[
    {
        "author": "phan1129",
        "created_utc": 1624887140,
        "id": "o9kc6b",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Reviewing the Bear Case on Paysafe (PSFE)\n\nJP Morgan CEO, Jamie Dimon, recently noted that fintechs pose \"enormous competitive threats\" to banks and SF Federal Reserve board member, Jackie Reses, sees them “taking over and revolutionizing banking” with “a wholesale transition” of “a $16 trillion market cap”.\n\nIn this context, fintech Paysafe (PSFE) is newly listed on the NYSE and introduced to the US market. Already well known in Europe, Paysafe reports a substantial $362 million in free cash flow, projects $100 billion in transactional volume, $1.5 billion in revenue, healthy double-digit growth and expanding $30%+ EBITDA margins, but, despite absolutely no negative news, the stock has taken a pounding which, in turn, has brought the bears out in force with some dubious arguments. Sorry for the long post, but I thought I'd address all of these arguments in one post:\n\n&amp;#x200B;\n\nCommon bear arguments:\n\n\\#1 Old business\n\n\\#2 Complex regulatory landscape / no moat\n\n\\#3 Growth by acquisition is risky and difficult\n\n\\#4 No growth\n\n\\#5 Slow growth\n\n\\#6 Not profitable\n\n\\#7 Too I much debt / they are going to dilute by borrowing more.\n\n\\#8 Blackstone made 3X and will sell\n\n\\#9 Founder share and warrant dilution.\n\n&amp;#x200B;\n\n\\#1) Old business. \n\nPaysafe’s extensive experience in risk management and its time-tested regulatory expertise over many regions globally is one of its greatest strengths. This is the reason that Paysafe is the #1 global leader in iGaming payment processing, a rapidly moving space that is anticipated to grow 10X. “At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”\n\nMuch of Paysafe’s business is in back-end payment processing so most don’t even know they are using it, but Paysafe is considered to be at the forefront in its field: Winner “Best Omni-Channel Payment Solution”, “Payment Processor of the Year,” and “Best Payment Method” and they are rapidly expanding in the US with new partnerships (just last 3 months: Coinbase, Microsoft, Luckbox, Amelco, Pointsbet, Virginia Lotto)\n\nIn Europe, where Paysafe is more known and used, Trustpilot (1) rates Paysafe as “Excellent” (4.7/5 stars) with over 25,000 reviews, and Skrill as “great” (4.2/5 stars) with over 17,000 reviews, while PayPal is rated \"bad\" (1.2/5 stars) with over 17,000 reviews.\n\nPaysafe has the No. 2 global digital wallet with presence in 120 countries. They’ve just integrated their digital wallet platforms, Neteller and Skrill, recently voted “Best Digital Wallet” for “best consumer take up”, “most innovative technology” with “greatest potential to disrupt current ecosystems.”\n\nAside from Coinbase, Luckbox and Microsoft, they are partnered with Roblox, Draftkings, Spotify, Fortnight, Amazon, Twitch, bet365, ApplePay, Youtube, Visa, Betfair, PayLease, ESL Gaming, BetMGM, among many others. They are currently moving quickly to integrate their services to offer easier migration of eCash, integration of payment methods, cross-border payments and expansion into global banking as a service. \n\nIn preparation for their plans, Paysafe's newly announced Board of Directors includes a former Morgan Stanley CEO, a former Chairman of the American Gaming Association and CEO of MGM Resorts International, a legal and regulatory expert in the multi-jurisdictional online and retail gambling industries, two senior Managing Directors from Blackstone, two from CVC, the CEO of Dun &amp; Bradstreet and CEO of Black Knight, and the Chairman of the Board of Fidelity.\n\nAs Chairman Bill Foley says, \"It’s going to be a land grab…I have a vision that we should be THE digital wallet… It’s our job to be there first and to make sure we dominate.\" This doesn't sound like an old company resting on its laurels. \n\n&amp;#x200B;\n\n\\#2) Complex regulatory landscape / no moat. \n\nBill Foley, Chairman of Fidelity and now also Paysafe’s Chairman of the Board, calls Paysafe,“a fortress. It’s got a moat… We have a proven strategy of winning as new global markets open. And most importantly, we have unrivaled regulatory risk and technical expertise.\" Their regulatory acumen is the reason they currently dominate globally in sports betting/iGaming and are integrating their global platforms to expand into banking as a service. There are 1.7 billion \"unbanked\" because so many in the world who have mobile devices, still don't have access to the essential ID metrics that most banks and credit cards require to open accounts. Paysafe's risk management and cross boarder regulatory expertise offers a durable advantage in spaces where competing fintechs are hesitant to go. Leaning into this strength, they've brought on PayPal's former CRO and added a multi-jurisdictional regulatory expert to their Board of Directors\n\nFrom SEC filed transcript (2) - Paysafe CEO, Philip McHugh: “To be a true global player in the iGaming space, the level of payments regulation, of gaming regulation and certification is very, very complex. When we talk about a deep and a wide moat, this is absolutely one of the areas that we see that benefit where it’s hard to copy.…We have over 300 professionals dedicated to risk, compliance, and analytics. That is very, very rare in the payments space. It’s a real strength of ours. We’ve been able to track some of the top people in the industry, including the former CRO from PayPal, and we’ve upgraded the team, we’ve built some real data capabilities, and we see this continuing to be an area of differentiation for Paysafe versus others.”\n\n“To be a winner in this space, you’re catering to some incredibly demanding clients. They want to be global, they want multiple APMs, but they want you to understand payment regulation in hundreds of countries in gaming and gambling regulation in hundreds of countries. That’s something that Paysafe has developed very, very successfully in every market we’ve entered.”\n\n&amp;#x200B;\n\n\\#3) Growth by acquisition is hard. \n\nSynergistic inorganic growth through M&amp;A is a key pillar of Paysafe’s forward growth strategy. Bill Foley's proven track record in quickly generating this kind of growth speaks for itself. Over the last five years Foley has grown Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B). He also grew FIS from $2.5 billion to over $91 billion (36.4X). Foley says, “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.” (2, 4)\n\n&amp;#x200B;\n\n\\#4) No growth. \n\nIt’s true that Paysafe’s revenue stagnated in 2020 resulting from business closures during Covid, but prior to that they reported a strong 27% CAGR (4,5), which is on par with high profile competitors:\n\n2017: $864 million rev\n\n2018 : $1.14 billion rev (+32%)\n\n2019 : $1.418 billion rev (+24%).\n\n2020 : $1.426 billion. (+0.5%)\n\nUnlike many fintechs, Paysafe has heavy exposure in brick-and-mortar retail and live sporting events, both of which were absolutely crushed in 2020 due to Covid. During this market dislocation, they pivoted, “exited low value referral channels” and made up revenue by expanding in the digital wallets and e-commmerce spaces, positioning themselves better going forward.\n\nLooking at other brick-and-mortar payment processors hard-hit during the same period, like Visa and Mastercard, Paysafe performed very well by comparison:\n\n—Visa: negative y-o-y revenue growth (-8.7%) and negative EBITDA growth (-10.2%)\n\n— Mastercard: negative y-o-y revenue growth (-9.4%) and negative EBITDA growth (-14.20%)\n\nNot claiming that Paysafe should be valued according to these two traditional payment processors but, given their commensurate slow down during Covid, it is interesting to note that their their averaged EV/Revenue multiples would put Paysafe at $46, which is very much in line with the valuation comps cited below.\n\n&amp;#x200B;\n\n\\#5) Slow growth. \n\nGoing forward, Paysafe conservatively projects $10-13% annual growth over the next two years but they are careful so say that those growth projections exclude M&amp;A plans and expansion in iGaming which is expected to grow at 55% CAGR over the next several years. iGaming accounts for over a third of Paysafe’s revenue so this growth is a significant exclusion.\n\nAnalyst Michael Del Grosso, who recently initiated coverage with a $19 price target (6) said, “we believe there is upside to our forecasts in the event of state-level legalization of iGaming.”\n\nIn the short time since he wrote that, here are some of the headlines signaling a price target upgrade:\n\n1 \"New York State Legalizes Online Sports Wagering\"\n\n2 \"Maryland Online Sports Betting Bill Passes Legislature\"\n\n3 New Hampshire: \"Sports betting deal approved overwhelmingly; Hogan likely to sign\"\n\n4 \"Arizona governor signs bill legalizing sports betting\"\n\n5 \"Wyoming Legalizes Sports Betting\"\n\n6 ”Delaware igaming revenue up 74.3% year-on-year in March\"\n\n7 \"Pennsylvania gambling revenue rockets 162.7% in March - The biggest increase was recorded for sports wagering, where revenue rocketed by 326.1%\"\n\n8 “Caesars Entertainment (Paysafe partner) announced Official Sports Betting Partner of NFL\"\n\n9 “Michigan’s online sports betting launch hailed a success, Ohio could follow this year”\n\n10 “Ohio legislators doubling down on legalized sports gambling”\n\n11 “Louisiana Begins The Process of Legalized Sports Betting”\n\n12 “Path to legalized Texas sports betting becomes more clear”\n\n13 “NC lawmakers make push to legalize sports gambling to generate funding for schools”\n\n14 \"Single-sports betting in Canada wins House vote, nears legalization\"\n\n15 “Florida poised to offer sports betting under major gambling deal”\n\n16 “Legal Sports Betting Could Get To California Sooner Than You Think“\n\n&amp;#x200B;\n\nLooking at a larger basket of comps with a collective growth rate of \\~12.5% (not far from Paysafe’s minimum 10.6% projection) here are valuations based on PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, bill, GPN, and Paysign among others:\n\n&amp;#x200B;\n\nPaysafe’s share price with average of sector peer multiples:\n\nEV/EBITDA ratio : $122.09\n\nEV/Rev ratio : $83.91\n\nEV/FCF ratio : $87.86\n\nAverage: $97.95\n\n&amp;#x200B;\n\nAfter eliminating outliers with highest multiples:\n\nEV/EBITDA ratio :$50.75\n\nEV/Rev ratio : $44.64\n\nEV/FCF ratio : $44.18\n\nAverage :$46.52\n\n&amp;#x200B;\n\nNotes:\n\n1 Unlike Paysafe, around half of these competitors report negative EBITDA growth and a third report negative EBITDA and negative free cash flow.\n\n2 Used low end of Paysafe's projections and factored in debt and high-end of potential dilution.\n\n3 As noted Paysafe’s 10.6% rev growth projection excludes planned inorganic M&amp;A growth and projected 55% CAGR iGaming growth, which constitutes a third of their revenue.\n\n4 The above comps were taken during a sector-wide pull-back and do not reflect recent fintech gains since Jamie Dimon’s \"enormous competitive threats\" comment.\n\nIn a nutshell, the basket of sector peers projects roughly 20% more growth than Paysafe yet trades at 350-750% higher multiples. With Paysafe having better financials than most, it is hard to argue that this is proportionate.\n\n&amp;#x200B;\n\n\\#6) Not profitable. \n\nPaysafe expects $900 million in gross profit with healthy 30-32% EBITDA margin. As one recent article pointed out, “Paysafe has shown some intriguing projections in terms of its profitability. The company’s projected gross margin is 63%, an impressive number compared to competitors like Square with a gross margin under 30%.”\nThese fintech competitors are trading at much higher multiples but have worse EPS than Paysafe:\n\nRepay: -0.67,\n\nAffirm : -2.18,\n\nNuvei : -1.08,\n\nPaysign : -0.19.\n\nBill : -0.62,\n\nShift4 : -0.43\n\nAverage EV/EBITDA multiples of the above companies would put Paysafe's SP at $69\nIf you read their transcripts and presentations, you’ll see that profit is being utilized to grow the business and integrate their global platforms into what they call Paysafe Unity. They’ve recently completed the integration of Skrill and Neteller digital wallets into a single code. Foley has indicated further elimination of redundancies to create new efficiencies and increase margins to enhance M&amp;A activities. From what I can tell, Foley is all about the long game.\n\n&amp;#x200B;\n\n\\#7) Too I much debt / they are going to dilute by borrowing more.   \nPaysafe just paid down $1.1 billion in debt. Why would they turn around and borrow again? As Fidelity’s Chairman of the Board, Bill Foley says: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6x Debt/EBITDA.”\n\nTheir 3.6X Debt/EBITDA ratio is better than most fintech peers. Investopedia: “Debt/EBITDA measures a company's ability to pay off its incurred debt. A high ratio result could indicate a company has a too-heavy debt load.” \n\nOf the 11 fintech competitors I looked at, all but three (PYPL, ADYEY, NUVCF), have worse Debt/EBITDA ratios than Paysafe and many have negative EBITDA, making debt service that much more difficult:\n\nSquare: 77.8X\n\nRepay : 8.7X\n\nFiserv : $21.2B / $4.7B : 4.5X\n\nGPN : $10.27B / $2.8B : 3.67X\n\nShift4 : $1.8B / -$8M : negative EBITDA\n\nAffirm : $1.67B / -77.6M negative EBITDA\n\nPaysign : $4.3M / -$5.79M : negative EBITDA\n\nBill : $947M / -43.85M : negative EBITDA\n\nDepending on whether you include SQ and AFRM, the combined multiples of the above competitors (by EV/EBITDA, EV/free cash flow or EV/revenue) puts Paysafe’s share price in the $45 to $90 range. Point being, their debt position is better than most and hardly a red flag. Further, management has said they’ll be able to fund M&amp;A plans with expanding 32-35%+ EBITDA margins ($500 - 560 million, 21% CAGR) and $362 million in free cash flow.\n\n&amp;#x200B;\n\n\\#8) Blackstone made 3X and will sell. \n\nThe common myth is that Blackstone/CVC made 300% by paying $3 billion to take Paysafe private and receiving $9 billion in the recent deal to bring it public. The reality, as reported by the Wall Street Journal (8), is that Blackstone/CVC took Paysafe private in 2017 for $3.9 Billion and they received about $5.6 billion in cash and shares on the recent deal. Adjusted for inflation, they paid $4.2 billion so it’s more like a 33% return on a 4 year hold.\n\nImportantly, this came AFTER they grew revenue 65% ($864B to $1.426B), stewarded a billion in investments to grow the business, and the deal included paying down over $1.1 billion in debt. This suggests Foley cut a great deal for shareholders. It also explains why private equity has signaled that they'll stay on long term to reap much bigger gains through Foley’s time-tested M&amp;A playbook.\n\nBlackstone itself says (9), “The term of private equity funds can be upwards of 7-10 years.” With so much runway and comps pointing to a 3-4X valuation, why would Blackstone leave so much money on the table?\n\nBlackstone Senior Managing Director Eli Nagler signals an ongoing interest in staying on: “We believe Paysafe has a long runway for further growth and look forward to remaining part of the team and seeing their continued success as a public company.”\n\nIn a recent interview Foley said, private equity’s plan to stay on was part of what encouraged PIPE to invest $2 billion: “They rolled a significant amount of their investment which is a confidence builder. They didn’t take all their money off the table…All of these things put together really created the confidence among the investor base to invest in the PIPE and then support the stock.”\n\nThis trust was reiterated in the SEC filed FTAC’s Board of Directors’ Reasons for the Approval of the Business Combination: “Commitment of Paysafe’s Owners. The FTAC Board believes that the CVC Investors, the Blackstone Investors and other current indirect stockholders of PGHL continuing to own a substantial percentage of the post-combination company on a pro forma basis reflects such stockholders’ belief in and commitment to the continued growth prospects of Paysafe going forward.”\n\nThe PIPE investors are even less of a concern because they are title and life insurance companies known for long-term investment strategies, they are closely aligned with Foley and understand both his M&amp;A track record and his ability to create mutually beneficial synergistic deals through what Bloomberg called the “The Foley Network” (perhaps, for example, Paysafe will handle Fidelity’s massive transactional volume). \nIn a recent Bloomberg interview, Bill Foley said, “The thing that was different about our transaction is that we brought capital to the table. The companies that I’m affiliated with actually invested roughly a billion dollars in the PIPE and forward purchase agreements so Paysafe was always a really protected asset besides the fact that it’s a great asset.”\n\nBesides, just as large funds will often drive price down to accumulate large positions, they also can drive price up to sell into strength and will do so via off-market trades to avoid price slippage. Therefore, we probably wouldn’t even notice profit taking until after quarterly filings. Paysafe’s fundamental value in context indicates such prospects present very little long term risk, especially from current price levels. Given Paysafe's $100B market share (similar to Square’s), once audited numbers are available, many large funds focused on this space will necessarily seek a more balanced exposure through Paysafe.\n\n&amp;#x200B;\n\n\\#9) Founder share and warrant dilution. \n\nAccording to the 20F recently filed, roughly 53 million warrants pose potential dilution at a maximum of 7.5% (movement we've seen in a day), but the cashless conversion option, generally exchanging 3 warrants for a single share, can reduce that dilution by 2/3 to around 2.5%. It is very likely that many will use this option since most warrant holders do not have the extra cash to pay an additional $11.50 for each warrant conversion. It will probably be somewhere in the middle of the two scenarios (\\~5%) but this is not a major concern in the scheme of things.\n\nImportantly, the 20F also shows that all founder shares are already included in the current outstanding share count so there is no risk of dilution there.\n\nTotal FTAC Founder shares 175,292,458 24.2 % \n\nBlackstone Investors 123,734,571 17.1 % \n\nCVC Investors 156,006,433 21.6 % \n\nOther Pre-Business Combination Paysafe Shareholders 53,701,074 7.4 % \n\nCannae (excluding amounts included in Founder) 50,000,000 6.9 % \n\nPIPE Investors (excluding Cannae) 165,000,000 22.8 % \n\n723,734,536 100.0 % \n\n\n&amp;#x200B;\n\nDespite a lack of negative news, short sellers and bashers have been able to exploit a perfect storm of doubt created by seemingly unrelated events ranging from forced selling pressure coming from widely reported changes in margin requirements (25% to 100% upon ticker change without any prior notice), to simultaneous limits on buying resulting from excessive delays (7+ trading days) in the new PSFE ticker being available on many platforms, to things in the media that this sub will not allow to be discussed.  In this context, it is hard not to see a month's worth of “fake sell walls” and HFS “short ladder attacks” as anything other than opportunistic price manipulation but, speculation can only get you so far. \n\nI think Paysafe is currently undervalued and, as the developments in legalized sports betting come to fruition, it is very likely a 3X from here. M&amp;A plans already in the works will bring additional catalysts. Given Paysafe's healthy fundamentals, large market share in a fintech space known for “sticky” customers, and exposure to high growth verticals like iGaming, it seems inevitable that large funds will seek to benefit from these low prices, especially once the first audited quarterly numbers are available on May 11th.\n\n&amp;#x200B;\n\nNote: Per their analyst presentation, here is Paysafe’s minimum Q1 guidance to meet or beat:\n\n$360 million revenue\n\n$220 million gross profit\n\n$105 million EBITDA\n\n&amp;#x200B;\n\nDisclosure: I hold $600K in commons and warrants\n\nDisclaimer: I am not a financial advisor. All users should complete their own due diligence.\n\n&amp;#x200B;\n\nSources:\n\n(1) Trustpilot [https://uk.trustpilot.com/review/www.paysafecard.com](https://uk.trustpilot.com/review/www.paysafecard.com)\n\n(2) Transcript: [https://www.sec.gov/Archives/edgar/data/0001818355/000119312520311318/d91054d425.htm](https://www.sec.gov/Archives/edgar/data/0001818355/000119312520311318/d91054d425.htm)\n\n(3) 20F [https://www.sec.gov/Archives/edgar/data/1833835/000119312521104105/d159702d20f.htm#toc](https://www.sec.gov/Archives/edgar/data/1833835/000119312521104105/d159702d20f.htm#toc)\n\n(4) Investor Presentation: [https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm](https://www.sec.gov/Archives/edgar/data/1818355/000119312520311998/d54063d425.htm)\n\n(5) Analyst Presentation: [https://www.paysafe.com/fileadmin/content/pdf/Analyst\\_Day\\_presentation\\_March\\_9\\_\\_2021.pdf](https://www.paysafe.com/fileadmin/content/pdf/Analyst_Day_presentation_March_9__2021.pdf)\n\n(6) Analyst $19 [https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html](https://www.streetinsider.com/Analyst+Comments/UPDATE%3A+Compass+Point+Starts+Paysafe+Group+Ltd.+%28PFSE%29+at+Buy%3B+All-In+on+an+iGaming+Opportunity/18197588.html)\n\n(7) S1: [https://sec.report/Document/0001104659-20-089252/](https://sec.report/Document/0001104659-20-089252/)\n\n(8) WSJ: [https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827](https://www.wsj.com/articles/blackstone-cvc-to-buy-paysafe-for-3-9-billion-in-latest-online-payments-deal-1501830827)\n\n(9) Blackstone: [https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the\\_life\\_cycle\\_of\\_private\\_equity\\_insights.pdf](https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf)\n\n(10) Q1 earnings call: [https://ir.paysafe.com/news-events/events/detail/9758/first-quarter-2021-earnings-call](https://ir.paysafe.com/news-events/events/detail/9758/first-quarter-2021-earnings-call)",
        "subreddit": "wallstreetbets",
        "title": "Honest reasons why I’m actually investing in $PSFE and why I think it won’t crash 🚀🌚 it has potential to 5x or maybe more long term or SHORT TERM teehee",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o9kc6b/honest_reasons_why_im_actually_investing_in_psfe/",
        "created": 1624915940.0
    },
    {
        "author": "teebob21",
        "created_utc": 1624769733,
        "id": "o8qf2m",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "#Black Swan Sign #1: [The ratio of T-Bill competitive bids to available offerings is 3.24.](https://www.treasurydirect.gov/instit/annceresult/press/preanre/2021/R_20210624_1.pdf) \n\n$130B of investor and institutional money was bid on an available $40B of T-Bills in the most recent auction. The median annualized rate for these T-Bills was 0.04%. The annual inflation rate for the United States is 5.0% for the 12 months ended May 2021 after rising 4.2% previously, according to U.S. Labor Department data published June 10.\n\nIn other words, there is so much cash floating around from the JPoww printing press that institutional investors are willing to **lock in their losses** at an annualized rate of 5%, because there are no other more appealing investments for idle cash at this time. For every available debt dollar the US will sell, there's about three-fiddy chasing that 5% loss.\n\n#Black Swan Sign #2: Caribbean real estate markets are seeing exponential growth not seen since 2006-2007.\n\n\"We are optimistic that 2021 will be another great year. We have become trusted advisors to our International clients who appreciate the quality of people, place and lifestyle the Cayman Islands offers and this is prompting them to buy luxury vacation properties here and to earn permanent residency through investing in real estate.\"\n\n- [Sue Nickason, Cayman Islands.](https://www.hauteresidence.com/caribbean-real-estate-expectations-2021/)\n\nIn other words, the wealthy are looking to purchase residency and eventual citizenship via massive capital investments in known tax havens, in numbers not seen since before the US Subprime Crisis began. And let's not even talk about the bubbles happening on the Case-Schiller real estate and stock market PE charts. *Woof.*\n\n#Black Swan Sign #3: [International ex-US stock funds continue to have record high inflows.](https://www.reuters.com/business/global-markets-flows-graphics-2021-05-14/) \n\nMeanwhile, [SPY and other US-centric ETFs are experiencing heavy outflows at the same time.](https://www.nasdaq.com/articles/spy-iez%3A-big-etf-outflows-2021-04-30) In the last week of April alone, SPY destroyed over 1.5% of all available ETF units. \n\n#Black Swan Sign #4: [The US dollar is no longer the most common currency used in aggregate global payments. The Euro has became the #1 currency for settlement.](https://finance.yahoo.com/news/pound-falters-global-payments-while-010000028.html)\n\nSo, let's say I've mis-read the tea leaves. By all means, please refute these conclusions with other sources. \n\nBut if I'm right, it's now a game of musical chairs. Where will you be when the music stops? I'm a perma-bull but all signs point to RED. I'm rolling positions down and in for a credit where I can but reducing my DTE and stocking up on dry powder.",
        "subreddit": "options",
        "title": "This PermaBull plays Devil's Advocate: The Case for a Black Swan",
        "url": "https://www.reddit.com/r/options/comments/o8qf2m/this_permabull_plays_devils_advocate_the_case_for/",
        "created": 1624798533.0
    },
    {
        "author": "SageMaverick",
        "created_utc": 1622842215,
        "id": "nsg1q0",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I'd like to hear opinions on the future of Paysafe and whether now is the time to get in. Paysafe is a leading specialized payments platform, yesterday 3 June announced its expanded partnership with Golden Nugget Online Gaming.\n\nGNOG’s online casino for the regulated Michigan market has now plugged into Paysafe, also connecting the brand to the Guaranteed ACH technology of Global Payments Gaming Solutions, a division of Global Payments. Additionally, early this week, Susquehanna Initiated Coverage On Paysafe with Positive Rating, Announcing a Price Target of $17.\n\nIt is still sitting at a fairly good entry price of $12, and I also know there are many bag holders from the runup to $19 pre-IPO.\n\n[https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-and-golden-nugget-expand-partnership-into-michigan-igaming-market/](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-and-golden-nugget-expand-partnership-into-michigan-igaming-market/)",
        "subreddit": "wallstreetbets",
        "title": "PaySafe $PSFE primed for a runup to $17?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nsg1q0/paysafe_psfe_primed_for_a_runup_to_17/",
        "created": 1622871015.0
    },
    {
        "author": "SageMaverick",
        "created_utc": 1622842100,
        "id": "nsg06u",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I'd like to hear opinions on the future of Paysafe and whether now is the time to get in.  Paysafe is a leading specialized payments platform, yesterday 3 June announced its expanded partnership with Golden Nugget Online Gaming. \n\nGNOG’s online casino for the regulated Michigan market has now plugged into Paysafe, also connecting the brand to the Guaranteed ACH technology of Global Payments Gaming Solutions, a division of Global Payments. Additionally,  early this week, Susquehanna Initiated Coverage On Paysafe with Positive Rating, Announcing a Price Target of $17.  \n\nIt is still sitting at a fairly good entry price of $12, and I also know there are many bag holders from the runup to $19 pre-IPO.\n\n[https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-and-golden-nugget-expand-partnership-into-michigan-igaming-market/](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-and-golden-nugget-expand-partnership-into-michigan-igaming-market/)  \n\n\n[https://www.benzinga.com/news/21/06/21364228/susquehanna-initiates-coverage-on-paysafe-with-positive-rating-announces-price-target-of-17](https://www.benzinga.com/news/21/06/21364228/susquehanna-initiates-coverage-on-paysafe-with-positive-rating-announces-price-target-of-17)",
        "subreddit": "wallstreetbets",
        "title": "PaySafe $PSFE primed for a runup to $17?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nsg06u/paysafe_psfe_primed_for_a_runup_to_17/",
        "created": 1622870900.0
    },
    {
        "author": "papageorgio120",
        "created_utc": 1623626424,
        "id": "nz8tf5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I've been sharing a weekly market outlook with some friends and followers the past few months. Decided to start sharing with reddit. Let me know if you have any thoughts, questions, or suggestions.\n\nFrom the perspective of short to intermediate term swing and position trades:\n\n[https://docs.google.com/spreadsheets/d/1iLMZbkMOiNU5UvrLLVk\\_8hCjp5OY1Xy6c9Dn7vjMaTw/edit#gid=1599809613](https://docs.google.com/spreadsheets/d/1iLMZbkMOiNU5UvrLLVk_8hCjp5OY1Xy6c9Dn7vjMaTw/edit#gid=1599809613)\n\nHere are some of the tickers we look at: BLDR, CHGG, DLTR, GO, GPN, GRPN, HBI, KMX, RLMD, SONO\n\nDM me to connect on discord/twitter as well",
        "subreddit": "stocks",
        "title": "6/14 Market Update/Outlook - with some swing trade ideas",
        "url": "https://www.reddit.com/r/stocks/comments/nz8tf5/614_market_updateoutlook_with_some_swing_trade/",
        "created": 1623655224.0
    },
    {
        "author": "ModernBuddha1",
        "created_utc": 1623363262,
        "id": "nx038v",
        "num_comments": 222,
        "num_crossposts": 0,
        "selftext": "Buy and hold! and accumulate much as you can while they keep the stock price low. \n\ni know many of us are armed with Robinhood and we're trigger happy with buy/sell but if you want to win you must learn to buy and hold. Yes, Blackberry is one of those stock. In my view it's massively undervalued Cyber Security and IoT company. Their Blackberry Spark platform is taking over everything and overtaking Crowdstrike business too. How i make this assessment? Simple, if Crowdstrike was a good technology compnay the entire US federal government would be using it....BUT there're NOT! they are going to Blackberry.  **Blackberry has integrated artificial intelligence into all their products now.** \n\nEven IBM has decided to ditch their own cyber security software and switched to selling Blackberry Spark suite in Canada. When one of your biggest competitor ditches their own product and starts selling your product, that's a sign that you have an amazing crazy magic like product. \n\n[here's the proof](https://www.blackberry.com/us/en/company/newsroom/press-releases/2021/blackberry-and-ibm-canada-establish-a-new-partnership)\n\nCompared to industry the blackberry spark artificial intelligence machine is years in advance. **No other** ai based cyber security comes close to blackberry engine, this is why US government and 77% of fortune 100 companies have switched to blackberry. i will list their growing customers(big enterprises) in next part. **BB holds the biggest ai patent portfolio in cyber security!!**\n\nRevenue growth will explode in coming months and quarters. The ai based spark platform was launched last year and it took them few months to get their ducks and marketing in row! \n\nNext article i will dive deep into their latest product called Blackberry Persona! it's a god like ai that stops insider threats and stolen password(the pipeline hack could have been prevented if they had used blackberry). Password will be history and no longer will be required as we move into the future. \n\n**if we compare valuation to peers, the company should be around 70 Billion minimum or about $140 per share.** \n\nNot a financial advice. Part 3 coming......",
        "subreddit": "wallstreetbets",
        "title": "The Key to Blackberry",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nx038v/the_key_to_blackberry/",
        "created": 1623392062.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1623685357,
        "id": "nzppgh",
        "num_comments": 114,
        "num_crossposts": 0,
        "selftext": "\\[DD\\] Intel (INTC)\n\n**Estimated due diligence reading time: 8 minutes** \n\n&amp;#x200B;\n\nMarket Cap (MKT Cap) \n\n* 2014- 127B\n* 2016- 141B\n* 2018- 209B\n* 2020- 273B\n* Current- 233B\n\n\\*MKT Cap has increased by 83% since 2014\n\nEPS (Dilution)\n\n* 2016- $2.34\n* 2017- $2.31\n* 2018- $2.31\n* 2019- $4.42\n* 2020- $5.15\n* Current- $4.45\n\n\\*EPS has increased by 90% since 2016\n\nReturn on Equity (ROE)\n\n* 2016- 15.58\n* 2017- 13.91\n* 2018- 28.24\n* 2019- 27.16\n* 2020- 25.79\n\n\\*ROE has increased by 66% since 2016\n\nReturn on Assets (ROA)\n\n* 2016- 9.10\n* 2017- 7.79\n* 2018- 16.45\n* 2019- 15.42\n* 2020- 13.65\n\n\\*ROA has increased by 50% since 2016\n\nReturn on Investment (ROI)\n\n* 2016- 11.87\n* 2017- 10.21\n* 2018- 21.12\n* 2019- 20.47\n* 2020- 18.18\n\n\\*ROI has increased by 53% since 2016\n\n&amp;#x200B;\n\n**Financial Statement Highlights (in thousands)**\n\nTotal Revenue (TR)\n\n* 2016- 56.3B\n* 2017- 60.5B\n* 2018- 64.0B\n* 2019- 70.8B\n* 2020- 75.7B\n* Current- 77.7B\n\n\\*TR has increased by 38% since 2016\n\nEBITDA Margin\n\n* 2016- 35.23\n* 2017- 41.71\n* 2018- 45.73\n* 2019- 45.66\n* 2020- 46.13\n\n\\*EBITDA has increased by 31% since 2016\n\nGross Margin\n\n* 2016- 61.01\n* 2017- 62.30\n* 2018- 61.73\n* 2019- 58.56\n* 2020- 56.01\n\n\\*Gross Margin is down 8% since 2016\n\nPrice to Sales Ratio (PS)\n\n* 2016- 2.45\n* 2017- 2.61\n* 2018- 3.62\n* 2019- 3.35\n* 2020- 3.07\n* Current- 3.13\n\n\\*PS Ratio has increased by 28% since 2016\n\nPrice to Earnings Ratio (PE)\n\n* 2016- 12.05\n* 2017- 14.04\n* 2018- 20.83\n* 2019- 11.50\n* 2020- 10.18\n* Current- 13.00\n\n\\*PE Ratio has increased by 8% since 2016\n\nPrice to Book Ratio (PB)\n\n* 2016- 2.17\n* 2017- 2.28\n* 2018- 3.20\n* 2019- 3.09\n* 2020- 2.91\n* Current- 2.93\n\n\\*PB Ratio has increased by 35% since 2016\n\n&amp;#x200B;\n\n**Balance Sheet Highlights (in thousands)**\n\nTotal Liabilities\n\n* 2016- 44.3B\n* 2017- 48.8B\n* 2018- 58.4B\n* 2019- 55.8B\n* 2020- 71.4B\n* Current- 70.8B\n\n\\*Total Liabilities has increased by 60% since 2016\n\nLong Term Debt\n\n* 2016- 0.24\n* 2017- 0.27\n* 2018- 0.25\n* 2019- 0.25\n* 2020- 0.29\n\n\\*Long Term Debt has been pretty consistent in the past 5 years\n\nDebt to Equity Ratio (DE)\n\n* 2016- 0.38\n* 2017- 0.39\n* 2018- 0.35\n* 2019- 0.37\n* 2020- 0.45\n\n\\*DE Ratio has increased by 22% since 2019\n\n&amp;#x200B;\n\n**Competitors**\n\n* Advanced Micro Devices (AMD)\n* International Business Machines (IBM)\n* NVIDIA\n* Samsung\n\n&amp;#x200B;\n\n**Management**\n\n\tCEO Patrick Gelsinger has been a huge contributor to Intel's success. He was ranked the best CEO of America in 2019. He played a key role in USB, Wi-Fi, Intel Core, and Intel Xeon. Intel Core and Intel Xeon are some of the best modern-day processors on the market. \n\n&amp;#x200B;\n\n**Stock Price History**\n\n2016- $31.76\n\n2017- $36.52\n\n2018- $44.74\n\n2019- $47.22\n\n2020- $60.10\n\nCurrent- $57.85\n\n\\*Stock Price has increased by 82% since 2016\n\n&amp;#x200B;\n\n**Recent News (June 05, 2021)**\n\nIntel has partnered with a Biotech company called Enzolytics, Inc. Read about \"Optimizing Empathetic AI to Cure Deadly Diseases \\[here\\]([https://www.intel.com/content/www/us/en/healthcare-it/resources/enzolytics-whitepaper.html](https://www.intel.com/content/www/us/en/healthcare-it/resources/enzolytics-whitepaper.html))\n\n*TLDR*\n\nIntel is creating the AI for \"P4 Medecine\"\n\n* P4 Medicine aims to be predictive; A.I. is programmed to be prognostic\n* P4 Medicine seeks to preventative measures; A.I. is designed to be anticipatory\n* P4 Medicine embraces personalized care; A.I learns by being adaptive\n* P4 Medicine encourages physician/patient participation; A.I thrives on inclusive and participatory acts\n\nMajor components helped developed by Intel include:\n\n* Cervical Cancer Screening\n* Radiology Improvement\n* Precision Medicine\n* Tumor Detection\n* Genomics Research\n* Skin Cancer Detection\n\n&amp;#x200B;\n\n**Conclusion**\n\n\tIntel is among the stocks that are benefitting from the semiconductor shortage. CEO Pat Gelsinger expects the shortage to take a few years to recover. One problem the semiconductor industry faces is that the majority of chips are produced in Asia. Although recently, there has been a strong demand to increase chip production in the USA. Joe Biden's infrastructure plan includes $50B worth of subsidies for the semiconductor industry to help boost fabrication. However, it will take time to build the infrastructure. \n\n&amp;#x200B;\n\n*\\*\\*This is not investment advice\\*\\**\n\n*\\*\\*Do your own research\\*\\**",
        "subreddit": "investing",
        "title": "Due Diligence on Intel (INTC)",
        "url": "https://www.reddit.com/r/investing/comments/nzppgh/due_diligence_on_intel_intc/",
        "created": 1623714157.0
    },
    {
        "author": "pmchem",
        "created_utc": 1622545453,
        "id": "nprdln",
        "num_comments": 82,
        "num_crossposts": 0,
        "selftext": "As a sequel to \"10 interesting and useful ETFs with less than $1b AUM\", I'm back with 10 more ETFs that have less than $1b AUM but that I think are interesting and possibly useful and some comments on each.  Too often only the biggest ETFs, or most popular, get people's attention. I think it's worth looking further to see what's out there.\n\nStarting with a Peter Lynch inspired strategy (Lynch popularized the price/earnings-to-growth ratio),\n\n1. SPGP: Invesco S&amp;P 500 GARP ETF, [https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Investor&amp;ticker=SPGP](https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Investor&amp;ticker=SPGP) . \"Growth at a Reasonable Price\" (GARP).  This ETF is an interesting combination factor screener.  It only selects from S&amp;P 500 stocks, and screens them first for 3-year earnings and sales growth, and second for financial leverage (debt), return on equity, and earnings yield (trailing-twelve-month or \"TTM\" net income / market cap).  Holdings are weighted by growth score, not market cap.  GARP's historical performance is surprisingly good; it beat the S&amp;P 500 since January 2020 and beats both the S&amp;P and traditional CRSP growth/value factors YTD.  It also outperforms the S&amp;P on some longer timeframes.  Index rebalanced semiannually (3rd Friday June/Dec), and it costs a moderate 0.34% ER.  It's designed to hold 75 stocks.  Check SPGP out when it rebalances later in the month!\n\nMoving on to Factor ETFs,\n\n2.  FVAL: Fidelity Value Factor ETF, [https://screener.fidelity.com/ftgw/etf/snapshot/snapshot.jhtml?symbols=FVAL](https://screener.fidelity.com/ftgw/etf/snapshot/snapshot.jhtml?symbols=FVAL) .  This ETF tracks and index that calculates scores for: free cash flow yield, EBITDA to enterprise value, book value to price, and forward earnings to price. The first two factors result in it having some tech giants such as FB, GOOGL, AMZN, and AAPL in the index. But not some others, such as TSLA, which scores very poorly on... well, every factor. Banks are just scored on book to price and forward earnings to price, as their business model is not comparable to most other stocks. FVAL provides an interesting way to get exposure to possibly-not-overpriced intellectual property-heavy companies, as well as traditional value stocks.  Currently holds about 130 stocks.\n\n3.  FIVA: Fidelity International Value Factor ETF, [https://screener.fidelity.com/ftgw/etf/goto/snapshot/snapshot.jhtml?symbols=FIVA](https://screener.fidelity.com/ftgw/etf/goto/snapshot/snapshot.jhtml?symbols=FIVA) .  The international (mostly developed markets) counterpart to FVAL, this ETF fills a great niche since forward-looking international value ETFs are few and far between.  Most value ETFs are heavy on book value, and rely on backward looking metrics or ignore free cash flow.  FIVA (and FVAL) take a different approach.  Currently holds about 120 stocks.  FIVA is perhaps the single most overlooked ETF in this entire list -- it provides a unique type of international exposure, and at only 0.39% ER. International factor funds often have slightly higher ERs than total market funds, but may provide much greater total return given desirable macro-economic conditions.  For example, since the first vaccine was proven effective (which kicked off the value rally), FIVA has outperformed VEA by about 6 percent.\n\n4.  JVAL: JPMorgan U.S. Value Factor ETF, [https://am.jpmorgan.com/us/en/asset-management/adv/products/jpmorgan-us-value-factor-etf-46641q753](https://am.jpmorgan.com/us/en/asset-management/adv/products/jpmorgan-us-value-factor-etf-46641q753) .  JVAL's index is also a value screen. It scores via four metrics: earnings yield, book to price, free cash flow yield, and TTM dividend yield. Pretty well-rounded in that it includes earnings, book, and yield measures. It does not include forward earnings metrics. Due to the cash flow and earnings metrics, it ends up including some big tech companies like FB, GOOGL, and MSFT. While it includes a dividend metric, the JVAL ETF has a lower 30-day SEC yield than VTV or dividend-focused ETFs such as SCHD, so I would not consider it as a dividend fund.  Holds about 350 stocks.  \n\n5. FQAL: Fidelity Quality Factor ETF, [https://screener.fidelity.com/ftgw/etf/goto/snapshot/snapshot.jhtml?symbols=fqal](https://screener.fidelity.com/ftgw/etf/goto/snapshot/snapshot.jhtml?symbols=fqal) .  Quality ETFs depart from value ETFs in that they're less concerned about price/earnings metrics.   Fidelity's offering in the space weights stocks on free cash flow margin, return on invested capital (one of Charlie Munger's favorite metrics), and free cash flow stability.  For banks, it looks at return on equity and debt to assets.  This ends up having a lot of overlap with the S&amp;P 500, but it ends up filtering out companies like TSLA and as per its goal, only has about 130 companies overall.  Like FVAL, this costs 0.29% ER.  Fairly common for US factor funds.\n\n6. JQUA: JPMorgan U.S. Quality Factor ETF, [https://am.jpmorgan.com/us/en/asset-management/adv/products/jpmorgan-us-quality-factor-etf-46641q761](https://am.jpmorgan.com/us/en/asset-management/adv/products/jpmorgan-us-quality-factor-etf-46641q761) .  JPMorgan handles \"quality\" a bit differently.  They have 10, yes ten, different metrics that go into measuring quality.  They're grouped into categories for \"profitability\", \"solvency and financial risk\", and \"earnings quality\".  Loosely stated, they're looking for companies making reliable cold hard cash hand over fist that are not too indebted.  Like the Fidelity offering, it ends up looking a lot like the S&amp;P 500 but with slightly different weights.  GOOGL currently sits at the top of its holdings.\n\nLet us not forget commodities,\n\n7. COM: Direxion Auspice Broad Commodity Strategy ETF, [https://www.direxion.com/product/auspice-broad-commodity-strategy-etf](https://www.direxion.com/product/auspice-broad-commodity-strategy-etf) .  A fascinating ETF, it covers 12 different commodity futures in categories for metals, agriculture, and energy.  Different from most other commodity ETFs, it's almost like a commodity trend advisor (CTA) fund because it can take both long and \"flat\" (neutral/no) position in each commodity.  This helped COM wonderfully during the commodity crash in 2Q20 because they were able to go flat and preserve value, avoiding the oil crash.  If inflation comes back big time, commodities will benefit.  And if a commodity bubble bursts, this fund may be able to avoid some of the downside.  No K-1 form.  Might be my go-to outside of GUNR (equity ETF) for commodity exposure.\n\n8. CMDY: iShares Bloomberg Roll Select Commodity Strategy ETF, [https://www.ishares.com/us/products/292741/ishares-bloomberg-roll-select-commodity-strategy-etf-fund](https://www.ishares.com/us/products/292741/ishares-bloomberg-roll-select-commodity-strategy-etf-fund) .  A somewhat newer offering from Blackrock, this broad commodity fund systematically positions itself to best handle carry cost in the futures curve (and thus adjusts for contango / backwardation curves).  It has generally outperformed other popular long-only commodity funds, and avoid being overweight on oil/energy futures.\n\nSeeking dividends?\n\n9. SCHY: Schwab International Dividend Equity ETF, [https://www.schwabassetmanagement.com/products/schy](https://www.schwabassetmanagement.com/products/schy) . A new offering from Schwab, it's the international counterpart to SCHD.  Its index filters for companies that have made 10 consecutive years of dividend payments, and ranks them by cash flow to total debt, return on equity, dividend yield, and 5-year dividend growth rate.  After a volatility screen, the results are weighted by a capped market capitalization approach.  A wonderful mirror to SCHD for those seeking reliable income, but who also want to diversify outside of US markets.  I predict its AUM will go up by 10x in less than 2 years.  Also quite inexpensive at 0.14% ER -- Schwab is likely subsidizing this, in order to help it grow.\n\nFinally, like it or not, blockchain is here to stay,\n\n10. BLOK: Amplify Transformational Data Sharing ETF, [https://amplifyetfs.com/blok.html](https://amplifyetfs.com/blok.html) .  The AUM of this ETF is right around the $1b mark, but I'm including it anyway.  It seems to be the best-of-breed actively managed ETF for exposure to stocks benefiting from bitcoin mania and blockchain tech.  Clearly, it's volatile.  And it's not a pure bitcoin/ethereum play -- some small amounts of Samsung, IBM, and so on sneak in due to them having a connection to the space.  But it does hit all the big names, including recently listed Coinbase ($COIN).  If you can't be bothered to follow or deal with crypto in general but want something that will remain correlated to it, this is the ETF.  Pricey at 0.71% ER, but, it's actively managed and still has a lower ER than ARK's funds.\n\nDisclaimers: this is not financial advice. I currently have a position in FVAL, but no position in any of the other ETFs at time of posting.  That may change at any point in the future.  I am not predicting future performance for any of these funds.  Do your own due diligence (and please post in reply with what you find!).\n\nWhat do you guys think? Any of those look like something you might invest in? Anyone else want to comment on a personal favorite small/medium sized fund?",
        "subreddit": "investing",
        "title": "10 more interesting and useful ETFs with less than $1b AUM",
        "url": "https://www.reddit.com/r/investing/comments/nprdln/10_more_interesting_and_useful_etfs_with_less/",
        "created": 1622574253.0
    },
    {
        "author": "Florin123-",
        "created_utc": 1623288672,
        "id": "nwbqv5",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "Hey Ya! Remember the early 2000s? It was all about lace-up jeans, giant cargo shorts, Gilmore Girls, Lord of the Rings, the Atkins Diet ... and the BlackBerry.\n\nLong before the iPhone, the BlackBerry was the most beloved mobile gadget in the universe, known especially for its reliability, its security, and its full keyboard. But Research In Motion, the company that made it, didn't change quickly enough with the times, and the sweet fruit of its labors went sour. The company renamed itself BlackBerry (NYSE: BB) in early 2013 and set on a course of reinvention — first around smartphones, and then around software. Many people wrote it off.\n\nAnd that's where we see a major opportunity.\n\nBlackBerry has been quietly accelerating in its new mission securing all the connected devices that the modern world increasingly relies on. You've heard of the Internet of Things, chips embedded in all the stuff around us transmitting a wealth of data? Call the business angle \"the Enterprise of Things.\" BlackBerry's new focus still draws on its expertise in endpoint security, which shows us the fruit hasn't fallen so far from the tree. But this time around, it's securing things like self-driving vehicles, emergency health networks, financial reporting, and much more.\n\nIf your image of BlackBerry is stuck in the past, read on. This is a company with a future.\n\nSecond Bloom!\n\nIt's no surprise that most investors would pass BlackBerry by after a quick glance. Revenue has declined every year since 2011 — and even then, the company's share price was far below the peak of nearly $150 that it reached in mid-2008.\n\nBut this is, quite simply, an entirely different company than the BlackBerry most people remember, and its turnaround is just starting to take hold. Moreover, the company's progress is masked by the continuing decline of old legacy businesses that aren't part of management's vision or our investment thesis going forward.\n\nBlackBerry continued to sell its own handheld devices until mid-2016, and there are still BlackBerry-branded devices available, so current results continue to suffer from the decline of this business. Service access fees (SAF), related to legacy users of BlackBerry operating systems, are also dwindling. Given that these two businesses still represented roughly 50% of revenue in fiscal 2017, their continued decline has been keenly felt.\n\nBut the meat of the current business, Software and Services, has grown at an average annual pace of 15% over the past three years, reaching $782 million in fiscal 2018 (the company's fiscal year ends in February). This is now by far the largest part of BlackBerry, and we expect revenue for the company as a whole to stabilize this year and start rising thereafter.\n\nThe company's QNX operating system, in particular, has been driving growth. Traditionally used in vehicle infotainment systems, it has grown into the software backbone that can run all the chips in a vehicle, including safety and communications. BlackBerry has struck key deals with Qualcomm (NASDAQ: QCOM), Nvidia (NASDAQ: NVDA), Baidu (NASDAQ: BIDU), and others around this technology. Baidu, in turn, has made QNX the core of its Apollo platform, and has partnered with automakers like Ford (NYSE: F) and Hyundai to make this the core of future autonomous vehicles.\n\nThis certainly isn't the only area where BlackBerry's business is growing, but it's emblematic of the niche the company is carving out: securing endpoints in the Internet of Things, with a particular focus on enterprises. It has been a leader in Gartner's (NYSE: IT) Magic Quadrant for enterprise mobility management for the past two years, making it one of the Top Dogs in a sector that's expected to grow revenue at a 25% annual pace through 2021. \n\nStill Green!\n\nThat hasn't yet put BlackBerry in the black, but it's building the core of a very profitable business.\n\nSince being recapitalized by Fairfax Financial in 2013, BlackBerry has boasted a strong balance sheet, with $2.2 billion in cash and $810 million in convertible debt (which will likely convert to shares rather than being repaid). Gross margin improved from 49% in fiscal 2017 to an amazing 73% in fiscal 2018, indicating not only the company's shift from hardware to software, but also some considerable pricing power. Management also expects the company to deliver positive free cash flow this year (it did last year, too, albeit thanks to a large one-time adjustment).\n\nAdd it up and this is a $5.4 billion company currently generating around $800 million in very high-margin software revenue (leaving aside the remaining hardware and SAF businesses), with over 80% of that revenue recurring. With a gross margin that improved to 76% in the most recent quarter, we expect this business to ultimately produce profit margins in the 20% to 25% range, even as the top line continues to grow. That looks like an attractive price point.\n\nRisks and When We'd Sell!\n\nThere are a lot of reasons to look more deeply at BlackBerry's financials, but the surface picture remains unflattering. For the time being, this remains a company with shrinking revenue and marginal profitability. Changing that relies not just on continued growth of the software business, but scaling the business so that BlackBerry's relatively high sales, marketing, and R&amp;D costs come down as a percentage of revenue.\n\nThe company is a leader in a growing sector, but its competitors — companies like IBM (NYSE: IBM), VMware (NYSE: VMW), Cisco Systems (NASDAQ: CSCO), and others — have a lot of resources. That's why it's important that BlackBerry establish an especially strong presence in areas like vehicles, but we would like to see it keep getting wins in other areas, too.\n\nThe Foolish Bottom Line!\n\nNot every turnaround works, but BlackBerry has already become a leader in enterprise mobility management by leveraging its security DNA. This company has spent the last five years under CEO John Chen honing its new focus, and at this point he says the company is \"largely done reinventing itself\" and ready to focus on furthering its leadership. Chen should know — he's a turnaround expert who was previously brought into database company Sybase, returning it to profitability before it was sold to SAP (NYSE: SAP) in 2010.\n\nWhether or not BlackBerry remains on its own or is ultimately acquired, we expect it to continue expanding its capability and reach in keeping connected \"things\" safe and secure. The best part is that many investors can't see the green shoots growing from the rotten fruit of a decade past. That's a sweet opportunity.",
        "subreddit": "wallstreetbets",
        "title": "Buy $BB Recommendations by David Gardner (Stock Advisor - A Motley Fool Service) July 19, 2018!!! That's still a sweet opportunity.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nwbqv5/buy_bb_recommendations_by_david_gardner_stock/",
        "created": 1623317472.0
    },
    {
        "author": "Outof_ITM",
        "created_utc": 1623533281,
        "id": "nyh2vb",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "C3.ai(NYSE:AI)\n\nSector: Technology\n\nIndustry: Information Technology Services\n\nMarket cap: [6B](https://finance.yahoo.com/quote/AI?p=AI)\n\nC3.ai, Inc is an enterprise artificial intelligence company. The company provides software-as-a-service applications that enable customers to rapidly develop, deploy, and operate large-scale Enterprise AI applications across any infrastructure. It provides solutions under three divisions namely:\n\n* The C3 AI Suite: proprietary model-driven architecture, addresses the requirements for the digital transformation software stack, providing a low-code/no-code AI and Internet of Things, or IoT, platform that accelerates software development, reduces cost and risk, and delivers applications that are flexible enough to meet evolving needs.\n* C3 AI Applications: a large and growing family of industry-specific and application-specific turnkey AI solutions that can be immediately installed and deployed such as:\n   * Inventory Optimization: a solution to optimize raw material, in-process, and finished goods inventory levels\n   * Supply Network Risk: provides visibility into risks of disruption throughout the supply chain operations for enterprise supply chain managers\n   * Customer Churn Management: enables account executives and relationship managers to monitor customer satisfaction using transactional, behavioral, and contextual information, as well as to take action to prevent customer churn with AI-based and human-interpretable predictions and warning\n   * Production Schedule Optimization: a solution for scheduling production \n   * Predictive Maintenance: provides insight into asset risk to maintenance planners and equipment operators\n   * Fraud Detection solution\n   * Energy Management solution \n* C3.ai Ex Machina: analytics for applying data science to every-day business decisions\n\n**FINANCIALS**\n\n[ ](https://preview.redd.it/zudwz718ew471.png?width=624&amp;format=png&amp;auto=webp&amp;s=12d05673719c96e4bce13e8389d0f2c8a63f3006)\n\nC3 is growing rapidly with a total revenue of $156.7M in the fiscal year ended April 30, 2020 compared to $91.6M in the fiscal year ended April 30, 2019 representing a year-over-year growth of 71%. Over the same period, the subscription revenue grew to $135.4M from $77.5M representing a 75% increase.\n\nC3 has high total contract values for software subscriptions. The average total subscription contract values were:\n\n* 2016: $1.2M\n* 2017: $11.7M\n* 2018: $10.8M\n* 2019: $16.2M\n* 2020: $12.1M\n\n**BULL ARGUMENT**\n\nC3 has a first-mover advantage in Enterprise AI due to investment into their products and technology over the last decade. They have “Lighthouse Customers”, or large global early adopters, in Europe, Asia, and the United States across a range of industries that serve as proof points for other potential customers. Some customers include:\n\n[ ](https://preview.redd.it/6v6m5kedew471.png?width=624&amp;format=png&amp;auto=webp&amp;s=1e44125b37976abacc041856b3b4fda5e7608a95)\n\nThere is an extensive partner ecosystem that includes strategic relationships with established technology leaders like:\n\n* [Amazon Web Services](https://www.businesswire.com/news/home/20181010005314/en/C3-and-Amazon-Web-Services-Expand-Collaboration-to-Drive-Enterprise-Artificial-Intelligence-Adoption)\n* Fidelity National Information Services\n* [Google](https://www.businesswire.com/news/home/20180821005202/en/C3-IoT-and-Google-Cloud-Announce-Partnership)\n* [IBM](https://www.bloomberg.com/press-releases/2020-02-27/correcting-and-replacing-ibm-services-and-c3-ai-announce-strategic-alliance-for-digital-transformation-with-ai)\n* [Microsoft](https://www.cnbc.com/2020/12/09/microsoft-sees-gain-on-c3ai-investment-concurrent-with-ipo.html)\n\nAlthough the average total subscription value is decreasing and may continue to decrease, C3 has restructured the sales organization and expanded the market-partner ecosystem to address small, medium, and large sales opportunities. The progress is promising as the average total subscription contract value for six months ended October 31, 2020 was $7.7M.\n\nOn February 1, 2021, the [launch of the Open AI Energy Initiative](https://finance.yahoo.com/news/shell-c3-ai-baker-hughes-220000073.html) was announced by Shell, C3, Baker Hughes, and Microsoft. The initiative provides a framework for energy operators, service providers, equipment providers, and independent software vendors for energy services to offer interoperable solutions powered by the [BHC3 AI Suite](https://bakerhughesc3.ai/bhc3-ai-suite/model-driven-architecture/) and Microsoft Azure.\n\n**BEAR ARGUMENT**\n\nC3 faces intense competition and which could be an “early bird may get the worm, but the second mouse gets the cheese” type of situation as second movers could develop technology to improve upon any shortfalls. The main sources of potential competition include:\n\n* Greater name recognition, longer operating histories, and larger customer bases\n* Larger sales and marketing budgets and resources, and the capacity to leverage their sales efforts and marketing across a broader portfolio\n* Wider geographic presence\n* Lower labor and research and development costs\n* Larger and more mature intellectual property portfolios\n* Greater financial, technical, and other resources to provide support, make acquisitions, hire talent, and to develop and introduce new products\n\nThe Chief Executive Officer, Tom Siebel has received many [honors and awards](https://www.businesswire.com/news/home/20181112005818/en/EY-Honors-Thomas-M.-Siebel-as-2018-Entrepreneur-Of-The-Year%C2%AE), but if he, or other senior management team members, were to leave the company C3 may not be able to execute their business strategy. Siebel is critical to the overall management and continued development of the AI suite and AI Applications. All of the executive officers are at-will employees and they do not maintain any key person life insurance policies.\n\nC3 has a history of operating losses and may not achieve or sustain profitability in the future. The sales cycles can be long and unpredictable and the sales efforts require considerable time and expense. This is due to investing into sales to large organizations that typically undertake a significant evaluation and negotiation process due to their leverage, size, organization structure, and approval requirements. A limited number of customers have accounted for a substantial portion of C3’s revenue. The top three entities together accounted for 34% and 44% of the revenue for years ended April 30, 2019 and 2020, respectively. The same entities have been with C3 for an average of 3.3 years.\n\n**CONCLUSION**\n\nGiven the success of C3’s customers, I feel it will increase penetration of their existing customer base. They are primed to expand the major account sales organization to focus on large enterprise software agreements. Additionally, C3 will continue to develop high volume distribution channels to address the needs of small and medium businesses. I think they will continue to bring new product families to market that will develop into substantial recurring revenue streams. The total addressable market is rapidly growing and estimated to grow to $271B in 2024, a 12% CAGR from 2020's estimate of $174B.  This is a big opportunity for C3.  The lock up period [ended on June 7, 2021](https://www.nasdaq.com/market-activity/ipos/overview?dealId=907559-94759), and earnings happened on June 2, 2021. I believe everyone who wanted to sell has sold at this point. I am bullish and think C3 has great potential for a swing trade, but more so a long-term investment. \n\n*I am not a financial advisor. Do your own DD*\n\n*Current position: 515 shares @ $59.87*",
        "subreddit": "wallstreetbets",
        "title": "$AI is the future",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nyh2vb/ai_is_the_future/",
        "created": 1623562081.0
    },
    {
        "author": "Environmental_Work63",
        "created_utc": 1623735821,
        "id": "o06wsh",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "[https://whalewisdom.com/filer/citadel-advisors-llc#tabholdings\\_tab\\_link](https://whalewisdom.com/filer/citadel-advisors-llc#tabholdings_tab_link)\n\nI do not have a subscription but another user was kind to point this out.\n\nAs per u/shouldabeenalawyer69\n\n&amp;#x200B;\n\nAs you can see above, less that a month ago. Citadel securities has taken short position in WKHS. They are short 2,099,000 shares in Puts, have 1,822,200 shares tied into Calls, and own 779,284 shares. ([https://whalewisdom.com/filer/citadel-advisors-llc#tabholdings\\_tab\\_link](https://whalewisdom.com/filer/citadel-advisors-llc#tabholdings_tab_link))\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nThese filings don't include if they sold the calls/puts, or bought the calls/puts. But I have reason to believe, given that they have 2,099,000 shares short (which stands for about 21,000 Puts contracts; 100 share multiplier per contract) and are in the 6/18 Strike Price of 6 Put and the 9 Put as well. Just look at the open interest from thinkorswim below (Boxed in orange, right side). And obviously you might think, just coincidental. But..... I have coded the change of open interest to determine when this position was made, and if it was made all at once. To the right of the picture below, you can see that this position was placed between 15-20 trading days prior (OI (-15/-20Days). AKA 3-4 weeks prior, which puts us at the week prior to their fillings, May 17th. Like I said, these fillings were reported on May 21st.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nNow what about the call? They are tied into 1,822,200 shares or about (18k call contracts). Now again, looking at the coded option chain data, you can see that once again there was a position placed again for the 20 Call of this weeks, 6/18 expiration. The open interest increased to 18,513 15 days ago, or again, right at the time of Citadels fillings on May 21st.\n\nAs per u/JulianFranklin \"They sold 18,000 call contracts with a $20 strike price. That means they are promising to SELL 1.8 million shares (18,000 contracts X 100 shares per contract) at $20 each. That means, if WKHS finishes Friday at less than $20 they don't have to do anything, all the money they made selling the options is pure profit. Remember, options don't exist until someone sells them. An option is just a promise to either buy or sell at a later date under certain conditions. If the conditions aren't met by the timeline in the promise, then the option vanishes and the person who sold it wins. Now to the REAL part of your question...\n\n&amp;#x200B;\n\nCitadel wins if WKHS finishes above $9 and below $20. For every dollar ABOVE $20 that WKHS gets to by Friday closing bell, Citadel will lose $1.8 million (less whatever they were paid when they sold the option). So if WKHS goes to $25.55 at closing bell, Citadel loses $10 million. If it goes to $31.11 they lose $20 million. If WKHS goes to $50, they lose $54 million.\n\n&amp;#x200B;\n\nA protective collar strategy is performed by purchasing an out-of-the-money put option and simultaneously writing an out-of-the-money call option. The underlying asset and the expiration date must be the same. This strategy is often used by investors after a long position in a stock has experienced substantial gains. This allows investors to have downside protection as the long put helps lock in the potential sale price. However, the trade-off is that they may be obligated to sell shares at a higher price, thereby forgoing the possibility for further profits.\n\n&amp;#x200B;\n\nAn example of this strategy is if an investor is long on 100 shares of IBM at $50 and suppose that IBM rises to $100 as of January 1. The investor could construct a protective collar by selling one IBM March 105 call and simultaneously buying one IBM March 95 put. The trader is protected below $95 until the expiration date. The trade-off is that they may potentially be obligated to sell their shares at $105 if IBM trades at that rate prior to expiry.\n\nThe main drawback of this strategy is that the investor is giving away upside in the stock in exchange for obtaining downside protection. The protective collar works like a charm if the stock declines, but not so well if the stock surges ahead and is \"called away,\" as any additional gain above the call strike price will be lost.\n\n&amp;#x200B;\n\nMore details can be found here [https://www.reddit.com/r/WKHS/comments/nyxnrj/fellow\\_ape\\_brothers\\_and\\_sisters\\_of\\_wkhs\\_we\\_must/?utm\\_source=share&amp;utm\\_medium=ios\\_app&amp;utm\\_name=iossmf&amp;utm\\_term=link](https://www.reddit.com/r/WKHS/comments/nyxnrj/fellow_ape_brothers_and_sisters_of_wkhs_we_must/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf&amp;utm_term=link)",
        "subreddit": "Wallstreetbetsnew",
        "title": "Citadel owns 18,000 call contracts with a $20 strike price expiring Friday 6/18 along with 21,000 PUTS. A protective collar strategy MAY BE IN PLACE GME AMC we need your help to take them out",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/o06wsh/citadel_owns_18000_call_contracts_with_a_20/",
        "created": 1623764621.0
    },
    {
        "author": "Original-Setting-266",
        "created_utc": 1623430483,
        "id": "nxknef",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "Finally in $PLTR Palantir. Aside from the company's name is coming from Lord of the Rings aka the \"seeing-stones,\" described as indestructible balls of crystal used for communication and to see events in other parts of the world, the CEO Alex Karp’s interviews keep me more and more interested.\n\nThis is the dip to buy in my opinion.\n\nWith contracts with the US and UK in military intelligence police heathcare and others with IBM, Amazon etc, I’m intending to ride this to not just the moon but to Mars.\n\nShort term I see this going to $27 and attempting to break/ hold that key level. It is already showing the golden cross formation of crossing moving averages. In the long run this play does not have a roof, it will easily get back to all time highs of $45 and from there contract announcement after aannouncement will take it even further. My own PT is $80 min.\n\nhttps://preview.redd.it/zitv60yo2o471.png?width=602&amp;format=png&amp;auto=webp&amp;s=bfc444fb7454357ac67e31a7a4f16eb2f7237499\n\n  \n\nAscending wedge – higher low and holding a consistent high\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/q0ndlr6r2o471.png?width=602&amp;format=png&amp;auto=webp&amp;s=7ca9b8a462a13a9712376ac979ea969ad9798d83\n\n  \n\nThe breakout is coming! Get your boat loaded!\n\n300 @ 24.1",
        "subreddit": "wallstreetbets",
        "title": "$PLTR Palantir we going to the moon. Here’s why I loaded the boat today.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nxknef/pltr_palantir_we_going_to_the_moon_heres_why_i/",
        "created": 1623459283.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1624109479,
        "id": "o3g5ng",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "Before we get started, I'd like to point out that these stocks are ordered based on their current (2021) Dividend Yield. This list does not include every single company known to man. What are some of your favorite dividend companies?\n\n&amp;#x200B;\n\n[TTM Dividend Yield](https://preview.redd.it/9u7e4wsj48671.png?width=1046&amp;format=png&amp;auto=webp&amp;s=6bb1b078793b4359854662321d296dfb6b5cf220)\n\n*Note: Reddit only allows 20 images per post so the first 10 stocks don't have charts.*\n\n**30. Caterpillar (CAT)**\n\nDividend Payment: Quarterly \n\nLowest Dividend Yield in past 10 years: 1.95% (2021)\n\nHighest Dividend Yield in past 10 years: 4.09% (2015)\n\n**29. Aflac (AFL)**\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 2.00% (2019)\n\nHighest Dividend Yield in past 10 years: 2.75% (2011)\n\n**28. General Dynamics (GD)**\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 1.53% (2017)\n\nHighest Dividend Yield in past 10 years: 3.66% (2012)\n\n**27. Procter &amp; Gamble (PG)**\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 2.19% (2020)\n\nHighest Dividend Yield in past 10 years: 3.52% (2015)\n\n**26. The Clorox Co. (CLX)**\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 2.03% (2020)\n\nHighest Dividend Yield in past 10 years: 3.35% (2011)\n\n**25. PepsiCo (PEP)**\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 2.57% (2014)\n\nHighest Dividend Yield in past 10 years: 3.15% (2011)\n\n**24. The Coca-Cola Co. (KO)**\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 2.71% (2012)\n\nHighest Dividend Yield in past 10 years: 3.36% (2016)\n\n**23. 3M (MMM)**\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 1.97% (2013)\n\nHighest Dividend Yield in past 10 years: 3.44% (2019)\n\n**22. NiSource (NI)**\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 2.43% (2014)\n\nHighest Dividend Yield in past 10 years: 4.04% (2011)\n\n**21. Kimberly Clark (KMB)**\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 2.90% (2015)\n\nHighest Dividend Yield in past 10 years: 6.94% (2014)\n\n**20. Cardinal Health (CAH)**\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 1.60% (2014)\n\nHighest Dividend Yield in past 10 years: 3.74% (2019)\n\n**19. Federal Realty Investment Trust (FRT)**\n\n[TTM Dividend Yield](https://preview.redd.it/paf2kken48671.png?width=724&amp;format=png&amp;auto=webp&amp;s=14b2818078ff6160ac82a6d14190cbbdd83929b0)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 2.40% (2014)\n\nHighest Dividend Yield in past 10 years: 4.86% (2020)\n\n**18. Walgreens Boots Alliance (WBA)**\n\n[TTM Dividend Yield](https://preview.redd.it/e4yv9xhp48671.png?width=724&amp;format=png&amp;auto=webp&amp;s=07d829a2c4991910f4573152da1ddf36747d50e4)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 1.73% (2015)\n\nHighest Dividend Yield in past 10 years: 4.78% (2020)\n\n**17. Consolidated Edison (ED)**\n\n[TTM Dividend Yield](https://preview.redd.it/o5fl4v3s48671.png?width=724&amp;format=png&amp;auto=webp&amp;s=0e6eebb791bb67be6df4a6671b60ca748f970cf5)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 3.07% (2017)\n\nHighest Dividend Yield in past 10 years: 4.31% (2012)\n\n**16. Realty Income Corp (O)**\n\n[TTM Dividend Yield](https://preview.redd.it/34krjjot48671.png?width=724&amp;format=png&amp;auto=webp&amp;s=5d68c238180deac65b47044113d09d8dacca9632)\n\nDividend Payment: Monthly\n\nLowest Dividend Yield in past 10 years: 4.01% (2021)\n\nHighest Dividend Yield in past 10 years: 5.62% (2013)\n\n**15. People's United Financial (PBCT)**\n\n[TTM Dividend Yield](https://preview.redd.it/lmcw1rnv48671.png?width=724&amp;format=png&amp;auto=webp&amp;s=8752a7540663ad2e71cec1aa95ad14b7bacd2768)\n\nDividend Payment: Quarterly \n\nLowest Dividend Yield in past 10 years: 3.59% (2017)\n\nHighest Dividend Yield in past 10 years: 6.59% (2020)\n\n**14. AbbVie (ABBV)**\n\n[TTM Dividend Yield](https://preview.redd.it/fnijw5wx48671.png?width=724&amp;format=png&amp;auto=webp&amp;s=253ff66b2acea5ce0d2d37d0487d61865b40a576)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 6 years: 2.77% (2017)\n\nHighest Dividend Yield in past 6 years: 5.69% (2019)\n\n**13. International Business Machines (IBM)**\n\n[TTM Dividend Yield](https://preview.redd.it/o0p7myuz48671.png?width=724&amp;format=png&amp;auto=webp&amp;s=e414d992eeae4f6dd18a7ecdbbb34af394d44032)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 1.54% (2011)\n\nHighest Dividend Yield in past 10 years: 5.52% (2020)\n\n**12. Chevron (CVX)**\n\n[TTM Dividend Yield](https://preview.redd.it/8fodml8258671.png?width=724&amp;format=png&amp;auto=webp&amp;s=0b1f1688d144c4b156aea9b590c7c11b172e345e)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 3.02% (2011)\n\nHighest Dividend Yield in past 10 years: 5.80% (2020)\n\n**11. Gaming and Leisure Properties (GLPI)**\n\n[TTM Dividend Yield](https://preview.redd.it/hjciguq358671.png?width=724&amp;format=png&amp;auto=webp&amp;s=b8b4c236131c32369464cf0dcc09657dff18414c)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 7 years: 5.26% (2021)\n\nHighest Dividend Yield in past 7 years: 7.86% (2015)\n\n**10. Universal Corp (UVV)**\n\n[TTM Dividend Yield](https://preview.redd.it/46515rf558671.png?width=724&amp;format=png&amp;auto=webp&amp;s=c68cd5c549e0930905e2cbd05c7067618838fc1e)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 3.67% (2016)\n\nHighest Dividend Yield in past 10 years: 6.85% (2020)\n\n**9. ExxonMobil (XOM)**\n\n[TTM Dividend Yield](https://preview.redd.it/k9kvc9k758671.png?width=724&amp;format=png&amp;auto=webp&amp;s=35451b3352df6eb0c721c1a9c7f97a3b5d6d21a4)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 2.30% (2011)\n\nHighest Dividend Yield in past 10 years: 9.14% (2020)\n\n**8. ONEOK Inc (OKE)**\n\n[TTM Dividend Yield](https://preview.redd.it/ejkt41c958671.png?width=724&amp;format=png&amp;auto=webp&amp;s=a390dda91231c5b9efe59f0b7e2cc7f870c04304)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 2.59% (2013)\n\nHighest Dividend Yield in past 10 years: 12.36% (2020)\n\n**7. Altria Group (MO)**\n\n[TTM Dividend Yield](https://preview.redd.it/mck5vxwa58671.png?width=724&amp;format=png&amp;auto=webp&amp;s=2fd6ec062aca154a673b94edbf048b1021deb248)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 3.45% (2017)\n\nHighest Dividend Yield in past 10 years: 7.91% (2020)\n\n**6. AT&amp;T (T)**\n\n[TTM Dividend Yield](https://preview.redd.it/yr8f8add58671.png?width=724&amp;format=png&amp;auto=webp&amp;s=e7eda91d302451b829163ddac31f57e946cfa7e1)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 4.56% (2012)\n\nHighest Dividend Yield in past 10 years: 7.08% (2020)\n\n**5. Magellan Midtstream Partners (MMP)**\n\n[TTM Dividend Yield](https://preview.redd.it/ybq324af58671.png?width=724&amp;format=png&amp;auto=webp&amp;s=44908711e8a4d27af7c80115e06e34a7c76f41da)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 2.95% (2014)\n\nHighest Dividend Yield in past 10 years: 11.12% (2020)\n\n**4. Ares Capital (ARCC)**\n\n[TTM Dividend Yield](https://preview.redd.it/5i9b1u7h58671.png?width=724&amp;format=png&amp;auto=webp&amp;s=e64c72e42c8c5df80ce12d3eb1656e29d6cff9c0)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 10 years: 7.86% (2021)\n\nHighest Dividend Yield in past 10 years: 10.50% (2015)\n\n**3. BlackRock TCP Capital (TCPC)**\n\n[TTM Dividend Yield](https://preview.redd.it/gkjg2e0j58671.png?width=724&amp;format=png&amp;auto=webp&amp;s=4d006e2a233ab8ec7cd510301709f25529acdc05)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 8 years: 8.24% (2021)\n\nHighest Dividend Yield in past 8 years: 10.67% (2020)\n\n**2. New Mountain Finance (NMFC)**\n\n[TTM Dividend Yield](https://preview.redd.it/4c6zi5wk58671.png?width=724&amp;format=png&amp;auto=webp&amp;s=3a73d569f9d8e688b1cf232d15ead227ad575b66)\n\nDividend Payment: Quarterly\n\nLowest Dividend Yield in past 9 years: 8.86% (2021)\n\nHighest Dividend Yield in past 9 years: 10.94% (2012)\n\n**1.** **PennantPark Floating Rate Capital (PFLT)**\n\n[TTM Dividend Yield](https://preview.redd.it/8nzcnaom58671.png?width=724&amp;format=png&amp;auto=webp&amp;s=84adde39d53e49df268d663048b1065a744f9720)\n\nDividend Payment: Monthly\n\nLowest Dividend Yield in past 10 years: 4.32% (2011)\n\nHighest Dividend Yield in past 10 years: 10.63% (2020)\n\n&amp;#x200B;\n\n*Made Using Microsoft Excel*\n\n*\\*\\*This is not investment advice\\*\\**\n\n*\\*\\*Do your own research\\*\\**",
        "subreddit": "StockMarket",
        "title": "Top 30 High Yield Dividends",
        "url": "https://www.reddit.com/r/StockMarket/comments/o3g5ng/top_30_high_yield_dividends/",
        "created": 1624138279.0
    },
    {
        "author": "itzbranman",
        "created_utc": 1623782946,
        "id": "o0llbl",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": " \n\nDuring the last year Pitney Bowes grew its earnings per share (EPS) by 100%\n\nQ1 revenue of $915m, beating expectations, stock was then beaten down after a run up\n\nEvery quarter PBI exceeds expectations, with an EPS beat of 61% the first Quarter of 2021\n\nTheir e-commerce transformation has only just begun, which is why the share price has increased so much in the last year. This company has tons of room to grow, and they continually innovate in their sectors - E-commerce, shipping, office mailing, and Sending Technology Solutions. They provide Software-as-a-Service solutions to bolster their capabilities for ease of use and scalability.\n\nLeadership\n\nMarc B. Lautenbach - CEO Former IBM executive for 27 years, great track record leading the consulting and systems integration business.\n\nAna Maria Chadwick - CFO Former GE Financial CEO, where she helped to transform the business to adapt to the future. Just like she has been doing at PBI since January.\n\n90% of companies in the Fortune 500 rely on PBI's SaaS solutions to meet their e-commerce and shipping needs. You read that right. 90%.\n\nThe company just started a Dividend in April, which means more investors will hold for longer. More of the float will be locked up. This is good for us traders.\n\nThis is a value play. The company is severely undervalued and volume is low. All it needs is to be on the right people's radar to make a big jump.\n\nPosition: 200 12c 16 July, 1000 shares",
        "subreddit": "wallstreetbets",
        "title": "Pitney Bowes Inc., The Sleeping Giant",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o0llbl/pitney_bowes_inc_the_sleeping_giant/",
        "created": 1623811746.0
    },
    {
        "author": "Theeliteshitposter",
        "created_utc": 1622872200,
        "id": "nsoves",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Why I think BB is legit\n\nHonest View on BB\n\nApe Research Analyst Report on BB: To the Moon\n\nWhat's up apes, I know the last couple weeks have been life-changing for some of us. As a grad student who grew up on the lower end of the middle class, I recognize how pumped some fo you must feel and commend everyone's brass balls- it's never easy to make money in a casino as heavily manipulated as the free market that is the USA. But turning to BB: it was never meant to be just some squeeze (although its end result could technically be called that if you really wanted too)- it's a retooling company embedded in a crucial sector to the modern global economy.\n\nAnd so while some of us have become capable of retirement in recent weeks, I want to talk about a name that is on the cusp of a resurrection.\n\n# For BB Holders, it's been tough lately.\n\nMany people have harsh memories of Blackberry: it was on the cusp of bankruptcy as recently as 2015. Revenue growth sunk from $20B at its peak in 2011 (82% hardware sales) to under a $1B in the 2010s; $BB stock sunk from a peak of $146 in 2008 to single digits, thanks to negative cash flows and rapidly declining top line growth.\n\n[Not surprising BB ate shit for so long- this useless Etch-a-Sketch was 82&amp;#37; of their revenue in 2011!](https://preview.redd.it/w7dt7c4bwd371.png?width=1196&amp;format=png&amp;auto=webp&amp;s=80e0a1b70f7bad3078d8bb3d3982d69b1d12f1bb)\n\n[It's been a long, tough run for Blackberry shareholders since they ended hardware production\\/sales. The stock has been largely irrelevant for years, falling from a peak of $146 in May 2008 to single digits \\&lt; $5B market cap. But its transition into a cybersecurity company is only beginning to pay fruit, which I believe the market will catch on to very soon. Times are a-changing!](https://preview.redd.it/f5zqz58dwd371.png?width=1202&amp;format=png&amp;auto=webp&amp;s=763644f3ae3cc922a25d1e06d7d0a295ae5d5ed9)\n\n# A Rebranded Business for the Digital Economy\n\nLike we've seen with the Chads in Gamestoink, successful companies are the ones willing to renounce their fading legacy businesses and embrace initiatives and industries that sit on the cusp of the digital age. Enter Blackberry. Now we all remember Blackberry's legacy business- the handheld pagers that looked like shit, but only quirky people embraced (POTUS and CEOs used Blackberry pagers over iPhones for the longest of times, until Blackberry discontinued its hardware line).\n\nHowever, the primary focus for Blackberry has never changed. Blackberry was always security-centric, and with the installation of CEO John S. Chen in 2013, Blackberry pivoted towards software- a trend that was always going to happen given Apple's prowess in manufacturing superior smartphones.\n\n&amp;#x200B;\n\n[John S. Chen's my homie. If you're scared about holding BB bags, just reassure yourself that that chin can hold both yours and his. But seriously, he's an innovator, having been credited with \\\\\"Saving Blackberry\\\\\"- pay attention, his vision doesn't end with subsistence.](https://preview.redd.it/l39tl9rfwd371.png?width=716&amp;format=png&amp;auto=webp&amp;s=91ee66024cfba9e04ea1566f5690aeb57ecd2497)\n\nBut like Ryan Cohen with Gamestop/Chewy, Blackberry recognized it needed to adapt to survive, and that's exactly what it has done under Chen's stewardship. A glimpse at Blackberry today is far different than the pioneer that once controlled 20%+ of the mobile hardware market.\n\n[Revenues have intuitively followed a similar trajectory as Blackberry's market cap. But the transformation under Chen's leadership so far is tangible: after hardware sales alone accounted for 82&amp;#37; of revenue in 2011, the company made a wide U-turn. After establishing \\(and meeting\\) a goal for fiscal 2020 revenue to top $1B again, hardware has fallen to just \\~3&amp;#37; of sales. Enterprise software \\(44&amp;#37;\\), Licensing &amp; IP \\(31&amp;#37;\\), and Technology Solutions \\(22&amp;#37;\\) now dominate BB's topline as of 2020, cementing its push and admittance to the cybersecurity market.](https://preview.redd.it/u9mg373iwd371.png?width=1194&amp;format=png&amp;auto=webp&amp;s=5c8790440834c2d2f933eb88018fa6971d95ce0e)\n\n# So what does Blackberry actually do now?\n\nTo be clear, the only people walking around with Blackberry \"phones\" nowadays are old junkies trying to revive some 2000s nostalgia. Blackberry doesn't make that archaic crap anymore. All you need to remember are three phrases when thinking about the new Blackberry: **enterprise software, licensing IP,** and **technology solutions**.\n\n* **Enterprise software** is one of the fastest growing components of BB's cybersecurity offering. It includes products like the Blackberry Enterprise Mobility Suite, which provides endpoint management and BlackBerry AtHoc, a secure communications platform.\n* **Licensing IP** is the segment responsible for the monetization of the Company’s global patent portfolio as well as the mobility licensing operations, which license the BlackBerry brand and device software to handset vendors.\n* **Technology Solutions** is the business that includes BlackBerry QNX embedded software as well as several emerging businesses such as the BlackBerry Radar fleet management solutions.\n\nExciting Partnerships, Soaring Ambitions\n\n*\\*\\*You should really take a look at some of Blackberry's partnerships in the last 2 years- this is not a company that makes shitty pagers anymore, it's the company that embodies \"digital transformation.\"*\n\nTake a look at some of the companies Blackberry is sleeping with and tell me your smooth gorilla brain doesn't swell:\n\n* **Baidu** has an extensive partnership with BB in its autonomous vehicle unit, dating back to 2018. In January 2018, the two companies announced they would [partner](https://www.blackberry.com/us/en/company/newsroom/press-releases/2018/blackberry-and-baidu-partnering-to-accelerate-connected-and-autonomous-vehicle-technology) to utilize Blackberry QNX's OS as the backbone of Baidu's autonomous system. Blackberry also agreed to help Baidu integrate smartphone integration software for Chinese connected cars (CarLife), conversational AI (DuerOS), and HD maps. In January 2021, these two [expanded](https://www.blackberry.com/us/en/company/newsroom/press-releases/2021/blackberry-expands-partnership-with-baidu-to-power-next-generation-autonomous-driving-technology) their relationship: Blackberry's QNX Neutrino Real-Time OS is being utilized for all future EV models produced with the EV branch of GAC (Guangzhou Automotive Group, yes the C isn't a typo). Pretty exciting stuff to say the least..\n* **Motional**, which is a Hyundai backed AV startup, [announced](https://www.blackberry.com/us/en/company/newsroom/press-releases/2021/blackberrys-qnx-black-channel-communications-to-be-used-in-motionals-driverless-platform) in February 2021 its intentions to use BB's Black Channel communications technology for all of Motional's future AVs. A very integral input for Motional and impressive win for Blackberry, being able to ensure safe data communication exchanges within vehicle safety systems is essential for AVs' successful integration in society... otherwise where is the trust in accepting that ride? Not to mention that Apple (*the Tim Apple*) was chirping around with Hyundai and Kia, talking about making a \"smart car,\" *earlier this year!* I guess all the ape memes about Blackberry being a legitimate competitor to Apple shouldn't be sneezed at by Wall St equity research analysts and BB 🌈🐻s...\n* **AWS**, yes Amazon Web Services (!), is another credible player lining up with Blackberry. Although not quite as exciting as building actual AVs, the work they do is still essential to ensure this dream can actually be realized. In December 2020, the two Chads [announced](https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/aws-blackberry-join-forces-to-accelerate-innovation-with-new-intelligent-vehicle-data-platform) a multi-year partnership to develop BB's IVY platform (Intelligent Vehicle Data, yes the \"Y\" is weird, but makes sense for ape leadership), allowing automakers to read sensor data, normalize it, and create actionable insights from the data both in the vehicle and in the cloud.\n\nTake it from Amazon's new CEO, Andy Jassy himself: *“AWS and BlackBerry are making it possible for any automaker to continuously reinvent the customer experience and transform vehicles from fixed pieces of technology into systems that can grow and adapt with a user’s needs and preferences. Through this joint effort with BlackBerry, we will provide automakers with the insights, capabilities, agility, and speed they need to thrive in an increasingly connected world. As automakers seek to race ahead in their digital transformations, BlackBerry IVY empowers them to build their brands and set the standard for connected vehicle services across the automotive industry.”*\n\n[These geniuses love Blackberry, starting with their most intelligent, scalable business: AWS! Shouldn't you apes like BB as well?](https://preview.redd.it/ktha1d7nwd371.png?width=1218&amp;format=png&amp;auto=webp&amp;s=892b2415869531f1cf47f9c54b6d6e668c252877)\n\nBut why should I stop there? I'm tired of seeing fear-mongering Wall Street hedge funds, investment bankers, and research analysts attempting to push their positions (BB's primary competitors are IBM, Microsoft, VMware, and Mobile Iron, the former 3 of which are all significantly owned by \"institutions\" - &gt;75%) and allege Blackberry is a dying business that makes crappy hardware.\n\n* **Microsoft** (Yes its rival!) even realizes its budding competitor is crafting innovative solutions, announcing a partnership in [October 2020](https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/blackberry-athoc-integrates-with-microsoft-teams-for-critical-event-management) for Microsoft Teams! Microsoft plans to integrate Blackberry AtHoc, which will allow organizations on Teams to contact, alert, and account for all members of their group directly through Teams should some calamity transpire. Especially as we witness more cyber attacks (the digital economy's biggest threat will stem from this), it will be an all hands-on-deck effort to safeguard the integrity of our software. BB's partnership with Microsoft (and [ServiceNow](https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/blackberry-athoc-and-servicenow-partner-to-deliver-secure-and-re) for incident response management) not only grounds its strong advance to cybersecurity industry disruption, but its diverse agility to penetrate various sectors, ranging from AV/EV, CRM software, IoT, 5G, and so much more.\n* If the corporate pedigree isn't enough for you, I'll end with the **U.S. Air Force**. No, unlike what bulge bracket banks may lead you to believe, BB's revenue stream is well-diversified, as the USAF [announced](https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/the-united-states-air-force-chooses-blackberry-spark-for-secure-productivity) a partnership in September 2020. Blackberry Spark, utilized for UEM and UES, will help the Air Force with their secure productivity needs, enabling virtual work environments whilst ensuring premium security. As we face more threats in the cyber space and continue pivoting towards a \"work-from-home environment\" regardless of the permanent trends form Covid, BB's wide-ranging partnerships, from Fortune 500 tech companies to the U.S. military prove it is an essential cog in the 21st century digital economy. Not to mention consistent ARR is exactly what investors (the suits) should be looking for, so what gives with the nasty financial press?\n\n# Blackberry's Financial Trajectory (Revs, Bottom Line, CF)\n\nWe have to take a look at Blackberry's financials, after all that is what this casino allegedly runs on. Luckily, if we ignore what the \"experts\" in Battery Park are shilling, we'll notice Blackberry is not the capsizing Titanic all the research analysts make it out to be. I'll take you into a deeper dive into the top &amp; bottom line with just the facts and my brilliant takes, and y'all can make your own decision on whether BB stock is seriously a pile of rat shit or an emerging growth stud.\n\n[As you might expect, Blackberry's overall top line consistently declined until roughly 2020+ \\(when every single one of these dope partnerships was announced\\). As BB wound down its legacy hardware, handset, and related service products, sales declined nearly $400M over the course of final two years, a marked decline from the near $20B struck in 2011. This trend seems to be on the reverse though: the new partnerships in 2020\\/21 have certainly underscored BB's transition into a software company, a trend even Wall St has had to acknowledge by lifting growth targets for fiscal year 2021. IMO, the $1.2B projected top line figure for '21 is conservative, and I think these figures could start to double, triple, and 🚀🚀🚀 in 2024+. Let me explain why with more charts:](https://preview.redd.it/3pq5gyspwd371.png?width=874&amp;format=png&amp;auto=webp&amp;s=e1a643492be05c1ec2f4830bd0b66b180276b6b3)\n\n[All those dope corporate and military partnerships I highlighted earlier? They mainly fit into BB's Enterprise software\\/services revenue stream, which is now 44&amp;#37; of overall revenue. This is the first component that I believe is going to drive revenue growth, profitability, cash flow, and tendies for us and BB in the years to come. We'll first notice that growth in this space really picked up in 2020 for BB, similarly to when their overall topline reversed trend- because this is the soul of 2021 Blackberry! And no, this doesn't even really include the innovative AV\\/EV partnerships, these are just institutional clients like Microsoft, ServiceNow, or Salesforce who want to buy one of Blackberry's SaaS established offerings. Think of the potential addressable market in the years to come: work from home, AI, 5G, IoT, we can keep going- all of these things need to be protected, without security, there is no system- every software, hardware, and appliance company under the sun is going to be lining up because they have no choice. You are adapt or go extinct. I expect BB to continue driving this aspect of its growth in a gargantuan way: think 25-50&amp;#37; growth YoY.](https://preview.redd.it/m106ixxswd371.png?width=846&amp;format=png&amp;auto=webp&amp;s=59e12724037bc3b9f099ab2859bea4b6608f00ee)\n\n[If Enterprise Software is to be Blackberry's Patrick Mahomes, Technology Solutions will be Blackberry's Tom Brady. Since 2017, this aspect has doubled as a portion of overall BB revenue, from roughly 10&amp;#37; in '17 to over 22&amp;#37; projected in '21, reflecting BB's successful ongoing foray into innovative technologies. In this segment we see BB's partnerships with Motion\\/Baidu reflected, cutting-edge technology projects that will enable unfathomable innovations in the future. We could say autonomous vehicles, or drones or anything that will be automated- they will all need to be securitized, whether with each other or on the cloud. BB's deep partnerships with global leaders like Baidu indicate John Chen has been playing 4D Chess since 2013: intensive capital expenditures to transform a company's creative intelligence don't just happen with the snap of your fingers. Put simply, you don't just go from making pagers to making AVs overnight- it's a lengthy process that will affect your growth\\/profitability, as evidenced by Blackberry's fall from grace. But if my instincts are right, Enterprise Software and Technology Solutions will drive BB's revenue growth\\/profitability, propelling it back to $100B market cap in the not-so-distant future.](https://preview.redd.it/1h96psxuwd371.png?width=878&amp;format=png&amp;auto=webp&amp;s=595d7f66d80d079394875a718984ee589b593bcc)\n\n[BB earns a decent amount of revenue from Licensing\\/IP, which is quite frankly a pleasant surprise to me. Essentially this component comprises BB's monetization of its global patent portfolio and licensing operations, which do things like license the Blackberry brand\\/device software to various vendors \\(a lot of handset\\). It is somewhat impressive that it's currently 31&amp;#37; of BB's top line, but then again not too surprising. Considering the Enterprise Software\\/Technology Solutions streams are at really nascent stages of growth, it makes sense that this more \\\\\"legacy\\\\\" revenue stream is so prominent. But then again, this component jumped over 20&amp;#37; in 2020 \\(what seems to be BB's turning point\\), so it's not like I'm going to argue with more revenue either. I'd say this the Matt Stafford component of BB: a reliable and solid contributor, but not something I would be betting the bank on either. But if it produces \\(which is certainly not out of the question\\), I won't complain either \\(unless I'm from Detroit\\).](https://preview.redd.it/fx1ebhmxwd371.png?width=858&amp;format=png&amp;auto=webp&amp;s=06730b56ca47298cd1347a8c090542c1e90eae96)\n\n[I think we've established hardware\\/handsets are a legacy business for Blackberry. Why do I talk about it? B\\/c Wall Street does, and WSB often falls prey to their fear-mongering. DON'T PAY ATTENTION. It's like Mitch Trubisky- yeah that ish was dope in 2015-2016, but we all know it's washed now and the only reason we keep talking about is because shillers want to use it to keep diverting from the real gold.](https://preview.redd.it/j0fszgu0xd371.png?width=896&amp;format=png&amp;auto=webp&amp;s=e4b2250478ab2cb6ad49956d4b2f4f89560fc56c)\n\n[I'm not going to hammer earnings to crazy... to actually say with strong conviction that you can accurately forecast that out YoY is bullshit, and anyone from Wall St telling you they can is likely doing the same thing. Never the less, we see a clear trend: great profitability growth when Blackberry pagers led the mobile handset market, awful declines from 2012-2018 as BB closed hardware operations and invested in software\\/cybersecurity ambitions, culminating in the mixed bag we've been seeing in 2018 and beyond. Wouldn't be surprised to see this earnings churn to continue until \\~2023-2025, after all, you have to invest\\/incur losses if you want long-term profitability. I'm going to stay watching the 3 primary components of BB's revenue growth for now.](https://preview.redd.it/voaefw43xd371.png?width=1204&amp;format=png&amp;auto=webp&amp;s=71f9cc1c63d585f57e3b88e20803c7f0f3ab4d79)\n\n[I care about Cash Flow far more than net income. Yeah, it's nice to look profitable, but how much money is actually coming in to your company? We see... a slow pick-up after 2020 \\(\\*pinch me\\*\\), when BB's resurrection appears to have started. Even in its legacy days, Blackberry was seeing hella cash leave the company, which just underscores software is a more profitable business than hardware. 2021 projections indicate Cash Flow could increase at the largest YoY rate in Blackberry's history \\(albeit from it's near-zero base\\). Nevertheless, if revenue growth booms like I think it will, FCF metrics are gunna look pretty green in 2022+.](https://preview.redd.it/ja112d95xd371.png?width=1234&amp;format=png&amp;auto=webp&amp;s=d56e1feaa214463cd5b3b518e9b1c6171368f65b)\n\n# My Strongest Convictions on BB\n\nWell apes, thanks for enduring my BB nut. Now time for you to swallow:\n\n* I don't believe BB is \"just a meme.\" To the tards that made fuckloads of money on BBBY, KOSS, SNDL, and even AMC (not GME, PM me if you want to debate what I would call GME) to an extent in these \"not-exactly-the-future\" businesses with high amounts of short interest- kudos to you, here's your 👑, King. But the tough truth is I'm skeptical that \"squeezing\" is always going to work. For starters, you think the hedgies are really that fucking stupid? I mean, come on, Chancellor/Emperor Ken Griffin had to extend Melvin $5B in credit, lather up Vlad, and testify in front of Congress. Don't exactly think continuous losses and Congressional subpoenas are exactly what the hedgies want either... I'm sure their risk management committee have been popping Addies daily since January to make sure they aren't overfuckingextended in one bet. \\*Cough\\* \\*Bill Hwang\\* Cough\\*\n* No, I truly believe Blackberry Ltd is the 2016 version of AMD in the 2021 cybersecurity market. Back then, AMD's legacy business was flailing, and the entire chip market was dominated by Intel. They went into the changing room, made themselves up, and reorganized. Capturing 1%, then 2%, then 3% of the market share seems so little nominally, but means so much for the top line, bottom line, and the share price when you go from 0 to 1. 1 to 10 may seem like a big jump, but it's launching from the ground (a baseline of 0) that is most lucrative- and that is *exactly where Blackberry (BB) sits right now*. Capturing 2% of the global cybersecurity market would send BB flying, and we'd be soaring back to $140. If BB is actually as innovative as I think, who knows?\n* Unfortunately, if you think this is a short squeeze, I'm sorry, get out. I actually kinda like seeing closes like today (plummeting down 15%), because we shake out the weak hands and I can buy more cheap shares. No one's forcing you to buy this stock, I just like it. Facts &amp; numbers don't lie either. Short interest is 9% on roughly 500M shares outstanding, so we would likely need Jay Powell, Cathie Wood, Elon, and Chamath to hop in if there was actually to be a \"squeeze\" overnight.\n* But to contradict myself somewhat, I also think June 2021 (right now) could be one of the most preferential entry points into BB ever. Data indicates 40% of the shares are owned by institutions (similar numbers to GME), indicating 60% is retail, many of them apes. The suits may scream \"overvalued reeeee,\" and they have a point, BB stock isn't exactly cheap. As it trades at roughly 8X forward sales, BB is valued as a fast growing company, but not beyond the likes of PLTR &amp; SNOW (yes different industries, but valuations that are multiple times higher) or competitors like Palo Alto Networks or Cisco. As a graduate student attempting to be not completely rarted with my limited capital, I love the risk-reward for BB, especially considering they report earnings on June 22. I suspect these numbers will come in far stronger than the St is saying, and at least they will start to lift future guidance in a significant way (both catalysts for a 50-100% move in BB IMHO). I guess we'll see how the financials reward BB's transition, but I am truly convinced this is the AMD of cybersecurity.\n* This last part is a mixed-bag (but suspicious if we dive deeper), and I'm sure a lot of apes will downvote me and possibly completely avoid BB with this knowledge, but I want to share facts since they are evidently so hard to find. We got the usual mutual funds (Vanguard, Fidelity, TD, etc) who own BB (roughly 25%) and two woke funds who invest in \"innovative trends\" own the other 15%. But data does indicate nasty little Ken (Citadel) reported buying 1.3M shares of BB in Q1. BB was heavily shorted pre-GME (like 30%+), and Citadel/gey bears almost definitely bought shares to cover. The question I'm wondering was did Citadel actually buy BB b/c they were so worried about a squeeze since it is a legitimate growth stock or b/c he shares my sentiments about its turnaround? Regardless, both seem like positive catalysts for the stock, and hopefully Ken answers my question.... oh wait...\n\n[Self-explanatory.](https://preview.redd.it/w33d8rdaxd371.png?width=1886&amp;format=png&amp;auto=webp&amp;s=ab406b459250bc6669c79e67c65c145f9b879709)\n\nObligatiory: BB to the moon.",
        "subreddit": "Wallstreetbetsnew",
        "title": "Why BB is gunna moon",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/nsoves/why_bb_is_gunna_moon/",
        "created": 1622901000.0
    },
    {
        "author": "SavannahSmiles_",
        "created_utc": 1623419561,
        "id": "nxghnm",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": " [Stocks: The great value rotation may be over as investors reembrace tech (cnbc.com)](https://www.cnbc.com/2021/06/11/the-great-value-rotation-in-the-stock-market-could-be-over-already-as-investors-embrace-tech-again.html) \n\n**PUBLISHED FRI, JUN 11 20216:49 AM EDTUPDATED 2 HOURS AGO** \n\n[**Bob Pisani**](https://www.cnbc.com/bob-pisani/)[**@BOBPISANI**](https://twitter.com/BobPisani)\n\nIs the great value rotation over? \n\nThe S&amp;P 500 is at a historic high, but investors who earlier this year overweighted their portfolios into reopening stocks like [Caterpillar](https://www.cnbc.com/quotes/CAT) and banks, and away from tech and other growth stocks, appear to be rethinking that strategy.\n\nMany of the companies associated with the “reopening” trade topped out in April or early May:\n\n### CYCLICAL STOCKS\n\n**CYCLICAL STOCKS** **% OFF 52-WEEK HIGHS** **WHIRLPOOL-14% UNITED RENTALS-14% DEERE-15% CATERPILLAR-8%**\n\n### MATERIALS\n\n**MATERIALS STOCKS** **FROM 52-WEEK HIGHS** **VULCAN MATERIALS-11% CF INDUSTRIES-6% MARTIN MARIETTA-8%**\n\n### HOMEBUILDING AND HOME IMPROVEMENT\n\n**HOMEBUILDING/HOME IMPROVEMENT** **FROM 52-WEEK HIGHS** **MOHAWK-18% LENNAR-18% DR HORTON-18% PULTE-16%**\n\nNow, a final leg of the so-called “value” trade is also cracking this week: banks.\n\n### BANKS DOWN THIS WEEK\n\n**BANKS THIS WEEK** **REGIONS FINANCIAL-down 6% HUNTINGTON BANCSHARES-down 7% ZIONS BANCORPORATION-down 5% KEYCORP-down 5% BANK OF AMERICA-down 4% JPMORGAN-down 3%**\n\nInvestors instead have begun rotating back into old-school growth stocks. \n\nThursday saw new highs in [Cisco](https://www.cnbc.com/quotes/CSCO), [Alphabet](https://www.cnbc.com/quotes/GOOGL) and [IBM](https://www.cnbc.com/quotes/IBM). But perhaps more importantly, formerly deeply out-of-favor speculative growth stocks, many of them associated with Cathie Wood’s ARK funds, have begun to rebound.\n\n### SPECULATIVE TECH\n\n**SPECULATIVE TECH** **SINCE MAY 12** **ZOOM VIDEO-up 15% ROKU-up 11% SHOPIFY-up 11% SPOTIFY-up 8% TELADOC-up 6%**\n\n## The changing market narrative\n\nWhat’s going on?\n\nThe market narrative is changing. The first quarter storyline was that the reopening would be very strong, bond yields would move up, and inflation may be an issue later in the year.\n\nThis was only partially correct. The reopening has been strong, but bond yields have come down, not up, as investors have come to believe 1) that inflation and supply-chain issues may indeed be “transitory,” or temporary, as the Federal Reserve has insisted, and 2) that the second and third quarter is the top in earnings and economic growth.  \n\n“The value trade is unwinding, and the growth bulls are winning,” Alec Young, chief investment officer at Tactical Alpha, told me. “Bond yields are a proxy on the growth outlook,” he added, noting that bond investors see moderating inflation and a slower rate of growth (though still positive) in the second half of the year.\n\nThe result: Investors are staying in the market, but they are rotating into defensives (health care) and growth (technology). Formerly crowded trades like cyclicals and banks that are associated with the “value trade” are now retreating. \n\nWhy would investors rotate into growth stocks if growth is slowing?\n\n“Value is a more economically sensitive sector because value is weighted toward industrials, energy, materials, and small caps,” Young said.  \n\n“Early in the economic cycle, coming out of a recession, there is more earnings leverage from value stocks, so they are a better investment,” he added.\n\n“The problem is that everything has been compressed,” Young said. “We went into a recession really fast, and we came out of it fast, partly due to all the stimulus. Growth stocks now offer more reliable growth and are less subject to the vagaries of the economic cycle.”\n\nIn a recent note to clients, Goldman Sachs’ Ben Snider and David Kostin agreed. “History, valuations, positioning, and economic deceleration indicate that most of the rotation \\[from growth to value\\] is behind us,” they said.\n\nBecause this was a “crowded” (overweight) trade, Goldman suggested that many players are likely caught offsides. “Mutual funds are overweight Value to a larger degree than any time in our eight-year data history,” they said. “Hedge funds remain tilted toward Growth, but that tilt has recently fallen sharply and now ranks as the lowest in over five years.”",
        "subreddit": "StockMarket",
        "title": "The great value rotation in the stock market may already be over as investors embrace tech again",
        "url": "https://www.reddit.com/r/StockMarket/comments/nxghnm/the_great_value_rotation_in_the_stock_market_may/",
        "created": 1623448361.0
    },
    {
        "author": "moneygrabber007",
        "created_utc": 1623081331,
        "id": "nufxy6",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Below is a breakdown of a recent WSJ article about 5G in the US. I added some bullets throughout the article  based on some research.  Even though I disagree with a few of the author's points, I think it's a solid article and helped me understand 5G a bit more. \n\nAt the end, I included some of my own opinions. Hopefully this helps everyone better understand what is going on right now. I have a large position in one of these companies. I have decided to keep it out of this sub, but if you check my post history I am sure you can figure it out. \n\n**The U.S. Is Back in the 5G Game**\n\n*By* Stu Woo*,* May 26, 2021 12:00 pm ET\n\nThe U.S. government has upended the **$35 billion-a-year cellular-equipment industry**, ushering in a new era of competition and giving U.S. companies a shot at re-entering a sector they vacated years ago.\n\n· The $35 billion number they reference here only refers to the US. 2020 estimates the industry in the mid $400 billion range and most projections see this industry growing to the mid $500 billion range by 2023 and mid $700 billion range by 2027. \n\nIn the past five years, only China’s Huawei Technologies Co., Sweden’s Ericsson and Finland’s Nokia Corp. captured more than a 20% share of revenue in the wireless-equipment market, according to Dell’Oro Group, a research firm. **No other competitor consistently cracked even 10%.**\n\n· Huawei: 2020 revenue was $136.7 billion, not publicly traded so no market cap, 180,000+ employees\n\n· Ericsson (ERIC): 2020 revenue of $25.3 billion, market cap of $44.4 billion, valuation of 1.75X, 100K employees\n\n· Nokia (NOK): 2020 revenue of $24.96 billion, market cap of $29.8 billion, valuation of 1.19X, 92k employees\n\nNow that landscape is [changing](https://www.wsj.com/articles/huawei-loses-cellular-gear-market-share-outside-china-11615118400?mod=article_inline). Pushed by Washington’s campaign to cripple Huawei over cybersecurity concerns, **countries representing more than 60% of the world’s cellular-equipment market are considering or have already enacted restrictions against Huawei**, says Dell’Oro Group. And to take advantage of that opening, the U.S. government—as well as governments in the U.K. and European Union—are considering financial support and other measures to boost domestic cellular-equipment makers trying to crack the three incumbents’ stranglehold on the market.\n\nThe result is a newly competitive market that is reminiscent of the 1990s, when bygone industry giants such as Lucent, Motorola, Nortel, Siemens and Alcatel fought for a piece of a growing telecom-equipment pie.\n\n· Lucent merged with Alcatel in 2006 to form Alcatel-Lucent. Nokia absorbed Alcatel-Lucent in 2016. \n\n· Motorola split into Motorola Mobility and Motorola Solutions in 2011. Google acquired Motorola Mobility which, focuses on phones, in 2012 which was then sold to Lenovo in 2015. Motorola Solutions (MSI) 2020 revenue of $7.4 billion, market cap of $35.2 billion, valuation of 4.76X, 18K employees.\n\no MSI appears to focus on smaller, private networks especially in public safety. \n\n· Nortel: Went bankrupt in 2009 and Ericsson purchased most of its telecommunication assets over the next few years. \n\n· Siemens (SIEGY): 2020 revenue of $69.4 billion, market cap of $140.6 billion, valuation of 2.03X, 293k employees (manufactures switchboards and 5G routers)\n\n“It’s got a Wild West feel to it,” says Bill Plummer, a former Nokia and Huawei executive now working at JMA Wireless, a Syracuse, N.Y., 5G company. “We haven’t seen this since probably the eve of the dot-com bust—this dynamic and thriving competitive environment in wireless.”\n\nThat new environment could benefit everyone—other than, of course, Huawei, Ericsson and Nokia. It will give a host of competitors a chance to win business that only a couple of years ago seemed out of reach. And the new competitive fervor should increase innovation and lower costs for wireless carriers, which could pass on savings—and the fruits of those innovations—to customers.\n\nAmerican officials further say the new competitive landscape is crucial to U.S. efforts to counter China’s influence in developing 5G technology, **the next generation of wireless technology that will serve as the building blocks for all sorts of future technologies—whether in robot-run factories, heart-rate monitors, or any number of industries and products. The country that dominates 5G will be well-positioned to lead the technology industry in terms of profits and talent in the years ahead.**\n\n**The 3G days**\n\nAfter a vibrant start to the 3G era in the 2000s, when manufacturers throughout North America, Europe and Asia competed, equipment manufacturers started consolidating amid pressure from Huawei and another Chinese company, ZTE Corp. which were both selling increasingly competitive hardware at lower prices. In 2016, Nokia’s acquisition of Alcatel-Lucent, itself a merger of French and American companies, created today’s three-giant oligopoly.\n\nThe Trump administration began loosening the trio’s grip on the market in 2018 when it started urging allies to blacklist industry leader Huawei over national-security concerns. **The campaign worked: Huawei lost market share outside China to both Ericsson and Nokia last year**, according to Dell’Oro Group, as governments enacted or considered restrictions on Huawei’s equipment.\n\n“The big change over the past couple of years is pressure on Huawei,” says James Barford, a telecom analyst for Enders Analysis. “Even in countries where there is no formal ban, you’re going to be thinking twice” about using equipment from the Chinese company.\n\nThe stranglehold of the big three was further weakened by Nokia’s blunder in procuring expensive chips for its 5G equipment—a mistake that resulted in its equipment costing more upfront, as well as consuming more power. That’s an issue for wireless carriers, which can spend roughly 20% of operating expenses on energy. Nokia says it has since moved to cheaper, power-efficient chips, but damage was done: Some carriers looked elsewhere for supplies.\n\n· This appears to still be up in the air, but Pekka Lundmark, Nokia’s CEO, seemed adamant in an interview after Q1 that chips are no longer an issue for Nokia. We shall see. \n\nWith both Huawei and Nokia under pressure, that left Ericsson as the market leader outside China. But that, in turn, made wireless carriers’ executives wary. They say they want more competition to increase innovation and reduce costs.\n\nThe result has been an opening for a whole new generation of competitors—and the Wild West environment.\n\n**The open gambit**\n\nSome carriers are turning to Samsung Electronics Co. , the South Korean smartphone giant that is a relative newcomer to the wireless-infrastructure industry. It ranked fifth behind the three giants and China’s ZTE in 2020, but won a major victory last year when Verizon Communications Inc. switched suppliers from Nokia to Samsung.\n\n· ZTE: 2020 revenue of $15.86 billion, market cap of $21.84 billion, valuation of 1.38X, 74k employees (traded on Hong Kong and Shenzhen Stock Exchanges)\n\n· Samsung: 2020 revenue of $212 billion, market cap of $500 billion, valuation of 2.36X, 109k or 284K employees (traded on Korean Stock Market)\n\nBut it’s the possibility of buying 5G equipment using open-standards software that has the most potential for roiling the competitive order.\n\nTo understand why, consider that the cellular equipment that transmits signals to phones consists of three parts: the antenna, hardware that sits on a pole directly under the antenna, and more hardware at the pole’s base. **Huawei, Ericsson and Nokia currently sell all three parts in a bundle, and they aren’t interoperable**. For instance, a Huawei antenna doesn’t work with Ericsson electronics under the antenna.\n\nIt would be like buying a Dell laptop that works with only a Dell monitor and Dell printer. And it means customers have limited options on price, quality and features.\n\nEnter a new technology based on open standards, dubbed **Open RAN**, or radio access network. Companies making equipment based on these standards **allow wireless carriers to mix and match the antennas with different under-antenna hardware and centralized electronics**. That gives carriers more options for cost and quality.\n\n· Huawei: Does not believe in the use of Open RAN.\n\n· Ericsson: working on Open RAN, part of the O RAN Alliance.\n\n· Nokia: working on Open RAN, part of the O RAN Alliance.\n\n· ZTE: working on Open RAN, part of the O RAN Alliance.\n\n· Samsung: working on Open RAN, part of the O RAN Alliance.\n\nThe U.S. government is a major backer of the open-software efforts, which officials say could boost both U.S. national security and business. It potentially can help U.S. businesses by creating openings for new players, and because these new efforts rely less on hardware (where the U.S. has fallen behind) and more on software (where companies such as [**Microsoft**](https://www.wsj.com/market-data/quotes/MSFT) **Corp**. and [**International Business Machines**](https://www.wsj.com/market-data/quotes/IBM) **Corp**. can potentially play a role).\n\n· Microsoft: Partnership with Ericsson focuses on the auto industry. Partnership with Nokia focuses on cloud solutions for enterprise. Dealings with Huawei appear to be smartphone based, not 5G. \n\n· IBM: Has partnered with Ericsson in the past, but appears to be working more closely with Nokia and Samsung recently. \n\n“We may be able to increase security, reduce our exposure to any single foreign vendor, lower costs and push the equipment market to where the United States is uniquely skilled—in software,” Federal Communications Commission Acting Chairwoman Jessica Rosenworcel said in March.\n\nIf U.S. companies do indeed become major players in 5G equipment, then they can also play a bigger role in setting global standards for telecom equipment. That’s an arena where China has made great strides. U.S. officials prefer that companies in the U.S. and allied democracies set wireless standards, which they believe would lead to greater, less hackable security.\n\nPresident Biden and Japanese Prime Minister Suga Yoshihide last month agreed that the U.S. and Japan would collaborate to advance open 5G networks “by fostering innovation and by promoting trustworthy vendors and diverse markets,” the White House said. Congress this year enacted a law to establish a Commerce Department fund that would award grants to support the use of such open-standards equipment in the U.S. A bipartisan group of lawmakers backing the bill requested $750 million for the fund in fiscal year 2022.\n\nIn the U.K., a government-appointed task force to help British wireless carriers transition away from Huawei equipment recommended that new equipment makers, or those using open-standards software, represent 25% of the country’s wireless infrastructure by the mid-2020s. The task force recommended government incentives for wireless carriers buying such equipment, and for suppliers to locate research facilities in the U.K. The European Union this year started examining similar options.\n\n**The focus of newcomers**\n\nSeveral smaller U.S. companies—such as [Airspan Networks](https://www.wsj.com/market-data/quotes/AIRO), Altiostar, Mavenir, JMA and Parallel Wireless—are focused on 5G equipment using open software. Ericsson and Nokia are also shifting to using some open-standard software.\n\nThe new challengers have signed deals with some big carriers. [AT&amp;T](https://www.wsj.com/market-data/quotes/T) Inc. is testing open-standards equipment and plans to gradually introduce it, while newcomer wireless-carrier [Dish Network](https://www.wsj.com/market-data/quotes/DISH) Corp. has said its entire network would rely on such infrastructure.\n\n· [Airspan Networks](https://www.wsj.com/market-data/quotes/AIRO) (AIRO): 2020 revenue was $54.7 million, market cap of 11.9 million, valuation of 0.22X, 900 employees\n\n· Altiostar: 2020 revenue was $10-50 million, not publicly traded so no market cap, 359 employees, they are pre IPO and Qualcomm is an investor\n\n· Mavenir (MVNR): 2020 revenue was $462 million, market cap of $1.72 billion, valuation of 3.72X, 4,200employees\n\n· JMA: 2020 revenue was $369 million, not publicly traded so no market cap, 1,000 employees\n\n· Parallel Wireless: 2020 revenue was $75 million , not publicly traded so no market cap, 450 employees\n\n· Dish Network Corp: Rumored to be trying to become the 4th major US network behind Verizon, AT&amp;T, and T-Mobile. Partnered with Nokia on 5G software. Has worked with Ericsson in the past, but has been working closer with Mavenir and Qualcomm lately. \n\n· AT&amp;T: Has 5 year deal with Nokia for 5G services. Also has a deal with Nokia on 5G software. Partners with Ericsson on Private 5G Networks. Appears to be trying to move away from Huawei, but still works with them outside of US. \n\nDell’Oro Group predicts that equipment using open standards, from both newcomers and incumbents transitioning into the new market, **will capture 10% of the market by 2025**.\n\n“The operators say, ‘We need choice, we need a strong ecosystem,’ ” says Thierry Maupilé, a former Motorola and [Cisco Systems](https://www.wsj.com/market-data/quotes/CSCO) Inc. executive who now works at Altiostar, which provides software for open-standards 5G equipment. **“You have a playing field that has been reduced to a few companies.”**\n\nStill, **open-standards equipment remains in its early stages**, and it is too soon to know whether it will be a major player. Wireless carriers say their tests of open-standards equipment show some drawbacks. The new technology can be less energy-efficient than today’s conventional systems. And while the open-standards equipment can be used in rural areas, its performance isn’t yet up to snuff in densely populated urban areas.\n\n**But wireless carriers expect the open-standards equipment to be on par with Huawei, Ericsson and Nokia equipment in three or four years.**\n\n“For us, it is critical to maintain competition in our vendor system,” says Michael Trabbia, chief technology officer at French carrier Orange SA. **“We cannot end up with only two players.”**\n\n· The two players are of course Nokia and Ericsson with Huawei more and more out of the picture with more than 60% of the world’s cellular-equipment market are considering or have already enacted restrictions against them. Similar bans are being placed on ZTE so Nokia and Ericsson should continue to gain market share. This could also help Samsung, but I feel like their focus is elsewhere as a company. \n\n· I’ve kept things fact based up until now and will close with an opinion. Nokia and Ericsson appear to have an establishing duopoly in an industry that the US government has now twice admitted is massively important to the future technological success of all countries. \n\n· So much so that they are looking to spend money to try to help US based competitors of Nokia and Ericsson. The new competitors this article mentions are all small and well behind what the tech giants provide. Even with US funding they are not too worrisome. Mavenir seems like the most legitimate threat, but they already have a valuation multiple higher than Nokia and Ericsson. I don’t really see a fund of $750 million dollars split across 5 companies making much of a difference at the end of the day either. \n\n· Open RAN may be the future, but that is long ways away. This article suggests that a move to Open RAN in the US will hurt Nokia and Ericsson and help the smaller guys. I do not believe that will be the case. The tech giants will stay ahead of the smaller guys the same way they have done with hardware. And even if they do not the article states that it should make up only 10% of the market by 2021.",
        "subreddit": "investing",
        "title": "Investing in 5G: A Breakdown of a Recent WSJ Article and Why I think Nokia and Ericsson Have a Legitimate Duopoly Emerging in a Growing Industry",
        "url": "https://www.reddit.com/r/investing/comments/nufxy6/investing_in_5g_a_breakdown_of_a_recent_wsj/",
        "created": 1623110131.0
    },
    {
        "author": "Original-Setting-266",
        "created_utc": 1623430314,
        "id": "nxkl5i",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Finally in $PLTR Palantir. Aside from the company's name is coming from  Lord of the Rings aka the \"seeing-stones,\" described as indestructible balls of crystal used for communication and to see events in other parts of the world, the CEO Alex Karp’s interviews keep me more and more interested.\n\nThis is the dip to buy in my opinion. My position as of today 300 @ 24.1\n\nWith contracts with the US and UK in military intelligence police heathcare and others with IBM, Amazon etc, I’m intending to ride this to not just the moon but to Mars.\n\nShort term I see this going to $27 and attempting to break/ hold that key level. It is already showing the golden cross formation of crossing moving averages. In the long run this play does not have a roof, it will easily get back to all time highs of $45 and from there contract announcement after aannouncement will take it even further. My own PT is $80 min.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/8a13r1n32o471.png?width=602&amp;format=png&amp;auto=webp&amp;s=f1e1392816cfe35b430a950d01322d7736b7dad1\n\nAscending wedge – higher low and holding a consistent high\n\nhttps://preview.redd.it/qhjziwd42o471.png?width=602&amp;format=png&amp;auto=webp&amp;s=062ecc7c25cc0c3e6e5fdad294f153bb71bdc6ad\n\nThe breakout is coming! Get your boat loaded!\n\n300 @ 24.1",
        "subreddit": "wallstreetbets",
        "title": "$PLTR Palantir we going to the moon. Here’s why I loaded the boat today. BREAK OUT COMING!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nxkl5i/pltr_palantir_we_going_to_the_moon_heres_why_i/",
        "created": 1623459114.0
    },
    {
        "author": "LenKruse4R",
        "created_utc": 1623093371,
        "id": "nukvmx",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "(CSE:DIGI), (OTC: DBKSF)\n\nWith Digicyrypts recently officially rebranding itself to DigiMax recently I thought it would be a great time to share some DD and overall a brief summary of what these guys are doing and why I like them so much. So without further ado...\n\nDigimax is a Canadian company that focuses on AI and predictive tech. They have got a great team behind them and have several different services that they offer using this advanced technology. These services stretch into several sectors like financial, HR, crypto, and logistics, and all use a similar, constantly improving AI engine. Personally, I'll never get over just how cool AI as a concept is, what once seemed to be the stuff of sci-fi films is now very much so a reality. This engine is extremely effective at completing different types of analysis and predicting trends without the need for human influence or intervention.\n\nTheir first service I want to highlight is DataNavee. This is an engine for commercial business use and helps analyze trends in several factors associated with running a large or small business. These factors and indicators include sales, revenues, and supply chain quantities, all figures that are key to running a smooth business. DataNavee takes companies existing figures and extrapolates and interprets them allowing business owners to choose the best course of action based on the AI's highly advanced projections.\n\nFor anyone who is a big fan of crypto investments, they have their Crypto tracking and predicting service known as CryptoHawk. Once again using an advanced AI, it is able to track the prices and trends of Bitcoin and Etherium and make projections about future fluctuations. This service, in particular, is getting a huge improvement in the near future as Digimax brought on Delphi Anlaytics' crypto division to improve the accuracy of analysis and add other cryptocurrencies. This service generates SAAS revenue and has seen some impressive demand. In the same vein as crypto, they also look to open their own crypto fund which will be supported by their acquisitions of Kirobo and Barberton Fund this year.\n\nI am super impressed with the different revenue streams DigiMax and I still haven't even mentioned Darwin Ecosystem, a system that uses a projected personality interpreter to make hiring decisions. This particular project was made with IBM Watson and is currently used by 17 law enforcement agencies.\n\nWith the upcoming summer launch of their Crypto fund along with advancements in their other projects, DigiMax is looking to take the tech world by storm and offer industry-topping services. While this may be a big vision for a company with a $0.17 stock price, I definitely think it's within the realm of what's possible and for that reason, they are on my list!\n\nDisclaimer: DO YOUR OWN RESEARCH, this ain't investment advice!",
        "subreddit": "pennystocks",
        "title": "Digimax Solutions is killing it with AI",
        "url": "https://www.reddit.com/r/pennystocks/comments/nukvmx/digimax_solutions_is_killing_it_with_ai/",
        "created": 1623122171.0
    },
    {
        "author": "saintczr",
        "created_utc": 1622684087,
        "id": "nr1rx6",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "IBM",
        "subreddit": "wallstreetbets",
        "title": "Hear me out",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nr1rx6/hear_me_out/",
        "created": 1622712887.0
    },
    {
        "author": "AlmightySouza",
        "created_utc": 1622580152,
        "id": "nq42gk",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "mCloud Technologies (Ticker: MCLDF) is a 10 bagger in the making. mCloud has identified a niche opportunity to optimize energy assets for all businesses to contribute to higher ESG scores and overall energy savings. Bank of America (TICKER: BAC) **HAS ALL 3,300 of their branches connected to their software and SAVED roughly $40,000,000 through improved efficiencies (5). The savings they generated EXCEEDED the amount paid for the subscription.** \n\nQuick facts:\n\n*  WILL BE CASH FLOW POSITIVE by mid Q3 2021.\n* Quick Ratio well over 1\n* Price-to-Sales below 2\n* Gross Margins of 61%\n* SaaS company with 273% Net Dollar Retention and ZERO attrition currently serving an untapped market (Unbelievable)\n* Currently have 60,000 subscribers (Connect assets) which include blue-chip customers like McDonalds (Ticker: MCD), Planet Fitness (Ticker: PLNT), Starbucks (Ticker: SBUX), Telus (Ticker: T.TO) , Longyuen (Largest wind farm in China), etc (AND GROWING).\n* Comparables: Aspen Technologies (Ticker: AZPN), Honeywell (Ticker: HON), C3AI (Ticker: AI).\n* Stock price is down because COVID-19 restricted them from going to clients and connecting them. HUGE tailwinds as resections lift. \n* Five days ago (May 27th, 2021) Jack Vander Aarde from Maxim Group reiterated a \"BUY\" rating with a **price target of $5 (242% upside).** His recommendations have generated a 110% return while being a tracked analyst on TD Ameritrade with a success rate of 74%, ranking 13th out of 7,533 tracked analysts... No fluff here just facts.\n\nThe first component of the *AssetCareTM* foundation (Their SaaS product) is the IoT sensors that are attached to client’s assets (HVAC Systems, Wind Turbines, Electrical Transformers, Nuclear Power Plants, Heat Exchangers, etc.). The same way IoT sensors in an Apple Watch track the distance and speed you've ran or your sleeping patterns and heartbeat, mCloud's IoT sensors track real time asset data in buildings, oil and gas facilities, and wind farms. Some examples of the data points tracked are Kilowatt/hour usage (HVAC), outdoor temperature (HVAC), heating and cooling effectiveness (HVAC), system run-times (HVAC), heat transfer and viscosity (Oil and Gas), control systems (Oil and Gas), blade speed (Wind), etc. All of the respective information is collected, combined, and stored in the cloud where analytics are applied and correlations are made to directly decrease operating costs and provide better insight on the assets overall health (As oppose to traditional \"straight-line\" deprecation methods). These sensors years ago were very expensive and could not feasibly be used in providing a price-conscience product to consumers. With new advances in technology, the price of these sensors have dropped dramatically and the accuracy of the data they can accumulate has improved significantly. \n\nThe next foundational piece to their product is the cloud. In the 20th century companies had hardware that took up the size of entire rooms to store a fraction of data/information that can be stored today in a victual cloud. Now in the 21st century, big cloud providers such as Microsoft, Google, Amazon, and IBM viciously compete for customers, driving the price of storage down exponentially. With mCloud sensors tracking data 24/7/365, they now have a place to store and analyze it cheaply for its current 60,000 connected assets (and growing). The amount of storage needed for this *AssetCareTM* product was non-existent years ago and not available at a viable cost.\n\nLastly, with the cloud able to store all the data generated 24/7/365, data and analytics can now viably be applied to the entire data set. Traditionally in the late 20th century and early 21st century, organizations were only able to take a sample of the data available and come up with limited conclusions. Now with a place to store all data, companies like mCloud can provide an extremely more accurate analysis on the performance and health of any asset by identifying immensely more accurate anomalies and trends.\n\n**Summary**\n\nmCloud is unlocking the untapped potential of energy intensive assets with AI and analytics, curbing energy waste, maximizing energy production, and getting the most out of critical energy infrastructure. Through mCloud's AI-powered AssetCare™ platform, mCloud offers complete asset management solutions for commercial buildings, renewable energy, healthcare, heavy industry, and connected workers. IoT sensors bring data from connected assets into the cloud, where AI and analytics are applied to maximize their performance.",
        "subreddit": "wallstreetbets",
        "title": "C3AI’S ONLY COMPETITOR IS A 10 BAGGER.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nq42gk/c3ais_only_competitor_is_a_10_bagger/",
        "created": 1622608952.0
    },
    {
        "author": "saintczr",
        "created_utc": 1622684248,
        "id": "nr1tq2",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Just hear me out...\nThere’s a forgotten lemon \nDecaying\nBut it’s still got some juice \nIBM \nTime to make lemonade",
        "subreddit": "wallstreetbets",
        "title": "Listen",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nr1tq2/listen/",
        "created": 1622713048.0
    },
    {
        "author": "Fit-Woodpecker-9308",
        "created_utc": 1622718492,
        "id": "nraswv",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Brainchip Holdings (ASX: BRN) - artificial intelligence - years ahead of IBM and the like - huge potential - who is buying?? YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nraswv/brainchip_holdings_asx_brn_artificial/",
        "created": 1622747292.0
    },
    {
        "author": "NewspaperWrong809",
        "created_utc": 1623119999,
        "id": "nuuct3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Glad I loaded up. It won't take long for Hedera Hashgraph along with XRP to get to $1, $2, $3 etc esp with the CEOs of LG, IBM, Boeing, T Mobile and others with partnerships on the governance board with Hbar and Bank of America, RBC and 20 plus central banks with Ripple and XRP.  XRP, XLM, Vechain, Holochain and Hbar are the future. Liquidity, Supply Chain security,  decentralized payments and speed will mean everything very soon. Bit coin is old dated technology. These utility tokens are fast and scalable with real interoperability.  It's a ploy to get you to look this way while the bigger picture is happening somewhere else.  The media doesn't want you to know about the rest at this time. They get paid to kiss Wall Street's ass and b hole like a bear eating honey.",
        "subreddit": "wallstreetbets",
        "title": "Anyone got any X R P, V E T, H O T, H BAR or X LM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nuuct3/anyone_got_any_x_r_p_v_e_t_h_o_t_h_bar_or_x_lm/",
        "created": 1623148799.0
    },
    {
        "author": "SavannahSmiles_",
        "created_utc": 1623250440,
        "id": "nvxtjx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " [https://finance.yahoo.com/news/globalfoundries-says-ibm-demanding-2-205559991.html](https://finance.yahoo.com/news/globalfoundries-says-ibm-demanding-2-205559991.html)\n\n**Patricia Hurtado and Jackie DavalosMon, June 7, 2021, 3:00 PM**\n\n* [**IBM+0.93%**](https://finance.yahoo.com/quote/IBM?p=IBM)\n\n(Bloomberg) -- GlobalFoundries Inc. asked a judge to rule that it doesn’t owe $2.5 billion to International Business Machines Corp. over a 2014 deal in which the semi-conductor maker agreed to take an unprofitable chip-manufacturing unit off IBM’s hands.\n\nIn a complaint filed Monday in New York Supreme Court, GlobalFoundries is seeking a declaratory judgment that it didn’t breach the agreement and said IBM is threatening to sue. The suit comes as GlobalFoundries works with banks on an initial public offering that could value the chipmaker at about $30 billion.\n\n“This action arises out of what seems to be a misguided and ill-conceived effort by IBM’s law department to try to extract an outlandish payment,” GlobalFoundries said its complaint.\n\nIBM agreed in 2014 to pay GlobalFoundries $1.5 billion for GlobalFoundries to acquire the unit. As part of the deal, GlobalFoundries became IBM’s exclusive provider of certain power processors for the next 10 years, in exchange for access to IBM’s intellectual property. GlobalFoundries acquired manufacturing facilities in East Fishkill, New York, and Essex Junction, Vermont.\n\nGlobalFoundries is backed by Abu Dhabi sovereign fund Mubadala Investment Co. The chipmaker is coming to market as numerous industries complain they can’t get enough semiconductor supply and governments across the globe gear up to provide financial support for expansions in production.\n\nA call and email to IBM wasn’t immediately returned.\n\n‘Highly Suspect’\n\nIn its lawsuit, GlobalFoundries said IBM’s request for damages is “highly suspect” as it follows news of the potential IPO. GlobalFoundries also said that IBM “has yet to provide any substantive explanation” to its claims over the alleged breach.\n\nGlobalFoundries said in its lawsuit that it invested billions of dollars to develop cutting-edge chip-making technology, but that it decided not to pursue IBM’s “failing strategy” and notified IBM in 2018.\n\nAccording to the filing, development of the chip-technology was more challenging and expensive than initially anticipated, causing delays in the project’s targeted milestones. GlobalFoundries says it spent more money to catch up but still fell behind competitors including Samsung Electronics Co. and Taiwan Semiconductor Manufacturing Co. It also alleges IBM was “well aware” of delays and the switch to Samsung was beneficial for the company as it was cheaper and faster than GlobalFoundries would have been able deliver.\n\nIBM didn’t complain about GlobalFoundries’ actions until news of its potential IPO broke, and it now seeks “a quick payday,” GlobalFoundries alleges.\n\nThe case is GlobalFoundries v. IBM, New York Supreme Court, New York County.\n\n(Updates with details of complaint)\n\nMore stories like this are available on [bloomberg.com](https://www.bloomberg.com/)\n\n[Subscribe now](https://www.bloomberg.com/subscriptions/67obqkd5zdp5lj8/?utm_source=yahoo_usn) to stay ahead with the most trusted business news source.\n\n©2021 Bloomberg L.P.",
        "subreddit": "StockMarket",
        "title": "GlobalFoundries Says IBM Demanding $2.5 Billion as IPO Nears",
        "url": "https://www.reddit.com/r/StockMarket/comments/nvxtjx/globalfoundries_says_ibm_demanding_25_billion_as/",
        "created": 1623279240.0
    },
    {
        "author": "Dreamonsir",
        "created_utc": 1622557660,
        "id": "npva7i",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Wassup shitheads,\n\nThis isn't financial advice or investing advice at all.\n\nIt's time to grab some freeze-dried bananas cause we are about to go to the fucking moon and you can't have conventional bananas up there.\n\nSoFi is an all-in-one digital banking app. What started as a student loan financer has developed quickly into a one-stop-shop for your financial needs. Want to invest in stocks? SoFi's app allows you to do that. Need a personal loan because you YOLO'd your life savings and just got margin called? Okay, you degenerate. SoFi's got you covered. Debit Cards? Credit Cards? Yep. Yep. \n\nOkay so now that we got through what the app is, let's get into the nitty-gritty of their performance.\n\n**The Good**\n\nNet Revenue saw 151% YoY growth\n\nMember growth is seeing it's 7th consecutive quarters of accelerating YoY Growth. \nCurrently, they are at 2.2 Million users **with a 110% YoY growth**\n\nTotal Products saw a **121% YoY growth, their financial service products saw a 273% YoY growth.**\n\nIf you're too smooth-brained to understand so far, they are gaining a shit ton of people and those people are using their products and printing their money. \n\nGalileo Accounts saw a **130% YoY growth**\nWhat are Galileo accounts? I'm so fucking happy you asked you beautiful smooth brain\n\nSoFi acquired Galileo, which is a really fucking nerdy SaaS that handles transactions. They handle direct deposits, transfers, bill paying, checking balances, etc. \nMeaning not only is SoFi acting as a fintech for consumers, but they are also a SaaS for businesses. Fuck Robinhood, but they are one of Galileo's customers. \n\nThey are EBITDA positive!?\n\n**The Leadership Team**\nI would be remiss to not mention the leadership team.\nCEO - Anthony \"motherfuckin\" Noto\nA quick breakdown of that guys life.\nGoldman Sachs associate turned partner because of his understanding of the internet industry.\nInterim CFO of the NFL.\nCOO of Twitter.\nCEO of SoFi.\nThink about it, the COO of twitter is now the CEO of a fintech that has the EXACT SAME DEMOGRAPHICS AS TWITTER.\nTHIS GUY FUCKS.\n\nChief Marketing Officer - Lauren Webb\nPreviously the Marketing VP at Intuit - Intuit owns TurboTax, Mint, and Quickbooks \nBefore that she was the Senior Brand Manager for COVERGIRL\n\nHead of Brand Strategy previously worked at a brand strategy firm, where he was the lead brand strategist for taco bell and PlayStation.\n\n**Previous Valuations**\n2015 - 1B Valuation from Softbank\n2019 - 4.6B Valuation from Qatar Investments\n2021 - 8.6B Valuation from Social Capital. Yes, I know about Chammath and we will talk about that.\n\n**The Bad**\nWith every bull there is as bear that wants to take your lunch money. In this case, there are actually a bunch of bears.\n\nThere are currently no short shares available because of how much this stock is shorted. It's fucking nuts so proceed with extreme caution. I'm not stupid though so I am not going to tell you a short squeeze, even though last Friday there was a 260% short interest rate. There won't be a short squeeze tho cause dilution and all that shit.\n\nChamath - Look I hate this guy as much as the next but think about it. CLOV was a company that needed to go public through a SPAC. I honestly think that SoFi didn't need to go through a SPAC. and honestly SPCE is cool but this is the only actual investment worth investing in with Chamath's portfolio. Again this is not investing advice.\n\nTL;DR\nThe short bus is leaving, get in while you can. SoFi is legit\nPositions \n34 Shares\n20c 6/4\n22.5 c 7/16\n20c 1/21/22",
        "subreddit": "wallstreetbets",
        "title": "Get your money right",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/npva7i/get_your_money_right/",
        "created": 1622586460.0
    },
    {
        "author": "Dreamonsir",
        "created_utc": 1622557660,
        "id": "npva7i",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Wassup shitheads,\n\nThis isn't financial advice or investing advice at all.\n\nIt's time to grab some freeze-dried bananas cause we are about to go to the fucking moon and you can't have conventional bananas up there.\n\nSoFi is an all-in-one digital banking app. What started as a student loan financer has developed quickly into a one-stop-shop for your financial needs. Want to invest in stocks? SoFi's app allows you to do that. Need a personal loan because you YOLO'd your life savings and just got margin called? Okay, you degenerate. SoFi's got you covered. Debit Cards? Credit Cards? Yep. Yep. \n\nOkay so now that we got through what the app is, let's get into the nitty-gritty of their performance.\n\n**The Good**\n\nNet Revenue saw 151% YoY growth\n\nMember growth is seeing it's 7th consecutive quarters of accelerating YoY Growth. \nCurrently, they are at 2.2 Million users **with a 110% YoY growth**\n\nTotal Products saw a **121% YoY growth, their financial service products saw a 273% YoY growth.**\n\nIf you're too smooth-brained to understand so far, they are gaining a shit ton of people and those people are using their products and printing their money. \n\nGalileo Accounts saw a **130% YoY growth**\nWhat are Galileo accounts? I'm so fucking happy you asked you beautiful smooth brain\n\nSoFi acquired Galileo, which is a really fucking nerdy SaaS that handles transactions. They handle direct deposits, transfers, bill paying, checking balances, etc. \nMeaning not only is SoFi acting as a fintech for consumers, but they are also a SaaS for businesses. Fuck Robinhood, but they are one of Galileo's customers. \n\nThey are EBITDA positive!?\n\n**The Leadership Team**\nI would be remiss to not mention the leadership team.\nCEO - Anthony \"motherfuckin\" Noto\nA quick breakdown of that guys life.\nGoldman Sachs associate turned partner because of his understanding of the internet industry.\nInterim CFO of the NFL.\nCOO of Twitter.\nCEO of SoFi.\nThink about it, the COO of twitter is now the CEO of a fintech that has the EXACT SAME DEMOGRAPHICS AS TWITTER.\nTHIS GUY FUCKS.\n\nChief Marketing Officer - Lauren Webb\nPreviously the Marketing VP at Intuit - Intuit owns TurboTax, Mint, and Quickbooks \nBefore that she was the Senior Brand Manager for COVERGIRL\n\nHead of Brand Strategy previously worked at a brand strategy firm, where he was the lead brand strategist for taco bell and PlayStation.\n\n**Previous Valuations**\n2015 - 1B Valuation from Softbank\n2019 - 4.6B Valuation from Qatar Investments\n2021 - 8.6B Valuation from Social Capital. Yes, I know about Chammath and we will talk about that.\n\n**The Bad**\nWith every bull there is as bear that wants to take your lunch money. In this case, there are actually a bunch of bears.\n\nThere are currently no short shares available because of how much this stock is shorted. It's fucking nuts so proceed with extreme caution. I'm not stupid though so I am not going to tell you a short squeeze, even though last Friday there was a 260% short interest rate. There won't be a short squeeze tho cause dilution and all that shit.\n\nChamath - Look I hate this guy as much as the next but think about it. CLOV was a company that needed to go public through a SPAC. I honestly think that SoFi didn't need to go through a SPAC. and honestly SPCE is cool but this is the only actual investment worth investing in with Chamath's portfolio. Again this is not investing advice.\n\nTL;DR\nThe short bus is leaving, get in while you can. SoFi is legit\nPositions \n34 Shares\n20c 6/4\n22.5 c 7/16\n20c 1/21/22",
        "subreddit": "wallstreetbets",
        "title": "Get your money right",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/npva7i/get_your_money_right/",
        "created": 1622586460.0
    }
]