[
    {
        "author": "FinancialWhoas",
        "created_utc": 1637170268,
        "id": "qw4dbk",
        "num_comments": 149,
        "num_crossposts": 0,
        "selftext": "TLDR:  I did a bunch of math based on some reasonably good ideas to determine a  selection of stocks worth investing in. Tables of stocks found below.  My diamond hands are so rough on my fleshy...forearms. I can't type anymore.\n\n# Observations/Assumptions\n\nBefore  you jump down my throat, these are simplified observations/assumptions,  not internationally agreed upon mandates from heaven. Okay, now you can  jump down my throat.\n\n* Companies  with strong financials, a competitive advantage, good management, a  sustainable business model, etc. tend to do better than companies  missing one or more of those attributes.\n* For most people it is impossible to time the market\n* Stock prices have all available information priced into them.\n* The markets are relatively efficient over the long-term.\n* [Index funds have been shown to be the most successful stock investing instrument for most people](https://freakonomics.com/podcast/stupidest-money/)\n* [Index  fund returns, such as the S&amp;P 500, are now predominately determined  by a handful of extremely large, mostly tech stocks.](https://www.investopedia.com/top-10-s-and-p-500-stocks-by-index-weight-4843111)\n* [Most funds do not beat the index over a long period](https://finance.yahoo.com/news/dont-pay-investment-adviser-beat-144400899.html).\n* The cost of stock trades at most firms is now $0.00 (yes, simplified)\n* During times of volatility, companies that had poor financials will likely find it challenging to survive.\n* [Zombie companies](https://finance.yahoo.com/news/zombie-companies-hiding-uncomfortable-truth-183246812.html) are able to survive for longer periods during times of extremely cheap debt.\n* Index funds have these 3 issues that are hard to get around:\n   * You are unable to effectively [Tax-Loss Harvest](https://www.investopedia.com/articles/taxes/08/tax-loss-harvesting.asp)  even though many of the holdings that make up the index would have had  losses, thereby reducing the return compared to directly investing in  that same set of stocks in the same proportions.\n   * You have no control over the holdings within the fund and may be supporting things you don’t want to support.\n   * Due  to the way the index works, any large stock that becomes part of the  index is potentially a huge drag on the index. This happened when Tesla  was going to be added on 12/21/2020, which was announced on 11/16/2020,  forcing funds to buy the stock at the same time driving up the price,  which had already been driven up by people buying the stock knowing it  was then going to get added to the index forcing more people to buy the  stock. If you think it sounds kind of circular, that’s because it is.\n\n# Hypothesis\n\nUsing  industry benchmarking against the best of the best of the best  companies in each industry in order to purchase only the best companies  in equal measure should provide a well-diversified portfolio that over  the long term should be able to beat the S&amp;P 500.\n\n# Experiment 2020\n\n750  largest US stocks were analyzed against their peers in their industry  (Industry details available further down the post). Stocks were given a  score based on their relative percentage compared to the industry index.  For example, each companies’ average ROE of the last 4 years was  compared to this index value with the following type of breakdown:\n\n* ROE &lt; Index ROE = Poor = 1\n* ROE &gt; Index ROE = Moderate = 2\n* ROE &gt; 150% of Index ROE = Great = 3\n\nFor  example, the ROE communication services industry index value used was  10.10%. If a communication services company had a ROE average of 9%,  they would receive a poor rating. If they had a ROE of 10.5% they would  receive a moderate rating. If they had a ROE of 25% they would receive a  great rating.\n\nThis was done for all of the metrics below:\n\n* ROE\n* Revenue Growth %\n* EBITDA %\n* FCF %\n\nThe  relative scores used for each of the metrics was tweaked until there  was a good distribution of results. e.g., if the 150% revenue growth  only found 5 companies with a Great rating, that may need to be  decreased to 125% for a better distribution.\n\nAny stock that received a poor in any of the 4 metrics was eliminated.\n\n[ROE Example](https://preview.redd.it/t7l27u9tu6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=f904309edb170cc8679189ea62f7bbe057646a3d)\n\nROE Example\n\nThat left 53 stocks. EBITDA was then analyzed to see if it was declining, and if so, it too was eliminated.\n\nThis  left 45 stocks. These 45 were reviewed more thoroughly. What did the  company do? What were their competitive advantages? Are they currently  in any lawsuits? Does their debt look out of control? Do I see them  being a long-term sustainable choice? Is their IP about to expire? Has  WSB said it's a buy? Essentially boiling down to: Is there any reason  that I want to exclude them?\n\nThat left 26 across 7 sectors.\n\n[Industries 2020 Experiment Breakdown](https://preview.redd.it/3gurx91wu6081.png?width=366&amp;format=png&amp;auto=webp&amp;s=0e37aa1afdb655721fc83dff4e75867923e48cc1)\n\n**2020 Industry Breakdown**\n\nThese  26 stocks were bought in equal amounts in July 2020, August 2020, and  September 2020. To easily perform time weighted analysis of these stocks  and determine if there was an opportunity cost, 10% of the total  purchase each period was also allocated to VFIAX.\n\n2020 Experiment Results July, August, and September 2020 purchases to 11/16/2021\n\n* **S&amp;P 500** total return reinvested dividends: **49.09%**\n* **My 26 Stock Index** including reinvested dividends: **61.53%**\n\nCan we do it again this year? Should we go bigger? Yes.\n\n# Experiment 2021\n\n2,850  tickers of the largest US stocks were identified as the initial list.  The stocks had their last 5 years averaged for each of nine metrics:\n\n* Revenue Growth % - shows growth rate of the company\n* Profit Margin – shows how effective the business is at making money\n* Operating Margin – shows how much money the company earns on its revenue\n* FCF Margin – shows how efficient a company is with their cash\n* EBITDA Margin – shows a companies’ operating profitability\n* ROE – shows how well management balances profits, leverage, and assets to make money\n* ROA – shows how effectively a company utilizes its assets to generate profits\n* ROIC – shows how effective the company is at using its money to generate returns\n* Debt/Equity Ratio – shows the financial stability of a company\n\nMore  metrics were used due to the increased data set. These stocks were then  grouped by industry, and the average of the averages is taken to  determine the industry average for the last 5 years; I switched to  median based on a few outliers really throwing the average for some of  the metrics. If that was confusing, here is an example:\n\n·  3 stocks that make up an industry averaged -10%, 15%, and 20% ROE over  the last 5 years. The median over the last 5 years for that industry is  then 15% and all 3 of those stocks will be compared to that benchmark.\n\nEach  stock was compared against its Industry benchmark for each of the  metrics and given a score 1=Poor, 2=Good, 3=Great as well as a composite  score out of 27, from 9 metrics with a max score of 3 in each of the  metrics. The scores are based on how much better they are then the  average. I measured them against the benchmark using the same  methodology as previously performed: Poor &lt; 100%, Good &lt; 150%,  Great &gt; 150%. Again, these may be tweaked slightly depending on the  particular metric to find a useful distribution.\n\nI  also ranked every stock against the entire list for each of the metrics  and overall. For those wondering, the best stock in this ranking was  CORT with a score of 2,097 and the worst TICKER THAT SHALL NOT BE NAMED (evidently a stock that cannot be named because I was banned the first time I posted this) with a score of  23,095. Because the overall rank is a combination of 9 categories with  values ranging from 1-2791, the theoretical best a company could do  would be 9 and the theoretical worst a company could do would be 25,119.  Anyone wondering why the number of stocks doesn’t match the original  input (congratulations on your reading comprehension), this is primarily  due to mergers/acquisitions or the stock being taken private. Another  stock was acquired during the analysis, changing the max number yet  again.\n\nHere is an example showing Aerospace &amp; Defense scoring:\n\n[Aerospace &amp; Defense scoring](https://preview.redd.it/5r8i1qb0v6081.png?width=615&amp;format=png&amp;auto=webp&amp;s=947be14d943204b8211c0933e9c1f1a41d4a1986)\n\nHere is an example showing growth scoring (the Revenue Growth column is the company’s most recent year):\n\n[Growth Scoring](https://preview.redd.it/a2nq8c1av6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=c1f79a62b587bf6f1530f5beefda1b174b5d7d43)\n\nHere is an example of the visualizations for the data:\n\n[Data Visualization Example](https://preview.redd.it/5d41vcvdv6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=26567d730e1d668ccef856a18497fab38345577b)\n\nI  applied a series of filters to eliminated unwanted noise. I looked at  the top 5 stocks per industry (extending out for any ties), any stock  that scored a 25, 26, or 27 on the composite, or any stock that had a  high enough overall rank to justify being reviewed.\n\nNext,  I read the description of \\~300 stocks and looked through their  financials for any inconsistencies, such as one huge year throwing off  their average, profit margins higher than operating margins, highly  leveraged companies with poor growth, etc. My favorite find was that  Chemed Corporation provides hospice/palliative care and owns  Roto-Rooter. Yes, I did end up keeping them (how could you not?), no  there are not great synergies between the sectors of the business, yes,  they are aware of this. I also eliminated industries I wasn’t interested  in reviewing, such as REITS due to the need to look at different  metrics like FFO, Oil and Gas because it’s oil and gas, etc. These  activities eliminated \\~150. I would like to get back to REITs, but I’d  need to build a separate model.\n\nI  then looked at each stock in more detail compared to its peers that made  the cut. Are all the rest of them in the double digits for growth, are  the profit margins substantially less, which one is in a better debt  situation, did WSB say it's a buy, etc. Who deserves to be on this list?  This eliminated \\~75.\n\nWe were down  to 84 stocks at this point. I then looked at each company's investor  presentation, annual report, etc. to better understand what the company  does, their revenue model, risks, etc. I was not nearly as thorough on  this portion this year compared to last year just due to the substantial  increase in companies, 26 vs 84. My hourly wage at McDonald was going  to be better than my returns from the analysis if I took too long. I  only eliminated 1 company which left us at the grand total of 83  companies across 31 industries. Breakdown below:\n\n[Industry Breakdown](https://preview.redd.it/0bmcwyuiv6081.png?width=390&amp;format=png&amp;auto=webp&amp;s=0df395664265ef942ff736c889108711216e76ed)\n\nI then purchased all of these in equal proportion in April, May, and July of 2021.\n\n2021 Experiment Results April, May, and July 2021 purchases to 11/16/2021:\n\n* **S&amp;P 500** total return including reinvested dividends: **11.93%**\n* **My 2021 Stock Index** including reinvested dividends: **14.26%**\n\n# Industry Classification\n\n* For Experiment 2020, the Sector was used to determine how companies should be compared.\n   * This is made up of 11 sectors such as Information Technology, Communication Services, Utilities, etc.\n   * This  seemed to be too restrictive and compared companies against each other  that aren’t really accurate comparisons. See the example on ROE below.\n* For Experiment 2021 I used the Microsoft Excel Stock function to pull industries for all the stocks.\n   * This looks like it pulls data mostly from Industry and Sub-industry.\n   * This was successful on 98% of the stocks and for the final 2% I manually classified based on the taxonomy in the [Global Industry Classification Standard](https://en.wikipedia.org/wiki/Global_Industry_Classification_Standard).\n   * I  ended up needing to collapse the structure a little further. Originally  there were 55 classes with many of the classes having less than 10  stocks. I was able to collapse this to 44 classes. This will likely be  tweaked a little further next year as I had mathematical issues dealing  with averages/medians that were negative. There were also just too many  categories with similar enough results that they could be combined such  as biotech and pharmaceutical.\n\n# 2020 Stocks\n\nABMD\n\nADBE\n\nANET\n\nBWXT\n\nCRL\n\nDG\n\nENR\n\nETSY\n\nEXEL\n\nICLR\n\nISRG\n\nKLAC\n\nLKQ\n\nLRCX\n\nMNST\n\nMPWR\n\nMTCH\n\nOLED\n\nPAYC\n\nPHM\n\nTER\n\nTTD\n\nUI\n\nVEEV\n\nVMW\n\nVRTX\n\n# 2021 Stocks\n\nAAON\n\nAAPL\n\nACN\n\nADBE\n\nAEIS\n\nALGN\n\nAMAT\n\nANET\n\nAPH\n\nATR\n\nATVI\n\nAX\n\nBLD\n\nCDNS\n\nCGNX\n\nCHD\n\nCHE\n\nCORT\n\nCPRT\n\nDLB\n\nDORM\n\nEPAM\n\nESNT\n\nETSY\n\nEW\n\nEXPD\n\nEXPO\n\nFAST\n\nFB\n\nFIX\n\nFOXF\n\nFTNT\n\nGGG\n\nGOOG\n\nGRMN\n\nHEI.A\n\nHELE\n\nIDA\n\nINS\n\nINTC\n\nINTU\n\nIRBT\n\nISRG\n\nCCSI\n\nZD\n\nKLAC\n\nLRCX\n\nLULU\n\nMASI\n\nMED\n\nMKSI\n\nMKTX\n\nMNST\n\nMORN\n\nMPWR\n\nMSFT\n\nNMIH\n\nNRC\n\nNVDA\n\nODFL\n\nOLED\n\nOLLI\n\nPAYC\n\nPAYX\n\nPRLB\n\nQLYS\n\nREGN\n\nRMR\n\nROAD\n\nSCCO\n\nSFBS\n\nSLP\n\nSTMP\n\nTDY\n\nTER\n\nTREX\n\nTROW\n\nTTD\n\nTYL\n\nUI\n\nV\n\nVEEV\n\nVRTX\n\nWAL\n\nYETI\n\n# Notes\n\nI  partnered up for both the 2020 and 2021 experiments. This was critical  for both expanding my initial idea, brainstorming methods to build the  model, and reviewing the work done for errors. This was a team effort,  and I by no means deserve all the credit or hate.\n\nAll returns are showing reinvested dividends in the total return.\n\n\\*I  am not a financial advisor or anything else I should put here to ensure  it is clear that I did this for myself and am sharing my results and am  in no way forcing you to push buttons to buy things you don’t  understand or requiring justification for this run on sentence and  henceforth.\n\n\\*\\*\\*\\*. Past results are no guarantee of future returns.",
        "subreddit": "wallstreetbets",
        "title": "One Word For You: I Bet I Can Beat the S&amp;P 500",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qw4dbk/one_word_for_you_i_bet_i_can_beat_the_sp_500/",
        "created": 1637199068.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1636809489,
        "id": "qt13dl",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 15th, 2021.\n\n# **Inflation remains the hot topic in week ahead as Walmart and other key retailers report - [(Source)](https://www.cnbc.com/2021/11/12/inflation-remains-the-hot-topic-in-week-ahead-as-walmart-and-other-key-retailers-report.html)**\n*****\n&gt; Consumers are in the spotlight in the week ahead, with the imminent release of retail sales for October and earnings from major chain stores.\n*****\n&gt; Retail sales is the big economic report for the week, when the Census Bureau releases October data on Tuesday.\n*****\n&gt; Bleakley Advisory Group chief investment officer Peter Boockvar said he’s also looking at the New York Federal Reserve’s Empire state manufacturing survey Monday for updates on prices paid. The Philadelphia Fed manufacturing survey, a measure of growth in that region, is released Thursday.\n*****\n&gt; “That’s going to be key, outside of that it’s retail sales,” Boockvar said. “I think the inflation story will continue to dominate the headlines and the news flow in markets and what the Fed does.”\n*****\n&gt; Investors will also be watching the outcome of the virtual meeting between President Joe Biden and Chinese President Xi Jinping on Monday evening.\n*****\n&gt; “I think it’s good that they would be on a talking basis,” Boockvar said. “I don’t think anything would come out of it unless there’s some shocking change in the tariff situation, but I doubt anything will happen.”\n*****\n&gt; # Chain store earnings\n&gt; The earnings season is winding down, but the big-box stores have yet to report. Walmart and Home Depot release results Tuesday, and Target reports Wednesday.\n*****\n&gt; “Walmart is a pretty big barometer for the health of the consumer for sure, and it will be interesting to see how they handle margins,” National Securities chief market strategist Art Hogan said. Rising costs have been pressuring companies across industries, and many have raised prices in response.\n*****\n&gt; Based on the latest sentiment data Friday, consumers are getting worried about rising prices. The University of Michigan’ consumer sentiment index dropped to a 10-year low of 66.8 in the preliminary November report, from 71.7 in October.\n*****\n&gt; “It’s so important to look at what consumers do, versus what they say,” Hogan said. He said retail sales are expected to be up 1.1%, compared to a 0.7% gain in September.\n*****\n&gt; “The trend that we’re looking for in the next week is sequential improvement in economic data,” Hogan said. “That’s the important thing to focus on.”\n*****\n&gt; Other data in the coming week includes industrial production Tuesday. Housing starts and building permits data will be released Wednesday.\n*****\n&gt; Inflation also proved to be a problem in the stock market this past week, after both producer prices and consumer prices increased more than expected. The consumer price index jumped 6.2%, a three-decade high.\n*****\n&gt; Stocks snapped a five-week winning streak, and all major indices were lower in the past week. The S&amp;P 500 was down 0.3% for the week, at 4,682. The Nasdaq and Russell 2000 saw the biggest declines, falling 0.7% and 1% respectively.\n*****\n&gt; Treasury yields rose, as investors bet the Federal Reserve may be forced to raise interest rates sooner to combat inflation.\n*****\n&gt; The 10-year Treasury yield was at 1.57% on Friday afternoon, and the 2-year yield traded at 0.52%. Yields move opposite price.\n*****\n&gt; The best performing major S&amp;P equities sector was materials, an inflation play that gained more than 2.5%. The worst performer was the consumer discretionary sector, which includes retailers: It declined nearly 3.2%.\n*****\n&gt; Hogan said even with inflation fears, he expects stocks to continue to rise.\n*****\n&gt; “I think we continue to grind higher. We did the larger reset that we needed, which was six weeks - in September and two weeks of October,” he said. “The good news is demand hasn’t been destroyed. It’s been delayed.” Hogan said supply chain issues should get sorted out. He noted that some components of CPI, like higher used car prices, show that the inflation should be temporary.\n*****\n&gt; Trivariate Research founder Adam Parker said he expects the market to continue its march higher. “What would make me call for a correction in the market would be two things — hubris and debt,” he said. Neither of those are currently a problem, since he does not see signs of “management gone awry” and many companies restructured their debt.\n*****\n&gt; Managements are not engaging in arrogant behavior that would be more common at a market top, like excessive spending, he said.\n*****\n&gt; Parker said he expects mid-single digit earnings growth. “I think we could be pretty constructive for the next couple of quarters,” he said.\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/8rAJUHO.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/dhxVRcM.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/oHCQ5zT.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/NocMP7O.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/rHLkf6i.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SRRbBhh.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/68bpNyW.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/lF2TUFo.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/YuhpIuh.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/45es3q2.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nhff0sq.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/1xc0qaI.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/7FUnt2B.png))**\n\n*****\n\n&gt; # Best and Worst S&amp;P 500 Stocks Since September 30th\n\n&gt; The past month has seen the S&amp;P 500 pivot and rally higher after declines throughout the month of September. Since the end of Q3, the S&amp;P has now gained 8.6%, which is slightly off the highs from earlier this month. Earnings season has been in full swing over the past few weeks meaning there have been plenty of stocks with catalysts for big moves since the end of September. Below we show the stocks that have risen and fallen the most since September 30th.\n\n&gt; Topping the list is Enphase Energy (ENPH) having rallied 67.77% in the past month and a half. The bulk of that gain came after earnings as the stock leaped 24.65% the day after reporting and plenty of follow-through in the days after. Arista Networks (ANET) is also up over 50%. Like ENPH, a large portion of ANET's move came from an over 20% gain on earnings in response to a triple play. There are 18 other stocks in the S&amp;P 500 that have risen by more than 25% since the end of September. The largest of those are NVIDIA (NVDA) and Tesla (TSLA).\n\n&gt; Only 18% of the S&amp;P 500 has traded lower since September 30th, and by far the biggest decliner has been Moderna (MRNA). Although it has fallen a dramatic 41% in a short span, that eats into what have been very strong gains this year. Even after its decline so far in Q4, MRNA has still more than doubled year to date. The only other biggest decliners since September that are still up year to date are Garmin (GRMN), Allstate (ALL), Carnival (CCL), and Dish Network (DISH).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111221-930.png))**\n\n*****\n\n&gt; # Week Before Thanksgiving, DJIA up 19 of 28, but weaker lately\n\n&gt; Next week is not only November’s monthly option expiration week, but it is also the last full week of trading before Thanksgiving. DJIA has a reasonably solid track record over the last 28 years, rising 19 times the week before Thanksgiving with a median gain of 0.41%. But the other major U.S. stock market benchmarks have not been as strong and there has been more weakness across the board recently. Since 2003 DJIA is up only 9 out of the last 18 years with a median loss of 0.09%.\n\n&gt; S&amp;P is up 16 of the last 28 years with a median gain of 0.24% and down 10 of the last 18, –0.16% median loss. NASDAQ is up 16 of the last 28 years with a median gain of 0.28% and down 9 of the last 18, +0.07% median gain. Russell 2000 is up 15 of the last 28 years with a median gain of 0.54% and down 10 of the last 18, –0.20% median loss. If weakness does manifest next week, it may be a good set up for the Thanksgiving trade of buying into weakness the week before Thanksgiving and selling into strength around the holiday and typical November end-of-month strength.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/680c740a2fcf7b877a85ecba425f6bda/3d24fe398b06ac0c-55/s500x750/1ee3ab95c65a7c99a01105d66f8864bc7cdac8a7.jpg))**\n\n*****\n\n&gt; # Reasons To Be Thankful\n\n&gt; As we reach the home stretch of 2021, there is a lot to be thankful for. Stocks are having an amazing year, the economy is improving, and COVID-19 trends are going the right direction. Let’s look at some reasons to be thankful.\n\n&gt; What an amazing year and incredible recent run in stocks. The S&amp;P 500 Index just made 8 consecutive all-time highs for the first time since 1997 and it was up 17 out of 19 days for the first time since 1971. Along the way, the S&amp;P 500 was up more than 25% year-to-date in the month of November, making it one of the best years ever.\n\n&gt; The S&amp;P 500 has made 65 new all-time highs this year, tied for the second most in any year ever (tied with 1964), with only 77 in 1995 higher. Although it is still a longshot, there’s a chance we could see 13 more new highs and break the record, something to be thankful for indeed.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/11/Blog-11.10.21.png?ssl=1))**\n\n&gt; “Although the economy did slow in the third quarter, it looks like that was a one-off event due to supply chain issues and the Delta variant,” explained LPL Financial Chief Market Strategist Ryan Detrick. “We fully expect growth to pick up over the coming quarters as the economy continues to rebound thanks to a very healthy and strong U.S. consumer.”\n\n&gt; From the best services number ever, to job growth beating expectations, to inflation and supply chain issues showing signs of peaking, to consumers with trillions of dollars in savings, there are many reasons to expect the economy to remain strong as we head into 2022.\n\n&gt; At the end of the day, though, it is all about earnings. So, while the economy might have slowed in the third quarter, earnings once again came in much better than expected, showing how agile corporate America can be. S&amp;P 500 earnings are tracking to a 39% year-over-year increase in the third quarter, more than 12 percentage points above expectations with still more than 40 index constituents left to report. As our Earnings Season Dashboard shows below, there is a lot to be thankful for as it pertains to earnings.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/11/Chart-11.10.21-.png?ssl=1))**\n\n&gt; Lastly, the trends in COVID-19 are going the right way, with the number of hospitalizations down more than 50% from the September peak. With booster shots on the way and kids allowed to get vaccinated, there are many tailwinds to a continuation of the reopening we’ve been seeing. This is definitely something to be thankful for.\n\n*****\n\n&gt; # Sentiment Steadily Moving Higher\n\n&gt; The S&amp;P 500 has encountered some selling pressure this week, but that hasn't stopped sentiment from continuing its grind higher. The weekly AAII sentiment survey saw 48.0% of respondents report as bullish this week up from 41.5% last week. That puts bullish sentiment at the highest level since the first week of July when it was 0.6 percentage points higher than it is now.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Bull.png))**\n\n&gt; The increase in bullish sentiment borrowed from bears as less than a quarter of respondents reported having negative sentiment for the first time since the last week of July. Similar to bullish sentiment, bearish sentiment is now at the lowest level since the first week of July when it came in at 22.2%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Bear.png))**\n\n&gt; Overall, sentiment continues to favor bulls to a wide margin. As a result of the inverse moves in sentiment, the bull-bear spread rose to 24 from 15.5 last week. Again, that is levels not seen since early July.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Spread.png))**\n\n&gt; Neutral sentiment also declined this week falling by 4.5 percentage points to 28%. Unlike bullish and bearish sentiment, that reading is basically in the middle of the past several months' range as the reading has generally hovered around the 30% level.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Neutral.png))**\n\n*****\n\n&gt; # Small Business Economic Outlook Dour\n\n&gt; This morning the NFIB released the results of their October survey of small business sentiment. The report saw small business sentiment fall for the second month in a row. At 98.2, the index is now back to the same level it was at this past March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-HL.png))**\n\n&gt; With the decline in the headline reading, breadth was terrible with only one index that is an input to the optimism index—Plans to Make Capital Outlays—moving higher month over month. The various indices are now all over the place with regards to their own historical ranges. For example, Higher Prices, Compensation, and Compensation Plans all hit a record high while Expectations for the Economy to Improve and Credit Conditions for Regular Borrowers are just off of record lows.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Table.png))**\n\n&gt; Sales and earnings-related topics weighed on optimism in October. A net negative percentage of responding firms reported weaker actual and earnings changes. Meanwhile, the weakest percentage of respondents reported now as a good time to expand since February. Alongside that weaker reading, Outlook for General Business Conditions continues to collapse and is now at the second-lowest level on record; only slightly above the low from nine years ago. One potential factor playing into that weak sentiment is higher prices as that index hit another record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Sales.png))**\n\n&gt; While the headline Small Business Optimism index has declined, it has held up considerably well relative to the massive drop in the Outlook for General Business Conditions. As shown below, the spread between the two is now at a record high dating back to 1986.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Spread.png))**\n\n&gt; While there were some signs of cooling in October, overall the employment metrics in the report continue to be historically strong. Hiring Plans were unchanged at 26 which is off the late summer peak but still above any pre-pandemic level. While firms do not plan to take on as many workers as they had planned a few months ago, they are at least paying them better. Both Compensation and Compensation Plans continue to surge to new record highs. That has appeared to have some effect as the number of firms reporting Job Openings as Hard to Fill fell modestly. Additionally, as we noted in today's Morning Lineup, fewer businesses are reporting labor problems as their biggest concern.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Emp.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/45es3q2.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/EKBM7mR.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/9je3wSW.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.15.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pviG7w8.png))\n\n&gt; # ***Monday 11.15.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/hADm01O.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/peAqPvP.png))\n\n*****\n\n&gt; # ***Tuesday  11.16.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/EP2afcX.png))\n\n&gt; # ***Tuesday 11.16.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/AJnWJ7J.png))\n\n*****\n\n&gt; # ***Wednesday 11.17.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ev2lXWy.png))\n\n&gt; # ***Wednesday 11.17.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ep2sGdL.png))\n\n*****\n\n&gt; # ***Thursday 11.18.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SYzRwze.png))\n\n&gt; # ***Thursday 11.18.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ruo795N.png))\n\n*****\n\n&gt; # ***Friday 11.19.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/nzonZUm.png))\n\n*****\n\n&gt; # ***Friday 11.19.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Alibaba Group Holding Ltd. $166.81\n&gt; **Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, November 18, 2021. The consensus earnings estimate is $1.87 per share on revenue of $31.98 billion and the Earnings Whisper ® number is $1.99 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.25% with revenue increasing by 40.03%. Short interest has decreased by 1.1% since the company's last earnings release while the stock has drifted lower by 14.5% from its open following the earnings release to be 18.4% below its 200 day moving average of $204.35. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, October 12, 2021 there was some notable buying of 37,263 contracts of the $40.00 put expiring on Friday, December 17, 2021. Option traders are pricing in a 6.5% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # NVIDIA Corp. $303.90\n&gt; **NVIDIA Corp. (NVDA)** is confirmed to report earnings at approximately 4:20 PM ET on Wednesday, November 17, 2021. The consensus earnings estimate is $1.10 per share on revenue of $6.82 billion and the Earnings Whisper ® number is $1.16 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for earnings of $1.04 to $1.16 per share. Consensus estimates are for year-over-year earnings growth of 44.26% with revenue increasing by 44.31%. Short interest has decreased by 12.8% since the company's last earnings release while the stock has drifted higher by 55.9% from its open following the earnings release to be 66.2% above its 200 day moving average of $182.90. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, November 4, 2021 there was some notable buying of 23,417 contracts of the $300.00 call expiring on Friday, November 19, 2021. Option traders are pricing in a 6.9% move on earnings and the stock has averaged a 2.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=NVDA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Walmart Inc. $147.76\n&gt; **Walmart Inc. (WMT)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, November 16, 2021. The consensus earnings estimate is $1.39 per share on revenue of $135.74 billion and the Earnings Whisper ® number is $1.47 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat The company's guidance was for earnings of $1.30 to $1.40 per share. Consensus estimates are for year-over-year earnings growth of 3.73% with revenue increasing by 0.77%. Short interest has decreased by 28.7% since the company's last earnings release while the stock has drifted lower by 1.8% from its open following the earnings release to be 4.7% above its 200 day moving average of $141.10. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, November 8, 2021 there was some notable buying of 5,890 contracts of the $152.50 call expiring on Friday, November 19, 2021. Option traders are pricing in a 3.9% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=WMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Tyson Foods Inc. $81.23\n&gt; **Tyson Foods Inc. (TSN)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, November 15, 2021. The consensus earnings estimate is $2.19 per share on revenue of $12.43 billion and the Earnings Whisper ® number is $2.55 per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 20.99% with revenue increasing by 8.46%. Short interest has increased by 58.2% since the company's last earnings release while the stock has drifted higher by 8.3% from its open following the earnings release to be 6.6% above its 200 day moving average of $76.17. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, November 12, 2021 there was some notable buying of 10,821 contracts of the $87.50 call expiring on Friday, December 17, 2021. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=TSN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Target Corp. $260.02\n&gt; **Target Corp. (TGT)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, November 17, 2021. The consensus earnings estimate is $2.82 per share on revenue of $24.57 billion and the Earnings Whisper ® number is $3.17 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1.08% with revenue increasing by 8.56%. Short interest has decreased by 8.0% since the company's last earnings release while the stock has drifted higher by 4.4% from its open following the earnings release to be 15.3% above its 200 day moving average of $225.54. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, November 5, 2021 there was some notable buying of 5,141 contracts of the $230.00 put expiring on Friday, December 17, 2021. Option traders are pricing in a 6.0% move on earnings and the stock has averaged a 5.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=TGT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Home Depot, Inc. $372.63\n&gt; **Home Depot, Inc. (HD)** is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, November 16, 2021. The consensus earnings estimate is $3.40 per share on revenue of $34.49 billion and the Earnings Whisper ® number is $3.50 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.92% with revenue increasing by 2.84%. Short interest has decreased by 18.0% since the company's last earnings release while the stock has drifted higher by 16.1% from its open following the earnings release to be 17.6% above its 200 day moving average of $316.97. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 2, 2021 there was some notable buying of 3,511 contracts of the $390.00 call expiring on Friday, December 17, 2021. Option traders are pricing in a 3.5% move on earnings and the stock has averaged a 2.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=HD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lucid Group $43.93\n&gt; **Lucid Group (LCID)** is confirmed to report earnings after the market closes on Monday, November 15, 2021. The consensus estimate is for a loss of $0.22 per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat On Monday, November 8, 2021 there was some notable buying of 20,444 contracts of the $50.00 call expiring on Friday, November 19, 2021.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=LCID&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Sea Limited $341.29\n&gt; **Sea Limited (SE)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, November 16, 2021. The consensus estimate is for a loss of $0.67 per share on revenue of $2.34 billion and the Earnings Whisper ® number is ($0.75) per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 3.08% with revenue increasing by 93.04%. Short interest has increased by 28.1% since the company's last earnings release while the stock has drifted higher by 15.3% from its open following the earnings release to be 21.6% above its 200 day moving average of $280.58. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, November 10, 2021 there was some notable buying of 1,488 contracts of the $410.00 call expiring on Friday, November 26, 2021. Option traders are pricing in a 8.7% move on earnings and the stock has averaged a 6.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # FreightCar America Inc. $4.83\n&gt; **FreightCar America Inc. (RAIL)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, November 15, 2021. The consensus estimate is for a loss of $0.22 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 71.43% with revenue increasing by 3,863.97%. Short interest has decreased by 26.2% since the company's last earnings release while the stock has drifted lower by 8.0% from its open following the earnings release to be 5.0% below its 200 day moving average of $5.08. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 28, 2021 there was some notable buying of 867 contracts of the $5.00 call expiring on Friday, November 19, 2021. The stock has averaged a 13.9% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=RAIL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Macy's, Inc. $30.46\n&gt; **Macy's, Inc. (M)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, November 18, 2021. The consensus earnings estimate is $0.31 per share on revenue of $5.12 billion and the Earnings Whisper ® number is $0.47 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 263.16% with revenue increasing by 28.32%. Short interest has increased by 12.9% since the company's last earnings release while the stock has drifted higher by 58.3% from its open following the earnings release to be 52.3% above its 200 day moving average of $19.99. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 3, 2021 there was some notable buying of 6,498 contracts of the $42.00 call expiring on Friday, December 17, 2021. Option traders are pricing in a 11.6% move on earnings and the stock has averaged a 5.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=M&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets. :)",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning November 15th, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qt13dl/wall_street_week_ahead_for_the_trading_week/",
        "created": 1636838289.0
    },
    {
        "author": "FinancialWhoas",
        "created_utc": 1637167647,
        "id": "qw3f2w",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "TLDR: I did a bunch of math based on some reasonably good ideas to determine a selection of stocks worth investing in. Tables of stocks found below. My diamond hands are so rough on my fleshy...forearms. I can't type anymore.\n\n# Observations/Assumptions\n\nBefore you jump down my throat, these are simplified observations/assumptions, not internationally agreed upon mandates from heaven. Okay, now you can jump down my throat.\n\n* Companies with strong financials, a competitive advantage, good management, a sustainable business model, etc. tend to do better than companies missing one or more of those attributes.\n* For most people it is impossible to time the market\n* Stock prices have all available information priced into them.\n* The markets are relatively efficient over the long-term.\n* [Index funds have been shown to be the most successful stock investing instrument for most people](https://freakonomics.com/podcast/stupidest-money/)\n* [Index fund returns, such as the S&amp;P 500, are now predominately determined by a handful of extremely large, mostly tech stocks.](https://www.investopedia.com/top-10-s-and-p-500-stocks-by-index-weight-4843111)\n* [Most funds do not beat the index over a long period](https://finance.yahoo.com/news/dont-pay-investment-adviser-beat-144400899.html).\n* The cost of stock trades at most firms is now $0.00 (yes, simplified)\n* During times of volatility, companies that had poor financials will likely find it challenging to survive.\n* [Zombie companies](https://finance.yahoo.com/news/zombie-companies-hiding-uncomfortable-truth-183246812.html) are able to survive for longer periods during times of extremely cheap debt.\n* Index funds have these 3 issues that are hard to get around:\n   * You are unable to effectively [Tax-Loss Harvest](https://www.investopedia.com/articles/taxes/08/tax-loss-harvesting.asp) even though many of the holdings that make up the index would have had losses, thereby reducing the return compared to directly investing in that same set of stocks in the same proportions.\n   * You have no control over the holdings within the fund and may be supporting things you don’t want to support.\n   * Due to the way the index works, any large stock that becomes part of the index is potentially a huge drag on the index. This happened when Tesla was going to be added on 12/21/2020, which was announced on 11/16/2020, forcing funds to buy the stock at the same time driving up the price, which had already been driven up by people buying the stock knowing it was then going to get added to the index forcing more people to buy the stock. If you think it sounds kind of circular, that’s because it is.\n\n# Hypothesis\n\nUsing industry benchmarking against the best of the best of the best companies in each industry in order to purchase only the best companies in equal measure should provide a well-diversified portfolio that over the long term should be able to beat the S&amp;P 500.\n\n# Experiment 2020\n\n750 largest US stocks were analyzed against their peers in their industry (Industry details available further down the post). Stocks were given a score based on their relative percentage compared to the industry index. For example, each companies’ average ROE of the last 4 years was compared to this index value with the following type of breakdown:\n\n* ROE &lt; Index ROE = Poor = 1\n* ROE &gt; Index ROE = Moderate = 2\n* ROE &gt; 150% of Index ROE = Great = 3\n\nFor example, the ROE communication services industry index value used was 10.10%. If a communication services company had a ROE average of 9%, they would receive a poor rating. If they had a ROE of 10.5% they would receive a moderate rating. If they had a ROE of 25% they would receive a great rating.\n\nThis was done for all of the metrics below:\n\n* ROE\n* Revenue Growth %\n* EBITDA %\n* FCF %\n\nThe relative scores used for each of the metrics was tweaked until there was a good distribution of results. e.g., if the 150% revenue growth only found 5 companies with a Great rating, that may need to be decreased to 125% for a better distribution.\n\nAny stock that received a poor in any of the 4 metrics was eliminated.\n\nExample below on ROE:\n\n[ROE Example](https://preview.redd.it/unapdml3m6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=76d615130616fb32c179674306cb461d3c0dcb2d)\n\nThat left 53 stocks. EBITDA was then analyzed to see if it was declining, and if so, it too was eliminated.\n\nThis left 45 stocks. These 45 were reviewed more thoroughly. What did the company do? What were their competitive advantages? Are they currently in any lawsuits? Does their debt look out of control? Do I see them being a long-term sustainable choice? Is their IP about to expire? Has WSB said it's a buy? Essentially boiling down to: Is there any reason that I want to exclude them?\n\nThat left 26 across 7 sectors. \n\n**2020 Industries**\n\n[2020 Industry Breakdown](https://preview.redd.it/o9llcazgm6081.png?width=386&amp;format=png&amp;auto=webp&amp;s=64e5c541e836a173e373113b5d13cc5b7648f57a)\n\nThese 26 stocks were bought in equal amounts in July 2020, August 2020, and September 2020. To easily perform time weighted analysis of these stocks and determine if there was an opportunity cost, 10% of the total purchase each period was also allocated to VFIAX.\n\n2020 Experiment Results July, August, and September 2020 purchases to 11/16/2021\n\n* **S&amp;P 500** total return reinvested dividends: **49.09%**\n* **My 26 Stock Index** including reinvested dividends: **61.53%**\n\nCan we do it again this year? Should we go bigger? Yes.\n\n# Experiment 2021\n\n2,850 tickers of the largest US stocks were identified as the initial list. The stocks had their last 5 years averaged for each of nine metrics:\n\n* Revenue Growth % - shows growth rate of the company\n* Profit Margin – shows how effective the business is at making money\n* Operating Margin – shows how much money the company earns on its revenue\n* FCF Margin – shows how efficient a company is with their cash\n* EBITDA Margin – shows a companies’ operating profitability\n* ROE – shows how well management balances profits, leverage, and assets to make money\n* ROA – shows how effectively a company utilizes its assets to generate profits\n* ROIC – shows how effective the company is at using its money to generate returns\n* Debt/Equity Ratio – shows the financial stability of a company\n\nMore metrics were used due to the increased data set. These stocks were then grouped by industry, and the average of the averages is taken to determine the industry average for the last 5 years; I switched to median based on a few outliers really throwing the average for some of the metrics. If that was confusing, here is an example:\n\n· 3 stocks that make up an industry averaged -10%, 15%, and 20% ROE over the last 5 years. The median over the last 5 years for that industry is then 15% and all 3 of those stocks will be compared to that benchmark.\n\nEach stock was compared against its Industry benchmark for each of the metrics and given a score 1=Poor, 2=Good, 3=Great as well as a composite score out of 27, from 9 metrics with a max score of 3 in each of the metrics. The scores are based on how much better they are then the average. I measured them against the benchmark using the same methodology as previously performed: Poor &lt; 100%, Good &lt; 150%, Great &gt; 150%. Again, these may be tweaked slightly depending on the particular metric to find a useful distribution.\n\nI also ranked every stock against the entire list for each of the metrics and overall. For those wondering, the best stock in this ranking was CORT with a score of 2,097 and the worst was CYCN with a score of 23,095. Because the overall rank is a combination of 9 categories with values ranging from 1-2791, the theoretical best a company could do would be 9 and the theoretical worst a company could do would be 25,119. Anyone wondering why the number of stocks doesn’t match the original input (congratulations on your reading comprehension), this is primarily due to mergers/acquisitions or the stock being taken private. Another stock was acquired during the analysis, changing the max number yet again.\n\nHere is an example showing Aerospace &amp; Defense scoring:\n\n[Aerospace and Defense Example Scoring](https://preview.redd.it/s80995tpo6081.png?width=615&amp;format=png&amp;auto=webp&amp;s=58fbc4aa6a06985cbedd1d4bf26d678b94bcc977)\n\nHere is an example showing growth scoring (the Revenue Growth column is the company’s most recent year):\n\n[Growth Scoring](https://preview.redd.it/12pnpz90p6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=e4d32a3469e261be37cba38f28c9ca39ef0552e0)\n\nHere is an example of the visualizations for the data:\n\n[Data Visualizations](https://preview.redd.it/112baw12p6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=1c55275971eba7f3f0d316f84a275da53572fcf8)\n\nI applied a series of filters to eliminated unwanted noise. I looked at the top 5 stocks per industry (extending out for any ties), any stock that scored a 25, 26, or 27 on the composite, or any stock that had a high enough overall rank to justify being reviewed.\n\nNext, I read the description of \\~300 stocks and looked through their financials for any inconsistencies, such as one huge year throwing off their average, profit margins higher than operating margins, highly leveraged companies with poor growth, etc. My favorite find was that Chemed Corporation provides hospice/palliative care and owns Roto-Rooter. Yes, I did end up keeping them (how could you not?), no there are not great synergies between the sectors of the business, yes, they are aware of this. I also eliminated industries I wasn’t interested in reviewing, such as REITS due to the need to look at different metrics like FFO, Oil and Gas because it’s oil and gas, etc. These activities eliminated \\~150. I would like to get back to REITs, but I’d need to build a separate model.\n\nI then looked at each stock in more detail compared to its peers that made the cut. Are all the rest of them in the double digits for growth, are the profit margins substantially less, which one is in a better debt situation, did WSB say it's a buy, etc. Who deserves to be on this list? This eliminated \\~75.\n\nWe were down to 84 stocks at this point. I then looked at each company's investor presentation, annual report, etc. to better understand what the company does, their revenue model, risks, etc. I was not nearly as thorough on this portion this year compared to last year just due to the substantial increase in companies, 26 vs 84. My hourly wage at McDonald was going to be better than my returns from the analysis if I took too long. I only eliminated 1 company which left us at the grand total of 83 companies across 31 industries. Breakdown below:\n\n**Industry**\n\n[Industry Breakdown](https://preview.redd.it/r9rt903pp6081.png?width=388&amp;format=png&amp;auto=webp&amp;s=95168c9e7c65cf548f4bd7c4be45ffaf9b1ac46b)\n\nI then purchased all of these in equal proportion in April, May, and July of 2021.\n\n2021 Experiment Results April, May, and July 2021 purchases to 11/16/2021:\n\n* **S&amp;P 500** total return including reinvested dividends: **11.93%**\n* **My 2021 Stock Index** including reinvested dividends: **14.26%**\n\n# Industry Classification\n\n* For Experiment 2020, the Sector was used to determine how companies should be compared.\n   * This is made up of 11 sectors such as Information Technology, Communication Services, Utilities, etc.\n   * This seemed to be too restrictive and compared companies against each other that aren’t really accurate comparisons. See the example on ROE below.\n* For Experiment 2021 I used the Microsoft Excel Stock function to pull industries for all the stocks.\n   * This looks like it pulls data mostly from Industry and Sub-industry.\n   * This was successful on 98% of the stocks and for the final 2% I manually classified based on the taxonomy in the [Global Industry Classification Standard](https://en.wikipedia.org/wiki/Global_Industry_Classification_Standard).\n   * I ended up needing to collapse the structure a little further. Originally there were 55 classes with many of the classes having less than 10 stocks. I was able to collapse this to 44 classes. This will likely be tweaked a little further next year as I had mathematical issues dealing with averages/medians that were negative. There were also just too many categories with similar enough results that they could be combined such as biotech and pharmaceutical.\n\n# 2020 Stocks\n\nABMD\n\nADBE\n\nANET\n\nBWXT\n\nCRL\n\nDG\n\nENR\n\nETSY\n\nEXEL\n\nICLR\n\nISRG\n\nKLAC\n\nLKQ\n\nLRCX\n\nMNST\n\nMPWR\n\nMTCH\n\nOLED\n\nPAYC\n\nPHM\n\nTER\n\nTTD\n\nUI\n\nVEEV\n\nVMW\n\nVRTX\n\n# 2021 Stocks\n\nAAON\n\nAAPL\n\nACN\n\nADBE\n\nAEIS\n\nALGN\n\nAMAT\n\nANET\n\nAPH\n\nATR\n\nATVI\n\nAX\n\nBLD\n\nCDNS\n\nCGNX\n\nCHD\n\nCHE\n\nCORT\n\nCPRT\n\nDLB\n\nDORM\n\nEPAM\n\nESNT\n\nETSY\n\nEW\n\nEXPD\n\nEXPO\n\nFAST\n\nFB\n\nFIX\n\nFOXF\n\nFTNT\n\nGGG\n\nGOOG\n\nGRMN\n\nHEI.A\n\nHELE\n\nIDA\n\nINS\n\nINTC\n\nINTU\n\nIRBT\n\nISRG\n\nCCSI\n\nZD\n\nKLAC\n\nLRCX\n\nLULU\n\nMASI\n\nMED\n\nMKSI\n\nMKTX\n\nMNST\n\nMORN\n\nMPWR\n\nMSFT\n\nNMIH\n\nNRC\n\nNVDA\n\nODFL\n\nOLED\n\nOLLI\n\nPAYC\n\nPAYX\n\nPRLB\n\nQLYS\n\nREGN\n\nRMR\n\nROAD\n\nSCCO\n\nSFBS\n\nSLP\n\nSTMP\n\nTDY\n\nTER\n\nTREX\n\nTROW\n\nTTD\n\nTYL\n\nUI\n\nV\n\nVEEV\n\nVRTX\n\nWAL\n\nYETI\n\n# Notes\n\nI partnered up for both the 2020 and 2021 experiments. This was critical for both expanding my initial idea, brainstorming methods to build the model, and reviewing the work done for errors. This was a team effort, and I by no means deserve all the credit or hate.\n\nAll returns are showing reinvested dividends in the total return.\n\n\\*I am not a financial advisor or anything else I should put here to ensure it is clear that I did this for myself and am sharing my results and am in no way forcing you to push buttons to buy things you don’t understand or requiring justification for this run on sentence and henceforth.\n\n\\*\\*\\*\\*. Past results are no guarantee of future returns.",
        "subreddit": "wallstreetbets",
        "title": "One Word For You: I Bet I Can Beat the S&amp;P 500",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qw3f2w/one_word_for_you_i_bet_i_can_beat_the_sp_500/",
        "created": 1637196447.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1636806565,
        "id": "qt0aie",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 15th, 2021.\n\n# **Inflation remains the hot topic in week ahead as Walmart and other key retailers report - [(Source)](https://www.cnbc.com/2021/11/12/inflation-remains-the-hot-topic-in-week-ahead-as-walmart-and-other-key-retailers-report.html)**\n*****\n&gt; Consumers are in the spotlight in the week ahead, with the imminent release of retail sales for October and earnings from major chain stores.\n*****\n&gt; Retail sales is the big economic report for the week, when the Census Bureau releases October data on Tuesday.\n*****\n&gt; Bleakley Advisory Group chief investment officer Peter Boockvar said he’s also looking at the New York Federal Reserve’s Empire state manufacturing survey Monday for updates on prices paid. The Philadelphia Fed manufacturing survey, a measure of growth in that region, is released Thursday.\n*****\n&gt; “That’s going to be key, outside of that it’s retail sales,” Boockvar said. “I think the inflation story will continue to dominate the headlines and the news flow in markets and what the Fed does.”\n*****\n&gt; Investors will also be watching the outcome of the virtual meeting between President Joe Biden and Chinese President Xi Jinping on Monday evening.\n*****\n&gt; “I think it’s good that they would be on a talking basis,” Boockvar said. “I don’t think anything would come out of it unless there’s some shocking change in the tariff situation, but I doubt anything will happen.”\n*****\n&gt; # Chain store earnings\n&gt; The earnings season is winding down, but the big-box stores have yet to report. Walmart and Home Depot release results Tuesday, and Target reports Wednesday.\n*****\n&gt; “Walmart is a pretty big barometer for the health of the consumer for sure, and it will be interesting to see how they handle margins,” National Securities chief market strategist Art Hogan said. Rising costs have been pressuring companies across industries, and many have raised prices in response.\n*****\n&gt; Based on the latest sentiment data Friday, consumers are getting worried about rising prices. The University of Michigan’ consumer sentiment index dropped to a 10-year low of 66.8 in the preliminary November report, from 71.7 in October.\n*****\n&gt; “It’s so important to look at what consumers do, versus what they say,” Hogan said. He said retail sales are expected to be up 1.1%, compared to a 0.7% gain in September.\n*****\n&gt; “The trend that we’re looking for in the next week is sequential improvement in economic data,” Hogan said. “That’s the important thing to focus on.”\n*****\n&gt; Other data in the coming week includes industrial production Tuesday. Housing starts and building permits data will be released Wednesday.\n*****\n&gt; Inflation also proved to be a problem in the stock market this past week, after both producer prices and consumer prices increased more than expected. The consumer price index jumped 6.2%, a three-decade high.\n*****\n&gt; Stocks snapped a five-week winning streak, and all major indices were lower in the past week. The S&amp;P 500 was down 0.3% for the week, at 4,682. The Nasdaq and Russell 2000 saw the biggest declines, falling 0.7% and 1% respectively.\n*****\n&gt; Treasury yields rose, as investors bet the Federal Reserve may be forced to raise interest rates sooner to combat inflation.\n*****\n&gt; The 10-year Treasury yield was at 1.57% on Friday afternoon, and the 2-year yield traded at 0.52%. Yields move opposite price.\n*****\n&gt; The best performing major S&amp;P equities sector was materials, an inflation play that gained more than 2.5%. The worst performer was the consumer discretionary sector, which includes retailers: It declined nearly 3.2%.\n*****\n&gt; Hogan said even with inflation fears, he expects stocks to continue to rise.\n*****\n&gt; “I think we continue to grind higher. We did the larger reset that we needed, which was six weeks - in September and two weeks of October,” he said. “The good news is demand hasn’t been destroyed. It’s been delayed.” Hogan said supply chain issues should get sorted out. He noted that some components of CPI, like higher used car prices, show that the inflation should be temporary.\n*****\n&gt; Trivariate Research founder Adam Parker said he expects the market to continue its march higher. “What would make me call for a correction in the market would be two things — hubris and debt,” he said. Neither of those are currently a problem, since he does not see signs of “management gone awry” and many companies restructured their debt.\n*****\n&gt; Managements are not engaging in arrogant behavior that would be more common at a market top, like excessive spending, he said.\n*****\n&gt; Parker said he expects mid-single digit earnings growth. “I think we could be pretty constructive for the next couple of quarters,” he said.\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/8rAJUHO.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/dhxVRcM.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/oHCQ5zT.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/NocMP7O.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/rHLkf6i.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SRRbBhh.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/68bpNyW.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/lF2TUFo.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/YuhpIuh.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/KQOTTn6.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nhff0sq.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/1xc0qaI.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/7FUnt2B.png))**\n\n*****\n\n&gt; # Best and Worst S&amp;P 500 Stocks Since September 30th\n\n&gt; The past month has seen the S&amp;P 500 pivot and rally higher after declines throughout the month of September. Since the end of Q3, the S&amp;P has now gained 8.6%, which is slightly off the highs from earlier this month. Earnings season has been in full swing over the past few weeks meaning there have been plenty of stocks with catalysts for big moves since the end of September. Below we show the stocks that have risen and fallen the most since September 30th.\n\n&gt; Topping the list is Enphase Energy (ENPH) having rallied 67.77% in the past month and a half. The bulk of that gain came after earnings as the stock leaped 24.65% the day after reporting and plenty of follow-through in the days after. Arista Networks (ANET) is also up over 50%. Like ENPH, a large portion of ANET's move came from an over 20% gain on earnings in response to a triple play. There are 18 other stocks in the S&amp;P 500 that have risen by more than 25% since the end of September. The largest of those are NVIDIA (NVDA) and Tesla (TSLA).\n\n&gt; Only 18% of the S&amp;P 500 has traded lower since September 30th, and by far the biggest decliner has been Moderna (MRNA). Although it has fallen a dramatic 41% in a short span, that eats into what have been very strong gains this year. Even after its decline so far in Q4, MRNA has still more than doubled year to date. The only other biggest decliners since September that are still up year to date are Garmin (GRMN), Allstate (ALL), Carnival (CCL), and Dish Network (DISH).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111221-930.png))**\n\n*****\n\n&gt; # Week Before Thanksgiving, DJIA up 19 of 28, but weaker lately\n\n&gt; Next week is not only November’s monthly option expiration week, but it is also the last full week of trading before Thanksgiving. DJIA has a reasonably solid track record over the last 28 years, rising 19 times the week before Thanksgiving with a median gain of 0.41%. But the other major U.S. stock market benchmarks have not been as strong and there has been more weakness across the board recently. Since 2003 DJIA is up only 9 out of the last 18 years with a median loss of 0.09%.\n\n&gt; S&amp;P is up 16 of the last 28 years with a median gain of 0.24% and down 10 of the last 18, –0.16% median loss. NASDAQ is up 16 of the last 28 years with a median gain of 0.28% and down 9 of the last 18, +0.07% median gain. Russell 2000 is up 15 of the last 28 years with a median gain of 0.54% and down 10 of the last 18, –0.20% median loss. If weakness does manifest next week, it may be a good set up for the Thanksgiving trade of buying into weakness the week before Thanksgiving and selling into strength around the holiday and typical November end-of-month strength.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/680c740a2fcf7b877a85ecba425f6bda/3d24fe398b06ac0c-55/s500x750/1ee3ab95c65a7c99a01105d66f8864bc7cdac8a7.jpg))**\n\n*****\n\n&gt; # Reasons To Be Thankful\n\n&gt; As we reach the home stretch of 2021, there is a lot to be thankful for. Stocks are having an amazing year, the economy is improving, and COVID-19 trends are going the right direction. Let’s look at some reasons to be thankful.\n\n&gt; What an amazing year and incredible recent run in stocks. The S&amp;P 500 Index just made 8 consecutive all-time highs for the first time since 1997 and it was up 17 out of 19 days for the first time since 1971. Along the way, the S&amp;P 500 was up more than 25% year-to-date in the month of November, making it one of the best years ever.\n\n&gt; The S&amp;P 500 has made 65 new all-time highs this year, tied for the second most in any year ever (tied with 1964), with only 77 in 1995 higher. Although it is still a longshot, there’s a chance we could see 13 more new highs and break the record, something to be thankful for indeed.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/11/Blog-11.10.21.png?ssl=1))**\n\n&gt; “Although the economy did slow in the third quarter, it looks like that was a one-off event due to supply chain issues and the Delta variant,” explained LPL Financial Chief Market Strategist Ryan Detrick. “We fully expect growth to pick up over the coming quarters as the economy continues to rebound thanks to a very healthy and strong U.S. consumer.”\n\n&gt; From the best services number ever, to job growth beating expectations, to inflation and supply chain issues showing signs of peaking, to consumers with trillions of dollars in savings, there are many reasons to expect the economy to remain strong as we head into 2022.\n\n&gt; At the end of the day, though, it is all about earnings. So, while the economy might have slowed in the third quarter, earnings once again came in much better than expected, showing how agile corporate America can be. S&amp;P 500 earnings are tracking to a 39% year-over-year increase in the third quarter, more than 12 percentage points above expectations with still more than 40 index constituents left to report. As our Earnings Season Dashboard shows below, there is a lot to be thankful for as it pertains to earnings.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/11/Chart-11.10.21-.png?ssl=1))**\n\n&gt; Lastly, the trends in COVID-19 are going the right way, with the number of hospitalizations down more than 50% from the September peak. With booster shots on the way and kids allowed to get vaccinated, there are many tailwinds to a continuation of the reopening we’ve been seeing. This is definitely something to be thankful for.\n\n*****\n\n&gt; # Sentiment Steadily Moving Higher\n\n&gt; The S&amp;P 500 has encountered some selling pressure this week, but that hasn't stopped sentiment from continuing its grind higher. The weekly AAII sentiment survey saw 48.0% of respondents report as bullish this week up from 41.5% last week. That puts bullish sentiment at the highest level since the first week of July when it was 0.6 percentage points higher than it is now.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Bull.png))**\n\n&gt; The increase in bullish sentiment borrowed from bears as less than a quarter of respondents reported having negative sentiment for the first time since the last week of July. Similar to bullish sentiment, bearish sentiment is now at the lowest level since the first week of July when it came in at 22.2%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Bear.png))**\n\n&gt; Overall, sentiment continues to favor bulls to a wide margin. As a result of the inverse moves in sentiment, the bull-bear spread rose to 24 from 15.5 last week. Again, that is levels not seen since early July.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Spread.png))**\n\n&gt; Neutral sentiment also declined this week falling by 4.5 percentage points to 28%. Unlike bullish and bearish sentiment, that reading is basically in the middle of the past several months' range as the reading has generally hovered around the 30% level.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Neutral.png))**\n\n*****\n\n&gt; # Small Business Economic Outlook Dour\n\n&gt; This morning the NFIB released the results of their October survey of small business sentiment. The report saw small business sentiment fall for the second month in a row. At 98.2, the index is now back to the same level it was at this past March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-HL.png))**\n\n&gt; With the decline in the headline reading, breadth was terrible with only one index that is an input to the optimism index—Plans to Make Capital Outlays—moving higher month over month. The various indices are now all over the place with regards to their own historical ranges. For example, Higher Prices, Compensation, and Compensation Plans all hit a record high while Expectations for the Economy to Improve and Credit Conditions for Regular Borrowers are just off of record lows.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Table.png))**\n\n&gt; Sales and earnings-related topics weighed on optimism in October. A net negative percentage of responding firms reported weaker actual and earnings changes. Meanwhile, the weakest percentage of respondents reported now as a good time to expand since February. Alongside that weaker reading, Outlook for General Business Conditions continues to collapse and is now at the second-lowest level on record; only slightly above the low from nine years ago. One potential factor playing into that weak sentiment is higher prices as that index hit another record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Sales.png))**\n\n&gt; While the headline Small Business Optimism index has declined, it has held up considerably well relative to the massive drop in the Outlook for General Business Conditions. As shown below, the spread between the two is now at a record high dating back to 1986.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Spread.png))**\n\n&gt; While there were some signs of cooling in October, overall the employment metrics in the report continue to be historically strong. Hiring Plans were unchanged at 26 which is off the late summer peak but still above any pre-pandemic level. While firms do not plan to take on as many workers as they had planned a few months ago, they are at least paying them better. Both Compensation and Compensation Plans continue to surge to new record highs. That has appeared to have some effect as the number of firms reporting Job Openings as Hard to Fill fell modestly. Additionally, as we noted in today's Morning Lineup, fewer businesses are reporting labor problems as their biggest concern.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Emp.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending November 12th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=dmulEWE-T6Q))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 11.14.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$TSN $OEG $OTLY $AAP $IDEX $CSPR $WMT $HD $SE $STNE $LZB $DLO $TGT $BIDU $LOW $TJX $BILI $NNOX $NVDA $CSCO $VSCO $BABA $JD $M $BJ $WOOF $AMAT $WDAY $INTU $PANW $WSM $FL**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/KQOTTn6.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/MrpShLB.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/9je3wSW.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.15.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pviG7w8.png))\n\n&gt; # ***Monday 11.15.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/hADm01O.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/peAqPvP.png))\n\n*****\n\n&gt; # ***Tuesday  11.16.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/EP2afcX.png))\n\n&gt; # ***Tuesday 11.16.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/AJnWJ7J.png))\n\n*****\n\n&gt; # ***Wednesday 11.17.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ev2lXWy.png))\n\n&gt; # ***Wednesday 11.17.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ep2sGdL.png))\n\n*****\n\n&gt; # ***Thursday 11.18.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SYzRwze.png))\n\n&gt; # ***Thursday 11.18.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ruo795N.png))\n\n*****\n\n&gt; # ***Friday 11.19.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/nzonZUm.png))\n\n*****\n\n&gt; # ***Friday 11.19.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n&gt; **(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets. :)",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning November 15th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/qt0aie/wall_street_week_ahead_for_the_trading_week/",
        "created": 1636835365.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1636806307,
        "id": "qt087n",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 15th, 2021.\n\n# **Inflation remains the hot topic in week ahead as Walmart and other key retailers report - [(Source)](https://www.cnbc.com/2021/11/12/inflation-remains-the-hot-topic-in-week-ahead-as-walmart-and-other-key-retailers-report.html)**\n*****\n&gt; Consumers are in the spotlight in the week ahead, with the imminent release of retail sales for October and earnings from major chain stores.\n*****\n&gt; Retail sales is the big economic report for the week, when the Census Bureau releases October data on Tuesday.\n*****\n&gt; Bleakley Advisory Group chief investment officer Peter Boockvar said he’s also looking at the New York Federal Reserve’s Empire state manufacturing survey Monday for updates on prices paid. The Philadelphia Fed manufacturing survey, a measure of growth in that region, is released Thursday.\n*****\n&gt; “That’s going to be key, outside of that it’s retail sales,” Boockvar said. “I think the inflation story will continue to dominate the headlines and the news flow in markets and what the Fed does.”\n*****\n&gt; Investors will also be watching the outcome of the virtual meeting between President Joe Biden and Chinese President Xi Jinping on Monday evening.\n*****\n&gt; “I think it’s good that they would be on a talking basis,” Boockvar said. “I don’t think anything would come out of it unless there’s some shocking change in the tariff situation, but I doubt anything will happen.”\n*****\n&gt; # Chain store earnings\n&gt; The earnings season is winding down, but the big-box stores have yet to report. Walmart and Home Depot release results Tuesday, and Target reports Wednesday.\n*****\n&gt; “Walmart is a pretty big barometer for the health of the consumer for sure, and it will be interesting to see how they handle margins,” National Securities chief market strategist Art Hogan said. Rising costs have been pressuring companies across industries, and many have raised prices in response.\n*****\n&gt; Based on the latest sentiment data Friday, consumers are getting worried about rising prices. The University of Michigan’ consumer sentiment index dropped to a 10-year low of 66.8 in the preliminary November report, from 71.7 in October.\n*****\n&gt; “It’s so important to look at what consumers do, versus what they say,” Hogan said. He said retail sales are expected to be up 1.1%, compared to a 0.7% gain in September.\n*****\n&gt; “The trend that we’re looking for in the next week is sequential improvement in economic data,” Hogan said. “That’s the important thing to focus on.”\n*****\n&gt; Other data in the coming week includes industrial production Tuesday. Housing starts and building permits data will be released Wednesday.\n*****\n&gt; Inflation also proved to be a problem in the stock market this past week, after both producer prices and consumer prices increased more than expected. The consumer price index jumped 6.2%, a three-decade high.\n*****\n&gt; Stocks snapped a five-week winning streak, and all major indices were lower in the past week. The S&amp;P 500 was down 0.3% for the week, at 4,682. The Nasdaq and Russell 2000 saw the biggest declines, falling 0.7% and 1% respectively.\n*****\n&gt; Treasury yields rose, as investors bet the Federal Reserve may be forced to raise interest rates sooner to combat inflation.\n*****\n&gt; The 10-year Treasury yield was at 1.57% on Friday afternoon, and the 2-year yield traded at 0.52%. Yields move opposite price.\n*****\n&gt; The best performing major S&amp;P equities sector was materials, an inflation play that gained more than 2.5%. The worst performer was the consumer discretionary sector, which includes retailers: It declined nearly 3.2%.\n*****\n&gt; Hogan said even with inflation fears, he expects stocks to continue to rise.\n*****\n&gt; “I think we continue to grind higher. We did the larger reset that we needed, which was six weeks - in September and two weeks of October,” he said. “The good news is demand hasn’t been destroyed. It’s been delayed.” Hogan said supply chain issues should get sorted out. He noted that some components of CPI, like higher used car prices, show that the inflation should be temporary.\n*****\n&gt; Trivariate Research founder Adam Parker said he expects the market to continue its march higher. “What would make me call for a correction in the market would be two things — hubris and debt,” he said. Neither of those are currently a problem, since he does not see signs of “management gone awry” and many companies restructured their debt.\n*****\n&gt; Managements are not engaging in arrogant behavior that would be more common at a market top, like excessive spending, he said.\n*****\n&gt; Parker said he expects mid-single digit earnings growth. “I think we could be pretty constructive for the next couple of quarters,” he said.\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/8rAJUHO.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/dhxVRcM.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/oHCQ5zT.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/NocMP7O.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/rHLkf6i.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SRRbBhh.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/68bpNyW.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/lF2TUFo.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/YuhpIuh.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/KQOTTn6.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nhff0sq.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/1xc0qaI.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/7FUnt2B.png))**\n\n*****\n\n&gt; # Best and Worst S&amp;P 500 Stocks Since September 30th\n\n&gt; The past month has seen the S&amp;P 500 pivot and rally higher after declines throughout the month of September. Since the end of Q3, the S&amp;P has now gained 8.6%, which is slightly off the highs from earlier this month. Earnings season has been in full swing over the past few weeks meaning there have been plenty of stocks with catalysts for big moves since the end of September. Below we show the stocks that have risen and fallen the most since September 30th.\n\n&gt; Topping the list is Enphase Energy (ENPH) having rallied 67.77% in the past month and a half. The bulk of that gain came after earnings as the stock leaped 24.65% the day after reporting and plenty of follow-through in the days after. Arista Networks (ANET) is also up over 50%. Like ENPH, a large portion of ANET's move came from an over 20% gain on earnings in response to a triple play. There are 18 other stocks in the S&amp;P 500 that have risen by more than 25% since the end of September. The largest of those are NVIDIA (NVDA) and Tesla (TSLA).\n\n&gt; Only 18% of the S&amp;P 500 has traded lower since September 30th, and by far the biggest decliner has been Moderna (MRNA). Although it has fallen a dramatic 41% in a short span, that eats into what have been very strong gains this year. Even after its decline so far in Q4, MRNA has still more than doubled year to date. The only other biggest decliners since September that are still up year to date are Garmin (GRMN), Allstate (ALL), Carnival (CCL), and Dish Network (DISH).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111221-930.png))**\n\n*****\n\n&gt; # Week Before Thanksgiving, DJIA up 19 of 28, but weaker lately\n\n&gt; Next week is not only November’s monthly option expiration week, but it is also the last full week of trading before Thanksgiving. DJIA has a reasonably solid track record over the last 28 years, rising 19 times the week before Thanksgiving with a median gain of 0.41%. But the other major U.S. stock market benchmarks have not been as strong and there has been more weakness across the board recently. Since 2003 DJIA is up only 9 out of the last 18 years with a median loss of 0.09%.\n\n&gt; S&amp;P is up 16 of the last 28 years with a median gain of 0.24% and down 10 of the last 18, –0.16% median loss. NASDAQ is up 16 of the last 28 years with a median gain of 0.28% and down 9 of the last 18, +0.07% median gain. Russell 2000 is up 15 of the last 28 years with a median gain of 0.54% and down 10 of the last 18, –0.20% median loss. If weakness does manifest next week, it may be a good set up for the Thanksgiving trade of buying into weakness the week before Thanksgiving and selling into strength around the holiday and typical November end-of-month strength.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/680c740a2fcf7b877a85ecba425f6bda/3d24fe398b06ac0c-55/s500x750/1ee3ab95c65a7c99a01105d66f8864bc7cdac8a7.jpg))**\n\n*****\n\n&gt; # Reasons To Be Thankful\n\n&gt; As we reach the home stretch of 2021, there is a lot to be thankful for. Stocks are having an amazing year, the economy is improving, and COVID-19 trends are going the right direction. Let’s look at some reasons to be thankful.\n\n&gt; What an amazing year and incredible recent run in stocks. The S&amp;P 500 Index just made 8 consecutive all-time highs for the first time since 1997 and it was up 17 out of 19 days for the first time since 1971. Along the way, the S&amp;P 500 was up more than 25% year-to-date in the month of November, making it one of the best years ever.\n\n&gt; The S&amp;P 500 has made 65 new all-time highs this year, tied for the second most in any year ever (tied with 1964), with only 77 in 1995 higher. Although it is still a longshot, there’s a chance we could see 13 more new highs and break the record, something to be thankful for indeed.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/11/Blog-11.10.21.png?ssl=1))**\n\n&gt; “Although the economy did slow in the third quarter, it looks like that was a one-off event due to supply chain issues and the Delta variant,” explained LPL Financial Chief Market Strategist Ryan Detrick. “We fully expect growth to pick up over the coming quarters as the economy continues to rebound thanks to a very healthy and strong U.S. consumer.”\n\n&gt; From the best services number ever, to job growth beating expectations, to inflation and supply chain issues showing signs of peaking, to consumers with trillions of dollars in savings, there are many reasons to expect the economy to remain strong as we head into 2022.\n\n&gt; At the end of the day, though, it is all about earnings. So, while the economy might have slowed in the third quarter, earnings once again came in much better than expected, showing how agile corporate America can be. S&amp;P 500 earnings are tracking to a 39% year-over-year increase in the third quarter, more than 12 percentage points above expectations with still more than 40 index constituents left to report. As our Earnings Season Dashboard shows below, there is a lot to be thankful for as it pertains to earnings.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/11/Chart-11.10.21-.png?ssl=1))**\n\n&gt; Lastly, the trends in COVID-19 are going the right way, with the number of hospitalizations down more than 50% from the September peak. With booster shots on the way and kids allowed to get vaccinated, there are many tailwinds to a continuation of the reopening we’ve been seeing. This is definitely something to be thankful for.\n\n*****\n\n&gt; # Sentiment Steadily Moving Higher\n\n&gt; The S&amp;P 500 has encountered some selling pressure this week, but that hasn't stopped sentiment from continuing its grind higher. The weekly AAII sentiment survey saw 48.0% of respondents report as bullish this week up from 41.5% last week. That puts bullish sentiment at the highest level since the first week of July when it was 0.6 percentage points higher than it is now.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Bull.png))**\n\n&gt; The increase in bullish sentiment borrowed from bears as less than a quarter of respondents reported having negative sentiment for the first time since the last week of July. Similar to bullish sentiment, bearish sentiment is now at the lowest level since the first week of July when it came in at 22.2%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Bear.png))**\n\n&gt; Overall, sentiment continues to favor bulls to a wide margin. As a result of the inverse moves in sentiment, the bull-bear spread rose to 24 from 15.5 last week. Again, that is levels not seen since early July.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Spread.png))**\n\n&gt; Neutral sentiment also declined this week falling by 4.5 percentage points to 28%. Unlike bullish and bearish sentiment, that reading is basically in the middle of the past several months' range as the reading has generally hovered around the 30% level.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Neutral.png))**\n\n*****\n\n&gt; # Small Business Economic Outlook Dour\n\n&gt; This morning the NFIB released the results of their October survey of small business sentiment. The report saw small business sentiment fall for the second month in a row. At 98.2, the index is now back to the same level it was at this past March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-HL.png))**\n\n&gt; With the decline in the headline reading, breadth was terrible with only one index that is an input to the optimism index—Plans to Make Capital Outlays—moving higher month over month. The various indices are now all over the place with regards to their own historical ranges. For example, Higher Prices, Compensation, and Compensation Plans all hit a record high while Expectations for the Economy to Improve and Credit Conditions for Regular Borrowers are just off of record lows.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Table.png))**\n\n&gt; Sales and earnings-related topics weighed on optimism in October. A net negative percentage of responding firms reported weaker actual and earnings changes. Meanwhile, the weakest percentage of respondents reported now as a good time to expand since February. Alongside that weaker reading, Outlook for General Business Conditions continues to collapse and is now at the second-lowest level on record; only slightly above the low from nine years ago. One potential factor playing into that weak sentiment is higher prices as that index hit another record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Sales.png))**\n\n&gt; While the headline Small Business Optimism index has declined, it has held up considerably well relative to the massive drop in the Outlook for General Business Conditions. As shown below, the spread between the two is now at a record high dating back to 1986.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Spread.png))**\n\n&gt; While there were some signs of cooling in October, overall the employment metrics in the report continue to be historically strong. Hiring Plans were unchanged at 26 which is off the late summer peak but still above any pre-pandemic level. While firms do not plan to take on as many workers as they had planned a few months ago, they are at least paying them better. Both Compensation and Compensation Plans continue to surge to new record highs. That has appeared to have some effect as the number of firms reporting Job Openings as Hard to Fill fell modestly. Additionally, as we noted in today's Morning Lineup, fewer businesses are reporting labor problems as their biggest concern.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Emp.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending November 12th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=dmulEWE-T6Q))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 11.14.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$TSN $OEG $OTLY $AAP $IDEX $CSPR $WMT $HD $SE $STNE $LZB $DLO $TGT $BIDU $LOW $TJX $BILI $NNOX $NVDA $CSCO $VSCO $BABA $JD $M $BJ $WOOF $AMAT $WDAY $INTU $PANW $WSM $FL**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/KQOTTn6.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/MrpShLB.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/9je3wSW.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.15.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pviG7w8.png))\n\n&gt; # ***Monday 11.15.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/hADm01O.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/peAqPvP.png))\n\n*****\n\n&gt; # ***Tuesday  11.16.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/EP2afcX.png))\n\n&gt; # ***Tuesday 11.16.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/AJnWJ7J.png))\n\n*****\n\n&gt; # ***Wednesday 11.17.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ev2lXWy.png))\n\n&gt; # ***Wednesday 11.17.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ep2sGdL.png))\n\n*****\n\n&gt; # ***Thursday 11.18.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SYzRwze.png))\n\n&gt; # ***Thursday 11.18.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ruo795N.png))\n\n*****\n\n&gt; # ***Friday 11.19.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/nzonZUm.png))\n\n*****\n\n&gt; # ***Friday 11.19.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n&gt; **(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket. :)",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning November 15th, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/qt087n/wall_street_week_ahead_for_the_trading_week/",
        "created": 1636835107.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1635865475,
        "id": "ql67f2",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hey guys, upcoming earnings! Sorry for delay :)\n\nWhich ones are you waiting for most?\n\nWhat is ahead of us:\n\nhttps://preview.redd.it/qfd0fvxd67x71.png?width=1772&amp;format=png&amp;auto=webp&amp;s=a15749892219448fe10a2f001bd739b89e629d83\n\n**MON**\n\nBMO: $ON $CNA $ALX $PCG $JELD $TKR $TRVG $AMG $ENBL $LDI $BEN\n\nAMC: $CHGG $NXPI $CLX $FANG $SPG $RIG $MOS $ANET $CLR $CAR $WMB $ZI $O $NTR\n\n**TUE**\n\nBMO: $CRSR $RACE $UAA $CTLT $BP $EL $GPN $GNRC $LPX $RL $ARCB $EPO\n\nAMC: $AMC $APPS $ATV $ZG $TMUS $LYFT $VRTX $AYX $PGR $SEDG $DVN $XPO\n\n**WED**\n\nBMO: $CVS $BCRX $WING $NCLH $MAR $DISCA $EXPI $CWH $EAT $LL $SMG $CPRI\n\nAMC: $ROKU $ETSY $QCOM $FSLY $SKLZ $TTWO $ET $MRO $SPWR $SAND $MGNI $EA $CAKE\n\n**TH**\n\nBMO: $MRNA $PENN $VIAC $GOLD $NKLA $W $ERJ $CYBR $HIMX $DDOG $MBUU $VSTO $REGN\n\nAMC: $PINS $ABNB $PTON $SQ $RKT $UBER $SWKS $BNGO $NVAX $NET $MELI $OXY $DBX\n\n**FRI**\n\nBMO: $COIN $DKGN $CGC $GT $MGA $ENB $TEN $AMXC $CNK $D $ELAN $FLR",
        "subreddit": "CanadianInvestor",
        "title": "Most Anticipated Earnings Releases for the week beginning November 1st, 2021 - it's a big one!",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/ql67f2/most_anticipated_earnings_releases_for_the_week/",
        "created": 1635894275.0
    },
    {
        "author": "asdlkf",
        "created_utc": 1636970511,
        "id": "qud33e",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Arista networks ($ANET) has been unencumbered by the silicon shortage and as a result their market share has been jumping. Customers of other network equipment have been seeing multi-month lead times in equipment delivery, while ANET fills orders.\n\nI have $600 strike Nov 19 calls...\n\nAnet just announced a 4:1 stock split Thursday the 18th so the $600 calls will convert to 4x $150 calls. \n\nI'm hopeful for a bit of a price boost post-split Friday morning.",
        "subreddit": "wallstreetbets",
        "title": "$ANET stock split coming Thursday should be interesting.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qud33e/anet_stock_split_coming_thursday_should_be/",
        "created": 1636999311.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1636809411,
        "id": "qt12j4",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 15th, 2021.\n\n# **Inflation remains the hot topic in week ahead as Walmart and other key retailers report - [(Source)](https://www.cnbc.com/2021/11/12/inflation-remains-the-hot-topic-in-week-ahead-as-walmart-and-other-key-retailers-report.html)**\n*****\n&gt; Consumers are in the spotlight in the week ahead, with the imminent release of retail sales for October and earnings from major chain stores.\n*****\n&gt; Retail sales is the big economic report for the week, when the Census Bureau releases October data on Tuesday.\n*****\n&gt; Bleakley Advisory Group chief investment officer Peter Boockvar said he’s also looking at the New York Federal Reserve’s Empire state manufacturing survey Monday for updates on prices paid. The Philadelphia Fed manufacturing survey, a measure of growth in that region, is released Thursday.\n*****\n&gt; “That’s going to be key, outside of that it’s retail sales,” Boockvar said. “I think the inflation story will continue to dominate the headlines and the news flow in markets and what the Fed does.”\n*****\n&gt; Investors will also be watching the outcome of the virtual meeting between President Joe Biden and Chinese President Xi Jinping on Monday evening.\n*****\n&gt; “I think it’s good that they would be on a talking basis,” Boockvar said. “I don’t think anything would come out of it unless there’s some shocking change in the tariff situation, but I doubt anything will happen.”\n*****\n&gt; # Chain store earnings\n&gt; The earnings season is winding down, but the big-box stores have yet to report. Walmart and Home Depot release results Tuesday, and Target reports Wednesday.\n*****\n&gt; “Walmart is a pretty big barometer for the health of the consumer for sure, and it will be interesting to see how they handle margins,” National Securities chief market strategist Art Hogan said. Rising costs have been pressuring companies across industries, and many have raised prices in response.\n*****\n&gt; Based on the latest sentiment data Friday, consumers are getting worried about rising prices. The University of Michigan’ consumer sentiment index dropped to a 10-year low of 66.8 in the preliminary November report, from 71.7 in October.\n*****\n&gt; “It’s so important to look at what consumers do, versus what they say,” Hogan said. He said retail sales are expected to be up 1.1%, compared to a 0.7% gain in September.\n*****\n&gt; “The trend that we’re looking for in the next week is sequential improvement in economic data,” Hogan said. “That’s the important thing to focus on.”\n*****\n&gt; Other data in the coming week includes industrial production Tuesday. Housing starts and building permits data will be released Wednesday.\n*****\n&gt; Inflation also proved to be a problem in the stock market this past week, after both producer prices and consumer prices increased more than expected. The consumer price index jumped 6.2%, a three-decade high.\n*****\n&gt; Stocks snapped a five-week winning streak, and all major indices were lower in the past week. The S&amp;P 500 was down 0.3% for the week, at 4,682. The Nasdaq and Russell 2000 saw the biggest declines, falling 0.7% and 1% respectively.\n*****\n&gt; Treasury yields rose, as investors bet the Federal Reserve may be forced to raise interest rates sooner to combat inflation.\n*****\n&gt; The 10-year Treasury yield was at 1.57% on Friday afternoon, and the 2-year yield traded at 0.52%. Yields move opposite price.\n*****\n&gt; The best performing major S&amp;P equities sector was materials, an inflation play that gained more than 2.5%. The worst performer was the consumer discretionary sector, which includes retailers: It declined nearly 3.2%.\n*****\n&gt; Hogan said even with inflation fears, he expects stocks to continue to rise.\n*****\n&gt; “I think we continue to grind higher. We did the larger reset that we needed, which was six weeks - in September and two weeks of October,” he said. “The good news is demand hasn’t been destroyed. It’s been delayed.” Hogan said supply chain issues should get sorted out. He noted that some components of CPI, like higher used car prices, show that the inflation should be temporary.\n*****\n&gt; Trivariate Research founder Adam Parker said he expects the market to continue its march higher. “What would make me call for a correction in the market would be two things — hubris and debt,” he said. Neither of those are currently a problem, since he does not see signs of “management gone awry” and many companies restructured their debt.\n*****\n&gt; Managements are not engaging in arrogant behavior that would be more common at a market top, like excessive spending, he said.\n*****\n&gt; Parker said he expects mid-single digit earnings growth. “I think we could be pretty constructive for the next couple of quarters,” he said.\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/8rAJUHO.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/dhxVRcM.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/oHCQ5zT.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/NocMP7O.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/rHLkf6i.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/SRRbBhh.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/68bpNyW.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/lF2TUFo.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/YuhpIuh.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/45es3q2.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nhff0sq.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/1xc0qaI.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/7FUnt2B.png))**\n\n*****\n\n&gt; # Best and Worst S&amp;P 500 Stocks Since September 30th\n\n&gt; The past month has seen the S&amp;P 500 pivot and rally higher after declines throughout the month of September. Since the end of Q3, the S&amp;P has now gained 8.6%, which is slightly off the highs from earlier this month. Earnings season has been in full swing over the past few weeks meaning there have been plenty of stocks with catalysts for big moves since the end of September. Below we show the stocks that have risen and fallen the most since September 30th.\n\n&gt; Topping the list is Enphase Energy (ENPH) having rallied 67.77% in the past month and a half. The bulk of that gain came after earnings as the stock leaped 24.65% the day after reporting and plenty of follow-through in the days after. Arista Networks (ANET) is also up over 50%. Like ENPH, a large portion of ANET's move came from an over 20% gain on earnings in response to a triple play. There are 18 other stocks in the S&amp;P 500 that have risen by more than 25% since the end of September. The largest of those are NVIDIA (NVDA) and Tesla (TSLA).\n\n&gt; Only 18% of the S&amp;P 500 has traded lower since September 30th, and by far the biggest decliner has been Moderna (MRNA). Although it has fallen a dramatic 41% in a short span, that eats into what have been very strong gains this year. Even after its decline so far in Q4, MRNA has still more than doubled year to date. The only other biggest decliners since September that are still up year to date are Garmin (GRMN), Allstate (ALL), Carnival (CCL), and Dish Network (DISH).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111221-930.png))**\n\n*****\n\n&gt; # Week Before Thanksgiving, DJIA up 19 of 28, but weaker lately\n\n&gt; Next week is not only November’s monthly option expiration week, but it is also the last full week of trading before Thanksgiving. DJIA has a reasonably solid track record over the last 28 years, rising 19 times the week before Thanksgiving with a median gain of 0.41%. But the other major U.S. stock market benchmarks have not been as strong and there has been more weakness across the board recently. Since 2003 DJIA is up only 9 out of the last 18 years with a median loss of 0.09%.\n\n&gt; S&amp;P is up 16 of the last 28 years with a median gain of 0.24% and down 10 of the last 18, –0.16% median loss. NASDAQ is up 16 of the last 28 years with a median gain of 0.28% and down 9 of the last 18, +0.07% median gain. Russell 2000 is up 15 of the last 28 years with a median gain of 0.54% and down 10 of the last 18, –0.20% median loss. If weakness does manifest next week, it may be a good set up for the Thanksgiving trade of buying into weakness the week before Thanksgiving and selling into strength around the holiday and typical November end-of-month strength.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/680c740a2fcf7b877a85ecba425f6bda/3d24fe398b06ac0c-55/s500x750/1ee3ab95c65a7c99a01105d66f8864bc7cdac8a7.jpg))**\n\n*****\n\n&gt; # Reasons To Be Thankful\n\n&gt; As we reach the home stretch of 2021, there is a lot to be thankful for. Stocks are having an amazing year, the economy is improving, and COVID-19 trends are going the right direction. Let’s look at some reasons to be thankful.\n\n&gt; What an amazing year and incredible recent run in stocks. The S&amp;P 500 Index just made 8 consecutive all-time highs for the first time since 1997 and it was up 17 out of 19 days for the first time since 1971. Along the way, the S&amp;P 500 was up more than 25% year-to-date in the month of November, making it one of the best years ever.\n\n&gt; The S&amp;P 500 has made 65 new all-time highs this year, tied for the second most in any year ever (tied with 1964), with only 77 in 1995 higher. Although it is still a longshot, there’s a chance we could see 13 more new highs and break the record, something to be thankful for indeed.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/11/Blog-11.10.21.png?ssl=1))**\n\n&gt; “Although the economy did slow in the third quarter, it looks like that was a one-off event due to supply chain issues and the Delta variant,” explained LPL Financial Chief Market Strategist Ryan Detrick. “We fully expect growth to pick up over the coming quarters as the economy continues to rebound thanks to a very healthy and strong U.S. consumer.”\n\n&gt; From the best services number ever, to job growth beating expectations, to inflation and supply chain issues showing signs of peaking, to consumers with trillions of dollars in savings, there are many reasons to expect the economy to remain strong as we head into 2022.\n\n&gt; At the end of the day, though, it is all about earnings. So, while the economy might have slowed in the third quarter, earnings once again came in much better than expected, showing how agile corporate America can be. S&amp;P 500 earnings are tracking to a 39% year-over-year increase in the third quarter, more than 12 percentage points above expectations with still more than 40 index constituents left to report. As our Earnings Season Dashboard shows below, there is a lot to be thankful for as it pertains to earnings.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/11/Chart-11.10.21-.png?ssl=1))**\n\n&gt; Lastly, the trends in COVID-19 are going the right way, with the number of hospitalizations down more than 50% from the September peak. With booster shots on the way and kids allowed to get vaccinated, there are many tailwinds to a continuation of the reopening we’ve been seeing. This is definitely something to be thankful for.\n\n*****\n\n&gt; # Sentiment Steadily Moving Higher\n\n&gt; The S&amp;P 500 has encountered some selling pressure this week, but that hasn't stopped sentiment from continuing its grind higher. The weekly AAII sentiment survey saw 48.0% of respondents report as bullish this week up from 41.5% last week. That puts bullish sentiment at the highest level since the first week of July when it was 0.6 percentage points higher than it is now.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Bull.png))**\n\n&gt; The increase in bullish sentiment borrowed from bears as less than a quarter of respondents reported having negative sentiment for the first time since the last week of July. Similar to bullish sentiment, bearish sentiment is now at the lowest level since the first week of July when it came in at 22.2%.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Bear.png))**\n\n&gt; Overall, sentiment continues to favor bulls to a wide margin. As a result of the inverse moves in sentiment, the bull-bear spread rose to 24 from 15.5 last week. Again, that is levels not seen since early July.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Spread.png))**\n\n&gt; Neutral sentiment also declined this week falling by 4.5 percentage points to 28%. Unlike bullish and bearish sentiment, that reading is basically in the middle of the past several months' range as the reading has generally hovered around the 30% level.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/111121-AAII-Neutral.png))**\n\n*****\n\n&gt; # Small Business Economic Outlook Dour\n\n&gt; This morning the NFIB released the results of their October survey of small business sentiment. The report saw small business sentiment fall for the second month in a row. At 98.2, the index is now back to the same level it was at this past March.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-HL.png))**\n\n&gt; With the decline in the headline reading, breadth was terrible with only one index that is an input to the optimism index—Plans to Make Capital Outlays—moving higher month over month. The various indices are now all over the place with regards to their own historical ranges. For example, Higher Prices, Compensation, and Compensation Plans all hit a record high while Expectations for the Economy to Improve and Credit Conditions for Regular Borrowers are just off of record lows.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Table.png))**\n\n&gt; Sales and earnings-related topics weighed on optimism in October. A net negative percentage of responding firms reported weaker actual and earnings changes. Meanwhile, the weakest percentage of respondents reported now as a good time to expand since February. Alongside that weaker reading, Outlook for General Business Conditions continues to collapse and is now at the second-lowest level on record; only slightly above the low from nine years ago. One potential factor playing into that weak sentiment is higher prices as that index hit another record.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Sales.png))**\n\n&gt; While the headline Small Business Optimism index has declined, it has held up considerably well relative to the massive drop in the Outlook for General Business Conditions. As shown below, the spread between the two is now at a record high dating back to 1986.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Spread.png))**\n\n&gt; While there were some signs of cooling in October, overall the employment metrics in the report continue to be historically strong. Hiring Plans were unchanged at 26 which is off the late summer peak but still above any pre-pandemic level. While firms do not plan to take on as many workers as they had planned a few months ago, they are at least paying them better. Both Compensation and Compensation Plans continue to surge to new record highs. That has appeared to have some effect as the number of firms reporting Job Openings as Hard to Fill fell modestly. Additionally, as we noted in today's Morning Lineup, fewer businesses are reporting labor problems as their biggest concern.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/110921-NFIB-Emp.png))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/45es3q2.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/EKBM7mR.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/9je3wSW.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.15.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/pviG7w8.png))\n\n&gt; # ***Monday 11.15.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/hADm01O.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/peAqPvP.png))\n\n*****\n\n&gt; # ***Tuesday  11.16.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/EP2afcX.png))\n\n&gt; # ***Tuesday 11.16.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/AJnWJ7J.png))\n\n*****\n\n&gt; # ***Wednesday 11.17.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ev2lXWy.png))\n\n&gt; # ***Wednesday 11.17.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/Ep2sGdL.png))\n\n*****\n\n&gt; # ***Thursday 11.18.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/SYzRwze.png))\n\n&gt; # ***Thursday 11.18.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ruo795N.png))\n\n*****\n\n&gt; # ***Friday 11.19.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/nzonZUm.png))\n\n*****\n\n&gt; # ***Friday 11.19.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Alibaba Group Holding Ltd. $166.81\n&gt; **Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, November 18, 2021. The consensus earnings estimate is $1.87 per share on revenue of $31.98 billion and the Earnings Whisper ® number is $1.99 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.25% with revenue increasing by 40.03%. Short interest has decreased by 1.1% since the company's last earnings release while the stock has drifted lower by 14.5% from its open following the earnings release to be 18.4% below its 200 day moving average of $204.35. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, October 12, 2021 there was some notable buying of 37,263 contracts of the $40.00 put expiring on Friday, December 17, 2021. Option traders are pricing in a 6.5% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # NVIDIA Corp. $303.90\n&gt; **NVIDIA Corp. (NVDA)** is confirmed to report earnings at approximately 4:20 PM ET on Wednesday, November 17, 2021. The consensus earnings estimate is $1.10 per share on revenue of $6.82 billion and the Earnings Whisper ® number is $1.16 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for earnings of $1.04 to $1.16 per share. Consensus estimates are for year-over-year earnings growth of 44.26% with revenue increasing by 44.31%. Short interest has decreased by 12.8% since the company's last earnings release while the stock has drifted higher by 55.9% from its open following the earnings release to be 66.2% above its 200 day moving average of $182.90. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, November 4, 2021 there was some notable buying of 23,417 contracts of the $300.00 call expiring on Friday, November 19, 2021. Option traders are pricing in a 6.9% move on earnings and the stock has averaged a 2.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=NVDA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Walmart Inc. $147.76\n&gt; **Walmart Inc. (WMT)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, November 16, 2021. The consensus earnings estimate is $1.39 per share on revenue of $135.74 billion and the Earnings Whisper ® number is $1.47 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat The company's guidance was for earnings of $1.30 to $1.40 per share. Consensus estimates are for year-over-year earnings growth of 3.73% with revenue increasing by 0.77%. Short interest has decreased by 28.7% since the company's last earnings release while the stock has drifted lower by 1.8% from its open following the earnings release to be 4.7% above its 200 day moving average of $141.10. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, November 8, 2021 there was some notable buying of 5,890 contracts of the $152.50 call expiring on Friday, November 19, 2021. Option traders are pricing in a 3.9% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=WMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Tyson Foods Inc. $81.23\n&gt; **Tyson Foods Inc. (TSN)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, November 15, 2021. The consensus earnings estimate is $2.19 per share on revenue of $12.43 billion and the Earnings Whisper ® number is $2.55 per share. Investor sentiment going into the company's earnings release has 60% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 20.99% with revenue increasing by 8.46%. Short interest has increased by 58.2% since the company's last earnings release while the stock has drifted higher by 8.3% from its open following the earnings release to be 6.6% above its 200 day moving average of $76.17. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, November 12, 2021 there was some notable buying of 10,821 contracts of the $87.50 call expiring on Friday, December 17, 2021. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=TSN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Target Corp. $260.02\n&gt; **Target Corp. (TGT)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, November 17, 2021. The consensus earnings estimate is $2.82 per share on revenue of $24.57 billion and the Earnings Whisper ® number is $3.17 per share. Investor sentiment going into the company's earnings release has 77% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1.08% with revenue increasing by 8.56%. Short interest has decreased by 8.0% since the company's last earnings release while the stock has drifted higher by 4.4% from its open following the earnings release to be 15.3% above its 200 day moving average of $225.54. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, November 5, 2021 there was some notable buying of 5,141 contracts of the $230.00 put expiring on Friday, December 17, 2021. Option traders are pricing in a 6.0% move on earnings and the stock has averaged a 5.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=TGT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Home Depot, Inc. $372.63\n&gt; **Home Depot, Inc. (HD)** is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, November 16, 2021. The consensus earnings estimate is $3.40 per share on revenue of $34.49 billion and the Earnings Whisper ® number is $3.50 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 6.92% with revenue increasing by 2.84%. Short interest has decreased by 18.0% since the company's last earnings release while the stock has drifted higher by 16.1% from its open following the earnings release to be 17.6% above its 200 day moving average of $316.97. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 2, 2021 there was some notable buying of 3,511 contracts of the $390.00 call expiring on Friday, December 17, 2021. Option traders are pricing in a 3.5% move on earnings and the stock has averaged a 2.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=HD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lucid Group $43.93\n&gt; **Lucid Group (LCID)** is confirmed to report earnings after the market closes on Monday, November 15, 2021. The consensus estimate is for a loss of $0.22 per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat On Monday, November 8, 2021 there was some notable buying of 20,444 contracts of the $50.00 call expiring on Friday, November 19, 2021.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=LCID&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Sea Limited $341.29\n&gt; **Sea Limited (SE)** is confirmed to report earnings at approximately 6:30 AM ET on Tuesday, November 16, 2021. The consensus estimate is for a loss of $0.67 per share on revenue of $2.34 billion and the Earnings Whisper ® number is ($0.75) per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 3.08% with revenue increasing by 93.04%. Short interest has increased by 28.1% since the company's last earnings release while the stock has drifted higher by 15.3% from its open following the earnings release to be 21.6% above its 200 day moving average of $280.58. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, November 10, 2021 there was some notable buying of 1,488 contracts of the $410.00 call expiring on Friday, November 26, 2021. Option traders are pricing in a 8.7% move on earnings and the stock has averaged a 6.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # FreightCar America Inc. $4.83\n&gt; **FreightCar America Inc. (RAIL)** is confirmed to report earnings at approximately 7:30 AM ET on Monday, November 15, 2021. The consensus estimate is for a loss of $0.22 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 71.43% with revenue increasing by 3,863.97%. Short interest has decreased by 26.2% since the company's last earnings release while the stock has drifted lower by 8.0% from its open following the earnings release to be 5.0% below its 200 day moving average of $5.08. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 28, 2021 there was some notable buying of 867 contracts of the $5.00 call expiring on Friday, November 19, 2021. The stock has averaged a 13.9% move on earnings in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=RAIL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Macy's, Inc. $30.46\n&gt; **Macy's, Inc. (M)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, November 18, 2021. The consensus earnings estimate is $0.31 per share on revenue of $5.12 billion and the Earnings Whisper ® number is $0.47 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 263.16% with revenue increasing by 28.32%. Short interest has increased by 12.9% since the company's last earnings release while the stock has drifted higher by 58.3% from its open following the earnings release to be 52.3% above its 200 day moving average of $19.99. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 3, 2021 there was some notable buying of 6,498 contracts of the $42.00 call expiring on Friday, December 17, 2021. Option traders are pricing in a 11.6% move on earnings and the stock has averaged a 5.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=M&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/stocks. :)",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning November 15th, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/qt12j4/wall_street_week_ahead_for_the_trading_week/",
        "created": 1636838211.0
    },
    {
        "author": "Basic-Computer9692",
        "created_utc": 1637244961,
        "id": "qwqo2t",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Let’s get ANET going!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qwqo2t/lets_get_anet_going/",
        "created": 1637273761.0
    },
    {
        "author": "Blue_Blueberry5402",
        "created_utc": 1635858514,
        "id": "ql3tyc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Is ANET too late to buy? I panic sold at a low price in September and I like the company. Do you think this spike in price will be short lived?",
        "url": "https://www.reddit.com/r/investing/comments/ql3tyc/is_anet_too_late_to_buy_i_panic_sold_at_a_low/",
        "created": 1635887314.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1635865436,
        "id": "ql66xi",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hey guys, upcoming earnings! Sorry for delay :)\n\nWhich ones are you waiting for most?\n\nWhat is ahead of us:\n\nhttps://preview.redd.it/t52zft8967x71.png?width=1772&amp;format=png&amp;auto=webp&amp;s=f945f207e29987edb9796917197422bbe2603a9d\n\n**MON**\n\nBMO: $ON $CNA $ALX $PCG $JELD $TKR $TRVG $AMG $ENBL $LDI $BEN\n\nAMC: $CHGG $NXPI $CLX $FANG $SPG $RIG $MOS $ANET $CLR $CAR $WMB $ZI $O $NTR\n\n**TUE**\n\nBMO: $CRSR $RACE $UAA $CTLT $BP $EL $GPN $GNRC $LPX $RL $ARCB $EPO\n\nAMC: $AMC $APPS $ATV $ZG $TMUS $LYFT $VRTX $AYX $PGR $SEDG $DVN $XPO\n\n**WED**\n\nBMO: $CVS $BCRX $WING $NCLH $MAR $DISCA $EXPI $CWH $EAT $LL $SMG $CPRI\n\nAMC: $ROKU $ETSY $QCOM $FSLY $SKLZ $TTWO $ET $MRO $SPWR $SAND $MGNI $EA $CAKE\n\n**TH**\n\nBMO: $MRNA $PENN $VIAC $GOLD $NKLA $W $ERJ $CYBR $HIMX $DDOG $MBUU $VSTO $REGN\n\nAMC: $PINS $ABNB $PTON $SQ $RKT $UBER $SWKS $BNGO $NVAX $NET $MELI $OXY $DBX\n\n**FRI**\n\nBMO: $COIN $DKGN $CGC $GT $MGA $ENB $TEN $AMXC $CNK $D $ELAN $FLR",
        "subreddit": "options",
        "title": "Most Anticipated Earnings Releases for the week beginning November 1st, 2021 - it's a big one!",
        "url": "https://www.reddit.com/r/options/comments/ql66xi/most_anticipated_earnings_releases_for_the_week/",
        "created": 1635894236.0
    },
    {
        "author": "BigReturns",
        "created_utc": 1637297402,
        "id": "qx8k3j",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Did anybody else buy ANET first thing this morning when it was showing down 75% from $430 to $130 a share? I did and now it’s not reading it ever went down! What’s up with that?\n\nAny feedback would be so very appreciated. Thanks in advance",
        "subreddit": "investing",
        "title": "The stock this morning that dropped 75%",
        "url": "https://www.reddit.com/r/investing/comments/qx8k3j/the_stock_this_morning_that_dropped_75/",
        "created": 1637326202.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1635903650,
        "id": "qljs2h",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " Three ETF's per winner (when available)  \n\n\n**ETF Ticker | % invested in Winner | ETF Full Name**  \n\n\n**Industrials**: ETFs investing in Rockwell Automation  \nUTRN-- 4.04%  Vesper U.S. Large Cap Short-Term Reversal Strategy ETF  \nVSL-- 3.94%  Volshares Large Cap ETF  \nECOZ-- 3.14%  TrueShares ESG Active Opportunities ETF  \n\n\n**Health Care**: ETFs investing in McKesson Corporation  \nPPH-- 4.57%  VanEck Pharmaceutical ETF  \nPKW-- 4.13%  Invesco BuyBack Achievers™ ETF  \nFXG-- 3.37%  First Trust Consumer Staples AlphaDEX Fund  \n\n\n**Information Technology**: ETFs investing in Arista Networks Inc  \nIGN-- 9.68%  iShares North American Tech-Multimedia Networking ETF  \nBUL-- 4.48%  Pacer US Cash Cows Growth ETF  \nIYZ-- 3.82%  iShares U.S. Telecommunications ETF  \n\n\n**Communication Services**: ETFs investing in Live Nation Entertainment, Inc.  \nEWCO-- 5.53%  Invesco S&amp;P 500 Equal Weight Communication Services ETF  \nPEJ-- 3.12%  Invesco Dynamic Leisure &amp; Entertainment ETF  \nOGIG-- 1.65%  O’Shares Global Internet Giants ETF  \n\n\n**Consumer Discretionary**: ETFs investing in Under Armour Inc Class A  \nN/A--    \n   \n   \n\n\n**Utilities**: ETFs investing in American Water Works Company Inc  \nCGW-- 9.50%  Invesco S&amp;P Global Water Index ETF  \nPHO-- 7.69%  Invesco Water Resources ETF  \nEBLU-- 7.21%  Ecofin Global Water ESG Fund  \n\n\n**Financials**: ETFs investing in Franklin Resources, Inc.  \nSDEI-- 3.87%  Sound Equity Income ETF  \nKNG-- 1.74%  FT Cboe Vest S&amp;P 500 Dividend Aristocrats Target Income ETF  \nSDY-- 1.52%  SPDR S&amp;P Dividend ETF  \n\n\n**Materials**: ETFs investing in DuPont de Nemours Inc  \nABEQ-- 4.24%  Absolute Core Strategy ETF  \nJHMA-- 3.98%  John Hancock Multifactor Materials ETF  \nXLB-- 3.73%  Materials Select Sector SPDR Fund  \n\n\n**Real Estate**: ETFs investing in Simon Property Group Inc  \nICF-- 5.26%  iShares Cohen &amp; Steers REIT ETF  \nXLRE-- 4.75%  Real Estate Select Sector SPDR Fund  \nRWR-- 4.62%  SPDR Dow Jones REIT ETF  \n\n\n**Consumer Staples**: ETFs investing in Estee Lauder Companies Inc  \nJRNY-- 4.22%  ALPS Global Travel Beneficiaries ETF  \nXLP-- 4.19%  Consumer Staples Select Sector SPDR Fund  \nPSL-- 4.10%  Invesco DWA Consumer Staples Momentum ETF  \n\n\n**Energy**: ETFs investing in Diamondback Energy Inc  \nRYE-- 5.46%   Invesco S&amp;P 500® Equal Weight Energy ETF  \nFXN-- 4.95%   First Trust Energy AlphaDEX Fund  \nFCG-- 4.27%   First Trust Natural Gas ETF  \n\n\nHappy investing!",
        "subreddit": "StockMarket",
        "title": "ETFs with Investments in SP500 Winners of 11/2/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/qljs2h/etfs_with_investments_in_sp500_winners_of_1122021/",
        "created": 1635932450.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1635903632,
        "id": "qljrv4",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " **Winners**  \n\n\nWinner of the day by sector | **SP500**:  \n\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | Rockwell Automation | **ROK** | 7.35%  \n2. **Health Care** | McKesson Corporation | **MCK** | 5.21%  \n3. **Information Technology** | Arista Networks Inc | **ANET** | 20.39%  \n4. **Communication Services** | Live Nation Entertainment, Inc. | **LYV** | 2.63%  \n5. **Consumer Discretionary** | Under Armour Inc Class A | **UAA** | 16.47%  \n6. **Utilities** | American Water Works Company Inc | **AWK** | 1.79%  \n7. **Financials** | Franklin Resources, Inc. | **BEN** | 7.20%  \n8. **Materials** | DuPont de Nemours Inc | **DD** | 8.79%  \n9.  **Real Estate** | Simon Property Group Inc | **SPG** | 6.44%  \n10. **Consumer Staples** | Estee Lauder Companies Inc | **EL** | 4.14%  \n11. **Energy** | Diamondback Energy Inc | **FANG** | 2.54%  \n\n\n**Losers**  \n\n\nLoser of the day by sector | **SP500**:  \n\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **Generac Holdings Inc.** | GNRC | **-4.39%**  \n2. Health Care | **Incyte Corporation** |  INCY | **-8.46%**  \n3. Information Technology | **Global Payments Inc** | GPN | **-9.24%**  \n4.  Communication Services | **Match Group Inc** | MTCH | **-3.60%**  \n5. Consumer Discretionary | **Ralph Lauren Corp** | RL | **-9.70%**  \n6. Utilities | **NRG Energy Inc** | NRG | **-2.27%**  \n7. Financials | **Citizens Financial Group Inc** | CFG | **-1.58%**  \n8. Materials | **Mosaic Co** | MOS | **-9.21%**  \n9. Real Estate | **Weyerhaeuser Co** | WY | **-2.24%**  \n10. Consumer Staples | **Lamb Weston Holdings Inc** | LW | **-1.48%**  \n11. Energy | **Marathon Petroleum Corp** | MPC | **-3.90%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 11/2/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/qljrv4/sp500_winners_and_losers_1122021/",
        "created": 1635932432.0
    },
    {
        "author": "Blue_Blueberry5402",
        "created_utc": 1635855505,
        "id": "ql2x1s",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "I panic sold a my ANET and ZBRA in September. Is it worth it buying back at ANETs high price?",
        "url": "https://www.reddit.com/r/stocks/comments/ql2x1s/i_panic_sold_a_my_anet_and_zbra_in_september_is/",
        "created": 1635884305.0
    },
    {
        "author": "Big-Accident1145",
        "created_utc": 1637249531,
        "id": "qws9at",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "ANET Stock Split -Help!",
        "url": "https://www.reddit.com/r/stocks/comments/qws9at/anet_stock_split_help/",
        "created": 1637278331.0
    }
]