[
    {
        "author": "jyliu86",
        "created_utc": 1628110661,
        "id": "oy26kf",
        "num_comments": 58,
        "num_crossposts": 0,
        "selftext": "In summary, I expect another wave of lockdowns to go into effect, but they will go into effect too late, and do too little to have any effect on containing the next COVID19 Delta Variant outbreak. \n\nUnfortunately, I also don't think there's any market play beyond building up 12 months of cash for rent/daily expenses, and to stockpile on toilet paper now before the next shopping spree starts.\n\nIn general, when dealing with disease, the public health options are development of a cure, development of vaccine, or implementation of quarantine. Remdesivir is the only available treatment, and requires IV application, and thus is not effective for widespread use. Regarding quarantine, I point you to the news.\n\nRegarding the vaccine, it seems that the recent mRNA vaccines only have \\~50% efficacy in preventing infection. The CDC tracked an outbreak in Massachusetts due to a July 4th party in Provincetown, MA\n\n[https://www.cdc.gov/mmwr/volumes/70/wr/mm7031e2.htm?s\\_cid=mm7031e2\\_w](https://www.cdc.gov/mmwr/volumes/70/wr/mm7031e2.htm?s_cid=mm7031e2_w)\n\nThe study shows a nearly 1:1 infection count of vaccinated to unvaccinated individuals. \n\nFor those of you not in the know, this is one of the biggest LGBTQ parties in the US, so is pretty left leaning. We can assume a pretty high vaccination rate. This is actually good for vaccine efficacy due to Simpson's paradox, but it does show that breakthrough infection is real, and not to be underestimated. The CDC did not estimate vaccine efficacy and warned not to do so due to small sample sizes.\n\nThe UK did.\n\n[http://hdl.handle.net/10044/1/90800](http://hdl.handle.net/10044/1/90800)\n\nBased on their REACT study, which randomly samples ALL UK residents, and not just sick people, they estimate a vaccine efficacy of 50%-60%. Do note that the error bars on these numbers are BIG, like 20%-95% big.\n\nThe vaccine seems to be on par to a flu shot in terms of efficacy. Unfortunately, flu has an r0 of 1-2. The original COVID19 had an r0 of 2-3, and delta looks to be 4-9.\n\nGiven delta is about 2x-3x more transmissible, and the vaccine is 1/2 has effective, lockdowns and masking are inconsistent, I'd estimate we're going to see COVID spread on par to the early pandemic. We're currently back to infection numbers similar to Nov/Dec 2020. Even if all vaccine hesitancy vanished overnight, given the mediocre efficacy coupled with high r0, vaccinations must be coupled with social distancing to control the spread. \n\nGiven human nature and politics, a lockdown NOW could theoretically control the spread. That is politically unviable. A lockdown later will be too late due to exponential growth, but will occur anyway once bodies start to hit the floor. \n\nThe doctor's haven't figured out why the vaccine isn't working, it could be waning immunity amongst the early vaccinations, or just a poor match. This would necessitate a booster, which the WHO just announced a moritorium on so poor countries can get vaccinated, or a delta specific booster, which Pfizer and Moderna are working on, but there's no data if it works or not. Of course, rich countries will likely give the WHO the finger, but this only helps if this is waning immunity and not vaccine mismatch.\n\nSo, what's this mean for the markets? Likely 🌈🐻 \n\nBut in the mean time, everything's stupid expensive and I have no idea if/when this would occur. So, I'll give the personal finance advice to keep 6-12 months of cash to pay for rent/food if everything goes to shit. Even assuming that an uncontrolled pandemic occurs, I'd estimate a COVID-19 mortality of 1%-3% to not permanently cripple the economy. Unless your country is like Peru with a case mortality rate of \\~10%, in which case you're pretty f\\*cked. \n\n[https://coronavirus.jhu.edu/data/mortality](https://coronavirus.jhu.edu/data/mortality)\n\nBoomers are probably going to get killed by this virus, so investing in Zacks Funeral Services industry may be a good call: SCI, HI, MATW, CSV. Unfortunately, the market looks like they already priced this in.\n\nSo, stay safe. Get vaccinated. Socially distance. But it probably won't be enough.",
        "subreddit": "wallstreetbets",
        "title": "Prediction: Delta Variant Will Force Another Lockdown",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oy26kf/prediction_delta_variant_will_force_another/",
        "created": 1628139461.0
    },
    {
        "author": "prostockadvice",
        "created_utc": 1627867787,
        "id": "ow4rxh",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "# Major US indices pulled back Friday, but not all that much. I believe we are almost at a tipping point for an after summer correction, which will pull down the market across the board, gearing up for a run into the holiday season.  \n\nhttps://preview.redd.it/1bcspupbkue71.png?width=864&amp;format=png&amp;auto=webp&amp;s=02a41e032419f26faad300dd4bb7390095aacc6e\n\n Only one alert triggered Friday and that was an $**ABNB** put.  After starting on this project, I believe that $**ABNB** is overvalued and doesn't have the sustainability that the current market price implies. Therefore, I've put in two put alerts. Go small.  \n\nhttps://preview.redd.it/ejhnm9agkue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=40397c1f5393200798dd4c6033b186b808f6d782\n\n A better positions that I would prefer is entering into a bigger put at the YTD VWAP. I have already set an alert for this stronger resistance, but there is no guarantee if and when it will reach it.  \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#  Positions from Last Week\n\n**Ongoing** \t\t(I will consider cutting if Monday starts off red; still plenty of time left on)\n\n**$COIN** **-0.2%** (Shares)\n\n**$CAT -10%** (Calls)\n\n**$LOGI -7.2%** (Calls)\n\n&amp;#x200B;\n\n**New**\n\n**$ABNB +1.3%** (Puts)\n\n&amp;#x200B;\n\n### Closed\n\n**$TSLA +10% (**Closed)\n\n**$EBON +29%** (Closed)\n\n**$IRM +25%** (Closed)\n\n**$TSLA** \\+**117%** (Calls) \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#  New and Adjusted Alerts \n\n $**HOOD** IPO'd last week and I will be waiting to enter at $10... (Just Kidding) I'm staying away from **Robinhood** for now.  \n\nhttps://preview.redd.it/j2n60j2pkue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=9b8caa6b52af8d8929c9c14ba5553cd9a6df1037\n\n&amp;#x200B;\n\n After a great week with $**TSLA** calls, I've entered in another similar alert as the last two. If **Tesla** pulls back to the 50MA, I'll buy more calls. However, there is a chance that $**TSLA** keeps running next week therefore I am not interested in short term puts.  \n\nhttps://preview.redd.it/xusig0cqkue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=22d5c663bbebc6b93cb2bf8f818047304dcf42da\n\n&amp;#x200B;\n\n $**MT** is looking a little bit overbought, and even though I and many other analysts are bullish long term, I believe that this can be a good time to lock in some quick profits. Once it consolidates toward the 50MA, or even the YTD VWAP, we can re-enter with calls.  \n\nhttps://preview.redd.it/ju2q5ggrkue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=bd9e8be9ff1955c146f200b161d86d67da242b7a\n\n&amp;#x200B;\n\n I'm really liking $**CRM** going into August. The 180MA is approaching a large volume shelf that indicates a lot of buying will happen there. More so, the YTD VWAP is lurking at those levels as well. Long term bullish on **Salesforce**, and August is historically one of the best months for the stock. October or November calls, look tempting around the $230 level.  \n\nhttps://preview.redd.it/udz6h6jskue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=07559317d5d5618e74012c3ab7e3ae858b4b86db\n\n&amp;#x200B;\n\n \n\n$**TSM**, **Taiwan Semiconductor**, is, I believe, an undervalued company that has a fair price of around $130+. This is a great opportunity to pick up calls for November or EOY. September and October are some of the best months for **TSM** according to Trend Spider's Seasonality Chart. At current levels, the 50, 180, and a huge volume shelf are converging. \n\nhttps://preview.redd.it/21u9xyiukue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=0c03a9034effbf1c0594ba5aa34a48a6db2978b4\n\n&amp;#x200B;\n\n $**AXP** has had an amazing run this year August is one of the better months over the past decade. I believe consumer spending has and will increase and monthly calls or vertical spreads are perfect here.  \n\nhttps://preview.redd.it/jpgpa2hvkue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=0c2b50116bebade25f92b68a5e8f9b4437295997\n\n&amp;#x200B;\n\n **$AAP, Advance Auto Parts**, is still an interesting play for me. Everyone has probably heard by now that used car prices have gone up a lot. If we can get a consolidation around the 50MA, I think it is worth it to buy calls. However, I won't be waiting much longer for this one. I'll give it another week.  \n\nhttps://preview.redd.it/g655tlewkue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=0966c88748b44fd8f3317333e8233339c43c3644\n\n&amp;#x200B;\n\n $**VRT** also had a good week, up from the 50MA. I'm waiting for a resistance bounce to enter some short term puts.  \n\nhttps://preview.redd.it/r3kkaddxkue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=87d502222fa3701d87bf608c6284efa2dbc8fad2\n\n&amp;#x200B;\n\n I'm still waiting for **$X, US Steel**, to pull back to the 180ma. As you can see last it just came off a 180ma bounce, but not quite low enough to hit my trigger. I'm a patient man and I'll wait again. This is a good play going into October and November, so we have some time to enter.  \n\nhttps://preview.redd.it/09oy8sgykue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=ea114b1ade318baa53487eac738ca13ff3002470\n\n&amp;#x200B;\n\n **$AI** is to overhyped, and puts at upper resistance will pay significantly in my opinion. I've reupped the time on this alert and will wait for a bounce to enter.  \n\nhttps://preview.redd.it/snkwzjizkue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=acdd5c9d6fa626471ff21cf572b84a84a18343c7\n\n&amp;#x200B;\n\n One of my favorite shorts is $**EBON**. Probably by now you know I have personal experience with this company. Sort them into the ground, please. This time the alert is set to trigger at the 50 MA and I'll go into a bigger position.  \n\nhttps://preview.redd.it/bgr3pqj0lue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=20bef00a73ba2a1e68a0f2e2af0930cede9b9a95\n\n&amp;#x200B;\n\n $**ETSY** is next and the interesting thing about this stock, since its IPO, it has never had a positive October. I will be keeping this in mind when I buy calls at support. September usually is a good month. Getting in and out of this one is most likely the key.  \n\nhttps://preview.redd.it/whhewch1lue71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=58fd6d95a96e7fb55d0089c593522f3863b47043\n\n&amp;#x200B;\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n ^(Disclaimer: The comments opinions and analysis expressed herein are for informational and educational purpose only and should not be considered as individual advice or recommendations.)",
        "subreddit": "options",
        "title": "13 Options Plays for this Week - Journey to $1 Million is BACK",
        "url": "https://www.reddit.com/r/options/comments/ow4rxh/13_options_plays_for_this_week_journey_to_1/",
        "created": 1627896587.0
    },
    {
        "author": "HSeldon2020",
        "created_utc": 1628293332,
        "id": "ozid6u",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "**The Challenge:** *Double a $30K account in four months - 88 trading days, without using low float momentum trades. This is the update after two weeks, or ten trading days.*\n\n**The Reason:** *I set up this account specifically for this challenge.  Posting trades from my regular account was not instructive - mainly because, the trades were not relatable (e.g. most people are not buying 10 ITM TSLA calls that are 3 weeks out).  However, I wanted to show traders that it is possible to quickly grow your Day Trading account without having to do low float momentum trades (which is a fast way for traders, especially new traders, to lose a lot of money).  Instead, this challenge intends to utilize foundational Day Trading methods (i.e. Relative Strength to SPY) in a completely transparent way.  The amount I chose to start with was $30, as the federal guidelines requires $25K to Day Trade and I added $5K for some cushion.*\n\nIn order to reach this goal I would need to average $341 a day.  \n\nEvery trade since this challenge has started has been live posted in r/RealDayTrading as they happen.\n\nI am also providing the link to the accounts' TraderSync log.  Here is the updated log as of the end of day today:\n\n[https://shared.tradersync.com/hariseldon2021](https://shared.tradersync.com/hariseldon2021)\n\nI have not finished updating the \"setups\" and \"mistakes\" in Tradersync, I will do that this weekend.\n\n*Note: There are still some open positions that TraderSync does not report until they close, including calls for* ***DDOG*** *and puts for* ***CL.***  *As well as an open* ***/ES*** *short.  Thus, the total is overstated by about $1,700.  Only closed trades are included.*\n\nAlso being carried into next week are **IR** calls, **MA** puts, **SFIX** puts, **SNAP** calls and **SPCE** calls.\n\nThe total account value is at $35,321.48, almost $1,000 over goal.  \n\nCommissions and Fees paid so far: $669.82\n\nTotal number of trades: 223 - with 30 trades considered \"Breakeven\" (*within $25)* and 8 open trades.  Of the 185 remaining trades that were either winners or losers:\n\nWinners: 139 - 75.1%\n\nLosers: 46 - 24.9%\n\n**Notes:** Computer issues limited me to only a few trades today, and I took part of yesterday off.\n\nI made several mistakes (**PINS, MRNA**) that I outlined in other posts, and Ameritrade closed a lotto trade last Friday which cost me roughly $500 in profit. \n\nThis challenge is not for me to prove anything about my trading - to be honest, I do not need to - I have traded for a living for the past 3 years, make a good living out of it and have absolutely no need for validation.  However, after posting on the various trading forums here and speaking to hundreds of traders over the past two years, several things have become clear:\n\n1) Most people believe Day Trading is primarily *Gap n Go* strategies, which is what most so-called \"gurus\" market to people.  **This is not Day Trading**.  In fact, this method is *extremely difficult* and the last thing new traders should be trying.\n\n2) Everyone else believes that it is impossible to be a consistently profitable Day Trader.  Now I know this isn't true, because I am one.  Many of the professional Day Traders I know, also know this isn't true, since they do it as well.  Unfortunately, people here got it into their heads that 95% fail and technical analysis is bullshit.  Well most people *do fail* but that is because nobody tells them how difficult it is, and how much time (about two years of training) and effort it takes.\n\nSo I set up r/RealDayTrading to be a place where people can learn how to actually do this for a living.  I am not selling anything, have no desire to have any channel and do not have a product.   Once again, don't need it, don't want it.   However, I did want a place where other pros could come and teach people how to Day Trade without constantly being attacked by trolls (shocking I know, but Reddit has trolls).  I am very thankful that several of them agreed to come on board as mods and have been posting excellent content.   However, advice only goes so far - hence, this challenge.\n\nI hope some of you are finding it helpful.\n\nSee you next week!\n\nBest - H.S.",
        "subreddit": "StockMarket",
        "title": "$30K Challenge - Update",
        "url": "https://www.reddit.com/r/StockMarket/comments/ozid6u/30k_challenge_update/",
        "created": 1628322132.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1627938686,
        "id": "ownzr1",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, August 2, 2021**\n\nStocks continued volatility from last week, with the three major indexes opening the day in the green before turning lower towards the end in the first trading session in August. As has been the case for at least a few weeks now, it seems the market will continue to perform a careful balancing act between record corporate profits and expectations for economic expansion and concerns surrounding the highly contagious coronavirus Delta variant and inflation. \n\nSo far, 59% of the companies in the S&amp;P 500 (SPY) have reported Q2 earnings, with 88% of these beating analyst expectations, according to FactSet. This quarter is shaping up to be another record-breaking one, with corporate earnings growth rate expected to accelerate 85%, which would be the biggest jump since the Q4 20009. \n\nHowever, it is important to note that, despite beating earnings expectations, a number of these companies have pulled back, with tepid outlooks moving forward overshadowing strong results. Moving forward, given that most companies have so far exceeded pre-pandemic levels and the current quarter has an easy comparison to last year, expectations for growth are inevitably going to moderate. This said, I think the pullback in some stocks following earnings is an overreaction. \n\nIn the last few weeks, concerns over the coronavirus Delta variant are increasing, which inevitably, has injected volatility in the markets. Last week, the CDC reversed their indoor mask policy. The agency now recommends that even fully vaccinated individuals begin once again wearing masks indoors in areas with high coronavirus transmission and in K-12 schools. Dr. Rochelle Walensky, Director of the CDC said, “In areas with substantial and high transmission, CDC recommends fully vaccinated people wear masks in public, indoor settings to help prevent the spread of the delta variant, and protect others. This includes schools”. \n\nAs I have said before and will explain further below, while the surge in cases is unfortunate, it is important to note that the surge is largely concentrated in areas with high vaccine hesitancy. Moreover, while cases are surging, thankfully, hospitalizations and death rates are much lower when compared to previous surges, a sign that the vaccine is doing its job. While it doesn’t prevent one from becoming infected, it greatly reduces the possibility for complications. \n\nIn the US, despite roughly 50% of the population being vaccinated, in the past two weeks, infections across the country have roughly doubled, with new cases jumping from 13,200 on July 4 to 78,433 as of July 31, according to data compiled by John Hopkins University. However, it is important to note, despite the surge the 7-day average of deaths is 360, once again according to John Hopkins University. \n\nAccording to data from the CDC, 97% of people who have died or been hospitalized with COVID-19 since the vaccine became widely available are unvaccinated. Dr Rochelle Walensky, Director of CDC said of the rising cases, “There is a clear message that is coming through. This is becoming a pandemic of the unvaccinated. Our biggest concern is we are going to continue to see preventable cases, hospitalizations, and sadly deaths among the unvaccinated.” Sadly, despite the widespread availability of the vaccine in the US, hesitancy in certain places remains very high.\n\nMoreover, last week, the Fed released its July Monetary Policy Report largely reiterated what members of the Fed have been saying for months, but did include some new language hinting that the economic recovery is getting closer to the Fed’s stated goals. The report also acknowledged potential risks and stated the Fed was ready to act if “appropriate risks arise”. The statement read, “In assessing the appropriate stance of monetary policy, the Committee will continue to monitor the implications of incoming information for the economic outlook. The Committee would be prepared to adjust the stance of monetary policy as appropriate if risks emerge that could impede the attainment of the Committee's goals. The Committee's assessments will take into account a wide range of information, including readings on public health, labor market conditions, inflation pressures and inflation expectations, and financial and international developments.”\n\n**Highlights**\n\n* In a big industry move, Square (SQ) acquired Australian fin-tech company Afterpay, which allows customers to pay in installments, for $29 billion in an all-stock transaction. Square released a statement that read, “Square plans to integrate Afterpay into its existing Seller and Cash App business units, enable even the smallest of merchants to offer BNPL \\[buy now, pay later\\] at checkout, give Afterpay consumers the ability to manage their installment payments directly in Cash App, and give Cash App customers the ability to discover merchants and BNPL offers directly within the app.”\n* Along with the Afterpay announcement, SQ unexpectedly announced Q2 earnings, which showed gross profit growing 91% thanks to strong Cash App and Seller ecosystem growth. The company reported revenue of $4.68 billion, 87% growth year-on-year but below the the $5.03 billion expected. Earnings per share skyrocketed to $0.66 compared to $0.30 expected.\n* Google announced it was moving away from Qualcomm (QCOM) and would begin manufacturing its own in-house processors for new Pixel phones launching later this year. This follows a similar move to what Apple (AAPL) did to Intel (INTC).\n* Ford Motors (F) Chief Financial Officer John Lawler said the company hopes to reinstate a dividend by the end of the year. He said, “We've had a really tough period of time here the last couple of years with Covid last year and now the chip shortage. We plan to bring the dividend back as soon as we can...depending on how the second half goes with \\[computer\\] chips, it could be as early as the end of this year.” Ford suspended its dividend last year.\n* Electric vehicle sales in China more than tripled in July compared to a year ago. \n   * Nio delivered 7,931 vehicles in July, 124% increase YoY\n   * Xpeng (XPEV) delivered 8,040 vehicles, 228% increase YoY\n   * Li (LI) delivered 8,589 vehicles, 251% increase YoY\n* \\*\\***Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Abbvie (ABBV) with two target raises. Stock currently around $115\n   * Mizuho from $128 to $131 at Buy. \n   * SVB Leerink from $144 to $145 at Outperform\n* Avantor (AVTR) with a host of target raises. Consensus price target $45 at Buy. Stock currently around $37\n* Chevron (CVX) target raised by Raymond James from $120 to $125 at Outperform. Stock currently around $102\n* Electronic Arts (EA) target raised by Credit Suisse from $165 to $174 at Buy. Stock currently around $144\n* Fifth Third Bancorp (FITB) target raised by Morgan Stanley from $48 to $49 at Overweight. Stock currently around $36\n* Linde (LIN) with two target raises. Stock currently around $300\n   * Deutsche Bank from $345 to $350 at Buy. \n   * JP Morgan from $350 to $356 at Overweight\n* Lyft target raised by Credit Suisse from $76 to $79 at Outperform. Stock currently around $56\n* MasterCard (MA) with two target raises. Stock currently around $375.\n   * Barclays from $452 to $455 at Overweight.\n   * Mizuho from $435 to $450 at Buy.\n* Regeneron Pharmaceuticals (REGN) target raised by HC Wainwright from $729 to $741 at Buy. Stock currently around $577\n* T-Mobile (TMUS) target raised by Deutsche Bank from $188 to $195 at Buy. Stock currently around $145\n* Take-Two Interactive (TTWO) target raised by Credit Suisse from $205 to $211 at Overweight. Stock currently around $167\n\n“An investment in knowledge pays the best interest.” - Benjamin Franklin",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, August 2, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/ownzr1/here_is_a_market_recap_for_today_monday_august_2/",
        "created": 1627967486.0
    },
    {
        "author": "bmanvg21",
        "created_utc": 1628125637,
        "id": "oy6u0d",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Times up! BB’s about to jump tomorrow so I’ll put the catalyst in bullet points for you degenerate sluts.\n\n•Jarvis 2.0 launch\n•MACD on daily chart cross\n•New first of its kind clean water monitoring solution (listen to Michael Burry on infrastructure)\n•Partnership with Stella Cyber to deliver AI driven security\n•BlackBerry’s QNX OS chosen to be in communications based train control systems in Seoul\n•200/50 MA cross on weekly charts \n\nWith $GME first and $AMC second, $BB is next to squeeze.",
        "subreddit": "wallstreetbets",
        "title": "$BB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oy6u0d/bb/",
        "created": 1628154437.0
    },
    {
        "author": "ArchegosRiskManager",
        "created_utc": 1627833123,
        "id": "ovuksb",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "In my last post, I went over how to value stocks based on the discounted cash flow of a company. If you haven't read it yet, [start here.](https://www.reddit.com/r/stocks/comments/o8ygn4/how_stocks_are_valued_part_1_discounted_cash_flow/?utm_source=share&amp;utm_medium=web2x&amp;context=3) This post will go over ***relative valuation***, rather than the absolute value of a company.\n\n# Comparables\n\nWhen you're buying a house, how do you determine what the fair value of the house is? Appraisers often look at similar homes in the neighborhood to get an idea of how much the house should be worth.\n\nIf the house on 123 Potato Street were similar to all the other houses on Potato Street but was selling for 20% more than the average, odds are it's not going to sell. This concept of comparing assets to similar assets also applies in stock valuation.\n\n# How Do We Compare Stocks?\n\nRemember that stocks just represent a fraction of a company's future earnings. For similar companies with similar industries, earnings, and, $1 in earnings for company A should be worth the same as $1 of earnings for company B.\n\nA lemonade stand that makes $10 on Potato Street should be worth about the same to an investor as a lemonade stand that makes $10 somewhere else in the same neighborhood. If one is valued at $100 and the other at $120, the first lemonade stand might be undervalued.\n\nThere are several metrics we can use to compare stocks. Some ratios include:\n\n1. Price to Earnings (P/E). This ratio is calculated by dividing the stock price by its earnings per share. For example, WFC and BAC are (at a glance) similar companies since they're both in the same industry. It makes sense that they have similar P/E ratios, with WFC at 13.16 and BAC at 12.83. However, we see that BAC is relatively cheaper as we pay less for each dollar of earnings compared to WFC.\n2. Price to Sales (P/S). This is similar to P/E, except that we compare the stock price to the revenue of a company instead of its earnings. This is good for companies that aren't profitable yet, since comparing negative P/E ratios seems a bit silly. Uber, for example, has a P/S of 7.40. If we use only P/S to compare Uber to Lyft, which has a P/S of 8.71, UBER seems to be the better investment since we're paying less for each dollar of revenue.\n3. Price to Earnings Growth (PEG). This ratio measures the stock price as a ratio to the company's earnings growth (typically over the next 1-3 years). This ratio is calculated as the P/E divided by the earnings growth rate. For example, if AAPL has a P/E of 28.3x and a growth rate of 1.3%, AAPL has a PEG of 22.6x. MSFT has a higher P/E (35.09x), but because of its higher growth rate of 8.9%, has a much lower PEG of 3.92x.\n\nWe can use these ratios (and others) to identify whether stocks are relatively undervalued compared to other similar stocks, or we can compare stocks to the industry average. If we buy companies that are relatively cheaper compared to their peers, we should (in theory) perform better over time.\n\n# Short Term Relative Value Trading Strategies\n\nWe can also make relative value in the short term. \n\nA common retail trader’s strategy is to buy a stock for a few days or a few weeks, hoping to scalp a few dollars and turn a profit. However, what if the market drops? Your stock could outperform the market by only falling 3% while the market falls by 10%. You were right but you still lost money due to your market exposure.\n\nHedge funds also bet on stocks, except instead of looking for a return on a single stock, they bet on stocks going up or down relative to another. They buy stock A and short-sell stock B, hoping A will outperform B. This is aptly named the Long-Short trading strategy or the pairs trade. If A falls 3% but B drops 5%, the hedge fund makes money overall.\n\n# Short Term Relative Value Trade Examples\n\nHow can we apply this to our trading? What if we think GME will outperform AMC? At $161 its may or may not be a good idea to be strictly long GME. However, we can hedge by shorting AMC. If all meme stocks crash, we still make money as long as GME doesn’t fall as much as AMC does. If GameStop stays flat, we make money when AMC falls. (Of course, if you think AMC is the winner you can just inverse the above strategy)\n\nWe can apply this strategy to stocks in similar industries such as GM/F, V/MA, and KO/PEP.\n\nA second example would be a pairs trade I closed earlier last week.\n\nGoogle has two classes of (publicly traded) shares: GOOGL (Class A) which has voting rights, and GOOG (Class C) which has none.\n\nTheoretically, GOOGL should always be more expensive because they have voting rights, but because Alphabet is conducting share buybacks of GOOG exclusively, GOOGL was cheaper for a while - [We can see this in the trading view chart here.](https://imgur.com/a/Qng5vyG)\n\nBy buying GOOGL and shorting GOOG, I’m betting the gap between the two stocks will close. I don’t care if the market rises, falls, or goes sideways. I don’t even care if google falls 50%. The only thing I’m betting on is that GOOGL will be the same price as GOOG eventually, and after Alphabet announced it would start buybacks of both share classes, the gap closed.",
        "subreddit": "stocks",
        "title": "How Stocks Are Valued Part 2: Relative Value",
        "url": "https://www.reddit.com/r/stocks/comments/ovuksb/how_stocks_are_valued_part_2_relative_value/",
        "created": 1627861923.0
    },
    {
        "author": "LocustFunds",
        "created_utc": 1628027411,
        "id": "oxducu",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n[ $SPY Total Flow ](https://preview.redd.it/f2c7pwxsq7f71.png?width=1170&amp;format=png&amp;auto=webp&amp;s=13ad733079e40883c5ef52df277460401e19ea2e)\n\n&amp;#x200B;\n\n[ $SPY Bubble Flow. This is not retail throwing millions in to multiple lower $SPY put strikes imho. ](https://preview.redd.it/vxb70zfyq7f71.png?width=521&amp;format=png&amp;auto=webp&amp;s=f20295d9f4628e9136ab7ab614d76e66b2f1e73a)\n\n&amp;#x200B;\n\n[ $SPY P\\/C Ratio. Pus lead calls by almost 100 Million $ ](https://preview.redd.it/z9cmm5l2r7f71.png?width=1782&amp;format=png&amp;auto=webp&amp;s=05e16241399dd5b08601e4e1fc1ec7ed2036669d)\n\n&amp;#x200B;\n\n[ $SPY Trade Tape page 1 sorted by premium... ](https://preview.redd.it/s7sjung4r7f71.png?width=1775&amp;format=png&amp;auto=webp&amp;s=d159d5795daa245b80bd44ebe01319648223a61b)\n\n&amp;#x200B;\n\n[ $SPY Trade Tape page 2  sorted by premium... ](https://preview.redd.it/bxfni835r7f71.png?width=1791&amp;format=png&amp;auto=webp&amp;s=87c60a91bb884697b5819cfe37df6fec1225b439)\n\n&amp;#x200B;\n\n[ $SPY Trade Tape page 3 sorted by premium.](https://preview.redd.it/1gsd06h6r7f71.png?width=1788&amp;format=png&amp;auto=webp&amp;s=52a6857225c66ac3fa95e96e9a4b3fe1c7fac67f)\n\n&amp;#x200B;\n\n[ $SPY GEX closed above the flip point back in to positive territory. ](https://preview.redd.it/g0bg7zd8r7f71.png?width=1781&amp;format=png&amp;auto=webp&amp;s=52e10b3b02e2d5b86735c18edfd14274a5e64b0a)\n\n&amp;#x200B;\n\n[ $SPY Daily View. Lots of resistance above. ](https://preview.redd.it/adgp5cw9r7f71.png?width=1627&amp;format=png&amp;auto=webp&amp;s=6df93014c893c938eec472c0f85f801e07969123)\n\n&amp;#x200B;\n\n[ $SPY Daily BB bounced of the white 20 ma ](https://preview.redd.it/fygwruebr7f71.png?width=1627&amp;format=png&amp;auto=webp&amp;s=2743b3581951f092b5bbd7aa8bc56b04a248cbe7)\n\n&amp;#x200B;\n\n[ $SPY 1 Hour still churning in this tight range trying to burn thru its negative divergence. ](https://preview.redd.it/a7fvuopdr7f71.png?width=1627&amp;format=png&amp;auto=webp&amp;s=8ca79c02753b3c7f484a84a6a5a1ae66c2ad508a)\n\n&amp;#x200B;\n\n[ $SPY 15 Minute falling wedge B\\/O I was mentioning yesterday confirming today providing a 4 point run or 1&amp;#37;](https://preview.redd.it/tvmhpxefr7f71.png?width=1627&amp;format=png&amp;auto=webp&amp;s=39f83f37b1a90031e42729d9f64a76638d69d1bf)\n\nPlease post from yesterday for reference...\n\n[https://www.reddit.com/r/options/comments/owoloy/spx\\_spy\\_vix\\_vxx\\_uvxy\\_end\\_of\\_day\\_flows\\_gex\\_and\\_spy/](https://www.reddit.com/r/options/comments/owoloy/spx_spy_vix_vxx_uvxy_end_of_day_flows_gex_and_spy/)\n\n&amp;#x200B;\n\n[ $VIX Total Flow closed neutral ](https://preview.redd.it/snmk8buhr7f71.png?width=1177&amp;format=png&amp;auto=webp&amp;s=4403012edc6ea607c1c7d09602fa7b06e38817e8)\n\n&amp;#x200B;\n\n[ $VIX P\\/C Ratio even thou we got a neutral close calls still lead puts by 7 million $ ](https://preview.redd.it/xneoy7djr7f71.png?width=1792&amp;format=png&amp;auto=webp&amp;s=a9288b315e425774e297c74c39dbfd3635a24d4b)\n\n&amp;#x200B;\n\n[ $VIX Bubble Flow. All these strikes are well above the currant spot and again this is not retail throwing millions in to multiple $VIX strikes imho. ](https://preview.redd.it/i4p0x03mr7f71.png?width=538&amp;format=png&amp;auto=webp&amp;s=31955ad6a6ab7cf0625e6716460e9e4c94dc8e09)",
        "subreddit": "options",
        "title": "$SPX $SPY short term buy signal triggered and trying hard to negate its negative divergence, but I'm still seeing a whole lot of puts come thru the tape. End of day flows, GEX and technical analysis for Tuesday 8/3",
        "url": "https://www.reddit.com/r/options/comments/oxducu/spx_spy_short_term_buy_signal_triggered_and/",
        "created": 1628056211.0
    },
    {
        "author": "RomulusAugustus753",
        "created_utc": 1628012612,
        "id": "ox8oc5",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "[https://www.bloomberg.com/news/articles/2021-08-03/tencent-plummets-as-chinese-crackdown-fears-persist?utm\\_medium=social&amp;cmpid=socialflow-twitter-business&amp;utm\\_content=business&amp;utm\\_campaign=socialflow-organic&amp;utm\\_source=twitter](https://www.bloomberg.com/news/articles/2021-08-03/tencent-plummets-as-chinese-crackdown-fears-persist?utm_medium=social&amp;cmpid=socialflow-twitter-business&amp;utm_content=business&amp;utm_campaign=socialflow-organic&amp;utm_source=twitter)\n\nThere's been a lot of FUD talk recently about the extra risks of putting your money in Chinese stocks. These risks stem from the whipsaw regulatory caprices of the Chinese Communist Party (CCP). Well, now, here's some more of that same talk.\n\nChinese gaming stocks were in free fall after CCP state-run media (like most large companies, media in China is subject to state control) suddenly referred to gaming as \"spiritual opium,\" and then deleted the remark, letting shares regain some of their losses. Deleted or not, this pronouncement harbinges future CCP crackdown and intervention in names like Tencent, Bilibili, and XD. The CCP sparked similar fears recently vis-a-vis Chinese tech and internet names, as well as education names, see, e.g. [https://www.cnbc.com/2021/07/23/us-listed-china-education-stocks-plunge-as-beijing-regulators-crack-down.html](https://www.cnbc.com/2021/07/23/us-listed-china-education-stocks-plunge-as-beijing-regulators-crack-down.html) . The CCP has particularly targeted foreign listed companies for crackdown, especially those listed in the US. Again, the message could not be clearer: China has placed foreign--and, especially, US--investors in its crosshairs. The CCP is purposefully swinging its weight around to remind everyone who is in control in China; this is their overriding concern, to maintain control. It would not do to have Jack Ma, for example, stand up to Secretary General Xi the way, say, Mark Zuckerberg recently stood up to a certain orange-hued Tariff Man by banning him from FB. The CCP is about maintaining power and face: it is not about to let such a thing happen, even if it has to inflict a lot of pain on a lot of people.\n\nNow, there is nothing wrong with government deciding on and implementing policy to shape its society in a given way, and there is nothing wrong with government incentivizing the public to go along with it; that is indeed the nature and essence of government, and every government has the right to do this, including the CCP. We have heard they wish to curb monopoly power among the tech sector; to make education more broadly available to meet public demand by nationalizing those services; and now, it appears, they wish to curb the influence of gaming among the Chinese populace. All well and good.\n\nThe problem here, however, is that the CCP does not do this in a measured, deliberate, transparent, and predictable way; it instead acts whimsically and capriciously, without warning and without any attempt to gradually telegraph its plans to the investing public so that the market has time to react in a more measured fashion. This stands in stark contradistinction to the deliberative, telegraphed, and gradual process that marks US and European lawmaking and regulation, where statutes like the US' Administrative Procedures Act (APA) mandate public comment and interactive dialogue in regulated industries. The CCP's willingness to act in such a way is deliberate: the party moves swiftly and without warning not only to implement its goals as expeditiously as possible, but also to remind people--and especially foreign and US investors--who is in charge. Lack of reciprocity thoroughly characterizes the Chinese/Rest-of-the-World relationship, and this business with the gaming stocks today is one more example of that lack of reciprocity; other governments do not treat Chinese investors like China treats its foreign investors. It would not surprise me if the CCP turned around and ordered app stores to remove gaming apps within a week, just as was done with Didi.\n\nMany other r-slurs and I have reminded our fellows that the CCP could nullify the VIE contracts that allow Chinese companies to trade on US exchanges; they could pocket all your hard-earned money in a heartbeat, just as quickly as they've struck out at gaming industries today. Far be it from me to tell you where to put your money. But today's action vis-a-vis Tencent and other gaming companies presents another opportunity to repeat: be aware of the outsized regulatory and governmental risks imposed by the CCP if you are going to go long on juicy-looking Chinese stocks.\n\nVarious obligatory INB4s:\n\n\"Gosh, Romulus Augustus, China wouldn't shoot itself in the foot and injure its standing in the world by bilking foreign investors and taking all their money, leaving them high and dry.\" Recall what was done with the National Security Law in Hong Kong, in violation of a treaty the CCP signed (see one such recent arrest pursuant to that law: [https://www.reuters.com/world/asia-pacific/hong-kong-investigates-china-anthem-booing-during-olympics-broadcast-mall-2021-07-30/](https://www.reuters.com/world/asia-pacific/hong-kong-investigates-china-anthem-booing-during-olympics-broadcast-mall-2021-07-30/)) . Recall also that the CCP signed the Paris Accords, and before the ink on their signature was even dry, turned immediately around and built a metric ass-ton (yes, that's a technical unit of measurement) of new coal plants: [https://e360.yale.edu/features/despite-pledges-to-cut-emissions-china-goes-on-a-coal-spree](https://e360.yale.edu/features/despite-pledges-to-cut-emissions-china-goes-on-a-coal-spree) . The CCP does not care overmuch for niceties or proprieties: they will think nothing of lulling you, and then taking your money and rugpulling you without compunction or hesitation if they deem the time is right.\n\n\"Gosh, Romulus Augustus, China is just getting several monopolistic and socially toxic industries under control, you should want the increased competition and improved Chinese society that will come from these measures.\" As I said before, all well and good. But do it in a measured, telegraphed, transparent, and predictable way: don't make a point of purposefully rugpulling and whipsawing foreign investors in a way other governments don't do with Chinese investors.\n\n\"Gosh, Romulus Augustus, isn't this just racist and anti-Chinese? Why are you so bigoted against Chinese people? #StopAsianHate. \" It’s racist to point out that the CCP is bilking investors here of *all* ethnicities and creeds? I think not. Moreover, lobbing this accusation is a common wumao ([https://en.wikipedia.org/wiki/50\\_Cent\\_Party)/tankie/](https://en.wikipedia.org/wiki/50_Cent_Party)/tankie/) r/ sino tactic often used on social media. They’ve learned they can deflect from the CCP’s misdeeds by crying that any criticism of the government or enterprise is racist. But like Eric Carmen and the Raspberries, let's go all the way! Assume I am indeed a racist (I’m not). How does that factually alter, rebut, or contend with the substance of anything I’ve said here?\n\n\"Gosh, Romulus Augustus, don't you wish the US government had taken some action against its bad apples like Enron, Theranos, Your Hometown Deli, Lordstown, et al.?\" Someone will inevitably bring up Enron like they always do when this topic comes up, and, like always, it will drive me absolutely nuts. Besides the fact Enron was decades ago, it spawned disclosure and accounting laws that American companies now must comply with. Elizabeth Holmes (and that affected husky voice I'm sure some of you degens around here have busted one out to) is facing down a court for the shit she pulled with Theranos. NKLA somehow still has a 4 billion market cap despite Trevor Milton's crazy lies and fraudulent statements for which he's now facing criminal charges. Again, the US takes action against its bad apples in a measured, orderly, transparent way when compared with the CCP.\n\nI can already hear xupamos87, BVB\\_TallMorty, and the China Apologist/China Bull Crew now: \"Gosh, Romulus Augustus, the Chinese stocks present a great opportunity, boast great fundamentals, and I've already realized sick gains on DOYU and NIO and a whole host of others!\" More power to you! I'm glad you made money off these names! But that's besides the point of this post and other posts on this topic. The overarching point is, the CCP imposes regulatory risks and rugpulls foreign investors in a way that other governments don't do to Chinese investors: the point of this and other similar posts is to describe this risk if you're going to try to make money off these names, and also to point out the lack of reciprocity between China and the rest of the world. And as for the stellar fundamentals, well, they are cheap for a reason.\n\n\"Gosh, Romulus Augustus, the CCP has made clear it wants to work more closely with US regulators like the SEC to clean up its act and become more transparent.\" OK. Words are great, but actions are better. At this point in time, it sounds like a strategic attempt to lull US investors into a sense of security before yet another rug gets pulled or more foreign money gets siphoned off. Remember how I said above that the CCP signed the Paris Accords and then turned around and built more coal plants? (See, e.g., [https://www.bbc.com/news/science-environment-50474824](https://www.bbc.com/news/science-environment-50474824) ). It strikes me the same is going on here with promises of greater transparency and cooperation with the SEC. China lulled the rest of the world into hamstringing itself to meet agreed-upon emissions targets while going full-steam (or coal) ahead on its own plans. Lull into a sense of security, then go back on your word in bad faith, and then pull ahead while others are struggling behind in an attempt to conform in good faith to the agreement and mutual commitments made.\n\n\"Gosh, Romulus Augustus, the US is so awful compared to China, how can you trash China and not recognize the US is evil, racist, and has done terrible things in the past?\" I hear this one a lot from younger-sounding Gen Z folks and tankies whenever the topic of China treating foreign investors poorly is brought up. I don't dispute the US bears its share of sin. But we are talking about problems today that are directly affecting all of us and our money. And China behaves less transparently and fairly towards foreign investors in its companies than the US behaves towards Chinese investors in US companies. That is the problem, and it is a problem that deserves addressing, regardless of what the US has or has not done.\n\nBottom Line: Be very, very aware of the outsized regulatory risks posed by the CCP that you will not face from the US or EU governments. Factor those risks accordingly into your personal risk tolerance matrix when going long Chinese stocks.",
        "subreddit": "stocks",
        "title": "Oops they did it again: Gaming stocks fall after state-run media calls gaming \"spiritual opium\"",
        "url": "https://www.reddit.com/r/stocks/comments/ox8oc5/oops_they_did_it_again_gaming_stocks_fall_after/",
        "created": 1628041412.0
    },
    {
        "author": "bearcat2202",
        "created_utc": 1627996395,
        "id": "ox37ni",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I have been trying to do a lot of research on this, but are PayPal and square a big threat to $MA $V and $AXP? Or is it the other way around that the credit card companies s threaten PayPal and square long term business? \n\nOr can all of them exist harmoniously and Keep growing earnings like they have?",
        "subreddit": "stocks",
        "title": "Visa AMEX &amp; Mastercard vs PayPal, square",
        "url": "https://www.reddit.com/r/stocks/comments/ox37ni/visa_amex_mastercard_vs_paypal_square/",
        "created": 1628025195.0
    },
    {
        "author": "BlueForLyf",
        "created_utc": 1628037149,
        "id": "oxgwz2",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Can someone share easy and effective charting patterns to identify stocks on the move in short/medium term.\n\nFor example:\n\n1) when 20 day MA line crosses 50 day MA, its an uptrend in medium term.\n\n2) when a stock just reverts after touching 20 day MA, its a short term uptrend.  \n\n\nDoes anyone know such patterns that have good success rate ?",
        "subreddit": "stocks",
        "title": "Famous and easy charting patterns ?",
        "url": "https://www.reddit.com/r/stocks/comments/oxgwz2/famous_and_easy_charting_patterns/",
        "created": 1628065949.0
    },
    {
        "author": "LocustFunds",
        "created_utc": 1628027124,
        "id": "oxdqyw",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n[$SPY Total Flow](https://preview.redd.it/aj3uczscn7f71.png?width=1170&amp;format=png&amp;auto=webp&amp;s=748b6d2bcceb86aa2762b555097c902edc1ec1f8)\n\n&amp;#x200B;\n\n[$SPY Bubble Flow. This is not retail throwing millions in to multiple lower $SPY put strikes imho.](https://preview.redd.it/pzjxxbjdn7f71.png?width=521&amp;format=png&amp;auto=webp&amp;s=0d3018ecec56fb125828cd4f98f993648aac20d9)\n\n&amp;#x200B;\n\n[$SPY P\\/C Ratio. Pus lead calls by almost 100 Million $](https://preview.redd.it/fyeogkipn7f71.png?width=1782&amp;format=png&amp;auto=webp&amp;s=b7a6543b6d91949702bc147647bf38a617eae0e6)\n\n&amp;#x200B;\n\n*Processing img 8glnfkjen7f71...*\n\n&amp;#x200B;\n\n[$SPY Trade Tape page 2](https://preview.redd.it/97iug7wen7f71.png?width=1791&amp;format=png&amp;auto=webp&amp;s=04a5e365a57bf8fc6b8f00b1a6ada051d8127744)\n\n&amp;#x200B;\n\n[$SPY Trade Tape page 3](https://preview.redd.it/x0oyao6fn7f71.png?width=1788&amp;format=png&amp;auto=webp&amp;s=6dc7213cdf0cb843eecb0e7522680dfc07ea312f)\n\n&amp;#x200B;\n\n[$SPY GEX closed above the flip point back in to positive territory.](https://preview.redd.it/s69fr8jfn7f71.png?width=1781&amp;format=png&amp;auto=webp&amp;s=fb90c3663b54ca8f6b1622f7f36999e3dfd8c3fb)\n\n&amp;#x200B;\n\n[$SPY Daily View. Lots of resistance  above. ](https://preview.redd.it/yo1pgyzfn7f71.png?width=1627&amp;format=png&amp;auto=webp&amp;s=ba0b60f493db2e99e482e523b864df045f272f17)\n\n&amp;#x200B;\n\n[$SPY Daily BB bounced of the white 20 ma ](https://preview.redd.it/6xwjv14ln7f71.png?width=1627&amp;format=png&amp;auto=webp&amp;s=0e8b96da6eaa4d77cb0c015900f3fbde946c19ed)\n\n&amp;#x200B;\n\n[$SPY 1 Hour still churning in this tight range trying to burn thru its negative divergence. ](https://preview.redd.it/o6kn6rwln7f71.png?width=1627&amp;format=png&amp;auto=webp&amp;s=8ab1d5ba0ffad07476733b8897e921b3c75d948a)\n\n&amp;#x200B;\n\n[$SPY 15 Minute falling wedge B\\/O I was mentioning yesterday confirming today providing a 4 point run or 1&amp;#37;](https://preview.redd.it/ta8p2006p7f71.png?width=1627&amp;format=png&amp;auto=webp&amp;s=fd77a6b65a0688027972bed60a6ac02ffa3f2b01)\n\nPlease post from yesterday for reference...\n\n[https://www.reddit.com/r/options/comments/owoloy/spx\\_spy\\_vix\\_vxx\\_uvxy\\_end\\_of\\_day\\_flows\\_gex\\_and\\_spy/](https://www.reddit.com/r/options/comments/owoloy/spx_spy_vix_vxx_uvxy_end_of_day_flows_gex_and_spy/)\n\n&amp;#x200B;\n\n[$VIX Total Flow closed neutral ](https://preview.redd.it/l0izb3tnn7f71.png?width=1177&amp;format=png&amp;auto=webp&amp;s=08e6caf738b737e12f9657383efa24233bc86015)\n\n&amp;#x200B;\n\n[$VIX P\\/C Ratio even thou we got a neutral close calls still lead puts by 7 million $](https://preview.redd.it/uj9r2ixkp7f71.png?width=1792&amp;format=png&amp;auto=webp&amp;s=eeaf98b4e0c8c4c5837b507b749119004563272f)\n\n&amp;#x200B;\n\n[$VIX Bubble Flow. All these strikes are well above the currant spot and again this is not retail throwing millions in to multiple $VIX strikes imho.](https://preview.redd.it/uowhym7on7f71.png?width=538&amp;format=png&amp;auto=webp&amp;s=3f0ae9143b2e47fa3be1a2feeeca7f54aefa7b87)",
        "subreddit": "StockMarket",
        "title": "$SPX $SPY short term buy signal triggered and trying hard to negate its divergence, but I'm still seeing a whole lot of puts come thru the tape. End of day flows, GEX and technical analysis for Tuesday 8/3",
        "url": "https://www.reddit.com/r/StockMarket/comments/oxdqyw/spx_spy_short_term_buy_signal_triggered_and/",
        "created": 1628055924.0
    },
    {
        "author": "InsurViewChina",
        "created_utc": 1628503226,
        "id": "p0yfig",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Recently, Bright Health Group landed on the New York Stock Exchange and made $924 million in its initial public offering. The IPO pricing values Bright Health at $11.23 billion, according to [a report](https://www.reuters.com/legal/transactional/tiger-global-backed-bright-health-raises-924-mln-us-ipo-2021-06-24/) from Reuters. The startup insurer initially priced its IPO at $18 per share, and issued 51.3 million shares. At present, Bright Health's stock price is $16.7 and the market value is $10.277 billion.\n\nFounded in 2015, Bright Health is a medical health insurance and technology company. Through cooperation with top suppliers in the medical system, it establishes connections between medical consumers and suppliers, and is committed to providing users with reasonable medical insurance solutions and high-quality medical services through advanced technology.\n\nThe company raised $500 million in a late-stage funding round in September last year from investors such as Tiger Global Management, T. Rowe Price Associates and Blackstone Group Inc [(BX.N)](https://www.reuters.com/companies/BX.N), bringing total equity raised to over $1.5 billion.\n\nIn 2020, Bright Health generated more than 1.2 billion U.S. dollars in revenue, an increase of more than three times compared with the 280 million U.S. dollars in 2019. The total revenue for the first quarter of 2021 was US$874.6 million. While revenue has increased, the company's losses have been expanding. From 2018 to 2020, the company lost 62.6 million U.S. dollars, 125.3 million U.S. dollars and 248.4 million U.S. dollars, respectively, and its net loss almost doubled.\n\n**Business Model: 2C+2B**\n\nBright Health runs two businesses, NeueHealth(2B) and Bright HealthCare(2C). In particular, Bright HealthCare sells Medicare and commercial health insurance to about 623,000 consumers in 14 states of the United States. NeueHealth offers virtual and in-person clinical care to patients through affiliated primary care clinics.\n\n**Bright HealthCare: diverse strategies serve different groups of people**\n\nBright HealthCare offers health plans for individuals and families, small businesses and employees, and Medicare Advantage plans for seniors. Five years ago, Bright Healthcare only offered a single product in one state, and the number of users was only 10,765. As of now, this department operates in 14 states across the United States, and plans to expand to more states by 2022.\n\nCurrently, Bright HealthCare provides health care benefits to approximately 623,000 consumers. Customers include: 1) Commercial customers. Bright HealthCare provides commercial health plans in 11 states, including personal and family plans and employer plans, serving approximately 515,000 people; 2) Medicare Advantage users. Bright HealthCare provides Medicare Advantage products in 11 states, serving approximately 108,000 people, usually focusing on high-risk groups with special needs.\n\nIn addition, Bright Healthcare operates a small Managed Medicaid business in California. Regarding self-funded employer support, Bright Healthcare is currently establishing ASO business (ASO, administrative services only) for self-paying employers through multiple strategic partners. Administrative services only (ASO) refers to an agreement that companies use when they fund their [employee benefit plan](https://www.investopedia.com/terms/e/employer_sponsored_plan.asp) but hire an outside vendor to administrate it. Bright Healthcare believes that to continue expanding self-insurance market is an important part of its diversification strategy. Bright HealthCare also participates in a number of specialized plans and is the nation’s third largest provider of Chronic Condition Special Needs Plans (C-SNPs).\n\nFrom 2018 to 2020, Bright Healthcare’s total premiums were US$127 million, US$272 million, and US$1.18 billion, with growth rates of 114.17% and 333.82%, respectively. The growth rate was tripled. Its commercial insurance premium income was 111 million U.S. dollars, 236 million U.S. dollars, and 692 million U.S. dollars, with growth rates of 112.61% and 193.22%, respectively. Commercial premiums accounted for 87.64%, 86.77%, and 58.66% of total premiums, respectively, and their proportions dropped to about half in 2020. Medicare Advantage premium income was 15.71 million U.S. dollars, 36.03 million U.S. dollars and 480 million U.S. dollars, with growth rates of 129.34% and 1232.42%, respectively. The growth rate in 2020 is particularly astonishing. MA premiums accounted for 12.36%, 13.23% and 41.34% of total premiums, respectively, and their proportions increased to nearly half in 2020.\n\nIn terms of users, the number of commercial users in 2020 was 145,000, and this number soared to 482,000 in the first quarter of 2021, an increase of 232.41%. The number of MA users was 62,000, and reached 67,000 in the first quarter of 2021. Although Bright Health has achieved amazing growth in both premiums and the number of users, combined with its acquisitions, both the surge in users and the increase in premiums were driven by Bright Healthcare's acquisition of Brand New Day.  \n\n**NeueHealth: Healthcare services empower 2C business**\n\nNeueHealth is a comprehensive medical institution that provides local and personalized care services in a variety of ways. Its services include: \n\nIntegrated Care Delivery — Operating clinics that provide comprehensive care to all populations.\n\nBright Health Network —Ecosystem of Care Partners.\n\nValue Services Organization — Empowering high-performing primary care practices and care delivery organizations to succeed in their evolution towards risk-bearing care delivery.\n\nIts income consists of two parts, namely service fees and premium income. Service fees mainly refer to NeueHealth affiliated medical group’s pay-for-service income and the network service income generated by Bright Health Network under NeueHealth; the premium income refers to NeueHealth’s value service organization and its affiliated medical group’s income from taking charge of patients’ medical care.\n\nIn 2020, NeueHealth's service fee income was 29.35 million U.S. dollars, and premium income was 7.79 million U.S. dollars. In the first quarter of 2021, service fee income increased by US$8.1 million year-on-year, reaching US$15.6 million, mainly due to the increase in revenue from the inter-company network contract service of the Bright HealthCare division. Premium income increased by US$26.7 million year-on-year, an increase of 1,330.8% to US$28.7 million. Similarly, the increase in revenue was driven by the acquisition of PMA.\n\nAs of April 2021, NeueHealth works with over 200,000 care provider partners and operates 28 managed and affiliated risk-bearing clinics within its integrated care delivery system. Through those risk-bearing clinics, NeueHealth maintains nearly 75,000 unique patient relationships as of April 2021, approximately 30,000 of which are served through value-based arrangements, across multiple payors. In addition to the directly managed and affiliated clinics, NeueHealth manages care for an additional 33 clinics through its Value Services Organization.\n\n**Competitive advantages: technology empowerment + extensive customer base + full chain**\n\nAfter summarizing Bright Health's business model, we found that the company's competitive advantages include: extensive customer base coverage, technological empowerment, and full-chain services.\n\nOn the customer side, Bright Healthcare offers plans covering all groups of people. In particular, the currently developing Managed Medicaid business covers children and low-income groups; the personal and family plans in the business plan section cover self-employed and part-time groups; Medicare Advantage covers groups over 65 years old; and Employer ASO covers self-financing employer groups. At the same time, many of Bright Healthcare's professional programs target the chronically ill population. In other words, regardless of customers’ income, age, work or the way to obtain insurance, Bright Health can provide products or services in a direct or indirect manner.\n\nHowever, at present, Bright Healthcare’s two largest customer groups are business plans and MA groups. Both in premium income and customer groups, business plans make up the most part. Products and services for other groups are still in their infancy, and the development of these product lines in the future will still require a lot of effort.\n\nIn technology, Bright Health has developed “Bright Health Intelligent Operating System” or “BiOS”. It  refers to Bright Health’s end-to-end intelligent technology platform comprised of consumer, care delivery, and administrative solutions, all designed to enable an integrated, aligned, and consumer-focused healthcare ecosystem.  \n\nBiOS uses the powerful data generated by Care Partner model to achieve integration of the healthcare system, including smart data center Consumer360 and the solution DocSquad for consumers and suppliers. “Consumer360” refers to Bright Health’s proprietary intelligent data hub, which aggregates clinical and administrative data, as well as information derived from the consumer experience (i.e., from call center and other consumer interactions) and data relating to Social Determinants of Health. It could create a personalized digital care plan to empower DocSquad.  \n\n\n“DocSquad” refers to Bright Health’s consumer and care provider solution, comprised of a purpose-built set of tools and experiences connecting consumers with the organizations responsible for their care, while giving providers a 360-degree view of a consumer to better manage their healthcare needs. Its services include virtual care, personalized care team, smart warning, and other healthcare services.\n\nAnother advantage of Bright Health is that it both provides 2C and 2B services. On the one hand, it provides customers with Bright Healthcare products, as well as customized and market-specific nursing services through NeueHealth's network and other healthcare providers. On the other hand, for business clients, NeueHealth helps healthcare providers gather consumers and provide care partners with multiple value propositions, while providing innovative tools and solutions to support population health management and development of value-based care. For payers, NeueHealth allows Bright HealthCare and other third-party payers to participate in value-based payment arrangements, while managing risk-bearing care delivery. It provides payers with predictability of medical expenses, allowing them to focus more on benefit design and management.\n\nIn sum, Bright Health integrates financing and delivery of healthcare through the division and collaboration of the two departments, covering both payers and suppliers. The payer’s funding not only focuses on preventing losses, but also on creating overall consumer value and increasing access to medical care through effective resource allocation. Suppliers construct value-based arrangements that aim to reward the quality of care provided, rather than the number of services. It could reduce the total cost of care and improve clinical outcomes.\n\n**Future challenges: loss doubles, and medical cost ratio increases**\n\nApart from advantages, Bright Health is also facing some challenges. To achieve future development and even profitability, these challenges need to be overcome.\n\nFirst, the problem of customer groups. At present, the company's main customer base is divided into commercial users and MA users. Commercial users’,or personal insurance’s market share is relatively small, and the number of users in this market has grown rapidly after the enactment of Affordable Care Act. But in the later stage, the user group who cannot receive premium subsidies will have adverse selection. The data shows that the total number of monthly registrations in the personal market increased from 10.6 million in 2013 to 17.4 million in 2015, reaching a peak, and then fell to 13.8 million in 2018. One reason is that from 2017 to 2018, insurance premiums rose sharply, and many people were unable to receive premium subsidies, so adverse selection occurred. Consistent with the number of users, operators that provide individual insurance plans have also seen a general trend of growth first and then decline, which also means that this market is very difficult for insurance companies.\n\nIn addition, there are many other participants in the personal insurance market, including Oscar Health, which went public not long ago. Although Bright Health claims to be able to compete with the former in terms of healthcare networks, Oscar has 400,000 individual insurance members, just slightly less than that of Bright Health in personal insurance market.\n\nOn the other hand, the MA market is full of giants, and leading insurance companies occupy a large part of the market share, leaving Bright Health only a small part. Whether it is in personal insurance or MA, customer acquisition is quite difficult, which is why Bright Health has adopted mergers and acquisitions to grow its customer base.\n\nAlthough Bright Health said it would expand to other customer groups, including self-funding employer market and small business market, the development of these strategies is still in the early stages and has not been reflected in the company's financial data. In the future, much resources must be invested, and even mergers and acquisitions and other means will be necessary to seize market share and customer base.\n\nIn addition, although Bright Health has both an insurance supply department and a medical service department, its medical cost ratio(MCR) has been growing. From 2018 to 2020, the company's MCR were 75.8%, 82.4% and 88.7%, which did not have any advantages compared with other companies. In other words, the company's efforts to control medical expenses through NeueHealth do not seem to have worked.\n\nThe company's operating costs have also been increasing. From 2018 to 2020, operating costs were US$95.83 million, US$180 million and US$410 million, respectively, with growth rates of 88% and 127%. With high medical expenses, coupled with increasing operating costs, the company still has a long way to go to achieve profitability.\n\nNevertheless, Bright Health is committed to controlling the entire value chain including users, payers and suppliers. This model is still a core competitiveness, which distinguishes it from competitors such as Oscar, and also reminds people of United Health.\n\nWhat we can learn from Bright Health is its practice of complementing business through acquisitions. Bright Health turned NeueHealth into an independent department and constantly emphasizes the possibility of its future development. This differentiated department is built through continuous acquisitions. At present, 3% of the revenue contributed by this department is contributed by the acquisition department. Furthermore, the success of UnitedHealth Group is also on the basis of continuous acquisitions.\n\nAnother lesson is the construction and integration of technology platforms. The intelligent platform built by Bright Health integrates users, payers, and suppliers, and its solutions for suppliers or patients, such as applications, are based on this platform. It aggregates all user data and claims data to achieve transparent exchange and empowerment of data.\n\nBright Health’s future is worth looking forward to.",
        "subreddit": "stocks",
        "title": "Bright Health IPO value of $11.23 billion: Will technology-enabled medical insurance usher in a turning point?",
        "url": "https://www.reddit.com/r/stocks/comments/p0yfig/bright_health_ipo_value_of_1123_billion_will/",
        "created": 1628532026.0
    },
    {
        "author": "spiroklon",
        "created_utc": 1628258429,
        "id": "oz77kc",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hello, I just opened a second account woth IBKR and they offered me the option of ordering a debit MasterCard. Without much info, and the link they sent doesn’t open.  \nI’m in (ON) looking for others experience / pros / cons \n\nHow / why do you use it ? \nCan I use it as a LOC ?",
        "subreddit": "CanadianInvestor",
        "title": "IBKR debit MasterCard",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/oz77kc/ibkr_debit_mastercard/",
        "created": 1628287229.0
    },
    {
        "author": "Presidentyler",
        "created_utc": 1628172074,
        "id": "oyi6gg",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "YOLO some MA CALLS anyone else buying the dip?",
        "url": "https://i.redd.it/1f5jpvlzpjf71.jpg",
        "created": 1628200874.0
    },
    {
        "author": "fustreiche",
        "created_utc": 1628512623,
        "id": "p10lng",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "NASDAQ: $ACER NEWS : \n\n \n\n**NEWTON, MA and GENEVA, SWITZERLAND / ACCESSWIRE / August 9, 2021 /** Acer Therapeutics Inc. (NASDAQ:ACER) (\" **Acer** \"), a pharmaceutical company focused on the acquisition, development and commercialization of therapies for serious rare and life-threatening diseases with significant unmet medical needs, and RELIEF THERAPEUTICS Holding AG (SIX: RLF, OTCQB: RLFTF) (\" **Relief** \"), a biopharmaceutical company seeking to provide patients therapeutic relief from serious diseases with high unmet need, today announced the submission of a New Drug Application (NDA) to the U.S. Food and Drug Administration (FDA) for ACER-001 (sodium phenylbutyrate) for the treatment of Urea Cycle Disorders (UCDs). ACER-001 is a nitrogen-binding agent in development for use as adjunctive therapy in the chronic management of patients with UCDs involving deficiencies of carbamylphosphate synthetase (CPS), ornithine transcarbamylase (OTC), or argininosuccinic acid synthetase (AS).\n\n[https://finance.yahoo.com/news/relief-therapeutics-holdings-ag-acer-053000334.html?soc\\_src=social-sh&amp;soc\\_trk=tw&amp;tsrc=twtr](https://finance.yahoo.com/news/relief-therapeutics-holdings-ag-acer-053000334.html?soc_src=social-sh&amp;soc_trk=tw&amp;tsrc=twtr)",
        "subreddit": "wallstreetbets",
        "title": "RELIEF THERAPEUTICS Holdings AG: Acer Therapeutics and Relief Therapeutics Announce Submission of a New Drug Application to the U.S. FDA for ACER-001 for Treatment of Urea Cycle Disorders",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p10lng/relief_therapeutics_holdings_ag_acer_therapeutics/",
        "created": 1628541423.0
    },
    {
        "author": "Exitmorelikeentrance",
        "created_utc": 1628484044,
        "id": "p0ufto",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Breaking: Alchemy Pay to Launch Virtual Mastercard and Visa Card Services",
        "url": "https://www.prnewswire.com/news-releases/alchemy-pay-to-launch-virtual-crypto-mastercard-and-visa-card-services-301350814.html",
        "created": 1628512844.0
    },
    {
        "author": "Thin_Application_424",
        "created_utc": 1628216122,
        "id": "oyxduk",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " If I’m reading correctly and with what we know up to this point. The Q2 earnings is gonna fuck up estimates. Their guidance and commentary estimates between 66K-70K MA membership by 12/31/21. Membership was approximately 66,300 as of 3/31/21 (a full 9 months before schedule). Their GAAP MCR reported was 107.6% (but that’s taking into account COVID-19 costs; without which was only 95.4%). Their expenses was $104.6 million, but that was “primarily due to an increase in non-cash stock-based compensation to certain executives in relation to the merger” with SPAC. Which won’t be on Q2 financials. Their GAAP net loss was $(48.4M) but that was primarily due to the fact the SEC made them change warrants to a liability in their balance sheet, which since have been redeemed and will affect their bottom line significantly (won’t be a liability any longer). Their EBITDA (earnings before interest tax depreciation and amortization) was ($76.2M) with COVID-19; without it would’ve been only ($52.1M). Revenue generated by Direct Contacting estimated between $20-$30M depending on finalization of accounting “which they expect to be completed by end of the second quarter.” Reconciliation of Adjusted Operating Expenses (non-GAAP) to projected salaries and benefits is not provided because stock-based compensation cannot be reasonably calculated without unreasonable efforts (which won’t matter for Q2 because they haven’t further compensated executives and already have been accounted for as an expense in Q1). A reconciliation of projected normalized MCR (medical cost ratio, low number is better) to GAAP MCR cannot by calculated because of COVID-19. Which we did see a decrease in COVID-19 so those numbers can’t be anywhere close to Q1. Th numbers are going to be awesome. Revenue will be higher than estimated ($205.39 Q2) because of estimated $20-30M due to direct contacting. And costs will be lower because Q1 included compensation to executives by way of non-cash stock-basis. They will show that even with COVID-19 costs, with their membership growth already at their estimates for the whole year, operating expenses what they really will be moving forward without the stock compensation, and warrant liability accounted for. This earning call is going to be HUGE! They’re doing a live webcast on 8/11/21 at 5 pm EST on",
        "subreddit": "wallstreetbets",
        "title": "Discussion on $CLOV",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oyxduk/discussion_on_clov/",
        "created": 1628244922.0
    },
    {
        "author": "Mouse_Numerous",
        "created_utc": 1628015253,
        "id": "ox9m9g",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "This is memo on Metromile $MILE heavily shorted. \n\nBetsy Cohen joins Metromile $MILE Board of Directors, investing millions in MILE MassMutual Barings owns 19.3M common in Novation Co $NOVC. $MILE and $NOVC are both massively shorted and could offer a bigger SHORT SQUEEZE then $GME. \r  \nFortress, Wesley Edens CEO and EJF Capital Manny Friedman, CEO own 31.3M NOVC Common and the only Sr Debt to exit Ch 11 with $6.3M cash for no cram down. They were given post Ch 11 exit 31.3M NOVC common at less than ONE PENNY see Globenewswire link below, courtesy of NOVC Chairman. NOVC Chairman Barry Igdaloff restructured Dynex Capital NYSE $DX with Wesley Edens who at the time 2000-03 was Chairman of both Fortress and Capstead Mortgage $CMO. CMO owned DX. Igdaloff and his same DX cabal owns at least   40M NOVC common with his cabal mostly from Dynex Capital $DX. I with a small shareholder count own 30M NOVC shares totals 120M vs 116M shares outstanding in 2020 10K filed 3/4/21 Audited by www.boulaygroup.com which refuses to disclose same common equity investors own at the same time NOVC only Sr Debt to exit Ch 11 effectively allowing these investors to use Sr Debt as fodder to take 50M of their 90M NOVC commons shares at pennies or less. Who knows how many common they or their agents have bought at pennies per share? \r  \n\r  \nThe last 6 days over 2M shares traded on $NOVC of which 52% was shorted www.otcshortreport.com/company/NOVC on no news, no Q, Going Concern in 10K created by concealing the fact same investors www.Fortress.com and EJFcap.com own both the NOVC common and NOVC only Sr Debt, hidden by them behind CDOs they paid very little to own via CDO Service Rights; Fortress owns 2.3rd of NOVC only Sr Debt/31.3M common via Taberna CDOs I and II Fortress bought from #MILE Board Member Betsy Cohen RAIT Financial https://www.inquirer.com/philly/business/homepage/20100422\\_RAIT\\_sells\\_Taberna\\_CDOs\\_for\\_\\_16\\_5M.html Who would short a penny stock?\r  \nThey can copy their restructurings at Dynex Capital DX and Newcastle $NCT Fortress split into 3 tax exempt MREITs $NRZ, $SNR, $NEWM aka $GCI before changing Newcastle name to www.driveshack.com $DS. \r  \n\r  \nI have reason to believe they will duplicate or cut and paste these restructuring blueprints at Novation Companies, Inc. $NOVC by separating NOVC ex MREIT Novastar Financial Inc that holds rights to rich, seasoned collateral assets to most of $3 Billion portfolio of RMBS, Non-QM collateral assets that can be leveraged 15:1 say 10:1 into 30 B portfolio x NIM of 500 Bpts say 400 Bpts that is $1.2B NIM less some SGA, Other Ex and you have annual dividend est at 3-6.00 (DX pays .13 ct MONTHLY dividend .39 cts per Qtr, NRZ in 2019 paid common 2.00 annual or 50 cts qtrly dividend). At 10% yield that is as much as 60 stock you can buy today for much less and this does not include like $DS another tax free company operating with 730M NOL www.healthcare-staffing.com. NOVC provides no transparency because by failing to be transparent and misleading Mr. Market they drive share price to pennies while they award the Board 18M RSU and give Note Holders hidden behind CDOs 31.3M common at less than ONE CENT. https://www.globenewswire.com/news-release/2019/08/09/1900133/0/en/novation-companies-inc-executes-first-amendment-to-senior-secured-note-purchase-agreement.html \r  \nCDOs owned by Fortress/EJF Capital are would be worth almost $2B (31M shares x 60/share) and they still collect dividends and another lucrative management fee like NRZ per 10K at NRZ paid Fortress in 2019 alone $170M two part management fee. They still hold like DS HCS owned by NOVC www.healthcare-staffing.com \r  \nWhere is ex MassMutual Employee aka #RoaringKitty aka Keith Gill American financial analyst Keith Patrick Gill is an American financial analyst and investor known for his posts on the subreddit r/wallstreetbets. Wikipedia Born: June 8, 1986 (age 35 years), Brockton, MA Other names: DeepFuckingValue; Roaring Kitty Alma mater: Stonehill College Known for: Involvement in the GameStop short squeeze",
        "subreddit": "wallstreetbets",
        "title": "This is memo on Metromile $MILE as it is heavily shorted like $GME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ox9m9g/this_is_memo_on_metromile_mile_as_it_is_heavily/",
        "created": 1628044053.0
    },
    {
        "author": "dadozer",
        "created_utc": 1628017913,
        "id": "oxakai",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I did it, ma: 2k to 42.5k AMD (bonus 25k--1.5k--42.5k portfolio)",
        "url": "https://www.reddit.com/gallery/oxakai",
        "created": 1628046713.0
    },
    {
        "author": "ItsyaboiNuT",
        "created_utc": 1628502886,
        "id": "p0ycwu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Alchemy Pay to launch virtual crypto cards with Visa and Mastercard support",
        "url": "https://www.reddit.com/r/stocks/comments/p0ycwu/alchemy_pay_to_launch_virtual_crypto_cards_with/",
        "created": 1628531686.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1628619701,
        "id": "p1v23r",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "W￼ith Apple‘s iPhone typical fall launch is fast approaching, details about the device’s new capabilities have started to leak out.\n\nAs consumers and gadget fans pore over the tidbits for taste of what Apple’s (ticker: AAPL) latest pocket computetr will have in store, chip investors too are scrutinizing the trickle of information. In a Tuesday report, Bloomberg News said the new Apple phones will feature new video and camera features, a faster Apple-designed chip to power the gadget, and new screen technology. Apple will keep the same iPhone dimensions and designs as last year’s models, the report said.\n\nBased on the scarce available details, the exact makeup of the guts of the next line of iPhones is highly speculative at this point. But, investors know a few things already based on past designs and the bare-bones description. \n\nOne of the biggest changes in recent memory was the iPhone’s adoption of 5G technology, requiring a batch of new chips to support the fast uplink speed. For many phones, including Apple’s, that tended to mean much more silicon overall, which was good news for the chip makers that supply Apple with parts.\n\nFor the 5G modems themselves, the iPhone 12 contained chips made by Qualcomm (QCOM), which suggests it too will likely supply the iPhone’s 5G wireless chip—at least for now. Apple has reportedly launched its own effort to design wireless radios, so that may change in the future. The chip giant has made other chips for the iPhones such as power modules. \n\nSkyworks Solutions (SWKS) and Qorvo (QRVO) make radio-related iPhone components, too, and have both been historic suppliers. Broadcom (AVGO) also has made wireless chips and other iPhone components. Barclays chip analyst Blayne Curtis has staked Qorvo has his favorite of the batch of Apple suppliers he watches.\n\nFor the new camera, it’s possible Texas Instruments (TXN) could play a role, as it has supplied the power-management chip for previous iterations of the iPhone camera. Its chips that help with battery-charging have also been spotted in past phones.\n\nMemory-wise, according to an iFixit teardown, the last iPhone used random access memory made by Micron Technology (MU). Micron has said the 5G upgrade cycle has benefited it because new generation phones typically carry more RAM than their 4G counterparts. The iPhone 12’s flash storage was produced by closely held Kioxia Holdings, a Japanese memory maker that has been considering an initial public offering in recent months.\n\nWe know Apple is designing the chips that power its phones, and has for several generations, effectively cutting out Qualcomm from the processor part of iPhone revenue. Taiwan \nSemiconductor Manufacturing (TSM), has made the chip in the past, and it is all but certain to be making the latest iPhone processors.\n\nSource: Barron's\n\nSome of the semi stocks mentioned in this article are still worth to buy. qcom, tsm, mu, skws and qrvo are all trading between 20 to 30 pe. The revenue growth for these stocks are still attractive. With apple releasing the new iphones at September, these stocks will definitely benefit from the ongoing 5G trend.",
        "subreddit": "stocks",
        "title": "Apple Suppliers That Could Benefit New iPhone Models",
        "url": "https://www.reddit.com/r/stocks/comments/p1v23r/apple_suppliers_that_could_benefit_new_iphone/",
        "created": 1628648501.0
    },
    {
        "author": "babbldev",
        "created_utc": 1629132051,
        "id": "p5jthx",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Most pessimistic tickers in last week's news (8/9-8/13):**\n\n1. $OCGN Ocugen\n2. $AAP Advanced Auto Parts\n3. $ARE Alexandria Real Estate\n4. $ETSY Etsy\n5. $AMZN Amazon\n6. $SWKS Skyworks Solutions\n7. $PTON Peloton\n8. $CMCSA Comcast Communications\n9. $BR Broadridge\n10. $CHTR Charter Communications\n11. $TXN Texas Instruments\n\n**Most optimistic tickers in last week's news (8/9-8/13):**\n\n1. $WBA Walgreens Boots Alliance\n2. $QQQ\\* Invesco QQQ\n3. $MRVL Marvell Technology\n4. $TTD Trade Desk Inc.\n5. $WFC Wells Fargo\n6. $AMD Advanced Micro Devices\n7. $D Dominion Energy\n8. $CB Chubb Ltd.\n9. $CVS CVS Health\n10. $CRO Cirralto\n11. $XRP Ripple Coin\n\n *Source: 2,534 finance articles scraped from Benzinga, YahooFinance, MarketWatch, +53 others. Tickers corresponding sentiment expressed for each ticker shown below.* \n\nhttps://preview.redd.it/05q93u7dzqh71.jpg?width=826&amp;format=pjpg&amp;auto=webp&amp;s=7f6c7e937bcbe138447398842d10431935b4216a\n\nhttps://preview.redd.it/no611w7dzqh71.jpg?width=825&amp;format=pjpg&amp;auto=webp&amp;s=fd65e4264475b022e01acdcfa3128bd8e468a8ba",
        "subreddit": "StockMarket",
        "title": "Stocks with most optimistic &amp; pessimistic sentiment in news coverage over the past week:",
        "url": "https://www.reddit.com/r/StockMarket/comments/p5jthx/stocks_with_most_optimistic_pessimistic_sentiment/",
        "created": 1629160851.0
    },
    {
        "author": "stockplanner",
        "created_utc": 1628811901,
        "id": "p3btje",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Long Afternoon Watchlist $AAPL $ABBV $ACN $AMT $BDX $BHP $CCI $SWKS",
        "url": "https://youtube.com/watch?v=SVN2kuJxETA&amp;feature=share",
        "created": 1628840701.0
    }
]