[
    {
        "author": "Tersiv",
        "created_utc": 1624366303,
        "id": "o5mfhi",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "The parent company of Soho House which contains the Soho House worldwide clubs, Soho Works (read below), Electric Cinemas (these make AMC ones look like fun schoolgirl projects) their own furniture brand Soho Home, and glassware brand Barwell, in addition to offshoot clubs like The Ned in London’s Square Mile and Scorpios in Mykonos is headed to IPO on the NYSE under the ticker $MCG for a valuation of between $2b to $4b \n\nSome quick facts:\n\n- The IPO will be overseen by JPM and Goldman\n\n- But ‘WTF is soho house you retard?’ I hear you ask: They are an exclusive members club for those working in the creative sector (but who also tend to be trust fund kids, bankers masking as art philanthropists - your average blue-armpit-hair Marxist artist isn’t paying $18 a cocktail but they’re always packed and getting a rooftop seat in London or New York is near impossible atm\n\n- Their F&amp;B margins are insane \n\n- Kim Kardashian has been rejected a membership over a dozen times\n\n- haven’t turned a profit due to aggressive Goldman-backed expansion (see below): this year alone there will be openings in Rome, Tel Aviv, Brighton, Paris and London’s Strand just opened.\n\n- they have recently made an incredible shift towards turning the membership into a digital socialising network for their members with 7-figure investments into their app alone that has clubhouse like features, noticeboards, video chat, and frankly a more useful social tool than boomer Facebook and other cancerous ‘social’ media apps: the idea being that since the members are all vetted (you need a proposer and a seconder to be granted membership) they are much more likely to reach out and socially engage with one a other \n\n- they have a WeWork competitor called Soho Works which is frankly nicer, cooler and more of a social status catch for trust fund kids working on their ‘startup’  than prime retard masayoshi son’s loss porn brand WeWork\n\n- the principle holders are billionaire Ron Burkle, the founder Nick Jones, and British entrepreneur and CEO of caprice holdings, Richard Caring.\n\n- Goldman Sachs is placing a big bet on the growth of Soho House, with a $770m (£560m) loan to further allow for aggressive expansion \n\n- it’s so private your wife can meet all her boyfriends there and since photography is prohibited you can still hold your head high in your community \n\n- Profits at Soho House soared 23% to £31.7m in 2016 revenues up by a similar margin to £273.6m.\n\n-Turnover jumped again in the first half of 2017 by 28%, buoyed by new openings\n\n-They made £293 million (approximately $411 million) in revenues in 2019, about half of which originated from food and drink revenues and 20 percent from recurring payments by members. The rest originated from housewares.\n\n- it’s very pandemic/crisis proof because of being able to draw down on waitlists, according to the FT: “Soho House has been able to continue its aggressive expansion through a mixture of cost cuts, fundraising and incoming membership fees.\n\n“Our membership model is pretty robust through a serious crisis,” said Mr Jones, who reckoned that the lengthy wait to become a member — up to 18 months in some cases — put people off cancelling.”\n\nHe also told CITY A.M.; ‘if the business needed more money post-pandemic, it would let in its “huge” waiting list of 50,000 people.’\n\n- because of this current members are also reluctant to give up their membership because it’s so difficult to get in to start with \n\nNow if you don’t mind I’m going to go back to drinking my $9 matcha latte at the New York one.",
        "subreddit": "wallstreetbets",
        "title": "Soho House Retards",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o5mfhi/soho_house_retards/",
        "created": 1624395103.0
    },
    {
        "author": "randomhardo",
        "created_utc": 1623482785,
        "id": "ny15je",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "# Disclaimer:\n\n1) GILT has a market cap of $600m which is below the $1bn requirements for DDs  \nThat being said, GILT is a TASE 125 Index competent (Tel Aviv Stock Exchange), and is the #45 largest company in Israel. **If the market cap is an issue even for approved members, then I guess just take it down,** posting this DD since u/zjz and mods have been pushing for \"DDs that doesn't involve short squeezing\"\n\n2) This DD includes financial data that is not audited and not prepared in accordance with GAAP\n\n3) This DD also consists of personal opinions, third-party market research and not intended to be investment advice\n\n4) Lastly, the short percent of float is 1.65%, **there won't be any squeezing** (what a surprise, wow!)\n\n# Background 🛰️\n\nSo basically wtf is GILT, GILT is Gilat Satellite Networks Ltd and it is a provider of satellite-based broadband communications\n\nThe company designs and manufactures ground-based satellite communications equipment and provides comprehensive solutions and end-to-end services\n\nIts portfolio includes a cloud-based satellite network platform, very small aperture terminals (VSATs), amplifiers, high-speed modems, on-the-move antennas, and high-power solid-state power amplifiers (SSPAs), block upconverters (BUCs), and Transceivers\n\nThe company's solutions support multiple applications with a **full portfolio** of products to address key applications including **broadband access**, cellular backhaul, enterprise, in-flight connectivity, maritime, trains, **defense,** and **public safety**\n\n**This kinda reminds me of.**\n\n![img](7431zuic2s471 \"(just kidding)\nAEROTYNE &gt; we are looking at both civilians and military applications\")\n\nThe company’s equipment is used by satellite operators, service providers, telecommunications operators, system integrators, government and defense organizations, large corporations and enterprises. \n\nIt deals internationally, in Latin America, Asia, the Asia Pacific, North America, Africa, and Europe. In particular, the company provides connectivity services, internet access, and telephony, to enterprise, government, and residential customers over its own networks, built using both its equipment and equipment purchased from other manufacturers in various technologies and over other networks that it installs, primarily based on BOT (build, operate and transfer) contracts.\n\n# Industry Analysis 🛰️\n\n&gt;The global VSAT market is projected to grow from USD 9.5 billion in 2020 to USD 13.7 billion by 2025, at a CAGR of 7.5% during the forecast period.  \n&gt;  \n&gt;**Gilat Satellite Networks (Israel)**, L3 Harris Technologies (US), Viasat Inc (US), Inmarsat Global Limited (UK), and Orbit Communication System (Israel) are some of the **leading players** operating in the VSAT market report.  \n&gt;  \n&gt;Increased demand for VSAT in the maritime industry, and demand for VSAT on-the-move solutions for various platforms are the major factors driving the VSAT Market.  \n&gt;  \n&gt;The market is driven by various factors, such as the growing demand for VSAT systems from the maritime industry and increasing demand for VSAT on-the-move solutions for various platforms, and commercial services are the major drivers of VSAT market.  \n&gt;  \n&gt;The VSAT market includes major players Gilat Satellite Networks (Israel), L3 Harris Technologies (US), Viasat Inc (US), Inmarsat Global Limited (UK), and Orbit Communication System (Israel). These players have spread their business across various countries includes North America, Europe, Asia Pacific, Middle East, Africa, and South America. COVID-19 has impacted their businesses as well. Industry experts believe that COVID-19 could affect VSAT production and services by 7-10% globally in 2020.\n\n# Key Market Position 🛰️\n\nGILT has 80 patents, yes 80 patents in the whole satellite services, this ranges from communication cards to non-geosynchronous orbit satellite constellations. Below are some snapshots of what they do. It is very technical and looks complex, so that's good\n\nhttps://preview.redd.it/3sy1raa55s471.png?width=859&amp;format=png&amp;auto=webp&amp;s=f2b53e4d2743f2db634d6efadddd115a9359a3de\n\nhttps://preview.redd.it/l87g504g4s471.png?width=948&amp;format=png&amp;auto=webp&amp;s=7de925a9fe1d8ecc9502096df4f225d3e9c3447f\n\n# Financials 🛰️\n\n&amp;#x200B;\n\n[Gross](https://preview.redd.it/7ym51gtp5s471.png?width=1248&amp;format=png&amp;auto=webp&amp;s=0fd410a9ecf4738a706c9c03581c6378978dc3ba)\n\n[OCF](https://preview.redd.it/r9jylvhq5s471.png?width=1242&amp;format=png&amp;auto=webp&amp;s=be3c6219904dfa1639978651a539d60286bcd7fe)\n\n[fairly undervalued taking into account future earnings](https://preview.redd.it/yo4a3d6s5s471.png?width=728&amp;format=png&amp;auto=webp&amp;s=8cfc6ff9503e1b59814460692905f3f9cd27ba74)\n\nGILT **PE Ratio** is (14.3x) compared to the US Communications industry average (34.8x)  \nGILT's **revenue** is also forecast to grow faster than the US market (9.2% per year)  \nGILT also has **interest coverage** of 100, which means it is in good financial health\n\n# Catalysts - Smart Money Moving In 🛰️\n\n&gt;Taking into account **active hedge funds and investment managers only**  \n&gt;  \n&gt;Yelin Lapidot  \nFranklin Templeton  \nCitadel (2000% change)  \nVoloridge  \nMillennium Management  \nARK (100%)  \nSusquehanna (500%)  \n&gt;  \n&gt;all added on their positions in the last quarter alone\n\n# Catalysts - Positive News, Growing Orders 🛰️\n\n&gt;**Jun**  \nGilat Receives Contract to Supply Satellite Communication Equipment for Military Usage   \n&gt;  \n&gt;**May**  \nGilat Receives $13 Million Contract Award by Pronatel for Delivery of Internet    \nGilat Extends Multi-Million Dollar IoT Project in Latin America   \nGilat Receives Orders of over $4 Million for Support of Gateways of Low Earth Orbit (Leo) Constellations   \nGilat Enters Into Strategic Agreement Valued at Tens of Millions of Dollars with a Large Government Corporation in Asia Pacific   \n&gt;  \n&gt;**Apr**  \nGilat Receives over $5 Million for Cellular Backhaul Expansion from Tier-1 Mobile Network Carrier in Japan   \nGilat Receives over $20 Million in Orders for Support of Low Earth Orbit Constellation \n\n# Technicals 🛰️\n\nI'm not going to draw many lines because I'm not good at it and there are others out there that will do a much better job than I am. So I'm just going to leave you guys with Oscillators and MA\n\nhttps://preview.redd.it/urc6pmpaas471.png?width=914&amp;format=png&amp;auto=webp&amp;s=c27109a20d7c4480aa5ea7de9f00c49470ede8f6\n\nhttps://preview.redd.it/074admpaas471.png?width=873&amp;format=png&amp;auto=webp&amp;s=15e5abbc8a06bb6afa710492be16557407aedcb5\n\nhttps://preview.redd.it/678yjopaas471.png?width=858&amp;format=png&amp;auto=webp&amp;s=96f4e289cabb925e3f43da415193289295980443\n\n**TLDR:**\n\nStrong Fundamentals, improving Cash Flow. 🚀🛰️🌜\n\n&gt;They make their own VSAT cards so they could get revenue while no one was doing launches, they're one of the biggest microsatellite launchers in the world, they already have some juicy government contracts and they're uniquely poised to capitalize on the 5g rollout. They gon' be big.-\n\nu/MaverickTopGun\n\n**Bear**\n\n&gt;The biggest risk to Gilat Satellite Network is the competition. Much like the race to 5G that terrestrial companies are racing toward, Low-Earth Orbit (LEO) satellite technology is the next generation. It’s how militaries will communicate with low latency.  \n&gt;  \n&gt;Also, Gilat isn’t the only VSAT company in the race. Companies like Viasat Inc (VSAT) and Hughes Electronics Corporation also provide satellite internet to rural areas in the U.S. And Starlink is on its way.\n\n  \nPositions: 🚀🛰️🌜\n\nShares acquired at $10  \n15c LEAPS\n\nDYODD",
        "subreddit": "wallstreetbets",
        "title": "🛰️ $GILT: Israeli Satellites (civilians and military applications) 🛰️",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ny15je/gilt_israeli_satellites_civilians_and_military/",
        "created": 1623511585.0
    },
    {
        "author": "ExtensionDrawi",
        "created_utc": 1623739919,
        "id": "o07zz9",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Fast Finance24 \nKürzel :FF24 \nWKN: A1PG50\n\n\nNach längerer Suche wurde mit FF24 mal ein Penny Wert gefunden der tatsächlich 1 Euro gar über 1 Euro Potential vorweist .\n\nEinige Punkte mal kurz und knapp\n\n1. FF24 bringt jetzt ihre Töchter weltweit an die Börse , aktuell läuft die IPO für ok.de \n\nLaut Broschüren und der PR Agentur am Telefon läuft IPO so ab \n\nAm 01.09. wird ok.de an die Börse gehen.\nSowohl hier in Deutschland , folgt ein Listing in Toronto und an New York‘er Börsen. Es werden 100 Millionen Aktien zu 1,20 Euro platziert ( denke 1,20 schon hoch gegriffen) . \nWer bis 30.6. \nEinen Vorkauf bei ff24 für ok.de tätigt bekommt sie für 0,60 Euro. Mindestens 5000 müssen gekauft werden, max sind 50k Stück möglich. Haltezeit 6 Monate ab Börsengang. \n\nNur 10 Mio Aktien Anteile werden verkauft , die restlich 90 Mio wird FF24 halten .  Was umgerechnet eine Marktkapitalisierung weit über 1 Euro für FF24 zu folge haben müsste.\nBei 1 Euro ist die gerade mal mit 50 Mio bewertet \n\nKontakt :\nPR IR Agentur für FF24 &amp; Ok.de\nMail: ir@ff24.com\nTEL: 030/72621234\n\nQuelle : https://unternehmen.focus.de/geplante-boersengaenge.html\n\nQuelle : https://pre-ipo.ok.de/optin-469069351614335266586\n\n\n 3. ok.de hat als erster deutscher Online Dienstleister ihren eigenen coins raus gebracht , im Blockchain Sektor nun am Start  \n\nals erster kostenloser E-Mail-Anbieter mit unbegrenztem Speicher plant OK.de mit den OK-Coins zudem ein innovatives Prämiensystem, welches als anonyme und sichere Kryptowährung ausgegeben werden soll. Für die Zukunft ist geplant, internationale Domains zu kaufen und das Geschäft auf die USA und weitere Teile Europas auszuweiten.\n\n\nhttps://kb.ok.de/support/solutions/articles/48001149104-so-kaufen-sie-ok-coins\n\n\n4 . Vor kurzen wurde ein Otc Mantel übernommen , dieser wird nun zeitnah ein neuen haben Namen bekommen. Es wird sich um ein Fintech Unternehmen handeln was die Amerikaner lieben . Bei der Übernahme des wertlosen Mantels im März  , haben die Amis ihn alleine an an 2 Tagen auf über 700% hoch gekauft was eine kurzzeitige Bewertung im dreistelligen Millionen Bereich ausgemacht hatte .Die Ersten Töchter wurden nun den Mantel zu geführt \n\nFF24 Merchant Services GmbH (ff24payments.com) und der FF24 Ventures GmbH (ff24pay.com),\n\nDas Witzige ,  alleine der leere Mantel der bald an der Amerikanischen Börse mit neuen Namen sein Comeback feiert , ist aktuell mit 11 Millionen Dollar bewertet  \n\nFF24 Holding hält 90% Mantel  an diesen Mantel !!! Was bedeutet der Mantel ist alleine höher bewertet wie FF24 in Frankfurt selber \n\n\nQuelle : https://finance.yahoo.com/news/standard-vape-closes-rto-fast-131000550.html\n\nQuelle : http://mobile.dgap.de/dgap/News/corporate/fast-finance-holding-reverse-takeover-mit-der-standard-vape-corporation-erfolgreich-abgeschlossen/?newsID=1444863\n\n\n 5. Freefloat \n\nDas aktuell Freefloat liegt bei unglaublichen 14.71% nur .\n\nVor über einem Jahr noch bei 11% \nda hat aber eine Treuhand Firma im Jahre 2019/2020 sich von ihren 3,5% Anteilen getrennt ...was bei den geringen Handelsvolumen ein Kurzrückgang von 0,50 auf 0,10 \n\n\nFazit : \n\nAlleine die beide Beteiligungen an den zukünftig Börsen gelisteten Töchter Unternehmen , wo FF24 je 90% der Anteile hält spiegelt eine fundamentale Bewertung von 1.50-2 Euro wieder.  \n\nFF24 wird zeitnah nicht sondern zwei Töchterunternehmen an der New Yorker Börse gelistet haben !\n\nBei den geringen Freefloat von 14.71% könnte nun zeitlich schnell eine Neubewertung anstehen .\n\nThema fehlender Jahresbericht für 2020, der ist nicht Vollzug !\n\nFF24 ist an einem Nebenbörsenplatz gelistet da muss dieser in den ersten 6 Monaten im\nNeuen Jahr veröffentlicht werden aber auch hier gibt es weitere Ausnahmen ,so das  FF24 diesen wie jedes Jahr zuvor im August traditionell zur HV präsentiert.\n\nKeine Anlageberatung oder Kaufempfehlung. Sondern informationsaustausch.\n\n[View Poll](https://www.reddit.com/poll/o07zz9)",
        "subreddit": "Wallstreetbetsnew",
        "title": "$FF24 Fast Finance24 vom Penny zum Euro",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/o07zz9/ff24_fast_finance24_vom_penny_zum_euro/",
        "created": 1623768719.0
    },
    {
        "author": "stintank",
        "created_utc": 1623436838,
        "id": "nxn2mj",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$TEL; $150 call July 16th",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nxn2mj/tel_150_call_july_16th/",
        "created": 1623465638.0
    },
    {
        "author": "PlumpStegadon",
        "created_utc": 1624989124,
        "id": "oadgtb",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Howdy y'all. Are you a farmer hoping to make more profit on growing tobacco plants? Or maybe you’re just someone who likes boobs? In either case, you might be curious about what this cowboy bet the farm on when he visited the town’s saloon earlier this year - Collplant ($CLGN). *(disclaimer: When a cowboy starts yelling about a stock while stumbling out of a saloon, it’s probably smart to only use it for entertainment purposes and do your own research.)*\n\n**What is Collplant?**\n\nThey are a small biotech company based in Israel that has developed a way of producing rhCollagen from genetically-engineered tobacco plants. Collagen is used in both regenerative and aesthetic medicine. Compared to animal-based collagen, the company claims theirs is both better at cell-binding and has lower risk of pathogens or adverse immune responses. That’s a relief since the local sheriff told me some of the other cowboys have had half their cattle snatched up by the collagen thieves recently.\n\nTheir original usage of collagen has been for products involving advanced wound care and tissue repair. These are commercially available in a few eastern European countries. However, they haven’t generated more than $1-2M/year in revenue from them and I’m not sure if/when it might get FDA approval in the US. That brings me to the juicer product field: medical aesthetics!\n\nOn 2/8/2021, Collplant announced a development and commercialization agreement with Abbvie ($ABBV) for dermal and soft tissue fillers with the following benefits:\n\n* $14M upfront payment (already received)\n* Up to $89M additional milestone payments\n* Royalty payments on future product sales\n* Payment for manufacture and supply of the rhCollagen\n\nCollplant is also working on breast implants: both injectable and 3D bioprinted ones that use their rhCollagen. They have been working on research and prototypes for a few years and recently announced a joint development agreement with 3D-systems ($DDD) for this. So we might not just get DD-sized boobs, but also $DDD-sized ones! Their [page](https://collplant.com/products/breast-implants/) explains how the implants are basically temporary scaffolds that would gradually be replaced by newly grown natural breast tissue. So, the augmented boobs would actually be as good as the real thing! This also has potential to help breast cancer survivors via reconstructive procedures.\n\n**Key Statistics**\n\n* Market cap: \\~$200M\n* P/E (ttm): 34\n* Cash on hand as of 3/31: $50M\n* Long-term debt as of 3/31: 0\n\nThe $50M of cash reserves is enough to fund over 3 years worth of operating expenses without any revenue or share dilution, based on the $3.6M spent in 2021 Q1 ([earnings release](https://ir.collplant.com/news-events/press-releases/detail/108/collplant-biotechnologies-reports-first-quarter-2021)). The cash reserves mostly came from the initial $14M ABBV payment and a $35M secondary share offering earlier this year. This puts the company in a strong financial position, considering that they also stand to gain significant revenue from the ABBV deal and still get a bit of money from the wound care products. There could also be new deals/products announced in the future that would bring in more money.\n\n**Risks**\n\n* This is a small biotech company, which is inherently risky.\n* The company had a licensing and development agreement with United Therapeutics ($UTHR) for organ printing (lungs, kidneys, etc.) R&amp;D, but this was unexpectedly cancelled by UTHR earlier this year. This used to be Collplant’s one source of revenue besides the wound care product sales, which highlights the risks of relying on a handful of other companies for revenue via special deals instead of direct product sales.\n* Competitors in the space of medical aesthetics and organ printing might develop superior solutions that don’t use any collagen.\n* The company R&amp;D center is located in Rehovot, Israel - about 30 miles north of the Gaza border. I think rockets sometimes fly over that area on their way to Tel Aviv.\n\n**A few possible outcomes:**\n\n1. Deals with ABBV and DDD go reasonably well, wound care sales increase slowly, and CLGN stock has a peaceful decade, maybe going up 3-4x in the next 10 years.\n2. 3D printing or biotech business (maybe one currently working with Collplant) buys out the company for 2x current value (buyouts for small tech companies usually involve huge premiums).\n3. Collplant becomes a meme stock. The apes like boobs, especially $DDD-sized boobs. Maybe they also think it’s funny that it comes from tobacco. Collplant to the moon! They take advantage of a 10x stock price increase to fund moon-based collagen research that fails and then crash back to the current price.\n4. ABBV suddenly cancels the development agreement. DDD follows suit. Wound care product sales wither away to 0. Cash reserve dwindles over several years, shareholders are diluted into oblivion, and I am ruined.\n\n**So did you actually bet the farm on it? Or was it more like a large garden patch?**\n\nI bought 30k shares at an average cost basis of $16. $480k can probably buy a few acres of farmland somewhere in the Midwest. Or it might be able to buy a small garden patch in the SF bay area if patch inspection is waived. This is risky, but I’m a Collplant Cowboy!",
        "subreddit": "smallstreetbets",
        "title": "[DD] Collplant ($CLGN)",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/oadgtb/dd_collplant_clgn/",
        "created": 1625017924.0
    },
    {
        "author": "iPutTheScrewNTheTuna",
        "created_utc": 1623442140,
        "id": "nxozk6",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Plant X is described as \"the digital face of the plant-based community, PlantX’s platform is the one-stop-shop for everything plant-based. With its fast growing category verticals, the Company offers customers across North America more than 10,000 plant-based products. In addition to offering meal and indoor plant deliveries, the Company currently has plans underway to expand its product lines to include cosmetics, clothing, and its own water brand — but the business is not limited to an e-commerce platform.\" \n\n\n[below is the article](https://vegnews.com/2021/6/Matthew-kenney-vegan-deli)\nAcclaimed vegan chef and restaurateur Matthew Kenney will open more than 100 locations of vegan convenience store New Deli by the end of this year. The flagship location opened in 2018 in Venice, CA, offering everyday retail goods, including household supplies, personal hygiene items, frozen foods, pantry staples, and snacks, that are sustainable and often organic and fair-trade. The neighborhood convenience store also offers an extensive collection of organic beer and wine in addition to a counter deli where customers can order freshly prepared vegan sandwiches, eccentric toast, carrot lox bagels, or containers of deli items such as marinated tofu, chickpea tuna salad, or eggless quiche. \n\n\nAfter appointing Kenney as its chief culinary officer and signing a five-year partnership agreement with Kenny’s lifestyle company Matthew Kenney Cuisine (MKC), Canadian plant-based e-commerce platform PlantX acquired the New Deli brand along with its brick-and-mortar store. The company will work in collaboration with Kenney to expand the New Deli concept across North America. Over the next three months, the team will open corporate stores in San Diego, CA, Tel Aviv, Israel, and Squamish, BC, with plans to be in every major city across Canada—including Vancouver, Toronto, Montreal, Calgary, Edmonton, Ottawa, and Victoria—by the end of the year. PlantX also expects more than 100 franchise locations to be sold over the next 12 months. All New Deli stores will be rebranded as New Deli by PlantX. \n\n“It was always our intent to build New Deli into the ultimate plant-based convenience store brand and ultimately align with a growth partner to expand it through various global markets, rather than grow it on our own,” Kenney told VegNews. “PlantX’s expertise in the e-commerce segment strengthens New Deli beyond a brick-and-mortar concept and into a much more versatile and efficient operating model. We are excited about this new partnership and all the other work we plan to do together to bring more plant-based options to the world.”\n\n\nPlantX’s rapid expansion\nDescribed by some as the “Amazon for vegan food,” the PlantX e-commerce platform was created as a one-stop-shop for everything plant-based, offering consumers across North America more than 10,000 vegan products, including meal and indoor plant deliveries, with plans underway to expand its product lines to include cosmetics, clothing, and its own water brand. Last fall, PlantX launched its website for US consumers and expanded its retail presence with the announcement of a vegan retail and cafe in San Diego.\n\n\n\nEarlier this year, the company applied to list its common shares on the NASDAQ as part of its strategy to expand into the United States and enhance the Canadian company’s investor profile and visibility while accelerating growth. The company is also currently listed on the Canadian Securities Exchange under the symbol “VEGA.”\n\nIn April, professional tennis player and four-time Olympic Gold Medalist Venus Williams invested in PlantX and joined the team as an ambassador to help the company advocate for plant-based living. Williams transitioned to a plant-based diet to alleviate symptoms of an autoimmune disorder. PlantX now carries Williams’ Happy Viking vegan protein brand on its platform and the tennis star curates a “Venus’ Favorites” section of PlantX products on the company’s website.\n\n\nI believe in the potential of this company. I'm pretty new to investing in stocks but wanted to hear what you all have to say about it.",
        "subreddit": "options",
        "title": "PLXTF stocks plant x",
        "url": "https://www.reddit.com/r/options/comments/nxozk6/plxtf_stocks_plant_x/",
        "created": 1623470940.0
    },
    {
        "author": "ecf5022",
        "created_utc": 1624547258,
        "id": "o72s20",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Bought up 2000 shares of Pubmatic $PUBM aka PUBEMATIC.  Over 50% short interest after the lockup period expired.  It has the potential to be the next TTD, but at least he’s the short-teen upside of squeeze. Time will tel if it can find a foothold like TTD",
        "subreddit": "wallstreetbets",
        "title": "$PUBM SQUEEZE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o72s20/pubm_squeeze/",
        "created": 1624576058.0
    },
    {
        "author": "MrCoil",
        "created_utc": 1624384002,
        "id": "o5su63",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hi all, so I’m a bit of a space geek and I genuinely think in my lifetime the development of space travel and tourism will be huge. I used trading 212’s PIE features which allows me to make my own say mini ETF. I made one using space stocks I knew as well as researching online and ARK’s space ETF.\n\nI’ve listed below the stocks I’m in and what % and so far I’ve been given 15% returns on my investment which i can’t complain about. I was wondering if anyone has feedback on Space stocks to add/remove or adjusting my % per stock. I personally really believe this collection will be very valuable in 10+ years \n\nVirgin Galactic - 10%\nLockheed Martin - 10%\nIridium communications - 10%\nTrimble - 10%\nAerojet Rocketdybe 10%\nMaxar Technologies - 9%\nNorthrop Grumman - 9%\nL3 harris - 8%\nThales - 6%\nBoeing - 5%\nAirbus - 4%\nTeradyne - 3.5%\nDassault systems 3.3%\nRaven industries 2.2%",
        "subreddit": "stocks",
        "title": "My own Space collection",
        "url": "https://www.reddit.com/r/stocks/comments/o5su63/my_own_space_collection/",
        "created": 1624412802.0
    }
]