[
    {
        "author": "jamzkourt",
        "created_utc": 1635613079,
        "id": "qj5lz0",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Events Calendar:\nMonday November 1:\n\nPG&amp;E (PCG) reports earnings.\nISM Manufacturing PMI (October)\nU.S. Construction Spending (September)\nTuesday November 2:\n\nPfizer (PFE), Amgen (AMGN), Thomson Reuters (TRI), ConocoPhillips (COP), Marathon Petroleum (MPC), Diamondback Energy (FANG), Vertex Pharmaceuticals (VRTX), and Lyft (LYFT) report earnings.\nFOMC Meeting\nIBD/TIPP Economic Optimism (November)\nEA Markit Manufacturing PMI, Final (October)\nChina Caixin Services PMI (October)\nWednesday November 3:\n\nCVS Health Corp (CVS), Progressive Corp (PGR), MetLife (MET), Qualcomm (QCOM), Emerson Electric (EMR), Marriott International (MAR), Electronic Arts (EA), Manulife Financial (MFC), MGM Resorts International (MGM), Broadridge Financial Solutions (BR), Jones Lang Lasalle (JLL), Marathon Oil (MRO), and APA Corp (APA) report earnings.\nMBA Mortgage Market Index (October)\nEA Unemployment Rate (September)\nThursday November 4:\n\nModerna (MRNA), Cigna Corp (CI), AIG (AIG), Allstate (ALL), Illumina (ILMN), Regeneron Pharmaceuticals (REGN), Square (SQ), Uber (UBER), Airbnb (ABNB), Dropbox (DBX), and First Solar (FSLR) report earnings.\nEA Markit Services PMI, Final (October)\nEA PPI (September)\nFriday November 5:\n\nEOG Resources (EOG) reports earnings.\nLMI Logistics Managers Index (October)\nU.S. Nonfarm Payrolls (October)\nEA Construction PMI (October)\nEA Retail Sales (September)",
        "subreddit": "wallstreetbets",
        "title": "Events and earnings next week ….what are your top plays …..I’m watching PFE MRNA RKT as top 3 earnings plays",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qj5lz0/events_and_earnings_next_week_what_are_your_top/",
        "created": 1635641879.0
    },
    {
        "author": "wsbanontoday",
        "created_utc": 1634051198,
        "id": "q6o8v2",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " P10 Announces Launch of its Initial Public Offering  \n\n\n[https://finance.yahoo.com/news/p10-announces-launch-initial-public-121600927.html](https://finance.yahoo.com/news/p10-announces-launch-initial-public-121600927.html)  \n\n\nDALLAS, Oct. 12, 2021 (GLOBE NEWSWIRE) -- P10, Inc. (“P10”), a leading private markets solutions provider, announced today that it plans to commence the roadshow for its initial public offering.  \n\n\nP10 has filed a registration statement on Form S-1 with the Securities and Exchange Commission (“SEC”) to offer 20,000,000 shares of its Class A common stock to the public. The offering consists of 11,500,000 shares of Class A common stock offered by P10 and 8,500,000 shares of Class A common stock to be sold by certain stockholders of P10. The underwriters will have a 30-day option to purchase from the selling stockholders up to an additional 3,000,000 shares of Class A common stock at the initial public offering price, less underwriting discounts and commissions. P10 will not receive any proceeds from the sale of shares of Class A common stock by the selling stockholders. The initial public offering price is expected to be between $14.00 and $16.00 per share (after a 0.7-for-1 reverse stock split as described below). P10 has applied to list its Class A common stock on the New York Stock Exchange under the ticker symbol “PX.”  \n\n\nMorgan Stanley, J.P. Morgan and Barclays will act as lead book-running managers for the proposed offering. UBS Investment Bank, Keefe, Bruyette &amp; Woods, a Stifel Company, Oppenheimer and Stephens, Inc. will act as book-running managers, and East West Markets will act as co-manager for the proposed offering.  \n\n\nImmediately prior to the consummation of the offering, P10 Holdings, Inc. will consummate a reorganization pursuant to which a reverse stock split of 0.7-for-1 will be effected, immediately following which holders of P10 Holdings, Inc. (split adjusted) common stock will receive an equivalent number of shares of Class B common stock of P10, and P10 Holdings, Inc. will become a wholly-owned subsidiary of P10. Such Class B common stock of P10 has super voting rights and automatically converts into Class A common stock upon a sale of such shares of Class B common stock. The expected initial public offering price provided above is calculated after giving effect to the reverse stock split at P10 Holdings, Inc.  \n\n\nThe offering will be made only by means of a prospectus. Copies of the preliminary prospectus related to the offering may be obtained from: Morgan Stanley &amp; Co. LLC, Attention: Prospectus Department, 180 Varick Street, 2nd Floor, New York, NY 10014; J.P. Morgan Securities LLC, c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717, by telephone at (866) 803-9204, or by email at prospectus-eq\\_fi@jpmchase.com; Barclays Capital Inc., c/o Broadridge Financial Solutions, 1155 Long Island Avenue, Edgewood, NY 11717 or by email at barclaysprospectus@broadridge.com or by telephone at 1-888-603-5847.  \n\n\nA registration statement on Form S-1 relating to the proposed sale of these securities has been filed with the SEC but has not yet become effective. These securities may not be sold, nor may offers to buy be accepted, prior to the time the registration statement becomes effective.",
        "subreddit": "wallstreetbets",
        "title": "P10 IPO details announced. GET ON BOARD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q6o8v2/p10_ipo_details_announced_get_on_board/",
        "created": 1634079998.0
    }
]