[
    {
        "author": "vm5662",
        "created_utc": 1635802181,
        "id": "qkobmu",
        "num_comments": 118,
        "num_crossposts": 6,
        "selftext": "**Be Fearful When Others Are Greedy and Greedy When Others Are Fearful” - Warren Buffet**\n\n**Why people are Fearful:**\n\n* One of the main concerns people worry about this stock in their last Q2 earnings is that their LTO origination was down 17% YOY. But I think this chart can explain this massive Year over year LTO origination decline. as they had exceptionally great Q2 last year due to COVID stimulus, which is a one time surge only and made their LTO origination in Q2 2021 looks really bad. but when compared to Q1 2021, it is still up 1%. so it is actually not that bad.\n* Because of the Q2 earnings and guidance removal the stock tanked hard and is now trading at $4-5, creating an opportunity for us to make some tendies.\n* Because the stock tanked hard there were several lawsuits against the management for this behaviour but from the legal perspective they are in their legal boundaries (personally I feel the management should have been more careful).\n* Katapult’s focus on the nonprime consumer niche seems risky at first. Afterall, you would think that customers with worse credit scores would yield higher default risks. However, Katapult’s bad debt expense, or expense for uncollectable accounts receivable, is down from 7.9% last year to 6.1% this year. That is in line with Affirm’s bad debt expense, and Affirm handles prime customers. Katapult’s bad debt expense is growing at less than half the rate of its revenue, showing investors that risks pertaining to bad debt actually minimize as the company grows.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6fzkxpkox1x71.png?width=1354&amp;format=png&amp;auto=webp&amp;s=a61e9a7f5a6c4b907cf80eb103a30d5559c43608\n\n**Why you should be greedy:**\n\n* A study from Juniper Research suggests that BNPL transactions will grow from $226B in 2021 to $995B by 2026. 55% of Americans used a BNPL option as of March 2021 vs. just 37% in July 2020. The Federal Reserve Bank of New York also reports that **38% of US consumers are considered nonprime,** making it difficult for these consumers to access financing options. **Additionally, 67% of consumers with a FICO score below 700 need a BNPL option for large purchases**. Katapult provides this solution for online customers. Katapult's platform integrates seamlessly to merchant sites, so customers can choose the financing option as they check out. As the sole provider of BNPL financing for nonprime customers, Katapult has a massive untapped market.\n* Katapult is forecasting over $1B in revenue by 2023, and the company could beat this number if it keeps aggressively expanding to include new merchants.\n* Recent great direct partnership with Salesforce and Adobe and indirect waterfall partnership from Affirm with (Amazon, Target, Walmart). The amazon - affirm deal actually sent $KPLT all the way up to $7\\~$8 in September.\n* When u look at the number of buys from insider and institutional holders when this one crash in august due to removal of their guidance, this shows smart money actually think the stock price around $3\\~5 is a steal. (The highest buy from insider is $4.42, which means CEO actually didnt expect market can be way overreacting that the price can drop to \\~$3)\n* Katapult has an agreement with Affirm where consumers not approved by Affirm are then routed to Katapult. Affirm receives a referral fee for each successful consumer application. As you can see from the graph above, Katapult approves \\~60% of consumers who failed prime lender applications. These \"waterfall\" applicants generate $117M incremental originations per 1M applications. To date, 50 out of Katapult’s 150 merchants have come through this Affirm partnership. These 50 merchants represent less than 1% of Affirm’s 6500+ merchants and only 6% of the 900 Affirm merchants Katapult believes are a good fit, offering an opportunity for future growth.\n\n&amp;#x200B;\n\n[Insider purchase](https://preview.redd.it/mbfmqwlpx1x71.png?width=2359&amp;format=png&amp;auto=webp&amp;s=d9651b69dd723605151440e9821aca97f60e3b44)\n\n**Investment Thesis**\n\nKatapult Holdings is a leading buy now, pay later (\"BNPL\") company that provides Ecommerce financing solutions for nonprime consumers. KPLT has generated explosive revenue growth while remaining profitable, a rare feat for a young growth stock. While its financial performance has been fantastic, KPLT’s valuation is the key to this investment. Katapult has higher sales growth and stronger profit margins than its peers. Meanwhile, its stock is trading at \\~1/40th the multiples of these competitors (discount varies based on sales, gross profit, or EBITDA multiples). You will not find another company executing at this caliber priced this cheap. Value stocks can perform well. Growth stocks can perform well. When an impressive growth stock is trading like an undervalued stock, you have the opportunity to generate incredible returns. Katapult is a $30 stock, you don’t want to miss this one.\n\n**What Is Katapult?**\n\nKatapult provides BNPL solutions for nonprime Ecommerce customers. Katapult is the only nonprime financing platform dedicated to Ecommerce, as shown below:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/n3uufepqx1x71.png?width=640&amp;format=png&amp;auto=webp&amp;s=d1e60005054acf799b53aee674e6e7f148943baf\n\nInvestor Presentation\n\nKatapult offers three payment options for consumers:\n\n* Full Term: A $45 origination fee followed by either 12-24 months of lease payments, at the end of which the consumer owns the good.\n* 90 Day Discount: An early purchase option at 90 days, which enables the consumer to buy the good at a discount to the original price.\n* Extended Discount: A discounted purchase option after 90 days, but before the end of the lease period.\n\nThe average order value for goods leased through Katapult is \\~$600 with an average lease multiple of \\~2.0x cash price. The company’s solution is well-liked by consumers. Its Net Promoter Score of 58 is strong for a financial service, and Katapult has a 4.4 rating on Trust Pilot.\n\n**Business Model**\n\nKatapult partners with Ecommerce merchants like Shopify, Wayfair, Lenovo, and Purple who then integrate Katapult into their websites as a purchase option. Consumers provide their information to Katapult, who in turn makes an immediate credit approval decision. Katapult's risk model reviews over 100 attributes, including lease history and prior payment behavior, to approve or deny applicants in under five seconds. The company has a sub-3% fraud rate across its portfolio, and it recovers 80-90% of lease costs of charge-offs. The financer’s platform is sticky, as 48% of purchases have been done by repeat customers. Katapult also generates revenue through a \"waterfall\" program with Affirm.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gzebfgyrx1x71.png?width=640&amp;format=png&amp;auto=webp&amp;s=5e7bbd61edc80e801e4ef6261124432914c7d641\n\nKatapult has an agreement with Affirm where consumers not approved by Affirm are then routed to Katapult. Affirm receives a referral fee for each successful consumer application. As you can see from the graph above, Katapult approves \\~60% of consumers who failed prime lender applications. These \"waterfall\" applicants generate $117M incremental originations per 1M applications. To date, 50 out of Katapult’s 150 merchants have come through this Affirm partnership. These 50 merchants represent less than 1% of Affirm’s 6500+ merchants and only 6% of the 900 Affirm merchants Katapult believes are a good fit, offering an opportunity for future growth.\n\n**Solution Offered**\n\nNonprime consumers without credit scores currently struggle to get affordable financing options. Payday loans and credit cards offer predatory rates, but many of these consumers can’t afford to pay cash for furniture and other expensive items. Katapult gives these customers access to high-quality Ecommerce merchants with affordable payment structures. By integrating its platform to these Ecommerce sites, Katapult has built both a cheap and efficient solution for nonprime shoppers.\n\nOn the flipside, Ecommerce companies gain access to consumers they otherwise would not be able to sell to without bearing any credit risk. Katapult is fast, and that increases conversion rates. Merchants that integrate Katapult as a payment option also see higher repeat rates. Customers get access to new merchants and affordable financing; merchants gain millions of potential new customers with no added risk. A win-win scenario.\n\n**Valuation**\n\nKPLT is at a conservative $1B valuation with $450M in 2021 revenue. Check out the slide below from Katapult’s initial investor deck.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/evq0ng1tx1x71.png?width=640&amp;format=png&amp;auto=webp&amp;s=c8e39ab5dce8ca2e895469936b5a001175cae7bd\n\n*Source: Investor Presentation*\n\nThe above slide compares different players in the BNPL sector. In a vacuum, 14x EBITDA for a company growing sales, net income, and EBITDA at 100%+ for the last three years is great value. When you compare this to other companies in the sector, Katapult looks criminally undervalued. But what if this entire sector is expensive, and KPLT’s price is reasonable in the broader FinTech market? I compiled the below data set to see Katapult against 15 other FinTech companies. The results are interesting:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cfkjo8wtx1x71.png?width=1386&amp;format=png&amp;auto=webp&amp;s=279e067ab736ae4185905d749375d1249f08d135\n\nNote that I highlighted other recent DeSPACs (PSFE, SOFI) and IPOs (AFRM, UPST, GLBE) to point out how they are priced vs. KPLT. Katapult is not just cheap for a BNPL financer. The stock is heavily discounted in the larger FinTech market as well. I built a scatterplot to illustrate these companies' \"expected\" EV/2022e Gross Profit.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h4n8zvrux1x71.png?width=1376&amp;format=png&amp;auto=webp&amp;s=7f492e668f24237ea951fb35099a7b7ea2b443e5\n\nKPLT is already profitable, expanding its margins, and growing revenue at a blistering 84% over the next two years. How does the market value it? 3.83x 2022e gross profits. Meanwhile, a regression line of the FinTech market suggests that KPLT *should* trade at 48.4x 2022e gross profits.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4b667psvx1x71.png?width=472&amp;format=png&amp;auto=webp&amp;s=359fd931a68e5598031a4547a93d24a0a11b3fbc\n\nWhile the above scatterplot shows a \"fair value\" 48.4 EV/2022e GP for Katapult, I’m not implying a guaranteed 1000% jump. You could argue that this entire sector is overvalued, and prices need to come down. However, when valuations are high, execution has to be flawless for you to turn a profit. When valuations are low, execution has to be catastrophic for you to turn a loss. KPLT is growing revenue at more than twice the pace of several peers, while trading at 1/5th their valuations. Good execution? Stock goes up. Rerating? Stock goes up. Increased coverage? Stock goes up. Company underperforms? Stock might stay flat. KPLT’s valuation gives us a \"heads I win, tails you lose\" scenario.\n\n**Short Squeeze Potential**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lwkcvkqwx1x71.png?width=1906&amp;format=png&amp;auto=webp&amp;s=5bfe6c5e79c3c8b283c9df1231367234891a3f22\n\n**Fintel short squeeze list has $KPLT at the fourth position. The company has 15.7% of its float short and a borrow fee of 36.7%.**\n\n**Catalysts and Time Frame**\n\nKPLT is having earnings on 11/9 pre-market and can easily beat the estimates because of several partnerships with major players and the Q3 2020 is not abnormal like Q2 2020.\n\n**New Competition**\n\nI don't see Affirm or another competitor taking market share from Katapult(there’s a high chance that this could be acquired by Affirm itself). KPLT has a multi-year head start in this market niche, and it has been able to scale its operations profitably. Affirm set a new precedent through its waterfall partnership with Katapult, and I expect other BNPL companies to take similar steps if they want to enter the nonprime market.\n\n**The Trade**\n\nWe are rarely given the opportunity to buy hyper-growth at low valuations. When Mr. Market offers a gift, be greedy. Katapult's stock price declined quickly after the Q2 earnings, but it appears to have bottomed.\n\nI’m currently holding 75 $5C and $7.5C Dec’17 and Jan’21\n\n**Conclusion**\n\nKatapult is the best risk/return in the market right now. The company has managed to grow its revenue, EBITDA, and net income by \\~100% over the last three years, expects 84% revenue CAGR over the next two years, and it’s trading at 1.3x next year’s sales and 3.8x next year’s gross profit. Concentration, customer, and competition risks are minimal, and Katapult has a massive growth runway as the BNPL market grows. I imagine you will read several pitches for other FinTech companies such as Upstart, SoFi, and Square. Are these great companies? Absolutely. But ask yourself, “What has to happen for these stocks to increase 5x? 10x? What could make them decline 20%? 50%?”\n\nKatapult’s current performance relative to its peers easily justifies a $30 stock price. Now assume Katapult hits its revenue projections. Signs new partnerships with other merchants. Expands agreements with other BNPL players like Affirm. Katapult is a $1B company that could realistically grow to $10B in two years. If it outperforms, $10B might be a conservative valuation. I am incredibly bullish on Katapult, I encourage you to consider this intriguing opportunity.\n\nRelated links:\n\n* [https://ir.katapultholdings.com/news-events/news-releases](https://ir.katapultholdings.com/news-events/news-releases)\n* [https://katapult.com/partnerships/](https://katapult.com/partnerships/)",
        "subreddit": "SPACs",
        "title": "My thoughts on $KPLT and why it can be good opportunity for huge returns with low risk(already at the bottom). Earnings on 11/9 pre-market",
        "url": "https://www.reddit.com/r/SPACs/comments/qkobmu/my_thoughts_on_kplt_and_why_it_can_be_good/",
        "created": 1635830981.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1635951270,
        "id": "qlw7ro",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Here are Parts 5 - 7 of an article addressing the main bear arguments on Paysafe. Parts 1- 4 covered Paysafe’s outlook on growth, debt, and profit as well as available float.  I recommend starting with the [introduction in Part 1](https://www.reddit.com/r/stocks/comments/qkgndd/peeling_back_the_layers_on_paysafe_psfe/) (Growth), and following the links from there if still interested.\n\n# 5. Blackstone Group\n\nMany have blamed PSFE’s price decline on insider selling by pointing to Blackstone Group’s most recent 13F filings indicating a 23% reduction of their position. However, cross-referencing that 13F and the most recent [SEC filing](https://www.sec.gov/Archives/edgar/data/1833835/000156459021050428/psfe-424b3.htm) with Paysafe’s March 31 20F ([p.124](https://www.sec.gov/Archives/edgar/data/1833835/000119312521104105/d159702d20f.htm#toc)) shows that Blackstone holds the exact same number of shares as they did at the time of merger: 123.7 million shares.\n\nIt’s true, private equity lockups expired months ago and the 13F appears to show a sale of 37 million shares between Q1 and Q2.  BUT, to believe that they sold those shares then you’d also have to believe that they BOUGHT 37 million shares (a half billion dollar stake) in Q1, PRIOR to their payout from merger, and then immediately turned around and sold that exact same amount of shares for a SIGNIFICANT loss, just after merger. Seems like quite a stretch. When asked directly about Blackstone’s 13F and whether they’d sold shares, Paysafe’s investor relations responded, \"That swing in the 13F position was an issue with the 13F filing, but I see how that was confusing.  It was not reflective of any actual open market selling of Paysafe stock.\"\n\nMake of it what you will, but there’s no denying that the most recent records show that Blackstone still holds the same number of shares as they did per the original deal structure. The same is true of CVC.\n\nOther factors to consider about Blackstone’s stake:\n\n* Bears commonly claim Paysafe is overvalued because private equity made 3x on this investment. They reach this conclusion by ignoring the difference between market cap and enterprise value and by assuming PE was somehow awarded a full $9 billion from a $3 billion investment.  In truth, as Reuters [reported](https://www.reuters.com/article/paysafe-m-a-foley-trasimene-idUSKBN28H1GP), Paysafe, “was taken private by Blackstone Group Inc and CVC Capital Partners in 2017 for $4.7 billion, inclusive of debt.” At the time of the 2021 merger, Blackstone/CVC received $2.3 billion in cash and $2.8 billion in shares. (280 million shares now worth $2.2b). At current levels, that’s a total of $4.5 billion in cash and shares. So, from their initial $3.9 billion USD (£2.96b) investment, Blackstone and CVC are currently up a mere 15%, between cash and shares. That’s after 4 years of significant strategic investment in restructuring, de-risking, replacing the Board of Directors and bringing in all new leadership (CEO, CFO, CTO, CRO, CIO, CISO etc.).\n* This is part of a long term strategy. When taking Paysafe private, Blackstone/CVC [paid](https://www.finextra.com/newsarticle/30924/blackstonecvc-agree-296-billion-deal-for-paysafe) “a 42% premium over the group's average value over the past year,” because, as Reuter’s [reported](https://www.reuters.com/article/us-paysafe-group-m-a/paysafe-backs-3-9-billion-offer-from-blackstone-cvc-group-idUSKBN1AK0KN), insiders close to the deal said private equity had “a decade-long thesis that the shift to \\[digital payments\\] will only grow and grow and they want to get in now.” This “decade-long” thesis matches Blackstone’s typical investment term of “upwards of 7-10 years” according to their published [white paper](https://pws.blackstone.com/wp-content/uploads/sites/5/2020/09/the_life_cycle_of_private_equity_insights.pdf). 7 to 10 years would be 2024-2027, which lines up with the FTAC board investment thesis, as outlined in their [proxy statement](https://pdf.secdatabase.com/2681/0001193125-21-060961.pdf) when approving the business combination (see #9).\n* More recently, Reuters [reported](https://cn.reuters.com/article/instant-article/idINKBN28H1GP): “Martin Brand, senior managing director at Blackstone, said in an interview that retaining the majority of its investment would allow the buyout firm to benefit from the expected strong performance that Paysafe will generate going forward.” Blackstone Senior Managing Director Eli Nagler said, “We believe Paysafe has a long runway for further growth and look forward to remaining part of the team and seeing their continued success as a public company.”\n* And last month, CEO Philip McHugh [assured](https://bmo.qumucloud.com/view/2021-digitalbanking-paysafe#/): “You won’t see Blackstone and CVC going out there and doing big block sales any time soon. They see our story. They see the pipeline. They see the kind of top of funnel pipeline at the company where we’re gaining traction not only in US iGaming but in crypto, in travel and online gaming.”\n\n&amp;#x200B;\n\n# 6. Insider Ownership\n\nBears have argued that lack of insider ownership is a red flag but on top of the large stake held by board members, Blackstone and CVC, Paysafe’s [share registration](https://www.sec.gov/Archives/edgar/data/1833835/000156459021050428/psfe-424b3.htm) confirms this argument is another non-starter:\n\n* CEO Philip McHugh owns 2.4m shares\n* COO Danny Chazonoff owns 2.2m shares\n* Vice Chairman Joel Leonoff owns 8.3m shares\n* Chairman of the Board Bill Foley owns 42m shares\n* 3 Employee Trusts own 2.3m shares\n\n&amp;#x200B;\n\n# 7. Competition\n\nBears like to claim that a large competitor will eat Paysafe’s lunch, but it’s hard to ignore the fact that Paysafe is the one now encroaching on the North American market. Along with expanding in iGaming, they’re initiating their US launch of digital wallets Skrill and Neteller, with higher limits and [real-time pay-in/pay-out](https://finance.yahoo.com/news/skrill-usa-enhances-digital-wallet-080000953.html), which they say “fills a gap in the U.S. market.”\n\nSome theorize that Paysafe’s competitive threat is the reason it’s being shorted, so as to inhibit the company’s ability to raise capital for further acquisitions, or to prime them for a buyout. But the company has leverage to spare and, when asked directly about a buyout, the CEO was very clear that they are not interested.\n\nSpeculation aside, bears who claim Paysafe will lose to competitors generally ignore how large, established, specialized and diversified Paysafe is in the global marketplace. With its focus on niche verticals, Paysafe is the undisputed leader in iGaming; it owns the second largest digital wallet in the world; it is #4 globally in integrated payment processing; it does over $100 billion in volume; it is used in 120 countries, and it is so good at multi-jurisdictional regulatory monitoring and risk management that other payment processors often use them as a middle man for transactions.\n\nThis last point is a key differentiator for Paysafe. CEO McHugh: “Because it’s complicated, the risk and regulatory management in payments and gaming at a global scale is not something that’s easy to copy.” He further notes, “We can de-risk some transactions where the market has abandoned many of these players…we bring millions of consumers into the ecosystem.”\n\nPaysafe’s regulatory expertise enables them to innovate and enhance their moat with new risk-management solutions in different industries like their recently developed travel safeguarding [model](https://www.paysafe.com/fileadmin/content/pdf/Safeguarding-the-future-of-travel.pdf). It’s also a major reason why most iGaming operators use Paysafe’s [award winning](https://www.yogonet.com/international/noticias/2021/05/31/57794-paysafe-wins-payments-provider-award) platform (which, like any good pick and shovel play, makes them immune to the lack of brand loyalty among sports bettors who tend to migrate between iGaming operators).\n\nOften embedded behind the scenes so that customers don’t know they are using it, Paysafe offers a trusted payment gateway that so effectively mitigates transaction liability that it is commonly used as a hidden partner. They work with [MasterCard](https://www.mastercard.com/news/europe/en-uk/newsroom/press-releases/en-gb/2020/march/paysafe-and-mastercard-extend-strategic-partnership/), Visa, Fiserv, [WorldPay](https://www.infinicept.com/payment-facilitator/archive/game-on-for-worldpay-and-paysafe/)(US DraftKings), [Apple Pay](https://www.paysafe.com/us-en/apple-pay/), [Google Pay](https://www.paysafe.com/us-en/google-pay/), [PayPal](https://developer.paysafe.com/en/rest-apis/paysafe-payments-api/payments-api/payment-methods/paypal/), [Sightline](https://developer.paysafe.com/en/rest-apis/paysafe-payments-api/payments-api/payment-methods/sightline/), REPAY, Intellipay, and a host of others. Paysafe is also behind the roll-out of the [award](https://www.paysafe.com/de-en/paysafegroup/news/detail/paysafe-wins-two-payments-awards/) winning [Coinbase/Visa](https://www.thepower50.com/paysafe-issues-coinbases-new-visa-debit-card-enabling-easier-cryptocurrency-spending/) card.  In most cases it would take years of significant investment for others to match Paysafe’s level of monitoring, risk management and underwriting.  It’s often easier for a \"competitor\" to just give them a cut of the take.  CEO McHugh notes, “That’s where we get broader and deeper take rates over time. We process with Worldpay and have a capability with Fiserv as well, so we do multi-processor there.”  And Danny Chazonoff, COO, adds, “In Europe, we are the acquirer of record, so we have a principal membership with Visa and MasterCard. What that brings for us is the ability to do our own underwriting without any intervention at all from an acquiring bank.”\n\nRather than competing directly with other payment processors, Paysafe's angle is to quietly work with everyone.  This is partly why Bill Foley describes Paysafe as “ubiquitous. It’s just everywhere.”\n\nHaving cited a potential $58 trillion total addressable market, rather than competing in the general retail space, they focus on drilling down in “hard to do, hard to copy” niche verticals. CEO McHugh: “That’s why we like the deep verticals as opposed to trying to go head to head in the more general retail space which is more susceptible to scale economics.”\n\nThrough its emerging Unity Platform, Paysafe is also differentiating itself with a single cloud-based payment gateway that synthesizes a large [suite](https://www.sec.gov/Archives/edgar/data/1833835/000119312521055290/d18419df4a.htm) of interconnected products and payment rails:\n\n* credit and debit card processing\n* integrated eCommerce processing\n* online banking with real-time bank payments\n* ACH check transactions\n* digital wallets with real-time pay-in/pay-out functionality\n* person to person payments in 40 currencies\n* eCash solutions to digitize cash reaching a massive underbanked consumer base\n* 38 cryptocurrencies in over 90 markets\n* trading crypto and stocks in the wallet\n* international money transfers\n* branded gift card management\n* recurring billing\n* data mining for targeted direct marketing\n* travel safeguarding for most major airlines\n* tokenization and encryption (NFTs)\n* in-store brick-and-mortar frictionless checkout (with competitive scalable pricing for a wider range of business sizes)\n\nAs the CEO points out, “Merchants just want sales regardless of payment method…There are very few competitors that can compete with us across all of the products…we continue to see the combination of our eCommerce gateway, digital wallets, online banking, and eCash solutions as a true differentiator in the market…The company that can synthesize that onto one platform will do very well.\"\n\n# Reviews:\n\nWhile on the topic of competition, Bears who apparently aren’t aware of Paysafe’s award winning consumer products like [Paysafecard](https://www.marketscreener.com/quote/stock/PAYSAFE-LIMITED-120977165/news/Paysafe-Paysafecard-wins-Hermes-Business-Award-2021-36750942/) and [Skrill](https://www.paymentexpert.com/2019/11/01/skrill-wins-best-digital-wallet-at-juniper-research-2019-awards/), often point to an odd Trustpilot 1.9/5 star rating of nondescript “Paysafe” with only 287 reviews.\n\nMeanwhile, they ignore Trustpilot ratings of Paysafe’s actual consumer-facing products like:\n\n* Paysafecard: “Excellent” (4.7/5 stars) [43K reviews](https://www.trustpilot.com/review/www.paysafecard.com)\n* Skrill: “great” (4/5 stars) [19K reviews](https://www.trustpilot.com/review/skrill.com)\n* Skrill Money Transfer: “Excellent” (4.7/5 stars) [9K reviews](https://www.trustpilot.com/review/transfers.skrill.com)\n\nBy contrast, Trustpilot rates competitors:\n\n* PayPal: “bad\" (1.2/5 stars) [20K reviews](https://www.trustpilot.com/review/www.paypal.com)\n* Stripe: “Average” (3.3/5 stars) [6.6K reviews](https://www.trustpilot.com/review/stripe.com)\n* Cash App: “bad” (1.2/5 stars) [3K reviews](https://www.trustpilot.com/review/cash.app)\n* Zelle: “bad” (1.1/5 stars) [398 reviews](https://www.trustpilot.com/review/zellepay.com)\n* Venmo: “bad” (1.3/5 stars) [281 reviews](https://www.trustpilot.com/review/venmo.com)\n\nNote: This is not to bash competitors, but to point out how the bear argument is essentially meaningless. To be fair, those competing platforms get much better Apple mobile app reviews but, even there, Paysafe’s digital wallet Skrill gets a respectable, [4.4 out of 5 stars](https://apps.apple.com/us/app/skrill-pay-transfer-money/id718248239) with 7.2K ratings. And at GooglePlay, their Paysafecard get 4.3/5 stars with over [103K reviews](https://play.google.com/store/apps/details?id=at.paysafecard.android&amp;referrer=adjust_reftag%3DcIGmAvoU2TFcK%26utm_source%3DWebsite%2B-%2BApp%2BSeite).\n\n&amp;#x200B;\n\nFor a link to the next part go to [Part 1](https://www.reddit.com/r/stocks/comments/qkgndd/peeling_back_the_layers_on_paysafe_psfe/).  If you’d prefer a single post of the entire article, let me know and I’ll post it once it’s done.",
        "subreddit": "stocks",
        "title": "Peeling Back the Layers on Paysafe (PSFE) Parts 5-7",
        "url": "https://www.reddit.com/r/stocks/comments/qlw7ro/peeling_back_the_layers_on_paysafe_psfe_parts_57/",
        "created": 1635980070.0
    },
    {
        "author": "vm5662",
        "created_utc": 1635802181,
        "id": "qkobmu",
        "num_comments": 118,
        "num_crossposts": 6,
        "selftext": "**Be Fearful When Others Are Greedy and Greedy When Others Are Fearful” - Warren Buffet**\n\n**Why people are Fearful:**\n\n* One of the main concerns people worry about this stock in their last Q2 earnings is that their LTO origination was down 17% YOY. But I think this chart can explain this massive Year over year LTO origination decline. as they had exceptionally great Q2 last year due to COVID stimulus, which is a one time surge only and made their LTO origination in Q2 2021 looks really bad. but when compared to Q1 2021, it is still up 1%. so it is actually not that bad.\n* Because of the Q2 earnings and guidance removal the stock tanked hard and is now trading at $4-5, creating an opportunity for us to make some tendies.\n* Because the stock tanked hard there were several lawsuits against the management for this behaviour but from the legal perspective they are in their legal boundaries (personally I feel the management should have been more careful).\n* Katapult’s focus on the nonprime consumer niche seems risky at first. Afterall, you would think that customers with worse credit scores would yield higher default risks. However, Katapult’s bad debt expense, or expense for uncollectable accounts receivable, is down from 7.9% last year to 6.1% this year. That is in line with Affirm’s bad debt expense, and Affirm handles prime customers. Katapult’s bad debt expense is growing at less than half the rate of its revenue, showing investors that risks pertaining to bad debt actually minimize as the company grows.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6fzkxpkox1x71.png?width=1354&amp;format=png&amp;auto=webp&amp;s=a61e9a7f5a6c4b907cf80eb103a30d5559c43608\n\n**Why you should be greedy:**\n\n* A study from Juniper Research suggests that BNPL transactions will grow from $226B in 2021 to $995B by 2026. 55% of Americans used a BNPL option as of March 2021 vs. just 37% in July 2020. The Federal Reserve Bank of New York also reports that **38% of US consumers are considered nonprime,** making it difficult for these consumers to access financing options. **Additionally, 67% of consumers with a FICO score below 700 need a BNPL option for large purchases**. Katapult provides this solution for online customers. Katapult's platform integrates seamlessly to merchant sites, so customers can choose the financing option as they check out. As the sole provider of BNPL financing for nonprime customers, Katapult has a massive untapped market.\n* Katapult is forecasting over $1B in revenue by 2023, and the company could beat this number if it keeps aggressively expanding to include new merchants.\n* Recent great direct partnership with Salesforce and Adobe and indirect waterfall partnership from Affirm with (Amazon, Target, Walmart). The amazon - affirm deal actually sent $KPLT all the way up to $7\\~$8 in September.\n* When u look at the number of buys from insider and institutional holders when this one crash in august due to removal of their guidance, this shows smart money actually think the stock price around $3\\~5 is a steal. (The highest buy from insider is $4.42, which means CEO actually didnt expect market can be way overreacting that the price can drop to \\~$3)\n* Katapult has an agreement with Affirm where consumers not approved by Affirm are then routed to Katapult. Affirm receives a referral fee for each successful consumer application. As you can see from the graph above, Katapult approves \\~60% of consumers who failed prime lender applications. These \"waterfall\" applicants generate $117M incremental originations per 1M applications. To date, 50 out of Katapult’s 150 merchants have come through this Affirm partnership. These 50 merchants represent less than 1% of Affirm’s 6500+ merchants and only 6% of the 900 Affirm merchants Katapult believes are a good fit, offering an opportunity for future growth.\n\n&amp;#x200B;\n\n[Insider purchase](https://preview.redd.it/mbfmqwlpx1x71.png?width=2359&amp;format=png&amp;auto=webp&amp;s=d9651b69dd723605151440e9821aca97f60e3b44)\n\n**Investment Thesis**\n\nKatapult Holdings is a leading buy now, pay later (\"BNPL\") company that provides Ecommerce financing solutions for nonprime consumers. KPLT has generated explosive revenue growth while remaining profitable, a rare feat for a young growth stock. While its financial performance has been fantastic, KPLT’s valuation is the key to this investment. Katapult has higher sales growth and stronger profit margins than its peers. Meanwhile, its stock is trading at \\~1/40th the multiples of these competitors (discount varies based on sales, gross profit, or EBITDA multiples). You will not find another company executing at this caliber priced this cheap. Value stocks can perform well. Growth stocks can perform well. When an impressive growth stock is trading like an undervalued stock, you have the opportunity to generate incredible returns. Katapult is a $30 stock, you don’t want to miss this one.\n\n**What Is Katapult?**\n\nKatapult provides BNPL solutions for nonprime Ecommerce customers. Katapult is the only nonprime financing platform dedicated to Ecommerce, as shown below:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/n3uufepqx1x71.png?width=640&amp;format=png&amp;auto=webp&amp;s=d1e60005054acf799b53aee674e6e7f148943baf\n\nInvestor Presentation\n\nKatapult offers three payment options for consumers:\n\n* Full Term: A $45 origination fee followed by either 12-24 months of lease payments, at the end of which the consumer owns the good.\n* 90 Day Discount: An early purchase option at 90 days, which enables the consumer to buy the good at a discount to the original price.\n* Extended Discount: A discounted purchase option after 90 days, but before the end of the lease period.\n\nThe average order value for goods leased through Katapult is \\~$600 with an average lease multiple of \\~2.0x cash price. The company’s solution is well-liked by consumers. Its Net Promoter Score of 58 is strong for a financial service, and Katapult has a 4.4 rating on Trust Pilot.\n\n**Business Model**\n\nKatapult partners with Ecommerce merchants like Shopify, Wayfair, Lenovo, and Purple who then integrate Katapult into their websites as a purchase option. Consumers provide their information to Katapult, who in turn makes an immediate credit approval decision. Katapult's risk model reviews over 100 attributes, including lease history and prior payment behavior, to approve or deny applicants in under five seconds. The company has a sub-3% fraud rate across its portfolio, and it recovers 80-90% of lease costs of charge-offs. The financer’s platform is sticky, as 48% of purchases have been done by repeat customers. Katapult also generates revenue through a \"waterfall\" program with Affirm.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gzebfgyrx1x71.png?width=640&amp;format=png&amp;auto=webp&amp;s=5e7bbd61edc80e801e4ef6261124432914c7d641\n\nKatapult has an agreement with Affirm where consumers not approved by Affirm are then routed to Katapult. Affirm receives a referral fee for each successful consumer application. As you can see from the graph above, Katapult approves \\~60% of consumers who failed prime lender applications. These \"waterfall\" applicants generate $117M incremental originations per 1M applications. To date, 50 out of Katapult’s 150 merchants have come through this Affirm partnership. These 50 merchants represent less than 1% of Affirm’s 6500+ merchants and only 6% of the 900 Affirm merchants Katapult believes are a good fit, offering an opportunity for future growth.\n\n**Solution Offered**\n\nNonprime consumers without credit scores currently struggle to get affordable financing options. Payday loans and credit cards offer predatory rates, but many of these consumers can’t afford to pay cash for furniture and other expensive items. Katapult gives these customers access to high-quality Ecommerce merchants with affordable payment structures. By integrating its platform to these Ecommerce sites, Katapult has built both a cheap and efficient solution for nonprime shoppers.\n\nOn the flipside, Ecommerce companies gain access to consumers they otherwise would not be able to sell to without bearing any credit risk. Katapult is fast, and that increases conversion rates. Merchants that integrate Katapult as a payment option also see higher repeat rates. Customers get access to new merchants and affordable financing; merchants gain millions of potential new customers with no added risk. A win-win scenario.\n\n**Valuation**\n\nKPLT is at a conservative $1B valuation with $450M in 2021 revenue. Check out the slide below from Katapult’s initial investor deck.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/evq0ng1tx1x71.png?width=640&amp;format=png&amp;auto=webp&amp;s=c8e39ab5dce8ca2e895469936b5a001175cae7bd\n\n*Source: Investor Presentation*\n\nThe above slide compares different players in the BNPL sector. In a vacuum, 14x EBITDA for a company growing sales, net income, and EBITDA at 100%+ for the last three years is great value. When you compare this to other companies in the sector, Katapult looks criminally undervalued. But what if this entire sector is expensive, and KPLT’s price is reasonable in the broader FinTech market? I compiled the below data set to see Katapult against 15 other FinTech companies. The results are interesting:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cfkjo8wtx1x71.png?width=1386&amp;format=png&amp;auto=webp&amp;s=279e067ab736ae4185905d749375d1249f08d135\n\nNote that I highlighted other recent DeSPACs (PSFE, SOFI) and IPOs (AFRM, UPST, GLBE) to point out how they are priced vs. KPLT. Katapult is not just cheap for a BNPL financer. The stock is heavily discounted in the larger FinTech market as well. I built a scatterplot to illustrate these companies' \"expected\" EV/2022e Gross Profit.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h4n8zvrux1x71.png?width=1376&amp;format=png&amp;auto=webp&amp;s=7f492e668f24237ea951fb35099a7b7ea2b443e5\n\nKPLT is already profitable, expanding its margins, and growing revenue at a blistering 84% over the next two years. How does the market value it? 3.83x 2022e gross profits. Meanwhile, a regression line of the FinTech market suggests that KPLT *should* trade at 48.4x 2022e gross profits.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4b667psvx1x71.png?width=472&amp;format=png&amp;auto=webp&amp;s=359fd931a68e5598031a4547a93d24a0a11b3fbc\n\nWhile the above scatterplot shows a \"fair value\" 48.4 EV/2022e GP for Katapult, I’m not implying a guaranteed 1000% jump. You could argue that this entire sector is overvalued, and prices need to come down. However, when valuations are high, execution has to be flawless for you to turn a profit. When valuations are low, execution has to be catastrophic for you to turn a loss. KPLT is growing revenue at more than twice the pace of several peers, while trading at 1/5th their valuations. Good execution? Stock goes up. Rerating? Stock goes up. Increased coverage? Stock goes up. Company underperforms? Stock might stay flat. KPLT’s valuation gives us a \"heads I win, tails you lose\" scenario.\n\n**Short Squeeze Potential**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lwkcvkqwx1x71.png?width=1906&amp;format=png&amp;auto=webp&amp;s=5bfe6c5e79c3c8b283c9df1231367234891a3f22\n\n**Fintel short squeeze list has $KPLT at the fourth position. The company has 15.7% of its float short and a borrow fee of 36.7%.**\n\n**Catalysts and Time Frame**\n\nKPLT is having earnings on 11/9 pre-market and can easily beat the estimates because of several partnerships with major players and the Q3 2020 is not abnormal like Q2 2020.\n\n**New Competition**\n\nI don't see Affirm or another competitor taking market share from Katapult(there’s a high chance that this could be acquired by Affirm itself). KPLT has a multi-year head start in this market niche, and it has been able to scale its operations profitably. Affirm set a new precedent through its waterfall partnership with Katapult, and I expect other BNPL companies to take similar steps if they want to enter the nonprime market.\n\n**The Trade**\n\nWe are rarely given the opportunity to buy hyper-growth at low valuations. When Mr. Market offers a gift, be greedy. Katapult's stock price declined quickly after the Q2 earnings, but it appears to have bottomed.\n\nI’m currently holding 75 $5C and $7.5C Dec’17 and Jan’21\n\n**Conclusion**\n\nKatapult is the best risk/return in the market right now. The company has managed to grow its revenue, EBITDA, and net income by \\~100% over the last three years, expects 84% revenue CAGR over the next two years, and it’s trading at 1.3x next year’s sales and 3.8x next year’s gross profit. Concentration, customer, and competition risks are minimal, and Katapult has a massive growth runway as the BNPL market grows. I imagine you will read several pitches for other FinTech companies such as Upstart, SoFi, and Square. Are these great companies? Absolutely. But ask yourself, “What has to happen for these stocks to increase 5x? 10x? What could make them decline 20%? 50%?”\n\nKatapult’s current performance relative to its peers easily justifies a $30 stock price. Now assume Katapult hits its revenue projections. Signs new partnerships with other merchants. Expands agreements with other BNPL players like Affirm. Katapult is a $1B company that could realistically grow to $10B in two years. If it outperforms, $10B might be a conservative valuation. I am incredibly bullish on Katapult, I encourage you to consider this intriguing opportunity.\n\nRelated links:\n\n* [https://ir.katapultholdings.com/news-events/news-releases](https://ir.katapultholdings.com/news-events/news-releases)\n* [https://katapult.com/partnerships/](https://katapult.com/partnerships/)",
        "subreddit": "SPACs",
        "title": "My thoughts on $KPLT and why it can be good opportunity for huge returns with low risk(already at the bottom). Earnings on 11/9 pre-market",
        "url": "https://www.reddit.com/r/SPACs/comments/qkobmu/my_thoughts_on_kplt_and_why_it_can_be_good/",
        "created": 1635830981.0
    }
]