[
    {
        "author": "NrdRage",
        "created_utc": 1619291294,
        "id": "mxqn2b",
        "num_comments": 275,
        "num_crossposts": 0,
        "selftext": "Hola!   NrdRage here.  My apologies  for not posting this yesterday, but  Reddit, with their extreme ethics  (?) put me in a corner for 3 days for  upvoting a couple of comments my  daughter made about motorcycle  safety.  Good to see their priorities are  in order, An upvote from the  same NAT, that's way more important than  employment background checks  on pedophile enablers, right Reddit?\n\nGiven   that last week's DD was my first complete WHIFF (seriously,   embarrassingly bad, but we'll get into that), I'm going to work hard to   find a layup for everybody next week.  Think I've found one, but with   that tax bomb President Harris tossed out yesterday, I don't want to   name a new ticker, even if I think it's all smoke (because the mere act   of sabre rattling can shake a market, and there's sure to be plenty  more  of that in the coming weeks as the administration attempts to  normalize  the plan to create the actual highest cap gains tax rate in  the world).   So instead, let's go back through the DD's (the ones I  haven't deleted  because they were no longer effective, at any rate) and  update them and  where I am with them.  This should hopefully, for at  least a day, stop  people from grabbing a DD from 2 months ago and  jumping in then  wondering why the trade is different.  Oh, who am I  kidding, I know you  fucks, nothing will stop that.  At the very least,  it should shut up the  small group of people who played the trades wrong  and declared them  broken.  Let's start from February, so right after  the first round of  people who \"liked the stock\"\n\n# DD #1:  $PLTR.  Original Date January 27th, 2021\n\n&amp;#x200B;\n\n[I tried to tell you retards](https://preview.redd.it/pqrvl3j266v61.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=5b59d3513e9581b0babd63301fc9dd1cb8482387)\n\n**URL:**    Ended up deleting it - not because the DD was wrong, but because the   Palantards got it to about -700 karma and I decided to let them get   crushed.\n\n**Original thesis:**    $PLTR (then $35) was wildly overpriced based not only on their market   cap as a company who's almost every dollar is already priced in as a   result of their reliance upon government contracts, which span years,   their reliance upon the courts to force those contracts to be extended,   but also because the company insiders were selling stock like mad,   George Soros had signaled he was going to sell the 4% of the float he   controlled for \"ethical reasons\" (hah!).  Oh, and because Peter Thiel   participates in the wrong type of political ideology amongst the tech   elite, that he was so unfavored that there would be active attempts to   harm his ventures.\n\n**Original price target:**    I stated the company was worth no more than $22 and that people  should  open $25 puts expiring in late March.  In later comment updates,  I  stated that one should buy puts any time the company strongly  eclipsed  25, and should buy calls any time the company sinks to around  22, as  that's its rangebound territory.\n\n**How did it work/what has changed:**   Not a single thing.  It was literally impossible to screw this trade  up  unless you went against it.  So, of course, most of this sub did  just  that and lost money.\n\n**What the smart play is on it today:**   I no longer buy puts in $PLTR, but any time I see it creep to 22, I  buy  a biweekly $22 call.  Easy money that I will then put on the end of  a  fishing pole and hold over the head of a Palantard.\n\n**Trade rating:**  10/10.  15 bagger (and counting), plus you got to point and laugh at half of this sub.\n\n# DD #2:  Weed Stonks.  Original date February 3rd, 2021 (a non-Friday DD)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/rsk2tbc566v61.jpg?width=300&amp;format=pjpg&amp;auto=webp&amp;s=bf756ce0a9fad711fd9fce0af241b7768ec065c3\n\nURL:  [Right here](https://www.reddit.com/r/wallstreetbets/comments/lh6ttf/pass_the_bong_and_gather_round_bros_were_gonna/)\n\n**Original thesis:**     You're the bad kind of retarded if you were throwing money into  SNDL.   If you wanted a \"cheap\" stock, you should go with one that  doesn't put  fucking rubber and plastic in their weed - so to buy a  stock like  Organigram instead if you could remember their stupid  fucking name.   $APHA and $TLRY should be joined at the hip and either  APHA must come up  or TLRY must come down.  Talked about $CGC and $ACB,  though didn't  endorse them.  Matter of fact, I didn't really endorse  any of them.   This DD was more about \"well, I can't tell you not to do  this stupid  thing, but if you're going to do it, at least make less bad  choices  amongst the stupid ones\".  Way to make me feel like a pearl  clutching  Boomer parent, assholes.\n\n**Original Price Target:**    I didn't give any, because it was all obviously a bubble and I was   mostly advising people to be careful with the play, but to pick better   companies if you were going to jump in on it.\n\n**How did it work out/what has changed:**    If you read between the lines and TRADED (read:  Scalped like Crazy   Horse) these stocks instead of invested in them, you probably fared   pretty well.  All the weed stocks peaked a week later and then started   their decline (except for $APHA, which continued to rise for a while   before collapsing as it tried to find equilibrium w/ $TLRY).  My own   results were originally mixed on this.  I made a lot of money scalping   Sundial before getting out of the way at the top and laughed as it   collapsed to the surprise of a million braindead stoners.  I made some   pretty decent money on TLRY, made quite a lot on APHA (and then gave it   all back and then some on a stupid play for the merger that expires on   the 30th, a nice 7 figure waste of money), and made some money on   Organigram, but I kept the 1/22 $5c's and am reasonably certain they're a   complete loss, but just like bagging Olivia Munn, there's always a   chance.\n\n**What the smart play is on it today:**    Don't touch any of them.  The reality is, long term, these Canadian   companies are going to have a hard time penetrating the US market, even   if the product is federally legalized.  But, more importantly, the one   thing every weed company has in common with one another is that they  are  absolutely TERRIBLE at execution.  This is why you don't make  stoners  CEO's of publicly traded companies just because they're  passionate about  the product.  They've got the easiest product out  there to sell, and no  matter how low you set the bar, they somehow find  a way to trip over  it.\n\n**What you should play instead if you want to get in this space:**     $MO.  Yeah, you heard me, $MO.  Think about this a moment:  These   guys sell tobacco.  A product that they are forbidden from marketing or   even talking about, which gets hidden away behind cages in stores,  which  has been completely wiped from movies that might product place or  even  being MENTIONED in public because of regulations.  A product  which in  some places it's illegal to use in your own home or alone in  your  vehicle as you take a 10 minute break from your soul-sucking job  and  question every choice you've made in life, just hoping to get 5  minutes  of sweet relief before you have to head back behind the Wendy's  to  finish your shift....and they STILL sell billions of dollars a  year.   Say what you will about their product, but these fuckers **know how to execute.**    And they're already in America.  You don't think that they won't be  at  the front of the pack when that shit gets legalized?  You don't  think  they won't give up the brown leaf for the green leaf?  You don't  think  they won't start buying up every Ganja Goddess or Chronic ReLEAF  store  they can find once they're allowed to?  Fuck outta here.\n\n**Trade rating:**    8/10:  You made money if you followed it and got out a week later,  you  made even more if you caught how lukewarm I was on the entire  sector  and picked something else, and you saved a lot if you got out of  Sundial  like I said, but the weed play really died out a very short  time later,  so the upside was very limited.\n\n# DD #3:  $BB.  Original Date February 12th, 2021\n\n&amp;#x200B;\n\nURL:  [Right here, bitch-o](https://www.reddit.com/r/wallstreetbets/comments/liezfr/nrdrages_friday_dd_theres_still_one_meme_stock/)\n\n**Original Thesis:**    Using another company that pivoted from enterprise applications to   automotive ($NUAN) and has no competition, extrapolated long term   earnings potential of a company pivoting from phones to secure   automotive and fleet management.\n\n**Original Price Target:**    87.50.....in 2023.  My positions were very early, so my average PPS  is  7.67 and my calls are 5's, so not really playing the same game.  I  have  since added, over time, a load of 1/23 42c's at an average cost of  like  80 cents.\n\n**How did it work out:**    Thesis still holds, though it would sure be nice if the green number   reflected a mammoth spike in equity price.  The only reason this  company  isn't sitting at 20 right now and well on its way to smart  vehicle  dominance is because of the damned chip shortage.\n\n**What the smart play is on it today:**    It's still buy and tuck away in a hole somewhere like a Boomer.  Grab   the farthest out, farthest OTM calls you can find (they should be no   more than 50 or 60 cents).   You'll still be a massive disappointment to   your parents, but maybe you'll be able to trick them that you're   starting to grow up enough to where they'll let you move out of your   refrigerator box and housesit for them when they go on a cruise.  Hey,   speaking of....\n\n**Trade rating:**    5/10:  I expect this one to age like wine and ultimately be a huge   profit maker, but the chip shortage was a resistance point I failed to   consider so it hasn't seen the immediate burst.\n\n# DD #4:  Cruise lines.  Original Date February 19th, 2021📷\n\n&amp;#x200B;\n\n[Not mine.  But I wants it.](https://preview.redd.it/onkncs8c66v61.jpg?width=275&amp;format=pjpg&amp;auto=webp&amp;s=b139c61852f25bfc1b0a4d831afc7aa42eebf86d)\n\n**URL:**  [For you poor bastards who missed this boat](https://www.reddit.com/r/wallstreetbets/comments/lnpqrp/nrdrages_friday_dd_the_bermuda_triangle_and_you/)\n\n**Original Thesis:**   The cruise liners were one of the last Wuhan-fucked plays   out       there     who hadn't taken a true turn at the recovery wheel   just   yet.      Which   made   them smooth sailing for easy tendies\n\n**Original Price Target January 2022:**  $NCLH 46, $CCL/$CUK 47/42 respectively, $RCL $90.  My     positions      were    established a month and a half before the DD, so     my cost   basis    was    different.  I was holding 700 1/22 25c's in   $CCL and   2000 1/23    $42.5c's    in $NCLH.\n\n**How did it work out:**    If you jumped in shortly thereafter and played the stocks      right,     you    made enough to buy your own boat.  Sure, maybe it  was  a    17'     Bayliner    that all the women at the marina called    \"adorable\"   and  were    clearly    conflating towards what they    assumed was your    pathetic 2.5\"    penis size    at diamond hardness,    but it floated, it    had an engine,   and  dammit, it    was yours  and   you had enough left    over for a   captain's  hat and a bunch     of   beer money.  This one  was   hard to screw   up -  especially since  it    was   the first one I   started  providing   updates on  and made  sure    everybody   knew to take   profits  at 32 on   NCLH and buy   back at  29  (and  to continue     playing that  range), etc.    People  in  these   from the date  of posting   who   didn't  just buy and    hold likely    have turned at least a 6    bagger by now.     This trade  was,   and to   some  extent is, still solid    gold.\n\n**What's happened since then:**              In spite of none of the companies in question needing to    issue        shares   as they had enough cash on hand, $RCL issued    shortly  after    that    DD,  $CCL  immediately copied them, and $NCLH    followed  suit a    couple   of  weeks   after $CCL.  At least none of    them tried  to pull  an   $AMC  and   have the   CEO go on TV and  give   zero credit  to retail    investors  for   saving the   company  and   instead taking  all the  credit   before  diluting   and then    paying   himself a fat ass  bonus  for doing   nothing  but issuing    shares like     some sort of  conquering  hero.  The   amount of  the  dilution   in   question   meant  that the  resistance  price  of (to  use  as example,     $NCLH) of $32 a    share  already  represented a   higher  price than   the   pre-virus share   price.    Ditto  for the  other  2.   Investors   haven't seem   to have  noticed,    however,   and these  stocks  still   trade in the  general   range,  though the     resistance  level is now    more like 31/25/85.    Also,  the  sailing    schedules  for  the   domestic  cruise ships has  been  pushed   back  as a   result of     somebody high up at  the CDC  obviously  shorting    these  stocks,  as    that's  the only  explanation  for why they're   so   focused  on trying   to   send these  companies to 0   by  preventing   sailings.    Norwegian  is  resuming  cruises  outside  the  US in the next   couple  of   months.\n\n**What the smart play is today:**              These 3 companies are no longer as attractive as a result  of     the        dilution, but they're still good swing traders within   their       respective     channels.  I'd put up a picture of some   charts to  show      those, but I     already told you where the   resistance is,  grow a      wrinkle and learn  where    support is.\n\nI          have since   exited  my positions in $CCL (and was never in    $RCL),     and   have   drastically  reduced my holdings in $NCLH, but I    do  still     maintain a    skeleton crew  of January calls for them.\n\n**Trade rating:**              9/10.  It was really hard to fuck this one up, unless you    just        didn't   believe me. And it's still a live trade.  The only    thing  I       could have   done better was post it sooner, but I  make   sure my    trades     are   established and going the right way  before I   talk  about   them in     depth.\n\n# DD #5:  The Semiconductors:  Original Date February 26th, 2021\n\n&amp;#x200B;\n\n[And before you ask, yes it is.  Took this the other day when I   decided    to    start working on this. In retrospect, should have   washed first.](https://preview.redd.it/y6vlid9g66v61.jpg?width=1530&amp;format=pjpg&amp;auto=webp&amp;s=6bfae5eeadc261cda360675c53f44c33d6ca1582)\n\n**URL:** [For you poor, broke ass souls who missed it](https://www.reddit.com/r/wallstreetbets/comments/lt89s3/nrdrages_friday_dd_the_semis_play_not_just_the/)\n\n**Original Thesis:**          While everybody was spooging over high end chipmakers like  Theta        Semiconductor, $AMD, and $NVDA (and, to be fair, I had been   telling       people to buy $NVDA 545/580c's, which were all   multibaggers), the   real     action was in the commodity level   chipmaker space,  specifically    American   companies (or companies   that could masquerade  as them) who    would line   up to the trough to   get some free  government money to go    from being   nofab to fab   companies.\n\n**Original Price Target:**          $NXPI 200-210 within 3 months; $ON to within 43 within 3  months,       $MRVL  to 75 within that same range.  And I didn't give a  price   target     for  $UTZ, just that it would go up.\n\n**How did it work out:**          LAMBOS for almost everyone!  Supposing you could order one,   given      that  they can't get the chips they need to build the cars.       $NXPI   got   to  214 before pulling back to 202.  $ON hit 43 2  weeks   before I     predicted  it would.  $MRVL failed to live up to    expectations and has     been  essentially dead money since that    posting, but if you'll  recall I    was  very explicit that I was    bullish on them ONLY as a 5G  play,   whereas  the  others I felt had    more range and scope.  So  short-term   $MRVL play  was a  loser if you    moved up the timeline I  liked.  Oh, and   $UTZ printed  for   everybody   that just bought in  because they liked the   product.  It   was a   nice  little pocket play.\n\n**What's happened since then:**          The trade ran its course to perfection.  As I've been saying  for  a       little while now, semis, with the exception of $NVDA, are  not     presently    an interesting trade because there's been a  rotation out  of    them  after   this period of growth.  I am still  incredibly  bullish  on   the  sector as a   whole, but they need a  breather and  some time  out  of  the  sun before   continuing a leg up.   They're not  even good   rangebound   trades right now.    And LOL @  any of you  clowns who bought   $TSM  anyways  because Cramer  and his  cult of  Shortbus All-Stars   told  you  they were  the best in breed.   Suckers.    In the case of  $MRVL,  they  acquired  another company and  now are  going  to  \"officially\"  become a US  company  instead of that  tax  dodging shit   they've been  pulling, which  means the  thesis  about  them lining up for   gubmint  money is sound and  will happen   down the  road.\n\n**What the smart play is today:**         Ignore semis till at least June; probably July.  I have exited   out    of   all of my positions and have taken immense profits from the      commodity   semis.  I similarly got rid of my $NVDA calls at the  top,     though I am   willing to find a re-entry point in the 575 range  if  it    happens.  Don't   be sad that the trade is over, be glad that  it     happened and you might   have been there.  Or at least be happy  that I     was there and am   appreciative that I got to stack a bunch  more  paper    I'll never spend.    Either way.\n\n**Trade rating:**  9/10.  Absolutely perfect call, with only $MRVL being the laggard, but it came with the appropriate warning.\n\n# DD #6:  $CLNE.  Original Date March 5th, 2021\n\n&amp;#x200B;\n\nhttps://preview.redd.it/v4er1pwi66v61.png?width=640&amp;format=png&amp;auto=webp&amp;s=9a69c73b90b3d059645e2d9f3f61af090f7c8921\n\n**URL:** [Got buried in a mountain of Gibbons doing dumbass \"DD\" on their stonk](https://www.reddit.com/r/wallstreetbets/comments/lye7st/nrdrages_friday_dd_ok_one_of_you_apes_needs_to/)\n\n**Original Thesis:**         People are finally willing to take greenhouse gas emission   capture      seriously, and the infrastructure and transport sector is   finally   ready    to start moving away from diesel and traditional oil   based   products  in   favor of carbon negative renewable natural gas -     especially  companies   making carbon pledges or located in states   where   progressive  leadership   is going to demand emission reduction.     $CLNE  was uniquely  positioned  as  the nation's leading provider  of   that  fuel source and,  unlike all  the  other green energy   EV/charging   companies out there,  actually has a  real  product that   they sell in   large quantities, making  it a diamond in  the  otherwise   pipe dream   green energy space.\n\n**Original Price Target:**  $17 by late May, $31 by next March\n\n**How did it work out:**         I said to buy it as soon as it got under 11.  It got under 11  the      very  next trading day.  Then immediately shot up almost 50%  within   10    days  and was one of the few stocks out there  consistently   finishing    green  while the entire market was tanking.   As long as you   played it    smart and  heeded warnings about stonks  not always just   going up and    taking profit  after parabolic rises  and looking for   re-entries later,    then you made  enough money to  put RNG high powered   engines in both  your   boat from  cruise stocks  and your Lambo from   semis and convert  your   entire house to  being  powered by cow farts   before the green  energy   sector got   skullfucked.  If you held, you'll   feel this trade  didn't   work out   (though it still will, if you   picked the June target  date like   I  said)  and, if you re-entered   after taking profits, you've  either    been  averaging down lately as   this has been getting unfairly  dragged    down  with the entire green   energy sector or else you're   underwater on    it....but you'll still be   fine.\n\n**What's happened since then:**         A LOT.  From them getting dragged down from the mid 15's all the     way    to below 10 on nothing but good news to them signing major      partnerships   with $BP, Total and Citgo, to signing a half a billion      dollar deal  with  $AMZN to power their long-haul fleet with RNG to      Washington DC  flat-out  stating that methane capture is a capstone  of     their green  energy plan,  there has been nothing but good news  coming     out of this  company.  And  yet It got absolutely PUMMELED  with the     sector for the  last month, and  then this past week  started Monday     morning up 27% only  to not only give  all of those  gains back but  lose    another 20% by the  close of trading  Tuesday  because of a  combination    of market  manipulation by a hedge fund   that shorted the  stock into    oblivion for a  hit and run (do a search  on my profile by  posts and  look   up my Wednesday discussion if you  want to be  absolutely fucking    infuriated that someone borderline  committed a  crime) coupled with them    paying off an analyst at RayJay  to run a hit  piece on the $AMZN deal  to   try and sink  the stock  price even lower,  right down to that hedge   fund  suppressing  the  price of the stock  for 2 weeks to keep it under   $12 so  the most   popular options for  April would expire worthless.    This  company has,  in  short, been  subjected to a biblical level of   fuckery  that was  probably  was some  Mortimer Brothers bullshit for a $1   bet, and  it's  still  standing and  ready to spring. Oh, and somebody   informed  me  that they  got some  airtime on Cramer's show on the 24th.    Jimmy  Retard  is luekwarm on   them, and you should always inverse him,   so  balls to the  wall, baby.    Especially since he tried to compare the    2009 version of  this  company  (when nobody gave 2 shits about nat   gas)  with the 2021   version (where  governments are going to force   people  into this type  of  product and the  transport industry is   finally  transitioning away  from  oil).\n\n**What   the smart play  is today:**    My thesis, as written back then, is  EXACTLY  what I would  write even   today.  I stand by every last thing  in there,  including  the strike date   and price, in spite of the hedge  fund  bullshit that  artificially tanked the stock for no reason other  than  unmitigated  greed.  It was my   favorite stock in the whole  market then,  and it  still is now, just   balanced against the  knowledge that, as a  very  small midcap bordering on   a small cap,  it's easy to push around  and  very clearly fucked some hedge fund  manager's wife or something. If  you  don't believe me, every   analyst  out there says this company is  worth  double what it's at now. My  original position still exists, except now  it's bigger and I'm also the  owner of a lot (and I mean a LOT) of shares  on top of it that I was  gobbling up like a porn star eating all the  money shots in an episode  of Blacked on Tuesday and Wednesday.\n\n**Trade rating:**    10/10.   Nobody was talking about it before that DD.  You made a   multi-bagger in  just a few days if you jumped in, and even though   you're battered and  bloody right now on the 2nd run with them because   of the manipulation  from a hedge, you're still going to make mad   tendies with this one.   They've got EVERYTHING going for them,   corporate America is looking to  them for the carbon negative fuel as an   easy way to lower their  footprints, no competition other than a  shitty  (4 letter word for non IPO company) building their first   capture plant  who has NO fueling depots or infrastructure, politicians   demanding  carbon neutral fuel and, unlike most of the sector they  reside  in,  actually have a product and make money.\n\n# DD #7:  $BE.  Original Date March 12th, 2021\n\n&amp;#x200B;\n\nhttps://preview.redd.it/61gxm6cl66v61.jpg?width=300&amp;format=pjpg&amp;auto=webp&amp;s=3a4264419b1a0c4aaade95f69d2294665c72253e\n\n**URL:** [Lazy bitch can't even search for it yourself?](https://www.reddit.com/r/wallstreetbets/comments/m3mhkm/nrdrages_friday_dd_spring_is_in_the_air_the_birds/)\n\n**The thesis:**     The clusterfuck in Texas this past winter, combined with  California's   annual inability to provide even basic electricity to its  residents as   the state burns to the ground and they try to push  everybody into  EV's,  created a unique opportunity for a green energy  company that  existed  completely in its own space:  Weather immune  green energy  microgrids  that could scale to any size, literally NEVER  go down as has  been proven  by large-scale pilots in Delaware and Cal  Tech,  and  didn't have the  drawbacks of batteries.  Oh, and  politicians finally  acknowledging that  our utility grid is well beyond  end of life and hot  garbage and not  wanting voters blaming them for  citizen deaths being  willing to spend  taxpayer money to address that.\n\n**Original Price Target:**  70% conviction of a $32 price by mid-April, 45-50 by August, and a long term target of $72\n\n**How did it work out:**    I  had the unfortunate pleasure of posting this DD right as the  entire   green energy space was being crushed by big money rotating into   \"value\"  and later into \"the 10 biggest companies in the S&amp;P to  make  SPY go  up\", so things haven't gone as planned to this point.  The   stock has  actually fallen from the 27's all the way down into the  22's,  though it  has rebounded this week and looks to be starting a  fresh  run.  It's a  bit of a hail Mary, but that 5/21 32c that I was  hyping  back then....it  might still print.  Though even I rolled over  my May  calls to August at  the same strike to buy more time to make up  for them  getting dragged  down with a bunch of companies that aren't  even in the  same space as  these dudes.\n\n**What happened since then:**     They haven't announced any big deals, but I know they're working on    some.  And they set up a new global office in Dubai to start marketing    their products worldwide, which should only give them tailwinds going    forward.\n\n**What the smart play is today:**     I still stand behind everything written in that DD, with the only    thing I'd like to change is the expiry date on the calls from May to    August.  And again, if you're sitting on May calls that are way, WAY    down....I wouldn't cut bait with them just yet just because they're    already almost worthless and there's still a puncher's chance they fight    back.  This thing has started to get some life, and I wouldn't bet    against it being able to hit that strike in a month - well, I wouldn't    bet a lot.  I would just feel better if it were 4.  Long term, this is    still going to be a great investment.\n\n**Trade rating:**    I was  going to give this one a 2/10 just because it had been going   almost  straight down for weeks now killing the May expirys, but the   longer  calls and shares are still very much alive, but I'm going to   upgrade it  to a 3.5 because it's made some good movement, and I will   cross my  fingers that, by this time next month, I'll call it a 6.\n\n# DD #8:  $RYCEY.  Original Date March 19th, 2021\n\n&amp;#x200B;\n\n*Processing img tpd26fjn66v61...*\n\n**URL:** [How was this one of my most popular DD's?](https://www.reddit.com/r/wallstreetbets/comments/m8inij/nrdrages_friday_dd_the_absolute_shittiest_company/)\n\n**The thesis:**     Simple:  A re-opening play.  $RYCEY is one of the only companies in    the world that has not rebounded from the pandemic, and as soon as    people start flying en masse again, demand for their engines (and    maintenance contracts) will start buoying the stock price\n\n**How did it work out:**     I said buy shares and tuck them away.  The stock hasn't really moved    since that DD, and should still be tucked away.  The condition for   their  recovery (increased air travel) has not yet happened, therefore,   it's  not their turn yet.\n\n**What happened since then:**     People have continued to be afraid of their own shadows.  Especially    the Europoors, even though England no longer even has enough cases to    qualify as being in a pandemic.  Dumbasses.\n\n**What the smart play is today:**  Same as it was then.  Buy shares.  Hold.  My positions haven't changed.\n\n**Trade rating:**  4/10.  Their turn for recovery is taking forever, but it'll get there.\n\n# DD #9:  $NVTA.  Original Date April 2nd, 2021 (no DD the week before)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/n288725p66v61.jpg?width=1000&amp;format=pjpg&amp;auto=webp&amp;s=8a264d319bd86a13800c70f4714f12003130e769\n\n**The thesis:**   One of the  few biotech companies in the world worth betting on long  term.   Transformational technology, market leader.  Also, gave me an   opportunity to collaborate with Cathie about the stock (though, because   of my, to be charitable \"un-PC\" vernacular, she declined to put her  name  on the DD).\n\n**Original Price Target:**  50 by mid June, 60's by 2021\n\n**How did it work out:**    We're now officially in the space where the long-game trades are  still  developing and can't yet be judged.  The stock, typical of every   biotech, has been very choppy in this uncertain market.  It opened up   big a couple of days after the DD, but has drifted downwards since that   point.  The volatility still makes it a great intraday scalper, and the   thesis is still sound.\n\n**What happened since then:**   The rotation away from high multiple high growth stocks has continued,  especially after President Harris  proposed increasing the cap gains  tax to the highest in the world (via her J. Dunham \"Walter\" puppet).\n\n**What the smart play is today:**    I stand behind the DD and thesis, and the entry points are still   attractive.  I would move the strike price down into the low-mid 40's,   however.  My position has not changed.\n\n**Trade Rating:**  Incomplete.  Still developing.  I was very clear this one was not for the faint of heart.\n\n# DD #10:  $NEE.  Original Date April 9th, 2021\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5dl8kuuq66v61.jpg?width=1033&amp;format=pjpg&amp;auto=webp&amp;s=56ad32cd35498f28f7998cdca7e268907f7c3175\n\n**URL:** [You're late, but here you go](https://www.reddit.com/r/wallstreetbets/comments/mnksim/nrdrages_friday_dd_ill_take_a_mackinnon_jersey_2/)\n\n**The thesis:**    The $ICLN ETF, which was mostly just $PLUG, was rebalancing in a big   way; Blackrock would thus be purchasing massive quantities of shares of   stock in the new companies.  $NEE was uniquely positioned because it  had  the stability and rotation safety of a value stock, but the  multiple of  a growth stock\n\n**Price targets:**  I said definitely take profits at 83, and my positions were June 75's and 77.50's.\n\n**How did it work out:**    Flawlessly.  The stock basically rocketed to $80 as Blackrock   purchased shares much more aggressively than anticipated, and anyone who   played this trade with me and watched volume would have noticed the   volume fell off a cliff and took profits before it started creeping back   down (as everybody else was taking profits, too).  I exited my   positions near the top and stacked all the money in an air conditioned,   humidity controlled room that consumes immense amounts of coal power.\n\n**What happened since then:**    The share price has started to pull back, which was expected.    Further, they had an earnings call, and you should almost never play   earnings in this environment.\n\n**What the smart play is today:**    This trade is effectively finished - it was predicated upon a   rebalance, the rebalance happened, it was a lot of fun, we all made lots   of money.  This is still a really well run company but the short-term   thesis is no longer valid.  The DD will stay up only as a display of  the  company's operations, margins, and overall growth potential if you  want  to act like a Boomer and be a long-term investor.  I pulled out  all of  my short-term positions, and only maintain shares at this stage.\n\n**Trade rating:**    10/10.  Took even less time than expected for the trade to complete,   and was never in any danger of doing anything but printing tendies.  No   matter when you bought leading up to the rebalance, your position was   green and stayed that way the whole time.\n\n# DD #11:  $ISRG.  Original Date April 16th, 2021:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ms2pwzhs66v61.jpg?width=1200&amp;format=pjpg&amp;auto=webp&amp;s=48d5a30b34e00bb9b21c4571cbc053739206ce54\n\n**URL:** [Thus proving I'm not the Zombie Jew](https://www.reddit.com/r/wallstreetbets/comments/ms51jy/nrdrages_friday_dd_a_robot_may_not_injure_a_human/)\n\n**The thesis:**    A pure earnings play that I didn't really want to write, but my 1st   idea ($PLUG puts) ran its course before Friday.  Analysts had been   lowering expectations for $ISRG for weeks, and even management was   saying things to make it seem like they were going to have a subpar   quarter.  Which made sense, given that a lot of operating theatres are   still closed.\n\n**Price Targets:**    As it was an earnings play, didn't list any long term, but suggested   going long in a company that typically only melts upwards when the  stock  fell by 60 or 70 bucks.\n\n**How did it work out:**    Not even slightly.  At all.  Absolutely TERRIBLE call.  They blew the   doors off earnings, beating by more than a dollar those lowered  analyst  expectations.  Sales were up.  Procedures were up.  Everything  was up.   Instead of going down 10% on weakened guidance, the stock shot  up 5% and  blasted through all-time-highs.  This was a big time loser  of a trade.\n\n**So why did it happen:**   I can't take credit for digging this up, that credit goes to /u/Farmer_eh who did  all the sleuthing of HOW they pulled it off.  It turns out  $ISRG  accelerated depreciation on a lot of their production equipment,  and  also had an increase in inventory.  This means that they had a bunch  of  extra Da Vincis laying around in a warehouse and were selling them  to  medical centers at a steep discount, which is why they sold so many   more robots than any analyst expected (30% more than pre-COVID sales),   and also lowered their expenses for the quarter.  These are neat tricks   that a company can only pull every so often, and it was smart of $ISRG   to not only have that one in their pocket for a rainy day, but also the   wherewithall to play the card at the best possible moment.  So, in a   way, the thesis itself was sound and the quarter would, in fact, have   been a down one had they just been organic about it all, but I failed to   account for easily accomplished accounting magic and motivated sale   pricing to ensure a quarterly beat.  Which is something I'll remember   next time I think about shorting a company that beats on quarterlies   almost 90% of  the time.\n\n**What the smart play is today:**    The original DD talked about letting the stock price come down and   then going long, because this is a company that is mostly always going   to go up.  However, it's run up so fast after those earnings that even   long is a dicey play now, so this is a company that, if you aren't   already in, you should probably stay away from.  However, buried in that   DD was commentary about how $PLUG had been beaten down to the level I   wanted to see it go to already, and that it was time to go long in  them.   I've had a couple of you message me, showing that you had read  between  the lines,  to say you covered your puts after that and went  into  calls.  So those are paying off.  As the green energy sector is  starting  to rebound a bit, $PLUG will naturally get caught up in that,  so  there's a play there.\n\n**Trade rating:**    1/10.  It was going to be a 0, but, as mentioned above, if you had   read between the lines there, there was a secondary play buried in there   about $PLUG calls, so I'll give 1 single, solitary point on this   otherwise complete dumpster fire of a call.\n\nAll my love\n\n\\-Chad Dickens",
        "subreddit": "wallstreetbets",
        "title": "NrdRage's Friday DD...on a Saturday. Market is as confused as a Zoomer exposed to good music, so instead of something new, let's re-visit the last DD's, see where they shook out, and update them (DD \"Where are they now\" 30 for 30 edition)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mxqn2b/nrdrages_friday_ddon_a_saturday_market_is_as/",
        "created": 1619320094.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619124579,
        "id": "mwegir",
        "num_comments": 158,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, April 22, 2021**\n\nStocks fell on Thursday, erasing yesterday’s gains as market volatility continues. Stocks fell after Bloomberg reported that President Biden would propose increasing the capital gains tax rate on wealthy individuals. The S&amp;P 500 (SPY) closed 0.91% down, the Dow Jones (DIA) closed 0.94% and the tech-heavy Nasdaq (QQQ) fell 1.21%.\n\nAccording to a report by [Bloomberg](https://www.bloomberg.com/news/articles/2021-04-22/biden-to-propose-capital-gains-tax-as-high-as-43-4-for-wealthy), President Biden will propose almost doubling the capital gains tax rate for wealthy individuals earning $1 million or more per year to 39.6% to help pay for a slew of social programs and the proposed infrastructure bill. The new marginal 39.6% rate would be an increase from the current base rate of 20%, the people said on the condition of anonymity because the plan is not yet public. The proposal could reverse a long-standing provision of the tax code that taxes returns on investment lower than on labor/salary. \n\nCorporate earnings have so far exceeded Wall Street’s even lofty expectations, as companies benefited from both a surge in consumer spending as the economy opens back up and cost-cutting measures implemented during the height of the pandemic.  However, despite the largely positive earnings, many stocks have failed to react positively to the news. It seems as more positive economic data is released in terms of consumer spending and unemployment, it takes more and more impressive results to convince investors to pile into the stock. This suggests there is froth in the markets given the sky-high valuation of some companies, in our opinion.\n\nJim Caron, investment management fixed income portfolio manager at Morgan Stanley (MS) said, “What we have is the absence of a catalyst. Everything that we’ve done over the last twelve months has been to build up to this point, to get this recovery, to get a very, very strong second-quarter GDP, which we think could be upwards of 10%. But after that, things start to slow down. It doesn’t mean that the data gets bad, it just means on a relative basis that the third quarter will be weaker than the second quarter and the fourth quarter may be weaker than the third quarter.”\n\n**Highlights**\n\n* Two U.S. senators have expressed concern about what they said may be an emerging pattern of safety concerns involving Tesla Inc. vehicles in the wake of a fatal crash in Texas.\n* Square (SQ) announced that it plans to make new inventory-management features available to its sellers.The company is rolling out tools that help sellers automate their inventory-management processes by using barcode scanners to take stock of inventory and receiving alerts driven by machine learning to see when an item is due to run out.\n* The White House announced more than 200 million doses of the coronavirus vaccine have been distributed in the US, greatly surpassing original estimates of 100 million doses delivered in the first 100 days of Biden’s presidency. On the back of this robust distribution, all states are beginning to open back up.\n* Mortgage applications jumped 8.6% in the week ended April 16, marking the biggest jump since late January as mortgage rates pulled back following a surge, according to the Mortgage Bankers Association (MBA). \n* Ford Motor (F) is planning more downtime at five North American factories due to a global semiconductor shortage. \n* **\\*\\*Please note that current stock price was written in the morning and does not reflect current stock price\\*\\***\n* Twitter (TWTR) target raised by Argus from $72 to $82 at Buy. Stock currently around $65\n* Las Vegas Sands (LVS) target raised by Credit Suisse from $58 to $69 at Outperform. Stock currently around $58\n* Lam Research (LRCX) with a host of target raises. Consensus price target around $775 at Overweight. Stock currently around $615\n* Equifax (EFX) target raised by Needham &amp; Co from $215 to $260 at Buy. Stock currently around $221\n* Discover Financial Services (DFS) target raised by Morgan Stanley (MS) from $108 to $114 at Equal-Weight. Stock currently around $99\n* NXP Semiconductors (NXPI) target raised by Oppernheimer from $210 to $235 at Outpeform. Stock currently around $196\n* Facebook (FB) target raised by Jefferies Financial Group from $350 to $360 at Buy. Stock currently around $296\n* Chipotle (CMG) with a host of target raises after a strong earnings report. Consensus price target around $1700 at Outperform. Stock currently around $1479\n\n“All our dreams can come true, if we have the courage to pursue them.” - Walt Disney",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, April 22, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mwegir/here_is_a_market_recap_for_today_thursday_april/",
        "created": 1619153379.0
    },
    {
        "author": "Ironleg01",
        "created_utc": 1619363575,
        "id": "mya94l",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "Source: \\[censored, against the sub rules\\]\n\n&amp;#x200B;\n\n* Earnings  reports will dominate the action next week even as investors keep a  watch for any developments with an infrastructure package or capital  gains tax announcement. Conference calls from Tesla (NASDAQ\\*\\*:TSLA\\*\\*), Boeing **(NYSE:BA**) and AMD (NASDAQ\\*\\*:AMD\\*\\*)  will be of high interest. Economic reports due in the week ahead  include updates on durable goods orders, pending home sales and GDP.\n* Earnings season heats up in a big way with reports due in from Albertsons (NYSE:**ACI**), Tesla (**TSLA**) and NXP Semi (NASDAQ:**NXPI**) on April 26; BP (NYSE:**BP**), UPS (NYSE:**UPS**), General Electric (NYSE:**GE**), Alphabet (NASDAQ:**GOOG**), Microsoft (OTCPK:**MFST**) and Starbucks (NASDAQ:**SBUX**) on April 27; Humana (NYSE:**HUM**), Boeing (**BA**), Apple (NASDAQ:**AAPL**), Ford (NYSE:**F**), Qualcomm (NASDAQ:**QCOM**) and General Dynamics (NYSE:**GD**) on April 28; Comcast (NASDAQ:**CMCSA**), Merck (NYSE:**MRK**), Caterpillar (NYSE:**CAT**), Northrop Grumman (NYSE:**NOC**), Amazon (NASDAQ:**AMZN**), Nio (NYSE:**NIO**) and U.S. Steel (NYSE:**X**) on April 29; as well as Exxon Mobil (NYSE:**XOM**), Chevron (NYSE:**CVX**) and AbbVie (NYSE:**ABBV**) on April 30.\n* The latest vibe from Wall Street analysts is that Tesla (**TSLA**)  has a good chance to top consensus estimates for Q1 revenue of $10.5B  and EPS of $0.75 after factoring in the strong Q1 delivery numbers.  \"While Tesla has navigated a myriad of Chinese government PR issues,  chip shortages, and a further spotlight on its auto pilot safety record  (given the Texas crash) over the past month, the Street is now laser  focused on gauging the annual delivery trajectory for 2021,\" previews  analyst Dan Ives. The conference call set for April 26 at 4:30 p.m.  takes on some added significance with the news flow working against  Tesla over the last week.\n* Apple (**AAPL**)  is seen generating revenue of $77B and EPS of $0.98 in Q1. Analysts are  watching for indications that the company's strong services sales  growth has continued in Q2 quarter and that the pandemic boost in demand  for iPads and Macs has continued. Apple is also expected to increase  its dividend payout and boost its buyback allowance. After Apple turns  the page on Q1, investors will start looking to analyze how the iPhone  13 launch will factor in to the back half of the year.\n* Microsoft (NASDAQ:**MSFT**)  is tipped by Wedbush Securities for another beat and raise quarter. \"We  strongly believe the tide is shifting in the cloud arms race as  Microsoft should deliver a \\~45% Azure growth number this quarter and is  clearly taking market share vs. AWS based on our analysis. While we have  seen the momentum of this backdrop in the last few quarters, we believe  deal flow looks strong heading into the rest of FY21 and FY22 as we  estimate that Microsoft in particular is still only \\~35% through  penetrating its unparalleled installed base on the cloud transition,\"  updates analyst Dan Ives.\n* IPOs expected to start trading next week include FTC Solar (FTCI) on April 28 and both Endeavor Group (NYSE:EDR) and Fortegra Group (FRF) on April 29. IPO lockup periods are set to expire next week \\[censored, against the sub rules\\]\n* **Projected dividend increases (quarterly):** Expected dividend hikes for next week include Masco (NYSE:MAS) to $0.235 from $0.14, St Joe (NYSE:JOE) to $0.09 from $0.08, Tetra Tech (NYSE:TTI) $0.19 from $0.17, American Water (NYSE:AWK) to $0.60 from $0.55, Comfort Systems USA (NYSE:FIX) to $0.125 from $0.115, Ameriprise Financial (NYSE:AMP) to $1.11 from $1.04, Invesco (NYSE:IVZ) to $0.165 from $0.155, HP Enterprise (NYSE:HPE) to $0.1275 from $0.12 and Apple (AAPL) to $0.2175 from $0.205.\n* On  the topic of dividends, UBS ran a deep screen for some dividend  favorites. A list of 16 stocks was generated based off a filter of  Buy-rated stocks with three-year dividend growth rate forecast at least  at a high single digit rate, with a current dividend yield that beats  the S&amp;P's yield, sustainable payout ratios and sitting with more  than 10% potential upside to price targets. On that list the fastest  dividend growth was projected for Barrick (NYSE**GOLD**), East West Bancorp (NASDAQ:**EWBC**), and Royalty Pharma (NASDAQ:**RPRX**) and the lowest payout ratios (suggesting the greatest ability to pay) were at Sealed Air (NYSE:**SEE**), Royalty Pharma (**RPRX**) and East West Bancorp (**EWBC**). The highest yielding names in the screen included Merck (**MRK**), American Electric Power (NASDAQ:**AEP**) and Sempra (NYSE:**SRE**).\n* A pre-hearing conference will by held by the New Mexico Public Regulation Commission in regard to the PNM Resources (NYSE:PNM)-Avangrid (NYSE:AGR) merger. The companies have already landed several different approvals include from FERC. CoreLogic (NYSE:CLGX) shareholders vote on the buyout offer from Stone Point on April 28. Cooper Tire &amp; Rubber (NYSE:CTB) shareholders vote on the Goodyear Tire &amp; Rubber (NASDAQ:GT) merger on April 30. FactSet Research (NYSE:FDS) trades with takeover rumors swirling around it.\n* I-Mab (NASDAQ:IMAB) hosts its 2021 R&amp;D Day on April 26. Executives from Facebook (NASDAQ:FB), Twitter (NYSE:TWTR) and YouTube (GOOG) testify in front of a Senate Judiciary hearing covering algorithmic amplification on April 27. Atlassian (NASDAQ:TEAM)  Co-CEO and founder Mike Cannon-Brookes gives a talk at the company's  Team 21 event on April 28 that it hopes will draw attention to the  company's new innovations.\n* Wayfair (NYSE:W)  holds its two-day deals event on April 28-29. The Way Day shopping  event includes deals and promotions on best-selling items across the  whole home including furnishings, decor, housewares, home improvement  products, major appliances, outdoor and more. Shares of Wayfair are up  41% YTD and 232% over the last 52 weeks.\n* The NFL draft begins  the evening of April 29 and is a bettable event in more states than ever  as legislation continues to advance in more states. New Gatorade  (NASDAQ:PEP)  endorser Trevor Lawrence is expected to go the Jacksonville Jaguars as  the number one overall pick. The draft follows a big week for sports  betting/iGaming stocks like DraftKings (NASDAQ:DKNG) and Penn National Gaming after BetMGM's investor event pushed up expectations for the total addressable market.\n* **GamesBeat Summit 2021:** The event gathers videogame industry players (virtually)  April 28-29 with a special focus on diversity, inclusion and mental  health challenges, as part of its larger theme of what will keep gaming  growing. Notable sessions will include Phil Spencer, executive VP of  gaming at Microsoft (MSFT), who is joined by his team for \"Team Xbox on Gaming for Everyone\"; Activision Blizzard (NASDAQ:ATVI) CEO Bobby Kotick and AMD's (AMD) Frank Azor each talking about gaming's post-pandemic world; and representatives from Electronic Arts (NASDAQ:EA), Playtika (NASDAQ:PLTK), NetEase (NASDAQ:NTES), Tencent (OTCPK:TCEHY), Roblox (NYSE:RBLX) and Sony (NYSE:SONY).\n* **Conferences rundown:**  Notable conferences running during the week include the Chardan  Manufacturing Summit, H.C. Wainwright &amp; Co. Cryptocurrency,  Blockchain &amp; FinTech Conference, Kempen Life Science Conference and  B. Riley Neuroscience Conference.\n* Food  stocks catch the attention of the publication with more people heading  back to the office, to schools and to restaurants. Hershey (NYSE:HSY), Mondelez International (NASDAQ:MDLZ), Conagra Brands (NYSE:CAG), J.M. Smucker (NYSE:SJM), Hostess Brands (NASDAQ:TWNK), Kraft Heinz (NASDAQ:KHC), General Mills (NYSE:GIS), Kellogg (NYSE:K) and Campbell Soup (NYSE:CPB)  are called the leading food stocks with their lean valuations and  secure dividends comparing nicely to other sectors. Perrigo (NYSE:PRGO)  is tipped to see a turnaround. The company is seen moving past its  legal risks and its valuation is seen rising as investors get more  comfortable with the new growth profile. Meanwhile, Moderna (NASDAQ:MRNA) is called more than a one-hit wonder with strong sales seen for years.\n\n# Seeking Alpha Catalyst Watch\n\n&amp;#x200B;\n\n**Monday - April 26**\n\n&amp;#x200B;\n\n* **Volatility watch -** Stocks with a high level of volatility implied by options trading include \\[censored, against the sub rules\\]. Names with an elevated level of short interest heading into next week include \\[censored, against the sub rules\\].\n* **All week -**  Notable conferences running during the week include the Chardan  Manufacturing Summit, H.C. Wainwright &amp; Co. Cryptocurrency,  Blockchain &amp; FinTech Conference, Kempen Life Science Conference and  B. Riley Neuroscience Conference.\n* **All week -**  The Nevada Gaming Control Board is due to release its March gaming win  report sometime during the week. The state's casinos are expected to  post sequential progress. States that have already reported gross gaming  revenue numbers for March have posted strong results, including records  being set in Maryland, Ohio, Missouri and Iowa. Looking ahead, the  Governor of Nevada has announced plans to have casinos in the state be  operating at 100% by summer, which bodes well for MGM Resorts (NYSE:MGM), Boyd Gaming (NYSE:BYD), Caesars Entertainment (NASDAQ:CZR) and Red Rock Resorts (NASDAQ:RRR).\n* **All day -** The IPO lockup period on Root (NASDAQ:ROOT)  expires on April 26. Short interest on Root is at over 40% of total  float. Just to make things really interesting, noted short seller Citron  is long on Root. Also watch Biodesiz (NASDAQ:BDSX), Gatos Silver (NYSE:GATO) and MediaAlpha (NYSE:MAX) with their IPO lockups ending. Meanwhile, the quiet period expires on Frontier (NASDAQ:ULCC), Coursera (NYSE:COUR), Compass (NYSE:COMP), Karooooo (NASDAQ:KARO) and Smart Share (NASDAQ:EM) - which will free up analysts to post ratings.\n* **8:00 a.m.** I-Mab (NASDAQ:IMAB)  hosts its 2021 R&amp;D Day. The presentations from execs will provide  an in-depth breakdown of the company's key pipeline programs, research  and development strategy, as well as a progress update on I-Mab's  transformation into a fully integrated global biopharma company. Shares  of IMAB jumped more than 3% after an investor presentation last fall.\n* **10:20 a.m.**  Dow (NYSE:DOW)  CEO Jim Fitterling will make an appearance at the Bloomberg Green  Summit to discuss why green is good for business. Later in the day,  QuantumScape (NYSE:QS) CEO Jagdeep Singh is a featured speaker.\n* **1:45 p.m.** Execs with MeiraGTx Holdings plc (NASDAQ:MGTX) participate in a fireside chat at the Chardan Virtual Genetic Medicines Manufacturing Summit.\n* **5:30 p.m.** Tesla (NASDAQ:TSLA)  holds its earnings call with drama ratcheted up a bit amid new safety  concerns on Autopilot and some recent backlash in China. Analysts and  investors will also be looking for an update from Elon Musk and gang on  the company's full-year deliveries target.\n\n**Tuesday - April 27**\n\n&amp;#x200B;\n\n* **All day -** The FDA action date arrives for Protalix BioTherapeutics (NYSEMKT:PLX)  on the priority review of Pegunigalsidase alfa (PRX-102) for Fabry  disease. Shares of Protalix Bio rallied in February when positive data  was released by the company.\n* **8:00 a.m.**  Cyclerion Therapeutics (NASDAQ:CYCN)  hosts a webinar with a live Q&amp;A. The company will provide a  corporate update on clinical programs for its CY6463 therapy used in  Alzheimer's Disease with Vascular pathology. Cyclerion will discuss the  potential for CY6463 to treat Cognitive Impairment Associated with  Schizophrenia. Phase 2 top-line data is due in the middle part of the  year.\n* **10:00 a.m.** \\[censored, against the sub rules\\]\n* **10:00 a.m.** Executives from Facebook (NASDAQ:FB), Twitter (NYSE:TWTR) and YouTube (NASDAQ:GOOG)  testify in front of a Senate Judiciary hearing covering algorithmic  amplification. The original plan was to bring in chief executives to  discuss algorithms, but the testimony will come from executives closer  to policymaking on the issue.\n* **10:30 a.m.** Top execs with Solid Biosciences (NASDAQ:SLDB)  will participate in a virtual fireside chat at the Chardan 5th Annual  Genetic Medicines Manufacturing Summit. SVB Leerink has an aggressive  price target of $15 (194% upside) on SLDB based on its positive view on  the upside for SGT-001.\n* **11:00 a.m.** The two-day Adobe (NASDAQ:ADBE) Summit event kicks off with keynotes addresses from FedEx (NYSE:FDX) COO Raijesh Subramaniam, Pfizer (NYSE:PFE) CEO Albert Bourla and Adobe CEO Shantanu Narayen.\n* **5:00 p.m.** Intel (NASDAQ:INTC) will be on watch when AMD (NASDAQ:AMD)  execs hold their post-earnings conference call. Color from AMD on  demand and pricing could highlight again the competitive pressure being  felt by Intel with datacenter market share. \"*Intel is set for a very  challenging 2-3 years in terms of share loss, margin pressure, and  heightened execution risk by juggling many more balls in the air than  ever before*,\" warns Rosenblatt Securities.\n\n**Wednesday - April 28**\n\n&amp;#x200B;\n\n* **All day -**   The two-day GamesBeat Summit begins in a digital format. The event is  expected to cover some of the next-gen plans for the gaming industry.  Notable speakers include Microsoft's (NASDAQ:MSFT) top Xbox exec, as well as the CEOs of Playtika (NASDAQ:PLTK) and Activision Blizzard (NASDAQ:ATVI).\n* **All day -**   OPEC and its allies hold a full ministerial meeting. The opening  session is scheduled to include remarks from Saudi oil minister Prince  Abdulaziz bin Salman, Russian Deputy Prime Minister Alexander Novak and  Angolan Oil Minister Diamantino Pedro Azevedo. The meeting is expected  to be largely technical without major changes to policy, but comments  coming out of the meeting on a potential NOPEC bill in the U.S. could be  impact trading.\n* **10:00 a.m.** Trillium Therapeutics (NASDAQ:TRIL)  holds a R&amp;D Day to provide a data update for TTI-622 and TTI-621,  including data for the 18 mg/kg and 2 mg/kg dose cohorts. The company is  also expected to announce key strategic priorities in terms of target  indications and drug combinations across hematologic malignancies and  solid tumors. Ahead of the event, Benchmark initiated Trillium  Therapeutics with a Buy rating and a price target of $21 (120% upside).\n* **12:00 p.m.** Atlassian (NASDAQ:TEAM)  Co-CEO and founder Mike Cannon-Brookes gives a talk at the company's  Team 21 event that it hopes will draw attention to the company's new  innovations. Zoom Video (NASDAQ:ZM) CEO Eric Yuan and Slack Technologies (NYSE:WORK) CEO Stewart Butterfield are also scheduled to give talks at the virtual event on the modern work environment.\n* **2:00 p.m.**  The Fed's FOMC announcement is due to be made. Economists expect some  changes in the assessment of the economy in the first paragraph of the  statement in order for the central bank to flag the better growth data  with gains in COVID-sensitive sectors, while still emphasizing that the  improvement is just beginning. The language around the transitory  strength in inflation will also be watched closely.\n* **2:30 p.m.** Federal Reserve Chairman Jerome Powell holds a press conference.\n\n**Thursday - April 29**\n\n&amp;#x200B;\n\n* **All day -**  The FDA action date on the review of Ardelyx' (NASDAQ:ARDX)  Tenapanor for chronic kidney disease on dialysis arrives. Seeking Alpha  author Avisol Capital Partners is bullish on ARDX ahead of the FDA  decision.\n* **Premarket -**  Options trading implies large swings for 1-800-Flowers.com (NASDAQ:FLWS), Tempur-Sealy International (NYSE:TPX) and Realogy Holdings Corp (NYSE:RLGY)  after the companies report earnings. All three stocks are indicated to  swing between 9% and 10% (up or down) after the numbers hit.\n* **7:30 a.m.**  The advance release of Q1 U.S. GDP arrives. Bank of America expects an  acceleration in real growth to a robust 6.5% Q/Q pace, up from 4.1% in  Q4 of last year. \"Consumer spending likely surged this quarter by 11%,  boosted by the multiple shots to the arm from December stimulus, March  stimulus, and the COVID-19 vaccine which has allowed for greater  reopening in the economy. There is likely to be strength among many  other components of real activity with both residential and equipment  investment in particular seeing double digit annualized growth, and  government spending and intellectual property investment up solidly,\"  previews BofA.\n* **1:30 p.m.** Top execs with MediciNova(NASDAQ:MNOV)  will participate in a fireside chat hosted by B. Riley. The discussion  will cover MediciNova's development of MN-166 (ibudilast) for  neurological conditions. Shares of MediciNova soared last month after  the company announced a development agreement with the Biomedical  Advanced Research and Development Authority for MN-166.\n* **Postmarket -**  Amazon (NASDAQ:AMZN) is due to report earnings. Keep an eye on Summer Infant (NASDAQ:SUMR). The company derives 33% of its revenue from Amazon and moves in tandem with it the week after earnings 88% of the time.\n\n**Friday - April 30**\n\n&amp;#x200B;\n\n* **All day -**  Clorox (NYSE:CLX) and Colgate-Palmolive (NYSE:CL)  both report earnings amid heightened interest in how the companies lap  the tough pandemic comparables and management updates on pricing vs.  commodity costs. Options trading on the two stock implies a  post-earnings move up or down of around 4%.\n* **All day -**  It may be time to watch Airbnb (NASDAQ:ABNB)  for increased volatility with another series of lockups expiring in  early May. 80% of A-shares (20% of total) will come unlocked two days  following the company's upcoming Q1 report.  All B-class shares held  primarily by management and VCs are subject to Rule 144 and would also  be available to sell at this time if registered. Short interest on  Airbnb is also at about 15% of total float.",
        "subreddit": "stocks",
        "title": "Wall Street Breakfast: The Week Ahead",
        "url": "https://www.reddit.com/r/stocks/comments/mya94l/wall_street_breakfast_the_week_ahead/",
        "created": 1619392375.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619037870,
        "id": "mvozqy",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, April 21, 2021**\n\nStocks reversed on Monday, rising on Wednesday for the first day in three sessions, with small-caps leading the way after a terrible run of performance in April. Despite Netflix (NFLX) sharply missing earnings expectations in terms of new paid subscribers, the tech-heavy Nasdaq (QQQ), while the Dow Jones (DIA) and S&amp;P 500 (SPY) remain near record levels. \n\nAfter a recent spike this week, the CBOE Volatility Index sank back to near 52-week lows, a sign that investor risk appetite is increasing. The VIX is known as the \"investor fear gauge,\" because it reflects investors' best predictions of near-term market volatility or risk. In general, the VIX rises during times of financial stress and falls during good economic times. David Kostin, chief US equity strategist at Goldman Sachs said, “The S&amp;P 500 has reached new highs while volatility has sharply declined. Low volatility has outweighed low correlations among stocks, driving return dispersion back below the long-term average. As the U.S. moves beyond key macro events such as the 2020 election, the $1.9 trillion fiscal stimulus package, and peak economic activity, we expect three defining themes for markets will be tax reform, infrastructure, and pricing power.”\n\nWhile Netflix (NFLX) sharply missed estimates, this earnings season has largely blown consensus estimates out of the water, with more than 81% of companies that have reported so far beating earnings expectations, according to a study by FactSet. However, despite the largely positive earnings, many stocks (apart from today) have failed to react positively to the news. It seems as more positive economic data is released in terms of consumer spending and unemployment, it takes more and more impressive results to convince investors to pile into the stock. This suggests there is froth in the markets given the sky-high valuation of some companies. \n\nWhite House chief medical advisor Dr. Anthony Fauci said he believes the U.S. will likely resume use of the Johnson &amp; Johnson Covid-19 vaccine as soon as Friday with a warning or restriction attached. The doctor said, “My estimate is that we will continue to use it in some form. I doubt very seriously if they just cancel it. I don’t think that’s going to happen. I do think that there will likely be some sort of warning or restriction or risk assessment. I don’t think it’s just going to go back and say, ‘Okay, everything’s fine. Go right back.’ I think it’ll likely say, ‘Okay, we’re going to use it, but be careful under these certain circumstances.”\n\n**Highlights**\n\n* The White House announced more than 200 million doses of the coronavirus vaccine have been distributed in the US, greatly surpassing original estimates of 100 million doses delivered in the first 100 days of Biden’s presidency. On the back of this robust distribution, all states are beginning to open back up.\n* Mortgage applications jumped 8.6% in the week ended April 16, marking the biggest jump since late January as mortgage rates pulled back following a surge, according to the Mortgage Bankers Association (MBA). \n* Ford Motor (F) is planning more downtime at five North American factories due to a global semiconductor shortage. \n* During yesterday’s virtual event, Apple (AAPL) announced a new slate of products set to include the companies own chip. The offering includes a new iMac, a new iPad, and a new tracking-device called Airtags.\n* Gisele Bündchen, supermodel and Tom Brady’s wife was announced as a special advisor for the CEO and board of directors in DraftKings. This is just the latest in a series of high-profile moves by DraftKings to establish itself as the premier sport-betting company. \n* After gapping up after earnings, Intuitive Surgical (ISRG) joined the ranks of healthcare companies worth $100 billion or more\n* After a series of high profile accidents including small children, the US Consumer Product Safety Commission advised consumer to not buy the treadmill if there are small kids or pets at home.This could affect the company's product-safety profile, a material category for the household and personal-goods sector. In response, Peloton (PTON) called the statements “inaccurate and misleading” and refused calls to recall their treadmill. The stock has been in freefall this week. \n* \\*\\***Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Abbott Labs (ABT) target raised by Morgan Stanley (MS) from $136 to $140 at Overweight. Stock currently around $120\n* Allegiant Travel (ALGT) target raised by Barclaays from $237 to $300 at Overweight. Stock currently around $231\n* Burlington Stores (BURL) target raised by Loop Capital from $325 to $365 at Buy. Stock currently around $319\n* Dell Technologies (DELL) with a host of target raises. Consensus price target $115 at Overweight. Stock currently around $101\n* Equinix (EQIX) target raised by Mizuho from $750 to $800 at Buy. Stock currently around $726\n* Facebook (FB) target raised by Cowen from $350 to $360 at Outperform. Stock currently around $303\n* Forward Air (FWRD) target raised by Raymond James from $95 to $100 at Outperform. Stock currently around $87 \n* Alphabet (GOOG,GOOGL) target raised by Cowen from $2400 to $2600 at Outperform. Stock currently around $2293\n* Goldman Sachs (GS) with a host of target raises. Consensus price target $410 at Outperform. Stock currently around $332\n* Jazz Pharma (JAZZ) target raised by Cantor Fitzgerald from $185 to $198 at Overweight. Stock currently around $168\n* JP Morgan (JPM) with three target raises. Stock currently around $150 \n   * DA Davidson from $179 to $182 at Buy\n   * Royal Bank of Canada from $150 to $160 \n   * Piper Sandler from $170 to $180\n* Lam Research (LRCX) target raised by Argus from $625 to $725 at Buy. Stock currently around $613\n* NXP Semiconductors (NXPI) target raised by Wells Fargo (WFC) from $193 to $235 at Overweight. Stock currently around $194\n* Penn National Gaming (PENN) target raised by Goldman Sachs (GS) from $153 to $158 at Buy. Stock currently around $89\n* Royal Caribbean (RCL) target raised by Goldman Sachs (GS) from $76 to $95 at Neutral\n* Snap (SNAP) target raised by Cowen from $86 to $88 at Outperform. Stock currently around $58\n* UPS with two target raises. Stock currently around $180\n   * Citigroup (C) from $190 to $200 at Neutral\n   * Raymond James from $195 to $200 at Strong-Buy\n\n“In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock prices, not risk, but it is an opportunity.” - Li Lu",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, April 21, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mvozqy/here_is_a_market_recap_for_today_wednesday_april/",
        "created": 1619066670.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619642247,
        "id": "n0o7ex",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "The stock market fell on Wednesday, with all three major indexes closing modestly red as market participants continue to digest the corporate earnings season and new commentary from the Federal Open Markets Committee. \n\nThe FOMC said the effective distribution of the vaccine in the US has improved economic conditions but reiterated interest rates will remain near-zero and the asset purchasing program in place. The Fed said, “Amid progress and strong policy support, indicators of economic activity and employment have risen.” The committee remains optimistic about the rebound in economic activity, describing the most affected sectors as “having shown improvement”, but shows no signs of slowing quantitative easing or raising interest rates. With more than 8 million people still out of jobs compared to pre-pandemic levels, FOMC reiterated its commitment to supporting the economy.\n\nThe Fed also said inflation has “risen” but attributed the higher readings to “transitory factors”, meaning they expect any rise in inflationary pressures to be short-lived. Central bank officials warn that higher inflation reading could be coming as a result of measuring year-over-year changes from a highly unusual 2020. In other words, The Fed looks at changes in prices in a year-over-year format. Data for March and April of this year could therefore reflect large price “increases” because they are being compared against March and April in 2020 that saw massive price drops. \n\nEconomic data published since the Fed’s last meeting in March 17 have largely supported their brighter outlook. Consumer spending surged 9.8% in March and initial jobless claims dropped to pandemic-era lows as more states continue reopening measures. In other news, according to a report by the Conference Board, consumer confidence has surged to a 14-month high in April as effective distribution of the vaccine and easing of social distancing guidelines in the US allows for the economy to gradually reopen. The Conference Board's monthly consumer confidence index jumped to a reading of 121.7 in April, or well above the 113.0 expected. Lynn Franco, senior director of economic indicators at the Conference Board, said in a statement, “Consumers’ assessment of current conditions improved significantly in April, suggesting the economic recovery strengthened further in early Q2. Consumers’ optimism about the short-term outlook held steady this month. Consumers were more upbeat about their income prospects, perhaps due to the improving job market and the recent round of stimulus checks.”\n\n**Highlights**\n\n* The US trade deficit rose to a new record high in March, according to data from the Department of Commerce. The deficit increased by 4% to $90.6 billion, higher than the $88 expected by economists\n* Mortgage applications fell 2.5% week-on-week, according to the Mortgage Bankers Association. This follows a jump of 8.6% last week, which had marked the first rise in seven weeks. \n* A deep-sea mining robot on a test mission to bring up rocks rich in cobalt and nickel from the floor of the Pacific Ocean has malfunctioned and is lost.\n* According to multiple reports, Nio began development on more affordable SUV to cater for the mid to low price markets and is also working on an upgraded 70-kilowatt-hour battery pack using lithium-iron-phosphate batteries, which are cheaper than the ones the company uses now\n* Nio said in a tweet from its official handle that its global vision is gaining steam and the company is making plans to expand to Norway as part of its plan to expand into Europe. Press Conference on May 6th at 1 am PDT \n* The European Union fined Credit Suisse Group AG, Bank of America Corp. and Credit Agricole SA a small amount for illegally colluding on trades in government bond markets at the expense of their clients.\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Advanced Auto Parts (AAP) target raised by Wedbush from $210 to $230 at Outperform. Stock currently around $197\n* AMD with two target raises. Stock currently around $85\n   * \\- Raymond James from $100 to $110 at Outperform\n   * Susquehanna from $115 to $125 at Positive\n* Boyd Gaming (BYD) with two target raises. Stock currently around $69\n   * Deutsche Bank from $71 to $77 Buy\n   * Morgan Stanley (MS) from $66 to $78 at Overweight\n* Capital One (COF) with a host of target raises. Consensus price target $165 at Outperform. Stock currently around $139\n* Crocs (CROX) target raised by Robert W Baird from $100 to $135 at Outperform. Stock currently around $98\n* EA target raised by KeyCorp from $165 to $170 at Overweight. Stock currently around $143\n* F5 Networks (FFIV) target raised by Needham &amp; Co from $245 to $255 at Buy. Stock currently around $205\n* Alphabet (GOOG, $GOOGL) with a host of target raises. Consensus price target $2850 at Buy. Stock currently around $2290\n* Lam Research (LRCX) with a host of target raises. Consensus price target $730 at Buy. Stock currently around $645\n* Microsoft (MSFT) with a host of target raises. Consensus price target $300 at Outperform. Stock currently around $262\n* Signature Bank (SBNY) with two target raises. Stock currently around $252\n   * Wedbush from $280 to $305 at Outperform\n   * Raymond James from $290 to $300 at Strong-Buy\n* Tesla (TSLA) target raised by Morgan Stanley to $900 at Overweight. Stock currently around $704\n* Visa (V) with a host of target raises. Consensus price target $265 at Outperform. Stock currently around $230\n* NXP Semiconductors (NXPI) with a host of target raises. Consensus price target $230 at Outperform. Stock currently around $203\n\n“To bear trials with a calm mind robs misfortune of its strength and burden.\" - Seneca",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, April 28, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/n0o7ex/here_is_a_market_recap_for_today_wednesday_april/",
        "created": 1619671047.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1619278590,
        "id": "mxmc9e",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning April 26th, 2021.\n\n# **Taxes and inflation will be key themes for markets in the week ahead - [(Source)](https://www.cnbc.com/2021/04/23/taxes-and-inflation-will-be-key-themes-for-markets-in-the-week-ahead.html)**\n*****\n&gt; The final week of April is going to be a busy one for markets with a Federal Reserve meeting and a deluge of earnings news.\n*****\n&gt; Hot topics in markets will continue to be inflation and taxes.\n*****\n&gt; President Joe Biden is expected to detail his “American Families Plan” and the tax increases to pay for it, including a much higher capital gains tax for the wealthy. The plan is the second part of his Build Back Better agenda and will include new spending proposals aimed at helping families. The president addresses a joint session of Congress Wednesday evening.\n*****\n&gt; It’s a huge week for earnings with about a third of the S&amp;P 500 reporting, including Big Tech names, such as Apple, Microsoft, Alphabet and Amazon.\n*****\n&gt; As many have already done, firms like Boeing, Ford, Caterpillar and McDonald’s, are likely to detail cost pressures they are facing from rising materials and transportation costs and supply chain disruptions.\n*****\n&gt; At the same time, the Fed is expected to defend its policy of letting inflation run hot, while assuring markets it sees the pick-up in prices as only temporary. The central bank meets on Tuesday and Wednesday.\n*****\n&gt; # The central bank takes the main stage\n&gt; “I think the Fed would like not to be a feature next week, but the Fed will be forced from the background because of concerns about inflation,” said Diane Swonk, chief economist at Grant Thornton.\n*****\n&gt; The central bank is not expected to make any policy moves, but Fed Chairman Jerome Powell’s press briefing following the meeting Wednesday will be closely watched.\n*****\n&gt; So far, the barrage of earnings news has been positive, with 86% of companies reporting earnings beats. Corporate profits are expected to be up about 33.9% for the first quarter, based on estimates and actual reports, according to Refinitiv. Revenues are about 9.9% higher.\n*****\n&gt; There is important inflation data Friday when the Fed’s preferred inflation gauge is reported.\n*****\n&gt; The personal consumption expenditure report is expected to show a 1.8% rise in core inflation, still below the Fed’s target of 2%. Other data releases include the first-quarter gross domestic product on Thursday, which is expected to have grown by 6.5%, according to Dow Jones.\n*****\n&gt; “I think the Fed has no urgency to shift monetary policy at this point,” said Ian Lyngen, head of U.S. rates strategy at BMO. “The Fed needs to acknowledge that the data is improving. We had a strong first quarter.”\n*****\n&gt; “The Fed needs to acknowledge that but at the same time they’re keeping extremely accommodative policy in place, so they’ll have to make a note to the fact that the easy policy is warranted,” he said.\n*****\n&gt; Lyngen said the Fed will likely point to continued concerns about the pandemic globally as a potential risk to the economic recovery.\n*****\n&gt; Powell is also expected to once more explain that the Fed will let inflation rise above its 2% target for a period of time before it raises rates so that the economy can have more time to heal. “It’s going to be a challenge for the Fed,” said Swonk.\n*****\n&gt; The base effects for the next several months will make inflation appear to have jumped sharply because of the comparison to a weak period last year. The consumer price index for April could be above 3%, compared to 2.6% last month, Swonk added.\n*****\n&gt; “The Fed is trying to let a lot more people get out onto the dance floor before it calls ‘last call,’” she said. “Really what Powell has been saying since day one is if we take care of people on the margins and bring them back into the labor force, the rest will take care of itself.”\n*****\n&gt; Stocks were slightly lower in the past week, and Treasury yields held at lower levels. The 10-year yield, which moves opposite price, was at 1.55% Friday.\n*****\n&gt; The S&amp;P 500 was down 0.1%, ending the week at 4,180, while Nasdaq Composite was down nearly 0.3% at 14,016. The Dow was off just shy of 0.5% at 34,043.\n*****\n&gt; # Tax hike prospects\n&gt; Stocks were hit hard on Thursday when after a news report said that Biden is expected to propose a capital gains tax rate of 39.6% for people earning more than $1 million a year.\n*****\n&gt; Combined with the 3.8% net investment income tax, the new levy would more than double the long term capital gains rate of 20% or the richest Americans.\n*****\n&gt; Strategists said Biden is expected to propose raising the income tax rate for those earning more than $400,000.\n*****\n&gt; “I think a lot of people are starting to price in the risk there going to be a significant increase in both corporate and capital gains taxes,” said Lyngen.\n*****\n&gt; So far, companies have not provided much in the way of commentary on the proposed hike in corporate taxes to 28% from 21% but they have been talking about other costs.\n*****\n&gt; David Bianco, chief investment strategist for the Americas at DWS, said he expects larger companies will do better dealing with supply chain constraints than smaller ones. Big Tech is also likely to fare better during the semiconductor shortage than auto makers, which have already announced production shutdowns, he said.\n*****\n&gt; “Next week is tech week. I think we’re going to get down on our knees and just be in awe of their business models and their ability to grow at a behemoth scale,” Bianco said.\n*****\n&gt; He said he’s not in favor of Wall Street’s popular trade into cyclicals and out of growth. He still favors growth.\n*****\n&gt; “We’re overweight equities really because we’re concerned about rising interest rates,” Bianco said. “I’m not bullish in that I expect the market to rise that much from here.”\n*****\n&gt; “We stuck with growth and dug deeper into bond substitutes, utilities, staples, real estate,” he said, adding he is underweight industrials, energy and materials. “Energy is doomed. It’s being nationalized via regulation. I do like industrials, they are well-run companies, but I do think infrastructure spending expectations for classic infrastructure are too high.”\n*****\n&gt; He also said industrials are good businesses, but the stocks have become overvalued.\n*****\n&gt; Bianco said he likes big box stores, but smaller retailers are facing big challenges that were already impacting them prior to Covid. He also finds small biotech firms attractive.\n*****\n&gt; “I like healthcare stocks. Those valuations are reasonable. People have been paranoid about politicians beating on them since 1992. They manage through it and lately they’ve been delivering,” he said.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/03KqldG.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/FctG7IL.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/Iq1PKMJ.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/eegfti6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/cdNcBaJ.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/yhkNZLm.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/9js7oZJ.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/g84GywG.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/64LgRnj.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/dD0vkLd.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/LaQNKey.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/rOIVB71.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/hKlmSsP.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/Fntbm0R.png))**\n\n*****\n\n&gt; # Next Bump in Post-Election Year Rally Could Be in May\n\n&gt; As of yesterday’s close, DJIA was up 10.5% year-to-date. S&amp;P 500 was up 10.1% and NASDAQ was at 7.0%. Compared to average post-election year historical performance since 1950 graphed in the charts above and below, DJIA, S&amp;P 500 and NASDAQ are all still comfortably above past post-election year average performance for this point of the year.\n\n&gt; Due to Covid-19, 2021 so far has been more volatile than the average post-election year. Aside from larger magnitude swings in performance, we have observed the return of seasonality with choppiness in February and weakness in March following monthly options expiration. Strength this April is also aligning with historical in post-election year April strength.\n\n&gt; Historically, the next area of potential concern for the current rally is just after mid-May. This is also right around the time Q1 earnings season is beginning to wrap and focus shifts to Q2 estimates, graduations, and other early summer activities.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/6d832ea3cc4bbc31e8cfe94f03d98ac6/8e21ed4124083bdb-70/s500x750/83b3d05531a38363e7eae827dfdc65cea7df6790.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/8d8b97ef2c731be8f580e16dbe25d431/8e21ed4124083bdb-5f/s500x750/1e8a68dfbdeea8147d89c8ac91122b1b05419ecb.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/cd741bab290266df3e64e5ed52a0d7a7/8e21ed4124083bdb-b0/s500x750/6384a25868caf6c5fcfad8e452b0ae508758114a.jpg))**\n\n*****\n\n&gt; # Leading Indicators Suggest an Accelerating U.S. Economy\n\n&gt; The economic reacceleration is underway in the U.S., as the expanding vaccination campaign, lifting of mobility restrictions, and infusion of fiscal stimulus combined to lift the Conference Board’s Leading Economic Index (LEI) in March. The LEI grew 1.3% month over month, ahead of Bloomberg consensus forecasts of 1%, raising the Conference Board’s gross domestic product (GDP) expectations to 6% on a year-over-year basis.\n\n&gt; After a weaker-than-expected February release that was primarily disrupted by the winter storm, data in March snapped back in a strong fashion. All ten components of the LEI rose in March, while jobless claims were the largest contributor to the growth of the index. Labor market data has continued to improve since the measurement period, as weekly jobless claims have posted back-to-back pandemic lows. The ISM New Orders Index was the second largest contributor to the LEI, which climbed to its highest levels since 2004.\n\n&gt; The Conference Board revised the February data lower, however, snapping what was a 10-month streak of growth for the index. As shown in the LPL Chart of the Day, the LEI is back on the rise, suggesting further economic momentum in the coming months:\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.23.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; “Momentum breeds momentum, and we expect the U.S. economy will continue to improve in the coming months as we move forward with reopening plans,” noted LPL Financial Chief Market Strategist Ryan Detrick. “As the rest of the world continues to improve as well, we expect some spill-over effects to also benefit the US economy.”\n\n&gt; The U.S. is currently vaccinating around 3 million people per day, according to the Center for Disease Control (CDC), and over half of the adult population has received at least one dose of the vaccine. Meanwhile, over 80% of the population above the age of 65—the most at-risk age segment of the population—has received at least one dose of the vaccine. The improving vaccination data has helped embolden policymakers to lift restrictions, and prompted us to upgrade our GDP forecast for the U.S. to 6.25-6.75% in our recent Weekly Market Commentary.\n\n*****\n\n&gt; # What Happens After The First Rate Hike?\n\n&gt; “Don’t fight the Fed.” Old investment saying\n\n&gt; One of the popular questions we’ve received lately is what do stocks do after the first rate hike? Let’s be clear, we think the Federal Reserve Bank (Fed) will leave rates low until at least 2023, but what if we get a sudden dose of inflation? This isn’t our base case, but a rate hike could potentially happen sooner in that situation.\n\n&gt; After all, the first rate hike in 2015 set off a huge sell-off into early February 2016, as the market was quite upset and let it be known that it felt the Fed acted too soon. In fact, the first hikes of 2004 and 1999 also saw losses the first three months after the first hike, but eventually stocks were in the green a year later.\n\n&gt; “The first hike in recent cycles has indeed brought with it some selling pressure, but hikes usually take place in strong economies, so it isn’t surprising to see returns turn green once you go further out,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But let’s not sound any alarms yet, we don’t see a rate hike for a couple of years. Still, it’s good to know what the playbook could be once it happens.”\n\n&gt; As shown in the LPL Chart of the Day, that initial rate hike can cause some hiccups the first three months, but returns turn much better 6- and 12-months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.21.21-Blog-Chart-1.png?ssl=1)**\n\n*****\n\n&gt; # Twin Deficits and the US Dollar\n\n&gt; It was a particularly challenging year for the greenback in 2020, where the world’s reserve currency acted as a “safe haven” asset at the height of the March 2020 market volatility, only to fall over the remainder of the year. With the U.S. outpacing much of the developed world in economic growth in 2021, Treasury yields have been rising and the dollar has strengthened, bucking the consensus view for dollar weakness.\n\n&gt; We view the “twin deficits” of the U.S. economy—the combination of the budget deficit and the current account deficit—as a long-term structural driver of a weaker U.S. dollar. As a historical net importer, the U.S. has usually carried a trade deficit (leading to a broader current account deficit in the process), while the flood of pandemic aid has stretched the budget deficit and ballooned the sum of the twin deficits to all-time lows as a percent of gross domestic product (GDP). As shown in the LPL Chart of the Day, changes in the twin deficits have been a relatively accurate predictor in the long-term trend of the value of the US dollar:\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.22.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; With the twin deficits reaching all-time lows, it’s hard to be bullish the US dollar over the long-term relative to its major counterparts. “The short-dollar trade has certainly been a frustrating one for investors this year, but the long-term trend continues to point lower,” added LPL Financial Chief Market Strategist Ryan Detrick. “However, a counter-trend rally like we saw in the first quarter might have been enough to flush out some of the crowded consensus for a lower dollar.”\n\n&gt; U.S. economic growth has outpaced our developed nation counterparts to begin 2021, but expectations for growth in the rest of the world may be playing catch up. In particular, the 30-year German bund yield broke out to its highest level since the onset of the pandemic, suggesting growth expectations for one of our major trade partners may be on the rise.\n\n&gt; A soft dollar has a variety of investment implications. While we continue to favor U.S. stock market exposure over developed international markets, investments overseas may benefit from the tailwind of the softer dollar. Meanwhile, commodities have historically benefitted from a weaker dollar, and may be positioned for further upside as economic activity in the rest of the world heats up. For more on our tactical market views, check out our April Global Portfolio Strategy.\n\n*****\n\n&gt; # Dips in Short Supply\n\n&gt; While many areas of the market have seen sizable pullbacks this year, the broader market has been stingier. Just this morning, a client was lamenting the fact that they had a decent amount of cash, but the market just wasn't providing opportunities to get in. So far this year, the S&amp;P 500's largest decline from a peak (on a closing basis) has been 4.23%, and given that we're not even four full months into the year, we initially thought that 4% seemed normal enough especially when the earlier months of the year tend to be positive.\n\n&gt; In order to see how this year stacks up to prior years, the chart below shows the duration into each year (on a percentage basis) that the S&amp;P 500 first closed down 5% or more from its YTD peak. Years in green indicate that there wasn't a single point in the entire year that the S&amp;P 500 experienced a 5% decline. The last occurrence was in 2017, and there have been a total of seven years since 1928. As we near the end of April, we're nearly a third of the way into 2021, and compared to the 'average' year, we've already gone longer without a 5% pullback. Since 1928, the S&amp;P 500 usually experiences its first 5%+ pullback 28% of the way into the year, which coincidentally enough works out to April 15th - the day before Federal taxes are typically due! In fact, at this point in prior years, the S&amp;P 500 has already experienced its first 5%+ pullback more than 65% of the time. Believe it or not, in 30% of all years since 1928 the first 5% drop occurred in the month of January.\n\n&gt; Based on prior years, the market to this point has in fact been stingy in terms of providing opportunities for investors to add exposure, although based on today's reports of new capital gains tax increases from the Biden Administration, that window may soon open.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/042221-5-Pullbacks.png))**\n\n*****\n\n&gt; # What is a 200-Day Moving Average Again?\n\n&gt; If we've learned anything over the last two trading days after what seemed like a one-way move higher for the S&amp;P 500, it is that equities can also go down. Even after the declines of the last couple of days, though, the S&amp;P 500 still remains close to 4% above its 50-day moving average (DMA) and more than 10% above its 200-DMA. While there have been a handful of days since the COVID lows where the S&amp;P 500 has dipped below its 50-DMA, there hasn't been a single day since last June where the S&amp;P 500 came even close to testing its 200-DMA. We're only in late April now, but as long as the S&amp;P 500 doesn't see a significant fall in the next two months, it has the potential to go a full year without closing below its 200-DMA. When the 200-DMA does finally come into play again, many investors may not recognize what it is.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/042021-SP-500.png))**\n\n&gt; The chart below shows the percentage of time over a rolling one-year period that the S&amp;P 500 traded above its 200-DMA. At 89% now, the current level is hardly remarkable by historical standards. Right before the COVID crash last year, the percentage reached as high as 97.6%, and three years ago in March 2018, it was up at 100%. What is remarkable about the chart, though, is how elevated this moving average has been for so long. The last time it was below 50% was back in December 2009!\n\n&gt; It's easy to tell by looking at the chart, but thanks to short and swift pullbacks in the post-financial crisis period, this current streak without a sub-50% reading is the longest on record. To put a little more meat on the example, after the current streak of nearly 11.5 years, the next longest streak stretched over a period of just under ten years spanning from April 1991 through March 2001 while the one behind that was less than five years (ending in May 2008). And you only thought the market had been defying gravity recently!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/042021-Above-200-DMA.png))**\n\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending April 23rd, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=zVSgvKq0pQw))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 4.25.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=lNEOWj2EubI))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$AAPL** \n&gt; * **$TSLA** \n&gt; * **$AMD** \n&gt; * **$AMZN** \n&gt; * **$MSFT** \n&gt; * **$FB** \n&gt; * **$NIO** \n&gt; * **$BA** \n&gt; * **$UPS** \n&gt; * **$PINS** \n&gt; * **$GE** \n&gt; * **$SHOP** \n&gt; * **$GOOGL** \n&gt; * **$QCOM** \n&gt; * **$XOM** \n&gt; * **$F** \n&gt; * **$MMM** \n&gt; * **$ABBV** \n&gt; * **$ACI** \n&gt; * **$TWTR** \n&gt; * **$X** \n&gt; * **$SPOT** \n&gt; * **$TDOC** \n&gt; * **$CL** \n&gt; * **$V** \n&gt; * **$CAT** \n&gt; * **$LLY** \n&gt; * **$ENPH** \n&gt; * **$SAND** \n&gt; * **$OTIS** \n&gt; * **$SWKS** \n&gt; * **$CROX** \n&gt; * **$MRK** \n&gt; * **$RTX** \n&gt; * **$MCD** \n&gt; * **$SBUX** \n&gt; * **$OSTK** \n&gt; * **$BP** \n&gt; * **$NXPI** \n&gt; * **$DPZ** \n&gt; * **$BMY** \n&gt; * **$MA** \n&gt; * **$GLW** \n&gt; * **$CHKP**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/dD0vkLd.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/tcxvmqm.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/hcAO3Gz.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR THE NEXT FEW WEEKS!](https://i.imgur.com/IAo7GlZ.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR XLF COMPANIES FOR THE NEXT FEW WEEKS!](https://i.imgur.com/j0DqRRh.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR XLK COMPANIES FOR THE NEXT FEW WEEKS!](https://i.imgur.com/mnzxCHb.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR XLV COMPANIES FOR THE NEXT FEW WEEKS!](https://i.imgur.com/08xmiRX.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR XLI COMPANIES FOR THE NEXT FEW WEEKS!](https://i.imgur.com/YpSjzzQ.jpg))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 4.26.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/CSjyM5z.png))\n\n&gt; # ***Monday 4.26.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/5f8y7hV.png))\n\n*****\n\n&gt; # ***Tuesday  4.27.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/oiJIwAm.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/HBIDjE9.png))\n\n&gt; # ***Tuesday 4.27.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/ROeEsDZ.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/ULBdPab.png))\n\n*****\n\n&gt; # ***Wednesday 4.28.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/vMsmAhL.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/rmljNNP.png))\n\n&gt; # ***Wednesday 4.28.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/RDE1FuX.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/yNRtL7R.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/SVlEwKR.png))\n\n*****\n\n&gt; # ***Thursday 4.29.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/4agD6a7.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/e1ex0sZ.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/J6Nw60b.png))\n\n&gt; # ***Thursday 4.29.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/VvVoXXd.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/bBCcQ78.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/HmfBR4U.png))\n\n*****\n\n&gt; # ***Friday 4.30.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/kc3V6fB.png))\n\n*****\n\n&gt; # ***Friday 4.30.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/t7kDKVf.png))\n\n*****\n\n&gt; # Apple, Inc. $134.32\n**Apple, Inc. (AAPL)** is confirmed to report earnings at approximately 4:30 PM ET on Wednesday, April 28, 2021. The consensus earnings estimate is $0.99 per share on revenue of $77.06 billion and the Earnings Whisper ® number is $1.08 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 55.29% with revenue increasing by 32.15%. Short interest has increased by 1.6% since the company's last earnings release while the stock has drifted lower by 3.7% from its open following the earnings release to be 11.1% above its 200 day moving average of $120.93. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, April 8, 2021 there was some notable buying of 49,660 contracts of the $140.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Tesla, Inc. $729.40\n**Tesla, Inc. (TSLA)** is confirmed to report earnings at approximately 4:10 PM ET on Monday, April 26, 2021. The consensus earnings estimate is $0.78 per share on revenue of $10.24 billion and the Earnings Whisper ® number is $0.86 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 248.21% with revenue increasing by 71.09%. Short interest has decreased by 17.9% since the company's last earnings release while the stock has drifted lower by 11.0% from its open following the earnings release to be 31.5% above its 200 day moving average of $554.56. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, April 19, 2021 there was some notable buying of 25,000 contracts of the $1,030.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 8.1% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Advanced Micro Devices, Inc. $82.76\n**Advanced Micro Devices, Inc. (AMD)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, April 27, 2021. The consensus earnings estimate is $0.44 per share on revenue of $3.21 billion and the Earnings Whisper ® number is $0.47 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 144.44% with revenue increasing by 79.73%. Short interest has increased by 34.4% since the company's last earnings release while the stock has drifted lower by 9.2% from its open following the earnings release to be 0.2% above its 200 day moving average of $82.58. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, April 12, 2021 there was some notable buying of 41,267 contracts of the $80.00 call and 39,182 contracts of the $80.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Amazon.com, Inc. -\n**Amazon.com, Inc. (AMZN)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, April 29, 2021. The consensus earnings estimate is $9.65 per share on revenue of $104.41 billion and the Earnings Whisper ® number is $11.56 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 92.61% with revenue increasing by 38.38%. Short interest has increased by 61.1% since the company's last earnings release while the stock has drifted lower by 2.5% from its open following the earnings release to be 5.3% above its 200 day moving average of $3,172.75. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, April 22, 2021 there was some notable buying of 8,119 contracts of the $3,400.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Microsoft Corp. $261.15\n**Microsoft Corp. (MSFT)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, April 27, 2021. The consensus earnings estimate is $1.76 per share on revenue of $41.03 billion and the Earnings Whisper ® number is $1.86 per share. Investor sentiment going into the company's earnings release has 85% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.71% with revenue increasing by 17.16%. Short interest has increased by 23.5% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 17.2% above its 200 day moving average of $222.86. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, April 20, 2021 there was some notable buying of 9,063 contracts of the $265.00 call expiring on Friday, July 16, 2021. Option traders are pricing in a 3.6% move on earnings and the stock has averaged a 2.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Facebook Inc. $301.13\n**Facebook Inc. (FB)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, April 28, 2021. The consensus earnings estimate is $2.36 per share on revenue of $23.53 billion and the Earnings Whisper ® number is $2.68 per share. Investor sentiment going into the company's earnings release has 84% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 38.01% with revenue increasing by 32.66%. The stock has drifted higher by 8.6% from its open following the earnings release to be 11.7% above its 200 day moving average of $269.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, April 14, 2021 there was some notable buying of 18,839 contracts of the $310.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 5.9% move on earnings and the stock has averaged a 5.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # NIO Inc. $41.08\n**NIO Inc. (NIO)** is confirmed to report earnings at approximately 5:00 PM ET on Thursday, April 29, 2021. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Short interest has increased by 27.8% since the company's last earnings release while the stock has drifted lower by 10.9% from its open following the earnings release to be 15.8% above its 200 day moving average of $35.47. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, April 22, 2021 there was some notable buying of 32,398 contracts of the $40.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 9.6% move on earnings and the stock has averaged a 17.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NIO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Boeing Co. $238.38\n**Boeing Co. (BA)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, April 28, 2021. The consensus estimate is for a loss of $1.17 per share on revenue of $15.41 billion. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 31.18% with revenue decreasing by 8.86%. Short interest has decreased by 9.0% since the company's last earnings release while the stock has drifted higher by 21.1% from its open following the earnings release to be 20.2% above its 200 day moving average of $198.38. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, April 6, 2021 there was some notable buying of 17,621 contracts of the $250.00 call and 17,205 contracts of the $250.00 put expiring on Friday, May 21, 2021. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 3.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # nited Parcel Service, Inc. $178.96\n**United Parcel Service, Inc. (UPS)** is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, April 27, 2021. The consensus earnings estimate is $1.63 per share on revenue of $20.47 billion and the Earnings Whisper ® number is $2.03 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 41.74% with revenue increasing by 13.50%. Short interest has increased by 32.9% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 11.3% above its 200 day moving average of $160.74. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, April 6, 2021 there was some notable buying of 14,036 contracts of the $190.00 call expiring on Friday, June 18, 2021. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 6.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UPS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Pinterest, Inc. $74.99\n**Pinterest, Inc. (PINS)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, April 27, 2021. The consensus earnings estimate is $0.08 per share on revenue of $472.67 million and the Earnings Whisper ® number is $0.13 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for revenue of approximately $469.00 million. Consensus estiamtes are for year-over-year revenue growth of 73.81%. The stock has drifted lower by 13.0% from its open following the earnings release to be 29.5% above its 200 day moving average of $57.90. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, April 15, 2021 there was some notable buying of 7,454 contracts of the $90.00 call expiring on Friday, May 21, 2021. Option traders are pricing in a 13.2% move on earnings and the stock has averaged a 18.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PINS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning April 26th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/mxmc9e/wall_street_week_ahead_for_the_trading_week/",
        "created": 1619307390.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619642291,
        "id": "n0o82a",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, April 28, 2021**\n\nThe stock market fell on Wednesday, with all three major indexes closing modestly red as market participants continue to digest the corporate earnings season and new commentary from the Federal Open Markets Committee. \n\nThe FOMC said the effective distribution of the vaccine in the US has improved economic conditions but reiterated interest rates will remain near-zero and the asset purchasing program in place. The Fed said, “Amid progress and strong policy support, indicators of economic activity and employment have risen.” The committee remains optimistic about the rebound in economic activity, describing the most affected sectors as “having shown improvement”, but shows no signs of slowing quantitative easing or raising interest rates. With more than 8 million people still out of jobs compared to pre-pandemic levels, FOMC reiterated its commitment to supporting the economy.\n\nThe Fed also said inflation has “risen” but attributed the higher readings to “transitory factors”, meaning they expect any rise in inflationary pressures to be short-lived. Central bank officials warn that higher inflation reading could be coming as a result of measuring year-over-year changes from a highly unusual 2020. In other words, The Fed looks at changes in prices in a year-over-year format. Data for March and April of this year could therefore reflect large price “increases” because they are being compared against March and April in 2020 that saw massive price drops. \n\nEconomic data published since the Fed’s last meeting in March 17 have largely supported their brighter outlook. Consumer spending surged 9.8% in March and initial jobless claims dropped to pandemic-era lows as more states continue reopening measures. In other news, according to a report by the Conference Board, consumer confidence has surged to a 14-month high in April as effective distribution of the vaccine and easing of social distancing guidelines in the US allows for the economy to gradually reopen. The Conference Board's monthly consumer confidence index jumped to a reading of 121.7 in April, or well above the 113.0 expected. Lynn Franco, senior director of economic indicators at the Conference Board, said in a statement, “Consumers’ assessment of current conditions improved significantly in April, suggesting the economic recovery strengthened further in early Q2. Consumers’ optimism about the short-term outlook held steady this month. Consumers were more upbeat about their income prospects, perhaps due to the improving job market and the recent round of stimulus checks.”\n\n**Highlights**\n\n* The US trade deficit rose to a new record high in March, according to data from the Department of Commerce. The deficit increased by 4% to $90.6 billion, higher than the $88 expected by economists\n* Mortgage applications fell 2.5% week-on-week, according to the Mortgage Bankers Association. This follows a jump of 8.6% last week, which had marked the first rise in seven weeks. \n* A deep-sea mining robot on test mission to bring up rocks rich in cobalt and nickel from the floor of the Pacific Ocean has malfunctioned and is lost.\n* According to multiple reports, Nio began development on more affordable SUV to cater for the mid to low price markets and is also working on an upgraded 70 kilowatt-hour battery pack using lithium-iron phosphate batteries, which are cheaper than the ones the company uses now\n* Nio said in a tweet from its official handle that its global vision is gaining steam and the company is making plans to expand to Norway as part of its plan to expand into Europe. Press Conference on May 6th at 1 am PDT \n* The European Union fined Credit Suisse Group AG, Bank of America Corp. and Credit Agricole SA a small amount for illegally colluding on trades in government bond markets at the expense of their clients.\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Advanced Auto Parts (AAP) target raised by Wedbush from $210 to $230 at Outperform. Stock currently around $197\n* AMD with two target raises. Stock currently around $85\n   * \\- Raymond James from $100 to $110 at Outperform\n   * Susquehanna from $115 to $125 at Positive\n* Boyd Gaming (BYD) with two target raises. Stock currently around $69\n   * Deutsche Bank from $71 to $77 Buy\n   * Morgan Stanley (MS) from $66 to $78 at Overweight\n* Capital One (COF) with a host of target raises. Consensus price target $165 at Outperform. Stock currently around $139\n* Crocs (CROX) target raised by Robert W Baird from $100 to $135 at Outperform. Stock currently around $98\n* EA target raised by KeyCorp from $165 to $170 at Overweight. Stock currently around $143\n* F5 Networks (FFIV) target raised by Needham &amp; Co from $245 to $255 at Buy. Stock currently around $205\n* Alphabet (GOOG, $GOOGL) with a host of target raises. Consensus price target $2850 at Buy. Stock currently around $2290\n* Lam Research (LRCX) with a host of target raises. Consensus price target $730 at Buy. Stock currently around $645\n* Microsoft (MSFT) with a host of target raises. Consensus price target $300 at Outperform. Stock currently around $262\n* Signature Bank (SBNY) with two target raises. Stock currently around $252\n   * Wedbush from $280 to $305 at Outperform\n   * Raymond James from $290 to $300 at Strong-Buy\n* Tesla (TSLA) target raised by Morgan Stanley to $900 at Overweight. Stock currently around $704\n* Visa (V) with a host of target raises. Consensus price target $265 at Outperform. Stock currently around $230\n* NXP Semiconductors (NXPI) with a host of target raises. Consensus price target $230 at Outperform. Stock currently around $203\n\n“To bear trials with a calm mind robs misfortune of its strength and burden.\" - Seneca",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Wednesday, April 28, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/n0o82a/here_is_a_market_recap_for_today_wednesday_april/",
        "created": 1619671091.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619124606,
        "id": "mwegvb",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, April 22, 2021**\n\nStocks fell on Thursday, erasing yesterday’s gains as market volatility continues. Stocks fell after Bloomberg reported that President Biden would propose increasing the capital gains tax rate on wealthy individuals. The S&amp;P 500 (SPY) closed 0.91% down, the Dow Jones (DIA) closed 0.94% and the tech-heavy Nasdaq (QQQ) fell 1.21%.\n\nAccording to a report by [Bloomberg](https://www.bloomberg.com/news/articles/2021-04-22/biden-to-propose-capital-gains-tax-as-high-as-43-4-for-wealthy), President Biden will propose almost doubling the capital gains tax rate for wealthy individuals earning $1 million or more per year to 39.6% to help pay for a slew of social programs and the proposed infrastructure bill. The new marginal 39.6% rate would be an increase from the current base rate of 20%, the people said on the condition of anonymity because the plan is not yet public. The proposal could reverse a long-standing provision of the tax code that taxes returns on investment lower than on labor/salary. \n\nCorporate earnings have so far exceeded Wall Street’s even lofty expectations, as companies benefited from both a surge in consumer spending as the economy opens back up and cost-cutting measures implemented during the height of the pandemic.  However, despite the largely positive earnings, many stocks have failed to react positively to the news. It seems as more positive economic data is released in terms of consumer spending and unemployment, it takes more and more impressive results to convince investors to pile into the stock. This suggests there is froth in the markets given the sky-high valuation of some companies, in our opinion.\n\nJim Caron, investment management fixed income portfolio manager at Morgan Stanley (MS) said, “What we have is the absence of a catalyst. Everything that we’ve done over the last twelve months has been to build up to this point, to get this recovery, to get a very, very strong second-quarter GDP, which we think could be upwards of 10%. But after that, things start to slow down. It doesn’t mean that the data gets bad, it just means on a relative basis that the third quarter will be weaker than the second quarter and the fourth quarter may be weaker than the third quarter.”\n\n**Highlights**\n\n* Two U.S. senators have expressed concern about what they said may be an emerging pattern of safety concerns involving Tesla Inc. vehicles in the wake of a fatal crash in Texas.\n* Square (SQ) announced that it plans to make new inventory-management features available to its sellers.The company is rolling out tools that help sellers automate their inventory-management processes by using barcode scanners to take stock of inventory and receiving alerts driven by machine learning to see when an item is due to run out.\n* Amazon-backed home technology solutions provider SmartRent.com Inc said on Thursday it had agreed to go public through a merger with a blank-check firm, valuing the equity of the combined company at around $2.2 billion.\n* The White House announced more than 200 million doses of the coronavirus vaccine have been distributed in the US, greatly surpassing original estimates of 100 million doses delivered in the first 100 days of Biden’s presidency. On the back of this robust distribution, all states are beginning to open back up.\n* Mortgage applications jumped 8.6% in the week ended April 16, marking the biggest jump since late January as mortgage rates pulled back following a surge, according to the Mortgage Bankers Association (MBA). \n* Ford Motor (F) is planning more downtime at five North American factories due to a global semiconductor shortage. \n* **\\*\\*Please note that current stock price was written in the morning and does not reflect current stock price\\*\\***\n* Twitter (TWTR) target raised by Argus from $72 to $82 at Buy. Stock currently around $65\n* Las Vegas Sands (LVS) target raised by Credit Suisse from $58 to $69 at Outperform. Stock currently around $58\n* Lam Research (LRCX) with a host of target raises. Consensus price target around $775 at Overweight. Stock currently around $615\n* Equifax (EFX) target raised by Needham &amp; Co from $215 to $260 at Buy. Stock currently around $221\n* Discover Financial Services (DFS) target raised by Morgan Stanley (MS) from $108 to $114 at Equal-Weight. Stock currently around $99\n* NXP Semiconductors (NXPI) target raised by Oppernheimer from $210 to $235 at Outpeform. Stock currently around $196\n* Facebook (FB) target raised by Jefferies Financial Group from $350 to $360 at Buy. Stock currently around $296\n* Chipotle (CMG) with a host of target raises after a strong earnings report. Consensus price target around $1700 at Outperform. Stock currently around $1479\n\n“All our dreams can come true, if we have the courage to pursue them.” - Walt Disney",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, April 22, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mwegvb/here_is_a_market_recap_for_today_thursday_april/",
        "created": 1619153406.0
    },
    {
        "author": "PerennialSynergy",
        "created_utc": 1618938373,
        "id": "muv3bz",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "$ON: our favorite semiconductor name, sporting a bullish butterfly harmonic; entry, targets, and stop loss are all provided on my chart. We entered long here at 39.60. ______________________________________ //Relevant Tags: $DJI $SPX $SPY $ES $NDX $QQQ $NQ $VIX $SMH $NXPI //",
        "url": "https://i.redd.it/ru0pz54g1du61.jpg",
        "created": 1618967173.0
    },
    {
        "author": "LuigiC173",
        "created_utc": 1619802805,
        "id": "n1yj5i",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "As it falls towards 190/share is this a good one to get in on? Chip shortage yes but I assume in time that ends and they rise again. I have enough to buy five shares, would they be worth a long term hold? Just recently took some gains so looking to reinvest.",
        "subreddit": "stocks",
        "title": "NXPI, Time to Buy?",
        "url": "https://www.reddit.com/r/stocks/comments/n1yj5i/nxpi_time_to_buy/",
        "created": 1619831605.0
    },
    {
        "author": "PorscheBoxsterS",
        "created_utc": 1619383257,
        "id": "myh3nk",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "What do you all think of companies like Infineon/NXP/ST micro electronics/Texas Instruments, etc.?\n\n&amp;#x200B;\n\nPremise: A future of electric power: solar, wind, electric cars, and more control automation should increase the rate of demand for power electronics like inverters, mosfets, hi reliability switches, and other power modules.\n\n&amp;#x200B;\n\n* EV's use 3-5x as much power electronics as gasoline powered vehicles. These things go into everything from HVAC controls to the battery management system, and of course a massive (and expensive) inverter.\n* GaN and SiC tech has been long awaited to increase the efficiency of any electrical device, whether it is the generators on a wind turbine or the inverters for a solar panel (Enphase - Infineon DC/AC converters).\n* Data centers - new process GaN devices offer a 5-10% improvement in power efficiency compared to older tech power supplies.\n* EV charging stations - industrial grade HiRel power switching electronics required with smart controller modules.\n* Aerospace - with the boom in microsatellites and orbital projects, wouldn't we also need radhard HiRel power electronics modules as well?\n\n&amp;#x200B;\n\nWhat do you all think? Should we buy into some of these in addition to the traditional semiconductor market we all know about (logic chips like Intel,Nvidia/AMD,etc.)? \n\n&amp;#x200B;\n\n[Infineon Stock Chart - Leader in Power Electronics Segment](https://finance.yahoo.com/quote/ifnny/) Also, they have a new fab which is opening up in 2 months, which should allow them to quickly supply product at the currently inflated shortage prices. They seem to be like the Intel (IDM) for the power electronics sector.",
        "subreddit": "investing",
        "title": "Power Semiconductors - Their Future In A Clean Energy World",
        "url": "https://www.reddit.com/r/investing/comments/myh3nk/power_semiconductors_their_future_in_a_clean/",
        "created": 1619412057.0
    },
    {
        "author": "Ironleg01",
        "created_utc": 1619360671,
        "id": "my9bmu",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Source: \\[domain name\\]/article/4421118-wall-street-breakfast-week-ahead (cannot link SA articles)\n\n# Economic reports in the week ahead\n\n* Earnings  reports will dominate the action next week even as investors keep a  watch for any developments with an infrastructure package or capital  gains tax announcement. Conference calls from Tesla (NASDAQ:TSLA), Boeing (NYSE:BA) and AMD (NASDAQ:AMD)  will be of high interest. Economic reports due in the week ahead  include updates on durable goods orders, pending home sales and GDP.\n* Earnings season heats up in a big way with reports due in from Albertsons (NYSE:ACI), Tesla (TSLA) and NXP Semi (NASDAQ:NXPI) on April 26; BP (NYSE:BP), UPS (NYSE:UPS), General Electric (NYSE:GE), Alphabet (NASDAQ:GOOG), Microsoft (OTCPK:MFST) and Starbucks (NASDAQ:SBUX) on April 27; Humana (NYSE:HUM), Boeing (BA), Apple (NASDAQ:AAPL), Ford (NYSE:F), Qualcomm (NASDAQ:QCOM) and General Dynamics (NYSE:GD) on April 28; Comcast (NASDAQ:CMCSA), Merck (NYSE:MRK), Caterpillar (NYSE:CAT), Northrop Grumman (NYSE:NOC), Amazon (NASDAQ:AMZN), Nio (NYSE:NIO) and U.S. Steel (NYSE:X) on April 29; as well as Exxon Mobil (NYSE:XOM), Chevron (NYSE:CVX) and AbbVie (NYSE:ABBV) on April 30.\n* The latest vibe from Wall Street analysts is that Tesla (TSLA)  has a good chance to top consensus estimates for Q1 revenue of $10.5B  and EPS of $0.75 after factoring in the strong Q1 delivery numbers.  \"While Tesla has navigated a myriad of Chinese government PR issues,  chip shortages, and a further spotlight on its auto pilot safety record  (given the Texas crash) over the past month, the Street is now laser  focused on gauging the annual delivery trajectory for 2021,\" previews  analyst Dan Ives. The conference call set for April 26 at 4:30 p.m.  takes on some added significance with the news flow working against  Tesla over the last week.\n* Apple (AAPL)  is seen generating revenue of $77B and EPS of $0.98 in Q1. Analysts are  watching for indications that the company's strong services sales  growth has continued in Q2 quarter and that the pandemic boost in demand  for iPads and Macs has continued. Apple is also expected to increase  its dividend payout and boost its buyback allowance. After Apple turns  the page on Q1, investors will start looking to analyze how the iPhone  13 launch will factor in to the back half of the year.\n* Microsoft (NASDAQ:MSFT)  is tipped by Wedbush Securities for another beat and raise quarter. \"We  strongly believe the tide is shifting in the cloud arms race as  Microsoft should deliver a \\~45% Azure growth number this quarter and is  clearly taking market share vs. AWS based on our analysis. While we have  seen the momentum of this backdrop in the last few quarters, we believe  deal flow looks strong heading into the rest of FY21 and FY22 as we  estimate that Microsoft in particular is still only \\~35% through  penetrating its unparalleled installed base on the cloud transition,\"  updates analyst Dan Ives.\n* IPOs expected to start trading next week include FTC Solar (FTCI) on April 28 and both Endeavor Group (NYSE:EDR) and Fortegra Group (FRF) on April 29. IPO lockup periods are set to expire next week on Root (NASDAQ:ROOT), MediaAlpha (NYSE:MAX), Gatos Silver (NYSE:GATO), Biodesxi (NASDAQ:BDSX), Leslie's (NASDAQ:LESL), Allegro MicroSystems (NASDAQ:ALGM), Lufax Holding (NYSE:LU), Atea Pharmaceuticals (NASDAQ:AVIR), SQZ Biotechnologies (NYSE:SQZ) and Galecto (NASDAQ:GLTO). The quiet period expires on Frontier (NASDAQ:ULCC), Coursera (NYSE:COUR), Compass (NYSE:COMP), Karooooo (NASDAQ:KARO) and Smart Share (NASDAQ:EM).\n* **Projected dividend increases (quarterly):** Expected dividend hikes for next week include Masco (NYSE:MAS) to $0.235 from $0.14, St Joe (NYSE:JOE) to $0.09 from $0.08, Tetra Tech (NYSE:TTI) $0.19 from $0.17, American Water (NYSE:AWK) to $0.60 from $0.55, Comfort Systems USA (NYSE:FIX) to $0.125 from $0.115, Ameriprise Financial (NYSE:AMP) to $1.11 from $1.04, Invesco (NYSE:IVZ) to $0.165 from $0.155, HP Enterprise (NYSE:HPE) to $0.1275 from $0.12 and Apple (AAPL) to $0.2175 from $0.205. \n* On  the topic of dividends, UBS ran a deep screen for some dividend  favorites. A list of 16 stocks was generated based off a filter of  Buy-rated stocks with three-year dividend growth rate forecast at least  at a high single digit rate, with a current dividend yield that beats  the S&amp;P's yield, sustainable payout ratios and sitting with more  than 10% potential upside to price targets. On that list the fastest  dividend growth was projected for Barrick (**NYSE:****GOLD**), East West Bancorp (**NASDAQ:****EWBC**), and Royalty Pharma (**NASDAQ:****RPRX**) and the lowest payout ratios (suggesting the greatest ability to pay) were at Sealed Air (**NYSE:****SEE**), Royalty Pharma (**RPRX**) and East West Bancorp (**EWBC**). The highest yielding names in the screen included Merck (**MRK**), American Electric Power (**NASDAQ:****AEP**) and Sempra (**NYSE:****SRE**).\n* A pre-hearing conference will by held by the New Mexico Public Regulation Commission in regard to the PNM Resources (NYSE:PNM)-Avangrid (NYSE:AGR) merger. The companies have already landed several different approvals include from FERC. CoreLogic (NYSE:CLGX) shareholders vote on the buyout offer from Stone Point on April 28. Cooper Tire &amp; Rubber (NYSE:CTB) shareholders vote on the Goodyear Tire &amp; Rubber (NASDAQ:GT) merger on April 30. FactSet Research (NYSE:FDS) trades with takeover rumors swirling around it.\n* I-Mab (NASDAQ:IMAB) hosts its 2021 R&amp;D Day on April 26. Executives from Facebook (NASDAQ:FB), Twitter (NYSE:TWTR) and YouTube (GOOG) testify in front of a Senate Judiciary hearing covering algorithmic amplification on April 27. Atlassian (NASDAQ:TEAM)  Co-CEO and founder Mike Cannon-Brookes gives a talk at the company's  Team 21 event on April 28 that it hopes will draw attention to the  company's new innovations. \n* Wayfair (NYSE:W)  holds its two-day deals event on April 28-29. The Way Day shopping  event includes deals and promotions on best-selling items across the  whole home including furnishings, decor, housewares, home improvement  products, major appliances, outdoor and more. Shares of Wayfair are up  41% YTD and 232% over the last 52 weeks. \n* The NFL draft begins  the evening of April 29 and is a bettable event in more states than ever  as legislation continues to advance in more states. New Gatorade  (NASDAQ:PEP)  endorser Trevor Lawrence is expected to go the Jacksonville Jaguars as  the number one overall pick. The draft follows a big week for sports  betting/iGaming stocks like DraftKings (NASDAQ:DKNG) and Penn National Gaming after BetMGM's investor event pushed up expectations for the total addressable market.",
        "subreddit": "stocks",
        "title": "Wall Street Breakfast: The Week Ahead",
        "url": "https://www.reddit.com/r/stocks/comments/my9bmu/wall_street_breakfast_the_week_ahead/",
        "created": 1619389471.0
    },
    {
        "author": "TEXzLIB",
        "created_utc": 1619383493,
        "id": "myh6m9",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " \n\nCompanies like Infineon/NXP/ST micro electronics/Texas Instruments just for discussion.\n\nPremise: A future of electric power: solar, wind, electric cars, and more control automation should increase the rate of demand for power electronics like inverters, mosfets, hi reliability switches, and other power modules.\n\n* EV's use 2-3x as much power electronics as gasoline powered vehicles. These things go into everything from HVAC controls to the battery management system, and of course a massive (and expensive) inverter.\n* GaN and SiC tech has been long awaited to increase the efficiency of any electrical device, whether it is the generators on a wind turbine or the inverters for a solar panel (Enphase - Infineon DC/AC converters) or even the charging plugs for your phone or laptop.\n* Data centers - new process GaN devices offer a 5-10% improvement in power efficiency compared to older tech power supplies.\n* EV charging stations - industrial grade HiRel power switching electronics required with smart controller modules.\n* Aerospace - with the boom in microsatellites and orbital projects, wouldn't we also need radhard HiRel power electronics modules as well (these products have fat profit margins too)?\n\nWhat do you all think? Should we buy into some of these in addition to the traditional semiconductor market we all know about (logic chips like Intel,Nvidia/AMD,etc.)?\n\n[Infineon Stock Chart - Leader in Power Electronics Segment](https://finance.yahoo.com/quote/ifnny/) Also, they have a new fab which is opening up in 2 months, which should allow them to quickly supply product at the currently inflated shortage prices. They seem to be like the Intel (IDM) for the power electronics sector.",
        "subreddit": "investing",
        "title": "Power Semiconductors - Their Future In An Electrical World",
        "url": "https://www.reddit.com/r/investing/comments/myh6m9/power_semiconductors_their_future_in_an/",
        "created": 1619412293.0
    },
    {
        "author": "MarioFurbo",
        "created_utc": 1617320813,
        "id": "mi86dc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Not expecting strike being met. Hoping to flip them. \nXOM 66C 4/23\nNXPI 260C 4/16\nMRO 16.50 4/23\nTSM 175C 5/23",
        "subreddit": "options",
        "title": "Any potential here",
        "url": "https://www.reddit.com/r/options/comments/mi86dc/any_potential_here/",
        "created": 1617349613.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1619278419,
        "id": "mxmab7",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning April 26th, 2021.\n\n# **Taxes and inflation will be key themes for markets in the week ahead - [(Source)](https://www.cnbc.com/2021/04/23/taxes-and-inflation-will-be-key-themes-for-markets-in-the-week-ahead.html)**\n*****\n&gt; The final week of April is going to be a busy one for markets with a Federal Reserve meeting and a deluge of earnings news.\n*****\n&gt; Hot topics in markets will continue to be inflation and taxes.\n*****\n&gt; President Joe Biden is expected to detail his “American Families Plan” and the tax increases to pay for it, including a much higher capital gains tax for the wealthy. The plan is the second part of his Build Back Better agenda and will include new spending proposals aimed at helping families. The president addresses a joint session of Congress Wednesday evening.\n*****\n&gt; It’s a huge week for earnings with about a third of the S&amp;P 500 reporting, including Big Tech names, such as Apple, Microsoft, Alphabet and Amazon.\n*****\n&gt; As many have already done, firms like Boeing, Ford, Caterpillar and McDonald’s, are likely to detail cost pressures they are facing from rising materials and transportation costs and supply chain disruptions.\n*****\n&gt; At the same time, the Fed is expected to defend its policy of letting inflation run hot, while assuring markets it sees the pick-up in prices as only temporary. The central bank meets on Tuesday and Wednesday.\n*****\n&gt; # The central bank takes the main stage\n&gt; “I think the Fed would like not to be a feature next week, but the Fed will be forced from the background because of concerns about inflation,” said Diane Swonk, chief economist at Grant Thornton.\n*****\n&gt; The central bank is not expected to make any policy moves, but Fed Chairman Jerome Powell’s press briefing following the meeting Wednesday will be closely watched.\n*****\n&gt; So far, the barrage of earnings news has been positive, with 86% of companies reporting earnings beats. Corporate profits are expected to be up about 33.9% for the first quarter, based on estimates and actual reports, according to Refinitiv. Revenues are about 9.9% higher.\n*****\n&gt; There is important inflation data Friday when the Fed’s preferred inflation gauge is reported.\n*****\n&gt; The personal consumption expenditure report is expected to show a 1.8% rise in core inflation, still below the Fed’s target of 2%. Other data releases include the first-quarter gross domestic product on Thursday, which is expected to have grown by 6.5%, according to Dow Jones.\n*****\n&gt; “I think the Fed has no urgency to shift monetary policy at this point,” said Ian Lyngen, head of U.S. rates strategy at BMO. “The Fed needs to acknowledge that the data is improving. We had a strong first quarter.”\n*****\n&gt; “The Fed needs to acknowledge that but at the same time they’re keeping extremely accommodative policy in place, so they’ll have to make a note to the fact that the easy policy is warranted,” he said.\n*****\n&gt; Lyngen said the Fed will likely point to continued concerns about the pandemic globally as a potential risk to the economic recovery.\n*****\n&gt; Powell is also expected to once more explain that the Fed will let inflation rise above its 2% target for a period of time before it raises rates so that the economy can have more time to heal. “It’s going to be a challenge for the Fed,” said Swonk.\n*****\n&gt; The base effects for the next several months will make inflation appear to have jumped sharply because of the comparison to a weak period last year. The consumer price index for April could be above 3%, compared to 2.6% last month, Swonk added.\n*****\n&gt; “The Fed is trying to let a lot more people get out onto the dance floor before it calls ‘last call,’” she said. “Really what Powell has been saying since day one is if we take care of people on the margins and bring them back into the labor force, the rest will take care of itself.”\n*****\n&gt; Stocks were slightly lower in the past week, and Treasury yields held at lower levels. The 10-year yield, which moves opposite price, was at 1.55% Friday.\n*****\n&gt; The S&amp;P 500 was down 0.1%, ending the week at 4,180, while Nasdaq Composite was down nearly 0.3% at 14,016. The Dow was off just shy of 0.5% at 34,043.\n*****\n&gt; # Tax hike prospects\n&gt; Stocks were hit hard on Thursday when after a news report said that Biden is expected to propose a capital gains tax rate of 39.6% for people earning more than $1 million a year.\n*****\n&gt; Combined with the 3.8% net investment income tax, the new levy would more than double the long term capital gains rate of 20% or the richest Americans.\n*****\n&gt; Strategists said Biden is expected to propose raising the income tax rate for those earning more than $400,000.\n*****\n&gt; “I think a lot of people are starting to price in the risk there going to be a significant increase in both corporate and capital gains taxes,” said Lyngen.\n*****\n&gt; So far, companies have not provided much in the way of commentary on the proposed hike in corporate taxes to 28% from 21% but they have been talking about other costs.\n*****\n&gt; David Bianco, chief investment strategist for the Americas at DWS, said he expects larger companies will do better dealing with supply chain constraints than smaller ones. Big Tech is also likely to fare better during the semiconductor shortage than auto makers, which have already announced production shutdowns, he said.\n*****\n&gt; “Next week is tech week. I think we’re going to get down on our knees and just be in awe of their business models and their ability to grow at a behemoth scale,” Bianco said.\n*****\n&gt; He said he’s not in favor of Wall Street’s popular trade into cyclicals and out of growth. He still favors growth.\n*****\n&gt; “We’re overweight equities really because we’re concerned about rising interest rates,” Bianco said. “I’m not bullish in that I expect the market to rise that much from here.”\n*****\n&gt; “We stuck with growth and dug deeper into bond substitutes, utilities, staples, real estate,” he said, adding he is underweight industrials, energy and materials. “Energy is doomed. It’s being nationalized via regulation. I do like industrials, they are well-run companies, but I do think infrastructure spending expectations for classic infrastructure are too high.”\n*****\n&gt; He also said industrials are good businesses, but the stocks have become overvalued.\n*****\n&gt; Bianco said he likes big box stores, but smaller retailers are facing big challenges that were already impacting them prior to Covid. He also finds small biotech firms attractive.\n*****\n&gt; “I like healthcare stocks. Those valuations are reasonable. People have been paranoid about politicians beating on them since 1992. They manage through it and lately they’ve been delivering,” he said.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/03KqldG.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/FctG7IL.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/Iq1PKMJ.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/eegfti6.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/cdNcBaJ.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/yhkNZLm.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/9js7oZJ.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/g84GywG.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/64LgRnj.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/dD0vkLd.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/LaQNKey.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/rOIVB71.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/hKlmSsP.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/Fntbm0R.png))**\n\n*****\n\n&gt; # Next Bump in Post-Election Year Rally Could Be in May\n\n&gt; As of yesterday’s close, DJIA was up 10.5% year-to-date. S&amp;P 500 was up 10.1% and NASDAQ was at 7.0%. Compared to average post-election year historical performance since 1950 graphed in the charts above and below, DJIA, S&amp;P 500 and NASDAQ are all still comfortably above past post-election year average performance for this point of the year.\n\n&gt; Due to Covid-19, 2021 so far has been more volatile than the average post-election year. Aside from larger magnitude swings in performance, we have observed the return of seasonality with choppiness in February and weakness in March following monthly options expiration. Strength this April is also aligning with historical in post-election year April strength.\n\n&gt; Historically, the next area of potential concern for the current rally is just after mid-May. This is also right around the time Q1 earnings season is beginning to wrap and focus shifts to Q2 estimates, graduations, and other early summer activities.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/6d832ea3cc4bbc31e8cfe94f03d98ac6/8e21ed4124083bdb-70/s500x750/83b3d05531a38363e7eae827dfdc65cea7df6790.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/8d8b97ef2c731be8f580e16dbe25d431/8e21ed4124083bdb-5f/s500x750/1e8a68dfbdeea8147d89c8ac91122b1b05419ecb.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/cd741bab290266df3e64e5ed52a0d7a7/8e21ed4124083bdb-b0/s500x750/6384a25868caf6c5fcfad8e452b0ae508758114a.jpg))**\n\n*****\n\n&gt; # Leading Indicators Suggest an Accelerating U.S. Economy\n\n&gt; The economic reacceleration is underway in the U.S., as the expanding vaccination campaign, lifting of mobility restrictions, and infusion of fiscal stimulus combined to lift the Conference Board’s Leading Economic Index (LEI) in March. The LEI grew 1.3% month over month, ahead of Bloomberg consensus forecasts of 1%, raising the Conference Board’s gross domestic product (GDP) expectations to 6% on a year-over-year basis.\n\n&gt; After a weaker-than-expected February release that was primarily disrupted by the winter storm, data in March snapped back in a strong fashion. All ten components of the LEI rose in March, while jobless claims were the largest contributor to the growth of the index. Labor market data has continued to improve since the measurement period, as weekly jobless claims have posted back-to-back pandemic lows. The ISM New Orders Index was the second largest contributor to the LEI, which climbed to its highest levels since 2004.\n\n&gt; The Conference Board revised the February data lower, however, snapping what was a 10-month streak of growth for the index. As shown in the LPL Chart of the Day, the LEI is back on the rise, suggesting further economic momentum in the coming months:\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.23.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; “Momentum breeds momentum, and we expect the U.S. economy will continue to improve in the coming months as we move forward with reopening plans,” noted LPL Financial Chief Market Strategist Ryan Detrick. “As the rest of the world continues to improve as well, we expect some spill-over effects to also benefit the US economy.”\n\n&gt; The U.S. is currently vaccinating around 3 million people per day, according to the Center for Disease Control (CDC), and over half of the adult population has received at least one dose of the vaccine. Meanwhile, over 80% of the population above the age of 65—the most at-risk age segment of the population—has received at least one dose of the vaccine. The improving vaccination data has helped embolden policymakers to lift restrictions, and prompted us to upgrade our GDP forecast for the U.S. to 6.25-6.75% in our recent Weekly Market Commentary.\n\n*****\n\n&gt; # What Happens After The First Rate Hike?\n\n&gt; “Don’t fight the Fed.” Old investment saying\n\n&gt; One of the popular questions we’ve received lately is what do stocks do after the first rate hike? Let’s be clear, we think the Federal Reserve Bank (Fed) will leave rates low until at least 2023, but what if we get a sudden dose of inflation? This isn’t our base case, but a rate hike could potentially happen sooner in that situation.\n\n&gt; After all, the first rate hike in 2015 set off a huge sell-off into early February 2016, as the market was quite upset and let it be known that it felt the Fed acted too soon. In fact, the first hikes of 2004 and 1999 also saw losses the first three months after the first hike, but eventually stocks were in the green a year later.\n\n&gt; “The first hike in recent cycles has indeed brought with it some selling pressure, but hikes usually take place in strong economies, so it isn’t surprising to see returns turn green once you go further out,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But let’s not sound any alarms yet, we don’t see a rate hike for a couple of years. Still, it’s good to know what the playbook could be once it happens.”\n\n&gt; As shown in the LPL Chart of the Day, that initial rate hike can cause some hiccups the first three months, but returns turn much better 6- and 12-months later.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.21.21-Blog-Chart-1.png?ssl=1)**\n\n*****\n\n&gt; # Twin Deficits and the US Dollar\n\n&gt; It was a particularly challenging year for the greenback in 2020, where the world’s reserve currency acted as a “safe haven” asset at the height of the March 2020 market volatility, only to fall over the remainder of the year. With the U.S. outpacing much of the developed world in economic growth in 2021, Treasury yields have been rising and the dollar has strengthened, bucking the consensus view for dollar weakness.\n\n&gt; We view the “twin deficits” of the U.S. economy—the combination of the budget deficit and the current account deficit—as a long-term structural driver of a weaker U.S. dollar. As a historical net importer, the U.S. has usually carried a trade deficit (leading to a broader current account deficit in the process), while the flood of pandemic aid has stretched the budget deficit and ballooned the sum of the twin deficits to all-time lows as a percent of gross domestic product (GDP). As shown in the LPL Chart of the Day, changes in the twin deficits have been a relatively accurate predictor in the long-term trend of the value of the US dollar:\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.22.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; With the twin deficits reaching all-time lows, it’s hard to be bullish the US dollar over the long-term relative to its major counterparts. “The short-dollar trade has certainly been a frustrating one for investors this year, but the long-term trend continues to point lower,” added LPL Financial Chief Market Strategist Ryan Detrick. “However, a counter-trend rally like we saw in the first quarter might have been enough to flush out some of the crowded consensus for a lower dollar.”\n\n&gt; U.S. economic growth has outpaced our developed nation counterparts to begin 2021, but expectations for growth in the rest of the world may be playing catch up. In particular, the 30-year German bund yield broke out to its highest level since the onset of the pandemic, suggesting growth expectations for one of our major trade partners may be on the rise.\n\n&gt; A soft dollar has a variety of investment implications. While we continue to favor U.S. stock market exposure over developed international markets, investments overseas may benefit from the tailwind of the softer dollar. Meanwhile, commodities have historically benefitted from a weaker dollar, and may be positioned for further upside as economic activity in the rest of the world heats up. For more on our tactical market views, check out our April Global Portfolio Strategy.\n\n*****\n\n&gt; # Dips in Short Supply\n\n&gt; While many areas of the market have seen sizable pullbacks this year, the broader market has been stingier. Just this morning, a client was lamenting the fact that they had a decent amount of cash, but the market just wasn't providing opportunities to get in. So far this year, the S&amp;P 500's largest decline from a peak (on a closing basis) has been 4.23%, and given that we're not even four full months into the year, we initially thought that 4% seemed normal enough especially when the earlier months of the year tend to be positive.\n\n&gt; In order to see how this year stacks up to prior years, the chart below shows the duration into each year (on a percentage basis) that the S&amp;P 500 first closed down 5% or more from its YTD peak. Years in green indicate that there wasn't a single point in the entire year that the S&amp;P 500 experienced a 5% decline. The last occurrence was in 2017, and there have been a total of seven years since 1928. As we near the end of April, we're nearly a third of the way into 2021, and compared to the 'average' year, we've already gone longer without a 5% pullback. Since 1928, the S&amp;P 500 usually experiences its first 5%+ pullback 28% of the way into the year, which coincidentally enough works out to April 15th - the day before Federal taxes are typically due! In fact, at this point in prior years, the S&amp;P 500 has already experienced its first 5%+ pullback more than 65% of the time. Believe it or not, in 30% of all years since 1928 the first 5% drop occurred in the month of January.\n\n&gt; Based on prior years, the market to this point has in fact been stingy in terms of providing opportunities for investors to add exposure, although based on today's reports of new capital gains tax increases from the Biden Administration, that window may soon open.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/042221-5-Pullbacks.png))**\n\n*****\n\n&gt; # What is a 200-Day Moving Average Again?\n\n&gt; If we've learned anything over the last two trading days after what seemed like a one-way move higher for the S&amp;P 500, it is that equities can also go down. Even after the declines of the last couple of days, though, the S&amp;P 500 still remains close to 4% above its 50-day moving average (DMA) and more than 10% above its 200-DMA. While there have been a handful of days since the COVID lows where the S&amp;P 500 has dipped below its 50-DMA, there hasn't been a single day since last June where the S&amp;P 500 came even close to testing its 200-DMA. We're only in late April now, but as long as the S&amp;P 500 doesn't see a significant fall in the next two months, it has the potential to go a full year without closing below its 200-DMA. When the 200-DMA does finally come into play again, many investors may not recognize what it is.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/042021-SP-500.png))**\n\n&gt; The chart below shows the percentage of time over a rolling one-year period that the S&amp;P 500 traded above its 200-DMA. At 89% now, the current level is hardly remarkable by historical standards. Right before the COVID crash last year, the percentage reached as high as 97.6%, and three years ago in March 2018, it was up at 100%. What is remarkable about the chart, though, is how elevated this moving average has been for so long. The last time it was below 50% was back in December 2009!\n\n&gt; It's easy to tell by looking at the chart, but thanks to short and swift pullbacks in the post-financial crisis period, this current streak without a sub-50% reading is the longest on record. To put a little more meat on the example, after the current streak of nearly 11.5 years, the next longest streak stretched over a period of just under ten years spanning from April 1991 through March 2001 while the one behind that was less than five years (ending in May 2008). And you only thought the market had been defying gravity recently!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/042021-Above-200-DMA.png))**\n\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending April 23rd, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=zVSgvKq0pQw))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 4.25.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=lNEOWj2EubI))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$AAPL** \n&gt; * **$TSLA** \n&gt; * **$AMD** \n&gt; * **$AMZN** \n&gt; * **$MSFT** \n&gt; * **$FB** \n&gt; * **$NIO** \n&gt; * **$BA** \n&gt; * **$UPS** \n&gt; * **$PINS** \n&gt; * **$GE** \n&gt; * **$SHOP** \n&gt; * **$GOOGL** \n&gt; * **$QCOM** \n&gt; * **$XOM** \n&gt; * **$F** \n&gt; * **$MMM** \n&gt; * **$ABBV** \n&gt; * **$ACI** \n&gt; * **$TWTR** \n&gt; * **$X** \n&gt; * **$SPOT** \n&gt; * **$TDOC** \n&gt; * **$CL** \n&gt; * **$V** \n&gt; * **$CAT** \n&gt; * **$LLY** \n&gt; * **$ENPH** \n&gt; * **$SAND** \n&gt; * **$OTIS** \n&gt; * **$SWKS** \n&gt; * **$CROX** \n&gt; * **$MRK** \n&gt; * **$RTX** \n&gt; * **$MCD** \n&gt; * **$SBUX** \n&gt; * **$OSTK** \n&gt; * **$BP** \n&gt; * **$NXPI** \n&gt; * **$DPZ** \n&gt; * **$BMY** \n&gt; * **$MA** \n&gt; * **$GLW** \n&gt; * **$CHKP**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/dD0vkLd.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/tcxvmqm.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/hcAO3Gz.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR THE NEXT FEW WEEKS!](https://i.imgur.com/IAo7GlZ.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR XLF COMPANIES FOR THE NEXT FEW WEEKS!](https://i.imgur.com/j0DqRRh.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR XLK COMPANIES FOR THE NEXT FEW WEEKS!](https://i.imgur.com/mnzxCHb.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR XLV COMPANIES FOR THE NEXT FEW WEEKS!](https://i.imgur.com/08xmiRX.jpg))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES FOR XLI COMPANIES FOR THE NEXT FEW WEEKS!](https://i.imgur.com/YpSjzzQ.jpg))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 4.26.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/CSjyM5z.png))\n\n&gt; # ***Monday 4.26.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/5f8y7hV.png))\n\n*****\n\n&gt; # ***Tuesday  4.27.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/oiJIwAm.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/HBIDjE9.png))\n\n&gt; # ***Tuesday 4.27.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/ROeEsDZ.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/ULBdPab.png))\n\n*****\n\n&gt; # ***Wednesday 4.28.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/vMsmAhL.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/rmljNNP.png))\n\n&gt; # ***Wednesday 4.28.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/RDE1FuX.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/yNRtL7R.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/SVlEwKR.png))\n\n*****\n\n&gt; # ***Thursday 4.29.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/4agD6a7.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/e1ex0sZ.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/J6Nw60b.png))\n\n&gt; # ***Thursday 4.29.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/VvVoXXd.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/bBCcQ78.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/HmfBR4U.png))\n\n*****\n\n&gt; # ***Friday 4.30.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/kc3V6fB.png))\n\n*****\n\n&gt; # ***Friday 4.30.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/t7kDKVf.png))\n\n*****\n\n&gt; # Apple, Inc. $134.32\n**Apple, Inc. (AAPL)** is confirmed to report earnings at approximately 4:30 PM ET on Wednesday, April 28, 2021. The consensus earnings estimate is $0.99 per share on revenue of $77.06 billion and the Earnings Whisper ® number is $1.08 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 55.29% with revenue increasing by 32.15%. Short interest has increased by 1.6% since the company's last earnings release while the stock has drifted lower by 3.7% from its open following the earnings release to be 11.1% above its 200 day moving average of $120.93. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, April 8, 2021 there was some notable buying of 49,660 contracts of the $140.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AAPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Tesla, Inc. $729.40\n**Tesla, Inc. (TSLA)** is confirmed to report earnings at approximately 4:10 PM ET on Monday, April 26, 2021. The consensus earnings estimate is $0.78 per share on revenue of $10.24 billion and the Earnings Whisper ® number is $0.86 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 248.21% with revenue increasing by 71.09%. Short interest has decreased by 17.9% since the company's last earnings release while the stock has drifted lower by 11.0% from its open following the earnings release to be 31.5% above its 200 day moving average of $554.56. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, April 19, 2021 there was some notable buying of 25,000 contracts of the $1,030.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 8.1% move on earnings and the stock has averaged a 6.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TSLA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Advanced Micro Devices, Inc. $82.76\n**Advanced Micro Devices, Inc. (AMD)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, April 27, 2021. The consensus earnings estimate is $0.44 per share on revenue of $3.21 billion and the Earnings Whisper ® number is $0.47 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 144.44% with revenue increasing by 79.73%. Short interest has increased by 34.4% since the company's last earnings release while the stock has drifted lower by 9.2% from its open following the earnings release to be 0.2% above its 200 day moving average of $82.58. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, April 12, 2021 there was some notable buying of 41,267 contracts of the $80.00 call and 39,182 contracts of the $80.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Amazon.com, Inc. -\n**Amazon.com, Inc. (AMZN)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, April 29, 2021. The consensus earnings estimate is $9.65 per share on revenue of $104.41 billion and the Earnings Whisper ® number is $11.56 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 92.61% with revenue increasing by 38.38%. Short interest has increased by 61.1% since the company's last earnings release while the stock has drifted lower by 2.5% from its open following the earnings release to be 5.3% above its 200 day moving average of $3,172.75. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, April 22, 2021 there was some notable buying of 8,119 contracts of the $3,400.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 4.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Microsoft Corp. $261.15\n**Microsoft Corp. (MSFT)** is confirmed to report earnings at approximately 4:10 PM ET on Tuesday, April 27, 2021. The consensus earnings estimate is $1.76 per share on revenue of $41.03 billion and the Earnings Whisper ® number is $1.86 per share. Investor sentiment going into the company's earnings release has 85% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.71% with revenue increasing by 17.16%. Short interest has increased by 23.5% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 17.2% above its 200 day moving average of $222.86. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, April 20, 2021 there was some notable buying of 9,063 contracts of the $265.00 call expiring on Friday, July 16, 2021. Option traders are pricing in a 3.6% move on earnings and the stock has averaged a 2.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Facebook Inc. $301.13\n**Facebook Inc. (FB)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, April 28, 2021. The consensus earnings estimate is $2.36 per share on revenue of $23.53 billion and the Earnings Whisper ® number is $2.68 per share. Investor sentiment going into the company's earnings release has 84% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 38.01% with revenue increasing by 32.66%. The stock has drifted higher by 8.6% from its open following the earnings release to be 11.7% above its 200 day moving average of $269.60. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, April 14, 2021 there was some notable buying of 18,839 contracts of the $310.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 5.9% move on earnings and the stock has averaged a 5.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # NIO Inc. $41.08\n**NIO Inc. (NIO)** is confirmed to report earnings at approximately 5:00 PM ET on Thursday, April 29, 2021. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. Short interest has increased by 27.8% since the company's last earnings release while the stock has drifted lower by 10.9% from its open following the earnings release to be 15.8% above its 200 day moving average of $35.47. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, April 22, 2021 there was some notable buying of 32,398 contracts of the $40.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 9.6% move on earnings and the stock has averaged a 17.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NIO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Boeing Co. $238.38\n**Boeing Co. (BA)** is confirmed to report earnings at approximately 7:30 AM ET on Wednesday, April 28, 2021. The consensus estimate is for a loss of $1.17 per share on revenue of $15.41 billion. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 31.18% with revenue decreasing by 8.86%. Short interest has decreased by 9.0% since the company's last earnings release while the stock has drifted higher by 21.1% from its open following the earnings release to be 20.2% above its 200 day moving average of $198.38. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, April 6, 2021 there was some notable buying of 17,621 contracts of the $250.00 call and 17,205 contracts of the $250.00 put expiring on Friday, May 21, 2021. Option traders are pricing in a 4.5% move on earnings and the stock has averaged a 3.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # nited Parcel Service, Inc. $178.96\n**United Parcel Service, Inc. (UPS)** is confirmed to report earnings at approximately 6:00 AM ET on Tuesday, April 27, 2021. The consensus earnings estimate is $1.63 per share on revenue of $20.47 billion and the Earnings Whisper ® number is $2.03 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 41.74% with revenue increasing by 13.50%. Short interest has increased by 32.9% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 11.3% above its 200 day moving average of $160.74. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, April 6, 2021 there was some notable buying of 14,036 contracts of the $190.00 call expiring on Friday, June 18, 2021. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 6.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UPS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Pinterest, Inc. $74.99\n**Pinterest, Inc. (PINS)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, April 27, 2021. The consensus earnings estimate is $0.08 per share on revenue of $472.67 million and the Earnings Whisper ® number is $0.13 per share. Investor sentiment going into the company's earnings release has 81% expecting an earnings beat The company's guidance was for revenue of approximately $469.00 million. Consensus estiamtes are for year-over-year revenue growth of 73.81%. The stock has drifted lower by 13.0% from its open following the earnings release to be 29.5% above its 200 day moving average of $57.90. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, April 15, 2021 there was some notable buying of 7,454 contracts of the $90.00 call expiring on Friday, May 21, 2021. Option traders are pricing in a 13.2% move on earnings and the stock has averaged a 18.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PINS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning April 26th, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mxmab7/wall_street_week_ahead_for_the_trading_week/",
        "created": 1619307219.0
    },
    {
        "author": "The_Peronist",
        "created_utc": 1618564959,
        "id": "mrzjc2",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hello folks,\n\nI'm considering invest on some of the players on the eSIM industry since, as you may know, demand of this technology is increasing at the pace of IoT and wearables like the Apple Watch.\n\nTop players apparently are: Gemalto N.V., Infineon Technologies A.G., Deutsche Telekom, STMicroelectronics, NXP (next experience) Semiconductors, Giesecke + Devrient, NTT DoCoMo INC. (Japan), Sierra Wireless INC.\n\nAnyone have any idea of who of those manufacturers may be providing to Apple?\n\nWhat criteria would you use to narrow down that list?\n\nThank you!",
        "subreddit": "ValueInvesting",
        "title": "Embedded SIM (eSIM) Manufacturers",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/mrzjc2/embedded_sim_esim_manufacturers/",
        "created": 1618593759.0
    },
    {
        "author": "LuigiC173",
        "created_utc": 1619705357,
        "id": "n155jb",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "NXPI avoid or buy in",
        "url": "https://www.reddit.com/r/stocks/comments/n155jb/nxpi_avoid_or_buy_in/",
        "created": 1619734157.0
    },
    {
        "author": "NrdRage",
        "created_utc": 1619290450,
        "id": "mxqc7w",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \n\nDD #4:  Cruise lines.  Original Date February 19th, 2021📷\n\nNot mine.  But I wants it.\n\nURL:  [For you poor bastards who missed this boat](https://www.reddit.com/r/wallstreetbets/comments/lnpqrp/nrdrages_friday_dd_the_bermuda_triangle_and_you/)\n\n**Original Thesis:**             The cruise liners were one of the last Wuhan-fucked plays  out       there     who hadn't taken a true turn at the recovery wheel  just   yet.      Which   made   them smooth sailing for easy tendies\n\n**Original Price Target January 2022:**             $NCLH 46, $CCL/$CUK 47/42 respectively, $RCL $90.  My    positions      were    established a month and a half before the DD, so    my cost   basis    was    different.  I was holding 700 1/22 25c's in    $CCL and   2000 1/23    $42.5c's    in $NCLH.\n\n**How did it work out:**             If you jumped in shortly thereafter and played the stocks     right,     you    made enough to buy your own boat.  Sure, maybe it was  a    17'     Bayliner    that all the women at the marina called   \"adorable\"   and  were    clearly    conflating towards what they   assumed was your    pathetic 2.5\"    penis size    at diamond hardness,   but it floated, it    had an engine,   and  dammit, it    was yours and   you had enough left    over for a   captain's  hat and a bunch    of   beer money.  This one  was   hard to screw   up -  especially since it    was   the first one I   started  providing   updates on  and made sure    everybody   knew to take   profits  at 32 on   NCLH and buy  back at  29  (and  to continue     playing that  range), etc.    People in  these   from the date  of posting   who   didn't  just buy and   hold likely    have turned at least a 6    bagger by now.     This trade was,   and to   some  extent is, still solid    gold.\n\n**What's happened since then:**             In spite of none of the companies in question needing to   issue        shares   as they had enough cash on hand, $RCL issued   shortly  after    that    DD,  $CCL  immediately copied them, and $NCLH   followed  suit a    couple   of  weeks   after $CCL.  At least none of   them tried  to pull  an   $AMC  and   have the   CEO go on TV and give   zero credit  to retail    investors  for   saving the   company and   instead taking  all the  credit   before  diluting   and then   paying   himself a fat ass  bonus  for doing   nothing  but issuing   shares like     some sort of  conquering  hero.  The   amount of  the dilution   in   question   meant  that the  resistance  price  of (to use  as example,     $NCLH) of $32 a    share  already  represented a  higher  price than   the   pre-virus share   price.    Ditto  for the other  2.   Investors   haven't seem   to have  noticed,    however,  and these  stocks  still   trade in the  general   range,  though the    resistance  level is now    more like 31/25/85.    Also,  the  sailing   schedules  for  the   domestic  cruise ships has  been  pushed   back as a   result of     somebody high up at  the CDC  obviously  shorting   these  stocks,  as    that's  the only  explanation  for why they're  so   focused  on trying   to   send these  companies to 0   by preventing   sailings.    Norwegian  is  resuming  cruises  outside  the US in the next   couple  of   months.\n\n**What the smart play is today:**             These 3 companies are no longer as attractive as a result of     the        dilution, but they're still good swing traders within  their       respective     channels.  I'd put up a picture of some  charts to  show      those, but I     already told you where the  resistance is,  grow a      wrinkle and learn  where    support is.\n\nI         have since   exited  my positions in $CCL (and was never in   $RCL),     and   have   drastically  reduced my holdings in $NCLH, but I   do  still     maintain a    skeleton crew  of January calls for them.\n\n**Trade rating:**             9/10.  It was really hard to fuck this one up, unless you   just        didn't   believe me. And it's still a live trade.  The only   thing  I       could have   done better was post it sooner, but I make   sure my    trades     are   established and going the right way before I   talk  about   them in     depth.\n\nDD #5:  The Semiconductors:  Original Date February 26th, 2021\n\nAnd        before you ask, yes it is.  Took this the other day when I  decided    to    start working on this. In retrospect, should have  washed first.\n\n**URL:** [For you poor, broke ass souls who missed it](https://www.reddit.com/r/wallstreetbets/comments/lt89s3/nrdrages_friday_dd_the_semis_play_not_just_the/)\n\n**Original Thesis:**         While everybody was spooging over high end chipmakers like Theta        Semiconductor, $AMD, and $NVDA (and, to be fair, I had been  telling       people to buy $NVDA 545/580c's, which were all  multibaggers), the   real     action was in the commodity level  chipmaker space,  specifically    American   companies (or companies  that could masquerade  as them) who    would line   up to the trough to  get some free  government money to go    from being   nofab to fab  companies.\n\n**Original Price Target:**         $NXPI 200-210 within 3 months; $ON to within 43 within 3 months,       $MRVL  to 75 within that same range.  And I didn't give a price   target     for  $UTZ, just that it would go up.\n\n**How did it work out:**         LAMBOS for almost everyone!  Supposing you could order one,  given      that  they can't get the chips they need to build the cars.      $NXPI   got   to  214 before pulling back to 202.  $ON hit 43 2 weeks   before I     predicted  it would.  $MRVL failed to live up to   expectations and has     been  essentially dead money since that   posting, but if you'll  recall I    was  very explicit that I was   bullish on them ONLY as a 5G  play,   whereas  the  others I felt had   more range and scope.  So  short-term   $MRVL play  was a  loser if you   moved up the timeline I  liked.  Oh, and   $UTZ printed  for  everybody   that just bought in  because they liked the   product.  It  was a   nice  little pocket play.\n\n**What's happened since then:**         The trade ran its course to perfection.  As I've been saying for  a       little while now, semis, with the exception of $NVDA, are not     presently    an interesting trade because there's been a rotation out  of    them  after   this period of growth.  I am still incredibly  bullish  on   the  sector as a   whole, but they need a breather and  some time  out  of  the  sun before   continuing a leg up.  They're not  even good   rangebound   trades right now.    And LOL @ any of you  clowns who bought   $TSM  anyways  because Cramer  and his cult of  Shortbus All-Stars   told  you  they were  the best in breed.  Suckers.    In the case of  $MRVL,  they  acquired  another company and now are  going  to  \"officially\"  become a US  company  instead of that tax  dodging shit   they've been  pulling, which  means the  thesis about  them lining up for   gubmint  money is sound and  will happen  down the  road.\n\n**What the smart play is today:**        Ignore semis till at least June; probably July.  I have exited  out    of   all of my positions and have taken immense profits from the     commodity   semis.  I similarly got rid of my $NVDA calls at the top,     though I am   willing to find a re-entry point in the 575 range if  it    happens.  Don't   be sad that the trade is over, be glad that it     happened and you might   have been there.  Or at least be happy that I     was there and am   appreciative that I got to stack a bunch more  paper    I'll never spend.    Either way.\n\n**Trade rating:**  9/10.  Absolutely perfect call, with only $MRVL being the laggard, but it came with the appropriate warning.\n\nDD #6:  $CLNE.  Original Date March 5th, 2021\n\n📷\n\n**URL:** [Got buried in a mountain of Gibbons doing dumbass \"DD\" on their stonk](https://www.reddit.com/r/wallstreetbets/comments/lye7st/nrdrages_friday_dd_ok_one_of_you_apes_needs_to/)\n\n**Original Thesis:**        People are finally willing to take greenhouse gas emission  capture      seriously, and the infrastructure and transport sector is  finally   ready    to start moving away from diesel and traditional oil  based   products  in   favor of carbon negative renewable natural gas -    especially  companies   making carbon pledges or located in states  where   progressive  leadership   is going to demand emission reduction.    $CLNE  was uniquely  positioned  as  the nation's leading provider of   that  fuel source and,  unlike all  the  other green energy  EV/charging   companies out there,  actually has a  real  product that  they sell in   large quantities, making  it a diamond in  the  otherwise  pipe dream   green energy space.\n\n**Original Price Target:**  $17 by late May, $31 by next March\n\n**How did it work out:**        I said to buy it as soon as it got under 11.  It got under 11 the      very  next trading day.  Then immediately shot up almost 50% within   10    days  and was one of the few stocks out there consistently   finishing    green  while the entire market was tanking.  As long as you   played it    smart and  heeded warnings about stonks not always just   going up and    taking profit  after parabolic rises and looking for   re-entries later,    then you made  enough money to put RNG high powered   engines in both  your   boat from  cruise stocks and your Lambo from   semis and convert  your   entire house to  being powered by cow farts   before the green  energy   sector got  skullfucked.  If you held, you'll   feel this trade  didn't   work out  (though it still will, if you   picked the June target  date like   I said)  and, if you re-entered   after taking profits, you've  either   been  averaging down lately as   this has been getting unfairly  dragged   down  with the entire green   energy sector or else you're  underwater on    it....but you'll still be   fine.\n\n**What's happened since then:**        A LOT.  From them getting dragged down from the mid 15's all the    way    to below 10 on nothing but good news to them signing major     partnerships   with $BP, Total and Citgo, to signing a half a billion     dollar deal  with  $AMZN to power their long-haul fleet with RNG to     Washington DC  flat-out  stating that methane capture is a capstone of     their green  energy plan,  there has been nothing but good news coming     out of this  company.  And  yet It got absolutely PUMMELED with the     sector for the  last month, and  then this past week started Monday     morning up 27% only  to not only give  all of those gains back but  lose    another 20% by the  close of trading  Tuesday because of a  combination    of market  manipulation by a hedge fund  that shorted the  stock into    oblivion for a  hit and run (do a search on my profile by  posts and  look   up my Wednesday discussion if you want to be  absolutely fucking    infuriated that someone borderline committed a  crime) coupled with them    paying off an analyst at RayJay to run a hit  piece on the $AMZN deal  to   try and sink  the stock price even lower,  right down to that hedge   fund  suppressing  the price of the stock  for 2 weeks to keep it under   $12 so  the most  popular options for  April would expire worthless.    This  company has, in  short, been  subjected to a biblical level of   fuckery  that was probably  was some  Mortimer Brothers bullshit for a $1   bet, and  it's still  standing and  ready to spring. Oh, and somebody   informed  me that they  got some  airtime on Cramer's show on the 24th.    Jimmy Retard  is luekwarm on   them, and you should always inverse him,   so balls to the  wall, baby.    Especially since he tried to compare the   2009 version of  this  company  (when nobody gave 2 shits about nat  gas)  with the 2021   version (where  governments are going to force  people  into this type  of  product and the  transport industry is  finally  transitioning away  from  oil).\n\nWhat  the smart play  is today:    My thesis, as written back then, is EXACTLY  what I would  write even   today.  I stand by every last thing in there,  including  the strike date   and price, in spite of the hedge fund  bullshit that  artificially tanked the stock for no reason other than  unmitigated  greed.  It was my   favorite stock in the whole market then,  and it  still is now, just   balanced against the knowledge that, as a  very  small midcap bordering on   a small cap, it's easy to push around  and  very clearly fucked some hedge fund manager's wife or something. If  you  don't believe me, every   analyst out there says this company is  worth  double what it's at now. My original position still exists, except now  it's bigger and I'm also the owner of a lot (and I mean a LOT) of shares  on top of it that I was gobbling up like a porn star eating all the  money shots in an episode of Blacked on Tuesday and Wednesday.\n\n**Trade rating:**   10/10.   Nobody was talking about it before that DD.  You made a  multi-bagger in  just a few days if you jumped in, and even though  you're battered and  bloody right now on the 2nd run with them because  of the manipulation  from a hedge, you're still going to make mad  tendies with this one.   They've got EVERYTHING going for them,  corporate America is looking to  them for the carbon negative fuel as an  easy way to lower their  footprints, no competition other than a shitty  (4 letter word for non IPO company) building their first  capture plant  who has NO fueling depots or infrastructure, politicians  demanding  carbon neutral fuel and, unlike most of the sector they reside  in,  actually have a product and make money.\n\nDD #7:  $BE.  Original Date March 12th, 2021\n\n**URL:** [Lazy bitch can't even search for it yourself?](https://www.reddit.com/r/wallstreetbets/comments/m3mhkm/nrdrages_friday_dd_spring_is_in_the_air_the_birds/)\n\n**The thesis:**    The clusterfuck in Texas this past winter, combined with California's   annual inability to provide even basic electricity to its residents as   the state burns to the ground and they try to push everybody into  EV's,  created a unique opportunity for a green energy company that  existed  completely in its own space:  Weather immune green energy  microgrids  that could scale to any size, literally NEVER go down as has  been proven  by large-scale pilots in Delaware and Cal Tech,  and  didn't have the  drawbacks of batteries.  Oh, and politicians finally  acknowledging that  our utility grid is well beyond end of life and hot  garbage and not  wanting voters blaming them for citizen deaths being  willing to spend  taxpayer money to address that.\n\n**Original Price Target:**  70% conviction of a $32 price by mid-April, 45-50 by August, and a long term target of $72\n\n**How did it work out:**   I  had the unfortunate pleasure of posting this DD right as the entire   green energy space was being crushed by big money rotating into  \"value\"  and later into \"the 10 biggest companies in the S&amp;P to make  SPY go  up\", so things haven't gone as planned to this point.  The  stock has  actually fallen from the 27's all the way down into the 22's,  though it  has rebounded this week and looks to be starting a fresh  run.  It's a  bit of a hail Mary, but that 5/21 32c that I was hyping  back then....it  might still print.  Though even I rolled over my May  calls to August at  the same strike to buy more time to make up for them  getting dragged  down with a bunch of companies that aren't even in the  same space as  these dudes.\n\n**What happened since then:**    They haven't announced any big deals, but I know they're working on   some.  And they set up a new global office in Dubai to start marketing   their products worldwide, which should only give them tailwinds going   forward.\n\n**What the smart play is today:**    I still stand behind everything written in that DD, with the only   thing I'd like to change is the expiry date on the calls from May to   August.  And again, if you're sitting on May calls that are way, WAY   down....I wouldn't cut bait with them just yet just because they're   already almost worthless and there's still a puncher's chance they fight   back.  This thing has started to get some life, and I wouldn't bet   against it being able to hit that strike in a month - well, I wouldn't   bet a lot.  I would just feel better if it were 4.  Long term, this is   still going to be a great investment.\n\n**Trade rating:**   I was  going to give this one a 2/10 just because it had been going  almost  straight down for weeks now killing the May expirys, but the  longer  calls and shares are still very much alive, but I'm going to  upgrade it  to a 3.5 because it's made some good movement, and I will  cross my  fingers that, by this time next month, I'll call it a 6.\n\nDD #8:  $RYCEY.  Original Date March 19th, 2021\n\n**URL:** [How was this one of my most popular DD's?](https://www.reddit.com/r/wallstreetbets/comments/m8inij/nrdrages_friday_dd_the_absolute_shittiest_company/)\n\n**The thesis:**    Simple:  A re-opening play.  $RYCEY is one of the only companies in   the world that has not rebounded from the pandemic, and as soon as   people start flying en masse again, demand for their engines (and   maintenance contracts) will start buoying the stock price\n\n**How did it work out:**    I said buy shares and tuck them away.  The stock hasn't really moved   since that DD, and should still be tucked away.  The condition for  their  recovery (increased air travel) has not yet happened, therefore,  it's  not their turn yet.\n\n**What happened since then:**    People have continued to be afraid of their own shadows.  Especially   the Europoors, even though England no longer even has enough cases to   qualify as being in a pandemic.  Dumbasses.\n\n**What the smart play is today:**  Same as it was then.  Buy shares.  Hold.  My positions haven't changed.\n\n**Trade rating:**  4/10.  Their turn for recovery is taking forever, but it'll get there.\n\nDD #9:  $NVTA.  Original Date April 2nd, 2021 (no DD the week before)",
        "subreddit": "wallstreetbets",
        "title": "Troubleshooting autofilter, pay no attention",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mxqc7w/troubleshooting_autofilter_pay_no_attention/",
        "created": 1619319250.0
    },
    {
        "author": "LastDelivery5",
        "created_utc": 1619105817,
        "id": "mw7grz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " The rumor of Samsung-NXP started again after the Qualcomm attempt. Early in Feb, Korean newspaper has started the speculation. Names included NXP, IFX, TI, Renesas. This week, Barron's wrote again about Samsung looking for a US based auto analog company, presumably with fab. \n\nI think the regulatory hurdle to buy NXP is quite high given its market share and the importannce. In 2018, China killed the NXP and Qualcomm merger on antitrust concerns. \n\nLast year, Starboard Value, a top activist hedge fund, bought a significant stake in ON, touting that it is an undervalued scaled asset. And given the track record of Starboard selling and merging analog semi companies, could it be ON in the running for Samsung instead of Samsung? So far, I have not seen ON's name floated anywhere, though regulatory-wise, it might be an easier deal. \n\n[https://www.koreatimes.co.kr/www/tech/2021/02/133\\_303542.html](https://www.koreatimes.co.kr/www/tech/2021/02/133_303542.html)\n\n[https://www.barrons.com/articles/nxp-semiconductors-acquisition-makes-sense-samsung-51618937427?mod=djem\\_b\\_Weekly%20Barrons%20feed%20for%20last%2024%20hours](https://www.barrons.com/articles/nxp-semiconductors-acquisition-makes-sense-samsung-51618937427?mod=djem_b_Weekly%20Barrons%20feed%20for%20last%2024%20hours)",
        "subreddit": "wallstreetbets",
        "title": "Might Samsung buy $ON?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mw7grz/might_samsung_buy_on/",
        "created": 1619134617.0
    },
    {
        "author": "NrdRage",
        "created_utc": 1619289467,
        "id": "mxq00v",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nDD #4:  Cruise lines.  Original Date February 19th, 2021📷\n\nNot mine.  But I wants it.\n\nURL:  [For you poor bastards who missed this boat](https://www.reddit.com/r/wallstreetbets/comments/lnpqrp/nrdrages_friday_dd_the_bermuda_triangle_and_you/)\n\n**Original Thesis:**          The cruise liners were one of the last Wuhan-fucked plays out     there     who hadn't taken a true turn at the recovery wheel just yet.      Which   made   them smooth sailing for easy tendies\n\n**Original Price Target January 2022:**          $NCLH 46, $CCL/$CUK 47/42 respectively, $RCL $90.  My positions      were    established a month and a half before the DD, so my cost   basis    was    different.  I was holding 700 1/22 25c's in $CCL and   2000 1/23    $42.5c's    in $NCLH.\n\n**How did it work out:**          If you jumped in shortly thereafter and played the stocks  right,     you    made enough to buy your own boat.  Sure, maybe it was a  17'     Bayliner    that all the women at the marina called \"adorable\"  and  were    clearly    conflating towards what they assumed was your   pathetic 2.5\"    penis size    at diamond hardness, but it floated, it   had an engine,   and  dammit, it    was yours and you had enough left   over for a   captain's  hat and a bunch    of beer money.  This one was   hard to screw   up -  especially since it  was   the first one I  started  providing   updates on  and made sure  everybody   knew to take  profits  at 32 on   NCLH and buy  back at 29 (and  to continue    playing that  range), etc.    People in  these from the date  of posting  who   didn't  just buy and   hold likely  have turned at least a 6   bagger by now.     This trade was,   and to some  extent is, still solid   gold.\n\n**What's happened since then:**          In spite of none of the companies in question needing to issue       shares   as they had enough cash on hand, $RCL issued shortly after    that    DD,  $CCL  immediately copied them, and $NCLH followed suit a    couple   of  weeks   after $CCL.  At least none of them tried to pull  an   $AMC  and   have the   CEO go on TV and give zero credit to retail    investors  for   saving the   company and instead taking all the  credit   before  diluting   and then   paying himself a fat ass bonus  for doing   nothing  but issuing   shares like   some sort of conquering  hero.  The   amount of  the dilution   in question   meant that the  resistance  price  of (to use  as example,   $NCLH) of $32 a   share  already  represented a  higher  price than the   pre-virus share  price.    Ditto  for the other  2.   Investors haven't seem   to have noticed,    however,  and these  stocks  still trade in the  general  range,  though the    resistance  level is now  more like 31/25/85.   Also,  the  sailing   schedules  for  the domestic  cruise ships has been  pushed   back as a   result of   somebody high up at  the CDC obviously  shorting   these  stocks,  as  that's  the only  explanation for why they're  so   focused  on trying to   send these  companies to 0  by preventing   sailings.   Norwegian is  resuming  cruises  outside the US in the next   couple of   months.\n\n**What the smart play is today:**          These 3 companies are no longer as attractive as a result of  the        dilution, but they're still good swing traders within their     respective     channels.  I'd put up a picture of some charts to show     those, but I     already told you where the resistance is, grow a     wrinkle and learn  where    support is.\n\nI      have since   exited  my positions in $CCL (and was never in $RCL),    and   have   drastically  reduced my holdings in $NCLH, but I do still     maintain a    skeleton crew  of January calls for them.\n\n**Trade rating:**          9/10.  It was really hard to fuck this one up, unless you just       didn't   believe me. And it's still a live trade.  The only thing I       could have   done better was post it sooner, but I make sure my   trades     are   established and going the right way before I talk about   them in     depth.\n\nDD #5:  The Semiconductors:  Original Date February 26th, 2021\n\nAnd     before you ask, yes it is.  Took this the other day when I decided  to    start working on this. In retrospect, should have washed first.\n\n**URL:** [For you poor, broke ass souls who missed it](https://www.reddit.com/r/wallstreetbets/comments/lt89s3/nrdrages_friday_dd_the_semis_play_not_just_the/)\n\n**Original Thesis:**      While everybody was spooging over high end chipmakers like Theta     Semiconductor, $AMD, and $NVDA (and, to be fair, I had been telling     people to buy $NVDA 545/580c's, which were all multibaggers), the real     action was in the commodity level chipmaker space, specifically   American   companies (or companies that could masquerade as them) who   would line   up to the trough to get some free government money to go   from being   nofab to fab companies.\n\n**Original Price Target:**      $NXPI 200-210 within 3 months; $ON to within 43 within 3 months,    $MRVL  to 75 within that same range.  And I didn't give a price target    for  $UTZ, just that it would go up.\n\n**How did it work out:**      LAMBOS for almost everyone!  Supposing you could order one, given    that  they can't get the chips they need to build the cars.    $NXPI  got   to  214 before pulling back to 202.  $ON hit 43 2 weeks before I    predicted  it would.  $MRVL failed to live up to expectations and has    been  essentially dead money since that posting, but if you'll recall I    was  very explicit that I was bullish on them ONLY as a 5G play,   whereas  the  others I felt had more range and scope.  So short-term   $MRVL play  was a  loser if you moved up the timeline I liked.  Oh, and   $UTZ printed  for  everybody that just bought in because they liked the   product.  It  was a  nice little pocket play.\n\n**What's happened since then:**      The trade ran its course to perfection.  As I've been saying for a     little while now, semis, with the exception of $NVDA, are not  presently    an interesting trade because there's been a rotation out of  them  after   this period of growth.  I am still incredibly bullish on  the  sector as a   whole, but they need a breather and some time out of  the  sun before   continuing a leg up.  They're not even good rangebound   trades right now.    And LOL @ any of you clowns who bought $TSM  anyways  because Cramer  and his cult of Shortbus All-Stars  told you  they were  the best in breed.  Suckers.   In the case of $MRVL, they  acquired  another company and now are going  to \"officially\" become a US  company  instead of that tax dodging shit  they've been pulling, which  means the  thesis about them lining up for  gubmint money is sound and  will happen  down the road.\n\n**What the smart play is today:**     Ignore semis till at least June; probably July.  I have exited out  of   all of my positions and have taken immense profits from the  commodity   semis.  I similarly got rid of my $NVDA calls at the top,  though I am   willing to find a re-entry point in the 575 range if it  happens.  Don't   be sad that the trade is over, be glad that it  happened and you might   have been there.  Or at least be happy that I  was there and am   appreciative that I got to stack a bunch more paper  I'll never spend.    Either way.\n\n**Trade rating:**  9/10.  Absolutely perfect call, with only $MRVL being the laggard, but it came with the appropriate warning.\n\nDD #6:  $CLNE.  Original Date March 5th, 2021\n\n📷\n\n**URL:** [Got buried in a mountain of Gibbons doing dumbass \"DD\" on their stonk](https://www.reddit.com/r/wallstreetbets/comments/lye7st/nrdrages_friday_dd_ok_one_of_you_apes_needs_to/)\n\n**Original Thesis:**     People are finally willing to take greenhouse gas emission capture    seriously, and the infrastructure and transport sector is finally ready    to start moving away from diesel and traditional oil based products  in   favor of carbon negative renewable natural gas - especially  companies   making carbon pledges or located in states where progressive  leadership   is going to demand emission reduction.  $CLNE was uniquely  positioned  as  the nation's leading provider of that fuel source and,  unlike all  the  other green energy EV/charging companies out there,  actually has a  real  product that they sell in large quantities, making  it a diamond in  the  otherwise pipe dream green energy space.\n\n**Original Price Target:**  $17 by late May, $31 by next March\n\n**How did it work out:**     I said to buy it as soon as it got under 11.  It got under 11 the   very  next trading day.  Then immediately shot up almost 50% within 10   days  and was one of the few stocks out there consistently finishing   green  while the entire market was tanking.  As long as you played it   smart and  heeded warnings about stonks not always just going up and   taking profit  after parabolic rises and looking for re-entries later,   then you made  enough money to put RNG high powered engines in both your   boat from  cruise stocks and your Lambo from semis and convert your   entire house to  being powered by cow farts before the green energy   sector got  skullfucked.  If you held, you'll feel this trade didn't   work out  (though it still will, if you picked the June target date like   I said)  and, if you re-entered after taking profits, you've either   been  averaging down lately as this has been getting unfairly dragged   down  with the entire green energy sector or else you're underwater on    it....but you'll still be fine.\n\n**What's happened since then:**     A LOT.  From them getting dragged down from the mid 15's all the way    to below 10 on nothing but good news to them signing major  partnerships   with $BP, Total and Citgo, to signing a half a billion  dollar deal  with  $AMZN to power their long-haul fleet with RNG to  Washington DC  flat-out  stating that methane capture is a capstone of  their green  energy plan,  there has been nothing but good news coming  out of this  company.  And  yet It got absolutely PUMMELED with the  sector for the  last month, and  then this past week started Monday  morning up 27% only  to not only give  all of those gains back but lose  another 20% by the  close of trading  Tuesday because of a combination  of market  manipulation by a hedge fund  that shorted the stock into  oblivion for a  hit and run (do a search on my profile by posts and look  up my Wednesday discussion if you want to be absolutely fucking  infuriated that someone borderline committed a crime) coupled with them  paying off an",
        "subreddit": "wallstreetbets",
        "title": "Troubleshooting autofilter, don't pay attention",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mxq00v/troubleshooting_autofilter_dont_pay_attention/",
        "created": 1619318267.0
    },
    {
        "author": "NrdRage",
        "created_utc": 1619289915,
        "id": "mxq5qj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nDD #4:  Cruise lines.  Original Date February 19th, 2021📷\n\nNot mine.  But I wants it.\n\nURL:  [For you poor bastards who missed this boat](https://www.reddit.com/r/wallstreetbets/comments/lnpqrp/nrdrages_friday_dd_the_bermuda_triangle_and_you/)\n\n**Original Thesis:**           The cruise liners were one of the last Wuhan-fucked plays out      there     who hadn't taken a true turn at the recovery wheel just  yet.      Which   made   them smooth sailing for easy tendies\n\n**Original Price Target January 2022:**           $NCLH 46, $CCL/$CUK 47/42 respectively, $RCL $90.  My  positions      were    established a month and a half before the DD, so  my cost   basis    was    different.  I was holding 700 1/22 25c's in  $CCL and   2000 1/23    $42.5c's    in $NCLH.\n\n**How did it work out:**           If you jumped in shortly thereafter and played the stocks   right,     you    made enough to buy your own boat.  Sure, maybe it was a   17'     Bayliner    that all the women at the marina called \"adorable\"   and  were    clearly    conflating towards what they assumed was your    pathetic 2.5\"    penis size    at diamond hardness, but it floated, it    had an engine,   and  dammit, it    was yours and you had enough left    over for a   captain's  hat and a bunch    of beer money.  This one  was   hard to screw   up -  especially since it  was   the first one I   started  providing   updates on  and made sure  everybody   knew to take   profits  at 32 on   NCLH and buy  back at 29 (and  to continue     playing that  range), etc.    People in  these from the date  of posting   who   didn't  just buy and   hold likely  have turned at least a 6    bagger by now.     This trade was,   and to some  extent is, still solid    gold.\n\n**What's happened since then:**           In spite of none of the companies in question needing to issue        shares   as they had enough cash on hand, $RCL issued shortly  after    that    DD,  $CCL  immediately copied them, and $NCLH followed  suit a    couple   of  weeks   after $CCL.  At least none of them tried  to pull  an   $AMC  and   have the   CEO go on TV and give zero credit  to retail    investors  for   saving the   company and instead taking  all the  credit   before  diluting   and then   paying himself a fat ass  bonus  for doing   nothing  but issuing   shares like   some sort of  conquering  hero.  The   amount of  the dilution   in question   meant  that the  resistance  price  of (to use  as example,   $NCLH) of $32 a    share  already  represented a  higher  price than the   pre-virus share   price.    Ditto  for the other  2.   Investors haven't seem   to have  noticed,    however,  and these  stocks  still trade in the  general   range,  though the    resistance  level is now  more like 31/25/85.    Also,  the  sailing   schedules  for  the domestic  cruise ships has  been  pushed   back as a   result of   somebody high up at  the CDC  obviously  shorting   these  stocks,  as  that's  the only  explanation  for why they're  so   focused  on trying to   send these  companies to 0   by preventing   sailings.   Norwegian is  resuming  cruises  outside  the US in the next   couple of   months.\n\n**What the smart play is today:**           These 3 companies are no longer as attractive as a result of   the        dilution, but they're still good swing traders within their      respective     channels.  I'd put up a picture of some charts to show      those, but I     already told you where the resistance is, grow a      wrinkle and learn  where    support is.\n\nI       have since   exited  my positions in $CCL (and was never in $RCL),     and   have   drastically  reduced my holdings in $NCLH, but I do  still     maintain a    skeleton crew  of January calls for them.\n\n**Trade rating:**           9/10.  It was really hard to fuck this one up, unless you just        didn't   believe me. And it's still a live trade.  The only thing  I       could have   done better was post it sooner, but I make sure my    trades     are   established and going the right way before I talk  about   them in     depth.\n\nDD #5:  The Semiconductors:  Original Date February 26th, 2021\n\nAnd      before you ask, yes it is.  Took this the other day when I decided   to    start working on this. In retrospect, should have washed first.\n\n**URL:** [For you poor, broke ass souls who missed it](https://www.reddit.com/r/wallstreetbets/comments/lt89s3/nrdrages_friday_dd_the_semis_play_not_just_the/)\n\n**Original Thesis:**       While everybody was spooging over high end chipmakers like Theta      Semiconductor, $AMD, and $NVDA (and, to be fair, I had been telling      people to buy $NVDA 545/580c's, which were all multibaggers), the  real     action was in the commodity level chipmaker space, specifically    American   companies (or companies that could masquerade as them) who    would line   up to the trough to get some free government money to go    from being   nofab to fab companies.\n\n**Original Price Target:**       $NXPI 200-210 within 3 months; $ON to within 43 within 3 months,     $MRVL  to 75 within that same range.  And I didn't give a price target     for  $UTZ, just that it would go up.\n\n**How did it work out:**       LAMBOS for almost everyone!  Supposing you could order one, given     that  they can't get the chips they need to build the cars.    $NXPI   got   to  214 before pulling back to 202.  $ON hit 43 2 weeks before I     predicted  it would.  $MRVL failed to live up to expectations and has     been  essentially dead money since that posting, but if you'll  recall I    was  very explicit that I was bullish on them ONLY as a 5G  play,   whereas  the  others I felt had more range and scope.  So  short-term   $MRVL play  was a  loser if you moved up the timeline I  liked.  Oh, and   $UTZ printed  for  everybody that just bought in  because they liked the   product.  It  was a  nice little pocket play.\n\n**What's happened since then:**       The trade ran its course to perfection.  As I've been saying for a      little while now, semis, with the exception of $NVDA, are not   presently    an interesting trade because there's been a rotation out of   them  after   this period of growth.  I am still incredibly bullish on   the  sector as a   whole, but they need a breather and some time out  of  the  sun before   continuing a leg up.  They're not even good  rangebound   trades right now.    And LOL @ any of you clowns who bought  $TSM  anyways  because Cramer  and his cult of Shortbus All-Stars  told  you  they were  the best in breed.  Suckers.   In the case of $MRVL,  they  acquired  another company and now are going  to \"officially\"  become a US  company  instead of that tax dodging shit  they've been  pulling, which  means the  thesis about them lining up for  gubmint  money is sound and  will happen  down the road.\n\n**What the smart play is today:**      Ignore semis till at least June; probably July.  I have exited out   of   all of my positions and have taken immense profits from the   commodity   semis.  I similarly got rid of my $NVDA calls at the top,   though I am   willing to find a re-entry point in the 575 range if it   happens.  Don't   be sad that the trade is over, be glad that it   happened and you might   have been there.  Or at least be happy that I   was there and am   appreciative that I got to stack a bunch more paper   I'll never spend.    Either way.\n\n**Trade rating:**  9/10.  Absolutely perfect call, with only $MRVL being the laggard, but it came with the appropriate warning.\n\nDD #6:  $CLNE.  Original Date March 5th, 2021\n\n📷\n\n**URL:** [Got buried in a mountain of Gibbons doing dumbass \"DD\" on their stonk](https://www.reddit.com/r/wallstreetbets/comments/lye7st/nrdrages_friday_dd_ok_one_of_you_apes_needs_to/)\n\n**Original Thesis:**      People are finally willing to take greenhouse gas emission capture     seriously, and the infrastructure and transport sector is finally  ready    to start moving away from diesel and traditional oil based  products  in   favor of carbon negative renewable natural gas -  especially  companies   making carbon pledges or located in states where  progressive  leadership   is going to demand emission reduction.  $CLNE  was uniquely  positioned  as  the nation's leading provider of that  fuel source and,  unlike all  the  other green energy EV/charging  companies out there,  actually has a  real  product that they sell in  large quantities, making  it a diamond in  the  otherwise pipe dream  green energy space.\n\n**Original Price Target:**  $17 by late May, $31 by next March\n\n**How did it work out:**      I said to buy it as soon as it got under 11.  It got under 11 the    very  next trading day.  Then immediately shot up almost 50% within 10    days  and was one of the few stocks out there consistently finishing    green  while the entire market was tanking.  As long as you played it    smart and  heeded warnings about stonks not always just going up and    taking profit  after parabolic rises and looking for re-entries later,    then you made  enough money to put RNG high powered engines in both  your   boat from  cruise stocks and your Lambo from semis and convert  your   entire house to  being powered by cow farts before the green  energy   sector got  skullfucked.  If you held, you'll feel this trade  didn't   work out  (though it still will, if you picked the June target  date like   I said)  and, if you re-entered after taking profits, you've  either   been  averaging down lately as this has been getting unfairly  dragged   down  with the entire green energy sector or else you're  underwater on    it....but you'll still be fine.\n\n**What's happened since then:**      A LOT.  From them getting dragged down from the mid 15's all the  way    to below 10 on nothing but good news to them signing major   partnerships   with $BP, Total and Citgo, to signing a half a billion   dollar deal  with  $AMZN to power their long-haul fleet with RNG to   Washington DC  flat-out  stating that methane capture is a capstone of   their green  energy plan,  there has been nothing but good news coming   out of this  company.  And  yet It got absolutely PUMMELED with the   sector for the  last month, and  then this past week started Monday   morning up 27% only  to not only give  all of those gains back but lose   another 20% by the  close of trading  Tuesday because of a combination   of market  manipulation by a hedge fund  that shorted the stock into   oblivion for a  hit and run (do a search on my profile by posts and look   up my Wednesday discussion if you want to be absolutely fucking   infuriated that someone borderline committed a crime) coupled with them   paying off an analyst at RayJay to run a hit piece on the $AMZN deal to   try and sink  the stock price even lower, right down to that hedge  fund  suppressing  the price of the stock for 2 weeks to keep it under  $12 so  the most  popular options for April would expire worthless.   This  company has, in  short, been subjected to a biblical level of  fuckery  that was probably  was some Mortimer Brothers bullshit for a $1  bet, and  it's still  standing and ready to spring. Oh, and somebody  informed  me that they  got some airtime on Cramer's show on the 24th.   Jimmy Retard  is luekwarm on  them, and you should always inverse him,  so balls to the  wall, baby.   Especially since he tried to compare the  2009 version of  this company  (when nobody gave 2 shits about nat gas)  with the 2021  version (where  governments are going to force people  into this type of  product and the  transport industry is finally  transitioning away from  oil).",
        "subreddit": "wallstreetbets",
        "title": "Troubleshooting autofilter, pay no attention",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mxq5qj/troubleshooting_autofilter_pay_no_attention/",
        "created": 1619318715.0
    },
    {
        "author": "NrdRage",
        "created_utc": 1619289349,
        "id": "mxpymz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nDD #4:  Cruise lines.  Original Date February 19th, 2021📷\n\nNot mine.  But I wants it.\n\nURL:  [For you poor bastards who missed this boat](https://www.reddit.com/r/wallstreetbets/comments/lnpqrp/nrdrages_friday_dd_the_bermuda_triangle_and_you/)\n\n**Original Thesis:**         The cruise liners were one of the last Wuhan-fucked plays out    there     who hadn't taken a true turn at the recovery wheel just yet.     Which   made   them smooth sailing for easy tendies\n\n**Original Price Target January 2022:**         $NCLH 46, $CCL/$CUK 47/42 respectively, $RCL $90.  My positions     were    established a month and a half before the DD, so my cost  basis    was    different.  I was holding 700 1/22 25c's in $CCL and  2000 1/23    $42.5c's    in $NCLH.\n\n**How did it work out:**         If you jumped in shortly thereafter and played the stocks right,     you    made enough to buy your own boat.  Sure, maybe it was a 17'     Bayliner    that all the women at the marina called \"adorable\" and  were    clearly    conflating towards what they assumed was your  pathetic 2.5\"    penis size    at diamond hardness, but it floated, it  had an engine,   and  dammit, it    was yours and you had enough left  over for a   captain's  hat and a bunch    of beer money.  This one was  hard to screw   up -  especially since it  was   the first one I started  providing   updates on  and made sure  everybody   knew to take profits  at 32 on   NCLH and buy  back at 29 (and  to continue   playing that  range), etc.    People in  these from the date  of posting who   didn't  just buy and   hold likely  have turned at least a 6  bagger by now.     This trade was,   and to some  extent is, still solid  gold.\n\n**What's happened since then:**         In spite of none of the companies in question needing to issue      shares   as they had enough cash on hand, $RCL issued shortly after   that    DD,  $CCL  immediately copied them, and $NCLH followed suit a   couple   of  weeks   after $CCL.  At least none of them tried to pull an   $AMC  and   have the   CEO go on TV and give zero credit to retail   investors  for   saving the   company and instead taking all the credit   before  diluting   and then   paying himself a fat ass bonus for doing   nothing  but issuing   shares like   some sort of conquering hero.  The   amount of  the dilution   in question   meant that the resistance  price  of (to use  as example,   $NCLH) of $32 a   share already  represented a  higher  price than the   pre-virus share  price.   Ditto  for the other  2.   Investors haven't seem   to have noticed,   however,  and these  stocks  still trade in the  general  range, though the    resistance  level is now  more like 31/25/85.   Also,  the sailing   schedules  for  the domestic  cruise ships has been  pushed  back as a   result of   somebody high up at  the CDC obviously  shorting  these  stocks,  as  that's  the only  explanation for why they're  so  focused  on trying to   send these  companies to 0  by preventing  sailings.   Norwegian is  resuming  cruises  outside the US in the next  couple of   months.\n\n**What the smart play is today:**         These 3 companies are no longer as attractive as a result of the        dilution, but they're still good swing traders within their    respective     channels.  I'd put up a picture of some charts to show    those, but I     already told you where the resistance is, grow a    wrinkle and learn  where    support is.\n\nI     have since   exited  my positions in $CCL (and was never in $RCL),   and   have   drastically  reduced my holdings in $NCLH, but I do still    maintain a    skeleton crew  of January calls for them.\n\n**Trade rating:**         9/10.  It was really hard to fuck this one up, unless you just      didn't   believe me. And it's still a live trade.  The only thing I      could have   done better was post it sooner, but I make sure my  trades     are   established and going the right way before I talk about  them in     depth.\n\nDD #5:  The Semiconductors:  Original Date February 26th, 2021\n\nAnd    before you ask, yes it is.  Took this the other day when I decided to    start working on this. In retrospect, should have washed first.\n\n**URL:** [For you poor, broke ass souls who missed it](https://www.reddit.com/r/wallstreetbets/comments/lt89s3/nrdrages_friday_dd_the_semis_play_not_just_the/)\n\n**Original Thesis:**     While everybody was spooging over high end chipmakers like Theta    Semiconductor, $AMD, and $NVDA (and, to be fair, I had been telling    people to buy $NVDA 545/580c's, which were all multibaggers), the real    action was in the commodity level chipmaker space, specifically  American   companies (or companies that could masquerade as them) who  would line   up to the trough to get some free government money to go  from being   nofab to fab companies.\n\n**Original Price Target:**     $NXPI 200-210 within 3 months; $ON to within 43 within 3 months,   $MRVL  to 75 within that same range.  And I didn't give a price target   for  $UTZ, just that it would go up.\n\n**How did it work out:**     LAMBOS for almost everyone!  Supposing you could order one, given   that  they can't get the chips they need to build the cars.    $NXPI got   to  214 before pulling back to 202.  $ON hit 43 2 weeks before I   predicted  it would.  $MRVL failed to live up to expectations and has   been  essentially dead money since that posting, but if you'll recall I   was  very explicit that I was bullish on them ONLY as a 5G play,  whereas  the  others I felt had more range and scope.  So short-term  $MRVL play  was a  loser if you moved up the timeline I liked.  Oh, and  $UTZ printed  for  everybody that just bought in because they liked the  product.  It  was a  nice little pocket play.\n\n**What's happened since then:**     The trade ran its course to perfection.  As I've been saying for a    little while now, semis, with the exception of $NVDA, are not presently    an interesting trade because there's been a rotation out of them  after   this period of growth.  I am still incredibly bullish on the  sector as a   whole, but they need a breather and some time out of the  sun before   continuing a leg up.  They're not even good rangebound  trades right now.    And LOL @ any of you clowns who bought $TSM anyways  because Cramer  and his cult of Shortbus All-Stars  told you they were  the best in breed.  Suckers.   In the case of $MRVL, they acquired  another company and now are going  to \"officially\" become a US company  instead of that tax dodging shit  they've been pulling, which means the  thesis about them lining up for  gubmint money is sound and will happen  down the road.\n\n**What the smart play is today:**    Ignore semis till at least June; probably July.  I have exited out of   all of my positions and have taken immense profits from the commodity   semis.  I similarly got rid of my $NVDA calls at the top, though I am   willing to find a re-entry point in the 575 range if it happens.  Don't   be sad that the trade is over, be glad that it happened and you might   have been there.  Or at least be happy that I was there and am   appreciative that I got to stack a bunch more paper I'll never spend.    Either way.\n\n**Trade rating:**  9/10.  Absolutely perfect call, with only $MRVL being the laggard, but it came with the appropriate warning.\n\nDD #6:  $CLNE.  Original Date March 5th, 2021\n\n📷\n\n**URL:** [Got buried in a mountain of Gibbons doing dumbass \"DD\" on their stonk](https://www.reddit.com/r/wallstreetbets/comments/lye7st/nrdrages_friday_dd_ok_one_of_you_apes_needs_to/)\n\n**Original Thesis:**    People are finally willing to take greenhouse gas emission capture   seriously, and the infrastructure and transport sector is finally ready   to start moving away from diesel and traditional oil based products in   favor of carbon negative renewable natural gas - especially companies   making carbon pledges or located in states where progressive leadership   is going to demand emission reduction.  $CLNE was uniquely positioned  as  the nation's leading provider of that fuel source and, unlike all  the  other green energy EV/charging companies out there, actually has a  real  product that they sell in large quantities, making it a diamond in  the  otherwise pipe dream green energy space.\n\n**Original Price Target:**  $17 by late May, $31 by next March\n\n**How did it work out:**    I said to buy it as soon as it got under 11.  It got under 11 the  very  next trading day.  Then immediately shot up almost 50% within 10  days  and was one of the few stocks out there consistently finishing  green  while the entire market was tanking.  As long as you played it  smart and  heeded warnings about stonks not always just going up and  taking profit  after parabolic rises and looking for re-entries later,  then you made  enough money to put RNG high powered engines in both your  boat from  cruise stocks and your Lambo from semis and convert your  entire house to  being powered by cow farts before the green energy  sector got  skullfucked.  If you held, you'll feel this trade didn't  work out  (though it still will, if you picked the June target date like  I said)  and, if you re-entered after taking profits, you've either  been  averaging down lately as this has been getting unfairly dragged  down  with the entire green energy sector or else you're underwater on   it....but you'll still be fine.\n\n**What's happened since then:**    A LOT.  From them getting dragged down from the mid 15's all the way   to below 10 on nothing but good news to them signing major partnerships   with $BP, Total and Citgo, to signing a half a billion dollar deal  with  $AMZN to power their long-haul fleet with RNG to Washington DC  flat-out  stating that methane capture is a capstone of their green  energy plan,  there has been nothing but good news coming out of this  company.  And  yet It got absolutely PUMMELED with the sector for the  last month, and  then this past week started Monday morning up 27% only  to not only give  all of those gains back but lose another 20% by the  close of trading  Tuesday because of a combination of market  manipulation by a hedge fund  that shorted the stock into oblivion for a  hit and run (do a search on my profile by posts and look up my Wednesday discussion if you want to be absolutely fucking infuriated that someone borderline committed a crime).",
        "subreddit": "wallstreetbets",
        "title": "Don't pay attention to this post, troubleshooting autofilters",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mxpymz/dont_pay_attention_to_this_post_troubleshooting/",
        "created": 1619318149.0
    },
    {
        "author": "NrdRage",
        "created_utc": 1619290055,
        "id": "mxq7fx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nDD #4:  Cruise lines.  Original Date February 19th, 2021📷\n\nNot mine.  But I wants it.\n\nURL:  [For you poor bastards who missed this boat](https://www.reddit.com/r/wallstreetbets/comments/lnpqrp/nrdrages_friday_dd_the_bermuda_triangle_and_you/)\n\n**Original Thesis:**            The cruise liners were one of the last Wuhan-fucked plays out       there     who hadn't taken a true turn at the recovery wheel just   yet.      Which   made   them smooth sailing for easy tendies\n\n**Original Price Target January 2022:**            $NCLH 46, $CCL/$CUK 47/42 respectively, $RCL $90.  My   positions      were    established a month and a half before the DD, so   my cost   basis    was    different.  I was holding 700 1/22 25c's in   $CCL and   2000 1/23    $42.5c's    in $NCLH.\n\n**How did it work out:**            If you jumped in shortly thereafter and played the stocks    right,     you    made enough to buy your own boat.  Sure, maybe it was a    17'     Bayliner    that all the women at the marina called  \"adorable\"   and  were    clearly    conflating towards what they  assumed was your    pathetic 2.5\"    penis size    at diamond hardness,  but it floated, it    had an engine,   and  dammit, it    was yours and  you had enough left    over for a   captain's  hat and a bunch    of  beer money.  This one  was   hard to screw   up -  especially since it   was   the first one I   started  providing   updates on  and made sure   everybody   knew to take   profits  at 32 on   NCLH and buy  back at 29  (and  to continue     playing that  range), etc.    People in  these  from the date  of posting   who   didn't  just buy and   hold likely   have turned at least a 6    bagger by now.     This trade was,   and to  some  extent is, still solid    gold.\n\n**What's happened since then:**            In spite of none of the companies in question needing to  issue        shares   as they had enough cash on hand, $RCL issued  shortly  after    that    DD,  $CCL  immediately copied them, and $NCLH  followed  suit a    couple   of  weeks   after $CCL.  At least none of  them tried  to pull  an   $AMC  and   have the   CEO go on TV and give  zero credit  to retail    investors  for   saving the   company and  instead taking  all the  credit   before  diluting   and then   paying  himself a fat ass  bonus  for doing   nothing  but issuing   shares like    some sort of  conquering  hero.  The   amount of  the dilution   in  question   meant  that the  resistance  price  of (to use  as example,    $NCLH) of $32 a    share  already  represented a  higher  price than  the   pre-virus share   price.    Ditto  for the other  2.   Investors  haven't seem   to have  noticed,    however,  and these  stocks  still  trade in the  general   range,  though the    resistance  level is now   more like 31/25/85.    Also,  the  sailing   schedules  for  the  domestic  cruise ships has  been  pushed   back as a   result of    somebody high up at  the CDC  obviously  shorting   these  stocks,  as   that's  the only  explanation  for why they're  so   focused  on trying  to   send these  companies to 0   by preventing   sailings.   Norwegian  is  resuming  cruises  outside  the US in the next   couple of   months.\n\n**What the smart play is today:**            These 3 companies are no longer as attractive as a result of    the        dilution, but they're still good swing traders within their       respective     channels.  I'd put up a picture of some charts to  show      those, but I     already told you where the resistance is,  grow a      wrinkle and learn  where    support is.\n\nI        have since   exited  my positions in $CCL (and was never in  $RCL),     and   have   drastically  reduced my holdings in $NCLH, but I  do  still     maintain a    skeleton crew  of January calls for them.\n\n**Trade rating:**            9/10.  It was really hard to fuck this one up, unless you  just        didn't   believe me. And it's still a live trade.  The only  thing  I       could have   done better was post it sooner, but I make  sure my    trades     are   established and going the right way before I  talk  about   them in     depth.\n\nDD #5:  The Semiconductors:  Original Date February 26th, 2021\n\nAnd       before you ask, yes it is.  Took this the other day when I decided    to    start working on this. In retrospect, should have washed first.\n\n**URL:** [For you poor, broke ass souls who missed it](https://www.reddit.com/r/wallstreetbets/comments/lt89s3/nrdrages_friday_dd_the_semis_play_not_just_the/)\n\n**Original Thesis:**        While everybody was spooging over high end chipmakers like Theta       Semiconductor, $AMD, and $NVDA (and, to be fair, I had been telling       people to buy $NVDA 545/580c's, which were all multibaggers), the   real     action was in the commodity level chipmaker space,  specifically    American   companies (or companies that could masquerade  as them) who    would line   up to the trough to get some free  government money to go    from being   nofab to fab companies.\n\n**Original Price Target:**        $NXPI 200-210 within 3 months; $ON to within 43 within 3 months,      $MRVL  to 75 within that same range.  And I didn't give a price  target     for  $UTZ, just that it would go up.\n\n**How did it work out:**        LAMBOS for almost everyone!  Supposing you could order one, given      that  they can't get the chips they need to build the cars.     $NXPI   got   to  214 before pulling back to 202.  $ON hit 43 2 weeks  before I     predicted  it would.  $MRVL failed to live up to  expectations and has     been  essentially dead money since that  posting, but if you'll  recall I    was  very explicit that I was  bullish on them ONLY as a 5G  play,   whereas  the  others I felt had  more range and scope.  So  short-term   $MRVL play  was a  loser if you  moved up the timeline I  liked.  Oh, and   $UTZ printed  for  everybody  that just bought in  because they liked the   product.  It  was a  nice  little pocket play.\n\n**What's happened since then:**        The trade ran its course to perfection.  As I've been saying for a       little while now, semis, with the exception of $NVDA, are not    presently    an interesting trade because there's been a rotation out of    them  after   this period of growth.  I am still incredibly bullish  on   the  sector as a   whole, but they need a breather and some time  out  of  the  sun before   continuing a leg up.  They're not even good   rangebound   trades right now.    And LOL @ any of you clowns who bought   $TSM  anyways  because Cramer  and his cult of Shortbus All-Stars   told  you  they were  the best in breed.  Suckers.   In the case of  $MRVL,  they  acquired  another company and now are going  to  \"officially\"  become a US  company  instead of that tax dodging shit   they've been  pulling, which  means the  thesis about them lining up for   gubmint  money is sound and  will happen  down the road.\n\n**What the smart play is today:**       Ignore semis till at least June; probably July.  I have exited out    of   all of my positions and have taken immense profits from the    commodity   semis.  I similarly got rid of my $NVDA calls at the top,    though I am   willing to find a re-entry point in the 575 range if it    happens.  Don't   be sad that the trade is over, be glad that it    happened and you might   have been there.  Or at least be happy that I    was there and am   appreciative that I got to stack a bunch more paper    I'll never spend.    Either way.\n\n**Trade rating:**  9/10.  Absolutely perfect call, with only $MRVL being the laggard, but it came with the appropriate warning.\n\nDD #6:  $CLNE.  Original Date March 5th, 2021\n\n📷\n\n**URL:** [Got buried in a mountain of Gibbons doing dumbass \"DD\" on their stonk](https://www.reddit.com/r/wallstreetbets/comments/lye7st/nrdrages_friday_dd_ok_one_of_you_apes_needs_to/)\n\n**Original Thesis:**       People are finally willing to take greenhouse gas emission capture      seriously, and the infrastructure and transport sector is finally   ready    to start moving away from diesel and traditional oil based   products  in   favor of carbon negative renewable natural gas -   especially  companies   making carbon pledges or located in states where   progressive  leadership   is going to demand emission reduction.   $CLNE  was uniquely  positioned  as  the nation's leading provider of  that  fuel source and,  unlike all  the  other green energy EV/charging   companies out there,  actually has a  real  product that they sell in   large quantities, making  it a diamond in  the  otherwise pipe dream   green energy space.\n\n**Original Price Target:**  $17 by late May, $31 by next March\n\n**How did it work out:**       I said to buy it as soon as it got under 11.  It got under 11 the     very  next trading day.  Then immediately shot up almost 50% within  10    days  and was one of the few stocks out there consistently  finishing    green  while the entire market was tanking.  As long as you  played it    smart and  heeded warnings about stonks not always just  going up and    taking profit  after parabolic rises and looking for  re-entries later,    then you made  enough money to put RNG high powered  engines in both  your   boat from  cruise stocks and your Lambo from  semis and convert  your   entire house to  being powered by cow farts  before the green  energy   sector got  skullfucked.  If you held, you'll  feel this trade  didn't   work out  (though it still will, if you  picked the June target  date like   I said)  and, if you re-entered  after taking profits, you've  either   been  averaging down lately as  this has been getting unfairly  dragged   down  with the entire green  energy sector or else you're  underwater on    it....but you'll still be  fine.\n\n**What's happened since then:**       A LOT.  From them getting dragged down from the mid 15's all the   way    to below 10 on nothing but good news to them signing major    partnerships   with $BP, Total and Citgo, to signing a half a billion    dollar deal  with  $AMZN to power their long-haul fleet with RNG to    Washington DC  flat-out  stating that methane capture is a capstone of    their green  energy plan,  there has been nothing but good news coming    out of this  company.  And  yet It got absolutely PUMMELED with the    sector for the  last month, and  then this past week started Monday    morning up 27% only  to not only give  all of those gains back but lose    another 20% by the  close of trading  Tuesday because of a combination    of market  manipulation by a hedge fund  that shorted the stock into    oblivion for a  hit and run (do a search on my profile by posts and  look   up my Wednesday discussion if you want to be absolutely fucking    infuriated that someone borderline committed a crime) coupled with them    paying off an analyst at RayJay to run a hit piece on the $AMZN deal  to   try and sink  the stock price even lower, right down to that hedge   fund  suppressing  the price of the stock for 2 weeks to keep it under   $12 so  the most  popular options for April would expire worthless.    This  company has, in  short, been subjected to a biblical level of   fuckery  that was probably  was some Mortimer Brothers bullshit for a $1   bet, and  it's still  standing and ready to spring. Oh, and somebody   informed  me that they  got some airtime on Cramer's show on the 24th.    Jimmy Retard  is luekwarm on  them, and you should always inverse him,   so balls to the  wall, baby.   Especially since he tried to compare the   2009 version of  this company  (when nobody gave 2 shits about nat  gas)  with the 2021  version (where  governments are going to force  people  into this type of  product and the  transport industry is  finally  transitioning away from  oil).\n\nWhat  the smart play is today:    My thesis, as written back then, is EXACTLY  what I would write even   today.  I stand by every last thing in there,  including the strike date   and price, in spite of the hedge fund  bullshit that artificially tanked the stock for no reason other than  unmitigated greed.  It was my   favorite stock in the whole market then,  and it still is now, just   balanced against the knowledge that, as a  very small midcap bordering on   a small cap, it's easy to push around  and very clearly fucked some hedge fund manager's wife or something.",
        "subreddit": "wallstreetbets",
        "title": "Troubleshooting autofilter, pay no attention to this",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mxq7fx/troubleshooting_autofilter_pay_no_attention_to/",
        "created": 1619318855.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619037959,
        "id": "mvp0uf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, April 21, 2021**\n\nStocks reversed on Monday, rising on Wednesday for the first day in three sessions, with small-caps leading the way after a terrible run of performance in April. Despite Netflix (NFLX) sharply missing earnings expectations in terms of new paid subscribers, the tech-heavy Nasdaq (QQQ), while the Dow Jones (DIA) and S&amp;P 500 (SPY) remain near record levels. \n\nAfter a recent spike this week, the CBOE Volatility Index sank back to near 52-week lows, a sign that investor risk appetite is increasing. The VIX is known as the \"investor fear gauge,\" because it reflects investors' best predictions of near-term market volatility or risk. In general, the VIX rises during times of financial stress and falls during good economic times. David Kostin, chief US equity strategist at Goldman Sachs said, “The S&amp;P 500 has reached new highs while volatility has sharply declined. Low volatility has outweighed low correlations among stocks, driving return dispersion back below the long-term average. As the U.S. moves beyond key macro events such as the 2020 election, the $1.9 trillion fiscal stimulus package, and peak economic activity, we expect three defining themes for markets will be tax reform, infrastructure, and pricing power.”\n\nWhile Netflix (NFLX) sharply missed estimates, this earnings season has largely blown consensus estimates out of the water, with more than 81% of companies that have reported so far beating earnings expectations, according to a study by FactSet. However, despite the largely positive earnings, many stocks (apart from today) have failed to react positively to the news. It seems as more positive economic data is released in terms of consumer spending and unemployment, it takes more and more impressive results to convince investors to pile into the stock. This suggests there is froth in the markets given the sky-high valuation of some companies. \n\nWhite House chief medical advisor Dr. Anthony Fauci said he believes the U.S. will likely resume use of the Johnson &amp; Johnson Covid-19 vaccine as soon as Friday with a warning or restriction attached. The doctor said, “My estimate is that we will continue to use it in some form. I doubt very seriously if they just cancel it. I don’t think that’s going to happen. I do think that there will likely be some sort of warning or restriction or risk assessment. I don’t think it’s just going to go back and say, ‘Okay, everything’s fine. Go right back.’ I think it’ll likely say, ‘Okay, we’re going to use it, but be careful under these certain circumstances.”\n\n**Highlights**\n\n* The White House announced more than 200 million doses of the coronavirus vaccine have been distributed in the US, greatly surpassing original estimates of 100 million doses delivered in the first 100 days of Biden’s presidency. On the back of this robust distribution, all states are beginning to open back up.\n* Mortgage applications jumped 8.6% in the week ended April 16, marking the biggest jump since late January as mortgage rates pulled back following a surge, according to the Mortgage Bankers Association (MBA). \n* Ford Motor (F) is planning more downtime at five North American factories due to a global semiconductor shortage. \n* During yesterday’s virtual event, Apple (AAPL) announced a new slate of products set to include the companies own chip. The offering includes a new iMac, a new iPad, and a new tracking-device called Airtags.\n* Gisele Bündchen, supermodel and Tom Brady’s wife was announced as a special advisor for the CEO and board of directors in DraftKings. This is just the latest in a series of high-profile moves by DraftKings to establish itself as the premier sport-betting company. \n* After gapping up after earnings, Intuitive Surgical (ISRG) joined the ranks of healthcare companies worth $100 billion or more\n* After a series of high profile accidents including small children, the US Consumer Product Safety Commission advised consumer to not buy the treadmill if there are small kids or pets at home.This could affect the company's product-safety profile, a material category for the household and personal-goods sector. In response, Peloton (PTON) called the statements “inaccurate and misleading” and refused calls to recall their treadmill. The stock has been in freefall this week. \n* \\*\\***Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Abbott Labs (ABT) target raised by Morgan Stanley (MS) from $136 to $140 at Overweight. Stock currently around $120\n* Allegiant Travel (ALGT) target raised by Barclaays from $237 to $300 at Overweight. Stock currently around $231\n* Burlington Stores (BURL) target raised by Loop Capital from $325 to $365 at Buy. Stock currently around $319\n* Dell Technologies (DELL) with a host of target raises. Consensus price target $115 at Overweight. Stock currently around $101\n* Equinix (EQIX) target raised by Mizuho from $750 to $800 at Buy. Stock currently around $726\n* Facebook (FB) target raised by Cowen from $350 to $360 at Outperform. Stock currently around $303\n* Forward Air (FWRD) target raised by Raymond James from $95 to $100 at Outperform. Stock currently around $87 \n* Alphabet (GOOG,GOOGL) target raised by Cowen from $2400 to $2600 at Outperform. Stock currently around $2293\n* Goldman Sachs (GS) with a host of target raises. Consensus price target $410 at Outperform. Stock currently around $332\n* Jazz Pharma (JAZZ) target raised by Cantor Fitzgerald from $185 to $198 at Overweight. Stock currently around $168\n* JP Morgan (JPM) with three target raises. Stock currently around $150 \n   * DA Davidson from $179 to $182 at Buy\n   * Royal Bank of Canada from $150 to $160 \n   * Piper Sandler from $170 to $180\n* Lam Research (LRCX) target raised by Argus from $625 to $725 at Buy. Stock currently around $613\n* NXP Semiconductors (NXPI) target raised by Wells Fargo (WFC) from $193 to $235 at Overweight. Stock currently around $194\n* Penn National Gaming (PENN) target raised by Goldman Sachs (GS) from $153 to $158 at Buy. Stock currently around $89\n* Royal Caribbean (RCL) target raised by Goldman Sachs (GS) from $76 to $95 at Neutral\n* Snap (SNAP) target raised by Cowen from $86 to $88 at Outperform. Stock currently around $58\n* UPS with two target raises. Stock currently around $180\n   * Citigroup (C) from $190 to $200 at Neutral\n   * Raymond James from $195 to $200 at Strong-Buy\n\n“In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock prices, not risk, but it is an opportunity.” - Li Lu",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Wednesday, April 21, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mvp0uf/here_is_a_market_recap_for_today_wednesday_april/",
        "created": 1619066759.0
    },
    {
        "author": "Rel8hurtboys",
        "created_utc": 1619122763,
        "id": "mwds0p",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "NXP Semiconductors - SWOT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mwds0p/nxp_semiconductors_swot/",
        "created": 1619151563.0
    },
    {
        "author": "NrdRage",
        "created_utc": 1619288997,
        "id": "mxpu8d",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nDD #4:  Cruise lines.  Original Date February 19th, 2021📷\n\nNot mine.  But I wants it.\n\nURL:  [For you poor bastards who missed this boat](https://www.reddit.com/r/wallstreetbets/comments/lnpqrp/nrdrages_friday_dd_the_bermuda_triangle_and_you/)\n\n**Original Thesis:**       The cruise liners were one of the last Wuhan-fucked plays out  there     who hadn't taken a true turn at the recovery wheel just yet.   Which   made   them smooth sailing for easy tendies\n\n**Original Price Target January 2022:**       $NCLH 46, $CCL/$CUK 47/42 respectively, $RCL $90.  My positions   were    established a month and a half before the DD, so my cost basis   was    different.  I was holding 700 1/22 25c's in $CCL and 2000 1/23   $42.5c's    in $NCLH.\n\n**How did it work out:**       If you jumped in shortly thereafter and played the stocks right,   you    made enough to buy your own boat.  Sure, maybe it was a 17'   Bayliner    that all the women at the marina called \"adorable\" and were   clearly    conflating towards what they assumed was your pathetic 2.5\"   penis size    at diamond hardness, but it floated, it had an engine,  and  dammit, it    was yours and you had enough left over for a  captain's  hat and a bunch    of beer money.  This one was hard to screw  up -  especially since it  was   the first one I started providing  updates on  and made sure  everybody   knew to take profits at 32 on  NCLH and buy  back at 29 (and  to continue   playing that range), etc.   People in  these from the date  of posting who   didn't just buy and  hold likely  have turned at least a 6  bagger by now.    This trade was,  and to some  extent is, still solid  gold.\n\n**What's happened since then:**       In spite of none of the companies in question needing to issue    shares   as they had enough cash on hand, $RCL issued shortly after that    DD,  $CCL  immediately copied them, and $NCLH followed suit a couple   of  weeks   after $CCL.  At least none of them tried to pull an $AMC  and   have the   CEO go on TV and give zero credit to retail investors  for   saving the   company and instead taking all the credit before  diluting   and then   paying himself a fat ass bonus for doing nothing  but issuing   shares like   some sort of conquering hero.  The amount of  the dilution   in question   meant that the resistance price of (to use  as example,   $NCLH) of $32 a   share already represented a higher  price than the   pre-virus share  price.   Ditto for the other 2.   Investors haven't seem   to have noticed,   however, and these stocks  still trade in the  general  range, though the   resistance level is now  more like 31/25/85.   Also,  the sailing  schedules  for the domestic  cruise ships has been  pushed  back as a  result of  somebody high up at  the CDC obviously  shorting  these stocks,  as that's  the only  explanation for why they're  so  focused on trying to  send these  companies to 0  by preventing  sailings.  Norwegian is resuming  cruises  outside the US in the next  couple of  months.\n\n**What the smart play is today:**       These 3 companies are no longer as attractive as a result of the      dilution, but they're still good swing traders within their  respective     channels.  I'd put up a picture of some charts to show  those, but I     already told you where the resistance is, grow a  wrinkle and learn  where    support is.\n\nI   have since   exited  my positions in $CCL (and was never in $RCL), and   have   drastically  reduced my holdings in $NCLH, but I do still  maintain a    skeleton crew  of January calls for them.\n\n**Trade rating:**       9/10.  It was really hard to fuck this one up, unless you just    didn't   believe me. And it's still a live trade.  The only thing I    could have   done better was post it sooner, but I make sure my trades    are   established and going the right way before I talk about them in    depth.\n\n&amp;#x200B;\n\n DD #5:  The Semiconductors:  Original Date February 26th, 2021\n\nAnd  before you ask, yes it is.  Took this the other day when I decided to  start working on this. In retrospect, should have washed first.\n\n**URL:** [For you poor, broke ass souls who missed it](https://www.reddit.com/r/wallstreetbets/comments/lt89s3/nrdrages_friday_dd_the_semis_play_not_just_the/)\n\n**Original Thesis:**   While everybody was spooging over high end chipmakers like Theta  Semiconductor, $AMD, and $NVDA (and, to be fair, I had been telling  people to buy $NVDA 545/580c's, which were all multibaggers), the real  action was in the commodity level chipmaker space, specifically American  companies (or companies that could masquerade as them) who would line  up to the trough to get some free government money to go from being  nofab to fab companies.\n\n**Original Price Target:**   $NXPI 200-210 within 3 months; $ON to within 43 within 3 months, $MRVL  to 75 within that same range.  And I didn't give a price target for  $UTZ, just that it would go up.\n\n**How did it work out:**   LAMBOS for almost everyone!  Supposing you could order one, given that  they can't get the chips they need to build the cars.    $NXPI got to  214 before pulling back to 202.  $ON hit 43 2 weeks before I predicted  it would.  $MRVL failed to live up to expectations and has been  essentially dead money since that posting, but if you'll recall I was  very explicit that I was bullish on them ONLY as a 5G play, whereas the  others I felt had more range and scope.  So short-term $MRVL play was a  loser if you moved up the timeline I liked.  Oh, and $UTZ printed for  everybody that just bought in because they liked the product.  It was a  nice little pocket play.\n\n**What's happened since then:**   The trade ran its course to perfection.  As I've been saying for a  little while now, semis, with the exception of $NVDA, are not presently  an interesting trade because there's been a rotation out of them after  this period of growth.  I am still incredibly bullish on the sector as a  whole, but they need a breather and some time out of the sun before  continuing a leg up.  They're not even good rangebound trades right now.",
        "subreddit": "wallstreetbets",
        "title": "Don't pay attention to this, troubleshooting autofilter",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mxpu8d/dont_pay_attention_to_this_troubleshooting/",
        "created": 1619317797.0
    },
    {
        "author": "stokpik",
        "created_utc": 1619525022,
        "id": "mzmwww",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "A federal jury in Texas has relieved Intel Corporation (NASDAQ:INTC) a multibillion-dollar fine. The case before the jury outlined that Intel infringed several patents that initially belonged to NXP Semiconductors NV.",
        "url": "https://www.wallstreetpr.com/?p=44462",
        "created": 1619553822.0
    },
    {
        "author": "LastDelivery5",
        "created_utc": 1619106083,
        "id": "mw7kcv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nThe rumor of Samsung is shopping for a US based auto chip company. Early in Feb, Korean newspaper has started the speculation. Names included IFX, TI, Renesas. This week, Barron's wrote again about Samsung looking for a US based auto analog company, presumably with fab.\n\nI think the regulatory hurdle to buy some the above listed names is quite high given its market share and the importannce. In 2018, China killed the Qualcomm merger on antitrust concerns.\n\nLast year, Starboard Value, a top activist hedge fund, bought a significant stake in ON, touting that it is an undervalued scaled asset. And given the track record of Starboard selling and merging analog semi companies, could it be ON in the running for Samsung instead of Samsung? So far, I have not seen ON's name floated anywhere, though regulatory-wise, it might be an easier deal. \n\n[https://www.koreatimes.co.kr/www/tech/2021/02/133\\_303542.html](https://www.koreatimes.co.kr/www/tech/2021/02/133_303542.html)\n\n[https://www.barrons.com/articles/nxp-semiconductors-acquisition-makes-sense-samsung-51618937427?mod=djem\\_b\\_Weekly%20Barrons%20feed%20for%20last%2024%20hours](https://www.barrons.com/articles/nxp-semiconductors-acquisition-makes-sense-samsung-51618937427?mod=djem_b_Weekly%20Barrons%20feed%20for%20last%2024%20hours)",
        "subreddit": "wallstreetbets",
        "title": "Might Samsung buy $ON",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mw7kcv/might_samsung_buy_on/",
        "created": 1619134883.0
    },
    {
        "author": "NrdRage",
        "created_utc": 1619289059,
        "id": "mxpv0g",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nDD #4:  Cruise lines.  Original Date February 19th, 2021📷\n\nNot mine.  But I wants it.\n\nURL:  [For you poor bastards who missed this boat](https://www.reddit.com/r/wallstreetbets/comments/lnpqrp/nrdrages_friday_dd_the_bermuda_triangle_and_you/)\n\n**Original Thesis:**        The cruise liners were one of the last Wuhan-fucked plays out   there     who hadn't taken a true turn at the recovery wheel just yet.    Which   made   them smooth sailing for easy tendies\n\n**Original Price Target January 2022:**        $NCLH 46, $CCL/$CUK 47/42 respectively, $RCL $90.  My positions    were    established a month and a half before the DD, so my cost basis    was    different.  I was holding 700 1/22 25c's in $CCL and 2000 1/23    $42.5c's    in $NCLH.\n\n**How did it work out:**        If you jumped in shortly thereafter and played the stocks right,    you    made enough to buy your own boat.  Sure, maybe it was a 17'    Bayliner    that all the women at the marina called \"adorable\" and were    clearly    conflating towards what they assumed was your pathetic 2.5\"    penis size    at diamond hardness, but it floated, it had an engine,   and  dammit, it    was yours and you had enough left over for a   captain's  hat and a bunch    of beer money.  This one was hard to screw   up -  especially since it  was   the first one I started providing   updates on  and made sure  everybody   knew to take profits at 32 on   NCLH and buy  back at 29 (and  to continue   playing that range), etc.    People in  these from the date  of posting who   didn't just buy and   hold likely  have turned at least a 6  bagger by now.    This trade was,   and to some  extent is, still solid  gold.\n\n**What's happened since then:**        In spite of none of the companies in question needing to issue     shares   as they had enough cash on hand, $RCL issued shortly after  that    DD,  $CCL  immediately copied them, and $NCLH followed suit a  couple   of  weeks   after $CCL.  At least none of them tried to pull an  $AMC  and   have the   CEO go on TV and give zero credit to retail  investors  for   saving the   company and instead taking all the credit  before  diluting   and then   paying himself a fat ass bonus for doing  nothing  but issuing   shares like   some sort of conquering hero.  The  amount of  the dilution   in question   meant that the resistance price  of (to use  as example,   $NCLH) of $32 a   share already represented a  higher  price than the   pre-virus share  price.   Ditto for the other  2.   Investors haven't seem   to have noticed,   however, and these  stocks  still trade in the  general  range, though the   resistance  level is now  more like 31/25/85.   Also,  the sailing  schedules  for  the domestic  cruise ships has been  pushed  back as a  result of   somebody high up at  the CDC obviously  shorting  these stocks,  as  that's  the only  explanation for why they're  so  focused on trying to   send these  companies to 0  by preventing  sailings.  Norwegian is  resuming  cruises  outside the US in the next  couple of  months.\n\n**What the smart play is today:**        These 3 companies are no longer as attractive as a result of the       dilution, but they're still good swing traders within their   respective     channels.  I'd put up a picture of some charts to show   those, but I     already told you where the resistance is, grow a   wrinkle and learn  where    support is.\n\nI    have since   exited  my positions in $CCL (and was never in $RCL),  and   have   drastically  reduced my holdings in $NCLH, but I do still   maintain a    skeleton crew  of January calls for them.\n\n**Trade rating:**        9/10.  It was really hard to fuck this one up, unless you just     didn't   believe me. And it's still a live trade.  The only thing I     could have   done better was post it sooner, but I make sure my trades     are   established and going the right way before I talk about them in     depth.\n\nDD #5:  The Semiconductors:  Original Date February 26th, 2021\n\nAnd   before you ask, yes it is.  Took this the other day when I decided to   start working on this. In retrospect, should have washed first.\n\n**URL:** [For you poor, broke ass souls who missed it](https://www.reddit.com/r/wallstreetbets/comments/lt89s3/nrdrages_friday_dd_the_semis_play_not_just_the/)\n\n**Original Thesis:**    While everybody was spooging over high end chipmakers like Theta   Semiconductor, $AMD, and $NVDA (and, to be fair, I had been telling   people to buy $NVDA 545/580c's, which were all multibaggers), the real   action was in the commodity level chipmaker space, specifically American   companies (or companies that could masquerade as them) who would line   up to the trough to get some free government money to go from being   nofab to fab companies.\n\n**Original Price Target:**    $NXPI 200-210 within 3 months; $ON to within 43 within 3 months,  $MRVL  to 75 within that same range.  And I didn't give a price target  for  $UTZ, just that it would go up.\n\n**How did it work out:**    LAMBOS for almost everyone!  Supposing you could order one, given  that  they can't get the chips they need to build the cars.    $NXPI got  to  214 before pulling back to 202.  $ON hit 43 2 weeks before I  predicted  it would.  $MRVL failed to live up to expectations and has  been  essentially dead money since that posting, but if you'll recall I  was  very explicit that I was bullish on them ONLY as a 5G play, whereas  the  others I felt had more range and scope.  So short-term $MRVL play  was a  loser if you moved up the timeline I liked.  Oh, and $UTZ printed  for  everybody that just bought in because they liked the product.  It  was a  nice little pocket play.\n\n**What's happened since then:**    The trade ran its course to perfection.  As I've been saying for a   little while now, semis, with the exception of $NVDA, are not presently   an interesting trade because there's been a rotation out of them after   this period of growth.  I am still incredibly bullish on the sector as a   whole, but they need a breather and some time out of the sun before   continuing a leg up.  They're not even good rangebound trades right now.    And LOL @ any of you clowns who bought $TSM anyways because Cramer  and",
        "subreddit": "wallstreetbets",
        "title": "Don't pay attention to this, troubleshooting autofilter",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mxpv0g/dont_pay_attention_to_this_troubleshooting/",
        "created": 1619317859.0
    },
    {
        "author": "NrdRage",
        "created_utc": 1619288728,
        "id": "mxpr2e",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nDD #4:  Cruise lines.  Original Date February 19th, 2021📷\n\nNot mine.  But I wants it.\n\nURL:  [For you poor bastards who missed this boat](https://www.reddit.com/r/wallstreetbets/comments/lnpqrp/nrdrages_friday_dd_the_bermuda_triangle_and_you/)\n\n**Original Thesis:**     The cruise liners were one of the last Wuhan-fucked plays out there    who hadn't taken a true turn at the recovery wheel just yet.  Which  made   them smooth sailing for easy tendies\n\n**Original Price Target January 2022:**     $NCLH 46, $CCL/$CUK 47/42 respectively, $RCL $90.  My positions were    established a month and a half before the DD, so my cost basis was    different.  I was holding 700 1/22 25c's in $CCL and 2000 1/23 $42.5c's    in $NCLH.\n\n**How did it work out:**     If you jumped in shortly thereafter and played the stocks right, you    made enough to buy your own boat.  Sure, maybe it was a 17' Bayliner    that all the women at the marina called \"adorable\" and were clearly    conflating towards what they assumed was your pathetic 2.5\" penis size    at diamond hardness, but it floated, it had an engine, and dammit, it    was yours and you had enough left over for a captain's hat and a bunch    of beer money.  This one was hard to screw up - especially since it  was   the first one I started providing updates on and made sure  everybody   knew to take profits at 32 on NCLH and buy back at 29 (and  to continue   playing that range), etc.  People in these from the date  of posting who   didn't just buy and hold likely have turned at least a 6  bagger by now.    This trade was, and to some extent is, still solid  gold.\n\n**What's happened since then:**     In spite of none of the companies in question needing to issue  shares   as they had enough cash on hand, $RCL issued shortly after that  DD,  $CCL  immediately copied them, and $NCLH followed suit a couple of  weeks   after $CCL.  At least none of them tried to pull an $AMC and  have the   CEO go on TV and give zero credit to retail investors for  saving the   company and instead taking all the credit before diluting  and then   paying himself a fat ass bonus for doing nothing but issuing  shares like   some sort of conquering hero.  The amount of the dilution  in question   meant that the resistance price of (to use as example,  $NCLH) of $32 a   share already represented a higher price than the  pre-virus share  price.   Ditto for the other 2.  Investors haven't seem  to have noticed,   however, and these stocks still trade in the general  range, though the   resistance level is now more like 31/25/85.  Also,  the sailing  schedules  for the domestic cruise ships has been pushed  back as a  result of  somebody high up at the CDC obviously shorting  these stocks,  as that's  the only explanation for why they're so  focused on trying to  send these companies to 0  by preventing sailings.  Norwegian is resuming  cruises outside the US in the next couple of  months.\n\n**What the smart play is today:**     These 3 companies are no longer as attractive as a result of the    dilution, but they're still good swing traders within their respective    channels.  I'd put up a picture of some charts to show those, but I    already told you where the resistance is, grow a wrinkle and learn where    support is.\n\nI  have since  exited  my positions in $CCL (and was never in $RCL), and  have  drastically  reduced my holdings in $NCLH, but I do still maintain a   skeleton crew  of January calls for them.\n\n**Trade rating:**     9/10.  It was really hard to fuck this one up, unless you just  didn't   believe me. And it's still a live trade.  The only thing I  could have   done better was post it sooner, but I make sure my trades  are   established and going the right way before I talk about them in  depth.\n\nDD #5:  The Semiconductors:  Original Date February 26th, 2021\n\nAnd    before you ask, yes it is.  Took this the other day when I decided to    start working on this. In retrospect, should have washed first.\n\n**URL:** [For you poor, broke ass souls who missed it](https://www.reddit.com/r/wallstreetbets/comments/lt89s3/nrdrages_friday_dd_the_semis_play_not_just_the/)\n\n**Original Thesis:**     While everybody was spooging over high end chipmakers like Theta    Semiconductor, $AMD, and $NVDA (and, to be fair, I had been telling    people to buy $NVDA 545/580c's, which were all multibaggers), the real    action was in the commodity level chipmaker space, specifically  American   companies (or companies that could masquerade as them) who  would line   up to the trough to get some free government money to go  from being   nofab to fab companies.\n\n**Original Price Target:**     $NXPI 200-210 within 3 months; $ON to within 43 within 3 months,   $MRVL  to 75 within that same range.  And I didn't give a price target   for  $UTZ, just that it would go up.\n\n**How did it work out:**     LAMBOS for almost everyone!  Supposing you could order one, given   that  they can't get the chips they need to build the cars.    $NXPI got   to  214 before pulling back to 202.  $ON hit 43 2 weeks before I   predicted  it would.  $MRVL failed to live up to expectations and has   been  essentially dead money since that posting, but if you'll recall I   was  very explicit that I was bullish on them ONLY as a 5G play,  whereas  the  others I felt had more range and scope.  So short-term  $MRVL play  was a  loser if you moved up the timeline I liked.  Oh, and  $UTZ printed  for  everybody that just bought in because they liked the  product.  It  was a  nice little pocket play.\n\n**What's happened since then:**     The trade ran its course to perfection.  As I've been saying for a    little while now, semis, with the exception of $NVDA, are not presently    an interesting trade because there's been a rotation out of them  after   this period of growth.  I am still incredibly bullish on the  sector as a   whole, but they need a breather and some time out of the  sun before   continuing a leg up.  They're not even good rangebound  trades right now.  Also, let's all laugh at any of you clowns who bought $TSM anyways",
        "subreddit": "wallstreetbets",
        "title": "Pay no attention to th is, I'm troubleshooting a series of autofilter issues",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mxpr2e/pay_no_attention_to_th_is_im_troubleshooting_a/",
        "created": 1619317528.0
    }
]