[
    {
        "author": "blastoff42069",
        "created_utc": 1615476582,
        "id": "m2ssko",
        "num_comments": 261,
        "num_crossposts": 0,
        "selftext": "I posted this in r/CCIV but Ill share here also \n\n&amp;#x200B;\n\nEarlier today I posted my Lucid YOLO options purchase here.... \n\n[https://www.reddit.com/r/CCIV/comments/m26uib/lucid\\_cciv\\_yolo\\_part\\_1/](https://www.reddit.com/r/CCIV/comments/m26uib/lucid_cciv_yolo_part_1/)\n\nthe entry point seems to be ok, we have found a rounded bottom on the 5 day chart and looking to move about the $25 mark as we get closer to merger and use that as a floor. I sold my warrants and rolled into leap options, with extremely small common position. I can then add to the dip if we retest $21.50 easily, won't get called on warrants, and having the majority of capital in options that will keep me personally from over trading.\n\nSo I thought I would post up my DD and thesis why I think this is a great value investment that has a lot of potential. Here we go.... TLDR at the end\n\n**CCIV / Lucid Motors**\n\n**Background**\n\nFirst and foremost I am not a professional trader nor am I a financial advisor. I do however have A LOT of experience in the automotive field, in particular BMW. I have been trained, and worked on pretty much all BMW electric or hybrid models with the exception of the last 3 current model years or so. I have met with BMWs engineers over the years (foreign and domestic), toured factories and of course owned and/or driven almost every BMW model ever made. Also managed one of the largest BMW Service departments and loaner car fleets in the USA. I know.....what the fuck does this have to do with LUCID. The old saying.....I might know a thing or two, because I’ve seen a thing or two. Im also no longer working in the car business but that's for another day.\n\n**Lucid Motors leadership:**\n\nYou can find the list of executive management here: [Board of Directors | Lucid Motors](https://www.lucidmotors.com/company/board/)\n\nPeter Rawlinson – CEO/CTO As you know he’s a former Tesla, has over 30 years of automotive experience, including leading the model S team at Tesla. Extensive engineering background with multiple automotive companies. Although I love Peters proper CEO leadership and great speaking ability, I do not believe in the future he will be still be leading both roles of CTO and CEO. There is room to grow on this board and I wouldn’t be surprised if someone left the Silicon Valley to join Lucid (as Peter has already encouraged a partnership with a large cap tech company).\n\nShelby Chen – Hes got M&amp;A experience mainly in China with Tsing Capital. There is not a lot of info around on him, but he could be the key to Asia markets based on his experience when the brands wants to grow into again markets.\n\nTurqi Alnowaiser – Representing the PIF, that’s pretty much it.\n\nTony Posawatz – Non Executive Director – 40 years of auto experience, lead the turnaround and resale of Fisker Automotive (Polished the turd and sold it in a year). Hes pretty active on twiiter [u/TonyPosawatz](https://www.reddit.com/u/TonyPosawatz/)\n\nAndrew Liveris – You already know the Michael Klein connection to Churchill Capital, the relationship has proved its purpose.\n\nOnce the merger is completed I do expect Lucid to add to its board, I wouldn’t be surprised if Alan Mulally joined based him being on the Churchill board, or he might make an excellent recommendation for them.\n\n**Technology**\n\nOne thing that sets Lucid apart from other competitors is their technology. Everything is in house! Battery design, electric motors are all designed and manufactured in house. They do not rely on someone else to make powertrains or batteries somewhere else and ship them. Why is this sooooooooooo important? Well let me tell you…. When you don’t engineer and manufacture your own shit you leave exponential risk to supply chains and potential defects. Ill use BMW as an example… The N54 engine was to be the first twin turbo motor produced in the brand and the first with a gasoline high pressure fuel system that ran as pressure of 300 bar. This fuel system was designed and supplied by another manufacturer. When troubles arose, vehicles were repurchased, the company got sued, bad headlines for the brand and dealers suffered. When you are the designer and manufacturer you are always 100% in the know and are not being sold on the NEXT BIG THING trying to chase automotive awards or competition. The next thing that goes seriously undervalued in this company is their experience in racing….. Im sure most of you are thinking why does that apply? Well my favorite engineering term that’s always often used to describe new parts is “ROBUST”. When you test parts like batteries from constant abuse (Formula E) you tend to learn a thing or two pretty quick what works and what doesn’t. Lucid’s experience in being the battery supplier for Formula E has have them not only an edge in efficiency, but I am willing to be a more ROBUST battery than other EVs. By manufacturing their own battery you have now entered into a technology race with TESLA which for the moment, Lucid appears to be winning.\n\n[2021 Lucid Air: Digging Into the Luxury EV's Tesla-Beating Tech (motortrend.com)](https://www.motortrend.com/news/2021-lucid-air-technology/) You can read some supporting information here.\n\n[Atieva Powers Season 6 of Formula E with Spec Battery Pack of Its Own Design | Lucid Motors](https://www.lucidmotors.com/media-room/atieva-powers-season-6-formula-e-spec-battery-pack-its-own-design/)\n\n**Models**\n\nThe Lucid Air being available in 5 different model variants from $69,900 to $161,500 make the car more available to luxury buyers more than just BALLERS. The SUV market is HUGE in the US and also the most competitive. By leading the technology race Project Gravity will sure to be a hit in 2023. If you are unsure why the SUV should be the next model, ask Lamborghini how many of the Urus they sold last year (4,391 Urus produced to 3039 of combined other Lambo models in 2020). Peter specifically said a high production, low priced vehicle will be the last item on the list to produce, and he's right. There is no point to rush into a high produced, low margin vehicle right away, that's for last (Tesla model 3 playbook).\n\n**Production**\n\nThe first phase of the factory (999,000sqft)  has been completed which took about a year to complete and production of the Lucid Air will be rolling off early summer 2021.\n\nYou can see some of it here [Inside Lucid Motors’ new electric vehicle factory in Casa Grande, Arizona - YouTube](https://www.youtube.com/watch?v=Fy6Lcz7CsQY) .\n\nPhase 2 of 5 has already been approved by Arizona and will begin construction immediately for Project Gravity. The total size of the factory will reach 5.1 Million sqft once all phases are completed. Phase 2 should be complete roughly Feb 2022, which will be the perfect ramp for Gravity in 2023 MY.\n\nWhat is not so talked about is the battery and powertrain factory is at another offsite facility in Arizona. This is a smart move allowing Lucid to scale the business from the automotive side and from the industrial side simultaneously without slowing either business.  \n\n&amp;#x200B;\n\n**Diverse Portfolio**\n\nLucid is also following the footsteps of Tesla and allowing their battery design to be used for non-automotive power supply\n\n[Electric-Car Startup Lucid to Follow Tesla Into Energy Storage - Bloomberg](https://www.bloomberg.com/news/articles/2020-09-09/electric-car-startup-lucid-to-follow-tesla-into-energy-storage)\n\nWhy is this important? Well when you become the leader in the technology race of EVs you can become a supplier to other OEMs and apply your patents to a broader space of other industries. This allows you to have a higher space of growth or “blue ocean strategy”.\n\nPowertrain and battery factory is separate from the auto manufacturing location so both sides of the business can grow without stepping on each other.\n\n**Competitive Advantage of Lucid Air Model**\n\n1. Battery design – not only is the battery range longer (over 500 miles), its smaller and more light weight then its competitors ( 3-5 year technology advantage in my view)\n2. Motor design – Much smaller with less moving parts than competitors (3-5 year technology advantage in my view)\n3. Model advantage to Tesla Model S Plaid – When the Plaid becomes available the specifications are going to be pretty close in performance. I would give the Lucid the advantage in luxury especially with the back seat design. The model S will have a slight autonomous driving advantage.\n4. 900V proven platform with the most range available in any electric vehicle at the moment.\n5. The ability to use your vehicle as a power supply for your home without having to buy a Tesla Power Wall or other battery supply system (10-20K cost advantage).\n6. Charging ability via Wunderbox – Fastest charging available to date.\n7. The vehicle is built for tomorrow, not just for today.\n\n**Electrify America Partnership**\n\nI wont be the first to tell you that Lucid is not going to be rolling out its own charging stations and it DOESN’T MATTER!!!!!! Now, let me explain. When TESLA launched to Model S the biggest consumer backlash was over range. I will tell you that this is the BIGGEST pushback on all EVs. TESLA burned CASH to build out a charging infrastructure to support their own vehicles (own chargers and their own proprietary charging connector). The reason for this was they were the only manufacturer trying to build the consumer case for EVs. There was no other true competitor, thus the reason they needed to have a charging infrastructure to support the product. EVs have now surpassed the need to OEMs to be the sole source of charging. This would be like FORD having to supply all the gas stations, it just doesn’t make sense and its not a good use of capital.\n\nThere are several charging companies out there now, some established and some starting. The car of any brand can only charge at the level of what the power is available, and what the car can accept. The fastest way to charge cars with a large battery capacity is with a DC power supply (Level 3 Charger). The charging speed dictation will be with the available power and the cars capability. The Lucid battery has the capacity to charge faster than any other OEM at the moment.\n\n[Lucid Air to be the Fastest Charging EV, Featuring a 900V+ Architecture Delivering a Charging Rate of Up to 20 Miles Per Minute | Lucid Motors](https://www.lucidmotors.com/media-room/lucid-air-fastest-charging-ev/#:~:text=The%20Lucid%20Air%20will%20be%20a%20groundbreaking%20EV%20in%20terms,to%2080%20miles%20per%20hour)\n\nThere will not be enough DC chargers to put out the speed today that Lucid can accept. This is a good thing, you are not buying a 10 year old out dated laptop that only accepts floppy discs. The car is BUILT for the FUTURE. As EVs grow, charging station companies will be expanding their fleets and the power available for charging at fast rates will grow.\n\nLast, with a 500 plus mile range you wont need to charge this thing everyday. Tell me how many times the average driver leaves home, drives over 500 miles before returning home? The answer, very few time a year which is why the growth of home charging networks will also grow. How many cars have 500 mile range gas tanks? Pretty few with the exception of some big diesel trucks. You don’t need to keep making the battery bigger, after all it’s the most costly expense. 500 miles of driving range will calm the nerves of almost all previous anxious EV drivers.\n\n**Autonomous Driving**\n\nThis is the largest and also smallest hurdle for Lucid. Here is the current autonomous levels for reference.\n\n[The 6 Levels of Vehicle Autonomy Explained | Synopsys Automotive](https://www.synopsys.com/automotive/autonomous-driving-levels.html)\n\nAlmost all manufacturers can get to level 2 right now with a simple camera and lidar system. Tesla has released its beta autopilot and its basically close to level 3, more like 2.75. Lucid has developed the car again for the future with a combination of 32 sensors and cameras.\n\n[Lucid Motors Announces Lucid DreamDrive, an Advanced Driver-Assistance System that Debuts in the Lucid Air | Lucid Motors](https://www.lucidmotors.com/media-room/lucid-motors-announces-lucid-dreamdrive/)\n\nHow important is autonomous driving to customers? I will use the Tesla Model Y (which I own) for reference. The model Y like the Lucid Air comes will all the hardwire required for autonomous driving. The model Y comes with a basic version of Level 2 autonomous driving, if you want to upgrade to the FULL autopilot which is basically level 2.75 its an extra $10,000. **Tesla only sells about 15% of all capable models with full autopilot.** Now at least Tesla will sell it to you… other manufactures like Cadillac are discussing 2-3 years for free and then you pay a subscription beyond that. This is A LOT of LIABILITY to take on as a manufacture to sell AUTO PILOT as a permanent feature. You are basically on the LIABILITY hook with NHTSA for life by offering this feature including any potential recalls. With only 15% of drivers willing to pay for it now, this feature is not the make or break for the company, electric range will be. I believe long term, ALL manufactures will offer autonomous driving as a subscription model. Another great example, Microsoft Office is now Microsoft 360, yearly subscription revenue. Easy way for public companies can show steady \"SERVICE\" revenues without product sales. Who says they can't license it from another company if for some reason theirs is not as good? Less risk also.....\n\n**History of EV success and failures**\n\nTESLA is successful, we have covered most of the reasons why already and Peter has experience with those. **WHY** people choose Teslas over other EVs? First reason is technology (we have outlined those). Second, non-polarizing looks. How many EVs have you seen where you looked at one and couldn’t tell if it was gas or electric? Almost all EVs have some type of lame wannabe futuristic design that people don’t necessarily care for. Now up and til the debut of the Cyber Truck, most Tesla Models were not polarizing to consumers. I think the consensus of the Cyber truck is about 50% love, 50% hate. Tesla makes a descent looking car, but really has the technology people want and enjoy.\n\nOther failures…. I can start by generalizing the majority of existing OEMs by saying they outsource their electrical powertrain technology and you will find that they are all about 5 years behind and 150 miles short in driving range. There are several examples but the most recent one I was excited for what the Porsche Taycan Turbo S. The prototype was sick AF with suicide doors, fast and a 800V battery and promised driving range just over 300 miles. Well, what did we get? $185,000 gets you 192 mile driving range, and a basic Porsche interior. This is the typical OEM response to chasing Tesla. I expect more of this with the new BMW I4 (its gonna be ugly), Jaguar I-Pace and the hideous Mercedes concept.\n\nIMO other EV startups that may not make it:\n\n1. Polestar – the 200 mile swiss electric volvo. Seen 2 in person, not terrible design but lack EV technology.\n2. Fisker – The abortion of Henrik Fisker (BMW designer of the 6 series and Z8) from 2008, used outsourced A123 battery supplier which went BK (car was shit anyways, plagued with electrical issues from body harness design amongst other things (my friends worked there), sold to Chinese auto parts company. Henrik retained the name and trademark to try and relaunch it. They wont produce their first SUV until 2022, which will be at an outsourced manufacturing facility in Austria (again same narrative as previous company history, and it will probly repeat itself.) Id stay the FUCK AWAY from this one.\n3. Rivian – Its got a chance, huge backing from Ford (again chasing), Amazon (why not) debuts in June 2021, but the large truck and large SUV design is not really a competitor with Lucid.\n4. Karma – See Fisker, it was the Chinese abortion and the 20 year old laptop someone thinks might work.\n5. Faraday Future -  feel free to read the wiki, but they have poor leadership, lackluster product and cannot manage money. STAY AWAY!!!!! [Faraday Future - Wikipedia](https://en.wikipedia.org/wiki/Faraday_Future)\n6. Nikola – you already have heard, cant trust em, nothing proven, GM already wasted money on a pipe dream, and they aint got a working model.\n7. Lordstown – More of a competitor to Rivian and Nikola, but again 250 mile range, lacks technology, not a direct competitor.\n\nHybrids… more trouble than they are worth. Many oems have come out with hybrid cars to get the range out of cars and too be honest they don’t work that well. There is too many parts, a lot of engineering to get both systems to work well together flawlessly. You still have to meet combustion engine emissions requirements. Greatest flop….. BMW I8. Super hyped, descent looking, what did we get? A 3 cylinder turbo motor on one axle, and really small battery with 13 mile range on the other and a ton of carbon fiber. The car was super expensive to make, weak performance and dealers still have trouble selling them. In fact you can pick one up used for as little as 60K.\n\nALL ELECTRIC WORKS! There’s is library’s full of stories why EVs work, but heres the reason TESLA and LUCID will continue to work.\n\n1. Simple standard aluminum chassis, cheaper and less expensive than carbon fiber but not has heavy as steel.\n2. Basic cost effective design, and not POLARIZING!\n3. Technological advantage over competitors, without a doubt 3-5 years ahead.\n4. Room for technology advances without the need to upgrade hardware in the vehicle (autonomous driving upgrades in the future)(Fast charging)\n5. Luxury braded EV\n6. Vehicle engineering, design and production is vertically integrated (no outsourcing)\n7. Proven tested technology\n8. No internal combustion engine, no smog requirements, which also means less governance. \n\nNow why TESLA and LUCID will continue to achieve... These brands complement each other, one is more value branded and the other luxury branded. Its like Toyota and Lexus, but different parent companies with similar technologies. They are both vertically integrated from design, production and retail distribution (they CONTROL the NARRATIVE).\n\n**Marketing**\n\nLucid is running the same playbook as Tesla, stores in the mall and eliminating the franchise agreement. Ive been to the one in west LA (next to Beverly Hills), its literally right by Apple and Tesla. It works well!!! Keep running with it... run the play til it stops working. \n\n**Launch**\n\nWell Elon said it himself, prototypes are easy, production is hard. Thats why Im ok with rolling back the initial delivery a month or two. Its better to work hard to keep the quality high and under promise and over deliver. Once the the Air Model is out, the roll out of the Gravity should be much easier. They don't use the same production line which means there is no retooling to do between runs (TESLA had this problem).\n\n**Possible OBSTACLES**\n\n1. Production, will be the hardest part no matter what.\n2. PIF intervention and influence of next factory placement. (Control can be eliminated with board member voting rights)\n3. Saudi violations of human rights intervention from US (appears to be low risk based off latest journalist incident)\n4. Initial delivery issues\n\n**Potential GREEN SHOOTS**\n\n1. Great new board members (there's room for a good CTO)\n2. Lucid Air well received at launch by customers\n3. High gasolines prices drive EV sales (See recent mentions of comedy super cycle with inflation, it appears to be happening.)\n4. Government incentives to switch to EV increased or extended\n5. Partnership with Large Cap tech company for vehicle integrations (apple?)\n\n**Value Investment Proposition**\n\n1. You are getting a Tesla like product, without having to convince customers the first real EV proposition and without having to build a charging infrastructure.\n2. This is now going to be a CASH rich company that can get them to 2023 without debt since they over subscribed the PIPE invest with an extra 1.5 Billion (Churchill says sorry) in a economic environment in which interest rates will be rising putting pressure on other high growth/high levered competitors.\n3. SPACs in the last 2 weeks have come under scrutiny and you now have an entry point much lower than the DA with plenty of room to run.\n4. We have a cordial, well spoken CEO who you don't have to worry about being removed as CEO by the board for something he said on twitter.\n\n**Price Point**\n\nTesla burned a fucking wad of cash the first 5 years and raised money with stock multiple times. There will be cash burn from Lucid, but I don't think it will be the levels of Tesla. I think they get to 2023 without having to raise some cash via stock offering. They will need this for the final factory expansion.\n\nI think Lucid can ramp up faster than Tesla because they have the cash and can operate freely, they have secured facilities and a road map to success already. They will have less road blocks since Tesla has paved the way for direct sales to consumers, charging network and proven concept.\n\nHeres a 3rd party article that argues some valuation with a somewhat bearish view so I'm not hyping anything\n\n[https://www.fool.com/investing/2021/03/10/how-lucid-motors-stock-could-double-your-money/](https://www.fool.com/investing/2021/03/10/how-lucid-motors-stock-could-double-your-money/)\n\nNow it states that a valuation of 64B at $40 a share is lofty and I do agree for today. Remember, stocks trade based on forward earnings and sales, and lets not forget Teslas sales were weak and the product was out of favor until recently. Since then the growth of Tesla has been exponential. We have the country pushing for EVs and consumers will drive them. I mean a fucking sedan doing a 9.9 1/4 mile time with a 500 mile driving range. I mean that's like a Ferrari assassin sleeper shit, and this is a REALITY.\n\nMerger Complete Price Point: **June 30, 2021 - $30**\n\nVehicle deliveries have been rolling at 75% of expectations **EOY December 2021 - $40**\n\nLucid Air production is ramped up and bugs are worked out for 2022, Gravity debut and second facility completed for Gravity production **March 2022 $75**\n\nGravity production running 100%, Air 100% **December 2022 $100**\n\nOther Exponential factors in Lucid valuation that have not been factored into sales +/- 20%\n\n1. Battery and Powertrain units being sold to other manufactures\n2. Cash raise at the end of 2022 to fund future production facilities\n3. Licensing of proprietary technology to other OEMs\n4. Expansion of powertrain and battery factory\n5. A world of unfucking knowns\n6. Tease of other models or new concepts (Coupe sports car would be my next limited production high profitable model choice). \n\n**TLDR**\n\n**I like the stock**",
        "subreddit": "SPACs",
        "title": "CCIV / Lucid Motors YOLO DD",
        "url": "https://www.reddit.com/r/SPACs/comments/m2ssko/cciv_lucid_motors_yolo_dd/",
        "created": 1615505382.0
    },
    {
        "author": "FutureCo",
        "created_utc": 1617029668,
        "id": "mfrao5",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Holdings are listed. Tomorrow, ARKX start trading. PDF says holdings are listed as of 03/26/2021.\n\nhttps://ark-funds.com/wp-content/fundsiteliterature/holdings/ARK_SPACE_EXPLORATION_&amp;_INNOVATION_ETF_ARKX_HOLDINGS.pdf\n\nInterestingly, ARKX will contain PRNT, which is ARK's 3D printing ETF as their #2 component.\n\nRank | Company | Ticker | CUSIP | Shares | Market Value($) | Weight(%)\n--- |              --- | ---      | ------  | -------- | ----------------   | -------------\n1 | TRIMBLE INC | TRMB | 896239100 | 1156 | $86,353.20 | 8.47\n2 | THE 3D PRINTING ETF | PRNT | UF 00214Q500 | 1636 | $62,168.00 | 6.10\n3 | KRATOS DEFENSE &amp; SECURITY | KTOS | 50077B207 | 2203 | $57,322.06 | 5.62\n4 | L3HARRIS TECHNOLOGIES INC | LHX | 502431109 | 255 | $50,729.70 | 4.97\n5 | JD.COM INC-ADR | JD | 47215P106 | 610 | $50,062.70 | 4.91\n6 | KOMATSU LTD 6301 | JT | 6496584 | 1547 | $46,545.40 | 4.56\n7 | LOCKHEED MARTIN CORP | LMT | 539830109 | 125 | $45,588.75 | 4.47\n8 | IRIDIUM COMMUNICATIONS INC | IRDM | 46269C102 | 1132 | $43,163.16 | 4.23\n9 | THALES SA | HO FP | 4162791 | 407 | $39,789.41 | 3.90\n10 | BOEING CO/THE | BA | 97023105 | 145 | $35,506.15 | 3.48\n11 | NVIDIA CORP | NVDA | 67066G104 | 66 | $33,895.62 | 3.32\n12 | SPIRIT AEROSYSTEMS HOLD-CL A | SPR | 848574109 | 687 | $33,209.58 | 3.26\n13 | DEERE &amp; CO | DE | 244199105 | 87 | $32,389.23 | 3.18\n14 | AMAZON.COM INC | AMZN | 23135106 | 10 | $30,520.30 | 2.99\n15 | TERADYNE INC | TER | 880770102 | 235 | $27,969.70 | 2.74\n16 | ALPHABET INC-CL C | GOOG | 02079K107 | 13 | $26,462.15 | 2.59\n17 | DASSAULT SYSTEMES SE | DSY | 5330047 | 121 | $26,035.27 | 2.55\n18 | TELEDYNE TECHNOLOGIES INC | TDY | 879360105 | 65 | $26,050.70 | 2.55\n19 | GARMIN LTD | GRMN | B3Z5T14 | 160 | $20,539.20 | 2.01\n20 | VIRGIN GALACTIC HOLDINGS INC | SPCE | 92766K106 | 672 | $19,884.48 | 1.95\n21 | RAVEN INDUSTRIES INC | RAVN | 754212108 | 512 | $17,454.08 | 1.71\n22 | AIRBUS SE AIR | FP | 4012250 | 144 | $16,583.72 | 1.63\n23 | AEROVIRONMENT INC | AVAV | 8073108 | 138 | $16,395.78 | 1.61\n24 | ALIBABA GROUP HOLDING-SP ADR | BABA | 01609W102 | 72 | $16,362.72 | 1.60\n25 | ELBIT SYSTEMS LTD | ESLT | 2311614 | 108 | $15,082.20 | 1.48\n26 | US DOLLAR | USD | - | 13003.12 | $13,003.12 | 1.27\n27 | NETFLIX INC | NFLX | 64110L106 | 25 | $12,701.25 | 1.25\n28 | HEICO CORP | HEI | 422806109 | 94 | $11,605.24 | 1.14\n29 | HONEYWELL INTERNATIONAL INC | HON | 438516106 | 53 | $11,582.09 | 1.14\n30 | WORKHORSE GROUP INC | WKHS | 98138J206 | 803 | $10,800.35 | 1.06\n31 | TAIWAN SEMICONDUCTOR-SP ADR | TSM | 874039100 | 89 | $10,373.84 | 1.02\n32 | TENCENT HOLDINGS LTD-UNS ADR | TCEHY | 88032Q109 | 128 | $10,365.44 | 1.02\n33 | ANSYS INC | ANSS | 03662Q105 | 30 | $10,288.80 | 1.01\n34 | SYNOPSYS INC | SNPS | 871607107 | 42 | $10,195.50 | 1.00\n35 | XILINX INC | XLNX | 983919101 | 83 | $10,220.62 | 1.00\n36 | MEITUAN-CLASS B | 3690 | BGJW376 | 244 | $9,484.63 | 0.93\n37 | AUTODESK INC | ADSK | 52769106 | 31 | $8,339.31 | 0.82\n38 | ATLAS CREST INVESTMENT COR-A | ACIC | 49284102 | 730 | $7,409.50 | 0.73\n39 | REINVENT TECHNOLOGY-CLASS A | RTP | BLPHSK8 | 734 | $7,472.12 | 0.73",
        "subreddit": "StockMarket",
        "title": "ARKX Holdings Posted",
        "url": "https://www.reddit.com/r/StockMarket/comments/mfrao5/arkx_holdings_posted/",
        "created": 1617058468.0
    },
    {
        "author": "Novel-Building2980",
        "created_utc": 1615314123,
        "id": "m1cosg",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I decided to go through the stocks in ARKK to see which ones have bubbled. Based on a 2 year return being 150% points greater than the 2 year S&amp;P500 return of 40%. IE stocks which had grown by 190% or more in the last 2 years. \n\nI then looked to see what their price should be after bursting. Bursting being a 40% fall in value. I used 60% of the peak value from the last 2 years as my price target. \n\nData from 10.03.19 - 09.03.21\n\nThe first % is the stock’s gain from 10.03.19 to its highest price. \n\nThe second % is the stock’s current gain from 10.03.19\n\nTarget is target price hehe\n\n❌ means the stock didn’t bubble\n\n☑️ Means a bubble stock on my price watch list\n\n✔️ Means the stock price has already sunk to the price target. It’s crashed 40% or more. \n\nSquare. 255% 163% (125%). Target $165 ☑️\n\nRoku 646% 421% (310%). Target $281☑️\n\nTeladoc 367% 181%. Target $176 ☑️\n\nSpotify 156% 82%. ❌\n\nBidu 99% 36%. ❌\n\nZillow 424% 230%. Target $120☑️\n\nShopify 606% 420% (310%). Target $884☑️\n\nCrispr 417% 194%. Target $126✔️✔️\n\nInvitae 133% 43%. ❌\n\nPayPal 196% 124% (98%) Target $183☑️\n\nZoom 801% 401%. Target $340✔️✔️\n\nExact sciences 62% 22%❌\n\nTwilio 236% 137% (118%) $266☑️\n\nUnity software 141% 35%❌\n\nDocusign 369% 241% (135%). Target $158☑️\n\nPure Storage 38% -7%❌\n\nTencent 115% 78%❌\n\nProto labs 104% 15%❌\n\niovance therapeutics 413%. 220% (206%). Target $31.5☑️\n\nTwist biosciences 771% 382%. Target $124✔️✔️\n\nIntellia 369% 179%. Target $50☑️\n\nKe Holdings 110% 42%❌\n\nNintendo 133% 96%(68%)❌\n\nIntercontinental 57% 52%❌\n\n10X genomics 276% 169%. Target $118☑️\n\nSea limited 1090% 839%. Target $167☑️\n\nLending Tree 3% -30%❌\n\nPagerduty 43% -6%❌\n\nEditas 272% 80%. Target $54.34✔️✔️\n\nIridium 115% 56%❌\n\nTwou -19% -46%❌\n\nTwitter 146% 109%❌\n\nNovartis 16% 1%❌\n\nVeracyte 249% 126%. Target $48.82☑️\n\nSynopsys 167% 111% $174.40☑️\n\nPalantir 282% 155%. Target $23.4✔️✔️\n\nPacific bio 583% 332%. Target $30.19☑️\n\nMaterialise 396% 129%. Target $48.37✔️\n\nRegeneron 55% 14%❌\n\nHuya 27% -5%❌\n\nStratasys 117% -1%❌\n\nBeam therapeutics 463% 276%. Target $72.45☑️\n\nTaiwan semiconductor 244% 196%. Target $84.03☑️\n\nTeradyne 252% 178%. Target $86.18☑️\n\nCompugen 406% 127%. Target $11.67✔️\n\nCerus 25% 2%❌\n\nSeres therapeutics 423% 201%. Target $22.63✔️\n\nFate therapeutics 521% 357%. Target $70.44☑️\n\nNanostring 201% 127%. Target $49.77❌\n\nI have £12,300 from selling Tesla which I planned to use to buy Tesla back at a more realistic price of $500. I think that will double by end of 2021 and 1 million vehicles delivered plus FSD. \n\nI was considering using that £12,300 to buy only the crashed stocks in ARKK, with a view ARK have done the qualitative analysis already, so I’m buying high quality companies at a corrected price. My belief here is these stocks will also double by year end, given the pace of technological change starting. \n\nWhat do you think??",
        "subreddit": "investing_discussion",
        "title": "ARKK bubble bargains??",
        "url": "https://www.reddit.com/r/investing_discussion/comments/m1cosg/arkk_bubble_bargains/",
        "created": 1615342923.0
    }
]