[
    {
        "author": "Trading-Resources",
        "created_utc": 1626410069,
        "id": "ol9lx3",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "Semiconductor Expected Earnings Dates\n\nIf you are investing in semiconductor stocks it’s always nice to see how other stocks perform in the same sector before earnings. If I’m missing any or mistaken the dates please let me know and I will correct them. Enjoy! \n\n07/15PM $TSM \n\nTaiwan Semiconductor (NYSE:TSM): Q2 GAAP EPS of $0.93 beats by $0.02. Revenue of $13.29B (+28.0% Y/Y) misses by $20M.\n\n07/21PM ASML\n\n07/21AH TXN\n\n07/22AH INTC\n\n07/26AH CDNS\n\n07/27AH AMD\n\n07/27AH TER\n\n07/28PM UMC\n\n07/28AH QCOM\n\n07/28AH LRCX\n\n07/28AH XLNX\n\n07/29AH SWKS\n\n08/02AH NXPI\n\n08/03AH MCHP\n\n08/03AH LSCC\n\n08/05PM HIMX\n\n08/09PM ON\n\n08/10PM VSH 👈👍 (Hidden Value+Growth Surprise Play)\n\n08/10PM IMOS\n\n08/10AH INDI\n\n08/18PM ADI\n\n08/18AH NVDA\n\n08/17AH CREE\n\n08/18AH SNPS\n\n08/19AH AMAT\n\n08/19AH KEYS\n\n08/29AH KLAC\n\n09/02AH AVGO\n\n09/29AH MU",
        "subreddit": "wallstreetbets",
        "title": "Semiconductor Expected Earnings Dates",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ol9lx3/semiconductor_expected_earnings_dates/",
        "created": 1626438869.0
    },
    {
        "author": "zanoo911",
        "created_utc": 1627521444,
        "id": "otni86",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "I've spent quite a bit of time organizing this list. \nI'd like to narrow it down without losing broad sector diversification. \nLooking for growth as well as dividend growth. \n\n* TECH: * Software Application: TTD NICE ADSK INTU CDNS CRM (APPS)\n* Software Infrastructure: ZS CRWD ADBE FTNT SNPS NET (MSFT SQ) \n* Semiconductor: AVGO SWKS MPWR (NVDA MRVL LSCC QCOM TXN UMC)  \n* Semiconductor Equipment:: NVMI LRCX TER ENTG AMAT ASML (CAMT)\n* Internet Retail: ETSY MELI PDD (JD BABA) \n* Tech Services: ACN (INFY PRFT) \n* Tech Instruments: GRMN NOVT\n* Comm Equipemt: (CLFD) \n* Electronics: (AAPL)\n* Internet: NTES ZG \n* Hardware: LOGI\n* Gaming: SE \n\n\n*\n\n* TELECOM: TMUS T ZM (VZ) \n* Canadian Telecom: (BCE T) \n\n*\n\n* HEALTH: TDOC UNH (AMEH)\n* Medical Devices: MDT ISRG \n\n*\n\n* FINANCIAL: \n* Banks: BANF JPM IBN (BAC) \n* Canadian Banks: (BNS RY TD)\n* Asset Mgmt: BLK TROW (ARCC BSTZ) \n* Credit Cards: MA V AXP (HX PYPL V GSY) \n* Insurance: AIZ (\n* Canadian Insurance: SLF MFC POW) \n* Exchange: SPGI  \n\n*\n\n* CONSUMER DISC: \n* Personal Services: MED \n* Restaurants: MCD DPZ (PZA)\n* Special Retail: BBY \n* Auto Parts: XPEL\n* Packaging: ATR (ITP)\n* Leisure: POOL \n* Home: HD \n\n*\n\n* CONSUMER STAPLES: \n* Discount Stores: DG COST\n* Beverages: (PEP CELH) \n* Household: CHD \n\n*\n\n* INDUSTRIALS: \n* Machinery: PNR MMM ITW EMR GNRC XYL  (ABB SHYF) \n* Building Parts: CSL \n* Staffing: ADP PAYX \n* Railroads: UNP (CP) \n* Freight: FDX EXPD\n* Renting: (MGRC) \n* Services: CPRT \n* Tools: SNA \n* Waste: WM \n\n*\n\n* MATERIALS: \n* Metals/Mining: BBL RIO VALE \n* Canadian Metals/Mining: (LAC LUN SLI CGXF PWI) \n* Chemicals: APD PPG\n* Steel: (STLD LIF)\n\n*\n\n* UTILITIES: \n* Renewables: ORA \n* Canadian Renewables: (AQN BEP H INE PIF RNW TA) \n* Electric: NEE XEL \n* Canadian Electric: (FTS CU CPX HUTL)\n* Water: AWK \n\n*\n\n* ENERGY:\n* Canadian Energy: (CNQ PPL ENS)  \n\n*\n\n* REITs: VNQ O \n* Canadian: (APR AD BRE FCD INO NWH NXR SRU SMU SGR RIT RS TNT)\n\n*",
        "subreddit": "investing",
        "title": "Is there any redundancy here?",
        "url": "https://www.reddit.com/r/investing/comments/otni86/is_there_any_redundancy_here/",
        "created": 1627550244.0
    },
    {
        "author": "ArtofZed",
        "created_utc": 1625915029,
        "id": "ohgp3l",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Im looking for an ETF for 30-40 Years. Ive gained some knowledge from the german community and\n\nwanna hear out some of you guys aswell.\n\nCurrently im running the Vanguard all world ETF a1jx52 with a TER of 0,22% at zero additional cost at my broker \"scaleable\".\n\nSince im from germany i choosed one which pays out to get 60k in it (This is the limit my payout gets taxfree in germany called \"Sparerpauschbetrag\").\n\nCurrently im thinking of maybe changing this to the S&amp;P500. The growth was better but it the diversity is less. But a lot of the big american companies are also big in europe. Amazon / Apple etc.\n\nWhat would u recommend? \n\nStick with the World ETF to be save or should i go with the S&amp;P500 have a bit more risk but greater return?\n\n&amp;#x200B;\n\nThanks in advance",
        "subreddit": "stocks",
        "title": "What would be a good longterm ETF for 30-40 Years?",
        "url": "https://www.reddit.com/r/stocks/comments/ohgp3l/what_would_be_a_good_longterm_etf_for_3040_years/",
        "created": 1625943829.0
    },
    {
        "author": "zanoo911",
        "created_utc": 1627521301,
        "id": "otngu8",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "I've spent quite a bit of time organizing this list. \nI'd like to narrow it down without losing broad sector diversification. \nLooking for growth as well as dividend growth. \n\n* TECH: \n* Software Application: TTD NICE ADSK INTU CDNS CRM (APPS)\n* Software Infrastructure: ZS CRWD ADBE FTNT SNPS NET (MSFT SQ) \n* Semiconductor: AVGO SWKS MPWR (NVDA MRVL LSCC QCOM TXN UMC)  \n* Semiconductor Equipment:: NVMI LRCX TER ENTG AMAT ASML (CAMT)\n* Internet Retail: ETSY MELI PDD (JD BABA) \n* Tech Services: ACN (INFY PRFT) \n* Tech Instruments: GRMN NOVT\n* Comm Equipemt: (CLFD) \n* Electronics: (AAPL)\n* Internet: NTES ZG \n* Hardware: LOGI\n* Gaming: SE \n\n\n*\n\n* TELECOM: TMUS T ZM (VZ) \n* Canadian Telecom: (BCE T) \n\n*\n\n* HEALTH: TDOC UNH (AMEH)\n* Medical Devices: MDT ISRG \n\n*\n\n* FINANCIAL: \n* Banks: BANF JPM IBN (BAC) \n* Canadian Banks: (BNS RY TD)\n* Asset Mgmt: BLK TROW (ARCC BSTZ) \n* Credit Cards: MA V AXP (HX PYPL V GSY) \n* Insurance: AIZ (\n* Canadian Insurance: SLF MFC POW) \n* Exchange: SPGI  \n\n*\n\n* CONSUMER DISC: \n* Personal Services: MED \n* Restaurants: MCD DPZ (PZA)\n* Special Retail: BBY \n* Auto Parts: XPEL\n* Packaging: ATR (ITP)\n* Leisure: POOL \n* Home: HD \n\n*\n\n* CONSUMER STAPLES: \n* Discount Stores: DG COST\n* Beverages: (PEP CELH) \n* Household: CHD \n\n*\n\n* INDUSTRIALS: \n* Machinery: PNR MMM ITW EMR GNRC XYL  (ABB SHYF) \n* Building Parts: CSL \n* Staffing: ADP PAYX \n* Railroads: UNP (CP) \n* Freight: FDX EXPD\n* Renting: (MGRC) \n* Services: CPRT \n* Tools: SNA \n* Waste: WM \n\n*\n\n* MATERIALS: \n* Metals/Mining: BBL RIO VALE \n* Canadian Metals/Mining: (LAC LUN SLI CGXF PWI) \n* Chemicals: APD PPG\n* Steel: (STLD LIF)\n\n*\n\n* UTILITIES: \n* Renewables: ORA \n* Canadian Renewables: (AQN BEP H INE PIF RNW TA) \n* Electric: NEE XEL \n* Canadian Electric: (FTS CU CPX HUTL)\n* Water: AWK \n\n*\n\n* ENERGY:\n* Canadian Energy: (CNQ PPL ENS)  \n\n*\n\n* REITs: VNQ O \n* Canadian: (APR AD BRE FCD INO NWH NXR SRU SMU SGR RIT RS TNT)",
        "subreddit": "stocks",
        "title": "Is there any redundancy here?",
        "url": "https://www.reddit.com/r/stocks/comments/otngu8/is_there_any_redundancy_here/",
        "created": 1627550101.0
    },
    {
        "author": "Andrerp24",
        "created_utc": 1626127465,
        "id": "oj1mfm",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "I was thinking about investing 5-10% of my portfolio in this ETF and I would like to know what is the sub's opinion about this ETF. My motives are based on the premise that India is an emerging market, which has a growing population demography and I kinda of compare the potential of this economy with the potential that china's ecomy had 20/30 years ago. Of course that the investment period would not be less than 10/15 years.  I think the TER of etf is a little high;l, 0.65% if I'm not mistaken, but being the high growth potential that the etf have, I think one thing compensates for the other.\nAnd I think it's one of Degiro's free ETFs (no commissions in buying and selling the etf, I'm from Europe). Thanks in advance for the comments",
        "subreddit": "wallstreetbets",
        "title": "iShares MSCI India UCITS ETF USD (Acc)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oj1mfm/ishares_msci_india_ucits_etf_usd_acc/",
        "created": 1626156265.0
    },
    {
        "author": "Cybur_Sam",
        "created_utc": 1626718035,
        "id": "onjm09",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Hello everyone!\n\nRecently I have been looking into setting up a long-term index investment and I would like to make sure that I choose the right NASDAQ-100 ETF so that I am not forced to sell later (avoiding taxes is always nice). The requirements of my investment decision include Non-Hedged CAD ETF's that track the NASDAQ-100 with relatively low MER's. Naturally, this search has led me to the following ETF's, though I am split on which to choose due to their dividend payout policies:\n\nHXQ - $52/share - Pays no dividend (which is nice from a tax perspective) and offers good performance. However, it has a TER of 0.38 which increases the total expense to 0.66 - I assume that is because the fund is withholding dividends from it's holders and repurchasing stocks, effectively increasing management expenses.\n\n[https://www.horizonsetfs.com/ETF/HXQ#](https://www.horizonsetfs.com/ETF/HXQ#)  \n\n\nZNQ - $60/share - Pays an annual dividend with a yield of 0.33%, with an MER of 0.38.\n\n[https://www.bmogam.com/ca-en/advisors/znq-bmo-nasdaq-100-equity-index-etf/](https://www.bmogam.com/ca-en/advisors/znq-bmo-nasdaq-100-equity-index-etf/)\n\n&amp;#x200B;\n\nQQC - $22/share - Pays a quarterly dividend of 1.16% (yikes), has an MER of 0.20, and is brand spanking new (Issued May 10th, 2021 - So...no performance data to compare with). Aside from the dividends, this is my most favorable option because I cannot purchase fractional shares, so the low price is very appealing.\n\n[https://www.invesco.ca/ivz/p/exchange-traded-fund/invesco-nasdaq-100-index-etf---cad/at-a-glance/547](https://www.invesco.ca/ivz/p/exchange-traded-fund/invesco-nasdaq-100-index-etf---cad/at-a-glance/547)\n\n&amp;#x200B;\n\nI would love to hear some feedback, and see what arguments can be made for these three ETF's. They are all decent in my opinion and offer similar performance, but I am trying to be as efficient as possible. Let me know if you see anything I am missing here! \n\nThanks ahead of time, this community is great!",
        "subreddit": "CanadianInvestor",
        "title": "HXQ vs. ZNQ vs. QQC",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/onjm09/hxq_vs_znq_vs_qqc/",
        "created": 1626746835.0
    },
    {
        "author": "ArtofZed",
        "created_utc": 1626153981,
        "id": "oj90fa",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Hey guys.\n\nIm from europe and decided to go for a s&amp;p 500. \n\nInvesco S&amp;P 500 UCITS ETF**ISIN** IE00B3YCGJ38, **WKN** A1CYW7\n\n\\- TER 0,05% \n\n\\- TD -0,26%\n\n\\- Ireland\n\nPros: Low TER , synthethic\n\nCons: my broker charges 1 Euro per monthly to be able to select this.\n\nVanguard S&amp;P 500 UCITS ETF (USD) Accumulating ISIN IE00BFMXXD54, WKN A2PFN2\n\n\\- TER 0,07%,\n\n\\- -0,29%\n\n\\- Ireland\n\nPros: Low TER, free in my broker\n\nCons: not sure if the synthethic performs better\n\nI can also get the  iShares S&amp;P 500 Swap as physical or synthetic but it also costs 1 euro per month.\n\nCan u give me advice on either choosing one of those 3 ETFs? A lot of people say synthethic gives better performance due to tax optimization but is it worth the risk? Or is almost riskfree?\n\nI like the vanguard it is free in my broker and i dont have to break my head about it because it is physical.\n\nI would love any input of you guys.",
        "subreddit": "stocks",
        "title": "S&amp;P 500 Vanguard vs. Invesco vs. iShares - Which one to pick as an european",
        "url": "https://www.reddit.com/r/stocks/comments/oj90fa/sp_500_vanguard_vs_invesco_vs_ishares_which_one/",
        "created": 1626182781.0
    },
    {
        "author": "ArtofZed",
        "created_utc": 1626632283,
        "id": "omw35a",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Vanguard All World as a Core and NASDAQ 100 as i side ETF?\n\n\nHello guys. Im from Germany and started to inform myself about investing.\n\nSince i work in germany i have an VL Depot where my company pays 26 out of 40 Euros every month in my ETF. I have the Vanguard all World Acc. in it.\nA2PKXG\n\nMy main ETF is the Dist. Vanguard All World A1JX52. I pay monthly 500 into it and aim to get 60k and then switch to the Acc. We get taxfree dividends up to 801 Euros in germany. So solid choice to go this route.\n\nI have a solid All World Core and want to invest around 100 in NASDAQ INVESCO Swap A2QMHS. The ETF is new, is this an issues?\n\nAll in all i would go 540 into a World ETF and 100 into NASDAQ 100 because i dont have the time to deal with single stocks.\n\nIs this a solid choice. I wanna only figure out how my Main Strategy will work out. Any advice? The S&amp;P500 seems ok too but i want an allworld as a core do be saver.\n\nAny input would be appreciated. All ETFs have no costs beside TER.\n\nGreetings",
        "subreddit": "stocks",
        "title": "Vanguard All World as a Core and NASDAQ 100 as i side ETF?",
        "url": "https://www.reddit.com/r/stocks/comments/omw35a/vanguard_all_world_as_a_core_and_nasdaq_100_as_i/",
        "created": 1626661083.0
    },
    {
        "author": "TangerineHelpful8201",
        "created_utc": 1627226885,
        "id": "ordla2",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "#### From Stansberry Research\n\n#### \n\n#### A Three-Pronged Strategy for Accelerated Growth\n\n**inTEST (NYSE American: INTT)** is a global supplier of precision-engineered equipment used to test and manufacture everything from medical devices to cell phones to aircraft.\n\nThe business has two segments: thermal products and electromechanical semiconductor (\"EMS\") products.\n\nThe thermal segment designs and sells equipment used for manufacturing activities, like forming metals with precise heating and or managing extreme temperatures. This equipment is widely used across the automotive, defense, aerospace, energy, industrial, medical, semiconductor, and telecommunications sectors. Now, it's also being used in the fast-growing cannabis industry. (More on that in a minute.)\n\nThe EMS segment designs and sells products used primarily by semiconductor companies to automatically test the chips they manufacture for defects. (Automated test equipment is referred to as \"ATE.\") In addition to selling directly to big, well-known chip manufacturers like Texas Instruments (TXN), inTEST also sells to third-party testing services and ATE original equipment manufacturers (\"OEMs\") like market leader Teradyne (TER).\n\nIn 2019, inTEST began referring to all the products it sells to semiconductor customers as the \"semi market.\" Everything else – basically, all non-semi, thermal product sales – are referred to as \"multimarket.\"\n\nIts largest customers include Analog Devices (ADI), Emerson Electric (EMR), Lockheed Martin (LMT), NXP Semiconductors (NXPI), Qualcomm (QCOM), and Texas Instruments, among others.\n\nLast year, inTEST's board of directors decided it was time for the company to renew its focus on growth. So they hired Richard Grant as CEO. Grant is an outsider who brings many years of executive experience from stints with three global, publicly traded industrial companies: ABB (ABB), former *Extreme Value* winner Ametek (AME), and Emerson Electric.\n\nThe board gave Grant a mandate to drive new and more sustainable long-term growth for inTEST. And last March, he outlined his plan to transform the company, potentially doubling revenue in the process.\n\nUnder Grant's leadership, inTEST will now focus on three strategies to accelerate growth...\n\n**Growth Strategy No. 1: Expand inTEST's Global Footprint**\n\ninTEST provides products and services to customers around the globe, but its manufacturing plants are located entirely in the U.S. Grant says this makes it difficult to succeed in foreign markets, particularly when facing local competitors.\n\nHaving a presence in international markets provides access to lower-cost labor, lower shipping costs, and an improved ability to compete on price. So Grant is determined to expand inTEST's manufacturing footprint. Last month, he announced inTEST's Ambrell business will establish a presence in Mexico for the first time.\n\nAmbrell is part of inTEST's thermal segment. It makes the induction (i.e. precision) heating systems manufacturers rely on to build electric motors. Since a large percentage of electric motors are already manufactured in Mexico, Grant says it makes sense to have a presence there. And General Motors' (GM) recent announcement that it will invest $1 billion to produce electric vehicles (\"EVs\") in the country means the timing couldn't be better.\n\nFirst steps include the addition of a full-time sales representative, an applications engineer dedicated to working with Latin America-based customers, and plans to build an applications lab in Mexico. It's also possible inTEST could acquire another company with a significant footprint in Mexico over the next 12 months to further its presence there.\n\n**Growth Strategy No. 2: Develop New Solutions for New Users**\n\nGrant says inTEST will also grow by developing solutions that are \"new to the company, new to the industry, or new to the world.\" A primary focus of its multimarket segment will be two of the hottest emerging markets in the world right now: EVs and cannabis.\n\nLast month, we recommended [**CTS (NYSE: CTS)**](https://members.stansberryresearch.com/articles/ride-the-ev-wave-with-this-little-known-125-year-old-company) as an excellent way to play the **emerging EV wave**. inTEST gives us good exposure to EVs as well.\n\nCurrently, the EV market is small. Last year, about 2.5 million EVs sold, accounting for just 4% of worldwide auto sales. But consumers are getting more and more comfortable with EVs. And their options are drastically improving, with more than 400 different models expected to launch by 2025. So sales growth is expected to rise rapidly over the next couple decades.\n\nEstimates vary, but a reasonable forecast is that over the next 30 years, the global EV fleet could potentially rise from 10 million units today to 700 million units in 2050. And a lot of them will be manufactured by current EV market leader – and inTEST customer – Tesla (TSLA).\n\nTo meet its share of this future demand, Tesla is currently building its fourth EV-manufacturing plant, this one in Berlin. Production is expected to eventually hit 500,000 cars per year. That's more EVs than all other German carmakers *combined* produced in 2020.\n\nBig new Tesla factories are great news for inTEST. The company started working with Tesla early, creating custom thermal solutions for its production of motors, steering columns, and other applications. As Tesla continues to ramp global production (its stated goal is 50% growth per year), it'll need more inTEST equipment.\n\nNow, Grant says inTEST is also leveraging its Tesla expertise to capture opportunities with other EV manufacturers. During the first-quarter 2021 call with analysts in May, he noted that inTEST is receiving \"robust\" orders from other EV makers.\n\nOn the third-quarter 2020 call last November, he highlighted EV orders from a \"large domestic automotive manufacturer\" and the company's first order from an EV truck start-up. Later this year, INTT will also launch a marketing campaign targeted at 300 EV contacts to increase awareness.\n\nThe second emerging market that holds great promise for inTEST is **cannabis**.\n\nTo get a sense for just how promising this market is, here's what cannabis expert Tom Carroll recently told subscribers to his *Cannabis Capitalist* newsletter...\n\n&gt;Overall, the legal cannabis market in the U.S. is still in the early stages... But it has grown immensely in the last five years.  \nThis is a massive, newly legal market – likely the biggest in a generation.  \nIn 2014, the legal and recreational market totaled about $2 billion. By 2020, total sales grew to $18 billion... a monumental increase. However, by 2025, the market is expected to more than double from 2020, exceeding $40 billion.\n\nKeep in mind, these numbers are just for the U.S. Grandview Research estimates the global cannabis cultivation market was $124 billion in 2019 and will exceed $300 billion by 2027.\n\nThe concentrates segment – oils extracted from cannabis plants – is the fastest-growing part of this market. Extracting cannabinoid-containing oil from the rest of the plant requires extreme temperatures that must be precisely controlled throughout the entire process. That just happens to be an area where inTEST shines...\n\ninTEST honed its skills in the thermal-equipment sector by building demanding, customized applications for military, aerospace, and energy customers. Now, it's leveraging that skill set to deliver the highest-quality and fastest extraction times available in the botanical-extraction industry.\n\nFor example, inTEST uses liquid nitrogen chillers that can cool 100 gallons of ethanol (the extraction agent) to an extreme -70°C in less than 30 minutes. During the third-quarter call, Grant told analysts that chiller bookings and revenues each exceeded $1 million in a quarter for the first time in history.\n\nOn the May call with analysts, Grant said the initiative launched last year to target OEMs in the cannabis space is also bearing fruit. One new OEM has placed a $300,000 order. An existing OEM customer has placed a follow-up order. And inTEST has signed two brand-new OEM customers.\n\ninTEST has also launched a marketing campaign targeted at 800 potential customers across the cannabis industry.\n\n**Growth Strategy No. 3: Grow Through Strategic Acquisitions**\n\ninTEST has only made two acquisitions in the past decade, the last one in 2017. Grant has made it clear that will change on his watch.\n\nDuring the fourth-quarter 2020 call in February, he told analysts that inTEST will aggressively drive merger and acquisition (M&amp;A) activities moving forward. This includes targeting...\n\n1. \"Bolt on\" deals – smaller companies in the same line of work as inTEST that expand existing product lines or geographic coverage areas.\n2. Companies that broaden the reach of inTEST's process technology capabilities in areas like medical-device manufacturing or material testing.\n3. Businesses that bring in entirely new customers, such as environmental testing.\n\nEssentially, nothing is off the table here.\n\nAcquisitions for a smaller company like inTEST can dramatically boost investment returns. This was an important attribute of our TFI International recommendation, and it has paid off. As of yesterday's close, we're up 146% on TFII. inTEST has the same kind of potential under Grant's leadership.\n\n#### The Next Cyclical Upturn in Semiconductors Means More Growth for INTT\n\ninTEST's three-pronged growth strategy is largely focused on opportunities in its multimarket segment. But there's a solid growth story underlying the EMS business, too...\n\nThe proliferation of chips in everything from cars to consumer electronics to factories is the driving force behind rising semiconductor demand. This in turn creates demand for the ATE products that inTEST manufactures and sells. Basically, anytime chip manufacturers expand their capacity to meet rising demand, it's good for inTEST's EMS business.\n\nIn its latest annual 10-K filing with the SEC, inTEST says the semiconductor market entered a cyclical downturn in early 2019. But the company now believes the next cyclical upturn has begun…\n\nOn a trailing 12-month basis, inTEST's booking growth rate (semiconductor-related orders placed but not yet executed) confirms this. After turning negative in the first quarter of 2019 (-3%), it didn't return to positive territory until the fourth quarter of 2020 (27%). The booking growth rate for the first quarter of 2021 was even higher (62%).\n\nDue in part to the chip shortage we reported on [last month](https://members.stansberryresearch.com/articles/ride-the-ev-wave-with-this-little-known-125-year-old-company), inTEST customers are in, according to Grant, a \"race to add capacity,\" particularly for the semiconductors used in automobiles and mobile phones.\n\nTexas Instruments is currently building its latest semiconductor foundry (or manufacturing plant) in Texas. Intel (INTC), another inTEST customer, announced a $20 billion investment back in March to expand its chipmaking footprint in Arizona. And Intel's chief rival Taiwan Semiconductor Manufacturing (TSM) – which accounts for 15% of TER's business and therefore indirectly affects inTEST – just broke ground on a new Arizona foundry that it says could be the first of six on this site over the next 10 to 15 years.\n\nEarlier this week, the U.S. Senate also passed the U.S. Innovation and Competition Act. If enacted, the legislation commits approximately $50 billion to boosting domestic semiconductor production. The effort to wean America off foreign-made chips has bipartisan support and could become an important new source of growth for inTEST.\n\nThere are other interesting opportunities that could add incremental growth from here, too. For instance, following a long development period, EMS has begun receiving orders from a \"major player in the memory test space.\" And its intelligent test cell system could be a big winner as customers (new and existing) upgrade their older test systems.\n\nNo one, including us, knows how long this new semiconductor cycle upturn, now two quarters long, will last. But with orders on the rise and the recent addition of EMS Vice President and General Manager Joe McManus, inTEST is primed to capitalize on the trend for as long as possible.\n\nGrant hired McManus to run this highly technical business segment largely because of his growth track record. During his seven-year tenure as a sales executive at a small semiconductor business, for instance, McManus reportedly helped grow sales from less than $20 million to more than $65 million.\n\nHis appointment at inTEST appears to be well-timed for the nascent semiconductor cycle upturn.\n\nIn short, inTEST has multiple avenues of growth that are likely to play out over the next few years. Now, let's take a look at the Five Clues...\n\n#### The Five Essential Financial Clues\n\nWe use the [Five Essential Financial Clues](https://members.stansberryresearch.com/articles/financial-clue-video) to help us identify great businesses. A great business doesn't necessarily have all five clues present. But the best ones tend to have more of them than less well-run companies. It would be normal for such a young technology company to not have a single one of the five clues present. But as you'll see, INTT stacks up fairly well, with especially strong performance in free cash flow (\"FCF\") and its balance sheet.\n\n**Gushes Free Cash Flow**\n\nA business's intrinsic value comes from the cash it generates in excess of all taxes, expenses, and reinvesting enough to maintain and grow. That's called FCF. The best businesses tend to generate more cash than they know what to do with.\n\nLike many technology-based businesses today, INTT has a history of generating consistent FCF. (The big drop in 2019 is due to an \"earnout\" payment related to the 2017 acquisition of Ambrell.) Increased capital spending to facilitate new growth – including investments in newly acquired businesses – could reduce FCF in the next few years... but we'd consider this simply laying the foundation for larger FCF over the long term.\n\n📷\n\n**Consistent Margins**\n\nIn a capitalist economy, it's normal for competition to winnow profit margins, sometimes down to zero, as companies compete more and more aggressively for market share. A consistent margin is an economic anomaly, sometimes indicating that a business provides goods and service its customers can't get elsewhere.\n\nINTT has a history of consistent (and relatively high) gross margins, a reflection of the fact that its solutions are often highly configured to match unique customer needs and command premium pricing.\n\nHowever, operating, pretax, and net margins are much more susceptible to the boom-and-bust nature of the semiconductor cycle. That's because many of the high fixed costs associated with manufacturing chip equipment (like operating and maintaining the plants) don't go away when sales decline.\n\nAs we noted earlier, the chip cycle turned down in 2019, causing these margins to decline. The good news is the decline is over, and the cycle is turning up. This is when you want to buy cyclical companies.\n\n📷\n\nWe expect margins to rebound as the post-pandemic recovery gains steam and key markets like cannabis and EVs continue to grow rapidly.\n\n**Strong Balance Sheet**\n\nThere are two kinds of good balance sheets. The first is when a company has more cash than debt. The second is when a company has more debt than cash on hand but earns enough income to cover its debt service obligations.\n\nINTT is the first kind. It has $10.2 million in cash and no debt. This is an ideal setup for financing new acquisitions, allowing plenty of room to borrow for those acquisitions. That is important because it won't need to fundraise by issuing new shares (a move that dilutes current shareholders).\n\nA cash-gushing business with a pristine, debt-free balance sheet is a rare find these days. We believe INTT is ready to make good use of it.\n\n**Shareholder Rewards**\n\nINTT doesn't pay a dividend and management says it doesn't expect to do so \"in the foreseeable future.\" That's not unusual for a small, young company. It simply reflects the fact that INTT is instead plowing its excess cash flows back into the business... for acquisitions or to buy back stock.\n\nMost companies are mediocre share repurchasers, and we haven't seen anything that tells us INTT will do any better. The best we can expect is for this activity to do no harm.\n\nOver time, we've learned one of the benefits of shareholder rewards is that they impose discipline on the management team by limiting the amount of capital available. No company can reinvest unlimited amounts of capital, and capital allocators are only human. A large amount of excess cash on the balance sheet tends to burn a hole in management's pockets. Share repurchases help to prevent the company from spending wastefully.\n\n📷\n\n**Consistent Return on Equity**\n\nIf a business were a bank account, return on equity (\"ROE\") would be the interest rate you'd earn on all the money you left in it.\n\nCyclical companies like inTEST normally experience fluctuating ROE over a full cycle.\n\nAs you can see in the following chart, the strong bounce out of the 2009 chip-cycle low resulted in extraordinary ROE in 2010 and 2011 (higher than 40%). As the cycle matured, ROE fluctuated between 5% and 10% before dipping into negative territory during the latest cycle downturn.\n\nWith the semiconductor cycle once again turning up, inTEST's ROE is also on the rise. As of the first-quarter 2021, it was 5.4% and already above the five-year average of 4.3%. We expect it to move even higher in the quarters ahead.\n\n📷\n\n#### What's It Worth?\n\nNow let's put our Price Implied Expectations model to work in order to get a handle on INTT's upside potential at its recent share price. We'll start as we typically do with a review of our model's three most important inputs: revenue growth, operating margins, and FCF margins.\n\n**Revenue Growth Expectations**\n\nDespite the strong bounce in INTT's stock over the past year, the current share price implies just 3% average growth beyond 2021. That's too low.\n\nRemember, the semiconductor cycle has just turned up. That means inTEST's EMS revenue will likely ramp higher as chipmakers expand capacity to satisfy growing demand. And these upturns can last years.\n\nThe company's thermal business is also poised to grow sharply as the markets for EVs and cannabis expand.\n\nFactSet reports that the consensus of analysts who cover inTEST is that revenue over the next 12 months (Year 1 of our analysis) will be $80 million. The company doesn't provide a next-12-months revenue forecast. But for the current quarter, it expects to generate between $20 million and $21 million. On an annualized basis, the low end of that range lines up with FactSet's estimate ($20 million x 4 quarters = $80 million). That's a good starting point for Year 1 revenue.\n\nThe FactSet consensus for Year 2 of our analysis translates to 10% revenue growth. That's consistent with the 10% average growth rate inTEST experienced between the last two major chip cycle lows in 2009 and 2019.\n\nBut there are two big differences between the inTEST of today and the inTEST of a few years ago...\n\nIn 2021, the multimarket segment (the one targeting cannabis and EVs) accounted for 46% of total new company orders. In 2015, it accounted for just 28%. This provides much-needed revenue stability compared with the cyclical semiconductor business.\n\nWhen the chip cycle turned down in 2019, inTEST's semiconductor orders declined as much as 45% YOY (on a TTM basis) during the fourth quarter. But multimarket revenue only fell 15% in the same period. Ultimately, this factor alone will help INTT post better-than-10% average revenue growth in the years ahead.\n\nThe second big difference between the inTEST of today and the inTEST of a few years ago relates to acquisitions. Acquisitions only made a limited contribution to the 10% average revenue growth between 2009 and 2019. But as we mentioned earlier, Grant intends to increase M&amp;A activity. We think an incremental average growth of 1% to 2% from acquisitions is reasonable.\n\nIn the final analysis, we expect inTEST's revenue to grow 13% on average over the next five years.\n\n**Operating Margins**\n\nOver the last complete semiconductor cycle (from the low in 2009 to the low in 2019), inTEST's operating margins averaged 8.9%.\n\nLooking ahead, we expect inTEST's average, full-cycle operating margin – the average margin earned from one cycle low to the next – to move considerably higher for four reasons...\n\nFirst, diversification away from the chip cycle will reduce the depth of the operating margin decline. During the latest 2019 to 2020 downturn, the operating margin bottomed at -0.3%. That's far better than what happened in 2009 (-18.7%). The difference is primarily related to growth of the multimarket business and greater diversification away from the deeply cyclical semiconductor sector.\n\nSecond, shortly after taking the helm, Grant took steps to consolidate EMS' manufacturing facilities. CFO Hugh T. Regan, Jr. estimates this will result in annual cost savings of $600,000.\n\nAt the same time, EMS sales are rising. Grant says shipments of certain EMS products over the first half of this year are likely to exceed totals for 2019 and 2020 combined. Remember, margins can move sharply higher when sales are strongly rising and fixed costs are declining.\n\nThird, inTEST already has the manufacturing capacity needed to respond to big organic growth opportunities like EVs and cannabis. This means we'll likely see a significant lift to the consolidated operating margin as sales grow faster than fixed costs company-wide.\n\nFourth, Grant is determined to standardize as much of inTEST's manufacturing as possible and considers this a key to expanding margins. The basic idea here is to increase the use of common components across multiple products, which can be bought in larger quantities at lower prices.\n\nIn summary, we expect INTT's operating margin to average 15% in the current cycle – widely beating the 8.9% from the previous full cycle. Our Year 1 margin forecast is 13.5%, rising gradually to 15% by Year 3.\n\n**Free Cash Flow Margins**\n\ninTEST's full-cycle average FCF margin was 6.1% (2009 to 2019). The factors expected to boost future operating margins should do the same for FCF margins. But the overall impact will likely be somewhat less, given the capital intensity of the business. (As a manufacturer, inTEST must continuously replace and upgrade its stock of capital equipment.)\n\nOver the past 12 months, the FCF margin was 5.4%. We expect it to rise to 7% over the next 12 months (Year 1) and reach a new full-cycle average of 9% by Year 3.\n\n#### Putting It All Together\n\nRunning the numbers just detailed through our valuation model generates an intrinsic value estimate of $26.50 per share. Think of this as the highest price a knowledgeable buyer would pay for the entire business today.\n\nTo test its reasonableness, we look to recent transactions involving similar businesses.\n\nWe usually make comparisons among companies with stabilized or normal levels of EBITDA. But because inTEST's TTM EBITDA ($7 million) is depressed, it's more appropriate to focus on forward estimates of EBITDA.\n\nThe FactSet consensus for the next 12 months of EBITDA is $12 million, which we consider reasonable. This produces an intrinsic value multiple of 23.5 times.\n\nThe best direct comparable is Wise Road Capital's recent deal to acquire Magnachip Semiconductor (MX) for $29 per share. Like INTT, MX is a highly cyclical small-cap company operating in the chip sector. Its TTM EBITDA ($42.5 million) is also coming off a deep cyclical low and is expected to move sharply higher over the next 12 months to $64.5 million. Using the latter figure produces an enterprise value (\"EV\") to EBITDA multiple of 17.3 times.\n\nIt makes sense that INTT commands a higher multiple than MX. Due to the custom nature of its business, inTEST's products command premium pricing, which translates into much higher gross margins, which then translates into higher operating and FCF margins. Historically, inTEST has likewise experienced faster top-line growth across the full cycle.\n\nOver a five-year period, we estimate inTEST's average EBITDA to be $19.4 million. Using this as a proxy for stabilized next-12-months EBITDA produces a multiple of 14.5 times.\n\nNow, let's compare this with Analog Devices' pending purchase of Maxim Integrated Products (MXIM), another semiconductor deal which just received full approval from EU regulators and should close soon. The deal's multiple based on the next 12 months of EBITDA is 24 times.\n\nIt makes sense that MXIM commands a higher multiple than inTEST. While MXIM has historically grown revenue at a slower rate, it earns much higher gross, operating, and FCF margins.\n\n📷\n\nOur intrinsic value estimate of $26.50 is well supported by the available market data.",
        "subreddit": "pennystocks",
        "title": "INTT - Little known, lots of potential",
        "url": "https://www.reddit.com/r/pennystocks/comments/ordla2/intt_little_known_lots_of_potential/",
        "created": 1627255685.0
    },
    {
        "author": "fuckkdabears",
        "created_utc": 1625354640,
        "id": "od8pgu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Was reading an old thread about this very topic just now: \nhttps://old.reddit.com/r/CanadianInvestor/comments/g4iodr/znq_vs_hxq/\n\nIt seems that no one can confirm at the time of posting whether the TER (Trade expense ratio) for HXQ was removed in 2020. Can anyone confirm now?\n\nAlso, between **HXQ** (MER of 0.28% and *maybe* a TER of 0.38%) and **ZNQ** (MER of 0.38%), which would you rather?",
        "subreddit": "CanadianInvestor",
        "title": "Which one would you choose for an unhedged NASDAQ 100 ETF: HXQ or ZNQ?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/od8pgu/which_one_would_you_choose_for_an_unhedged_nasdaq/",
        "created": 1625383440.0
    },
    {
        "author": "zanoo911",
        "created_utc": 1627521364,
        "id": "otnhgi",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I've spent quite a bit of time organizing this list. \nI'd like to narrow it down without losing broad sector diversification. \nLooking for growth as well as dividend growth. \n\n* TECH: * Software Application: TTD NICE ADSK INTU CDNS CRM (APPS)\n* Software Infrastructure: ZS CRWD ADBE FTNT SNPS NET (MSFT SQ) \n* Semiconductor: AVGO SWKS MPWR (NVDA MRVL LSCC QCOM TXN UMC)  \n* Semiconductor Equipment:: NVMI LRCX TER ENTG AMAT ASML (CAMT)\n* Internet Retail: ETSY MELI PDD (JD BABA) \n* Tech Services: ACN (INFY PRFT) \n* Tech Instruments: GRMN NOVT\n* Comm Equipment: (CLFD) \n* Electronics: (AAPL)\n* Internet: NTES ZG \n* Hardware: LOGI\n* Gaming: SE \n\n\n*\n\n* TELECOM: TMUS T ZM (VZ) \n* Canadian Telecom: (BCE T) \n\n*\n\n* HEALTH: TDOC UNH (AMEH)\n* Medical Devices: MDT ISRG \n\n*\n\n* FINANCIAL: \n* Banks: BANF JPM IBN (BAC) \n* Canadian Banks: (BNS RY TD)\n* Asset Mgmt: BLK TROW (ARCC BSTZ) \n* Credit Cards: MA V AXP (HX PYPL V GSY) \n* Insurance: AIZ (\n* Canadian Insurance: SLF MFC POW) \n* Exchange: SPGI  \n\n*\n\n* CONSUMER DISC: \n* Personal Services: MED \n* Restaurants: MCD DPZ (PZA)\n* Special Retail: BBY \n* Auto Parts: XPEL\n* Packaging: ATR (ITP)\n* Leisure: POOL \n* Home: HD \n\n*\n\n* CONSUMER STAPLES: \n* Discount Stores: DG COST\n* Beverages: (PEP CELH) \n* Household: CHD \n\n*\n\n* INDUSTRIALS: \n* Machinery: PNR MMM ITW EMR GNRC XYL  (ABB SHYF) \n* Building Parts: CSL \n* Staffing: ADP PAYX \n* Railroads: UNP (CP) \n* Freight: FDX EXPD\n* Renting: (MGRC) \n* Services: CPRT \n* Tools: SNA \n* Waste: WM \n\n*\n\n* MATERIALS: \n* Metals/Mining: BBL RIO VALE \n* Canadian Metals/Mining: (LAC LUN SLI CGXF PWI) \n* Chemicals: APD PPG\n* Steel: (STLD LIF)\n\n*\n\n* UTILITIES: \n* Renewables: ORA \n* Canadian Renewables: (AQN BEP H INE PIF RNW TA) \n* Electric: NEE XEL \n* Canadian Electric: (FTS CU CPX HUTL)\n* Water: AWK \n\n*\n\n* ENERGY:\n* Canadian Energy: (CNQ PPL ENS)  \n\n*\n\n* REITs: VNQ O \n* Canadian: (APR AD BRE FCD INO NWH NXR SRU SMU SGR RIT RS TNT)\n\n*",
        "subreddit": "StockMarket",
        "title": "Is there any redundancy here?",
        "url": "https://www.reddit.com/r/StockMarket/comments/otnhgi/is_there_any_redundancy_here/",
        "created": 1627550164.0
    },
    {
        "author": "ArtofZed",
        "created_utc": 1626632395,
        "id": "omw4fk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Vanguard All World as a Core and NASDAQ 100 as i side ETF?\n\n\nHello guys. Im from Germany and started to inform myself about investing.\n\nSince i work in germany i have an VL Depot where my company pays 26 out of 40 Euros every month in my ETF. I have the Vanguard all World Acc. in it.\nA2PKXG\n\nMy main ETF is the Dist. Vanguard All World A1JX52. I pay monthly 500 into it and aim to get 60k and then switch to the Acc. We get taxfree dividends up to 801 Euros in germany. So solid choice to go this route.\n\nI have a solid All World Core and want to invest around 100 in NASDAQ INVESCO Swap A2QMHS. The ETF is new, is this an issues?\n\nAll in all i would go 540 into a World ETF and 100 into NASDAQ 100 because i dont have the time to deal with single stocks.\n\nIs this a solid choice? I also do a bit of Crypto but i wanna only figure out how my Main Strategy will work out. Any advice? The S&amp;P500 seems ok too but i want an allworld as a core do be saver.\n\nAny input would be appreciated. All ETFs have no costs beside TER.\n\nGreetings",
        "subreddit": "StockMarket",
        "title": "Vanguard All World as a Core and NASDAQ 100 as i side ETF?",
        "url": "https://www.reddit.com/r/StockMarket/comments/omw4fk/vanguard_all_world_as_a_core_and_nasdaq_100_as_i/",
        "created": 1626661195.0
    }
]