[
    {
        "author": "chriizzl",
        "created_utc": 1634577257,
        "id": "qar6j5",
        "num_comments": 392,
        "num_crossposts": 0,
        "selftext": "Hey everyone,\n\nI did put a lot of research into the current situation for quite some time and finally build a portfolio I am 100% behind long-term. However, the more I learned, the more sure I am that we will experience a market crash rather soon, than late.\n\nI am not here to debate whether or not you think this is true, but the situation for this thought game is that we might see a crash similar in numbers, not principle like 2008' all over again.In general, during times of high inflation, most businesses will not come out well. The earnings will go up, but they need to put more money into their own business to even stay in the same place. A hedge for this are companies that can easily scale their business without needed money flow. I am looking at you Facebook, who can place 10% more ads, Adobe who can increase their product price without fear of losing customers, Apple, Microsoft...\n\nThe theory behind this discussion would assume that GameStop is a good hedge and to some degree AMC as well, I even heard that from the high ups in a very big, german bank, which is incredibly weird since they were against it months ago and did not even want to talk about it in the first place. This assumes that the crash is happening because of said theory I explained below in short in an edit. It does not mean that a high percentage of the entire portfolio should persist of them, but a chunk just in case might be a very good idea. The market is more complex than many think.\n\nAnother hedge and long term hold can not be mentioned in this sub, but you might guess what it is. Sadly, we cant debate this here. Has to do with weird blocks and tokens, latter of which might change the whole gaming industry and I am thankfully in the position where I can take constant profits from it in percentages that sound absolutely insane.\n\nSo, in case of this **theoretical** scenario, I would like to get everyone's opinion on this. I want to be clear, I value every single opinion and would love the most input possible. In case of no crash, my investments should grow steadily, but in case of a crash due to named circumstance, they would skyrocket. Again, this is purely theoretical, I do not want to discuss whether or not it is happening, but what you would do in case it will happen in the near future.\n\n&amp;#x200B;\n\n**TLDR: How would you hedge against a potential market crash ala 2008 due to Evergrande + GameStop and the overall situation?**\n\n*Since I got downvoted to hell on a different subreddit for even mentioning GME and spreading the word, I will add the theory behind GameStop again, even though most of you might know this already.*\n\n*The theory: The most part of the stock is traded in Dark Pools and all the shorting Hedge Funds are telling us that they closed their position, which is mathematically impossible. Do the research yourself. So, what I think is happening, is that all the shorts are actually synthetic and not real shares. There is tons and tons of proof of it, too much to even deny at this point. They exercise and sell deep ITM calls in order to get the FTDs. So basically, they are passing them from one to another, to another.*\n\n*Think of it like this, a good analogy I found: You get a credit card with 10.000$ on it, max it out and have to repay next month. However, you have endless credit cards, so you can get another credit card and \"pay\" the 10.000$ with that. The debt is still there, its just getting passed. You can do that forever. Now you need more money, so you do this all over again and keep digging the grave deeper and deeper. In this theory, multiple times the float and continuing. In order to stop that, you have to lock the float entirely, which is why everyone is currently directly registering their shares. IF this is true, I do not have to explain the potential outcome. There is simply too much proof as that I can deny that at all.*\n\n*Computershare confirmed this:Quote from their Twitter: \"Shares held directly on the books of US companies through a transfer agent are not held at DTCC. As such, shares are not available to be loaned for any means within the security markets. Computershare is a registered transfer agent &amp; therefore does not lend shares in any capacity\"*\n\n*I need to admit I am a bit disappointed by the negative response from a lot of people, but I would like to keep this open and come back one year later, I will simply take all the downvotes from here. I will still read everything and appreciate any opinion on the topic.*\n\n*Cheers, have a nice week everyone!*",
        "subreddit": "wallstreetbets",
        "title": "Hedging against a Market Crash, 2008' all over again",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qar6j5/hedging_against_a_market_crash_2008_all_over_again/",
        "created": 1634606057.0
    },
    {
        "author": "ZhangtheGreat",
        "created_utc": 1633196423,
        "id": "pzzq5j",
        "num_comments": 103,
        "num_crossposts": 0,
        "selftext": "On The Tonight Show, Jimmy Fallon occasionally has a segment where he asks his Twitter followers to #DescribeA____Badly (e.g. movie, TV show, etc.). You can find examples on YouTube.\n\nLet’s kill some time by doing the same with stocks/companies: pick one or a few and describe them badly. Note that this is for humor and not seriousness. I’ll start…\n\nAAPL - You’ll continue buying the same crap we put out, so why innovate?\n\nADBE - Let your creativity out. Just pay us a subscription price to do so.\n\nAMZN - We’re not satisfied with world domination. Space is next.\n\nBRK.B - Because you’re too poor to afford BRK.A.\n\nFB - We know all your secrets.\n\nGOOG - We know even more of your secrets than FB.\n\nMSFT - Milking the same OS for almost four decades.\n\nLooking forward to reading yours.",
        "subreddit": "wallstreetbets",
        "title": "Describe a stock/company badly (humor post)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pzzq5j/describe_a_stockcompany_badly_humor_post/",
        "created": 1633225223.0
    },
    {
        "author": "masteroflich",
        "created_utc": 1634294027,
        "id": "q8lo3j",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Shopifys PE ratio has come down substantially over the past few quarters sitting on around 72 right now. For a company thats often labeled as the definition of overvaluation this doesnt seem very high.\n\nFor reference, other cloud businesses:\n\nAdobe has 48 and isnt growing half as fast. \n\nMsft is sitting at 36 and is arguably much more saturated that SHOP.\n\nsame with Amazon at 57\n\n&amp;#x200B;\n\nIt helps the company is a slight amount off its ATH, but im acutally considering doubling my initial investment. Thoughts?",
        "subreddit": "stocks",
        "title": "Why is $SHOP still considered heavily overvalued?",
        "url": "https://www.reddit.com/r/stocks/comments/q8lo3j/why_is_shop_still_considered_heavily_overvalued/",
        "created": 1634322827.0
    },
    {
        "author": "jeff9331",
        "created_utc": 1634536582,
        "id": "qagkhn",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "Basically i am very bullish on $KPLT at this price $4.85, here's why\n\n1) When u look at the number of buys from insider and institutional holders when this one crash in august due to removal of their guidance, they show smart money actually think the stock price around $3\\~5 is a steal. (The highest buy from insider is $4.42, which means CEO actually didnt expect market can be way overreacting that the price can drop to \\~$3)\n\nhttps://preview.redd.it/l67gnekm35u71.png?width=2359&amp;format=png&amp;auto=webp&amp;s=31097b2cf6f1af83d980b53e27291377b875b1c1\n\n[https://fintel.io/so/us/318085206](https://fintel.io/so/us/318085206)\n\n&amp;#x200B;\n\n2) Their revenue multiple now is absurdly low compared to other BNPL growth stock. with the stock trading at this range basically means that market expect KPLT with no growth in the coming years or going bankrupt soon which is ridiculous. if they can show some slight revenue growth and give us some full year guidance in the upcoming Q3 earning call (11/9), this one will surely be back at least $8. \n\nhttps://preview.redd.it/f9it5tsta5u71.png?width=1376&amp;format=png&amp;auto=webp&amp;s=674f626600b66b1e536179b0dcbfa6b3dd2db0b4\n\n3) One of the main concern people worry about this stock in their last Q2 earning is that `their LTO origination was down 17% YOY.` but i think this chart can explain this massive Year over year LTO origination decline. as they had exceptionally great Q2 last year due to COVID stimulus, which is one time surge only which made their `LTO origination` in Q2 2021 looks really bad, but when compared to Q1 2021 is still up 1%, so it is actually not that bad.\n\nhttps://preview.redd.it/w1foazc685u71.png?width=1354&amp;format=png&amp;auto=webp&amp;s=b5163b155a819fc728d209059d1a385ce3ba1d98\n\n4) Recent great direct partnership with Salesforce and Adobe\n\n[https://www.streetinsider.com/Corporate+News/Katapult+Holdings+%28KPLT%29+collaborates+with+Adobe+to+give+consumers+more+ways+to+pay/19045138.html](https://www.streetinsider.com/Corporate+News/Katapult+Holdings+%28KPLT%29+collaborates+with+Adobe+to+give+consumers+more+ways+to+pay/19045138.html)\n\n[https://www.globenewswire.com/en/news-release/2021/09/30/2306230/0/en/Katapult-Announces-its-Lease-Purchase-Solution-an-Integration-with-Salesforce-Commerce-Cloud.html](https://www.globenewswire.com/en/news-release/2021/09/30/2306230/0/en/Katapult-Announces-its-Lease-Purchase-Solution-an-Integration-with-Salesforce-Commerce-Cloud.html)\n\n5) Recent indirect waterfall partnership from Affirm with (amazon, target, walmart). The amazon - affirm deal actually sent $KPLT all the way up to $7\\~$8 in september.\n\n6) High short interest makes it a good short squeeze candidate if more good news coming\n\nhttps://preview.redd.it/6rbfbkjs95u71.png?width=1906&amp;format=png&amp;auto=webp&amp;s=044671cd44465dfa867285c48ce6af6b75be4cbf\n\n7) Their fail to deliver going into power this week, with this 2.6 million shares fail to deliver, and last friday the Market maker shorted more just to make the 5$ call expire worthless, this one has high chance to take off today or Tuesday.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/axjtad99a5u71.png?width=2389&amp;format=png&amp;auto=webp&amp;s=63a3f4a7d0a31dff9336d2b23e1a0aee9e0269f7\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5viw9d1aa5u71.png?width=960&amp;format=png&amp;auto=webp&amp;s=5ba5fc12d433a9cc3d496d1261c080a54b872aab\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nWhat are your thought about $KPLT? \n\n&amp;#x200B;\n\nPosition: 200 11/19 $6 call",
        "subreddit": "SPACs",
        "title": "who are here the holder of $KPLT ? some thoughts about $KPLT",
        "url": "https://www.reddit.com/r/SPACs/comments/qagkhn/who_are_here_the_holder_of_kplt_some_thoughts/",
        "created": 1634565382.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1634760228,
        "id": "qc9lxh",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Wednesday, October 20, 2021**\n\n***Quick rant:*** *It’s remarkable how quickly market sentiment changes. It seems two weeks ago, everyone was predicting an imminent market crash and, in many occasions, going as far as insulting my intelligence for presenting a different viewpoint and remaining bullish even during the height of the Evergrande situation and a looming US debt default. Now it seems the doomsaying posts and articles have all but disappeared. The market has dipped significantly roughly 5-6 times this year and every time it happens I see the same upswell of doomsaying articles and market crash predictors. Not to go on a rant, but it amazes me how willing people are to fight against the trend. Like I’ve said, it is important to acknowledge risks present in the market and be prepared to react to the unforeseen, but I don’t get why people decide to consciously decide to fight market trends, it is much easier and more profitable to just ride them until you can’t anymore. There’s a saying that goes, pessimists sound smart, optimists make money. I have found this saying to be true.* \n\nThe incredible rally in the stock market continued, with the S&amp;P 500 (SPY) climbing seven straight days to claw back the losses suffered in September when the index dipped -5% from highs for the first time all year. While the tech-heavy Nasdaq (QQQ) fell modestly today, the index has rocketed more than 6% higher from the lows on October 4, a stunning comeback. The Dow Jones (DIA) reached a new intraday all-time high, carried by continued strength in financial stocks. The Russell 2000 (IWM), which tracks the performance of small-caps, traded modestly higher today. Market participants remain encouraged by stronger-than-expected corporate profits amid ongoing supply-chain pressures.\n\nVery strong corporate earnings reports from bellwethers like big banks, Johnson and Johnson (JNJ), and Procter and Gamble (PG) have assuaged fears that corporate profits would slow down dramatically amid supply chain constraints. As the earnings season kicked off, market participants were nervous that ongoing inflationary pressures, labor market imbalances, and congestions issues at ports would greatly weigh on corporate profits. So far, that has not proven to be the case. \n\nJon Adams, Senior Investment Strategist at BMO Capital Markets said, “We think investorshave been too pessimistic on earnings expectations. It does look like Q2 was likely the peak, but Q3 is going to be strong, probably above 30% year-over-year growth. We think the strength will continue into the fourth quarter, we’re not overly concerned about profit margins. We are closely monitoring supply chain issues and increasing wage pressures but still think that profit margins are at healthy levels, and that there's more upside to come.\"\n\n**Highlights**\n\n* The price of … reached new all-time highs, breaking $65k for the first time after the first-ever ETF was launched in the market yesterday.\n* Sharers of Pinterest (PINS) rocketed higher after Bloomberg reported that PayPal (PYPL) was considering acquiring the company for $70 a share (roughly $39 billion). Shares of PINS were up more than 10% while shares of PYPL fell after the report was released.\n* Adobe (ADBE) says it expects holiday-period online sales to reach an all-time high of $207 billion from November 1 to December 31 in the US. That would represent a jump of 10% YoY. The company says it expects global online sales to reach $910 billion, also a record.\n* The 30-year fixed mortgage rate increased to 3.23% for the week ended Oct. 15, according to a weekly update from the Mortgage Bankers Association. This is the highest level in six months and higher than the 3.18% during the prior week. \n* Facebook (FB) will change its name in order to reflect itself as a “metaverse” company. As a reminder, the metaverse is a shared, 3D virtual space in which people can interact with the environment and other via online avatars accessed using virtual reality technology.\n* Jack MA, founder of Alibaba (BABA) was seen traveling in Europe, specifically Spain, in the first overseas trip since the government began cracking down on his companies over a year ago. \n* DraftKings (DKNG) is launching online betting operations in Connecticut\n* Ford Motors (F) to invest $300 million in building an electric vehicle car parts factory in the UK\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Amazon (AMZN) target set at $4,100 by Mizuho. Stock currently around $3416\n* Apollo Global Management (APO) target raised by BMO Capital Markets from $80 to $93 at Outperform. Stock currently around $75\n* Chevron (CVX) target raised by Raymond James from $125 to $134 at Outperform. Stock currently around $113\n* Caesars Entertainmnet (CZR) target raised by Morgan Stanley from $127 to $138 at Overweight\n* Generac (GNRC) target raised by KeyCorp from $500 to $520 at Overweight. Stock currently around $461\n* Halliburton (HAL) with a host of target raises. Average price target $30 at Overweight. Stock currently around $26\n* Microsoft (MSFT) with two target raises. Stock currently around $307\n   * Jefferies Financial from $345 to $365 at Buy\n   * Wedbush from $350 to $375 at Outperform. S\n* Netflix (NFLX) with a host of target raises after posting positive earnings. Average price target $725 at Buy. Stock currently around $625\n* ServiceNow (NOW) target raised by Bank of America from $700 to $800 at Buy. Stock currently around $680\n* O’Reilly Automotive (ORLY) target raised by Wells Fargo from $670 to $700 at Overweight. Stock currently around $644\n* Signature Bank (SBNY) with three target raises. Stock currently around $310\n   * Maxim Group from $330 to $375 at Buy\n   * Wedbush from $320 to $340 at Outperform\n   * Raymond James from $337 to $360 at Strong-Buy\n\n“Don't judge each day by the harvest you reap but by the seeds that you plant.” - Robert Louis Stevenson",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, October 20, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/qc9lxh/here_is_a_market_recap_for_today_wednesday/",
        "created": 1634789028.0
    },
    {
        "author": "ZhangtheGreat",
        "created_utc": 1634576775,
        "id": "qar0iq",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "ADBE is a stock I regret not buying when I first started investing in April, because at the time, I had no idea how much of a competitive advantage it had on its rivals. Now that I understand more, I want in, but the problem is that its price is way too high, especially after that run-up in June.\n\nThe September sell off was encouraging, but I didn’t want to buy if it stayed above 500. Now it’s back up above 600 (as of this post).\n\nIs anyone else in or waiting to get into ADBE? Anyone have any thoughts they’re willing to share about it? Thanks!",
        "subreddit": "stocks",
        "title": "Adobe (ADBE) - I want in, but…",
        "url": "https://www.reddit.com/r/stocks/comments/qar0iq/adobe_adbe_i_want_in_but/",
        "created": 1634605575.0
    },
    {
        "author": "makaros622",
        "created_utc": 1634492959,
        "id": "qa3qfr",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I am a 29yo long term investor. My goals is capital for retirement or FIRE. \n\nI have been building a portfolio over the last 1.5 years.\n\nMy portfolio consists of 3 main ETFs (SP500, all world, small caps).\n\nAdditionally, to boost returns, I have invested in the following stocks:\n\nAAPL\nFB\nPINS\nMA\nIDXX\nSQ\nLMND\nFSS\nADSK\nXPEL\nMSFT\nPYPL\nNET\nTDOC\nFVRR\nETSY\nCRWD\nAMD\nTSLA\nSE\nPLTR\nAPPS\nCHPT\nSOFI\nMU\nCRSR\nU\nV\nNVDA\nAMAT\nTTD\nGRWG\nOPEN\nDMTK\n\nSome like DMTK are really speculative.\n\nFrom now on, I am thinking to only invest into my 3 ETFs (every month) and only to the following stocks (only when they dip at least 5%). So my ETFs remain my core.\n\nTTD, SQ, PYPL, FB, FVRR, AAPL, MSFT, ETSY, MU, SOFI, AMD, NVDA, PINS, CRSR, SE,  APPS , U, TSLA, MA, V, TDOC,  CRWD, FSS, NET, PLTR, AXON, ROKU, UPST, DDOG, DOCU, LMND, ADSK, ADBE, AMAT\n\nWhat do you think?",
        "subreddit": "stocks",
        "title": "Advice/discussion about my portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/qa3qfr/advicediscussion_about_my_portfolio/",
        "created": 1634521759.0
    },
    {
        "author": "fomotherapy",
        "created_utc": 1635545689,
        "id": "qinqxz",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Hey guys,  \n\nNot being sarcastic here, i'm really serious. How are these guys having 93B market cap selling Photoshop and After effects? I mean they're generally not even selling this stuff since most people rips it off.  \n\nIs their business model really based primarly on selling software products? Photoshop and after effects and Adobe PDF reader are worth 93B?  \n\nThanks guys!",
        "subreddit": "stocks",
        "title": "Why adobe (ADI) has such a huge market cap? I mean these guys are only selling Photoshop",
        "url": "https://www.reddit.com/r/stocks/comments/qinqxz/why_adobe_adi_has_such_a_huge_market_cap_i_mean/",
        "created": 1635574489.0
    },
    {
        "author": "Anth916",
        "created_utc": 1635382500,
        "id": "qhb3kp",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I recently sold some ADBE (yesterday) and ASML (today). In both cases, my sale price was actually higher than the intraday that you see on Yahoo Finance. In the case of Adobe, it was only like 7 cents higher. In the case of ASML, it was like 23 cents higher.\n\nI'm assuming it's because these stocks are so expensive, that you can have an ask that might be slightly higher than what everybody else is getting, and somebody reaches up and grabs your ask, but it somehow doesn't reflect in the overall intraday high.\n\nAt lest, that's my current theory.\n\nEither that, or is TD Ameritrade themselves buying my shares for some purpose? So somebody can short it or something...",
        "subreddit": "stocks",
        "title": "I sold some stocks slightly higher than the intraday high.. how does this happen?",
        "url": "https://www.reddit.com/r/stocks/comments/qhb3kp/i_sold_some_stocks_slightly_higher_than_the/",
        "created": 1635411300.0
    },
    {
        "author": "jeff9331",
        "created_utc": 1634297824,
        "id": "q8mlwn",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Katapult is a company provides BNPL options for non-prime E-commerce customers. Katapult is the only pure-play financing platform dedicated to E-commerce\n\nWhy i think they are the most undervalued BNPL stock in the market?\n\n* When compare katapult to other growth stock in BNPL space. For today's price, it is just trading \\~2x revenue vs the BNPL industry standard 28x revenue. They have a good growth record from 2018\\~2020 shown as below.\n\nhttps://preview.redd.it/a17yuix4blt71.png?width=950&amp;format=png&amp;auto=webp&amp;s=4fd1b5e7262b6f7d364920f9b834a15f45df7a37\n\n* They are the only player in the nonprime and e-commerce area. and nonprime customers are the most underserved customers in US.\n\nhttps://preview.redd.it/3l59fforblt71.png?width=950&amp;format=png&amp;auto=webp&amp;s=9bcdcbe1db74438faf24a9092e33c6bfab99df2c\n\n* There is a waterfall partnership for katapult to gain customers from Affirm, when customers are denied financing with Affirm. So recent great partnerships of Affirm with \\[Amazon, Target and Walmart\\] could translate a big gain to katapult.\n* They have \\~100 millions in hand and have been profitable in 2020\n\nhttps://preview.redd.it/drmb3cikhlt71.png?width=950&amp;format=png&amp;auto=webp&amp;s=98d792f0b25936c31f5433f87a24e99f043cae42\n\n* Recent great direct partnership with Salesforce and Adobe \n\n[https://www.streetinsider.com/Corporate+News/Katapult+Holdings+%28KPLT%29+collaborates+with+Adobe+to+give+consumers+more+ways+to+pay/19045138.html](https://www.streetinsider.com/Corporate+News/Katapult+Holdings+%28KPLT%29+collaborates+with+Adobe+to+give+consumers+more+ways+to+pay/19045138.html)\n\n[https://www.globenewswire.com/en/news-release/2021/09/30/2306230/0/en/Katapult-Announces-its-Lease-Purchase-Solution-an-Integration-with-Salesforce-Commerce-Cloud.html](https://www.globenewswire.com/en/news-release/2021/09/30/2306230/0/en/Katapult-Announces-its-Lease-Purchase-Solution-an-Integration-with-Salesforce-Commerce-Cloud.html)\n\nThe reason they went down from 10$ to $3 when they removed the full year guidance in their last earning call.\n\nBut with the insiders kept buying around $3.4\\~4.42 range right after that massive sell-off,  i think it is just way overreacting to the earning call. Right now should be a great buying opportunity when the stock is just trading \\~$5 range, when they are about to report their Q3 result on 11/9.\n\nhttps://preview.redd.it/wg4n3gwmelt71.png?width=2116&amp;format=png&amp;auto=webp&amp;s=6d1c5343797008ba217cb288b1f1024b5407e489\n\nOne of the main concern people worry about this stock in their last Q2 earning is that their LTO origination was down 17% YOY. but i think this chart can explain this massive Year over year LTO origination decline. as they had exceptionally great Q2 last year due to COVID stimulus, which is one time surge only which made their Q2 2021 looks really bad, but when compared to Q1 2021 is still up 1%, so it is actually not bad.\n\nhttps://preview.redd.it/wtljix8qklt71.png?width=1354&amp;format=png&amp;auto=webp&amp;s=aee83ec73add7b87618f58ab7f24fb77706141f2\n\nAnd it doesn't not only have great *fundamentals, it also has great short squeeze potential.*\n\n26.18% float shorted \n\nhttps://preview.redd.it/p5dy35k9glt71.png?width=1906&amp;format=png&amp;auto=webp&amp;s=1492b7db208fb9c28566f467f4ee5b0fd760fa14\n\nThe shorts have been trying to push the price down so that 19316 10/15 6$ call options can expire worthless today. \n\nhttps://preview.redd.it/wl7oqei8glt71.png?width=2096&amp;format=png&amp;auto=webp&amp;s=a850428ff80dd5100e9c85e78977714fb0705337\n\nbut with the lots of Fail to deliver going into power this week, i think $KPLT have really high chance taking off today. \n\nhttps://preview.redd.it/j2lgu7onllt71.png?width=2389&amp;format=png&amp;auto=webp&amp;s=b893d842eb1c6cff993ce7fdcdfed92dc62ae656\n\nhttps://preview.redd.it/w0bx93ntglt71.png?width=960&amp;format=png&amp;auto=webp&amp;s=c4c2e88fd61b50598cb0ffe46076be9d2fc044ac\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nPosition: 200 11/19 $6 call",
        "subreddit": "wallstreetbets",
        "title": "(Nonprime version of $AFRM) $KPLT Katapult is dirty cheap right now, the most undervalued stock in BNPL space",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q8mlwn/nonprime_version_of_afrm_kplt_katapult_is_dirty/",
        "created": 1634326624.0
    },
    {
        "author": "omotrodest",
        "created_utc": 1635531426,
        "id": "qiixtv",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I'm following Peter Lynch's (Fidelity fund manager in the 70s-90s who beat the S&amp;P500 and had an annualized performance of 29% across his years). His simple strategy is to \"use our edge\" (in our own industry) and \"invest in what we know\", since we get to know of innovative companies before Wall Street does. I'm a software engineer in FAANG/big tech, and I frequently work with product managers and designers so this is exactly my domain. For that, I'm buying AMPL Amplitude - they just IPO'ed a month ago.\n\nAmplitude is heavily used by product-driven teams. From using it personally and talking with friends in other FAANGs/unicorns/boomer/mid-sized tech cos, it’s an essential favorite of product managers and product-focused teams (devs, ui/ux, sales, marketing, customer success). It’s also a bet on the product-led growth paradigm that was popularized by FB/Google. This is a bet on the PM wave and the rise of product management that we're seeing across ALL industries (not just in tech). Just search for “product manager” in LinkedIn jobs. You’ll see lots of boomer companies having job postings for them. We’re seeing revenue drivers of companies shifting from sales/marketing (historically the revenue driver) to product teams (historically a cost center).We’ve seen the rise of digital sales (Salesforce/CRM), digital marketing (Hubspot/HUBS), and customer experience management (Sprinklr/CXM, Salesforce, Hubspot, and Adobe/ADBE), but they had their time. The digital world and digital optimization isn't just about snatching that first sale online - it's also about providing the best customer journey and deriving the lifetime value of the customer as a result. Product-led growth's time is now - we’re seeing the rise of product management, which has been popular in tech (for years) but only recently (in the pandemic) did boomer companies also copy this.\n\nHow did I come across this? From talking with friends in other FAANGs/big techs/unicorns and also from seeing our product teams using it. I think this is the benefit of not sticking ones head into your tech company's own tech stack. Just working on your own company's tech stack causes techies to become \"institutionalized\". Your tech skills don't just degrade but it also prevents you from coming across hypergrowth SaaS companies outside - be more alert in watching for tech stacks you techies are working on. Anyone working in tech would have come across the rise of Atlassian Jira ($TEAM - used by tech companies for scrum/PM task management), Twilio (API-powered communications), and Okta (API for single-sign on/security/login).\n\nAnd AMPL's management team is just terrific - just look at their Teamblind ratings - nearly 4.5 across all categories! Teamblind is what us tech workers use - we don't use boomer Glassdoor to rate companies or share experience - us tech workers in the industry only ever use Teamblind. AMPL takes care of their people and pay top rate, so hopefully they have low churn. And their CEO (Spencer Skates) is actively talking to the community on HackerNews - check out his active community involvement at HN ([https://news.ycombinator.com/user?id=sskates](https://news.ycombinator.com/user?id=sskates)). He is also active on reddit under u/sskates. Their Chief Architect (Jeffrey Wang) is also active on reddit discussing Amplitude, product analytics, and engineering - [https://www.reddit.com/user/paladin314159/](https://www.reddit.com/user/paladin314159/).\n\nSeriously - their management team is like Jim Sinegal (the retired CEO/co-founder of Costco) - he famously was humble/down to earth, dressed simply, visited individual Costco warehouses, and worked the floor (talking to customers and floor staff) even though he was the CEO! I think the Amplitude team is embodying the Costco exec team's mindset - treat their employees well, don't screw over/f\\*ck over customers, pay top talent, and be humble. Amplitude also pays top-tier for talent (as seen from anecdotes their Teamblind ratings). What are other examples of companies succeeding with a Costco-like-treat-employees-well + pay-top-talent mindset? Starbucks (SBUX), Atlassian (TEAM), Google, Southwest Airlines back in the day (LUV), Dutch Bros Coffee (BROS), Costco (COST), Hubspot (HUBS).\n\nYou guys should read the \"Letters from our founders\" section in Amplitude's S-1 IPO doc. They are true visionaries. Here's also what the CEO u/sskates mentioned in reddit. They are doing for product management what Salesforce did for sales and Adobe for marketing. I encourage you guys to go through the hackernews + reddit posts of sskates (Spencer - the CEO) and Jeffrey ([paladin314159](https://www.reddit.com/user/paladin314159/) on reddit). Read their S1 too!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fjq5i0b0kfw71.png?width=1024&amp;format=png&amp;auto=webp&amp;s=c603727d3e6c7df1cc9d1d775df3871ab51706ec\n\n&amp;#x200B;\n\nTheir exec teams discussions also mention how they encourage their own engineers to talk to customers themselves - what a product- driven company! The culture within the company is also awesome according to Teamblind - they even have a program where staff are paired with one other random staff (or was it a team) to grab coffee breaks. AMPL indeed practice what they preach - which is to break down enterprise silos and be product-driven. They mentioned this in announcements but also in the CEOs HackerNews comments and the Chief Architect's reddit comments.\n\nFor 2021 and onwards, they are going to focus on winning the enterprise product analytics environment (winning more of the Fortune 100/Fortune 500) as boomer companies join the product analytics/product management bandwagon. Enterprise and large customers are where the money is at for product analytics. Their customer acquisition model of volume upsell and product cross- sell (mentioned in their S-1 filing) is also interesting as volume upsell leads to the optimization of existing Amplitude's offerings and product cross-sell leads to new Amplitude offerings. Focusing on enterprise is the right strategy - Mixpanel (their competitor) should have done this but instead they focused on SMBs - which have lower revenue. Enterprise is where the money is at - look at MSFT, CRM (Salesforce), Adobe, and Intuit - what? - those stocks gained **as much as the FAANG/even more,** but you never hear reddit or Jim Cramer pumping these grandma B2B tech companies. Why? Because B2B tech companies are an absolute cash cow (milking enterprises) BUT they are not sexy, so WSB and CNBC/Cramer doesn't pump them. AMPL is gonna be another unsexy B2B tech biz, just like Atlassian, Twilio, and Okta.\n\nAMPL's net retention rate is also 119% - meaning a customer spends 1.19 cents in the next year if they spend 1 dollar this year - that's an amazing NRR rate! That is much better than Hubspot's (HUBS) Net Revenue Retention rate of 90-100% and revenue growth rate of 35-40%... and their stock has 15x-30xed in the past 5 years (nearly 2x YTD!). That's the power of hypergrowth SaaS - HUBS having much lower YoY revenue growth and NRR retention rate still went to the moon.\n\nI also checked out their VC backers in Crunchbase - yeah lots of well-known names so that's a definite sign of approval. Big names include Sequoia, Benchmark, and IVP venture funds.\n\nFrom a valuation perspective, AMPL has a P/S ratio of around 30-50 (based on 2021/2022 numbers - can't pin this down accurately yet) even though they are growing at around 50-70%. Their gross margin is also at 60-70+%. As a rule-of-thumb for high-gross-margin SaaS companies, the P/S ratio number and revenue YOY growth rate should be the same. AMPL's P/S should in theory grow to 50-70% to match their revenue growth rate - and that's just IF they grow into TODAY's (2021) valuation - their P/S could go much higher when the market realizes and prices in their future years' growth.\n\nI'm following Peter Lynch's advice to buy what I know and these are my high conviction, buy-and-hold stocks as long as their story doesn't change. Peter Lynch managed Fidelity's Magellan Fund, and he grew his fund by 29% annualized over 13 years (even across bear markets - beating the SP500 by a wide margin). He just bought growth stocks in growing industries by using his \"insider edge\". His \"edge\" was going to the mall and seeing how companies like GAP, Dunkin Donuts, and Home Depot were popular wayyyyy before Wall Street and when their stock barely moved (due to receiving no attention from Wall Street yet). AMPL will grow into their valuation later (it's already undervalued/valued just right based on P/S). And I'm buying it because everyone in product management uses it. Lynch also noted that growth stocks (like Walmart and Fedex back in the day) were never cheap. He noted that the best stocks are leading growth companies in a nascent/growing/new industry (in this case product management analytics popularized by Amplitude, Heap, Mixpanel, Pendo, Woopra, mParticle, etc). Lynch's advice for retailers is to use their edge and intricate knowledge of the industry to beat the market - I'm doing that.\n\nAMPL is one of the 3 stocks that I hold a significant concentration of my portfolio in. Why concentrate hold a significant concentration on a few stocks? I'm following Buffett's and Munger's advice - for people that know what they are doing, diversifying is a terrible mistake. Nobody has gotten rich off their 7th best idea instead of their first best idea. Their advice is to extremely concentrate on a few position if the conviction is right. Berkshire and Daily Journal (Munger's own fund) both held as few as 2-3 stocks back when they were smaller and when they had high conviction plays. Buffett's and Munger's advice for people with \"insider edge\" is to concentrate portfolios into high conviction plays.\n\nHappy weekend and let me know your thoughts. I grokked their S-1 IPO docs before they IPO'ed + went through the reddit and hackernews posts of both Spencer (CEO) and Jeffrey (chief architect) and they truly are the growth leader in this nascent space.\n\n&amp;#x200B;\n\nPositions:\n\n&amp;#x200B;\n\nMore than 650k across all my accounts.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/yg7xq0u6kfw71.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=42ab93364b22c8e90e1bdf5d073ccf0728aa1b1c\n\n&amp;#x200B;\n\nhttps://preview.redd.it/psfug6qbkfw71.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=6fdde9b13573d43ad66d495f1661885a37ab7fe9\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9cfzl2mckfw71.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=101d5da91a21ab8c33f7035a321dd7627c3ffa0e",
        "subreddit": "wallstreetbets",
        "title": "AMPL - a bet on the rise of product management and product-driven development",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qiixtv/ampl_a_bet_on_the_rise_of_product_management_and/",
        "created": 1635560226.0
    },
    {
        "author": "ShittyStockPicker",
        "created_utc": 1634619666,
        "id": "qb4eht",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I've been holding Facebook for a while, buying shares here and there on dips. I've listened to the conference calls and everything, but there's something that's bugging me about the company, and social media in general. \n\nI own shares in NVDA. I'm a long term buy and holder of the company. I think they'll provide the brainpower for the software of the future. NVDA has real estate, patents, brain power, and produces a physical product. If NVDA decided to just shut down their factories tonight, the world would panic. Prices of microchips would skyrocket even further, inflation in anything that relied on cheap chips would spiral out of control in this particular manufacturing situation. The United States might even regard this as a national security issue. \n\nWhat would happen if Mark shut down Facebook's servers? Well, I guess we'd spend more time on Reddit, maybe? I might text my friends instead of like their pictures on Facebook? \n\nThe one thing that has stuck with me since I heard Buffet say is that he invests in companies \"with an enduring competitive advantage\". I honestly can't think of what that competitive advantage is when Facebook went down, and damn near nothing about the world changed. We all just kinda went somewhere else.   \n\n\nI'm kind of in the middle of a portfolio rebalancing. I've always liked Adobe, owned it for a little while. I might switch out FB for ADBE. I dunno.",
        "subreddit": "ValueInvesting",
        "title": "As much as I love Facebook, I think I have to divest from the company",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/qb4eht/as_much_as_i_love_facebook_i_think_i_have_to/",
        "created": 1634648466.0
    },
    {
        "author": "chriizzl",
        "created_utc": 1634576902,
        "id": "qar24t",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hey everyone,\n\nI did put a lot of research into the current situation for quite some time and finally build a portfolio I am 100% behind long-term. However, the more I learned, the more sure I am that we will experience a market crash rather soon, than late.\n\nI am not here to debate whether or not you think this is true, but the situation for this thought game is that we might see a crash similar in numbers, not principle like 2008' all over again.In general, during times of high inflation, most businesses will not come out well. The earnings will go up, but they need to put more money into their own business to even stay in the same place. A hedge for this are companies that can easily scale their business without needed money flow. I am looking at you Facebook, who can place 10% more ads, Adobe who can increase their product price without fear of losing customers, Apple, Microsoft...\n\nThe theory behind this discussion would assume that GameStop is a good hedge and to some degree AMC as well, I even heard that from the high ups in a very big, german bank, which is incredibly weird since they were against it months ago and did not even want to talk about it in the first place. This assumes that the crash is happening because of said theory I explained below in short in an edit. It does not mean that a high percentage of the entire portfolio should persist of them, but a chunk just in case might be a very good idea. The market is more complex than many think.\n\nAnother hedge and long term hold can not be mentioned in this sub, but you might guess what it is. Sadly, we cant debate this here. Has to do with weird blocks and tokens, latter of which might change the whole gaming industry and I am thankfully in the position where I can take constant profits from it in percentages that sound absolutely insane.\n\nSo, in case of this **theoretical** scenario, I would like to get everyone's opinion on this. I want to be clear, I value every single opinion and would love the most input possible. In case of no crash, my investments should grow steadily, but in case of a crash due to named circumstance, they would skyrocket. Again, this is purely theoretical, I do not want to discuss whether or not it is happening, but what you would do in case it will happen in the near future.\n\n&amp;#x200B;\n\n**TLDR: How would you hedge against a potential market crash ala 2008 due to Evergrande + GameStop and the overall situation?**\n\n[What people on r/stocks still think is going on.](https://imgur.com/a/NDk35Xm)\n\n*Since I get downvoted to hell in a different subreddit, I would like to explain what I think is happening with GameStop. That should be widely known here by now, but I will just repeat that again.*\n\n*The theory: The most part of the stock is traded in Dark Pools and all the shorting Hedge Funds are telling us that they closed their position, which is mathematically impossible. Do the research yourself. So, what I think is happening, is that all the shorts are actually synthetic and not real shares. There is tons and tons of proof of it, too much to even deny at this point. They exercise and sell deep ITM calls in order to get the FTDs. So basically, they are passing them from one to another, to another.*\n\n*Think of it like this, a good analogy I found: You get a credit card with 10.000$ on it, max it out and have to repay next month. However, you have endless credit cards, so you can get another credit card and \"pay\" the 10.000$ with that. The debt is still there, its just getting passed. You can do that forever. Now you need more money, so you do this all over again and keep digging the grave deeper and deeper. In this theory, multiple times the float and continuing. In order to stop that, you have to lock the float entirely, which is why everyone is currently directly registering their shares. IF this is true, I do not have to explain the potential outcome. There is simply too much proof as that I can deny that at all.*\n\n*Computershare confirmed this:*  \n*Quote from their Twitter: \"Shares held directly on the books of US companies through a transfer agent are not held at DTCC. As such, shares are not available to be loaned for any means within the security markets. Computershare is a registered transfer agent &amp; therefore does not lend shares in any capacity\"*\n\n*I need to admit I am a bit disappointed by the negative response from a lot of people, but I would like to keep this open and come back one year later, I will simply take all the downvotes from here. I will still read everything and appreciate any opinion on the topic.*\n\n*Cheers, have a nice week everyone!*",
        "subreddit": "wallstreetbets",
        "title": "Hedging against a Market Crash, 2008' all over again",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qar24t/hedging_against_a_market_crash_2008_all_over_again/",
        "created": 1634605702.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1634760252,
        "id": "qc9m9m",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Wednesday, October 20, 2021**\n\n*Quick rant: It’s remarkable how quickly market sentiment changes. It seems two weeks ago, everyone was predicting an imminent market crash and, in many occasions, going as far as insulting my intelligence for presenting a different viewpoint and remaining bullish even during the height of the Evergrande situation and a looming US debt default. Now it seems the doomsaying posts and articles have all but disappeared. The market has dipped significantly roughly 5-6 times this year and every time it happens I see the same upswell of doomsaying articles and market crash predictors. Not to go on a rant, but it amazes me how willing people are to fight against the trend. Like I’ve said, it is important to acknowledge risks present in the market and be prepared to react to the unforeseen, but I don’t get why people decide to consciously decide to fight market trends, it is much easier and more profitable to just ride them until you can’t anymore. There’s a saying that goes, pessimists sound smart, optimists make money. I have found this saying to be true.* \n\nThe incredible rally in the stock market continued, with the S&amp;P 500 (SPY) climbing seven straight days to claw back the losses suffered in September when the index dipped -5% from highs for the first time all year. While the tech-heavy Nasdaq (QQQ) fell modestly today, the index has rocketed more than 6% higher from the lows on October 4, a stunning comeback. The Dow Jones (DIA) reached a new intraday all-time high, carried by continued strength in financial stocks. The Russell 2000 (IWM), which tracks the performance of small-caps, traded modestly higher today. Market participants remain encouraged by stronger-than-expected corporate profits amid ongoing supply-chain pressures.\n\nVery strong corporate earnings reports from bellwethers like big banks, Johnson and Johnson (JNJ), and Procter and Gamble (PG) have assuaged fears that corporate profits would slow down dramatically amid supply chain constraints. As the earnings season kicked off, market participants were nervous that ongoing inflationary pressures, labor market imbalances, and congestions issues at ports would greatly weigh on corporate profits. So far, that has not proven to be the case. \n\nJon Adams, Senior Investment Strategist at BMO Capital Markets said, “We think investorshave been too pessimistic on earnings expectations. It does look like Q2 was likely the peak, but Q3 is going to be strong, probably above 30% year-over-year growth. We think the strength will continue into the fourth quarter, we’re not overly concerned about profit margins. We are closely monitoring supply chain issues and increasing wage pressures but still think that profit margins are at healthy levels, and that there's more upside to come.\"\n\n**Highlights**\n\n* The price of … reached new all-time highs, breaking $65k for the first time after the first-ever ETF was launched in the market yesterday.\n* Sharers of Pinterest (PINS) rocketed higher after Bloomberg reported that PayPal (PYPL) was considering acquiring the company for $70 a share (roughly $39 billion). Shares of PINS were up more than 10% while shares of PYPL fell after the report was released.\n* Adobe (ADBE) says it expects holiday-period online sales to reach an all-time high of $207 billion from November 1 to December 31 in the US. That would represent a jump of 10% YoY. The company says it expects global online sales to reach $910 billion, also a record.\n* The 30-year fixed mortgage rate increased to 3.23% for the week ended Oct. 15, according to a weekly update from the Mortgage Bankers Association. This is the highest level in six months and higher than the 3.18% during the prior week. \n* Facebook (FB) will change its name in order to reflect itself as a “metaverse” company. As a reminder, the metaverse is a shared, 3D virtual space in which people can interact with the environment and other via online avatars accessed using virtual reality technology.\n* Jack MA, founder of Alibaba (BABA) was seen traveling in Europe, specifically Spain, in the first overseas trip since the government began cracking down on his companies over a year ago. \n* DraftKings (DKNG) is launching online betting operations in Connecticut\n* Ford Motors (F) to invest $300 million in building an electric vehicle car parts factory in the UK\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Amazon (AMZN) target set at $4,100 by Mizuho. Stock currently around $3416\n* Apollo Global Management (APO) target raised by BMO Capital Markets from $80 to $93 at Outperform. Stock currently around $75\n* Chevron (CVX) target raised by Raymond James from $125 to $134 at Outperform. Stock currently around $113\n* Caesars Entertainmnet (CZR) target raised by Morgan Stanley from $127 to $138 at Overweight\n* Generac (GNRC) target raised by KeyCorp from $500 to $520 at Overweight. Stock currently around $461\n* Halliburton (HAL) with a host of target raises. Average price target $30 at Overweight. Stock currently around $26\n* Microsoft (MSFT) with two target raises. Stock currently around $307\n   * Jefferies Financial from $345 to $365 at Buy\n   * Wedbush from $350 to $375 at Outperform. S\n* Netflix (NFLX) with a host of target raises after posting positive earnings. Average price target $725 at Buy. Stock currently around $625\n* ServiceNow (NOW) target raised by Bank of America from $700 to $800 at Buy. Stock currently around $680\n* O’Reilly Automotive (ORLY) target raised by Wells Fargo from $670 to $700 at Overweight. Stock currently around $644\n* Signature Bank (SBNY) with three target raises. Stock currently around $310\n   * Maxim Group from $330 to $375 at Buy\n   * Wedbush from $320 to $340 at Outperform\n   * Raymond James from $337 to $360 at Strong-Buy\n\n“Don't judge each day by the harvest you reap but by the seeds that you plant.” - Robert Louis Stevenson",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Wednesday, October 20, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/qc9m9m/here_is_a_market_recap_for_today_wednesday/",
        "created": 1634789052.0
    },
    {
        "author": "ProfPennyPincher",
        "created_utc": 1634065987,
        "id": "q6teh9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "With the psychedelic market expected to reach $100B very soon, I have a few holdings in psychedelics companies across the sector, and I know a bit about the industry. But the real question is, how does the average investor who's not super knowledgeable about the industry get in?\n\nThat's where a soon to IPO company called Origin Therapeutics comes in. CSE reserved $ORIG plans to invest (and is already investing) in a diverse range of psychedelic companies that encompass different industry areas and will open the door to many early-stage/high-potential companies for the average investor. This means they invest in and guide small/emerging companies to generate returns for $ORIG investors. Some of their portfolio companies include:\n\n* Microdose Psychedelic Insights\n* Ocean Bio Ltd.\n* Dimensions Health Centres Inc.\n* Xpira Pharmaceuticals Inc.\n* Tripsitter Clinic Corp.\n\nIt goes a bit more in-depth about what each company does in the article: [https://financialpost.com/globe-newswire/origin-therapeutics-files-preliminary-prospectus-and-announces-initial-portfolio-companies/wcm/6c9aeea8-238f-45d1-8acb-ae9706ac69ba/amp/](https://financialpost.com/globe-newswire/origin-therapeutics-files-preliminary-prospectus-and-announces-initial-portfolio-companies/wcm/6c9aeea8-238f-45d1-8acb-ae9706ac69ba/amp/)\n\nThe management team over at $ORIG is extremely impressive as well. Early investors or founders in companies such as Adobe, Cybin, Charlotte’s Web, and many more.\n\nhttps://preview.redd.it/ijhltsnlj2t71.png?width=1318&amp;format=png&amp;auto=webp&amp;s=cb466af41c9c1badbbb7701fdcc398bb4aeb5de5\n\nTie an experienced management team with market growth and their already promising holdings. I'm getting pretty excited for the IPO. They recently completed a $6.5M financing round closed back in August, and we should see $ORIG on the CSE sometime this Q.\n\nTake a look at their investor presentation: [https://originpsychedelics.com/wp-content/uploads/2021/07/Origin-Investor-Deck.pdf](https://originpsychedelics.com/wp-content/uploads/2021/07/Origin-Investor-Deck.pdf)",
        "subreddit": "shroomstocks",
        "title": "$ORIG.C - Promising Psychedelic IPO as the Sector Continues to Heat Up",
        "url": "https://www.reddit.com/r/shroomstocks/comments/q6teh9/origc_promising_psychedelic_ipo_as_the_sector/",
        "created": 1634094787.0
    },
    {
        "author": "manuce94",
        "created_utc": 1634620700,
        "id": "qb4nx1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "CanadianInvestor",
        "title": "Adobe Aims At 22% EPS Growth From Markets Worth $147 Billion",
        "url": "https://www.forbes.com/sites/petercohan/2021/10/17/adobe-aims-at-22-eps-growth-from-markets-worth-147-billion/?sh=471aa264766b",
        "created": 1634649500.0
    }
]