[
    {
        "author": "VisualMod",
        "created_utc": 1630227613,
        "id": "pdrwfn",
        "num_comments": 10829,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 29, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pdrwfn/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1630256413.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1629622821,
        "id": "p997ik",
        "num_comments": 8881,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 22, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p997ik/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1629651621.0
    },
    {
        "author": "dkkc19",
        "created_utc": 1628095787,
        "id": "oxwuiw",
        "num_comments": 3853,
        "num_crossposts": 0,
        "selftext": "There's still so many people using Robinhood after all the GME crap. And what really blows my mind is that I see people here on this very sub using Robinhood everyday? It absolutely baffles the living shit out of me as to why you are still using something that screwed you over, especially knowing very well that it could happen again and screw you over AGAIN. I don't want to see anyone who gets screwed over by Robinhood yet again complaining about it. You asked for it buddy.\n\nI know you stock market types only care about profit but godamn what kind of abusive relationship is this. This is mainly why I switched to the other market and projects like Merrymen who aim to undo this shit. What kind of abusive relationship do you people have with Robinhood. They give you a slick UI and you forget about all the wrongs they did to you? bruh.",
        "subreddit": "wallstreetbets",
        "title": "It absolutely blows my mind that so many people and especially people on this sub are STILL using Robinhood despite what happened with the whole gamestop fiasco.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oxwuiw/it_absolutely_blows_my_mind_that_so_many_people/",
        "created": 1628124587.0
    },
    {
        "author": "natery5",
        "created_utc": 1630343055,
        "id": "pembbo",
        "num_comments": 3074,
        "num_crossposts": 0,
        "selftext": "Here it is, I got lucky.  I took a few loans in different ways to daytrade stocks:\n\n- $20k\n- $10k\n- $6k from my girlfriend\n- $4k from credit cards\n- some savings from my regular job\n\nThe reason I took so many loans is that I was constantly making little money and losing (the loans were not taken all at once). At one point, I decided to put together as much money as possible and went all in on GameStop after the first squeeze.\n\nWhen GameStop hit $340 the second time, I sold it all literally 5 minutes before it dipped, and made $65k.\n\nSince that moment, I've been trading with $50k+ and it's been really easy to make money, so I decided to quit my job. After quitting, I got my hand into $25k that they had to pay me as severance.\n\nBottom line: I extinguished all my loans BUT $27k I owe the bank, and right now I'm trading with $65k. I figured that, considering taxes, I have to make $1500 monthly to break even (monthly expenses + loan rate). If I pay off the bank, that amount is reduced to $700 monthly expenses.\n\nHowever, if I pay off the bank, my trading power will be reduced to $35k, which is insufficient, in my experience, to make money just trading stocks. So what do I do? Keep trading until those $65k become, lets say, $100k, and then pay off the bank? Or just extinguish debt and go back to trade with under $50k?\n\nThanks!",
        "subreddit": "wallstreetbets",
        "title": "I made a lot of money on GME and quit my job, but I'm not sure whether to pay off my debt or keep daytrading with a lot of money",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pembbo/i_made_a_lot_of_money_on_gme_and_quit_my_job_but/",
        "created": 1630371855.0
    },
    {
        "author": "Forfucksakebobby",
        "created_utc": 1628231208,
        "id": "oz13mw",
        "num_comments": 2508,
        "num_crossposts": 0,
        "selftext": "This is not a shitpost, I’ve included screenshots and will provide additional if needed by the ghey mods to show this is real.\n\nI logged into a device’s Robinhood account (I’m from Iowa btw) and linked my bank account. Then immediately I transferred $15k into my Robinhood account by accident. I frantically tried undoing it, but they seemed to have eventually noticed because it says the password changed. So far, nothing has changed so I don’t think the person realizes what’s going on. The $15k is set to clear on the 10th (Tuesday) and I’m thinking about this non stop because why would this happen? I emailed Robinhood about it and they haven’t replied yet.  \n\nI posted on legal advice and the responses were lackluster, but one commenter advised me to go to WSB since whoever I’ve tried to scam would likely be retarded enough to post about it. I figure I might as well come here to get a second opinion. What do I do?",
        "subreddit": "wallstreetbets",
        "title": "I accidentally fucked up and deposited $15k into a random account",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oz13mw/i_accidentally_fucked_up_and_deposited_15k_into_a/",
        "created": 1628260008.0
    },
    {
        "author": "RichFelon",
        "created_utc": 1627825979,
        "id": "ovsi57",
        "num_comments": 1950,
        "num_crossposts": 0,
        "selftext": "I see quite a few posts on China this morning and want to clarify a few points. In full disclosure I lost over 300k on Chinese stocks in a combination of shares, warrants, and options. Yes, I am glad I sold because my losses would be even greater. \n\n1. Chinese entrepreneurs like to IPO in America because the entrepreneurs and VCs are given US dollars for their shares. For those that didn’t know it is almost impossible to move money out of China. This is true for American companies such as Apple and Starbucks, the money stays there. It is a closed capital account. IPOs in American markets means foreign investors (American investors) can get liquidity when investing in a Chinese company. \n\n2. The CCP was more than happy to allow American IPOs because they need US dollars. The world does not trust the Renminbi and it is only used in 1 percent of transactions compared to 60 percent for the US dollar. China must use US dollars to trade with the world. (If anyone is familiar with the Belt and Road you will know China uses dollars to fund such project). When Chinese investors and entrepreneurs are allowed to sell their shares in American markets they bring in US dollars. \n\n3. China has global ambitions of being a super power. After watching a certain guy (not trying to get political) get banned from social media and made irrelevant, Xi and the CCP woke up to the reality it could be next. The party then decided to crack down even further on its entrepreneurs, who the CCP believes may one day oppose it. The crack down on the Ant IPO was just the start. (For those who don’t know, China does not take criticism well. If Apple/Tesla was to criticize the CCP both businesses would fail to operate in China (this happened to Hilton for naming Taiwan as a country, but only for a week).This is why you see NO American CEOs or entrepreneurs criticize China. \n\n4. The SEC is finally acting. News has broke the SEC will not allow anymore Chinese IPOs without disclosure of the CCP’s control. Every company in China is subject to control by the CCP. You either comply or you are sent to a camp. You also have the threat of delisting because of the Holding Foreign Companies Accountable Act. \n\nAt this point China has pissed off pretty much the entire US. From crashing internet money, to stocks, and don’t forget about their lies about COVID. I can’t imagine investors will bid up the price of these stocks again. Cut your loses and consider this market dead. Xi is a 1940s German leader reincarnated.",
        "subreddit": "wallstreetbets",
        "title": "China Doesn’t Care About US Investor’s Money",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ovsi57/china_doesnt_care_about_us_investors_money/",
        "created": 1627854779.0
    },
    {
        "author": "CaspeanSea",
        "created_utc": 1630242870,
        "id": "pdv0na",
        "num_comments": 1900,
        "num_crossposts": 0,
        "selftext": "Okay fellow apes.Hurricane Ida is mere hours away from hitting the coast of Louisiana. It surprisingly strengthened as it neared landfall and is now a Cat 5 hurricane, expected to be the \"strongest storm\" since 1850, even worse than Katrina.  \nHere's how to play it.\n\n1- A bunch of offshore drilling takes place in the gulf and with a storm this destructive, production will take a hit, oil futures are already up. You can play this by buying calls on SPDR S&amp;P Oil &amp; Gas Exploration &amp; Production ETF $XOP or playing the levered oil ETF $GUSH.\n\n  \n2- People run out to buy a whole lotta stuff from generators to basic homebuilding materials like plywood, sandbags, flashlights etc. You can play this by buying calls on Home Depot $HD,  Lowe's $LOW and Generac Holdings $GNRC which sells generators.\n\n  \n3- People tend to rent cars to run away from the storm or as a short-term replacement for the cars that they lost in the storm. You can play this by buying calls on the AVIS Budget group $CAR.United Rentals $URI which rents out all sorts of equipment gets a boost from every hurricane season as well.\n\nMy favorite play will probably be oil, as \\~90% of oil and gas production in the gulf of Mexico has already shut down and storm damage will inevitably limit future production as well. I'll be looking to buy $XOP &amp; $GUSH call spreads.  \n\n\nNOTE: Spambot kept deleting my post for \"spam domains\" even though they were all legit local news sources, so I removed all links.",
        "subreddit": "wallstreetbets",
        "title": "Hurricane Ida is \"Worst in 170 Years\" How to Bankroll the Destruction Like an Ape King",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pdv0na/hurricane_ida_is_worst_in_170_years_how_to/",
        "created": 1630271670.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1629049426,
        "id": "p4y22z",
        "num_comments": 1688,
        "num_crossposts": 0,
        "selftext": "Step 1: Find a product that people love… then make a slightly better version of it, and price it WAY BELOW your cost so that you lose money on every unit sold.\n\nStep 2: Create a ridiculous mission statement. It doesn’t matter what you’re selling -- your real mission is things like consciousness, happiness, and community. And use the word ‘technology’ a lot. No matter what you’re producing, always pretend that you’re a tech company.\n\nStep 3: Raise money from investors at an obscene valuation on the basis that you’re a visionary tech company. Don’t bother forecasting profits and creating conservative pro-forma statements, from which investors can derive a sensible valuation of your business. Instead, let the investors imagine how profitable your company can eventually become.\n\nStep 4: At a minimum, double your losses every year. And, as you continue to burn through investor capital, raise even more money at progressively higher valuations.\n\nStep 5: At the peak of the stock market bubble, take your company public at twice your last valuation. Reward these gullible investors with limited voting rights, and consolidate your power over the company as you steer it towards greater and greater losses while showering yourself with gigantic compensation packages.\n\nCongratulations. You’re now a billionaire.",
        "subreddit": "wallstreetbets",
        "title": "How to become a billionaire in 5 easy steps",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p4y22z/how_to_become_a_billionaire_in_5_easy_steps/",
        "created": 1629078226.0
    },
    {
        "author": "thethrifter",
        "created_utc": 1628002124,
        "id": "ox50iz",
        "num_comments": 1592,
        "num_crossposts": 0,
        "selftext": "Robinhood fucked me on GME and i moved all of my funds to Webull but im not liking the webull mobile app as much as Robinhood. (TD Ameritrade also stopped buys on GME but i didnt have an option to move my self directed HSA account out of TD)\n\nI like the simple uppies and downies graphs designed for retards better.\n\nI also like how RH shows the break evens on the options chains is it has kept me from making more than a few bad trades.\n\nI wasnt trading as successfully on webull because i found it harder to track my trades and watchlist and i wasnt as confident in finding the best options to buy.\n\nI dont like how RH market orders seem to steal an extra penny off the bid but limit orders fixes that.\n\nI want Vlad to suck my nuts but the platform just works better for me and they offered me $100 to transfer funds back into RH.\n\nI couldnt turn down taking $100 out of Vlads pocket so i transferred funds back planning on moving them out after the bonus cleared, but i like the app better and started making trades on RH again\n\nConflicted and realizing this post will bring hate from GME apes but I'm curious what other people think.",
        "subreddit": "wallstreetbets",
        "title": "Unpopular opinion: Robinhood still has the best mobile interface",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ox50iz/unpopular_opinion_robinhood_still_has_the_best/",
        "created": 1628030924.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1628758823,
        "id": "p2w1f3",
        "num_comments": 1447,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 12, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p2w1f3/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1628787623.0
    },
    {
        "author": "icorrectotherpeople",
        "created_utc": 1628210028,
        "id": "oyvpgw",
        "num_comments": 1366,
        "num_crossposts": 0,
        "selftext": "This is not a shitpost, I’ve included screenshots and will provide additional if needed by the ghey mods to show this is real.\n\nSomeone logged into my Robinhood account (allegedly from a device in Iowa) and linked a new bank account. Then immediately they transferred $15k into my Robinhood account. I was out at the time of seeing this, but after seeing a text notification about this on my phone I quickly logged onto Robinhood in a panic and changed my password and then changed my password to the email I use for it. So far, nothing has changed so I don’t think they were able to get into my account since the password change. The $15k is set to clear on the 10th (Tuesday) and I’m thinking about this non stop because why would this happen? I emailed Robinhood about it and they haven’t replied yet.\n\nI posted on legaladvice and the responses were lackluster but one commenter advised me to stay away from WSB for a while so I figure I might as well come here to get a second opinion. What do I do?",
        "subreddit": "wallstreetbets",
        "title": "Someone hacked my Robinhood account and GAVE me $15k",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oyvpgw/someone_hacked_my_robinhood_account_and_gave_me/",
        "created": 1628238828.0
    },
    {
        "author": "AlwaysMooning",
        "created_utc": 1629054713,
        "id": "p4zpd6",
        "num_comments": 1344,
        "num_crossposts": 0,
        "selftext": "I’ve worked hard over the past twenty years to slowly build a portfolio I can be proud of (about $250,000). This is a lot of money for a delivery driver! I’m hoping to be able to retire someday.\n\nI recently found WSB and I’ve made some savvy moves. I’ve also made some dumb moves. I’m down $62,000 this year (almost double my salary 🤦‍♂️) If SQ hits 300 this month, I will be back to even, however. \n\nAnyway, my 12-year-old son just started a stock market class in school. They have been trading for the past two months starting with $10,000 imaginary dollars. He was telling me about it and I was like “sure sure” just nodding along until he tells me he is up to $1.5 million! I didn’t believe it until he showed me! The kid has a gift. 😃 I talked to his teacher and she was so impressed. She made an off-hand comment about how lucky I am to have someone so good with stocks in my family. \n\nAnd that’s when it hit me. My son should run my portfolio! \n\nBUT I don’t want to put too much pressure on him if anything goes wrong. So I don’t want him to even know it’s real money. \n\nMy plan is to “Enders Game” him. I’m going to tell him that I found an international scholarship program and the first person to turn $250,000 into $10 million wins a free scholarship to college. (Which I will of course be able to pay for out of the winnings.)\n\nI feel really good about this plan and I’m planning on handing my passwords over to him on Monday. Just wondering if anyone has ever done anything like this and if so do they have any tricks or tips? My main concern is he realizes he’s actually trading real money. I want him to be ready to take the risks necessary to help daddy retire. \n\nThis is the biggest risk I’ve ever taken but I feel so fricken good about it. Thoughts and prayers are appreciated. Love this community!",
        "subreddit": "wallstreetbets",
        "title": "Pulling an “Enders Game” on my portfolio",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p4zpd6/pulling_an_enders_game_on_my_portfolio/",
        "created": 1629083513.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1628067616,
        "id": "oxomm7",
        "num_comments": 1301,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 04, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oxomm7/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1628096416.0
    },
    {
        "author": "yeahyeah2468",
        "created_utc": 1628411102,
        "id": "p0aylx",
        "num_comments": 1285,
        "num_crossposts": 0,
        "selftext": "Obviously, listing companies that are currently already super close to a 1 trillion market cap is not really helpful. \n\nA trillion isn’t wha it used to be, lol, but I’m curious what you all are thinking when it comes to companies with a 1 trillion market cap in 5 years. \n\nMy personal picks:\n\n- SHOP\n- NVDA\n\nWhat are your picks?",
        "subreddit": "stocks",
        "title": "Which stock, currently well below a 1 trillion $ market cap, do you see reaching that market cap within 5 years?",
        "url": "https://www.reddit.com/r/stocks/comments/p0aylx/which_stock_currently_well_below_a_1_trillion/",
        "created": 1628439902.0
    },
    {
        "author": "chingchongcheng84",
        "created_utc": 1630160197,
        "id": "pdajvt",
        "num_comments": 1234,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Baba new low every month since March, when will it end?",
        "url": "https://i.redd.it/h0wu4hrgx3k71.jpg",
        "created": 1630188997.0
    },
    {
        "author": "stockerooni",
        "created_utc": 1630271785,
        "id": "pe3y4x",
        "num_comments": 1186,
        "num_crossposts": 0,
        "selftext": "Ban me if baba doesn’t go up 5% by tomorrow EOD. \n\nBaba makes 2X more revenue than AMZN.\n\nBabas market cap is 25% of AMZN. TWENTY. FIVE. PERCENT. \n\nBaba is down 50 percent from ATH. THAT IS HALF.\n\n“I won’t invest in baba because it is owned b-“ STOP IT.\n\n“It’s just a shell company of the cayma-“ WHO CARES.\n\n“But what about ongoing tensions betwee” READ EVERYTHING ABOVE.\n\nThis is the dip. This is what we have waited for. This is not financial advice.",
        "subreddit": "wallstreetbets",
        "title": "$BABA. Ban me if it doesn’t go +5% tomorrow.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pe3y4x/baba_ban_me_if_it_doesnt_go_5_tomorrow/",
        "created": 1630300585.0
    },
    {
        "author": "Uchia_Zero",
        "created_utc": 1629940670,
        "id": "pbp39y",
        "num_comments": 1152,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I'M TIRED OF BEING POOR! I JUST WANT TO HELP MY PARENTS RETIRE PEACEFULLY! I Quit my job a few weeks a ago, I'm trying to achieve that American dream everyone has given up on. I'm a first generation and I want it!",
        "url": "https://i.redd.it/s1nib2ixslj71.jpg",
        "created": 1629969470.0
    },
    {
        "author": "Im_Blind_And_Deaf",
        "created_utc": 1627924355,
        "id": "owj1di",
        "num_comments": 1152,
        "num_crossposts": 0,
        "selftext": "The title pretty much says it. Robinhood CEO, Vladimir Tenev, sold **1250000** shares of Robinhood ($HOOD) at **$36.40**, which amounts to $45,500,000 USD.\n\n[From the NASDAQ website](https://preview.redd.it/vsjexs6o5ze71.png?width=1039&amp;format=png&amp;auto=webp&amp;s=28498cb28bfa1d712149ea71d897064c0fc65d56)\n\nHere's a link to the official [SEC Filing Form](https://secfilings.nasdaq.com/filingFrameset.asp?FilingID=15125984&amp;RcvdDate=07/28/2021&amp;CoName=ROBINHOOD%20MARKETS,%20INC.&amp;FormType=4&amp;View=html) \n\nAmongst the group of insiders who sold shares, the Chief Marketing Officer stands out. Christina Smedley sold **100%** of her shares! (99,884 shares at $35.28, over $3.5 million USD)\n\nAlso, Jason Warnick, the Chief Financial Officer sold 25% of his shares (125,000 at $36.40, over $4.5 million US)\n\nHere's a table, for smooth brains like me who process information better this way 😅🤣\n\n|Insider|Shares Sold|Price|Amount in USD|\n|:-|:-|:-|:-|\n|V. Tenev - CEO|1,250,000|$36.40|$45,500,000|\n|J. Warnick - CFO|125,000|$36.40|$4,550,000|\n|C. Smedley - CMO|99,884|$35.28|$3,523,907.52|\n\nWhat do you think? Is this a sign they don't believe in the company?",
        "subreddit": "wallstreetbets",
        "title": "Robinhood insider selling - Vlad sold 1,250,000 ($45+ million) worth of $HOOD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/owj1di/robinhood_insider_selling_vlad_sold_1250000_45/",
        "created": 1627953155.0
    },
    {
        "author": "throwawayTrekr",
        "created_utc": 1628194811,
        "id": "oyqw1q",
        "num_comments": 1140,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "It's been a long trek, but made it out of the canyon!",
        "url": "https://i.redd.it/t4b0p19fllf71.gif",
        "created": 1628223611.0
    },
    {
        "author": "MinionCommander",
        "created_utc": 1628899179,
        "id": "p3xblq",
        "num_comments": 1130,
        "num_crossposts": 0,
        "selftext": "I know it’s my own damn fault for using their scam service but holy hell this was egregious.\n\nI had sold SPY calls that were almost a full $1 OTM at expiration and these fuckers decided to force me to buy them back before expiration AND sell my further expiration SPY calls that I was holding in order to pay for it.\n\nTheir risk management team told me that apparently their algorithm considers it a risk that SPY will run an entire fucking dollar in 60 minutes at close. Doesn’t matter that I had the calls to cover it as collateral even if i did get exercised.\n\nThey said my position was “recollateralized as a calendar spread.”\n\nBetween the cost of buying back the 1 hour deep OTM FDs and the bid ask spread on my long calls these fuckers spent $600 of my gains to force me to buy FDs from them and probably pocketed the premiums and the bid ask spread.\n\nAbsolute scam. Cancelling my account Monday and leaving nothing but bad reviews everywhere.",
        "subreddit": "wallstreetbets",
        "title": "Robinhood is a scam. I know you know but holy hell they actually just scammed me out of $600.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p3xblq/robinhood_is_a_scam_i_know_you_know_but_holy_hell/",
        "created": 1628927979.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1628760617,
        "id": "p2we5l",
        "num_comments": 1049,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme and/or [post your arguments against options here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Options Trading Thursday - Aug 12, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/p2we5l/rstocks_daily_discussion_options_trading_thursday/",
        "created": 1628789417.0
    },
    {
        "author": "Abhisingh9916",
        "created_utc": 1628780202,
        "id": "p31ijc",
        "num_comments": 1042,
        "num_crossposts": 0,
        "selftext": "Reddit, the self-declared ‘front page of the internet,’ says it is now valued at more than $10 billion after raising an additional $410 million in funding, with the final round expected to grow to up to $700 million. \n\nThe company continues to build and sanitize its business, removing racist, misogynist, and otherwise controversial communities, as it prepares to go public at some point in the future.\n\n\n“We are still planning on going public, but we don’t have a firm timeline there yet,” Reddit’s co-founder and CEO Steve Huffman told The New York Times in an interview. “All good companies should go public when they can.”\n\nThe company previously raised $250 million in funding earlier this year for a valuation of $6 billion. But Huffman told the Times the company was approached with this recent financing round by Fidelity Investments and were made “an offer that we couldn’t refuse.”",
        "subreddit": "stocks",
        "title": "Reddit is now valued at more than $10 billion The company is still planning on going public",
        "url": "https://www.reddit.com/r/stocks/comments/p31ijc/reddit_is_now_valued_at_more_than_10_billion_the/",
        "created": 1628809002.0
    },
    {
        "author": "epicoliver3",
        "created_utc": 1630328741,
        "id": "pehp2m",
        "num_comments": 1033,
        "num_crossposts": 0,
        "selftext": "What's up retards, I have spent the past 2 WEEKS finding the best stock play to make YOU RICH, and it looks like CRSR is ready to go to the MOON!\n\nNO MORE will your wife’s boyfriend bully you for your micro-penis! After CRSR you will be rich enough to get penis-enlargement surgery and FINALLY have a dong BIGGER than his!!!\n\nNow before you retards go gamble all your life savings on the chance to get penis-enlargement surgery, let me explain why CRSR will go TO THE MOOON\n\n&amp;#x200B;\n\n**First, the Fundamentals:**\n\nNow bare with me, I know you retards don’t like fundamentals… So I will make it as short and colorful as possible!\n\nFundamentally, this company is one of the MOST undervalued companies I have EVER seen\n\nhttps://preview.redd.it/mznix9b2uhk71.png?width=1380&amp;format=png&amp;auto=webp&amp;s=c29960c932cbd9af0f993eaaf0b124f918960fac\n\nCRSR has grown at 24.3% Y/Y despite chip shortages, re-openings, supply-chain shocks, commodity inflation, and last year being especially good for them cause of lockdowns\n\nThey also own Elgato which specializes in studio equipment for streamers, and Origin PC which builds custom pc’s\n\nThese two additional companies have been growing rapidly and allow CRSR to capture the whole gaming peripheral market\n\nDespite being a well run, profitable company in a growing industry, they are priced at HALF the S&amp;P 500's P/E!\n\nhttps://preview.redd.it/izz273f4uhk71.png?width=825&amp;format=png&amp;auto=webp&amp;s=efe189f52a2c6e4b7afd394465e64fb915cc0320\n\nAdditionally the float is only around 88M... so unlike some plays on here, WSB could LITERALLY buy the ENTIRE FLOAT\n\nI could go on for SO much longer about why CRSR is a Deep F\\*cking Value play... But since you retards have an attention-span worse than a goldfish, I will move on...\n\n&amp;#x200B;\n\n**Option Chains:**\n\nCorsair has an insanely bullish options market which is primed for a Gamma Squeeze\n\nhttps://preview.redd.it/3778p8t6uhk71.png?width=1290&amp;format=png&amp;auto=webp&amp;s=0c9838491bb87c9d27bdacb7759ff9fe87f37ae5\n\nIf CRSR gets above $35.00 by 9/17, up to 2,037,800 shares will need to be purchased! This is even before WSB has gotten their greasy hands on it. I’m sure by 9/17 the open interest will be MUCH higher\n\nHaving so many options sold just OTM is PERFECT for a gamma squeeze\n\nAdditionally due to delta hedging, the more IV on options and options that go ITM, the more stocks MM's will need to buy to hedge against the options that they sold\n\nHaving so many options contracts sold on a smaller market cap stock is perfect for a gamma squeeze. IV will go through the roof once WSB buys in causing MM's to hedge creating a feedback loop\n\nCRSR options are SUPER cheap which gives a good entry point for WSB retards, and makes it much easier to increase the open interest\n\n&amp;#x200B;\n\n**Short sellers:**\n\nOver the past month, short sellers have been getting TOO greedy and have been adding a shit ton of positions around 26$. This means shorts will be underwater if the stock price increases AT ALL\n\nCRSR has a short interest of around 24% which, albeit still large, would not be a huge issue on its own... but because most of these short positions were opened at the literal bottom, those short sellers will be much more likely to close their positions and/or be margin called\n\nFor the past few weeks, around 40% of the volume has been sold short\n\nhttps://preview.redd.it/e9foib1cuhk71.png?width=768&amp;format=png&amp;auto=webp&amp;s=cd43fab041475611218d946812efb0dc47a2d786\n\nAt the same time as shorts have been adding positions, large institutional investors have been buying in HEAVILY\n\nhttps://preview.redd.it/a7284jjduhk71.png?width=820&amp;format=png&amp;auto=webp&amp;s=22a94571d7c932f4439a5587301cbcfca8fc41ff\n\nThis high of a short interest combined with strong financials, a bullish options market, and large institutional investors being on our side means shorts are absolutely fucked and this stock is going TO THE MOON\n\n&amp;#x200B;\n\n**How to Profit:**\n\nI recommend buying a mix of 9/17 ITM/OTM calls, leaps, and shares\n\nBuy 9/17 calls if you believe this has a chance to squeeze\n\nBuy leaps/shares if you believe in the underlying company\n\n&amp;#x200B;\n\n**Positions:**\n\n10 $27.5 C 9/17, 13 $30 C 9/17, 50 $32.5 C 9/17, 20 $35 C 9/17, 106 shares, 2 $25 2/18/22 C\n\n&amp;#x200B;\n\n**TLDR:**\n\nhttps://preview.redd.it/u1dcgm1iuhk71.png?width=1920&amp;format=png&amp;auto=webp&amp;s=15cd932f87fe52287b37262ec396341363afc910",
        "subreddit": "wallstreetbets",
        "title": "CRSR: The Play of a Century",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pehp2m/crsr_the_play_of_a_century/",
        "created": 1630357541.0
    },
    {
        "author": "margin_call_rep",
        "created_utc": 1627871280,
        "id": "ow5nx0",
        "num_comments": 1029,
        "num_crossposts": 0,
        "selftext": "As the beginning of next year, California will enforce new animal welfare law for breeding pigs and other farm animals. But only 4% the hog operations currently can comply. According to one farmer, to meet the new standard, he needs 3 million for the upgrade to raise just 250 hogs. Restaurants owners are worried because bacon is one of the most popular breakfast items and bacon helped their business survive the pandemic. ([https://www.bloomberg.com/news/articles/2021-07-31/bacon-may-disappear-in-california-as-pig-rules-take-effect](https://www.bloomberg.com/news/articles/2021-07-31/bacon-may-disappear-in-california-as-pig-rules-take-effect?srnd=premium)).  People love bacon from all backgrounds. \"You know, I work and live with a lot of Asian and Hispanic populations in the city and their diet consists of pork bacon. Pork bacon is huge,\" Kim said. \"It’s almost like bread and butter.\"\n\nBacon love is ingrained into our soul and genetics and therefore an inelastic demand. Therefore a small change in bacon supply can lead to a drastic change in price, as explained by graph below. \n\n[Inelastic Demand Price Action](https://preview.redd.it/huc5pz6xoue71.jpg?width=570&amp;format=pjpg&amp;auto=webp&amp;s=fcea15c61d5e19157c1cfb07d1e9684142bf67c2)\n\nAccording to consulting firm Hitamiya Group, if half of the pork supply was lost, bacon price would jump 60% which means a $6 package could rise to $9.60 cents ([https://www.bloomberg.com/news/articles/2021-07-31/bacon-may-disappear-in-california-as-pig-rules-take-effect?srnd=premium](https://www.bloomberg.com/news/articles/2021-07-31/bacon-may-disappear-in-california-as-pig-rules-take-effect?srnd=premium)). If 90% - 95% of the supplies are gone, the fair price should be at least 2.5 times the current market value. And that means **1 package of bacon is $15 per package.** \n\nYou must wonder, how do I profit from this? A very ancient trade technique - BUY LOW SELL HIGH\n\nI am not talking about buying 10 packs of bacon from Costco and resale them later. I am talking about doing it at scale. Go big or go home. \n\n**Step 1 - Install Freezers in Your Garage**\n\nLet’s figure out how many freezers you can potentially have. First park your cars on the street and empty the garage. The average garage size is 12 feet \\* 22 feet \\* 8 feet. So 12 \\* 22 \\* 8 = 2112 cubic feet. \n\nThe below fridge dimension is 37.25 x 20.75 x 33.25 inches and can storage up to 7 cubic feet items. \n\n[ Ideal Fridge to Keep Bacon](https://preview.redd.it/yfk3jbp3que71.jpg?width=1282&amp;format=pjpg&amp;auto=webp&amp;s=731f5da26e2187ec37b1dbd4fbabc5b7789ebd15)\n\nLet’s do more math to see how many fridges your garage can potentially store. \n\n2112 (volume of garage) \\* 1728 (1 cubic feet is 1728 cubic inch) / 37.25 \\* 20.75 \\* 33.25 (volume of fridge) = **142 fridges**\n\nObviously you can’t just stack all of those fridges in the garage. Let’s say we can achieve 80% of that. And that means you can have around **110 fridges.** \n\nRemember to use Amazon FREE SHIPPING. Very important to save cost. \n\n**Fridge Cost with Tax**: 110 \\* 229 \\* 1.1 (Uncle Sam wants the tax) = **$27709**\n\n|**Item**|Cost|\n|:-|:-|\n|110 Fridges|$27709|\n\n**Step 2 - Buy Bacon in Bulk and use FREE SHIPPING**\n\nAccording to USDA ([https://www.ers.usda.gov/data-products/meat-price-spreads/](https://www.ers.usda.gov/data-products/meat-price-spreads/)), one package (1 pound) of bacon in  June 2021 is about $6.67. We can get this much lower by buying from Costco in BULK. As you can see below, **our one package cost is $4.53** AFTER tax including delivery. Again, very important to use free shipping to save cost.\n\n[Bacon Price From Costco](https://preview.redd.it/4a12382erue71.png?width=1840&amp;format=png&amp;auto=webp&amp;s=48f5dacba1eb055847e3b266aef24fb5abcee393)\n\nIt's time to calculate how much to buy. The size of one package of bacon is about 10 inch \\* 4 inch \\* 1 inch so 40 cubic inch. And the volume of our fridge is 7 cubic feet which is 12096 cubic inch. So one fridge can store around 300 packages or pounds of bacon. With 110 fridges, we can store 33000 packages or pounds of bacon. Each pound of bacon is $4.53, so the total cost of bacon is $149,490\n\nTotal Cost So Far\n\n|**Item**|Cost|\n|:-|:-|\n|110 Fridges|$27709|\n|33000 packages or 2200 cases of bacon|$149,490|\n\n**Step 3 - Factor In the Electricity Cost**\n\nRunning 110 freezers in the garage is apparently very energy consuming and electricity is expensive in California, at about 20 cents / kWh. \n\nThe freezer is 150 watts so running 110 freezers for let's say 6 months will cost $14256. You can check my math below:\n\n150 watts \\* 6 (month) \\* 30 (days) \\* 24 (hours) / 1000 = 648 kWh (one fridge running a year energy consumption)\n\n648 kWh \\* 0.2 cents / kWh \\* 110 = $14256\n\nTotal Cost So Far\n\n|**Item**|Cost|\n|:-|:-|\n|110 Fridges|$27709|\n|33000 packages or 2200 cases of bacon|$149,490|\n|Electricity|$14256|\n\nStep 4 - Sell High And Take Profits\n\nDon't diamond hand bacon, you are in 2022 and it's time to sell for a profit! \n\nThe cost of bacon per package factoring in everything so far is **$5.8.** And we unload each package for $15. So that means each package profit is $9.2. \n\n# The total profit is $9.2 * 33000 = $303,600\n\nIf you too lazy to contact customers or answer phone calls yourself, just hire someone for like 20K a month to the work for you. I expect the inventory goes to zero in a month so at the end of the day, you pocket close to $280,000 profits. \n\nAnd you can figure out the tax part and probably can resell those freezers for half the price.\n\nTLDR: Buy Bacon Now and Get Rich Later",
        "subreddit": "wallstreetbets",
        "title": "Once In A Lifetime Hog Future Opportunity In California",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ow5nx0/once_in_a_lifetime_hog_future_opportunity_in/",
        "created": 1627900080.0
    },
    {
        "author": "epicoliver3",
        "created_utc": 1628170928,
        "id": "oyhsyz",
        "num_comments": 1016,
        "num_crossposts": 0,
        "selftext": " \n\nListen here retards, I have a play which will make your wife’s boyfriend so hard he will finally take a turn with you\n\nMcAfee announced a special dividend of $4.50 per share which is INSANE considering the stock is only $30\n\nAs we get closer to August 13th, the stock will go up as people buy shares to get that dividend. Options are cheap and this has not even been priced in since the stock has only gone up 81 cents since the announcement!\n\nMcAfee's stock has low liquidity with an average trading volume of 450,000 shares. A higher trading day of 900,000 shares made this thing go up almost 7%! If people start buying heavy for the dividend, this thing will go to the MOOON\n\nThis play doesn’t require McAfee to have solid fundamentals or any other boomer r/investing words, it just takes advantage of people being greedy and buying in to get the dividend.\n\nMy strategy is to buy a mix of $25, $30, and $35 call options and sell these before August 13th because people will sell their shares after they are eligible for the $4.5 dividend.\n\nMy positions:\n\n8 25c, 10 30c, 3 35c, 3 25p (all expiring 8/20)\n\nTLDR:\n\nhttps://preview.redd.it/kw9ug9j8mjf71.png?width=1043&amp;format=png&amp;auto=webp&amp;s=538bda805bdc26d68599030d2871a96fc4975ae9",
        "subreddit": "wallstreetbets",
        "title": "McAfee’s dividend will make us RICH",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oyhsyz/mcafees_dividend_will_make_us_rich/",
        "created": 1628199728.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1629451815,
        "id": "p81r65",
        "num_comments": 988,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia page](https://www.investopedia.com/fundamental-analysis-4689757/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp) and read [their PDF on the topic.](http://i.investopedia.com/inv/pdf/tutorials/fundamentalanalysis_intro.pdf)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Aug 20, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/p81r65/rstocks_daily_discussion_fundamentals_friday_aug/",
        "created": 1629480615.0
    },
    {
        "author": "Alternative-Fox6236",
        "created_utc": 1628037150,
        "id": "oxgwzr",
        "num_comments": 977,
        "num_crossposts": 0,
        "selftext": "Hey all,\n\nSo my parents gave me $125k and told me to do what I want with it. I know most people might just spend it, but my thought was to just index it in SPY. \n\nI don know much about options so I thought, are there better options strategies out there than just indexing?\n\nI did a bit of research on the wheel, but I feel like indexing would give me a better return. \n\nThanks!",
        "subreddit": "options",
        "title": "Parents gave me $125,000, was going to index it but will options give me better returns?",
        "url": "https://www.reddit.com/r/options/comments/oxgwzr/parents_gave_me_125000_was_going_to_index_it_but/",
        "created": 1628065950.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1627981221,
        "id": "owzidc",
        "num_comments": 960,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 03, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/owzidc/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1628010021.0
    },
    {
        "author": "ZhangtheGreat",
        "created_utc": 1629847893,
        "id": "paz1rv",
        "num_comments": 959,
        "num_crossposts": 0,
        "selftext": "Let’s go back to the basics here. If you could choose just one rule for investing to teach someone looking to get into the game, what would it be?\n\nMine? “NEVER invest more than what you are both able and willing to lose.”\n\nOnly one rule per person, please. Joke rules are openly permitted as long as they’re obviously jokes.",
        "subreddit": "stocks",
        "title": "Your number one rule for investing",
        "url": "https://www.reddit.com/r/stocks/comments/paz1rv/your_number_one_rule_for_investing/",
        "created": 1629876693.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1629459921,
        "id": "p83k1y",
        "num_comments": 910,
        "num_crossposts": 0,
        "selftext": "Inductions\n------\n\n\n----------\nUser|Cast Vote|Voters\n:--|:--|:--\n**None**\n\nEjections\n------\n\n\n----------\nUser|Cast Vote|Voters\n:--|:--|:--\n**None**\n\n\n\n---\nFAQ\n------\n\nOnly approved users can participate here. They can induct and eject other users which will be displayed publicly as it is happening in the above tables. Anyone on the approved users list (which you cannot see) will be ignored entirely by /u/VisualMod and most of the AutoModerator rules for all comments and submissions, so bestow this status on people wisely to accrue traders and bros to the thread.\nTen affirmative votes are required to induct or eject someone. Simply click one of the links below and put their username (no /u/) in the body of the message.\n\n[**Begin Induction**](https://www.reddit.com/message/compose/?to=VisualMod&amp;subject=induct) | [**Begin Ejection**](https://www.reddit.com/message/compose/?to=VisualMod&amp;subject=eject)\n\nYou can get a DM when the new thread pops up by commenting !subscribe.",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 20, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p83k1y/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1629488721.0
    },
    {
        "author": "giovannigiannis",
        "created_utc": 1630054452,
        "id": "pcjjc9",
        "num_comments": 884,
        "num_crossposts": 0,
        "selftext": "You autists must be asleep right now, because no one has been posting the news 🗞.   The Supreme Court just said it’s okay for you to yank out your deadbeat tenants by the hair and beat them in the street. Finally. Now, once you’re all done getting your kicks out, what are your stock plays gonna be?  Surely this will have an affect on your favorite memes, won’t it?  Personally, I think it could see it going both ways.  On one hand, it’s a step forward to clearing out a problem (ie deadbeats).  Now the housing market is freed up and housing-providers can sell or fill their spaces.  This might result in an overall positive sentiment from the grand community, which means stocks go boom.  But on the other hand, this could trigger despair and a lack of confidence, which means stocks go bang. What are your thoughts?",
        "subreddit": "wallstreetbets",
        "title": "Eviction tsunami incoming",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pcjjc9/eviction_tsunami_incoming/",
        "created": 1630083252.0
    },
    {
        "author": "epicoliver3",
        "created_utc": 1628601589,
        "id": "p1p0rx",
        "num_comments": 880,
        "num_crossposts": 0,
        "selftext": " \n\nHey retards, here's another special dividend play for a special boy. \n\nMcAfee may have made your wife’s boyfriend hard, but Ecovyst will make you SO RICH you can finally fuck some strippers to satisfy yourself since your wife won’t. \n\n&amp;#x200B;\n\nEcovyst (ECVT) just announced a special dividend of $3.2/share, which at a share price of $16.2 is OVER a 20% return! Now I am not here to talk about a boomer 20% return, but more so how this news has not been priced into the stock/options and provides a perfect short-term options play \n\nOver the past few days ECVT has traded relatively flat, only really increasing over the past day or so. News of this insane dividend has barely made any headlines and no one seems to know about it. Once more people find out about this stock and buy in for that 20% return, the price will EXPLODE\n\nSince the announcement of the dividend, the stock has ONLY increased by 8 cents\n\nhttps://preview.redd.it/rxekeqrr6jg71.png?width=812&amp;format=png&amp;auto=webp&amp;s=aec7b419466a891ac768925d3195b2bc86953adc\n\nThe stock ‘should’ drop around $3.2 after the ex. dividend date (efficient market hypothesis) which ‘should’ mean people won’t buy in just for the dividend, but people (and the market in general) are irrational and greedy so stocks generally have run-ups prior to special dividends (see price action on RKT, MCFE, AFG, SUTL ect.)\n\nSpecial dividends also signify to the market that the company is being successful \n\nIn addition to this, the stock has low liquidity with an average trading volume of only around 223,000 shares and an institutional ownership of OVER 69%. This means the stock will MOON if only a small amount of people buy in \n\n&amp;#x200B;\n\nBesides the whole special dividend play, ECVT is actually a decent, profitable growth company. Y/Y revenues were up 47% and they posted a profitable quarter of $0.11/share. They manufacture and catalyze chemicals for green tech, which will be a growing industry in the future. I know this play is not about the viability of the company, but this being a decent company takes some of the risk away\n\nAdditionally, options have not priced in ANY pre-dividend volatility, the 8/20 $15C only needs to have the stock go up 0.92% to make money\n\nThe ex. Dividend date for the special dividend is aftermarket 8/11 so I would sell before then\n\nThe record date is on the 12th, so if you are feeling risky you could hold until 8/12 \n\nMy positions: \n\n10 8/20 $15 C, 10 8/20 $17.5 C\n\nTLDR:\n\nhttps://preview.redd.it/95xleam07jg71.png?width=977&amp;format=png&amp;auto=webp&amp;s=00b7ae4a817068e02f300f4602643382f8a22239",
        "subreddit": "wallstreetbets",
        "title": "Ecovyst: Get rich from this special dividend",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1p0rx/ecovyst_get_rich_from_this_special_dividend/",
        "created": 1628630389.0
    },
    {
        "author": "bryschmi",
        "created_utc": 1629573005,
        "id": "p8xcfv",
        "num_comments": 880,
        "num_crossposts": 0,
        "selftext": "It’s down over 10% in the past month, and down 2.77% in the past 365 days… I know it had a huge run up boosted by Covid when everything was locked down, but still. \n\nI’ve been solely investing in Amazon the past couple weeks. I think it’s a no brainer and a great time to get in. The infrastructure they’re building right now will lock them in as a dominant leader for decades. They’re not going anywhere. \n\nAnd working in tech sales I see or hear every day companies utilizing AWS or making the move to it. The US government tends to utilize it in contracts which is huge.  \n\nWhat are your thoughts?",
        "subreddit": "stocks",
        "title": "Why the hell is no one talking about the buying-of-the-dip opportunity for Amazon?",
        "url": "https://www.reddit.com/r/stocks/comments/p8xcfv/why_the_hell_is_no_one_talking_about_the/",
        "created": 1629601805.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1628845213,
        "id": "p3jotz",
        "num_comments": 870,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 13, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p3jotz/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1628874013.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1627808412,
        "id": "ovotya",
        "num_comments": 867,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 01, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ovotya/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1627837212.0
    },
    {
        "author": "Diems23",
        "created_utc": 1629399562,
        "id": "p7l7i6",
        "num_comments": 851,
        "num_crossposts": 0,
        "selftext": "Like the title says I just bought alibaba, it was in my watchlist for a while now and When it dipped 6% today I decided to pull the trigger on it.\nI now their is a lot of fear on baba right now but I learned to be greedy when others are fearfull and fearfull when other are greedy.\nI simply refuse to believe that the CCP is willing to destroy one of it’s most successful companies and the valuation + growth potential makes it a screaming buy. \nIt’s 1,6% of my portfolio",
        "subreddit": "stocks",
        "title": "I just bought alibaba",
        "url": "https://www.reddit.com/r/stocks/comments/p7l7i6/i_just_bought_alibaba/",
        "created": 1629428362.0
    },
    {
        "author": "clint1reid",
        "created_utc": 1630268832,
        "id": "pe30ne",
        "num_comments": 851,
        "num_crossposts": 0,
        "selftext": "There have been threads about the highest conviction stock picks. I think the opposite is also interesting. \n\nAmong the stocks that you own - what is your lowest conviction stock? Why haven’t you sold it yet?",
        "subreddit": "stocks",
        "title": "What is the lowest conviction stock you own and why?",
        "url": "https://www.reddit.com/r/stocks/comments/pe30ne/what_is_the_lowest_conviction_stock_you_own_and/",
        "created": 1630297632.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1628586017,
        "id": "p1lgcz",
        "num_comments": 850,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 10, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1lgcz/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1628614817.0
    },
    {
        "author": "shortyafter",
        "created_utc": 1628120007,
        "id": "oy57s2",
        "num_comments": 835,
        "num_crossposts": 0,
        "selftext": "**TL;DR at bottom.**\n\nHere's your obligatory bear post for the day/week/whatever.\n\nI'm not an expert but I do have some qualifications that lead me to believe that the global economy is in for some trouble.  I could be wrong, of course, and actually my entire theory is predicated on that fact.  Still, I feel I am sure enough in my convictions to the point where this statement is worth making.  You may disagree with the worthiness of this post, and of course, the premise behind it.  That's fine;  I'm just here to share the way I see things.\n\nWhat's certain is that, even if one may see the warning signs of a looming crisis, it's near impossible to tell when that crisis might be.  I have no idea.  All I know is I see some precariousness and warning signs right now.  So, without further ado:\n\n&amp;#x200B;\n\n**The Uncertain Nature of the World**\n\nThe world is uncertain.  Black swan events happen, and they happen frequently.  Again, some people may have some inkling of them, but it's hard if not impossible to predict these things with any degree of certainty.  Some examples that come to mind (please excuse the lack of chronological ordering): the Covid-19 pandemic, September 11th, the Global Financial Crisis, the John F. Kennedy assassination, Columbus discovering America, the Challenger/Colombia space shuttle disasters, the assassination of Franz Ferdinand leading to WW1, the Great Depression, the Black Death, the storm that destroyed the Spanish Armada, the Wehrmacht crossing the Ardennes, the smart phone / internet revolution, etc.  The last one is interesting if you ever saw *Back to the Future: Pt. 2.*  The most they predicted were flying cars, but not smart phones or internet.\n\nBut I digress.  These events are part and parcel of life, and the major events of history do not happen in a linear fashion.  Sure, we may be able to connect the dots after the fact, but when they happen it's almost unbelievable; we seem to be taken utterly by surprise.  Just think: apart from Bill Gates or someone like that, which one of us normal folk thought we'd be dealing with a pandemic this time 2 years ago?  I certainly didn't imagine it.\n\nAnd it happens in our personal lives too.  You meet someone.  You have a break up.  You get injured.  You get sick.  You lose a loved one.  You fall in love.  Who knows.  Life is very, very unpredictable.\n\nDon't get me wrong; that doesn't mean I don't think we should try.  Science helps. We can form hypotheses and test them.  This adds a lot of certainty to a world that is very uncertain.  But even Einstein would admit that some things are simply out of our grasp:\n\n\"What I see in Nature is a magnificent structure that we can comprehend only very imperfectly, and that must fill a thinking person with a feeling of humility.\"\n\n&amp;#x200B;\n\n**The Folly of Economics**\n\nI studied economics.  I was very interested in Econ 101 and decided to make that my major.  Later, however, I was disappointed in what I learned.  I don't know.  There was just too much mathematical formulating and analysis.  I didn't feel, really, that I had learned much of anything that was actually relevant and applicable to the real world.  To be honest, at the time I just thought I was an idiot and bad at math - blaming myself rather than the field, as a young, lost kid might be prone to do.  Looking back, however, I think there were serious shortcomings that I had picked up on but did not have the tools to express.\n\nI'm not saying that there isn't a place for that sort of analysis in the study of economics: I imagine there is.  I just don't think that it should be the singular focus of the whole field.  Indeed, while mathematical equations are imperative for pure math and even for practical applications like physics and chemistry, can they really be applied with the same rigorous veracity to the study of something so complex and changeable as the economy?\n\nFormer economic advisor at the Bank of International Settlements William White argues that instead of looking at the economy through equations and equilibria, we should be viewing the economy as a [complex adaptive system](https://en.wikipedia.org/wiki/Complex_adaptive_system#:~:text=A%20complex%20adaptive%20system%20is,the%20behavior%20of%20the%20components.&amp;text=The%20Complex%20Adaptive%20Systems%20approach%20builds%20on%20replicator%20dynamics).  You know, like a garden.  You have an idea in mind of what you want to plant and where, but some plants die, some don't, weeds pop up, there might be an infestation.  The whole thing is quite unpredictable because it depends on an enormous amount of variables interacting with each other.  Well, that's a lot like the economy.  (Read more here: [Recognizing the Economy as a Complex, Adaptive System: Implications for Central Banks](https://williamwhite.ca/2018/04/22/recognizing-the-economy-as-a-complex-adaptive-system-implications-for-central-banks/))\n\n&amp;#x200B;\n\n**The Folly of Modern Central Banking**\n\nThe folly here follows naturally from the aforementioned ontological error in the field of economics: we think the economy is predictable and controlable.  Cut interest rates here, buy assets there, and we're good to go.  If only it were that simple.\n\nLook at the data we're looking at right now.  Despite absolutely unprecedented amounts of liquidity being pumped by the Federal Reserve (and by other central banks around the world), we're still unable to get people back to work.  Check out the [ADP numbers](https://www.cnbc.com/2021/08/04/private-companies-added-330000-jobs-in-july-according-to-adp-far-short-of-the-653000-estimate.html) today: 653,000 new positions were expected in July, but the actual result was a miss of just over half (330,000).  If you've been paying attention to the data in past months as well, you've noticed consistent misses in employment.  And how about inflation?  YoY inflation hikes are expected due to base effects from the pandemic last year, but MoM inflation has been coming in consistently higher than expected.  All of this makes you wonder: does the Fed really have things under control?  *Could* they have things under control?\n\nI would argue that you can't solve structural employment issues by throwing the liquidity at the markets.  The problem is not liquidity, there's plenty of it: the problem is structural mismatches, as well as other factors like people preferring to take extended unemployment rather than working.  You can't fix that with more liquidity.  One of the most respected modern economists, Paul Krugman, would probably say \"well, it can't hurt\".  And according to their models, it can't.  Unfortunately economists and central bankers seem to do be doing their absolute best to turn their blind eye to clear asset bubbles.  SPX is up nearly 48% since pandemic lows less than 18 months ago, while the Nasdaq is up nearly 58% in the same period. Meanwhile the real economy has been absolutely hammered.  The [Shiller PE ratio](https://www.multpl.com/shiller-pe) is at 38.25 at time of writing - a level unseen since prior to the bursting of the dot-cum bubble.  It is clear that there is a severe disconnect between fundamentals and asset prices due to excessive liquidity system.\n\nIf the Fed manages a controlled walk down of interest rates, and earnings continue to grow into current valuations, then no problem, right?  Right.  It's possible.  But that would be hoping for the best.  William White argues that it's more rational to prepare for the worst rather than naively hoping for the best.  A long series of things would have to go according to plan for this bubble to be \"defused\", and any number of unforeseen events could arise in order to knock the whole plan off track.  Some examples come to mind (and these are just the ones that we can fathom... the whole point is that there are more that we probably can't): Delta variant or other Covid-related scares, geopolitical tensions with China/USA/Taiwan, inflation running hotter than expected, etc.\n\nAnd speaking of inflation, why in the world is the Federal Reserve so confident that inflation is transitory?  As I mentioned above, YoY and MoM inflation expectations have come in consistently higher than expectations over the course of the last few months, oftentimes to the tune of 70-80%.  If whoever is making these predictions is getting it so wrong in regards to the numbers, who's to say that they aren't getting it wrong in regards to it being transitory?\n\nLook, it very well may be; the supply chain disruption argument is a valid and strong one.  But nobody has a crystal ball. The Fed is not an all-seeing eye where they can simply predict exactly what is going to happen.  One might hope that the Fed would be more prudent and humble in their analysis of the situation.\n\nAnd certainly the Fed has a long history of getting things wrong.  In early 2007 Ben Bernanke famously declared that subprime was \"contained\".  Just a few months later, when the crisis did begin to arise, Jim Cramer called out Bernanke for \"being an academic\" and for being out of touch with the situation on the ground.  Look, I don't really like Cramer, but I do believe he was in the right at this particular moment.  This sub won't allow me to link it here, but I recommend looking up \"Cramer tells Bernanke to wake up\" on YouTube.  It's worth a watch.\n\nLet's not forget that, even before either of these two events, the Fed absolutely failed to anticipate the crisis in the first place.  Later they would say that such a crisis was unpredictable, and totally based on panic.  But they forget the fact that people like Dr. Michael Burry, of Big Short book and film fam, did see it coming.  All of the people in that book saw it coming.  Even [William White saw it coming, and warned Alan Greenspan of it at Jackson Hole in 2003.](https://www.spiegel.de/international/business/the-man-nobody-wanted-to-hear-global-banking-economist-warned-of-coming-crisis-a-635051.html) The Fed, however, did not see it coming.  Bernanke would also claim that the crisis was nothing more than old-fashioned financial panic, and that if not for the panic it would have been the equivalent of nothing more than \"a bad day in the stock market\".  This is a convenient view for him to take, as it alleviates him of all responsibility for completely bungling the situation.  Even [Paul Krugman challenges Bernanke's assertion that it was all related to financial panic and not at all tied to fundamentals in the housing market](https://www.google.com/search?q=Paul+Krugman+Great+recession+bernanke&amp;oq=paul+krugman+&amp;aqs=chrome.1.69i57j69i59l3j35i39j69i60l3.2811j0j7&amp;sourceid=chrome&amp;ie=UTF-8).\n\nOf course, Bernanke and those around him would hold on to their view that nobody could have seen the crisis coming, and go on to congratulate themselves for rescuing the country and the world from a crisis that they themselves had failed to prevent.\n\n&amp;#x200B;\n\n**Where We Are Today**\n\nAnd that brings us to where we are today, with massive monetary stimulus coming from the Fed and all major central banks as a response to the Covid-19 crisis.  The response to 2008 was seen, rightfully in many ways, as a success.  By injecting liquidity into markets when they needed it most, the Fed and other central banks were able to stave off the next Great Depression.  Unfortunately, however, apart from taking into the account their failure to prevent the crisis in the first place, central banks have also failed to take into account the limitations of their policies.  Not only have their policies become less effective, but they've also opened the door for a dangerous array of unintended consequences (William White talks about both issues [here](https://www.dallasfed.org/~/media/documents/institute/wpapers/2012/0126.pdf)).  William White also says that, contrary to what the Fed seems to believe, monetary policy \"is no free lunch\".\n\nRecovery since 2008 has been asymmetric: we seem to be trying to fix deep, structural problems via simple injections of liquidity. Meanwhile, inequality grows, the poor get poorer, and political and social unrest continue to grow as a result.  It's a dangerous path to go down, and rather than try to explain it myself , I would recommend reading the White paper I linked above.  One clear and present danger I see today, which White mentioned in the paper, is the presence of serial bubbles: the dot-com bubble led to the housing bubble, and the housing bubble has led to the current stock market bubble, only to be aggravated by the Covid crisis and the Fed's response to it (ironically causing a new bubble in the housing market as well).  If something unforeseen were to happen, these bubbles could pop, causing lasting damage to Main Street.\n\nOne issue that I see now is that, if we were to have another crisis, what more could be done?  How much higher can the Fed expand their balance sheet?  How much more deficit spending can the federal government engage in?  I believe that we are dangerously close to exhausting our policy options.\n\nIf everything goes according to plan, it's possible that everything works out just fine.  The issue, however, may be in assuming that everything will go according to plan.\n\n&amp;#x200B;\n\n**What To Do as an Investor**\n\nI'm not an expert at this, but I would not tell anyone to go cash right now.  I would say, however, that it may be wise to hold a larger cash percentage than you're normally accustomed to.  If you normally hold 5% in your portfolio, for example, then maybe you'd consider holding 10-15%.  This will provide for buying opportunities in the event that we do have a major correction, and it will also help to preserve capital.  That said, full cash does not seem to be the way to go.  If you're waiting for a crash, you may be waiting forever.\n\nWhat I would recommend, and this seems pertinent to a lot of what I see on this subreddit, is diversification.  I see people with dangerous allocations into overvalued tech stocks (\"buy Microsoft at any valuation\"), holding 3-4 tech stocks as their whole portfolio, a 2-fund portfolio with levered funds UPRO and TQQQ, etc.  I see people holding ARK funds and other \"disruptive\" tech with unproven track records.  I see people recommending lump sums right now, because, \"on average\", they do better.\n\nIf it were me, I would diversify and play it more conservatively.  VOO would be infinitely better than UPRO, for example.  A diversified portfolio of blue-chips which very well may (and should) include stocks like Microsoft would be infinitely better than *only* holding Microsoft.  Patient dollar cost averaging would probably be more wise than dumping one's life savings into an S+P 500 index fund at the moment.\n\nI would also encourage people to look at fundamentals.  One should never, IMO, feel the urge to pay for a stock 30, 35, or 50+ times earnings just because of \"future growth potential\".  It's a gamble.\n\nIn the end, all of these strategies that I am opposed to may end up working out and may even end up doing better than my conservative approach.  The problem, however, is what happens if they don't.\n\n&amp;#x200B;\n\n**TL;DR, Summary, and Final Thoughts**\n\nAs humans we seem to have a problem with humility.  In some ways I think it's painful for us to accept our limitations and fragility.  Thus, it's easier for us to pretend that the world is predictable, orderly, and within our control.  This fallacy has made it's way into the field of economics and by extension into central banks and the Federal Reserve.  Current policies, encouraged by the \"success\" of 2008, operate under the fallacy that the economy is orderly and able to be controlled surgically, rather than admitting the unpredictability of the economy as a complex adaptive system and taking measures to be ready for when black swan events can and do occur.\n\nAs a society and as investors, we can certainly hope for the best, and sometimes the best does manifest itself and such optimism does lead to better outcomes for those who profess it.  However, perhaps a more prudent, realistic approach would be to prepare for the worst, or at the very least recognize our limitations and put measures in place in order to mitigate any potential disruptive events.\n\nGood luck and best wishes to all.",
        "subreddit": "stocks",
        "title": "The Coming Crisis.",
        "url": "https://www.reddit.com/r/stocks/comments/oy57s2/the_coming_crisis/",
        "created": 1628148807.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1627894814,
        "id": "owaqd6",
        "num_comments": 832,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 02, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/owaqd6/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1627923614.0
    },
    {
        "author": "WriterNamedJesk",
        "created_utc": 1628014044,
        "id": "ox96ze",
        "num_comments": 832,
        "num_crossposts": 0,
        "selftext": "Source from CNBC:\n\n&gt;\tShares of Robinhood soared Tuesday, pushing the newly public stock trading app well above its IPO price of $38 per share last week.\n\n&gt;\tRobinhood went public last Thursday on the Nasdaq under the ticker HOOD, hitting the public markets it seeks to democratize. The stock priced at $38 per share, the low end of its offering range. It opened at that price on Thursday but then fell 8% on its first day and had largely traded below that price, until Tuesday.\n\n&gt;\tRobinhood's stock last traded at $47.40 per share, up 25% on Tuesday.",
        "subreddit": "investing",
        "title": "Robinhood surges 25%, blows past $38 IPO price",
        "url": "https://www.reddit.com/r/investing/comments/ox96ze/robinhood_surges_25_blows_past_38_ipo_price/",
        "created": 1628042844.0
    },
    {
        "author": "helpmefindthetruth",
        "created_utc": 1629650459,
        "id": "p9ftsv",
        "num_comments": 826,
        "num_crossposts": 0,
        "selftext": "Like a true fucking moron, I've yoloed student loan money since last October. Tesla calls made me rich, spac calls made me richer. Then February happened and spac calls made me considerably less rich. 🤡 \n\nAnyhow, I'm too ugly to work behind the dumpster at Wendy's, so being fresh out of tendies, I embarked on an epic quest to search for work so I could still manage to pay my wife's boyfriend. And afford fresh cum socks.\n\nI lied about everything on my resume, and somehow landed a job as a stock broker at a large financial institution. I you knew me, you would be absolutely dumb-founded that I pulled this off. I'm incredibly unqualified and retarded. My parents and brothers were absolutely mind-fucked that I'd managed to pull this off. My mom cried tears of joy at the news that her one retarded son was finally able to get a job. \n\nWhich brings me to the main point of this post: **companies like Fidelity, Schwab, and Vanguard are desperate for employees. They're hiring anyone and everyone. Unlicensed on the phones is especially easy to get hired for, and they sponsor you for the series 7 exam to become a broker.** \n\n**I now get paid $22/hour working from home, jacking off and doing practically nothing.** The phone rings once every 15 or so minutes, and the rest of the time I'm on wallstreetbets, soaking in meme culture and trading on my own account, which is perfectly legal and allowed, as long as I don't front-run our clients. \n\nI love y'all, so wanted to pass on this beautiful brown nugget of wisdom: **apply at a financial institution like the ones mentioned above, get hired, work from home, and sit back trading the memestocks while getting paid hourly for it.** You also will become a licensed stock broker and learn a fuck-ton about the markets. There is so much to learn. If you're great at being retarded, why not get paid for it? Like the joker says, if you're good at something, never do it for free. \n\nI'm off to buy buttplugs now...",
        "subreddit": "wallstreetbets",
        "title": "I'm a retard/genius and I now get paid to be a degenerate. WallStreetBets was the gateway drug that led to a promising career.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p9ftsv/im_a_retardgenius_and_i_now_get_paid_to_be_a/",
        "created": 1629679259.0
    },
    {
        "author": "Abhisingh9916",
        "created_utc": 1628561695,
        "id": "p1fylf",
        "num_comments": 817,
        "num_crossposts": 0,
        "selftext": "AMC Entertainment mentioned Monday it will begin accepting bitcoin as payment for movie tickets and concessions if bought on-line in any respect of its U.S. theaters. \n\nCEO Adam Aron mentioned throughout an earnings name Monday that the movie theater chain will have the IT methods in place to take the cryptocurrency as payment by the tip of 2021.\n\nThe transfer marks a wedding of two extremely speculative property — bitcoin, identified for its wild volatility, and AMC, which turned a meme inventory star favored by retail merchants on Reddit’s notorious WallStreetBets discussion board.\n\nThe value of bitcoin swung drastically in latest weeks, final buying and selling round $46,000 after falling under $30,000 final month. The latest rebound got here amid optimism {that a} cryptocurrency compromise will be included as a part of the bipartisan infrastructure bundle. The Senate finally didn’t advance the deal.\n\nTesla had introduced plans to allow bitcoin transactions, however it halted automotive purchases with the digital token in mid-Could as a consequence of considerations over how mining contributes to local weather change. CEO Elon Musk has since commented positively on bitcoin, saying he plans to carry the coin long run.\n\nShares of AMC climbed greater than 4% in prolonged buying and selling on Monday following a better-than-feared earnings report. The corporate posted a narrower-than-expected loss throughout the second quarter, together with income that topped analysts’ estimates.\n\nThe inventory has rallied practically 1,500% this 12 months as a band of retail merchants who coordinated trades on social media platforms managed to create a large brief squeeze within the shares. The struggling movie theater was a preferred brief goal amongst hedge funds and different gamers.",
        "subreddit": "stocks",
        "title": "AMC says it will accept bitcoin as payment for movie tickets by year-end",
        "url": "https://www.reddit.com/r/stocks/comments/p1fylf/amc_says_it_will_accept_bitcoin_as_payment_for/",
        "created": 1628590495.0
    },
    {
        "author": "stonkslbonks",
        "created_utc": 1629038298,
        "id": "p4unkz",
        "num_comments": 816,
        "num_crossposts": 0,
        "selftext": "Good Morning Ya’ll,\n\nI have an emergency fund of $10k sitting in cash. I’m trying to think of the best way to make this work for me with next to no risk. Right now I’m considering parking this into a bond etf in my taxable account so I can get at least 1-2% back each year and so that its accessible (aka not in a retirement account). Savings accounts, CDs, etc. are not options. I’m not unfamiliar with the market so I wont jump at the slightest bit of risk but I would like my money to still be there in an emergency. My goal is just to beat what I would get if I put it into a savings account. Any suggestions on ultra safe securities or alternatives? \n\nThank you!",
        "subreddit": "investing",
        "title": "Where to park my Emergency Fund?",
        "url": "https://www.reddit.com/r/investing/comments/p4unkz/where_to_park_my_emergency_fund/",
        "created": 1629067098.0
    },
    {
        "author": "Cadenca",
        "created_utc": 1629201700,
        "id": "p62dds",
        "num_comments": 811,
        "num_crossposts": 0,
        "selftext": "It's looking brutal for both of the big Chinese names. The education stocks we of course have to dismiss from the get-go, they're done. However the jury is still out on BABA and Tencent. This can be a generational buying opportunity if China lets them do business somewhat freely even after the crackdown. Tencent music is hard to evaluate with the forced streaming rights thing, but it's a separate ticker from Tencent (TME vs TCEHY). \n\nPersonally  I bought a 2023 LEAP on BABA at 186, thinking it was a great buy. We are down from even that, and Baba is dancing around very crucial moving averages now. I also opened a long day trade on Tencent since their earnings are tomorrow. Guidance will matter a LOT, but the stock is down so much that the previous quarter earnings will possibly be outstanding given their stock prices, allowing for a nice day trade.  \n\n\nHowever, the uncertainty absolutely cannot be understated. What do you think? Are you biting yet?",
        "subreddit": "stocks",
        "title": "Chinese stock bloodbath continues, with BABA, Tencent still showing no signs of life. Can we buy in yet?",
        "url": "https://www.reddit.com/r/stocks/comments/p62dds/chinese_stock_bloodbath_continues_with_baba/",
        "created": 1629230500.0
    },
    {
        "author": "Spirited-Pause",
        "created_utc": 1629462652,
        "id": "p848ug",
        "num_comments": 807,
        "num_crossposts": 1,
        "selftext": "[https://www.axios.com/home-construction-levels-dc2bd3ac-3b36-43e2-b24e-bd686c09f3d3.html](https://www.axios.com/home-construction-levels-dc2bd3ac-3b36-43e2-b24e-bd686c09f3d3.html)\n\n \n\n&gt;The number of new homes under construction has soared — to levels not seen since the housing market crash 14 years ago.  \n&gt;  \n&gt;**Why it matters:** Home prices have been [surging](https://www.axios.com/consumers-complain-high-prices-inflation-2143e88c-84a3-4908-9861-8dd1571636dd.html) as the demand for houses has [outpaced supply](https://www.axios.com/housing-demand-outpacing-supply-construction-816e1c64-d164-4cfd-9b83-9f40b3079b36.html). Homebuilders are doing what they can to keep up, but supply chain bottlenecks have led some to [turn away buyers](https://www.axios.com/home-sales-construction-demand-dr-horton-805c6f47-c8c4-46ee-96a6-3b0fcd330365.html) as they try to catch up.  \n&gt;  \n&gt;**Driving the news:** There were 689,000 single-family homes [under construction](https://www.census.gov/construction/nrc/index.html) in July, the highest number since July 2007.  \n&gt;  \n&gt;\"This  is clearly a positive sign given the remarkably low levels of inventory  on the market,\" Mortgage Bankers Association chief economist Mike  Fratantoni says.  \n&gt;  \n&gt;**Yes, but:** While the large  number likely means more new homebuyers will soon be able to move in, it  may also reflect the fact that it’s taking increasingly [longer](https://nahbnow.com/2021/08/builder-confidence-at-13-month-low-on-higher-material-costs-home-prices/) to complete a home.  \n&gt;  \n&gt;\"I  expect there have been delays in construction, and that is why there  are so many ‘under construction,'\" Bill McBride, housing economist at  Calculated Risk, tells Axios.  \n&gt;  \n&gt;\"The lack of building materials,  ready-to-build on lots, and labor shortages are slowing housing growth,\"  Ali Wolf, chief economist at Zonda Economics, tells Axios.  \n&gt;  \n&gt;This explains why the number of homes under construction is up even as the [pace of housing starts slows](https://www.reuters.com/world/us/us-housing-starts-fall-sharply-july-2021-08-18/).  \n&gt;  \n&gt;**State of play:** As of June, [new homes](https://www.census.gov/construction/nrs/pdf/newressales.pdf)  were being sold at an annualized rate of 676,000, a number that’s come  down from a high of 993,000 in January due to supply constraints.  \n&gt;  \n&gt;An unusually high [76.6%](https://www.axios.com/housing-demand-outpacing-supply-construction-816e1c64-d164-4cfd-9b83-9f40b3079b36.html) of new homes sold were either still under construction or not yet started.  \n&gt;  \n&gt;While the supply of new homes has been ticking higher, completed homes represented a [record low](https://twitter.com/RenMacLLC/status/1419668494816264193) 10.2% of this supply.  \n&gt;  \n&gt;**The big picture:** It may be tempting to draw comparisons to the housing bubble, but that may be a mistake.  \n&gt;  \n&gt;\"Builders  adjust their sales strategy depending on where the market is,\" Wolf  explains. \"For example, during the mid-2000s housing boom, builders  started a lot of speculative building to get ahead of the demand.\"  \n&gt;  \n&gt;\"Following  the crash, builders pivoted more towards a built-to-order model where  they would wait for a buyer to start most of their homes,\" she says.  \"The high number of homes under construction is partly telling us that  builders are building homes that they already have under contract.\"  \n&gt;  \n&gt;**The bottom line:**  While the elevated level of construction raises warning flags, evidence  suggests it is more reflective of delays than frenzied speculative  building.  \n&gt;  \n&gt;\"Since most of these are already sold, I don't think we are overbuilding, or that this will impact prices,\" McBride says.",
        "subreddit": "investing",
        "title": "New home construction has soared to its highest level since July 2007",
        "url": "https://www.reddit.com/r/investing/comments/p848ug/new_home_construction_has_soared_to_its_highest/",
        "created": 1629491452.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1628154012,
        "id": "oydmm5",
        "num_comments": 797,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 05, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oydmm5/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1628182812.0
    },
    {
        "author": "bvttfvcker",
        "created_utc": 1628534250,
        "id": "p17j5j",
        "num_comments": 793,
        "num_crossposts": 0,
        "selftext": "GameStop has been a *maaaajor* taboo item for the last few months due to the inherent controversy around it.\n\nI feel like GameStop's fundamentals are pretty solid right now, but I'd like to hear more from people who surf a regular stock subreddit. \n\nWhat I have followed since I purchased shares in January is mostly that the price has *wildly* fluctuated, but the OBV has not really dropped at all. The big elephant in the room is the speculation that GME is shorted over %100, but are there any inferences that can be made from its' charts that can prove this?\n\nI appreciate your time in this and hope to learn more. I'm not a finance expert of any kind. Thanks again.",
        "subreddit": "stocks",
        "title": "So are we allowed to talk about GameStop on this sub yet?",
        "url": "https://www.reddit.com/r/stocks/comments/p17j5j/so_are_we_allowed_to_talk_about_gamestop_on_this/",
        "created": 1628563050.0
    },
    {
        "author": "lib3rty47",
        "created_utc": 1629189760,
        "id": "p5zu8c",
        "num_comments": 793,
        "num_crossposts": 0,
        "selftext": "Michael Burry is the latest investor to reveal a bet against the ETF, according to Scion Asset Management's second-quarter 13F filing. Burry initiated the new position by buying $31 million worth of puts in the ARKK ETF.\n\nBurry's not the only one, as the Disruptive Innovation ETF has a 30-day put-to-call ratio of 1.8, meaning more people are buying bearish put options on the fund than bullish call options.\n\nOther investors are outright shorting shares of the ETF, with short interest currently sitting at a record high 11.63%, according to data from Koyfin. With 21.58 million shares sold short as of Friday, the bet against ARK Invest's Disruptive Innovation ETF now totals $2.6 billion. \t\t\n\nBurry's bet against ARK is likely tied to his conviction that Tesla is a short, given that Scion Asset Management's largest position is a $731 million put position in the electric vehicle manufacturer, representing a whopping 35% of his fund's more than $2 billion in assets under management. Burry increased his bet against Tesla by 34% in the second-quarter. \n\nTesla remains Ark Invests largest position by a significant margin, with it making up nearly 11% of the ARKK ETF as of Friday. \n\nThe ARKK ETF is down 7% year-to-date, but up 38% over the past year. The ETF was down about 3% on Monday. \n\nWho's side are you on?",
        "subreddit": "investing",
        "title": "Michael Burry just unveiled a new short bet against Cathie's Wood's Arkk innovation ETF",
        "url": "https://www.reddit.com/r/investing/comments/p5zu8c/michael_burry_just_unveiled_a_new_short_bet/",
        "created": 1629218560.0
    },
    {
        "author": "Wild-Fisherman-2573",
        "created_utc": 1628248495,
        "id": "oz4ka3",
        "num_comments": 724,
        "num_crossposts": 0,
        "selftext": "Listen up retards, this won't be short.\n\nThis was not meant for you apes; Seek ing alpha denied my article because they don't want recent SPACs merger on their website.\n\nSo instead of earning cash to spend it on stupid shit, I'm here wasting my time for you all because I don't want 50 hours and 4000 words of research to go to waste, let me tell you gamblers why Microvast ($MVST) is a Hidden gem.\n\nFirst of all, you retards probably came for the short squeeze potential, rumor has it, there's not many shares left to short sell and Microvast is down 60% from its peak (even after yesterday's 20%+ run), but I could not care less about that, MVST will trade significantly higher once decent analysts start coverage on it and this post will tell you why. You guys are so lucky to have found this now, I've been holding since November when it was $11, so the price right now is still dirt cheap (it was $15 two weeks ago...).\n\nQuick introduction for those of you who don’t know what Microvast is and what it does. Microvast is a technology innovator for Li-ion batteries that designs, develops and manufactures battery systems for commercial electric vehicles and energy storage that feature ultra-fast charging capabilities, long life and superior safety. Microvast believes the ultra-fast charging capabilities of its battery systems make charging electric vehicles as convenient as fueling conventional vehicles and believes the long battery life of its battery systems reduces the total cost of ownership of electric vehicles.\n\nMicrovast is expected to grow at a compounded annual growth rate of 87%, their estimates are justified by the growing desire for electrification as well as the growing demand for clean energy and the zero-carbon revolution.\n\nThe forecasted battery components revenues (see picture below) come from Microvast being vertically integrated. Their battery components are world-class, significantly differentiating and they are going to sell those parts to some key cell manufacturers in the passenger EV market (specifically their aramid separator and their gradient cathode). They currently ship to passenger vehicle applications (SAIC) but are also engaging with passenger OEMs that have made the announcement that they will manufacture their own batteries (with battery components)\\[1\\]. They also plan to do the same thing with consumer electronics.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/alqqdfwu0qf71.png?width=359&amp;format=png&amp;auto=webp&amp;s=f607dd17a8b1c6817205d2e9b561ca0c22eb26dc\n\nMicrovast's projected revenues\n\nWhile their projections may seem optimistic, they were able to secure partnerships with industry leaders representing over $1.5 Bn in contracted revenue through 2027. $44 millions, $125 millions, $172 millions, $250 millions, and $355 millions for 2021, 2022, 2023, 2024, and 2025 respectively. Those numbers were before they recently announced a partnership with eVersum, a high-tech vehicle OEM, specialized in the design, development, and build of the most purposely engineered electric commercial vehicles for passenger transport. The deal has a potential volume forecasted to be more than 100 million €.\n\nThere’s a great interview on [cheddar news](https://cheddar.com/media/microvast-goes-public-on-nasdaq-via-spac) with Shane Smith, COO of Microvast, where he talks about why Microvast went public and raised more than $800 million: “We raised capital to support orders we already had in place. We’ve won more business than we’ve had capacity for”. It seems like Microvast has a great problem; the demand is bigger than the supply at the moment, which is great news as they may not need to spend a lot on marketing if customers are coming to them directly.\n\n\\- Microvast has over a decade of expertise in designing and manufacturing battery components (Cells, electrolytes, packs, separators). That differentiates them from most of the other battery makers who source their components from the vendors. It is important to note the cell makers do not have the right to produce the material that they did not invent or have the license for. “Microvast invented and manufactures the key battery materials to ensure unique performance and by also guaranteeing the leading time because the material patents are the strongest patents, legally protected and our success is founded on our deep technology portfolio which is wholly owned and protected by over 550 patents (and patent applications)”, said Dr. Mattis, Chief Technology Officer of the company.\n\n\\- They have more than 1800 employees including more than 500 employees in the R&amp;D division.\n\n\\- They have 28000+ Battery systems in operation in 19 different countries.\n\n\\- More than 3.8Bn Miles of operational distance was covered with no major safety incidents.\n\n\\- Their Batteries can run at a high temperature for a long time and they won’t explode. They have this proprietary way for their Batteries to be 90% as efficient as brand-new ones after 10,000 charges.\n\n\\- Among all of Microvast’s products, two stands out that no one else in the world has: the 100% Aramid separator and the full concentration of the grading of the material.\n\no “One of the perks for the solid-state battery is on shrinking separators and with our Aramid separator, we are there”, Dr Wenjuan Mattis said in the Wedbush conference held on April 8th2021. For the fans of solid-state batteries, this could be a major catalyst incoming. Their Aramid separator has higher thermal stability than charged cathode material; 2X the temperature resistance of traditional poly-ethylene separators, enhancing safety and charging time.\n\no “We have almost 15 patents in solid-state batteries, it’s one of the three advanced technologies that we’re working on”, said COO Shane Smith. 15 might not look like a lot compared to QuantumScape, which holds over 200 patents and patent applications related to solid-state battery technology, but they operate in different markets, MVST in commercial vehicle batteries and QS more in the passenger EV batteries. Also, it’s important to mention that they are not really competitors at the moment, Microvast generated about $ 107 million in sales in 2020 and is expecting to generate more than $2 billion in sales in 2025 compared to QuantumScape, which will not generate meaningful revenues until 2026, according to the website “[barrons.com](https://barrons.com/)”.\n\n\\- The other material, the full concentration grid in the cathode, is a unique material made by Microvast. With this technology, they can tune the distribution of the transition metals across the particles, which allows them to maximize the capacity and maintain safety and at the same time minimize the cost and the risk by reducing the cobalt content. The material has a capacity 20% higher than the best material in the market and is 10% lower in cost. They have a production line that has been making 600 tons per year (for the past 3 years).\n\n**Partnership/Customers**\n\n\\- They have solid partnerships, including FPT (the global powertrain brand of CNH Industrial Group), Oshkosh (leading global innovator of mission-critical vehicles and essential equipment), Porsche, SAIC, and many more. Oshkosh also made a $25MM strategic investment in the PIPE, and signed joint development agreement highlighting future battery collaboration and integration. It is worth mentioning that Oshkosh received the USPS contract to replace its mail delivery trucks (the initial contract is. worth $482 million). Also, it is an open contract, meaning USPS will be able to order more vehicles throughout the 10-year contract ([they will order between 50,000 and 165,000 vehicles](https://www.oshkoshcorp.com/en/news/2-23-21-usps)). This is a lot of potential business for Microvast and could represent a serious catalyst in the future once more information is available. Oshkosh expects to start production in 2023, right when Microvast’s factory in Tennessee will be up and running. Remember, MVST went from $14 to $23 the day Oskosh got the USPS contract, this will definitely be a HUGE catalyst once we know more about it.\n\n\\- They can count as their customers some of the leading global bus OEMs including Yutong, Higer, Foton, King Long, VDL, and Wright Bus. Their batteries are being deployed across a broad range of commercial vehicles, including automated guided vehicles, port equipment, mining trucks, fork-lift trucks. They also have customer relationships with the likes of Kion, Kalmar, KoneCranes, Linde, PSA Singapore, and Gaussin. All of these names are recognized as leading OEMs in their particular area of focus.\n\n**Key advantages over its competitors**\n\nMicrovast is very unique in itself and it is hard to compare them with other public companies; some are fairly young compared to them and others are well established but operate in the passenger EV battery market and it is unclear when/if they will shift towards the manufacturing of commercial EV batteries.\n\nTheir closest competitor is probably \\*\\*\\* had to get rid of this competitor (market cap under 1bill) but the short answer is that MVST is 10 times better...\n\nIf we do a quick head-to-head comparison, we can see Microvast seems to have a clearer path to achieve its Revenue goals.\n\n\\*\\*\\* is headquartered in Los Angeles with a factory of 113K sq.ft compared to Microvast with its biggest factory in China (1.72MM sq.ft.), another one in Germany (170K sq.ft.), and one in the United States in 2022 (577K sq.ft.). In contrast, \\*\\*\\* has more than 200 employees and Microvast is expected to hire around 300 employees only for their new factory in Tennessee and they also have more than 500 employees working in the R&amp;D division as mentioned before.\n\nIt looks like Microvast is better positioned to profit from global electrification with their factories established in three different parts of the world.\n\nThe picture below shows both their year-over-year revenues growth, which could be a bit misleading as they are not in the same business stage and operate in different continents for now. China and Europe lead the United States in electric commercial vehicles on the road, which could explain the difference.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/e6wzhoey0qf71.png?width=297&amp;format=png&amp;auto=webp&amp;s=77984dcaac9f5762f2edc3dd7fc971418dfa0ed7\n\nBut the point I want to make here is that they rely on different things, \\*\\*\\* miss on revenues is due to the short-term limited number of battery cell providers, producing safe, high-performance cells suitable for the commercial electric vehicle market. “We know, we, and the whole industry, need more cells”, said the CEO of \\*\\*\\* in their latest earnings call. Whereas Microvast produces their own cells, relying more on the primary resources. See the picture below for Microvast 2021 projected Revenues as well as \\*\\*\\* forecasted and revised revenues.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hbp0ee4x0qf71.png?width=253&amp;format=png&amp;auto=webp&amp;s=23295bd6c127a150fb07bdfec94a2a814a5fc752\n\nOn the other hand, it is true that Microvast did not have earnings call yet to discuss their 2021 outlook but I believe they are in line to achieve their projected revenues. They had \\~ $107 MM in revenues in 2020 and if they keep the same YoY growth rate of 115% (Q1 2020 à Q1 2021), they will get to $230 MM by the end of the year. The key differentiator here is that Microvast manufactures their own cells, which ensures high quality, faster product development, greater customization to client needs, and tighter cost control as well as higher margins. The fact that Microvast has its own in-house manufacturing capacity is a clear competitive advantage to my eyes (see picture below, found on Microvast website).\n\n&amp;#x200B;\n\nhttps://preview.redd.it/nkrsbv1r0qf71.png?width=468&amp;format=png&amp;auto=webp&amp;s=a77943b9313e8bdb0ce659885fc94ab870543332\n\nBoth of these companies are currently highly valued based on their potential and future expected revenues. At their current market cap, \\*\\*\\* is selling at an estimated 2021 P/S ratio between 23 and 51 and MVST with an estimated 2021 P/S ratio of about 12. Once again, these two companies are not at the same business stage and I believe they will both succeed and grow at an impressive pace, however, MVST’s growth perspective and business model seem less risky and more predictable.\n\nI have a conservative 2023 Price target on MVST of $25 (that was for Seeking Alpha, let's be real here $25 is legit fair value for Microvast, it should trade at a premium for all its potential not a discount), which is more than a 200% increase from its current price of about 8$ and $25 also happens to be their 52 week-high. My price target is based on discounted 2023 revenues and a P/S ratio of 12 (85% of forecasted 2023 revenues (85%\\*751MM) \\* 12 = \\~$7,5 billion market cap). Considering their direct competitor is currently more expensive (P/S between 23-51) and other companies operating in a similar sector are trading at high valuations: Tesla (\\~20 P/S), Pro terra (\\~11 P/S), QuantumScape (Market cap of 9.5B without revenues yet), and Nikola (Market cap of \\~4B without revenues yet), Microvast can be considered as fairly cheap and this price target of $25 as conservative. It could easily go to $40 is what I meant.\n\n**TAM is estimated to be $30Bn + in 2025**\n\n· Battery providers are expected to play a pivotal role in the EV value chain: \\~ 30-40% of EV value resides in the battery.\n\n· The rotation from gas-powered commercial vehicles to electric-powered commercial vehicles might happen quicker than the rotation from gas passenger cars to electric passenger cars because of government funding. Also, with the lithium shortage, the world will have to mine more lithium but it would not make sense to use powered-gas trucks to mine to then build electric batteries for a greener future, I believe the U.S government as well as the other governments, will make sure we use clean energy to mine lithium or any other natural resources, which would benefit Microvast.\n\n· The demand is bigger than the supply at the moment with battery cell production in the U.S. just below 40 GWh in 2020, while battery demand exceeded 42 GWh. For context, achieving President Biden’s goal of a 100% electric fleet of U.S. government vehicles will require 69 GWh of battery cells. I believe Microvast is well-positioned to become a giant in the industry with their new factories; they planned ahead, which could give them a competitive advantage over their competitors.\n\n· EV Battery market is believed to be at a key inflection point (EV is 1.5% of 2020 sales – 8.5% by. 2025), which equals to an expected CAGR of 55% (based on sales in key markets: U.S, Europe, China, Japan &amp; South Korea). Source: [Microvast investors presentation](https://microvast.com/app/uploads/2021/07/investor-presentation.pdf).\n\nØ There is a profound energy transition toward renewable energy driven by governmental policies that are synchronized for the first time, according to Frederique Carrier in the [RBC Global insight May 2021](https://www.rbcinsight.com/WM/Share/ResearchViewer/?SSS_550F5749FFF0E40F2A81B69264610173).\n\no The European Green Deal refocused the EU’s COVID-19 stimulus package onto renewables -charging infrastructure, power generation, and green hydrogen projects (allocating up to $600 billion to green projects).\n\no China’s 14th Five-Year Plan called for electric vehicles to constitute 20 percent of overall new car sales in China by 2021 from just 5% now (spending up to $1.5 trillion).\n\no Joe Biden won the U.S presidential election with a sweeping infrastructure program (up to $2 trillion).\n\no Microvast is well diversified in these three growing markets with its biggest factory in China (1.72MM sq.ft.), one in Germany (170K sq.ft.), and another one in production in the United States (577K sq.ft., expected to start production in 2022).\n\n\\- According to Shelby Tucker, RBC Capital Markets, LLC Utilities Analyst, the global market for batteries has the potential to grow 100 times by 2050.\n\nAlso, great find by [u/Little\\_Objective\\_683/](https://www.reddit.com/user/Little_Objective_683/) : The U.S department of energy (DOE) asked Microvast in 2019 to build a Li-ion battery facility in the United States to fulfill Microvast's biggest order to date, which will make Microvast the largest American Li-ion Manufacturer.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7n6py2q11qf71.jpg?width=315&amp;format=pjpg&amp;auto=webp&amp;s=3e40ba583ed4d5027fcb52d24d696a9eda469102\n\n**Global market presence**\n\nAfter primarily being focused on the PRC and Asia-Pacific regions, they are expanding their presence and product promotion to Europe and the United States to capitalize on the rapidly growing electrification markets. In 2021, they will be launching a marketing campaign to introduce Microvast to more potential customers in regions outside the Asia Pacific region and adding more headcounts to support business development ([source: Sec.gov; DEF14 form](https://sec.report/Document/0001213900-21-035581/defm14a_tuscanholdings.htm)).\n\nThe European market presents enormous growth opportunities for electric vehicles, driven by higher emission standards, reduced total cost of ownership compared to gas-based combustion engines, and growing environmental awareness. In the United States, they believe a new political administration is likely to push the electrification revolution through regulation. In pursuing contract opportunities with industry-leading companies in the United States, they have seen how their potential customers recognize the lower total cost of ownership for commercial vehicles and are seeking alternative forms of energy for energy storage applications.\n\nAs they expand their presence globally, they will continue to invest in their existing partnerships in the PRC and the Asia Pacific region and continue to grow their business there.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/00irgk431qf71.png?width=468&amp;format=png&amp;auto=webp&amp;s=49bb262a01b29c15a45b58813e286e382434220e\n\n\\- Revenues in Europe decreased by about 22% while Revenues in PRC increased by more than 260%\n\n\\- I believe the decrease in Europe is temporary and was caused by the pandemic, since it affected the whole industry, as Panasonic mentioned in their latest earnings report. and with the new factory in Germany, it will become more convenient for European companies to try and buy Microvast’s products. According to the website [iea.org](https://www.iea.org/), new electric car registrations were about 3 million globally in 2020 and for the first time, Europe led with 1.4 million new registrations followed by China with 1.2 million and the United States with 295 000 new electric cars.\n\n**Bear Case**\n\nI could not find solid bear cases anywhere on Microvast other than “it’s a Chinese company, stay away” or “insiders are dumping shares on you, get out”.\n\nLet’s talk about the latter quickly. As found on [the sec.gov DEF14 filing for THCB](https://sec.report/Document/0001213900-21-035581/defm14a_tuscanholdings.htm) (SPAC that merged with Microvast),\n\n“Subject to certain exceptions, the Registration Rights and Lock-Up Agreement further provides (1) Wu will be subject to a lock-up of one year with respect to 25% of his shares and a lock-up of two years for the remaining 75% of his shares, provided that, with respect to the 25% of his shares subject to the one-year lock-up, he can sell those shares if the shares trade at $15.00 or above for 20 days in any 30-day period and (2) the Microvast equity holders other than Wu are subject to a six-month lock-up. The Registration Rights and Lock-Up Agreement further provides that the shares owned by the Sponsor Group will be subject to a lock-up. Specifically, with respect to 75% of the shares owned by the Sponsor Group, (a) 2/3rds of such shares are subject to a one-year lock-up unless the shares trade at $12.50 or above for any 20 trading days within a 30-trading day period and (b) the remaining 1/3rd of such shares are subject to a one-year lock-up. With respect to the remaining 25% of the shares owned by the Sponsor Group, (a) 50% of such shares are locked-up until the later of the one-year anniversary of the Closing and the date on which the shares trade at $12.00 or above for any 20 trading days within a 30-trading day period, (b) the remaining 50% of such shares are locked-up until the later of the one-year anniversary of the Closing and the date on which the shares trade at $15.00 or above for any 20 trading days within a 30-trading day period and (c) all of such shares are subject to forfeiture if such trading targets are not met by the fifth anniversary of the Closing.”.\n\nIn other words, insiders are not “dumping shares on us” at a price of about $8 (now $10) because of their lock-up agreement.\n\nShould you fear Microvast because it is a Chinese company? Perma bulls will tell you it is not a Chinese company as it is headquartered and founded in Houston, Texas. In reality, it really is a Chinese battery maker coming public through an American SPAC, [according to Dana Blankenhorn](https://www.nasdaq.com/articles/tuscan-holdings-is-gaining-traction-but-where-is-microvast-coming-from-2021-02-10) (let's not argue about this fellow retards, it doesn't really matter; China is years ahead of the U.S in EV). If you were on vacation the past couple of weeks, here’s what happened with the Chinese stocks:\n\n\\- A crackdown on education has spread to Chinese tech stocks and the whole Chinese market (MSCI China index delivered negative returns of -14% in July).\n\n\\- Investors fear the unpredictability of the Chinese government, which could explain the 40% drop in MVST share price in a month.\n\nSo, the question is, should you be greedy when others are fearful as Warren Buffet said? Or should you panic sell after a 40% drop in a month?\n\nHere’s what UBS Chief Investment Officer Mark Haefel had to say on China:\n\n“For the tech sector, Beijing remains focused on its long-term goal of technological self-sufficiency and leadership on the global stage. We believe the regulatory risk will continue in the socially sensitive sectors of property. And healthcare, we don’t expect the government will push these sectors to non-profit either”. Another important part that Mark Haefel discussed is directly related to Microvast: “Offshore equities are pricing in a higher risk premium. This is likely to linger in the near term. However, we think Future returns will be largely driven by earnings growth (mainly from cyclical and value sectors) this year. We recommend investors cherry-pick stocks across sectors that are supported by earnings growth but have limited regulatory risk exposure. Our preferred sectors include consumer durables and services, energy, and Greentech.”\n\nIn the short term, who knows where the stock price can go, however, if Microvast delivers on their promises, we will most likely see abnormal returns. I understand the risk of companies operating in China, but what I particularly like about Microvast is that they are diversifying away from China with their factory in Germany and one incoming in the United States, they will be on three different continents, which is worth something to my eyes.\n\nLet’s summarize what has been said before with a SWOT Analysis\n\nSWOT AnalysisStrengths:\n\nØ Unlike competitors who redesign existing batteries to fit them in EVs, Microvast has designed its batteries from the ground up specifically to address the problems facing EV batteries. Every step of the manufacturing process is controlled by Microvast, leading to higher quality and lower-cost products.\n\nØ Researchers from Microvast have developed a novel high-power battery technology that has a higher energy density, longer life, and safer operation than any other state-of-the-art lithium-ion battery on the market. The system is built from four breakthrough technologies and could potentially be used in plug-in hybrid electric vehicle and fully electric vehicle markets. Because of its many benefits, the technology has the potential to also enhance the performance of lithium-ion batteries used in cell phones and other smaller-scale applications, as well as in electric grid applications.\n\nØ $ 1.5B total contracted revenue in Pipeline through 2027, which will help Microvast to grow revenue at an expected CAGR of 87% from 2020-2025E\n\nWeaknesses:\n\nØ Being a “Chinese company”, U.S investors might not like it as much as a U.S company.\n\nØ Portfolio Managers being scared of investing in SPACs or even the “deSPACs phase “after the SPACs controversy in the beginning of 2021.\n\nOpportunities:\n\nØ There is three substantial untapped markets that Microvast plans on expanding their products offering to; Passenger Vehicles (PV), Energy Storage Solutions (ESS), and Battery Components (Consumer Electronics), which could expand their TAM by $45B.\n\nØ 2021: Begin Battery Production in the area of Berlin, Germany\n\nØ 2022: Begin Battery Production in Clarksville, TN\n\nThreats:\n\nØ Susceptible to disruption, many companies are trying to improve EV batteries and might not need Microvast in the foreseeable future.\n\nØ The Prices of Lithium-ion batteries have been plummeting over the past decade, and that trend is expected to continue in the coming years, which could impact Microvast’s profit margin.\n\nØ Other companies are working hard on lowering EV battery costs, one or more of them could make a battery substantially cheaper than Microvast.\n\nTo conclude, I believe the growth opportunity in the commercial EV battery sector is impressive as well as somewhat predictable as it makes sense for companies to go electric economically, financially, and environmentally. Microvast is well-positioned to capture a great portion of the total addressable market of $30 Bn and has the opportunity to dramatically increase their TAM if they expand their business to consumer electronics, passenger EV batteries, and energy storage solutions market. The fact that Microvast went public through a SPAC merger less than a week ago gives retail investors an edge to generate alpha as analysts have not started to cover the company yet. Microvast also fits the criteria of sustainable investing, a trend that is not about to die anytime soon. Overall, Microvast has everything it needs to become a successful company; it now just needs to deliver on its promises.\n\nSo, the real question is: does the upside outweigh the downside?\n\nYou tell me.\n\n\\*\\*Disclaimer\n\nI own shares and warrants of MVST.\n\nI am not a financial advisor, this should not be used as financial advice.\n\n\\[1\\] Wedbush presentation 4/8/2021",
        "subreddit": "wallstreetbets",
        "title": "Microvast ($MVST) -The only DD you'll ever need",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oz4ka3/microvast_mvst_the_only_dd_youll_ever_need/",
        "created": 1628277295.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1628069417,
        "id": "oxp0mg",
        "num_comments": 723,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - Aug 04, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/oxp0mg/rstocks_daily_discussion_wednesday_aug_04_2021/",
        "created": 1628098217.0
    },
    {
        "author": "roman_axt",
        "created_utc": 1629726233,
        "id": "pa03sf",
        "num_comments": 709,
        "num_crossposts": 0,
        "selftext": "Hello, dear WSB, it's Roman here\\[,\\](https://imgur.com/a/zlXWOOh), it's been awhile!\n\nSome of you may remember me as a \\[triangles\\](https://www.reddit.com/r/wallstreetbets/comments/mrm6b5/like\\_a\\_beast\\_cornered\\_and\\_im\\_not\\_talking\\_about/) \\[lover\\](https://www.reddit.com/r/wallstreetbets/comments/mqt5qm/apemeisters\\_it\\_is\\_my\\_pleasure\\_to\\_present\\_you\\_the/), \\[SPY 🌈🐻 doomer\\](https://www.reddit.com/r/wallstreetbets/comments/mwevzz/the\\_big\\_short\\_20\\_why\\_bears\\_may\\_soon\\_reconsider/), \\[Meminem - Degen creator\\](https://www.reddit.com/r/wallstreetbets/comments/n2ifd1/happy\\_upcoming\\_10\\_mil\\_degenerate\\_wsb\\_heres\\_my/) or \\[the guy who got to CBS news\\](https://www.cbsnews.com/amp/news/amc-gamestop-meme-stock-rally-continues/) for the AMC TA with an \\[inverted MC Hammer and a bull humping a bear\\](https://www.reddit.com/r/wallstreetbets/comments/nfaizr/amc\\_looking\\_juicy\\_next\\_resistance\\_targets\\_1623/).  \nMost importantly, I am the retard to make a GME bet a couple of months ago, where I would have \\[to shave my precious beard provided GME stonk shares don't reach thousands\\](https://www.reddit.com/r/wallstreetbets/comments/nc6qi3/lets\\_revive\\_the\\_buried\\_wsb\\_culture\\_gme\\_to/). It's August already, GME is still in lower hundreds, and I feel obliged to make my next move. After several weeks of thoughtful consideration and research, I have finally made a decision to...\n\n\\[Double down\\](https://imgur.com/a/zlXWOOh) on my bet, like any decent retard residing in this cozy place would do.\n\nBut first things first, let's revise the original bet, \\[the underlying post and analysis\\](https://www.reddit.com/r/wallstreetbets/comments/nc6qi3/lets\\_revive\\_the\\_buried\\_wsb\\_culture\\_gme\\_to/).\n\n(I’m not a financial advisor, just a retard who enjoys writing big texts and making risky bets)\n\n&amp;#x200B;\n\n# Chapter I. The short, the squeeze, and the ugly manipulation\n\n&amp;#x200B;\n\nOk, so a couple(ish) of moths ago I handcrafted that TA thesis (on which the beard bet is based) for GME price action and its potential move to lower thousands as the short squeeze progresses:\n\n*Processing img 5sldutzq33j71...*\n\nThe thesis above was not a generic 'you are here' type of posts you got used to seeing occasionally here and there through the last half a year. Rather, it was a fair attempt to critically assess the stonk's technical setup through the prism of the two most famous SS historical examples:\n\n*Processing img h7b6sm9t43j71...*\n\n*Processing img iz041qtv43j71...*\n\n  \n\\[The OC post and analysis\\](https://www.reddit.com/r/wallstreetbets/comments/nc6qi3/lets\\_revive\\_the\\_buried\\_wsb\\_culture\\_gme\\_to/) (which is still worth your reading, especially if you want to grasp this chapter of the post in greater detail) took me a lot of effort to produce, and I am still proud to have done this work, distilling the essential components of a short squeeze structure, and creating at least some sort of a framework to apply in cases like the current one. However, GME price during the summer did not follow the pattern, and particularly its most anticipated triangular 'Squieezluminati Confirmed' stage.\n\n*Processing img ncwwuqz253j71...*\n\n  \nDoes it render the whole thing void? Well, that's what I've been thinking in August while morally preparing myself for the beard apostasy. But something didn't quiet fit, and I kept digging. Just to stumble upon this:\n\n*Processing img 58sg96eg53j71...*\n\nLooks familiar, doesn't it? Ladies and apemen, with a great pleasure I present you AMCSS, the timing of which is really similar to what I was betting my beard on in relation to GME. What happened to AMC during the summer actually proves almost every single point from my SS thesis. Firstly, the 'Purple Haze' level ($14.38) is the main resistance on the chart, and only when the breakout occurs, the SS unfolds. Secondly, 'Squeezy Grail' (the cup shaped consolidation) and the 'Runway' (rectangle) phases precede the squeeze impulse - that's where the buying pressure accumulates, to the point when it can no longer be suppressed. Next, interestingly enough, trend based Fibonacci periods grid allows to predict the peak date (vertical line marked as 1) extremely accurately, if the preliminary trend + the 'Squeezy Grail' phase are used as its core measurement (red dashed line). But wait, there's more! The 'Purple Haze' resistance is in between 1 and 0.786 Fibo levels (horizontal), while the retracement itself measures the amplitude of the SS impulse perfectly - e.g. take a look at how the price action retraces to 0.5 Fibo after the peak, or how the price consolidates in the channel of 0.236-0.382 after that. Well, the thesis fits almost perfectly to AMC - I hope you're now sitting like\n\n*Processing img nltp4a1l53j71...*\n\nThere are several minor deviations from the SS frameworks which should be mentioned too, though: the PH breakout occurs during 0.618 Fibo period, rather than 0.382, as it was in historical examples; the triangular phase doesn't really resemble a triangle. Notwithstanding those minor factors, original SS thesis is more than alive with the AMC example.\n\nYou might be thinking now: what defuq is this crazy dude is talking about, where is the video of the beard shaved? Well, I'm providing the AMCSS analysis here in order to prove that my thesis is legitimate, and GME price action had to follow the pattern. GME and AMC are like brothers in arms, with 'similar' fundamentals, and through the major part of 2021 those two have been moving in tandem, strongly following linear correlation principle. The thesis structure (built upon TSLA and VW historical examples) indicates that there is the strong buying pressure accumulating, and in AMC example the lid was opened for a bit to let the steam out; while GME is still being suppressed even further during the current consolidation, and in my opinion - it is done artificially and purposely.\n\nFurthermore, take a look at this:\n\n*Processing img 44m2qp2q53j71...*\n\n  \nWhat you see above is the screenshot from \\[my other post\\](https://www.reddit.com/r/wallstreetbets/comments/nwub7d/gme\\_to\\_amc\\_and\\_bb\\_last\\_week\\_ladies\\_go\\_first\\_gme/), where I explained that two stonks had extremely similar technical setups: both have long-ass triangular consolidation at the core, which is subsequently broken out to the upside. Next, take a look at MACDs or TSIs from both examples, and particularly at what is highlighted by rectangles - zoom in and see for yourself, the structures are close to being identical. So, the question arises: why if two stocks have very similar fundamental and technical backgrounds, one is allowed to moon a little bit, while the other one is being knocked out each time right before the lift off should occur? The answer if fairly obvious, and it's because some big financial boys want things to go this way. AMC is something they can control, or maybe they even benefit from it’s price fluctuations. While GME is a Pandora box, and they try to keep its lid close for as long as possible, soothed by an illusion of a controllable chaos. And those suckers are ready to use any method to suppress the price, especially \\*\\*insert Aliens Guy meme here\\*\\*: manipulation.\n\nApes from a friendly sub uncovered many such methods, like good old FTDs, married puts, OTC trades, wash sales, darkpools... I'm not going to discuss those things in this post, because there is a plenty of outstanding DD on reddit. I'm just going to borrow this picture from u/AutoDrafter2020 because it speaks for itself, in my opinion:\n\n*Processing img klztgzo563j71...*\n\nAs you can see yourself, every major piece of fundamentally good news for GME has resulted in price suppression, and each of the dirty play instruments mentioned above played a role in this shitshow to one degree or another. The manipulation is so blatantly obvious that it makes me sick. Manipulating the market is not cheap, and probably costs fuckers on the other side of the trade millions, if not billions every month. Why would there be so much effort and resources put into the war over a ‘memestonk’? Is it so that they want some random noname reddit retard to lose his precious beard? The actual answer is shocking, and in my opinion it should be sought in two Greek letters, **σ (sigma)** and **β (beta**).\n\n&amp;#x200B;\n\n# Chapter II. How 1987 and 2008 are reincarnating into 2021\n\n&amp;#x200B;\n\nPepperidge apes should remember that during one of the Gamestop congressional hearings Vlad 'the Stock Implaler' Tenev mentioned something about late January events falling into five-sigma category, which scientifically speaking corresponds to a p-value, or probability, of 3x10-7, or about 1 in 3.5 million. He also used such a hackneyed expression as a 'black swan' event. Quote from a \\[Bloomberg article\\](https://www.bloomberg.com/opinion/articles/2021-02-19/gamestop-hearing-robinhood-is-cool-but-is-it-out-of-its-depth):  \n\n\n&gt;A “black swan” event — made famous by Nassim Nicholas Taleb in a best seller that parsed the role of randomness in finance and life — comes as a surprise, has great impact and later becomes rationalized away as easily explained or predicted. *Many things that appear to be black swans, however, aren’t unforeseeable and are merely classified as such to avoid responsibility for not spotting them ahead of time in the first place*. A “five-sigma event” is a statistical descriptor of something that occurs five standard deviations away from and on either side of the mean in a data set. It describes the odds of something happening, and in five-sigma territory the odds are long.\n\n  \nCategorizing January craze as five sigma is debatable to say the least, because Gamestop shares started to skyrocket and multiply in price long before late January, and it doesn't take a lot of wrinkles to understand that the volatility should likely increase further, requiring additional collateral and somewhat decent risk management. However, I'm not going to discuss Vlad's choice of sacrificing Robbinhood users (disabling buy button) in order to protect the solvency of Robbinhood customers (Citadel and co), because that has been done enough times already, and the North remembers. Rather, Robbinhood example and Vlad's interpretation are provided here as a vivid illustration of the fact which we all feel deep inside: there is just too much risk in the market, it is being too much fucking over-leveraged so that even a fucking retail stock broker may easily get margin-called in a matter of hours. It is especially hilarious, considering the fact that unsophisticated actions of buying and holding a particular stock is enough to fuck the system, making the entire house of cards fall apart. The problem is that when you dive deeper, 2008 seem to be a blessing.  \n\n\nFor example, let's start from the easy difficulty, take a look at this chart:\n\n*Processing img 47plfcth63j71...*\n\nOne of the major indicators of how the leverage is utilized is FINRA's margin statistics from its members (who carry margin accounts for customers), which FINRA publishes every month. There are several points of interest for us on the chart above. The first and the most important one is that margin dept has tripled after previous major bottom in 2009, from about $300 billions to almost $900 bn in 2021. Furthermore, take a look at how MD reaches the peak of $500 bn both in 2000 and 2007, and it's sufficient to send S&amp;P into several years bear market with 50% retrace, as soon as the leveraging trend reverses. Currently, MD is on its way to trilly, the figure has almost doubled compared to 2000 and 2007. Sounds a bit GUHy, doesn't it? Also, looking at the margin debt before the .com bubble, 2007 financial crisis and Covid crash it can be seen that, each time, the margin contraction starts before the crash itself, making MD a leading indicator. And guess what? MD is down 4.3% in July, which is the first major decline in 15 months. Deleveraging is a painful process, but is necessary for markets’ health, and it seem to have already begun.\n\nHowever, this time it is going to be so much fucking worse. To quote a brilliant mind, u/Criand:  \n\n\n&gt;2008 never finished. It was can-kicked and the same people who caused the crash have still been running rampant doing the same bullshit in the derivatives market as that market continues to be unregulated. They're profiting off of short-term gains at the risk of killing their institutions and potentially the global economy.\n\nI strongly recommend you reading his informative 2008 post in full, because it is a fascinating financial journey, through which you will learn a lot about how fuk the financial system really is right now, largely because of leverage. Imagine if r/WallStreetBets was a central bank. Fuck, this must be the most spot on metaphor I came up with in my entire life. Actually, it seems now that the entire financial world is one fucking giant WSB right now. And not in the good sense of its reputation.\n\nTo quote another brilliant mind, u/peruvian_bull, whose series of posts has been peer-reviewed by an economics professor:  \n\n\n&gt;The entire derivatives market is HUGE. The BIS estimated the total notional value of the OTC derivatives market to be $640 Trillion in 2019! And that doesn't even include exchange-listed derivatives like most common option contracts. More sober estimates put it somewhere north of $1 Quadrillion. Numbers of this size are hard to wrap your head around - this is equivalent to a million billion, or a thousand trillion- for reference, the US economy is around $22 Trillion and the world economy is estimated to be $88 Trillion - thus the entire world economy could fit into the notional derivatives market 11x over and STILL not reach it. Every single bank is exposed, either directly or indirectly, to this market. For example, Deutsche Bank ALONE has over $47 Trillion in Notional gross exposure - TWICE the size of the entire US Economy!\n\n*Processing img enhgxe0773j71...*\n\n*Intermediate TL;DR: the financial market is sufficiently levered according to its risk tolerance, and we all know what comes after that:*\n\n*Processing img 2pb2k9qv63j71...*\n\nThis represents what Buffet called “A Time Bomb” in the market - as long as money flows in, the party continues. Once it stops, the Weapons of Financial Destruction are unleashed. As you may remember, something like that happened in 2008, when predatory lending targeting low-income homebuyers, excessive risk-taking by global financial institutions,\n\n*Processing img xct7amb273j71...*\n\nand the burst of the US housing bubble culminated in a perfect shitstorm. MBSs (Mortgage Backed Securities) tied to American real estate, as well as a vast web of linked to those MBSs CDOs, collapsed in value. As a result, financial institutions worldwide suffered severe damage, the GDP contracted sharply, the unemployment rates rose significantly, pushing millions of people into poverty - largely because some greedy bastards who had too much of financial power based on over-abused leverage and close to zero risk management made all the wrong decisions they could.\n\nThanks God, they promised not to do that again!\n\n*Processing video 1rflh5jy33j71...*\n\n  \n\\*\\*In Tyler’s voice\\*\\* So that was a fucking lie:\n\n*Processing img f9xgxitt73j71...*\n\nThe figures above provide the relatively up-to-date exposure of the the biggest commercial banks towards derivatives. Although, we shouldn’t expect that those numbers allow to calculate somewhat precise leverage ratios, inasmuch as many of these derivative obligations net each other out, rendering the real value of the debt to be a bit more modest (or maybe not, who knows what’s really going on OTC). What is safe to assume, however, is that based on the numbers above, the leverage ratio is still in double digits at least for the biggest and most systemically important banks. From the recent infamous Archegos example, we saw that playing with leverage-amplifying synthetic market instruments (total return swaps in Bill Hwang’s case) is like playing with matches - and it will almost certainly lead to dire consequences at some point in time. Poor Bill just was the first one to run out of luck.\n\nAnother important factor to bear in mind, is that those professional financial ANALysts seem to follow a similar risks assessment approach that is used by an average WSB retard buying FDs. No, I’m not kidding, they literally stick to a bit more sophisticated version of a famous postulate: ‘Stonks only go up’. We are talking about VaR, or Value at Risk models. u/peruvian_bull managed to explain this complex stuff in a brilliant way in his series of posts dedicated to the highly probable upcoming financial market fiasco (fascinating reading - in this part of the series, 1987 famous crash is discussed and how derivatives and improper risks assessment exacerbated it):\n\n*Processing img zfh3tjyk83j71...*\n\n&gt;Even to this day, Regulators, and indeed even financial industry insiders, are completely blind to the risk. OTC Derivatives are essentially unregulated - NO ONE knows the true size of this market. Worse yet, the traders inside the bank are using optimistic versions of the Efficient Market Hypothesis and VaR models to estimate their risk, which comes out to essentially 0 due to the risk models and net exposure hedging. Thus, they pile on more risk every day, ensuring that this problem continues to grow - until the entire system explodes.\n\n  \nNo wonder, that in such a financial environment as described above, cases like GME would be given a five-sigma label. The best analogy to describe current financial market conditions would be a castle made of sand, when one sea wave of a higher magnitude can easily crash the whole thing into the dirt; or a house of cards, when just one stronger blow of the wind will trigger a chain reaction and demolish it to the fundament. The current status quo is not self-sustainable, and very soon it will become also a not FED-sustainable. The markets have been artificially supported by the money supply expansion for too long, currently resembling a drugs addict, who can’t live without the always following stimulus “dose”. As soon as liquidity dries up for a brief moment (sucked in by some negative beta bad boy), or the FED blinks... I guess, we’ll find out really soon what happens then.\n\nTo conclude and sum up the second chapter, quoting u/peruvian_bull again:  \n\n\n&gt;**As long as money keeps flowing into the Casino, the gamblers feel little risk, so no one pulls out. The Fed continues to print money, equity/bond prices continue to rise, and since there’s “no risk” of the underlying falling in value, everyone keeps their money in the pot, and the poker game continues.**  \n&gt;  \n&gt;**The profits made from derivatives trading are enormous, and any bank that stopped doing this would quickly lose investors, because they would instantly take their capital out and take it to another bank that actually is profitable. It's all a confidence game - as long as everyone is confident, prices keep rising, and the cash keeps pumping in, the party will continue.**\n\n# Chapter III. The Sword of Damocles (and the bet)\n\n  \nWell, here comes the party pooper, or it’s more appropriate to say, the party shitter:\n\n*Processing img nw7vw0dk93j71...*\n\n*Processing img ebo8be5r93j71...*\n\n*Processing img kqwqmy9t93j71...*\n\nConnecting the dots: when there is too much risk in the system, it becomes less and less sustainable, so that potentially even a short but sudden and intense surge in volatility may demolish the whole house of ~~leverage~~cards. Anything may cause a fatal error in such a system, even an old man’s fart with the sigma of five. In our example however, it’s when crazy retail jumps on the hype train, and buys over-shorted stonk like there’s no tomorrow, things look like this:\n\n* GME shares added more than 500% in less than two days, showing off its negative beta in all glory,\n* making VIX volatility index explode more than 60% in a day,\n* and injuring SPY badly (sharp decline of about 4% in 21 hours).\n\nThat was just a preview.\n\nLate January events are extraordinary, that’s for sure. But, you know, extraordinary things happen too, and it’s plainly stupid not to hedge in such circumstances, as Robbinhood did in this story. That was a vivid example of an extremely poor risk management, prevalent on the financial markets currently. This factor, coupled with the excessive margin exploitation (e.g. a fucking reported triple digits SI, dafuq?), will consequently result in the financial crisis, which is currently on its way (remember, crises love September and October).\n\nAfter a rather fascinating set of circumstances, GME situation seems to have become the needle to burst the bubble, that’s why big financial boys use all of their dirty tricks, flirting with an illusion of a controllable chaos. However, any manipulation has its end, and it is a double edged sword (of Damocles). The market will punish the bad actors, as it has always done so in the past - and the good guys will be remunerated. Again, GME is not the reason of the upcoming market crash, but rather a trigger, and in the current financial environment anything could work as a substitute. What was that quote from the ‘Butterfly Effect’ movie? Oh,  \n\n\n&gt;It has been said that something as insignificant as the gases emitted from an anus of an old man can ultimately cause a financial typhoon all around the world...\n\n  \n**Enough words and quotes. This is my bet: GME to thousands in a couple of months, while the new financial crisis unveiling, or I’m not only shaving off my beard (which I wasn’t really afraid of loosing, tbh, as it would grow back in a couple of months) but also this, my real treasure:**\n\n*Processing video m0gwzvob43j71...*\n\n**And here is why I’m so confident in my bet and its timing:**  \n\n\n*Processing img w51ks5l2b3j71...*\n\nI mean, SPY is cooked. What's outlined on the TA above is a massive bearish formation, ready to push the market off the cliff it has been climbing all this time. In my opinion, that's going to be just the first wave of the nasty downside movement, and a very sharp and painful one. Considering the longer term setup, explained \\[here\\](https://www.reddit.com/r/wallstreetbets/comments/mwevzz/the\\_big\\_short\\_20\\_why\\_bears\\_may\\_soon\\_reconsider/), and \\[here\\](https://www.reddit.com/r/wallstreetbets/comments/o0fjdb/this\\_time\\_its\\_different/), the technical (as well as fundamentals, as discussed above) conditions resemble the perfect storm brewing. Now, while it's all calm before that storm, enjoy the last sunny and warm days (and, maybe, it's a good idea to fix some profits, dunno). September and October will be fun. Especially for GME with its negative beta.\n\n*Processing img mcg9etbeh3j71...*\n\n*Processing img xbskfzdkh3j71...*\n\n**TL;DR: My SS thesis and its core idea is more than alive with GME (proven by AMC example), and even though any major price action movement has been suppressed in an attempt to keep things under control by big financial players, the buying pressure is there and it's as strong as it has ever been. The financial system is over-levereged, way more than it was in 2008, and coupled with the industry poor risk assessment standarts ('average WSB retard'-like or worse), it is heading to the next financial crisis (and crashes love autumn). This factor, considering GME's negative beta, will likely trigger the next powerful bull run for GME, sucking in the liquidity from the fearful and already-illiquid markets, resulting in colossal volatility typhoon. Either that, or I'mma be completely bold this winter.**",
        "subreddit": "wallstreetbets",
        "title": "GME YOLO beard bet update. In short (pun intended), hedgies r out of luck, markets r fuk, GME will go BRRRR, and I’m doubling down on my bet with my “L'Oreal shampoo commercial”-like hair",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pa03sf/gme_yolo_beard_bet_update_in_short_pun_intended/",
        "created": 1629755033.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1628240417,
        "id": "oz2xiy",
        "num_comments": 696,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 06, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oz2xiy/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1628269217.0
    },
    {
        "author": "ini0n",
        "created_utc": 1629970346,
        "id": "pbw1cc",
        "num_comments": 694,
        "num_crossposts": 0,
        "selftext": "&gt; \"So it sounds like you're still sticking with Tesla\" - Host\n\n&gt; \"Without a doubt... We've increased our estimate, in the next 10 years we think the autonomous taxi network is a 11 to 12 trillion global opportunity. From nothing today, just to give you a sense of the size of that opportunity the US economy is 21 trillion dollars.\" - Cathie\n\nHear for yourself: https://youtu.be/JUk2PE02cl8\n\nFrom a quick Google, ride sharing and taxis currently are a $258b industry. The entire automotive industry is $3.5t. So not only will everyone switch from to self driving taxis, but they'll spend many multiples more then what was spent on all cars. \n\nMaybe Cathie is just fully onboard the Michael Burry \"there's going to be hyper inflation\" train who knows /s.\n\nhttps://www.statista.com/outlook/mmo/mobility-services/ride-hailing-taxi/worldwide\nhttps://www.ibisworld.com/global/market-size/global-car-automobile-sales/",
        "subreddit": "investing",
        "title": "Cathie Wood predicts the autonomous taxi network will reach $12 trillion in next 10 years",
        "url": "https://www.reddit.com/r/investing/comments/pbw1cc/cathie_wood_predicts_the_autonomous_taxi_network/",
        "created": 1629999146.0
    },
    {
        "author": "redtexture",
        "created_utc": 1628479677,
        "id": "p0td5f",
        "num_comments": 686,
        "num_crossposts": 0,
        "selftext": "For the options questions you wanted to ask, but were afraid to.  \n**There are no stupid questions, only dumb answers.**  &amp;nbsp;  **Fire away.**  \nThis project succeeds via thoughtful sharing of knowledge.  \n**You, too, are invited to respond to these questions.**  \nThis is a weekly rotation with past threads linked below.\n\n----\n\n###**BEFORE POSTING, PLEASE REVIEW THE BELOW LIST OF FREQUENT ANSWERS.**   [.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)\n\n---\n\n**Don't exercise your (long) options for stock!**   \n**Exercising throws away [extrinsic value](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value) that selling harvests.**  \n**Simply sell your (long) options, to close the position, for a gain or loss.**  \n**Your breakeven is the cost of your option when you are selling.**  \n**If exercising (a call), your breakeven is the strike price plus the debit cost to enter the position.**  \nFurther reading:   \n**[Monday School: Exercise and Expiration are not what you think they are.](https://www.reddit.com/r/options/comments/m5r8mi/monday_school_exercise_and_expiration_are_not/)**  \n\n---\n\n**Key informational links**  \n•&amp;nbsp;[Options FAQ / Wiki: Frequent Answers to Questions](https://www.reddit.com/r/options/wiki/faq)  \n•&amp;nbsp;[Options Toolbox Links / Wiki](https://www.reddit.com/r/options/wiki/toolbox/links)  \n•&amp;nbsp;[Options Glossary](https://www.optionseducation.org/referencelibrary/optionsglossary)   \n•&amp;nbsp;[List of Recommended Options Books](https://www.reddit.com/r/options/comments/8qfs14/options_book_list_review_of_all_books_that_helped/)    \n•&amp;nbsp;[Introduction to Options (The Options Playbook)](https://www.optionsplaybook.com/options-introduction/)  \n•&amp;nbsp;[The complete r/options side-bar informational links (made visible for mobile app users.)](https://www.reddit.com/r/options/about/sidebar)  \n•&amp;nbsp;[Characteristics and Risks of Standardized Options (Options Clearing Corporation)](\nhttps://www.theocc.com/about/publications/character-risks.jsp)  \n\n[.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)\n\n ----\n\n**Getting started in options**   \n•&amp;nbsp;[Calls and puts, long and short, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/basics)   \n•&amp;nbsp;[Options Basics (begals)](https://www.reddit.com/r/options/comments/gh9vpl/options_basics/)  \n•&amp;nbsp;[Exercise &amp; Assignment - A Guide (ScottishTrader)](https://www.reddit.com/r/options/wiki/faq/pages/exercise)  \n•&amp;nbsp;[Why Options Are Rarely Exercised - Chris Butler - Project Option (18 minutes)](https://www.youtube.com/watch?v=PsZsqiBFnmo)  \n•&amp;nbsp;[I just made (or lost) $___. Should I close the trade? (Redtexture)](https://www.reddit.com/r/options/comments/eunnko/noob_safe_haven_thread_jan_27_feb_02_2020/fg6jjjz/)    \n•&amp;nbsp;[Disclose option position details, for a useful response](https://www.reddit.com/r/options/wiki/faq/pages/trade_details)  \n•&amp;nbsp;[OptionAlpha Trading and Options Handbook](https://optionalpha.com/handbook)   \n\n---\n\n**Introductory Trading Commentary**   \n&amp;nbsp;&amp;nbsp;**Strike Price**   \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Options Basics: How to Pick the Right Strike Price (Elvis Picardo - Investopedia)](https://www.investopedia.com/articles/active-trading/021014/options-basics-how-pick-right-strike-price.asp)  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[High Probability Options Trading Defined (Kirk DuPlessis, Option Alpha)](https://www.youtube.com/watch?v=DcWHh2co80M)   \n&amp;nbsp;&amp;nbsp;**Breakeven**  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Your break-even (at expiration) isn't as important as you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/m0m7at/monday_school_your_breakeven_isnt_as_important_as/)  \n&amp;nbsp;&amp;nbsp;**Expiration**  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Options Expiration &amp; Assignment (Option Alpha)](https://www.youtube.com/watch?v=OnUsu1y1W9w)    \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Expiration times and dates (Investopedia)](https://www.investopedia.com/terms/e/expiration-time.asp)  \n&amp;nbsp;&amp;nbsp;**Greeks**  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Options Pricing &amp; The Greeks (Option Alpha) (30 minutes)](https://www.youtube.com/watch?v=kCJcEOYuuII)  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Options Greeks (captut)](https://www.reddit.com/r/options/comments/hl8i2n/option_greeks_101)  \n&amp;nbsp;&amp;nbsp;**Trading and Strategy**  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Common mistakes and useful advice for new options traders (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_common_mistakes_and_useful_advice_for__new_options_traders)  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Common Intra-Day Stock Market Patterns - (Cory Mitchell - The Balance)](https://www.thebalance.com/common-intra-day-stock-market-patterns-1031456)  \n\n---\n\n**Managing Trades**  \n•&amp;nbsp;[Managing long calls - a summary (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/managing_long_calls)  \n•&amp;nbsp;[The diagonal calendar spread, misnamed as the \"poor man's covered call\" (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/diagonal_calendars)  \n•&amp;nbsp;[Selected Option Positions and Trade Management (Wiki)](https://www.reddit.com/r/options/wiki/faq/pages/positions)  \n\n**Why did my options lose value when the stock price moved  favorably?**  \n•&amp;nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value)\n      \n**Trade planning, risk reduction and trade size**  \n•&amp;nbsp;[Exit-first trade planning, and a risk-reduction checklist (Redtexture)](https://www.reddit.com/r/options/comments/9at2fu/noob_thread_aug_26_sept_1/e4ywq0u/)  \n•&amp;nbsp;[Monday School: A trade plan is more important than you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/mpk6yf/monday_school_a_trade_plan_is_more_important_than/)  \n•&amp;nbsp;[Applying Expected Value Concepts to Option Investing (Select Options)](http://www.selectoptions.com/Edu-Expected-Result)  \n•&amp;nbsp;[Risk Management, or How to Not Lose Your House (boii0708) (March 6 2021)](https://www.reddit.com/r/options/comments/lyp1uc/risk_management_or_how_to_not_lose_your_house/)  \n•&amp;nbsp;[Trade Checklists and Guides (Option Alpha)](https://optionalpha.com/members/guides-checklists)  \n•&amp;nbsp;[Planning for trades to fail. (John Carter)  (at 90 seconds)](https://youtu.be/N5_OkdvPmUI?t=90)\n\n**Minimizing Bid-Ask Spreads (high-volume options are best)**   \n•&amp;nbsp;[Price discovery for wide bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/comments/9u8o7j/noob_safe_haven_thread_nov_0511_2018/e96eynd/)  \n•&amp;nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)\n\n**Closing out a trade**  \n•&amp;nbsp;[Most options positions are closed before expiration (Options Playbook)](https://www.optionsplaybook.com/options-introduction/closing-option-position)       \n•&amp;nbsp;[When to Exit Guide (Option Alpha)](https://web.archive.org/web/20201111230944/https://optionalpha.com/wp-content/uploads/2015/01/When-To-Exit-Guide.pdf)  \n•&amp;nbsp;[Risk to reward ratios change: a reason for early exit (Redtexture)](https://www.reddit.com/r/options/comments/hg8ce9/risk_to_reward_ratio_changes_over_the_life_of_an/)  \n•&amp;nbsp;[Close positions before expiration: TSLA decline after market close (PapaCharlie9) (September 11, 2020)](https://www.reddit.com/r/options/comments/ipqkua/fridays_tsla_lesson_close_positions_before/)  \n\n---\n\n**Options exchange operations and processes**  \nIncluding:     \n[Options Adjustments for Mergers, Stock Splits and Special dividends; Options Expiration creation; Strike Price creation; Trading Halts and Market Closings; Options Listing requirements;  Collateral Rules; List of Options Exchanges; Market Makers](https://www.reddit.com/r/options/wiki/faq/pages/exchange_operations)   \n\n**Miscellaneous**  \n•&amp;nbsp;[Graph of the VIX: S&amp;P 500 volatility index (StockCharts)](https://stockcharts.com/h-sc/ui?s=vix)  \n•&amp;nbsp;[Graph of VX Futures Term Structure (Trading Volatility)](http://www.tradingvolatility.net/p/datasourceurldocs.html)  \n•&amp;nbsp;[A selected list of option chain &amp; option data websites](https://www.reddit.com/r/options/wiki/faq/pages/data_sources)  \n•&amp;nbsp;[Options on Futures (CME Group)](https://www.cmegroup.com/education/files/options-on-futures-brochure.pdf)  \n•&amp;nbsp;[Selected calendars of economic reports and events](https://www.reddit.com/r/options/wiki/faq/pages/calendars)  \n•&amp;nbsp;[An incomplete list of international brokers trading USA (and European)  options](https://www.reddit.com/r/options/wiki/faq/pages/brokers/)\n\n---\n\nPrevious weeks' Option Questions Safe Haven threads.\n  \n[Complete archive: 2018, 2019, 2020, 2021](https://www.reddit.com/r/options/wiki/faq/archive/safe_haven_2021)\n\n---",
        "subreddit": "options",
        "title": "Options Questions Safe Haven Thread | Aug 09-15 2021",
        "url": "https://www.reddit.com/r/options/comments/p0td5f/options_questions_safe_haven_thread_aug_0915_2021/",
        "created": 1628508477.0
    },
    {
        "author": "redtexture",
        "created_utc": 1627901847,
        "id": "owc4fj",
        "num_comments": 684,
        "num_crossposts": 0,
        "selftext": "For the options questions you wanted to ask, but were afraid to.  \n**There are no stupid questions, only dumb answers.**  &amp;nbsp;  **Fire away.**  \nThis project succeeds via thoughtful sharing of knowledge.  \n**You, too, are invited to respond to these questions.**  \nThis is a weekly rotation with past threads linked below.\n\n----\n\n###**BEFORE POSTING, PLEASE REVIEW THE BELOW LIST OF FREQUENT ANSWERS.**   [.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)\n\n---\n\n**Don't exercise your (long) options for stock!**   \n**Exercising throws away [extrinsic value](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value) that selling harvests.**  \n**Simply sell your (long) options, to close the position, for a gain or loss.**  \n**Your breakeven is the cost of your option when you are selling.**  \n**If exercising (a call), your breakeven is the strike price plus the debit cost to enter the position.**  \nFurther reading:   \n**[Monday School: Exercise and Expiration are not what you think they are.](https://www.reddit.com/r/options/comments/m5r8mi/monday_school_exercise_and_expiration_are_not/)**  \n\n---\n\n**Key informational links**  \n•&amp;nbsp;[Options FAQ / Wiki: Frequent Answers to Questions](https://www.reddit.com/r/options/wiki/faq)  \n•&amp;nbsp;[Options Toolbox Links / Wiki](https://www.reddit.com/r/options/wiki/toolbox/links)  \n•&amp;nbsp;[Options Glossary](https://www.optionseducation.org/referencelibrary/optionsglossary)   \n•&amp;nbsp;[List of Recommended Options Books](https://www.reddit.com/r/options/comments/8qfs14/options_book_list_review_of_all_books_that_helped/)    \n•&amp;nbsp;[Introduction to Options (The Options Playbook)](https://www.optionsplaybook.com/options-introduction/)  \n•&amp;nbsp;[The complete r/options side-bar informational links (made visible for mobile app users.)](https://www.reddit.com/r/options/about/sidebar)  \n•&amp;nbsp;[Characteristics and Risks of Standardized Options (Options Clearing Corporation)](\nhttps://www.theocc.com/about/publications/character-risks.jsp)  \n\n[.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)\n\n ----\n\n**Getting started in options**   \n•&amp;nbsp;[Calls and puts, long and short, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/basics)   \n•&amp;nbsp;[Options Basics (begals)](https://www.reddit.com/r/options/comments/gh9vpl/options_basics/)  \n•&amp;nbsp;[Exercise &amp; Assignment - A Guide (ScottishTrader)](https://www.reddit.com/r/options/wiki/faq/pages/exercise)  \n•&amp;nbsp;[Why Options Are Rarely Exercised - Chris Butler - Project Option (18 minutes)](https://www.youtube.com/watch?v=PsZsqiBFnmo)  \n•&amp;nbsp;[I just made (or lost) $___. Should I close the trade? (Redtexture)](https://www.reddit.com/r/options/comments/eunnko/noob_safe_haven_thread_jan_27_feb_02_2020/fg6jjjz/)    \n•&amp;nbsp;[Disclose option position details, for a useful response](https://www.reddit.com/r/options/wiki/faq/pages/trade_details)  \n•&amp;nbsp;[OptionAlpha Trading and Options Handbook](https://optionalpha.com/handbook)   \n\n---\n\n**Introductory Trading Commentary**   \n&amp;nbsp;&amp;nbsp;**Strike Price**   \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Options Basics: How to Pick the Right Strike Price (Elvis Picardo - Investopedia)](https://www.investopedia.com/articles/active-trading/021014/options-basics-how-pick-right-strike-price.asp)  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[High Probability Options Trading Defined (Kirk DuPlessis, Option Alpha)](https://www.youtube.com/watch?v=DcWHh2co80M)   \n&amp;nbsp;&amp;nbsp;**Breakeven**  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Your break-even (at expiration) isn't as important as you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/m0m7at/monday_school_your_breakeven_isnt_as_important_as/)  \n&amp;nbsp;&amp;nbsp;**Expiration**  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Options Expiration &amp; Assignment (Option Alpha)](https://www.youtube.com/watch?v=OnUsu1y1W9w)    \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Expiration times and dates (Investopedia)](https://www.investopedia.com/terms/e/expiration-time.asp)  \n&amp;nbsp;&amp;nbsp;**Greeks**  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Options Pricing &amp; The Greeks (Option Alpha) (30 minutes)](https://www.youtube.com/watch?v=kCJcEOYuuII)  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Options Greeks (captut)](https://www.reddit.com/r/options/comments/hl8i2n/option_greeks_101)  \n&amp;nbsp;&amp;nbsp;**Trading and Strategy**  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Common mistakes and useful advice for new options traders (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_common_mistakes_and_useful_advice_for__new_options_traders)  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Common Intra-Day Stock Market Patterns - (Cory Mitchell - The Balance)](https://www.thebalance.com/common-intra-day-stock-market-patterns-1031456)  \n\n---\n\n**Managing Trades**  \n•&amp;nbsp;[Managing long calls - a summary (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/managing_long_calls)  \n•&amp;nbsp;[The diagonal calendar spread, misnamed as the \"poor man's covered call\" (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/diagonal_calendars)  \n•&amp;nbsp;[Selected Option Positions and Trade Management (Wiki)](https://www.reddit.com/r/options/wiki/faq/pages/positions)  \n\n**Why did my options lose value when the stock price moved  favorably?**  \n•&amp;nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value)\n      \n**Trade planning, risk reduction and trade size**  \n•&amp;nbsp;[Exit-first trade planning, and a risk-reduction checklist (Redtexture)](https://www.reddit.com/r/options/comments/9at2fu/noob_thread_aug_26_sept_1/e4ywq0u/)  \n•&amp;nbsp;[Monday School: A trade plan is more important than you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/mpk6yf/monday_school_a_trade_plan_is_more_important_than/)  \n•&amp;nbsp;[Applying Expected Value Concepts to Option Investing (Select Options)](http://www.selectoptions.com/Edu-Expected-Result)  \n•&amp;nbsp;[Risk Management, or How to Not Lose Your House (boii0708) (March 6 2021)](https://www.reddit.com/r/options/comments/lyp1uc/risk_management_or_how_to_not_lose_your_house/)  \n•&amp;nbsp;[Trade Checklists and Guides (Option Alpha)](https://optionalpha.com/members/guides-checklists)  \n•&amp;nbsp;[Planning for trades to fail. (John Carter)  (at 90 seconds)](https://youtu.be/N5_OkdvPmUI?t=90)\n\n**Minimizing Bid-Ask Spreads (high-volume options are best)**   \n•&amp;nbsp;[Price discovery for wide bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/comments/9u8o7j/noob_safe_haven_thread_nov_0511_2018/e96eynd/)  \n•&amp;nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)\n\n**Closing out a trade**  \n•&amp;nbsp;[Most options positions are closed before expiration (Options Playbook)](https://www.optionsplaybook.com/options-introduction/closing-option-position)       \n•&amp;nbsp;[When to Exit Guide (Option Alpha)](https://web.archive.org/web/20201111230944/https://optionalpha.com/wp-content/uploads/2015/01/When-To-Exit-Guide.pdf)  \n•&amp;nbsp;[Risk to reward ratios change: a reason for early exit (Redtexture)](https://www.reddit.com/r/options/comments/hg8ce9/risk_to_reward_ratio_changes_over_the_life_of_an/)  \n•&amp;nbsp;[Close positions before expiration: TSLA decline after market close (PapaCharlie9) (September 11, 2020)](https://www.reddit.com/r/options/comments/ipqkua/fridays_tsla_lesson_close_positions_before/)  \n\n---\n\n**Options exchange operations and processes**  \nIncluding:     \n[Options Adjustments for Mergers, Stock Splits and Special dividends; Options Expiration creation; Strike Price creation; Trading Halts and Market Closings; Options Listing requirements;  Collateral Rules; List of Options Exchanges; Market Makers](https://www.reddit.com/r/options/wiki/faq/pages/exchange_operations)   \n\n**Miscellaneous**  \n•&amp;nbsp;[Graph of the VIX: S&amp;P 500 volatility index (StockCharts)](https://stockcharts.com/h-sc/ui?s=vix)  \n•&amp;nbsp;[Graph of VX Futures Term Structure (Trading Volatility)](http://www.tradingvolatility.net/p/datasourceurldocs.html)  \n•&amp;nbsp;[A selected list of option chain &amp; option data websites](https://www.reddit.com/r/options/wiki/faq/pages/data_sources)  \n•&amp;nbsp;[Options on Futures (CME Group)](https://www.cmegroup.com/education/files/options-on-futures-brochure.pdf)  \n•&amp;nbsp;[Selected calendars of economic reports and events](https://www.reddit.com/r/options/wiki/faq/pages/calendars)  \n•&amp;nbsp;[An incomplete list of international brokers trading USA (and European)  options](https://www.reddit.com/r/options/wiki/faq/pages/brokers/)\n\n---\n\nPrevious weeks' Option Questions Safe Haven threads.\n  \n[Complete archive: 2018, 2019, 2020, 2021](https://www.reddit.com/r/options/wiki/faq/archive/safe_haven_2021)\n\n---",
        "subreddit": "options",
        "title": "Options Questions Safe Haven Thread | Aug 02-08 2021",
        "url": "https://www.reddit.com/r/options/comments/owc4fj/options_questions_safe_haven_thread_aug_0208_2021/",
        "created": 1627930647.0
    },
    {
        "author": "c-los85",
        "created_utc": 1629485613,
        "id": "p8bhe6",
        "num_comments": 679,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Is this how you do it? My wife's boyfriend told me to buy weed...",
        "url": "https://i.redd.it/oih39z9t7ki71.jpg",
        "created": 1629514413.0
    },
    {
        "author": "auralvance",
        "created_utc": 1629720599,
        "id": "p9yif3",
        "num_comments": 671,
        "num_crossposts": 0,
        "selftext": "Both Q1 and Q2 earnings calls saw a massive increase in activity in the prior two weeks and then the same drop off and slow bleeding for the following two months. While there's no guarantee that this will repeat itself a third time, if you're not bag holding this is a great opportunity to gamble at a pre-earnings spike. At worse it'll probably keep trading sideways around the 150 mark for a while longer as it has a base and some support now. GME seems to have been forgotten while people chase shilled garbage that has had far worse returns in the last six months.\n\nhttps://i.imgur.com/Puq00Ys.png\n\nDisclaimer: I'm not a financial advisor and this is not financial advice. I don't hold any shares. Picking up some cheap calls to see what happens and how retarded you actually all are.",
        "subreddit": "wallstreetbets",
        "title": "GME REMINDER: We are less than three weeks out from the Q2 earnings call. April/May had the same FUD and low volume until earnings was announced and it exploded. This is your chance to get in before the ramp up.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p9yif3/gme_reminder_we_are_less_than_three_weeks_out/",
        "created": 1629749399.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1628242211,
        "id": "oz3a2y",
        "num_comments": 669,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia page](https://www.investopedia.com/fundamental-analysis-4689757/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp) and read [their PDF on the topic.](http://i.investopedia.com/inv/pdf/tutorials/fundamentalanalysis_intro.pdf)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Aug 06, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/oz3a2y/rstocks_daily_discussion_fundamentals_friday_aug/",
        "created": 1628271011.0
    },
    {
        "author": "MyFunGa",
        "created_utc": 1628194388,
        "id": "oyqr09",
        "num_comments": 662,
        "num_crossposts": 0,
        "selftext": "President Biden is set to announce his aim for 50% electric vehicles by 2030. Yahoo Finance’s Rick Newman shares the details.\n\n### Video Transcript\n\nAKIKO FUJITA: The Biden administration is setting ambitious targets to reduce the country's carbon footprint, calling for electric vehicles to make up half of all new US car sales by the end of this decade. Some climate activists, though, saying the goal doesn't address the urgency of the crisis. Let's bring in Yahoo Finance's Rick Newman, who is following this story for us.\n\nAnd Rick, you know, we're talking about 50% by the end of the decade. And yet, today, EVs only make up about 3% of new car sales. So how realistic is this?\n\nRICK NEWMAN: It depends on what the government does, honestly. If the industry were just left to itself, I don't think there's any way we would get to 50% of new vehicle market share by 2030. The cars are still more expensive than gas-powered cars. There's still range issues. But the Biden administration plans to do a lot to incentivize people to buy these vehicles.\n\nSo there's going to be billions of dollars for new charging stations. So there will be charging stations, in theory, wherever you might need one. That's in the bipartisan infrastructure bill that's now in Congress. Biden wants about $170 billion in addition to that. He wants new subsidies for anybody buying an electric vehicle, electrify school buses. He wants subsidies for building battery plants in the United States and all this kind of stuff.\n\nSo this-- these are the reasons that the auto industry really seems quite happy to go along with this. Because they're going to-- they think they're going to get so much funding from the federal government to help them reach this target. By the way, we should point out to everybody watching, this is a target not a requirement. There's no penalty for any automaker that does not get to 50% of all new vehicle sales being electric by 2030. That's just the goal.\n\nAKIKO FUJITA: And Rick, you've also got some additional measures here laid out in that plan, including limits on tailpipe emissions. I mean, walk me through how significant of a bump that is. Because we all - there were standards set under the Obama administration. The Trump administration rolled that back. Where do things stand now?\n\nRICK NEWMAN: We don't know exactly. Because Biden has not yet said what he plans to do on that. I mean, just the very briefest history here, Obama, in 2012, raised fuel efficiency standards really aggressively. That would have required about a 5% improvement in fuel economy every year. And then Trump came in, and he slashed that down to about a 1.5% improvement in fuel economy every year.\n\nNow the reporting is that Biden is going to split the difference basically. He's going to raise fuel economy standards above where Trump left them to what would amount to about 3.7% increase in fuel economy every year. But that- they have not announced that yet. And that takes a long time. That is the-- that's changing a federal regulation, which has to go through months and months of review and things like that.\n\nAnd I think one of the things we're probably going to hear the Biden administration say, well, yeah, his guideline for fuel economy is not as aggressive as Obama's was back in 2012. But if we have all these new electric vehicles on the road, that is something that we didn't have really back in 2012. So that should make it easier to reach the 3.7% annual increase, or whatever it turns out to be. But that is down the road still.\n\nAKIKO FUJITA: OK. Rick Newman, staying on top of the details. Of course, you can read his story on YahooFinance.com as well. Thanks so much for that, Rick.",
        "subreddit": "stocks",
        "title": "Biden to push for 50% electric vehicles by 2030",
        "url": "https://www.reddit.com/r/stocks/comments/oyqr09/biden_to_push_for_50_electric_vehicles_by_2030/",
        "created": 1628223188.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1629365412,
        "id": "p7bitj",
        "num_comments": 655,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme and/or [post your arguments against options here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Options Trading Thursday - Aug 19, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/p7bitj/rstocks_daily_discussion_options_trading_thursday/",
        "created": 1629394212.0
    },
    {
        "author": "ArnoldisKing",
        "created_utc": 1629950806,
        "id": "pbrve2",
        "num_comments": 653,
        "num_crossposts": 0,
        "selftext": "i just started a small position in OTLY today and will buy more if it drops to 14/15 and then assess from there. \n\nDoes anyone here have stocks that they feel are undervalued/substantially undervalued? (i dont think otly is substantially given its market cap, but still think it will grow over time)\n\nObv will do my own DD on any recommendations. thanks",
        "subreddit": "stocks",
        "title": "what stocks do you see as undervalued at the moment?",
        "url": "https://www.reddit.com/r/stocks/comments/pbrve2/what_stocks_do_you_see_as_undervalued_at_the/",
        "created": 1629979606.0
    },
    {
        "author": "skysmoker",
        "created_utc": 1629514163,
        "id": "p8jkgh",
        "num_comments": 653,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2021/08/21/proposition-22-court-rules-california-ride-hailing-law-unconstitutional.html\n\nA California judge on Friday ruled that a 2020 ballot measure that exempted ride-share and food delivery drivers from a state labor law is unconstitutional as it infringed on the legislature’s power to set standards at the workplace.\n\nProposition 22 is unconstitutional as “it limits the power of a future Legislature to define app-based drivers as workers subject to workers’ compensation law”, which makes the entire ballot measure “unenforceable”, Alameda County Superior Court Judge Frank Roesch wrote in the ruling.\n\nGig economy companies including Uber, Lyft, Doordash and Instacart were pushing to keep drivers’ independent contractor status, albeit with additional benefits.\n\nThe ballot measure was meant to cement app-based food delivery and ride-hail drivers’ status as independent contractors, not employees.\n\nKnown as Proposition 22, it marked the culmination of years of legal and legislative wrangling over a business model that has introduced millions of people to the convenience of ordering food or a ride with the push of a button.",
        "subreddit": "investing",
        "title": "[CNBC] California superior judge on late Friday ruled that a 2020 ballot measure, Prop 22, that exempted ride-share and food delivery drivers from a state labor law is unconstitutional as it infringed on the legislature’s power to set standards at the workplace.",
        "url": "https://www.reddit.com/r/investing/comments/p8jkgh/cnbc_california_superior_judge_on_late_friday/",
        "created": 1629542963.0
    },
    {
        "author": "LegalAdvantage2",
        "created_utc": 1628637799,
        "id": "p20w1c",
        "num_comments": 648,
        "num_crossposts": 0,
        "selftext": "Thinking about taken a personal loan out for 10k and doubling up with margin to invest in solid growth stocks and dividend stocks. I know it’s inherently risky to invest borrowed money but I’m only 21 and if I lost it all it wouldn’t be the end of the world but I could have some nice returns if I invested wisely. My plan is to dump 5k into uwmc (not sure if I should wait til earnings or after) I’m leaning towards half now and half after earning just incase it tanks for some reason. Then leaving 5k for options. My strategy for options is to wait for red days and buy the intraday dip with calls at least a month out and sell shortly after. This strategy has worked well for me in the past. Recently did it with amd but should of held that for longer. Any reasons why i shouldn’t do this?",
        "subreddit": "wallstreetbets",
        "title": "Is it smart to get personal loans and invest a portion to help pay back interest and part of the loan?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p20w1c/is_it_smart_to_get_personal_loans_and_invest_a/",
        "created": 1628666599.0
    },
    {
        "author": "lurkingsince2006",
        "created_utc": 1629756927,
        "id": "paa5i3",
        "num_comments": 647,
        "num_crossposts": 0,
        "selftext": "For starters:\n\n* This should not be construed as investment advice, and since you are here, you should not be construed as an investor.\n* Seriously, I've been wrong many times and 100k is an amount I'm willing to walk away from.\n* I'm making some guesses here (professionals, which I am not, call them \"forecasts\") on what the company and the stock will do.   You should view them as wild guesses.\n* I'm long SLQT via a basket of options.   Something something.  Ok, I think I've exceeded the attention span of the average ape, so I will begin my analysis.\n\n# Background on SLQT\n\nSelectQuote (SLQT) is an insurance agency that specializes in selling healthcare to seniors, life insurance and home/auto insurance.   Yeah, I know, it's not a mattress company.\n\nOne of your key drivers in a business like this is your ability to attract and retain licensed insurance agents as most of these policies are sold over the phone.  Retention is key as most revenue happens during the annual October 15 - December 7 Medicare open enrollment period.   During the rest of the year, the goal is to keep you agents happy and productive any way you can in order to have them ready for peak season, as agents are your limiting factor.\n\nAugust 25th PM is annual earnings, which means we get our annual forecast as well.  SQLT's fiscal year ends June 30.\n\n# May 3 Pharmacy Announcement\n\nIMO, what makes this play interesting is that the core business in undervalued AND there is a new adjunct business (pharmacy) that should power a solid FY2022 that was announced on May 3.   There was a [press release](https://ir.selectquote.com/news/news-details/2021/SelectQuote-Announces-Expansion-Into-Healthcare-Services-With-Launch-of-Population-Health/default.aspx), [an investor presentation](https://s23.q4cdn.com/545595037/files/doc_presentation/2021/05/Population-Health-Launch-Slides-v30-FINAL.pdf), and [an investor conference call](https://event.on24.com/wcc/r/3106081/0357ACC54E4B22493CE855E7B85D87DF).   I highly recommend you review all three.   All of this should become apparent with annual guidance in a few days.\n\nSlide 19 - May 3 Investor Presentation:\n\n[You can fit so many Boomers in this pharmacy!](https://preview.redd.it/gcu3hxeel6j71.png?width=942&amp;format=png&amp;auto=webp&amp;s=789578151237042350f1b70d5492e82996e73843)\n\nSlide 20 - May 3 Investor Presentation:\n\n[Numbers, numbers, numbers](https://preview.redd.it/0qzgpsjil6j71.png?width=944&amp;format=png&amp;auto=webp&amp;s=e95ba2dcb177b82de31330d189e1f86bbeb46310)\n\nWe learn from the investor conference call and the recent earnings call that SLQT had an 80% opt-in rate and 30,000 members sign up for Population Health in about the first month of operations.   We also learned that they are going back and contacting previous sales with this initiative with an 85% successful contact rate, in addition to pitching Population Health to current sales (500k policies per year per slide 19).   Population Health is a free advisory service that they use to advise people to use their pharmacy:  SelectRx.\n\nI took their low estimate of 50k members using the pharmacy and straight lined it to 100k members over FY 2022 to create my own estimate of direct incremental impact to the business from their pharmacy.   This assumes a 10% attach rate growing to a 20% attach rate on 500k policies sold--far lower than the 80% of people opting into Population Health.   We also don't know how successful their historical outreach will be in terms of pharmacy conversions (they only stated an 85% contact rate--which is way high... old people have nothing better to do than answer their phones...).\n\n&amp;#x200B;\n\n[Drug dealing is very profitable.](https://preview.redd.it/djhg13ell6j71.png?width=582&amp;format=png&amp;auto=webp&amp;s=b8041055a6a42d6b6aec395958c68230e030dc9b)\n\nSo, I'm forecasting a 320.4M increase in revenue due to the pharmacy and 32.4M increase in EBITDA, which in this case should largely flow to net income.  I add these to my forecast for the core business.\n\n# Core Business\n\nFY 2022 Quarterly Forecast - Low Growth\n\n[My \\\\\"low\\\\\" forecast](https://preview.redd.it/s8cqaq0tl6j71.png?width=1196&amp;format=png&amp;auto=webp&amp;s=f84ec83409bf7e48c5fdbaf6c2aa7d8b4e2b2dc4)\n\nFY 2022 Quarterly Forecast - High Growth\n\n[My \\\\\"high\\\\\" forecast](https://preview.redd.it/zyds77gvl6j71.png?width=1196&amp;format=png&amp;auto=webp&amp;s=1f858b842edc4a0b32cccb556db3a6ff39f0293a)\n\nThe core business has been growing at quite a clip.  As of this moment I'm writing, the stock is trading at $13.57, which is a measly 16.35x trailing twelve months Net Income, when you assume the midpoint of guidance for calendar quarter Q2 2021 (which is FY Q4) that was provided on the last earnings call.  This is very intriguing when you look at recent growth rates of the business over the previous quarters (90.54% YoY, 103.22% YoY, and 79.62% YoY).\n\nThe yellow highlight is a discrepancy I found between reported EPS (which was reported massively negative) and net income (which was reported massively positive).  Since we don't believe in math or fundamentals around here, I simply put the EPS based upon the Net Income divided by shares reported and highlighted it in yellow to make me look like I have something intelligent to say about it, but I really don't.  I'm going to pull a Biden and say that something that happened 4 or 5 quarters ago just doesn't matter.\n\nThat being said, the reason for the drop after the May earnings call (the May pharmacy announcement did pretty much nothing to the price action) was the guidance that showed deceleration in growth to 27.70% for Q2 2021 CY (the number in a red box).   We had a second drop off in the last few weeks when GoHealth had a train wreck of an earnings call.   I'm betting SLQT goes the other way, especially when you consider the guidance for FY 2022.\n\n&amp;#x200B;\n\n[My FY2022 range of forecasts](https://preview.redd.it/1zuypbgpl6j71.png?width=1006&amp;format=png&amp;auto=webp&amp;s=69b93f829c8969fa67d258380f67da8d20ebe67d)\n\nClearly to get an understanding of where this business is going, we need to accurately predict YoY sales growth on a quarterly basis for the core business (YoY by quarter is going to be a decent representation given the seasonal nature of insurance sales).\n\nI proposed two different sales growth scenarios on the core business:\n\n1. On the high side, growth decelerates to 80%, 80%, 80%, &amp; 25% (a strong Q3 will be an anomaly due to a special enrollment period that ended August 15, but it is present nonetheless in the forecast)\n2. On the low side, the QoQ growth deceleration into CYQ2 represents the beginning of the collapse in growth:  25% YoY for all four quarters.\n\nIn both cases, these are forecasts for the core business of insurance sales.   I layer on pharmacy sales based upon the forecasts provided by the company on the May 3rd presentation, but rather than taking a midpoint, I straight line member growth over the year between the low to the high, and I assume the lower number of 6 Rx's per patient.   For Pharmacy gross margins, I use the forecasted ratio (the worst one).   I assume no marketing, as this is what they said in their pharmacy call.\n\n# Stock Price Predictions\n\nYou can see from the above chart, if we keep the low P/E ratio of 16.35x for a fast growing company, we end up with a price target between $18.74 to $28.45 based upon forecasted Net Income.  My low estimate of $1.15 is lower than the [Marketbeat consensus](https://www.marketbeat.com/stocks/NYSE/SLQT/earnings/) of $1.23 for next year as well.\n\nA few key points on my prediction:\n\n* I believe that market will adjust the price of this stock abruptly in the next few days due to FY2022 earnings guidance coming out and then gradually over the coming quarter.\n* I believe the market largely ignored SLQT when it started discussing pharmacy on May 3rd and the conference call a few days later.   This is a key strategic push for them, and according to the CFO on the last call, is one of three key drivers for FY22 (in addition to LHA and Senior).\n* I believe the market has mispriced the core business as well.   The GoHealth driven drop was a bad sympathy play that created a great entry.   Without that drop, the market was pricing in a total collapse in the growth vector of this company, which I just don't believe.    The insurance sales market is very lumpy with its seasonality.   Some quarters aren't going to grow as strong as others due to timing of open enrollment periods and market potential (or, in better words, lack thereof).   I expect previously strong growth quarters to decelerate, but not so drastically as a reduction to 25% YoY across the board.\n\n# My Positions\n\n[Via Excel](https://preview.redd.it/9w2pi3m3m6j71.png?width=325&amp;format=png&amp;auto=webp&amp;s=0d01480c5e8335757acc7677aa28bd5009f606a0)\n\n*Processing img 649k93xem6j71...*\n\nI played my positions according to my thesis.  I believe we have an immediate correction back up to where we were before GoHealth.   And then I believe we have a gradual rise to $20 over the coming quarter.\n\nI bought some Sep 20c as well because I'm a degenerate.",
        "subreddit": "wallstreetbets",
        "title": "$500k bet on SLQT. Here's why.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/paa5i3/500k_bet_on_slqt_heres_why/",
        "created": 1629785727.0
    },
    {
        "author": "16431879196842",
        "created_utc": 1630073070,
        "id": "pco0jp",
        "num_comments": 645,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2021/08/16/sp-500-doubles-from-its-pandemic-bottom-marking-the-fastest-bull-market-rally-since-wwii.html\n\n\nThe S&amp;P 500 has doubled on a closing basis from its Covid trough of 2,237.40 on March 23.\n\nIt took the market 354 trading days to get there, marking the fastest bull market doubling off a bottom, according to a CNBC analysis of data from S&amp;P Dow Jones Indices going back to WWII.\n\nOn average, it takes bull markets more than 1,000 trading days to reach that milestone, the analysis showed.",
        "subreddit": "investing",
        "title": "S&amp;P 500 doubles from its pandemic bottom, marking the fastest bull market rally since WWII",
        "url": "https://www.reddit.com/r/investing/comments/pco0jp/sp_500_doubles_from_its_pandemic_bottom_marking/",
        "created": 1630101870.0
    },
    {
        "author": "joeroganthumbhead",
        "created_utc": 1629939504,
        "id": "pbornw",
        "num_comments": 632,
        "num_crossposts": 0,
        "selftext": "My dad has a $5 million portfolio and would like to sell stocks to buy a home. Should he sell like $1 million worth to pay for it in cash or just take out enough for a 20% down and pay off the monthly mortgage?\n\nHe does not want to pay for an advisor because he thinks they usually don’t give great advice and they’re expensive.",
        "subreddit": "stocks",
        "title": "How to buy home with stocks (retirement)",
        "url": "https://www.reddit.com/r/stocks/comments/pbornw/how_to_buy_home_with_stocks_retirement/",
        "created": 1629968304.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1629104426,
        "id": "p5cb6k",
        "num_comments": 632,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 16, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p5cb6k/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1629133226.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1629277221,
        "id": "p6neqt",
        "num_comments": 610,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 18, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p6neqt/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1629306021.0
    },
    {
        "author": "PennyBotWeekly",
        "created_utc": 1630034710,
        "id": "pcf5cy",
        "num_comments": 608,
        "num_crossposts": 0,
        "selftext": " Talk about your plays today or things you are on the lookout for. This is where you belong if your comment includes a ticker.\n\n*keep it civil please*",
        "subreddit": "pennystocks",
        "title": "Daily Plays August 27, 2021",
        "url": "https://www.reddit.com/r/pennystocks/comments/pcf5cy/daily_plays_august_27_2021/",
        "created": 1630063510.0
    },
    {
        "author": "nams0",
        "created_utc": 1629247647,
        "id": "p6gk2y",
        "num_comments": 606,
        "num_crossposts": 0,
        "selftext": "&gt;Palantir Technologies Inc. said it’s preparing for another “black swan event” by stockpiling gold bars and inviting customers to pay for its data analysis software in gold.\n\n&gt;The company spent $50.7 million this month on gold, part of an unusual investment strategy that also includes startups, blank-check companies and possibly [redacted]. Palantir had previously said it would accept [redacted] as a form of payment before adding precious metals more recently.\n\n&gt;A spokeswoman for Palantir said no one has yet paid in either [redacted] or gold. Accepting nontraditional currencies “reflects more of a worldview,” Shyam Sankar, the chief operating officer, said in an interview. “You have to be prepared for a future with more black swan events.”\n\n&gt;The gold purchase was buried in a securities filing last week for its quarterly financial results and reported earlier this week by Barron’s. The acceptance of gold as a form of payment hasn’t been previously reported.\n\n&gt;Palantir’s 100-ounce gold bars will be kept in a secure location in the northeastern U.S., according to the filing. “The company is able to take physical possession of the gold bars stored at the facility at any time with reasonable notice,” Palantir wrote.\n\n&gt;Palantir, co-founded by the technology billionaire Peter Thiel and Chief Executive Officer Alex Karp, makes software used by governments and businesses. It fashions itself as a company of free thinkers. Palantir relocated to Denver last year and mocked its peers in Silicon Valley on the way out. In the interview, Shyam compared Palantir’s culture with an “artist colony,” rather than a tech company churning out software on an assembly line.\n\n&gt;Governments have strongly embraced Palantir software to help them make sense of the coronavirus pandemic, the current so-called black swan, a random and unpredictable event.\n\n&gt;The company has some $2.3 billion in cash and is exploring creative uses for that money. Palantir said in May that it was considering investing in [redacted]. And it’s taking stakes in startups that are customers of Palantir software, an approach that helped buoy sales results in the second quarter.\n\nhttps://www.bloomberg.com/news/articles/2021-08-17/palantir-buys-51-million-in-gold-bars-accepts-payment-in-gold\n\nThought this was quite interesting. Palantir is loaded with data, I wonder what they know that we don't for them to start buying and accepting actual gold as a hedge against a black swan event they seem to think is going to happen.",
        "subreddit": "stocks",
        "title": "Palantir Buys Gold Bars as Hedge Against ‘Black Swan Event’",
        "url": "https://www.reddit.com/r/stocks/comments/p6gk2y/palantir_buys_gold_bars_as_hedge_against_black/",
        "created": 1629276447.0
    },
    {
        "author": "Juicy_TC",
        "created_utc": 1628973465,
        "id": "p4fn0q",
        "num_comments": 605,
        "num_crossposts": 0,
        "selftext": "CEOs were at my hometown UPS hub the other day. A driver died outside their facility after finishing his route. There’s recorded radio transmission of him telling dispatch “I’m not going to be able to make it” and being told to finish his route. \n\nDriver finishes route parks truck at UPS wanders a hundred meters away, vomits, falls, literally dies in a ditch. (All the classic signs of heat exhaustion we as Texans are warned to be weary of, the downfall to it is once heat exhaustion sets in the disorientation is very intense) \n\nI witnessed all local news crews on site that morning, I witnessed the CEO of UPS and his entourage arrive. Then everyone left, and it’s like this guy never existed. \n\nI questioned each of the local news stations, showed my preferred one a photo of their truck at UPS and was told there is no story to tell there. \n\nWhy this is relevant to wall street bets…\n\nGoogle and research the social media back lash a few years ago regarding UPS does not provide vehicles with an AC. Match that to what happened to stock prices at that time. Because it’s looking like they’re trying to cover this up now to prevent the same thing from happening again, on a much larger scale. \n\nIt’s all very suspect, and the family is livid that it’s being downplayed",
        "subreddit": "wallstreetbets",
        "title": "Pay attention to UPS stock next week…",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p4fn0q/pay_attention_to_ups_stock_next_week/",
        "created": 1629002265.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1628661032,
        "id": "p26zj4",
        "num_comments": 603,
        "num_crossposts": 0,
        "selftext": "Everyone knows the market is rigged, but I think I've figured out a way to beat it.\n\nFirst off, you need to change your career. If you're fortunate enough to not be living off chicken tendies in your mom's basement, you are either gainfully employed, or have some crappy job in retail. Either way, you need to adjust. For the former, you will have to downgrade your career, and for the latter you are probably SOL either way so maybe stop reading now.\n\nNow you need to become a teacher. But not just any teacher. You need to get into a nice Manhattan private school at around grades 5 through 8. Now once you're teaching these little rich kids Social Studies or what have you, you introduce the \"stock market\" game. We've all heard of it or done it when we were kids in school. You give the kids paper trading accounts, and whoever has the most money after a few months, wins.\n\nNow the catch is that they all have hedge fund mommy and daddys that will be giving them sick stock tips so they win the candy jar at the end of the game. Now you take these stock tips from your students and fully leverage that on options with your measly teaching salary.\n\nAnd that is how you beat the market.",
        "subreddit": "wallstreetbets",
        "title": "How to beat the market",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p26zj4/how_to_beat_the_market/",
        "created": 1628689832.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1628155819,
        "id": "oye0n5",
        "num_comments": 600,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme and/or [post your arguments against options here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Options Trading Thursday - Aug 05, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/oye0n5/rstocks_daily_discussion_options_trading_thursday/",
        "created": 1628184619.0
    },
    {
        "author": "relam10",
        "created_utc": 1630397973,
        "id": "pf1lmc",
        "num_comments": 588,
        "num_crossposts": 0,
        "selftext": "Yesterday it gained popularity again thanks to a new reddit post and is currently in the top 3 trends:\n\n \n\nhttps://preview.redd.it/p33hk6ilhnk71.png?width=1432&amp;format=png&amp;auto=webp&amp;s=046ca3e0a12b67ad135921d8644051cd3a60ebd5\n\nTo put some context, I still see a lot of ignorance about this company.\n\nToo many people still think they are RGB and some peripherals (mouse, keyboard and headphones).\n\nThe truth is that corsair is a video game holding company. They do pretty much everything.\n\nJust FYI, corsair has acquired several companies the last 3 years: ScuffGaming, Origin, GamersSensei, Elgato, Visuals By Impulse....\n\nAll that's left is to enter the mobile gaming world and they will literally dominate the entire gaming market. And seeing their pace of acquisitions, I'm sure they will sooner or later.\n\nThe company is focusing lately on the streaming world (elgato, Visuals By Impulse), which as I'm sure you all know, is growing at an unstoppable pace, competing head to head with traditional television. It is only a matter of time before it becomes the most popular way to consume content.\n\nIt is also looking to improve its service and subscription revenues (ICUE).\n\nIn the last few months alone they have launched 84 products, shipped 33 million around the world and acquired 3 new companies.\n\nhttps://preview.redd.it/1pfyp61vink71.png?width=1865&amp;format=png&amp;auto=webp&amp;s=551d205ac2be82b9957d72b3122eea1feb340bef\n\nThey are expanding very aggressively, and currently sell products in 26 categories:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bgivrap5jnk71.png?width=2126&amp;format=png&amp;auto=webp&amp;s=54decbc4db9edf04e461d8c399cb91ec3898fcdd\n\nThey have some of the largest communities of all video game brands:\n\nhttps://preview.redd.it/n5tj29fajnk71.png?width=2153&amp;format=png&amp;auto=webp&amp;s=cd9a8f86b39f82507fcc676535f9c711f21b829f\n\nAll of its segments are growing at an astounding rate, but as you can see, the content creators segment is simply incredible. Elgato has a virtual monopoly in the capture, spotlight, streamdeck, green screen and they have just launched a facecam that is getting very good sales.\n\nhttps://preview.redd.it/3z1m6txgjnk71.png?width=2224&amp;format=png&amp;auto=webp&amp;s=176d3133b42aeaafbca8e71adee6fd8b57e84890\n\nThese spectacular results have been achieved at a rather adverse time.\n\nShipping costs have risen dramatically due to inflation, especially for container shipments from China.\n\nChip shortages have also been a big problem and, let's not forget, corsair has a leading position in ram memory, power supplies, magnetic levitation fans, RGB... and nowadays it is very expensive to buy a graphics card. Which has prevented many people from building their own computers.\n\nWe also come from a period of pandemic, many people thought that its sales were going to plummet, but in spite of all this, it has produced very good results.\n\n TL;DR \n\nhttps://preview.redd.it/bficnarjknk71.png?width=919&amp;format=png&amp;auto=webp&amp;s=b1f537f44e3f0af2704073175ea1b73c87bc947a\n\nI do have 500 Shares and few 9/17 30 Calls.",
        "subreddit": "wallstreetbets",
        "title": "CRSR: the sleeping giant, round two",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pf1lmc/crsr_the_sleeping_giant_round_two/",
        "created": 1630426773.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1630056615,
        "id": "pcjysj",
        "num_comments": 577,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on fundamentals, but if fundamentals aren't your thing then just ignore the theme and/or [post your arguments against fundamentals here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nMost fundamentals are updated every 3 months due to the fact that corporations release earnings reports every quarter, so traders are always speculating at what those earnings will say, and investors may change the size of their holdings based on those reports.  Expect a lot of volatility around earnings, but it usually doesn't matter if you're holding long term, but keep in mind the importance of earnings reports because a trend of declining earnings or a decline in some other fundamental will drive the stock down over the long term as well.\n\nSee the following word cloud and click through for the wiki:\n\n[Market Cap - Shares Outstanding - Volume - Dividend - EPS - P/E Ratio - EPS Q/Q - PEG - Sales Q/Q - Return on Assets (ROA) - Return on Equity (ROE) - BETA - SMA - quarterly earnings](https://www.reddit.com/r/stocks/wiki/fundamentals-themed-post)\n\nIf you have a basic question, for example \"what is EBITDA,\" then google \"investopedia EBITDA\" and click the Investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nUseful links:\n\n* [Investopedia page](https://www.investopedia.com/fundamental-analysis-4689757/) on fundamental analysis including [Discounted Cash Flow](https://www.investopedia.com/university/dcf/) analysis; see [definition here](https://www.investopedia.com/terms/d/dcf.asp) and read [their PDF on the topic.](http://i.investopedia.com/inv/pdf/tutorials/fundamentalanalysis_intro.pdf)\n* [FINVIZ](https://finviz.com/quote.ashx?t=aapl) for fundamental data, charts, and aggregated news\n* [Earnings Whisper](https://www.earningswhispers.com/stocks/aapl) for earnings details\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Fundamentals Friday Aug 27, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/pcjysj/rstocks_daily_discussion_fundamentals_friday_aug/",
        "created": 1630085415.0
    },
    {
        "author": "Araphoren",
        "created_utc": 1630349286,
        "id": "peofan",
        "num_comments": 576,
        "num_crossposts": 0,
        "selftext": "Hello again.\n\nUp here is a tightly wound time bomb. TTCF (Tattooed Chef) is a wildly asymmetric bet with an options IV that is drastically underpricing the risk of trapped shorts closing one another out with a fun catch: the higher IV goes, the more shorts lose.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5dlslsp7jjk71.png?width=500&amp;format=png&amp;auto=webp&amp;s=03c0ffec247a290c1704833f7b5a76e008e3acbf\n\nI’ve been watching this the past 2 weeks, and now have some hard examples of shorts using illegal methods of delaying the inevitable: an explosive move up from broker close outs and spiking short constraints. I’m confident in the move happening imminently, so will hit out the hard points asap.\n\n**Quick summary below on TTCF**\n\n\\- **Outstanding revenue** **growth** (up 52% yoy) outweighed tax liability loss for Q2 \n\n\\- **Short borrow rate spike to 200% to 300%** is one of the highest rates I’ve ever seen\n\n\\- **Short interest at 61%** of actionable float &amp; 37% of entire float\n\n\\- **FTD panic reset-the-clocks** are rampant \n\n\\- **SEC Reg SHO List** limits broker-short deal ability\n\n\\- **Float constrained** to 24mil \n\n\\- **Increasing IV and price catalyst** for short capitulation\n\n&amp;#x200B;\n\n[They done messed up](https://preview.redd.it/hjn1dtv8jjk71.png?width=768&amp;format=png&amp;auto=webp&amp;s=6b934fcf473f1a6ea9c4b7d185dae4832132d396)\n\n# Part 1 about\n\nTattooed chef creates sustainable vegetarian/vegan foods and sells them to various chains and grocery stores. Think Blue Apron for millennials without delivery costs. Good food, better profits. [From their 10Q](https://sec.report/Document/0001213900-21-042632/), They’re estimating close to $240mil in revenue for 2021, have $140mil of cash on hand (read: no dilution concerns), and have a gross margin of 13%. No wonder institutions increased holdings to nearly 20%. Honestly, a pretty solid company; CEO’s a cool dude, too.\n\n&amp;#x200B;\n\n[Bloomberg Institution rates](https://preview.redd.it/pw0mgjyajjk71.png?width=1841&amp;format=png&amp;auto=webp&amp;s=f32dd637515fe209c95b69688740ca4ec5c87e72)\n\nSo why the big drop? \n\nTurns out there was a tax deferment payment (read: loss) of $47.22mil they disclosed on Q2 ER on Aug 12. My theory is shorts were happening for a much larger drop, but also turns out the market didn’t care since the company is reporting solid growth and will continue to. \n\nEven after insiders were allowed to sell in April, the CEO only dropped 2.5% of his entire stake. \n\nCue: buy the fucking dip and tightening of the float.\n\n&amp;#x200B;\n\n[High frequency also price levels based on gaps\\/hedging\\/stops](https://preview.redd.it/7grbkn4djjk71.jpg?width=2732&amp;format=pjpg&amp;auto=webp&amp;s=6c936ba8d85ab9e9138345ac6e926e0a3a396c94)\n\nHere’s where it gets fun, during the small rally last week back to balance, cost to borrow increased x3 fold. Shorts not only did not close, but increased their positions. AKA all those shorts who opened up are now trapped.\n\n&amp;#x200B;\n\n[Ortex + IBKR borrow rates](https://preview.redd.it/m0npklrsjjk71.png?width=1233&amp;format=png&amp;auto=webp&amp;s=c88c1a7c10f16172e44cf263696b92a9e46cc8cc)\n\n# Part 2 massive short constraints\n\nA quick look at the options tape can tell you all you need to know about how deep the shorts are (see part 3) but if you want the numbers, here they are:\n\n**Float**: 40mil (Bloomberg)\n\n**Institutions**: 15.6mil (Bloomberg)\n\n**SI:** 15mil (Ortex)\n\n**Trading float:** 24.4mil\n\n**SI of trading float: 61% (not counting shorted shares)**\n\nTTCF is peculiar because in every case of a spiked 100% utilization (the broad availability of shares to short) there’s a corresponding rally in price. We’re there again but this time there’s a twist.\n\n&amp;#x200B;\n\n[Utilization in yellow, borrow rate in purple, 100&amp;#37; utilization highlighted](https://preview.redd.it/nrxqbhbgjjk71.png?width=3200&amp;format=png&amp;auto=webp&amp;s=874d29cb554dc22ebc55929ca6caba43c48f3917)\n\nNot only do I expect a high utilization rally 25-50% higher than current prices, we now have significant number of added short constraints prompting a higher move. \n\nListing them out - in addition to the utilization HTB rally, we now have 1) a smaller float due to institutional buys, 2) crazy high CTB rate of 220-340%, 3) reg SHO forcing close outs of recent FTD shorts, and 4) higher accruing losses the higher IV goes. \n\nThe excessive short borrowing results in issues with clearing houses and brokers – namely, these firms are loaning out shares they don’t have. [Enter the SEC and the regulation SHO list](http://www.nasdaqtrader.com/trader.aspx?id=regshothreshold).\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ylrlxw2ijjk71.png?width=1620&amp;format=png&amp;auto=webp&amp;s=1d507836289026e24e47112d295749a9be241b97\n\n# Reg SHO Threshold List\n\nPart 3 reset the clock… right?\n\nWell, they can try. Let’s have a primer. What is an FTD (Fail-To-Deliver) and resetting the clock?\n\n&gt;Periodically, securities become hard to borrow, and, where there are large and persistent fails to deliver in the security, end up on the threshold security list. These situations give rise to pricing differentials in the options of these securities, and the Put/Call equation may appear out of balance, which is, in part, a reflection of higher borrowing rates on these securities…. Reg SHO requires FTD positions resulting from short sale transactions to be closed out by a specific date (T+3).\n\n\\- [SEC Illegal Reset Report](https://www.sec.gov/about/offices/ocie/options-trading-risk-alert.pdf), page 6 (2013)\n\nOkay in English, FTD’s are when brokers can’t deliver short sales. They normally have to close them on T+3. In order to avoid closing, Short Bears are doing something called ‘Resetting the Clock’ to kick the ball down the road before closing out and paying 340% borrow fees. \n\nHere’s a walk-thru on the reset playbook.\n\n1. Short Bear shorts TTCF at 340% cost to borrow to try for a 5% gain. Yolo.\n2. Crooked Broker can’t deliver the borrowed shares.\n3. Crooked Broker is required to close out Short Bear on the third day (T+3).\n4. Short Bear doesn’t like this so they do a sneaky deal selling calls and buying puts on non-OI options with Crooked Broker so they assign them making it look like they closed out for another 3 days. \n5. Short Bear hopes price goes down before he has to pay the 340% cost to borrow + take the loss, so keeps doing this.\n\nWhat Short Bear is doing is illegal, so in the off chance the SEC ever does anything, here’s your proof (cc: SEC)\n\n&amp;#x200B;\n\n[Thursday Order, 12:18pm CST](https://preview.redd.it/tfwyt4bkjjk71.png?width=3542&amp;format=png&amp;auto=webp&amp;s=6d356e27430acd795e9d237e3d18a0ba3d1e8adc)\n\n&amp;#x200B;\n\n[Friday OI – options have all been exercised](https://preview.redd.it/pral284njjk71.png?width=1858&amp;format=png&amp;auto=webp&amp;s=7049084b5df1b7d8521adce965ecf186ae9aea3d)\n\nThese resets have been happening literally every day for the past week. So, why should you care? Well, the SEC tells us why.\n\n&gt;Trade A continues to execute a buy-write reset transaction whenever necessary, and by the time of expiration of its original Reversal, it may have given up some of the profits in the form of premiums paid, but it has maintained its short position without paying the higher cost to borrow or purchase shares to make delivery.\n\n\\- [SEC Illegal Reset Report](https://www.sec.gov/about/offices/ocie/options-trading-risk-alert.pdf), page 9\n\nRead: the longer shorts do this, the higher IV goes = the longer shorts do this, the more and more unprofitable it becomes. Not only does A) this clock reset point to severe short constraints, but B) this represents severe vulnerability if the powder keg goes off and mass calls get bought, jacking IV/premium, making the FTD reset dramatically more expensive and complex to complete while sparking off a short squeeze.\n\nEnter: vicious cycle\n\n1. Price goes higher, forcing high borrow rates\n2. Shorts with high borrow rates try to reset the clock\n3. Reset the clock jacks IV higher, making it more unprofitable\n4. Shorts start closing\n5. Price goes higher\n6. Repeat\n\n# Part 4 the play\n\nThe run should start imminently. \n\nRepeated tests of the $20 - $20.5 range result in huge panic short sells. On Thurs, shorts responded to attempted breakout by purchasing thousands of deep ITM puts and selling thousands of deep ITM calls for a stupid amount of premium. Didn’t work. On Fri, massive share sells tried to defend against another breakout.\n\n&amp;#x200B;\n\n[Short attacks on price Thurs-Fri](https://preview.redd.it/4osklbyojjk71.png?width=3506&amp;format=png&amp;auto=webp&amp;s=b2e94c58a1e32eadccf63c64e78606b9159743ee)\n\nIV is low enough to make substantial returns. It would be lower if not for shorts resetting transactions, but it’s all good because there’s ample ability to profit off their mistake. \n\nIt you want to see what short panic looks like, look no further than the walls of bought puts and sold calls shorts placed on Thurs to prevent a breakout.\n\n&amp;#x200B;\n\n[Thursday Order, 8:56am CST](https://preview.redd.it/4e9z9imqjjk71.png?width=1960&amp;format=png&amp;auto=webp&amp;s=051b05106221d1b73976a6176cfa2e8b0aef9d2e)\n\nMy move is on all time highs. \n\n9/17 22.5c @ 0.6 = 800% returns by exp. at 28\n\n9/17 25c @ 0.4 = 1150% returns by exp. at 30\n\n10/15 25c $ .65 = 1400% returns by exp. at 35\n\nCheers",
        "subreddit": "wallstreetbets",
        "title": "TTCF - The clock won't stop",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/peofan/ttcf_the_clock_wont_stop/",
        "created": 1630378086.0
    },
    {
        "author": "redtexture",
        "created_utc": 1630323423,
        "id": "pegbi9",
        "num_comments": 575,
        "num_crossposts": 0,
        "selftext": "For the options questions you wanted to ask, but were afraid to.  \n**There are no stupid questions, only dumb answers.**  &amp;nbsp;  **Fire away.**  \nThis project succeeds via thoughtful sharing of knowledge.  \n**You, too, are invited to respond to these questions.**  \nThis is a weekly rotation with past threads linked below.\n\n----\n\n###**BEFORE POSTING,  PLEASE REVIEW THE BELOW LIST OF FREQUENT ANSWERS.**   [.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)\n\n---\n\n**Don't exercise your (long) options for stock!**   \n**Exercising throws away [extrinsic value](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value) that selling harvests.**  \n**Simply sell your (long) options, to close the position, for a gain or loss.**  \n**Your breakeven is the cost of your option when you are selling.**  \n**If exercising (a call), your breakeven is the strike price plus the debit cost to enter the position.**  \nFurther reading:   \n**[Monday School: Exercise and Expiration are not what you think they are.](https://www.reddit.com/r/options/comments/m5r8mi/monday_school_exercise_and_expiration_are_not/)**  \n\n---\n\n**Key informational links**  \n•&amp;nbsp;[Options FAQ / Wiki: Frequent Answers to Questions](https://www.reddit.com/r/options/wiki/faq)  \n•&amp;nbsp;[Options Toolbox Links / Wiki](https://www.reddit.com/r/options/wiki/toolbox/links)  \n•&amp;nbsp;[Options Glossary](https://www.optionseducation.org/referencelibrary/optionsglossary)   \n•&amp;nbsp;[List of Recommended Options Books](https://www.reddit.com/r/options/comments/8qfs14/options_book_list_review_of_all_books_that_helped/)    \n•&amp;nbsp;[Introduction to Options (The Options Playbook)](https://www.optionsplaybook.com/options-introduction/)  \n•&amp;nbsp;[The complete r/options side-bar informational links (made visible for mobile app users.)](https://www.reddit.com/r/options/about/sidebar)  \n•&amp;nbsp;[Characteristics and Risks of Standardized Options (Options Clearing Corporation)](\nhttps://www.theocc.com/about/publications/character-risks.jsp)  \n•&amp;nbsp;[Binary options and Fraud (Securities Exchange Commission)](https://www.sec.gov/files/ia_binary.pdf)   \n[.](https://www.reddit.com/r/options/wiki/faq/subreddit_resources)\n\n ----\n\n**Getting started in options**   \n•&amp;nbsp;[Calls and puts, long and short, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/basics)   \n•&amp;nbsp;[Options Basics (begals)](https://www.reddit.com/r/options/comments/gh9vpl/options_basics/)  \n•&amp;nbsp;[Exercise &amp; Assignment - A Guide (ScottishTrader)](https://www.reddit.com/r/options/wiki/faq/pages/exercise)  \n•&amp;nbsp;[Why Options Are Rarely Exercised - Chris Butler - Project Option (18 minutes)](https://www.youtube.com/watch?v=PsZsqiBFnmo)  \n•&amp;nbsp;[I just made (or lost) $___. Should I close the trade? (Redtexture)](https://www.reddit.com/r/options/comments/eunnko/noob_safe_haven_thread_jan_27_feb_02_2020/fg6jjjz/)    \n•&amp;nbsp;[Disclose option position details, for a useful response](https://www.reddit.com/r/options/wiki/faq/pages/trade_details)  \n•&amp;nbsp;[OptionAlpha Trading and Options Handbook](https://optionalpha.com/handbook)   \n\n---\n\n**Introductory Trading Commentary**   \n&amp;nbsp;&amp;nbsp;**Strike Price**   \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Options Basics: How to Pick the Right Strike Price (Elvis Picardo - Investopedia)](https://www.investopedia.com/articles/active-trading/021014/options-basics-how-pick-right-strike-price.asp)  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[High Probability Options Trading Defined (Kirk DuPlessis, Option Alpha)](https://www.youtube.com/watch?v=DcWHh2co80M)   \n&amp;nbsp;&amp;nbsp;**Breakeven**  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Your break-even (at expiration) isn't as important as you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/m0m7at/monday_school_your_breakeven_isnt_as_important_as/)  \n&amp;nbsp;&amp;nbsp;**Expiration**  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Options Expiration &amp; Assignment (Option Alpha)](https://www.youtube.com/watch?v=OnUsu1y1W9w)    \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Expiration times and dates (Investopedia)](https://www.investopedia.com/terms/e/expiration-time.asp)  \n&amp;nbsp;&amp;nbsp;**Greeks**  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Options Pricing &amp; The Greeks (Option Alpha) (30 minutes)](https://www.youtube.com/watch?v=kCJcEOYuuII)  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Options Greeks (captut)](https://www.reddit.com/r/options/comments/hl8i2n/option_greeks_101)  \n&amp;nbsp;&amp;nbsp;**Trading and Strategy**  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Common mistakes and useful advice for new options traders (wiki)](https://www.reddit.com/r/options/wiki/faq/pages/introduction#wiki_common_mistakes_and_useful_advice_for__new_options_traders)  \n&amp;nbsp;&amp;nbsp;&amp;nbsp;•&amp;nbsp;[Common Intra-Day Stock Market Patterns - (Cory Mitchell - The Balance)](https://www.thebalance.com/common-intra-day-stock-market-patterns-1031456)  \n\n---\n\n**Managing Trades**  \n•&amp;nbsp;[Managing long calls - a summary (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/managing_long_calls)  \n•&amp;nbsp;[The diagonal call calendar spread, misnamed as the \"poor man's covered call\" (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/diagonal_calendars)  \n•&amp;nbsp;[Selected Option Positions and Trade Management (Wiki)](https://www.reddit.com/r/options/wiki/faq/pages/positions)  \n\n**Why did my options lose value when the stock price moved  favorably?**  \n•&amp;nbsp;[Options extrinsic and intrinsic value, an introduction (Redtexture)](https://www.reddit.com/r/options/wiki/faq/pages/extrinsic_value)\n      \n**Trade planning, risk reduction and trade size**  \n•&amp;nbsp;[Exit-first trade planning, and a risk-reduction checklist (Redtexture)](https://www.reddit.com/r/options/comments/9at2fu/noob_thread_aug_26_sept_1/e4ywq0u/)  \n•&amp;nbsp;[Monday School: A trade plan is more important than you think it is (PapaCharlie9)](https://www.reddit.com/r/options/comments/mpk6yf/monday_school_a_trade_plan_is_more_important_than/)  \n•&amp;nbsp;[Applying Expected Value Concepts to Option Investing (Select Options)](http://www.selectoptions.com/Edu-Expected-Result)  \n•&amp;nbsp;[Risk Management, or How to Not Lose Your House (boii0708) (March 6 2021)](https://www.reddit.com/r/options/comments/lyp1uc/risk_management_or_how_to_not_lose_your_house/)  \n•&amp;nbsp;[Trade Checklists and Guides (Option Alpha)](https://optionalpha.com/members/guides-checklists)  \n•&amp;nbsp;[Planning for trades to fail. (John Carter)  (at 90 seconds)](https://youtu.be/N5_OkdvPmUI?t=90)\n\n**Minimizing Bid-Ask Spreads (high-volume options are best)**   \n•&amp;nbsp;[Price discovery for wide bid-ask spreads (Redtexture)](https://www.reddit.com/r/options/comments/9u8o7j/noob_safe_haven_thread_nov_0511_2018/e96eynd/)  \n•&amp;nbsp;[List of option activity by underlying (Market Chameleon)](https://marketchameleon.com/Reports/optionVolumeReport)\n\n**Closing out a trade**  \n•&amp;nbsp;[Most options positions are closed before expiration (Options Playbook)](https://www.optionsplaybook.com/options-introduction/closing-option-position)       \n•&amp;nbsp;[When to Exit Guide (Option Alpha)](https://web.archive.org/web/20201111230944/https://optionalpha.com/wp-content/uploads/2015/01/When-To-Exit-Guide.pdf)  \n•&amp;nbsp;[Risk to reward ratios change: a reason for early exit (Redtexture)](https://www.reddit.com/r/options/comments/hg8ce9/risk_to_reward_ratio_changes_over_the_life_of_an/)  \n•&amp;nbsp;[Close positions before expiration: TSLA decline after market close (PapaCharlie9) (September 11, 2020)](https://www.reddit.com/r/options/comments/ipqkua/fridays_tsla_lesson_close_positions_before/)  \n\n---\n\n**Options exchange operations and processes**  \nIncluding:     \n[Options Adjustments for Mergers, Stock Splits and Special dividends; Options Expiration creation; Strike Price creation; Trading Halts and Market Closings; Options Listing requirements;  Collateral Rules; List of Options Exchanges; Market Makers](https://www.reddit.com/r/options/wiki/faq/pages/exchange_operations)   \n\n**Miscellaneous**  \n•&amp;nbsp;[Graph of the VIX: S&amp;P 500 volatility index (StockCharts)](https://stockcharts.com/h-sc/ui?s=vix)  \n•&amp;nbsp;[Graph of VX Futures Term Structure (Trading Volatility)](http://www.tradingvolatility.net/p/datasourceurldocs.html)  \n•&amp;nbsp;[A selected list of option chain &amp; option data websites](https://www.reddit.com/r/options/wiki/faq/pages/data_sources)  \n•&amp;nbsp;[Options on Futures (CME Group)](https://www.cmegroup.com/education/files/options-on-futures-brochure.pdf)  \n•&amp;nbsp;[Selected calendars of economic reports and events](https://www.reddit.com/r/options/wiki/faq/pages/calendars)  \n•&amp;nbsp;[An incomplete list of international brokers trading USA (and European)  options](https://www.reddit.com/r/options/wiki/faq/pages/brokers/)\n\n---\n\nPrevious weeks' Option Questions Safe Haven threads.\n  \n[Complete archive: 2018, 2019, 2020, 2021](https://www.reddit.com/r/options/wiki/faq/archive/safe_haven_2021)\n\n---",
        "subreddit": "options",
        "title": "Options Questions Safe Haven Thread | Aug 30 - Sept 05 2021",
        "url": "https://www.reddit.com/r/options/comments/pegbi9/options_questions_safe_haven_thread_aug_30_sept/",
        "created": 1630352223.0
    },
    {
        "author": "MuzGotTheBooze",
        "created_utc": 1629575629,
        "id": "p8y3en",
        "num_comments": 571,
        "num_crossposts": 0,
        "selftext": "I’m too young to remember 2008, but I how did the average persons day-to-day change? Did it change? What would you do differently if something like it happens again? How would you prepare (not really your stock portfolio, but your real life)?\n\nEdit: just to clarify I’m not trying to fear monger a crash, genuinely want to hear it from the average everyday people how it affected their lives.",
        "subreddit": "stocks",
        "title": "How was 2008?",
        "url": "https://www.reddit.com/r/stocks/comments/p8y3en/how_was_2008/",
        "created": 1629604429.0
    },
    {
        "author": "Cory-R1",
        "created_utc": 1630429779,
        "id": "pfa6je",
        "num_comments": 570,
        "num_crossposts": 0,
        "selftext": "Adjusting my target up to $150.00 based on what I learned yesterday:\n\n[LMC could reach $150 if their plan continues](https://preview.redd.it/2xm7r2o07qk71.png?width=1189&amp;format=png&amp;auto=webp&amp;s=c1815192e62af939a4f2074f2bc398c72be4ded6)\n\n✅ Over 30 % Short, Production Begins in September\n\n✅ Luxury options to be added such as leather seats, sun roof, etc.\n\n✅ The Endurance has been tested over a million miles in a last-mile delivery capacity and the regenerating braking is fully proven under stop and go.\n\n✅ The average US Fleet vehicle travels 80-100 miles per day.  The Endurance standard is 250.  Larger capacity will be offered later.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/x8o9th437qk71.png?width=1188&amp;format=png&amp;auto=webp&amp;s=f834f89a6590ef030c819c9da7dbfac045f7e095\n\n✅ You can spring lift the Endurance if you need more than the standard 15” clearance.\n\n✅ Alternate bed styles (bucket, rails, toolboxes, cap, utility, storage.. are all fine).\n\n✅ Endurance hub motors have integrated standard disc brake, standard outer caliper and a hub bearing.  Standard rims and tires are changed as a standard truck would.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/yx62dy377qk71.jpg?width=1000&amp;format=pjpg&amp;auto=webp&amp;s=6748f91afbf0c689f5447c0f155647d84a7e17bd\n\n✅ LMC Director of Sales told people in March that they were accepting POs.\n\n✅ Working with outfitters to offer Trailer package, toolbox, snowplows, all of that will be available.  Available with a bed-delete for custom applications.\n\n$150 price target will place it at $23B market cap, which is lower than the next 24 months of projected revenue for the company.\n\n🚀 ACTExpo reported registration was nearing 5,000 (that was early Monday before the event even began.)  Can you imagine how many people are experiencing the Endurance in person this week? [http://actexpo.com](http://actexpo.com) (Long Beach, CA)  LMC is also at NAFA this week (Pittsburgh PA):\n\n&amp;#x200B;\n\nhttps://preview.redd.it/t2i6kj247qk71.png?width=686&amp;format=png&amp;auto=webp&amp;s=45411e781535975b312046f554809c117a0db5f2\n\nAs far as specifications go, we know that the four in-wheel hub motors produce a total of 600 HP (608 HP), enough for a 0-60 mph (0-96 km/h) sprint of 5.5 seconds and a governed top speed of 80 mph (128 km/h).\n\n&amp;#x200B;\n\nhttps://preview.redd.it/dvhd7bx57qk71.png?width=1266&amp;format=png&amp;auto=webp&amp;s=2ed66f50e7a53f2e546f14eb4f2bc7af26238a55\n\n&amp;#x200B;\n\nThe Lordstown Endurance boasts the highest flexibility with vehicle design and chasis control.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lhpngt157qk71.png?width=998&amp;format=png&amp;auto=webp&amp;s=2ae1687f78c884d2b350a08b2a4e1708b4bf761f",
        "subreddit": "wallstreetbets",
        "title": "$150 Price Target for $RIDE Lordstown - Based on what I learned yesterday.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfa6je/150_price_target_for_ride_lordstown_based_on_what/",
        "created": 1630458579.0
    },
    {
        "author": "Berisha11",
        "created_utc": 1630426868,
        "id": "pf97f1",
        "num_comments": 569,
        "num_crossposts": 0,
        "selftext": "Dataroma is a website that tracks 72 so called 'superinvestors' to see what they've been up to. Every quarter it takes every 13F filing for each investor and compiles a list of the top 10 stocks that so called 'smart money' is currently buying. These investors are some of the biggest and most famous investors in the world today including: Warren Buffett, Charlie Munger, Bill Gates, Seth Klarman , Bill Ackman, Carl Icahn, Michael Burry, etc.\n\nThe number #1 ranked stock that big investors have bought this last quarter is [Alibaba](https://i.imgur.com/MxzqV4N.png). It is ranked past Google, Facebook, Amazon, Netflix and so many other companies. Thought this was interesting so I wanted to share. \n\n[Source](https://www.dataroma.com/m/g/portfolio_b.php?q=q&amp;o=c)",
        "subreddit": "stocks",
        "title": "BABA is the most bought stock amongst the biggest investors in America in the the last quarter.",
        "url": "https://www.reddit.com/r/stocks/comments/pf97f1/baba_is_the_most_bought_stock_amongst_the_biggest/",
        "created": 1630455668.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1629363616,
        "id": "p7b5v4",
        "num_comments": 567,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 19, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p7b5v4/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1629392416.0
    },
    {
        "author": "SS333SS",
        "created_utc": 1630272392,
        "id": "pe44tf",
        "num_comments": 566,
        "num_crossposts": 0,
        "selftext": "I'm very confused as to what the hell the current markets are supposed to be. The only thing that matters seems to be predicting what the federal reserve will do.\n\nNone of this makes sense to me as a young investor. By literally every marker we are in the biggest market bubble of all time, and many experts are talking about it. Yet this is somehow just the new status quo.\n\nIt's no longer about investing in how good the actual economy is doing, is it? I mean if you were sitting there in summer of 2019 before the virus started to become known, and I came to you in the future telling you there would literally be lockdowns and economic shutdown, what would you do?\n\nYou would sell many of your investments, maybe even short the market. Warn people of what's to come. This is the rational decision, isn't it? Things go up, and they also go down. What the hell has happened?\n\nBut actually the federal reserve decided to prop up the markets at the expense of savers and the dollar itself... so what was the point of speculating on the economy? It didn't even matter that we had a literal pandemic (or atleast the response of one), asset prices just went up and up. Imagine that was you, shorting on literal visions of future events, and still losing because the recession got cancelled.\n\nWhich leaves me very confused. Obviously you can't just create wealth out of nothing, there is always a downside to QE and that is inflation (more specifically, loss of purchasing power).\n\nWhat the hell happened to the markets, how did we let it get this bad? Why would the fed not use QE to turn a crisis into a less painful downturn, instead of creating so much new money that they somehow turn a shutdown into a bull market?\n\nAm I going crazy here? We read the statements made on Friday and the Federal reserve STILL is scared to stop pumping money into the market. But nobody's doing anything about it. How did things get this bad? No bubble resolves sideways. This is no longer investing, this is gambling, or something far worse.\n\nI don't know how any of you can be excited about a \"bull market to come\". Sure the amount of dollars your portfolio is worth may go up... but at what cost to the dollar itself?",
        "subreddit": "wallstreetbets",
        "title": "Is this really all there is to the market?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pe44tf/is_this_really_all_there_is_to_the_market/",
        "created": 1630301192.0
    },
    {
        "author": "roman_axt",
        "created_utc": 1629894842,
        "id": "pbaayh",
        "num_comments": 565,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Hola, retardos! It’s Roman here, and a couple of days ago I predicted the forthcoming GME bullrun, before it had actually happened. Here’s what I think will happen next: before settling on Mars, the Moon has to be conquered.",
        "url": "https://i.redd.it/7q090xkm0ij71.jpg",
        "created": 1629923642.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1629190813,
        "id": "p60172",
        "num_comments": 562,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 17, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p60172/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1629219613.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1629279012,
        "id": "p6nrco",
        "num_comments": 557,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Wednesday - Aug 18, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/p6nrco/rstocks_daily_discussion_wednesday_aug_18_2021/",
        "created": 1629307812.0
    },
    {
        "author": "PennyBotWeekly",
        "created_utc": 1630293911,
        "id": "pea0s2",
        "num_comments": 551,
        "num_crossposts": 0,
        "selftext": " Talk about your plays today or things you are on the lookout for. This is where you belong if your comment includes a ticker.\n\n*keep it civil please*",
        "subreddit": "pennystocks",
        "title": "Daily Plays August 30, 2021",
        "url": "https://www.reddit.com/r/pennystocks/comments/pea0s2/daily_plays_august_30_2021/",
        "created": 1630322711.0
    },
    {
        "author": "faisall1",
        "created_utc": 1629916224,
        "id": "pbh91f",
        "num_comments": 538,
        "num_crossposts": 0,
        "selftext": "^(I'm  not a financial advisor, nor am I giving any financial advise. This is  an entertainment/comedy-nonfactual post. I'm a retard  posting on WSB  with a bias due to having a position of my portfolio in $ASTS.  So, Don't act on anything posted in here and proceed on your own risk...)\n\nRoughly 40-47% of the world doesn't have access to online Porn or the internet, a **Trillion** dollar market untapped. Imagine more than **3 Billion** horny people limited to only masturbating to their imagination!!\n\nASTS is a potentially once in a decade investment, one to the likes of Tesla at it's beginnings... A service which has no competitors, not even StarLink(as per the CEO). The one investment which could offset all the previous losses...\n\nASTS is developing the **First and Only** Space based Cellular Broadband network, **SpaceMobile.** SpaceMobile will be **compatible** with all currently existing 5G and LTE smartphones without the need to do any modifications to your phones hardware. It will provide connectivity **at 4G/5G speeds** **everywhere on the planet – on land, at sea and in flight.** In addition, 5 Billion phones move in and out of coverage all the time, SpaceMobile is planning to bridge the gap of connection loss without the need of specialized equipment!\n\n# The Technology (Too Technical and can be skipped):\n\n**TLDR;  The tech has been proven to work on smaller scales but has yet to be done at the scale ASTS is aiming for. Additionally, it's 6G forward compatible!**\n\n***OVERVIEW***:  AST &amp; Science (“ASTS”) has designed a large aperture satellite system to provide ‘direct-to-device’ service to normal phones using a low earth orbit satellite array to directly connect to mobile phones anywhere on Earth.\n\n***Hardware***\\*\\*\\*:\\*\\*\\*   ASTS’ satellites are \\~10x bigger than the norm because they are essentially cell-phone towers in space. With a [900-square meter array](https://preview.redd.it/sk0cpuxbfnd71.png?width=1158&amp;format=png&amp;auto=webp&amp;s=f57703695f83ed465a1912b1ae546a4c04c4852c), the system is a large **“loud”**  system that can connect with a regular mobile phone. Traditional satellite phones are just “listen hard” whereas ASTS simply produces a loud signal to connect to regular mobile phones.\n\n***SOFTWARE:***   ASTS’ system does not require a special chipset on the phone because of its proprietary back-end software system that allows for interconnection to existing terrestrial(on Earth) spectrum and telecom networks. The “magic” of the technology is the back-end software that allows the system to utilize terrestrial spectrum, seamlessly interconnect over existing networks, and talk directly to an LTE system; ASTS is 6G forward compatible.\n\n***BACKHAUL***:   Once the signal is collected from a handset, ASTS sends the data back  on B-Band satellite spectrum to a ground gateway system. The phone-satellite connection is native to the carrier’s terrestrial spectrum.\n\n***CAPACITY***:  Each satellite can handle 1.2MM GB per month; extra capacity can be added by directing additional satellites at an area.\n\n# Business Model(Can be skipped):\n\n**TLDR; ASTS brings the satellites and execution while their partners bring the customers.**\n\n***The Model:*** ASTS has chosen to partner with preexisting telecom giants to acquire a large customer base with essentially 0 acquisition costs per customer for ASTS. They have agreed to a 50/50 revenue split with its partners who are going to provide the customers. The 5g connection will be offered as an add-on to preexisting data plans provided by their partners or as a standalone purchase.\n\n***How Does it generate Money? :***  With its current carrier partners, Vodafone and AT\\&amp;T; given its large, fixed cost base, the Company expects to generate 90% asset-level EBITDA margins that provide  significant operating leverage and cash flow.\n\nIn-place there are binding agreements with carriers to provide ASTS with access to  &gt;1.3BN existing customers without having to independently market to or acquire customers (or directly bear the cost of churn). Phase 1 will  target key Equatorial regions and cover 1.6BN people. In subsequent phases, it's planning to expand into Europe and N. America by 2024.\n\nThe company is expected to generate &gt;$1bn of EBITDA by 2024 based on 168 satellites launched, 27MM total subscribers, with an ARPU of $2.50 per user.\n\n***ASSets:***  ASTS has 750+ patents as well as a first-mover advantage(no competitors yet). Moreover, Commercial progress reinforces the Company’s technical lead in the market having ATT, Vodafone, American Towers and Rakuten in it's pocket.\n\n# Timeline(can be skipped):\n\n**TLDR;** **They have broken up their plan into 5 different phases spanning multiple  years with the intent of slowly expanding their satellite constellation until full global coverage is achieved.**\n\n* Phase 1 - Equatorial constellation, 20 satellites by 2022\n   * Cash flow from phase 1 will support the following phases\n* Phase 2 - NA/Europe/Asia, 45 satellites by 2022\n* Phase 3 - Full global coverage, 45 satellites by 2023\n   * At this point ASTS expects to start turning a profit\n* Phase 4 - Full global MIMO coverage (increased data capacity), 58 satellites by 2023\n* Phase 5 - Scaling network globally, 16 satellites by 2028\n\n# Management(Can be skipped):\n\n* CEO Abel Avellan\n   * 25+ years of space industry experience\n   * Track record of building a successful global satellite communications company\n      * EMC Emerging Markets Communications\n* CFO Tom Severson\n   * Former CFO of EMC\n* CTO Huiwen Yao\n   * 30+ years of experience in satcom\n* CCO Chris Ivory\n   * 25+ years of experience in satcom\n\nEmployees:\n\n* 236 full-time employees\n* 13 part-time employees\n* 161 scientists and engineers\n   * 24 of whom are PhDs\n\n**The deep executive ranks include executives from Orbital ATK, Globecomm,  NASA, and Maxar • The team has 161 scientists and engineers, 34 of whom  are PhDs.**\n\n# Catalysts(can be skipped):\n\n**The most important catalyst is the BlueWalker 3 satellite launch which will be taking place sometime in Q4  2021.**\n\nThis will be a bigger satellite than any previous ones created but it still is not the biggest they plan to make. However, a successful launch and connection to BW3 would definitively prove that the tech works at larger scales.\n\nOther smaller but still significant catalysts include:\n\n* Government approvals for servicing in each country\n* The launch date for BW3\n* Acquisition of a portion of the federal 5g fund\n\n# Risks(Can be skipped):\n\nEvery play ranging from 0dte to year long investments come with some amount of risk and this is no exception.  While some may simply be setbacks they are still worth knowing.\n\n* Delays\n   * Satellite construction and launch delays.\n* Execution\n   * Building, launching and deploying the satellites.\n* Regulators\n   * Need governmental approval for satellite operations from each country they wish to provide before they can service them.\n* Tech\n   * Satellite to phone connection still unproven on a large scale.\n* Funding\n   * Not fully funded (Need to raise \\~1.5 bn) however phase 1 is fully funded and is planned to help pay for the subsequent phases.\n\n# Valuation(Most important part):\n\nThe current market cap of ASTS is only 1.71 Billion for a stock with an extremely high potential, endless possibilities, and no competitors.\n\nSpaceX's Starlink(If we want to compare apples to oranges), will provide **FIXED-POINT(Doesn't connect to mobile)** broadband to customers at very high costs with unclear quality. Moreover Starlink cannot translate to mobile devices. It depends on Dish Satellites.\n\nStarLink is valuated between 40-50Billion Dollars! **Which equals around 222$-277$ of ASTS!!**\n\nJust like Facebook found out after it's IPO, the real market is and always will be in **MOBILE** and Starlink cannot translate to mobile devices.\n\n***Deutsche Bank most recent coverage:*** Their price target was set on 35$ and they added this nice comment **“If management executes on plan over the next five years, the company's intrinsic value should ultimately be \"significantly higher\"** than the $35  price target.\"\n\n***Barclays Most recent coverage:*** Their price target was set on 29$.\n\n**And Most importantly my coverage:** Well, you cannot really valuate this rare breed, because it's like trying to valuate $TSLA in the early days when it was just 50$(post split). ASTS is in a very similar situation right now having no competitors with a massive lead in the industry(A proven product on a small scale with well established partnerships with Vodafone, ATT, American Towers and Rakuten).\n\nRight now, it should atleast have a market cap of 10 Billion, which is 1/4 Starlink, and there's actually no competition.\n\nPrice target will be illustrated with crayons bellow:\n\n[ASTS Price Target illustrated with Crayons](https://preview.redd.it/cew62pdeqjj71.png?width=651&amp;format=png&amp;auto=webp&amp;s=43c5882e02595f60ed2d0f59646ad1e58605c2bf)\n\n&amp;#x200B;\n\n^(Special thanks to /oceanice and /thekookreport for their great DD)",
        "subreddit": "wallstreetbets",
        "title": "$ASTS: Universal 4k Porn streamed from anywhere on the planet Sea, Air, and Land!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pbh91f/asts_universal_4k_porn_streamed_from_anywhere_on/",
        "created": 1629945024.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1628499618,
        "id": "p0xpbh",
        "num_comments": 537,
        "num_crossposts": 0,
        "selftext": "Hopefully the bot fills this in. Act like you didn't see it.\n\nCheck out our [Discord](https://discord.gg/wallstreetbets)",
        "subreddit": "wallstreetbets",
        "title": "Fraternal Association of Gambling Gentlemen and Yacht Degenerates for August 09, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p0xpbh/fraternal_association_of_gambling_gentlemen_and/",
        "created": 1628528418.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1627896620,
        "id": "owb350",
        "num_comments": 536,
        "num_crossposts": 0,
        "selftext": "These daily discussions run from Monday to Friday including during our themed posts.\n\nSome helpful links:\n\n* [Finviz](https://finviz.com/quote.ashx?t=spy) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\nIf you have a basic question, for example \"what is EPS,\" then google \"investopedia EPS\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nPlease discuss your portfolios in the [Rate My Portfolio sticky.](https://www.reddit.com/r/stocks/search?sort=new&amp;q=Rate+My+Portfolio+-+r%2FStocks+Quarterly+Thread&amp;t=all&amp;restrict_sr=on).\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion Monday - Aug 02, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/owb350/rstocks_daily_discussion_monday_aug_02_2021/",
        "created": 1627925420.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1629146251,
        "id": "p5oks7",
        "num_comments": 527,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2021/08/16/wish-stock-down-27percent-in-two-days-and-78percent-since-january.html\n\nWish reported a surprising drop in second-quarter sales last week and a wider-than-expected loss.\n\nMarketplace revenue plunged 29% from a year earlier as users shopped elsewhere.\n\nSince peaking at $31.19 on Feb. 1, Wish has lost more than three-quarters of its value.\n\nThis is to remind investors please invest in ipo stock carefully. It could lose value much more faster than you think. If you are still holding this stock, you really need a long term horizon and patience.",
        "subreddit": "stocks",
        "title": "Wish stock has plunged 27% in two days and almost 80% since January as users flee",
        "url": "https://www.reddit.com/r/stocks/comments/p5oks7/wish_stock_has_plunged_27_in_two_days_and_almost/",
        "created": 1629175051.0
    },
    {
        "author": "pvpplease",
        "created_utc": 1630008642,
        "id": "pc7gv6",
        "num_comments": 527,
        "num_crossposts": 0,
        "selftext": "[‘How can you not be’ bullish on Peloton, trader asks ahead of quarterly earnings](https://www.cnbc.com/2021/08/26/peloton-earnings-trader-sees-a-potential-50percent-rally-back-to-old-highs.html) 3:38 PM\n\n[Peloton shares tank after cycle maker posts disappointing earnings and outlook; cuts Bike price](https://www.cnbc.com/2021/08/26/peloton-pton-q4-2021-loss.html) 4:03 PM",
        "subreddit": "stocks",
        "title": "CNBC does it again.",
        "url": "https://www.reddit.com/r/stocks/comments/pc7gv6/cnbc_does_it_again/",
        "created": 1630037442.0
    },
    {
        "author": "DarthTrader357",
        "created_utc": 1628182459,
        "id": "oymkfa",
        "num_comments": 525,
        "num_crossposts": 0,
        "selftext": "OK, at some point someone's gotta ask...is this market just stupid now? Over my 20 years of investing I've never seen so many people willing to throw away fundamentals to look for the next big thing.\n\n*Back in my day* (lol) companies were actually profitable BEFORE they took off and made millions. Microsoft comes to mind.\n\nIt's not like Microsoft IPO'd broke as shjt and then doubled in price over night. It stayed virtually flat in price, was strong fundamentally, and churned its way to the top slow and steady.\n\nEven through the dot com bubbles, the real estate crash, the covid crash, and all the little corrections in between.\n\nSo what the F\\*\\*\\* is going on with HOOD and other garbage stocks?",
        "subreddit": "options",
        "title": "HOOD - a 51B dollar company that doesn't earn any money",
        "url": "https://www.reddit.com/r/options/comments/oymkfa/hood_a_51b_dollar_company_that_doesnt_earn_any/",
        "created": 1628211259.0
    },
    {
        "author": "RossPG",
        "created_utc": 1629057814,
        "id": "p50n5p",
        "num_comments": 524,
        "num_crossposts": 0,
        "selftext": "Hello. On August 12th, something very strange happened. The url amazon.com/affirm no longer led to an error message. In fact, it redirects to a link that says \"Pay over time with Affirm\" in the tab title, and, if you're on the app it says \"Search in Pay over time with Affirm\" in the search bar. ipad view: https://imgur.com/rGLmrwy\n\nIf you do a \"view page source\" you can ctrl+F and see the \"08-12\" that verifies that this url was set up on 8/12.\n\nNow let's explore the url it redirects to. It has a specific \"node ID\" in it. https://www.amazon.com/b?node=23376591011\n\nUpon reviewing what this means, a node ID is set up for a specific category of product. For instance, this is what the url for their Kindle overview page looks like: https://www.amazon.com/b?node=17717476011 An identical URL with a different node ID.\n\nIt seems very unlikely they set up a specific node ID url if something wasn't brewing.\n\nNow lets look at other evidence. A few months ago, someone noticed during checkout the word \"option\" that had not been there before, yet there was only one pay over time option. See the third line down: https://imgur.com/g0jqN4c\n\nSomeone also noticed that when you used to search for \"Amazon Affirm\" on google it used to come up with a robo-generated search result mentioning Affirm. They do this with basically anything you search to generate clicks. But, a couple months ago, this robo-generated search result removed as if they were trying to hide something. Here is what used to come up: https://imgur.com/3uE52wt\n\nSo what could all this mean? It could be something as simple as Amazon will promote Affirm's upcoming debit card on their website, but why would they promote a competing card? At the moment Amazon only offers their own cards. Or.. it could be a full-blown partnership or buyout. We don't know, but something is going on.\n\nAlso, don't question why I was routinely visiting error message URLs. I have no life and was hoping one day I'd find something and I did.",
        "subreddit": "wallstreetbets",
        "title": "$AMZN is up to something with $AFRM - Obsessive DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p50n5p/amzn_is_up_to_something_with_afrm_obsessive_dd/",
        "created": 1629086614.0
    },
    {
        "author": "Hour_Amphibian1844",
        "created_utc": 1630234294,
        "id": "pdt52s",
        "num_comments": 519,
        "num_crossposts": 0,
        "selftext": "Maybe I don't get it. Scaling up a new automotive business seems to be insanely hard. Tesla succeeding seems to be an almost unprecedented case. There were significant doubts about Tesla's ability to survive when they were already making several hundred thousands of vehicles every year, and arguably they only made it thanks to regulatory credits (which will become less and less relevant) and big capital infusions. \n\nRivian and Lucid have surely already spent significant amounts just on developing the cars, without delivering a single one so far. The capital required to build and scale up factories will be absolutely gigantic, all in hopes of catching up to both Tesla (the cool new brand) and traditional manufacturers (with scale and lots of money). I just don't see how they manage to do what Tesla did and actually catch up with the field. Is there any scenario where these companies actually become a huge success and manage to justify their valuation?",
        "subreddit": "stocks",
        "title": "Is there any world where Rivian and Lucid don't just go bankrupt",
        "url": "https://www.reddit.com/r/stocks/comments/pdt52s/is_there_any_world_where_rivian_and_lucid_dont/",
        "created": 1630263094.0
    },
    {
        "author": "neox29",
        "created_utc": 1628907554,
        "id": "p3zhex",
        "num_comments": 518,
        "num_crossposts": 0,
        "selftext": "Hey y’all I’m looking for some inspiration. I’m at the verge of giving up after loosing 150k of my own money this year. Let’s not get into the specific of how it happened, for now. It can be summed up by that I am an emotional trader. \n\nI don’t want to give up. I want to be disciplined. I want to figure this out. \n\nMoney is relative. This represents a sizable chunk of money to me but not catastrophic. It would take me about 3 years of being a smart saver to save up 150k again. That’s a significant setback. \n\nAnyway has anyone been on the brink of quitting but hung in there?\n\nIt’s been the typical steps up and massive elevators down for me. I would say the vast majority of my losses happened on crazy days where I just could not control what was happening. \n\nRisk management, sizing and being able to take a small loss is the most challenging area for me. \n\nWell anyway I don’t have much more to loose. Not much liquid assets left. \n\nI really really don’t want to give up. Anyone been in even remotely similar situation and was able to rise from the ashes?",
        "subreddit": "options",
        "title": "Any good comeback stories? 150k loss and at the brink of giving up",
        "url": "https://www.reddit.com/r/options/comments/p3zhex/any_good_comeback_stories_150k_loss_and_at_the/",
        "created": 1628936354.0
    },
    {
        "author": "doggy_lovers",
        "created_utc": 1628873191,
        "id": "p3ozbg",
        "num_comments": 515,
        "num_crossposts": 0,
        "selftext": "I am interested in hearing a bull case for doordash. I've seen many youtube videos, reddit posts, and more always dump this stock yet this stock is trading at a high valuation at 18 times sales which implies at least 20-25% sales growth for the next 10 years based on my model. Even Uber, which I consider to be massively overvalued, is trading only 17 billion more for postmates and most dominant ride haling service. \n\nWith earnings miss, i would thought that this stock would go down, but instead as of writing this post it is up 1.5% while airbnb is down on better earnings. Even Disney stock, which crushed earnings, is only up 1.8% as of writing this, and trades at a more reasonable valuation. In my opinion, you cant miss earnings, and expect to go up, yet DoorDash did and the guidance wasnt that great either. \n\nSo why did doordash go up today on earnings? I didn't see any reddit post on doordash earnings, in fact I rarely hear anyone talk about this stock which is surprising considering its a 62 billion growth company. ( i hear more people discuss corsair which is a 2 billion company)\n\n I would like to hear your thoughts on why this stock is worth the price, I always like to hear bull cases, on companies I find overvalued (like i read other people's post on crowdstrike, nvidia, moderna so even thought I find those stocks are overvalued I understand the market valuation is so high on those companies.) \n\nIn short, I am interested in hearing a bull case for doordash and why doordash went up on earnings while most stocks went down on earnings (like sofi, ttcf, which is consider to be reasonable valuation)",
        "subreddit": "stocks",
        "title": "How is DoorDash a 62 billion company?",
        "url": "https://www.reddit.com/r/stocks/comments/p3ozbg/how_is_doordash_a_62_billion_company/",
        "created": 1628901991.0
    },
    {
        "author": "correct_the_econ",
        "created_utc": 1628920502,
        "id": "p42hlg",
        "num_comments": 508,
        "num_crossposts": 0,
        "selftext": "I was reading this great [Dollars and Data](https://ofdollarsanddata.com/the-problem-with-most-financial-advice/) article. A lot of investing advice seems to be a combination of survivorship bias and luck and is only really useful if you have disposable income. Hence it's no surprise that [84% of equities are owned by 10% of the population](https://www.nytimes.com/2021/01/26/upshot/stocks-pandemic-inequality.html). Having a high income requires minimal sacrifice to save and invest, I guess why it's so angering when I read articles advising broke people to \"skip their advocate toast and latte\" to put that 20$ in a total market index fund or ETF.",
        "subreddit": "investing",
        "title": "It seems like we really don't talk about the real secret of investing, having high Income.",
        "url": "https://www.reddit.com/r/investing/comments/p42hlg/it_seems_like_we_really_dont_talk_about_the_real/",
        "created": 1628949302.0
    },
    {
        "author": "r3dcorn",
        "created_utc": 1630329691,
        "id": "pehynu",
        "num_comments": 507,
        "num_crossposts": 0,
        "selftext": "I have been putting away money into the stock market for the last year and a half and so far I've been pretty happy with the results. I was thinking about getting into crypto as well a year ago and was told it isn't a good idea and it's all speculation and is a trend that will die off. What are your guys thoughts? I never pulled the pin, but I'd also kick myself in the ass if I never got into it and made money. Ben Felix on YouTube flat out said he will not put his money into crypto.",
        "subreddit": "CanadianInvestor",
        "title": "Should I stay clear from cryptocurrency and just focus on the stock market?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/pehynu/should_i_stay_clear_from_cryptocurrency_and_just/",
        "created": 1630358491.0
    },
    {
        "author": "xupamos87",
        "created_utc": 1627822376,
        "id": "ovrkt5",
        "num_comments": 503,
        "num_crossposts": 0,
        "selftext": "China is not trying to kill their big tech, they are trying to make their business models more long-lived and sustainable both financially and socially. \n\nIt is definitely trying hard to create a more conservative financial system while contributing to a more equal distribution of wealth. Say what you want, but that ain't bad news at all if you're a long term investor.   \n\nChina wants to rely less on foreign fund flows because they see high speculation and bubble activity in Western countries and they don't want their domestic companies to be exposed to that euphoria and collapse risk. It's easy for a company to act recklessly in such an environment, and these reckless acts might ruin the Government's efforts towards a stable and healthy growing market.  \n\nRemember, China is a country lead by a collectivist mindset where the good of the mass is more important than the good of a single company, in direct opposition to the policy of the US government (not so much Western Europe). But in the end the collective good turns out to be the company's best interest too.\n\nThey are not oblivious to the effects these measures have on the markets, even going as far as to post ads on the front page of every newspaper claiming that they are not in any way trying to harm tech companies, but actually helping them become more sustainable and resilient.   \n\n&amp;#x200B;\n\nWas the crackdown on education stocks really a surprise?  \n\nIn April the government released a document analyzing the education system of the country and already pointing out the problems they saw and possible corrective measures. \n\nIf somebody read those (and they should have if they owned the companies) they could have anticipated the sector to be caught in the regulation crossfire. But people don't do their due diligence and always act surprised when things go south. China is always clear about its intentions, we're just unable to understand them because we keep thinking in Western terms and taking our society and the companies we know as the \"default\" condition, which is fundamentally wrong.\n\nWas the crackdown on Didi a surprise too? \n\nAbsolutely not. The government had explicitly recommended Didi delayed their IPO until certain data issues had been dealt with. Their main concern was making sure data breaches were avoided since, well, the US is literally their main competitor. \n\nDidi ignored all this and went ahead. What followed was more than expected.\n\n&amp;#x200B;\n\nI'm not pretending their totalitarian government that seeks to have absolute control over everything and every piece of information and conducts ethnic cleansing is in any way the most advanced form of human governance. \n\nI'm simply pointing out that it is doing what it is doing because it wants to secure a strong and steady growth for its companies, and it knows that can only be achieved if it does not come at the expense of impoverishing its population and compromising healthy competition and fair-play in all sectors.\n\nOnly the western investor deeply embroiled in never-ending ATH's and euphoria can view the sustainable long-term measures as unsustainable and the unsustainable short-term bandaids as sustainable.\n\n&amp;#x200B;\n\nChinese positions: $DOYU 450 shares",
        "subreddit": "wallstreetbets",
        "title": "China is playing the long-game; US is running on band-aids",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ovrkt5/china_is_playing_the_longgame_us_is_running_on/",
        "created": 1627851176.0
    }
]