[
    {
        "author": "mvrush7",
        "created_utc": 1636182370,
        "id": "qnuzeh",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I’m considering a 7 figure DraftKings YOLO with 2-3 year time horizon. The stock is beat up and has big growth potential. I like the product. There are red flags (SPAC, Hindenburg note) but the growth potential is clear. I believe this is a stock that can catch fire and appeal to retail investors. I make low seven figures so losing it all wouldn’t kill me, but certainly would hurt badly. I also think this market is late cycle, which can be perfect timing or terrible. Other stocks I like are BYND, FB and ORCL. Thoughts?",
        "subreddit": "wallstreetbets",
        "title": "DraftKings YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qnuzeh/draftkings_yolo/",
        "created": 1636211170.0
    },
    {
        "author": "pete7782",
        "created_utc": 1636728266,
        "id": "qscny1",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "BAND protocol to Mars🚀 100x Oracle time is now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qscny1/band_protocol_to_mars_100x_oracle_time_is_now/",
        "created": 1636757066.0
    },
    {
        "author": "enterprevicng",
        "created_utc": 1636623570,
        "id": "qrhnyb",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Found this interesting project, would be putting in big bags!\n\nMy name is Artem Levin, I'm the founder of [Value Network,](https://valuenetwork.live/) and I'm happy to share this innovation with everyone. \n\nThe present Value Network results from a 2020 pivot when we decided to create a service based on Blockchain technology that will disrupt the cryptocurrency prediction markets.\n\n**Why Value Network ($VNTW)**\n\n* Value Network is a prediction market protocol that’s still undervalued &lt; $10M Market cap; three main competitors have over $1.5B joint market cap, so there’s still much room for astronomical growth.\n* The team is doxxed with a track record of successful projects and mainstream experience in developing crypto projects.\n* A world-class prediction trading experience that is open to all, thanks to the power of public blockchains and scaling solutions resulting in fast transactions with minimal fees.\n* Decentralized by Design, allowing users to predict instantly using blockchain. No sign-ups, no middle man, instant withdrawals &amp; no wondering if your funds are safe.\n* Value Network's smart contract code is fully audited by [Certik](https://www.certik.org/projects/valuenetwork)\n\n**Main functions:**\n\nAsset price predictions: Users predict whether the price of a cryptocurrency pair will be higher or lower at a specific moment. By design, users place bets against each other; funds are placed in a pool, and on settlement, winnings are disbursed among predictors.\n\n**On-Chain Strategies:**\n\nUsers create a prediction strategy in the form of a smart contract on [app.valuenetwork.live](https://app.valuenetwork.live/) platform; then other users can decide to pool funds into the strategy and follow his strategy and try to repeat his forecast with any amount of money. If the creator's forecast strategy is correct, he gets 20% from the winnings.\n\nWe have created Value Network integrating QTUM Blockchain, Binance Smart Chain and implemented Chainlink as the price oracle.\n\nCurrently, users can place predictions on the testnet before finally making predictions using real crypto!\n\n**Head on to** [**app.valuenetwork.live**](https://app.valuenetwork.live/) **NOW! The start of a whole new journey**",
        "subreddit": "investing",
        "title": "Value Network - Innovative P2P Predictions on Blockchain",
        "url": "https://www.reddit.com/r/investing/comments/qrhnyb/value_network_innovative_p2p_predictions_on/",
        "created": 1636652370.0
    },
    {
        "author": "JTrain_",
        "created_utc": 1635815014,
        "id": "qksnea",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Opinion on ORCL",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qksnea/opinion_on_orcl/",
        "created": 1635843814.0
    },
    {
        "author": "mvrush7",
        "created_utc": 1636182103,
        "id": "qnux98",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I’m considering a 7 figure DraftKings YOLO with 2-3 year time horizon. The stock is beat up and has big growth potential. I like the product. There are red flags (SPAC, Hindenburg note) but the growth potential is clear. I believe this is a stock that can catch fire and appeal to retail investors. I make low seven figures so losing it all wouldn’t kill me, but certainly would hurt badly. I also think this market is late cycle, which can be perfect timing or terrible. Other stocks I like are BYND, FB and ORCL.",
        "subreddit": "wallstreetbets",
        "title": "DraftKings YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qnux98/draftkings_yolo/",
        "created": 1636210903.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1636918875,
        "id": "qtxly7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n# # 2. Social Metaverse Investing\n\nYou know, before formally introducing this writing, I have to admit that there is a particular challenge when it comes to writing this book and that is modifying for correct predictions or fundamental market shifts. This statement existed in the financial technology chapter but makes more sense to move up  here in the technology introduction where we discuss the evolution of social media. That is because the subject of conversation for the next few years will be the metaverse or the third iteration of the internet. This subject of conversation was essentially referenced in this chapter but the information is far more clear now and requires this final edit or revision. So let's begin.\n\nIt likely makes sense to discuss and break down what a social network really is since it is something that has significantly changed human behavior. I like to invest in what I frame as intent-based social media and this is likely a function of my age and relationship with the internet. An intent-based social media platform is a network where the user is likely to use the application as a tool before considering entertainment. In short, social media exists on a spectrum ranging from intention to entertainment. One could see how a platform like TikTok is geared toward entertainment, while a platform like Pinterest is designed for intention. In this spectrum, we find many others in the middle like YouTube, Twitter, or Reddit.\n\nThis spectrum is critical to understand because it governs what kind of algorithms are used to drive the platform. In the case of entertainment-based media, like Instagram or TikTok, the platform seeks to understand the user so that it can fetch content that will entertain them. Entertainment is a highly subjective endeavor which forces the platforms to depend on algorithms to connect users and content. It is the open field form. On the other side, the intent-based platform serves a designed function and relationship with the content creator. For example, we visit Pinterest to create useful ideas, allowing content-creators to focus on the context of the platform. Google indexes websites so that users can portal into a library of website owners and services. Reddit curates loyal communities to drive its information and space.\n\nThe critical element of this spectrum is the complex conversations that drive privacy and security on platforms. Social media is how we interface with the internet and it is what we refer to as the second iteration of the internet. To briefly shift the tone of this conversation, the entertainment platform suffer from misinformation and propaganda driven campaigns. This is a natural consequence of relying on algorithms that depend on short and effective messaging and may ultimately affect intent-based platforms that orbit closer to entertainment, like Reddit or Youtube. They are called Influencers after all. The conversations surrounding privacy ultimately discuss these worst-case scenarios, so they're important to be mindful of historically and forward-looking.\n\nWith this issue highlighted, I would like to admit that one of my prediction about Facebook was correct. It will exist in social media forever, due to most applications using Facebook's software development ecosystems to create websites and applications on any device. This is similar to how Oracle will essentially exist forever as part of the computing world due to its widespread demand for system maintenance and improvements. This is set in stone and Facebook's drive for the metaverse ultimately points to how the leadership behind Facebook understands that social media is a forum that ebbs and flows with the population over time. So let's explore the thinking behind the leading social media platform and why it knows how to navigate and pivot its product over the years and how it lead to Roblox becoming Facebook's primary competitor for the next decade by examining Pinterest so that we can understand what social media truly is as a first generation investor.\n\nA social media platform is a forum. A forum is a place, meeting, or medium where ideas and views on a particular issue can be exchanged. Each forum accomplishes this in its own unique way.  Twitter is fundamentally used to search for what someone is saying, while Pinterest is used to search for ideas. Pinterest is a particularly interesting case due to hundreds of millions of women adopting the platform and achieving what Google+ had failed to accomplish - a social media platform that harnesses the power of search. I believe this is also an interesting examination of how influential women are to the market. One can question if Apple or Google would be as successful as they are without the seismic changes that the American workforce has adapted.\n\nThis spectrum distinction continues be important when investing in internet forums like Facebook, Twitter, or Snapchat because an investor would not want to mistake the differences between companies like Home Depot or Walmart. Both organizations exist in the retailing space, but the nature of the business, its incentives, and its customers are worlds apart. So is Pinterest a social media platform, search service, or both? With this in mind, we might begin to see why Facebook implementing a hashtag, Instagram implementation stories, or TikTok implementing streams may be irrelevant when understanding the full potential of a service like Snapchat or Twitter and the wisdoms the drive its growth in the market. Before ever investing in a company you need to discover and completely understand the incentives that drive the customers to return to the product. Without that, you are ultimately gambling in the market and driving through a fog hoping that things will turn out well.\n\nWhat drives a social networking site is a user’s incentive to search or discover information in that particular forum. As a result, examining social networking sites can be a lot like comparing shopping centers, such that a shopper is incentivized to go to a location for a particular reason that is best served by that institution. Pinterest uses pins, Reddit uses subreddits, and Google uses links - all having unique advantages as a means to distribute information.\n\nThe forum may take on a different medium. Google is used to answer information, Facebook allows us to connect, while online gaming satisfies our needs for adventure. When you examine the nature of a forum and a user’s incentive to participate in that forum, you’ll come to understand why a applications like Twitter, Pinterest, or online games like Roblox are a force of nature. These forums engage and fulfill our very real needs and demands as social beings. It will also help you understand why companies like Facebook would endeavor in metaverse products like virtual reality games and other forms of social media.\n\nPinterest is closer to the adoption of applications like YouTube or Reddit, where users aren't necessarily sharing their profiles with friends and use the applications to search for information that they find meaningful to them. This is what is known as “personal media” rather than typical “social media”. This is a characteristic that I believe grants a media platform a longer product lifespan. It will also be quite relevant when it comes to conversations about how users interact with the metaverse. Clearly, there will be users that enjoy the extroverted elements of it, while introverted users may prefer the personal media aspects of it. What I try to imagine is that the Instagram \"mall\" may be a more social space than the Pinterest \"mall\" in the metaverse.\n\nThe network-effect that built Pinterest has mostly been driven by women across all social-economic statuses, resulting in profound economic consequences across global households. What this ultimately results in is word-of-mouth adoption, where families learn how to use Pinterest as a tool and search engine rather than an application to connect with friends or family. As a result, Pinterest’s recommendation model is geared to advertise to women-influenced interests, which we will touch on shortly.  This has long-term positive consequences for product advertisers regardless of culture - which is exactly why Pinterest is performing remarkably well with international user adoption. Most American customers have already been effectively registered, where nearly 100 million American women are monthly active users.  \n\nThese customers are voluntarily searching for ads. Behaviorally, this means that Pinterest’s customers are in a high willingness to engage with things that result in action. In other words, a Pinterest user is logging in because they need to start, plan, and consume something in the near future. Customers do not need to be influenced into a product when the customer is coming onto the application with completely different expectations and incentives to search and shop. This is effectively a sweet spot for advertisers, as they know they’re getting top \"real estate\" advertisements. With a simple search, you’re welcomed to a rich library of consumable ideas for health, gifts, beauty, travelling, home developments, and millions of other regularly marketed products that influence the home.\n\nPinterest users have an incredibly high willingness to engage as a function of using the platform as a power tool. This willingness to engage inevitably translates into a willingness to pay. Pinterest was not designed to make a user spend hours mindlessly scrolling for content to discover random nuggets of entertainment. It was designed to make a sale and keep a customer happy outside of Pinterest so that the customer develops a positive relationship with the tool. That is fundamentally different from Facebook’s connect-everything approach to social-networking. It is less wasteful and more effective.\n\nYou may wonder why Pinterest essentially dominates the Google Images real estate when searching for images. This is a pretty complicated question to answer since the search engine optimization market is relatively new. As a rule of thumb, try to imagine that Google Search is more or less \"the web\", where website links are the lifeblood to Google search. A good link is extremely valuable to Google.\n\nDue to this relationship, it is in Google's interest to attempt to create a system that best serves their customer by offering the best, fastest, and most well-rounded results. This means that the most utilized or most well-developed websites are often the top results in a Google search.  This partially explains why searching for \"Lebron James\" today will result in search results by websites like Twitter, Wikipedia, Instagram, and other supersites.  Similarly, searching for \"Vegan food near me\" will produce results by organizations like Yelp and Doordash.\n\nThere are many other reasons of course, but this is a rough rule of thumb; the more well-developed a website is, the more likely that it will dominate web search results. As the web progresses, the definition of well-developed changes. An example of this is that Google begins to rank and prefer websites that implement privacy, page-load speed, and other important internet accessibility practices. This benefits organizations like Pinterest who develop tools like in-app browsers and support integration with applications like Zoom, Etsy, Shopify, and other large-scale platforms.\n\nWhy is Google doing this? Because they want high web standards as a global competitor and global leader of the internet. Part of the global competition is shaping the internet’s development to consider people that have high latency connections since software can scale faster than some of the hardware that is available around the globe. The internet is ultimately the access to information, which is as statistically scarce as the access to clean water and sanitation around the globe. In this regard, Google and Facebook compete rather aggressively.\n\nI totally love the fact that the network-effect behind Pinterest is built by women, but not necessarily for women. I am carefully monitoring the results of this network-effect as I believe that it will have long-term consequences on family life and scale as one of the most valuable internet properties similar to how Roblox breeched the family household and maintained relevancy over the years. I feel that this kind of product design will eventually create a deeper gravity for advertisers, where they know that Pinterest and things like Roblox are a reliable and effective advertising space.\n\nI use Facebook and Instagram every day, resulting in nothing. I regularly seek to delete it. I use Pinterest a few times a month at most. The difference is, every time I use Pinterest, I follow up or plan to follow up with some consumer behavior. And Facebook is pivoting itself to exist in such a way that it is impossible to delete. That, to me, is incredible.",
        "subreddit": "wallstreetbets",
        "title": "My Mental Model For Investing in Social Media Featuring Pinterest",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qtxly7/my_mental_model_for_investing_in_social_media/",
        "created": 1636947675.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1636074406,
        "id": "qmzo6g",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Thursday, November 4, 2021**\n\nThe good times keep on rolling! The remarkable rally in the S&amp;P 500 (SPY) and tech-heavy Nasdaq (QQQ) continued, which each index recording fresh intraday highs the day after the Federal Reserve’s decision to being tapering the pace of quantitative easing as the US economy reaches the “substantial progress” benchmark outlined by the Fed back in December 2020.\n\nAs was widely expected and extensively talked about on these recaps, the Fed announced it would begin tapering the pace of quantitative easing this month. As a reminder QE is one of the most powerful tools the fed has to help underpin the economy and financial markets during times of stress or crises (like the pandemic). Since last year, the Fed had been running QE at a clip of $120 billion per month. That pace will now begin to slow. \n\nThe Fed said in a statement, “In light of the substantial further progress the economy has made toward the Committee’s goals since last December, the Committee decided to begin reducing the monthly pace of its net asset purchases by $10 billion for Treasury securities and $5 billion for agency mortgage-backed securities. \n\nSpecifically, the Fed said it would begin reducing its asset purchases this month by a total of $15 billion, and then by another $15 billion in December, but said the outlook for the pace of tapering in the future would depend on \"changes in the economic outlook.\" Fed Chair Jerome Powell also reiterated his prior stance that the ultimate end of the tapering process next year would not automatically signal the start to interest rate hikes. \n\nNew weekly jobless claims came at a fresh pandemic-era low, with further improvements in the labor market coming as companies continue to compete to attract and retain workers amid elevated demand. New jobless claims came in at the lowest level since March 2020 at the beginning of the coronavirus pandemic. Here are the numbers:\n\n* **Initial unemployment claims, week ended October 30:** 269,000 vs. 275,000 expected and a revised 283,000 during prior week\n* **Continuing claims, week ended October 23:** 2.105. million vs. 2.147 million expected and a revised 2.239 million during prior week \n\n**Highlights**\n\n* NVIDIA (NVDA), my absolute favorite stock in the market, was on fire today, up double digit gains to cross $300 for the first time and topping $750 billion. This is the next $1 trillion stock IMO. The surge happened due to Wells Fargo raising price target $330, citing the metaverse as a major growth contributor\n* According to a report by the Wall Street Journal, Hertz and Tesla (TSLA) are working out how quickly the rental car company can receive its 100,000 cars delivered\n\n[https://www.wsj.com/articles/hertz-will-have-to-wait-for-teslas-just-like-other-buyers-11636028622?st=pgmbhcmxarriey5\\&amp;amp;reflink=article\\_copyURL\\_share](https://www.wsj.com/articles/hertz-will-have-to-wait-for-teslas-just-like-other-buyers-11636028622?st=pgmbhcmxarriey5&amp;amp;reflink=article_copyURL_share)\n\n* Ford Motor (F) said it plans to retire up to $5 billion in high-interest debt and tap into the fast-growing market for \"green\" bonds to help it finance new electric vehicles and expand credit to customers with lower scores.\n* Britain could speed up a move to make the executives of big techs firm criminally liable for harmful content on their platforms if they do not take action to tackle the problem, Digital Minister Nadine Dorries told lawmakers on Thursday.\n* Google is pursuing a massive cloud-computing contract with the Department of Defense, nearly three years after abandoning a similar bid process in the face of employee protests.\n* Google said on Thursday it plans to allow third party payment systems in South Korea in order to comply with a new law that bans major app store operators from forcing software developers to use their payments systems.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Albemarle (ALB) target raised by Oppenheimer from $296 to $307 at Outperform. Stock currently around $272\n* Booking (BKNG) with a host of target raises. Average price target $2900 at Buy. Stock currently around $2435\n* Costco (COST) with a host of target raises. Average price target $550 at Outperform. Stok currently around $515\n* CVS Health (CVS) with a host of target raises. Average price target $110 at Buy. Stock currently around $95\n* Electronic Arts (EA) with four target raises. Stock currently around $143\n   * Robert W Baird from $1170 to $175 at Outperform\n   * Credit Suisse from$175 to $177 at Outperform\n   * Rayond James from $177 to $185 at Outperform\n* Generac (GNRC) with two target raises. Stock currently around $450\n   * Citigroup from $520 to $560 at Buy\n   * Argus from $475 to $510\n* Humana (HUM) with a host of target raises. Average price target $500 at Outpeform. Stock currently around $450\n* Nio (NIO) target raised by Deutsche Bank from $60 to $70 at Buy. Stock currently around $43\n* NVIDIA (NVDA) target raised by Wells Fargo from $245 to $320 at Overweight. Stock currently around $305\n* Paycom (PAYC) target raised by KeyCorp from $475 to $575 at Overweight. Stock currently $512\n* Qualcomm (QCOM) with a host of target raises. Average price target $185 at Buy. Stock currently around $156\n* SolarEdge Technologies (SEDG) with two target raises. Stock currently around $350\n   * Truist from $340 to $395 at Buy\n   * BMO Capital Markets from $357 to $390 at Outperform\n\n“The greatest glory in living lies not in never falling, but in rising every time we fall”. *-Nelson Mandela*",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, Nov 4, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/qmzo6g/here_is_a_market_recap_for_today_thursday_nov_4/",
        "created": 1636103206.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1635979437,
        "id": "qm6crn",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Tuesday, November 3, 2021**\n\nThe market continued its march higher, with all three major indexes remarkably posting fresh intraday highs. The market gapped up in the last few hours of the session after the release of the Federal Reserve’s monthly monetary policy decision, which came in exactly how market participants wanted. The Russell 2000 (IWM) broke out in a big way today, finally breaking the $234.5 resistance it was battling with all year. Overall a great day for the markets. \n\nAs was widely expected and extensively talked about on these recaps, the Fed announced it would begin tapering the pace of quantitative easing this month. As a reminder QE is one of the most powerful tools the fed has to help underpin the economy and financial markets during times of stress or crises (like the pandemic). Since last year, the Fed had been running QE at a clip of $120 billion per month. That pace will now begin to slow. \n\nThe Fed said in a statement, “In light of the substantial further progress the economy has made toward the Committee’s goals since last December, the Committee decided to begin reducing the monthly pace of its net asset purchases by $10 billion for Treasury securities and $5 billion for agency mortgage-backed securities. \n\nThe best part, and what propelled markets higher the last hour of market, was that the Fed’s decision did not come with an updated timeline regarding the interest rate.\n\nStill, the persistently hotter-than-expected inflationary pressures in the recovering economy have put the Fed in a difficult spot when it comes to waiting on rate hikes, many economists argued. These elevated levels of inflation might push the Fed to raise rates more quickly than previously telegraphed, some maintained. And in the Fed's latest policy statement Wednesday, the central bank slightly updated its remarks on inflation, saying that \"Inflation is elevated, largely reflecting factors that are expected to be transitory.\" In September, the Fed had said inflation was \"elevated, largely reflecting transitory factors.\" \n\nIn a later press conference, Fed Chair Jerome Powell said of current inflationary pressures, “The inflation that we’re seeing is really not due to a tight labor market. It’s due to bottlenecks and it’s due to shortages and it’s due to very strong demand meeting those. We don’t see troubling increases in wages, and we don’t expect those to emerge.”\n\nHe reiterated that there is further ground to cover in regards to maximum employment, one of the fundamental data points the Fed looks at when deciding policy. Powell said, “It is time to taper we think because the economy has achieved substantial further progress toward our goals measured for last December. We don’t think it’s time yet to raise interest rates. There is still ground to cover to reach maximum employment both in terms of employment and terms of participation.”\n\nOn a personal note, I want to say I commend the Fed for successfully avoiding another taper tantrum, like the one we saw in 2013 when the markets went into meltdown after the Fed announced they would begin to taper QE. In the end the fears were massively overblown. I saw a lot of fear mongering regarding tapering this time around glad that was avoided.\n\n**Highlights**\n\n* Tesla (TSLA) stock was on the rise today again after Uber announced Tesla cars will be available to buy or lease as part of a green initiative for the ride-hailing company\n* Netflix (NFLX) announced that subscribers with Android phones or tablets can start playing mobile games on its app, an effort by the company to push into gaming. A Netflix subscription is required but there is no additional cost. \n* Elon Musk clarified via Twitter (TWTR) that there was no contract signed yet between Hertz and Tesla (TSLA) to buy the 100,000 EVs. A Hertz spokeswoman said deliveries of Tesla had already started. A link on Hertz’s website gives users the option to rent a Tesla Model 3. However, Hertz declines to comment beyond its original statement saying, “We don’t discuss the details of our business relationships or discussions with any auto maker or partner”.\n* With the recent surge in Tesla, Elon Musk became the first person to have a personal net worth surpassing $300 billion, absolutely insane. If he were a company, he’d be a top 30 company in the US by market cap by himself.\n* Green Bay Quarterback Aaron Rodgers teamed up with Square (SQ) to give away $1 million in BT.... as part of a promotion and will begin receiving part of his massive $33.5 million salary in that currency. \n* Amazon (AMZN) seeks approval from the Federal Communications Commission to launch two Project Kuiper satellites in 2022. Similar to SpaceX, it intends to be a broad constellation of internet and broadband satellites.\n* EV startup Rivian which is backed by Amazon (AMZN) and Ford Motors (F) announced it was seeking a $53 billion valuation in its upcoming IPO\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Akamai Technology target raised by Morgan Stanley from $119 to $130. Stock currently around $111\n* Cummins (CMI) with two target raises. Stock currently around $235\n   * Morgan Stanley from $252 to $262 at Equal Weight\n   * Credit Suisse from $295 to $304\n* ConocoPhillips (COP) target raised by Wells Fargo from $82 to $84 at Overweight. Stock currently around $73\n* Catalent (CTLT) target raised by Morgan Stanley from $147 to $160 at Overweight. Stock currently around $136\n* Caesars Entertainment (CZR) target raised by Wells Fargo from $140 to $145 at Overweight. Stock currently around $110\n* Esee Lauder (EL) with a host of target raises. Average price target $400 at Buy. Stock currently around $340\n* Generac (GNRC) with four very bullish target raises. Stock currently around $453\n   * Roth Capital from $500 to $555 at Buy\n   * Canaccord Genuity from $515 to $575 at Buy\n   * KeyCorp from $520 to $540 at Outperform\n   * Oppeinheimer from $500 to $540 at Outperform\n* Lyft (LYFT) target raised by Citigroup from $88 to $95 at Buy. Stock currently around $49\n* Paycom (PAYC) with a host of target raises. Average price target $575 at Buy. Stock currently around $512\n* SolarEdge (SEDG) with a host of target raises. Average price target $400 at Buy. Stock currently around $353\n\n“Many of life’s failures are people who did not realize how close they were to success when they gave up.” - Thomas Edison",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, Nov 3, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/qm6crn/here_is_a_market_recap_for_today_wednesday_nov_3/",
        "created": 1636008237.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1636074437,
        "id": "qmzoj1",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Thursday, November 4, 2021**\n\nThe good times keep on rolling! The remarkable rally in the S&amp;P 500 (SPY) and tech-heavy Nasdaq (QQQ) continued, which each index recording fresh intraday highs the day after the Federal Reserve’s decision to being tapering the pace of quantitative easing as the US economy reaches the “substantial progress” benchmark outlined by the Fed back in December 2020.\n\nAs was widely expected and extensively talked about on these recaps, the Fed announced it would begin tapering the pace of quantitative easing this month. As a reminder QE is one of the most powerful tools the fed has to help underpin the economy and financial markets during times of stress or crises (like the pandemic). Since last year, the Fed had been running QE at a clip of $120 billion per month. That pace will now begin to slow. \n\nThe Fed said in a statement, “In light of the substantial further progress the economy has made toward the Committee’s goals since last December, the Committee decided to begin reducing the monthly pace of its net asset purchases by $10 billion for Treasury securities and $5 billion for agency mortgage-backed securities. \n\nSpecifically, the Fed said it would begin reducing its asset purchases this month by a total of $15 billion, and then by another $15 billion in December, but said the outlook for the pace of tapering in the future would depend on \"changes in the economic outlook.\" Fed Chair Jerome Powell also reiterated his prior stance that the ultimate end of the tapering process next year would not automatically signal the start to interest rate hikes. \n\nNew weekly jobless claims came at a fresh pandemic-era low, with further improvements in the labor market coming as companies continue to compete to attract and retain workers amid elevated demand. New jobless claims came in at the lowest level since March 2020 at the beginning of the coronavirus pandemic. Here are the numbers:\n\n* **Initial unemployment claims, week ended October 30:** 269,000 vs. 275,000 expected and a revised 283,000 during prior week\n* **Continuing claims, week ended October 23:** 2.105. million vs. 2.147 million expected and a revised 2.239 million during prior week \n\n**Highlights**\n\n* NVIDIA (NVDA), my absolute favorite stock in the market, was on fire today, up double digit gains to cross $300 for the first time and topping $750 billion. This is the next $1 trillion stock IMO. The surge happened due to Wells Fargo raising price target $330, citing the metaverse as a major growth contributor\n* According to a report by the Wall Street Journal, Hertz and Tesla (TSLA) are working out how quickly the rental car company can receive its 100,000 cars delivered\n\n[https://www.wsj.com/articles/hertz-will-have-to-wait-for-teslas-just-like-other-buyers-11636028622?st=pgmbhcmxarriey5\\&amp;amp;reflink=article\\_copyURL\\_share](https://www.wsj.com/articles/hertz-will-have-to-wait-for-teslas-just-like-other-buyers-11636028622?st=pgmbhcmxarriey5&amp;amp;reflink=article_copyURL_share)\n\n* Ford Motor (F) said it plans to retire up to $5 billion in high-interest debt and tap into the fast-growing market for \"green\" bonds to help it finance new electric vehicles and expand credit to customers with lower scores.\n* Britain could speed up a move to make the executives of big techs firm criminally liable for harmful content on their platforms if they do not take action to tackle the problem, Digital Minister Nadine Dorries told lawmakers on Thursday.\n* Google is pursuing a massive cloud-computing contract with the Department of Defense, nearly three years after abandoning a similar bid process in the face of employee protests.\n* Google said on Thursday it plans to allow third party payment systems in South Korea in order to comply with a new law that bans major app store operators from forcing software developers to use their payments systems.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Albemarle (ALB) target raised by Oppenheimer from $296 to $307 at Outperform. Stock currently around $272\n* Booking (BKNG) with a host of target raises. Average price target $2900 at Buy. Stock currently around $2435\n* Costco (COST) with a host of target raises. Average price target $550 at Outperform. Stok currently around $515\n* CVS Health (CVS) with a host of target raises. Average price target $110 at Buy. Stock currently around $95\n* Electronic Arts (EA) with four target raises. Stock currently around $143\n   * Robert W Baird from $1170 to $175 at Outperform\n   * Credit Suisse from$175 to $177 at Outperform\n   * Rayond James from $177 to $185 at Outperform\n* Generac (GNRC) with two target raises. Stock currently around $450\n   * Citigroup from $520 to $560 at Buy\n   * Argus from $475 to $510\n* Humana (HUM) with a host of target raises. Average price target $500 at Outpeform. Stock currently around $450\n* Nio (NIO) target raised by Deutsche Bank from $60 to $70 at Buy. Stock currently around $43\n* NVIDIA (NVDA) target raised by Wells Fargo from $245 to $320 at Overweight. Stock currently around $305\n* Paycom (PAYC) target raised by KeyCorp from $475 to $575 at Overweight. Stock currently $512\n* Qualcomm (QCOM) with a host of target raises. Average price target $185 at Buy. Stock currently around $156\n* SolarEdge Technologies (SEDG) with two target raises. Stock currently around $350\n   * Truist from $340 to $395 at Buy\n   * BMO Capital Markets from $357 to $390 at Outperform\n\n“The greatest glory in living lies not in never falling, but in rising every time we fall”. *-Nelson Mandela*",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, Nov 4, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/qmzoj1/here_is_a_market_recap_for_today_thursday_nov_4/",
        "created": 1636103237.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1635979481,
        "id": "qm6da1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Tuesday, November 3, 2021**\n\nThe market continued its march higher, with all three major indexes remarkably posting fresh intraday highs. The market gapped up in the last few hours of the session after the release of the Federal Reserve’s monthly monetary policy decision, which came in exactly how market participants wanted. The Russell 2000 (IWM) broke out in a big way today, finally breaking the $234.5 resistance it was battling with all year. Overall a great day for the markets. \n\nAs was widely expected and extensively talked about on these recaps, the Fed announced it would begin tapering the pace of quantitative easing this month. As a reminder QE is one of the most powerful tools the fed has to help underpin the economy and financial markets during times of stress or crises (like the pandemic). Since last year, the Fed had been running QE at a clip of $120 billion per month. That pace will now begin to slow. \n\nThe Fed said in a statement, “In light of the substantial further progress the economy has made toward the Committee’s goals since last December, the Committee decided to begin reducing the monthly pace of its net asset purchases by $10 billion for Treasury securities and $5 billion for agency mortgage-backed securities. \n\nThe best part, and what propelled markets higher the last hour of market, was that the Fed’s decision did not come with an updated timeline regarding the interest rate.\n\nStill, the persistently hotter-than-expected inflationary pressures in the recovering economy have put the Fed in a difficult spot when it comes to waiting on rate hikes, many economists argued. These elevated levels of inflation might push the Fed to raise rates more quickly than previously telegraphed, some maintained. And in the Fed's latest policy statement Wednesday, the central bank slightly updated its remarks on inflation, saying that \"Inflation is elevated, largely reflecting factors that are expected to be transitory.\" In September, the Fed had said inflation was \"elevated, largely reflecting transitory factors.\" \n\nIn a later press conference, Fed Chair Jerome Powell said of current inflationary pressures, “The inflation that we’re seeing is really not due to a tight labor market. It’s due to bottlenecks and it’s due to shortages and it’s due to very strong demand meeting those. We don’t see troubling increases in wages, and we don’t expect those to emerge.”\n\nHe reiterated that there is further ground to cover in regards to maximum employment, one of the fundamental data points the Fed looks at when deciding policy. Powell said, “It is time to taper we think because the economy has achieved substantial further progress toward our goals measured for last December. We don’t think it’s time yet to raise interest rates. There is still ground to cover to reach maximum employment both in terms of employment and terms of participation.”\n\nOn a personal note, I want to say I commend the Fed for successfully avoiding another taper tantrum, like the one we saw in 2013 when the markets went into meltdown after the Fed announced they would begin to taper QE. In the end the fears were massively overblown. I saw a lot of fear mongering regarding tapering this time around glad that was avoided.\n\n**Highlights**\n\n* Tesla (TSLA) stock was on the rise today again after Uber announced Tesla cars will be available to buy or lease as part of a green initiative for the ride-hailing company\n* Netflix (NFLX) announced that subscribers with Android phones or tablets can start playing mobile games on its app, an effort by the company to push into gaming. A Netflix subscription is required but there is no additional cost. \n* Elon Musk clarified via Twitter (TWTR) that there was no contract signed yet between Hertz and Tesla (TSLA) to buy the 100,000 EVs. A Hertz spokeswoman said deliveries of Tesla had already started. A link on Hertz’s website gives users the option to rent a Tesla Model 3. However, Hertz declines to comment beyond its original statement saying, “We don’t discuss the details of our business relationships or discussions with any auto maker or partner”.\n* With the recent surge in Tesla, Elon Musk became the first person to have a personal net worth surpassing $300 billion, absolutely insane. If he were a company, he’d be a top 30 company in the US by market cap by himself.\n* Green Bay Quarterback Aaron Rodgers teamed up with Square (SQ) to give away $1 million in BTC as part of a promotion and will begin receiving part of his massive $33.5 million salary in that currency. \n* Amazon (AMZN) seeks approval from the Federal Communications Commission to launch two Project Kuiper satellites in 2022. Similar to SpaceX, it intends to be a broad constellation of internet and broadband satellites.\n* EV startup Rivian which is backed by Amazon (AMZN) and Ford Motors (F) announced it was seeking a $53 billion valuation in its upcoming IPO\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Akamai Technology target raised by Morgan Stanley from $119 to $130. Stock currently around $111\n* Cummins (CMI) with two target raises. Stock currently around $235\n   * Morgan Stanley from $252 to $262 at Equal Weight\n   * Credit Suisse from $295 to $304\n* ConocoPhillips (COP) target raised by Wells Fargo from $82 to $84 at Overweight. Stock currently around $73\n* Catalent (CTLT) target raised by Morgan Stanley from $147 to $160 at Overweight. Stock currently around $136\n* Caesars Entertainment (CZR) target raised by Wells Fargo from $140 to $145 at Overweight. Stock currently around $110\n* Esee Lauder (EL) with a host of target raises. Average price target $400 at Buy. Stock currently around $340\n* Generac (GNRC) with four very bullish target raises. Stock currently around $453\n   * Roth Capital from $500 to $555 at Buy\n   * Canaccord Genuity from $515 to $575 at Buy\n   * KeyCorp from $520 to $540 at Outperform\n   * Oppeinheimer from $500 to $540 at Outperform\n* Lyft (LYFT) target raised by Citigroup from $88 to $95 at Buy. Stock currently around $49\n* Paycom (PAYC) with a host of target raises. Average price target $575 at Buy. Stock currently around $512\n* SolarEdge (SEDG) with a host of target raises. Average price target $400 at Buy. Stock currently around $353\n\n“Many of life’s failures are people who did not realize how close they were to success when they gave up.” - Thomas Edison",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Wednesday, Nov 3, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/qm6da1/here_is_a_market_recap_for_today_wednesday_nov_3/",
        "created": 1636008281.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1635980721,
        "id": "qm6stw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **Winners**  \n\n\nWinner of the day by sector | **SP500**:  \n\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | Expeditors International of Wshngtn Inc | **EXPD** | 4.75%  \n2. **Health Care** | Centene Corp | **CNC** | 6.58%  \n3. **Information Technology** | Akamai Technologies, Inc. | **AKAM** | 5.46%  \n4. **Communication Services** | T-Mobile Us Inc | **TMUS** | 5.30%  \n5. **Consumer Discretionary** | Tapestry Inc | **TPR** | 5.53%  \n6. **Utilities** | NiSource Inc. | **NI** | 2.22%  \n7. **Financials** | People's United Financial, Inc. | **PBCT** | 4.26%  \n8. **Materials** | FMC Corp | **FMC** | 12.62%  \n9.  **Real Estate** | Weyerhaeuser Co | **WY** | 5.86%  \n10. **Consumer Staples** | Kroger Co | **KR** | 5.45%  \n11. **Energy** | Coterra Energy Inc | **CTRA** | 2.98%  \n\n\n**Losers**  \n\n\nLoser of the day by sector | **SP500**:  \n\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **Generac Holdings Inc.** | GNRC | **-6.24%**  \n2. Health Care | **Charles River Laboratories Intl. Inc** |  CRL | **-10.22%**  \n3. Information Technology | **Paycom Software Inc** | PAYC | **-7.36%**  \n4.  Communication Services | **Activision Blizzard, Inc.** | ATVI | **-14.06%**  \n5. Consumer Discretionary | **Chipotle Mexican Grill, Inc.** | CMG | **-1.25%**  \n6. Utilities | **American Water Works Company Inc** | AWK | **-4.97%**  \n7. Financials | **Aon PLC** | AON | **-3.21%**  \n8. Materials | **LyondellBasell Industries NV** | LYB | **-0.85%**  \n9. Real Estate | **SBA Communications Corporation** | SBAC | **-1.77%**  \n10. Consumer Staples | **SYSCO Corporation** | SYY | **-0.30%**  \n11. Energy | **Halliburton Company** | HAL | **-2.60%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 11/3/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/qm6stw/sp500_winners_and_losers_1132021/",
        "created": 1636009521.0
    }
]