[
    {
        "author": "louied91",
        "created_utc": 1610116056,
        "id": "kt3h1l",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " NEW YORK, NY, Jan. 08, 2021 (GLOBE NEWSWIRE) -- Tauriga Sciences, Inc. (OTCQB: TAUG) (“Tauriga” or the “Company”), a revenue generating, diversified life sciences company, with a proprietary line of functional “supplement” chewing gums (Flavors: Pomegranate, Blood Orange, Peach-Lemon, Pear Bellini, Mint, Black Currant) as well as two ongoing Biotechnologies initiatives, today announced that it has increased its product liability insurance “Aggregate” coverage to $10,000,000 (previously it had been $8,000,000).  This increase was completed due to substantial levels of interest (from potential retailers and major distributors), in carrying the Tauri-Gum™ product line.  The Company has been evaluating a number of opportunities and is specifically cognizant of margins and quality of revenue – when it comes to choosing the right distribution partner(s) or retailer(s) to enter into relationships with.  The Company also recently disclosed, the development of a 7th SKU of its flagship brand Tauri-Gum™.  \n\n\nIn other news, the Company continues to experience overall strength in its highest margin E-Commerce business segment.  On Thursday January 7, 2021 the Company established a new daily record (“24-hour period”) for the # of individual online orders with 111 (the previous record had been 103, set on November 25, 2020).  \n\nLastly, effective January 6, 2021, the Company has officially moved to a new corporate headquarters:\n\nPlease see Below:\n\nTauriga Sciences Inc.\n\n4 Nancy Court, Suite 4\n\nWappingers Falls, NY 12590\n\nThis change in corporate headquarters was enacted for safety and efficiency purposes, in response to the continued surge of the Pandemic.  \n\n[https://www.otcmarkets.com/stock/TAUG/news/story?e&amp;id=1780620](https://www.otcmarkets.com/stock/TAUG/news/story?e&amp;id=1780620)",
        "subreddit": "pennystocks",
        "title": "$TAUG Tauriga Sciences Inc. Increases its Product Liability Insurance Coverage to $10,000,000",
        "url": "https://www.reddit.com/r/pennystocks/comments/kt3h1l/taug_tauriga_sciences_inc_increases_its_product/",
        "created": 1610144856.0
    },
    {
        "author": "Im_shorting_elon",
        "created_utc": 1610500968,
        "id": "kw5pvz",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Just curious, has anyone ever told a Japanese investor from 1989 \"time in the market beats timing the market\"? \n\nHistorically, at least in America, \"buy and hold\" has been the go-to adage for investing guidance and one to live by, but just be careful in what you put your money into. A lot of companies although great, are grossly overvalued. There's a reason why the Chicago Bulls paid Michael Jordan $30M per season but not $300M. \n\nSome companies that still trade have never recovered from the Dotcom Bubble. Others took more than 15 years just to break even. Just be cognizant of that.",
        "subreddit": "investing",
        "title": "Time In The Market&gt;",
        "url": "https://www.reddit.com/r/investing/comments/kw5pvz/time_in_the_market/",
        "created": 1610529768.0
    }
]