[
    {
        "author": "zerggross",
        "created_utc": 1615989258,
        "id": "m70xcm",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "CanadianInvestor",
        "title": "I sold APH too early, why? Wife is mad I've been losing all our savings!",
        "url": "https://i.redd.it/diq59t73gln61.png",
        "created": 1616018058.0
    },
    {
        "author": "electriccabbage69",
        "created_utc": 1614713443,
        "id": "lwaf5y",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Just trying to understand why they all seem to move identically. I know it is not all of them, but the big dogs Aph, Weed, Tilray, Hmmj, etc...",
        "subreddit": "weedstocks",
        "title": "ELI5 - Why do all the potstocks have roughly the same daily graphs?",
        "url": "https://www.reddit.com/r/weedstocks/comments/lwaf5y/eli5_why_do_all_the_potstocks_have_roughly_the/",
        "created": 1614742243.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1614721491,
        "id": "lwdcn5",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, March 2, 2021**\n\nStocks retreated on Tuesday, pulling back after rallying yesterday, underscoring how volatile the market is right now. Market participants continue to focus on the Treasury yields, a new coronavirus vaccine from Johnson &amp; Johnson (JNJ), and additional stimulus from Washington. \n\nThe yield on the 10-year Treasury yield retreated to hover below 1.45% after spiking to a one-year high of 1.61% last week. The swift rise in interest rates last week spooked equity investors last week, with rates reflecting inflationary fears and impacting both corporate and consumer borrowing costs. Last week, during his testimony to Congress, Chair of the Federal Reserve Jerome Powell tried to temper fears over higher rates and inflationary pressures. He said,  rising Treasury yields are a statement of confidence on the part of markets that we’ll have a robust and ultimately complete \\[economic\\] recovery.” Central Bank officials from the United Kingdom and Australia echoed Powell’s sentiments and committed to maintaining accommodative fiscal policies. \n\nOver the weekend, the US Food and Drug Administration (FDA) granted emergency use authorization to Johnson &amp; Johnson’s (JNJ) single-dose coronavirus vaccine, making it the third vaccine approved in the US.  [The company has already begun shipping its COVID-19 vaccine ](https://www.jnj.com/johnson-johnson-announces-u-s-cdc-advisory-committee-recommends-first-single-shot-covid-19-vaccine-for-adults-18-and-older-in-u-s)and expects to deliver more than 100 million doses of the single-shot vaccines during the first half of 2021, including more than 20 million by the end of March. \n\nIn Washington D.C., Senate Majority Leader Chuck Schumer said the Senate is scheduled to begin debating the $1.9 trillion stimulus bill that the House of Representatives recently passed this week, though he did not specify when a vote would be held. \n\n**Highlights**\n\n* Rocket Mortgage (RKT) soared over 70% today, sending the stock to record highs and continuing a dizzying rally in the last few days. Shares were even halted at one point today. In a note to clients, S3 Analytics said, “RKT’s stock price and short selling activity is reminiscent of another recent high flying meme stock – GameStop Inc (GME). Both stocks saw their share price spike due to high retail buying interest (predominantly due to significant social media activity) and an options based gamma squeeze. Both stocks also had/have relatively high short interest and high stock borrow rates which imply strong short-selling demand and limited stock borrow supply.\"\n* After posting strong earnings and rising more than 8% after-hours yesterday, Zoom’s (ZM) stock price cratered today, with the stock going from 8% up to more than 9% down in today’s session.\n* After posting disappointing earnings, NIO’s stock also cratered today, falling more than 12% in today’s session.\n* After the recent controversies, Alibaba (BABA) co-founder Jack MA is now the fourth richest person in China, falling from first place. \n* In a memo to employees, Ant Group’s executive chairman Eric Jing said an IPO was still in the cards.\n* Vizio Holdings, a maker of smart TVs, has filed for an IPO. The company has sold 82.2 million televisions and 11.8 million sound bars since its founding in 2002, the prospectus said.\n* \\***Please note current stock prices were written in the morning pre-market and do not reflect intraday volatility.**\n* C3 AI (AI) target raised by Needham &amp; Co from $193 to $195 at Buy. Stock currently around $121\n* Broadcom (AVGO) target raised by Credit Suisse from $480 to $580 at Outperform. Stock currently around $490\n* Biohaven Pharma (BHVN) target raised by Mizuho from $93 to $103 at Buy. Stock currently around $86\n* Catalent (CTLT) target raised by Argus from $130 to $140 at Buy. Stock currently around $116\n* Intuit (INTU) with a host of target raises. Consensus price target around $450 at Buy. Stock currently around $406\n* Jazz Pharma (JAZZ) target raised by Piper Sandler frm $175 to $205 at Overweight. Stock currently around $169\n* Logitech (LOGI) target raised by Morgan Stanley from $116 to $122 at Overweight. Stock currently around $107.50\n* Oshkosh (OSK) with two target raises. Stock currently around $110. \n   * Citigroup from $100 to $130 at Buy\n   * Raymond James from $100 to $125 at Outperform\n* Palo Alto Networks (PANW) with two target raises. Stock currently around $367\n   * Mizuho from $450 to $475 at Buy\n   * Argus from $410 to $440 at Buy\n* Snapchat (SNAP) with a host of target raises. Consensus price target around $80 at Buy. Stock currently around $67\n* Square (SQ) with a host of target raises. Consensus price target around $300 at Buy. Stock currently around $241\n* Sarepta Therapeutics (SRPT) target raised by SVB Leerink from $125 to $126 at Outperform. Stock currently around $87\n* Workday (WDAY) target raised by Jefferies Financial from $280 to $325 at Buy. Stock currently around $252\n\n“The true investor welcomes volatility ... a wildly fluctuating market means that irrationally low prices will periodically be attached to solid businesses.” - Warren Buffet",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Tuesday, March 2, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/lwdcn5/here_is_a_market_recap_for_today_tuesday_march_2/",
        "created": 1614750291.0
    },
    {
        "author": "Visible_Antelope5010",
        "created_utc": 1614701654,
        "id": "lw5odk",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Introducing ... $SOXL. A 3X Bullish ETF of 80% Semiconductors 20% Semiconductor materials chain. Meaning it goes up 3x or down with it’s holdings. \n\n😍Love that leverage since stocks only go ⬆️ \n\nDo you like Semiconductors? Y/N \n\n\\-Are you bullish on NVDA/AMD 🚀🚀🚀 Y/N\n\n\\-Do you think there’s a Semiconductor shortage? Y/N\n\n\\-Do you like 3x Leverage? \n\n\\-Bears🌈🐻say: “ShoRtaGe MeANs     LeSs PrOFitS”\n\n\\-Yes, they might be constrained now, but it’s only a matter of time, Supply vs Demand. Semiconductor manufacturers will raise prices leading to increased profit that scales with inflation! Semiconductors go brrrr 💵 💵 💵 \n\nDo you really want to bet against:\n\n\\-Stimmy?💉💰💰💰\n\n\\-Government (Nat’l Security) interventions?🕵️🕵️‍♂️\n\n\\-Increased cryptomining, gaming, and EV/AI chip usage? 🚀🚀🚀\n\nLook around and see how hard it is to buy a current GPU at MSRP!\n\nSOXL Just split 15:1, this isn’t really technically bullish sign as it moves 3x based off of its holdings, however: calls, covered calls, puts, etc are cheaper for you to play!\n\n(620 —&gt; 41 per share as of today) \n\n...To me; it’s bullish AF, it means more people can play.\n\nFor the retards (like me): \n\nLove the call options on dips- 3x leverage off of 100x leverage from option(s) = Get Tendies or Die Tryin’  🍗 💀 \n\n1 yr return: +105.96% 😍 \n\nHoldings: (80% Semiconductor Manufactures, 20% Semiconductor Equipment)\n\nTop Holdings:\n\nBroadcom Limited, Qualcomm, Intel, Texas Instruments, Nvidia, AMD, Intel, Micron Technology, Taiwan Seminductor, Analog Devices, Applied Material, Lam Research (See Direxion Website)\n\n⚠️Warning ⚠️ : tanks hard on dips but that’s when you buy MOAR calls for insane gains.\n\nSee Posted Positions:Shares @ ATHs &amp; dips (pre split)\n\nCalls @ ATHs &amp; dips \n\n(My Entry: Everyday) - Shares\n\nCalls at dips\n\n📷📷\n\n*Processing img n1vvvtye3nk61...*\n\n*Processing img cw8tg1ze3nk61...*",
        "subreddit": "wallstreetbets",
        "title": "$SOXL 3X Semiconductor play 🚛🚛🚛🔌🔌🔌",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lw5odk/soxl_3x_semiconductor_play/",
        "created": 1614730454.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1614893130,
        "id": "lxvuo4",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, March 4, 2021**\n\nStocks slumped Thursday once again, continuing the recent sellof. The tech-heavy Nasdaq (QQQ) led the selloff, falling 1.64%. The S&amp;P 500 (SPY) fell 1.24% and the Dow Jones (DIA) fell 1.07%. At session lows, both the Nasdaq and S&amp;P 500 erased 2021’s gains. \n\nThe moves lower came even after a new report on weekly unemployment claims came in better than expected, pointing to improving employment trends. \n\n* **Initial jobless claims:** 745,000 vs. 750,000 expected and a revised 736,000 during the prior week. \n* **Continuing claims:** 4.295 million vs. 4.300 million expected and 4.419 million during the prior week\n\nDuring a public appearance Thursday afternoon, Federal Reserve Chairman Jerome Powell said Thursday that the central bank will be “patient” in keeping interest rates near zero, even if inflationary pressures start to rise. Powell cautioned that as the COVID-19 vaccine rollout continues, the Fed could see signs of rising prices amid surging consumer spending. But the Fed chairman noted that he does not expect higher inflation to turn into anything resembling the double-digit inflation of the 1970s. He said, “If we do see what we believe is likely a transitory increase in inflation, where longer-term inflation expectations are broadly stable at levels consistent with our framework and goals, I expect that we will be patient.”\n\nAs Treasury yields continue to rise, market participants are increasingly rotating out of high-growth names that led the markets in 2020. Technology stocks came under exceptional selling pressure as traders turned their focus to stocks poised to benefit more directly from an impending economic reopening. At the same time, the recent, rapid rise in Treasury yields has also deterred investors from growth stocks, with interest rates closely tied to borrowing costs for companies and consumers. The 10-year Treasury yield climbed to around 1.544% at the time of writing. \n\nIn other news, lawmakers in the Senate are set to begin debating President Biden’s $1.9 trillion stimulus, which was passed by the House of Representatives recently. Democrats are racing to push the legislation forward before the mid-March expiry of augmented Federal unemployment benefits. Republicans do not support the bill because of its size, but through a process called reconciliation, Democrats will be able to pass the bill without support from the other side of the aisle.\n\n**Highlights**\n\n* The decisions by Britain and the United States to suspend retaliatory tariffs will create space for negotiations on an ongoing dispute between Boeing (BA) and Airbus, White House Press Secretary Jen Psaki said on Thursday. \n* President Biden said his administration expects to have enough COVID-19 vaccines for any adult that wants it by the end of May, pulling the targets two months closer than the previous government estimate.\n* U.S. mortgage rates extended their recent leg higher to break above 3% for the first time since July 2020, raising concerns that the housing market's breakneck growth last year may sharply lose momentum.\n* Square (SQ) announced it took a majority stake in music platform Tidal that is owned by rapper Jay-Z. Jay-Z will be added to the board of directors at Square. \n* **Please note that the stock price was written in the morning and does not account for intraday changes.**\n* Airbnb (ABNB) with a host of target raises just over the $200 mark. Stock around $175. Including by Credit Suisse, Piper Sandler, Canaccord Genuity, &amp; Needham\n* Adaptive Biotechnologies (ADPT) had a price target raise by Morgan Stanley from $46 to $60\n* Big target raise for Alarm.com (ALRM) by Raymond James from $75 to $115 at STRONG-BUY\n* American Eagle Outfitters (AEO) target raise\n   * Citigroup from $29 to $32\n   * UBS Group from $31 to $37\n   * Jeffries Financial $30 to $32\n* Broadcom (AVGO) had a price target raise by Oppenheimer from $500 to $575 at OUTPERFORM\n* Carvana (CVNA) received a price target raise by JMP Securities from $250 to $290 at MARKET OUTPERFORM\n* Etsy (ETSY) with host of target raises\n   * Goldman Sachs $178 to $286 BUY\n   * Canaccord Genuity $215 to $270 BUY\n   * Morgan Stanley $93 to $123 UNDERWEIGHT\n   * Roth Capital $235 to $245 BUY\n   * Needham $155 to $235 BUY\n* Fisker (FSR) with a Target raise by Morgan Stanley from $27 to $40 at OVERWEIGHT\n* Futu Holdings (FUTU) Citigroup raise target from $120 to $245 at BUY. This is a big one!\n* Guardant Health (GH) had a price target raise by Morgfan Stanley $MS from $130 to $175\n* HP (HPQ) with a price target raise by Morgan Stanley from $30 to $38 at OVERWEIGHT\n* Liveperson (LPSN)  with a host of target raises. We like it at current elvels with this week’s selloff.\n   * Mizuho $75 to $90 BUY\n   * Needham $65 to $71\n   * Rosenblatt $73 to $75 BUY\n* PetIQ (PETQ) price target raised by Raymond James $35 to $45 OUTPERFORM\n* Renewables Energy Group (REGI) target raised by H.C. Wainwright from $70 to $115 at BUY. This is timely, especially with the selloff. We like it.\n* Twitter (TWTR) with a host of target raises by Goldman Sachs, Pivotal Research, Canaccord Genuity, KeyCorp, Rosenblatt. Most at BUY or OVERWEIGHT with end price target between $90 and $100\n* Shake Shack (SHAK) with host of target raises\n   * Deutsche Bank $70 to $107 HOLD\n   * Piper Sandler $122 to $135 OVERWEIGHT\n   * Morgan Stnaley $87 to $95 EQUAL WEIGHT\n\n“The first rule of investment is ‘buy low and sell high’, but many people fear to buy low because of the fear of the stock dropping even lower. Then you may ask: ‘When is the time to buy low?’ The answer is: When there is maximum pessimism.” - Sir John Templeton",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, March 4, 2021.",
        "url": "https://www.reddit.com/r/stocks/comments/lxvuo4/here_is_a_market_recap_for_today_thursday_march_4/",
        "created": 1614921930.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1614865967,
        "id": "lxkz0j",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to Thursday! Here are your pre-market stock movers &amp; news on this Thursday, March 4th, 2021-\n\n*****\n\n# [What to watch today: Stock futures lower ahead of jobless claims, Powell speech](https://www.cnbc.com/2021/03/04/what-to-watch-stock-futures-lower-ahead-of-jobless-claims-powell-speech.html)\n\n*****\n\n&gt; * Stock futures are pointing to a lower open and a third day of losses for the major U.S. equity averages, as concerns over the level of Treasury yields continues to weigh on Wall Street sentiment. Dow futures implied a loss of more than 40 points, while S&amp;P 500 and Nasdaq futures also were lower. The benchmark S&amp;P 500 dropped 1.3% Wednesday and the tech-heavy Nasdaq sank 2.7%. The 30-stock Dow declined 119 points, or 0.38%. (CNBC)\n\n*****\n\n&gt; * 10-year Treasury yield eases, but holds above 1.45% ahead of Powell’s speech (CNBC)\n\n*****\n\n&gt; * The Dow and S&amp;P 500 have fallen in four of the past five sessions, and the Nasdaq is coming off its biggest two-day loss in six months. Investors are no doubt hoping to hear comforting words from Federal Reserve Chairman Jerome Powell when he addresses the Wall Street Journal Jobs Summit shortly after midday. Due to Monday’s strong rally, the Dow and S&amp;P 500 remain higher for the week, and the Financials and Energy sectors are both up by well over 3% for the week.\n\n*****\n\n&gt; * Top investor John Rogers says to look outside of the S&amp;P 500 to find new opportunities (CNBC PRO)\n\n*****\n\n&gt; * The Labor Department releases its weekly report on initial jobless claims at 8:30 a.m. ET, with economists looking for 750,000 new claims for the week ending Feb. 27. That would be up from the prior week’s 730,000.\n\n*****\n\n&gt; * Revised fourth quarter productivity figures are also out at 8:30 a.m. ET, with consensus forecasts calling for productivity to have fallen 4.7% on an annual basis during the final three months of 2020. The prior estimate had come in at -4.8%.\n\n*****\n\n&gt; * At 10:00 a.m. ET, January factory orders are likely to have jumped 2.3%, according to economists, following a 1.1% increase in December.\nSupermarket operator Kroger (KR) leads this morning’s shortlist of corporate earnings releases, with BJ’s Wholesale (BJ), Burlington Stores (BURL) and Ciena (CIEN) also set to release quarterly numbers. Costco (COST), Broadcom (AVGO), Gap (GPS), SmileDirectClub (SDC) and IMAX (IMAX) are among the companies scheduled to issue earnings releases after today’s closing bell.\n\n*****\n\n&gt; * Top U.S. health officials are warning that highly transmissible variants are threatening the country’s progress on reducing coronavirus cases. New infections dropped sharply after their January peak, but the trend has since stalled even as more Americans are vaccinated against Covid. “So much can turn in the next few weeks,” CDC Director Dr. Rochelle Walensky said Wednesday. “How this plays out is up to us. The next three months are pivotal.” (CNBC)\n\n*****\n\n&gt; * President Joe Biden slams governors for lifting mask mandates, calls it ‘Neanderthal thinking’ (CNBC)\n\n*****\n\n&gt; * Kroger, Starbucks and Target will still require masks in Texas despite end of state mandate (USA Today)\n\n*****\n\n&gt; * Eligibility for Covid vaccines is being rapidly expanded in states across the U.S. in response to growing supply. Residents in Michigan and Indiana who are over 50 years old are now able to be vaccinated; in Connecticut and Arizona, the eligibility is now 55 and up. Johnson &amp; Johnson’s (JNJ) recently cleared single-dose vaccine is being reserved for teachers in Wisconsin and Pennsylvania, part of an increased push across the country to safely reopen schools. Nearly 52 million people in the U.S. have received at least one vaccine dose, representing more than 20% of the country’s adult population. (Associated Press)\n\n&gt; * ‘When will it end?‘: How a changing virus is reshaping scientists’ views on Covid-19 (Reuters)\n\n*****\n\n&gt; * House Democrats approved a wide-ranging piece of election-reform legislation Wednesday night, but the bill — which would restrict partisan gerrymandering and require states to have automatic voter registration, among other provisions — faces an unclear path in the Senate. House Resolution 1 passed mostly on partisan lines and would need to see support from 10 GOP senators to get past the filibuster. (Associated Press)\n\n*****\n\n&gt; * House passes police reform act named for George Floyd (NBC News)\n\n*****\n\n&gt; * The House canceled its session that had been scheduled for today, following a warning from Capitol Police that a militia group may be planning to attempt a breach of the building. In a statement almost two months after the Jan. 6 attack, Capitol Police said it “is aware of and prepared for any potential threats towards members of Congress or towards the Capitol complex.” It also said upgrades to security have been made. The Senate plans to meet as it debates the latest pandemic aid bill. (Reuters)\n\n*****\n\n&gt; * Biden agrees to limit number of people who will get checks in Covid relief plan (CNBC)\n\n*****\n\n&gt; * Apple (AAPL) is being investigated over antitrust concerns by the competition regulator in the U.K. The Competition and Markets Authority said Thursday the probe of the iPhone maker follows complaints from software developers about the company’s App Store, which has faced increased government scrutiny across the globe. For example, the Arizona House of Representatives passed a bill Wednesday that implicitly targets both Apple and Alphabet-owned Google’s (GOOGL) app stores and their policies around payment for developers. (CNBC)\n\n*****\n\n&gt; * Amazon-backed food delivery firm Deliveroo picks London for its blockbuster debut (CNBC)\n\n*****\n\n&gt; * Executive compensation at Chipotle Mexican Grill (CMG) will now be partly tied to achieving the company’s goals on diversity and the environment. The fast-casual burrito chain’s move follows similar steps from Starbucks (SBUX) and McDonald’s (MCD) and comes as individual investors and asset managers alike are placing a greater emphasis on environmental, societal and corporate governance (ESG) issues. For Chipotle, some of its environmental goals include raising its level of organic, local or regeneratively grown or raised food. (CNBC)\n\n*****\n\n&gt; * Walt Disney (DIS) plans to shutter 20% of its brick-and-mortar Disney Store locations, as the company boosts its focus on e-commerce operations. Disney said at least 60 of its locations in North America will close. Globally, there are about 300 Disney Stores. The Covid pandemic led to increased adoption of online shopping, with some saying the health crisis has accelerated the shift that was already in place. Disney did not say how the store closings will impact financial results. (CNBC)\n\n*****\n\n&gt; * Hedge fund Melvin Capital, which found itself at the center of the Reddit-sparked GameStop (GME) frenzy in January, saw a return of nearly 22% in February. Melvin had been short the video-game retailer before its stock took off as retail traders piled into the name, and the Gabe Plotkin-led fund ultimately declined 53% in January. (CNBC)\n\n*****\n\n&gt; * A prototype rocket from Elon Musk’s SpaceX exploded Wednesday, not long after it landed for the first time following a test flight. It’s not clear what caused the explosion, or whether it was intentional. On two previous test flights for the Starship prototype, in December and February, the rockets were unable to slow down enough and exploded on impact during an attempted landing. SpaceX, last valued at $74 billion, is working on the stainless steel Starship with the intention of launching people and cargo to the moon and Mars. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/J6h9Mk1.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/rATH7nP.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/rOdBDLP.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zRvHdP7.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/PbURZ3R.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/oqzviWR.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/c3skY5c.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/5esjaX3.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK!](https://i.imgur.com/fECqXkU.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/WHjaGxE.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/o587sap.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/nFW9lIO.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/U2z3zPp.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/cBS142Z.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.postimg.cc/T3p1yRnM/divical1.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.postimg.cc/L6yh6qY3/divical2.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* SKT\n* NIO\n* BFT\n* SLGG\n* GE\n* SNOW\n* MAC\n* SDGR\n* SOAC\n* MANA.X\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/03/04/stocks-making-the-biggest-moves-in-the-premarket-okta-marvell-technology-vroom-more.html)**)\n\n*****\n\n&gt; **Okta (OKTA)** – Okta tanked 10.5% in premarket trading after announcing it is buying customer management software provider Auth0 for $6.5 billion in stock. The provider of identity management software also reported quarterly earnings of 6 cents per share, compared to consensus forecasts of a 1 cent per share loss. Okta also gave a weaker-than-expected current-quarter earnings forecast.\n\n&gt; #**STOCK SYMBOL:** OKTA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=OKTA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/OKTA)**)\n\n*****\n\n&gt; **Marvell Technology (MRVL)** – Marvell shares fell 5.9% in the premarket after the chipmaker issued a disappointing outlook and said chip supplies could remain tight throughout the fiscal year. Marvell matched estimates with its latest quarterly earnings, with revenue coming in above analysts’ forecasts.\n\n&gt; #**STOCK SYMBOL:** MRVL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MRVL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRVL)**)\n\n*****\n\n&gt; **Vroom (VRM)** – Vroom tumbled 14.9% in premarket action after it reported a wider-than-expected loss for its latest quarter, although the online used-car seller’s revenue came in above estimates.\n\n&gt; #**STOCK SYMBOL:** VRM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VRM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VRM)**)\n\n*****\n\n&gt; **BJ’s Wholesale (BJ)** – The warehouse retailer earned 70 cents per share for its latest quarter, beating the 67 cents a share consensus estimate. Revenue topped forecasts as well, and an ex-fuel comparable-store sales increase of 15.9% beat the 15.5% increase anticipated by analysts polled by FactSet. BJ’s declined to provide guidance for 2021 due to pandemic-related uncertainty. Its shares lost 1.6% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** BJ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BJ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BJ)**)\n\n*****\n\n&gt; **Burlington Stores (BURL)** – The retailer of apparel and other merchandise reported quarterly earnings of $2.44 per share, 32 cents a share above estimates. Revenue also exceeded Wall Street forecasts. Comparable-store sales were flat for the quarter versus expectations of a 10% drop.\n\n&gt; #**STOCK SYMBOL:** BURL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BURL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BURL)**)\n\n*****\n\n&gt; **Ciena (CIEN)** – The networking equipment maker beat estimates by 7 cents a share, with quarterly profit of 52 cents per share. Revenue also topped analysts’ projections. Ciena shares fell 3.1% in the premarket, despite beating forecasts.\n\n&gt; #**STOCK SYMBOL:** CIEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CIEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CIEN)**)\n\n*****\n\n&gt; **Rocket Companies (RKT)** – Rocket shares moved between gains and losses in premarket trading, following the wide swings of the past few days. The Quicken Loans parent’s stock plunged 33% Wednesday after surging 71% the day before, amid increased attention in online financial forums. The shares were up 1.8% in the premarket.\n\n&gt; #**STOCK SYMBOL:** RKT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RKT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RKT)**)\n\n*****\n\n&gt; **CureVac (CVAC)** – The German drugmaker’s shares rose 4.1% in the premarket after Novartis (NVS) said it would help CureVac manufacture its Covid-19 vaccine once the drug is approved by regulators.\n\n&gt; #**STOCK SYMBOL:** CVAC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CVAC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CVAC)**)\n\n*****\n\n&gt; **Walt Disney (DIS)** – Disney plans to close about 60 of its brick-and-mortar Disney Store locations in North America by the end of the year, as it shifts its focus to its e-commerce operations. There are currently about 300 of the stores worldwide. Disney shares fell 1% in premarket action.\n\n&gt; #**STOCK SYMBOL:** DIS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DIS)**)\n\n*****\n\n&gt; **General Electric (GE)** – GE shares gained 2.2% in the premarket after Morgan Stanley raised its price target on the stock to a Street-high of $17 per share from $13 a share, based in part on a possibly significant recovery in GE’s aviation segment.\n\n&gt; #**STOCK SYMBOL:** GE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GE)**)\n\n*****\n\n&gt; **Amazon.com (AMZN)** – Amazon is in talks with the National Football League to carry a significant number of games exclusively on its Prime video service, according to people familiar with the matter who spoke to The Wall Street Journal. The deal could see Amazon pay $1 billion for exclusive rights to most Thursday games.\n\n&gt; #**STOCK SYMBOL:** AMZN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AMZN)**)\n\n*****\n\n&gt; **Snowflake (SNOW)** – Snowflake lost nearly $199 million in the fourth quarter, more than double the year-ago loss for the cloud database software company. Revenue more than doubled as well during the quarter, topping consensus forecasts. Following a record initial public offering for a software company last year, the lockup on the sale of insider shares will expire tomorrow.\n\n&gt; #**STOCK SYMBOL:** SNOW\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SNOW&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SNOW)**)\n\n*****\n\n&gt; **American Eagle (AEO)** – American Eagle beat estimates by 3 cents a share, with quarterly profit of 39 cents per share. The apparel retailer’s revenue came in slightly above Wall Street forecasts. American Eagle is also forecasting its best first-quarter sales in three years, driven by growth in its Aerie loungewear and lingerie brand. American Eagle rose 2.2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** AEO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AEO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AEO)**)\n\n*****\n\n&gt; **Walmart (WMT)** – Walmart’s Flipkart unit is exploring the idea of a U.S. listing, possibly through a special purpose acquisition company (SPAC) merger, according to people familiar with the matter who spoke to Bloomberg. Walmart bought a majority stake in the India-based e-commerce company in 2018.\n\n&gt; #**STOCK SYMBOL:** WMT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WMT)**)\n\n*****\n\n&gt; **Splunk (SPLK)** – The analytics software company reported quarterly profit of 38 cents per share, well above the consensus estimate of 4 cents a share. Splunk also delivered better-than-expected revenue. Its shares gained 3.4% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** SPLK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SPLK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SPLK)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Thursday, March 4th, 2021! :)**",
        "subreddit": "smallstreetbets",
        "title": "(3/4) Thursday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lxkz0j/34_thursdays_premarket_stock_movers_news/",
        "created": 1614894767.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1614893205,
        "id": "lxvvo1",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, March 4, 2021**\n\nStocks slumped Thursday once again, continuing the recent selloff. The tech-heavy Nasdaq (QQQ) led the selloff, falling 1.64%. The S&amp;P 500 (SPY) fell 1.24% and the Dow Jones (DIA) fell 1.07%. At session lows, both the Nasdaq and S&amp;P 500 erased 2021’s gains. \n\nThe moves lower came even after a new report on weekly unemployment claims came in better than expected, pointing to improving employment trends. \n\n* **Initial jobless claims:** 745,000 vs. 750,000 expected and a revised 736,000 during the prior week. \n* **Continuing claims:** 4.295 million vs. 4.300 million expected and 4.419 million during the prior week\n\nDuring a public appearance Thursday afternoon, Federal Reserve Chairman Jerome Powell said Thursday that the central bank will be “patient” in keeping interest rates near zero, even if inflationary pressures start to rise. Powell cautioned that as the COVID-19 vaccine rollout continues, the Fed could see signs of rising prices amid surging consumer spending. But the Fed chairman noted that he does not expect higher inflation to turn into anything resembling the double-digit inflation of the 1970s. He said, “If we do see what we believe is likely a transitory increase in inflation, where longer-term inflation expectations are broadly stable at levels consistent with our framework and goals, I expect that we will be patient.”\n\nAs Treasury yields continue to rise, market participants are increasingly rotating out of high-growth names that led the markets in 2020. Technology stocks came under exceptional selling pressure as traders turned their focus to stocks poised to benefit more directly from an impending economic reopening. At the same time, the recent, rapid rise in Treasury yields has also deterred investors from growth stocks, with interest rates closely tied to borrowing costs for companies and consumers. The 10-year Treasury yield climbed to around 1.544% at the time of writing. \n\nIn other news, lawmakers in the Senate are set to begin debating President Biden’s $1.9 trillion stimulus, which was passed by the House of Representatives recently. Democrats are racing to push the legislation forward before the mid-March expiry of augmented Federal unemployment benefits. Republicans do not support the bill because of its size, but through a process called reconciliation, Democrats will be able to pass the bill without support from the other side of the aisle.\n\n**Highlights**\n\n* The decisions by Britain and the United States to suspend retaliatory tariffs will create space for negotiations on an ongoing dispute between Boeing (BA) and Airbus, White House Press Secretary Jen Psaki said on Thursday. \n* President Biden said his administration expects to have enough COVID-19 vaccines for any adult that wants it by the end of May, pulling the targets two months closer than the previous government estimate.\n* U.S. mortgage rates extended their recent leg higher to break above 3% for the first time since July 2020, raising concerns that the housing market's breakneck growth last year may sharply lose momentum.\n* Square (SQ) announced it took a majority stake in music platform Tidal that is owned by rapper Jay-Z. Jay-Z will be added to the board of directors at Square. \n* **Please note that the stock price was written in the morning and does not account for intraday changes.**\n* Airbnb (ABNB) with a host of target raises just over the $200 mark. Stock around $175. Including by Credit Suisse, Piper Sandler, Canaccord Genuity, &amp; Needham\n* Adaptive Biotechnologies (ADPT) had a price target raise by Morgan Stanley from $46 to $60\n* Big target raise for Alarm.com (ALRM) by Raymond James from $75 to $115 at STRONG-BUY\n* American Eagle Outfitters (AEO) target raise\n   * Citigroup from $29 to $32\n   * UBS Group from $31 to $37\n   * Jeffries Financial $30 to $32\n* Broadcom (AVGO) had a price target raise by Oppenheimer from $500 to $575 at OUTPERFORM\n* Carvana (CVNA) received a price target raise by JMP Securities from $250 to $290 at MARKET OUTPERFORM\n* Etsy (ETSY) with host of target raises\n   * Goldman Sachs $178 to $286 BUY\n   * Canaccord Genuity $215 to $270 BUY\n   * Morgan Stanley $93 to $123 UNDERWEIGHT\n   * Roth Capital $235 to $245 BUY\n   * Needham $155 to $235 BUY\n* Fisker (FSR) with a Target raise by Morgan Stanley from $27 to $40 at OVERWEIGHT\n* Futu Holdings (FUTU) Citigroup raise target from $120 to $245 at BUY. This is a big one!\n* Guardant Health (GH) had a price target raise by Morgfan Stanley $MS from $130 to $175\n* HP (HPQ) with a price target raise by Morgan Stanley from $30 to $38 at OVERWEIGHT\n* Liveperson (LPSN)  with a host of target raises. We like it at current elvels with this week’s selloff.\n   * Mizuho $75 to $90 BUY\n   * Needham $65 to $71\n   * Rosenblatt $73 to $75 BUY\n* PetIQ (PETQ) price target raised by Raymond James $35 to $45 OUTPERFORM\n* Renewables Energy Group (REGI) target raised by H.C. Wainwright from $70 to $115 at BUY. This is timely, especially with the selloff. We like it.\n* Twitter (TWTR) with a host of target raises by Goldman Sachs, Pivotal Research, Canaccord Genuity, KeyCorp, Rosenblatt. Most at BUY or OVERWEIGHT with end price target between $90 and $100\n* Shake Shack (SHAK) with host of target raises\n   * Deutsche Bank $70 to $107 HOLD\n   * Piper Sandler $122 to $135 OVERWEIGHT\n   * Morgan Stnaley $87 to $95 EQUAL WEIGHT\n\n“The first rule of investment is ‘buy low and sell high’, but many people fear to buy low because of the fear of the stock dropping even lower. Then you may ask: ‘When is the time to buy low?’ The answer is: When there is maximum pessimism.” - Sir John Templeton",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, March 4, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/lxvvo1/here_is_a_market_recap_for_today_thursday_march_4/",
        "created": 1614922005.0
    },
    {
        "author": "Visible_Antelope5010",
        "created_utc": 1614699566,
        "id": "lw4t8w",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Introducing ... $SOXL. A 3X Bullish ETF of 80% Semiconductors 20% Semiconductor materials chain. Meaning it goes up 3x or down with it’s holdings. \n😍Love that leverage since stocks only go ⬆️ \n\nDo you like Semiconductors? Y/N \n-Are you bullish on NVDA/AMD 🚀🚀🚀 Y/N\n-Do you think there’s a Semiconductor shortage? Y/N\n-Do you like 3x Leverage? \n                -Bears🌈🐻say: “ShoRtaGe MeANs     LeSs PrOFitS”\n\n-Yes, they might be constrained now, but it’s only a matter of time, Supply vs Demand. Semiconductor manufacturers will raise prices leading to increased profit that scales with inflation! Semiconductors go brrrr 💵 💵 💵 \n\nDo you really want to bet against:\n-Stimmy?💉💰💰💰\n-Government (Nat’l Security) interventions?🕵️🕵️‍♂️\n-Increased cryptomining, gaming, and EV/AI chip usage? 🚀🚀🚀\n\nLook around and see how hard it is to buy a current GPU at MSRP!\n\nSOXL Just split 15:1, this isn’t really technically bullish sign as it moves 3x based off of its holdings, however: calls, covered calls, puts, etc are cheaper for you to play!\n\n(620 —&gt; 41 per share as of today) \n\n...To me; it’s bullish AF, it means more people can play.\nFor the retards (like me): \n\nLove the call options on dips- 3x leverage off of 100x leverage from option(s) = Get Tendies or Die Tryin’  🍗 💀 \n\n1 yr return: +105.96% 😍 \n\nHoldings: (80% Semiconductor Manufactures, 20% Semiconductor Equipment)\n\nTop Holdings:\nBroadcom Limited, Qualcomm, Intel, Texas Instruments, Nvidia, AMD, Intel, Micron Technology, Taiwan Seminductor, Analog Devices, Applied Material, Lam Research (See Direxion Website)\n\n⚠️Warning ⚠️ : tanks hard on dips but that’s when you buy MOAR calls for insane gains.\n\nSee Posted Positions:Shares @ ATHs &amp; dips (pre split)\n                 Calls @ ATHs &amp; dips \n\n(My Entry: Everyday) - Shares\nCalls at dips",
        "subreddit": "smallstreetbets",
        "title": "Tired of Meme Stocks? $SOXL 3X Semiconductor play 🚛🚛🚛🔌🔌🔌",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lw4t8w/tired_of_meme_stocks_soxl_3x_semiconductor_play/",
        "created": 1614728366.0
    },
    {
        "author": "AAces_Wild",
        "created_utc": 1614723944,
        "id": "lwe8t3",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "DISCLAIMER: Please do your own research - no investment is without risk, and may lose value.\n\nMarket Cap = 146M. Share price at close = $7.91\n\nSECTOR: Information Technology, INDUSTRY: Technology Hardware, Storage &amp; Peripherals\n\nSummary: One Stop Systems, Inc. designs, manufactures, and markets custom **high-speed computing systems** for high-performance edge computing applications in the US and internationally. Its GPU expansion units add hundreds of computing cores and teraflops of computing performance to virtually any original equipment manufacturer server. OSS' flash storage arrays provide hundreds of terabytes of storage and **millions of input/output operations per second** (see applications, below). It also offers servers for PCI express-over-cable expansion; desktop expansion appliances in various configurations that add input/output flexibility to any user's desktop system; **PCIe expansions,** and ruggedized mobile high-performance compute devices to meet specialized requirements for devices deployed at the edge in **various environmental conditions**. One Stop Systems, Inc. was founded in 1998 and is headquartered in Escondido, California. \n\nAPPLICATIONS \\- buckle in, exciting stuff.\n\nWith wide-ranging applications like AI, autonomous cars, and military technologies we don't even know exist yet (laser tech, threat detection, missile targeting), \"edge computing\" is sure to expand and meet growing demand for high-performance computing able to provide millions of actionable data points every second. In January 2021, OSS announced their 4th military contract via project “Orange Gear,” an AI system that enables U.S. Navy aircraft to conduct real-time AI-powered threat detection. Shooting down enemy assets, what guides the weapon? OSS enables the second-to-second calculations to achieve such precision. \n\nInteresting fact: OSS chief sales and marketing officer Jim Ison says they are going to “expand the support of wartime theater applications for [land, sea, air and space](http://www.globenewswire.com/fr/news-release/2021/01/05/2153506/0/en/OSS-Wins-Fourth-Program-with-Major-Military-Contractor.html).” ***SPACE***. What an incredible hint of things to come! The final frontier, space exploration represents a vast yet untapped potential area of edge computing expansion. Heck, the previous administration just created a new *branch of the military* specifically for protecting America’s interests above the stratosphere. Also consider that the USA, with a defense budget of $700 billion annually, will likely purchase American-made edge computing tech in-house, avoiding adversaries like China. OSS seems here to stay.\n\nWhile military contracts might not whet your appetite, consider autonomous driving. OSS’ ingenious “AI on the Fly” enables in-vehicle “ruggedized” autonomous driving. Here is a company rep, much smarter than myself, excited to provide more detail on [OSS' computing devices](https://www.youtube.com/watch?v=MAagBi_j4cA&amp;ab_channel=InsideHPCReport) in self-driving vehicles.\n\nSo what is a PCIe? The PCIe is the motherboard site that interfaces with a computer's graphics cards, hard drive adapter, SSDs, Wi-Fi, and Ethernet hardware connections. In June 2020, OSS introduced the [world’s first](https://www.globenewswire.com/news-release/2020/06/22/2051412/0/en/OSS-Introduces-World-s-First-PCIe-Gen-4-Expansion-System-for-NVIDIA-A100-PCIe-GPUs.html#:~:text=(Nasdaq%3A%20OSS)%2C%20a,20X%20over%20the%20previous%20generation) PCIe Gen4 Expansion System that fully supports NVIDIA A100 Tensor Core GPUs, which can boost computing performance up to 20X over the previous generation. The OSS Gen4 Expansion System allows system developers to scale out almost any Gen4 server by adding up to eight NVIDIA A100 GPUs. The system is ideal for boosting the performance of compute-intensive applications like **AI training, AI inference, video analytics and XR rendering**. What is XR rendering? X is just a placeholder! Virtual, Mixed, or Augmented reality (VR, MR, or AR, respectively) experiences include those where users generate new forms of reality by bringing digital objects into the physical world and those that see the bringing physical world objects into the digital world. Yes, OSS also powers augmented reality applications.\n\nINDUSTRY - is there growth to “Edge Computing” as a field? \n\n[MarketsandMarkets](https://www.marketsandmarkets.com/Market-Reports/edge-computing-market-133384090.html#:~:text=Edge%20computing%20can%20be%20used,%2C%20healthcare%2C%20and%20many%20others) projects the global edge computing market to grow from **$3.6 billion in 2020 to $15.7 billion by 2025**, at a Compound Annual Growth Rate (CAGR) of 34.1% during the forecast period. Factors such as the growing adoption of Internet of Things (IoT) across industries; rising demand for low-latency processing and real-time, automated decision-making solutions; and a need for surmounting exponentially increasing data volumes and network traffic.\n\nPARTNERSHIPS\n\nOSS is diversified in its partnerships with the big boys - Apple, Nvidia, Intel, AMD, Boeing, IBM, Lenovo, HP, and [many others](https://www.onestopsystems.com/partners).\n\nMEAT AND POTATOES - finances \n\nFollowing IPO in 2018, OSS already generates $60 million in revenue, increasing 45% YOY. \n\nHow about its market share? To find a company’s size, or “market cap,” multiply the current share price by the number of shares. OSS clocks in with 16,620,000 shares x $7.91 = 131M. For a company with a 130M market cap, $60M in revenue represents very strong revenue (46%) to its size. For comparison’s sake, NVDA market cap is 335B and generates 16.7B annually (5%). With 31% institutional ownership – and [increasing](https://fintel.io/so/us/oss) – this is certainly on the radar of the big players.\n\nA note about earnings per share (EPS) - OSS’ earnings announcement is coming between March 19 and 25. Based on two analyst forecasts, the consensus EPS forecast for the quarter is $0.04 with 12.17M revenue. Indeed, OSS has quickly transformed itself into a profitable enterprise with [consistent revenue beats](https://seekingalpha.com/symbol/OSS/earnings) to boot. \n\nBALANCE SHEET\n\nIn short, OSS has 40M in assets, 11M in liabilities and 2M total debt. \n\n*Processing img 0357jvc0uok61...*\n\nLEADERSHIP\n\nFormerly the interim head, now-CEO [David Raun](https://www.globenewswire.com/news-release/2020/06/25/2053412/0/en/OSS-Appoints-David-Raun-Technology-Industry-Veteran-as-President-CEO.html) has two decades of experience in the PCIe area, and led PLX Technology to record revenue and profits before getting acquired by Broadcom (AVGO).\n\nCOMPETITORS\n\nForget the stellar partnerships, what about the competition? Within the well-differentiated industry of Hardware, Storage, and Peripherals are 40 companies ranging from Apple to Ricoh. The direct competitor to watch for is Supermicro (SMCI). SMCI, however, makes no mention of cloud-readiness in its press release (coincidentally publicized merely hours after OSS, on the very same day - nervous, perhaps?). \n\nOn the other hand, the OSS 4UV can connect almost any Gen 4 server to eight A100 PCIe GPUs and two NICs, also offering a complete NVIDIA GPU **cloud-ready solution** with the OSS 4UV pre-installed in an OSS 2U-EOS-4a Gen 4 server.\n\nOFFERING\n\nPremarket Tuesday, March 2nd, OSS announced a 1.5M share offering to an institutional investor. Remarkably, OSS showed strength into the mid-morning, after opening at $7.56 it hit a high of $8.79 before succumbing to general market weakness and closing at $7.91, down 11% (see daily chart below). A green candle the day after an offering? Sounds like a great dip to buy. \n\nTECHNICALS\n\nhttps://preview.redd.it/tf412r4quok61.jpg?width=1522&amp;format=pjpg&amp;auto=webp&amp;s=d061155dc969bb6663af3fd38c9d1014ed799264\n\nVolume has been readily coming in. A stock that previously traded around 40k volume is now averaging big volumes, over 1M+ daily. What happened? I think institutions are beginning to catch on. Currently above the 5, 20, and 50 moving averages, OSS bounced nicely off the 20 MA during a big intra-day rally (40%+) on March 1st, 2021 hitting a fresh 52-week high of $9.50 without apparent news. \n\nCONCLUSIONS\n\nInvestors should ask the question, \"where could this company be in 2 to 3 years?\" With OSS, we have a case study in a profitable company meeting big revenue expectations relatively soon after IPO, invaluable partnerships, military contracts, and anticipatory growth in the industry and beyond.\n\nPOSITIONS: I am in for 1300 shares at $8.60.",
        "subreddit": "pennystocks",
        "title": "One Stop Systems ($OSS) DD: supercomputing is the future",
        "url": "https://www.reddit.com/r/pennystocks/comments/lwe8t3/one_stop_systems_oss_dd_supercomputing_is_the/",
        "created": 1614752744.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1614793616,
        "id": "lwzt2s",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "i have a heavy tech weighted portfolio and while I'm not overly worried I'm wondering if I should be adding JPM and BAC and more industrials to my portfolio or maybe even just adding to my Total Market index.\n\nI realize people are running scared from tech now due to various reasons and the rising 10 yr.\n\nI'm in it though for at least 10 years or more.  Should I be worried about tech and chasing recent market rotations?  I thought that wasn't the thing to do? I feel like I'd be betraying my tech 😆!!  Just joking.\n\nI also see that on average banks and industrials have been rather bad performers for over a decade.\n\nI realize they're \"beat up\", but why would people be moving their money into banks if they don't return much??\n\nIs it that they \"have no where else to put their money\" when rotating from tech?\n\nI realize also it's mostly the big money or smart money that moves the market and not small timers like me.\n\nSo should I just hold my tech?\n\nI'm not just tech though, I'm diversified.\n\nHere are some holdings for example.\n\nIndexes about 18% of portfolio combined\n\n FSKAX AARK VTWG FDIS FSPTX\n\n\nStocks. About up to 5% each\n\nAAPL MSFT make up 18% combined.\n\nUp to 5% each. \n\nCRWD HON NEE NVDA SQ PYPL TSLA UNP AVGO ASML LRCX TMO UNH TSM DG WMT",
        "subreddit": "stocks",
        "title": "Should you chase financials and industrials, etc?",
        "url": "https://www.reddit.com/r/stocks/comments/lwzt2s/should_you_chase_financials_and_industrials_etc/",
        "created": 1614822416.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1614721520,
        "id": "lwdczv",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Tuesday, March 2, 2021**\n\nStocks retreated on Tuesday, pulling back after rallying yesterday, underscoring how volatile the market is right now. Market participants continue to focus on the Treasury yields, a new coronavirus vaccine from Johnson &amp; Johnson (JNJ), and additional stimulus from Washington. \n\nThe yield on the 10-year Treasury yield retreated to hover below 1.45% after spiking to a one-year high of 1.61% last week. The swift rise in interest rates last week spooked equity investors last week, with rates reflecting inflationary fears and impacting both corporate and consumer borrowing costs. Last week, during his testimony to Congress, Chair of the Federal Reserve Jerome Powell tried to temper fears over higher rates and inflationary pressures. He said,  rising Treasury yields are a statement of confidence on the part of markets that we’ll have a robust and ultimately complete \\[economic\\] recovery.” Central Bank officials from the United Kingdom and Australia echoed Powell’s sentiments and committed to maintaining accommodative fiscal policies. \n\nOver the weekend, the US Food and Drug Administration (FDA) granted emergency use authorization to Johnson &amp; Johnson’s (JNJ) single-dose coronavirus vaccine, making it the third vaccine approved in the US.  [The company has already begun shipping its COVID-19 vaccine ](https://www.jnj.com/johnson-johnson-announces-u-s-cdc-advisory-committee-recommends-first-single-shot-covid-19-vaccine-for-adults-18-and-older-in-u-s)and expects to deliver more than 100 million doses of the single-shot vaccines during the first half of 2021, including more than 20 million by the end of March. \n\nIn Washington D.C., Senate Majority Leader Chuck Schumer said the Senate is scheduled to begin debating the $1.9 trillion stimulus bill that the House of Representatives recently passed this week, though he did not specify when a vote would be held. \n\n**Highlights**\n\n* Rocket Mortgage (RKT) soared over 70% today, sending the stock to record highs and continuing a dizzying rally in the last few days. Shares were even halted at one point today. In a note to clients, S3 Analytics said, “RKT’s stock price and short selling activity is reminiscent of another recent high flying meme stock – GameStop Inc (GME). Both stocks saw their share price spike due to high retail buying interest (predominantly due to significant social media activity) and an options based gamma squeeze. Both stocks also had/have relatively high short interest and high stock borrow rates which imply strong short-selling demand and limited stock borrow supply.\"\n* After posting strong earnings and rising more than 8% after-hours yesterday, Zoom’s (ZM) stock price cratered today, with the stock going from 8% up to more than 9% down in today’s session.\n* After posting disappointing earnings, NIO’s stock also cratered today, falling more than 12% in today’s session.\n* After the recent controversies, Alibaba (BABA) co-founder Jack MA is now the fourth richest person in China, falling from first place. \n* In a memo to employees, Ant Group’s executive chairman Eric Jing said an IPO was still in the cards.\n* Vizio Holdings, a maker of smart TVs, has filed for an IPO. The company has sold 82.2 million televisions and 11.8 million sound bars since its founding in 2002, the prospectus said.\n* \\***Please note current stock prices were written in the morning pre-market and do not reflect intraday volatility.**\n* C3 AI (AI) target raised by Needham &amp; Co from $193 to $195 at Buy. Stock currently around $121\n* Broadcom (AVGO) target raised by Credit Suisse from $480 to $580 at Outperform. Stock currently around $490\n* Biohaven Pharma (BHVN) target raised by Mizuho from $93 to $103 at Buy. Stock currently around $86\n* Catalent (CTLT) target raised by Argus from $130 to $140 at Buy. Stock currently around $116\n* Intuit (INTU) with a host of target raises. Consensus price target around $450 at Buy. Stock currently around $406\n* Jazz Pharma (JAZZ) target raised by Piper Sandler frm $175 to $205 at Overweight. Stock currently around $169\n* Logitech (LOGI) target raised by Morgan Stanley from $116 to $122 at Overweight. Stock currently around $107.50\n* Oshkosh (OSK) with two target raises. Stock currently around $110. \n   * Citigroup from $100 to $130 at Buy\n   * Raymond James from $100 to $125 at Outperform\n* Palo Alto Networks (PANW) with two target raises. Stock currently around $367\n   * Mizuho from $450 to $475 at Buy\n   * Argus from $410 to $440 at Buy\n* Snapchat (SNAP) with a host of target raises. Consensus price target around $80 at Buy. Stock currently around $67\n* Square (SQ) with a host of target raises. Consensus price target around $300 at Buy. Stock currently around $241\n* Sarepta Therapeutics (SRPT) target raised by SVB Leerink from $125 to $126 at Outperform. Stock currently around $87\n* Workday (WDAY) target raised by Jefferies Financial from $280 to $325 at Buy. Stock currently around $252\n\n“The true investor welcomes volatility ... a wildly fluctuating market means that irrationally low prices will periodically be attached to solid businesses.” - Warren Buffet",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today, Tuesday, March 2, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/lwdczv/here_is_a_market_recap_for_today_tuesday_march_2/",
        "created": 1614750320.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1614865895,
        "id": "lxky5e",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to Thursday! Here are your pre-market stock movers &amp; news on this Thursday, March 4th, 2021-\n\n*****\n\n# [What to watch today: Stock futures lower ahead of jobless claims, Powell speech](https://www.cnbc.com/2021/03/04/what-to-watch-stock-futures-lower-ahead-of-jobless-claims-powell-speech.html)\n\n*****\n\n&gt; * Stock futures are pointing to a lower open and a third day of losses for the major U.S. equity averages, as concerns over the level of Treasury yields continues to weigh on Wall Street sentiment. Dow futures implied a loss of more than 40 points, while S&amp;P 500 and Nasdaq futures also were lower. The benchmark S&amp;P 500 dropped 1.3% Wednesday and the tech-heavy Nasdaq sank 2.7%. The 30-stock Dow declined 119 points, or 0.38%. (CNBC)\n\n*****\n\n&gt; * 10-year Treasury yield eases, but holds above 1.45% ahead of Powell’s speech (CNBC)\n\n*****\n\n&gt; * The Dow and S&amp;P 500 have fallen in four of the past five sessions, and the Nasdaq is coming off its biggest two-day loss in six months. Investors are no doubt hoping to hear comforting words from Federal Reserve Chairman Jerome Powell when he addresses the Wall Street Journal Jobs Summit shortly after midday. Due to Monday’s strong rally, the Dow and S&amp;P 500 remain higher for the week, and the Financials and Energy sectors are both up by well over 3% for the week.\n\n*****\n\n&gt; * Top investor John Rogers says to look outside of the S&amp;P 500 to find new opportunities (CNBC PRO)\n\n*****\n\n&gt; * The Labor Department releases its weekly report on initial jobless claims at 8:30 a.m. ET, with economists looking for 750,000 new claims for the week ending Feb. 27. That would be up from the prior week’s 730,000.\n\n*****\n\n&gt; * Revised fourth quarter productivity figures are also out at 8:30 a.m. ET, with consensus forecasts calling for productivity to have fallen 4.7% on an annual basis during the final three months of 2020. The prior estimate had come in at -4.8%.\n\n*****\n\n&gt; * At 10:00 a.m. ET, January factory orders are likely to have jumped 2.3%, according to economists, following a 1.1% increase in December.\nSupermarket operator Kroger (KR) leads this morning’s shortlist of corporate earnings releases, with BJ’s Wholesale (BJ), Burlington Stores (BURL) and Ciena (CIEN) also set to release quarterly numbers. Costco (COST), Broadcom (AVGO), Gap (GPS), SmileDirectClub (SDC) and IMAX (IMAX) are among the companies scheduled to issue earnings releases after today’s closing bell.\n\n*****\n\n&gt; * Top U.S. health officials are warning that highly transmissible variants are threatening the country’s progress on reducing coronavirus cases. New infections dropped sharply after their January peak, but the trend has since stalled even as more Americans are vaccinated against Covid. “So much can turn in the next few weeks,” CDC Director Dr. Rochelle Walensky said Wednesday. “How this plays out is up to us. The next three months are pivotal.” (CNBC)\n\n*****\n\n&gt; * President Joe Biden slams governors for lifting mask mandates, calls it ‘Neanderthal thinking’ (CNBC)\n\n*****\n\n&gt; * Kroger, Starbucks and Target will still require masks in Texas despite end of state mandate (USA Today)\n\n*****\n\n&gt; * Eligibility for Covid vaccines is being rapidly expanded in states across the U.S. in response to growing supply. Residents in Michigan and Indiana who are over 50 years old are now able to be vaccinated; in Connecticut and Arizona, the eligibility is now 55 and up. Johnson &amp; Johnson’s (JNJ) recently cleared single-dose vaccine is being reserved for teachers in Wisconsin and Pennsylvania, part of an increased push across the country to safely reopen schools. Nearly 52 million people in the U.S. have received at least one vaccine dose, representing more than 20% of the country’s adult population. (Associated Press)\n\n&gt; * ‘When will it end?‘: How a changing virus is reshaping scientists’ views on Covid-19 (Reuters)\n\n*****\n\n&gt; * House Democrats approved a wide-ranging piece of election-reform legislation Wednesday night, but the bill — which would restrict partisan gerrymandering and require states to have automatic voter registration, among other provisions — faces an unclear path in the Senate. House Resolution 1 passed mostly on partisan lines and would need to see support from 10 GOP senators to get past the filibuster. (Associated Press)\n\n*****\n\n&gt; * House passes police reform act named for George Floyd (NBC News)\n\n*****\n\n&gt; * The House canceled its session that had been scheduled for today, following a warning from Capitol Police that a militia group may be planning to attempt a breach of the building. In a statement almost two months after the Jan. 6 attack, Capitol Police said it “is aware of and prepared for any potential threats towards members of Congress or towards the Capitol complex.” It also said upgrades to security have been made. The Senate plans to meet as it debates the latest pandemic aid bill. (Reuters)\n\n*****\n\n&gt; * Biden agrees to limit number of people who will get checks in Covid relief plan (CNBC)\n\n*****\n\n&gt; * Apple (AAPL) is being investigated over antitrust concerns by the competition regulator in the U.K. The Competition and Markets Authority said Thursday the probe of the iPhone maker follows complaints from software developers about the company’s App Store, which has faced increased government scrutiny across the globe. For example, the Arizona House of Representatives passed a bill Wednesday that implicitly targets both Apple and Alphabet-owned Google’s (GOOGL) app stores and their policies around payment for developers. (CNBC)\n\n*****\n\n&gt; * Amazon-backed food delivery firm Deliveroo picks London for its blockbuster debut (CNBC)\n\n*****\n\n&gt; * Executive compensation at Chipotle Mexican Grill (CMG) will now be partly tied to achieving the company’s goals on diversity and the environment. The fast-casual burrito chain’s move follows similar steps from Starbucks (SBUX) and McDonald’s (MCD) and comes as individual investors and asset managers alike are placing a greater emphasis on environmental, societal and corporate governance (ESG) issues. For Chipotle, some of its environmental goals include raising its level of organic, local or regeneratively grown or raised food. (CNBC)\n\n*****\n\n&gt; * Walt Disney (DIS) plans to shutter 20% of its brick-and-mortar Disney Store locations, as the company boosts its focus on e-commerce operations. Disney said at least 60 of its locations in North America will close. Globally, there are about 300 Disney Stores. The Covid pandemic led to increased adoption of online shopping, with some saying the health crisis has accelerated the shift that was already in place. Disney did not say how the store closings will impact financial results. (CNBC)\n\n*****\n\n&gt; * Hedge fund Melvin Capital, which found itself at the center of the Reddit-sparked GameStop (GME) frenzy in January, saw a return of nearly 22% in February. Melvin had been short the video-game retailer before its stock took off as retail traders piled into the name, and the Gabe Plotkin-led fund ultimately declined 53% in January. (CNBC)\n\n*****\n\n&gt; * A prototype rocket from Elon Musk’s SpaceX exploded Wednesday, not long after it landed for the first time following a test flight. It’s not clear what caused the explosion, or whether it was intentional. On two previous test flights for the Starship prototype, in December and February, the rockets were unable to slow down enough and exploded on impact during an attempted landing. SpaceX, last valued at $74 billion, is working on the stainless steel Starship with the intention of launching people and cargo to the moon and Mars. (CNBC)\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/J6h9Mk1.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/rATH7nP.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/rOdBDLP.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zRvHdP7.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/PbURZ3R.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/oqzviWR.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/c3skY5c.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/5esjaX3.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK!](https://i.imgur.com/fECqXkU.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/WHjaGxE.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/o587sap.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/nFW9lIO.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/U2z3zPp.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/cBS142Z.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #1!](https://i.postimg.cc/T3p1yRnM/divical1.png)**)\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK #2!](https://i.postimg.cc/L6yh6qY3/divical2.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* SKT\n* NIO\n* BFT\n* SLGG\n* GE\n* SNOW\n* MAC\n* SDGR\n* SOAC\n* MANA.X\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/03/04/stocks-making-the-biggest-moves-in-the-premarket-okta-marvell-technology-vroom-more.html)**)\n\n*****\n\n&gt; **Okta (OKTA)** – Okta tanked 10.5% in premarket trading after announcing it is buying customer management software provider Auth0 for $6.5 billion in stock. The provider of identity management software also reported quarterly earnings of 6 cents per share, compared to consensus forecasts of a 1 cent per share loss. Okta also gave a weaker-than-expected current-quarter earnings forecast.\n\n&gt; #**STOCK SYMBOL:** OKTA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=OKTA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/OKTA)**)\n\n*****\n\n&gt; **Marvell Technology (MRVL)** – Marvell shares fell 5.9% in the premarket after the chipmaker issued a disappointing outlook and said chip supplies could remain tight throughout the fiscal year. Marvell matched estimates with its latest quarterly earnings, with revenue coming in above analysts’ forecasts.\n\n&gt; #**STOCK SYMBOL:** MRVL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MRVL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRVL)**)\n\n*****\n\n&gt; **Vroom (VRM)** – Vroom tumbled 14.9% in premarket action after it reported a wider-than-expected loss for its latest quarter, although the online used-car seller’s revenue came in above estimates.\n\n&gt; #**STOCK SYMBOL:** VRM\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=VRM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/VRM)**)\n\n*****\n\n&gt; **BJ’s Wholesale (BJ)** – The warehouse retailer earned 70 cents per share for its latest quarter, beating the 67 cents a share consensus estimate. Revenue topped forecasts as well, and an ex-fuel comparable-store sales increase of 15.9% beat the 15.5% increase anticipated by analysts polled by FactSet. BJ’s declined to provide guidance for 2021 due to pandemic-related uncertainty. Its shares lost 1.6% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** BJ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BJ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BJ)**)\n\n*****\n\n&gt; **Burlington Stores (BURL)** – The retailer of apparel and other merchandise reported quarterly earnings of $2.44 per share, 32 cents a share above estimates. Revenue also exceeded Wall Street forecasts. Comparable-store sales were flat for the quarter versus expectations of a 10% drop.\n\n&gt; #**STOCK SYMBOL:** BURL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BURL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BURL)**)\n\n*****\n\n&gt; **Ciena (CIEN)** – The networking equipment maker beat estimates by 7 cents a share, with quarterly profit of 52 cents per share. Revenue also topped analysts’ projections. Ciena shares fell 3.1% in the premarket, despite beating forecasts.\n\n&gt; #**STOCK SYMBOL:** CIEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CIEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CIEN)**)\n\n*****\n\n&gt; **Rocket Companies (RKT)** – Rocket shares moved between gains and losses in premarket trading, following the wide swings of the past few days. The Quicken Loans parent’s stock plunged 33% Wednesday after surging 71% the day before, amid increased attention in online financial forums. The shares were up 1.8% in the premarket.\n\n&gt; #**STOCK SYMBOL:** RKT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RKT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RKT)**)\n\n*****\n\n&gt; **CureVac (CVAC)** – The German drugmaker’s shares rose 4.1% in the premarket after Novartis (NVS) said it would help CureVac manufacture its Covid-19 vaccine once the drug is approved by regulators.\n\n&gt; #**STOCK SYMBOL:** CVAC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CVAC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CVAC)**)\n\n*****\n\n&gt; **Walt Disney (DIS)** – Disney plans to close about 60 of its brick-and-mortar Disney Store locations in North America by the end of the year, as it shifts its focus to its e-commerce operations. There are currently about 300 of the stores worldwide. Disney shares fell 1% in premarket action.\n\n&gt; #**STOCK SYMBOL:** DIS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DIS)**)\n\n*****\n\n&gt; **General Electric (GE)** – GE shares gained 2.2% in the premarket after Morgan Stanley raised its price target on the stock to a Street-high of $17 per share from $13 a share, based in part on a possibly significant recovery in GE’s aviation segment.\n\n&gt; #**STOCK SYMBOL:** GE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GE)**)\n\n*****\n\n&gt; **Amazon.com (AMZN)** – Amazon is in talks with the National Football League to carry a significant number of games exclusively on its Prime video service, according to people familiar with the matter who spoke to The Wall Street Journal. The deal could see Amazon pay $1 billion for exclusive rights to most Thursday games.\n\n&gt; #**STOCK SYMBOL:** AMZN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AMZN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AMZN)**)\n\n*****\n\n&gt; **Snowflake (SNOW)** – Snowflake lost nearly $199 million in the fourth quarter, more than double the year-ago loss for the cloud database software company. Revenue more than doubled as well during the quarter, topping consensus forecasts. Following a record initial public offering for a software company last year, the lockup on the sale of insider shares will expire tomorrow.\n\n&gt; #**STOCK SYMBOL:** SNOW\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SNOW&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SNOW)**)\n\n*****\n\n&gt; **American Eagle (AEO)** – American Eagle beat estimates by 3 cents a share, with quarterly profit of 39 cents per share. The apparel retailer’s revenue came in slightly above Wall Street forecasts. American Eagle is also forecasting its best first-quarter sales in three years, driven by growth in its Aerie loungewear and lingerie brand. American Eagle rose 2.2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** AEO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=AEO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AEO)**)\n\n*****\n\n&gt; **Walmart (WMT)** – Walmart’s Flipkart unit is exploring the idea of a U.S. listing, possibly through a special purpose acquisition company (SPAC) merger, according to people familiar with the matter who spoke to Bloomberg. Walmart bought a majority stake in the India-based e-commerce company in 2018.\n\n&gt; #**STOCK SYMBOL:** WMT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WMT)**)\n\n*****\n\n&gt; **Splunk (SPLK)** – The analytics software company reported quarterly profit of 38 cents per share, well above the consensus estimate of 4 cents a share. Splunk also delivered better-than-expected revenue. Its shares gained 3.4% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** SPLK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SPLK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SPLK)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Thursday, March 4th, 2021! :)**",
        "subreddit": "StockMarket",
        "title": "(3/4) Thursday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/StockMarket/comments/lxky5e/34_thursdays_premarket_stock_movers_news/",
        "created": 1614894695.0
    },
    {
        "author": "freehouse_throwaway",
        "created_utc": 1614719860,
        "id": "lwcs10",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "* It's a seesaw market day as all indices attempts to find a clear direction after one of the best bull day in almost 9 months. Alas, after running up 5%+ on Monday, Tim Apple pare gains while Andy Amazon stayed relatively flat until power hour where big tech took a big dump. AAPL closed the day down -2% to $125 while AMZN closed down -1.64%, losing $3,100 yet again. Similar situation with FB at -2.23% and MSFta t -1.30%. With pressure from big bois and all sectors, QQQ/SPY sell off continued into closing hours.\n\n* **RKT** is back on WSB menu after a long hiatus where it never fucking breaks the $22/$23 channel. Things changed yesterday as the largest mortgage lender in the US reported stellar Q4 numbers, with EPS at $1.14 vs consensus of $0.87. For once theta gang does NOT win on RKT even with an implied move of 18%+. Coupled with the special dividend announcement of $1.11 per share, short sellers are being extra squeezed today as shares ran as high as $36+ during intraday high. Despite floating around up 18% to 20% for the day, RKT started sky rocketing as it broke out the channel at 12:47 PM. After touching intraday high of +60%, RKT continued volatite trade with multiple halts as all OTM weeklies goes deep ITM. RKT closed the day up 71% with the rocket continuing in AH. Surely a new round of WSBer going into an \"old\" meme stock won't result in a new group of bagholders!? \n\n* **GME** continues to trade in a new channel with wild swing days as gamma exposure settles from MMs selling Feb options last week. F to the bro that bought way too many $800c 2/26 FDs last week. During intraday high GME was up \"modestly\" at +8% to $133 but gains faded towards end of day to close red at -1.84% to $118. The all-to-important Q4 earnings loom later this month on Wednesday March 24. \n\n* **ZM** reported earnings yesterday and while shares soar 9% AH, the gains didn't translate in open session today as shares fade and sold off towards end of day to close -9% at $372. Q4 EPS was $1.22 vs $0.79 consensus, and they project Q1 EPS of ~$0.97 vs consensus of $0.72 along with full year 2022 of ~$3.65, above consensus of $2.96. Price target was raised to $420 from $390 at Morgan Stanley while Piper Sandler upgrades the video conference company from neutral to overweight, with a PT of $541 (lol wtf). \n\n* **ARK Invest ETFs** traded flat today reflecting many of Cathie's holdings performances as of late (until power dump hour). Sent by Market Jebus himself, Cathie Woods has been dealing with a number of negative news round as chatters floats about of funds targetting her holdings as an attempt to push ARKK, ARKW and others down thanks to recent growth name weakness and a push on redemption - to which Cathie responded in bewildment that her ETF has plenty of liquidity and redemption is never an issue. With selling pressure from ROKU and TSLA, ARKK closed down -2.48% to $133 while ARKW closed down -2.34% to $164.\n\n* **Notable upgrades and downgrades:** BYND, an old WSB meme, stock received an upgrade by Citi from Neutral to Buy. Shares close the day down -5% to $139. Cruise stocks receive an upgrade from Macquarie today with NCLH, RCL, CCL all upgraded to Outperform from Neutral today. On the downgrade side, PLUG took a hit from Barclays from Equal Weight to Underweight, while upping their PT to $29 (up from $21). The meme stock tok a dump today to close -7% to $48.73.\n\n* In WSB meme stock land (okay what isn't a meme stock these days), **AMC** close the day down -2.72% to $8.93. Steel gang (I know you're still out there) are finally slowly crawling back from the depths of theta hell, with **MT** up +3.71%, finally breaking out of $25 once again. **BB** closed down -3.76%, staying in the $10 ranges for now until the next catalyst arrives.\n\n* **Noteworthy ERs:** SNOW and OKTA reports today after market close. On Thursday before market opens: PRPL, and Michaels. After market close: COST, SDC, AVGO, GPS, and WORK. Heavily shorted Chinese education \"platform\" GSX reports Friday before market opens. Watch for TAL and EDU to move in sync with whatever GSX ends up reporting. (Both are good ER play candidate if you don't want to deal with the IV crush from GSX).\n\n* **Notable econ numbers:** ADP employment at 8:15 AM ET, EIA draw at 10:30 AM. Jobless claims report at the usual Thursday 8:30 AM followed by factory orders and EIA at 10:30 AM. Finally, Fri brings us the employment situation with nonfarm payroll numbers at 8:30 AM Friday.\n\n* The DOW closed down -0.46% or +144 pts, Nasdaq down -1.69% or -230 pts, SPX udown -0.81% or -31 pts, and RUT close down -1.93% or -43 pts. Our boi VIX is back in the spotlight again as its up 3.3% to 24+.\n\n* Yesterday's recap: none as its been awhile since I've written these.",
        "subreddit": "wallstreetbets",
        "title": "Reeeeeeeeecap of today's market driving news (March 3, 2021 after market close)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lwcs10/reeeeeeeeecap_of_todays_market_driving_news_march/",
        "created": 1614748660.0
    },
    {
        "author": "Visible_Antelope5010",
        "created_utc": 1614700562,
        "id": "lw57ow",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Introducing ... $SOXL. A 3X Bullish ETF of 80% Semiconductors 20% Semiconductor materials chain. Meaning it goes up 3x or down with it’s holdings. \n\n😍Love that leverage since stocks only go ⬆️ \n\nDo you like Semiconductors? Y/N \n\n\\-Are you bullish on NVDA/AMD 🚀🚀🚀 Y/N\n\n\\-Do you think there’s a Semiconductor shortage? Y/N\n\n\\-Do you like 3x Leverage? (let the pros do some of the work!) \n\n \n\nBears🌈🐻say: “ShoRtaGe MeANs LeSs PrOFitS”\n\nRe: Yes, they might be constrained now, but it’s only a matter of time, Supply vs Demand. Semiconductor manufacturers will raise prices leading to increased profit that scales with inflation. Semiconductors go brrrr 💵 💵 💵 \n\nDo you really want to bet against:\n\n\\-Stimmy?💉💰💰💰\n\n\\-Government (Nat’l Security) interventions?🕵️🕵️‍♂️\n\n\\-Increased cryptomining, gaming, and EV/AI chip usage? 🚀🚀🚀\n\nLook around and see how hard it is to buy a current GPU at MSRP!\n\n&amp;#x200B;\n\nSOXL Just split 15:1, this isn’t really technically bullish sign as it moves 3x based off of its holdings, however: calls, covered calls, puts, etc are cheaper for you to play!\n\n(620 —&gt; 41 per share as of today) \n\n...To me; it’s bullish AF, it means more people can play.\n\nFor the retards (like me): \n\nLove the call options on dips- 3x leverage off of 100x leverage from option(s) = Get Tendies or Die Tryin’  🍗 💀 \n\n1 yr return: +105.96% 😍 \n\nHoldings: (80% Semiconductor Manufactures, 20% Semiconductor Equipment)\n\nTop Holdings:\n\nBroadcom Limited, Qualcomm, Intel, Texas Instruments, Nvidia, AMD, Intel, Micron Technology, Taiwan Seminductor, Analog Devices, Applied Material, Lam Research (See Direxion Website)\n\n⚠️Warning ⚠️ : tanks harder on dips but that’s when you buy MOAR calls for insane gains.\n\nShares @ ATHs &amp; dips 1455 (68 pre split)\n\nCalls @ ATHs &amp; dips \n\n&amp;#x200B;\n\nPosting today cause: dipped\n\n📷📷",
        "subreddit": "wallstreetbets",
        "title": "Tired of Meme Stocks? $SOXL 3X Semiconductor play 🚛🚛🚛🔌🔌🔌",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lw57ow/tired_of_meme_stocks_soxl_3x_semiconductor_play/",
        "created": 1614729362.0
    },
    {
        "author": "PatternBackground463",
        "created_utc": 1615221905,
        "id": "m0jucd",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "RobinHood",
        "title": "Some to buy - Broadcom + Abbott Laboratories + Gold",
        "url": "https://www.reddit.com/r/RobinHood/comments/m0jucd/some_to_buy_broadcom_abbott_laboratories_gold/",
        "created": 1615250705.0
    }
]