[
    {
        "author": "Stantheredditman52",
        "created_utc": 1621433949,
        "id": "ng73bn",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "So the US government is supposed to release government files related to UFOs otherwise known as UAP in June 25. Now to some of you it may not be a big deal but the public may feel different about that. You see, these reports we’ve seen that the government has been releasing “confirming” is just the tip of the iceberg. Now you may not believe aliens are real and that’s fine that you’re that ignorant. We don’t judge. However, the US has been conducting recon missions observing these aerial phenomenons. They know they exist. They know they are here. They do not know their intentions or capabilities. Which is scary to think. \n\nSo how does this relate to stonks? How do you deal with a possible threat that has way better technology than you? You build and invest in better aerospace defensive technology. “Space Defense stocks” more or so space stocks “Trimble, Boeing, Lockheed, or even ETF stocks like ARKX” and others i can’t name off the top of my head. The point is, the public will feel as if we are vulnerable and in doing so the country will pour billions into aerospace defense and technology.\n\nNow I added a link to some compelling information. https://www.cbsnews.com/news/ufo-military-intelligence-60-minutes-2021-05-16/#app\n\nAnother note. There’s a name to one of the spaceships named “Tic Tac” which is known to travel at 35,000 mph and can travel through air and water. Google tic tac.",
        "subreddit": "wallstreetbets",
        "title": "Weird DD, about space and aliens and how it will affect space stocks.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ng73bn/weird_dd_about_space_and_aliens_and_how_it_will/",
        "created": 1621462749.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1620563758,
        "id": "n8ddnn",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "Good Sunday morning to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning May 10th, 2021.\n\n# **Inflation is the big challenge for markets and the Fed in the week ahead - [(Source)](https://www.cnbc.com/2021/05/07/inflation-is-the-big-challenge-for-markets-and-the-fed-in-the-week-ahead.html)**\n*****\n&gt; After April’s disappointing jobs report, market focus will shift squarely to inflation in the week ahead.\n*****\n&gt; The tug-of-war over tech stocks will also continue to be a dominant force in the stock market, after Friday’s bounce more than halved the week’s losses in the S&amp;P technology sector.\n*****\n&gt; The April employment report was extremely disappointing with just 266,000 jobs created, well below the 1 million expected. The Friday report cast doubt on the expectations of some investors that the Fed will move toward paring back its so-called quantitative easing bond purchases later this year.\n*****\n&gt; The thinking is if the inflation data appears hot when the consumer price index is reported Wednesday, it could ignite the debate about whether the Fed will have to tighten policy sooner than it would like. For now, the market is viewing the April jobs data as a distorted one-off report.\n*****\n&gt; “It’s all about the inflation numbers. It’s all about the transitory nature and to what extent we’ll see it,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group “It’s more relevant to the CPI month-over-month changes. If the month-over-month gains are starting to pick up steam, and we’re seeing 0.3% to 0.4%, that’s not transitory and that’s a problem for the Fed.”\n*****\n&gt; Economists expect April CPI to rise 0.2% over March, after a gain of 0.6% the month earlier. But on a year-over-year basis, CPI is expected to look sizzling, jumping 3.6%, according to Dow Jones. That compares to 2.6% the month earlier. Excluding food and fuel, CPI is expected to rise by 0.3% on a month-over-month basis.\n*****\n&gt; The central bank has maintained that the pop in inflation is expected to be transitory.\n*****\n&gt; Multiple Fed speakers are on the calendar, including Vice Chairman Richard Clarida, who speaks a half-hour after the CPI print Wednesday. Other officials speaking include Federal Reserve Board Governor Lael Brainard, New York President John Williams and Dallas Fed President Rob Kaplan.\n*****\n&gt; The producer price index is reported Thursday, and that should confirm a trend of higher prices that is showing up in corporate earnings releases. Another important data point, retail sales is released Friday.\n*****\n&gt; Boockvar said the retail sales report is not as important since it has been artificially boosted by one-time stimulus checks.\n*****\n&gt; “It’s like the steroid era of baseball,” he said. “Who knows how many home runs it would have hit without stimulus.”\n*****\n&gt; # Tech battleground\n&gt; The S&amp;P 500 and Dow finished the past week with gains. The S&amp;P rose 1.2% to 4,232, and 2.7% to 34,777. But the technology-laden Nasdaq fell about 1.5% to 13,752, even with Friday’s 0.9% gain.\n*****\n&gt; In the commodities market, fears of inflation continued to build.\n*****\n&gt; Copper futures hit a record high, as did lumber futures, rising 13% in the past week. Corn futures rose 8.6% in the past week, finishing at the highest level since 2013.\n*****\n&gt; West Texas Intermediate crude futures gained 2% to $64.90 per barrel.\n*****\n&gt; The 10-year note yield, which moves opposite price, was at 1.55%, down from 1.63% a week ago.\n*****\n&gt; Commodities fueled gains in the stock market this week, with the S&amp;P energy sector by far the best performer, up 8.9%. Materials rose 5.9%, followed by financials, which were up 4.2%. Industrials gained 3.4%. But the S&amp;P technology sector slumped 0.5%, for the week even with a 0.8% gain Friday.\n*****\n&gt; “I think one thing that people are overlooking is that the technology selling we’ve seen in the last few days...is not just the reaction to the adverse earnings price reactions that we saw from certain tech names,” said Julian Emanuel, chief equity and derivatives strategist at BTIG.\n*****\n&gt; “But it’s also this idea in that in a world where we assume capital gains taxes could go up, that’s where the capital gains lie,” he added. “So they are likely to come under incrementally more pressure on that basis.”\n*****\n&gt; President Joe Biden has proposed raising capital gains taxes to 39.6% for taxpayers making more than $1 million. That’s up from the current top rate of 20%.\n*****\n&gt; Emanuel said the upcoming federal income tax return filing date of May 17 could also be adding pressure to technology, since investors may be selling winners to pay their taxes.\n*****\n&gt; “With the tax bill coming due on May 17 for the 2020 calendar year, people are just going to use it as an excuse within the context of higher capital gains taxes to sell those stocks to pay for their tax bill,” Emanuel said. “I think people are overlooking this as part of the reason.”\n*****\n&gt; Boockvar said tech names could also face further headwinds from higher interest rates, particularly if inflation data is hotter than expected.\n*****\n&gt; “I think the last couple of weeks tells you froth is coming out of the most expensive part of tech and earnings for the big cap names are as good as it gets in terms of growth rates. The market is telling you that,” he said. “If you get a further move in rates, that’s a headwind.”\n*****\n&gt; Earnings season continues in the week ahead though most of the rush is over for the quarter. Disney, Marriott, Wynn Resorts, Airbnb are among the companies reporting that should provide insight on the economic reopening.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/cUOD0tT.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/VKhtBNU.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/HRLJN3b.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/hjmVj8H.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/S48iOLd.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qIgYv0k.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uOMQGUs.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/OWLEQXc.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qiXLhQt.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/t2D133W.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/5R0emOO.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/ZR1CoYl.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/XWzfbs8.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/yIN4N15.png))**\n\n*****\n\n&gt; # ARKK Stocks Breakdowns and Bounces\n\n&gt; After struggling for most of the past couple months, momentum and Tech stocks are broadly outperforming today as the Nasdaq is up 1.25% compared to a 0.78% gain in the S&amp;P 500. The ARK Innovation ETF (ARKK) has been a poster child of the momentum theme over the past year. After a 383.9% gain from the March 2020 low to its high in mid-February, ARKK has fallen around 30% in the months since then. For most of that time, the ETF consolidated between its 50 and 200-DMA. After a failed attempt to break above its 50-DMA at the end of April, it has taken a leg lower, falling below its 200-DMA for the first time in a year in the process. While ARKK has yet to move back above its 200-DMA, it has found support around $105 which traces back to the lows earlier this spring and the highs from the fall. In other words, from a technical perspective ARKK, as well as some of its holdings, still have plenty of technical hurdles including moving back above its moving averages and breaking the past few months' downtrends. At least for the time being, the group has found some respite in the move higher today.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK.png))**\n\n&gt; As for the individual holdings of the ARKK ETF, below we show the 25 largest which accounts for approximately three-quarters of net asset value. For the most part, these stocks continue to sit on huge gains from the past year (or since their market debut for those that have IPO'ed in the past year; bolded and bordered rows in the table below) with only a small handful in the red: Teladoc (TDOC), Coinbase (COIN), and Iovance Biotherapeutics (IOVA). Even though the 25 largest ARKK holdings are on average up 117% over the past year, they have certainly been a pain trade recently. Most of these names are deeply oversold at the moment, and relative to their 52-week highs, they are down 35% on average. In fact, of all 58 holdings, there are only four—Intercontinental Exchange (ICE), TuSimple (TSP), Trimble (TRMB), and PACCAR (PCAR)—that are less than 10% below their 52-week highs, and none of these break into the top 25 largest holdings (as such they are not pictured below).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK-Table.png))**\n\n&gt; While ARKK holdings have generally been weak over the past few months, in recent days there have been some notable developments in the charts of these names. Some of these like CRISPR Therapeutics (CRSP) and EXACT Sciences (EXAS) have fallen below the long-term 200-DMA. Other names in the ETF broke below their 200-DMA a while ago now, and their charts do not look much better. Stocks like Invitae (NVTA), Materialise (MTLS), and Teladoc (TDOC) collapsed below their long-term moving averages earlier this spring and this week's moves lower have resulted in breaks of critical support levels. For TDOC and MTLS, those levels have previously marked support at multiple points in the past year. One other interesting name in terms of performance today is Regeneron (REGN). Unlike many other ARKK stocks, REGN has actually been trending higher since March, albeit that is in the context of a much longer-term downtrend than many other ARKK holdings. Regardless, that recent rally has resulted in the stock to run right up to its long-term downtrend. In another move that is out of sync with its peers, today it has reversed lower, failing to break out from that downtrend.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK-Below1.png))**\n\n&gt; While most names have pulled back sharply and continue to trend lower to sideways at best, that is not to say all ARKK stocks have entirely negative charts. Similar to the ETF's chart, there are several names that have found support in the past couple of days. For example, DocuSign (DOCU), Iovance Biotherapeutics (IOVA), Palantir (PLTR), and Spotify (SPOT) are all bouncing off critical support levels of the past year. For others like Fate Therapeutics (FATE), Iridium (IRDM), PagerDuty (PD), PACCAR (PCAR), and Synopsis (SNPS), those support levels have also coincided with their moving averages. PACCAR is also notable in that it is even breaking back above its 50-DMA today. Similarly, Novartis (NVS) is attempting to move back above its 200-DMA. Perhaps one of the most technically strong stocks of these has been Sea Ltd (SEE). Over the past year, the 50-DMA has consistently provided reliable support. After a brief dip back below in March, in April it moved back above its 50-DMA and has once again successfully retested in the past week.\n\n&gt; In order to keep track of the ARK Innovation ETF's (ARKK) holdings, we created a custom portfolio that members can add here. Please note that this does not update real time and is only based on ARKK's holdings as of 5/6/21.\n\n&gt; As always, investors should do their own research before buying or selling any securities, and this chart analysis is in no way meant to be a buy or sell recommendation.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK-Pos1.png))**\n\n*****\n\n&gt; # Commodities Soar to Five Year Highs\n\n&gt; As talk of inflation continues to heat up, one asset class fueling the fire has been the commodities complex. In our one-year review of the market low, we noted how commodities had been some of the biggest winners during the market recovery. Well that trend hasn’t stopped yet, and as shown in the chart below, on Wednesday, the Bloomberg Commodity Index closed at its highest level since August 2015.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/05/Blog-5.7.21-a.png?ssl=1))**\n\n&gt; Whether this strength flows through to CPI or Core PCE (the Federal Reserve’s preferred measure of inflation) remains to be seen, but the technicals suggest this move could just be getting started. WTI crude oil is on the verge of breaking above a level of technical resistance that capped prices in 2019, while copper prices are less than 3% from their 2011 all-time highs. However, those who thought gold would benefit from inflation fears have been mistaken. In fact, of the 23 commodities tracked in the Bloomberg Commodity Index, gold is the worst performing year to date and one of the few that is actually negative over that time period.\n\n&gt; To be clear, we are not calling for runaway inflation. In fact, breaking to five year highs shows that broadly commodities have gone nowhere over that time period. However, we do continue to have a bullish view of energy and industrial metals and wouldn’t be surprised to see this trend continue, albeit likely at a slower pace than the past year. If prices do continue to rise it may put more pressure on companies who are not able to pass those costs onto consumers. But if companies are broadly able to pass these increased input costs along, then expect price increases to begin showing up in traditional inflation measures, but any persistent impact is likely to be modest. Be sure to check out the LPL Research blog next Wednesday, as we examine the April CPI data release.\n\n*****\n\n&gt; # April Jobs Data Disappoints Lofty Expectations\n\n&gt; Investors betting on a continued acceleration in U.S. payrolls in April following March’s impressive numbers received an unwelcome reminder of just how choppy the data can be month-to-month.\n\n&gt; The U.S. Bureau of Labor Statistics released its monthly employment report this morning, revealing that the domestic economy added only 266,000 jobs in April, well below Bloomberg-surveyed economists’ median forecast for a gain of 1,000,000. The prior two months also received net negative revisions of 78,000 jobs. The unemployment rate unexpectedly rose to 6.1% from 6%, though that was paired with an above-estimate gain in the labor force participation rate, which moved from 61.5% to 61.7%, equaling a recovery high. Average hourly earnings rose 0.7% month over month, signaling lower-wage workers did not rejoin the workforce to the degree expected.\n\n&gt; Anecdotal commentary provided by companies in recent months detailing their difficulty finding qualified job candidates evidently worked its way into the data this month in a big way. There are a few explanations for why this might be. Enhanced unemployment benefits may reduce the urgency for some to return to work. Additionally, still-closed schools and lack of child-care may make it difficult for workers to return to the in-person segments of the labor markets. And finally, March’s big jump in payrolls may have represented a rehiring of workers with whom hiring managers already had relationships, such as furloughed employees. Hiring new workers requires a more rigorous, and time-consuming, vetting process.\n\n&gt; As seen in the LPL Chart of the Day, April bucked the reacceleration trend seen off the December 2020 low. Total payrolls still sit about 8.2 million below the February 2020 peak of 152.5 million, but we are still very optimistic about our ability to recapture the lion’s share of those losses quickly despite today’s disappointing readout.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/05/5.7.21-Blog-CHart.png?ssl=1))**\n\n&gt; “The job market got a bit of a reality check this morning,” explained LPL Financial Chief Market Strategist Ryan Detrick. “While we always caution against reading too far into one data release, we think most of the cited factors that suppressed April’s payroll number should wear off naturally with time. We believe that despite April’s speedbump the overall trend will be higher from here.”\n\n&gt; Given the magnitude of the total loss that still needs to be recovered and the varying degrees to which parts of our economy are currently open, we believe jobs data will carry the potential for strong upside surprises for at least the next several months. Improving employment trends—though choppy—buoy consumer strength, and the economy overall, given consumers’ large weighting in the calculation of gross domestic product (GDP). As such, we continue to recommend positioning portfolios to take advantage of these trends, where appropriate, including an overweight allocation to equities relative to benchmarks, and a tilt toward sectors that may benefit more from a continued cyclical upturn\n\n*****\n\n&gt; # Let’s Talk About Stocks And Higher Taxes\n\n&gt; Our new Constitution is now established, everything seems to promise it will be durable; but, in this world, nothing is certain except death and taxes,” Benjamin Franklin\n\n&gt; First off, we hope everyone has a happy and safe Cinco de Mayo!\n\n&gt; One of the big discussions lately has been about how will higher taxes potentially impact the stock market. We’ve known since President Biden won the presidency and the Democrats secured control of the House and Senate that higher taxes were coming, likely in the form of higher corporate taxes and higher capital gains taxes on the wealthy—though probably not until 2022. It is worth noting though that stocks haven’t been fazed at all by all the higher taxes talk, as we just saw the best first 100 days for stocks under a new president since FDR.\n\n&gt; With proposals for the $1.8 trillion American Families Plan (AFP) and $2 trillion plus infrastructure bill (known as the American Jobs Plan or AJP), higher taxes are needed to help finance the new spending. Let’s be clear though, with a 50/50 Senate (Vice President Kamala Harris breaks ties) and historically slim Democratic majority in the House, we think these final numbers will likely come in less than $3 trillion combined, as these initial numbers from the Democrats are starting points for negotiations.\n\n&gt; Higher capital gains taxes on the wealthy are one way to pay for things, with the AFP proposing to increase the top tax rate on ordinary income to 39.6% from 37%, and capital gains and dividends taxes on those who earn more than $1 million to a maximum of 43.4% from the current 23.8%. Fun stat, only 0.32% of the population makes more than $1 million a year, so the truth is this won’t impact the other 99.68% of the population.\n\n&gt; “We’ve known higher taxes were coming so this shouldn’t be a surprise to anyone at this point,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Now here’s the catch, looking back at the times that taxes increased amid a strong economy, stocks did just fine. Given the strong economic outlook this year, you’d have to think history could repeat once again.”\n\n&gt; As shown in the LPL Chart of the Day, in 1986 and 2013, capital gains taxes increased, but the economy was on firm footing back then, compared with the 1970s hikes, which saw an economy marred by higher inflation and sluggish growth. Not surprisingly, the two more recent hikes saw solid stock market performance, while the 1970s hikes didn’t. Is it as simple as how the economy is doing? It very well could be.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/05/5.5.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; Corporate taxes are currently 21% and President Biden has discussed increasing the level to 28%. Although we think in the end the level will be more like 25%, the bottom line is higher corporate taxes are likely coming, which could knock a few percentage points off of future S&amp;P 500 Index earnings growth.\n\n&gt; So what happens after corporate taxes are raised? As the table below shows, muted returns a year out are normal, but interestingly stocks have consistently been in the green the three months before the official date of the tax increase, suggesting investors weren’t very worried about higher taxes on the horizon.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/05/5.5.21-Blog-Chart-2.png?ssl=1))**\n\n&gt; It’s always possible that higher taxes slowly take a bite out stock market returns over a longer time period than just a year, but if the concern is what all the talk about higher taxes may mean for markets over the next year, there’s not much historical evidence pointing to the potential for a bad outcome. The picture is murkier, though, with corporate taxes, which isn’t surprising, since stock prices are ultimately tied to earnings growth. But is often happens, markets seem to be more attuned to larger economic forces.\n\n*****\n\n&gt; # Individuals, Writers, and Managers All Still Bullish\n\n&gt; The major indices are broadly lower in the past week with the exception of the Dow which has risen just over 1%. The Nasdaq on the other hand has been the worst performer falling almost 3%. Even though the major indices are split in terms of performance, sentiment has gone the way of the Dow as bullish sentiment as measured through the AAII weekly survey rose 1.7 percentage points to 44.3%. While not a particularly large increase, this week did mark the first time bullish sentiment has risen in a month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Bull.png))**\n\n&gt; With bullish sentiment higher, fewer respondents reported as bearish. Only 23.1% of investors reported pessimistic sentiment; down 2.6 percentage points versus last week's reading. Just like bullish sentiment, that was not a particularly large change, and it leaves the reading in the middle of the past several weeks' range.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Bear.png))**\n\n&gt; The inverse moves in bullish and bearish sentiment resulted in the bull-bear spread climbing 4.3 points to 21.2. While that is still at the high end of the past few years' range, it is 11 points below where it stood only two weeks ago. Looking at another sentiment survey from Investors Intelligence which targets equity newsletter writers, the bull-bear spread also rose slightly week over week leaving the spread well below levels from only a couple of weeks ago. In other words, sentiment has moderated recently, but it has not dramatically shaken a historically bullish tone.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Bull-Bear.png))**\n\n&gt; Perhaps the most notable reading in this week's AAII survey was the reading on neutral sentiment. Up 0.7 percentage points from the prior week, it was not a particularly large gain especially compared to the 5 and 5.2 percentage point gains the previous two weeks. Regardless, moving higher once again neutral sentiment hit the highest level since the first week of March. Other than that week and the current one, there has only been one other week in the past year (second to last week of 2020) in which neutral sentiment was as high as it is now. Even though this week's reading is elevated relative to the past year, compared to the rest of the history of the survey, it is pretty unremarkable. On average over the life of the survey, neutral sentiment has averaged a reading just 0.9 percentage points lower than this week's reading.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Neutral.png))**\n\n&gt; The NAAIM Exposure Index is yet one more sentiment reading that also has shown some moderation but remains at a generally bullish level. This index reflects the average exposure to US equities of members of the National Association of Active Investment Managers. Readings of 200 would indicate they are leveraged long on average, 100 would be fully invested, 0 would be market neutral, -100 would be fully short, and -200 would be leveraged short. Last week saw this index tip above 100 for the first time since mid-February which also ranked in the top 2% of all readings going back to 2006. This week it fell 15.93 points. That stands in the bottom decile of weekly moves and was the largest drop since late March, but at 87.79, the index still points to historically bullish positioning among active managers.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-NAAIM.png))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/t2D133W.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/7QFXqBx.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/0X9IBEt.jpg))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 5.10.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/alkYsz5.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/HAh8p1I.png))\n\n&gt; # ***Monday 5.10.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/DKZzmHm.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/WE62nHL.png))\n\n*****\n\n&gt; # ***Tuesday  5.11.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/fQpT6Tw.png))\n\n&gt; # ***Tuesday 5.11.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/MqT0VW2.png))\n\n*****\n\n&gt; # ***Wednesday 5.12.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jZpyD2A.png))\n\n&gt; # ***Wednesday 5.12.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ddl5bEp.png))\n\n*****\n\n&gt; # ***Thursday 5.13.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oVFXepP.png))\n\n&gt; # ***Thursday 5.13.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/BZ8BaOn.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/mYeLJZb.png))\n\n*****\n\n&gt; # ***Friday 5.14.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/v6lNwIt.png))\n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/1cL8gOj.png))\n\n*****\n\n&gt; # ***Friday 5.14.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\n&gt; # Palantir Technologies Inc. $19.75\n**Palantir Technologies Inc. (PLTR)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, May 11, 2021. The consensus earnings estimate is $0.04 per share on revenue of $332.23 million and the Earnings Whisper ® number is $0.06 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Short interest has decreased by 9.1% since the company's last earnings release while the stock has drifted lower by 34.2% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, April 27, 2021 there was some notable buying of 13,293 contracts of the $25.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 11.3% move on earnings and the stock has averaged a 10.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Alibaba Group Holding Ltd. $225.31\n**Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, May 13, 2021. The consensus earnings estimate is $1.78 per share on revenue of $27.53 billion and the Earnings Whisper ® number is $1.93 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 97.78% with revenue increasing by 70.53%. Short interest has increased by 15.8% since the company's last earnings release while the stock has drifted lower by 14.8% from its open following the earnings release to be 12.9% below its 200 day moving average of $258.56. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 18,186 contracts of the $245.00 call expiring on Friday, May 14, 2021. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 2.5% move in recent quarters.\nWorkhorse Group Inc. $9.64\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Workhorse Group Inc. $9.64\n**Workhorse Group Inc. (WKHS)** is confirmed to report earnings at approximately 9:00 AM ET on Monday, May 10, 2021. The consensus estimate is for a loss of $0.19 per share on revenue of $2.61 million and the Earnings Whisper ® number is ($0.15) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 416.67% with revenue increasing by 3,007.14%. Short interest has increased by 103.2% since the company's last earnings release while the stock has drifted lower by 39.6% from its open following the earnings release to be 53.3% below its 200 day moving average of $20.64. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 8,546 contracts of the $9.50 put expiring on Friday, May 14, 2021. Option traders are pricing in a 16.8% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WKHS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Walt Disney Co $184.84\n**Walt Disney Co (DIS)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, May 13, 2021. The consensus earnings estimate is $0.28 per share on revenue of $15.86 billion and the Earnings Whisper ® number is $0.43 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 53.33% with revenue decreasing by 11.93%. The stock has drifted lower by 4.2% from its open following the earnings release to be 17.9% above its 200 day moving average of $156.73. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, May 3, 2021 there was some notable buying of 5,866 contracts of the $200.00 call expiring on Friday, May 14, 2021. Option traders are pricing in a 4.4% move on earnings and the stock has averaged a 3.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Trade Desk, Inc. $661.43\n**Trade Desk, Inc. (TTD)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, May 10, 2021. The consensus earnings estimate is $0.77 per share on revenue of $216.90 million and the Earnings Whisper ® number is $0.92 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat The company's guidance was for revenue of $214.00 million to $217.00 million. Consensus estimates are for earnings to decline year-over-year by 7.23% with revenue increasing by 35.01%. Short interest has increased by 38.3% since the company's last earnings release while the stock has drifted lower by 21.4% from its open following the earnings release to be 2.4% below its 200 day moving average of $677.57. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 10.2% move on earnings and the stock has averaged a 9.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TTD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # fuboTV Inc. $17.24\n**fuboTV Inc. (FUBO)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, May 11, 2021. The consensus estimate is for a loss of $0.44 per share on revenue of $103.79 million and the Earnings Whisper ® number is ($0.39) per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for revenue of $101.00 million to $103.00 million. Consensus estimates are for earnings to decline year-over-year by 193.33% with revenue increasing by 1,322.76%. The stock has drifted lower by 54.3% from its open following the earnings release to be 24.7% below its 200 day moving average of $22.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 27, 2021 there was some notable buying of 4,094 contracts of the $40.00 put and 4,052 contracts of the $40.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 16.4% move on earnings and the stock has averaged a 10.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # BioNTech SE $183.71\n**BioNTech SE (BNTX)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, May 10, 2021. The consensus earnings estimate is $4.31 per share on revenue of $2.60 billion and the Earnings Whisper ® number is $5.11 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1,757.69% with revenue increasing by 8,420.68%. Short interest has increased by 25.0% since the company's last earnings release while the stock has drifted higher by 84.1% from its open following the earnings release to be 82.9% above its 200 day moving average of $100.44. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 1,517 contracts of the $155.00 put expiring on Friday, May 14, 2021. Option traders are pricing in a 10.8% move on earnings and the stock has averaged a 5.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BNTX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Virgin Galactic Holdings, Inc. $19.61\n**Virgin Galactic Holdings, Inc. (SPCE)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, May 10, 2021. The consensus estimate is for a loss of $0.31 per share. Investor sentiment going into the company's earnings release has 44% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 3.33% with revenue increasing by 419,647.90%. Short interest has increased by 27.5% since the company's last earnings release while the stock has drifted lower by 45.1% from its open following the earnings release to be 26.2% below its 200 day moving average of $26.57. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, May 3, 2021 there was some notable buying of 8,668 contracts of the $17.00 put expiring on Friday, May 21, 2021. Option traders are pricing in a 11.9% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPCE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Airbnb, Inc. $151.21\n**Airbnb, Inc. (ABNB)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, May 13, 2021. The consensus estimate is for a loss of $1.15 per share on revenue of $704.86 million and the Earnings Whisper ® number is ($1.20) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. The stock has drifted lower by 22.1% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 5,211 contracts of the $160.00 call expiring on Friday, May 14, 2021. Option traders are pricing in a 9.9% move on earnings and the stock has averaged a 13.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ABNB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\nI hope you all have a wonderful Mother's Day weekend and a great week ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning May 10th, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/n8ddnn/wall_street_week_ahead_for_the_trading_week/",
        "created": 1620592558.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1620563660,
        "id": "n8dcql",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Good Sunday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning May 10th, 2021.\n\n# **Inflation is the big challenge for markets and the Fed in the week ahead - [(Source)](https://www.cnbc.com/2021/05/07/inflation-is-the-big-challenge-for-markets-and-the-fed-in-the-week-ahead.html)**\n*****\n&gt; After April’s disappointing jobs report, market focus will shift squarely to inflation in the week ahead.\n*****\n&gt; The tug-of-war over tech stocks will also continue to be a dominant force in the stock market, after Friday’s bounce more than halved the week’s losses in the S&amp;P technology sector.\n*****\n&gt; The April employment report was extremely disappointing with just 266,000 jobs created, well below the 1 million expected. The Friday report cast doubt on the expectations of some investors that the Fed will move toward paring back its so-called quantitative easing bond purchases later this year.\n*****\n&gt; The thinking is if the inflation data appears hot when the consumer price index is reported Wednesday, it could ignite the debate about whether the Fed will have to tighten policy sooner than it would like. For now, the market is viewing the April jobs data as a distorted one-off report.\n*****\n&gt; “It’s all about the inflation numbers. It’s all about the transitory nature and to what extent we’ll see it,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group “It’s more relevant to the CPI month-over-month changes. If the month-over-month gains are starting to pick up steam, and we’re seeing 0.3% to 0.4%, that’s not transitory and that’s a problem for the Fed.”\n*****\n&gt; Economists expect April CPI to rise 0.2% over March, after a gain of 0.6% the month earlier. But on a year-over-year basis, CPI is expected to look sizzling, jumping 3.6%, according to Dow Jones. That compares to 2.6% the month earlier. Excluding food and fuel, CPI is expected to rise by 0.3% on a month-over-month basis.\n*****\n&gt; The central bank has maintained that the pop in inflation is expected to be transitory.\n*****\n&gt; Multiple Fed speakers are on the calendar, including Vice Chairman Richard Clarida, who speaks a half-hour after the CPI print Wednesday. Other officials speaking include Federal Reserve Board Governor Lael Brainard, New York President John Williams and Dallas Fed President Rob Kaplan.\n*****\n&gt; The producer price index is reported Thursday, and that should confirm a trend of higher prices that is showing up in corporate earnings releases. Another important data point, retail sales is released Friday.\n*****\n&gt; Boockvar said the retail sales report is not as important since it has been artificially boosted by one-time stimulus checks.\n*****\n&gt; “It’s like the steroid era of baseball,” he said. “Who knows how many home runs it would have hit without stimulus.”\n*****\n&gt; # Tech battleground\n&gt; The S&amp;P 500 and Dow finished the past week with gains. The S&amp;P rose 1.2% to 4,232, and 2.7% to 34,777. But the technology-laden Nasdaq fell about 1.5% to 13,752, even with Friday’s 0.9% gain.\n*****\n&gt; In the commodities market, fears of inflation continued to build.\n*****\n&gt; Copper futures hit a record high, as did lumber futures, rising 13% in the past week. Corn futures rose 8.6% in the past week, finishing at the highest level since 2013.\n*****\n&gt; West Texas Intermediate crude futures gained 2% to $64.90 per barrel.\n*****\n&gt; The 10-year note yield, which moves opposite price, was at 1.55%, down from 1.63% a week ago.\n*****\n&gt; Commodities fueled gains in the stock market this week, with the S&amp;P energy sector by far the best performer, up 8.9%. Materials rose 5.9%, followed by financials, which were up 4.2%. Industrials gained 3.4%. But the S&amp;P technology sector slumped 0.5%, for the week even with a 0.8% gain Friday.\n*****\n&gt; “I think one thing that people are overlooking is that the technology selling we’ve seen in the last few days...is not just the reaction to the adverse earnings price reactions that we saw from certain tech names,” said Julian Emanuel, chief equity and derivatives strategist at BTIG.\n*****\n&gt; “But it’s also this idea in that in a world where we assume capital gains taxes could go up, that’s where the capital gains lie,” he added. “So they are likely to come under incrementally more pressure on that basis.”\n*****\n&gt; President Joe Biden has proposed raising capital gains taxes to 39.6% for taxpayers making more than $1 million. That’s up from the current top rate of 20%.\n*****\n&gt; Emanuel said the upcoming federal income tax return filing date of May 17 could also be adding pressure to technology, since investors may be selling winners to pay their taxes.\n*****\n&gt; “With the tax bill coming due on May 17 for the 2020 calendar year, people are just going to use it as an excuse within the context of higher capital gains taxes to sell those stocks to pay for their tax bill,” Emanuel said. “I think people are overlooking this as part of the reason.”\n*****\n&gt; Boockvar said tech names could also face further headwinds from higher interest rates, particularly if inflation data is hotter than expected.\n*****\n&gt; “I think the last couple of weeks tells you froth is coming out of the most expensive part of tech and earnings for the big cap names are as good as it gets in terms of growth rates. The market is telling you that,” he said. “If you get a further move in rates, that’s a headwind.”\n*****\n&gt; Earnings season continues in the week ahead though most of the rush is over for the quarter. Disney, Marriott, Wynn Resorts, Airbnb are among the companies reporting that should provide insight on the economic reopening.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/cUOD0tT.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/VKhtBNU.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/HRLJN3b.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/hjmVj8H.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/S48iOLd.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qIgYv0k.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uOMQGUs.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/OWLEQXc.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qiXLhQt.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/t2D133W.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/5R0emOO.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/ZR1CoYl.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/XWzfbs8.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/yIN4N15.png))**\n\n*****\n\n&gt; # ARKK Stocks Breakdowns and Bounces\n\n&gt; After struggling for most of the past couple months, momentum and Tech stocks are broadly outperforming today as the Nasdaq is up 1.25% compared to a 0.78% gain in the S&amp;P 500. The ARK Innovation ETF (ARKK) has been a poster child of the momentum theme over the past year. After a 383.9% gain from the March 2020 low to its high in mid-February, ARKK has fallen around 30% in the months since then. For most of that time, the ETF consolidated between its 50 and 200-DMA. After a failed attempt to break above its 50-DMA at the end of April, it has taken a leg lower, falling below its 200-DMA for the first time in a year in the process. While ARKK has yet to move back above its 200-DMA, it has found support around $105 which traces back to the lows earlier this spring and the highs from the fall. In other words, from a technical perspective ARKK, as well as some of its holdings, still have plenty of technical hurdles including moving back above its moving averages and breaking the past few months' downtrends. At least for the time being, the group has found some respite in the move higher today.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK.png))**\n\n&gt; As for the individual holdings of the ARKK ETF, below we show the 25 largest which accounts for approximately three-quarters of net asset value. For the most part, these stocks continue to sit on huge gains from the past year (or since their market debut for those that have IPO'ed in the past year; bolded and bordered rows in the table below) with only a small handful in the red: Teladoc (TDOC), Coinbase (COIN), and Iovance Biotherapeutics (IOVA). Even though the 25 largest ARKK holdings are on average up 117% over the past year, they have certainly been a pain trade recently. Most of these names are deeply oversold at the moment, and relative to their 52-week highs, they are down 35% on average. In fact, of all 58 holdings, there are only four—Intercontinental Exchange (ICE), TuSimple (TSP), Trimble (TRMB), and PACCAR (PCAR)—that are less than 10% below their 52-week highs, and none of these break into the top 25 largest holdings (as such they are not pictured below).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK-Table.png))**\n\n&gt; While ARKK holdings have generally been weak over the past few months, in recent days there have been some notable developments in the charts of these names. Some of these like CRISPR Therapeutics (CRSP) and EXACT Sciences (EXAS) have fallen below the long-term 200-DMA. Other names in the ETF broke below their 200-DMA a while ago now, and their charts do not look much better. Stocks like Invitae (NVTA), Materialise (MTLS), and Teladoc (TDOC) collapsed below their long-term moving averages earlier this spring and this week's moves lower have resulted in breaks of critical support levels. For TDOC and MTLS, those levels have previously marked support at multiple points in the past year. One other interesting name in terms of performance today is Regeneron (REGN). Unlike many other ARKK stocks, REGN has actually been trending higher since March, albeit that is in the context of a much longer-term downtrend than many other ARKK holdings. Regardless, that recent rally has resulted in the stock to run right up to its long-term downtrend. In another move that is out of sync with its peers, today it has reversed lower, failing to break out from that downtrend.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK-Below1.png))**\n\n&gt; While most names have pulled back sharply and continue to trend lower to sideways at best, that is not to say all ARKK stocks have entirely negative charts. Similar to the ETF's chart, there are several names that have found support in the past couple of days. For example, DocuSign (DOCU), Iovance Biotherapeutics (IOVA), Palantir (PLTR), and Spotify (SPOT) are all bouncing off critical support levels of the past year. For others like Fate Therapeutics (FATE), Iridium (IRDM), PagerDuty (PD), PACCAR (PCAR), and Synopsis (SNPS), those support levels have also coincided with their moving averages. PACCAR is also notable in that it is even breaking back above its 50-DMA today. Similarly, Novartis (NVS) is attempting to move back above its 200-DMA. Perhaps one of the most technically strong stocks of these has been Sea Ltd (SEE). Over the past year, the 50-DMA has consistently provided reliable support. After a brief dip back below in March, in April it moved back above its 50-DMA and has once again successfully retested in the past week.\n\n&gt; In order to keep track of the ARK Innovation ETF's (ARKK) holdings, we created a custom portfolio that members can add here. Please note that this does not update real time and is only based on ARKK's holdings as of 5/6/21.\n\n&gt; As always, investors should do their own research before buying or selling any securities, and this chart analysis is in no way meant to be a buy or sell recommendation.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK-Pos1.png))**\n\n*****\n\n&gt; # Commodities Soar to Five Year Highs\n\n&gt; As talk of inflation continues to heat up, one asset class fueling the fire has been the commodities complex. In our one-year review of the market low, we noted how commodities had been some of the biggest winners during the market recovery. Well that trend hasn’t stopped yet, and as shown in the chart below, on Wednesday, the Bloomberg Commodity Index closed at its highest level since August 2015.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/05/Blog-5.7.21-a.png?ssl=1))**\n\n&gt; Whether this strength flows through to CPI or Core PCE (the Federal Reserve’s preferred measure of inflation) remains to be seen, but the technicals suggest this move could just be getting started. WTI crude oil is on the verge of breaking above a level of technical resistance that capped prices in 2019, while copper prices are less than 3% from their 2011 all-time highs. However, those who thought gold would benefit from inflation fears have been mistaken. In fact, of the 23 commodities tracked in the Bloomberg Commodity Index, gold is the worst performing year to date and one of the few that is actually negative over that time period.\n\n&gt; To be clear, we are not calling for runaway inflation. In fact, breaking to five year highs shows that broadly commodities have gone nowhere over that time period. However, we do continue to have a bullish view of energy and industrial metals and wouldn’t be surprised to see this trend continue, albeit likely at a slower pace than the past year. If prices do continue to rise it may put more pressure on companies who are not able to pass those costs onto consumers. But if companies are broadly able to pass these increased input costs along, then expect price increases to begin showing up in traditional inflation measures, but any persistent impact is likely to be modest. Be sure to check out the LPL Research blog next Wednesday, as we examine the April CPI data release.\n\n*****\n\n&gt; # April Jobs Data Disappoints Lofty Expectations\n\n&gt; Investors betting on a continued acceleration in U.S. payrolls in April following March’s impressive numbers received an unwelcome reminder of just how choppy the data can be month-to-month.\n\n&gt; The U.S. Bureau of Labor Statistics released its monthly employment report this morning, revealing that the domestic economy added only 266,000 jobs in April, well below Bloomberg-surveyed economists’ median forecast for a gain of 1,000,000. The prior two months also received net negative revisions of 78,000 jobs. The unemployment rate unexpectedly rose to 6.1% from 6%, though that was paired with an above-estimate gain in the labor force participation rate, which moved from 61.5% to 61.7%, equaling a recovery high. Average hourly earnings rose 0.7% month over month, signaling lower-wage workers did not rejoin the workforce to the degree expected.\n\n&gt; Anecdotal commentary provided by companies in recent months detailing their difficulty finding qualified job candidates evidently worked its way into the data this month in a big way. There are a few explanations for why this might be. Enhanced unemployment benefits may reduce the urgency for some to return to work. Additionally, still-closed schools and lack of child-care may make it difficult for workers to return to the in-person segments of the labor markets. And finally, March’s big jump in payrolls may have represented a rehiring of workers with whom hiring managers already had relationships, such as furloughed employees. Hiring new workers requires a more rigorous, and time-consuming, vetting process.\n\n&gt; As seen in the LPL Chart of the Day, April bucked the reacceleration trend seen off the December 2020 low. Total payrolls still sit about 8.2 million below the February 2020 peak of 152.5 million, but we are still very optimistic about our ability to recapture the lion’s share of those losses quickly despite today’s disappointing readout.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/05/5.7.21-Blog-CHart.png?ssl=1))**\n\n&gt; “The job market got a bit of a reality check this morning,” explained LPL Financial Chief Market Strategist Ryan Detrick. “While we always caution against reading too far into one data release, we think most of the cited factors that suppressed April’s payroll number should wear off naturally with time. We believe that despite April’s speedbump the overall trend will be higher from here.”\n\n&gt; Given the magnitude of the total loss that still needs to be recovered and the varying degrees to which parts of our economy are currently open, we believe jobs data will carry the potential for strong upside surprises for at least the next several months. Improving employment trends—though choppy—buoy consumer strength, and the economy overall, given consumers’ large weighting in the calculation of gross domestic product (GDP). As such, we continue to recommend positioning portfolios to take advantage of these trends, where appropriate, including an overweight allocation to equities relative to benchmarks, and a tilt toward sectors that may benefit more from a continued cyclical upturn\n\n*****\n\n&gt; # Let’s Talk About Stocks And Higher Taxes\n\n&gt; Our new Constitution is now established, everything seems to promise it will be durable; but, in this world, nothing is certain except death and taxes,” Benjamin Franklin\n\n&gt; First off, we hope everyone has a happy and safe Cinco de Mayo!\n\n&gt; One of the big discussions lately has been about how will higher taxes potentially impact the stock market. We’ve known since President Biden won the presidency and the Democrats secured control of the House and Senate that higher taxes were coming, likely in the form of higher corporate taxes and higher capital gains taxes on the wealthy—though probably not until 2022. It is worth noting though that stocks haven’t been fazed at all by all the higher taxes talk, as we just saw the best first 100 days for stocks under a new president since FDR.\n\n&gt; With proposals for the $1.8 trillion American Families Plan (AFP) and $2 trillion plus infrastructure bill (known as the American Jobs Plan or AJP), higher taxes are needed to help finance the new spending. Let’s be clear though, with a 50/50 Senate (Vice President Kamala Harris breaks ties) and historically slim Democratic majority in the House, we think these final numbers will likely come in less than $3 trillion combined, as these initial numbers from the Democrats are starting points for negotiations.\n\n&gt; Higher capital gains taxes on the wealthy are one way to pay for things, with the AFP proposing to increase the top tax rate on ordinary income to 39.6% from 37%, and capital gains and dividends taxes on those who earn more than $1 million to a maximum of 43.4% from the current 23.8%. Fun stat, only 0.32% of the population makes more than $1 million a year, so the truth is this won’t impact the other 99.68% of the population.\n\n&gt; “We’ve known higher taxes were coming so this shouldn’t be a surprise to anyone at this point,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Now here’s the catch, looking back at the times that taxes increased amid a strong economy, stocks did just fine. Given the strong economic outlook this year, you’d have to think history could repeat once again.”\n\n&gt; As shown in the LPL Chart of the Day, in 1986 and 2013, capital gains taxes increased, but the economy was on firm footing back then, compared with the 1970s hikes, which saw an economy marred by higher inflation and sluggish growth. Not surprisingly, the two more recent hikes saw solid stock market performance, while the 1970s hikes didn’t. Is it as simple as how the economy is doing? It very well could be.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/05/5.5.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; Corporate taxes are currently 21% and President Biden has discussed increasing the level to 28%. Although we think in the end the level will be more like 25%, the bottom line is higher corporate taxes are likely coming, which could knock a few percentage points off of future S&amp;P 500 Index earnings growth.\n\n&gt; So what happens after corporate taxes are raised? As the table below shows, muted returns a year out are normal, but interestingly stocks have consistently been in the green the three months before the official date of the tax increase, suggesting investors weren’t very worried about higher taxes on the horizon.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/05/5.5.21-Blog-Chart-2.png?ssl=1))**\n\n&gt; It’s always possible that higher taxes slowly take a bite out stock market returns over a longer time period than just a year, but if the concern is what all the talk about higher taxes may mean for markets over the next year, there’s not much historical evidence pointing to the potential for a bad outcome. The picture is murkier, though, with corporate taxes, which isn’t surprising, since stock prices are ultimately tied to earnings growth. But is often happens, markets seem to be more attuned to larger economic forces.\n\n*****\n\n&gt; # Individuals, Writers, and Managers All Still Bullish\n\n&gt; The major indices are broadly lower in the past week with the exception of the Dow which has risen just over 1%. The Nasdaq on the other hand has been the worst performer falling almost 3%. Even though the major indices are split in terms of performance, sentiment has gone the way of the Dow as bullish sentiment as measured through the AAII weekly survey rose 1.7 percentage points to 44.3%. While not a particularly large increase, this week did mark the first time bullish sentiment has risen in a month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Bull.png))**\n\n&gt; With bullish sentiment higher, fewer respondents reported as bearish. Only 23.1% of investors reported pessimistic sentiment; down 2.6 percentage points versus last week's reading. Just like bullish sentiment, that was not a particularly large change, and it leaves the reading in the middle of the past several weeks' range.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Bear.png))**\n\n&gt; The inverse moves in bullish and bearish sentiment resulted in the bull-bear spread climbing 4.3 points to 21.2. While that is still at the high end of the past few years' range, it is 11 points below where it stood only two weeks ago. Looking at another sentiment survey from Investors Intelligence which targets equity newsletter writers, the bull-bear spread also rose slightly week over week leaving the spread well below levels from only a couple of weeks ago. In other words, sentiment has moderated recently, but it has not dramatically shaken a historically bullish tone.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Bull-Bear.png))**\n\n&gt; Perhaps the most notable reading in this week's AAII survey was the reading on neutral sentiment. Up 0.7 percentage points from the prior week, it was not a particularly large gain especially compared to the 5 and 5.2 percentage point gains the previous two weeks. Regardless, moving higher once again neutral sentiment hit the highest level since the first week of March. Other than that week and the current one, there has only been one other week in the past year (second to last week of 2020) in which neutral sentiment was as high as it is now. Even though this week's reading is elevated relative to the past year, compared to the rest of the history of the survey, it is pretty unremarkable. On average over the life of the survey, neutral sentiment has averaged a reading just 0.9 percentage points lower than this week's reading.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Neutral.png))**\n\n&gt; The NAAIM Exposure Index is yet one more sentiment reading that also has shown some moderation but remains at a generally bullish level. This index reflects the average exposure to US equities of members of the National Association of Active Investment Managers. Readings of 200 would indicate they are leveraged long on average, 100 would be fully invested, 0 would be market neutral, -100 would be fully short, and -200 would be leveraged short. Last week saw this index tip above 100 for the first time since mid-February which also ranked in the top 2% of all readings going back to 2006. This week it fell 15.93 points. That stands in the bottom decile of weekly moves and was the largest drop since late March, but at 87.79, the index still points to historically bullish positioning among active managers.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-NAAIM.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending May 7th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=E07MTeHTMe4))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 5.9.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=RVTxZHyUDvA))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **(T.B.A. THIS WEEKEND.)**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/t2D133W.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/7QFXqBx.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/0X9IBEt.jpg))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 5.10.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/alkYsz5.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/HAh8p1I.png))\n\n&gt; # ***Monday 5.10.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/DKZzmHm.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/WE62nHL.png))\n\n*****\n\n&gt; # ***Tuesday  5.11.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/fQpT6Tw.png))\n\n&gt; # ***Tuesday 5.11.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/MqT0VW2.png))\n\n*****\n\n&gt; # ***Wednesday 5.12.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jZpyD2A.png))\n\n&gt; # ***Wednesday 5.12.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ddl5bEp.png))\n\n*****\n\n&gt; # ***Thursday 5.13.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oVFXepP.png))\n\n&gt; # ***Thursday 5.13.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/BZ8BaOn.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/mYeLJZb.png))\n\n*****\n\n&gt; # ***Friday 5.14.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/v6lNwIt.png))\n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/1cL8gOj.png))\n\n*****\n\n&gt; # ***Friday 5.14.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\n&gt; # Palantir Technologies Inc. $19.75\n**Palantir Technologies Inc. (PLTR)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, May 11, 2021. The consensus earnings estimate is $0.04 per share on revenue of $332.23 million and the Earnings Whisper ® number is $0.06 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Short interest has decreased by 9.1% since the company's last earnings release while the stock has drifted lower by 34.2% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, April 27, 2021 there was some notable buying of 13,293 contracts of the $25.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 11.3% move on earnings and the stock has averaged a 10.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Alibaba Group Holding Ltd. $225.31\n**Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, May 13, 2021. The consensus earnings estimate is $1.78 per share on revenue of $27.53 billion and the Earnings Whisper ® number is $1.93 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 97.78% with revenue increasing by 70.53%. Short interest has increased by 15.8% since the company's last earnings release while the stock has drifted lower by 14.8% from its open following the earnings release to be 12.9% below its 200 day moving average of $258.56. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 18,186 contracts of the $245.00 call expiring on Friday, May 14, 2021. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 2.5% move in recent quarters.\nWorkhorse Group Inc. $9.64\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Workhorse Group Inc. $9.64\n**Workhorse Group Inc. (WKHS)** is confirmed to report earnings at approximately 9:00 AM ET on Monday, May 10, 2021. The consensus estimate is for a loss of $0.19 per share on revenue of $2.61 million and the Earnings Whisper ® number is ($0.15) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 416.67% with revenue increasing by 3,007.14%. Short interest has increased by 103.2% since the company's last earnings release while the stock has drifted lower by 39.6% from its open following the earnings release to be 53.3% below its 200 day moving average of $20.64. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 8,546 contracts of the $9.50 put expiring on Friday, May 14, 2021. Option traders are pricing in a 16.8% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WKHS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Walt Disney Co $184.84\n**Walt Disney Co (DIS)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, May 13, 2021. The consensus earnings estimate is $0.28 per share on revenue of $15.86 billion and the Earnings Whisper ® number is $0.43 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 53.33% with revenue decreasing by 11.93%. The stock has drifted lower by 4.2% from its open following the earnings release to be 17.9% above its 200 day moving average of $156.73. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, May 3, 2021 there was some notable buying of 5,866 contracts of the $200.00 call expiring on Friday, May 14, 2021. Option traders are pricing in a 4.4% move on earnings and the stock has averaged a 3.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Trade Desk, Inc. $661.43\n**Trade Desk, Inc. (TTD)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, May 10, 2021. The consensus earnings estimate is $0.77 per share on revenue of $216.90 million and the Earnings Whisper ® number is $0.92 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat The company's guidance was for revenue of $214.00 million to $217.00 million. Consensus estimates are for earnings to decline year-over-year by 7.23% with revenue increasing by 35.01%. Short interest has increased by 38.3% since the company's last earnings release while the stock has drifted lower by 21.4% from its open following the earnings release to be 2.4% below its 200 day moving average of $677.57. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 10.2% move on earnings and the stock has averaged a 9.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TTD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # fuboTV Inc. $17.24\n**fuboTV Inc. (FUBO)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, May 11, 2021. The consensus estimate is for a loss of $0.44 per share on revenue of $103.79 million and the Earnings Whisper ® number is ($0.39) per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for revenue of $101.00 million to $103.00 million. Consensus estimates are for earnings to decline year-over-year by 193.33% with revenue increasing by 1,322.76%. The stock has drifted lower by 54.3% from its open following the earnings release to be 24.7% below its 200 day moving average of $22.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 27, 2021 there was some notable buying of 4,094 contracts of the $40.00 put and 4,052 contracts of the $40.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 16.4% move on earnings and the stock has averaged a 10.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # BioNTech SE $183.71\n**BioNTech SE (BNTX)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, May 10, 2021. The consensus earnings estimate is $4.31 per share on revenue of $2.60 billion and the Earnings Whisper ® number is $5.11 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1,757.69% with revenue increasing by 8,420.68%. Short interest has increased by 25.0% since the company's last earnings release while the stock has drifted higher by 84.1% from its open following the earnings release to be 82.9% above its 200 day moving average of $100.44. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 1,517 contracts of the $155.00 put expiring on Friday, May 14, 2021. Option traders are pricing in a 10.8% move on earnings and the stock has averaged a 5.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BNTX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Virgin Galactic Holdings, Inc. $19.61\n**Virgin Galactic Holdings, Inc. (SPCE)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, May 10, 2021. The consensus estimate is for a loss of $0.31 per share. Investor sentiment going into the company's earnings release has 44% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 3.33% with revenue increasing by 419,647.90%. Short interest has increased by 27.5% since the company's last earnings release while the stock has drifted lower by 45.1% from its open following the earnings release to be 26.2% below its 200 day moving average of $26.57. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, May 3, 2021 there was some notable buying of 8,668 contracts of the $17.00 put expiring on Friday, May 21, 2021. Option traders are pricing in a 11.9% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPCE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Airbnb, Inc. $151.21\n**Airbnb, Inc. (ABNB)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, May 13, 2021. The consensus estimate is for a loss of $1.15 per share on revenue of $704.86 million and the Earnings Whisper ® number is ($1.20) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. The stock has drifted lower by 22.1% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 5,211 contracts of the $160.00 call expiring on Friday, May 14, 2021. Option traders are pricing in a 9.9% move on earnings and the stock has averaged a 13.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ABNB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\nI hope you all have a wonderful Mother's Day weekend and a great week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning May 10th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/n8dcql/wall_street_week_ahead_for_the_trading_week/",
        "created": 1620592460.0
    },
    {
        "author": "No_Seesaw1134",
        "created_utc": 1620780751,
        "id": "nachc4",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "$APTV - Taking off after hours which is fine, we are hoping for a small pull back. Beautiful triangle forming, I want to see a breakout.\n\n&amp;#x200B;\n\n$AQN  - amazing trend forming and support right here. If we get a full move and eventually a break out, we could have a massive play here.\n\n&amp;#x200B;\n\n$BKNG - Amazing massive trend. You are paying more for the amazing price action and support coming. Buy fractional shares if needed, great play.\n\n&amp;#x200B;\n\n$EMN  - SHORT! This is a year long trend, and this resistance is STRONG. I have faith it is going to pull back right around here for some easy money.\n\n&amp;#x200B;\n\n$MFC  - amazing uptrend right here, and it is headed right for value. Support is holding and so is the trend, love to see it.\n\n&amp;#x200B;\n\n$PRTK - Another amazing pharma play - this is big reward or big risk, no one knows. Can have a 15% day any given day, or 5% lose, it is volatile but I like it here.\n\n&amp;#x200B;\n\n$RCL  - Amazing triangle and support coming together. We have to see a full move to make it truly worth it, but a great value.\n\n&amp;#x200B;\n\n$TRMB - Amazing uptrend that follows the 200EMA on the 180D time frame, what more can ya want?!\n\n&amp;#x200B;\n\n$WSC  - Amazing wedge so do not get too bold on price targets - but this is an amazing looking setup.",
        "subreddit": "stocks",
        "title": "My Watchlist For 5/12/2021 - Let's Capitalize On Folks Selling...",
        "url": "https://www.reddit.com/r/stocks/comments/nachc4/my_watchlist_for_5122021_lets_capitalize_on_folks/",
        "created": 1620809551.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1620563601,
        "id": "n8dc54",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning May 10th, 2021.\n\n# **Inflation is the big challenge for markets and the Fed in the week ahead - [(Source)](https://www.cnbc.com/2021/05/07/inflation-is-the-big-challenge-for-markets-and-the-fed-in-the-week-ahead.html)**\n*****\n&gt; After April’s disappointing jobs report, market focus will shift squarely to inflation in the week ahead.\n*****\n&gt; The tug-of-war over tech stocks will also continue to be a dominant force in the stock market, after Friday’s bounce more than halved the week’s losses in the S&amp;P technology sector.\n*****\n&gt; The April employment report was extremely disappointing with just 266,000 jobs created, well below the 1 million expected. The Friday report cast doubt on the expectations of some investors that the Fed will move toward paring back its so-called quantitative easing bond purchases later this year.\n*****\n&gt; The thinking is if the inflation data appears hot when the consumer price index is reported Wednesday, it could ignite the debate about whether the Fed will have to tighten policy sooner than it would like. For now, the market is viewing the April jobs data as a distorted one-off report.\n*****\n&gt; “It’s all about the inflation numbers. It’s all about the transitory nature and to what extent we’ll see it,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group “It’s more relevant to the CPI month-over-month changes. If the month-over-month gains are starting to pick up steam, and we’re seeing 0.3% to 0.4%, that’s not transitory and that’s a problem for the Fed.”\n*****\n&gt; Economists expect April CPI to rise 0.2% over March, after a gain of 0.6% the month earlier. But on a year-over-year basis, CPI is expected to look sizzling, jumping 3.6%, according to Dow Jones. That compares to 2.6% the month earlier. Excluding food and fuel, CPI is expected to rise by 0.3% on a month-over-month basis.\n*****\n&gt; The central bank has maintained that the pop in inflation is expected to be transitory.\n*****\n&gt; Multiple Fed speakers are on the calendar, including Vice Chairman Richard Clarida, who speaks a half-hour after the CPI print Wednesday. Other officials speaking include Federal Reserve Board Governor Lael Brainard, New York President John Williams and Dallas Fed President Rob Kaplan.\n*****\n&gt; The producer price index is reported Thursday, and that should confirm a trend of higher prices that is showing up in corporate earnings releases. Another important data point, retail sales is released Friday.\n*****\n&gt; Boockvar said the retail sales report is not as important since it has been artificially boosted by one-time stimulus checks.\n*****\n&gt; “It’s like the steroid era of baseball,” he said. “Who knows how many home runs it would have hit without stimulus.”\n*****\n&gt; # Tech battleground\n&gt; The S&amp;P 500 and Dow finished the past week with gains. The S&amp;P rose 1.2% to 4,232, and 2.7% to 34,777. But the technology-laden Nasdaq fell about 1.5% to 13,752, even with Friday’s 0.9% gain.\n*****\n&gt; In the commodities market, fears of inflation continued to build.\n*****\n&gt; Copper futures hit a record high, as did lumber futures, rising 13% in the past week. Corn futures rose 8.6% in the past week, finishing at the highest level since 2013.\n*****\n&gt; West Texas Intermediate crude futures gained 2% to $64.90 per barrel.\n*****\n&gt; The 10-year note yield, which moves opposite price, was at 1.55%, down from 1.63% a week ago.\n*****\n&gt; Commodities fueled gains in the stock market this week, with the S&amp;P energy sector by far the best performer, up 8.9%. Materials rose 5.9%, followed by financials, which were up 4.2%. Industrials gained 3.4%. But the S&amp;P technology sector slumped 0.5%, for the week even with a 0.8% gain Friday.\n*****\n&gt; “I think one thing that people are overlooking is that the technology selling we’ve seen in the last few days...is not just the reaction to the adverse earnings price reactions that we saw from certain tech names,” said Julian Emanuel, chief equity and derivatives strategist at BTIG.\n*****\n&gt; “But it’s also this idea in that in a world where we assume capital gains taxes could go up, that’s where the capital gains lie,” he added. “So they are likely to come under incrementally more pressure on that basis.”\n*****\n&gt; President Joe Biden has proposed raising capital gains taxes to 39.6% for taxpayers making more than $1 million. That’s up from the current top rate of 20%.\n*****\n&gt; Emanuel said the upcoming federal income tax return filing date of May 17 could also be adding pressure to technology, since investors may be selling winners to pay their taxes.\n*****\n&gt; “With the tax bill coming due on May 17 for the 2020 calendar year, people are just going to use it as an excuse within the context of higher capital gains taxes to sell those stocks to pay for their tax bill,” Emanuel said. “I think people are overlooking this as part of the reason.”\n*****\n&gt; Boockvar said tech names could also face further headwinds from higher interest rates, particularly if inflation data is hotter than expected.\n*****\n&gt; “I think the last couple of weeks tells you froth is coming out of the most expensive part of tech and earnings for the big cap names are as good as it gets in terms of growth rates. The market is telling you that,” he said. “If you get a further move in rates, that’s a headwind.”\n*****\n&gt; Earnings season continues in the week ahead though most of the rush is over for the quarter. Disney, Marriott, Wynn Resorts, Airbnb are among the companies reporting that should provide insight on the economic reopening.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/cUOD0tT.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/VKhtBNU.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/HRLJN3b.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/hjmVj8H.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/S48iOLd.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qIgYv0k.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/uOMQGUs.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/OWLEQXc.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qiXLhQt.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/t2D133W.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/5R0emOO.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/ZR1CoYl.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/XWzfbs8.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/yIN4N15.png))**\n\n*****\n\n&gt; # ARKK Stocks Breakdowns and Bounces\n\n&gt; After struggling for most of the past couple months, momentum and Tech stocks are broadly outperforming today as the Nasdaq is up 1.25% compared to a 0.78% gain in the S&amp;P 500. The ARK Innovation ETF (ARKK) has been a poster child of the momentum theme over the past year. After a 383.9% gain from the March 2020 low to its high in mid-February, ARKK has fallen around 30% in the months since then. For most of that time, the ETF consolidated between its 50 and 200-DMA. After a failed attempt to break above its 50-DMA at the end of April, it has taken a leg lower, falling below its 200-DMA for the first time in a year in the process. While ARKK has yet to move back above its 200-DMA, it has found support around $105 which traces back to the lows earlier this spring and the highs from the fall. In other words, from a technical perspective ARKK, as well as some of its holdings, still have plenty of technical hurdles including moving back above its moving averages and breaking the past few months' downtrends. At least for the time being, the group has found some respite in the move higher today.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK.png))**\n\n&gt; As for the individual holdings of the ARKK ETF, below we show the 25 largest which accounts for approximately three-quarters of net asset value. For the most part, these stocks continue to sit on huge gains from the past year (or since their market debut for those that have IPO'ed in the past year; bolded and bordered rows in the table below) with only a small handful in the red: Teladoc (TDOC), Coinbase (COIN), and Iovance Biotherapeutics (IOVA). Even though the 25 largest ARKK holdings are on average up 117% over the past year, they have certainly been a pain trade recently. Most of these names are deeply oversold at the moment, and relative to their 52-week highs, they are down 35% on average. In fact, of all 58 holdings, there are only four—Intercontinental Exchange (ICE), TuSimple (TSP), Trimble (TRMB), and PACCAR (PCAR)—that are less than 10% below their 52-week highs, and none of these break into the top 25 largest holdings (as such they are not pictured below).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK-Table.png))**\n\n&gt; While ARKK holdings have generally been weak over the past few months, in recent days there have been some notable developments in the charts of these names. Some of these like CRISPR Therapeutics (CRSP) and EXACT Sciences (EXAS) have fallen below the long-term 200-DMA. Other names in the ETF broke below their 200-DMA a while ago now, and their charts do not look much better. Stocks like Invitae (NVTA), Materialise (MTLS), and Teladoc (TDOC) collapsed below their long-term moving averages earlier this spring and this week's moves lower have resulted in breaks of critical support levels. For TDOC and MTLS, those levels have previously marked support at multiple points in the past year. One other interesting name in terms of performance today is Regeneron (REGN). Unlike many other ARKK stocks, REGN has actually been trending higher since March, albeit that is in the context of a much longer-term downtrend than many other ARKK holdings. Regardless, that recent rally has resulted in the stock to run right up to its long-term downtrend. In another move that is out of sync with its peers, today it has reversed lower, failing to break out from that downtrend.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK-Below1.png))**\n\n&gt; While most names have pulled back sharply and continue to trend lower to sideways at best, that is not to say all ARKK stocks have entirely negative charts. Similar to the ETF's chart, there are several names that have found support in the past couple of days. For example, DocuSign (DOCU), Iovance Biotherapeutics (IOVA), Palantir (PLTR), and Spotify (SPOT) are all bouncing off critical support levels of the past year. For others like Fate Therapeutics (FATE), Iridium (IRDM), PagerDuty (PD), PACCAR (PCAR), and Synopsis (SNPS), those support levels have also coincided with their moving averages. PACCAR is also notable in that it is even breaking back above its 50-DMA today. Similarly, Novartis (NVS) is attempting to move back above its 200-DMA. Perhaps one of the most technically strong stocks of these has been Sea Ltd (SEE). Over the past year, the 50-DMA has consistently provided reliable support. After a brief dip back below in March, in April it moved back above its 50-DMA and has once again successfully retested in the past week.\n\n&gt; In order to keep track of the ARK Innovation ETF's (ARKK) holdings, we created a custom portfolio that members can add here. Please note that this does not update real time and is only based on ARKK's holdings as of 5/6/21.\n\n&gt; As always, investors should do their own research before buying or selling any securities, and this chart analysis is in no way meant to be a buy or sell recommendation.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050721-ARKK-Pos1.png))**\n\n*****\n\n&gt; # Commodities Soar to Five Year Highs\n\n&gt; As talk of inflation continues to heat up, one asset class fueling the fire has been the commodities complex. In our one-year review of the market low, we noted how commodities had been some of the biggest winners during the market recovery. Well that trend hasn’t stopped yet, and as shown in the chart below, on Wednesday, the Bloomberg Commodity Index closed at its highest level since August 2015.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/05/Blog-5.7.21-a.png?ssl=1))**\n\n&gt; Whether this strength flows through to CPI or Core PCE (the Federal Reserve’s preferred measure of inflation) remains to be seen, but the technicals suggest this move could just be getting started. WTI crude oil is on the verge of breaking above a level of technical resistance that capped prices in 2019, while copper prices are less than 3% from their 2011 all-time highs. However, those who thought gold would benefit from inflation fears have been mistaken. In fact, of the 23 commodities tracked in the Bloomberg Commodity Index, gold is the worst performing year to date and one of the few that is actually negative over that time period.\n\n&gt; To be clear, we are not calling for runaway inflation. In fact, breaking to five year highs shows that broadly commodities have gone nowhere over that time period. However, we do continue to have a bullish view of energy and industrial metals and wouldn’t be surprised to see this trend continue, albeit likely at a slower pace than the past year. If prices do continue to rise it may put more pressure on companies who are not able to pass those costs onto consumers. But if companies are broadly able to pass these increased input costs along, then expect price increases to begin showing up in traditional inflation measures, but any persistent impact is likely to be modest. Be sure to check out the LPL Research blog next Wednesday, as we examine the April CPI data release.\n\n*****\n\n&gt; # April Jobs Data Disappoints Lofty Expectations\n\n&gt; Investors betting on a continued acceleration in U.S. payrolls in April following March’s impressive numbers received an unwelcome reminder of just how choppy the data can be month-to-month.\n\n&gt; The U.S. Bureau of Labor Statistics released its monthly employment report this morning, revealing that the domestic economy added only 266,000 jobs in April, well below Bloomberg-surveyed economists’ median forecast for a gain of 1,000,000. The prior two months also received net negative revisions of 78,000 jobs. The unemployment rate unexpectedly rose to 6.1% from 6%, though that was paired with an above-estimate gain in the labor force participation rate, which moved from 61.5% to 61.7%, equaling a recovery high. Average hourly earnings rose 0.7% month over month, signaling lower-wage workers did not rejoin the workforce to the degree expected.\n\n&gt; Anecdotal commentary provided by companies in recent months detailing their difficulty finding qualified job candidates evidently worked its way into the data this month in a big way. There are a few explanations for why this might be. Enhanced unemployment benefits may reduce the urgency for some to return to work. Additionally, still-closed schools and lack of child-care may make it difficult for workers to return to the in-person segments of the labor markets. And finally, March’s big jump in payrolls may have represented a rehiring of workers with whom hiring managers already had relationships, such as furloughed employees. Hiring new workers requires a more rigorous, and time-consuming, vetting process.\n\n&gt; As seen in the LPL Chart of the Day, April bucked the reacceleration trend seen off the December 2020 low. Total payrolls still sit about 8.2 million below the February 2020 peak of 152.5 million, but we are still very optimistic about our ability to recapture the lion’s share of those losses quickly despite today’s disappointing readout.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/05/5.7.21-Blog-CHart.png?ssl=1))**\n\n&gt; “The job market got a bit of a reality check this morning,” explained LPL Financial Chief Market Strategist Ryan Detrick. “While we always caution against reading too far into one data release, we think most of the cited factors that suppressed April’s payroll number should wear off naturally with time. We believe that despite April’s speedbump the overall trend will be higher from here.”\n\n&gt; Given the magnitude of the total loss that still needs to be recovered and the varying degrees to which parts of our economy are currently open, we believe jobs data will carry the potential for strong upside surprises for at least the next several months. Improving employment trends—though choppy—buoy consumer strength, and the economy overall, given consumers’ large weighting in the calculation of gross domestic product (GDP). As such, we continue to recommend positioning portfolios to take advantage of these trends, where appropriate, including an overweight allocation to equities relative to benchmarks, and a tilt toward sectors that may benefit more from a continued cyclical upturn\n\n*****\n\n&gt; # Let’s Talk About Stocks And Higher Taxes\n\n&gt; Our new Constitution is now established, everything seems to promise it will be durable; but, in this world, nothing is certain except death and taxes,” Benjamin Franklin\n\n&gt; First off, we hope everyone has a happy and safe Cinco de Mayo!\n\n&gt; One of the big discussions lately has been about how will higher taxes potentially impact the stock market. We’ve known since President Biden won the presidency and the Democrats secured control of the House and Senate that higher taxes were coming, likely in the form of higher corporate taxes and higher capital gains taxes on the wealthy—though probably not until 2022. It is worth noting though that stocks haven’t been fazed at all by all the higher taxes talk, as we just saw the best first 100 days for stocks under a new president since FDR.\n\n&gt; With proposals for the $1.8 trillion American Families Plan (AFP) and $2 trillion plus infrastructure bill (known as the American Jobs Plan or AJP), higher taxes are needed to help finance the new spending. Let’s be clear though, with a 50/50 Senate (Vice President Kamala Harris breaks ties) and historically slim Democratic majority in the House, we think these final numbers will likely come in less than $3 trillion combined, as these initial numbers from the Democrats are starting points for negotiations.\n\n&gt; Higher capital gains taxes on the wealthy are one way to pay for things, with the AFP proposing to increase the top tax rate on ordinary income to 39.6% from 37%, and capital gains and dividends taxes on those who earn more than $1 million to a maximum of 43.4% from the current 23.8%. Fun stat, only 0.32% of the population makes more than $1 million a year, so the truth is this won’t impact the other 99.68% of the population.\n\n&gt; “We’ve known higher taxes were coming so this shouldn’t be a surprise to anyone at this point,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Now here’s the catch, looking back at the times that taxes increased amid a strong economy, stocks did just fine. Given the strong economic outlook this year, you’d have to think history could repeat once again.”\n\n&gt; As shown in the LPL Chart of the Day, in 1986 and 2013, capital gains taxes increased, but the economy was on firm footing back then, compared with the 1970s hikes, which saw an economy marred by higher inflation and sluggish growth. Not surprisingly, the two more recent hikes saw solid stock market performance, while the 1970s hikes didn’t. Is it as simple as how the economy is doing? It very well could be.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/05/5.5.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; Corporate taxes are currently 21% and President Biden has discussed increasing the level to 28%. Although we think in the end the level will be more like 25%, the bottom line is higher corporate taxes are likely coming, which could knock a few percentage points off of future S&amp;P 500 Index earnings growth.\n\n&gt; So what happens after corporate taxes are raised? As the table below shows, muted returns a year out are normal, but interestingly stocks have consistently been in the green the three months before the official date of the tax increase, suggesting investors weren’t very worried about higher taxes on the horizon.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/05/5.5.21-Blog-Chart-2.png?ssl=1))**\n\n&gt; It’s always possible that higher taxes slowly take a bite out stock market returns over a longer time period than just a year, but if the concern is what all the talk about higher taxes may mean for markets over the next year, there’s not much historical evidence pointing to the potential for a bad outcome. The picture is murkier, though, with corporate taxes, which isn’t surprising, since stock prices are ultimately tied to earnings growth. But is often happens, markets seem to be more attuned to larger economic forces.\n\n*****\n\n&gt; # Individuals, Writers, and Managers All Still Bullish\n\n&gt; The major indices are broadly lower in the past week with the exception of the Dow which has risen just over 1%. The Nasdaq on the other hand has been the worst performer falling almost 3%. Even though the major indices are split in terms of performance, sentiment has gone the way of the Dow as bullish sentiment as measured through the AAII weekly survey rose 1.7 percentage points to 44.3%. While not a particularly large increase, this week did mark the first time bullish sentiment has risen in a month.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Bull.png))**\n\n&gt; With bullish sentiment higher, fewer respondents reported as bearish. Only 23.1% of investors reported pessimistic sentiment; down 2.6 percentage points versus last week's reading. Just like bullish sentiment, that was not a particularly large change, and it leaves the reading in the middle of the past several weeks' range.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Bear.png))**\n\n&gt; The inverse moves in bullish and bearish sentiment resulted in the bull-bear spread climbing 4.3 points to 21.2. While that is still at the high end of the past few years' range, it is 11 points below where it stood only two weeks ago. Looking at another sentiment survey from Investors Intelligence which targets equity newsletter writers, the bull-bear spread also rose slightly week over week leaving the spread well below levels from only a couple of weeks ago. In other words, sentiment has moderated recently, but it has not dramatically shaken a historically bullish tone.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Bull-Bear.png))**\n\n&gt; Perhaps the most notable reading in this week's AAII survey was the reading on neutral sentiment. Up 0.7 percentage points from the prior week, it was not a particularly large gain especially compared to the 5 and 5.2 percentage point gains the previous two weeks. Regardless, moving higher once again neutral sentiment hit the highest level since the first week of March. Other than that week and the current one, there has only been one other week in the past year (second to last week of 2020) in which neutral sentiment was as high as it is now. Even though this week's reading is elevated relative to the past year, compared to the rest of the history of the survey, it is pretty unremarkable. On average over the life of the survey, neutral sentiment has averaged a reading just 0.9 percentage points lower than this week's reading.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-AAII-Neutral.png))**\n\n&gt; The NAAIM Exposure Index is yet one more sentiment reading that also has shown some moderation but remains at a generally bullish level. This index reflects the average exposure to US equities of members of the National Association of Active Investment Managers. Readings of 200 would indicate they are leveraged long on average, 100 would be fully invested, 0 would be market neutral, -100 would be fully short, and -200 would be leveraged short. Last week saw this index tip above 100 for the first time since mid-February which also ranked in the top 2% of all readings going back to 2006. This week it fell 15.93 points. That stands in the bottom decile of weekly moves and was the largest drop since late March, but at 87.79, the index still points to historically bullish positioning among active managers.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/05/050621-NAAIM.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending May 7th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=E07MTeHTMe4))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 5.9.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=RVTxZHyUDvA))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **(T.B.A. THIS WEEKEND.)**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/t2D133W.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/7QFXqBx.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/0X9IBEt.jpg))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 5.10.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/alkYsz5.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/HAh8p1I.png))\n\n&gt; # ***Monday 5.10.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/DKZzmHm.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/WE62nHL.png))\n\n*****\n\n&gt; # ***Tuesday  5.11.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/fQpT6Tw.png))\n\n&gt; # ***Tuesday 5.11.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/MqT0VW2.png))\n\n*****\n\n&gt; # ***Wednesday 5.12.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jZpyD2A.png))\n\n&gt; # ***Wednesday 5.12.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ddl5bEp.png))\n\n*****\n\n&gt; # ***Thursday 5.13.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oVFXepP.png))\n\n&gt; # ***Thursday 5.13.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/BZ8BaOn.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/mYeLJZb.png))\n\n*****\n\n&gt; # ***Friday 5.14.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/v6lNwIt.png))\n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/1cL8gOj.png))\n\n*****\n\n&gt; # ***Friday 5.14.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\n&gt; # Palantir Technologies Inc. $19.75\n**Palantir Technologies Inc. (PLTR)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, May 11, 2021. The consensus earnings estimate is $0.04 per share on revenue of $332.23 million and the Earnings Whisper ® number is $0.06 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat. Short interest has decreased by 9.1% since the company's last earnings release while the stock has drifted lower by 34.2% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, April 27, 2021 there was some notable buying of 13,293 contracts of the $25.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 11.3% move on earnings and the stock has averaged a 10.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Alibaba Group Holding Ltd. $225.31\n**Alibaba Group Holding Ltd. (BABA)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, May 13, 2021. The consensus earnings estimate is $1.78 per share on revenue of $27.53 billion and the Earnings Whisper ® number is $1.93 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 97.78% with revenue increasing by 70.53%. Short interest has increased by 15.8% since the company's last earnings release while the stock has drifted lower by 14.8% from its open following the earnings release to be 12.9% below its 200 day moving average of $258.56. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 18,186 contracts of the $245.00 call expiring on Friday, May 14, 2021. Option traders are pricing in a 4.6% move on earnings and the stock has averaged a 2.5% move in recent quarters.\nWorkhorse Group Inc. $9.64\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BABA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Workhorse Group Inc. $9.64\n**Workhorse Group Inc. (WKHS)** is confirmed to report earnings at approximately 9:00 AM ET on Monday, May 10, 2021. The consensus estimate is for a loss of $0.19 per share on revenue of $2.61 million and the Earnings Whisper ® number is ($0.15) per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 416.67% with revenue increasing by 3,007.14%. Short interest has increased by 103.2% since the company's last earnings release while the stock has drifted lower by 39.6% from its open following the earnings release to be 53.3% below its 200 day moving average of $20.64. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 8,546 contracts of the $9.50 put expiring on Friday, May 14, 2021. Option traders are pricing in a 16.8% move on earnings and the stock has averaged a 7.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WKHS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Walt Disney Co $184.84\n**Walt Disney Co (DIS)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, May 13, 2021. The consensus earnings estimate is $0.28 per share on revenue of $15.86 billion and the Earnings Whisper ® number is $0.43 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 53.33% with revenue decreasing by 11.93%. The stock has drifted lower by 4.2% from its open following the earnings release to be 17.9% above its 200 day moving average of $156.73. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, May 3, 2021 there was some notable buying of 5,866 contracts of the $200.00 call expiring on Friday, May 14, 2021. Option traders are pricing in a 4.4% move on earnings and the stock has averaged a 3.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DIS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Trade Desk, Inc. $661.43\n**Trade Desk, Inc. (TTD)** is confirmed to report earnings at approximately 7:00 AM ET on Monday, May 10, 2021. The consensus earnings estimate is $0.77 per share on revenue of $216.90 million and the Earnings Whisper ® number is $0.92 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat The company's guidance was for revenue of $214.00 million to $217.00 million. Consensus estimates are for earnings to decline year-over-year by 7.23% with revenue increasing by 35.01%. Short interest has increased by 38.3% since the company's last earnings release while the stock has drifted lower by 21.4% from its open following the earnings release to be 2.4% below its 200 day moving average of $677.57. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 10.2% move on earnings and the stock has averaged a 9.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=TTD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # fuboTV Inc. $17.24\n**fuboTV Inc. (FUBO)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, May 11, 2021. The consensus estimate is for a loss of $0.44 per share on revenue of $103.79 million and the Earnings Whisper ® number is ($0.39) per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat The company's guidance was for revenue of $101.00 million to $103.00 million. Consensus estimates are for earnings to decline year-over-year by 193.33% with revenue increasing by 1,322.76%. The stock has drifted lower by 54.3% from its open following the earnings release to be 24.7% below its 200 day moving average of $22.89. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 27, 2021 there was some notable buying of 4,094 contracts of the $40.00 put and 4,052 contracts of the $40.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 16.4% move on earnings and the stock has averaged a 10.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # BioNTech SE $183.71\n**BioNTech SE (BNTX)** is confirmed to report earnings at approximately 6:30 AM ET on Monday, May 10, 2021. The consensus earnings estimate is $4.31 per share on revenue of $2.60 billion and the Earnings Whisper ® number is $5.11 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1,757.69% with revenue increasing by 8,420.68%. Short interest has increased by 25.0% since the company's last earnings release while the stock has drifted higher by 84.1% from its open following the earnings release to be 82.9% above its 200 day moving average of $100.44. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 1,517 contracts of the $155.00 put expiring on Friday, May 14, 2021. Option traders are pricing in a 10.8% move on earnings and the stock has averaged a 5.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BNTX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Virgin Galactic Holdings, Inc. $19.61\n**Virgin Galactic Holdings, Inc. (SPCE)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, May 10, 2021. The consensus estimate is for a loss of $0.31 per share. Investor sentiment going into the company's earnings release has 44% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 3.33% with revenue increasing by 419,647.90%. Short interest has increased by 27.5% since the company's last earnings release while the stock has drifted lower by 45.1% from its open following the earnings release to be 26.2% below its 200 day moving average of $26.57. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, May 3, 2021 there was some notable buying of 8,668 contracts of the $17.00 put expiring on Friday, May 21, 2021. Option traders are pricing in a 11.9% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPCE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Airbnb, Inc. $151.21\n**Airbnb, Inc. (ABNB)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, May 13, 2021. The consensus estimate is for a loss of $1.15 per share on revenue of $704.86 million and the Earnings Whisper ® number is ($1.20) per share. Investor sentiment going into the company's earnings release has 56% expecting an earnings beat. The stock has drifted lower by 22.1% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. On Friday, May 7, 2021 there was some notable buying of 5,211 contracts of the $160.00 call expiring on Friday, May 14, 2021. Option traders are pricing in a 9.9% move on earnings and the stock has averaged a 13.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ABNB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\nI hope you all have a wonderful Mother's Day weekend and a great week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning May 10th, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/n8dc54/wall_street_week_ahead_for_the_trading_week/",
        "created": 1620592401.0
    },
    {
        "author": "hankmcgruff",
        "created_utc": 1621042158,
        "id": "ncny25",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "  \n\n**60 Minutes to Air Specialized UAP Program ahead of Govt June Mandate to Release Files! (Link Below)**\n\n[https://twitter.com/60Minutes/status/1393250354133970949?s=20](https://twitter.com/60Minutes/status/1393250354133970949?s=20)\n\n**Unidentified Aerial Phenomenon**\n\nMomentum has been building across the world for greater disclosure of government knowledge into UAP’s (Unidentified Aerial Phenomenon) after the New York Times released it’s bombshell coverage of encounters by 3 Navy pilots in 2017 and 2019 each reporting to have seen technology that defies the limits of physics with capabilities that far exceed that of any known assets in US, Russian or Chinese arsenals. Manoeuvres that have been witnessed include rapid deacceleration (high velocity to a sudden stop, then hover); sharp angle, high velocity low angle turns (right angles or sharper); low altitude trans medium travel (submerged craft lifting and flying from water, and the reverse); high altitude trans medium travel (craft dropping from above 80,000 ft then coming to a hover at 30,000 ft, and the reverse); high velocity travel (Mach 10+ or near instantaneous); non aerodynamic aircraft design (cubes, pyramids, cylinders, disks, acorns, top hats) and propulsion systems that do not function off of exothermic thrust based physics (no thermal heat trail). Pressure has been building on the Pentagon to release what it knows, which has since resulted in the declassification of those videos and confirmation by the Pentagon that they are authentic as well as new mandates outlined in the 2021 COVID relief bill mandating full government disclosure by June 2021. The Pentagon has also publicly announced the creation of a new UFO taskforce and has been giving closed door briefings to members of the Senate and Congress, including the Senate Intelligence Committee, on these incursions into American airspace. Former Senate Majority Leader Harry Reid has long fought for funding and disclosure and recently when asked the question “so are you saying there’s information that the public hasn’t seen on the subject”; he responded, “what I’m telling you is that the public hasn’t seen most of the information”. \n\nAs recently as two weeks ago, new videos and pictures have been leaked of UAP’s flying in formation over US battle squadrons which include captured images of acorn and pyramid shaped craft hovering at distance. The frequency of these incursions has also been alarming, prompting several Atlantic based Airforce bases to issue warnings to their pilots of unknown objects in their airspace ahead of every exercise. Radar technicians aboard the aircraft carrier “Nimitz” describe seeing these objects at such a high frequency and in such high numbers that on some days they were described as “falling out of the sky”. Additional alarm has been raised by other members of the military as the frequency of sightings also seems to correlate with proximity to nuclear facilities including missile silos, aircraft carriers and submarines, with senior officials in charge of these facilities describing anomalies in launch sequences that appear to be intentional. These concerns are what prompted Christopher Lemon, former Deputy Assistant Secretary of Defense for Intelligence along with Luis Elizondo, former director of the Advanced Aerospace Threat Identification Program (ATTIP) at the Pentagon to leak the videos to the New York Times. \n\nSpeculation of UFO’s dates back to World War II where pilots regularly observed bright lights in the sky that would track them into battles. At the time, these unknown objects were referred to as “Foo Fighters” but were later termed UFO’s (Unidentified Flying Objects) after the public became enthralled in the crash at Roswell where the government announced it was in possession of an alien aircraft and subsequently retracted the story the following day. Public interest was further garnered in the 1980’s when a military contractor, Bob Lazar, who worked as a physicist on advanced propulsion systems came forward with information that he had worked on 9 crafts in government possession at a military black site called S-4 that matched the descriptions and performance capabilities of the UFO’s described by pilots. This base was later known as Area 51 and has captured the publics imagination ever since. \n\nIn 2001, a group of concerned senior military leadership and citizens held the first attempt at public disclosure, hosting the Citizens Disclosure Project in front of a panel of several sitting US Senators. While momentum again began to build, that momentum was quickly quashed by the events of September 11 and public interest and only just begun to resurface. Article in the New York Times detailing the UAP Task Force and report release here:\n\n[https://www.nytimes.com/2020/07/23/us/politics/pentagon-ufo-harry-reid-navy](https://www.nytimes.com/2020/07/23/us/politics/pentagon-ufo-harry-reid-navy)\n\nInvestigative journalism by The New Yorker in its most recent May issue detailing the heightened controversy, link below:\n\n[https://www.newyorker.com/magazine/2021/05/10/how-the-pentagon-started-taking-ufos-seriously](https://www.newyorker.com/magazine/2021/05/10/how-the-pentagon-started-taking-ufos-seriously)\n\n**Invest in otherworldly opportunities – Procure Space ETF (UFO)**\n\nUFO has captured the minds of space-themed investing since its inception date April 10, 2019. It has performed remarkably in-line with peers when benchmarked against the S&amp;P 1500 Industrials Index as of May 12, 2021. As with many funds of its vintage the crash of March’20 effectively served as a stress test to the financial health of its component companies, which it passed with flying colors, achieving almost a full retracement (the fund only recorded a loss in value of 3.64%, from $26.37 to $25.41, which was improved by a further 1% from dividends earned during the period). Post-2020, similar space-ETFs have launched in 2021 in advance of an anticipated flood of investor funds into this emerging sector as Morgan Stanley estimates the global space industry could generate revenue of more than $1 trillion of more in 2040, up from $350 billion, currently. With roughly half of that increase expected to come from satellite broadband, UFO is well positioned to benefit from this influx of capital with 40.71% of fund allocation comprised of a mix of both orbital and surface communication companies. Full fund composition breakdown below:\n\nORBCOMM Inc (6.90%), DISH Network Corp Class A (6.21%), Garmin Ltd (5.34%), Eutelsat Communications (5.26%), Trimble Inc (4.99%), SES SA DR (4.88%), EchoStar Corp (4.87%), Weathernews Inc (4.78%), Sirius XM Holdings Inc (4.71%), SKY Perfect JSAT Corp (4.55%), Viasat Inc (4.27%), Iridium Communications Inc (4.24%), Avio SpA (3.84%), Loral Space &amp; Communications Inc (3.81%), Gilat Satellite Networks Ltd (3.26%), Maxar Technologies Inx (3.19%), Lockheed Martin Corp (2.81%), AT&amp;T Inc (2.71%), Raytheon Technologies Corp (2,68%), Comcast Corp Class A (2.49%), Northrop Grumman Corp (2.44%), Virgin Galactic Holdings Inc Shs A (2.40%), L3Harris Technologies Inc (2.25%), Boeing Co (2.20%), Honeywell International Inc (1.73%).\n\nManagement fee associated with the fund of 0.75%.\n\n**Why UFO? What’s the play here?**\n\nFormer Democratic Majority Leader and Nevada Senator Harry Reid, as well as other notable ufologists, have long claimed that defense contractor Lockheed Martin may have had fragments of a crashed UFO in its possession. Many claim that possession of the UFO material is what not only inspired the shapes of many skunkworks aircraft but led to multiple breakthroughs in materials research and stealth technology. Employees at LMT have gone so far as to make eyewitness reports of alien sightings and direct interactions. More broadly speaking, any admission by the government of extra-terrestrials will naturally be met with fear, and the simple play here is to place a long trade on defense and aerospace of which UFO has a significant composition (with an allocation of 27.19%, including major Pentagon contractors Raytheon, Northrop and Boeing). Should the evidence provided be less than conclusive interest in UFO the ETF is expected to increase at the bare minimum both from direct key term searches (literally the letters “UFO”), searches by retail investors surrounding related investment opportunities, and even more generally through social media sentiment. The uptick in interest should naturally lead to an increase in volume traded in popular aerospace and defense stocks, most of which are held by the fund. Defense stocks are a popular benefactor in times of global uncertainty and the sudden interest back to space is likely to exacerbate existing trends toward the militarization of space and a resurgence of Cold War between leading world powers (notably between the US, China and Russia, see this article in Politico below). Increased investment into satellite communications is also an expected knock-on effect as countries will be focused on boosting their “ears and eyes in the skies” (see below article from C4ISRNET). Article links:\n\n[https://www.politico.com/story/2019/06/16/war-in-space-trump-china-1365842](https://www.politico.com/story/2019/06/16/war-in-space-trump-china-1365842)\n\n[https://www.c4isrnet.com/battlefield-tech/space/2021/02/26/report-broadens-conversation-on-space-militarization-and-space-force-satellite-defense/](https://www.c4isrnet.com/battlefield-tech/space/2021/02/26/report-broadens-conversation-on-space-militarization-and-space-force-satellite-defense/)",
        "subreddit": "wallstreetbets",
        "title": "60 Minutes to Air Specialized UAP Program ahead of Govt June Mandate to Release Files!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ncny25/60_minutes_to_air_specialized_uap_program_ahead/",
        "created": 1621070958.0
    },
    {
        "author": "GardenCat1551",
        "created_utc": 1620058803,
        "id": "n408gk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Any thoughts on upcoming TRMB earnings? People usually sell off to minimize risk right?",
        "url": "https://www.reddit.com/r/StockMarket/comments/n408gk/any_thoughts_on_upcoming_trmb_earnings_people/",
        "created": 1620087603.0
    }
]