[
    {
        "author": "ArtichokeOk9708",
        "created_utc": 1615298914,
        "id": "m174cm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Morning Stock Review Mar 9 2021 $PAYC",
        "url": "https://youtube.com/watch?v=1CtOjZMF-Oo&amp;feature=share",
        "created": 1615327714.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1615239549,
        "id": "m0qv3d",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "Stocks were mixed on Monday as Treasury yields rose amid stimulus optimism. The Dow Jones (DIA) gained close to 1% while the S&amp;P 500 (SPY) and Nasdaq (QQQ) pulled back. The tech-heavy Nasdaq (QQQ) is officially in correction territory, falling more than 10% from its recent highs. \n\nOver the weekend, the Senate approved the $1.9 trillion stimulus package. The bill, which includes $300 per week in enhanced federal unemployment benefits through early September, $350 billion in state and local aid and $1,400 stimulus checks to Americans who qualify is set for a vote in the House of Representatives tomorrow before being sent to President Biden’s for signature. The bill is likely to pass before the March 14 deadline where enhanced federal unemployment benefits expire. \n\nThe prospect of a strong economic recovery post-pandemic, enabled by the rollout of vaccines and supportive fiscal and monetary policy, have simultaneously pushed estimates for growth higher while stoking fears of inflation. As a result, Treasury yields have turned sharply higher, hovering near 1.6%,  making bonds more attractive and capital more expensive to borrow. Rising yields hurt high-growth companies, like tech stocks, the most because these companies generate most of their revenue and earnings years down the road. The future value of that capital decreases in today’s dollar value as the yield increases. As a result, market participants are increasingly rotating out of high-flying stocks that led 2020 into stocks that will benefit from economic reopening. \n\nHighlights\nThe ARKK Innovation ETF (ARKK), which counts Tesla as its top holding by market value, has plunged by 22% over the past two weeks, as Tesla and other high-flying tech names like Square and Roku gave back some of their 2020 gains. This was the best performing ETF last year.\n\nShares of Apple (AAPL) and other tech giants are near 3-month lows. Could be a good time to get in as a safe, long term investment.\n\nShares of Gamestop (GME) and AMC surged again today, very interesting. As usual, exercise extreme caution around these plays, no one knows what could possibly happen.\n\nRoblox's IPO is set to take place on the New York Stock Exchange on Wednesday under the ticker symbol \"RBLX.\" \n\n*Please note that current stock price was written in the morning premarket and does not reflect intraday movement*\n \n\nAccenture (ACN) target raised by Susquehanna from $267 to $290 at Positive. Stock currently around $250\n\nC3 AI (AI) target raised by Needham &amp; Co from $193 to $195 at Buy. Stock currently around $95\n\nAmbarella (AMBA) target raised by Morgan Stanley from $125 to $136 at Overweight. Stock currently around $113\n\nDigital Turbine (APPS) target raised by Roth Capital from $87 to $100 at Buy. Stock currently around $74\n\nBroadcom (AVGO) target raised by Morgan Stanley from $521 to $538 at Overweight. Stock currently around $450\n\nCitigroup (C) target raised by Wells Fargo from $74 to $82 at Overweight. Stock currently around $70\n\nCRISPR Therapeutics (CRSP) target raised by Barclays from $113 to $140 at Overweight. Stock currently around $114\n\nDraftKings (DKNG) target raised by Cannaccord Genuity from $65 to $80 at Buy. Stock currently around $59\n\nJazz Pharma (JAZZ) target raised by UBS Group from $174 to $228 at Buy. Stock currently around $165\n\nLogitech (LOGI) target raised by Morgan Stanley from $116 to $122 at Overweight. Stock currently around $95\n\nMicron Technology with three target raises. Consensus price target is $107 at Overweight. Stock currently around $89\n\nNovoCure (NVCR) target raised by Mizuho from $150 to $175 at Buy. Stock currently around $130\n\nOracle (ORCL) target raised by Cowen from $70 to $77 at Outperform. Stock currently around $70\n\nPersonalis (PSNL) target raised by Morgan Stanley from $27 to $38 at Overweight. Stock currently around $24\n\nSarepta Therapeutics (SRPT) target raised by SVB Leerink from $125 to $126 at Outperform. Stock currently around $85\n\nTwitter (TWTR) target raised by Morgan Stanley from $54 to $75 at Equal-Weight. Stock currently around $67.\n\nWestern Digital (WDC) with two target raises. Stock currently around $68\n\nDeutsche Bank from $65 to $80 at Buy\n\nMorgan Stanley from $58 to $84 at Overweight. \n\nZoom (ZM) target raised by Morgan Stanely from $390 to $420 at Equal-Weight. Stock currently around $338",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Monday, March 8, 2021.",
        "url": "https://www.reddit.com/r/StockMarket/comments/m0qv3d/here_is_a_market_recap_for_today_monday_march_8/",
        "created": 1615268349.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1615585500,
        "id": "m3ryxk",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, March 12, 2021**\n\nStocks traded mixed on Friday, with technology stocks coming under pressure once again as Treasury yields resumed their march forward. The Dow extended gains from yesterday, hitting fresh intraday records. The S&amp;P 500 (SPY) opened in the red but managed to climb throughout the session to finish modestly green.\n\nAfter months of negotiation, President Biden signed into law a new $1.9 trillion coronavirus relief package after the bill passed in both houses of Congress by party-line votes. The bill includes provisions like $1,400 stimulus checks to most Americans, $300 per week in augmented unemployment benefits through early September, and $350 billion in state, local and tribal government aid. The bill comes exactly one year following the World Health Organization's formal designation of the coronavirus outbreak as a pandemic on March 11, 2020. \n\nThe 10-year Treasury yield climbed more than 10 basis points to reach a fresh, one year high at 1.628%. This marks a rise of around 50 basis points compared to levels from a month ago. Yields are rising in response to inflationary fears and expectations for explosive growth as the economy reopens.  Kit Juckes, Societe Generale macro strategist, wrote in a note to clients, “The pattern seems clear enough: The equity market is seeing a sector rotation but not a correction; the bond market is seeking a new equilibrium in the light of a vastly improved economic outlook in both the U.S. and elsewhere.”\n\nRising Treasury yields hurt high-growth stocks the most because high-growth companies generate most of their cash and earnings years down the road. Future cash decreases in today's dollars as rates increase partly because investors have more opportunity to earn bigger returns from assets paying higher interest and dividends right now. \n\nIn vaccine news, shares of Novavax (NVAX) jumped 8% on Friday after a final[ analysis of the drugmaker's COVID-19 vaccine trial in the UK showed the inoculation was 96.4% effective ](https://ir.novavax.com/news-releases/news-release-details/novavax-confirms-high-levels-efficacy-against-original-and-0)against the original strain of the coronavirus. Analyses also showed the vaccine was 86.3% effective against the variant of the coronavirus circulating in the UK, and 55.4% effective against the variant circulating in South Africa.\n\nAfter AstraZeneca (AZN) and European officials asked the US to share their stockpile of AZN while the FDA conducts further trials to determine whether to grant the vaccine emergency use authorization. In other news, several countries have suspended distribution of AZN’s vaccine following reports of blood clots. A WHO spokeswoman, Margaret Harris, said at a briefing that an advisory committee was investigating reports of individuals falling ill or dying after developing blood clots in the post-vaccination period, but that no causal link had been established.\n\n**Highlights**\n\n* Bitcoin (BTC) reached a new all-time high at $58,000, extending the cryptocurrency’s dizzying rally in the last 12 months.  \n* A Tesla Inc investor has sued Chief Executive Officer Elon Musk and its board, saying many of his tweets violated a previous settlement with the U.S. Securities and Exchange Commission.\n* siphoned away by online platforms could get an assist from Congress under legislation that a House panel took up Friday. If passed, the legislation would grant news organizations a four-year exemption from antitrust laws to band together to negotiate compensation from online platforms that use their content, including Facebook Inc. and Alphabet Inc.'s Google.\n* Ford Motor Co on Friday nominated two younger Ford family members to its board of directors. The board nominated Alexandra Ford English, the 33-year-old daughter of Executive Chairman Bill Ford, and Henry Ford III, the 40-year-old son of Edsel Ford, Bill's cousin who is retiring from the board in May\n* On Friday morning, Hindenburg Research published a negative research report about Lordstown Motors (ticker: RIDE). The report makes several claims, notably that not all of the preorders the company has claimed are real. This is the same firm that published a popular short report on EV-company Nikola (NKLA) months ago. \n* \\*\\***Please note that the current stock price was written in the morning and does not reflect intraday changes\\*\\***\n* AerCap (AER) target raised by Cowen from $54 to $75 at Outperform. Stock currently around $60. AER acquired GE Capital Aviation Services, business, in a transaction involving $24 billion of cash, $1 billion of AerCap notes and/or cash, and 1.1 billion newly issued AerCap shares.\n* DocuSign (DOCU) target raised by Morgan Stanley (MS) from $280 to $290 at Outperform. Stock currently around $208\n* DOMO with two target raises. Stock currently around $63. \n   * Needham &amp; Co from $85 to $91 at Buy\n   * Cowen from $72 to$85 Outperform\n* Fate Therapeutics (FATE) target raised by SVB Leerink to $121 at Outpeform. Stock currently around $95\n* JD.com (JD) target raised by UBS Group from $105 to $110 at Buy. Stock currently around $83\n* NovaVax (NVAX) target raised by HC Wainwright from $207 to $317 at Buy following positive vaccine news. Stock currently around $201\n* ULTA Beauty (ULTA) with too many target raise to list. Consensus price target $350 at Overweight. Stock currently around $312\n* Western Digital (WDC) target raised by Wedbush from $68 to $85 at Outperform. Stock currently around $69\n\n“The way to get started is to quit talking and begin doing.” - Walt Disney",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, March 12, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/m3ryxk/here_is_a_market_recap_for_today_friday_march_12/",
        "created": 1615614300.0
    },
    {
        "author": "WorldDense3368",
        "created_utc": 1615496189,
        "id": "m30jlh",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "have fun boys it looks like musk probably sold every plaid plus for a year in teslas fleet deal elektric noted orders on the next batch got pushed back publicly to 2022. \n\ngain north of 100k its pages long\n\n📷 ate the image last time top is tsla bottom is wdc\n\nhttps://preview.redd.it/kv5xzyvupgm61.png?width=3045&amp;format=png&amp;auto=webp&amp;s=3579766e2a4d5742641731c53a124a45c34bde65",
        "subreddit": "wallstreetbets",
        "title": "tesla, thesse bots don't like me ..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m30jlh/tesla_thesse_bots_dont_like_me/",
        "created": 1615524989.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1615239429,
        "id": "m0qthm",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "correction territory, falling more than 10% from its recent highs. \n\nOver the weekend, the Senate approved the $1.9 trillion stimulus package. The bill, which includes $300 per week in enhanced federal unemployment benefits through early September, $350 billion in state and local aid and $1,400 stimulus checks to Americans who qualify is set for a vote in the House of Representatives tomorrow before being sent to President Biden’s for signature. The bill is likely to pass before the March 14 deadline where enhanced federal unemployment benefits expire. \n\nThe prospect of a strong economic recovery post-pandemic, enabled by the rollout of vaccines and supportive fiscal and monetary policy, have simultaneously pushed estimates for growth higher while stoking fears of inflation. As a result, Treasury yields have turned sharply higher, hovering near 1.6%,  making bonds more attractive and capital more expensive to borrow. Rising yields hurt high-growth companies, like tech stocks, the most because these companies generate most of their revenue and earnings years down the road. The future value of that capital decreases in today’s dollar value as the yield increases. As a result, market participants are increasingly rotating out of high-flying stocks that led 2020 into stocks that will benefit from economic reopening. \n\nHighlights\n\nThe ARKK Innovation ETF (ARKK), which counts Tesla as its top holding by market value, has plunged by 22% over the past two weeks, as Tesla and other high-flying tech names like Square and Roku gave back some of their 2020 gains. This was the best performing ETF last year.\n\nShares of Apple (AAPL) and other tech giants are near 3-month lows. Could be a good time to get in as a safe, long term investment.\n\nShares of Gamestop (GME) and AMC surged again today, very interesting. As usual, exercise extreme caution around these plays, no one knows what could possibly happen.\n\nRoblox's IPO is set to take place on the New York Stock Exchange on Wednesday under the ticker symbol \"RBLX.\" \n\n*Please note that current stock price was written in the morning premarket and does not reflect intraday movement*\n \nAccenture (ACN) target raised by Susquehanna from $267 to $290 at Positive. Stock currently around $250\n\nC3 AI (AI) target raised by Needham &amp; Co from $193 to $195 at Buy. Stock currently around $95\n\nAmbarella (AMBA) target raised by Morgan Stanley from $125 to $136 at Overweight. Stock currently around $113\n\nDigital Turbine (APPS) target raised by Roth Capital from $87 to $100 at Buy. Stock currently around $74\n\nBroadcom (AVGO) target raised by Morgan Stanley from $521 to $538 at Overweight. Stock currently around $450\n\nCitigroup (C) target raised by Wells Fargo from $74 to $82 at Overweight. Stock currently around $70\n\nCRISPR Therapeutics (CRSP) target raised by Barclays from $113 to $140 at Overweight. Stock currently around $114\n\nDraftKings (DKNG) target raised by Cannaccord Genuity from $65 to $80 at Buy. Stock currently around $59\n\nJazz Pharma (JAZZ) target raised by UBS Group from $174 to $228 at Buy. Stock currently around $165\n\nLogitech (LOGI) target raised by Morgan Stanley from $116 to $122 at Overweight. Stock currently around $95\n\nMicron Technology with three target raises. Consensus price target is $107 at Overweight. Stock currently around $89\n\nNovoCure (NVCR) target raised by Mizuho from $150 to $175 at Buy. Stock currently around $130\n\nOracle (ORCL) target raised by Cowen from $70 to $77 at Outperform. Stock currently around $70\n\nPersonalis (PSNL) target raised by Morgan Stanley from $27 to $38 at Overweight. Stock currently around $24\n\nSarepta Therapeutics (SRPT) target raised by SVB Leerink from $125 to $126 at Outperform. Stock currently around $85\n\nTwitter (TWTR) target raised by Morgan Stanley from $54 to $75 at Equal-Weight. Stock currently around $67.\n\nWestern Digital (WDC) with two target raises. Stock currently around $68\n\nDeutsche Bank from $65 to $80 at Buy\n\nMorgan Stanley from $58 to $84 at Overweight. \n\nZoom (ZM) target raised by Morgan Stanely from $390 to $420 at Equal-Weight. Stock currently around $338\n\n\"In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock price not risk, but it is an opportunity. Where else do you look for cheap stocks?\" -Li Lu",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, March 8, 2021.",
        "url": "https://www.reddit.com/r/stocks/comments/m0qthm/here_is_a_market_recap_for_today_monday_march_8/",
        "created": 1615268229.0
    },
    {
        "author": "dan_lev",
        "created_utc": 1615736330,
        "id": "m4xcd5",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "It's Fate. Using WDC and GME tendies to adopt Mars from the WDC!",
        "url": "https://i.redd.it/dfsrip9gj0n61.jpg",
        "created": 1615765130.0
    },
    {
        "author": "WorldDense3368",
        "created_utc": 1615495854,
        "id": "m30faq",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "have fun boys it looks like musk probably sold every plaid plus for a year in teslas fleet deal elektric noted orders on the next batch got pushed back publicly to 2022 top is tesla bottom is wdc",
        "subreddit": "wallstreetbets",
        "title": "tesla, bite me bot",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m30faq/tesla_bite_me_bot/",
        "created": 1615524654.0
    },
    {
        "author": "Unlucky-Dare",
        "created_utc": 1615592616,
        "id": "m3ublw",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "# Highlights from Friday’s trading session\n\n*  Dow posts another record close\n* Treasury bears hunt down tech stocks\n* Analysts believe Apple could hit $3T market capitalization\n* Biden signs $1.9T stimulus package\n\nTech stocks coming under pressure once again as Treasury yields resumed the pump. The Dow extended gains from yesterday, hitting fresh intraday records. The S&amp;P 500 (SPY) opened in the red but managed to climb throughout the session to finish green.\n\nPresident Biden signed into law a new $1.9 trillion coronavirus relief package after the bill passed in both houses of Congress by party-line votes. The bill includes provisions like $1,400 stimulus checks to most Americans, $300 per week in augmented unemployment benefits through early September, and $350 billion in state, local and tribal government aid. \n\nThe 10-year Treasury yield climbed more than 10 basis points to reach a fresh, one year high at 1.628%. This marks a rise of around 50 basis points compared to levels from a month ago. Yields are rising in response to inflationary fears and expectations for explosive growth as the economy reopens.  \n\n[WSBN Video on Treasury Yields](https://www.youtube.com/watch?v=i07x-c9Bt_0&amp;t=30s)\n\n# Friday Market Recap\n\n* Dow posts another record close\n\nThe Dow Jones Industrial Average jumped to another record high on Friday as rising reopening optimism continued to encourage the rotation into cyclical stocks. The 30-stock benchmark climbed 293.05 points, or 0.9%, to close at a record at 32,778.64.\n\n* Treasury bears hunt down tech stocks\n\nRecent gains made by tech stocks may soon be wiped out if the treasury yields keeps climbing. U.S. stocks fell on Friday as yields rose to 1.6%, the highest since February 2013, rekindling fears that rising rates will take the comeback momentum out of equities, especially tech names.\n\n* Analysts believe Apple could hit $3trn market capitalization\n\nAnalysts from Wedbush and Citi bank believe that Apple could hit a 3T market valuation. The company’s venture into the EV space, plus the iPhone which is expected to have blockbuster sales, could further strengthen the tech company’s position as the mots capitalized and valuable company in the world.\n\n• Lordstorm Motors falls by 20% on Short sellers report\n\nShares of Lordstown Motors dropped by as much as 20% after Hinderburg research a short position on the stick. The short seller’s move was based on a sharply critical report on the electric-vehicle maker.\n\n**Highlights**  \n\n\n* Bitcoin (BTC) reached a new all-time high at $58,000\n* A Tesla Inc investor has sued Chief Executive Officer Elon Musk and its board, saying many of his tweets violated a previous settlement with the U.S. Securities and Exchange Commission.\n*  Ford Motor Co on Friday nominated two younger Ford family members to its board of directors. The board nominated Alexandra Ford English, the 33-year-old daughter of Executive Chairman Bill Ford, and Henry Ford III, the 40-year-old son of Edsel Ford, Bill's cousin who is retiring from the board in May\n* DocuSign (DOCU) target raised by Morgan Stanley (MS) from $280 to $290 at Outperform. \n* JD.com (JD) target raised by UBS Group from $105 to $110 at Buy. \n* NovaVax (NVAX) target raised by HC Wainwright from $207 to $317 at Buy following positive vaccine news. \n* ULTA Beauty (ULTA) with too many target raise to list. Consensus price target $350 at Overweight. \n* Western Digital (WDC) target raised by Wedbush from $68 to $85 at Outperform.",
        "subreddit": "Wallstreetbetsnew",
        "title": "Market Recap - Friday, March 12th 2021",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/m3ublw/market_recap_friday_march_12th_2021/",
        "created": 1615621416.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1615585536,
        "id": "m3rzer",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Stocks traded mixed on Friday, with technology stocks coming under pressure once again as Treasury yields resumed their march forward. The Dow extended gains from yesterday, hitting fresh intraday records. The S&amp;P 500 (SPY) opened in the red but managed to climb throughout the session to finish modestly green.\n\nAfter months of negotiation, President Biden signed into law a new $1.9 trillion coronavirus relief package after the bill passed in both houses of Congress by party-line votes. The bill includes provisions like $1,400 stimulus checks to most Americans, $300 per week in augmented unemployment benefits through early September, and $350 billion in state, local and tribal government aid. The bill comes exactly one year following the World Health Organization's formal designation of the coronavirus outbreak as a pandemic on March 11, 2020. \n\nThe 10-year Treasury yield climbed more than 10 basis points to reach a fresh, one year high at 1.628%. This marks a rise of around 50 basis points compared to levels from a month ago. Yields are rising in response to inflationary fears and expectations for explosive growth as the economy reopens.  Kit Juckes, Societe Generale macro strategist, wrote in a note to clients, “The pattern seems clear enough: The equity market is seeing a sector rotation but not a correction; the bond market is seeking a new equilibrium in the light of a vastly improved economic outlook in both the U.S. and elsewhere.”\n\nRising Treasury yields hurt high-growth stocks the most because high-growth companies generate most of their cash and earnings years down the road. Future cash decreases in today's dollars as rates increase partly because investors have more opportunity to earn bigger returns from assets paying higher interest and dividends right now. \n\nIn vaccine news, shares of Novavax (NVAX) jumped 8% on Friday after a final[ analysis of the drugmaker's COVID-19 vaccine trial in the UK showed the inoculation was 96.4% effective ](https://ir.novavax.com/news-releases/news-release-details/novavax-confirms-high-levels-efficacy-against-original-and-0)against the original strain of the coronavirus. Analyses also showed the vaccine was 86.3% effective against the variant of the coronavirus circulating in the UK, and 55.4% effective against the variant circulating in South Africa.\n\nAfter AstraZeneca (AZN) and European officials asked the US to share their stockpile of AZN while the FDA conducts further trials to determine whether to grant the vaccine emergency use authorization. In other news, several countries have suspended distribution of AZN’s vaccine following reports of blood clots. A WHO spokeswoman, Margaret Harris, said at a briefing that an advisory committee was investigating reports of individuals falling ill or dying after developing blood clots in the post-vaccination period, but that no causal link had been established.\n\n**Highlights**\n\n* Bitcoin (BTC) reached a new all-time high at $58,000, extending the cryptocurrency’s dizzying rally in the last 12 months.  \n* A Tesla Inc investor has sued Chief Executive Officer Elon Musk and its board, saying many of his tweets violated a previous settlement with the U.S. Securities and Exchange Commission.\n* siphoned away by online platforms could get an assist from Congress under legislation that a House panel took up Friday. If passed, the legislation would grant news organizations a four-year exemption from antitrust laws to band together to negotiate compensation from online platforms that use their content, including Facebook Inc. and Alphabet Inc.'s Google.\n* Ford Motor Co on Friday nominated two younger Ford family members to its board of directors. The board nominated Alexandra Ford English, the 33-year-old daughter of Executive Chairman Bill Ford, and Henry Ford III, the 40-year-old son of Edsel Ford, Bill's cousin who is retiring from the board in May\n* On Friday morning, Hindenburg Research published a negative research report about Lordstown Motors (ticker: RIDE). The report makes several claims, notably that not all of the preorders the company has claimed are real. This is the same firm that published a popular short report on EV-company Nikola (NKLA) months ago. \n* \\*\\***Please note that the current stock price was written in the morning and does not reflect intraday changes\\*\\***\n* AerCap (AER) target raised by Cowen from $54 to $75 at Outperform. Stock currently around $60. AER acquired GE Capital Aviation Services, business, in a transaction involving $24 billion of cash, $1 billion of AerCap notes and/or cash, and 1.1 billion newly issued AerCap shares.\n* DocuSign (DOCU) target raised by Morgan Stanley (MS) from $280 to $290 at Outperform. Stock currently around $208\n* DOMO with two target raises. Stock currently around $63. \n   * Needham &amp; Co from $85 to $91 at Buy\n   * Cowen from $72 to$85 Outperform\n* Fate Therapeutics (FATE) target raised by SVB Leerink to $121 at Outpeform. Stock currently around $95\n* JD.com (JD) target raised by UBS Group from $105 to $110 at Buy. Stock currently around $83\n* NovaVax (NVAX) target raised by HC Wainwright from $207 to $317 at Buy following positive vaccine news. Stock currently around $201\n* ULTA Beauty (ULTA) with too many target raise to list. Consensus price target $350 at Overweight. Stock currently around $312\n* Western Digital (WDC) target raised by Wedbush from $68 to $85 at Outperform. Stock currently around $69\n\n“The way to get started is to quit talking and begin doing.” - Walt Disney",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, March 12, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/m3rzer/here_is_a_market_recap_for_today_friday_march_12/",
        "created": 1615614336.0
    },
    {
        "author": "spadesoftrades",
        "created_utc": 1615223742,
        "id": "m0kkz8",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Been thinking about this stock for a while. Just saw another 4/16 call order for $388k with a $72.50 strike. Seems reasonable that it might hit this, so I'm in on this. How you guys feeling about $WDC?\n\n&amp;#x200B;\n\nhttps://preview.redd.it/i8whg9nv7ul61.png?width=620&amp;format=png&amp;auto=webp&amp;s=60fbaee749049bc70d57f983552fac745d58bd8a",
        "subreddit": "options",
        "title": "$WDC call alert",
        "url": "https://www.reddit.com/r/options/comments/m0kkz8/wdc_call_alert/",
        "created": 1615252542.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1615177256,
        "id": "m07myi",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Watchlist 3-8-21 👀\n\nKEEP EYES ON CRUDE OIL – CRUDE is UP = MARKET DOWN\n\nDow futures rose on Sunday evening as a new stimulus package from Washington headed toward final passage this week . President Joe Biden is expected to sign it into law before unemployment aid programs expire on March 14.\n\n“10-year yields finally caught up to other asset markets. This is putting pressure on valuations, especially for the most expensive stocks that had reached nosebleed valuations,” Mike Wilson, the chief U.S. equity strategist at Morgan Stanley, said in a note.\n\nOn the economic front, investors will get a look at wholesale inventory data from January on Monday. Several economic measures in recent weeks have shown a recovery that is picking up steam, including a better-than-expected February jobs report released on Friday.\n\nHOT SECTORS:\n\n1. House Goods \\^PRPL \\^LCUT \\^LUG \\^SNBR\n2. Financial Technology \\^FUTU \\^MFH\n3. Homebuilding/ Households Goods \\^GMS \\^KNH \\^JELD \\^CNR\n4. Computers, Phones &amp; Household Electronics \\^WDC \\^DBD \\^HPQ \\^SCSC\n5. Oil &amp; Gas \\^HPR \\^WTI \\^CPE \\^PVAC\n6. Natural Gas Utilities \\^OGS \\^NWN \\^SWX \\^SJI\n\nAH RUNNERS TURN POTENTIAL PM GAPPERS: $ANCN $TKAT $ADPT $LOGC $SGBX $CAPR $GBS $OCGN\n\nOil &amp; Gas Drilling\n\nCrude oil is up 2.83% at $67\n\nWatching $RIG $ENSV $BORR $BTU $CDEV $MRO $OXY $APA $HAL $USEG $ICD $CEI $HUSA\n\nCRYPTO/BLOCKCHAIN PLAYS:\n\nBITCOIN OVER 50K\n\n$WKEY with BTC weekend run and news on Friday the market has not reacted to, WISeKey's WISeToken Utility Token, a Blockchain-Based Asset for Machine-to-Machine Interactions is Now Integrated into the Oracle Blockchain.\n\nSympathy/Related: #MOGO #NXTD #MGI #EQOS #BRQS #AIKI4 #IZEA #AEHL #DPW #PBTS #MARA #PHUN #RIOT #EBON #HIVE #BRQS #IPDN #SOS\n\nRENEWABLE ENERGY:\n\n$OEG has earnings coming up\n\n$TRCH has pending merger news\n\nSympathy/Related: #WWR #PECK #PLUG #CLSK #FCEL #SUNW #AMTX #PEIX #ENG #SPI #WATT #ALAC #OPTT #SYPR #CBAT #WWR\n\nTECHNICALS:\n\n$RKT - potential short squeeze. Ex Dividend date is 3/9.\n\n$LOTZ - trending on Stocktwits, potential WSB squeeze\n\nRumor\n\n$CLBS upgraded by Zacks to 10$. just changed trend and is climbing...\n\n$LMPX - LMP Announces Closings on its Stage 1 Acquisitions and Expects its Highest Revenue and Gross Profit this Month in the History of the Company.\n\n$AUVI – NEWS - SteriLumen tweeted that the LEDs in their devices have been proven to kill Coronavirus in seconds. Unusual volume on Friday and it seems to be on a uptrend. With the news it could see a jump to test resistance at the $9.64 and it breaks, the next line of resistance is $10.16.\n\n$SRNE Lee’s Pharmaceutical Announces its Anti-PD-L1 Antibody Socazolimab, Licensed From Sorrento Therapeutics, Receives Clearance to Start Phase 3 Trial as a First-line Treatment of Extensive-stage Small-Cell Lung Cancer\n\nALL look ready for a bounce solely based on oversold chart and stimulus plays\n\n&amp;#x200B;\n\n*Processing img kqf0s1podql61...*\n\nBack Burners: \\^BNGO \\^EYES \\^EARS \\^GHSI",
        "subreddit": "smallstreetbets",
        "title": "Watchlist 3-8-21 👀",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/m07myi/watchlist_3821/",
        "created": 1615206056.0
    },
    {
        "author": "Nijmegen88",
        "created_utc": 1614719131,
        "id": "lwci7k",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "WDC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lwci7k/wdc/",
        "created": 1614747931.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1614872564,
        "id": "lxndly",
        "num_comments": 0,
        "num_crossposts": 0,
        "subreddit": "wallstreetbets",
        "title": "$MU and $WDC BUY the dip.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxndly/mu_and_wdc_buy_the_dip/",
        "created": 1614901364.0
    },
    {
        "author": "Polytroposphere",
        "created_utc": 1614892316,
        "id": "lxvjxv",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "You've probably heard the news by now that 6 Dr Seuss books will no longer be published for imagery that has been deemed racist. Regardless of your political beliefs, we're all here to make MONEY. Basic supply and demand indicates that discontinued books will skyrocket in value if demand increases. Sure enough, within two days, these banned Dr Seuss books are now worth their weight in [fucking gold](https://www.cbr.com/dr-seuss-banned-books-sell-high-pries-seconday-market/).\n\nHere's a breakdown by numbers. I'm using data from Barnes and Noble online to establish the normal hardcover price, and then the lowest price on Amazon to establish approximate selling price after it was announced that they will no longer be published:\n\n* The Cat's Quizzer\n   * $9.99 ---&gt; $499.99 **(4,905% increase)**\n* If I Ran the Zoo\n   * $17.99 ---&gt; $594.00 **(3,202% increase)**\n* On Beyond Zebra\n   * $16.99 ---&gt; $425.25 **(2,403% increase)**\n* Scrambled Eggs Super\n   * $14.75 ---&gt; $325.00 **(2,103% increase)**\n* McElligot's Pool\n   * $19.99 ---&gt; $325.00 **(1,526% increase)**\n* And to Think That I Saw it on Mulberry Street\n   * $16.99 ---&gt; $224.25 **(1,220% increase)**\n\nEvery single one of these is a literal ten-bagger. What's even more crazy is that this [Insider article](https://www.insider.com/classic-childrens-books-that-havent-aged-well-2019-5#if-i-ran-the-zoo-by-theodor-seuss-geisel-aka-dr-seuss-has-been-criticized-for-containing-numerous-offensive-images-1) sort of called it almost two years ago—the first book on their list is If I Ran the Zoo. In addition to the above mentioned Insider article, I looked through several lists of books that are being challenged for racial content. My analysis leads me to believe that *The Indian in the Cupboard* by Lynne Reid Banks, currently being published by Harper Collins, is a prime candidate for a discontinued book squeeze. Here's why:\n\n1. **Low Search Volume**. Here's a Google trends graph of how often the recalled Dr Seuss books were searched for on Amazon. \n\nhttps://preview.redd.it/d178buhtl2l61.png?width=2322&amp;format=png&amp;auto=webp&amp;s=4ad443bc373d439abe34e87d8fbd8c8d04ffd32a\n\nNotice how there's nobody trying to buy these books? This makes sense. No publisher in their right mind would discontinue a popular children's book. This is why books like *The Cat in the Hat* or *Peter Pan*, which have also been criticized, will never go out of print. It would be a financial nightmare.\n\nIn contrast, look at how Indian in the Cupboard stacks up against some other contenders:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1xe9dbpun2l61.png?width=2306&amp;format=png&amp;auto=webp&amp;s=01e3995810de807ae599684cd690ba7efc2149b7\n\nIf you follow the red trendline, you will see that searches for \"Indian in the Cupboard Amazon\" are effectively 0 with some slight upticks every now and then. This contrasts with Amazon searches for titles like Little House on the Prairie, which sees consistent search frequency. Discontinuing further printings of The Indian in the Cupboard will probably have little impact on HarperCollins' margins.\n\n2. **Broad readership base, particularly among middle-aged readers.** In addition to being discontinued, a book will need to have excess demand before the price will surge. This will happen only if the book has a broad readership base. In Dr Seuss's case, so many adults have probably read at least one of the 6 discontinued books growing up (hell I loved Mulberry Street when I was little), which is why they're actually buying up these books now that they've become limited edition items. It probably helps that Dr Seuss wrote his books to help children read and literally every elementary school still uses his writing to teach literacy skills.\n\nSimilarly, *The Indian in the Cupboard* was actually well-received in the 80s and was incorporated into school curriculums nationwide. You can still find entire teaching guides built around *The Indian in the Cupboard*, and I distinctly remember reading this book and filling out worksheets back in third grade 2009. Yeah, this book isn't as popular as it once was, but I'm willing to bet that in the 40 years that it's been out, it's been able to build a solid fanbase of readers who will buy a copy out of nostalgia once this book gets banned. This also gives *The Indian in the Cupboard* an advantage over books like *Pippi Longstocking,* which—despite being a children's book with low search volume—is beloved in Sweden but has a much smaller audience in America.\n\n3. **History of contentious debate.** The controversy over Dr Seuss's books didn't just happen overnight (although it certainly felt that way). His books have been banned in libraries for years and there are [arguments](https://www.nbcnews.com/news/nbcblk/reckoning-dr-seuss-racist-imagery-has-been-years-making-n1259330) going all the way back to the 90s about whether his books are racist. This is the same situation that *The Indian in the Cupboard* finds itself in. It's been removed from numerous public libraries and the American Library Association leadership advised educators to avoid the book as far back as 1991. This is important because the decision to remove books is typically time-sensitive. Given almost 30 years to consider whether or not to discontinue publishing, Harper Collins likely has enough financial data and a good picture of consumer preferences, especially under the current political climate, to decide that they will stop further publications of *The Indian in The Cupboard*. \n\nIt's important to keep in mind that there is significantly less liquidity with trading books than stocks. However, books are still less volatile and, like art pieces, tend to appreciate in value over time. I think that *The Indian in the Cupboard* is a long-term hold which has the potential to increase ten fold when it inevitably gets pulled from circulation.",
        "subreddit": "wallstreetbets",
        "title": "Banned/Discontinued Book Investing",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxvjxv/banneddiscontinued_book_investing/",
        "created": 1614921116.0
    },
    {
        "author": "Liftasaurusrex",
        "created_utc": 1614813723,
        "id": "lx75uz",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Okay so here are my thoughts. Behind Nestle, PepsiCo is the biggest company in it's sector by revenue. It also follows Coke stock fairly closely. But what made the difference this last year was how these two comparable soda giants fared during covid 19.\n\nKO or Coke performed extremely poorly and made less money yoy. It's payout ratio for its dividend was touching 94%. Meaning they only had 6% left over after paying out their shareholders. That's not a lot of money to do much of anything with. ESPECIALLY in an industry that needs to move towards new products with the decline in popularity of Soda.\n\nTo compare with PepsiCo, which even during the pandemic found a way to make more revenue in 2020 than in 2019.\n\nTo give you specific numbers, in 2018 was an increase in total revenue by 1.79% compared to 2017. In 2019 it increased 3.87% compared to 2018, and in 2020 increased a 4.78% which might I remind you that this increase happened during the pandemic. Now why did PepsiCo do well against their main rival coke?\n\nTo answer this in simple terms their portfolio was more diversified than coke's and they focused on releasing new and more popular products as well as packaged food which saw a huge boost in sales from \"Toilet Paper Bandits\" or panic shoppers stocking up on bags of fritos, lays, cheetos, and on the healthier side of things Quaker Oats and other products. Until recently most people thought coke stock was king between the two companies but I believe 2020 may have put pepsi on the podium as our clear winner of the Cola Wars.\n\nPepsi has a dividend yield of 3.12% and a payout ratio of 79.88%\n\nCoke has a dividend yield of 3.35% and a payout ratio of 93.85%\n\nWith the payout ratios so high I am a little concerned for dividend increases for both but I would be shocked if coke raised it any more than they had to to keep their dividend status.\n\nShare price:\n\nI see PepsiCo valued at $154.36 a share\nTrevis Evaluation puts then at $150.16 which I believe is low but close to a 20 dollar per share increase or more either way.\n\nThis is an upside of 18.46% not including dividends.\n\nAnd I calculated Coke to be valued at $52.72 a share.\nTrevis Evaluation puts it at $55.48 which is more than I calculated.\n\nTaking the higher of the two numbers this leave a share price upside of around 11.00%\n\nThere are many other reasons I believe Pepsi is going to be the better long term pick like how they released the new cocktail mixers neon Zebra (which I would love to try) to take some of the cocktail mixer marketshare. Which the mixer market tops 858 MM$ and an industry that grew 35% just last year. Cocktail culture is coming to North America and in the United States and Canada we are heavily accepting these delicious mixers that are premade and easy to make.\n\nWhat are your thoughts on these two companies or their sectors in general? Do you think PepsiCo is undervalued? Or do you think Coke is still a better buy? Let me know in the comments.\n\nDisclaimer: I am Long PepsiCo and hold positions in the stock mentioned above.",
        "subreddit": "wallstreetbets",
        "title": "PepsiCo (PEP): Is the Market undervaluing this Dividend Staple?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx75uz/pepsico_pep_is_the_market_undervaluing_this/",
        "created": 1614842523.0
    },
    {
        "author": "emoneynati",
        "created_utc": 1614775120,
        "id": "lwsxde",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Has This Sub Seen the RH Parody Ad by Zebra Corner??? Don't let their support stay at such relatively low views!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lwsxde/has_this_sub_seen_the_rh_parody_ad_by_zebra/",
        "created": 1614803920.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1617269411,
        "id": "mhrm7t",
        "num_comments": 813,
        "num_crossposts": 0,
        "selftext": "This is the daily discussion, so anything stocks related is fine, but the theme for today is on stock options, but if options aren't your thing then just ignore the theme and/or [post your arguments against options here](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+semiannual+arguments+against+TA%22&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) and not in the current post.\n\nSome helpful day to day links, including news:\n\n* [Finviz](https://finviz.com/quote.ashx?t=amd) for charts, fundamentals, and aggregated news on individual stocks\n* [Bloomberg market news](https://www.bloomberg.com/markets)\n* StreetInsider news:\n  * [Market Check](https://www.streetinsider.com/Market+Check) - Possibly why the market is doing what it's doing including sudden spikes/dips\n  * [Reuters aggregated](https://www.streetinsider.com/Reuters) - Global news\n\n-----\n\nRequired info to start understanding options:\n\n* [Call option Investopedia video](https://www.investopedia.com/terms/c/calloption.asp) basically a call option allows you to buy 100 shares of a stock at a certain price (strike price), but without the obligation to buy\n* [Put option Investopedia video](https://www.investopedia.com/terms/p/putoption.asp) a put option allows you to sell 100 shares of a stock at a certain price (strike price), but without the obligation to sell\n\nSee the following word cloud and click through for the wiki:\n\n[Call option - Put option - Exercising an option - Strike price - ITM - OTM - ATM - Long options - Short options - Combo - Debit - Credit or Premium - Covered call - Naked - Debit call spread - Credit call spread - Strangle - Iron condor - Vertical debit spreads - Iron Fly](https://www.reddit.com/r/stocks/wiki/options-themed-post)\n\nIf you have a basic question, for example \"what is delta,\" then google \"investopedia delta\" and click the investopedia article on it; do this for everything until you have a more in depth question or just want to share what you learned.\n\nSee our past [daily discussions here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+%22r%2Fstocks+daily+discussion%22&amp;restrict_sr=on&amp;sort=new&amp;t=all)  Also links for:  [Technicals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Atechnicals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Tuesday, [Options Trading](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoptions&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Thursday, and [Fundamentals](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Afundamentals&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all) Friday.",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Discussion &amp; Options Trading Thursday - Apr 01, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mhrm7t/rstocks_daily_discussion_options_trading_thursday/",
        "created": 1617298211.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1617267615,
        "id": "mhr8j1",
        "num_comments": 221,
        "num_crossposts": 0,
        "selftext": "If your question is \"I have $10,000, what do I do?\" or other \"advice for my personal situation\" questions, you should include relevant information, such as the following:\n\n* How old are you? What country do you live in?  \n* Are you employed/making income? How much?  \n* What are your objectives with this money? (Buy a house? Retirement savings?)  \n* What is your time horizon? Do you need this money next month? Next 20yrs?  \n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?)  \n* What are you current holdings? (Do you already have exposure to specific funds and sectors? Any other assets?)  \n* Any big debts (include interest rate) or expenses?  \n* And any other relevant financial information will be useful to give you a proper answer.  \n\nPlease consider consulting our FAQ first - https://www.reddit.com/r/investing/wiki/faq\nAnd our [side bar](https://www.reddit.com/r/investing/about/sidebar) also has useful resources.  \n\nBe aware that these answers are just opinions of Redditors and should be used as a starting point for your research. You should strongly consider seeing a registered financial rep before making any financial decisions!",
        "subreddit": "investing",
        "title": "Daily Advice Thread - All basic help or advice questions must be posted here.",
        "url": "https://www.reddit.com/r/investing/comments/mhr8j1/daily_advice_thread_all_basic_help_or_advice/",
        "created": 1617296415.0
    },
    {
        "author": "diagonalcutter",
        "created_utc": 1617269089,
        "id": "mhrjw4",
        "num_comments": 188,
        "num_crossposts": 0,
        "selftext": "I've been lurking and reading your posts for a while and decided two days ago to buy $EEENF. And what do you know, it's up over 111% in two days. Pretty cool. In a small test, I bought 1000 shares at $.03 and it's at $.07 now. If I had invested a meaningful amount it would have made a significant impact on my account balance.\n\nSo, more penny stocks for me thanks to you guys and gals. Maybe I'll go YOLO next time and share some loss porn :)",
        "subreddit": "pennystocks",
        "title": "My first penny stock ($EEENF) has 111% profit in two days",
        "url": "https://www.reddit.com/r/pennystocks/comments/mhrjw4/my_first_penny_stock_eeenf_has_111_profit_in_two/",
        "created": 1617297889.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1617268812,
        "id": "mhrhul",
        "num_comments": 121,
        "num_crossposts": 0,
        "selftext": "The familiar [\"Rate My Portfolio\" sticky can be found here.](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Arate+my+portfolio&amp;restrict_sr=on&amp;sort=new&amp;t=all)\n\n-----\n\nWelcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a day.  I get it, you want to talk about what's popular, what's hot, and that 1.. single.. stock you like.. well here you go!  Some helpful links just for you:\n  \n* [Previous meme stock threads](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%28common+OR+meme%29&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)  \n* [Previous discussions on overlooked (and possibly undervalued) stocks](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoverlooked&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)  \n* [General discussions](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Adiscussion&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)  \n* [The **original GME megathread**](https://www.reddit.com/r/stocks/comments/layb68/rstocks_gme_megathread/) with a ton of useful information\n* [Use Finviz for aggregated news on your favorite stock](https://finviz.com/quote.ashx?t=gme)  \n\nAn important message from our mod u/TCGYT [regarding meme stocks.](https://www.reddit.com/r/stocks/wiki/meme-stocks-warning)\n\nLastly if you need professional help:  \n* Problem Gambling:  Call/Text: 1-800-522-4700 or [chat online now.](https://WWW.NCPGAMBLING.ORG/CHAT)  \n* Crisis Hotline (24/7): 1-800-273-TALK (8255) (Veterans, press 1) or Text “HOME” to 741-741",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Thread on Meme Stocks Thursday - Apr 01, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mhrhul/rstocks_daily_thread_on_meme_stocks_thursday_apr/",
        "created": 1617297612.0
    },
    {
        "author": "Character-Cup-2263",
        "created_utc": 1617264285,
        "id": "mhqk13",
        "num_comments": 90,
        "num_crossposts": 0,
        "selftext": "President Biden unveiled the $2.25 trillion [American Jobs Plan](https://www.cnet.com/google-amp/news/biden-infrastructure-plan-ev-rebates-charging-stations/) that includes $174 billion for electrification (building 500,000 EV charging stations, giving direct EV rebates, building EV supply chain in the US) and $270 billion in upgrading train and road infrastructure.\n\nA more robust universally-accessible EV charging infrastructure will accelerate the growth of the entire EV industry and help level the playing field for non-Tesla EVs (Tesla's supercharger network has been a key selling point for Tesla). Being the software provider for 23 out of 25 top EV automakers, Blackberry will also experience the same explosive growth soon.\n\nUpgrading train and road infrastructure might imply the adoption of Internet of Things (IoT) and Vehicle to Infrastructure communication (V2X) to enhance logistical/traffic management for better efficiency, productivity and public safety. As major infrastructure becomes connected to the internet, security will be a major requirement because these infrastructure will become hackable surfaces that can cause serious damage. Blackberry is the leading software provider for mission critical applications, IoT cybersecurity and Unified Endpoints Management (UEM) that has a great track record working closely with governments across the world. It is very likely that Blackberry will win major government contracts soon in this space given its technical expertise in the IoT space and huge engineering workforce in the US.",
        "subreddit": "wallstreetbets",
        "title": "[$BB] Blackberry is well-positioned to benefit from Biden's $2 trillion infrastructure plan",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhqk13/bb_blackberry_is_wellpositioned_to_benefit_from/",
        "created": 1617293085.0
    },
    {
        "author": "Afraid-Test7779",
        "created_utc": 1617268264,
        "id": "mhrdom",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "It begins, GME margin call from FUTU Securities in Hong Kong👊🦍🙌💎",
        "url": "https://i.redd.it/jwd17q1d3jq61.jpg",
        "created": 1617297064.0
    },
    {
        "author": "UTrider",
        "created_utc": 1617272507,
        "id": "mhsasq",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "Was happy to see news this morning that Lordstown Motors had the first two beta truck come off the assembly line yesterday. I know I know -- SEC investigation -- yes I know one of their trucks burned to the ground in January on a test drive.\n\nBut i like the way they are doing the trucks.  They actually look like a truck -- compare it to the Cyber truck, and just looks alone it wins hands down.  I also think the hub motors will be the way for EV to go in the future.  The space a motor like Tesla uses can be dedicated to storage area or more battery space for longer distances.\n\nI'm slowly coming to face reality that EV will be what we drive in the next 10 to 15 years.  So I've been watching and reading on different companies.  I do have a few shares of Lordstown (38 shares -- please stop laughing at the small amount.)\n\nHopefully the remaining test trucks come off the line without a hitch, the testing of them goes off without a hitch, and production starts this fall.\n\n[https://electrek.co/2021/03/31/lordstown-motors-reveals-its-first-two-endurance-betas/](https://electrek.co/2021/03/31/lordstown-motors-reveals-its-first-two-endurance-betas/)",
        "subreddit": "stocks",
        "title": "Lordstown motors beta trucks come off assembly line",
        "url": "https://www.reddit.com/r/stocks/comments/mhsasq/lordstown_motors_beta_trucks_come_off_assembly/",
        "created": 1617301307.0
    },
    {
        "author": "AkikoMinami",
        "created_utc": 1617273256,
        "id": "mhsgy5",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "In it with all my savings since February. Refueling whenever I can. Apes together strong. 🦍",
        "url": "https://www.reddit.com/gallery/mhsgy5",
        "created": 1617302056.0
    },
    {
        "author": "MyNameCannotBeSpoken",
        "created_utc": 1617270637,
        "id": "mhrvl4",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "I tend to purchase deep in the money LEAPS as stock replacement. As you know, the spreads can be ridiculously large (sometimes more than 20%).\n\n\nI recently discovered that when doing a poor man's covered call (pmcc) and it gets assigned, rather than selling the call, my brokerage places  100 short sale stocks per contract into my portfolio and lets me keep the call.\n\nThe spread to buy to cover short stocks seems far less than the call option.\n\nIf I have a LEAP call that I no longer wish to hold, is it materially different to sell the call with a 20% spread loss or do a pmcc and have the call assigned and keep the long call with the shorted shorted shares? It seems like the latter is the same as liquidating but with no spread loss, plus I earn a premium from writing the call option in the pmcc.",
        "subreddit": "options",
        "title": "Liquidating LEAPS",
        "url": "https://www.reddit.com/r/options/comments/mhrvl4/liquidating_leaps/",
        "created": 1617299437.0
    },
    {
        "author": "DaddyDersch",
        "created_utc": 1617264298,
        "id": "mhqk4d",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Take it from someone who started investing this year and made mistakes and loss money. \n\nYou need to decide what your goals are and how high of a risk you wanna take. Do you want to follow stocks and ETFs that you have to actively manage and attempt to beat the market with or do you wanna put your money in weekly or monthly and watch it grow without having to do constant research? Note- while i consider VTI/ the boglehead method pretty low risk and care free one should still keep up with the market to know whats going on.\n\n1. Open webull \n\n2. Deposit any money you are ready to invest into VTI (US total market etf) until you know what your official investmsnt plan is and have adjusted that a few times. Mine has changed a lot. VTI is a relatively \"safe\" yet great returning etf. \n\n3. Go to the \"paper trading\" section of webull and start looking at stocks. Use these different sub reddits like stocks, stockmarket, etfs and boglehead to do research (note- other brokerages use paper trading but its what i used so its why i said webull). \n\n3a. Learn about what TRUE DD is. Not what W S B tells you. Yes some people here and other forums occasionally post solid DD but you need to know what EPS, PE, BVPS, ROE, Debt, etc. All mean and why they are important. Specifically PE is something ive learned to assess. Webull has some pretty great charts where you can look at the different EMAs. Until you know all of these things and know what the company actually does and how they make money/ will in the future the stock stays in your trading account. \n\n4. Find a stock you like. Add it to your paper trading account and watch it for 3-6 months. \n\n5. Assess it again. Did it drop? Why? Did it run up like crazy? Why? Find out why. Learn how to assess these movements.\n\n6. If and only if 3-6  months later you feel like this stock is a winner then move it to your actual trading account and buy in. (For those of you saying well thats 6 months of gains i just missed. No you are getting VTI gains plus if the stocks solid now itll be solid again in 6 months right? The goals a solid return not day trading 200% gains).\n\nPRO TIPS-\n\n-DO NOT FOMO SELL OR BUY STOCKS. I can not emphasize this enough. Ive bought in where things are gaining 5%/ hour and guess what? The stock within a week dropped back down to \"fill the gaps.\" I never believed that was a thing but ive watched it happen way too many times. About 99% of the time a stock i watchlisted shot up if i got it while going up within a  week it temporarily dropped back before rising again. \n\n-Do yourself a favor and avoid Wall s t r e e t b e t s \n\n-Never invest any money you arent willing to lose today. If you need the money soon (within a year in my opinion) and will need that full amount do not invest it. The market especially now is unpredictable. A lot of people lost a lot of money these last 2 months that they will either never get back or will be holding the bag they call it for years. \n\n- Contrary to popular belief... its okay to sell for a loss. This is a hard lesson and one many people will give you a hard time on saying \"BuY hIgH sElL lOw.\" Guess what? Sometimes we pick bad stocks/ etfs. Especially when you are new you will think you found the gold mind of a stock only for it to get bad news like the trial drug didnt get approved or they delayed production or loss a contract bid. Would you rather be down 20% and perhaps watch it keep going down more and hold that stock for years perhaps before it comes back up or would you rather accept the loss (which youll claim on taxes) and then reinvest in a solid company/ etf that will make that loss back faster. Of course this correction we were just in is an expection in someways because some companies will bounce back relatively quick but i forsee that there will be many people that bought in at all time highs who wont see a profit for a very long time. \n\n- In the same respect above you have to have discipline. Stocks dont only go up. You WILL have down days. Youll temporarily be in the red. This will be the pucker moment you decide if you regret buying that position or not. Be disciplined. \n\n-The same goes for being on top. There is absolutely nothing wrong with taking profits if your stock happens to have a huge run up (knowing youll pay capital gains tax though). \n\n- DO NOT USE MARGIN ACCOUNTS \n\n- Avoid option trading for at least a year till you understand what you are doing and can pick good stocks to buy options for. You can lose so much money so fast. \n\n- these subs can be amazing and they can be toxic. Some people give great advice and others dont. Whatever someone tells you dont take it as fact. They may tell you that AMD will double in 6 months buy buy buy. But its your money not theirs you could lose. \n\n- CNBC gets a lot of hate but Squak box, fast money and mad money on Spotify or watching it live has some really good insight to the market. But again they dont always give great advice. \n\n- you have to decide what your plan is and what stocks/ etfs/ risk fits your life style and plan. \n\n- people are scared of dividends for no reason. Unless you are investing millions upon millions of dollars ignoring solid stocks and ETFs which pay dividends to \"avoid unnecessary tax events\" is silly. If you dont believe me look at an ETF like SCHD. calculate the max amount youll ever get in that account. Divide by shares and multiply by dividend rate. Its not that much in end that you pay taxes on.\n\n- as much as we all wanna make 200% every month on every stock thats so unbelievably unrealistic. Look at some of the biggest ETFs like VT, VTI, SCHA, SCHB, VXUS, etc. And see their YOY returns. That your goal.\n\n\nMy advice/ quick tid bit/ plan\n\nI attempted to beat the market. I fomo'd into stocks and got burnt and loss money. I bought stocks at ATh cause every said stocks only go up. Thankfully my losses are minimal since i invested minimally my first year but i learned some hard lessons. I got humbled quick and ive realized i cant beat the market, i don't have the skill or time to do proper DD and watch the stocks 24/7 to assess whats happening and id rather park my money in a few ETFs and let it grow. Im not gonna gain 300% in a year but if i can gain 5-10% in a year it beats the heck outta what a savings account could ever give me.\n\nMy current 5 fund boglehead portfolio spin off... (which i plan to hold for a year before i rebalance... with the exception of increasing SCHD/ VXUS quicker than that and decreasing VTI to compensate). \n\nVTI- 70% \n\nVXUS- 10%\n\nSCHD- 10% \n\nQQQM- 7.5:\n\nQQQJ- 7.5%\n\nGood luck!",
        "subreddit": "stocks",
        "title": "My unsolicited advice to the new investor",
        "url": "https://www.reddit.com/r/stocks/comments/mhqk4d/my_unsolicited_advice_to_the_new_investor/",
        "created": 1617293098.0
    },
    {
        "author": "Shane8282",
        "created_utc": 1617272267,
        "id": "mhs8ti",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "\n\nBlink Charging is a small cap American EV charging provider with a value of 1.45 billion. It has been rallying from a around $1 dollar to a yearly high of $64.00 but in the last couple months has dropped in value by almost half to $34.00 due to a rising short interest amongst hedge funds to around 41% making it one of the most heavily shorted stocks on the Nasdaq right now. Not sure what hedge funds are short but I feel there are a few reasons for this.\n\nThe main reason for this is that there are a number of other competitors that are making inroads in the market and that Blink is relatively small amount of market share at 8% at current. Chargepoint is the largest in the market. Although I feel that that what the hedge funds have overlooked is that there should be room for loads of companys in the EV charging industry. The sheer rate of growth in the EV market has driven this company up 1200% and that has potential to keep going. Blink has implemented a total of 15,760 charging stations and Apple has added all these stations to its Apple Maps which is massive for the company. We also should not underestimate the radical change to the global economy where clean energy is going to overtake traditional fossil fuels. America has a target I believe of 2035 for the phase out of fossil fuel transport while most of Europe has pledged to transform its economy to be carbon neutral by 2030 with EVs playing a major part in that shift. This indicates that there is huge upside for the company in the coming years.💎🙌\n\nBelow I have highlighted a few of the fundamentals that are interesting and may look familar here including the current short interest (42%) and the current float 32 million. Thats around 20 million LESS than GME currently. 💎🙌\n\nAlso I checked on iborrowdesk where there is currently 45,000 shorts available very similar to GME at the moment although the borrow fee can be as high as 80%?? \n\nHere is where I got these numbers from if people want to expand on this.\n\nhttps://www.highshortinterest.com/ \n\nhttps://iborrowdesk.com/report/CCGID\n\nHowever I do think that there is reason to claim the stock is undervalued regardless of what the squeeze potential may be if that sanario was to play out. What do you guys think I'm not a stock wizard by any means I'm just an Ape like you 🦧🦧 all so it would be interesting to get your opinions. 🙌💎",
        "subreddit": "wallstreetbets",
        "title": "Is Blink Charging (BLNK) the next Gme?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhs8ti/is_blink_charging_blnk_the_next_gme/",
        "created": 1617301067.0
    },
    {
        "author": "DaddyDersch",
        "created_utc": 1617264415,
        "id": "mhql1t",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Take it from someone who started investing this year and made mistakes and loss money. \n\nYou need to decide what your goals are and how high of a risk you wanna take. Do you want to follow stocks and ETFs that you have to actively manage and attempt to beat the market with or do you wanna put your money in weekly or monthly and watch it grow without having to do constant research? Note- while i consider VTI/ the boglehead method pretty low risk and care free one should still keep up with the market to know whats going on.\n\n1. Open webull \n\n2. Deposit any money you are ready to invest into VTI (US total market etf) until you know what your official investmsnt plan is and have adjusted that a few times. Mine has changed a lot. VTI is a relatively \"safe\" yet great returning etf. \n\n3. Go to the \"paper trading\" section of webull and start looking at stocks. Use these different sub reddits like stocks, stockmarket, etfs and boglehead to do research (note- other brokerages use paper trading but its what i used so its why i said webull). \n\n3a. Learn about what TRUE DD is. Not what W S B tells you. Yes some people here and other forums occasionally post solid DD but you need to know what EPS, PE, BVPS, ROE, Debt, etc. All mean and why they are important. Specifically PE is something ive learned to assess. Webull has some pretty great charts where you can look at the different EMAs. Until you know all of these things and know what the company actually does and how they make money/ will in the future the stock stays in your trading account. \n\n4. Find a stock you like. Add it to your paper trading account and watch it for 3-6 months. \n\n5. Assess it again. Did it drop? Why? Did it run up like crazy? Why? Find out why. Learn how to assess these movements.\n\n6. If and only if 3-6  months later you feel like this stock is a winner then move it to your actual trading account and buy in. (For those of you saying well thats 6 months of gains i just missed. No you are getting VTI gains plus if the stocks solid now itll be solid again in 6 months right? The goals a solid return not day trading 200% gains).\n\nPRO TIPS-\n\n-DO NOT FOMO SELL OR BUY STOCKS. I can not emphasize this enough. Ive bought in where things are gaining 5%/ hour and guess what? The stock within a week dropped back down to \"fill the gaps.\" I never believed that was a thing but ive watched it happen way too many times. About 99% of the time a stock i watchlisted shot up if i got it while going up within a  week it temporarily dropped back before rising again. \n\n-Do yourself a favor and avoid Wall s t r e e t b e t s \n\n-Never invest any money you arent willing to lose today. If you need the money soon (within a year in my opinion) and will need that full amount do not invest it. The market especially now is unpredictable. A lot of people lost a lot of money these last 2 months that they will either never get back or will be holding the bag they call it for years. \n\n- Contrary to popular belief... its okay to sell for a loss. This is a hard lesson and one many people will give you a hard time on saying \"BuY hIgH sElL lOw.\" Guess what? Sometimes we pick bad stocks/ etfs. Especially when you are new you will think you found the gold mind of a stock only for it to get bad news like the trial drug didnt get approved or they delayed production or loss a contract bid. Would you rather be down 20% and perhaps watch it keep going down more and hold that stock for years perhaps before it comes back up or would you rather accept the loss (which youll claim on taxes) and then reinvest in a solid company/ etf that will make that loss back faster. Of course this correction we were just in is an expection in someways because some companies will bounce back relatively quick but i forsee that there will be many people that bought in at all time highs who wont see a profit for a very long time. \n\n- In the same respect above you have to have discipline. Stocks dont only go up. You WILL have down days. Youll temporarily be in the red. This will be the pucker moment you decide if you regret buying that position or not. Be disciplined. \n\n-The same goes for being on top. There is absolutely nothing wrong with taking profits if your stock happens to have a huge run up (knowing youll pay capital gains tax though). \n\n- DO NOT USE MARGIN ACCOUNTS \n\n- Avoid option trading for at least a year till you understand what you are doing and can pick good stocks to buy options for. You can lose so much money so fast. \n\n- these subs can be amazing and they can be toxic. Some people give great advice and others dont. Whatever someone tells you dont take it as fact. They may tell you that AMD will double in 6 months buy buy buy. But its your money not theirs you could lose. \n\n- CNBC gets a lot of hate but Squak box, fast money and mad money on Spotify or watching it live has some really good insight to the market. But again they dont always give great advice. \n\n- you have to decide what your plan is and what stocks/ etfs/ risk fits your life style and plan. \n\n- people are scared of dividends for no reason. Unless you are investing millions upon millions of dollars ignoring solid stocks and ETFs which pay dividends to \"avoid unnecessary tax events\" is silly. If you dont believe me look at an ETF like SCHD. calculate the max amount youll ever get in that account. Divide by shares and multiply by dividend rate. Its not that much in end that you pay taxes on.\n\n- as much as we all wanna make 200% every month on every stock thats so unbelievably unrealistic. Look at some of the biggest ETFs like VT, VTI, SCHA, SCHB, VXUS, etc. And see their YOY returns. That your goal.\n\n\nMy advice/ quick tid bit/ plan\n\nI attempted to beat the market. I fomo'd into stocks and got burnt and loss money. I bought stocks at ATh cause every said stocks only go up. Thankfully my losses are minimal since i invested minimally my first year but i learned some hard lessons. I got humbled quick and ive realized i cant beat the market, i don't have the skill or time to do proper DD and watch the stocks 24/7 to assess whats happening and id rather park my money in a few ETFs and let it grow. Im not gonna gain 300% in a year but if i can gain 5-10% in a year it beats the heck outta what a savings account could ever give me.\n\nMy current 5 fund boglehead portfolio spin off... (which i plan to hold for a year before i rebalance... with the exception of increasing SCHD/ VXUS quicker than that and decreasing VTI to compensate). \n\nVTI- 70% \n\nVXUS- 10%\n\nSCHD- 10% \n\nQQQM- 7.5:\n\nQQQJ- 7.5%\n\nGood luck!",
        "subreddit": "StockMarket",
        "title": "My unsolicited advice to the new investor",
        "url": "https://www.reddit.com/r/StockMarket/comments/mhql1t/my_unsolicited_advice_to_the_new_investor/",
        "created": 1617293215.0
    },
    {
        "author": "bauer5x",
        "created_utc": 1617276038,
        "id": "mht59h",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": " This latest installment of why $DGX is **still** the safest double up+ opportunity in the market will likely be my last update before earnings this month (baring eventful news). A lot of this will be regurgitation from Parts 1 and 2 because, well, most of what was discussed has been coming to fruition:\n\n[$DGX DD Pt. 1](https://www.reddit.com/r/wallstreetbets/comments/lktkjr/dgx_quest_diagnostics_is_free_tendies/)\n\n[$DGX DD Pt. 2 - Electric Boogaloo](https://www.reddit.com/r/wallstreetbets/comments/m2dtqk/dgx_quest_diagnostics_pt_2_electric_boogaloo/)\n\n**TL;DR again** \\- $DGX is now over 8% higher since DD Pt. 2 earlier this month. The stock and associated calls are still trading at very reasonable amounts, continuing to make $DGX the safest double up+ play in the market. **During their Investor Day earlier in March, they doubled both LT Revenue and EPS CAGR guidance. They also confirmed they will be repurchasing $900 MILLION in shares in the FIRST HALF of this year. This will reduce their float by over 5%.** That is material. Now consider 90% of float is owned by institutions. Then add in all EPS guidance given for Q1 and Q2 does NOT factor in repurchases. Blah blah blah ROCKETS.\n\n**Positions** \\- I've given my positions every single time, yet some smucks demanded a screenshot. Why how much $ I have in these positions matters is beyond me. Either I tickled your balls enough during the DDs to invest or I didn't. Anyway, here's a **consolidated** view (100% options), which is drastically understated ($10k+ both gains and total value) because Ally's platform has become unreliable hot garbage:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/kspcic1dqjq61.jpg?width=3480&amp;format=pjpg&amp;auto=webp&amp;s=05521960a236201679bbda237f3fb5997ad5270a\n\nOpen: May 21 $125, $130, $135. Aug 20 $120, $125, $130, $140, $145, $150, $160\n\nAs previously mentioned, I also have another $50k stock and a small amount of options in my other account with TD. I will be moving all of my holdings to TD eventually because Ally has become completely broken over the past year and their customer service is non existent. **Just a PSA to AVOID ALLY.**\n\n**The new stuff:**\n\n* Most important - March Investor Day LT Revenue and Earnings CAGR increase and MASSIVE share repurchase timing: [**https://finance.yahoo.com/news/quest-diagnostics-updates-strategic-growth-114500393.html**](https://finance.yahoo.com/news/quest-diagnostics-updates-strategic-growth-114500393.html)  \n\n   * This improved LT outlook has yet to be reflected in any new \"analyst\" price targets\n* Acquired Mercy's outreach lab services. Like I said, they will be using their piles of $$$ to make acquisitions. Especially as smaller labs run out of runway as the pandemic slows down. [https://finance.yahoo.com/news/quest-diagnostics-mercy-broaden-access-140700481.html](https://finance.yahoo.com/news/quest-diagnostics-mercy-broaden-access-140700481.html)\n* Struck deal with Zora Biosciences' to further efforts to enhance direct to consumer self testing offerings. A key growth focus for them is self testing of all kinds in the future: [https://finance.yahoo.com/news/zora-biosciences-licenses-ceramide-technology-130400471.html](https://finance.yahoo.com/news/zora-biosciences-licenses-ceramide-technology-130400471.html)  \n\n   * [https://www.bloomberg.com/news/articles/2021-03-11/quest-sees-direct-to-consumer-testing-taking-off-post-pandemic](https://www.bloomberg.com/news/articles/2021-03-11/quest-sees-direct-to-consumer-testing-taking-off-post-pandemic)\n* As previously noted in earlier DDs, analysts were drastically overestimating the Q1 drop off in COVID testing expected. Public data shows daily testing remains absurdly high. In fact, the lowest testing day so far in Q1 is still higher than the highest day from May-Oct 2020. The overall Q1 daily average remains over DOUBLE that period as well. Heck, even Quest's own press release indicates COVID testing remains absurdly high through March (Q1) for them specifically: [https://newsroom.questdiagnostics.com/COVIDTestingUpdates](https://newsroom.questdiagnostics.com/COVIDTestingUpdates)\n* On top of the $50billion in stimulus, $DGX will also be a primary provider of testing services upon school re-openings: [https://www.rockefellerfoundation.org/wp-content/uploads/2021/03/K-12-NTAP.pdf](https://www.rockefellerfoundation.org/wp-content/uploads/2021/03/K-12-NTAP.pdf)\n\n**Some important stuff from the previous DDs because God knows you still didn't click the links above:**\n\n* Based on management's own conservative EPS forecasts (**excl repurchases**), a PE of 10 at mid year results in a share price of $144. This is the absolute floor target. They also announced unprecedented $2b in share repurchases for 2021, meaning they can repurchase over 16m shares at current levels. Their float is 133m shares, **BUT roughly 90% of that is owned by INSTITUIONS, leaving LESS THAN 16m** ***available*** **to public.** Assuming institutions continue to hold the majority of their shares (they will. it's a safe dividend stock), this stock will rocket by end of year.  \n\n   * I have always expected a Q1 diluted EPS &gt; 4. I am currently projecting 4.2, which results in a TTM EPS of 14. Further, I anticipate roughly $3 EPS as the Q2 floor, resulting in a TTM EPS post Q2 of 15.63.\n   * This results in an EPS 20% above the high amount given in guidance, which again, was conservative and didn't account for share repurchases\n\nThe reason this stock constantly runs up into earnings and then ticks lower despite large beats is solely due to their base testing lagging behind typical performance due to COVID. The market is acting as if the COVID faucet will just get shut off in the snap of a finger (soon) and then the base testing will take time to return. Does this sound right to you? **This line of thinking is laughably absurd and naïve.** Reasons:\n\n* After a year of this shit, there is a massive backlog of people/procedures that will be completed after more of the pop is vaccinated. We haven't even seen a DGX Q performance with strong base testing AND COVID $$$ yet. Q1 of 2021 will be the first. Book it.\n* **Political climate / stimulus** \\- I'm sure you all saw the CDC is now \"recommending\" double masking. Hell, I've passed out four times writing this diatribe due to the 6 masks I'm wearing. Why does this matter? For every bit a person feels the previous admin downplayed COVID, the new admin is going 100% the opposite direction. Considering the US is going to continue to pump trillions into the economy, you can bet your ass all testing companies will benefit. There will definitely be huge grants/subsidies for enhanced serology procedures and research....and of course in analyzing COVID further. These testing companies have so much COVID data that will continue to be poured over as the pandemic lessens. You can also bet there will be an increased $ focus on scanning/checking for new viruses in the near future.\n* **$$$$$$$** \\- Do you think DGX is just going to light the enormous $$$ they've made over the past 9 months and will continue to make for 2021 on fire? Because that's what the current stock price/growth reflects. When in reality and in addition to the buybacks, they will be targeting acquisitions and investing heavily in serology capabilities/analysis and self testing expansion.\n\n**Price Expectations by EOY:**\n\n* Worst case - $150. Yea, I'm serious. Baring a market meltdown driven by Biden's tax policy, this baby is a lock.\n* Best case - $200\n\n**Important Dates:**\n\n* Ex-Dividend date this FRIDAY 4/2\n* Q1 Earnings 4/22\n\n**Disclaimer:** I'm a rando on a message board, yada yada yada, not investment advice. Ally SUCKS as a brokerage. Use someone else. Long live GME.",
        "subreddit": "smallstreetbets",
        "title": "$DGX Quest Diagnostics Pt. 3 - Leading a Redditor to Tendies",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/mht59h/dgx_quest_diagnostics_pt_3_leading_a_redditor_to/",
        "created": 1617304838.0
    },
    {
        "author": "liszt1811",
        "created_utc": 1617275793,
        "id": "mht2uz",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Disclaimer: I own close to 150k shares.\n\nI read the RethinkX report about the next revolution in food, you can find it here: https://www.rethinkx.com/food-and-agriculture\n\nNewsflash: People like eating meat and demand is growing rapidly\nhttps://www.agriculture.gov.au/abares/research-topics/agricultural-outlook/meat-consumption\n\nNow this creates a tricky situation as global production can only follow demand if we scale production in ways that are rather harmful to the environment and - inherently - inefficient. We basically built the whole animal around the desired product, but we do not need the animal and it takes rather long to reach \"maturity\" and consumes too much resources along the way. Long story short - we need a more efficient method.\n\nEnter lab meat/fish. Here they produce meat with the help of cells and media in bio reactors, the same ones used for the fermentation of yeast. Same product but less of the downsides of traditional meat and fish:\n- Shorter production time\n- More cost efficient in the future (rough estimate says 2030)\n- no animals are harmed (unless you count the minimal itch it takes to get some cells)\n- one cow = tons of meat (all they need is cells from it)\n- can be produced in a factory, does not need land \n- way smaller CO2 footprint\n- better food quality, no friggin hormones everywhere\n- potentially to be consumed by vegetarians and vegans too (vegans questionable I know)\n\nOne of the most promising companies currently is BlueNalu (https://www.bluenalu.com/) aiming for production later this year. Now almost none of the companies are publicly traded at the moment, but I found a good vehicle to get access: Agronomics\nhttps://agronomics.im/wp-content/uploads/2020/07/Agronomics-Corporate-Presentation-.pdf\n\nIf you are interested, I recommend reading the book \"Moo's Law\" by one of the founders, Jim Mellon. Overall extremely interesting new sector and also one that hits the nerve of the current society I think (everyone is becoming more environmentally aware).",
        "subreddit": "pennystocks",
        "title": "Agronomics - Lab Meat and Fish",
        "url": "https://www.reddit.com/r/pennystocks/comments/mht2uz/agronomics_lab_meat_and_fish/",
        "created": 1617304593.0
    },
    {
        "author": "Stuvio",
        "created_utc": 1617270713,
        "id": "mhrw64",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I have been trading options for a while now but just yesterday my broker send me an e-mail saying my cash account was 98% used and that this was dangerous for my margins. \nI thought the full amount of written out options was held as reserve. But this isn’t the case. A percentage (still large) is held as collateral, but some of it is margin. \nMy first instinct is that I don’t want margins, but maybe it is better to have margin once I understand it better?",
        "subreddit": "options",
        "title": "I don’t want option margin, do I?",
        "url": "https://www.reddit.com/r/options/comments/mhrw64/i_dont_want_option_margin_do_i/",
        "created": 1617299513.0
    },
    {
        "author": "DamianNapo",
        "created_utc": 1617275069,
        "id": "mhswa0",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": " \n\nIf there is a SPAC coming that I am interested in ($QELL), and I read that it has a 'combined value' of $3.3b after the merger, and the current market cap of that shell ticker is only $475m at a share price of roughly $10.25, does that mean it will have a 6x bump on the merger?\n\n&amp;#x200B;\n\n* \"Transaction values the combined company at approximately $3.3 billion pro forma equity value at the $10.00 per share PIPE price.\"\n\n&amp;#x200B;\n\nThat seems almost a little too simple- Find a SPAC's predicted value, see if the shell company's market cap is less, then buy in. Am I misunderstanding something here, or does this make sense?\n\n[https://www.suasnews.com/2021/03/lilium-announces-intention-to-list-on-nasdaq-through-a-merger-with-qell-acquisition-corp/](https://www.suasnews.com/2021/03/lilium-announces-intention-to-list-on-nasdaq-through-a-merger-with-qell-acquisition-corp/)",
        "subreddit": "smallstreetbets",
        "title": "Using Market Cap to Value SPACs?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/mhswa0/using_market_cap_to_value_spacs/",
        "created": 1617303869.0
    },
    {
        "author": "Defiant_Statement_81",
        "created_utc": 1617270461,
        "id": "mhru9k",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "I would like the big banks to just admit that they've overleveraged hundreds of hedge funds and that Archegos was just a taste of what's to come. Valuations in the market are sitting 16-32x what they should be and another fire sale(s) could trigger a cascade of panic selling.\n\nSomeone please tell me how they're comfortable investing in today's market when stocks from March of 2020 to March of 2021 look like a fucking stiletto on the growth chart. There is no justification for a company's stock to gain $30 in one month when it's already sitting at $110. \n\nMore speculation, more excess dollars and sooner or later it will come to a head. I'm tired of waiting, just get on with the fucking show already.",
        "subreddit": "StockMarket",
        "title": "Can the stock market please crash already?",
        "url": "https://www.reddit.com/r/StockMarket/comments/mhru9k/can_the_stock_market_please_crash_already/",
        "created": 1617299261.0
    },
    {
        "author": "randomFrenchDeadbeat",
        "created_utc": 1617265812,
        "id": "mhqvhc",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "2 independent audits showed muddy waters lied, harassed a company and shorted it, again. Solutions 30 is up +36 % on opening today !",
        "url": "https://i.redd.it/kwx38h80wiq61.jpg",
        "created": 1617294612.0
    },
    {
        "author": "Character-Cup-2263",
        "created_utc": 1617262503,
        "id": "mhq649",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "President Biden unveiled the $2.25 trillion [American Jobs Plan](https://www.cnet.com/google-amp/news/biden-infrastructure-plan-ev-rebates-charging-stations/) that includes $174 billion for electrification (building 500,000 EV charging stations, giving direct EV rebates, building EV supply chain in the US) and $270 billion in upgrading train and road infrastructure.\n\nA more robust universally-accessible EV charging infrastructure will accelerate the growth of the entire EV industry and help level the playing field for non-Tesla EVs (Tesla's supercharger network has been a key selling point for Tesla). Being the software provider for 23 out of 25 top EV automakers, Blackberry will also experience the same explosive growth soon.\n\nUpgrading train and road infrastructure might imply the adoption of Internet of Things (IoT) and Vehicle to Infrastructure communication (V2X) to enhance logistical/traffic management for better efficiency, productivity and public safety. As major infrastructure becomes connected to the internet, security will be a major requirement because these infrastructure will become hackable surfaces that can cause serious damage. Blackberry is the leading software provider for mission critical applications, IoT cybersecurity and Unified Endpoints Management (UEM) that has a great track record working closely with governments across the world. It is very likely that Blackberry will win major government contracts soon in this space given its technical expertise in the IoT space and huge engineering workforce in the US.",
        "subreddit": "wallstreetbets",
        "title": "[$BB] Blackberry is well-positioned to benefit from Biden's $2 trillion infrastructure plan",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhq649/bb_blackberry_is_wellpositioned_to_benefit_from/",
        "created": 1617291303.0
    },
    {
        "author": "Shane8282",
        "created_utc": 1617266874,
        "id": "mhr2us",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "\n\nBlink Charging (BLNK) is a small cap American EV charging provider with a value of 1.45 billion. It has been rallying from a around $1 dollar to a yearly high of $64.00 but in the last couple months has dropped in value by almost half to $34.00 due to a rising short interest amongst hedge funds to around 41% making it one of the most heavily shorted stocks on the Nasdaq right now. Not sure what hedge funds are short but I feel there are a few reasons for this.\n\nThe main reason for this is that there are a number of other competitors that are making inroads in the market and that BLNK is relatively small amount of market share at 8% at current. Chargepoint is the largest in the market. Although I feel that that what the hedge funds have overlooked is that there should be room for loads of companys in the EV charging industry. The sheer rate of growth in the EV market has driven this company up 1200% and that has potential to keep going. BLNK has implemented a total of 15,760 charging stations and Apple has added all these stations to its Apple Maps which is massive for the company. We also should not underestimate the radical change to the global economy where clean energy is going to overtake traditional fossil fuels. America has a target I believe of 2035 for the phase out of fossil fuel transport while most of Europe has pledged to transform its economy to be carbon neutral by 2030 with EVs playing a major part in that shift. This indicates that there is huge upside for the company in the coming years.💎🙌\n\nBelow I have highlighted a few of the fundamentals that are interesting and may look familar here including the current short interest (42%) and the current float 32 million. Thats around 20 million LESS than GME currently. 💎🙌\n\nAlso I checked on iborrowdesk where there is currently 45,000 shorts available very similar to GME at the moment although the borrow fee can be as high as 80%?? \n\nHere is where I got these numbers from if people want to expand on this.\n\nhttps://www.highshortinterest.com/ \n\nhttps://iborrowdesk.com/report/CCGID\n\nHowever I do think that there is reason to claim the stock is undervalued regardless of what the squeeze potential may be if that sanario was to play out. What do you guys think I'm not a stock wizard by any means I'm just an Ape like you 🦧🦧 all so it would be interesting to get your opinions. 🙌💎",
        "subreddit": "wallstreetbets",
        "title": "Is Blink Charging (BLNK) the next Gme?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhr2us/is_blink_charging_blnk_the_next_gme/",
        "created": 1617295674.0
    },
    {
        "author": "pleadinginsanity2",
        "created_utc": 1617267015,
        "id": "mhr3xq",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Thank you everybody for all the great advice yesterday. I am down to three questions now: Do they let you trade immediately with the funds from a sale like Robinhood does, or do you have to wait? Also, from what I read yesterday it sounds like TD does not do fractional trades. Is that correct? Finally, if Schwab is buying TD then wouldn't it make more sense to use Schwab instead if TD, or is TD better? Also open to other ideas, I really do not want to be switching around. I am hoping to settle on one broker and stick with them for the long term. I am leaning toward Fidelity at this point. BTW, I prefer to trade on my PC rather than my phone if that makes a difference, The advice from here has been great.",
        "subreddit": "stocks",
        "title": "A few more brokerage questions.",
        "url": "https://www.reddit.com/r/stocks/comments/mhr3xq/a_few_more_brokerage_questions/",
        "created": 1617295815.0
    },
    {
        "author": "Fresh_Fondant_3632",
        "created_utc": 1617260808,
        "id": "mhpsoq",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " \n\n## AMC NYSE Short Interest as of 03/15/2021 at 11 Percent\n\n the hedge fund guys are ay it again shorting AMC \n\nShort Interest as of 03/15/2021 11 Percent since they did not learn with Game Stop if anyone has any extra funds even a share or two each could help make them eat there greed, come on guys  buy a couple shares of AMC again for Round 2 if you can afford to loose it, so they stop making money off of other companies misery especially when the pandemic was not even AMC's fault its just wrong IMO",
        "subreddit": "wallstreetbets",
        "title": "The Hedge Fund Guys are at it AGAIN with AMC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhpsoq/the_hedge_fund_guys_are_at_it_again_with_amc/",
        "created": 1617289608.0
    },
    {
        "author": "Hungry_Track",
        "created_utc": 1617265702,
        "id": "mhquoo",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "I’ve been in MVIS since it was around $1.20. I sold at $9 where before it dipped to around $5. Then after losing about 16k on some risky trades, I decided to dance with the girl who brung me and buy back into mvis at $10 in Feb. For the last few months I acquired 5,100 May 21st $18 calls. At first I quickly made around 22k, the last two weeks I was nothing but red. I finally told my parents this morning that I lost 29k from my peak, but as I walked out the door I said, “but I haven’t sold so I haven’t lost anything”. MVIS was stagnant all day so I didn’t bother to check it, until just about market close. I thought my app was glitching because I made about 19k in 45 minutes. I came my pants, twice. I know I’m bound to get my heart broken very soon but I’m an addicted gambler and have clawed my way back from massive losses before.",
        "subreddit": "options",
        "title": "Mvis yolo",
        "url": "https://www.reddit.com/r/options/comments/mhquoo/mvis_yolo/",
        "created": 1617294502.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1617268735,
        "id": "mhrha8",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Paysafe has finally just gone public with a new Board of Directors, much less debt, lots more cash, new M&amp;A plans and a new ticker: PSFE During yesterday's ticker change, there were several reports of people having no access to their accounts and/or suddenly being faced with an abrupt change in margin requirements from 25% to 100%. Many suggest this was intentional manipulation to give institutions cheaper shares. Regardless, this may have created a good buying opportunity for us too. For those interested, here's some comprehensive DD.\n\nPaysafe is a unique combination of fintech, iGaming, sports betting and banking all rolled into one stock. Whether you like him or not, this is essentially why NBC’s Jim Cramer recently said, “There is something about Paysafe that may be the ultimate stock for this moment.” (video link below) Market analyst Steve Grasso says, “It’s the most excited I’ve been about a stock in a long time.” Grasso, by the way, has repeated called for it to triple ($45-50). So why is that?\n\nPaysafe offers a scalable electronic payment platform used by Draftkings, Roblox, Spotify, eToro, Fortnight, Coinbase, Amazon, Twitch, EA, 888, ApplePay, Youtube, Visa, Microsoft, Xbox, Amelco, William Hill, Ceasar's, Betfair, Pokerstars, PayLease, ESL Gaming, Luckbox, bet365, Lotto among many others.\n\nPaysafe is ranked No. 2 globally in the digital wallet space with presence in 120 countries and No. 4 globally in integrated merchant processing.\n\nImportantly, Paysafe is the No. 1 global leader in iGaming eCash network (currently 36% of revenue) with 10-15X growth projected. US iGaming continues to be legalized state by state, growing revenue by 234% in just the last year. “At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”\n\nPaysafe is enabled for digital currency (a type that shall not be mentioned in these parts) without having to go through fiat. It recently partnered with Coinbase to expand options in US and it just launched PaysafeCash in US. (Now in 40 currencies and 30 global markets enabling easier cross border payments.)\n\nPerhaps most central to this recent merger is Bill Foley, Fidelity’s Chairman of the Board and now the Chairman of Paysafe, who has a proven track record for generating exponential synergistic inorganic growth. For example, in just the last five years, he grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B). He also grew FIS from $2.5 billion to over $91 billion (36.4X) and he says, “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.”\n\nOf their expansion plans Foley says, “We’ve got a wide landscape we can attack. It’s pretty exciting.” “It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else.” “I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody. That’s why I got so excited about Paysafe Group Holdings Limited as its position in iGaming is really second to none.” “Whether it’s a lottery or slot machines or sportsbetting opening in a state, it’s our job to be there first and to make sure we dominate. We’re focusing on gaming, particularly sportsbetting, in the United States as it becomes legal and we’ve got a wide landscape we can attack. It’s pretty exciting.”\n\nAlong with Bill Foley, Paysafe's newly announced Board of Directors includes a former Morgan Stanley CEO, a former Chairman of the American Gaming Association and CEO of MGM Resorts International, a legal and regulatory expert in the multi-jurisdictional online and retail gambling industries, the CEO of Dun &amp; Bradstreet and CEO of Black Knight, two senior Managing Directors from Blackstone and two senior Managing Directors from CVC,\n\nBetween the new Board of Directors, Bill Foley’s proven expertise in rapid M&amp;A growth and Paysafe’s massive market share and diverse assets, including the world’s second largest digital wallet, $362 million in free cash flow, 30-35% margins (21% CAGR), a projected $100-110 billion in transactional volume and $1.5 billion revenue, it is inevitable that institutional investors will, by necessity, include PSFE in their portfolios.\n\nPaysafe’s industry leading risk management and international regulatory expertise gives them an edge in spaces where competitors have hesitated like iGaming, sportsbetting, alternative currency trading as well as offering essential banking and ecommerce services to the \"unbanked\" (1.7 billion globally). Paysafe has a global platform with integrated cloud technology (Snowflake) allowing for easier migration of eCash, integration of payment methods and expansion into global banking as a service. Paysafe is so diversified that they've identified a $58 trillion TAM.\n\nFurther, major investment funds know that fintechs are the future. Fund manager Cathie Wood says, “Fintechs are going to, we believe, gut banks.” Similarly, Jackie Reses, board member of the SF Federal Reserve and fmr Head of Square Capital, calls for fintech “taking over and revolutionizing banking” representing “a wholesale transition” of a $16 trillion market cap.\n\nAnalyst Michael Del Grosso recently initiated coverage saying, \"We believe PSFE represents a relatively scarce asset within the payments industry given its unique business strategy, geographical footprint, and focus on the iGaming industry. Our forecasts imply revenue growth at the high-end of management's guidance and we believe there is upside to our forecasts in the event of state-level legalization of iGaming. PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States.\"\n\nInvestors should be aware that there is are post-merger lockup periods before insiders can sell their shares: PIPE: = 176 days. Private Equity = 86 days (roughly 6 and 3 months respectively accounting for trading days and weekends). Something to be aware of but there are several signals that these parties aren't in any rush to sell. Eli Nagler, a Senior Managing Director at Blackstone, recently said: “Today is a significant milestone for Paysafe and a testament to the excellent work of their world-class management team over several years. We believe Paysafe has a long runway for further growth and look forward to remaining part of the team and seeing their continued success as a public company.” Regarding Blackstone and CVC, who now have four senior managing directors on Paysafe’s Board, Foley said, “They rolled a significant amount of their investment which is a confidence builder. They didn’t take all their money off the table… All of these things put together really created the confidence among the investor base to invest in the PIPE and then support the stock.” Also, the PIPE investors are primarily insurance companies known for long term hold strategies and they are closely associated with Bill Foley. As Foley recently said, “Having a large PIPE basically validates the transaction.… The companies that I’m affiliated with actually invested roughly a billion dollars in the PIPE and forward purchase agreements so Paysafe was always a really protected asset, besides the fact that it’s a great asset.”\n\nBill Foley says Paysafe may be his “best investment ever.” He says, “It’s a fortress. It’s got a moat.” “We have a proven strategy of winning as new global markets open. And most importantly, we have unrivaled regulatory risk and technical expertise.”\n\nAs an aside, even though, “Roughly 75% of online gambling operators use Paysafe for processing payments” many in the US haven’t yet heard of it yet. Partially because much of its presence is in back-end processing. Through its several new partnerships (Coinbase, Microsoft Rentmoola), Paysafe is just now rolling out its offerings in the U.S. In Europe, where it is more commonly used, Trustpilot rates Paysafe as “Excellent” (4.7/5 stars) with over 20,000 reviews, and Skrill (owned by Paysafe) 4/5 stars “great” with over 16,000 reviews, while competitor PayPal is rated \"poor\" only 1/5 stars with over 16,000 reviews. Further, Paysafe was winner of the American Gambling Awards’ “Payment Processor of the Year,” and owns Openbucks, Neteller and Skrill, 2019 winner “Best Digital Wallet” for best consumer take up and most innovative technology with “greatest potential to disrupt current ecosystems.” Also, Paysafe won “Best Omni-Channel Payment Solution” 2021 MPE Award and the gaming industry SAGSE award for “Best Payment Method.”\n\nTo give a sense of their pace and progress, these are some of Paysafe’s recent announcements that were made before going public and have not been factored into the current valuation:\n\nDec. 15 — Paysafe launches Paysafecash in the US\n\nDec. 21 — Paysafe partners with Amelco to plug US sports books into unified payments platform\n\nDec. 23 — Paysafe enables online cash payments for Microsoft\n\nJan 11 — Paysafe partners with Colorado’s BetWildwood\n\nFeb 1 — Paysafe expands Virginia Lottery partnership\n\nFeb 17 — Paysafe partners with Luckbox to roll out Skrill and Neteller payment services\n\nFeb 18 — Paysafe expands partnership with ESL Gaming, the world’s largest esports company\n\nFeb 23 — Paysafe’s Skrill launches new fiat-to-digital currency\n\nFeb 25 — Paysafe partners with Austria’s A1 esports League\n\nMar 1 — Paysafe partners with RentMoola to enable US renters to pay rent with Paysafecash eCash\n\nMar 12 — Leeds United announces partnership with Skrill\n\nMar 15 — Paysafe expands U.S. partnership with PointsBet\n\nMar 16 — Paysafe partners with Provema to enable online cash payments\n\nMar 25 -- Paysafe’s Skrill expands digital currency offering to US with Coinbase\n\n&amp;#x200B;\n\nFortunately for shareholders, even before Foley’s value creation play book is put into action, Paysafe is currently undervalued compared to sector peers.\n\nSince market analyst Steve Grasso continues to his repeat his calls for a triple ($45-50), I've looked more closely at EV / EBITDA, EV / Revenue and EV / Free cash flow multiples of sector peers, including PayPal, Nuvei, Repay, Shift 4, Adyen, Square, Affirm, Stripe, Chime and a few others, using cross-referenced data from Nasdaq, WSJ, Morningstar, Macrotrends, Yahoo Finance. The conservative average of those three multiples puts Paysafe’s post-merger pro forma share value at around $46.52:\n\n&amp;#x200B;\n\nPaysafe’s share price using the average multiples from the full list of sector peers:\n\nEV/EBITDA ratio : $122.09\n\nEV/Rev ratio : $83.91\n\nEV/FCF ratio : $87.86\n\nAverage: $97.95\n\n&amp;#x200B;\n\nMore realistic share prices, after eliminating all outliers with very high multiples:\n\nEV/EBITDA ratio :$50.75\n\nEV/Rev ratio : $44.64\n\nEV/FCF ratio : $44.18\n\nAverage :$46.52\n\n&amp;#x200B;\n\nNote: Unlike Paysafe, nearly half of these publicly traded fintechs still do not report positive cash flow. Also, these multiples reflect a collective 27% pull back from recent highs so interest rate risks have been somewhat factored in.\n\nAlso, Paysafe's CFO noted that their conservative 11% growth projection is tied to the general fintech market at large. They have deliberately excluded both M&amp;A plans that are apparently already underway and US iGaming growth that may potentially grow 10x or more over the next 5 years. Further, the above comps include fintechs with slower or similar growth while still commanding much higher multiples. For example, Shift4 reported only 4% y-o-y growth and GPN's growth projection is on par with Paysafe's.",
        "subreddit": "wallstreetbets",
        "title": "Paysafe goes public with new ticker: PSFE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhrha8/paysafe_goes_public_with_new_ticker_psfe/",
        "created": 1617297535.0
    },
    {
        "author": "Apprehensive_Pin_560",
        "created_utc": 1617270270,
        "id": "mhrsuh",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "VANCOUVER, British Columbia (AP) _ Northern Dynasty Minerals Ltd. (NAK) on Wednesday reported a loss of $9.9 million in its fourth quarter.\n\nOn a per-share basis, the Vancouver, British Columbia-based company said it had a loss of 2 cents.\n\nFor the year, the company reported that its loss narrowed to $47.7 million, or 10 cents per share.\n\nThe company's shares closed at 63 cents. A year ago, they were trading at 39 cents",
        "subreddit": "wallstreetbets",
        "title": "r/NAK",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhrsuh/rnak/",
        "created": 1617299070.0
    },
    {
        "author": "TransportationSea516",
        "created_utc": 1617265645,
        "id": "mhquad",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "Is it a sign.",
        "url": "https://i.redd.it/dvywwookviq61.jpg",
        "created": 1617294445.0
    },
    {
        "author": "XSOUL_1337",
        "created_utc": 1617267716,
        "id": "mhr9fo",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "Yahoo News article Yellen talking about Re-Opening the FSOC (idk if it has made the rounds yet) article linked on comments",
        "url": "https://i.redd.it/3nvynm2p1jq61.png",
        "created": 1617296516.0
    },
    {
        "author": "NikoLetubeur",
        "created_utc": 1617261471,
        "id": "mhpy4q",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n[the shark waiting to buy your cheap stonks](https://preview.redd.it/wpv5n8v2jiq61.jpg?width=366&amp;format=pjpg&amp;auto=webp&amp;s=576f9c5b853e2e4d808f6d1d15f13f462033500a)\n\nMaybe you have seen videos on instagram about traders turning pennies into millions?\n\nMaybe you just like the stock ?\n\nMaybe your friend has bought into x, and now he’s trying to get you to buy some. Most of the time, by the time you are learning about a new hot stock, or the next big shitcoin, it is already too late. Yes, you missed out, like Ignored, my friend who’s always asking if it’s too late.\n\nYour are your #1 ennemy\n\n&amp;#x200B;\n\nRead more tips here :\n\n[The only trading tips you will ever need ](https://decentra.news/the-only-trading-tips-you-will-ever-need/)",
        "subreddit": "pennystocks",
        "title": "The only trading tips you will ever need",
        "url": "https://www.reddit.com/r/pennystocks/comments/mhpy4q/the_only_trading_tips_you_will_ever_need/",
        "created": 1617290271.0
    },
    {
        "author": "Sean_Trelle",
        "created_utc": 1617260630,
        "id": "mhpr5j",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "When I look at the front page of WSB these days all I see are a bunch of virgins collectively asking, \"daddy, when is GME going to moon?\" Or, \"daddy, is the squeeze szuoze yet?\" Looking for reassurance and constantly refreshing WSB to feed your confirmation bias is not as good thing for sentiment. If you are cock sure about GME hitting $42069 then you don't need to read every goddamn comment on the daily GME thread or read every crayon laden TA post that tells you GME will moon on X date. Why is there such a need to have constant reassurance about GME mooning? Is it a possible FUD strategy? Think about it; you're conditioned to log on to WSB and get an instant dopamine hit because you saw a post about how GME is gonna moon any second now. What happens if this stretches on for months or even years? People might lose interest and, God forbid, exit their positions. GME is shaping up to be a solid long term play regardless of the short squeeze potential. Quit needing constant reassurance, it makes us look unsure and insecure. \n\nTL;DR: Nobody knows when GME will moon. Quit circle jerking and wearing out your dopamine receptors. If you're cock sure about GME mooning then STFU and HODL!\n\nPositions: $CUM 420@69, $ASS 69@420.",
        "subreddit": "wallstreetbets",
        "title": "GME Confirmation Bias is a FUD Campaign.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhpr5j/gme_confirmation_bias_is_a_fud_campaign/",
        "created": 1617289430.0
    },
    {
        "author": "now_is_time",
        "created_utc": 1617261510,
        "id": "mhpyhv",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "# Digihost Acquires 60 MW Power Plant Increasing Hashrate Capacity to 3 EH\n\nTORONTO, March 24, 2021 (GLOBE NEWSWIRE) -- Digihost Technology Inc. (“Digihost” or the “**Company**”) (TSXV: **DGHI**; OTCQB: **HSSHF**) is pleased to announce that the Company has signed a binding agreement (the “Agreement”) for the purchase of a 60 MW power plant (“**Digifactory1”**) located in the State of New York, bringing the Company’s total power capacity to approximately 102 MW. The Company’s ability to generate its own power will significantly reduce electricity costs, the Company’s largest operating expense for its cryptocurrency mining operations. It is estimated that with the acquisition of Digifactory1, the all-in cost of electricity will be reduced to under US$0.03 per kw/h.  \n\n\nTo the extent possible, the Company intends to source and utilize renewable natural gas for the operations of Digifactory1 and also engage in the practice of acquiring renewable energy certificates, all in line with the Company’s objective to mitigate its carbon footprint. Digifactory1 will have the capacity to operate an additional 18,000 top tier Bitcoin miners, which if added to the existing fleet of 11,500 miners already in operation, would combine for a total Bitcoin mining capacity of approximately 400 Bitcoins per month as of today’s mining difficulty factor. Additionally, the expanded capacity would allow for a potential increase to the existing hashrate of 190 PH to up to 3 EH. This substantial increase in both Bitcoin mining output capacity and hashrate would be the direct result of potentially adding up to 18,000 latest generation Bitcoin miners, versus the current operating mix of 11,500 older and newer version Bitcoin miners.\n\nUnder the terms of the Agreement, the Company will pay to the vendor cash consideration of US$3,500,000 and issue to the vendor 437,318 common shares of the Company with a deemed value of US$750,000 (US$1.72 per share).\n\nAlec Amar, the Company’s President stated: “We are extremely excited to have achieved this milestone in the evolution of our Company. Vertical integration is a fundamental aspect of our business model, which will enable us to maximize Bitcoin mining efficiency and continuing to create sustainable value for our shareholders. The addition of Digifactory1 will further reduce the electricity costs of our already efficient operations, and will also provide additional capacity to operate a new fleet of top tier Bitcoin miners.”\n\n[Source](https://www.globenewswire.com/en/news-release/2021/03/24/2198342/0/en/Digihost-Acquires-60-MW-Power-Plant-Increasing-Hashrate-Capacity-to-3-EH.html)\n\n  \n\n# Digihost Acquires 700 S17+ 76TH Bitcoin Miners for Immediate Delivery\n\nTORONTO, March 29, 2021 (GLOBE NEWSWIRE) -- Digihost Technology Inc. (“Digihost” or the “Company”) (TSXV: **DGHI**; OTCQB: **HSSHF**) is pleased to announce the acquisition of 700 Bitmain S17+ 76TH miners for a total purchase price of US$4.025 million, that would increase the Company’s hashrate by 50PH, or approximately 20% in the second quarter of 2021. The Bitmain S17+ miners are scheduled for delivery in early April and will be deployed immediately.  \n\n\nThe addition of the 700 Bitmain S17+ miners, based on the current price of Bitcoin (“**BTC**”) and level of mining difficulty, would increase the Company’s monthly mined BTC by approximately 9 BTC, which would translate to an additional US$400,000 of operating profit per month. The new miners will be installed at the Company’s existing mining facility in Upstate New York.\n\nMichel Amar, the Company’s CEO, stated: “We continue to aggressively pursue every new opportunity that aligns with our goal to expand operations through the strategic acquisition of Bitcoin miners and low-cost sources of clean energy. The acquisition and immediate deployment of these new miners is the first in, what we expect to be, many new acquisitions going forward. We are excited to implement our plan to utilize the expanded 3EH hashing capacity from our recently announced acquisition of a 60MW power plant (*press release: March 24, 2021*), where it is expected that the Company’s energy cost would be further reduced by up to 40%.”\n\n[Source](https://www.globenewswire.com/en/news-release/2021/03/29/2200616/0/en/Digihost-Acquires-700-S17-76TH-Bitcoin-Miners-for-Immediate-Delivery.html)\n\n**About Digihost Technology Inc.**  \nDigihost Technology Inc. (TSXV: **DGHI**; OTCQB: **HSSHF**) is a growth-oriented blockchain technology company primarily focused on Bitcoin mining. The Company's mining facilities are located in Upstate New York, and are equipped with 78.7 MW of low-cost power with the option to expand to 102MW. The Company is currently hashing at a rate of 190PH with potential to expand to a rate of 3EH.",
        "subreddit": "pennystocks",
        "title": "HSSHF - Digihost Acquires 60 MW Power Plant Increasing Hashrate Capacity to 3 EH And Acquires 700 S17+ 76TH Bitcoin Miners for Immediate Delivery",
        "url": "https://www.reddit.com/r/pennystocks/comments/mhpyhv/hsshf_digihost_acquires_60_mw_power_plant/",
        "created": 1617290310.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1617268208,
        "id": "mhrd8o",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "I recently took a small position in UNP to veer away from my heavy tech portfolio.  \n\nI've been eyeing a few industrials to try and average in slowly as long term positions.\n\nI was wondering what people's thoughts were on HON DD or MMM to put in my ROTH to help diversify a little.\n\nI'm leaning to HON.  Is it expensive right now?\n\nIt looks like DD and MMM seem the most \"beat up\" though.  Maybe higher short term upside?\n\nReopening plays?\n\nThanks",
        "subreddit": "stocks",
        "title": "A good industrial long term position? HON DD MMM",
        "url": "https://www.reddit.com/r/stocks/comments/mhrd8o/a_good_industrial_long_term_position_hon_dd_mmm/",
        "created": 1617297008.0
    },
    {
        "author": "Narrow_Atmosphere996",
        "created_utc": 1617264160,
        "id": "mhqiy9",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Finally saved enough for the minimum buy in of a monthly return type mutual thingy. Not really sure how any of this works, but am figuring it out as I go. Simply felt the need to share this. \n\nAlso sorry for not adding a picture. I genuinely dont know what info is safe to share and what isnt, so for now, not showing any\nEnjoy your night everyone",
        "subreddit": "wallstreetbets",
        "title": "Bought my first investment. Very proud.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhqiy9/bought_my_first_investment_very_proud/",
        "created": 1617292960.0
    },
    {
        "author": "InvestingPlusData",
        "created_utc": 1617275282,
        "id": "mhsybb",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "For those of us that are more heavily invested in the tech sector, I'm wondering if it makes more sense to rebalance our portfolios now, compared to when the sector is performing particularly well. My thought is that if some of your positions are down/negative, you'll have to pay less capital gains tax than if your portfolio is performing relatively better.\n\nIn the past, it's felt *nicer* to rebalance when my portfolio is performing well as I can see the profits that I have made, but now I'm thinking that I should wait for a bit of a down spell to do this to save some money come tax time.\n\nKeen to hear your thoughts, thanks!",
        "subreddit": "investing_discussion",
        "title": "Rebalancing your portfolio - tax implication",
        "url": "https://www.reddit.com/r/investing_discussion/comments/mhsybb/rebalancing_your_portfolio_tax_implication/",
        "created": 1617304082.0
    },
    {
        "author": "XSOUL_1337",
        "created_utc": 1617267687,
        "id": "mhr97g",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Yahoo News article Yellen talking about Re-Opening the FSOC (idk if it has made the rounds yet) article linked on comments",
        "url": "https://i.redd.it/7prm44ck1jq61.png",
        "created": 1617296487.0
    },
    {
        "author": "DeerLegal",
        "created_utc": 1617266419,
        "id": "mhqzlx",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "\n\n\n\nThis post is regarding the link on Michael Burry's Twitter. It is a long read, but I have found some parallels with [The EVERYTHING Short](https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/). Really recommend reading the whole thing it if you have time.\n\nRead it here: [https://www.federalreserve.gov/econres/notes/feds-notes/ins-and-outs-of-collateral-re-use-20181221.htm](https://www.federalreserve.gov/econres/notes/feds-notes/ins-and-outs-of-collateral-re-use-20181221.htm)\n\nDisclaimer: I am not a financial advisor. This document was published in December 2018 and the author has a PhD in Finance, so a real wrinkly brain. (Although it is a bit outdated, the information is insightful and Michael Burry is leading us to it)\n\n**So what sticks out to me:**\n\n1. &amp;#x200B;\n\nhttps://preview.redd.it/18s07nx4lhq61.jpg?width=294&amp;format=pjpg&amp;auto=webp&amp;s=4f86ce49c15ff2eccf34d031e0129ee09c42aae8\n\n2.\n\nhttps://preview.redd.it/0jrlxae7nhq61.jpg?width=319&amp;format=pjpg&amp;auto=webp&amp;s=8b98e4ede6f06ef8562d6c039c5e138b88ace48b\n\nDid I read that right, 7 times as many treasury security backed assets as they own!?! and this is just 2018...\n\n3.\n\nhttps://preview.redd.it/522gn9j8nhq61.jpg?width=408&amp;format=pjpg&amp;auto=webp&amp;s=f963eceba95828408aba0ce2391f43b738cdd3ed\n\nSo this part about the eSLR rule is interesting, but it didn't hold up. Next I will show some 2020 data from the same author which shows the collateral multiplier back up around 9 in April 2020.Source: [https://www.federalreserve.gov/econres/feds/files/2020103pap.pdf](https://www.federalreserve.gov/econres/feds/files/2020103pap.pdf)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/e8h5xnu1ohq61.png?width=697&amp;format=png&amp;auto=webp&amp;s=a334a1c4d758f5364a51f8f61362d7f6f271e74f\n\nhttps://preview.redd.it/m3vkyi49ohq61.png?width=648&amp;format=png&amp;auto=webp&amp;s=f5e2c2dab4e6145fcc80504ebf97585d100bfaaf\n\nNotice collateral multiplier is defined as the ratio between the black line (U.S. Treasury SFTs) and the red line (non-rehypothecated).\n\n&amp;#x200B;\n\nCould a much smarter ape like u/atobitt give some insight here? This looks huge, but I don't completely understand what I'm looking at here.\n\nSorry if it's a bit rushed, I wrote it during my lunch break. I'll respond to comments later.\n\n&amp;#x200B;\n\nEdit 1: Great analysis from u/weeknddev \n\n&gt;7x leverage on encumbered capital and more than 85% is rehypothecated. This is like taking 85% of the same banana until there is no banana left. I would suspect that 7x exposure is low. Why?  \n&gt;  \n&gt;Those who do not exceed 700b in capital only have to report monthly as of this publication. That means at any given time they could be several factors more rehypothecated betting like fucking degenerates. And like in other posts because their money comes from derivatives, they are able to sell them and make out like bandits. Truly bandits.  \n&gt;  \n&gt;Since we effectively blocked their get out of jail free card by holding so damn hard they cannot come up with those rehypothecated shares. They are beyond fucked .. but we might be too.\n\nAll I can say is, buy and HODL is the way.\n\n**Important: Let’s Spread Awareness**\n\nMy dear Apes check this out.\nLet’s spread awareness of what an massive fraud is happening currently on the stock markets. What better way is there than than educating ourselves and others?\n\n\n**Not financial advice**\n\nThis is not financial advice. I’m just an idiat who has no clue what he’a taklking about. I just like the stock.\n\n**Original source** by u/RichHodler",
        "subreddit": "StockMarket",
        "title": "The Everything Short Part 2-this is huge!!!",
        "url": "https://www.reddit.com/r/StockMarket/comments/mhqzlx/the_everything_short_part_2this_is_huge/",
        "created": 1617295219.0
    },
    {
        "author": "__renesh__",
        "created_utc": 1617260579,
        "id": "mhpqqo",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "You’re an absolutely retarded fucking 🦍 if u believe this . Happy April Fool’s lmfao🤡\n\nWe like the stonk🤑, so we hold. The short squeeze is coming, be patient!",
        "subreddit": "Wallstreetbetsnew",
        "title": "The short squeeze already squose / or it is never happening (Detailed explanation",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/mhpqqo/the_short_squeeze_already_squose_or_it_is_never/",
        "created": 1617289379.0
    },
    {
        "author": "VGK_F",
        "created_utc": 1617263071,
        "id": "mhqa8q",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "Why your pennystocks have gone down and what can you do about it?",
        "url": "https://www.youtube.com/watch?v=N0C9Xi5cFKA",
        "created": 1617291871.0
    },
    {
        "author": "cmrny",
        "created_utc": 1617273809,
        "id": "mhslji",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Options expiring today for NIO $40 Call 4/1. Should I sell or exercise it?",
        "url": "https://www.reddit.com/r/stocks/comments/mhslji/options_expiring_today_for_nio_40_call_41_should/",
        "created": 1617302609.0
    },
    {
        "author": "gio9619",
        "created_utc": 1617273984,
        "id": "mhsn05",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hi everyone I'm new here and would like to suggest 3 website to earn some free crypto by watching shortlinks or ptc ads, they both allow to withdraw to expresscrypto, [faucetpay](https://faucetpay.io/?r=1219077) coinbase or directly to wallet.\n\n1: the first is [faucetcrypto](https://faucetcrypto.com/ref/781142) it allows to earn some coin through shortlinks and ptc ads, the minimum amount to withdraw is very low and can be reached daily plus it has a level program that gives you more coins by leveling up\n\n2: the second is dutchy corps [dutchy corps](https://autofaucet.dutchycorp.space/?r=france999) that is an autofaucet, it allows to earn by watching shortlinks, ptc ads and surfing ads. It also has a level program that increase the claming amount plus i recommend to run the autofaucet with balance mode to earn an additional 10% and on weekends to earn an additional 20% claim bonus\n\n3: the third is [autoclaim](https://autoclaim.in/r/france999) that allows to earn coin by doing shortlinks very easily, it also has a bonus program and there is no minimum amount to withdraw\n\nI think is a good way to start earn some crypto without spend money, if someone did register and want some tip I use to do the shortlinks and ptc ads quickly feel free to message me.",
        "subreddit": "Wallstreetbetsnew",
        "title": "three websites to earn some free crypto",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/mhsn05/three_websites_to_earn_some_free_crypto/",
        "created": 1617302784.0
    },
    {
        "author": "fatedwanderer84",
        "created_utc": 1617267212,
        "id": "mhr5gt",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Getting some ETFM stock with my morning coffee. CEO says it like it is and FOMO corp. is on the path to success.",
        "url": "https://i.redd.it/ea88a3b80jq61.png",
        "created": 1617296012.0
    },
    {
        "author": "gio9619",
        "created_utc": 1617276032,
        "id": "mht57m",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hi everyone I'm new here and would like to suggest 3 website to earn some free cripto by watching shortlinks or ptc ads, they both allow to withdraw to expresscrypto, [faucetpay](https://faucetpay.io/?r=1219077) coinbase or directly to wallet.\n\n1: the first is [faucetcrypto](https://faucetcrypto.com/ref/781142) it allows to earn some coin through shortlinks and ptc ads, the minimum amount to withdraw is very low and can be reached daily plus it has a level program that gives you more coins by leveling up\n\n2: the second is dutchy corps [dutchy corps](https://autofaucet.dutchycorp.space/?r=france999) that is an autofaucet, it allows to earn by watching shortlinks, ptc ads and surfing ads. It also has a level program that increase the claming amount plus i recommend to run the autofaucet with balance mode to earn an additional 10% and on weekends to earn an additional 20% claim bonus\n\n3: the third is [autoclaim](https://autoclaim.in/r/france999) that allows to earn coin by doing shortlinks very easily, it also has a bonus program and there is no minimum amount to withdraw\n\nI think is a good way to start earn some cripto without spend money, if someone did register and want some tip I use to do the shortlinks and ptc ads quickly feel free to message me.",
        "subreddit": "wallstreetbets",
        "title": "three websites to earn some free cripto",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mht57m/three_websites_to_earn_some_free_cripto/",
        "created": 1617304832.0
    },
    {
        "author": "Diamond_handzz",
        "created_utc": 1617267475,
        "id": "mhr7eb",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "2 charts, 1 answer. Even the smoothest of brains should be able to see the pattern. But in case not, I filled it in for you. 🚀🌔",
        "url": "https://www.reddit.com/gallery/mhr7eb",
        "created": 1617296275.0
    },
    {
        "author": "SentenceEquivalent51",
        "created_utc": 1617262945,
        "id": "mhq9d2",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "HITIF UP 178% yoy OTC grab it before it goes!!!",
        "url": "https://i.redd.it/m5h85zpjniq61.jpg",
        "created": 1617291745.0
    },
    {
        "author": "projectzeroe",
        "created_utc": 1617275465,
        "id": "mhszwc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Well oh well Earthlings of WSB! HOFV might be short on shorts today and we have been doing our DD! Might need you to come and gamma squeeze the living GME out of it!!!! We are ready to rocket roll on this!!!! Come SOS!",
        "url": "https://i.redd.it/a5j9pcyrojq61.jpg",
        "created": 1617304265.0
    },
    {
        "author": "88evergreen88",
        "created_utc": 1617264201,
        "id": "mhqjay",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "A noob and an experienced investor each open a new trading account on February 1, 2021.  Based on market trends/volatility over the past two months what % of returns and/or losses would you guess each hypothetical person has suffered/attained.  Of course it ‘depends’, but indulge me.",
        "subreddit": "CanadianInvestor",
        "title": "Here’s a hypothetical:",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/mhqjay/heres_a_hypothetical/",
        "created": 1617293001.0
    },
    {
        "author": "Agnosticpoopster",
        "created_utc": 1617263108,
        "id": "mhqaix",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I got in at $13 after reading of it on wallstreetbets but ended up selling it at around $17 because I thought it’s amazing that something I got from wallstreetbets actually went up, time to take profit. I was a pussy basically. Then I saw it went up to $30s then $100s then $300s and as many I started reading more on it but decided not to chase it. Then saw it come back down to $40 but just thought to myself I dodged a bullet, even though I could have stayed in at $13 purchase and not sell but it could be worse and I could have gotten it and $300. Then I saw it going back up and while all of this was happening I went balls deep reading the DDs on wsb/gme and really understood what was going on but again decided to stay away cause I didn’t want anything close to betting. But clearly it didn’t stay that way and my whole plan changed when I took my mothers to doctors, we were sitting in the waiting area and I had some heart to heart with my mother (she recently lost her brother and got sick right after) She went to use the restroom and I opened wsb and saw DFV post his account update. That happened to be exactly at the time when $GME had gone back up from $40s back to above $100s, but that day it was red. It dipped below $100 and I set the limit for $88 to go all in and guess what $GME low was that day.. around $86.5. I got my shares and right after it started going up.\nAnd it was the last time $GME dipped below $100. I consider myself extremely lucky I got a good buy point even though I was nowhere in the earliest of people who deserve all the returns in this more then anyone cause they believed in the stock from the start but I am so glad I got in this cause at that moment it felt so right. It still feels right. This was about 40 days back and i have deleted my stock account from my phone so I don’t even think of selling it, I want..need this to change my life around, had pretty much the worst time of my life since I lost everything in 2018 and this seemed like the best way to do it. I put whatever I have now In gme and honestly it doesn’t matter if I got in at $88 or $200 when it’s at +$10000. It’s good to be in this journey with you guys. Thanks to you guys I got in this and got this opportunity to see the worth. I believe in this company and I HOLD 🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nSorry for any English mistakes, not my first language. Thanks for listening 🦍🦍🦍’s",
        "subreddit": "wallstreetbets",
        "title": "My GME YOLO story: I lost all my money back in 2018 trading options, I promised myself I won’t touch options ever again. In dec 2020 I started trading again and thought of $gme as something close to betting and options trading for the volatility it had after it started going up.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhqaix/my_gme_yolo_story_i_lost_all_my_money_back_in/",
        "created": 1617291908.0
    },
    {
        "author": "Sfkingz17",
        "created_utc": 1617260705,
        "id": "mhprs7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC let’s go #amc not that I want it I want to see movies!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhprs7/amc_lets_go_amc_not_that_i_want_it_i_want_to_see/",
        "created": 1617289505.0
    },
    {
        "author": "AkikoMinami",
        "created_utc": 1617273004,
        "id": "mhsevp",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Holding with all my savings since February - refueling whenever I can. It ain’t about the individual, it’s about the TRIBE! 🦍",
        "url": "https://www.reddit.com/gallery/mhsevp",
        "created": 1617301804.0
    },
    {
        "author": "gio9619",
        "created_utc": 1617274830,
        "id": "mhsu1h",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hi everyone I'm new here and would like to suggest 3 website to earn some free cripto by watching shortlinks or ptc ads, they both allow to withdraw to expresscrypto, [faucetpay](https://faucetpay.io/?r=1219077) coinbase or directly to wallet.\n\n1: the first is [faucetcrypto](https://faucetcrypto.com/ref/781142) it allows to earn some coin through shortlinks and ptc ads, the minimum amount to withdraw is very low and can be reached daily plus it has a level program that gives you more coins by leveling up\n\n2: the second is dutchy corps [dutchy corps](https://autofaucet.dutchycorp.space/?r=france999) that is an autofaucet, it allows to earn by watching shortlinks, ptc ads and surfing ads. It also has a level program that increase the claming amount plus i recommend to run the autofaucet with balance mode to earn an additional 10% and on weekends to earn an additional 20% claim bonus\n\n3: the third is [autoclaim](https://autoclaim.in/r/france999) that allows to earn coin by doing shortlinks very easily, it also has a bonus program and there is no minimum amount to withdraw\n\nI think is a good way to start earn some cripto without spend money, if someone did register and want some tip I use to do the shortlinks and ptc ads quickly feel free to message me.",
        "subreddit": "wallstreetbets",
        "title": "three websites t earn some free cripto",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhsu1h/three_websites_t_earn_some_free_cripto/",
        "created": 1617303630.0
    },
    {
        "author": "iamcrackers",
        "created_utc": 1617272739,
        "id": "mhscqx",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hi, remember what we all did for GameStop? Can we do it again for Nokia please?! That would be great. \n\nThanks.",
        "subreddit": "wallstreetbets",
        "title": "A message from a random idiot",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhscqx/a_message_from_a_random_idiot/",
        "created": 1617301539.0
    },
    {
        "author": "Diamond_handzz",
        "created_utc": 1617267117,
        "id": "mhr4ot",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "2 charts, 1 answer. One chart is 4 hour interval, other is 1 day interval. 4 hour shows MACD has crossed and moon shot is soon. 1 day shows moonshot happening next week or week after. Smooth brains should be able to see pattern but I filled it in for you anyways. RSI is favorable as well. 💎👐🏻🚀🌔",
        "url": "https://www.reddit.com/gallery/mhr4ot",
        "created": 1617295917.0
    },
    {
        "author": "Victorinox2",
        "created_utc": 1617272511,
        "id": "mhsatx",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Am I doing it right like a true retard?",
        "url": "https://i.redd.it/fnz4lmozfjq61.jpg",
        "created": 1617301311.0
    },
    {
        "author": "jaystockknowhow",
        "created_utc": 1617269202,
        "id": "mhrko8",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " Stock Digitaltown Inc. (symbol **DGTW**) They provide an alternative to multi-national search engines and marketplaces, saving merchants money and ensuring more revenue stays within the local economy and community.\n\nStock Phi Group Inc. (symbol **PHIL**) is simply a Reserved Alternative Investment Fund (“RAIF”) with several compartments for investment in selective industries and opportunities.\n\nStock Sunstock Inc. (symbol **SSOK**) is a public company and is involved in the buying, selling and distribution of precious metals, primarily gold.)\n\nAll of these stocks have been amazing in the past and now they are at a low buying price, it is the perfect time to buy before they rises again. If your new to the stock market trading I would suggest using the trading platform called thinkorswim it is from tdameritrade, I think it is great you can look up all kind of charts and news about any given stock and lots more it is very helpful and of course buying and selling stocks. The link is: [https://www.tdameritrade.com/tools-and-platforms/thinkorswim.page](https://www.tdameritrade.com/tools-and-platforms/thinkorswim.page)",
        "subreddit": "investing_discussion",
        "title": "GOOD PENNY STOCKS AT THE MOMENT",
        "url": "https://www.reddit.com/r/investing_discussion/comments/mhrko8/good_penny_stocks_at_the_moment/",
        "created": 1617298002.0
    },
    {
        "author": "JoelOnCrypto",
        "created_utc": 1617266126,
        "id": "mhqxne",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hey guys!\n\nPart 7 of my +80000% day trading challenge is now live on YouTube!\n\n[https://youtu.be/BJ9DcDNz0HM](https://youtu.be/BJ9DcDNz0HM)\n\nSince I have a lot of extra time due to the Covid situation here in Sweden, I decided to do a day trading challenge this year, which I’ve been doing since February 2021.\n\nThe challenge is based on a strategy that I created based on my trading result calculator and it’s actually working out really good so far.\n\nI’m 36 trades in and up +636% already. My vision is to increase my trading account by +80000% this year, going from 100 USD to 80k USD.\n\nI know it sounds insane, but I actually have a plan for this.\n\nAll the best,\n\nJoel",
        "subreddit": "investing_discussion",
        "title": "I recorded all of my trades this year, and I’m up +636%",
        "url": "https://www.reddit.com/r/investing_discussion/comments/mhqxne/i_recorded_all_of_my_trades_this_year_and_im_up/",
        "created": 1617294926.0
    },
    {
        "author": "zmanred",
        "created_utc": 1617263866,
        "id": "mhqgfz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "https://sec.report/Document/0001193125-21-096719/?_gl=1*1lnbb9d*_ga*RDhvVHM5dUQ1MDdGb1N3LUhVcGI2ajRubWlnelFBb0REOXoxZ0JxWWlKR0JIaEd2UVRxVm9nMDRRMlg1TG9fRQ..\n\n\nSo you would think that date of the meeting would be one of the most important pieces of information. However everytime the meeting is mentioned it just says “meeting will be held on..” and then the sentence ends abruptly. Why wouldn’t they specify a date? Is it just because they haven’t decided when and where? \n\nIs it allowed to submit such filings with missing information? Maybe it’s done in the interest of getting Ironsources financial information to the general public ASAP but I was just confused reading this. Can someone elaborate if this is normal practice? Thanks",
        "subreddit": "stocks",
        "title": "TBA Ironsource F-4 filing with SEC does not specify date of the shareholders meeting",
        "url": "https://www.reddit.com/r/stocks/comments/mhqgfz/tba_ironsource_f4_filing_with_sec_does_not/",
        "created": 1617292666.0
    },
    {
        "author": "Klutzy_Difference_41",
        "created_utc": 1617263005,
        "id": "mhq9ru",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Is it really a smart idea to try to squeeze MVIS,we should focus on AMC and GME because they haven't even come close to squeezing yet and now dividing out manpower even more makes it harder, we should do MVIS once AMC and GME squeezes?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhq9ru/is_it_really_a_smart_idea_to_try_to_squeeze/",
        "created": 1617291805.0
    },
    {
        "author": "SentenceEquivalent51",
        "created_utc": 1617271261,
        "id": "mhs0ge",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "OTC HITIF 179% growth yoy grab b4 it flies. 🌚 🚀",
        "url": "https://i.redd.it/8rqnjtv9cjq61.jpg",
        "created": 1617300061.0
    },
    {
        "author": "IndividualHyena2103",
        "created_utc": 1617263497,
        "id": "mhqdi5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "What's up to all my apes. I was scared to pull to the trigger and leave RH while this short squeeze was going on .. I said F*## IT this morning and finally said I'm getting off RH NOW!!! ITS TIME TOO ROCK OUT WITH MY COCK OUT AND GO APES SHIT.. I HOPE THIS POST HELP ANY AND EVERYONE WHO WAS FEELING LIKE ME ... #MAKEYOURSTOCKCOUNT .... GET OUT THAT DEEP DEEP DARK POOL.",
        "subreddit": "wallstreetbets",
        "title": "It takes a village to overcome this matter!#GoApes",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhqdi5/it_takes_a_village_to_overcome_this_mattergoapes/",
        "created": 1617292297.0
    },
    {
        "author": "citsituAerAuoY",
        "created_utc": 1617271001,
        "id": "mhryaj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Check out r/wedontlikethestock and tell me what you think about it",
        "subreddit": "wallstreetbets",
        "title": "I did a thing",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhryaj/i_did_a_thing/",
        "created": 1617299801.0
    },
    {
        "author": "11ftw",
        "created_utc": 1617271024,
        "id": "mhrygy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "It came out of nowhere but here we are. \n\n\n\nAlso April's fool.",
        "subreddit": "wallstreetbets",
        "title": "RoaringKitty selling GME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhrygy/roaringkitty_selling_gme/",
        "created": 1617299824.0
    },
    {
        "author": "GhostIntention",
        "created_utc": 1617262531,
        "id": "mhq6bo",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "As you probably already saw last night, DISCB had a huge pump.\n\nBut why didn't DISCA (and DISCK for that matter) follow?\n\nI get that the there are minor differences like A would have voting rights and B doesn't, plus theres a 30x difference in volume and a corresponding 3x inverse difference in market cap between A and B. The eps is around the same though. The beta for B is just under 1 at 0.97 whilst A and C are around 1.5\n\nSo why is there such dispersion between its class A and class B share price? I don't get it.\n\nSorry, if this is a dumb question.",
        "subreddit": "wallstreetbets",
        "title": "DISCB &amp; DISCA Dispersion",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhq6bo/discb_disca_dispersion/",
        "created": 1617291331.0
    },
    {
        "author": "godnroc147",
        "created_utc": 1617271925,
        "id": "mhs646",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Absolutely amazing waking up and seeing this. Shout out to the guy that got Cramer to respond to this, it really made my morning!",
        "url": "https://i.redd.it/bj1zed39ejq61.jpg",
        "created": 1617300725.0
    },
    {
        "author": "bauer5x",
        "created_utc": 1617275722,
        "id": "mht28j",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "This latest installment of why $DGX is **still** the safest double up+ opportunity in the market will likely be my last update before earnings this month (baring eventful news). A lot of this will be regurgitation from Parts 1 and 2 because, well, most of what was discussed has been coming to fruition:\n\n[$DGX DD Pt. 1](https://www.reddit.com/r/wallstreetbets/comments/lktkjr/dgx_quest_diagnostics_is_free_tendies/)\n\n[$DGX DD Pt. 2 - Electric Boogaloo](https://www.reddit.com/r/wallstreetbets/comments/m2dtqk/dgx_quest_diagnostics_pt_2_electric_boogaloo/)\n\n**TL;DR again** \\- $DGX is now over 8% higher since DD Pt. 2 earlier this month. The stock and associated calls are still trading at very reasonable amounts, continuing to make $DGX the safest double up+ play in the market. **During their Investor Day earlier in March, they doubled both LT Revenue and EPS CAGR guidance. They also confirmed they will be repurchasing $900 MILLION in shares in the FIRST HALF of this year. This will reduce their float by over 5%.** That is material. Now consider 90% of float is owned by institutions. Then add in all EPS guidance given for Q1 and Q2 does NOT factor in repurchases. Blah blah blah ROCKETS.\n\n**Positions** \\- I've given my positions every single time, yet some smucks demanded a screenshot. Why how much $ I have in these positions matters is beyond me. Either I tickled your balls enough during the DDs to invest or I didn't. Anyway, here's a **consolidated** view (100% options), which is drastically understated ($10k+ both gains and total value) because Ally's platform has become unreliable hot garbage:\n\nhttps://preview.redd.it/5gb2taxvojq61.jpg?width=3480&amp;format=pjpg&amp;auto=webp&amp;s=eb95029912abbf651f90edff2079c88361902d4b\n\nOpen: May 21 $125, $130, $135. Aug 20 $120, $125, $130, $140, $145, $150, $160\n\nAs previously mentioned, I also have another $50k stock and a small amount of options in my other account with TD. I will be moving all of my holdings to TD eventually because Ally has become completely broken over the past year and their customer service is non existent. **Just a PSA to AVOID ALLY.**\n\n**The new stuff:**\n\n* Most important - March Investor Day LT Revenue and Earnings CAGR increase and MASSIVE share repurchase timing: [**https://finance.yahoo.com/news/quest-diagnostics-updates-strategic-growth-114500393.html**](https://finance.yahoo.com/news/quest-diagnostics-updates-strategic-growth-114500393.html)\n   * This improved LT outlook has yet to be reflected in any new \"analyst\" price targets\n* Acquired Mercy's outreach lab services. Like I said, they will be using their piles of $$$ to make acquisitions. Especially as smaller labs run out of runway as the pandemic slows down. [https://finance.yahoo.com/news/quest-diagnostics-mercy-broaden-access-140700481.html](https://finance.yahoo.com/news/quest-diagnostics-mercy-broaden-access-140700481.html)\n* Struck deal with Zora Biosciences' to further efforts to enhance direct to consumer self testing offerings. A key growth focus for them is self testing of all kinds in the future:  [https://finance.yahoo.com/news/zora-biosciences-licenses-ceramide-technology-130400471.html](https://finance.yahoo.com/news/zora-biosciences-licenses-ceramide-technology-130400471.html)\n   * [https://www.bloomberg.com/news/articles/2021-03-11/quest-sees-direct-to-consumer-testing-taking-off-post-pandemic](https://www.bloomberg.com/news/articles/2021-03-11/quest-sees-direct-to-consumer-testing-taking-off-post-pandemic)\n* As previously noted in earlier DDs, analysts were drastically overestimating the Q1 drop off in COVID testing expected. Public data shows daily testing remains absurdly high. In fact, the lowest testing day so far in Q1 is still higher than the highest day from May-Oct 2020. The overall Q1 daily average remains over DOUBLE that period as well. Heck, even Quest's own press release indicates COVID testing remains absurdly high through March (Q1) for them specifically: [https://newsroom.questdiagnostics.com/COVIDTestingUpdates](https://newsroom.questdiagnostics.com/COVIDTestingUpdates)\n* On top of the $50billion in stimulus, $DGX will also be a primary provider of testing services upon school re-openings: [https://www.rockefellerfoundation.org/wp-content/uploads/2021/03/K-12-NTAP.pdf](https://www.rockefellerfoundation.org/wp-content/uploads/2021/03/K-12-NTAP.pdf)\n\n**Some important stuff from the previous DDs because God knows you still didn't click the links above:**\n\n* Based on management's own conservative EPS forecasts (**excl repurchases**), a PE of 10 at mid year results in a share price of $144. This is the absolute floor target. They also announced unprecedented $2b in share repurchases for 2021, meaning they can repurchase over 16m shares at current levels. Their float is 133m shares, **BUT roughly 90% of that is owned by INSTITUIONS, leaving LESS THAN 16m** ***available*** **to public.** Assuming institutions continue to hold the majority of their shares (they will. it's a safe dividend stock), this stock will rocket by end of year.\n   * I have always expected a Q1 diluted EPS &gt; 4. I am currently projecting 4.2, which results in a TTM EPS of 14. Further, I anticipate roughly $3 EPS as the Q2 floor, resulting in a TTM EPS post Q2 of 15.63.\n   * This results in an EPS 20% above the high amount given in guidance, which again, was conservative and didn't account for share repurchases\n\nThe reason this stock constantly runs up into earnings and then ticks lower despite large beats is solely due to their base testing lagging behind typical performance due to COVID. The market is acting as if the COVID faucet will just get shut off in the snap of a finger (soon) and then the base testing will take time to return. Does this sound right to you? **This line of thinking is laughably absurd and naïve.** Reasons:\n\n* After a year of this shit, there is a massive backlog of people/procedures that will be completed after more of the pop is vaccinated. We haven't even seen a DGX Q performance with strong base testing AND COVID $$$ yet. Q1 of 2021 will be the first. Book it.\n* **Political climate / stimulus** \\- I'm sure you all saw the CDC is now \"recommending\" double masking. Hell, I've passed out four times writing this diatribe due to the 6 masks I'm wearing. Why does this matter? For every bit a person feels the previous admin downplayed COVID, the new admin is going 100% the opposite direction. Considering the US is going to continue to pump trillions into the economy, you can bet your ass all testing companies will benefit. There will definitely be huge grants/subsidies for enhanced serology procedures and research....and of course in analyzing COVID further. These testing companies have so much COVID data that will continue to be poured over as the pandemic lessens. You can also bet there will be an increased $ focus on scanning/checking for new viruses in the near future.\n* **$$$$$$$** \\- Do you think DGX is just going to light the enormous $$$ they've made over the past 9 months and will continue to make for 2021 on fire? Because that's what the current stock price/growth reflects. When in reality and in addition to the buybacks, they will be targeting acquisitions and investing heavily in serology capabilities/analysis and self testing expansion.\n\n**Price Expectations by EOY:**\n\n* Worst case - $150. Yea, I'm serious. Baring a market meltdown driven by Biden's tax policy, this baby is a lock.\n* Best case - $200\n\n**Important Dates:**\n\n* Ex-Dividend date this FRIDAY 4/2\n* Q1 Earnings 4/22\n\n**Disclaimer:** I'm a rando on a message board, yada yada yada, not investment advice. Ally SUCKS as a brokerage. Use someone else. Long live GME.",
        "subreddit": "wallstreetbets",
        "title": "$DGX Quest Diagnostics Pt. 3 - Leading a Redditor to Tendies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mht28j/dgx_quest_diagnostics_pt_3_leading_a_redditor_to/",
        "created": 1617304522.0
    },
    {
        "author": "Chasetp06",
        "created_utc": 1617262624,
        "id": "mhq70j",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Hong Kong brokers Margin called? What is your thoughts on this and the accuracy? OP verified it many times on r/GME",
        "url": "https://www.reddit.com/gallery/mhq70j",
        "created": 1617291424.0
    },
    {
        "author": "SentenceEquivalent51",
        "created_utc": 1617264301,
        "id": "mhqk5g",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "HITIF 178% yoy growth grab it b4 it flies!",
        "url": "https://i.redd.it/sh0qavwkriq61.jpg",
        "created": 1617293101.0
    },
    {
        "author": "Burnerpornacc",
        "created_utc": 1617269464,
        "id": "mhrmmk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Mama we made it!",
        "url": "https://i.redd.it/9b67x5mx6jq61.jpg",
        "created": 1617298264.0
    },
    {
        "author": "Muujala",
        "created_utc": 1617268091,
        "id": "mhrcc4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHood",
        "title": "Good Morning Everyone that’s reading this Hope you have a Wonderful day today ★ / For thee people That have Invested In Luokung Technology ( LKCO ) How do you feel about it is this a Good Investment ? I put in quite an amount of Shares",
        "url": "https://i.redd.it/j495ihnu2jq61.jpg",
        "created": 1617296891.0
    },
    {
        "author": "nurelgrc",
        "created_utc": 1617268964,
        "id": "mhriz0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "If we're about to pull the rug from under their feet \\*again\\* it might as well be today, since the theaters are now open\n\nThoughts?",
        "subreddit": "wallstreetbets",
        "title": "Is AMC the GME 2.0 or is it not?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhriz0/is_amc_the_gme_20_or_is_it_not/",
        "created": 1617297764.0
    },
    {
        "author": "SentenceEquivalent51",
        "created_utc": 1617265252,
        "id": "mhqr9r",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "OTC HITIF Cannabis 179% yoy growth news just came out buy it b4 it flies.",
        "url": "https://i.redd.it/vrrby2reuiq61.jpg",
        "created": 1617294052.0
    },
    {
        "author": "Victorinox2",
        "created_utc": 1617272729,
        "id": "mhscnm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Am I doing it right like a true retard?",
        "url": "https://i.redd.it/5vkbif4ngjq61.jpg",
        "created": 1617301529.0
    }
]