[
    {
        "author": "r4mpy",
        "created_utc": 1635696117,
        "id": "qjsjdt",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "It is that time of the quarter again, where companies churn out their  quarterly earnings, whilst Lil Joey throws his rent money haphazardly at  companies he thinks will perform, like the degenerate he is. The  adrenaline from playing earnings feeds his life force, as he eyeballs  his monitor refreshing NVDA's IR page hoping for that green candle to  dildo up his ass for the sweet sweet pleasure of tendies.\n\nUnfortunately,  things never turn out right for Lil Joey, the stock meets everyone's  already sky high expectations, and somehow tanks 3%! Joey is sad. It's  okay there's always another company's earnings right?\n\nDon't  be Lil Joey. Be better. Don't gambl- Just kidding, we all know you will  want that ERdraneline anyway. Instead, here's some predictions for next  week that a model I've been refining has churned out. It's modeled to  predict post earnings movement as well such that my back tests have  shown 60% precision in predicting stocks that gap up at least 2% post  earnings. It's average return per earnings report is 2.37%.\n\n*Processing img 9my1ozbi6tw71...*\n\nMy predictions for stocks that are likely to be profitable from 1/11/21 to 3/11/21 are:\n\nMCK,  HOLX, AIZ, SMCI, APPS, BCC, ATVI, LGIH, DD, LAMR, RVLV, RPD,  SUPN, BLKB, CDAY, ALL, EQX, ATH, PING, MET, EQIX, HMN, SMG, CRTO,  PTC, LBTYA, ONEM, TXG, EVRI.\n\nNote  that this model has not yet been tested on live earnings and past  performance does not guarantee future returns. Also I am smooth brained like most of you and this is obviously for entertainment and is not financial advice. I'll be YOLOing some monies into some of these and will update at probably the end of the week.",
        "subreddit": "wallstreetbets",
        "title": "Tis' the (earnings) season (and some predictions)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qjsjdt/tis_the_earnings_season_and_some_predictions/",
        "created": 1635724917.0
    },
    {
        "author": "r4mpy",
        "created_utc": 1635695850,
        "id": "qjsfnj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "It is that time of the quarter again, where companies churn out their quarterly earnings, whilst Lil Joey throws his rent money haphazardly at companies he thinks will perform, like the degenerate he is. The adrenaline from playing earnings feeds his life force, as he eyeballs his monitor refreshing NVDA's IR page hoping for that green candle to dildo up his ass for the sweet sweet pleasure of tendies. \n\nUnfortunately, things never turn out right for Lil Joey, the stock meets everyone's already sky high expectations, and somehow tanks 3%! Joey is sad. It's okay there's always another company's earnings right?\n\nDon't be Lil Joey. Be better. Don't gambl- Just kidding, we all know you will want that ERdraneline anyway. Instead, here's some predictions for next week that a model I've been refining has churned out. It's modeled to predict post earnings movement as well such that my back tests have shown 60% precision in predicting stocks that gap up at least 2% post earnings. It's average return per earnings report is 2.37%. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/ku7drgnn5tw71.png?width=638&amp;format=png&amp;auto=webp&amp;s=871a6e553e8d4f47b604acf08f50b35bed0d16e1\n\nMy predictions for 1/11/21 to 3/11/21 are:\n\nMCK, HOLX, AIZ, SMCI, VECO, APPS, BCC, ATVI, LGIH, DD, LAMR, RVLV, RPD, SUPN, BLKB, CDAY, ALL, BNFT, EQX, ATH, PING, MET, EQIX, HMN, SMG, CRTO, PTC, LBTYA, ONEM, TXG, AUTL, CUTR, EVRI\n\nNote that this model has not yet been tested on live earnings and past performance does not guarantee future returns. Also I am smooth brained like most of you are and this is obviously for entertainment and is not financial advice. I'll be YOLOing some of my money into some of these and will update at probably the end of the week.",
        "subreddit": "wallstreetbets",
        "title": "Tis' the (earnings) season! (and my predictions)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qjsfnj/tis_the_earnings_season_and_my_predictions/",
        "created": 1635724650.0
    },
    {
        "author": "CapableScholar16",
        "created_utc": 1633476412,
        "id": "q28a90",
        "num_comments": 657,
        "num_crossposts": 0,
        "selftext": "Donald Trump tweets, Elon Musk Papa Elon TSLA, Stonks go up, No GME/AMC, Real Wall Street professionals dropping insider tips, PYPL, SHOP, SQ, JPow printers go brrrr, and more.\n\nI am willing to give up 50% of my portfolio for me to experience 2020 again. Including March. Even without the ability to trade, I just want my news feed to replicate March 2020 until December 2020. Of course this should exclude people dying from Covid. I am talking about the chaosity of it. Anyone else like me?",
        "subreddit": "wallstreetbets",
        "title": "Does anyone else miss 2020 or is it just me?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q28a90/does_anyone_else_miss_2020_or_is_it_just_me/",
        "created": 1633505212.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1633524299,
        "id": "q2jolj",
        "num_comments": 396,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "In case you aren’t aware, starting next year. If you transact $600 or more, your payment processor (Bank, PayPal, Venmo, Exchange) will be required to report it to the IRS. This is gonna hurt $EBAY and $ETSY because they are mostly small businesses. Heads up and prepare if you need to.",
        "url": "https://www.reddit.com/gallery/q2jolj",
        "created": 1633553099.0
    },
    {
        "author": "Curious-Interest-734",
        "created_utc": 1633466608,
        "id": "q255e0",
        "num_comments": 327,
        "num_crossposts": 0,
        "selftext": "So many ppl lost money in all the tickers, cause we retails are divided by the hedgies, look what happen with GME and AMC.  We won because we are focus. I have cashed out all my earnings to all in on PSFE because the exact same scenario is happening. I all in in GME at 30 and it rose to 300. I've put my capital in AMC at 3 and it rose to 70. PSFE is the next GME, igaming revenue up 70%, transactional volume up 41%, no pipe is selling but stocks tank to 7 from 19.\n\nRecently I bought in affirm at 60, when it got shorted down from 100, good news happened and it rose 100%. We all want the next AMC and I am quite certain PSFE is the next. It monopolize Canada's igaming market by having a 100% share and 75% share in the US. All of the big betting players are a client of PSFE.\n\nNone of the pipe has sold here, bill foley with 30m shares, dan loeb with 41m shares. Blackrock just bought in at 8.3m shares at $12. This will explode soon. Shorts are trapped with &gt;10% float just like AMC was when it was at $8.\n\nPaysafe’s share price with average of sector peer multiples:\n\nEV/EBITDA ratio : $122.09EV/Rev ratio : $83.91EV/FCF ratio : $87.86Average: $97.95\n\nMore realistic price after removing all outliers in each category which put PSFE share price over $100\n\nEV/EBITDA ratio : $50.75EV/Rev ratio : $44.64EV/FCF ratio : $44.18Average : $46.52\n\n\\- Paysafe Powers Online Payments for Montana Lottery’s Sportsbook\n\n\\- Paysafe Streamlines Payments for Interactive Wagering With Fubo Gaming in US\n\n\\- bunq Partners With Paysafe to Enable Cash Deposits for Digital Banking\n\n\\- Paysafe Expands Betfred USA Sports Partnership Through Income Access Deal\n\n\\- Paysafe Completes Acquisition of PagoEfectivo\n\n\\- Paysafe to Acquire viafintech\n\n\\- Paysafe to Acquire SafetyPay\n\nPaysafe acquire these companies in cash unlike Square and Paypal with stocks. These means the shareholders and board think its undervalued. Many of the buyers are stucked in at $12. I am in at $9 with 35k shares. Affirm has 2x since. I bought AMC at $12 sit to $5 and rose to $60.\n\nThis is not financial advice, do your own DD. But this just might be the next netflix. :)",
        "subreddit": "wallstreetbets",
        "title": "Paysafe 10x from here.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q255e0/paysafe_10x_from_here/",
        "created": 1633495408.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1633214683,
        "id": "q056if",
        "num_comments": 182,
        "num_crossposts": 0,
        "selftext": "I realize there will be a lot of pressure on faang and tech coming up but I'm long term.  However I'm wondering if being long those (faang) I shouldn't make some short term moves to lighten my tech exposure.\n\nThe shares would be long that I'm exiting so taxes aren't much for me, although I'll feel like I'm cheating on my tech names lol.\n\nI do have things like VTI, HD, UNH, medical devices mutual fund (FSMEX), COST, ODFL, TMO, but am about 50% tech names like MSFT GOOGL NVDA AAPL ASML PYPL CRWD SQ etc.\n\nI also am 20% or a little more cash right now.  I was planning on deploying the cash into faangs if we get a significant pull back in those names which I don't feel we have had yet.\n\nI'm mainly wondering if that's a good strategy (buying significant dips in tech mega cap) or if some cash should be deployed into \"reopening\" (although I'm kind of tired of hearing about that! Lol) stocks,\n\nOr deployed into industrials or whatever. \n\nI realize being 50% tech I'm gonna get hit, but I always think of tech rebounding eventually so it doesn't worry me.  I know that long term MSFT AAPL GOOGL NVDA will go up imo.\n\nMy portfolio is already down about 4% for September, but I'm not panicking yet!",
        "subreddit": "stocks",
        "title": "Tech heavy, 20% cash. What to do.",
        "url": "https://www.reddit.com/r/stocks/comments/q056if/tech_heavy_20_cash_what_to_do/",
        "created": 1633243483.0
    },
    {
        "author": "Zrocker04",
        "created_utc": 1633968944,
        "id": "q5ze2f",
        "num_comments": 127,
        "num_crossposts": 0,
        "selftext": "**Think your portfolio can outperform a 1.5 and 7 year old? Then stay tuned lol.**\n\nSo I posted a few weeks ago about letting our children pick their own stocks. Details on how we do it below the portfolios. \n\n**7 Year old portfolio: Moderna, Dcoin (can't spell it out here), SPYG, SPY, Square, Netflix**\n\n**1.5 Year old portfolio: Moderna, SPY, SPYG, Ether (same as above), PayPal, Russell 1000 ETF**\n\nSo far I'm actually impressed with the picks. The SPY/SPYG picks were because we forgot pick and they needed ETFs.\n\nMy girlfriend has a 7 year old boy and we have a 1.5YO daughter. I put together a list of stocks to pick from (like 200-300 to pick from, ETFs and 10+ of each major market sector). We let them pick or play games to pick. The 1.5YO rolls dice most the time lol. We put in $10 every week to whatever they pick. 25% must be in ETFs for some stability. \n\nThey'll have access to the money once they're 18, accounts are still in our names just in case, and we don't expect to cash out enough to increase the capital gains taxes. We'll still likely be the gatekeepers for the money so they don't just blow it on hookers; more for a car, college, travel, etc.",
        "subreddit": "wallstreetbets",
        "title": "Letting children pick stocks: Week 6 update",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q5ze2f/letting_children_pick_stocks_week_6_update/",
        "created": 1633997744.0
    },
    {
        "author": "Zrocker04",
        "created_utc": 1633968574,
        "id": "q5z969",
        "num_comments": 113,
        "num_crossposts": 0,
        "selftext": "**Think your portfolio can outperform a 1.5 and 7 year old? Then stay tuned lol.**\n\nSo I posted a few weeks ago about letting our children pick their own stocks. Details on how we do it below the portfolios. \n\n**7 Year old portfolio: Moderna, Dogecoin, SPYG, SPY, Square, Netflix**\n\n**1.5 Year old portfolio: Moderna, SPY, SPYG, Ethereum, PayPal, Russell 1000 ETF**\n\nSo far I'm actually impressed with the picks. The 1.5YO SPY/SPYG picks were because we forgot to let her roll the dice lol.\n\nMy girlfriend has a 7 year old boy and we have a 1.5YO daughter. I put together a list of stocks to pick from (like 200-300 to pick from, ETFs and 10+ of each major market sector). We let them pick or play games to pick. The 1.5YO rolls dice most the time lol. We put in $10 every week to whatever they pick. 25% must be in ETFs for some stability. \n\nThey'll have access to the money once they're 18, accounts are still in our names just in case, and we don't expect to cash out enough to increase the capital gains taxes. We'll still likely be the gatekeepers for the money so they don't just blow it on hookers; more for a car, college, travel, etc.",
        "subreddit": "stocks",
        "title": "Letting children pick their own stocks: Week 6",
        "url": "https://www.reddit.com/r/stocks/comments/q5z969/letting_children_pick_their_own_stocks_week_6/",
        "created": 1633997374.0
    },
    {
        "author": "Phx-Jay",
        "created_utc": 1633531029,
        "id": "q2lrum",
        "num_comments": 65,
        "num_crossposts": 0,
        "selftext": "Paysafe (PSFE)\n\nHave you Apes been missing the news lately on a stock that is one of us?  Why? Paysafe is a leading supporter of online gaming and the deals recently announced are not priced into the stock.  If anyone should be supporting gambling it is us?\n\nIt’s has a high potential of being bought…\n\n“The Bottom Line\n\nSomeone is going to buy this company.\n\nProcessors are looking for growth and innovation. They’re all focused on Square (NASDAQ:SQ), which has only grown more popular as it has gone into various banking and investment niches.\n\nGambling doesn’t scare the payments industry. Casino contracts are highly prized. Processors don’t hand gamblers money they don’t have. When the gambler is out of money, they reject the transaction. Many casinos have special rules for gambler transactions aimed at keeping them, and the gamblers, out of trouble.\n\nThis means the downside risk of PaySafe stock is limited. There remain potential suitors for the company. The most likely is Fidelity National, which has a market cap of nearly $75 billion. But if Foley sees a better bid, he will certainly take it.\n\nThe debt means PaySafe’s enterprise value is fair, not low. But you can buy it here.”\n\nIt now has deals with Fubo, Montana Lottery Sportsbook, and many more on the way…\n6 days ago:\n\n“FuboTV Inc (NYSE: FUBO) is trading higher Thursday after the company's subsidiary, Fubo Gaming, announced a partnership with Paysafe (NYSE: PSFE).\nFubo Sportsbook will plug into Paysafe for credit and debit card payments. It is expected to launch in the fourth quarter.”\n\n2 Days Ago:\n\n“HOUSTON, October 04, 2021--(BUSINESS WIRE)--Paysafe (NYSE: PSFE), a leading specialized payments platform, today announced a new partnership with INTRALOT, a leading global gaming solutions supplier. INTRALOT’s sports-betting platform has integrated with Paysafe to enable the Montana government-operated lottery to provide its online sportsbook patrons with a comprehensive suite of traditional and alternative payment methods via a single API.”\n\nThe third and fourth quarter earnings are going to beat.  There are no supply chain issues with this company and gambling is through the roof.  I don’t YOLO but I’m considering it with this stock.  At only $7 and $5 Billion Market Cap this is one of the best deals.  \n\nMore institutional ownership then ever:\n\n\n“The number of bullish hedge fund positions improved by 9 lately. Paysafe Limited (NYSE:PSFE) was in 50 hedge funds' portfolios at the end of June. The all time high for this statistic was previously 41. This means the bullish number of hedge fund positions in this stock currently sits at its all time high. Our calculations also showed that PSFE isn't among the 30 most popular stocks among hedge funds (click for Q2 rankings).”\n\nGet on the rocket at this price…its not going to zero so very limited risk at this level.  Revenue increasing every quarter….just look at the charts.  I wouldn’t be surprised if they announce getting into BNPL as well since that is the hot industry.\n\nPositions:\n\n3000 Shares\n11/19/21 8C",
        "subreddit": "wallstreetbets",
        "title": "PSFE….the next SQ / PayPal to the moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q2lrum/psfethe_next_sq_paypal_to_the_moon/",
        "created": 1633559829.0
    },
    {
        "author": "Jerome_BRRR_Powell",
        "created_utc": 1633663461,
        "id": "q3pc8x",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Gentlemen, I hope you have been making the most of the opportunity my dear friend, Moscow Mitch has provided you. ie I **HOPE YOU BOUGHT THE DIP F%\\*%\\*#\\*@**\n\nWhile I still have your attention, I would like to introduce you to a company that me and some fellows have been bag holding (in the red) for a while.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3jmjge40a5s71.png?width=1379&amp;format=png&amp;auto=webp&amp;s=cc941bbcf643c78cefe803ee9ce4174b8f8e5889\n\n**Payoneer, the Paypal for** **~~Shithole~~** **Developing Countries**\n\n**Payoneer** is Paypal for B2B global commerce, particularly outside North American and Europe. The company provides B2B services for millions of SMB and enterprises around the world\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qn847nz0a5s71.png?width=1759&amp;format=png&amp;auto=webp&amp;s=d05be8973c4bfefe00396c250fb92fe123c5f0ae\n\nThe ideal customer is a small but growing SMB doing business all over the world which needs currency, compliance and business services. Payoneer is an obvious candidate to handles these needs given its global network.\n\n· Payoneer offers vendors the ability to move money with a U.S. bank account and pay suppliers, without having to deal with too many banking hurdles or red tape.\n\n· A lot of freelancers on Upwork.com use Payoneer because many of them live in countries that Upwork.com can't wire money to.\n\n· Once vendors receive funds into their Payoneer account they can either withdraw the cash using their Payoneer provided Master Card or do a direct bank transfer from Payoneer to their local bank. Usually funds arrive within 1-2 business days.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cjzym5w1a5s71.png?width=1764&amp;format=png&amp;auto=webp&amp;s=e77f88b654fe44aca54902b8a4f1d18bb7c519b9\n\nSo, it is basically a bank that includes an accountant to help meet a business’ needs. The one product or feature that is missing is digital coins.\n\nSay a consumer wants to rent an airbnb. They use a credit card (or other payment method) to pay airbnb, a payment gateway facilitates payment acceptance. The payment is then processed and Airbnb ends up with the money from the transaction. Airbnb has now gathered cash through its acquirers (e.g., Adyen, ACI). Airbnb now needs to distribute funds to its SMB sellers. Airbnb uses payoneer to disburse funds to sellers. From this example, you can see Payoneer isn't competing with companies like Adyen or other acquirers/ processors, even though they are processing payments.\n\nPayoneer signs up individual sellers, which allows the sellers to use payoneer across platforms (e.g., facebook marketplace and amazon). Hyperwallet (owned by PayPal) is one of their competitors, but Hyperwallet operates completely differently, they sign up users via the platform, but this means you can't use hyperwallet for your business on both amazon and fb marketplace without going through the onboarding process again. Given the trend towards SMB sellers operating across multiple marketplaces, this is a huge benefit for payoneer, and makes PayPal's offering a lot less competitive. It also means Payoneer owns the seller relationship in a way that PayPal doesn't do as effectively, and makes it easier for them to package other offerings (e.g., working capital). These other offerings provide a two-fold benefit - their customer relationships become stronger, so revenue is seen as more recurring and investors will pay a higher multiple; and they'll make more money per customer.\n\nMy view is that Payoneer should see an S-type growth curve, where they'll hit a critical mass of users and see exponential growth, like cashapp, or venmo. Their investor presentation projects 25% revenue growth over the next couple years, I think this is super conservative, especially considering that 25% growth rate doesn't account for the two travel related marketplaces that got screwed by covid. Once they hit that critical mass of users, they'll pop off, sales &amp; marketing expenses will drop, and they'll become profitable.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5xuonwi2a5s71.png?width=1556&amp;format=png&amp;auto=webp&amp;s=b57e5a829bbcb5d58f51cbdc2e426ceca0ccd2a3\n\nThe company’s focus on investing for future services is actually what gets me most excited as it may ward off near-term investor interest and improves its competitive position. It’s also a sign of a mature management team. The opportunity to provide additional services such as working capital, compliance and tax services seems like an obvious strategic move to drive growth. Specifically, working capital is far and away the most important service and something SMBs are desperate for.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zi2sl613a5s71.png?width=1664&amp;format=png&amp;auto=webp&amp;s=e959a0115d4cbb201b531f77ae5276a31026a7d1\n\nWho are their customers and where are they know? 5 million businesses in 190 countries. Customers include Amazon, Wish, Lazada (owned by Alibaba) Shopee, and Ebay. Weird right, they work with Ebay given Paypal does too. This is because they work with countries and specific clients that Paypal not accept into their platform. Investors need to understand that sometimes people have to use other platforms because they the Paypal’s or banks are NOT willing to take the risk. Sure the risk is probably higher but the amount of people that need access to capital or payment process is high when many banks in many countries do not approve people for such type of access.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/r1kinxk3a5s71.png?width=1631&amp;format=png&amp;auto=webp&amp;s=74cd5a7bdb3d3934ce730e1dd9aa9204ff72b259\n\n# Payoneer vs PayPal\n\nThe growth of Payoneer’s global network included a move into India in April 2016, following a partnership with Pune-based IndusInd Bank and expressions of interest in its services from more than 10,000 freelancers and small businesses across the country. \n\n2018 PayPal study suggest that India’s freelancers represent around one quarter of the world’s gig workforce.\n\n**In August 2019, Payoneer announced a year-on-year increase of 400% in its customer base and a threefold increase in payment volumes processed in India.**\n\n*“PayPal says to shut domestic payments business in India” \\~ Reuters*\n\nNEW DELHI (Reuters) - PayPal Holdings Inc will wind down its domestic payments business in India from April 1,2021 the company said in a statement on Friday.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gcipi9b4a5s71.png?width=1743&amp;format=png&amp;auto=webp&amp;s=c3b20d766db9f0b8302c16582755758489bc479e\n\nB2B global marketplace. The attractiveness of FinTech can be summarized in a few words, namely, “scale” and “network effects”. From the metrics Payoneer shared, it looks like they’re benefitting from these dynamics. Analysts estimate the global B2B market at tens of trillions $ and cross-border payments at $300bn. Obviously the pandemic only accelerated these trends. (From the presentation, it looks like company B2B AR/AP volume more than doubled at 140% in 2020 although the CFO later cited a 53% increase in volumes so not sure exactly how to interpret that.)\n\nVolume and customer growth drives revenues. Volumes grew over 53% in 2020 (67% adjusted for the pandemic) and are expected to grow at 44% and 33% in 2021 and 2022, respectively, which translates into 25% annual revenue growth per year for the next two years.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ghmjbjt4a5s71.png?width=1721&amp;format=png&amp;auto=webp&amp;s=4c9dcfa310f5e6a4bc90b66fbf9fc8b018377aa7\n\nThe benefits of network effects cannot be overstated as Paypal has proven. As a company acquires more customers, the value of its network increases. Payoneer’s business model leverages this same dynamic. Moreover, its network would be very difficult to replicate. The company’s global platform includes over 80 banks and clearing partners in over 100 countries. The company also provides customers data about its transactions, which I believe will be increasingly useful and sticky.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/z9x3x8b5a5s71.png?width=1797&amp;format=png&amp;auto=webp&amp;s=caa49b84156468b94a9f50b9a23ffb208340eba3\n\nWhat do I think the future holds for Payoneer? I actually think there are several exits for this company.\n\n**Growth:**\n\nNote that Payoneer currently doesn’t do B2C, hence it may be quite common for retail to never even have heard of it, unless they are a business or in the gig economy. That is one of the problems for the stock, no one has heard of it (yet) because it works quietly behind the scenes. Given enough funding, who knows, Payoneer may well expand to B2C. Alibaba initially started as B2B as well but has since expanded to B2C (Taobao).\n\nWe just need Payoneer to be 5% of PayPal (ie. $15B market cap) in order for stock price to be in the $30-$40 range. ($6B market cap corresponds to around $13-$15 stock price.) \n\n&amp;#x200B;\n\nhttps://preview.redd.it/95silwp5a5s71.png?width=1748&amp;format=png&amp;auto=webp&amp;s=f10a138995c52367baa00ed4a10e9287c5da04ee\n\n**Acquisition:**  \n Large international payments processer buys them. Could be Paypal, Square, Stripe, First Data, etc. consolidation WILL happen in this space and I think short-term Payoneer will acquire some companies and then be sold to a bigger company. Think of this as how banks in the USA were allowed to merge in 1995 given the law that passed. Before you had 100,000 banks then it was 50,000 banks, then 10,000 banks and now like 5,000 banks but the top 10 banks make up a large % of the business/volume.\n\nWildcard: CRM business buys them. What many people do not realize is that CRM’s have been changing the game. First it was to help you sell with marketing tools, then it is to improve communication within the team, then it will be storage, and legal transactions then it will be financial transaction. They are literally going to control the beginning to the end of the customer relationship and all of that data they possess is very valuable to help their customers grow.\n\n&amp;#x200B;\n\nThis is not financial advice, i am not a financial advisor. I have a long position with the warrants that i purchased in February and are therefore in the red.",
        "subreddit": "wallstreetbets",
        "title": "$PAYO Baby Momma, so she can feed the kids",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q3pc8x/payo_baby_momma_so_she_can_feed_the_kids/",
        "created": 1633692261.0
    },
    {
        "author": "DDistrict",
        "created_utc": 1633464342,
        "id": "q24dvm",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hi All, \n\nCIBC Added 5 new CDR's today (PayPal, Facebook, Disney, Microsoft, Visa). \n\nDoes anyone know how the following situations would impact a CDR? \n\nIf you are holding Facebook CDRs for example and the company gets broken up, how would that affect the CDR price? Would a CDR holder reap any of the benefits (eg. X amount of shares of Instagram)? \n\nWhat about stock splits? Would the CDR split at the same rate as the under laying security? \n\nTIA",
        "subreddit": "CanadianInvestor",
        "title": "CIBC CDR's 5 Newly Added US Stocks + Questions",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/q24dvm/cibc_cdrs_5_newly_added_us_stocks_questions/",
        "created": 1633493142.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1633515750,
        "id": "q2hk93",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "PayPal leads teens in pay now buy later (BNPL) among teens in widely regarded survey",
        "url": "https://finance.yahoo.com/news/paypal-buy-now-pay-later-us-teens-191218772.html",
        "created": 1633544550.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1633964172,
        "id": "q5xn5h",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\nhttps://preview.redd.it/87ovkqet4us71.png?width=1122&amp;format=png&amp;auto=webp&amp;s=bf75d024b262c9d963cb26eb0de46b08916e3ca6\n\n**5-Year Recap**\n\n* Market Cap has increased by 710%\n* Total Revenue has increased by 620%\n* Gross Margin hs decreased by 39%\n* EPS Dilution has increased by 800%\n* P/S Ratio has increased by 30%\n* P/E Ratio N/A\n* P/B Ratio has increased by 133%\n* Total Liabilities have increased by 691%\n* Dividend Yield: 0%\n\n&amp;#x200B;\n\n**Behind the Company**\n\nSquare is an e-commerce platform for small and large businesses. Square makes it easier for customers to pay for products and services. Square’s biggest product currently is a card reader that enables businesses to offer credit card payments instead of solely using cash. Square owns the popular Cash App which allows users to send payments, receive payments, invest, hold, and buy/sell bitcoin.\n\n**Industry Overview**\n\nThe buy-now-pay-later (BNPL) industry has seen some major growth this past year. There are advantages to using BNPL over credit cards. With BNPL technology, consumers don’t have to worry about their credit scores. This can be seen as both an advantage and disadvantage. If you have a low credit score, you can use Square to avoid taking more hits on your credit. However, you can’t build up your credit score using Square. \n\n**News Timeline**\n\nJuly 20, 2021\\[Source\\]([https://squareup.com/us/en/press/introducing-square-banking](https://squareup.com/us/en/press/introducing-square-banking))\n\nAugust 1, 2021\\[Source\\](https://squareup.com/us/en/press/square-announces-plans-to-acquire-afterpay)\n\n* Square announces plan to acquire Afterpay\n   * Aimed towards a younger generation\n\nSeptember 20, 2021\\[Source\\]([https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france](https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france))\n\n* Square plans to enter France market\n\nSeptemeber 28, 2021\\[Source\\]([https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html](https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html))\n\n* Square partners with TikTok\n\n\\[Source\\]([https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187](https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187))\n\n* Mastercard announces plan to enter BNPL market\n\n**Competitors**\n\n* PayPal\n* Fiserv\n* Global Payments\n* Affirm Holdings\n* Shopify \n* Clover\n\n**Technical Analysis**\n\n[https://www.tradingview.com/chart/SQ/SdTObmDK-Square-SQ-Descending-Channel/](https://www.tradingview.com/chart/SQ/SdTObmDK-Square-SQ-Descending-Channel/)\n\n**Bullish Case**\n\n* BNPL industry has global potential to grow \n* Small business lending is increasing\n* Invested heavily in Bitcoin \n\n**Bearish Case**\n\n* Strong competition in the BNPL industry\n* Speculation of future revenue reliant on Bitcoin\n* Invested heavily in Bitcoin\n\n**Management** \n\nSquare CEO Jack Dorsey is somewhat a prodigy. Having co-founded Twitter back in 06’, Jack now. Dorsey is one of the most successful self-taught coders in the world. Not many CEOs can say they’ve helped build their companies' platforms and helped manage them. \n\n**Conclusion**\n\nI am concerned about Mastercard’s announcement to enter the BNPL market. I believe that other credit cards and banks will follow suit. Up until now, banks have been slow to respond and are sustaining huge losses because of it. The BNPL market is pretty saturated as it is. The BNPL market as a whole is very expensive (coming from a small investor's POV). Square’s P/B ratio is currently at 40, which indicates that the company might be overvalued. On top of that, Squares Total liabilities, D/E ratio, and Long Term Debt have all seen a sharp increase. Square is aggressively trying to expand by financing its debt. This alone makes me hesitant to invest. I am concerned with Square’s ties to bitcoin. I labeled this as both a bullish and bearish case. Square invested a good chunk of money in bitcoin. That means their reliant on bitcoins performance. If bitcoin goes up, they go up. If bitcoin goes down, they do down. There is a lot of news and government intervention surrounding bitcoin which can either be positive or negative. I do believe the BNPL industry is a growing market, but with more competition entering the market, it will be hard for Square to capture market share. \n\n*\\*\\*This is not investment advice. I am not an expert. Do your own research\\*\\**",
        "subreddit": "smallstreetbets",
        "title": "Square inc (SQ) Due Diligence",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/q5xn5h/square_inc_sq_due_diligence/",
        "created": 1633992972.0
    },
    {
        "author": "anythinggoesherename",
        "created_utc": 1633155054,
        "id": "pzpntz",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Thoughts on HMBL? They launched HUMBL Tickets™ which is a platform to provide consumers with direct access to lower-cost, premium seating options across verticals such as pro sports, college sports, concerts, theater, festivals, and more\nThey also allow the sale listing and purchase of NFTs\nThey’re doing a lot more and still getting shorted like crazy. I believe they have the potential to rival PayPal but it’s just not getting steam. What say y’all?",
        "subreddit": "wallstreetbets",
        "title": "Humbl Inc",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pzpntz/humbl_inc/",
        "created": 1633183854.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1634045695,
        "id": "q6mbk4",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\n[5-Year Recap](https://preview.redd.it/gd6lq7iru0t71.png?width=1122&amp;format=png&amp;auto=webp&amp;s=029563f3871fd847d8c7822cec3ae29094e10ec2)\n\n* Market Cap has increased by 710%\n* Total Revenue has increased by 620%\n* Gross Margin hs decreased by 39%\n* EPS Dilution has increased by 800%\n* P/S Ratio has increased by 30%\n* P/E Ratio N/A\n* P/B Ratio has increased by 133%\n* Total Liabilities have increased by 691%\n* Dividend Yield: 0%\n\n**Behind the Company**\n\nSquare is an e-commerce platform for small and large businesses. Square makes it easier for customers to pay for products and services. Square’s biggest product currently is a card reader that enables businesses to offer credit card payments instead of solely using cash. Square owns the popular Cash App which allows users to send payments, receive payments, invest, and hold.\n\n**Industry Overview**\n\nThe buy-now-pay-later (BNPL) industry has seen some major growth this past year. There are advantages to using BNPL over credit cards. With BNPL technology, consumers don’t have to worry about their credit scores. This can be seen as both an advantage and disadvantage. If you have a low credit score, you can use Square to avoid taking more hits on your credit. However, you can’t build up your credit score using Square. \n\n**News Timeline**\n\nJuly 20, 2021\n\n\\[Source\\]([https://squareup.com/us/en/press/introducing-square-banking](https://squareup.com/us/en/press/introducing-square-banking))\n\nAugust 1, 2021\n\n\\[Source\\](https://squareup.com/us/en/press/square-announces-plans-to-acquire-afterpay)\n\n* Square announces plan to acquire Afterpay\n   * Aimed towards a younger generation\n\nSeptember 20, 2021\n\n\\[Source\\]([https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france](https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france))\n\n* Square plans to enter France market\n\nSeptemeber 28, 2021\n\n\\[Source\\]([https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html](https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html))\n\n* Square partners with TikTok\n\n\\[Source\\]([https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187](https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187))\n\n* Mastercard announces plan to enter BNPL market\n\n**Competitors**\n\n* PayPal\n* Fiserv\n* Global Payments\n* Affirm Holdings\n* Shopify \n* Clover\n\n**Technical Analysis**\n\n**Bullish Case**\n\n* BNPL industry has global potential to grow \n* Small business lending is increasing\n* &amp;#x200B;\n\n**Bearish Case**\n\n* Strong competition in the BNPL industry\n* &amp;#x200B;\n\n**Management** \n\nSquare CEO Jack Dorsey is somewhat a prodigy. Having co-founded Twitter back in 06’, Jack now. Dorsey is one of the most successful self-taught coders in the world. Not many CEOs can say they’ve helped build their companies' platforms and helped manage them. \n\n**Conclusion**\n\nI am concerned about Mastercard’s announcement to enter the BNPL market. I believe that other credit cards and banks will follow suit. Up until now, banks have been slow to respond and are sustaining huge losses because of it. The BNPL market is pretty saturated as it is. The BNPL market as a whole is very expensive (coming from a small investor's POV). Square’s P/B ratio is currently at 40, which indicates that the company might be overvalued. On top of that, Squares Total liabilities, D/E ratio, and Long Term Debt have all seen a sharp increase. Square is aggressively trying to expand by financing its debt. This alone makes me hesitant to invest. I do believe the BNPL industry is a growing market, but with more competition entering the market, it will be hard for Square to capture market share. \n\n*\\*\\*This is not investment advice. I am not an expert. Do your own research\\*\\**",
        "subreddit": "wallstreetbets",
        "title": "Square (SQ) Due Diligence",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q6mbk4/square_sq_due_diligence/",
        "created": 1634074495.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1633963869,
        "id": "q5xjd0",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\nhttps://preview.redd.it/2bqq1cuw3us71.png?width=1122&amp;format=png&amp;auto=webp&amp;s=57fd105af6509015a5ab14c577672023e09d440c\n\n**5-Year Recap**\n\n* Market Cap has increased by 710%\n* Total Revenue has increased by 620%\n* Gross Margin hs decreased by 39%\n* EPS Dilution has increased by 800%\n* P/S Ratio has increased by 30%\n* P/E Ratio N/A\n* P/B Ratio has increased by 133%\n* Total Liabilities have increased by 691%\n* Dividend Yield: 0%\n\n&amp;#x200B;\n\n**Behind the Company**\n\nSquare is an e-commerce platform for small and large businesses. Square makes it easier for customers to pay for products and services. Square’s biggest product currently is a card reader that enables businesses to offer credit card payments instead of solely using cash. Square owns the popular Cash App which allows users to send payments, receive payments, invest, hold, and buy/sell bitcoin.\n\n**Industry Overview**\n\nThe buy-now-pay-later (BNPL) industry has seen some major growth this past year. There are advantages to using BNPL over credit cards. With BNPL technology, consumers don’t have to worry about their credit scores. This can be seen as both an advantage and disadvantage. If you have a low credit score, you can use Square to avoid taking more hits on your credit. However, you can’t build up your credit score using Square. \n\n**News Timeline**\n\nJuly 20, 2021\\[Source\\]([https://squareup.com/us/en/press/introducing-square-banking](https://squareup.com/us/en/press/introducing-square-banking))\n\nAugust 1, 2021\\[Source\\](https://squareup.com/us/en/press/square-announces-plans-to-acquire-afterpay)\n\n* Square announces plan to acquire Afterpay\n   * Aimed towards a younger generation\n\nSeptember 20, 2021\\[Source\\]([https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france](https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france))\n\n* Square plans to enter France market\n\nSeptemeber 28, 2021\\[Source\\]([https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html](https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html))\n\n* Square partners with TikTok\n\n\\[Source\\]([https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187](https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187))\n\n* Mastercard announces plan to enter BNPL market\n\n**Competitors**\n\n* PayPal\n* Fiserv\n* Global Payments\n* Affirm Holdings\n* Shopify \n* Clover\n\n**Technical Analysis**\n\n[https://www.tradingview.com/chart/SQ/SdTObmDK-Square-SQ-Descending-Channel/](https://www.tradingview.com/chart/SQ/SdTObmDK-Square-SQ-Descending-Channel/)\n\n**Bullish Case**\n\n* BNPL industry has global potential to grow \n* Small business lending is increasing\n* Invested heavily in Bitcoin \n\n**Bearish Case**\n\n* Strong competition in the BNPL industry\n* Speculation of future revenue reliant on Bitcoin\n* Invested heavily in Bitcoin\n\n**Management** \n\nSquare CEO Jack Dorsey is somewhat a prodigy. Having co-founded Twitter back in 06’, Jack now. Dorsey is one of the most successful self-taught coders in the world. Not many CEOs can say they’ve helped build their companies' platforms and helped manage them. \n\n**Conclusion**\n\nI am concerned about Mastercard’s announcement to enter the BNPL market. I believe that other credit cards and banks will follow suit. Up until now, banks have been slow to respond and are sustaining huge losses because of it. The BNPL market is pretty saturated as it is. The BNPL market as a whole is very expensive (coming from a small investor's POV). Square’s P/B ratio is currently at 40, which indicates that the company might be overvalued. On top of that, Squares Total liabilities, D/E ratio, and Long Term Debt have all seen a sharp increase. Square is aggressively trying to expand by financing its debt. This alone makes me hesitant to invest. I am concerned with Square’s ties to bitcoin. I labeled this as both a bullish and bearish case. Square invested a good chunk of money in bitcoin. That means their reliant on bitcoins performance. If bitcoin goes up, they go up. If bitcoin goes down, they do down. There is a lot of news and government intervention surrounding bitcoin which can either be positive or negative. I do believe the BNPL industry is a growing market, but with more competition entering the market, it will be hard for Square to capture market share. \n\n*\\*\\*This is not investment advice. I am not an expert. Do your own research\\*\\**",
        "subreddit": "StockMarket",
        "title": "Square inc (SQ) Due Diligence",
        "url": "https://www.reddit.com/r/StockMarket/comments/q5xjd0/square_inc_sq_due_diligence/",
        "created": 1633992669.0
    },
    {
        "author": "Zrocker04",
        "created_utc": 1633968782,
        "id": "q5zbwb",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Think your portfolio can outperform a 1.5 and 7 year old? Then stay tuned lol.**\n\nSo I posted a few weeks ago about letting our children pick their own stocks. Details on how we do it below the portfolios. \n\n**7 Year old portfolio: Moderna, DCOIN (can't type it out here), SPYG, SPY, Square, Netflix**\n\n**1.5 Year old portfolio: Moderna, SPY, SPYG, ETHER (same as above) , PayPal, Russell 1000 ETF**\n\nSo far I'm actually impressed with the picks. The 1.5YO SPY/SPYG picks were because we forgot to let her roll the dice lol.\n\nMy girlfriend has a 7 year old boy and we have a 1.5YO daughter. I put together a list of stocks to pick from (like 200-300 to pick from, ETFs and 10+ of each major market sector). We let them pick or play games to pick. The 1.5YO rolls dice most the time lol. We put in $10 every week to whatever they pick. 25% must be in ETFs for some stability. \n\nThey'll have access to the money once they're 18, accounts are still in our names just in case, and we don't expect to cash out enough to increase the capital gains taxes. We'll still likely be the gatekeepers for the money so they don't just blow it on hookers; more for a car, college, travel, etc.",
        "subreddit": "wallstreetbets",
        "title": "Letting children pick stocks: Week 6 Update",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q5zbwb/letting_children_pick_stocks_week_6_update/",
        "created": 1633997582.0
    },
    {
        "author": "Tomkila",
        "created_utc": 1633364187,
        "id": "q18pbd",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "“Subscription/Recurring Billing Management Market Research Report by Industry, by Deployment, by Payment Mode, by Region - Global Forecast to 2025 - Cumulative Impact of COVID-19”\nTweet this\nThe Global Subscription/Recurring Billing Management Market size was estimated at USD 5,122.88 Million in 2020 and expected to reach USD 5,941.43 Million in 2021, at a Compound Annual Growth Rate (CAGR) 16.02% to reach USD 10,772.14 Million by 2025.\n\nCompetitive Strategic Window:\n\nThe Competitive Strategic Window analyses the competitive landscape in terms of markets, applications, and geographies to help the vendor define an alignment or fit between their capabilities and opportunities for future growth prospects. It describes the optimal or favorable fit for the vendors to adopt successive merger and acquisition strategies, geography expansion, research &amp; development, and new product introduction strategies to execute further business expansion and growth during a forecast period.\n\nFPNV Positioning Matrix:\n\nThe FPNV Positioning Matrix evaluates and categorizes the vendors in the Subscription/Recurring Billing Management Market based on Business Strategy (Business Growth, Industry Coverage, Financial Viability, and Channel Support) and Product Satisfaction (Value for Money, Ease of Use, Product Features, and Customer Support) that aids businesses in better decision making and understanding the competitive landscape.\n\nMarket Share Analysis:\n\nThe Market Share Analysis offers the analysis of vendors considering their contribution to the overall market. It provides the idea of its revenue generation into the overall market compared to other vendors in the space. It provides insights into how vendors are performing in terms of revenue generation and customer base compared to others. Knowing market share offers an idea of the size and competitiveness of the vendors for the base year. It reveals the market characteristics in terms of accumulation, fragmentation, dominance, and amalgamation traits.\n\nThe report provides insights on the following pointers:\n\n1. Market Penetration: Provides comprehensive information on the market offered by the key players\n\n2. Market Development: Provides in-depth information about lucrative emerging markets and analyze penetration across mature segments of the markets\n\n3. Market Diversification: Provides detailed information about new product launches, untapped geographies, recent developments, and investments\n\n4. Competitive Assessment &amp; Intelligence: Provides an exhaustive assessment of market shares, strategies, products, certification, regulatory approvals, patent landscape, and manufacturing capabilities of the leading players\n\n5. Product Development &amp; Innovation: Provides intelligent insights on future technologies, R&amp;D activities, and breakthrough product developments\n\nThe report answers questions such as:\n\n1. What is the market size and forecast of the Global Subscription/Recurring Billing Management Market?\n\n2. What are the inhibiting factors and impact of COVID-19 shaping the Global Subscription/Recurring Billing Management Market during the forecast period?\n\n3. Which are the products/segments/applications/areas to invest in over the forecast period in the Global Subscription/Recurring Billing Management Market?\n\n4. What is the competitive strategic window for opportunities in the Global Subscription/Recurring Billing Management Market?\n\n5. What are the technology trends and regulatory frameworks in the Global Subscription/Recurring Billing Management Market?\n\n6. What is the market share of the leading vendors in the Global Subscription/Recurring Billing Management Market?\n\n7. What modes and strategic moves are considered suitable for entering the Global Subscription/Recurring Billing Management Market?\n\nMarket Dynamics\n\nDrivers\n\nRising Penetration of Electronic Media and Devices Coupled with Advanced Subscription &amp; Billing Software\nGrowing Demand for Integrated Subscription and Billing Platform\nIncreasing Customer Awareness and Subscription Base\nGrowing Adoption of Subscription and Billing Solutions across Various Industries\nRestraints\n\nComplex Customization &amp; ROI Risk for Businesses and Customer Concern Regarding Security\nOpportunities\n\nScalability of SaaS Business Model\nUpgradation of Legacy System and Scalability Associated with SaaS Business Model\nAdoption of Emerging Technologies and the Economic Growth of Countries such as India and China\nThe Need to Systemize Management is Facilitated by Integration of Back-End Systems\nChallenges\n\nLimited Technical Skills and Expertise\nAdvanced Cost Associated with System Transformation\nCompanies Mentioned\n\n2Checkout.com, Inc. by VeriFone Holdings, Inc.\nActivePlatform\nAmazon.com, Inc.\nAria Systems, Inc.\nBluSynergy\nBraintree by PayPal Holdings, Inc.\nCerillion PLC\nCleverbridge AG\nConga\nDXC Technology Company\nFastSpring\nFreshBooks\nLogiSense Corporation\nOracle Corporation\nRecurly, Inc.\nSalesforce.com, Inc.\nSAP SE\nStripe\nTransverse, LLC\nZoho Corporation Pvt. Ltd.\nZuora, Inc.",
        "subreddit": "StockMarket",
        "title": "Insights on the Subscription/Recurring Billing Management Global Market to 2025 - Featuring ActivePlatform, Amazon and FastSpring Among Others - ResearchAndMarkets.com",
        "url": "https://www.reddit.com/r/StockMarket/comments/q18pbd/insights_on_the_subscriptionrecurring_billing/",
        "created": 1633392987.0
    },
    {
        "author": "vanturetrading",
        "created_utc": 1633956254,
        "id": "q5v0qh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good morning everyone, I hope you had a nice and relaxing weekend.\n\n*This list is geared towards day trading. With the momentum watchlist especially, I am typically in and out very quickly, only occasionally longer than a couple minutes, usually faster scalps.* Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management for your account. Feel free to message me if you have any questions.\n\n**Main Watchlist:**\n\nGapping UP:\n\n* BABA\n* MARA\n* AZPN\n* PDD\n* FANG\n* OXY\n* CPE\n* ACY\n* PTGX\n\nGapping DOWN:\n\n* LUV\n* NVDA\n* AMD\n* PYPL\n* TWTR\n* NET\n\n**Momentum Watchlist:**\n\n* FLXN (+70%)\n* ADMS (+70%)\n* EZFL (+20%)\n* BFI (+12%)\n* NNVC (+4%)\n\n**Market Outlook:**\n\nStocks are looking to open lower this morning, albeit somewhat mixed. With the major indices hovering near relevant SMA's, the next few days will be important for the market. Will we see a bounce off these support levels once again, or will we break down? Things are looking bearish to me from a TA standpoint, but we'll see how things look closer to market open. I'll also be watching the mega caps closely, as if they show weakness, the whole market could follow. Growth slowdown remains a concern, as we saw Goldman Sachs cut their U.S. GDP growth forecast for both 2021 and next year. With growth slowdown concerns and supply chain issues, we could be in for quite a ride this (and next) earnings season. \n\nSPY is trading a bit over 436, and could test the SMA(100) at \\~434.81 as support in today's trading. SMA(9) is also relevant at 433.86. If we easily break down through those levels, we could see more red. Regardless, we should see more volatility today. If SPY sees strength, I'll be watching the resistance level around 438. DIA is trading a bit over 347 and could test the SMA(100) as resistance around that level. I'll also be watching price action around the 346 support level. QQQ is trading a bit under 359 and looking bearish this morning. Currently gapping down below the SMA(100) and the SMA(9), it will likely test that 359 level as resistance. If it can't get back up, we could see red over the next few days. Gold and silver are each slightly down this morning, while crude oil is up over 3% and looks to continue its recent strength. Bitcoin is currently trading around 56,400, and we could see more consolidation up at this resistance level. Crypto-related stocks are up in premarket trading, trading in sympathy with Bitcoin. Airlines and cruise stocks are down a bit in premarket. It will be interesting if they hold up over support levels and maintain the new uptrend, or if we see more selling off. Meme stocks have been quiet recently, but it's always worth keeping an eye on them. \n\nRemember to use proper risk management, by making sure you size appropriately for your account and have a plan for every trade you enter (both for taking profits and cutting losses). Happy trading everyone :)",
        "subreddit": "StockMarket",
        "title": "Morning Update for Monday, 10/11/21",
        "url": "https://www.reddit.com/r/StockMarket/comments/q5v0qh/morning_update_for_monday_101121/",
        "created": 1633985054.0
    },
    {
        "author": "vanturetrading",
        "created_utc": 1633956060,
        "id": "q5uyvz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good morning everyone, I hope you had a nice and relaxing weekend.\n\n*This list is geared towards day trading. With the momentum watchlist especially, I am typically in and out very quickly, only occasionally longer than a couple minutes, usually faster scalps.* Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management for your account. Feel free to message me if you have any questions.\n\n**Main Watchlist:**\n\nGapping UP:\n\n* BABA\n* AZPN\n* PDD\n* FANG\n* OXY\n* CPE\n* ACY\n* PTGX\n\nGapping DOWN:\n\n* LUV\n* NVDA\n* AMD\n* PYPL\n* TWTR\n* NET\n\n**Market Outlook:**\n\nStocks are looking to open lower this morning, albeit somewhat mixed. With the major indices hovering near relevant SMA's, the next few days will be important for the market. Will we see a bounce off these support levels once again, or will we break down? Things are looking bearish to me from a TA standpoint, but we'll see how things look closer to market open. I'll also be watching the mega caps closely, as if they show weakness, the whole market could follow. Growth slowdown remains a concern, as we saw Goldman Sachs cut their U.S. GDP growth forecast for both 2021 and next year. With growth slowdown concerns and supply chain issues, we could be in for quite a ride this (and next) earnings season. \n\nSPY is trading a bit over 436, and could test the SMA(100) at \\~434.81 as support in today's trading. SMA(9) is also relevant at 433.86. If we easily break down through those levels, we could see more red. Regardless, we should see more volatility today. If SPY sees strength, I'll be watching the resistance level around 438. DIA is trading a bit over 347 and could test the SMA(100) as resistance around that level. I'll also be watching price action around the 346 support level. QQQ is trading a bit under 359 and looking bearish this morning. Currently gapping down below the SMA(100) and the SMA(9), it will likely test that 359 level as resistance. If it can't get back up, we could see red over the next few days. Gold and silver are each slightly down this morning, while crude oil is up over 3% and looks to continue its recent strength. B\\*\\*coin is currently trading around 56,400, and we could see more consolidation up at this resistance level. Cr\\*\\*to-related stocks are up in premarket trading, trading in sympathy with B\\*\\*coin. Airlines and cruise stocks are down a bit in premarket. It will be interesting if they hold up over support levels and maintain the new uptrend, or if we see more selling off. Meme stocks have been quiet recently, but it's always worth keeping an eye on them. \n\nRemember to use proper risk management, by making sure you size appropriately for your account and have a plan for every trade you enter (both for taking profits and cutting losses). Happy trading everyone :)",
        "subreddit": "stocks",
        "title": "Morning Update for Monday, 10/11/21",
        "url": "https://www.reddit.com/r/stocks/comments/q5uyvz/morning_update_for_monday_101121/",
        "created": 1633984860.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1633963909,
        "id": "q5xjwj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\nSome of you may know me from my educational and due diligence posts at r/DoctorStock. We've been researching Square for the past 2 weeks, these are our compiled findings. \n\nhttps://preview.redd.it/1sp1phm14us71.png?width=1122&amp;format=png&amp;auto=webp&amp;s=2dd82ffe277b3d03d17f5749f1920cfd1fe0e4bf\n\n**5-Year Recap**\n\n* Market Cap has increased by 710%\n* Total Revenue has increased by 620%\n* Gross Margin hs decreased by 39%\n* EPS Dilution has increased by 800%\n* P/S Ratio has increased by 30%\n* P/E Ratio N/A\n* P/B Ratio has increased by 133%\n* Total Liabilities have increased by 691%\n* Dividend Yield: 0%\n\n&amp;#x200B;\n\n**Behind the Company**\n\nSquare is an e-commerce platform for small and large businesses. Square makes it easier for customers to pay for products and services. Square’s biggest product currently is a card reader that enables businesses to offer credit card payments instead of solely using cash. Square owns the popular Cash App which allows users to send payments, receive payments, invest, hold, and buy/sell bitcoin.\n\n**Industry Overview**\n\nThe buy-now-pay-later (BNPL) industry has seen some major growth this past year. There are advantages to using BNPL over credit cards. With BNPL technology, consumers don’t have to worry about their credit scores. This can be seen as both an advantage and disadvantage. If you have a low credit score, you can use Square to avoid taking more hits on your credit. However, you can’t build up your credit score using Square. \n\n**News Timeline**\n\nJuly 20, 2021\\[Source\\]([https://squareup.com/us/en/press/introducing-square-banking](https://squareup.com/us/en/press/introducing-square-banking))\n\nAugust 1, 2021\\[Source\\](https://squareup.com/us/en/press/square-announces-plans-to-acquire-afterpay)\n\n* Square announces plan to acquire Afterpay\n   * Aimed towards a younger generation\n\nSeptember 20, 2021\\[Source\\]([https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france](https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france))\n\n* Square plans to enter France market\n\nSeptemeber 28, 2021\\[Source\\]([https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html](https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html))\n\n* Square partners with TikTok\n\n\\[Source\\]([https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187](https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187))\n\n* Mastercard announces plan to enter BNPL market\n\n**Competitors**\n\n* PayPal\n* Fiserv\n* Global Payments\n* Affirm Holdings\n* Shopify \n* Clover\n\n**Technical Analysis**\n\n[https://www.tradingview.com/chart/SQ/SdTObmDK-Square-SQ-Descending-Channel/](https://www.tradingview.com/chart/SQ/SdTObmDK-Square-SQ-Descending-Channel/)\n\n**Bullish Case**\n\n* BNPL industry has global potential to grow \n* Small business lending is increasing\n* Invested heavily in Bitcoin \n\n**Bearish Case**\n\n* Strong competition in the BNPL industry\n* Speculation of future revenue reliant on Bitcoin\n* Invested heavily in Bitcoin\n\n**Management** \n\nSquare CEO Jack Dorsey is somewhat a prodigy. Having co-founded Twitter back in 06’, Jack now. Dorsey is one of the most successful self-taught coders in the world. Not many CEOs can say they’ve helped build their companies' platforms and helped manage them. \n\n**Conclusion**\n\nI am concerned about Mastercard’s announcement to enter the BNPL market. I believe that other credit cards and banks will follow suit. Up until now, banks have been slow to respond and are sustaining huge losses because of it. The BNPL market is pretty saturated as it is. The BNPL market as a whole is very expensive (coming from a small investor's POV). Square’s P/B ratio is currently at 40, which indicates that the company might be overvalued. On top of that, Squares Total liabilities, D/E ratio, and Long Term Debt have all seen a sharp increase. Square is aggressively trying to expand by financing its debt. This alone makes me hesitant to invest. I am concerned with Square’s ties to bitcoin. I labeled this as both a bullish and bearish case. Square invested a good chunk of money in bitcoin. That means their reliant on bitcoins performance. If bitcoin goes up, they go up. If bitcoin goes down, they do down. There is a lot of news and government intervention surrounding bitcoin which can either be positive or negative. I do believe the BNPL industry is a growing market, but with more competition entering the market, it will be hard for Square to capture market share. \n\n*\\*\\*This is not investment advice. I am not an expert. Do your own research\\*\\**",
        "subreddit": "investing_discussion",
        "title": "Square in (SQ) Due Diligence",
        "url": "https://www.reddit.com/r/investing_discussion/comments/q5xjwj/square_in_sq_due_diligence/",
        "created": 1633992709.0
    }
]