[
    {
        "author": "Radish-Perfect",
        "created_utc": 1619894655,
        "id": "n2ojmq",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "What if I told you that Qualcomm, Intel, Skyworks, Texas Instruments, Samsung, and Analog devices all had something in common in their supply chain? They all buy their testing capital equipment from Cohu. \n\nCohu offers a few different products. All of them are within the market of testing computer chips. Why is this market important? Well on the customer end, imagine if you spent 2500$ on a laptop and the intel chip inside didn't work. You'd return it to BestBuy, who would return it to HP, who would return it to Intel. A long and expensive chain of returns for a nonfunctional product. This issue can also be more than just an inconvenience. What if you bought a self driving tesla and one of the chips in the sensors didn't work? What if a Boeing airbus had some faulty chips in the navigation system? In short, it's very important that the semi manufacturers know that their product is working when they send it out. \n\n**Bullish trends**\n\n1. Semiconductor volume is increasing in the following industries, **mobile phones** (5g needs 2x the chips), **Computing**, **Automotive** (electric and self driving need exponentially more chips than cars of the past), **Cloud computing** (basically a warehouse of semiconductors) **AI** (not sure how this works, but it's going to need computer chips). Here's my main argument: ***Each of those markets is rapidly growing, and at the same time chip volume is rising in each of those markets***. This creates a sort of exponential effect for the semiconductor chain. Not only is there a strong catalyst from increasing volume in existing markets (phones, pcs), but we also see rapidly growing new markets that also have high density. (cloud, auto). This is very bullish for the entire semi supply chain.  But the key feature that benefits testing in particular, is increasing complexity of chips. A more complex chip requires more complex testing, which demands a higher premium. \n2. Semiconductor shortage. We all know demand for computer chips is very high. And supply has just about run out. This means that prices for semiconductors should increase due to scarcity. This is great news for Cohu, as it leaves more margin to charge for testing. If you were ford would you pay a premium on chips in order to produce your vehicles?\n3. Increasing chip complexity, on smaller wafers, demands a higher price for testing. AMAT recently noted on April 6th analyst day that capital intensity (% revenue spent on capital equipment) is returning to the 2000 highs of 16%. This increased capital intensity seems especially true when we consider the global chip shortage. Intel and Nvidia are opening new fabs in the last couple months. These factories are going to require a shit-ton of capital equipment. For example TSMC announced they'll be spending $100 billion over the next 3 years on capital equipment, as their fabs have been running at 100% for months and still can't keep up with demand.\n4. Trend of strong growth. Cohu has shown strong growth in the last year. In Q1 2020, revenue was $138.9 million, and gross margin was 41.7%. Q1 2021 revenue was just reported at $225.1 million, and gross margin was 45.6%. This is annual revenue growth of 62%, and margin growth of 9%. Business outlook in only getting better as the semiconductor shortage worsens, and demand continues to grow across sectors.\n5. Very high accounts receivable. Accounts receivable is up 30% annually to 197 million$. Recurring customers represent 48% of Cohu's revenue, so this is a very strong sign in my opinion. \n\n**Bearish trends**\n\n1. The company is on a huge downturn in the last few trading days due to announcing 42-45% gross margin for Q2 instead of 45%+, like Q1. This is on increased revenue of 234-250 million forecasted for Q2. A decrease in GM on growing revenue is never a great sign. The reason for this change is that much of the forecasted growth is in the automotive segment, which is lower margin than other segments I mentioned in the last section. Essentially the chips in cars aren't as complicated as the chips in PCs or phones, so they are less expensive, and therefore have a lower margin for testing. I will point out that the firm is likely to generate more gross margin dollars next quarter than this quarter, albeit on lower gm %. (.43x240=$103.2 gm, vs this last quarter 225x.456=$102.6gm). \n2. Recent stock offering. Cohu sold 4,950,000 shares at 41$ at the start of march. This diluted the shares available, but raised $202 million for the firm. They used this to pay off debt, and fund future growth. \n3. strong competition. Cohu's main competitors are advantest, and teradyne. These are two large global firms that have significantly more financial resources than Cohu. Cohu does have some advantages over these strong competitors, it's the global leader in Radio frequency power amplifier. RF amplifiers are a key component in mobile phones, and are increasing in volume with the 5g rollout. (more chips per phone, and more complexity) Essentially Cohu is in the dominant position in this growing market. Cohu is also the leader in automotive handling. (handling is a process where chips are moved into the testing device, then sorted based on results).\n\n**Fundamental analysis**\n\nI use a ratio similar to p/e. I use gross margin/market cap. (If I was buying the whole company, I'd want to know how much profit I'm purchasing, I don't like p/e because it can be manipulated by the # of shares issued).\n\nCohu annual gm=$316,000,000. Cohu market cap=$1,925,000,000\n\n$316 million/$1925 million=6.09\n\nThis is a very attractive price/gm ratio. Lets compare it to some other companies ratios. \n\nCohu-6.09\n\naapl-19.12\n\namzn-18\n\nter-11.3\n\nadvantest-7.19\n\nswks-17.9\n\nIf cohu were trading at the same multiplier as it's large cap competitor, Teradyne, the stock price would nearly double.\n\nTaking a look at the balance sheet, Cohu is in a much better position today than 1 year ago. They have $290 million of cash, almost double from a year ago. They also have significantly lower long term debt. \\~$200 million today versus \\~$300 million a year ago. \n\n&amp;#x200B;\n\n**Technical analysis**\n\n[Cohu 1 year chart](https://preview.redd.it/pav84wurgjw61.png?width=1504&amp;format=png&amp;auto=webp&amp;s=3d65ce5a266334b6f1c8a9cd3fb344509441451e)\n\nAs we can see from the 1 year chart above, Cohu seems to find support around the $40 mark for the past 6 months. Currently it's chillin out on the support line, so this indicates to me that it's a good time to purchase cohu, as I love buying dips. We can also see it's found resistance at around $50, having tested that line 3-4 times since the start of the year. I cannot say with certainty that it will break this resistance line, but I do expect it to at least check this number again some time in the next 2-3 months. My expected range for this stock in the next 3 months is between $50 and $65, which leaves room for some nice profit if one were to buy at $40. \n\nIn conclusion, cohu is a small cap in an extremely hot market. It's got some big competitors, but it holds certain key advantages over them. The financial position of the company is really good currently, and it's growth should continue for the foreseeable future. It's strongest catalyst is that semiconductor density is increasing in existing markets, and new markets are emerging with high density, which has the potential to create enormous growth. For this reason, I think COHU is a great choice. (Even if you disagree on Cohu, you will want to have some semiconductors in your portfolio for the next few years). \n\nDisclaimer: I'm holding call options on this company. \n\ncheers",
        "subreddit": "wallstreetbets",
        "title": "Cohu; the plug for your favorite semiconductor companies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n2ojmq/cohu_the_plug_for_your_favorite_semiconductor/",
        "created": 1619923455.0
    },
    {
        "author": "Wald_JD",
        "created_utc": 1620088889,
        "id": "n4bxnk",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I know crypto miners mostly use Nvidia or AMD GPUs to mine, but are Qualcomm GPU also heavily used to mine? I'm worry that with ETH moving from POW to POS, price of GPUs will definitely drop and this will not only impact the 2 big giants of crypto mining GPU but also Qualcomm itself.\nThoughts?",
        "subreddit": "stocks",
        "title": "Are Qualcomm graphic cards heavinly used in mining? ETH is going to POS soon and many GPU will lose lot of their values.",
        "url": "https://www.reddit.com/r/stocks/comments/n4bxnk/are_qualcomm_graphic_cards_heavinly_used_in/",
        "created": 1620117689.0
    },
    {
        "author": "Wald_JD",
        "created_utc": 1619885414,
        "id": "n2lf5r",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I was reading that over 50% of QUALCOMM's revenue come from China. Is it possibile that after Huawei will be able to produce its own chips (because of the US tariffs), QCOM revenue will shrink year after year and the stock will consequently plummet?",
        "subreddit": "stocks",
        "title": "A thought about QUALCOMM future revenue situation.",
        "url": "https://www.reddit.com/r/stocks/comments/n2lf5r/a_thought_about_qualcomm_future_revenue_situation/",
        "created": 1619914214.0
    },
    {
        "author": "unsightlypounding680",
        "created_utc": 1619983251,
        "id": "n3dotn",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "SAN FRANCISCO (Reuters) - Epic Games faces an uphill legal battle against Apple Inc (NASDAQ:AAPL) in an antitrust trial starting Monday, and a defeat for the maker of \"Fortnite\" could make it harder for U.S. government regulators to pursue a similar case against the iPhone maker, legal experts said.\n\nBut win or lose at the trial, Epic, which has pursued an aggressive public relations campaign against Apple alongside its court pleadings, may have already accomplished a major goal: Drawing Apple squarely into the global debate over whether and how massive technology companies should be regulated.\n\nApple has mostly succeeded in staying out of the regulatory crosshairs by arguing that the iPhone is a niche product in a smartphone world dominated by Google (NASDAQ:GOOGL)'s Android operating system. But that argument has become harder to sustain with the number of iPhone users now exceeding 1 billion.\nEpic alleges Apple has such a strong lock on those customers that the app store constitutes a distinct market for software developers over which Apple has monopoly power. Apple is abusing that power, Epic argues, by forcing developers to use Apple's in-app payment systems - which charge commissions of up to 30% - and to submit to app-review guidelines the gaming company says discriminate against products that compete with Apple's own.\n\n\"It's not a super-strong suit - I don't think they are likely to win,\" said Rebecca Haw Allensworth, a law professor at Vanderbilt Law School. \"But it has already achieved a lot of its purpose, which is drawing attention to some of Apple's practices that many developers see as abusive.\"\nUPHILL BATTLE\n\nEpic's arguments draw on major antitrust cases against Microsoft (NASDAQ:MSFT), Eastman Kodak and American Express (NYSE:AXP), but apply those precedents in new ways that have not been tested in U.S. courts, legal experts said.\n\nFor example, in arguing that iPhones are a software market unto themselves, Epic relies partly on a 1992 U.S. Supreme Court decision that rejected efforts by Kodak to force owners of its copying machines to use Kodak repair services.\n\nSpencer Waller, a competition law professor at the Loyola University Chicago School of Law, said the Kodak decision has had mixed success in subsequent cases.\n\n\"Plaintiffs are often unsuccessful because courts read Kodak narrowly at times,” Waller said.\nEpic also faces hurdles in its contention that Apple's in-app payment commissions are too high at 30% and could be as much as 10 times lower if market forces prevailed. American courts have been reluctant to dive into setting specific rates, in large part because unlike Europe, the prevailing interpretation of U.S. antitrust law does not consider a dominant firm charging high prices to be anticompetitive in itself.\n\nApple argues that whatever dominant position it may have in mobile software is an outgrowth of its creation of both the iPhone and a curated App Store that makes consumer comfortable.\n\"If you obtained a monopoly legitimately, you're allowed to charge high prices,\" said Randal Picker, a professor at the University of Chicago Law School.\n\nRegardless of who wins at the trial expected to last three weeks before Judge Yvonne Gonzalez Rogers (NYSE:ROG) in Oakland, California, the case is all-but-certain to be appealed to the U.S. Ninth Circuit Court of Appeals, which last year reinforced the notion that dominant firms can charge high prices in a case involving Qualcomm (NASDAQ:QCOM) Inc.\n\"Anticompetitive behavior is illegal under federal antitrust law. Hypercompetitive behavior is not,\" Circuit Judge Consuelo Callahan wrote in the court's opinion.\n\nA federal antitrust official, speaking anonymously because the official was not authorized to speak to the media, said that an Epic loss would dim the chances of the government pursuing a similar lawsuit against Apple.\n\nBREWING ANTITRUST DEBATE\n\nEpic's suit has ramped up pressure on Apple in the court of public opinion at a time when the iPhone maker's business practices are facing fresh scrutiny around the world.\nThe U.S. Department of Justice https://reut.rs/3vAq5sD is probing the company's practices, Reuters has reported, and regulators in the United Kingdom and Australia have opened probes or called for regulation.\n\nEuropean Union regulators last week accused Apple of distorting competition in the music streaming market, siding with Spotify (NYSE:SPOT) Technology in the zone's first major anti-competition charge against Apple.\n\nEpic advertisements decrying Apple for taking such a big cut of revenue are landing aside those headlines.\n\"The public can understand these issues, and in many ways understand them better than these judges who have never played a game in their life,\" said Thomas Horton, a professor at the University of South Dakota School of Law.\n\nThe biggest threat to Apple's App Store is not lawsuits, but rather new laws regulating digital platforms, said Joel Mitnick, a partner at Cadwalader, Wickersham &amp; Taft and a former U.S. Federal Trade Commission trial lawyer.",
        "subreddit": "investing",
        "title": "Analysis-In Apple versus Epic Games, courtroom battle is only half the fight",
        "url": "https://www.reddit.com/r/investing/comments/n3dotn/analysisin_apple_versus_epic_games_courtroom/",
        "created": 1620012051.0
    }
]