[
    {
        "author": "SomethingAweful308",
        "created_utc": 1615862890,
        "id": "m5z8j4",
        "num_comments": 127,
        "num_crossposts": 0,
        "selftext": "RKT ipo'd at $19 back in August.  The Gilford family spent 35 year building them into the largest mortgage orginator in the world.  They survived every downturn even the '07 Mortgagepocolypse, each time growing and taking share.\n\nThey didn't need no cash, they came public to establish themselves in the public market and begin planning for the some day when death taxes require the family to settle up with the irs.\n\nThe Gilfords built a $50 Billion company from scratch, its a story right up there with Buffet and Bezos but this family gets no respect.   They should.  \n\nThe biz:\n\nBanks make loans, sometimes they make the mortgage thing to apes who have \"civilized\" and live in house things.  I sleep in the woods and swing from trees, but many of my so called 'evolved' cousins like this house living bullshit.  Well banks only have a handful of people in house who loan house mortages (i know weird).  They rely on these fly by night boiler rooms who send emails and call you unexpectedly, you think its about your car warranty or solar but this is that other sales call about Refi-Cash-Out into a Fixed Fully Ammortizing 30 year or buying a rental with a 5/1 ARM Fixed-Floating with rolled in closing costs.  \n\nIts really a bunch of bullshit, mortgages, roofs, solar panels.  I like bananas, but I like this stonk called RKT.  \n\nMorgages are hard, they want paperworks, bank statements, adp payroll slips.  The business comes in waves.  When rates are cheap and banks full of new dollar tokens given to them by  JPOW, there is a long line of house living apes trying to mortage their paychecks from 30 years on so they can install a pool or move to a neighborhood with a country club.  So the banks call on these boiler rooms to make all the paper mortgage calls happen.\n\nThese 'orginiators' are typically like circus pop up tent companies.  They hire a bunch of unemployed used car saleman and maniacs froms the sober house to call the leads and take the applications.  They hire Amanda and Britney who couldn't succeed as beauticians to do the document reviews and processing.  Simply put its the cast of heros you used to see on episodes of COPS where the call was a 'domestic.'  \n\nBut the Gilfords had a vision: build software that runs on devices that make it so easy to apply, qualify and process a mortgage that even Rodney with 5 days outa rehab and Britney 'I told your ass to send me that already' couldn't screw it up and the customer gets their house money fast and easy right from the app on their handheld glowing glass screen.\n\nHedge funds don't understand how good this software is.  No one else bothered to build it because bankers are not creative, they live by screwing others.  And the other circus freaks pushing mortgages are in it for next week commish check so they can coke and hookers.  \n\nStonk is at $26\n\nThe Hedges shorted 40 mil shares on a 115 mil float.  And index fund already bought 11 mil shares (invesco).   The original fund managers who bought the ipo sold it out during the last blast up to $43.  They sold, bc they saw morgage rates go up a 1/2 point and figured the circus is over and all these pop up freak show mortgage boiler rooms are going under.  They didn't bother to look at rkt.  They have a 90% repeat business rate: meaning 9/10 customers who do a mortgage with rocket, will use rocket if they do another.  typicall number in bankin is 1 or 2 out of 10.  RKT app is number 1 in the catagory, and as Mamma Cathy Wood teached me smooth ape brain: innovation is a winner take all game.  \n\nRKT builds back better each downturn, and every mortgage boom brings in startup circus creeps that don't know how to code, analyst customer data (data science) and deliver good service.  Why should they? they believe its a churn and burn business.  They are running flee market stores, RKT is runnnin and Amazon of mortgages and now getting into car and personal loans\n\nThey don't take credit risk, they lend for banks and investor pools.  they \"service\" the loan which means they bill and collect.  so when rates fluctuate they have to adjust the holding value of the collection rights up or down any quarter.  Hedgefunds predict that higher rates mean they take a write down.  But thats just paper bullshit.  the collection rights always are profitable, they just have to 'discount' them when banks same interest is worth more.  Hedgefunds look for quick profits, not revolutionary businesses that make lives better.\n\nThey missed tsla, apple, amzn and countless others the same way.  RKT is no diff.\n\nThe company minted coin in 2020, about $4.50/share in profit.  Thats a PE of like 6.  Now no one thinks they will make that in '21.  2020 was the best mortgage year ever, people sat at home, watched netflix and bought and refinanced houses.  They also learned to use their phones and their computers for the first time ever.  They can now work and do businness on them, before they didn't, but covid make them overcome their fear and forced all the boomers to use their phone to get a mortgage.   the secular story of waiting for the apes who know how to use an app to move out of mom's basement to buy a house is over.  The boomers learned to use apps and now, all businesses will suceed or fail based on the quality of the app experience.  Did i mention RKTs apps are all number 1 or near in their catagories and great reveiws.  \n\nBeing number 1 and having great reviews in the app store makes it game over.  Its winner take all.  RKT will clean up in the down turn.  they will earn less with less business and higher rates but the long term earnings power of this company is $2-3/share and growing every downturn.\n\n&amp;#x200B;\n\n[CEO of RKT: This Guy Fucks!](https://preview.redd.it/9wt6lcae0bn61.png?width=636&amp;format=png&amp;auto=webp&amp;s=97969bbe977a7211c3477c7aedc7ccfb19175aa7)\n\n&amp;#x200B;\n\nI bet my account the stonk would go up over 28.89 this friday b/c i YOLO'd the mother fucking FDs.",
        "subreddit": "wallstreetbets",
        "title": "RKT The Rocket Companys: Cheap and Hated",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m5z8j4/rkt_the_rocket_companys_cheap_and_hated/",
        "created": 1615891690.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1614778597,
        "id": "lwu16p",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to Wednesday! Here are your pre-market stock movers &amp; news on this Wednesday, March 3rd, 2021-\n\n*****\n\n# [5 things to know before the stock market opens Wednesday](https://www.cnbc.com/2021/03/03/5-things-to-know-before-the-stock-market-opens-march-3-2021.html)\n\n*****\n\n&gt; # 1. Dow futures jump after Tuesday’s early gain fizzles and reverses\n\n&gt; * The Dow is set to rise 200 points Wednesday after late-day selling reversed strong gains earlier in Tuesday’s session. Coming off their best days since November, the 30-stock average Tuesday fell 0.5% and the Nasdaq dropped 1.7% as tech stocks pulled back. The S&amp;P 500 slid 0.8%, a day after its biggest one-day advance since June.\n\n&gt; * The latest ADP report on private sector employment is set for release at 8:30 a.m. ET, one hour before Wall Street’s open. U.S. companies are expected to have added 225,000 new jobs in February compared to January of gains 174,000 positions. The ADP lately has not been the best predictor of the government’s monthly jobs report, which comes out Friday.\n\n*****\n\n&gt; # 2. Senate to begin debate soon on $1.9 trillion Covid relief bill\n\n&gt; * The Senate is expected to start debate as soon as Wednesday on its version of the House-passed, $1.9 trillion Covid relief bill. However, it excludes a federal minimum wage boost to $15 per hour. President Joe Biden on Tuesday urged Democrats to stand united and approve the measure, even as some party moderates sought to dial back parts of the package. Democrats, with the slimmest of margins in the Senate, are using special rules that would allow them to pass the bill without GOP support.\n\n*****\n\n&gt; # 3. U.S. will have enough Covid vaccines for ‘every adult’ by end of May\n\n&gt; * The U.S. will have a large enough supply of coronavirus vaccines to inoculate “every adult in America” by the end of May, two months earlier than previously expected, Biden said at the White House on Tuesday. The announcement came as the administration works to increase production of Johnson &amp; Johnson’s newly cleared single-shot vaccine, and rival Merck agrees to pitch in.\n\n&gt; * The Republican governors of Texas and Mississippi both announced Tuesday that they’re lifting mask mandates in their states and allowing businesses to reopen at full capacity even as the decline in new daily Covid-19 cases slows. CDC Director Dr. Rochelle Walensky on Monday warned states against lifting public health restrictions too quickly.\n\n*****\n\n&gt; # 4. America’s biggest firms push for path to citizenship for ‘Dreamers’\n\n&gt; * America’s biggest companies are urging Congress to establish a permanent path to citizenship for undocumented immigrants brought to the U.S. as children. In a letter Wednesday, a coalition of more than 100 companies and trade associations — including Facebook, General Motors, Marriott, Target, Visa and Uber — asked Senate leaders Chuck Schumer, D-N.Y., and Mitch McConnell, R-Ky., to pass the bipartisan Dream Act of 2021. The move comes as Biden and Democrats on Capitol Hill look to immigration as a major legislative priority.\n\n*****\n\n&gt; # 5. Stocks to watch: Rocket Companies, Las Vegas Sands, Oscar Health\n\n&gt; * Rocket Companies fell 6% in Wednesday’s premarket trading after more than doubling over the past three sessions. On Tuesday, the Quicken Loans and Rocket Mortgage parent surged over 71% on no apparent news. The heavily shorted stock appears to have garnered bullish interest from day traders on Reddit’s WallStreetBets forum.\n\n&gt; * Casino operator Las Vegas Sands said Wednesday it would sell its Vegas real estate and operations to private equity giant Apollo Global Management for about $6.25 billion. The properties include the Venetian Resort Las Vegas and the Sands Expo and Convention Center. Shares of Las Vegas Sands were up almost 3% in the premarket. Apollo fell nearly 1%.\n\n&gt; * Oscar Health is set to debut Wednesday on the New York Stock Exchange. The health insurance startup backed by Google-parent Alphabet priced its initial public offering Tuesday evening at $39 per share, above the already-raised expected range of $36 to $38. The IPO gives Oscar Health a market value of $7.7 billion ahead of trading.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mFJEZLD.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/DZktsvp.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #1!](https://i.postimg.cc/Yq2hHN9S/econcal1.png)**)\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #2!](https://i.postimg.cc/FFV78Chq/econcal2.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zRvHdP7.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/PbURZ3R.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/oqzviWR.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/HGdMXO8.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/978P5c5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK!](https://i.imgur.com/2Ltoqja.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.postimg.cc/d0wfH06g/upgradesdowngrades1.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.postimg.cc/52wGSzBw/upgradesdowngrades2.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.postimg.cc/nh8gm2DF/upgradesdowngrades3.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/85n5bWw.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/3PemF5S.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/0YIFXZl.png)**)\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/03/03/stocks-making-the-biggest-moves-in-the-premarket-lyft-las-vegas-sands-wendys-more.html)**)\n\n*****\n\n&gt; **Lyft (LYFT)** – The ride-hailing company said that last week saw the highest level of ride volume since the pandemic took hold last March. As a result, Lyft expects to report a smaller quarterly loss than it had previously projected. Lyft shares jumped 5.6% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** LYFT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LYFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LYFT)**)\n\n*****\n\n&gt; **Las Vegas Sands (LVS)** – The casino operator’s shares rose 3% in the premarket after it announced a deal to sell its Las Vegas properties to private-equity firms Apollo Global (APO) and VICI Properties for $6.25 billion. The sale includes The Venetian Resort Las Vegas and the Sands Expo and Convention Center. Apollo Global shares gained 2.1%.\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n&gt; **Wendy’s (WEN)** – The restaurant chain missed estimates by a penny a share, with quarterly earnings of 17 cents per share. Revenue came in short of forecasts as well. Global comparable sales rose 4.7%, shy of the FactSet consensus estimate of 5.7% due primarily to international weakness. Its shares fell 3.3% in the premarket.\n\n&gt; #**STOCK SYMBOL:** WEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WEN)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** – The discount retailer earned $2.13 per share for the fourth quarter, beating estimates by 2 cents a share. Revenue essentially was in line with expectations. Comparable-store sales rose 4.9%, short of the 5.5% estimate of analysts surveyed by FactSet. The company’s shares fell 2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **Hewlett Packard Enterprise (HPE)** – HPE beat estimates by 11 cents a share, with quarterly earnings of 52 cents per share. The enterprise computing hardware maker’s revenue came in above forecasts as well. The company issued strong guidance for both the current quarter and full year, as it continues to benefit from the pandemic-inspired digital transformation.\n\n&gt; #**STOCK SYMBOL:** HPE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HPE)**)\n\n*****\n\n&gt; **Box (BOX)** – Box reported quarterly earnings of 22 cents per share, 5 cents a share above estimates. Revenue beat projections as well. The online data storage company also issued a better-than-expected full-year outlook and expects that the current quarter will see revenue above $200 million for the first time.\n\n&gt; #**STOCK SYMBOL:** BOX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BOX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BOX)**)\n\n*****\n\n&gt; **Nordstrom (JWN)** – Nordstrom earned 21 cents per share for its latest quarter, 7 cents a share above estimates. The retailer also reported better-than-expected revenue. Nordstrom was helped by a boost in digital sales as well as growth in its off-price operation, but the retailer warned that it would have to clear excess holiday inventory through that off-price channel. Shares fell 2.6% in premarket action.\n\n&gt; #**STOCK SYMBOL:** JWN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=JWN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/JWN)**)\n\n*****\n\n&gt; **FuboTV (FUBO)** – FuboTV reported quarterly revenue in excess of $100 million for the first time, with the live sports streaming company reporting a better-than-expected $105.1 million in sales. Subscriber numbers jumped 73% from a year earlier to a total of 548,000. Its shares fell 4% in the premarket, however, following a nearly 50% year-to-date jump.\n\n&gt; #**STOCK SYMBOL:** FUBO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FUBO)**)\n\n*****\n\n&gt; **Rocket Companies (RKT)** – Rocket shares have been volatile in premarket trading after more than doubling over the past three sessions. The Quicken Loans and Rocket Mortgage parent has been garnering increasing attention in online forums, with investors noting the high level of short interest. Rocket shares fell 5.5% in premarket action.\n\n&gt; #**STOCK SYMBOL:** RKT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RKT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RKT)**)\n\n*****\n\n&gt; **Urban Outfitters (URBN)** – Urban Outfitters beat estimates by 2 cents a share, with quarterly earnings of 30 cents per share. The apparel retailer’s revenue fell slightly below Wall Street forecasts, however, and gross profit margins dropped more than 3 percentage points from a year earlier. Its shares fell 1.6% in the premarket.\n\n&gt; #**STOCK SYMBOL:** URBN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=URBN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/URBN)**)\n\n*****\n\n&gt; **Ross Stores (ROST)** – Ross Stores sank 3.1% in the premarket after it reported quarterly earnings of 67 cents per share, below the $1.00 a share consensus estimate. The discount retailer’s revenue came in below estimates as well, hurt by pandemic-related store closures in California.\n\n&gt; #**STOCK SYMBOL:** ROST\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ROST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ROST)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, March 3rd, 2021! :)**",
        "subreddit": "stocks",
        "title": "(3/3) Wednesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/stocks/comments/lwu16p/33_wednesdays_premarket_stock_movers_news/",
        "created": 1614807397.0
    },
    {
        "author": "OptionStalker",
        "created_utc": 1617024682,
        "id": "mfpmx9",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "This is a follow up to my post Sunday. Every trade should start with your opinion of the market. My trade duration is less than a month so my forecasts stay within that time period. I will post a trade with instructions later today or tomorrow and then I will back track to show you how I found it and why I like it. This forecast was posted before the open Monday. \n\nMARKET BIAS: Neutral to slightly bullish for the next month\n\nOPTIONS STRATEGY: Sell OTM bullish put spreads\n\nMARKET ANALYSIS:   \n\nLast week the market passed the critical test and major moving averages in the NASDAQ 100 and the S&amp;P 500 held. Friday stocks rebounded and I believe we will see follow-through buying during this holiday shortened week. This is been a stair-step rally and the price action has been choppy while profits catch up to lofty valuations. Major economic releases should be market friendly and earnings season will be upon us when we return after Easter.\n\nThe NASDAQ 100 tested the 100-day moving average and it bounced off of that level. This is important because it was a higher low. Buyers did not feel that we would be able to test the lows from March and they were more aggressive on this dip. Tech stocks have been soft because of the rise in interest rates the last two months. US 10-Year Treasuries (TLT) found support (interest rates have stopped going up) and the bid in tech stocks should improve into earnings season.\n\nThe S&amp;P 500 tested the 50-day moving average and it also bounced off of that support level. This is been a three steps forward, two steps backwards rally and we are poised to break through the all-time high in the next few weeks.\n\nThis morning there are some nervous jitters over the demise of a hedge fund (Archegos). We saw margin liquidations in their holdings last week and a number of banks have considerable exposure. Credit Suisse (CS) said that it will have a material impact on earnings this quarter. I do not see this as a systemic event and $20 billion will be quickly absorbed.\n\nLast week's initial jobless claims dropped to 674,000 and that was the best reading in the last few months. States are reopening and employment will improve quickly. Approximately 8% of our labor force is tied to the hospitality industry and the rebound should be swift as restaurants reopen. ADP will release its employment numbers Wednesday and the Unemployment Report will be posted Friday (market closed). This week we will also get official PMI's and ISM manufacturing on Thursday. Traders will be watching for steady improvement. \n\nThe Fed has stated that it will not raise rates until 2024 and that it expects inflation to reach 2.5% this year. They see higher prices as a temporary event and that they will normalize in 2022. This means that we are in a \"sweet spot\" where strong economic data points should not raise fear that the Fed will tighten.\n\nStock valuations are stretched, but we almost have another quarter of profits under our belt. Q4 corporate guidance was much better-than-expected and earnings should be healthy. The market bid typically strengthens into earnings season and we are only a few weeks away.\n\nSwing traders are long SPY. Raise your stop to SPY $386 (closing basis). You should be selling out of the money bullish put spreads on stocks with relative strength and heavy volume. I prefer selling bullish put spreads on stocks with strong momentum and technical breakouts through resistance. Sell below technical support and try to keep your spreads inside of a three week window to maximize accelerated time premium decay.\n\nDay traders should look for an early test of support this morning. I believe that the market will rebound fairly quickly. As the market drops on the open find relative strength. Buyers took notice when support levels last week held and overseas markets were fairly strong. The downward sloping trend line for SPY (30 minute bars) was breached and prices should be stable to slightly higher this week. This morning we are simply giving back the gains from the last 30 minutes of trading Friday.\n\nSupport is at SPY $391 and resistance is at $396 and the all-time high.",
        "subreddit": "options",
        "title": "Market Forecast - 3 Step Process To Options Trading - Part 2",
        "url": "https://www.reddit.com/r/options/comments/mfpmx9/market_forecast_3_step_process_to_options_trading/",
        "created": 1617053482.0
    },
    {
        "author": "ProductCompetitive31",
        "created_utc": 1616954363,
        "id": "mf63po",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Hello, Im new trader. so i searched for bull flag pattern and i found $ADP. the flag pole is $19. what do you think about?",
        "url": "https://i.redd.it/grod57325tp61.png",
        "created": 1616983163.0
    },
    {
        "author": "trevandezz",
        "created_utc": 1614780893,
        "id": "lwuuwe",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "ADP (private sector jobs added) missed expectations. Market is reacting early. More in comments",
        "url": "https://i.redd.it/asdc05s4ntk61.jpg",
        "created": 1614809693.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1617222016,
        "id": "mhes8g",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "**Dow (0.26%), S&amp;P 500 +0.36%, Nasdaq +1.54%, Russell 2000 +1.13%**  \n**Wednesday, March 31, 2021**  \n\n\n* **Synopsis**\n   * US equities were mostly higher in Wednesday trading, though finished off best levels, with S&amp;P now little changed on the week. Small caps higher again after resuming recent bounce yesterday. Growth outperformed value with tech and consumer discretionary the leaders. FAANGs all higher and semis reversed some of the week's declines. Financials, energy, consumer staples among sectors lower. Treasuries little changed to a touch weaker. Dollar stronger vs yen but little changed vs euro. Gold finished up 1.8%. WTI crude settled down 2.3%.\n   * **White House infrastructure** **stimulus plan released** ahead of Biden speech. White House has proposed over $2T of spending over eight-year period focused on traditional road, bridge, airport, water-delivery and utility projects, as well as electrification, high-speed broadband, worker training, supply chain and R&amp;D investments, and home-based care. Partial funding will come from 15 years of higher taxes, including increase in corporate tax rate to 28% from 21%, an increase in the global minimum tax from \\~13% to 21%, and other measures. Democrats expected to have to use reconciliation to pass. Demands for SALT relief emerging as a potential stumbling block.\n   * Pretty quiet elsewhere ahead of **nonfarm payrolls on Friday** where market seems to be looking for a print above the \\~650K consensus. However, **ADP private payrolls** growth of 517K only a bit better than 500K consensus. March **Chicago PMI** highest since Jul-18. February **pending home sales** missed on tight inventory. **China manufacturing and services PMIs** **surprised to the upside**, hitting three- and four-month highs, respectively. **Eurozone headline and core inflation came in softer**. Some discussion about **worsening coronavirus trends in the US** with new infections up 20% in past two weeks, though vaccine optimism remains fairly elevated with good news from Pfizer/BioNTech this morning regarding efficacy in adolescents. Multiple reports noted **Biden to let Trump's H1-B visa ban expire**.\n   * **WBA** beat and raised with Street positive on execution given COVID headwinds. **LULU** beat with Street positive on digital sales strength and momentum into Q1 but some disappointment 2021 EPS guidance light on Mirror dilution. **CHWY** a standout after it beat and guided above with takeaways positive on rebound in new customer adds and opportunities in healthcare. **KR** reconfirmed FY21 comps guidance but bar high. **CLF** guided 2021 EBITDA above the Street with takeaways noting the company's leverage to stronger domestic steel prices. **PVH** results mixed with revenue below but EBIT ahead while FY guide below on softer NA outlook but not really a surprise. **BB** revenue missed.\n* **Digest**\n   * **Tech, consumer discretionary best performers as growth extends week's outperformance:**\n      * Growth continued to outperform value factor today. **Tech** the best performer with semis, AAPL (upgrade), internet names stronger. **Consumer discretionary** saw solid gains TSLA and AMZN. **Communication services** in line with interactive media, entertainment better groups but media weaker. **Healthcare** weighed down by hospitals and managed care. **Industrials** lower on weakness across airlines, trucking, machinery. **Consumer staples** an underperformer with grocers (KR update), tobacco weaker. **Materials** down as broader chemicals group traded lower. **Financials** trailed as banks, insurance gave back some of yesterday's gains. **Energy** the worst performer, following WTI crude lower as integrated oil extended week's losses.\n   * **March ADP employment beats ahead of Friday's payrolls report:**\n      * March **ADP employment report** showed a gain of 517K, ahead of estimates for 500K and the highest since September. February was also revised up 59K to 176K. Service-sector jobs were up 437K, led by leisure and hospitality, up 169K. Good-producing jobs were up 80K on a 49K manufacturing and 32K construction gain. Report comes ahead of Friday's **March nonfarm payrolls report**, with expectations for a gain of 614K, up from February's 329K print. Would be highest since October's 680K increase. Private payrolls expected to increase by 525K and government up 89K. Unemployment rate expected to fall 0.2 pp to 6.0%, while average hourly earnings expected to hold at +0.2% (and down to 4.5% y/y from February's +5.3%). Some sell-side previews noted upside risk to payrolls could be driven by strong reopening momentum, with some real-time data showing fastest activity growth since last summer.\n   * **Details of infrastructure stimulus in focus ahead of Biden speech:**\n      * White House release [proposal](https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/) that includes \\~$2T of spending over eight-year period focused on traditional road, bridge, airport, water-delivery and utility projects, as well as electrification, high-speed broadband, worker training, supply chain and R&amp;D investments, and home-based care ([Washington Post](https://urldefense.com/v3/__https:/www.washingtonpost.com/us-policy/2021/03/30/biden-infrastructure-plan-jobs/__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q05vFqPAw$), [NY Times](https://urldefense.com/v3/__https:/www.nytimes.com/2021/03/30/business/economy/biden-infrastructure-taxes.html__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q0d-INcDA$), [Politico](https://urldefense.com/v3/__https:/www.politico.com/news/2021/03/30/biden-infrastructure-plan-478627__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q2iMz2d3A$), [Bloomberg](https://urldefense.com/v3/__https:/www.bloomberg.com/news/articles/2021-03-30/biden-to-lay-out-u-s-economic-renewal-in-rejuvenated-pittsburgh?srnd=premium&amp;sref=J9GPLx1B__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q3IwE9qlg$)) In terms of some of the bigger tranches, reports said \\~$621B will go to traditional infrastructure, \\~$400B to home care for elderly and disabled, $300B to housing infrastructure, $300B to revive US manufacturing, and $174B to vehicle electrification. Partial funding will come from 15 years of higher taxes, including increase in corporate tax rate to 28% from 21% and increase in global minimum tax. Democrats expected to have to use reconciliation in Senate to pass while one stumbling block emerging in House is demand from Blue-state Democrats to scrap $10K SALT deduction limit ([Bloomberg](https://urldefense.com/v3/__https:/www.bloomberg.com/news/articles/2021-03-30/salt-cap-repeal-advocates-near-numbers-to-block-biden-tax-plan?srnd=premium&amp;sref=J9GPLx1B__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q1QjL0aAA$), [The Hill](https://urldefense.com/v3/__https:/thehill.com/policy/finance/545632-democrats-have-a-growing-salt-tax-problem__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q1OL7zEuA$), [Politico](https://urldefense.com/v3/__https:/www.politico.com/news/2021/03/30/blue-state-democrats-salt-taxes-478556__;!!PBKjc0U4!dileJLwkytaR-wTi5vN_CHFQOO8EvTBeqvFeRXLQKZ3PJRPR9KHfr79w8Q1aQ8Klhg$)).\n   * **Still no clarity on what exactly is coming in Phase 2 of Biden plan:**\n      * While programs announced today in Biden's \"American Jobs Plan\" to focus on physical infrastructure, White House also preparing another round of proposals which could bring the total price tag for this effort near $4T. Administration officials speaking about this next phase only in broadest strokes, though likely to include family-centered elements such as improved health coverage, expanded child tax benefit, and paid family/medical leave. Structure and timing of this follow-on effort remain unclear, though idea of pairing physical infrastructure with other traditional Democratic priorities plays into notion Biden hopes to engineer a broad overhaul of the economy in the mold of FDR's New Deal or LBJ's Great Society. No rollout date for phase 2 has been announced but commentators see a speech coming sometime before the White House's climate summit on 22-23 April.\n   * **Afternoon headlines:**\n      * **Economic policy/Stimulus:**\n      * **Coronavirus:**\n      * **Corporate:**\n      * **Market:**\n   * **Notable Gainers:**\n      * \\+16.7% **CLF** (Cleveland-Cliffs): Guided Q1 EBITDA \\~27% above the Street based on current contractual business and forecast for hot-rolled coil to average $975/ton for remainder of the year; Q2 and FY21 guidance ahead as well.\n      * \\+13.3% **AYI** (Acuity Brands): FQ2 earnings beat with gross margins also ahead; noted ongoing Covid impact with Direct Network sales holding up best; analysts see last quarter as a trough for activity and sales amidst improving commercial real estate trends including larger contractor backlogs.\n      * \\+6.9% **HOG** (Harley-Davidson): Upgraded to outperform from neutral at RW Baird; positive on strategic direction of Hardwire plan; expects retail to turn positive in 2021 with lean dealer inventory fueling a healthy replenishment cycle (with checks showing signs of shortages).\n      * \\+6.7% **SQ** (Square): Upgraded to outperform from market perform at Keefe, Bruyette &amp; Woods; said platform positioned to be a winner within underserved market with Seller less than 3% penetrated and Cash App less than 2%; also cited additional customer acquisition avenues with TIDAL, Credit Karma's tax business.\n      * \\+5.4% **CHWY** (Chewy, Inc.): Q4 EBITDA and revenue margins beat; margins boosted by hardgoods, proprietary brands, and healthcare; FY21 revenue guidance above the Street; said QTD customer acquisition and spending trends remain strong.\n      * \\+5.4% **AMAT** (Applied Materials): Initiated outperform at Bernstein; cited positive long term industry outlook, expects rapid growth in wafer fab equipment, sees additional upside optionality for the firm along with LRCX.\n      * \\+4.6% **BNTX** (BioNTech): Announced with PFE positive topline results for Covid vaccine study in adolescents 12 to 15 years old; no cases of Covid were observed in the vaccinated group, similar to prior 16-25 year old study, vaccine was well tolerated; plan to request emergency use authorization as soon as possible.\n      * \\+3.6% **WBA** (Walgreens Boots Alliance): FQ2 earnings and revenue beat with FY guidance raised; analysts noted good execution, particularly in US, despite larger than expected Covid headwind; lower tax rate and interest expenses also benefited earnings; International wholesale business sale likely to be completed this year.\n      * \\+1.9% **AAPL** (Apple): Upgraded to buy from neutral at UBS; cited more stable long-term iPhone demand environment and optionality surrounding likely entry to the auto market.\n   * **Notable Decliners:**\n      * \\-19.7% **RMO** (Romeo Power): Preliminary Q4 EPS and revenue missed; FY21 revenue guide \\~78% below the Street; noted near-term production and revenues to be constrained by supply shortage in battery cells; said working with preferred partners to secure allocations.\n      * \\-11% **OLO** (Olo, Inc.): FT reported DoorDash (DASH) accused company of overcharging it for more than three years; paper said DoorDash was Olo's largest delivery partner last year, accounting for 19.3% of revenue.\n      * \\-9.7% **BB** (BlackBerry): Q4 results below expectations with Software and Services a drag; Licensing and other revenues also missed; company has entered into negotiations to sell majority of its patent portfolio; if no sale, company guided license revenue well below consensus in its most conservative scenario; upgraded at Canaccord Genuity.\n      * \\-5.5% **KR** (Kroger): To provide update at today's Investor Day; reconfirmed FY 21 EPS guidance, which brackets Street consensus; also reconfirms comps, OI, capex, FCF guidance; analysts noted high bar into Investor Day, noting optimism around comps, holding market share gains accumulated in FY20.\n      * \\-3.3% **LULU** (lululemon athletica): Q4 EPS and revenue beat; comps beat, but store comp decline worse than expected; OM light on higher SG&amp;A than expected; guided FY22 EPS below Street, but revenue ahead; analysts said expense outlook given MIRROR, digital channel costs likely to weigh on earnings growth.\n   * **S&amp;P 500 Sector Performance**\n      * **Outperformers:** Tech +1.50%, Consumer Disc. +0.83%, Utilities +0.65%, Communication Svcs. +0.40%\n      * **Underperformers:** Energy (0.93%), Financials (0.90%), REITs (0.50%), Materials (0.49%), Consumer Spls. (0.48%), Industrials (0.33%), Healthcare +0.14%\n* **Data**\n   * DXY: 93.23, (0.07)\n   * €-$ +0.0004 or +0.03% to 1.1726\n   * £-$ +0.0045 or +0.33% to 1.3783\n   * $-¥ +0.37 or +0.34% to 110.74\n   * €-¥ +0.52 or +0.40% to 129.84\n   * 2-year yield +1 bps to 0.16%\n   * 10-year yield +1 bps to 1.74%\n   * 30-year yield +1 bps to 2.41%\n   * WTI Crude (May 21): ($1.24) or (2.05%) to $59.31\n   * Gold (Jun 21): +$22.10 or +1.31% to $1708.1\n   * Index Performance\n      * Month-to-date: Dow +6.62%, S&amp;P +4.24%, Nasdaq +0.41% Russell +0.88%\n      * Quarter-to-date: Dow +7.76%, S&amp;P +5.77%, Nasdaq +2.78% Russell +12.44%\n      * Year-to-date: Dow +7.76%, S&amp;P +5.77%, Nasdaq +2.78% Russell +12.44%",
        "subreddit": "stocks",
        "title": "U.S. Market Recap - Wednesday, March 31, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mhes8g/us_market_recap_wednesday_march_31_2021/",
        "created": 1617250816.0
    },
    {
        "author": "freehouse_throwaway",
        "created_utc": 1614719860,
        "id": "lwcs10",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "* It's a seesaw market day as all indices attempts to find a clear direction after one of the best bull day in almost 9 months. Alas, after running up 5%+ on Monday, Tim Apple pare gains while Andy Amazon stayed relatively flat until power hour where big tech took a big dump. AAPL closed the day down -2% to $125 while AMZN closed down -1.64%, losing $3,100 yet again. Similar situation with FB at -2.23% and MSFta t -1.30%. With pressure from big bois and all sectors, QQQ/SPY sell off continued into closing hours.\n\n* **RKT** is back on WSB menu after a long hiatus where it never fucking breaks the $22/$23 channel. Things changed yesterday as the largest mortgage lender in the US reported stellar Q4 numbers, with EPS at $1.14 vs consensus of $0.87. For once theta gang does NOT win on RKT even with an implied move of 18%+. Coupled with the special dividend announcement of $1.11 per share, short sellers are being extra squeezed today as shares ran as high as $36+ during intraday high. Despite floating around up 18% to 20% for the day, RKT started sky rocketing as it broke out the channel at 12:47 PM. After touching intraday high of +60%, RKT continued volatite trade with multiple halts as all OTM weeklies goes deep ITM. RKT closed the day up 71% with the rocket continuing in AH. Surely a new round of WSBer going into an \"old\" meme stock won't result in a new group of bagholders!? \n\n* **GME** continues to trade in a new channel with wild swing days as gamma exposure settles from MMs selling Feb options last week. F to the bro that bought way too many $800c 2/26 FDs last week. During intraday high GME was up \"modestly\" at +8% to $133 but gains faded towards end of day to close red at -1.84% to $118. The all-to-important Q4 earnings loom later this month on Wednesday March 24. \n\n* **ZM** reported earnings yesterday and while shares soar 9% AH, the gains didn't translate in open session today as shares fade and sold off towards end of day to close -9% at $372. Q4 EPS was $1.22 vs $0.79 consensus, and they project Q1 EPS of ~$0.97 vs consensus of $0.72 along with full year 2022 of ~$3.65, above consensus of $2.96. Price target was raised to $420 from $390 at Morgan Stanley while Piper Sandler upgrades the video conference company from neutral to overweight, with a PT of $541 (lol wtf). \n\n* **ARK Invest ETFs** traded flat today reflecting many of Cathie's holdings performances as of late (until power dump hour). Sent by Market Jebus himself, Cathie Woods has been dealing with a number of negative news round as chatters floats about of funds targetting her holdings as an attempt to push ARKK, ARKW and others down thanks to recent growth name weakness and a push on redemption - to which Cathie responded in bewildment that her ETF has plenty of liquidity and redemption is never an issue. With selling pressure from ROKU and TSLA, ARKK closed down -2.48% to $133 while ARKW closed down -2.34% to $164.\n\n* **Notable upgrades and downgrades:** BYND, an old WSB meme, stock received an upgrade by Citi from Neutral to Buy. Shares close the day down -5% to $139. Cruise stocks receive an upgrade from Macquarie today with NCLH, RCL, CCL all upgraded to Outperform from Neutral today. On the downgrade side, PLUG took a hit from Barclays from Equal Weight to Underweight, while upping their PT to $29 (up from $21). The meme stock tok a dump today to close -7% to $48.73.\n\n* In WSB meme stock land (okay what isn't a meme stock these days), **AMC** close the day down -2.72% to $8.93. Steel gang (I know you're still out there) are finally slowly crawling back from the depths of theta hell, with **MT** up +3.71%, finally breaking out of $25 once again. **BB** closed down -3.76%, staying in the $10 ranges for now until the next catalyst arrives.\n\n* **Noteworthy ERs:** SNOW and OKTA reports today after market close. On Thursday before market opens: PRPL, and Michaels. After market close: COST, SDC, AVGO, GPS, and WORK. Heavily shorted Chinese education \"platform\" GSX reports Friday before market opens. Watch for TAL and EDU to move in sync with whatever GSX ends up reporting. (Both are good ER play candidate if you don't want to deal with the IV crush from GSX).\n\n* **Notable econ numbers:** ADP employment at 8:15 AM ET, EIA draw at 10:30 AM. Jobless claims report at the usual Thursday 8:30 AM followed by factory orders and EIA at 10:30 AM. Finally, Fri brings us the employment situation with nonfarm payroll numbers at 8:30 AM Friday.\n\n* The DOW closed down -0.46% or +144 pts, Nasdaq down -1.69% or -230 pts, SPX udown -0.81% or -31 pts, and RUT close down -1.93% or -43 pts. Our boi VIX is back in the spotlight again as its up 3.3% to 24+.\n\n* Yesterday's recap: none as its been awhile since I've written these.",
        "subreddit": "wallstreetbets",
        "title": "Reeeeeeeeecap of today's market driving news (March 3, 2021 after market close)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lwcs10/reeeeeeeeecap_of_todays_market_driving_news_march/",
        "created": 1614748660.0
    },
    {
        "author": "OptionStalker",
        "created_utc": 1617025609,
        "id": "mfpx0x",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\nThis is a follow up to my post Sunday. Every trade should start with your opinion of the market. My trade duration is less than a month so my forecasts stay within that time period. I will post a trade with instructions later today or tomorrow and then I will back track to show you how I found it and why I like it. This forecast was posted before the open Monday.\n\nMARKET BIAS: Neutral to slightly bullish for the next month\n\nOPTIONS STRATEGY: Sell OTM bullish put spreads\n\nMARKET ANALYSIS:\n\nLast week the market passed the critical test and major moving averages in the NASDAQ 100 and the S&amp;P 500 held. Friday stocks rebounded and I believe we will see follow-through buying during this holiday shortened week. This is been a stair-step rally and the price action has been choppy while profits catch up to lofty valuations. Major economic releases should be market friendly and earnings season will be upon us when we return after Easter.\n\nThe NASDAQ 100 tested the 100-day moving average and it bounced off of that level. This is important because it was a higher low. Buyers did not feel that we would be able to test the lows from March and they were more aggressive on this dip. Tech stocks have been soft because of the rise in interest rates the last two months. US 10-Year Treasuries (TLT) found support (interest rates have stopped going up) and the bid in tech stocks should improve into earnings season.\n\nThe S&amp;P 500 tested the 50-day moving average and it also bounced off of that support level. This is been a three steps forward, two steps backwards rally and we are poised to break through the all-time high in the next few weeks.\n\nThis morning there are some nervous jitters over the demise of a hedge fund (Archegos). We saw margin liquidations in their holdings last week and a number of banks have considerable exposure. Credit Suisse (CS) said that it will have a material impact on earnings this quarter. I do not see this as a systemic event and $20 billion will be quickly absorbed.\n\nLast week's initial jobless claims dropped to 674,000 and that was the best reading in the last few months. States are reopening and employment will improve quickly. Approximately 8% of our labor force is tied to the hospitality industry and the rebound should be swift as restaurants reopen. ADP will release its employment numbers Wednesday and the Unemployment Report will be posted Friday (market closed). This week we will also get official PMI's and ISM manufacturing on Thursday. Traders will be watching for steady improvement.\n\nThe Fed has stated that it will not raise rates until 2024 and that it expects inflation to reach 2.5% this year. They see higher prices as a temporary event and that they will normalize in 2022. This means that we are in a \"sweet spot\" where strong economic data points should not raise fear that the Fed will tighten.\n\nStock valuations are stretched, but we almost have another quarter of profits under our belt. Q4 corporate guidance was much better-than-expected and earnings should be healthy. The market bid typically strengthens into earnings season and we are only a few weeks away.\n\nSwing traders are long SPY. Raise your stop to SPY $386 (closing basis). You should be selling out of the money bullish put spreads on stocks with relative strength and heavy volume. I prefer selling bullish put spreads on stocks with strong momentum and technical breakouts through resistance. Sell below technical support and try to keep your spreads inside of a three week window to maximize accelerated time premium decay.\n\nDay traders should look for an early test of support this morning. I believe that the market will rebound fairly quickly. As the market drops on the open find relative strength. Buyers took notice when support levels last week held and overseas markets were fairly strong. The downward sloping trend line for SPY (30 minute bars) was breached and prices should be stable to slightly higher this week. This morning we are simply giving back the gains from the last 30 minutes of trading Friday.\n\nSupport is at SPY $391 and resistance is at $396 and the all-time high.",
        "subreddit": "options",
        "title": "Market Forecast - 3 Step Process To Options Trading - Part 2",
        "url": "https://www.reddit.com/r/options/comments/mfpx0x/market_forecast_3_step_process_to_options_trading/",
        "created": 1617054409.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1614778742,
        "id": "lwu2vs",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to Wednesday! Here are your pre-market stock movers &amp; news on this Wednesday, March 3rd, 2021-\n\n*****\n\n# [5 things to know before the stock market opens Wednesday](https://www.cnbc.com/2021/03/03/5-things-to-know-before-the-stock-market-opens-march-3-2021.html)\n\n*****\n\n&gt; # 1. Dow futures jump after Tuesday’s early gain fizzles and reverses\n\n&gt; * The Dow is set to rise 200 points Wednesday after late-day selling reversed strong gains earlier in Tuesday’s session. Coming off their best days since November, the 30-stock average Tuesday fell 0.5% and the Nasdaq dropped 1.7% as tech stocks pulled back. The S&amp;P 500 slid 0.8%, a day after its biggest one-day advance since June.\n\n&gt; * The latest ADP report on private sector employment is set for release at 8:30 a.m. ET, one hour before Wall Street’s open. U.S. companies are expected to have added 225,000 new jobs in February compared to January of gains 174,000 positions. The ADP lately has not been the best predictor of the government’s monthly jobs report, which comes out Friday.\n\n*****\n\n&gt; # 2. Senate to begin debate soon on $1.9 trillion Covid relief bill\n\n&gt; * The Senate is expected to start debate as soon as Wednesday on its version of the House-passed, $1.9 trillion Covid relief bill. However, it excludes a federal minimum wage boost to $15 per hour. President Joe Biden on Tuesday urged Democrats to stand united and approve the measure, even as some party moderates sought to dial back parts of the package. Democrats, with the slimmest of margins in the Senate, are using special rules that would allow them to pass the bill without GOP support.\n\n*****\n\n&gt; # 3. U.S. will have enough Covid vaccines for ‘every adult’ by end of May\n\n&gt; * The U.S. will have a large enough supply of coronavirus vaccines to inoculate “every adult in America” by the end of May, two months earlier than previously expected, Biden said at the White House on Tuesday. The announcement came as the administration works to increase production of Johnson &amp; Johnson’s newly cleared single-shot vaccine, and rival Merck agrees to pitch in.\n\n&gt; * The Republican governors of Texas and Mississippi both announced Tuesday that they’re lifting mask mandates in their states and allowing businesses to reopen at full capacity even as the decline in new daily Covid-19 cases slows. CDC Director Dr. Rochelle Walensky on Monday warned states against lifting public health restrictions too quickly.\n\n*****\n\n&gt; # 4. America’s biggest firms push for path to citizenship for ‘Dreamers’\n\n&gt; * America’s biggest companies are urging Congress to establish a permanent path to citizenship for undocumented immigrants brought to the U.S. as children. In a letter Wednesday, a coalition of more than 100 companies and trade associations — including Facebook, General Motors, Marriott, Target, Visa and Uber — asked Senate leaders Chuck Schumer, D-N.Y., and Mitch McConnell, R-Ky., to pass the bipartisan Dream Act of 2021. The move comes as Biden and Democrats on Capitol Hill look to immigration as a major legislative priority.\n\n*****\n\n&gt; # 5. Stocks to watch: Rocket Companies, Las Vegas Sands, Oscar Health\n\n&gt; * Rocket Companies fell 6% in Wednesday’s premarket trading after more than doubling over the past three sessions. On Tuesday, the Quicken Loans and Rocket Mortgage parent surged over 71% on no apparent news. The heavily shorted stock appears to have garnered bullish interest from day traders on Reddit’s WallStreetBets forum.\n\n&gt; * Casino operator Las Vegas Sands said Wednesday it would sell its Vegas real estate and operations to private equity giant Apollo Global Management for about $6.25 billion. The properties include the Venetian Resort Las Vegas and the Sands Expo and Convention Center. Shares of Las Vegas Sands were up almost 3% in the premarket. Apollo fell nearly 1%.\n\n&gt; * Oscar Health is set to debut Wednesday on the New York Stock Exchange. The health insurance startup backed by Google-parent Alphabet priced its initial public offering Tuesday evening at $39 per share, above the already-raised expected range of $36 to $38. The IPO gives Oscar Health a market value of $7.7 billion ahead of trading.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mFJEZLD.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/DZktsvp.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #1!](https://i.postimg.cc/Yq2hHN9S/econcal1.png)**)\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #2!](https://i.postimg.cc/FFV78Chq/econcal2.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zRvHdP7.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/PbURZ3R.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/oqzviWR.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/HGdMXO8.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/978P5c5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK!](https://i.imgur.com/2Ltoqja.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.postimg.cc/d0wfH06g/upgradesdowngrades1.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.postimg.cc/52wGSzBw/upgradesdowngrades2.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.postimg.cc/nh8gm2DF/upgradesdowngrades3.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/85n5bWw.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/3PemF5S.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/0YIFXZl.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* OCGN\n* KMPH\n* RKT\n* TRXC\n* UWMC\n* OVID\n* FUBO\n* DIA\n* HZON\n* GENE\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/03/03/stocks-making-the-biggest-moves-in-the-premarket-lyft-las-vegas-sands-wendys-more.html)**)\n\n*****\n\n&gt; **Lyft (LYFT)** – The ride-hailing company said that last week saw the highest level of ride volume since the pandemic took hold last March. As a result, Lyft expects to report a smaller quarterly loss than it had previously projected. Lyft shares jumped 5.6% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** LYFT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LYFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LYFT)**)\n\n*****\n\n&gt; **Las Vegas Sands (LVS)** – The casino operator’s shares rose 3% in the premarket after it announced a deal to sell its Las Vegas properties to private-equity firms Apollo Global (APO) and VICI Properties for $6.25 billion. The sale includes The Venetian Resort Las Vegas and the Sands Expo and Convention Center. Apollo Global shares gained 2.1%.\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n&gt; **Wendy’s (WEN)** – The restaurant chain missed estimates by a penny a share, with quarterly earnings of 17 cents per share. Revenue came in short of forecasts as well. Global comparable sales rose 4.7%, shy of the FactSet consensus estimate of 5.7% due primarily to international weakness. Its shares fell 3.3% in the premarket.\n\n&gt; #**STOCK SYMBOL:** WEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WEN)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** – The discount retailer earned $2.13 per share for the fourth quarter, beating estimates by 2 cents a share. Revenue essentially was in line with expectations. Comparable-store sales rose 4.9%, short of the 5.5% estimate of analysts surveyed by FactSet. The company’s shares fell 2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **Hewlett Packard Enterprise (HPE)** – HPE beat estimates by 11 cents a share, with quarterly earnings of 52 cents per share. The enterprise computing hardware maker’s revenue came in above forecasts as well. The company issued strong guidance for both the current quarter and full year, as it continues to benefit from the pandemic-inspired digital transformation.\n\n&gt; #**STOCK SYMBOL:** HPE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HPE)**)\n\n*****\n\n&gt; **Box (BOX)** – Box reported quarterly earnings of 22 cents per share, 5 cents a share above estimates. Revenue beat projections as well. The online data storage company also issued a better-than-expected full-year outlook and expects that the current quarter will see revenue above $200 million for the first time.\n\n&gt; #**STOCK SYMBOL:** BOX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BOX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BOX)**)\n\n*****\n\n&gt; **Nordstrom (JWN)** – Nordstrom earned 21 cents per share for its latest quarter, 7 cents a share above estimates. The retailer also reported better-than-expected revenue. Nordstrom was helped by a boost in digital sales as well as growth in its off-price operation, but the retailer warned that it would have to clear excess holiday inventory through that off-price channel. Shares fell 2.6% in premarket action.\n\n&gt; #**STOCK SYMBOL:** JWN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=JWN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/JWN)**)\n\n*****\n\n&gt; **FuboTV (FUBO)** – FuboTV reported quarterly revenue in excess of $100 million for the first time, with the live sports streaming company reporting a better-than-expected $105.1 million in sales. Subscriber numbers jumped 73% from a year earlier to a total of 548,000. Its shares fell 4% in the premarket, however, following a nearly 50% year-to-date jump.\n\n&gt; #**STOCK SYMBOL:** FUBO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FUBO)**)\n\n*****\n\n&gt; **Rocket Companies (RKT)** – Rocket shares have been volatile in premarket trading after more than doubling over the past three sessions. The Quicken Loans and Rocket Mortgage parent has been garnering increasing attention in online forums, with investors noting the high level of short interest. Rocket shares fell 5.5% in premarket action.\n\n&gt; #**STOCK SYMBOL:** RKT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RKT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RKT)**)\n\n*****\n\n&gt; **Urban Outfitters (URBN)** – Urban Outfitters beat estimates by 2 cents a share, with quarterly earnings of 30 cents per share. The apparel retailer’s revenue fell slightly below Wall Street forecasts, however, and gross profit margins dropped more than 3 percentage points from a year earlier. Its shares fell 1.6% in the premarket.\n\n&gt; #**STOCK SYMBOL:** URBN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=URBN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/URBN)**)\n\n*****\n\n&gt; **Ross Stores (ROST)** – Ross Stores sank 3.1% in the premarket after it reported quarterly earnings of 67 cents per share, below the $1.00 a share consensus estimate. The discount retailer’s revenue came in below estimates as well, hurt by pandemic-related store closures in California.\n\n&gt; #**STOCK SYMBOL:** ROST\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ROST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ROST)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, March 3rd, 2021! :)**",
        "subreddit": "smallstreetbets",
        "title": "(3/3) Wednesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lwu2vs/33_wednesdays_premarket_stock_movers_news/",
        "created": 1614807542.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1614778539,
        "id": "lwu0fq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to Wednesday! Here are your pre-market stock movers &amp; news on this Wednesday, March 3rd, 2021-\n\n*****\n\n# [5 things to know before the stock market opens Wednesday](https://www.cnbc.com/2021/03/03/5-things-to-know-before-the-stock-market-opens-march-3-2021.html)\n\n*****\n\n&gt; # 1. Dow futures jump after Tuesday’s early gain fizzles and reverses\n\n&gt; * The Dow is set to rise 200 points Wednesday after late-day selling reversed strong gains earlier in Tuesday’s session. Coming off their best days since November, the 30-stock average Tuesday fell 0.5% and the Nasdaq dropped 1.7% as tech stocks pulled back. The S&amp;P 500 slid 0.8%, a day after its biggest one-day advance since June.\n\n&gt; * The latest ADP report on private sector employment is set for release at 8:30 a.m. ET, one hour before Wall Street’s open. U.S. companies are expected to have added 225,000 new jobs in February compared to January of gains 174,000 positions. The ADP lately has not been the best predictor of the government’s monthly jobs report, which comes out Friday.\n\n*****\n\n&gt; # 2. Senate to begin debate soon on $1.9 trillion Covid relief bill\n\n&gt; * The Senate is expected to start debate as soon as Wednesday on its version of the House-passed, $1.9 trillion Covid relief bill. However, it excludes a federal minimum wage boost to $15 per hour. President Joe Biden on Tuesday urged Democrats to stand united and approve the measure, even as some party moderates sought to dial back parts of the package. Democrats, with the slimmest of margins in the Senate, are using special rules that would allow them to pass the bill without GOP support.\n\n*****\n\n&gt; # 3. U.S. will have enough Covid vaccines for ‘every adult’ by end of May\n\n&gt; * The U.S. will have a large enough supply of coronavirus vaccines to inoculate “every adult in America” by the end of May, two months earlier than previously expected, Biden said at the White House on Tuesday. The announcement came as the administration works to increase production of Johnson &amp; Johnson’s newly cleared single-shot vaccine, and rival Merck agrees to pitch in.\n\n&gt; * The Republican governors of Texas and Mississippi both announced Tuesday that they’re lifting mask mandates in their states and allowing businesses to reopen at full capacity even as the decline in new daily Covid-19 cases slows. CDC Director Dr. Rochelle Walensky on Monday warned states against lifting public health restrictions too quickly.\n\n*****\n\n&gt; # 4. America’s biggest firms push for path to citizenship for ‘Dreamers’\n\n&gt; * America’s biggest companies are urging Congress to establish a permanent path to citizenship for undocumented immigrants brought to the U.S. as children. In a letter Wednesday, a coalition of more than 100 companies and trade associations — including Facebook, General Motors, Marriott, Target, Visa and Uber — asked Senate leaders Chuck Schumer, D-N.Y., and Mitch McConnell, R-Ky., to pass the bipartisan Dream Act of 2021. The move comes as Biden and Democrats on Capitol Hill look to immigration as a major legislative priority.\n\n*****\n\n&gt; # 5. Stocks to watch: Rocket Companies, Las Vegas Sands, Oscar Health\n\n&gt; * Rocket Companies fell 6% in Wednesday’s premarket trading after more than doubling over the past three sessions. On Tuesday, the Quicken Loans and Rocket Mortgage parent surged over 71% on no apparent news. The heavily shorted stock appears to have garnered bullish interest from day traders on Reddit’s WallStreetBets forum.\n\n&gt; * Casino operator Las Vegas Sands said Wednesday it would sell its Vegas real estate and operations to private equity giant Apollo Global Management for about $6.25 billion. The properties include the Venetian Resort Las Vegas and the Sands Expo and Convention Center. Shares of Las Vegas Sands were up almost 3% in the premarket. Apollo fell nearly 1%.\n\n&gt; * Oscar Health is set to debut Wednesday on the New York Stock Exchange. The health insurance startup backed by Google-parent Alphabet priced its initial public offering Tuesday evening at $39 per share, above the already-raised expected range of $36 to $38. The IPO gives Oscar Health a market value of $7.7 billion ahead of trading.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mFJEZLD.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/DZktsvp.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #1!](https://i.postimg.cc/Yq2hHN9S/econcal1.png)**)\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #2!](https://i.postimg.cc/FFV78Chq/econcal2.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zRvHdP7.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/PbURZ3R.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/oqzviWR.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/HGdMXO8.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/978P5c5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK!](https://i.imgur.com/2Ltoqja.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.postimg.cc/d0wfH06g/upgradesdowngrades1.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.postimg.cc/52wGSzBw/upgradesdowngrades2.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.postimg.cc/nh8gm2DF/upgradesdowngrades3.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/85n5bWw.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/3PemF5S.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/0YIFXZl.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* OCGN\n* KMPH\n* RKT\n* TRXC\n* UWMC\n* OVID\n* FUBO\n* DIA\n* HZON\n* GENE\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/03/03/stocks-making-the-biggest-moves-in-the-premarket-lyft-las-vegas-sands-wendys-more.html)**)\n\n*****\n\n&gt; **Lyft (LYFT)** – The ride-hailing company said that last week saw the highest level of ride volume since the pandemic took hold last March. As a result, Lyft expects to report a smaller quarterly loss than it had previously projected. Lyft shares jumped 5.6% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** LYFT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LYFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LYFT)**)\n\n*****\n\n&gt; **Las Vegas Sands (LVS)** – The casino operator’s shares rose 3% in the premarket after it announced a deal to sell its Las Vegas properties to private-equity firms Apollo Global (APO) and VICI Properties for $6.25 billion. The sale includes The Venetian Resort Las Vegas and the Sands Expo and Convention Center. Apollo Global shares gained 2.1%.\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n&gt; **Wendy’s (WEN)** – The restaurant chain missed estimates by a penny a share, with quarterly earnings of 17 cents per share. Revenue came in short of forecasts as well. Global comparable sales rose 4.7%, shy of the FactSet consensus estimate of 5.7% due primarily to international weakness. Its shares fell 3.3% in the premarket.\n\n&gt; #**STOCK SYMBOL:** WEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WEN)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** – The discount retailer earned $2.13 per share for the fourth quarter, beating estimates by 2 cents a share. Revenue essentially was in line with expectations. Comparable-store sales rose 4.9%, short of the 5.5% estimate of analysts surveyed by FactSet. The company’s shares fell 2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **Hewlett Packard Enterprise (HPE)** – HPE beat estimates by 11 cents a share, with quarterly earnings of 52 cents per share. The enterprise computing hardware maker’s revenue came in above forecasts as well. The company issued strong guidance for both the current quarter and full year, as it continues to benefit from the pandemic-inspired digital transformation.\n\n&gt; #**STOCK SYMBOL:** HPE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HPE)**)\n\n*****\n\n&gt; **Box (BOX)** – Box reported quarterly earnings of 22 cents per share, 5 cents a share above estimates. Revenue beat projections as well. The online data storage company also issued a better-than-expected full-year outlook and expects that the current quarter will see revenue above $200 million for the first time.\n\n&gt; #**STOCK SYMBOL:** BOX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BOX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BOX)**)\n\n*****\n\n&gt; **Nordstrom (JWN)** – Nordstrom earned 21 cents per share for its latest quarter, 7 cents a share above estimates. The retailer also reported better-than-expected revenue. Nordstrom was helped by a boost in digital sales as well as growth in its off-price operation, but the retailer warned that it would have to clear excess holiday inventory through that off-price channel. Shares fell 2.6% in premarket action.\n\n&gt; #**STOCK SYMBOL:** JWN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=JWN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/JWN)**)\n\n*****\n\n&gt; **FuboTV (FUBO)** – FuboTV reported quarterly revenue in excess of $100 million for the first time, with the live sports streaming company reporting a better-than-expected $105.1 million in sales. Subscriber numbers jumped 73% from a year earlier to a total of 548,000. Its shares fell 4% in the premarket, however, following a nearly 50% year-to-date jump.\n\n&gt; #**STOCK SYMBOL:** FUBO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FUBO)**)\n\n*****\n\n&gt; **Rocket Companies (RKT)** – Rocket shares have been volatile in premarket trading after more than doubling over the past three sessions. The Quicken Loans and Rocket Mortgage parent has been garnering increasing attention in online forums, with investors noting the high level of short interest. Rocket shares fell 5.5% in premarket action.\n\n&gt; #**STOCK SYMBOL:** RKT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RKT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RKT)**)\n\n*****\n\n&gt; **Urban Outfitters (URBN)** – Urban Outfitters beat estimates by 2 cents a share, with quarterly earnings of 30 cents per share. The apparel retailer’s revenue fell slightly below Wall Street forecasts, however, and gross profit margins dropped more than 3 percentage points from a year earlier. Its shares fell 1.6% in the premarket.\n\n&gt; #**STOCK SYMBOL:** URBN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=URBN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/URBN)**)\n\n*****\n\n&gt; **Ross Stores (ROST)** – Ross Stores sank 3.1% in the premarket after it reported quarterly earnings of 67 cents per share, below the $1.00 a share consensus estimate. The discount retailer’s revenue came in below estimates as well, hurt by pandemic-related store closures in California.\n\n&gt; #**STOCK SYMBOL:** ROST\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ROST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ROST)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, March 3rd, 2021! :)**",
        "subreddit": "StockMarket",
        "title": "(3/3) Wednesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/StockMarket/comments/lwu0fq/33_wednesdays_premarket_stock_movers_news/",
        "created": 1614807339.0
    },
    {
        "author": "SnooObjections5334",
        "created_utc": 1614709311,
        "id": "lw8tdp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "This is the most identical company by market cap to GME pump and short float.  \nIts at 500 mil market cap, exactly the same as GME when it took off. 46% short float.   \n\n\nUnlike GME, this company has potential AFTER sqz fundamentally.  \n\n\nhttps://preview.redd.it/ig4x0aalpnk61.png?width=1676&amp;format=png&amp;auto=webp&amp;s=14c14fec8565ea7589cb86623d991e6301b6a005\n\nThis is a case to squueze short with buy and hold because the company has upcoming FDA dates and most importantly increasing revenue. You are on the lowest point of entry right now, ever. Buy and wait for more decisions and for 2020 approvals to start generating more profit.  \n\n\nUPCOMING FDA DECISIONS:  \n\n\n**Opdivo and Rubraca ATHENA** \\- PHASE 3 and most important phase for movement.\n\n*Ovarian Cancer (* **200,000**  cases in US yearly) *- First-line maintenance treatment*\n\n  \n**Rucaparib ARIEL4**\n\n*Relapsed ovarian cancer patients with BRCA mutations PHASE 3*  \n\n\n **Rucaparib - LODESTAR**   *Solid tumors*   Phase 2\n\n**FAP-2286** *FAP-positive tumors* Phase 1/2  \n\n\nhttps://preview.redd.it/oisdz5wopnk61.png?width=872&amp;format=png&amp;auto=webp&amp;s=8925b3b970500cc085957dcc6c43a92170891549\n\n**Revenue**:\n\n2017 71067% YOY increase  \n2018 71.84% YOY increase.  \n2019 49.92 % YOY increase  \n2020 15.05% YOY increase.  \n\n\n**Gross Profit:**  \n2017: 547075% YOY increase  \n2018: 67.48%  YOY increase  \n2019: 47.75 YOY increase  \n2020: 13.75% YOY increase  \n\n\nYea, their revenue and profits slowed in 2020, but its logical given the covid case when most companies went negative on profits.   \n\n\nhttps://preview.redd.it/s8lki0jqpnk61.png?width=1101&amp;format=png&amp;auto=webp&amp;s=8179fddc15aa83a149192d9f955eb90af2569aaa\n\n  \n\n\n  \n\n\n CLVS has a pipeline of cancer drugs dealing with solid tumors.\n\nRucaparib\n\n[Rucaparib](https://clovisoncology.com/pipeline/rucaparib/), an oral, small molecule inhibitor of poly (ADP-ribose) polymerase (PARP)1, 2 and 3 is being developed in multiple tumor types, including ovarian and prostate cancers, as monotherapy and in combination with other anti-cancer agents.  Exploratory studies in other tumor types are also underway. Clovis holds global rights for rucaparib.\n\nLucitanib\n\n[Lucitanib](https://clovisoncology.com/pipeline/lucitanib/), an investigational angiogenesis inhibitor, which inhibits vascular endothelial growth factor receptors 1 through 3 (VEGFR1-3), platelet-derived growth factor receptors alpha and beta (PDFGRα/β) and fibroblast growth factor receptors 1 through 3 (FGFR1-3). Emerging clinical data support the combination of angiogenesis inhibitors and immunotherapy to increase effectiveness in multiple cancer indications. Angiogenic factors, such as vascular endothelial growth factor (VEGF), are frequently up-regulated in tumors and create an immunosuppressive tumor microenvironment. Use of antiangiogenic drugs may reverse this immunosuppression and augment response to immunotherapy. Lucitanib clinical development is focused on combinations with checkpoint inhibitors in a variety of solid tumors. Clovis holds global rights for lucitanib excluding China.\n\nFAP-2286 and Peptide-Targeted Radionuclide Development Program\n\nThe Company’s peptide-targeted radiopharmaceutical therapy development program includes lead compound [FAP-2286](https://clovisoncology.com/pipeline/fap-2286/) and three additional unnamed preclinical targets discovered by 3B Pharmaceuticals. The initial focus is on developing FAP-2286, a peptide-targeted radionuclide therapy (PTRT) and imaging agent targeting fibroblast activation protein (FAP). FAP consists of two parts: a peptide that binds to FAP and a linker and site that can be used to attach radiation for imaging and therapeutic use. FAP is highly expressed in many epithelial cancers, including more than 90 percent of breast, lung, colorectal and pancreatic carcinomas.1 Clovis plans to initiate a broad clinical development program for FAP-2286 as a FAP-targeted therapeutic agent in the first half of 2021. Clovis holds global rights for the discovery program and for FAP-2286 holds U.S. and global rights, excluding Europe.",
        "subreddit": "wallstreetbets",
        "title": "Reload. CLVS. Clovis Oncology",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lw8tdp/reload_clvs_clovis_oncology/",
        "created": 1614738111.0
    }
]