[
    {
        "author": "zanoo911",
        "created_utc": 1625970134,
        "id": "ohvzti",
        "num_comments": 164,
        "num_crossposts": 0,
        "selftext": "I've collected 150 stocks, I know it's too many, so I would appreciate some help disqualifying the obvious mistakes. Most of these are either tech stocks, especially cloud, or on some list, like Dividend Kings, or Aristocrats. My goal is to have the absolute best growth stocks, then also growth stocks that also pay increasing dividends, a combination approach, plus a few spec on the side. I have a medium-high risk tolerance and 15 year + Horizon. \n\n* I will keep APL ADBE BABA BIDU COST HD HON INTC KO MA MSFT NVDA O PEP PYPL T TCEHY TGT TXN UNH V \n\n* but I am less certain on others like ABB ABM ACN ADP AMAT APPH APPN ARCC ASML AVGO BAC BLK CMCSA COIN CRM CRWD CSCO DD DDOG DOCU DPZ DUK ENPH ETSY FDX FSLY GILT HVBT IRDM ISRG JMIA JPM LOGI LRCX LSCC MELI MP MRVL MU NEE NET NIO NOW ORA ORCL PAYX PG PLUG PNR PSA QCOM RNG ROKU ROP SE SEDG SNOW SPCE SPLK SQ SWKS TDOC TTD TTWO UPS VSAT WELL XEL ZEN ZG ZM ZS \n\n* and others on those dividend lists such as: ADI AIZ AMT ANTM APD ATO ATR AWK AWR BANF BMI BRO CAT CB CBU CFR CHD CINF CL CLX CME CMI CSL CSX CTBI DCI DOV EMR ESS EXPD FAST FELE GPC HTD ITW JKHY LANC LECO LIN MCHP MCO MGRC NDSN NUE PH RPM SPGI TROW UNP WEC WM",
        "subreddit": "stocks",
        "title": "Way too many stocks to choose from...",
        "url": "https://www.reddit.com/r/stocks/comments/ohvzti/way_too_many_stocks_to_choose_from/",
        "created": 1625998934.0
    },
    {
        "author": "RatinSweet",
        "created_utc": 1627152694,
        "id": "oqvv14",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "I get the traditional advice of diversification, but if a) you’re a high earner b) you have high risk tolerance and c) you’re young, then what’s wrong with investing a select few blue chips or high growth potential companies? For example, what if you invested all your money into Google, Tesla, and AMD/NVDA? In my view, earning 13% YoY in SPY is for sure safe, but several companies have the potential to do much better. I personally wouldn’t invest in a ton of companies in the S&amp;P500 like Cisco or Texas Instruments. I would rather have my money in something like Apple instead. Thoughts?",
        "subreddit": "stocks",
        "title": "Investing in individual companies as a way to build wealth",
        "url": "https://www.reddit.com/r/stocks/comments/oqvv14/investing_in_individual_companies_as_a_way_to/",
        "created": 1627181494.0
    },
    {
        "author": "UltimateTraders",
        "created_utc": 1625618113,
        "id": "of7xyf",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "Hello everyone, since I have come on Reddit late January I have been asked this many times, almost daily. I have told people eventually when I have more time I will write a post on it. There was no debate this is probably the most asked question that I have….Well why do you day trade? Well 50 cents isn’t good enough for me? You trade for 5 to 10 cents? That makes no sense.\n\n**I was going to write this post it was just when, not if. Please remember I am not a journalist, I am not compensated to write these, so when I spend hours writing a post and pour insight from a real trader that is on the battlefield everyday since 1995 it does mean much more then an author or even most money managers. I am on the war path watching the movement all day. Now, if I ever publish a book in my mid 50s this will probably go into it, because this isn’t even full details but will at least get the message across and ideas of what Long, Swing, Day Trade. The first few paragraphs were what forced me to trade sooner, and how I started you can skip that if you want.**\n\nI am going to go back to how I started in 1995 and It matters because it is why, I started as a swing trader that held positions from 1-6 months or even a year… It slowly evolved and I pretty much try to liquidate my account to have other opportunities the next trading day.\n\nI am not exactly sure if I started in 1994 or 1995, it was probably the end of 1994. I was 14 or 15, I was always crazy about cars, and could not wait to buy a used car, even if it was a beat up Oldsmobile. My Uncle lived in Long Island in a very fancy estate and did not work at all. He was in his late 30’s and always spent time with my brother and I. I remember saying Uncle Andrew, you do so well, when I am 16 or 17 if I can save up to buy a car that would be a dream. He told me he would give me something even more valuable then money to buy the car. Naturally, I was piqued, I knew nothing about the stock market but here I am with $2,000 and my Uncle tells me there are ways I can definitely by the time I am 17, not only have a car but not some cheap Oldsmobile. He put me in touch with a broker he knew from JB Oxford. He told me to read the Wall Street Journal everyday and would quiz me on articles. I opened an account with JB with the $2,000 and at that time trades were $50, they did allow the first 5 trades free because of his relationship with my uncle. I started to read and my uncle told me his preference for long term, and his strategy. My first investments were things he and I both agreed upon. Coke KO, Disney DIS, Philip Morris MO, American Power APC which got bought by Cisco eventually. So I put $500 in each of these 4 and let them grow. I would watch everyday in the journal and find the tickers, AOL didn’t get big until 1996. It was his guidance that caused me to hold them long. Eventually after close to a year the account was almost doubled at near $4,000.\n\nNow by the time I was 16, AOL was booming and I got internet access right away. My uncle was old school and read the paper everyday. Eventually I could get quotes immediately online, and get information much quicker. I started to realize that if I time these things and could get quotes throughout the day I could make that money faster and even more. I was going off of end of day quotes. And I would call Anthony my broker from JB Oxford the next day and place a limit order….once a year. As I called him more and more because I was getting mid day quotes, he took to a liking of me. He invited me to the city and to meet with other brokers. I started to see the platforms, the super computers, I met market makers, important people. Some of which invited me daily. I started to write important stuff, keep a journal on AOL. By the time, I was 17 I was a swing trader, I could name the Dow 30, and pretty much the entire SP500. I could tell you roughly the closing prices on them all. (I cant even do that now). I was labeled the chosen one…”Ultimate” by market makers…. In 1997/1998 JB was about to be bought out eventually I believe it happened in 2000, but I say that because I opened an Etrade account, in case, as Anthony warned me. Etrade was charging $29.95 per trade and could be done online. **ONLINE TRADES?? AND JUST $30!!!** Yea you cant imagine how funny that sounds now. The purpose of this paragraph is that when online trading came and just at $30 per trade. I moved from most of my positions being held for 1-3 months to 1 month. Remember I started at like 6 months to a year, to trading and hanging out with brokers and holding 1-3 months to just 1 month. With the evolution of information and discounted trading I traded more and more. I don’t know exactly the year, but I called TD Ameritrade which started to grow at the time. Etrade came down to $19.95 per trade. Ameritrade told me if I could do at least 30 trades a month they will discount me to $14.95……Boom, JB was bought out…I now had an account with etrade and ameritrade. I was enticed to trade more actively with discounted trades. Eventually I called etrade and told them I would like to close the account my $14.95 per trade at Ameritrade was awesome. Etrade fought for more hard. They said if I made 150 trades a quarter they would retro back to the trades in the quarter and make it $9.95 per trade. Ameritrade said If I could do 150 trades they would match the $9.95 per trade and give me 10 free trades! It was a crazy back and forth the whole time I didn’t close either account and I was forced to make crazy trades for these discounts. I was forced to be a day trader, but I started to get a great skill set. At 1 point etrade almost demanded I close the Ameritrade and said they were creating a new division called Platinum/Power Etrade and if I keep my 150 trades a quarter they are paying for DSL (High Speed Internet) WOW! You are all so spoiled, you have no idea how bad 56K dial up is. And around the year 2001/2002 when I had DSL (which is now extinct) It was like 300MB download so 6x 56K phone dial up, but no one had it. No one, if you had DSL it had to be like some big bank or someone really important. It was like $400 a month remember this was 2001/2002. So I was pretty much forced to be day trading but I developed a good skill set. They both told me trading less I would lose the discounts…..Etrade said I would pay a discounted rate of $200 per month for DSL if I didn’t make enough trades.\n\nBy around 2005/2006 I am not sure how, but other brokers started to catch wind of me being an active day trader. Still don’t know how but at that time there wasn’t nearly as many traders, trades. Fidelity called me and didn’t want to take no for an answer. They offered me $7 per trade if I could make 100 trades a quarter. So here I was with 3 different accounts (Opened for commission discounts, freebies), because commissions could eat into cost. So I had the 3 accounts Etrade, Ameritrade, Fidelity.\n\nAround this time, I was about 25 and decided to open an IRA with Chase, because I had no 401K of course. So that is how I have the Chase account. I started IRA’s at 25.\n\nThe above paragraphs are to describe the evolution and I guess forced hand at being a day trader in order to receive discounts. I kid you not that there were probably quarters where I did 1,000 trades. They all worked by quarters, not months. Eventually I got a cable modem, and trading was discounted and I was not required to trade as much.\n\n**Now this is for more, because I have so many years experience. This may not work for you, or your comfort level. I compiled watch lists of over 800 tickers, I have studied their patterns, read their finances. I say this because it may be easy for me to take a stock and trade it for 10, 50 or 75 cents.**\n\nThere is always a trade for me, if I want it. I have lists which I said you should make in my posts about daily routine. So that I don’t have to search for symbols. I simply click a situation and I have the symbols right there and I can trade. Defensive, Power Plays (High Pe, NO PE, Hyper Growth), Dividends, Finance, Insurance, Dow, Top SP, you get the picture. Why this is important is I don’t have to scour and search everywhere for a play or news. I can click a list and see anything abnormal so there is always a trade for me, if I want it.\n\n**Some bloody days, it is better to sit on the sidelines and do nothing. On a typical day I may do 2-4 rounds (BUY/SELL) On a bad day I do 0 of course**\n\n**I do not set stop losses. My stocks have fundamentals, if you trade garbage you get garbage and you may lose. I keep NIO, LMND, SNOW on lists so I can laugh.**\n\n**I haven’t shorted since 2014 (TSLA), I haven’t bought options since 2017 (Puts on TSLA). I learned the had way shorting you cant go against a cult stock or freight train. Options I learned it’s a gamble you win or go home. Though I was very successful earlier, but I lost 50k on the short and 25K on TSLA puts. We must learn from our mistakes.**\n\nNow a couple of reasons why day trading is better\n\nYou keep cash ready for an opportunity the next day. Yesterdays crazy drop, and rally. Unfortunately, my portfolio was about 66% stocks, and 33% LL which I don’t like to do so I have opportunity. I generally like to have at least 50-66% of cash ready. Unfortunately, I do not take losses, and my day trades turn into swing trades. Generally they never last more then 5 to 10 business days. My longest recently was 7-8 on Allstate which I sold at 106…. Now it is 112 on a defensive market.\n\nThose 25-50 cents add up quickly. I made an example in 1 of my posts usig RKT. I started trading RKT about 19-20. The market hates RKT and even after awesome earnings it comes down. Also, now everything is commission free!!! I literally have gotten about $20 on RKT, that is how much I have scooped with that 25 to as much as a dollar. **There are plenty of very successful day traders that pick 5 to 10 stocks and trade them for a living!** As a kid, I saw market makers that would focus on 2-3 all day the same ones for a month.\n\nOn VRM I probably made about the same with 50 cents to 2 dollars. Knowing and studying the patterns is critical if you want to be a day trader. Before VRM took off. I carefully studied the pattern from 33-38 over a 60 day period and once it blasted thru 38 I did not trade it until this past Thursday. Yes, of course stocks can blow by comfortable trading levels and we must pivot and do something else\\*\\*. HELLO 800 TICKERS!\\*\\*\n\nIf you do not plan on viewing stocks daily, or weekly I actually recommend Index funds like the RUSSELL 2000, the SP500, the Nasdaq 100….. Do not buy mutual funds (heavy fees) and I do not recommend ETF’s way riskier and higher fees than index funds. Look at the superstar Cathie that’s now down over 20%. I look at her portfolio and laugh. So no ETFS! Do not be a stock picker if you don’t plan to reevaluate at least every quarter on an earnings report. Things can change on a dime. Did you see VRM!!!!\n\n**Yes there are Apples, Netflix, Amazon, Invisalign (All which I did own), but remember there are close to 10,000 stocks that trade so what is the probability you own the next best thing since sliced bread?**\n\n**Trading a lot is about probability, risk on the upside, the downside. Market sentiment, as we see interest rates etc. You must monitor or I suggest the index funds.**\n\n**If you plan to be a great trader it takes a ton of patience, reading, experience and seeing the market. Do not believe you can quit your job and be a day trader for life unless you are willing to do that? Did you read my daily routine? I follow that to this day!! Will you? If you do not or 1 day decide to wake up late you can see red crayons for a while. The other day a reddit user whom I like and he messages me daily went on the hype train with RKT, though it was against my advice. He had a chance to get out and be slightly profitable the next morning. Instead he partied and drank the night before and now RKT is 24……….Do you know what a mistake that was? And from what he says he has 3,000 shares…. Do you see how costly that error was. I am not naming names but he knows if he reads this who he is. And I am not saying this to make him feel bad. I am saying this because to be successful this is not a game, it may seem like it until red crayons and you need the money.**\n\n**Lastly, do not believe I will continue to do this with no compensation forever. Do not think you all can sleep wake up, get great plays, make money and the next day just rinse and repeat. I will stay on Reddit and will not close the forum/group. My posts will remain as great insights from a trader. I do not know what I plan to do yet. My 60 day experiment will end March 31st. What I can say, is that I will absolutely not spend 2-3 hours a day on reddit with no compensation. I am happy if everyone around me learns and makes money. But I also want to land that 500K job, yup it’s a long shot but I was giving the experiment 60 days. And yes, Wall Street Journal did reach out to me…..but once I said I wanted 500k… everyone got quiet. Listen, I have to make more than Im making now. I have to be able to retire from my W2, maybe stop doing computers for this to be worthwhile.**\n\n**So 3 hours later, yup took me 3 hours to write this, I hope it helps. And remember I am not a journalist with an opinion, I am not an author writing in past tense with old experiences on trading. I am on the front lines with you! Battling out! Seeing the blood, rallying the troops!**\n\nGood luck and happy trading!",
        "subreddit": "smallstreetbets",
        "title": "What is better more effective? Day Trading? Swing Trading? Long term? What is the strategy? Tips?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/of7xyf/what_is_better_more_effective_day_trading_swing/",
        "created": 1625646913.0
    },
    {
        "author": "zanoo911",
        "created_utc": 1625969497,
        "id": "ohvu7r",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I've collected 150 stocks, I know it's too many, so I would appreciate some help disqualifying the obvious mistakes. Most of these are either tech stocks, especially cloud, or on some list, like Dividend Kings, or Aristocrats. My goal is to have the absolute best growth stocks, then also growth stocks that also pay increasing dividends, a combination approach, plus a few spec on the side. I have a medium-high risk tolerance and 15 year + Horizon. \n\n* I will keep APL ADBE BABA BIDU COST HD HON INTC KO MA MSFT NVDA O PEP PYPL T TCEHY TGT TXN UNH V \n\n* but I am less certain on others like ABB ABM ACN ADP AMAT APPH APPN ARCC ASML AVGO BAC BLK CMCSA COIN CRM CRWD CSCO DD DDOG DOCU DPZ DUK ENPH ETSY FDX FSLY GILT HVBT IRDM ISRG JMIA JPM LOGI LRCX LSCC MELI MP MRVL MU NEE NET NIO NOW ORA ORCL PAYX PG PLUG PNR PSA QCOM RNG ROKU ROP SE SEDG SNOW SPCE SPLK SQ SWKS TDOC TTD TTWO UPS VSAT WELL XEL ZEN ZG ZM ZS \n\n* and others on those dividend lists such as: ADI AIZ AMT ANTM APD ATO ATR AWK AWR BANF BMI BRO CAT CB CBU CFR CHD CINF CL CLX CME CMI CSL CSX CTBI DCI DOV EMR ESS EXPD FAST FELE GPC HTD ITW JKHY LANC LECO LIN MCHP MCO MGRC NDSN NUE PH RPM SPGI TROW UNP WEC WM",
        "subreddit": "StockMarket",
        "title": "Help me disqualify these stocks",
        "url": "https://www.reddit.com/r/StockMarket/comments/ohvu7r/help_me_disqualify_these_stocks/",
        "created": 1625998297.0
    },
    {
        "author": "feelthebern5G",
        "created_utc": 1625260559,
        "id": "ocjnmu",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Sold Gene Options this week, holding 100k cash. Bought IBM, CSCO, KHC, WBA for 1% div yield target",
        "url": "https://www.reddit.com/gallery/ocjnmu",
        "created": 1625289359.0
    },
    {
        "author": "wilhouse",
        "created_utc": 1627732247,
        "id": "ov5rvj",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "I have about $1500 in my trading account (have a seperate  long term retirement accoubt) that I'm looking to grow by trading options. I'm kind of learning towards the more conservative side of being an option seller but even for the lower end of the company's that I have in my watchlist (AMD, CSCO, DKNG, T, UAA, WFC) CSP and CC strategies are affordable.   I've tried put credit spreads and condors but I feel like I'm constantly getting burned on them especially when played around earnings. \n\nIdk if I'm just picking spreads that are to close to expiry or not with a large enough PoP because I'm either taking them for a max loss or barely being able to close them out for little to no profit. \n\nCurrently have this account open on RH.  Thanks for any feedback.",
        "subreddit": "options",
        "title": "Picking strategies for growing a small account?",
        "url": "https://www.reddit.com/r/options/comments/ov5rvj/picking_strategies_for_growing_a_small_account/",
        "created": 1627761047.0
    },
    {
        "author": "Tomkila",
        "created_utc": 1627648342,
        "id": "oujpdx",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Automotive Hypervisor Market Statistics 2030 -\n\nThe global automotive hypervisor market was valued at $131.20 million in 2020, and is projected to reach $2,037.60 million by 2030, registering a CAGR of 31.9% from 2021 to 2030.  \n[COVIDIMPACTSTATEMENT]     \nAutomotive hypervisor is an embedded technology specially designed for automobiles and is used for in-vehicle infotainment purpose. It is a set of programs which is capable to perform numerous virtual machine operations through operating system (OS) on a host system. Typically, hypervisors are low-level programs designed in virtualization that allows a single processor to be shared with multiple applications that run on different operating systems. Moreover, hypervisor can be called as a computer software that allows multiple operating systems to utilize a common CPU, memory, etc. and also decides the hardware allocation for each of the program. Generally two types of hypervisors i.e. Type 1 &amp; Type 2 are designed, which are used in automobiles and its application depends on the architecture of the vehicle system.\nAutomotive-Hypervisor-Market-2021-2030\t\nGet more information on this report : Request Sample Pages\nFactors such as growth of connected infrastructure, adoption of ADAS features in vehicles and intervention of innovative technologies for advanced user interface (UI) supplements the growth of the global automotive hypervisor market. Moreover, the factors such as high manufacturing cost and troubleshooting &amp; maintenance of automotive software hampers the growth of the global automotive hypervisor market. However, the factors such as improved performance of autonomous vehicles and data monetization in extended automotive ecosystem are the factors that are expected to create a positive impact on the growth of the automotive hypervisor market in the near future.\n[VEHICLETYPEGRAPH]\nGet more information on this report : Request Sample Pages\nThe global automotive hypervisor market is segmented into vehicle type, type, level of automation, vehicle class and region. Based on the vehicle type, the market has been segmented into passenger cars, light commercial vehicles and heavy commercial vehicles. Based on type, the automotive hypervisor market has been segmented into Type 1 and Type 2. Based on the level of automation, the market has been segmented into semi-autonomous and fully autonomous. Based on the vehicle class, the market has been segmented into mid-priced and luxury. By region, the global market is analyzed across North America, Europe, Asia-Pacific and LAMEA. \nThe key players operating in the global automotive hypervisor market include BlackBerry, Green Hills, IBM, NXP Semiconductors, Panasonic Corporation, Renesas Electronic Corporation, Sasken, Siemens AG, Visteon and Wind River. \n[TYPEGRAPH]\nGet more information on this report : Request Sample Pages\nGrowth of connected infrastructure\n\nWith the rapid adoption of Internet of Things (IoT), the transportation infrastructure across the globe is evolving quickly. Companies such as Cisco and IBM, have created digital platforms, which can automate street and traffic lights, optimize trash pickup, and augment surveillance. For instance, installation of IoT sensors in Las Vegas streets has managed to control traffic congestion and solve environmental issues. Connected infrastructure includes car parks, toll booths, and smart-street and traffic lights.\nAutonomous vehicles can interact with intelligent street lights to enable fluid traffic without any congestion. Furthermore, development of ITS corridors are also one of the growth factors for autonomous vehicles as ITS corridors have connecting services and allow communication between vehicle and infrastructure (V2I), thus easing the traffic flow. Therefore, growth in connected infrastructure is projected to boost the demand for advanced vehicle thereby leading to the growth of automotive hypervisor market.\n[LEVELOFAUTOMATIONGRAPH]\nGet more information on this report : Request Sample Pages\nIntervention of innovative technologies for advanced user interface (UI)\n\nUser interface is an interactive platform that is used as a medium for the user and the application to interact. New vehicles are being equipped with innovative technologies such as visual info-gratification including digital speedometers, climate control, navigation, driving assistance and other car settings. These digital info-graphics systems can be accessed through touchscreen display, which is placed on the vehicle’s dashboard. In addition, in order to provide the same digital human experience to the users, leading automotive companies are improving the user interface (UI) inside the next vehicle generation by adding digital screens and human-interfaces to the interior of a car. Such interfaces require software for technology integration, which in turn, boost the automotive hypervisor market growth.\nFor instance, in January 2020, Rightware, the leading provider of automotive user interface software, introduced new Kanzi reference HMI (Human-Machine Interface) platform, which combines the company’s suite of automotive user interface design software into an integrated solution to help automakers and suppliers deliver the best possible user experience in multi-display digital cockpits. \n[VEHICLECLASSGRAPH]\nGet more information on this report : Request Sample Pages\nTroubleshooting and maintenance of automotive software\n\nThe integration of software solutions on cars has added computer-like specs to cars. The digitization of vehicles has enhanced performance, efficiency and convenience. However, software failures pose a huge challenge to the automotive industry. Software is transforming car capabilities but also creating development challenges for automotive players. In addition, the automotive software market is in developing phase, thus, there is a limited number of resources with hands-on experience in the latest and trending technologies to maintain or troubleshoot the software problems. Moreover, not only consumers need to learn more about software-based features and maintenance, but also car manufacturers, vendors, automotive &amp; transportation industry players yet have little understanding of software-based services, as well as maintenance and troubleshooting of that software. Therefore, the factors such as lack of skilled workforce, automotive software engineers and expertise is limiting the automotive hypervisor market growth.\nData monetization in extended automotive ecosystem\n\nOne major trend emerging in the global automotive sector is vehicle connectivity. The connectivity ecosystem of automotive includes various stakeholders such as insurers, cellular network providers, software providers, IT companies, and hardware and electronic devices providers. Vehicles are now able to capture and share many types of data, including geolocation, vehicle performance, driver behavior, and biometrics data. Hence, it is a dynamic ecosystem where every stakeholder including software providers monetizes the data generated from the vehicles. In addition, the growing attraction of connected cars has compelled automotive companies to develop skills in web technology, chip design, and embedded systems, starting with smartphone integration. Therefore, the data monetization is expected to create growth opportunities for the automotive hypervisor market in near future. \n[REGIONGRAPH]\nGet more information on this report : Request Sample Pages\nCovid-19 Impact Analysis\nCOVID-19 has presented the world with an unprecedented economic, humanitarian, and healthcare challenge.\nIt has also affected general lifestyle and behavior pertaining to travel, consumption of goods, and services as well as working style of individuals.\nMoreover, owing to the pandemic and its rapid spread across the globe, demand &amp; supply chain for numerous products came to a halt due to unavailability of transportation medium.\nThis has increased demand for electric vehicles and resulted in the electric vehicle industry to witness lucrative growth at the end of 2020.\nMoreover, numerous companies, which are inclined toward production of advanced technologies to be used in vehicles have carried out numerous developmental strategies such as agreements, expansions, product developments, and product launches.\nKey Benefits For Stakeholders\nThis study presents analytical depiction of the global automotive hypervisor market analysis along with current trends and future estimations to depict imminent investment pockets.\nThe overall automotive hypervisor market opportunity is determined by understanding profitable trends to gain a stronger foothold.\nThe report presents information related to the key drivers, restraints, and opportunities of the global automotive hypervisor market with a detailed impact analysis.\nThe current automotive hypervisor market is quantitatively analyzed from 2021 to 2030 to benchmark the financial competency.\nPorter’s five forces analysis illustrates the potency of the buyers and suppliers in the industry.",
        "subreddit": "pennystocks",
        "title": "Automotive hypervisor market is an interesting industry!",
        "url": "https://www.reddit.com/r/pennystocks/comments/oujpdx/automotive_hypervisor_market_is_an_interesting/",
        "created": 1627677142.0
    },
    {
        "author": "bigdaddyhoo",
        "created_utc": 1625147132,
        "id": "obm5tf",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Almost everyone considers P:E when buying stock in a company, but have you considered their [EV/EBITDA](https://www.investopedia.com/ask/answers/072715/what-considered-healthy-evebitda.asp)? One is not necessarily better than the other, but It can be very helpful to consider a companies Enterprise Value.\n\n \n\nIf you were considering buying 2 cars, and they both cost $30k, but one had $2000 cash in the glove compartment, and the other had $2000 in unpaid parking tickets in the glove, that would be important to you, right? If you only look at market cap and not Enterprise Value (EV), you are ignoring what's in the glove compartment.\n\n \n\nConsider 2 companies with a similar market cap, say INTC ($226.7B) and CSCO ($223.4B). If you just look at their market caps, you might say they are close enough (1.5% difference) that you will just directly compare their income statements. But Cisco has $29.4B in cash and only $14.5B in debt, so when you buy their stock, you are also buying some of their cash reserves. This is included in the Enterprise Value (EV) which is $223.4B+$14.5B-$29.4B=$208.5B\n\nIntel has $23.9B cash and $36B debt, so their EV is $226.7B+$36B-$23.9B=$238.8B\n\nSo when you consider their cash and debt, Intel can be considered 14.5% more expensive than Cisco instead of 1.5%.\n\n \n\nIt's not always the be all end all, but it can be very helpful to look at Enterprise Value when you are comparing stocks.",
        "subreddit": "stocks",
        "title": "Understanding Enterprise Value",
        "url": "https://www.reddit.com/r/stocks/comments/obm5tf/understanding_enterprise_value/",
        "created": 1625175932.0
    },
    {
        "author": "Janto_2021",
        "created_utc": 1626011068,
        "id": "oi4pin",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "WSJ \"The Meme Stock Fantasy Is Becoming a Reality for GameStop and AMC - The hot companies of the moment are converting hype into real value, following a Wall Street tradition practiced by Tesla, AOL, Cisco and others. But true believers will pay for it.\"",
        "url": "https://www.wsj.com/articles/the-meme-stock-fantasy-is-becoming-a-reality-for-gamestop-and-amc-11625823008",
        "created": 1626039868.0
    },
    {
        "author": "Complex_Mention_8495",
        "created_utc": 1625743931,
        "id": "og5c6c",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I stumbled on a tutorial video on covered calls on YouTube ( [https://www.youtube.com/watch?v=sYjUQY6\\_Q-I](https://www.youtube.com/watch?v=sYjUQY6_Q-I)) and it makes me angry in several ways.\n\nOn the one hand, the young man basically explains the theory of a covered call, which is ok-ish but the stuff he is doing makes me shake my head.\n\n**First,** he is buying a Cisco-Shared straight as a market-order only to sell covered calls afterwards. Why a market order (\\~47.60 $)? That's the worst thing one can do. Take at least a limit-order, or even better a cash secured put, which will reward you with another premium.\n\n**Second**, he is then selling  a covered call that is already in the money by 10Cents (47.50$). By this, he is accepting to loose 10$ as he has to give away his collateral cheaper than he bought it. \n\n**Finally** and in order the earn 1730$ being mentioned in the title, the young mans advice is just to sell ten of those covered calls, translating into a collateral  of &gt;47k $",
        "subreddit": "options",
        "title": "This tutorial video on covered calls (A small rant...)",
        "url": "https://www.reddit.com/r/options/comments/og5c6c/this_tutorial_video_on_covered_calls_a_small_rant/",
        "created": 1625772731.0
    },
    {
        "author": "IvanThinking",
        "created_utc": 1627473826,
        "id": "ot8ilq",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "  \n\n1) Not only is Workhorse an innovative American technology company with outstanding growth (projected by analysts to be over 5000% year over year with the upcoming earnings report) but \n\n2) as the only last mile delivery electric vehicle, it is the only viable choice to meet President Biden's executive order which \"directs the federal agencies to procure carbon pollution-free electricity and clean, zero-emission vehicles\" for government fleets. Recall that the order states \"the Postal Service shall ensure that at least 75 percent of the total number of vehicles purchased using such funds shall be electric or zero-emission vehicles.\"\n\n3) It was unfairly removed from consideration in the USPS contract in favor of a defense contractor that \n\na) has never made a last mile delivery vehicle let alone an electric one \n\nb) was awarded the contract based on a prototype that was not subjected to required testing as Workhorses models were \n\nc) only promises to deliver \"up to 10%\" conversion of their combustion engine vehicles at some unspecified time \n\nd) had a $54 million insider stock buy (equal to their average trading volume for an entire day) in the after-market trading session the night prior to their surprise award of the contract\n\n4) **Workhorse's legal challenge to the likely fraudulent USPS award has now provided the Biden administration the legal path to remove Postmaster General DeJoy who has been in suspicion of fraud and is now a target of an FBI investigation. Workhorse argues that DeJoy's appointment violated the constitution as outlined in this video.** [USPS Violates Constitution? Workhorse Argues Yes! - YouTube](https://www.youtube.com/watch?v=rNsryX9mSr8)  \n\nIf there wasn’t already enough reasons for me to pile into Workhorse stock on the future of this innovative American tech company with projected over 5000% year over year growth for this quarter’s earnings call in a week or so, with one of the highest short interest IMO unfairly depressing this stock price and causing Ortex and other services to list $WKHS as the highest short squeeze alert category, **but now they are exposing government corruption and are providing the legal path to remove the corrupt Postmaster General DeJoy.** \n\nThis is not investment advice. \n\nBut I see an American innovator, electric vehicle and drone maker, fighting hedge fund shorts, fighting government corruption, and still achieving outstanding growth. So, I have gotten behind them as my largest holding. See below, I am holding 5400 $WKHS shares now at a $14.26 cost basis.  \n\n[My $WKHS position](https://imgur.com/a/tWykcOv)\n\nAdditional due diligence below. I believe in the long term prospects of what appears to me to be a great American technology innovator in an emerging market with huge upside growth possible.  \n \n\nTo be balanced, the stock has been beaten up badly this past month with short interest in the stock currently the 2nd highest reported according to Ortex and the decline in stock price the last few weeks has been accompanied by anywhere from 30% to 60% of the daily volume being short selling trying to drive away interest from the stock. This makes it one of the highest short squeeze targets in the market (highest short squeeze rating by Ortex and noted as such by several other financial services as well).  \n \n\nI like both that it could be an extremely explosive short squeeze AND that it is a very promising long term play with very exciting technologies being the only last-mile delivery EV in the market and has a patent and orders for their Horsefly delivery drone which is the only vehicle mounted drone launch and return.  \n \n\n* WKHS is clearly growing as it is hiring a ton of engineers. [https://recruiting.paylocity.com/Re...-a66a-7c50cd057385/Workhorse-Technologies-Inc](https://recruiting.paylocity.com/Recruiting/Jobs/All/df0f8067-2068-443e-a66a-7c50cd057385/Workhorse-Technologies-Inc)  \n \n* Debt free, $250 Million cash on hand\n\nA) The WKHS C-650 will likely start shipping this month  \n \n\nB) 32 C-1000’s built in April alone.  \n \n\nC) Estimates from the last ER- 100 vehicles projected for Q2, 300 for Q3 and 600 for Q4  \n \n\nD) Dr. Rob Wilson PhD COO / NASA fellow is working on refrigerated vehicles (likely have already built some). Rob worked for Cisco.. WKHS would be first to market with a 1000 cubic ft refrigerated truck. That’s Yuge!  \n \n\nE) Pride Group launched their webpage [Pride](https://prideev.com/)  \n \n\nF) Pritchard launched their webpage [Pritchard](https://www.pritchardworkhorse.com/)  \n \n\nG) JB Poindexter website launched [JB](https://jbpoindexter.com/eavx/)  \n \n\nH) Patents for one piece composite body that bolts to skateboard (huge advantage for fleets and light) and for a removable one piece power terrain. (Quick to remove any engine and back on the road)  \n \n\nI) The Horsefly drone should be get FAA approval this year. FAA approved truck launched autonomous drones.. WKHS owns this patent. UPS has been testing for 5 years. Come and get it Amazon.  \n \n\nOrders:  \n \n\n1-Started with 1200 from UPS  \n \n\n2-Prichard ordered 500 spaced out quarterly, expecting more  \n \n\n3-Pride’s initial order is 120, Then 600 each through FY 2023. Followed by 5000 through the next 3 years- thought to be structured that way to ensure Canada’s infrastructure is in order.  \n \n\n* $15B in EV infrastructure in      current bi-partisan agreement for infrastructure, Biden admin pushed for      $174B. This is the infrastructure and the government credits which make      the EV delivery market much more attractive to buyers.\n\n[Electric vehicle infrastructure gets $15 billion in new US bipartisan proposal, new EV rebate to come later - Electrek](https://electrek.co/2021/06/24/electric-vehicle-infrastructure-15-billion-in-new-bipartisan-proposal-new-ev-rebate/)  \n \n\nNote also that President Biden will give remarks this week on the trillions of dollars in the Infrastructure Bill in Cincinnati which also happens to be right where Workhorse's headquarters are located.  \n \n\nBiden executive order states (with application to USPS contract):  \n \n\nConsistent with the goals of the President’s Build Back Better jobs and economic recovery plan, of which his clean energy jobs plan is a central pillar, the order **directs the federal agencies to procure carbon pollution-free electricity and clean, zero-emission vehicles** to create good-paying, union jobs and stimulate clean energy industries.  \n \n\n[FACT SHEET: President Biden Takes Executive Actions to Tackle the Climate Crisis at Home and Abroad, Create Jobs, and Restore Scientific Integrity Across Federal Government | The White House](https://www.whitehouse.gov/briefing-room/statements-releases/2021/01/27/fact-sheet-president-biden-takes-executive-actions-to-tackle-the-climate-crisis-at-home-and-abroad-create-jobs-and-restore-scientific-integrity-across-federal-government/)  \n \n\nSo I'm not banking on getting a share of the $6 Billion USPS contract but $WKHS has a reasonable chance at it and it is politically popular for the 100% EV option to get at least some of the award.  \n \n\nHere is other Congressional action that bodes well for WKHS getting a piece of this $6B.  \n \n\nH.R.1636 — 117th Congress (2021-2022) Postal Vehicle Modernization Act Sponsor: Rep. Huffman, Jared \\[D-CA-2\\] (Introduced 03/08/2021) Cosponsors: (39) Committees: House - Oversight and Reform Latest Action: House - 03/08/2021 Referred to the House Committee on Oversight and Reform. (All Actions)  \n \n\nH.R.3521 — 117th Congress (2021-2022) Postal Service Electric Fleet Authorization Act of 2021 Sponsor: Rep. Lynch, Stephen F. \\[D-MA-8\\] (Introduced 05/25/2021) Cosponsors: (3) Committees: House - Oversight and Reform Latest Action: House - 05/25/2021 Referred to the House Committee on Oversight and Reform. (All Actions)  \n \n\nH.Res.202 — 117th Congress (2021-2022) Expressing support for the need for a replacement fleet that meets the climate goals of the United States, protects critical supply chains, and promotes a cleaner, more stable future for a burgeoning 21st century domestic vehicle industry. Sponsor: Rep. Kaptur, Marcy \\[D-OH-9\\] (Introduced 03/09/2021) Cosponsors: (2) Committees: House - Oversight and Reform Latest Action: House - 03/09/2021 Referred to the House Committee on Oversight and Reform. (All Actions)  \n \n\nSources congress.gov  \n \n\nFrom H.R. 3521: [HR3521 | US Congress 2021-2022 | Postal Service Electric Fleet Authorization Act of 2021 | TrackBill](https://trackbill.com/bill/us-congress-house-bill-3521-postal-service-electric-fleet-authorization-act-of-2021/2130502/)  \n \n\nThere is authorized to be appropriated to the United States Postal Service $8,000,000,000, to remain available until expended, for the acquisition of vehicles and the infrastructure required to operate a fleet of electric vehicles.  \n \n\nthe Postal Service shall ensure that **at least 75 percent of the total number of vehicles** purchased using such funds shall be electric or zero-emission vehicles.",
        "subreddit": "wallstreetbets",
        "title": "Workhorse DD and Workhorse legal team provides the legal path for President Biden to remove corrupt Postmaster General DeJoy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ot8ilq/workhorse_dd_and_workhorse_legal_team_provides/",
        "created": 1627502626.0
    },
    {
        "author": "GeneGriffingy2",
        "created_utc": 1626282260,
        "id": "ok8pcy",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "TSXV: PAI  \nOTC: INOTF  \nFSE: 71TA\n\nPredictiv AI Inc.  a software and solutions provider in the artificial intelligence markets, today announced that its Board of Directors has appointed Jim Grimes, Chairman of Predictiv AI, as interim President and Chief Executive Officer following Michael Lende's resignation effective July 30, 2021.\n\nDue to personal family matters, Mr. Lende has made the difficult decision to step down as Predictiv AI's President, Chief Executive Officer and Director of the Corporation.\n\nJim Grimes is a recognized pioneer in Canada's telecom technology industry; a highly successful angel investor and much sought-after, respected executive consultant. During his career, he opened and led the Canadian division of three early-stage Silicon Valley based telecom start-ups – Stratacom Inc. (Cisco), Xylan Inc. (Alcatel) and Access 360 (IBM). Mr. Grimes subsequently led, in concert with the Cisco Canada leadership team under Nitin Kawale, the creation of Cisco Canada Venture Fund to drive Canadian innovation.\n\nMost recently, Mr. Grimes was VP Product Solutions within the Enterprise Business Unit at Rogers and, leveraging his vast and deep relationships in the C-suites of Canadian business, advised companies such as Next Pathway Inc. on their corporate growth, acquisition and exit strategies.\n\nFind the full release here at: [https://finance.yahoo.com/news/predictiv-ai-names-jim-grimes-125100024.html](https://finance.yahoo.com/news/predictiv-ai-names-jim-grimes-125100024.html)\n\n&amp;#x200B;\n\nThis is is not financial advice!!",
        "subreddit": "StockMarket",
        "title": "Predictiv AI Names Jim Grimes Interim President &amp; CEO",
        "url": "https://www.reddit.com/r/StockMarket/comments/ok8pcy/predictiv_ai_names_jim_grimes_interim_president/",
        "created": 1626311060.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1625180258,
        "id": "obxebz",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " **Winners**\n\nWinner of the day by sector | **SP500**:\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | J B Hunt Transport Services Inc | **JBHT** | 2.45%  \n2. **Health Care** | Viatris Inc | **VTRS** | 3.22%  \n3. **Information Technology** | DXC Technology Co | **DXC** | 3.72%  \n4. **Communication Services** | Interpublic Group of Companies Inc | **IPG** | 2.03%  \n5. **Consumer Discretionary** | NVR, Inc. | **NVR** | 2.79%  \n6. **Utilities** | Entergy Corporation | **ETR** | 1.87%  \n7. **Financials** | Lincoln National Corporation | **LNC** | 2.40%  \n8. **Materials** | Albemarle Corporation | **ALB** | 2.12%  \n9.  **Real Estate** | CBRE Group Inc | **CBRE** | 1.69%  \n10. **Consumer Staples** | Philip Morris International Inc. | **PM** | 0.75%  \n11. **Energy** | Diamondback Energy Inc | **FANG** | 6.08%  \n\n\n**Losers**\n\nLoser of the day by sector | **SP500**:\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **Cummins Inc.** | CMI | **-0.69%**  \n2. Health Care | **CVS Health Corp** |  CVS | **-1.46%**  \n3. Information Technology | **Micron Technology, Inc.** | MU | **-5.73%**  \n4.  Communication Services | **Activision Blizzard, Inc.** | ATVI | **-1.61%**  \n5. Consumer Discretionary | **Etsy Inc** | ETSY | **-3.08%**  \n6. Utilities | **DTE Energy Co** | DTE | **-13.67%**  \n7. Financials | **Goldman Sachs Group Inc** | GS | **-1.20%**  \n8. Materials | **Newmont Corporation** | NEM | **-0.82%**  \n9. Real Estate | **Equinix Inc** | EQIX | **-0.62%**  \n10. Consumer Staples | **Walgreens Boots Alliance Inc** | WBA | **-7.41%**  \n11. Energy | **Valero Energy Corporation** | VLO | **-0.35%**",
        "subreddit": "wallstreetbets",
        "title": "SP500 Winners and Losers | 7/1/2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/obxebz/sp500_winners_and_losers_712021/",
        "created": 1625209058.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1625614726,
        "id": "of6ypo",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "**Winners**\n\nWinner of the day by sector | **SP500**:\n\n**Sector |** Company **| Ticker |** % Price Change\n\n1. **Industrials** | Generac Holdings Inc. | **GNRC** | 3.47%  \n2. **Health Care** | ABIOMED, Inc. | **ABMD** | 3.06%  \n3. **Information Technology** | Arista Networks Inc | **ANET** | 2.56%  \n4. **Communication Services** | Twitter Inc | **TWTR** | 1.44%  \n5. **Consumer Discretionary** | Amazon.com, Inc. | **AMZN** | 4.69%  \n6. **Utilities** | American Water Works Company Inc | **AWK** | 1.91%  \n7. **Financials** | MarketAxess Holdings Inc. | **MKTX** | 1.71%  \n8. **Materials** | Newmont Corporation | **NEM** | 0.84%  \n9.  **Real Estate** | Extra Space Storage, Inc. | **EXR** | 2.44%  \n10. **Consumer Staples** | Clorox Co | **CLX** | 1.12%  \n11. **Energy** | No Winners | |  \n\n\n**Losers**\n\nLoser of the day by sector | **SP500**:\n\n**Sector | Company | Ticker | % Price Change**\n\n1. Industrials | **General Electric Company** | GE | **-3.29%**  \n2. Health Care | **Viatris Inc** |  VTRS | **-3.54%**  \n3. Information Technology | **DXC Technology Co** | DXC | **-3.28%**  \n4.  Communication Services | **CBS Corporation Common Stock** | VIAC | **-2.92%**  \n5. Consumer Discretionary | **MGM Resorts International** | MGM | **-4.61%**  \n6. Utilities | **NRG Energy Inc** | NRG | **-1.01%**  \n7. Financials | **Comerica Incorporated** | CMA | **-3.69%**  \n8. Materials | **Nucor Corporation** | NUE | **-4.10%**  \n9. Real Estate | **Host Hotels and Resorts Inc** | HST | **-3.01%**  \n10. Consumer Staples | **Molson Coors Beverage Co Class B** | TAP | **-3.33%**  \n11. Energy | **Diamondback Energy Inc** | FANG | **-7.03%**",
        "subreddit": "wallstreetbets",
        "title": "SP500 Winners and Losers | 7/6/2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/of6ypo/sp500_winners_and_losers_762021/",
        "created": 1625643526.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1625180427,
        "id": "obxg6p",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\n**Winners**\n\nWinner of the day by sector | **SP500**:\n\n**Sector |** Company **| Ticker |** % Price Change\n\n1. **Industrials** | J B Hunt Transport Services Inc | **JBHT** | 2.45%\n2. **Health Care** | Viatris Inc | **VTRS** | 3.22%\n3. **Information Technology** | DXC Technology Co | **DXC** | 3.72%\n4. **Communication Services** | Interpublic Group of Companies Inc | **IPG** | 2.03%\n5. **Consumer Discretionary** | NVR, Inc. | **NVR** | 2.79%\n6. **Utilities** | Entergy Corporation | **ETR** | 1.87%\n7. **Financials** | Lincoln National Corporation | **LNC** | 2.40%\n8. **Materials** | Albemarle Corporation | **ALB** | 2.12%\n9. **Real Estate** | CBRE Group Inc | **CBRE** | 1.69%\n10. **Consumer Staples** | Philip Morris International Inc. | **PM** | 0.75%\n11. **Energy** | Diamondback Energy Inc | **FANG** | 6.08%\n\n**Losers**\n\nLoser of the day by sector | **SP500**:\n\n**Sector | Company | Ticker | % Price Change**\n\n1. Industrials | **Cummins Inc.** | CMI | **-0.69%**\n2. Health Care | **CVS Health Corp** |  CVS | **-1.46%**\n3. Information Technology | **Micron Technology, Inc.** | MU | **-5.73%**\n4.  Communication Services | **Activision Blizzard, Inc.** | ATVI | **-1.61%**\n5. Consumer Discretionary | **Etsy Inc** | ETSY | **-3.08%**\n6. Utilities | **DTE Energy Co** | DTE | **-13.67%**\n7. Financials | **Goldman Sachs Group Inc** | GS | **-1.20%**\n8. Materials | **Newmont Corporation** | NEM | **-0.82%**\n9. Real Estate | **Equinix Inc** | EQIX | **-0.62%**\n10. Consumer Staples | **Walgreens Boots Alliance Inc** | WBA | **-7.41%**\n11. Energy | **Valero Energy Corporation** | VLO | **-0.35%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 7/1/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/obxg6p/sp500_winners_and_losers_712021/",
        "created": 1625209227.0
    }
]