[
    {
        "author": "junglehuck",
        "created_utc": 1613749766,
        "id": "lnj00p",
        "num_comments": 723,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part.  I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth.  So, feel free to add to this list but here are stocks I like - both long and short.\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "stocks I like - for the hedge funds buying tech to track this",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/",
        "created": 1613778566.0
    },
    {
        "author": "pmchem",
        "created_utc": 1612445969,
        "id": "lcftzc",
        "num_comments": 511,
        "num_crossposts": 6,
        "selftext": "I've been doing a lot of ETF research lately and wanted to share this list because I think that smaller ETFs fly under the radar all too often.  Here are 10 ETFs with less than a billion dollars under management, but that I think are interesting and possibly useful, with reasons why:\n\n1. THNQ: ROBO Global Artificial Intelligence ETF, [https://roboglobaletfs.com/thnq](https://roboglobaletfs.com/thnq) .  The process-based management of THNQ's holdings targets heavy exposure to companies leading development or execution with artificial intelligence and machine learning.  My only issue with it is that for some reason they don't include Facebook in its holdings (and FB is famous with PyTorch and related work).  Competitors in this thematic space include Global X's AIQ and iShares' IRBO.  A newer ETF, THNQ has performed very, very well since inception, easily beating many other growth ETFs.  Certainly a theme to watch for the coming decade.\n2. SFY: SoFi Select 500 ETF, [https://www.sofi.com/invest/etfs/sfy/](https://www.sofi.com/invest/etfs/sfy/) .  This ETF is... highly intriguing.  It has a 0.0% expense ratio, yes, free, waived until at least end of June 2021 (at which point it might go up to 0.19%).  They're waiving the fee to draw in AUM.  Its performance over the past trading year is +20%, so it beats the S&amp;P 500 (easily).  What they do is take the top 500 US stocks by market cap, then weight them according to a set of equations based on net income and sales growth as per the methodology.  Not market-cap weighted, which is very unusual and thus nice to have as a tool in your toolkit.  The ETF ends up with more weighted overlap with the S&amp;P 500 than other large-cap growth ETFs such as VUG, IWZ, JKE, etc., because the \"value\" companies are still in there -- they're just not weighted as highly as they are in SPY or VOO.  The usual suspects are still in the top 10: AAPL, AMZN, MSFT, TSLA, GOOGL, FB.   SQ comes in at #15, which I think is very nice, and SQ is missing from an S&amp;P 500 ETF.  Granted, if the ER wasn't 0.0%, this ETF would be significantly less attractive.  Index methodology here: [https://www.solactive.com/wp-content/uploads/2019/03/Solactive-SoFi-US-500-Growth-Index-Guideline.pdf](https://www.solactive.com/wp-content/uploads/2019/03/Solactive-SoFi-US-500-Growth-Index-Guideline.pdf)\n3. DSTL: Distillate U.S. Fundamental Stability &amp; Value ETF, [https://distillatefunds.com/dstl](https://distillatefunds.com/dstl) .  Its methodology is in the prospectus, [https://distillatefunds.com/dstl/prospectus](https://distillatefunds.com/dstl/prospectus) .  Essentially, they try to combine \"quality\" and \"value\" factor investing. The fund's weighted overlap with SPY is only 20% according to [etfrc.com](https://etfrc.com). So it's not simply the S&amp;P. It's also not the first ETF to use free cash flow as a factor (see also: COWZ, TTAC, neither of which I really like). Its ER is only 0.39%, which is reasonably low for small-ish specialty ETFs. But how does it perform? Well, since inception over 2 years ago it has kept pace with or outperformed the S&amp;P 500 and iShares' US quality and value factor ETFs every step of the way.  Gotta admit, I'm kinda impressed. Their top holdings right now are: JNJ, UNH, INTC, WMT, GOOGL, HD, PG, CSCO, AMGN, and AVGO. Surprisingly, compared to SPY, they're most underweight in financials. I would've thought they scored well on those cash flow metrics but maybe the banks score poorly on their debt metric and they don't compensate for banks having a different business model than, say, JNJ.  Really neat non-market-cap weighted ETF!\n4. SDG: iShares MSCI Global Impact ETF, [https://www.ishares.com/us/products/283378/ishares-msci-global-impact-etf-fund](https://www.ishares.com/us/products/283378/ishares-msci-global-impact-etf-fund) . This fund tracks an index that seeks to \"Obtain exposure to global stocks aiming to advance themes related to the United Nation’s Sustainable Development Goals, such as education or climate change.\"  ARK Investing may also be launching an ETF with this theme in the future (see: [https://www.youtube.com/watch?v=kfhgbZBWgBE&amp;t=30m53s](https://www.youtube.com/watch?v=kfhgbZBWgBE&amp;t=30m53s) ).  Methodology here: [https://www.msci.com/msci-acwi-sustainable-impact-index](https://www.msci.com/msci-acwi-sustainable-impact-index) .  It's nice to have a fund you can feel good about investing in.  It has also easily outperformed the S&amp;P 500 over the past year!\n5. FRDM: Freedom 100 Emerging Markets ETF, [https://freedometfs.com/frdm/](https://freedometfs.com/frdm/) . It's a very new emerging markets ETF that is not market-cap weighted and filters countries based on human and economic freedom scores.  Top holdings include TSMC, Samsung, and CD Projekt Red.  If you're concerned about international tensions and based in North America, this could be something you'd like.  Also a rare way to get very high weight to tech outside China in an emerging markets ETF.  Very unusual and a neat tool to have in your emerging markets investing toolbox!\n6. EMXC: iShares MSCI Emerging Markets ex China ETF, [https://www.ishares.com/us/products/288504/ishares-msci-emerging-markets-ex-china-etf-fund](https://www.ishares.com/us/products/288504/ishares-msci-emerging-markets-ex-china-etf-fund) . Also an ex-China emerging markets fund, but otherwise it follows a broad MSCI mark-cap weighted index.  Very top-heavy in Korea, Taiwan, India, and Brazil.  It's another tool to stay in emerging markets but specifically tailor your China exposure through some other portfolio choice (or have none at all).  Like in FRDM, you get heavy exposure to TSMC and Samsung.\n7. IMTM: iShares MSCI Intl Momentum Factor ETF, [https://www.ishares.com/us/products/271538/ishares-msci-international-developed-momentum-factor-etf](https://www.ishares.com/us/products/271538/ishares-msci-international-developed-momentum-factor-etf) .  One of the few ways to get exposure to trending stocks in developed non-US markets.  Really heavy on tech and luxury.  If you're bored of holding EFA or VEA and want greater returns from non-US developed markets, check this out, it may be something you like.  High exposure to Shopify, Sony, Nintendo, LVMH.\n8. SWAN: AMPLIFY BLACKSWAN GROWTH &amp; TREASURY CORE ETF, [https://amplifyetfs.com/swan.html](https://amplifyetfs.com/swan.html) .  Treasuries plus SPY LEAP options.  Its performance in 2020 was great -- saved you during the crash, and gets you most of the S&amp;P 500 upside during \"normal\" times.  Kind of a barbell strategy; an interesting conservative ETF.  Probably of greater interest to people near or in retirement.  Amplify has a whole set of thematic ETFs, much like Global X.\n9. NTSX: WisdomTree 90/60 U.S. Balanced Fund, [https://www.wisdomtree.com/etfs/asset-allocation/ntsx](https://www.wisdomtree.com/etfs/asset-allocation/ntsx) .  Another fund that deals with both US large caps and treasuries.  But in this case, it uses treasury futures as leveraged exposure to get 90% equities, 60% treasuries total exposure.  Quite a clever package and designed for long-term holding with reduced volatility, while likely outperforming a 60/40 balanced fund.  There's a huge thread on bogleheads.org about it with a lot of people who like its design.\n10. IGBH: iShares Interest Rate Hedged Long-Term Corporate Bond ETF, [https://www.ishares.com/us/products/275397/ishares-interest-rate-hedged-10-year-credit-bond-etf](https://www.ishares.com/us/products/275397/ishares-interest-rate-hedged-10-year-credit-bond-etf) .  This is an interest-rate hedged long-term corporate bond ETF.  You see, when treasury yields rise, as is expected the next year or two, corporate bond yields also rise.  But that means the price of the bonds goes down -- bad for bond ETF values.  Hedging the rates allows you to still collect distributions and have lower volatility than equities, but avoid the interest-rate risk.  A whole lot of money has flowed into this and its sister ETF, LQDH, in the past 6 months because of historically low treasury yields.\n\nok, here's a bonus #11:\n\n11. PPA: Invesco Aerospace &amp; Defense ETF, [https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Investor&amp;ticker=PPA](https://www.invesco.com/us/financial-products/etfs/product-detail?audienceType=Investor&amp;ticker=PPA) .  This is a broad defense industry ETF, and may have some deep value right now as the industry has lagged for the past year.  But the world is still a dangerous place and if war breaks out these companies will benefit; a good ETF to have watchlisted.  US and allied defense spending keeps chugging along.  Also, many of these companies may be in Cathie Wood's ARKX. ITA is an alternative but lacks $HON, which is an important company in the sector.\n\nDisclaimer: this is not financial advice and I currently have no position in any of those ETFs at time of posting, but that may change at any point in the future.\n\nWhat do you guys think?  Any of those look like something you might invest in?  Anyone else want to comment on a personal favorite small/medium sized fund?\n\n&amp;#x200B;\n\nedit, 6 hours after OP: wow, this post blew up!  I'm so happy many people are finding this discussion informative.  Thanks for the awards and comments.",
        "subreddit": "investing",
        "title": "10 interesting and useful ETFs with less than $1b AUM",
        "url": "https://www.reddit.com/r/investing/comments/lcftzc/10_interesting_and_useful_etfs_with_less_than_1b/",
        "created": 1612474769.0
    },
    {
        "author": "techtrnd",
        "created_utc": 1612841463,
        "id": "lftk0b",
        "num_comments": 98,
        "num_crossposts": 0,
        "selftext": "It’s only a matter of time before it is discovered by more and more people. Do your own research and you will know. But here are some key points which made me think seriously about ACEV Achronix merger . The whole SPAC market is filled with companies with absurd financials and negative growth but this one stood out for its potential \n\n1. Achronix is the Only independent FPGA and eFPGA maker. FPGA falls under the category of data accelerators such as GPUs but it’s faster, flexible  and more power efficient than GPUs\nTheir target market is high growth AI apps, cloud computing, 5G and automotive driver assistance \nand the crypto industry\n\n2. There are only 2 other main players\nAlterra was acquired by Intel few years ago, and Xilinx was acquired by AMD , that leaves Achronix as the only independent FPGA maker. This is important as it could also become a prime candidate for acquisition by Nvidia ( just a thought) \n\n3. Their latest product speedster 7 is geared more towards AI/ML AND data acceleration\nThis is crucial If you look at Ark big ideas 2021, They have mentioned Compounded annual growth rate ( CAGR) of 17% for deep learning. The Arm big ideas also talk about Data center reinvention where majority of the processor change is driven by data accelerators  ( GPUs and FPGA likes ) which again grows at 21% CAGR. \n\nAchronix has a huge dependency on Intel for their previous generation product but also gives them a committed revenue for next year and the dependency is projected to go down to 23-26% by 2023 . Their latest product speedster 7 has secured offers from atleast 6 customers and many more are in pipeline \n\nOn the merger - \n\nhttps://www.achronix.com/sites/default/files/docs/Achronix_Ace_Merger_Presentation_VF.pdf\n\n79% gross margin for 2020 with CAGR of 20-25% in coming years\n\nThey have a non cancellable order of 160mn next year with 1.1 billion in identified opportunities in next year driven by speedster product \n\nMerger is estimated at about 2.1 bn approx 12 times their sales compared that with AMD Xilinx merger ( done at 30 times sales )\n\nACEV team - are industry veterans. They grew netlogic for  3.7 bn $ by Broadcom and TDK invensense acquisition of 1.3 bn \n\nOne of the founding members Dr. Sunny Siu has deep ties with the academia. These are the guys who are part of the cutting edge research and have a passion for entrepreneurship - these are the people who I see as capable enough to change the world. Among his many academic accomplishments, he was the founding director of MIT auto ID ( pioneer of IOT research) at MIT. They have been around semis and am sure they know what they are doing not some rich guy trying to acquire some random company\n\nhttp://acev.io/investor-info/board-of-directors/default.aspx",
        "subreddit": "SPACs",
        "title": "ACEV - A sleeping giant ( soon to be :)",
        "url": "https://www.reddit.com/r/SPACs/comments/lftk0b/acev_a_sleeping_giant_soon_to_be/",
        "created": 1612870263.0
    },
    {
        "author": "AIwaysLearning",
        "created_utc": 1612842053,
        "id": "lftq2y",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "This is not financial advice. This is my first DD so please leave feedback. \n\n\nI believe Qualcomm has been brutally oversold. I expect a large rebound in the following months. \n\nFollowing their [most recent earnings report Q1 2021](https://investor.qualcomm.com/sec-filings/all-sec-filings/content/0001728949-21-000022/0001728949-21-000022.pdf) on the 4th of February their stock dropped 10% in 2 days. However, their earning report was strong and they maintain confidence that they will have a strong Q2 earnings too with an EPS of $1.65 (analysts were expecting an EPS of $1.57). The Q1 ER had an EPS of $2.17 per diluted share which is more than double their Q1 2020 $0.99 EPS. Although their ER beating high estimates of $8 billion in sales by an extra $200 million, [their licensing division brought in $1.35 billion of an estimated $1.43 billion.](https://www.barrons.com/articles/qualcomm-stock-earnings-chips-apple-51612390489) Their equipment and services division brought in $6.440 billion. They had an operating income of 2.5 billion.\n\n\nQcom has a healthy balance sheet with $7 billion in cash and very little short term debt. They do have $15 billion of long term doubt, which would be entirely covered by their cash, accounts receivable, and inventory. They can chip away at this debt slowly in this low interest period whilst focusing on R&amp;D.\n\n\nAll sounds good, so why did the stock tumble so bad? I’ve looked at different sources and have read that business analysts are worried about the limited manufacturing capacity across the semiconductor industry. However, I believe this is bullish. With demand higher than supply, it allows for the flexibility in price and larger profits whilst reinvesting back into manufacturing. Furthermore, I do not believe the dip is for this reason as other US chip producers such as Broadcom, Nvidia and the likes also are experiencing the same chip shortage and their stocks have not dipped in the same way. AMD has dipped in a similar way after beating earnings in true fashion and is showing signs of recovery which makes me bullish of a rebound. \n\n It is possible the sell off may be due to [citi downgrading their PT to $165 from $194.](https://www.marketwatch.com/story/qualcomm-stock-gets-a-downgrade-at-citi-after-earnings-2021-02-04) This is still higher than the current price by a bit but is slightly more bearish. Qualcomm has 77% of shares held by institutions, so you’d expect less volatility considering recently they have been loading up on shares, however, this data is prior to earnings. Updated figures on institutional holding reports are filed within 45 days after calendar quarter end - the 21st of March. [The most credible reason for the dip may be due to analysts having higher forecasts for the licensing division, however, I do believe the reaction has been very disproportionate especially when following EPS for the next quarter remains strong.](https://www.fool.com/investing/2021/02/04/why-qualcomm-stock-is-falling-today/)\n\n\n\n\nProbably some bad DD. Not financial advice. Please tell me how to improve.",
        "subreddit": "wallstreetbets",
        "title": "I believe Qualcomm will recover",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lftq2y/i_believe_qualcomm_will_recover/",
        "created": 1612870853.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1614375213,
        "id": "lt8f99",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, February 26, 2021**\n\nStocks traded mixed, with the S&amp;P 500 (SPY) and Dow Jones (DIA) pulling back while the tech-heavy Nasdaq (QQQ) rose, rebounding from its worst selloff since October. Market participants continue to nervously eye rising Treasury yields. \n\nThe saga between market makers and retail traders continues. The Securities and Exchange Commission (SEC) temporarily suspended a list of companies from trading due to “questionable trading and social media activity,” according to a statement from the Commission. The SEC alleges that \"Certain social media accounts may be engaged in a coordinated attempt to artificially influence their share prices.” A full list of the halted securities can be found [here](https://www.sec.gov/litigation/suspensions/2021/34-91213-o.pdf?utm_medium=email&amp;utm_source=govdelivery).\n\nOn Friday, the U.S. House of Representatives is anticipated to pass a $1.9 trillion COVID-19 stimulus package. The bill includes an additional $1,400 in stimulus checks to most Americans, $400 per week in augmented federal unemployment insurance, and $350 billion in state, local and tribal government relief. The bill would then head to the U.S. Senate, with many lawmakers aiming to pass the bill before a mid-March cliff for when current pandemic-era benefits are set to expire.\n\nTreasury yields were mostly lower today at 1.424% at the time of writing but continue to hover near one-year highs. Treasury yields are the interest rate the US government pays on its debt obligations, such as bonds. Very basically, rising Treasury yields affect the stock market in two ways: (1) it makes Treasury bonds more attractive assets for investment and (2) raises the cost of borrowing money for companies, which is why high-flying tech stocks were hit particularly hard yesterday.  Charlie Ripley, senior investment strategist for Allianz Investment Management said, \"Driving rates higher has been a combination of higher growth expectations as well as higher inflation expectations. Until recently, market participants have been able to digest the upward drift in long-term rates, but it appears that the next leg up in interest rates is a bigger bite to chew. Looking at where real yields were at, they were simply too low when considering growth expectations, and it’s likely that long-term real yields will continue to drift higher as economic data improves.\" In other words, expectations for more growth in the market, combined with inflationary fears are lowering demand in bonds, which in turn raises the yield. \n\n**Highlights**\n\n* Robinhood[ disclosed in a filing Friday](https://www.sec.gov/Archives/edgar/data/1561014/000162828021003429/fy20rhfshortfinal.pdf) that the company is in talks with the Financial Industry Regulatory Authority (FINRA) over outages on the platform during the March 2020 market volatility, along with other matters surrounding options trading and communications with customers on the platform.\n* DigitalOcean and Olo are two tech companies that recently filed to go public. DigitalOcean is a cloud-computing company, while Olo provides restaurant software. \n* Britain is seeking to build a consensus among G7 nations on how to stop large technology companies exploiting their dominance, warning that there can be no repeat of Facebook's (FB) one-week media blackout in Australia.\n* Despite the recent market selloff, shares of EV-manufacturer Fisker (FSR) are flying, finishing the week up more than 56%. \n* DraftKings (DKNG) outperformed the market after raising guidance on revenue for next year during earnings report.\n* **\\*Note: Current stock prices are written in the premarket in the morning, so they do not reflect intraday changes in price.**\n* Airbnb (ABNB) with two target raises. Stock currently around $182\n   * Canaccord Genuity from $175 to $220 at Buy\n   * Needham &amp; Co. from $200 to $225 at Buy\n* AutoDesk (ADSK) target raised by Barclays from $324 to $335 at Overweight. Stock currently around $284\n* Broadcom (AVGO) target raised by Oppenheimer from $500 to $575 at Outperform. Stock currently around $457\n* Alarm (ALRM) target raised by Raymond James from $75 to $115 at Strong-Buy. Stock currently around $89\n* Booking (BKNG) target raised by Susquehanna from $2,100 to $3,000 at Positive. Stock currently around $2,273\n* ETSY with a host of target raises. Consensus price target $260 at Buy. Stock currently around $197\n* Wow, this is crazy bearish. Jeffries set a $79 price target for Facebook (FB). Stock is currently around $254\n* Fisker (FSR) target raised by Cowen from $22 to $29 at Outperform.\n* Shake Shack (SHAK) target raised by Piper Sandler from $122 to $135 at Overweight. Stock currently around $119\n* After announcing plans to double revenue by 2023, Twitter (TWTR) with two target raises. Stock currently around $75\n   * Pivotal Research from $77.25 to $95 at Buy\n   * Goldman Sachs (GS) from $78 to $112 at Buy.\n\n\"The person who starts simply with the idea of getting rich won't succeed; you must have a larger ambition.\" - John D. Rockefeller",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, February 26, 2021. Enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/lt8f99/here_is_a_market_recap_for_today_friday_february/",
        "created": 1614404013.0
    },
    {
        "author": "gavinkress",
        "created_utc": 1614150454,
        "id": "lr6da4",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "This is my first time posting my DD, I am mostly posting this because I really believe in this trade, but I am always looking for feedback and ways to improve my process.\n\n**5G Outlook**\n\nQCOM will be the leader in 5G technology until at least the next generation chips. 5G adoption has [been much faster than 4G](https://wccftech.com/qualcomm-5g-2022-750-million/). In 2019, 5G market revenue was $0.71B in 2020 it had increased to $2.56B with 2021 [projections](https://www.statista.com/statistics/1006994/5g-market-revenue-worldwide/) around $5.4B and $8.75B in 2022. QCOM reported $6.5B earnings in Q4 beating estimations averaging $5.93B, for a 35% YoY increase. The CEO directly stated this was due to 5G.\n\n**Competition**\n\nWith their multi year agreement with Apple and the success of the Snapdragon X60 5G in the iPhone 12, it seems like Apple will be sticking with QCOM modems for the near future. I say the near future because Apple’s acquisition of Intel’s modem division indicates they will begin to develop their own chipset at some point.\n\nThere is not much in the space of real threatening competition for QCOM right now. The Chinese phone manufacturer, Huawei, designs its own 5G chips and outsources production through Taiwan Semiconductor Manufacturing Co. , but previously offered QCOM chips in its flagship models. This stopped once the trade sanctions were put in place August 2020 (which surprisingly did not result in a hit to the stock even though Huawei is the worlds biggest supplier of 5G phones).  Huawei's only 5G chip, the Kirin 980, is [blown out of the water](https://nanoreview.net/en/soc-compare/qualcomm-snapdragon-875-vs-hisilicon-kirin-980) by QCOMs most recent 5G chip. As of now QCOM only has a [license to sell 4G chips to the Huawei, which is severly limiting their ability to supply smartphones and driving up the prices](https://www.theverge.com/2020/11/14/21565185/us-qualcomm-license-4g-chips-huawei-ban-china-phones). When Biden inevitably [lifts the trade restrictions he contested](https://www.globaltimes.cn/page/202101/1214060.shtml), Huawei will become another massive customer of QCOM and may even follow Apple's lead by abandoning their own chip design for QCOMs superior modems as the defualt modem in their flagship models. The revenue from this should be extensive due to pent up demand.\n\nSamsung has historically produced its own modems but QCOM's Snapdragon 888 seems to work [better in Samsung’s phone than their own newest Exynos 2100](https://www.gsmarena.com/exynos_2100_vs_snapdragon_888_sustained_performance_and_throttling_on_the_samsung_galaxy_s21_ultra_v-news-47769.php) and you can currently buy the phone with [either chip](https://www.sammobile.com/opinion/samsung-fans-have-had-it-with-exynos-processors). There is increasing pressure for Samsung to follow suit with apple and almost all other android smartphones and transition entirely to QCOM modems.\n\nQCOM has a ridiculous [patent portfolio](https://www.qualcomm.com/invention/qroniclesofinvention/index.html) and tons of high performing low cost 5G chips available.\n\nThis is likely why it continues to dominate its much smaller competitors such as Skyworks and Broadcom. However, one of the more impressive aspects of the portfolio is the large investment in AI. Almost all modern processors take advantage of AI in some way and this will really set the stage for the future of the industry.\n\nIf technology innovation follows its historical pattern, 6G will likely not be commercially available until around 2030 and considering the exponentially increasing patent portfolio due to reinvestment in R&amp;D by QCOM, it could be a leader in this as well.\n\n&amp;#x200B;\n\n[Fundamental Analysis of QCOM and Competition \\(Purple Estimates are from Yahoo Financial Analysts\\)](https://preview.redd.it/7v1s0jbjrcj61.png?width=439&amp;format=png&amp;auto=webp&amp;s=f9555472846e6d11e14ced4186b25b91caa0caba)\n\nQCOM is currently trading at around $137.12 after the recent volatility and I think it is a great opportunity to look at ITM Call options. It is the most affordable of its competition apart from intel which failed to keep Apple and was forced to [exit the modem industry](https://www.extremetech.com/extreme/227720-how-intel-lost-10-billion-and-the-mobile-market). It also has by far the best opportunity for growth. I think the Yahoo analyst projection is actually conservative.\n\nThere is another manufacturer that some people are claiming is relevant, MediaTek. I completely disagree. While it does have 5G chips, they are abysmal compared to everything else. They have very little scalability because they are a penny stock on TPE.\n\n**Price Prediction**\n\nLooking at the price action excluding the spike from the announcement of the Apple agreement in April 2019.\n\n&amp;#x200B;\n\n[Price action analysis of QCOM ](https://preview.redd.it/rajh6u56ocj61.png?width=1687&amp;format=png&amp;auto=webp&amp;s=73e89cab7db1b5d0ed86106641d41b2b4d8a3236)\n\nIt seems likely the price could range from $167.54 in the most bearish case to $258.99 in the most bullish. Giving a heavier weight to the bullish trajectory I believe $225 is a reasonable target at the current rate.\n\nThe previous Fibonacci retracement is not comparable due to the onset Covid-19 restrctions and the previous action is not very informative either because there are way too many developments in both the company and market. However, if we assume a retracement back to 0.618 at a price of $125.27 (I think the market will start to turn around due to Powell's testimony).  We should see a bounce late this week or early next week. Since this was a recovery I am expecting a trend reversal around the first Fibonacci extension metric. Which should happen close to year end, in a bullish case it keeps going on to the second metric.\n\nHowever, since the federal reserve is going to continue to its MMT policies along with the exponential rise in trading, I think 5G companies haven't yet received the attention they could (apart from AVGO), with the S&amp;P sitting at around a 39 average PE, I believe QCOMs PE has a lot of potential for upward movement in this bull market.\n\nIf we model QCOMS EPS with a 5th degree polynomial (excluding outliers) to allow for the exponential growth of 5G while hampering growth rate due to slower growth of other aspects of the company, this is the result.\n\n&amp;#x200B;\n\n[Red lines indicate Q1 and Q4 model EPS predictions, the equation of the best fit  polynomial is displayed. The 0.8&amp;#37; Confidence interval is shown as it visually fits the previous data well. ](https://preview.redd.it/8cntgna8ocj61.png?width=1072&amp;format=png&amp;auto=webp&amp;s=0cb9daa431f121e9876350d9c55e2be1be8c0d3e)\n\nThis puts the target price after 2021 at $342.45 ***at its current PE***, obviously the uncertainty is massive though and that is mostly due to the recent price action.\n\nRight now Jan 21, 2022 Calls with a $135 strike are $19.50 bid and $20.55 ask. The theta is currently -0.028 and a delta of 0.588 because it is pretty much ATM with a 36.63 IV. The IV has taken a 17% hit due to what looks like a recent correction, however this was mostly due to speculation about monetary policy, and I expect the IV to bounce as demand increases.\n\n[Date Key for Graphs](https://preview.redd.it/y3ugz6f89dj61.png?width=1554&amp;format=png&amp;auto=webp&amp;s=43f235f0d720e59f9fb2343771bf8d941cb918e1)\n\n&amp;#x200B;\n\n[IV](https://preview.redd.it/c9dfbfzn8dj61.png?width=1129&amp;format=png&amp;auto=webp&amp;s=fa87fac5bc93a8d0edbe059951eebd291c85cffd)\n\n&amp;#x200B;\n\n[Vega](https://preview.redd.it/55yibbwa9dj61.png?width=1126&amp;format=png&amp;auto=webp&amp;s=70ecfac54784eea3fad18e26f0e2de28bf8b81e6)\n\nThe vega is at its peak at 0.508 and only slowly declines as the options go ITM while IV sharply rises, I expect a significant premium increase due to this in the rebound.\n\nThe gamma is pretty low due to the length of the option and only decreases.\n\n&amp;#x200B;\n\n[Gamma](https://preview.redd.it/7dns6nc0adj61.png?width=1132&amp;format=png&amp;auto=webp&amp;s=0eec82bccfcce256cc9f2f36166afbd907e0bcbe)\n\nHowever, despite this, if we saw a return to last week's price delta would increase to nearly 0.9.\n\n&amp;#x200B;\n\n[Delta](https://preview.redd.it/jdtgd4x9adj61.png?width=1125&amp;format=png&amp;auto=webp&amp;s=04554cc43fde2d69a648da5e6e0cbd7b85b4e6f0)\n\nThetas look relatively stable until you get 2-3 weeks from expiry and deep OTM.  If you shoot for a pre-holiday sell or roll, and you stay at least above 25% OTM, you are looking at about a 40-60% theta hit to the premium. However, following a vega path in this box, you will see a range from 0.2-0.4 average vega, with IV following correspondingly to the intrinsic value, it could see an average of about 45-65. Thus its possible to offset the theta loss with 2.6 (13%) to 11.2 (56%) \\[using $20 premium\\] which would average to about a 15.5% premium loss. I think this could even be less however because the rebound will likely be soon.\n\n&amp;#x200B;\n\n[Vega Path](https://preview.redd.it/b2dfpdackdj61.png?width=1124&amp;format=png&amp;auto=webp&amp;s=22a6e8109e0910863f5efd91fd0a4e81ed28a27a)\n\nIt is pretty clear that the average delta will be around 0.9 assuming it goes in the right direction.\n\nAssuming the greeks follow the ranges above and selling or rolling at the target, in the most bearish case where it enters and follows the pre-Covid price action we can expect a $167 price which would net around a 229% return for the year. If we move to the next most bearish case (Yahoo Analysts) , this would net a 260% return. I think a 350-600% return is most likely though. It is not unreasonable to humor the possibility of a 1000% return on this investment in just one year.  If this stock begins to get more (deserved) attention and the PE starts to rise due to its real future value, this could be a really amazing trade 1000%+. These numbers seem too good to be true, but I invested heavily and have mostly held and or rolled both Apple and TSLA since 2017 based on similar principles, which adds to my confidence in this investment.\n\nThe figure below is a precalculated table of contract values, its pretty close to what I have, it seems like the delta curve it follows is a bit different (maybe a predetermined function and not based on the ticker's delta curve).\n\n&amp;#x200B;\n\n[Third Party value calculations](https://preview.redd.it/f1tv3t1aqdj61.png?width=885&amp;format=png&amp;auto=webp&amp;s=8d01984c67a63def0750a55e2fb33cb9975d3ceb)\n\nThis is not financial advice. I have multiple call options and many shares of QCOM.",
        "subreddit": "options",
        "title": "Trade of the Year: QCOM 01/21/22 Call $135 Strike DD",
        "url": "https://www.reddit.com/r/options/comments/lr6da4/trade_of_the_year_qcom_012122_call_135_strike_dd/",
        "created": 1614179254.0
    },
    {
        "author": "Kac985",
        "created_utc": 1613751320,
        "id": "lnjmb1",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Fuck all the hedge funds keeping track of stocks mentioned on here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnjmb1/fuck_all_the_hedge_funds_keeping_track_of_stocks/",
        "created": 1613780120.0
    },
    {
        "author": "FikerGaming",
        "created_utc": 1613766331,
        "id": "lnplr1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " So hedge funds use alot time and money to find what stocks are trending on WSB sub pages. so here are some to help them out. They need our help, you are welcome hedge funds.\n\nfeel free to copy this and spread it.\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "subreddit": "Wallstreetbetsnew",
        "title": "The hedge funds need our Help.",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lnplr1/the_hedge_funds_need_our_help/",
        "created": 1613795131.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1614375250,
        "id": "lt8fpw",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, February 26, 2021**\n\nStocks traded mixed, with the S&amp;P 500 (SPY) and Dow Jones (DIA) pulling back while the tech-heavy Nasdaq (QQQ) rose, rebounding from its worst selloff since October. Market participants continue to nervously eye rising Treasury yields. \n\nThe saga between market makers and retail traders continues. The Securities and Exchange Commission (SEC) temporarily suspended a list of companies from trading due to “questionable trading and social media activity,” according to a statement from the Commission. The SEC alleges that \"Certain social media accounts may be engaged in a coordinated attempt to artificially influence their share prices.” A full list of the halted securities can be found [here](https://www.sec.gov/litigation/suspensions/2021/34-91213-o.pdf?utm_medium=email&amp;utm_source=govdelivery).\n\nOn Friday, the U.S. House of Representatives is anticipated to pass a $1.9 trillion COVID-19 stimulus package. The bill includes an additional $1,400 in stimulus checks to most Americans, $400 per week in augmented federal unemployment insurance, and $350 billion in state, local and tribal government relief. The bill would then head to the U.S. Senate, with many lawmakers aiming to pass the bill before a mid-March cliff for when current pandemic-era benefits are set to expire.\n\nTreasury yields were mostly lower today at 1.424% at the time of writing but continue to hover near one-year highs. Treasury yields are the interest rate the US government pays on its debt obligations, such as bonds. Very basically, rising Treasury yields affect the stock market in two ways: (1) it makes Treasury bonds more attractive assets for investment and (2) raises the cost of borrowing money for companies, which is why high-flying tech stocks were hit particularly hard yesterday.  Charlie Ripley, senior investment strategist for Allianz Investment Management said, \"Driving rates higher has been a combination of higher growth expectations as well as higher inflation expectations. Until recently, market participants have been able to digest the upward drift in long-term rates, but it appears that the next leg up in interest rates is a bigger bite to chew. Looking at where real yields were at, they were simply too low when considering growth expectations, and it’s likely that long-term real yields will continue to drift higher as economic data improves.\" In other words, expectations for more growth in the market, combined with inflationary fears are lowering demand in bonds, which in turn raises the yield. \n\n**Highlights**\n\n* Robinhood[ disclosed in a filing Friday](https://www.sec.gov/Archives/edgar/data/1561014/000162828021003429/fy20rhfshortfinal.pdf) that the company is in talks with the Financial Industry Regulatory Authority (FINRA) over outages on the platform during the March 2020 market volatility, along with other matters surrounding options trading and communications with customers on the platform.\n* DigitalOcean and Olo are two tech companies that recently filed to go public. DigitalOcean is a cloud-computing company, while Olo provides restaurant software. \n* Britain is seeking to build a consensus among G7 nations on how to stop large technology companies exploiting their dominance, warning that there can be no repeat of Facebook's (FB) one-week media blackout in Australia.\n* Despite the recent market selloff, shares of EV-manufacturer Fisker (FSR) are flying, finishing the week up more than 56%. \n* DraftKings (DKNG) outperformed the market after raising guidance on revenue for next year during earnings report.\n* **\\*Note: Current stock prices are written in the premarket in the morning, so they do not reflect intraday changes in price.**\n* Airbnb (ABNB) with two target raises. Stock currently around $182\n   * Canaccord Genuity from $175 to $220 at Buy\n   * Needham &amp; Co. from $200 to $225 at Buy\n* AutoDesk (ADSK) target raised by Barclays from $324 to $335 at Overweight. Stock currently around $284\n* Broadcom (AVGO) target raised by Oppenheimer from $500 to $575 at Outperform. Stock currently around $457\n* Alarm (ALRM) target raised by Raymond James from $75 to $115 at Strong-Buy. Stock currently around $89\n* Booking (BKNG) target raised by Susquehanna from $2,100 to $3,000 at Positive. Stock currently around $2,273\n* ETSY with a host of target raises. Consensus price target $260 at Buy. Stock currently around $197\n* Wow, this is crazy bearish. Jeffries set a $79 price target for Facebook (FB). Stock is currently around $254\n* Fisker (FSR) target raised by Cowen from $22 to $29 at Outperform.\n* Shake Shack (SHAK) target raised by Piper Sandler from $122 to $135 at Overweight. Stock currently around $119\n* After announcing plans to double revenue by 2023, Twitter (TWTR) with two target raises. Stock currently around $75\n   * Pivotal Research from $77.25 to $95 at Buy\n   * Goldman Sachs (GS) from $78 to $112 at Buy.\n\n\"The person who starts simply with the idea of getting rich won't succeed; you must have a larger ambition.\" - John D. Rockefeller",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, February 26, 2021. Please Enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/lt8fpw/here_is_a_market_recap_for_today_friday_february/",
        "created": 1614404050.0
    },
    {
        "author": "balloonglue556",
        "created_utc": 1613754500,
        "id": "lnkxxm",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part. I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth. So, feel free to add to this list but here are \nstocks I like - both long and short. $COCK and $ASS are definitely the Vlad's favorite \n\nThanks u/junglehuck for the list of stocks I like a lot \n\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "I like these stocks so much (SEC &amp; HEDGies plz do not look at this post)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnkxxm/i_like_these_stocks_so_much_sec_hedgies_plz_do/",
        "created": 1613783300.0
    },
    {
        "author": "theflythewall",
        "created_utc": 1613343348,
        "id": "ljzjk5",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "MCHP, TXN, AVGO &amp; AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ljzjk5/mchp_txn_avgo_amd/",
        "created": 1613372148.0
    },
    {
        "author": "itshapda",
        "created_utc": 1613642641,
        "id": "lmjd72",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "# What  do  ₿TC , Apple, Qualcomm, Google, Microsoft, Amazon, Sony, AMD,  Nvidia, ARM, Intel, Broadcom, 5G, AI, Cathie Wood, and Butterfly Network  have in common??\n\n# They have the  most valuable company in the world, that no one really pays attention  to. What if you could gain exposure to all things future with one  ticker..?\n\n# The ticker is $TSM.\n\n# I am not a financial advisor. What I am sharing is my opinion, if anything I would like feedback from the community on the information I’ve provided.\n\n&amp;#x200B;\n\n* **XBT breaks 50k.**  \n\n   * [https://www.eenewseurope.com/news/first-seven-customers-5nm-tsmc-production](https://www.eenewseurope.com/news/first-seven-customers-5nm-tsmc-production)\n   * [https://www.tomshardware.com/news/tsmc-to-produce-5nm-asics-for-bitmain-canaan-in-2020](https://www.tomshardware.com/news/tsmc-to-produce-5nm-asics-for-bitmain-canaan-in-2020)\n   * [https://www.tweaktown.com/news/69632/tsmc-making-5nm-asics-bitmain-canaan-2020/index.html](https://www.tweaktown.com/news/69632/tsmc-making-5nm-asics-bitmain-canaan-2020/index.html)\n* **Cathie Wood**  \n\n   * [https://cathiesark.com/arkk/complete-holdings](https://cathiesark.com/arkk/complete-holdings)\n* **Playstation 5 sold out. Xbox sold out. RTX 3080 sold out, 3090 sold out.**   \n\n   * [https://www.theverge.com/21451144/sony-ps5-preorder-microsoft-xbox-series-x-nvidia-rtx-3080-mess](https://www.theverge.com/21451144/sony-ps5-preorder-microsoft-xbox-series-x-nvidia-rtx-3080-mess)\n   * [https://www.tomsguide.com/news/ps5-and-xbox-series-x-stock-shortages-have-killed-the-console-war](https://www.tomsguide.com/news/ps5-and-xbox-series-x-stock-shortages-have-killed-the-console-war)\n   * [https://www.thesun.co.uk/tech/13921865/sold-out-xbox-series-x-will-suffer-shortages-until-june-microsoft-admits/](https://www.thesun.co.uk/tech/13921865/sold-out-xbox-series-x-will-suffer-shortages-until-june-microsoft-admits/)\n   * [https://www.tomsguide.com/news/where-to-buy-the-nvidia-geforce-rtx-3080](https://www.tomsguide.com/news/where-to-buy-the-nvidia-geforce-rtx-3080)\n   * [https://www.tomshardware.com/news/terrible-time-to-buy-gpu-late-2020](https://www.tomshardware.com/news/terrible-time-to-buy-gpu-late-2020)\n   * [https://www.notebookcheck.net/PlayStation-5-production-hits-a-chip-related-obstacle-but-Sony-secures-US-supply-method-for-the-likely-affordable-PS5-console.494088.0.html](https://www.notebookcheck.net/PlayStation-5-production-hits-a-chip-related-obstacle-but-Sony-secures-US-supply-method-for-the-likely-affordable-PS5-console.494088.0.html)\n* **Apple.**  \n\n   * [https://www.notebookcheck.net/TSMC-cannot-meet-the-entire-Apple-M1-order-volume-Samsung-could-jump-to-the-rescue.503905.0.html](https://www.notebookcheck.net/TSMC-cannot-meet-the-entire-Apple-M1-order-volume-Samsung-could-jump-to-the-rescue.503905.0.html)\n   * [https://asia.nikkei.com/Business/Technology/Apple-partners-with-TSMC-to-develop-ultra-advanced-displays](https://asia.nikkei.com/Business/Technology/Apple-partners-with-TSMC-to-develop-ultra-advanced-displays)\n   * [https://www.macrumors.com/guide/tsmc/](https://www.macrumors.com/guide/tsmc/)\n   * [https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/apple-arm-using-80-of-tsmc-capacity-for-most-advanced-5nm-chips-61864034](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/apple-arm-using-80-of-tsmc-capacity-for-most-advanced-5nm-chips-61864034)\n\n&amp;#x200B;\n\n* **Amazon Web Services, (through AnnaPurna)**  \n\n   * [https://www.gizchina.com/2021/01/27/tsmc-will-manufacture-3nm-chips-for-intel-in-the-second-half-of-2022/](https://www.gizchina.com/2021/01/27/tsmc-will-manufacture-3nm-chips-for-intel-in-the-second-half-of-2022/)\n   * [https://www.cnn.com/2020/07/31/tech/tsmc-intel-semiconductors-hnk-intl/index.html](https://www.cnn.com/2020/07/31/tech/tsmc-intel-semiconductors-hnk-intl/index.html)\n   * [https://www.taiwannews.com.tw/en/news/3546432](https://www.taiwannews.com.tw/en/news/3546432)\n   * [https://techutzpah.com/chip-on-the-new-block-tsmc/](https://techutzpah.com/chip-on-the-new-block-tsmc/)\n\n&amp;#x200B;\n\n* **Google.**  \n\n   * [https://asia.nikkei.com/Business/Technology/TSMC-and-Google-push-chipmaking-boundaries-with-3D-stacking](https://asia.nikkei.com/Business/Technology/TSMC-and-Google-push-chipmaking-boundaries-with-3D-stacking)\n   * [https://www.taiwannews.com.tw/en/news/4057460](https://www.taiwannews.com.tw/en/news/4057460)\n   * [https://www.theburnin.com/industry/tsmc-teaming-google-amd-developing-chip-packaging-techniques-2020-11-24/](https://www.theburnin.com/industry/tsmc-teaming-google-amd-developing-chip-packaging-techniques-2020-11-24/)\n   * [https://www.reddit.com/r/AMD\\_Stock/comments/jwblw4/tsmc\\_and\\_google\\_push\\_chipmaking\\_boundaries\\_with/](https://www.reddit.com/r/AMD_Stock/comments/jwblw4/tsmc_and_google_push_chipmaking_boundaries_with/)\n   * [https://www.techpowerup.com/275209/tsmc-partners-with-google-and-amd-to-push-3d-silicon](https://www.techpowerup.com/275209/tsmc-partners-with-google-and-amd-to-push-3d-silicon)\n   * [https://www.eenewsanalog.com/news/google-amd-tipped-early-adopters-tsmc-chiplet-manufacturing](https://www.eenewsanalog.com/news/google-amd-tipped-early-adopters-tsmc-chiplet-manufacturing)\n   * [https://www.taiwannews.com.tw/en/news/3546432](https://www.taiwannews.com.tw/en/news/3546432)\n\n&amp;#x200B;\n\n* **5G. Qualcomm.**  \n\n   * [https://www.tweaktown.com/news/74800/qualcomm-and-tsmc-working-together-on-next-gen-snapdragon-885-chip/index.html](https://www.tweaktown.com/news/74800/qualcomm-and-tsmc-working-together-on-next-gen-snapdragon-885-chip/index.html)\n   * [https://www.digitimes.com/news/a20210122PD208.html](https://www.digitimes.com/news/a20210122PD208.html)\n   * [https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/](https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/)\n* **ARM**  \n\n   * [https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/apple-arm-using-80-of-tsmc-capacity-for-most-advanced-5nm-chips-61864034](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/apple-arm-using-80-of-tsmc-capacity-for-most-advanced-5nm-chips-61864034)\n* **Microsoft.**  \n\n   * [https://www.taiwannews.com.tw/en/news/3546432](https://www.taiwannews.com.tw/en/news/3546432)\n   * [https://pr.tsmc.com/english/news/1973](https://pr.tsmc.com/english/news/1973)\n\n&amp;#x200B;\n\n* **Advanced Micro Devices.**  \n\n   * [https://www.extremetech.com/computing/319929-amds-reliance-on-tsmc-isnt-harming-the-companys-growth-prospects](https://www.extremetech.com/computing/319929-amds-reliance-on-tsmc-isnt-harming-the-companys-growth-prospects)\n   * [https://www.extremetech.com/computing/313222-intel-amd-reportedly-fighting-for-capacity-at-tsmc](https://www.extremetech.com/computing/313222-intel-amd-reportedly-fighting-for-capacity-at-tsmc)\n* **Nvidia.**  \n\n   * [https://hexus.net/tech/news/graphics/146170-nvidia-shift-rtx-30-gpus-tsmc-7nm-2021-says-report/](https://hexus.net/tech/news/graphics/146170-nvidia-shift-rtx-30-gpus-tsmc-7nm-2021-says-report/)\n   * [https://www.anandtech.com/show/15800/nvidia-announces-new-drive-platforms-with-orin-and-ampere-](https://www.anandtech.com/show/15800/nvidia-announces-new-drive-platforms-with-orin-and-ampere-)\n* **Intel**  \n\n   * [https://www.eetasia.com/nxp-teams-with-tsmc-on-5nm-for-next-gen-auto-platform/](https://www.eetasia.com/nxp-teams-with-tsmc-on-5nm-for-next-gen-auto-platform/)\n   * [https://en.wikichip.org/wiki/mobileye/eyeq/eyeq5](https://en.wikichip.org/wiki/mobileye/eyeq/eyeq5)\n   * [https://www.gizmochina.com/2021/01/27/intel-3nm-chips-tsmc-2022/](https://www.gizmochina.com/2021/01/27/intel-3nm-chips-tsmc-2022/)\n* **Huawei Ban.**  \n\n   * [https://www.reuters.com/article/us-usa-huawei-tech-exclusive-idUSKBN22R1KC](https://www.reuters.com/article/us-usa-huawei-tech-exclusive-idUSKBN22R1KC)\n* **Butterfly Network**  \n\n   * [https://www.itnonline.com/content/butterfly-network-releases-new-version-point-care-ultrasound-platform-butterfly-iq](https://www.itnonline.com/content/butterfly-network-releases-new-version-point-care-ultrasound-platform-butterfly-iq)\n* **Broadcom, HiSilicon, Mediatek, Bitmain, Canaan, MicroBT ( ₿  Mining), Solar, Autonomous Vehicles, Artificial Intelligence.**  \n\n   * [https://www.taipeitimes.com/News/biz/archives/2020/03/09/2003732331](https://www.taipeitimes.com/News/biz/archives/2020/03/09/2003732331)\n   * [https://investors.broadcom.com/news-releases/news-release-details/broadcom-debuts-industrys-first-5nm-asic-data-center-and-cloud](https://investors.broadcom.com/news-releases/news-release-details/broadcom-debuts-industrys-first-5nm-asic-data-center-and-cloud)\n   * [https://www.channelnewsasia.com/news/business/mediatek-taps-tsmc-6-nanometer-tech-for-new-flagship-5g-phone-chips-14001724](https://www.channelnewsasia.com/news/business/mediatek-taps-tsmc-6-nanometer-tech-for-new-flagship-5g-phone-chips-14001724)\n\nI  had been living in Taiwan for the past 3 years, one thing i noticed is  Taiwanese people are very heavily influenced by the US. I also believe  the relationship between Taiwan and China have put Taiwan into a  position where it semi depends on the US. With China's economy booming,  the US did not want to give up their baby TSM. They banned TSM, from  making HiSilicon chips for Huawei. I wonder why?\n\nTSM  also announced they are spending 28 billion in capex, to hopefully  expand and meet the demand. A plant in Arizona, should also help the  American companies who rely on TSM heavily.\n\nBeing my first post, any feedback would be much appreciated.\n\nAlso thanks to [u/jamseh](https://www.reddit.com/u/jamseh/) for sharing his post, which gave me the idea of sharing mine. Check out his post here: [https://www.reddit.com/r/wallstreetbets/comments/ll7xmx/tsm\\_and\\_the\\_global\\_automotive\\_semiconductor/](https://www.reddit.com/r/wallstreetbets/comments/ll7xmx/tsm_and_the_global_automotive_semiconductor/)\n\nand [u/wallstreetbetch](https://www.reddit.com/u/wallstreetbetch/).",
        "subreddit": "wallstreetbets",
        "title": "Why this company is the most valuable company in the world.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lmjd72/why_this_company_is_the_most_valuable_company_in/",
        "created": 1613671441.0
    },
    {
        "author": "JaytotheEnny",
        "created_utc": 1613762830,
        "id": "lno8kc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I heard about all of the hedge funds working really, really hard on building these trackers that crawl through all of our posts looking for the next big hit. I feel so bad for those little-widdle hedgie funds and wanted to put together a great list for them. \n\n MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JAP, JAP, JAP JAP, JAP JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TATE, TATE, TATE, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Here are some stocks that I like- for all those trackers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lno8kc/here_are_some_stocks_that_i_like_for_all_those/",
        "created": 1613791630.0
    },
    {
        "author": "kasey721",
        "created_utc": 1613151944,
        "id": "ligbe2",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "AVGO is integrating the future!",
        "url": "https://www.reddit.com/r/StockMarket/comments/ligbe2/avgo_is_integrating_the_future/",
        "created": 1613180744.0
    },
    {
        "author": "kasey721",
        "created_utc": 1613151788,
        "id": "lig97h",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "AVGO -- That's the way to grow!",
        "url": "https://www.reddit.com/r/stocks/comments/lig97h/avgo_thats_the_way_to_grow/",
        "created": 1613180588.0
    },
    {
        "author": "flashman42069",
        "created_utc": 1612243249,
        "id": "laob8e",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Tesla Boeing Delta Broadcom",
        "url": "https://www.reddit.com/r/stocks/comments/laob8e/tesla_boeing_delta_broadcom/",
        "created": 1612272049.0
    },
    {
        "author": "Express-Let-6858",
        "created_utc": 1613103282,
        "id": "li3e9l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "WTF are people smoking around here? Seems like mostly their dough. BB was a good bet and a hold. The chips stocks are the big news now. AMD, TSMC, BROADCOM. The rest in this thread lately are face plants. TLRY at $420? You need to clear the smoke. Lemmie break this down to 3 points.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/li3e9l/wtf_are_people_smoking_around_here_seems_like/",
        "created": 1613132082.0
    },
    {
        "author": "itshapda",
        "created_utc": 1613642167,
        "id": "lmj8az",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\n# What do  ₿TC , Apple, Qualcomm, Google, Microsoft, Amazon, Sony, AMD, Nvidia, ARM, Intel, Broadcom, 5G, AI, Cathie Wood, and Butterfly Network have in common??\n\n# They have the most valuable company in the world, that no one really pays attention to. What if you could gain exposure to all things future with one ticker..?\n\n# The ticker is $TSM.\n\n# I am not a financial advisor.\n\n# What I am sharing is my opinion, if anything I would like feedback from the community on the information I’ve provided.\n\n* **XBT breaks 50k.**\n   * [https://www.eenewseurope.com/news/first-seven-customers-5nm-tsmc-production](https://www.eenewseurope.com/news/first-seven-customers-5nm-tsmc-production)\n   * [https://www.tomshardware.com/news/tsmc-to-produce-5nm-asics-for-bitmain-canaan-in-2020](https://www.tomshardware.com/news/tsmc-to-produce-5nm-asics-for-bitmain-canaan-in-2020)\n   * [https://www.tweaktown.com/news/69632/tsmc-making-5nm-asics-bitmain-canaan-2020/index.html](https://www.tweaktown.com/news/69632/tsmc-making-5nm-asics-bitmain-canaan-2020/index.html)\n\n&amp;#x200B;\n\n* **Cathie Wood**\n   * [https://cathiesark.com/arkk/complete-holdings](https://cathiesark.com/arkk/complete-holdings)\n\n&amp;#x200B;\n\n* **Playstation 5 sold out. Xbox sold out. RTX 3080 sold out, 3090 sold out.** \n   * [https://www.theverge.com/21451144/sony-ps5-preorder-microsoft-xbox-series-x-nvidia-rtx-3080-mess](https://www.theverge.com/21451144/sony-ps5-preorder-microsoft-xbox-series-x-nvidia-rtx-3080-mess)\n   * [https://www.tomsguide.com/news/ps5-and-xbox-series-x-stock-shortages-have-killed-the-console-war](https://www.tomsguide.com/news/ps5-and-xbox-series-x-stock-shortages-have-killed-the-console-war)\n   * [https://www.thesun.co.uk/tech/13921865/sold-out-xbox-series-x-will-suffer-shortages-until-june-microsoft-admits/](https://www.thesun.co.uk/tech/13921865/sold-out-xbox-series-x-will-suffer-shortages-until-june-microsoft-admits/)\n   * [https://www.tomsguide.com/news/where-to-buy-the-nvidia-geforce-rtx-3080](https://www.tomsguide.com/news/where-to-buy-the-nvidia-geforce-rtx-3080)\n   * [https://www.tomshardware.com/news/terrible-time-to-buy-gpu-late-2020](https://www.tomshardware.com/news/terrible-time-to-buy-gpu-late-2020)\n   * [https://www.notebookcheck.net/PlayStation-5-production-hits-a-chip-related-obstacle-but-Sony-secures-US-supply-method-for-the-likely-affordable-PS5-console.494088.0.html](https://www.notebookcheck.net/PlayStation-5-production-hits-a-chip-related-obstacle-but-Sony-secures-US-supply-method-for-the-likely-affordable-PS5-console.494088.0.html)\n\n&amp;#x200B;\n\n* **Apple.**\n   * [https://www.notebookcheck.net/TSMC-cannot-meet-the-entire-Apple-M1-order-volume-Samsung-could-jump-to-the-rescue.503905.0.html](https://www.notebookcheck.net/TSMC-cannot-meet-the-entire-Apple-M1-order-volume-Samsung-could-jump-to-the-rescue.503905.0.html)\n   * [https://asia.nikkei.com/Business/Technology/Apple-partners-with-TSMC-to-develop-ultra-advanced-displays](https://asia.nikkei.com/Business/Technology/Apple-partners-with-TSMC-to-develop-ultra-advanced-displays)\n   * [https://www.macrumors.com/guide/tsmc/](https://www.macrumors.com/guide/tsmc/)\n   * [https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/apple-arm-using-80-of-tsmc-capacity-for-most-advanced-5nm-chips-61864034](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/apple-arm-using-80-of-tsmc-capacity-for-most-advanced-5nm-chips-61864034)\n\n  \n\n\n*Processing img vzqfm1log7i61...*\n\n&amp;#x200B;\n\n* **Amazon Web Services, (through AnnaPurna)**\n   * [https://www.gizchina.com/2021/01/27/tsmc-will-manufacture-3nm-chips-for-intel-in-the-second-half-of-2022/](https://www.gizchina.com/2021/01/27/tsmc-will-manufacture-3nm-chips-for-intel-in-the-second-half-of-2022/)\n   * [https://www.cnn.com/2020/07/31/tech/tsmc-intel-semiconductors-hnk-intl/index.html](https://www.cnn.com/2020/07/31/tech/tsmc-intel-semiconductors-hnk-intl/index.html)\n   * [https://www.taiwannews.com.tw/en/news/3546432](https://www.taiwannews.com.tw/en/news/3546432)\n   * [https://techutzpah.com/chip-on-the-new-block-tsmc/](https://techutzpah.com/chip-on-the-new-block-tsmc/)\n\n&amp;#x200B;\n\n*Processing img pwde1ssqg7i61...*\n\n* **Google.**\n   * [https://asia.nikkei.com/Business/Technology/TSMC-and-Google-push-chipmaking-boundaries-with-3D-stacking](https://asia.nikkei.com/Business/Technology/TSMC-and-Google-push-chipmaking-boundaries-with-3D-stacking)\n   * [https://www.taiwannews.com.tw/en/news/4057460](https://www.taiwannews.com.tw/en/news/4057460)\n   * [https://www.theburnin.com/industry/tsmc-teaming-google-amd-developing-chip-packaging-techniques-2020-11-24/](https://www.theburnin.com/industry/tsmc-teaming-google-amd-developing-chip-packaging-techniques-2020-11-24/)\n   * [https://www.reddit.com/r/AMD\\_Stock/comments/jwblw4/tsmc\\_and\\_google\\_push\\_chipmaking\\_boundaries\\_with/](https://www.reddit.com/r/AMD_Stock/comments/jwblw4/tsmc_and_google_push_chipmaking_boundaries_with/)\n   * [https://www.techpowerup.com/275209/tsmc-partners-with-google-and-amd-to-push-3d-silicon](https://www.techpowerup.com/275209/tsmc-partners-with-google-and-amd-to-push-3d-silicon)\n   * [https://www.eenewsanalog.com/news/google-amd-tipped-early-adopters-tsmc-chiplet-manufacturing](https://www.eenewsanalog.com/news/google-amd-tipped-early-adopters-tsmc-chiplet-manufacturing)\n   * [https://www.taiwannews.com.tw/en/news/3546432](https://www.taiwannews.com.tw/en/news/3546432)\n\n&amp;#x200B;\n\n*Processing img iyh6e0msg7i61...*\n\n&amp;#x200B;\n\n* **5G. Qualcomm.**\n   * [https://www.tweaktown.com/news/74800/qualcomm-and-tsmc-working-together-on-next-gen-snapdragon-885-chip/index.html](https://www.tweaktown.com/news/74800/qualcomm-and-tsmc-working-together-on-next-gen-snapdragon-885-chip/index.html)\n   * [https://www.digitimes.com/news/a20210122PD208.html](https://www.digitimes.com/news/a20210122PD208.html)\n   * [https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/](https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/)\n\n&amp;#x200B;\n\n* **ARM**\n   * [https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/apple-arm-using-80-of-tsmc-capacity-for-most-advanced-5nm-chips-61864034](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/apple-arm-using-80-of-tsmc-capacity-for-most-advanced-5nm-chips-61864034)\n\n&amp;#x200B;\n\n* **Microsoft.**\n   * [https://www.taiwannews.com.tw/en/news/3546432](https://www.taiwannews.com.tw/en/news/3546432)\n\n&amp;#x200B;\n\n*Processing img j2ov407tg7i61...*\n\n* [https://pr.tsmc.com/english/news/1973](https://pr.tsmc.com/english/news/1973)\n\n&amp;#x200B;\n\n* Advanced Micro Devices.\n   * [https://www.extremetech.com/computing/319929-amds-reliance-on-tsmc-isnt-harming-the-companys-growth-prospects](https://www.extremetech.com/computing/319929-amds-reliance-on-tsmc-isnt-harming-the-companys-growth-prospects)\n   * [https://www.extremetech.com/computing/313222-intel-amd-reportedly-fighting-for-capacity-at-tsmc](https://www.extremetech.com/computing/313222-intel-amd-reportedly-fighting-for-capacity-at-tsmc)\n\n&amp;#x200B;\n\n* Nvidia.\n   * [https://hexus.net/tech/news/graphics/146170-nvidia-shift-rtx-30-gpus-tsmc-7nm-2021-says-report/](https://hexus.net/tech/news/graphics/146170-nvidia-shift-rtx-30-gpus-tsmc-7nm-2021-says-report/)\n   * [https://www.anandtech.com/show/15800/nvidia-announces-new-drive-platforms-with-orin-and-ampere-](https://www.anandtech.com/show/15800/nvidia-announces-new-drive-platforms-with-orin-and-ampere-)\n\n&amp;#x200B;\n\n* Intel\n   * [https://www.eetasia.com/nxp-teams-with-tsmc-on-5nm-for-next-gen-auto-platform/](https://www.eetasia.com/nxp-teams-with-tsmc-on-5nm-for-next-gen-auto-platform/)\n   * [https://en.wikichip.org/wiki/mobileye/eyeq/eyeq5](https://en.wikichip.org/wiki/mobileye/eyeq/eyeq5)\n   * [https://www.gizmochina.com/2021/01/27/intel-3nm-chips-tsmc-2022/](https://www.gizmochina.com/2021/01/27/intel-3nm-chips-tsmc-2022/)\n\n&amp;#x200B;\n\n* Huawei Ban.\n   * [https://www.reuters.com/article/us-usa-huawei-tech-exclusive-idUSKBN22R1KC](https://www.reuters.com/article/us-usa-huawei-tech-exclusive-idUSKBN22R1KC)\n\n&amp;#x200B;\n\n* Butterfly Network\n   * [https://www.itnonline.com/content/butterfly-network-releases-new-version-point-care-ultrasound-platform-butterfly-iq](https://www.itnonline.com/content/butterfly-network-releases-new-version-point-care-ultrasound-platform-butterfly-iq)\n\n&amp;#x200B;\n\n* Broadcom, HiSilicon, Mediatek, Bitmain, Canaan, MicroBT ( ₿  Mining), Solar, Autonomous Vehicles, Artificial Intelligence.\n   * [https://www.taipeitimes.com/News/biz/archives/2020/03/09/2003732331](https://www.taipeitimes.com/News/biz/archives/2020/03/09/2003732331)\n   * [https://investors.broadcom.com/news-releases/news-release-details/broadcom-debuts-industrys-first-5nm-asic-data-center-and-cloud](https://investors.broadcom.com/news-releases/news-release-details/broadcom-debuts-industrys-first-5nm-asic-data-center-and-cloud)\n   * [https://www.channelnewsasia.com/news/business/mediatek-taps-tsmc-6-nanometer-tech-for-new-flagship-5g-phone-chips-14001724](https://www.channelnewsasia.com/news/business/mediatek-taps-tsmc-6-nanometer-tech-for-new-flagship-5g-phone-chips-14001724)\n\n&amp;#x200B;\n\nI had been living in Taiwan for the past 3 years, one thing i noticed is Taiwanese people are very heavily influenced by the US. I also believe the relationship between Taiwan and China have put Taiwan into a position where it semi depends on the US. With China's economy booming, the US did not want to give up their baby TSM. They banned TSM, from making HiSilicon chips for Huawei. I wonder why? \n\nTSM also announced they are spending 28 billion in capex, to hopefully expand and meet the demand. A plant in Arizona, should also help the American companies who rely on TSM heavily. \n\n  \nBeing my first post, any feedback would be much appreciated.\n\n   \nAlso thanks to u/jamseh for sharing his post, which gave me the idea of sharing mine. Check out his post here: [https://www.reddit.com/r/wallstreetbets/comments/ll7xmx/tsm\\_and\\_the\\_global\\_automotive\\_semiconductor/](https://www.reddit.com/r/wallstreetbets/comments/ll7xmx/tsm_and_the_global_automotive_semiconductor/)\n\n  \nand u/wallstreetbetch.",
        "subreddit": "wallstreetbets",
        "title": "The most valuable company in the entire world, that no one pays enough attention to!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lmj8az/the_most_valuable_company_in_the_entire_world/",
        "created": 1613670967.0
    },
    {
        "author": "itshapda",
        "created_utc": 1613643150,
        "id": "lmjhma",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " What  do  ₿TC , Apple, Qualcomm, Google, Microsoft, Amazon, Sony, AMD,  Nvidia, ARM, Intel, Broadcom, 5G, AI, Cathie Wood, and Butterfly Network  have in common??\n\nThey have the  most valuable company in the world, that no one really pays attention  to. What if you could gain exposure to all things future with one  ticker..?\n\nThe ticker is $TSM.\n\nI am not a financial advisor.What I am sharing is my opinion, if anything I would like feedback from the community on the information I’ve provided.\n\n&amp;#x200B;\n\n* **XBT breaks 50k.**\n   * [https://www.eenewseurope.com/news/first-seven-customers-5nm-tsmc-production](https://www.eenewseurope.com/news/first-seven-customers-5nm-tsmc-production)\n   * [https://www.tomshardware.com/news/tsmc-to-produce-5nm-asics-for-bitmain-canaan-in-2020](https://www.tomshardware.com/news/tsmc-to-produce-5nm-asics-for-bitmain-canaan-in-2020)\n   * [https://www.tweaktown.com/news/69632/tsmc-making-5nm-asics-bitmain-canaan-2020/index.html](https://www.tweaktown.com/news/69632/tsmc-making-5nm-asics-bitmain-canaan-2020/index.html)\n\n&amp;#x200B;\n\n* **Cathie Wood**\n   * [https://cathiesark.com/arkk/complete-holdings](https://cathiesark.com/arkk/complete-holdings)\n\n&amp;#x200B;\n\n* **Playstation 5 sold out. Xbox sold out. RTX 3080 sold out, 3090 sold out.** \n   * [https://www.theverge.com/21451144/sony-ps5-preorder-microsoft-xbox-series-x-nvidia-rtx-3080-mess](https://www.theverge.com/21451144/sony-ps5-preorder-microsoft-xbox-series-x-nvidia-rtx-3080-mess)\n   * [https://www.tomsguide.com/news/ps5-and-xbox-series-x-stock-shortages-have-killed-the-console-war](https://www.tomsguide.com/news/ps5-and-xbox-series-x-stock-shortages-have-killed-the-console-war)\n   * [https://www.thesun.co.uk/tech/13921865/sold-out-xbox-series-x-will-suffer-shortages-until-june-microsoft-admits/](https://www.thesun.co.uk/tech/13921865/sold-out-xbox-series-x-will-suffer-shortages-until-june-microsoft-admits/)\n   * [https://www.tomsguide.com/news/where-to-buy-the-nvidia-geforce-rtx-3080](https://www.tomsguide.com/news/where-to-buy-the-nvidia-geforce-rtx-3080)\n   * [https://www.tomshardware.com/news/terrible-time-to-buy-gpu-late-2020](https://www.tomshardware.com/news/terrible-time-to-buy-gpu-late-2020)\n   * [https://www.notebookcheck.net/PlayStation-5-production-hits-a-chip-related-obstacle-but-Sony-secures-US-supply-method-for-the-likely-affordable-PS5-console.494088.0.html](https://www.notebookcheck.net/PlayStation-5-production-hits-a-chip-related-obstacle-but-Sony-secures-US-supply-method-for-the-likely-affordable-PS5-console.494088.0.html)\n\n&amp;#x200B;\n\n* **Apple.**\n   * [https://www.notebookcheck.net/TSMC-cannot-meet-the-entire-Apple-M1-order-volume-Samsung-could-jump-to-the-rescue.503905.0.html](https://www.notebookcheck.net/TSMC-cannot-meet-the-entire-Apple-M1-order-volume-Samsung-could-jump-to-the-rescue.503905.0.html)\n   * [https://asia.nikkei.com/Business/Technology/Apple-partners-with-TSMC-to-develop-ultra-advanced-displays](https://asia.nikkei.com/Business/Technology/Apple-partners-with-TSMC-to-develop-ultra-advanced-displays)\n   * [https://www.macrumors.com/guide/tsmc/](https://www.macrumors.com/guide/tsmc/)\n   * [https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/apple-arm-using-80-of-tsmc-capacity-for-most-advanced-5nm-chips-61864034](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/apple-arm-using-80-of-tsmc-capacity-for-most-advanced-5nm-chips-61864034)\n\n&amp;#x200B;\n\n* **Amazon Web Services, (through AnnaPurna)**\n   * [https://www.gizchina.com/2021/01/27/tsmc-will-manufacture-3nm-chips-for-intel-in-the-second-half-of-2022/](https://www.gizchina.com/2021/01/27/tsmc-will-manufacture-3nm-chips-for-intel-in-the-second-half-of-2022/)\n   * [https://www.cnn.com/2020/07/31/tech/tsmc-intel-semiconductors-hnk-intl/index.html](https://www.cnn.com/2020/07/31/tech/tsmc-intel-semiconductors-hnk-intl/index.html)\n   * [https://www.taiwannews.com.tw/en/news/3546432](https://www.taiwannews.com.tw/en/news/3546432)\n   * [https://techutzpah.com/chip-on-the-new-block-tsmc/](https://techutzpah.com/chip-on-the-new-block-tsmc/)\n\n&amp;#x200B;\n\n* **Google.**\n   * [https://asia.nikkei.com/Business/Technology/TSMC-and-Google-push-chipmaking-boundaries-with-3D-stacking](https://asia.nikkei.com/Business/Technology/TSMC-and-Google-push-chipmaking-boundaries-with-3D-stacking)\n   * [https://www.taiwannews.com.tw/en/news/4057460](https://www.taiwannews.com.tw/en/news/4057460)\n   * [https://www.theburnin.com/industry/tsmc-teaming-google-amd-developing-chip-packaging-techniques-2020-11-24/](https://www.theburnin.com/industry/tsmc-teaming-google-amd-developing-chip-packaging-techniques-2020-11-24/)\n   * [https://www.reddit.com/r/AMD\\_Stock/comments/jwblw4/tsmc\\_and\\_google\\_push\\_chipmaking\\_boundaries\\_with/](https://www.reddit.com/r/AMD_Stock/comments/jwblw4/tsmc_and_google_push_chipmaking_boundaries_with/)\n   * [https://www.techpowerup.com/275209/tsmc-partners-with-google-and-amd-to-push-3d-silicon](https://www.techpowerup.com/275209/tsmc-partners-with-google-and-amd-to-push-3d-silicon)\n   * [https://www.eenewsanalog.com/news/google-amd-tipped-early-adopters-tsmc-chiplet-manufacturing](https://www.eenewsanalog.com/news/google-amd-tipped-early-adopters-tsmc-chiplet-manufacturing)\n   * [https://www.taiwannews.com.tw/en/news/3546432](https://www.taiwannews.com.tw/en/news/3546432)\n\n&amp;#x200B;\n\n* **5G. Qualcomm.**\n   * [https://www.tweaktown.com/news/74800/qualcomm-and-tsmc-working-together-on-next-gen-snapdragon-885-chip/index.html](https://www.tweaktown.com/news/74800/qualcomm-and-tsmc-working-together-on-next-gen-snapdragon-885-chip/index.html)\n   * [https://www.digitimes.com/news/a20210122PD208.html](https://www.digitimes.com/news/a20210122PD208.html)\n   * [https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/](https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/)\n\n&amp;#x200B;\n\n* **ARM**\n   * [https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/apple-arm-using-80-of-tsmc-capacity-for-most-advanced-5nm-chips-61864034](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/apple-arm-using-80-of-tsmc-capacity-for-most-advanced-5nm-chips-61864034)\n\n&amp;#x200B;\n\n* **Microsoft.**\n   * [https://www.taiwannews.com.tw/en/news/3546432](https://www.taiwannews.com.tw/en/news/3546432)\n   * [https://pr.tsmc.com/english/news/1973](https://pr.tsmc.com/english/news/1973)\n\n&amp;#x200B;\n\n* **Advanced Micro Devices.**  \n\n   * [https://www.extremetech.com/computing/319929-amds-reliance-on-tsmc-isnt-harming-the-companys-growth-prospects](https://www.extremetech.com/computing/319929-amds-reliance-on-tsmc-isnt-harming-the-companys-growth-prospects)\n   * [https://www.extremetech.com/computing/313222-intel-amd-reportedly-fighting-for-capacity-at-tsmc](https://www.extremetech.com/computing/313222-intel-amd-reportedly-fighting-for-capacity-at-tsmc)\n\n&amp;#x200B;\n\n* **Nvidia.**\n   * [https://hexus.net/tech/news/graphics/146170-nvidia-shift-rtx-30-gpus-tsmc-7nm-2021-says-report/](https://hexus.net/tech/news/graphics/146170-nvidia-shift-rtx-30-gpus-tsmc-7nm-2021-says-report/)\n   * [https://www.anandtech.com/show/15800/nvidia-announces-new-drive-platforms-with-orin-and-ampere-](https://www.anandtech.com/show/15800/nvidia-announces-new-drive-platforms-with-orin-and-ampere-)\n\n&amp;#x200B;\n\n* **Intel**\n   * [https://en.wikichip.org/wiki/mobileye/eyeq/eyeq5](https://en.wikichip.org/wiki/mobileye/eyeq/eyeq5)\n   * [https://www.gizmochina.com/2021/01/27/intel-3nm-chips-tsmc-2022/](https://www.gizmochina.com/2021/01/27/intel-3nm-chips-tsmc-2022/)\n\n&amp;#x200B;\n\n* **Huawei Ban.**\n   * [https://www.reuters.com/article/us-usa-huawei-tech-exclusive-idUSKBN22R1KC](https://www.reuters.com/article/us-usa-huawei-tech-exclusive-idUSKBN22R1KC)\n\n&amp;#x200B;\n\n* **Butterfly Network**\n   * [https://www.itnonline.com/content/butterfly-network-releases-new-version-point-care-ultrasound-platform-butterfly-iq](https://www.itnonline.com/content/butterfly-network-releases-new-version-point-care-ultrasound-platform-butterfly-iq)\n\n&amp;#x200B;\n\n* **Broadcom, HiSilicon, Mediatek, Bitmain, Canaan, MicroBT ( ₿  Mining), Solar, Autonomous Vehicles, Artificial Intelligence.**\n   * [https://www.taipeitimes.com/News/biz/archives/2020/03/09/2003732331](https://www.taipeitimes.com/News/biz/archives/2020/03/09/2003732331)\n   * [https://investors.broadcom.com/news-releases/news-release-details/broadcom-debuts-industrys-first-5nm-asic-data-center-and-cloud](https://investors.broadcom.com/news-releases/news-release-details/broadcom-debuts-industrys-first-5nm-asic-data-center-and-cloud)\n   * [https://www.channelnewsasia.com/news/business/mediatek-taps-tsmc-6-nanometer-tech-for-new-flagship-5g-phone-chips-14001724](https://www.channelnewsasia.com/news/business/mediatek-taps-tsmc-6-nanometer-tech-for-new-flagship-5g-phone-chips-14001724)\n\nI  had been living in Taiwan for the past 3 years, one thing i noticed is  Taiwanese people are very heavily influenced by the US. I also believe  the relationship between Taiwan and China have put Taiwan into a  position where it semi depends on the US. With China's economy booming,  the US did not want to give up their baby TSM. They banned TSM, from  making HiSilicon chips for Huawei. I wonder why?\n\nTSM  also announced they are spending 28 billion in capex, to hopefully  expand and meet the demand. A plant in Arizona, should also help the  American companies who rely on TSM heavily.\n\nBeing my first post, any feedback would be much appreciated.\n\nAlso thanks to [u/jamseh](https://www.reddit.com/u/jamseh/) for sharing his post, which gave me the idea of sharing mine. Check out his post here: [https://www.reddit.com/r/wallstreetbets/comments/ll7xmx/tsm\\_and\\_the\\_global\\_automotive\\_semiconductor/](https://www.reddit.com/r/wallstreetbets/comments/ll7xmx/tsm_and_the_global_automotive_semiconductor/)\n\nand [u/wallstreetbetch](https://www.reddit.com/u/wallstreetbetch/).",
        "subreddit": "wallstreetbets",
        "title": "Perserverance lands on Mars today, This stock is heading to the MOON.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lmjhma/perserverance_lands_on_mars_today_this_stock_is/",
        "created": 1613671950.0
    }
]