[
    {
        "author": "InvestorCowboy",
        "created_utc": 1623600506,
        "id": "nyzmxy",
        "num_comments": 356,
        "num_crossposts": 0,
        "selftext": "**10. IBUY (Amplify Online Retail)**\n\nNet Assets: 1.23 B\n\n5-Year Return: 416.54%\n\nTop 5 Notable Holdings: Lands' End, ThredUp, Stitch Fix, The RealReal, and BigCommerce Holdings.\n\n&amp;#x200B;\n\n**9. ARKG (ARK Genomic Revolution)**\n\nNet Assets: 9.44 B\n\n5-Year Return: 415.29%\n\nTop 5 Notable Holdings: Teladoc Health, Exact Sciences, CareDx, Pacific BioSciences, and Regeneration Pharmaceuticals.\n\n&amp;#x200B;\n\n**8. ARKK (ARK Innovation)**\n\nNet Assets: 22.28 B\n\n5-Year Return: 493.36%\n\nTop 5 Notable Holdings: Tesla, Teladoc, Roku, Zoom, and Square.\n\n&amp;#x200B;\n\n**7. QLD (ProShares Ultra QQQ)**\n\nNet Assets: 4.3 B\n\n5-Year Return: 658.04%\n\nTop 5 Notable Holdings: Alphabet Inc-CL C, Facebook, Alphabet Inc-Cl A, Tesla, and NVDIA.\n\n&amp;#x200B;\n\n**6. ARKW (ARK Next Generation Internet)**\n\nNet Assets: 6.90 B\n\n5-Year Return: 527.61%\n\nTop 5 Notable Holdings: Tesla, Grayscale Bitcoin Trust, Square, Teladoc, and Shopify.\n\n&amp;#x200B;\n\n**5. USD (ProShares Ultra Semiconductors)**\n\nNet Assets: 5.45 B\n\n5-Year Return: 801.83%\n\nTop 5 Notable Holdings: NVIDIA, Intel, Broadcom, Texas Instruments, and Qualcomm.\n\n&amp;#x200B;\n\n**4. ROM (ProShares Ultra Technology)**\n\nNet Assets: 765.4 M\n\n5-year Return: 820.41%\n\nTop 5 Notable Holdings: Apple, Microsoft, Facebook, Alphabet Inc-CL A, and Alphabet Inc-CL C.\n\n&amp;#x200B;\n\n**3. TQQQ (ProShares UltraPro QQQ)**\n\nNet Assets: 12.1 B\n\n5-year Return: 1286.04%\n\nTop 5 Notable Holdings: Apple, Amazon, Alphabet Inc-CL C, Facebook, and Alphabet Inc-CL A.\n\n&amp;#x200B;\n\n**2. TECL (Direxion Daily Technology Bull 3x Shares)**\n\nNet Assets: 2.02 B\n\n5-Year Return: 1272.70%\n\nTop 5 Notable Holdings: Apple, Microsoft, NVIDIA, VISA, and Mastercard.\n\n&amp;#x200B;\n\n**1. SOXL (Direxion Daily Semiconductors Bull 3x Shares)**\n\nNet Assets: 4.56 B\n\n5-Year Return: 2011.76%\n\nTop 5 Notable Holdings: NVIDIA, Texas Instruments, Broadcom, Qualcomm, and Intel.\n\n&amp;#x200B;\n\nOriginal Post w/ Charts can be found \\[here\\]([https://www.reddit.com/r/doctorstock/comments/nyvtds/top\\_10\\_highest\\_earning\\_etfs/](https://www.reddit.com/r/doctorstock/comments/nyvtds/top_10_highest_earning_etfs/))\n\n&amp;#x200B;\n\n*Made using Microsoft Excel*\n\n*Disclaimer:*\n\n*\\*\\*Charts don't include all ETFs holdings\\*\\**\n\n*\\*\\*This is not investment advice\\*\\**\n\n*\\*\\*Do your own research\\*\\**",
        "subreddit": "investing",
        "title": "Top 10 Highest Earning ETFs",
        "url": "https://www.reddit.com/r/investing/comments/nyzmxy/top_10_highest_earning_etfs/",
        "created": 1623629306.0
    },
    {
        "author": "anuder1",
        "created_utc": 1622566943,
        "id": "npytvv",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": " \n\n**Why Intel ($INTC) is undervalued**\n\nThis is my first ever stock analysis, any tips will be appreciated. \n\nDISCLOSURE: I do not own any shares of Intel at the time of writing. \n\nIntel is a chipmaker who has been beaten down by the ongoing global chip shortage. Intel is down from it’s high and has a relatively low P/E value. I am currently bullish on Intel. AMD is currently expensive and overvalued at the moment. AMD has had no availability in the consumer market for quite some time. Intel is finally the more affordable option again (in terms of consumer parts) due to AMD having very limited availability. In terms of stock, Intel is currently down from it’s high and has potential to go back up. \n\n**Finances**\n\nFirst things first, let’s get into Intel’s financials. Over the past few years, Intel has had steady revenue growth:\n\n2017: 62.76B\n\n2018: 70.85B\n\n2019: 71.97B\n\n2020: 77.87B\n\nIntel has also been steadily buying back outstanding shares, declining in numbers every year:\n\nIn 2018, Intel had 4.701B outstanding shares, a 2.77% decrease from 2017.\n\nIn 2019, Intel had 4.473B outstanding shares, a 4.85% decrease from 2018.\n\nIn 2020, Intel had 4.232B outstanding shares, a 5.39% decrease from 2019.\n\nIn March 2021, Intel had 4.096B outstanding shares, a 5.01% decrease from 2020.\n\n**Competition/Growth Potential**\n\nIntel has a P/E ratio of 12.80. This is low, compared to the average P/E ratio of 22.69 for the rest of the industry. Intel is also still down from it’s stock price high of \\~$68 in April at \\~$57 right now. The global chip shortage has been the main cause of Intel being down, along with fierce competition from AMD. As chip production begins to pick back up, Intel’s stock should begin to go up as well. AMD has been hurt greatly from this chip shortage as well, giving Intel a chance to possibly undercut AMD and lead to growth. \n\nIntel also plans to build more production plants so that they can keep up with the ever-increasing demand for chips. Intel is still ahead of AMD in market share as well. Intel’s new 11th Gen processors are back on top in terms of speed, especially in laptops. A subsidiary of Intel has also landed a deal with Toyota ($TM) to produce radar technology for Toyota. \n\n**Final Thoughts**\n\nIntel seems to be using the chip shortage as a way to come back from their drought. They seem to have been benefiting from it greatly.\n\nIntel is not out yet. They still have the market share and resources to compete with AMD. Intel is undervalued and has the capability to bounce back strong from the chip shortage and also has a chance to finally come out on top as the primary choice in the chip market. \n\nWhat are everyone else’s thoughts? I personally believe that Intel is due for a breakout in the next months, but what does everyone else think? I was also wondering about Qualcomm ($QCOM), what does everyone think about that?",
        "subreddit": "investing",
        "title": "Why Intel ($INTC) is Undervalued",
        "url": "https://www.reddit.com/r/investing/comments/npytvv/why_intel_intc_is_undervalued/",
        "created": 1622595743.0
    },
    {
        "author": "joelivi053",
        "created_utc": 1624717202,
        "id": "o8bon3",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": "GSAT (Globalstar) is the future of Satellite Communications (GPS) and 5G PT $6.60 2021, $10-15 2022 Here's why: Compare the 5G demand to Straight Path Communications in 2017. There was a vicious bidding war between Verizon and AT&amp;T to acquire the next big 5G telecommunications company, StraightPath. I'm here to tell you history is going to repeat itself in GSAT. Deals with NOKIA and QUALCOMM will catapult this to double digits!!!!!!!!\n\n\"Globalstar, Inc. provides mobile satellite services worldwide. The company offers duplex two-way voice and data products, including mobile voice and data satellite communications services and equipment for remote business continuity, recreational usage, safety, emergency preparedness and response, and other applications; fixed voice and data satellite communications services and equipment at industrial, commercial, and residential sites, as well as rural villages and ships; and satellite data modem services comprising asynchronous and packet data services. It also provides SPOT consumer retail products, such as SPOT satellite GPS messenger for personal tracking, emergency location, and messaging solutions; and SPOT Trace, an anti-theft and asset tracking device. In addition, the company offers commercial Internet of Things one-way transmission products to track cargo containers and rail cars, as well as to monitor utility meters, and oil and gas assets. Further, it sells wholesale minutes to independent gateway operators (IGOs); and provides engineering services, such as hardware and software designs to develop specific applications; and installation of gateways and antennas.\"\n\nMarketplace: 5G is clearly the future of many industries. Autonomous cars (EV), Cellular, Energy, Agriculture, etc all willsoonrelyon5Gstructuredcommunications. GSATencompassesallofthese. The 5G market alone is expected to be worth over 667 Billion dollars in 5 years. This is not even including the EV space, which relies heavily on secure communications (aka GSAT) The Market is setup for a dominant, trusted company like GSAT to overtake.\n\nLeadership:\n\nDavid Kagan Chief Executive Officer David Kagan currently serves as CEO of Globalstar. Prior to re-joining Globalstar as President and COO in December 2017, Kagan was the COO of SpeedCast International Limited. He served as President of ITC Global, a premier global VSAT satellite services provider from August 2014 through September 2015. He was also the President and CEO of Globe Wireless from June 2011 through January 2014 when it was sold to Inmarsat PLC.\n\nL. Barbee Ponder IV General Counsel and Vice President of Regulatory Mr. Ponder has previously served as Senior Regulatory Counsel for BellSouth Corporation in Washington, D.C. where he provided representation before the Federal Communications Commission, Congress and the White House on issues concerning 1996\n\nTelecommunications Act, deregulation of broadband services and tax issues concerning the telecommunications industry. Guys...This man worked for the FCC on the telecommunications act in 1996. He knows the regulations and rules behind telecom industry (5G).\n\nTechnology, Current Contracts Band53 technology created by GSAT is being used by companies like Nokia and recently Qualcomm. From a press release: \"Globalstar has worked to develop the Band 53 ecosystem with a group of priority partners like Nokia. Globalstar’s Band 53 is a prime mid-band spectrum resource that we offer to our partners for deployment with customers that otherwise would not have access to the benefits of licensed spectrum. The combination of Nokia’s global reach and Globalstar’s Band 53 terrestrial authorizations in multiple countries around the globe present an exciting opportunity for secure wireless solutions.\" This technology is the absolute future of secure 5G connections in not only telecommunications, but also in the EV landscape. Yes you heard it right, GSAT already uses their technology in auto makers such as Fiat Chrysler and Jeep. GSAT has the technology to jump fully into the connected car market, especially the ever poipular EV connected car market. GSAT owns 24 ground stations that serve as points between satellites and over 120 countries. The reach is already there. They are only limited by which contracts they will inevitably pick up. See: Nokia, Jeep, Qualcomm. (So far)\n\nFuture Growth With the world becoming ever more connected, these smaller but established companies are just waiting to boom. Every partnership that GSAT sees can increase its cap 2-3 fold. Just a basic true evaluation by some analysts see GSAT worth 9.25 Billion (pre Qualcomm deal) which puts them at $6.60 a share at current valuations! If you don't believe me, go look at what Nokia has said about their partnership with Globalstar: https://investors.globalstar.com/news-releases/news-release-details/globalstar-announces-nokia-deployment-over-licensed-band-53-port",
        "subreddit": "wallstreetbets",
        "title": "$GSAT GlobalStar analysis (+1,000%)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o8bon3/gsat_globalstar_analysis_1000/",
        "created": 1624746002.0
    },
    {
        "author": "kozzmo1",
        "created_utc": 1622744739,
        "id": "nrk9v6",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "Hey everyone! I’m 26 and all my life my dad has been telling me I should diversify and buy good stocks in different sectors. However looking at my YTD profits I’m sitting at only 2% gain. Looking at switching to index funds because a lot of them throw off an okay dividend as well as gaining a lot more than 2% wanted to know peoples thoughts on my portfolio and what I might be able to differently. I’ve been told owning a stock is like owning a company and if you cannot spend the time to research every company and keep up with it, index funds are the best choice. \n\nHere are my stocks:\nMMM \nAMD \nAMZN \nAAPL \nCVX \nCMCSA \nD \nHD \nHON \nINTC\nJNJ\nKMB\nLMT\nNKE\nPEP\nQCOM\nKO\nV\nDIS\nPLTR\nMP \n\nPlease let me know what you think. I think overall it’s a pretty diversified portfolio, a bit tech heavy, I know. Any suggestions please let me know, thank you!",
        "subreddit": "investing",
        "title": "Thinking about switching to index funds",
        "url": "https://www.reddit.com/r/investing/comments/nrk9v6/thinking_about_switching_to_index_funds/",
        "created": 1622773539.0
    },
    {
        "author": "third_legatron",
        "created_utc": 1623811202,
        "id": "o0ut7u",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Based on the companies PEG ratio it seems that lam research is in a very unique place when it comes to forward earnings regarding the semi space. The stock continues to be undervalued relative to peers. \n\nI am not big into tech at all. I do own shares on nvidia, AMD, and lam research as of now. Amd and lam have relatively low PEG ratios for stocks expecting the growth that they do and I believe it represents a clear buying opportunity. I understand that lam research has done extremely well this year due to the semiconductor shortage, but I still believe being long lam is a smart move. \n\nI bought lam at $500 with the intention of averaging down and have not had the chance. I will not average up on these names as of now, since I do like my cost basis. But I do believe these names have room to run.\n\nNvidia is an exception I will live with because they do just destroy every expectation set and are a leader in many of their industries. I see their PEG of 3.1 as sustainable and wanted to own them pre-split. I also sold bull put spreads because I believe the case for Nvidia is unique. \n\nThe tech industry is flush with buying opportunities, although I wouldn't necessarily go all in on at a given time, I would put 25% on intended capitol to work and leave cash on the side to play the average as the stock moves. With the inflation and interest theme playing out, I feel there will be more buying opportunities, but I also want skin in the game. I stick to big tech and companies that can handle interest rates rising. \n\nI wouldn't go long on a semi ETF at this point, but I would like some money in the game.\n\nEdit: Qualcomm should be on this list, but I do not follow them. They are great.",
        "subreddit": "stocks",
        "title": "Lam research in value growth territory, other tech stocks.",
        "url": "https://www.reddit.com/r/stocks/comments/o0ut7u/lam_research_in_value_growth_territory_other_tech/",
        "created": 1623840002.0
    },
    {
        "author": "Florin123-",
        "created_utc": 1623288672,
        "id": "nwbqv5",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "Hey Ya! Remember the early 2000s? It was all about lace-up jeans, giant cargo shorts, Gilmore Girls, Lord of the Rings, the Atkins Diet ... and the BlackBerry.\n\nLong before the iPhone, the BlackBerry was the most beloved mobile gadget in the universe, known especially for its reliability, its security, and its full keyboard. But Research In Motion, the company that made it, didn't change quickly enough with the times, and the sweet fruit of its labors went sour. The company renamed itself BlackBerry (NYSE: BB) in early 2013 and set on a course of reinvention — first around smartphones, and then around software. Many people wrote it off.\n\nAnd that's where we see a major opportunity.\n\nBlackBerry has been quietly accelerating in its new mission securing all the connected devices that the modern world increasingly relies on. You've heard of the Internet of Things, chips embedded in all the stuff around us transmitting a wealth of data? Call the business angle \"the Enterprise of Things.\" BlackBerry's new focus still draws on its expertise in endpoint security, which shows us the fruit hasn't fallen so far from the tree. But this time around, it's securing things like self-driving vehicles, emergency health networks, financial reporting, and much more.\n\nIf your image of BlackBerry is stuck in the past, read on. This is a company with a future.\n\nSecond Bloom!\n\nIt's no surprise that most investors would pass BlackBerry by after a quick glance. Revenue has declined every year since 2011 — and even then, the company's share price was far below the peak of nearly $150 that it reached in mid-2008.\n\nBut this is, quite simply, an entirely different company than the BlackBerry most people remember, and its turnaround is just starting to take hold. Moreover, the company's progress is masked by the continuing decline of old legacy businesses that aren't part of management's vision or our investment thesis going forward.\n\nBlackBerry continued to sell its own handheld devices until mid-2016, and there are still BlackBerry-branded devices available, so current results continue to suffer from the decline of this business. Service access fees (SAF), related to legacy users of BlackBerry operating systems, are also dwindling. Given that these two businesses still represented roughly 50% of revenue in fiscal 2017, their continued decline has been keenly felt.\n\nBut the meat of the current business, Software and Services, has grown at an average annual pace of 15% over the past three years, reaching $782 million in fiscal 2018 (the company's fiscal year ends in February). This is now by far the largest part of BlackBerry, and we expect revenue for the company as a whole to stabilize this year and start rising thereafter.\n\nThe company's QNX operating system, in particular, has been driving growth. Traditionally used in vehicle infotainment systems, it has grown into the software backbone that can run all the chips in a vehicle, including safety and communications. BlackBerry has struck key deals with Qualcomm (NASDAQ: QCOM), Nvidia (NASDAQ: NVDA), Baidu (NASDAQ: BIDU), and others around this technology. Baidu, in turn, has made QNX the core of its Apollo platform, and has partnered with automakers like Ford (NYSE: F) and Hyundai to make this the core of future autonomous vehicles.\n\nThis certainly isn't the only area where BlackBerry's business is growing, but it's emblematic of the niche the company is carving out: securing endpoints in the Internet of Things, with a particular focus on enterprises. It has been a leader in Gartner's (NYSE: IT) Magic Quadrant for enterprise mobility management for the past two years, making it one of the Top Dogs in a sector that's expected to grow revenue at a 25% annual pace through 2021. \n\nStill Green!\n\nThat hasn't yet put BlackBerry in the black, but it's building the core of a very profitable business.\n\nSince being recapitalized by Fairfax Financial in 2013, BlackBerry has boasted a strong balance sheet, with $2.2 billion in cash and $810 million in convertible debt (which will likely convert to shares rather than being repaid). Gross margin improved from 49% in fiscal 2017 to an amazing 73% in fiscal 2018, indicating not only the company's shift from hardware to software, but also some considerable pricing power. Management also expects the company to deliver positive free cash flow this year (it did last year, too, albeit thanks to a large one-time adjustment).\n\nAdd it up and this is a $5.4 billion company currently generating around $800 million in very high-margin software revenue (leaving aside the remaining hardware and SAF businesses), with over 80% of that revenue recurring. With a gross margin that improved to 76% in the most recent quarter, we expect this business to ultimately produce profit margins in the 20% to 25% range, even as the top line continues to grow. That looks like an attractive price point.\n\nRisks and When We'd Sell!\n\nThere are a lot of reasons to look more deeply at BlackBerry's financials, but the surface picture remains unflattering. For the time being, this remains a company with shrinking revenue and marginal profitability. Changing that relies not just on continued growth of the software business, but scaling the business so that BlackBerry's relatively high sales, marketing, and R&amp;D costs come down as a percentage of revenue.\n\nThe company is a leader in a growing sector, but its competitors — companies like IBM (NYSE: IBM), VMware (NYSE: VMW), Cisco Systems (NASDAQ: CSCO), and others — have a lot of resources. That's why it's important that BlackBerry establish an especially strong presence in areas like vehicles, but we would like to see it keep getting wins in other areas, too.\n\nThe Foolish Bottom Line!\n\nNot every turnaround works, but BlackBerry has already become a leader in enterprise mobility management by leveraging its security DNA. This company has spent the last five years under CEO John Chen honing its new focus, and at this point he says the company is \"largely done reinventing itself\" and ready to focus on furthering its leadership. Chen should know — he's a turnaround expert who was previously brought into database company Sybase, returning it to profitability before it was sold to SAP (NYSE: SAP) in 2010.\n\nWhether or not BlackBerry remains on its own or is ultimately acquired, we expect it to continue expanding its capability and reach in keeping connected \"things\" safe and secure. The best part is that many investors can't see the green shoots growing from the rotten fruit of a decade past. That's a sweet opportunity.",
        "subreddit": "wallstreetbets",
        "title": "Buy $BB Recommendations by David Gardner (Stock Advisor - A Motley Fool Service) July 19, 2018!!! That's still a sweet opportunity.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nwbqv5/buy_bb_recommendations_by_david_gardner_stock/",
        "created": 1623317472.0
    },
    {
        "author": "TheDevelopedDeed",
        "created_utc": 1623102071,
        "id": "nuoeuq",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Industry groups from Japan and Finland will conduct joint research and development of sixth-generation communications technology, looking to lead the creation of 6G standards in a field increasingly influenced by Chinese companies.\n\nFinnish telecom supplier Nokia, a global leader in the industry, will join the effort.\n\nJapan's Beyond 5G Promotion Consortium will sign the agreement soon with Finnish group 6G Flagship. The accord is to be announced Tuesday at the Global Digital Summit 2021, an event organized by Nikkei and Japan's Ministry of Internal Affairs and Communications.\n\nThe initiative follows a [$4.5 billion commitment](https://asia.nikkei.com/Business/Telecommunication/US-and-Japan-to-invest-4.5bn-in-next-gen-6G-race-with-China) by Japan and the U.S. toward the development of next-generation communications technology, in a partnership announced in April. Extending the cooperation to \"third-countries\" to promote secure connectivity is seen helping in the competition with China to set global standards.\n\nThe Beyond 5G Promotion Consortium, which aims to commercialize 6G technology in the 2030s, includes the University of Tokyo along with major Japanese telecom players such as Nippon Telegraph &amp; Telephone, NTT Docomo, KDDI, SoftBank Corp. and Rakuten Mobile. 6G Flagship is led by Finland's University of Oulu.\n\nMembers of the Japanese consortium will engage in joint research projects and personnel exchange. The group is in talks for future collaboration with an American counterpart that includes telecom supplier Cisco Systems and chipmaker Intel.\n\nShares of 5G patents owned by Japanese developers have fallen behind the likes of South Korea's Samsung Electronics and U.S. player Qualcomm. NTT Docomo holds about 6% of 5G patents, compared with roughly 10% for Qualcomm and China's Huawei Technologies.\n\nThe internal affairs ministry aims for Japan to command at least a 10% share in 6G patents together with a slice of 30% or more in equipment and software.\n\n[Source](https://asia.nikkei.com/Business/Telecommunication/Japan-teams-up-with-Finland-on-6G-development)\n\n&amp;#x200B;\n\n# NOK to the moon! 🚀 --&gt; 🌙",
        "subreddit": "wallstreetbets",
        "title": "👩‍🚀Japan partners with $NOK on 6G, China may follow? MOON TIME! 🚀🚀🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nuoeuq/japan_partners_with_nok_on_6g_china_may_follow/",
        "created": 1623130871.0
    },
    {
        "author": "joelivi053",
        "created_utc": 1624656320,
        "id": "o7wxw5",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "This is all off the top of my head but it’s a basic outline of why I think GSAT is a big deal. There are a lot of people who understand the company better than I do, but I really think this is worth looking seriously at, and its up a little bit today so here’s my first stab at DD.\n\nBe advised: I’m not a sat com expert, nor is this investment advice and I really have no Idea what I'm doing here.\n\nAlso, I should say Price Targets for GSAT range wildly, I've seen targets over $200 per share floated around with some pretty impressive analysis behind it, but more conservatively I'm in line with suggestions it COULD be $30-$50 if and when all goes well in a very optimal scenario, and it seems there's a much broader consensus on a 7$ to 10$ target in the near term.\n\nGSAT owns c band and s band spectrum, which with the push to 5G and Internet of Things has suddenly become incredibly valuable. Recent FCC auctions will attest to this.\n\nFor years, GSAT was waiting for FCC authorization on that spectrum, but by the time they got it, they had issues with debt and investors were wary to jump in without a clear Monetization plan for their spectrum. The heavy debt situation has since been resolved, giving them enough of a cash runway to continue in for the next three years. Their business model during most of the past decade involved satellite phones and gps tracking, which, with their aging satellites and limited market for that kind of stuff, was never meant to do much more than keep the lights on while they waited for the value of their spectrum to appreciate. Their share price languished under $1 for a long time until 2021, when a couple things started to shift. They partnered with Nokia to set up a secure redundant 5G node for the port of Seattle, with more similar collaborations likely down the line. Then, most recently, QCOM announced that their x65 next generation snapdragon modem, which is the most popular smartphone modem in the world, will connect to the n53 band specifically. GSAT owns this band of spectrum, nobody else. QCOM obviously did that for a reason, but as of now, there’s no widespread usage of that spectrum as it’s not really being used except by GSAT SPOT devices and phones, which is to say, hardly at all.\n\nExactly what that means for GSAT is unclear, but what it does mean is that within a few years, millions of devices around the world will have the ability to connect to their spectrum.\n\nThere’s a lot of DD out there breaking down price targets, but the truth is nobody knows, and the CEO and other execs have shown an incredible amount of patience and personal investment in terms of allowing their spectrum assets to appreciate while putting their own money on the line to keep things afloat over the years.\n\nStarlink, AT&amp;T, Verizon should all be interested in buying, and have probably all made offers or overtures, but GSAT has not bitten, even when they needed the money. Which also suggests that the company is not interested in a sale. And indeed, leasing the spectrum might be far more lucrative than an outright sale, and better for shareholders.\n\nI won't bother describing the different possible monetization strategies here, as I've linked to a report published by Nokia at the bottom of this post that does a much better job than I could.\n\nGSATs spectrum is sometimes compared to a large swath of undeveloped beachfront property in the middle of South Beach, completely clean and unsullied in the middle of an increasingly crowded and frenzied space.\n\nThey look like a penny stock at first glance but they are far from it, and it may be the ultimate 5G play.\n\nYou might ask: What about Musk’s Starlink? Aren’t they going to eat GSAT’s lunch?\n\nEDIT: This is better addressed in a comment by u/squishjonesjr:\n\n\"Starlink use Ku band for their user terminal links and Ka for the gateway links, they wont need any spectrum in C-band. Also doubt they would purchase spectrum to ensure others cant use it, their main focus is not going bankrupt. Their initial constellation will cost ~$10B and could be much higher if more sats are needed (filed for up to 15k sats). Not to mention their gen 1 sats have a useful life of 5 years so they will have to replace those soon after service start.\"\n\n-u/squishjonesjr\n\nStarlink probably doesn’t need GSAT spectrum, and for our purposes, GSAT is not really in competition with Starlink, as their current business model (which will be affected by Starlink) is not the source of the stocks theoretcal valuation. but if someone DID want to compete with Starlink, they would need to access GSAT assets. Which is another reason why Starlink might need to get there first, not because they need it but because they dont want anyone else to have it.\n\nStarlink is a possible buyer for GSAT, not for their satellites but for their spectrum. The value of GSAT is NOT in its satellites or the ground units, its in the spectrum.\n\nDISH is another possible buyer for GSAT.\n\nSome people point to debt issues with GSAT . It’s true the company has diluted its shares quite a bit to remain solvent over the years, but they currently have enough cash on hand to give them a three year runway. It would make ZERO sense for another offering to occur BEFORE a major monetization event for the spectrum, and since this is 5G, that monetization event is going to happen WELL before they run out of cash.\n\nAnother issue often raised: “The FCC can just seize spectrum and reallocate it if they want, that’s what happened to (insert late 90’s early 2000’s Sat company here)\n\nThese other companies, from what I understand, had major issues with solvency, and so they basically went to the FCC to see what kind of deal they could get if they surrendered it to be reallocated. BTW, I’ve learned that the correct way to talk about spectrum is not as something that GSAT owns or holds but as something they currently control.\n\nSeems Risky?\n\nBetting on the value of Globalstar spectrum WAS a risky play, but now that QCOM has legitimized the value of the n53 band (albeit not explicitly or specifically in terms of eventual use case) by including it in the next gen snapdragon's connectivity ability, the risk associated with the play has diminished a great deal.\n\nThe bear case of the QCOM aspect of all this is that including n53 connectivity is more of a marketing trick than something they imagine will actually get used, but given that n53 is extraordinarily underutilized at this point, even that scenario implies that QCOM expects to see expanded usage of that band in the short term.\n\nAlso I thought it was interesting that Nokia would publish this on their website: https://www.nokia.com/blog/case-globalstar-6-ways-leverage-spectrum-asset/\n\nFrom Nokia:\n\n“Nokia customer Globalstar Inc., a U.S. based provider of mobile satellite voice and data services, is in the enviable position of having 2.4 GHz spectrum that works everywhere, meaning it has been globally allocated. 2.4 GHz spectrum is in the sweet spot from a physics perspective because it’s good for both coverage and capacity. Although it’s not yet a 3GPP standardized spectrum band, it has been approved by the Federal Communications Commission and recently in other countries. It’s remarkably clean meaning it’s clear, has no co-channel interference and provides network benefits for both indoor and outdoor deployments.\n\nGlobalstar turned to Nokia to help determine the band characteristics for its available spectrum and identify potential application options. Nokia’s Network Planning and Optimization (NPO) team conducted a small cell network study of Globalstar’s 2.4 GHz spectrum as compared to a similar HetNet network in 2.1 GHz. The study proved the versatility of Globalstar’s spectrum, showing that operators with a small cell network could benefit from Globalstar’s clean spectrum, while those without small cell networks could benefit from its huge capacity.\n\nIn our study, Globalstar’s spectrum outperformed outdoor small cell deployments by 20%, while requiring 33% less infrastructure. For indoors in an urban office environment, we were able to deploy approximately half the access points required since the band has no interference from macro towers operating in the same frequency. The full report can be seen here. The team went a step further to also provide six business model options for Globalstar to consider.\n\n“We were excited to work with Nokia’s NPO experts to help determine how to best monetize and maximize the use cases of our spectrum asset so we can deliver the highest quality experience to the end users,” said Jay Monroe, chairman and CEO of Globalstar.\n\n6 ways to monetize &amp; maximize the spectrum\n\n1.Lease the spectrum to incumbent operators – This provides extra capacity for operators and uses their own RAN equipment and services. Operators can use clean spectrum without incumbrance and it supports standard capabilities like Carrier Aggregation, roaming and redirection. For Globalstar, this is a simple revenue model without any operational burdens.\n\n2.Dedicated in-building small cell spectrum – The analysis clearly shows the difficulties presented by macro interference to small cell deployments. Offering a dedicated, clean spectrum band would dramatically improve the performance of these HetNets and significantly reduce the cost to deploy them. Globalstar could lease the spectrum to one carrier nationwide or carriers in geographic regions that wanted to reduce the strain on their expensive macro tower infrastructure.\n\n3.Use the spectrum as a satellite service enhancement – By deploying RANs in Globalstar’s high use areas, such as air terminals, shipping ports, military bases or cargo handling facilities, Globalstar can both provide satellite offload and support high data rates and advanced applications. Enhanced services are provided to customers where they normally congregate, and for these customers there is a layer of satellite redundancy in the event of disruptions in terrestrial networks.\n\n4.Lease spectrum for private LTE systems to non-carriers – Cable companies are increasingly interested in pursuing wireless services themselves. Globalstar’s spectrum provides an opportunity to add a private LTE network on top of their dense cable plant. Alternatively, as the in-building networks are further developed there may be an opportunity to include Globalstar’s band as a private LTE service on top of neutral host models.\n\n5.Directly provide private services to enterprises – By offering private LTE systems directly to enterprises, Globalstar provides spectrum, equipment and services to end user customers, which provides direct control over the user experience and maximizes private LTE system revenue opportunities. These deployments of Globalstar’s spectrum could be done while several of these other options are pursued simultaneously.\n\n6.Mass market product enablement licensing – Globalstar could license spectrum to ODM manufacturers for use in mass market. This would include unrestricted use and products distributed globally. This option could address the Internet of Things or Connected Car markets.\n\nNo matter what Globalstar decides to do, Nokia will be there to partner with them – in the U.S. and around the world. We are also lending our support to the 3GPP standardization process and equipment manufacturing enablement, which are critical for the spectrum’s success.",
        "subreddit": "wallstreetbets",
        "title": "GSAT ULTIMATE DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o7wxw5/gsat_ultimate_dd/",
        "created": 1624685120.0
    },
    {
        "author": "ImpactExtreme",
        "created_utc": 1624023403,
        "id": "o2p9k4",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "[Billionaire Sternlicht Goes Bigger Again to Extend SPAC Streak](https://www.bloomberg.com/news/articles/2021-06-18/billionaire-sternlicht-goes-bigger-again-to-extend-spac-streak)\n\n\nProperty billionaire Barry Sternlicht has once again increased the size of a special purpose acquisition company, a trick that others are finding harder to pull off in a cooling SPAC market.\n\nSternlicht’s Jaws Juggernaut Acquisition Corp. raised $240 million in its U.S. initial public offering after boosting the size of the deal by 20%, according to a statement late Thursday. The SPAC is the fifth in a series raised by Sternlicht since the beginning of last year -- all with “Jaws” in the name -- and he’s achieved the rare feat of upsizing every one of them.\n\nIt’s a sign that after a blowout 18 months for blank-check listings, in which record amounts of capital have been raised for deals across all major sectors, investors are starting to become more selective about where they place their bets and are focusing on serial dealmakers with proven track records.\n\nOnly 11% of the SPACs priced in the U.S. this quarter were upsized, down from nearly half of all offerings in the first quarter, according to data compiled by Bloomberg. The strong demand for the latest SPAC from Sternlicht, the founder of Starwood Capital, comes as the overall market slows after the glut of deals and recent regulatory crackdowns.\n\nThe listing also marks a return to the limelight for former Qualcomm Inc. boss Paul Jacobs, who left the smartphone chipmaker in 2018. Jacobs serves as chief executive officer of the SPAC, which will hunt for acquisitions in the wireless communications industry.\n\nJaws Juggernaut says it’s already identified one potential target -- unusual for SPACs that usually start their search after listing. It may consider buying XCOM Labs Inc., the startup that Jacobs founded after leaving Qualcomm, and combining it with another company, according to the prospectus. That would technically comply with SPAC norms as the vehicle wouldn’t buy only XCOM.\n\nCredit Suisse Group AG arranged the Jaws Juggernaut offering. Units of the SPAC start trading Friday on the Nasdaq Capital Market under the “JUGGU” ticker.\n\nSome of Sternlicht’s previous blank-check companies have already sealed acquisitions. Jaws Spitfire Acquisition Corp., which has tennis legend Serena Williams on its board, agreed in March to buy metal printing specialist Velo3D Inc. Earlier this month, medical provider Cano Health Inc. started trading on the New York Stock Exchange after completing a merger with Jaws Acquisition Corp.",
        "subreddit": "SPACs",
        "title": "$JUGGU - Barry Sternlicht's new upsized SPAC Jaws Juggernaut potentially merging with XCOM Labs Inc",
        "url": "https://www.reddit.com/r/SPACs/comments/o2p9k4/juggu_barry_sternlichts_new_upsized_spac_jaws/",
        "created": 1624052203.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1624203195,
        "id": "o487cq",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "**10. IBUY (Amplify Online Retail)**\n\nhttps://preview.redd.it/o095f9j6wf671.png?width=1266&amp;format=png&amp;auto=webp&amp;s=5cdce21bca22b42c49a668b125bc037dbb3bb32b\n\nNet Assets: 1.23 B\n\n5-Year Return: 416.54%\n\nTop 5 Notable Holdings: Lands' End, ThredUp, Stitch Fix, The RealReal, and BigCommerce Holdings.\n\n**9. ARKG (ARK Genomic Revolution)**\n\nhttps://preview.redd.it/5u59k4u7wf671.png?width=1506&amp;format=png&amp;auto=webp&amp;s=39fbfc7c7fcbee4a9d5fdba6e9195f1c0233a982\n\nNet Assets: 9.44 B\n\n5-Year Return: 415.29%\n\nTop 5 Notable Holdings: Teladoc Health, Exact Sciences, CareDx, Pacific BioSciences, and Regeneration Pharmaceuticals.\n\n**8. ARKK (ARK Innovation)**\n\nhttps://preview.redd.it/q0yu09x8wf671.png?width=1496&amp;format=png&amp;auto=webp&amp;s=1a63e17b49dd15208b6735c319a60d5c08bbcab8\n\nNet Assets: 22.28 B\n\n5-Year Return: 493.36%\n\nTop 5 Notable Holdings: Tesla, Teladoc, Roku, Zoom, and Square.\n\n**7. QLD (ProShares Ultra QQQ)**\n\nhttps://preview.redd.it/1l49gjx9wf671.png?width=1292&amp;format=png&amp;auto=webp&amp;s=1b24887e9c128a61519dbb99baf813f13c94f0cc\n\nNet Assets: 4.3 B\n\n5-Year Return: 658.04%\n\nTop 5 Notable Holdings: Alphabet Inc-CL C, Facebook, Alphabet Inc-Cl A, Tesla, and NVDIA.\n\n**6. ARKW (ARK Next Generation Internet)**\n\nhttps://preview.redd.it/4qakkl8bwf671.png?width=1276&amp;format=png&amp;auto=webp&amp;s=e5da1a42d080e4b7f7b4ca1ba797fe545751199e\n\nNet Assets: 6.90 B\n\n5-Year Return: 527.61%\n\nTop 5 Notable Holdings: Tesla, Grayscale Bitcoin Trust, Square, Teladoc, and Shopify.\n\n**5. USD (ProShares Ultra Semiconductors)**\n\nhttps://preview.redd.it/zs4v0wmcwf671.png?width=1252&amp;format=png&amp;auto=webp&amp;s=7e2e29bf1b4add0f882ede6d3a6d5a86a12e8350\n\nNet Assets: 5.45 B\n\n5-Year Return: 801.83%\n\nTop 5 Notable Holdings: NVIDIA, Intel, Broadcom, Texas Instruments, and Qualcomm.\n\n**4. ROM (ProShares Ultra Technology)**\n\nhttps://preview.redd.it/dtspaerdwf671.png?width=1510&amp;format=png&amp;auto=webp&amp;s=86cf6bad090d5fa3144bedcfe33dff630b997bf0\n\nNet Assets: 765.4 M\n\n5-year Return: 820.41%\n\nTop 5 Notable Holdings: Apple, Microsoft, Facebook, Alphabet Inc-CL A, and Alphabet Inc-CL C.\n\n**3. TQQQ (ProShares UltraPro QQQ)**\n\nhttps://preview.redd.it/88hq2eoewf671.png?width=1162&amp;format=png&amp;auto=webp&amp;s=639a7fc428c69fb6ba1f12d52813cb602ae5c2f6\n\nNet Assets: 12.1 B\n\n5-year Return: 1286.04%\n\nTop 5 Notable Holdings: Apple, Amazon, Alphabet Inc-CL C, Facebook, and Alphabet Inc-CL A.\n\n**2. TECL (Direxion Daily Technology Bull 3x Shares)**\n\nhttps://preview.redd.it/vton7vkfwf671.png?width=1480&amp;format=png&amp;auto=webp&amp;s=be59f68834e298a513afca5a0ee3560c07536927\n\nNet Assets: 2.02 B\n\n5-Year Return: 1272.70%\n\nTop 5 Notable Holdings: Apple, Microsoft, NVIDIA, VISA, and Mastercard.\n\n**1. SOXL (Direxion Daily Semiconductors Bull 3x Shares)**\n\nhttps://preview.redd.it/zdgd1gegwf671.png?width=1338&amp;format=png&amp;auto=webp&amp;s=effaeb3b3a6baa6bdf21df9152108d606bf2a67e\n\nNet Assets: 4.56 B\n\n5-Year Return: 2011.76%\n\nTop 5 Notable Holdings: NVIDIA, Texas Instruments, Broadcom, Qualcomm, and Intel.\n\n&amp;#x200B;\n\n*Made using Microsoft Excel*\n\n*Disclaimer:*\n\n*\\*\\*Charts don't include all ETFs holdings\\*\\**\n\n*\\*\\*This is not investment advice\\*\\**\n\n*\\*\\*Do your own research\\*\\**",
        "subreddit": "StockMarket",
        "title": "Top 10 Highest Earning ETFs",
        "url": "https://www.reddit.com/r/StockMarket/comments/o487cq/top_10_highest_earning_etfs/",
        "created": 1624231995.0
    },
    {
        "author": "dreamliner330",
        "created_utc": 1623711408,
        "id": "nzzexc",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I'm holding a lot of NVDA right now and I'm a bit concerned that the ARM merger might fall through which I'm sure would be disasterous for the stock (at least a big short term hit).\n\nWhat I've read shows the deal won't be finalized until 2022 but what concerns me is an early end from a country rejecting the merger terms.  I also see now that Qualcomm has injected itself into the story.\n\n[https://www.cnbc.com/2021/06/08/nvidias-acquisition-of-arm-set-to-be-delayed-by-chinese-regulators.html](https://www.cnbc.com/2021/06/08/nvidias-acquisition-of-arm-set-to-be-delayed-by-chinese-regulators.html)\n\n[https://www.cnbc.com/2021/06/14/qualcomm-offers-to-invest-in-arm-as-regulators-threaten-nvidia-deal.html](https://www.cnbc.com/2021/06/14/qualcomm-offers-to-invest-in-arm-as-regulators-threaten-nvidia-deal.html)\n\n&amp;#x200B;\n\nWhat do you guys this of the merger timeline and is there any way to monitor the progress?  Perhaps this thread could keep us up to date on NVDA/ARM news.",
        "subreddit": "stocks",
        "title": "NVDA &amp; ARM? Consequences of a failed acquisition?",
        "url": "https://www.reddit.com/r/stocks/comments/nzzexc/nvda_arm_consequences_of_a_failed_acquisition/",
        "created": 1623740208.0
    },
    {
        "author": "Jimenezmf777",
        "created_utc": 1624494627,
        "id": "o6ppms",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Earlier this year, Verizon, AT&amp;T and T-Mobile collectively spent almost $100 billion on C-band spectrum licenses for 5G. Incredibly, all that spending didn't even cover the billions of additional dollars in network equipment that will be necessary to put that spectrum into use.\n\nNow, as the dust settles on all those eye-watering expenditures, investors are beginning to look at other spectrum license holders in a new light.\n\n\"We believe Globalstar and its sponsors, after years of development, support and patience, are at long last starting to realize a return on satellite system and spectrum assets, making 2021 an excellent time, in our opinion, to buy Globalstar before the market digests this change,\" wrote the financial analysts at B. Riley Securities in a recent note to investors. The analysts gave Globalstar's stock a \"buy\" rating.\n\nGlobalstar is one of a handful of companies that holds spectrum licenses that could eventually make their way into terrestrial 5G networks. Whether those licenses will underpin a private 5G network for an enterprise or a public 5G network for a big mobile network operator remains to be seen.\n\n ⬆️ The partnerships of XCOM LABS and QUALCOMM will benefit GSATs spectrum\n\nhttps://www.lightreading.com/5g/are-globalstar-anterix-nextnav-and-ligado-ushering-in-new-era-of-5g/a/d-id/770372",
        "subreddit": "pennystocks",
        "title": "AT&amp;T, Verizon, T-Mobile Vs GSAT",
        "url": "https://www.reddit.com/r/pennystocks/comments/o6ppms/att_verizon_tmobile_vs_gsat/",
        "created": 1624523427.0
    },
    {
        "author": "TheMacroDrip",
        "created_utc": 1622736430,
        "id": "nrh2hj",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "The global semi-conductor shortage, aka chip shortage, has been crippling many industries. Demand for chips is continuing to outstrip supply and the car industry is longer the only one feeling the pain. Many auto-makers are actually limiting the amount of cars produced in 2021, including Ford recently who announced they will be canceling weeks worth of production of the F-150.\n\n**Overview**\n\nThere are a few factors at play giving analysts the impression that this shortage may last until early 2022. There’s a few KEY points that come to mind:\n\n* Most chips are produced overseas: Covid-related delays in shipping ports have effected supply coming into the United States.\n* China has been stock-piling chips: Chinese businesses have bought an absurd amount of chip-producing equipment (roughly $32 billion) in an effort to protect themselves from further US sanctions.\n* Demand for electronic products have soared.\n* Often over-looked, consumers don’t realize the amount of chips it takes to build cars in 2021. The trend is continuing in the same direction as many analysts expect the automative industry to begin predominantly developing cars with network connectivity.\n\nThis leaves an opportunity for those willing to look past the hardship some of these companies are experiencing of being unable to meet demand. The semi-conductor industry is expected to grow at CAGR of roughly \\~9% over the next 7-8 years. I see this as a relatively conservative number and it is my opinion that we are heading into a super-cycle of chip upgrades, processing power, and memory devices. Here are a few reasons:\n\n1. We are already seeing noticeable shift in demand and the way consumers are interacting in a new digital world.\n2. These electronics are becoming faster and more powerful, which simply requires a larger quantity &amp; quality of chips.\n3. More and more devices rely on connectivity and the car industry is now making it’s way onto a similar path.\n4. Following Nvidia’s earnings call we are seeing a large rise in trends for AI and machine-learning which is leading to increased demand for the required components.\n5. The rise of crypto mining will also play a role in the increased demand.\n\n**The Players**\n\nMany of the chip-related plays have already seen convincing growth over the last 12 months. However, several names have recently followed the markets to the downside and currently pose a potential good entry point. This secular trend in semi-conductor demand over the next several years is here to stay.\n\nMy semis watchlist is holding some familiar names: Applied Materials (AMAT), ASML Holdings (ASML), Skyworks Solutions (SWKS), Nvidia (NVDA), Intel (INTC), Advanced Micro Devices (AMD), Qualcomm (QCOM), and Taiwan Semiconductors (TSM).\n\nThe ones that make my shortlist are the following: NVDA, AMD, TSM, and AMAT. Here’s a look at the 2-year chart for the 4 tickers mentioned above. \n\nhttps://preview.redd.it/xr0kge6rq2371.png?width=2380&amp;format=png&amp;auto=webp&amp;s=c4beece1276b8c383ed5a2c0cca07bf40f42da11\n\n&amp;#x200B;\n\nIt is clear the secular trend in computer chips and processors have contributed greatly to the growth of these companies. Let’s take a look at a shorter time-frame. Here’s the 3-month chart for the same list of tickers. \n\nhttps://preview.redd.it/pip83wxqq2371.png?width=2388&amp;format=png&amp;auto=webp&amp;s=b353b714f1958233646a57ee5680bf2385ee2a3d\n\n&amp;#x200B;\n\nLooking at it from another angle we see AMD and TSM have been lagging behind the performance of AMAT and NVDA, who are on a nearly identical path. TSM is a leading manufacturer of chips and actually supplies most of AMD’s chips. They are based in Taiwan and there have been some concerns over the potential invasion of China. Setting those concerns aside these companies may still experience strong growth. My plays right now are in AMD and TSM and I will feel comfortable adding to any of the names I mentioned in this article if the right entry point shows itself.\n\n**Final Thoughts**\n\nI would love to say here’s why “x” company is in a better financial position than company “y”, but in this case I believe the high demand for semiconductors will benefit most names participating in this industry. Of course, not every company is made equal so please do your own research before investing in any stocks. In my opinion, this industry is in an upward secular trend and demand remains in-tact, providing tailwinds to the participants.\n\nKeep an eye on earnings reports and financial data of companies that BUY these products. Look at phone, tablet, computer manufacturers (Apple), cloud server providers, Google server expansion (also server chip REPLACEMENT rates, which is a thing), and AI/Machine learning projects (autonomous driving, video analysis, big-data processors). It may be years before the growth slows in this industry and these players will stand to largely benefit.",
        "subreddit": "StockMarket",
        "title": "The global chip shortage and how I'll be taking advantage of the semi's dip: NVDA, AMD, AMAT, TSM",
        "url": "https://www.reddit.com/r/StockMarket/comments/nrh2hj/the_global_chip_shortage_and_how_ill_be_taking/",
        "created": 1622765230.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1624303676,
        "id": "o53a00",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Hey everyone, this is a repost from last week since it got taken down. So Enjoy! Use the links to view the pie charts.\n\n&amp;#x200B;\n\n**10. IBUY (Amplify Online Retail)**\n\nhttps://imgur.com/u5eXsNU\n\nNet Assets: 1.23 B\n\n5-Year Return: 416.54%\n\nTop 5 Notable Holdings: Lands' End, ThredUp, Stitch Fix, The RealReal, and BigCommerce Holdings.\n\n&amp;#x200B;\n\n**9. ARKG (ARK Genomic Revolution)**\n\nhttps://imgur.com/2ErmdmN\n\nNet Assets: 9.44 B\n\n5-Year Return: 415.29%\n\nTop 5 Notable Holdings: Teladoc Health, Exact Sciences, CareDx, Pacific BioSciences, and Regeneration Pharmaceuticals.\n\n&amp;#x200B;\n\n**8. ARKK (ARK Innovation)**\n\nhttps://imgur.com/o6q3gEO\n\nNet Assets: 22.28 B\n\n5-Year Return: 493.36%\n\nTop 5 Notable Holdings: Tesla, Teladoc, Roku, Zoom, and Square.\n\n&amp;#x200B;\n\n**7. QLD (ProShares Ultra QQQ)**\n\nhttps://imgur.com/2fOV9Yi\n\nNet Assets: 4.3 B\n\n5-Year Return: 658.04%\n\nTop 5 Notable Holdings: Alphabet Inc-CL C, Facebook, Alphabet Inc-Cl A, Tesla, and NVDIA.\n\n&amp;#x200B;\n\n**6. ARKW (ARK Next Generation Internet)**\n\nhttps://imgur.com/zLk2KWY\n\nNet Assets: 6.90 B\n\n5-Year Return: 527.61%\n\nTop 5 Notable Holdings: Tesla, Grayscale Bitcoin Trust, Square, Teladoc, and Shopify.\n\n&amp;#x200B;\n\n**5. USD (ProShares Ultra Semiconductors)**\n\nhttps://imgur.com/qEezvZ3\n\nNet Assets: 5.45 B\n\n5-Year Return: 801.83%\n\nTop 5 Notable Holdings: NVIDIA, Intel, Broadcom, Texas Instruments, and Qualcomm.\n\n&amp;#x200B;\n\n**4. ROM (ProShares Ultra Technology)**\n\nhttps://imgur.com/x6i2AOT\n\nNet Assets: 765.4 M\n\n5-year Return: 820.41%\n\nTop 5 Notable Holdings: Apple, Microsoft, Facebook, Alphabet Inc-CL A, and Alphabet Inc-CL C.\n\n**3. TQQQ (ProShares UltraPro QQQ)**\n\n&amp;#x200B;\n\nNet Assets: 12.1 B\n\n5-year Return: 1286.04%\n\nTop 5 Notable Holdings: Apple, Amazon, Alphabet Inc-CL C, Facebook, and Alphabet Inc-CL A.\n\n**2. TECL (Direxion Daily Technology Bull 3x Shares)**\n\n&amp;#x200B;\n\nNet Assets: 2.02 B\n\n5-Year Return: 1272.70%\n\nTop 5 Notable Holdings: Apple, Microsoft, NVIDIA, VISA, and Mastercard.\n\n&amp;#x200B;\n\n**1. SOXL (Direxion Daily Semiconductors Bull 3x Shares)**\n\nhttps://imgur.com/0JQDpTh\n\nNet Assets: 4.56 B\n\n5-Year Return: 2011.76%\n\nTop 5 Notable Holdings: NVIDIA, Texas Instruments, Broadcom, Qualcomm, and Intel.\n\n&amp;#x200B;\n\n*Pie Charts Made using Microsoft Excel*\n\n*Disclaimer:*\n\n*\\*\\*Charts don't include all ETFs holdings\\*\\**\n\n*\\*\\*This is not investment advice\\*\\**\n\n*\\*\\*Do your own research\\*\\**",
        "subreddit": "investing",
        "title": "Top 10 Highest Earning ETFs",
        "url": "https://www.reddit.com/r/investing/comments/o53a00/top_10_highest_earning_etfs/",
        "created": 1624332476.0
    },
    {
        "author": "Jimenezmf777",
        "created_utc": 1624409016,
        "id": "o61luf",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Top analyst B. Riley Marked a price target of 3.25. Current price 1.90ish still in the buy zone. Within 6-7 months they obtained multiple partnerships increasing their cash flow! I’ll be sharing the links of few companies that are making the company grow and their page of all the partnerships of 2021! Just do your own DD, I’ll be holding fam! 🚀🚀🚀 \n\nhttps://www.qualcomm.com/news/releases/2021/05/24/qualcomm-expands-compute-portfolio-snapdragon-7c-gen-2-compute-platform\n\nhttps://www.businesswire.com/news/home/20210414005167/en/Globalstar-Brazil-Partners-with-Cisa-Trading-Bringing-Asset-Management-Solutions-for-the-Oil-and-Gas-Sector-in-Brazil\n\nhttps://www.businesswire.com/news/home/20210217005597/en/Globalstar-Announces-Strategic-Alliance-With-XCOM-Labs\n\nhttps://investors.globalstar.com/news-releases?mobile=1&amp;page=0\n\nhttps://www.thestreet.com/investing/globalstar-rated-buy-b-riley-likes-potential-for-return-on-assets",
        "subreddit": "RobinHoodPennyStocks",
        "title": "WORD ON THE STREET GSAT UNDERVALUED?",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/o61luf/word_on_the_street_gsat_undervalued/",
        "created": 1624437816.0
    },
    {
        "author": "Jimenezmf777",
        "created_utc": 1624410323,
        "id": "o620ki",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Top analyst B. Riley Marked a price target of 3.25. Current price 1.90ish still in the buy zone. Within 6-7 months they obtained multiple partnerships increasing their cash flow! I’ll be sharing the links of few companies that are making the company grow and their page of all the partnerships of 2021! Just do your own DD, I’ll be holding fam! 🚀🚀🚀 \n\nhttps://www.qualcomm.com/news/releases/2021/05/24/qualcomm-expands-compute-portfolio-snapdragon-7c-gen-2-compute-platform\n\nhttps://www.businesswire.com/news/home/20210414005167/en/Globalstar-Brazil-Partners-with-Cisa-Trading-Bringing-Asset-Management-Solutions-for-the-Oil-and-Gas-Sector-in-Brazil\n\nhttps://www.businesswire.com/news/home/20210217005597/en/Globalstar-Announces-Strategic-Alliance-With-XCOM-Labs\n\nhttps://investors.globalstar.com/news-releases?mobile=1&amp;page=0\n\nhttps://www.thestreet.com/investing/globalstar-rated-buy-b-riley-likes-potential-for-return-on-assets",
        "subreddit": "StockMarket",
        "title": "WORD ON THE STREET GSAT UNDERVALUED?",
        "url": "https://www.reddit.com/r/StockMarket/comments/o620ki/word_on_the_street_gsat_undervalued/",
        "created": 1624439123.0
    },
    {
        "author": "Immediate_Employee62",
        "created_utc": 1622588383,
        "id": "nq73rl",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "  \n\nAccording to SRMX's earnings report, the golden nuggets are listed below:\n\n* Tri Cascade released its 5G M.2 module model SG500M2-X, which is embedded with Qualcomm 2nd generation SDX55 5G [modem](http://tricascadeinc.com/res/TRITOM%205G%20M2_SG500M2-X_product%20sheet.pdf).**^(1)**\n* Tri Cascade released the PoC of TRITOM Guardian S100 for Azure IoT [device](http://tricascadeinc.com/res/TRITOM%20Azure%20Sphere%20Guardian%20S100%20data%20sheet.pdf) security. **^(1)**\n* Tri Cascade entered into a Buy/Sell Arrangement and Platform under a Service Agreement with Avnet Inc. for TRITOM Guardian S100 and for other Tri Cascade products. (Avnet is a global leader of electronic components and services, guiding makers and manufacturers from design to delivery)**^(1)**\n* Tri Cascade entered into an authorized, formal Supplier relationship with Microsoft and received a purchase order from Microsoft for the Tri Cascade TRITOM Guardian S100 module, and successfully delivered the product to Microsoft in April, 2021.**^(1)**\n\nWhile no revenue was recorded during the 3 months ended March 31, 2021, the company will report revenue in the second quarter of 2021 from its sales to Microsoft.**^(1)**\n\nHowever, you can see huge potential is there for Saddle Ranch Media share holders, one thing you should also note is that Saddle Ranch Media now fully owns Tri Cascade, ownership was transferred from SkyFidelity to Saddle Ranch Media. This did not impact any revenue.\n\n&amp;#x200B;\n\n# SRMX powering Qualcomm\n\n Tri Cascade's 5G M.2 module will power Qualcomm. The microchip is a 2nd generation 5G modem with integrated multi-mode support, designed to deliver breakthrough wireless performance and accelerate the global 5G rollout.  \n\nTRITOM 5G Modem supports virtually any combination of spectrum bands and/or modes: 5G mmWave and sub-6 GHz, standalone and non-standalone modes, TDD and FDD, spectrum sharing, LTE and legacy modes (3G, 2G). This is designed to enable OEMs to bring blazing fast connected devices to global networks in nearly any form factor.\n\nThe connectorized TRITOM module will enable original equipment manufacturers and system integrators requiring the highest possible speeds to deploy 5G on their mobile computing, networking and IoT platforms worldwide.\n\n&amp;#x200B;\n\n# SRMX powering Microsoft\n\n The TRITOM Azure Sphere Guardian S100 is built with Microsoft Azure Sphere-certified chip and includes built-in Microsoft security technology to provide connectivity and a dependable hardware-based root of trust.  \n\nThe TRITOM S100 provides various interface for unconnected equipment which was designed before connectivity for non-IT devices was considered feasible or were intentionally not connected because they were deemed too mission critical to be subjected to the unsafe internet world. \n\nConnecting equipment and device to the internet representing innovative business model such as preventive maintenance, just-in-time reporting and role-based access to the equipment and data.\n\n&amp;#x200B;\n\n^(1) Page 9 in Q report.\n\n**Quarterly Report:** [**https://www.otcmarkets.com/stock/SRMX/disclosure**](https://www.otcmarkets.com/stock/SRMX/disclosure)",
        "subreddit": "wallstreetbets",
        "title": "Saddle Ranch Media (SRMX) powers Microsoft and Qualcomm",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nq73rl/saddle_ranch_media_srmx_powers_microsoft_and/",
        "created": 1622617183.0
    },
    {
        "author": "ghjkzh",
        "created_utc": 1623233172,
        "id": "nvs6sq",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Nokia, Qualcomm and UScellular claim 5G mmWave range Recorder Moon NOK",
        "url": "https://www.google.de/amp/s/www.computerweekly.com/news/252502094/Nokia-Qualcomm-and-UScellular-claim-5G-mmWave-range-record%3famp=1",
        "created": 1623261972.0
    },
    {
        "author": "Jimenezmf777",
        "created_utc": 1624491711,
        "id": "o6owap",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Earlier this year, Verizon, AT&amp;T and T-Mobile collectively spent almost $100 billion on C-band spectrum licenses for 5G. Incredibly, all that spending didn't even cover the billions of additional dollars in network equipment that will be necessary to put that spectrum into use.\n\nNow, as the dust settles on all those eye-watering expenditures, investors are beginning to look at other spectrum license holders in a new light.\n\n\"We believe Globalstar and its sponsors, after years of development, support and patience, are at long last starting to realize a return on satellite system and spectrum assets, making 2021 an excellent time, in our opinion, to buy Globalstar before the market digests this change,\" wrote the financial analysts at B. Riley Securities in a recent note to investors. The analysts gave Globalstar's stock a \"buy\" rating.\n\nGlobalstar is one of a handful of companies that holds spectrum licenses that could eventually make their way into terrestrial 5G networks. Whether those licenses will underpin a private 5G network for an enterprise or a public 5G network for a big mobile network operator remains to be seen.\n\n ⬆️ The partnerships of XCOM LABS and QUALCOMM will benefit GSATs spectrum\n\nhttps://www.lightreading.com/5g/are-globalstar-anterix-nextnav-and-ligado-ushering-in-new-era-of-5g/a/d-id/770372",
        "subreddit": "StockMarket",
        "title": "AT&amp;T, Verizon, T-Mobile Vs GSAT",
        "url": "https://www.reddit.com/r/StockMarket/comments/o6owap/att_verizon_tmobile_vs_gsat/",
        "created": 1624520511.0
    },
    {
        "author": "Realguyme",
        "created_utc": 1624263576,
        "id": "o4qdcj",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " Micron Technology, Inc. designs, manufactures, and sells memory and storage products worldwide. The company operates through four segments: Compute and Networking Business Unit, Mobile Business Unit, Storage Business Unit, and Embedded Business Unit. It offers memory and storage technologies, including DRAM, NAND, NOR, and 3D XPoint memory under the Micron and Crucial brands, as well as through private labels.  \n\nReasons why it will soar up to 60% in 10 DAYS.\n\n\\- They have 3rd largest market share of DRAM(their main market) and they recently announced that they developed its DRAM to next generation ahead of Samsung and SK hynix which are top 2 DRAM manufacturers.\n\n\\- U.S. government wants to expand its semiconductor market share worldwide, and in order to do that, they want to use its infrastructure bill to invest in its domestic semiconductor companies such as Micron, Intel, TXN, Qualcomm, and others (not only just money, but also politically supports).\n\n\\- 25 Up revisions and 0 Down revisions from financial analysts in last 3 months. 8 earning beats and 0 earning miss in last 2 years. Consensus YoY Growth in Aug 21 is 97%, and consensus EPS estimate in Aug 2022 is 11.05. #1 semiconductor company in Quant Rating due to its great income growth and good balance sheet.\n\n\\- All Quant, Wallstreet, Seeking Alpha, and other analysts are bullish on this stock. \n\nIts next earnings report is 06/30. Its earning surprise will make its price soared. \n\nCurrent price: 76.95 \n\nTarget prices by analysts: Yahoo Finance (High: 172, Average: 118)  Seeking Alpha (High:140, Avg:114) Marketwatch (Avg: 120).\n\n\\- Micron is one of David Tepper's (#1 economy predictor in the world) 4 major holdings that include Amazon, Facebook, and Google.\n\n\\- Just find some articles and read it since you are investing with your capital and you do not want to invest without any knowledge of it unless you really do not give any FXXX about your money.\n\nI'm not a financial advisor, and this is just a DD to share my opinion of this stock.\n\nPosition: 5 CALL 07/02 $77 , 7 CALL 07/02 $80",
        "subreddit": "wallstreetbets",
        "title": "Micron DD (Easiest and briefest explanation for apes) 40-60% upside potential in 10 DAYS!!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o4qdcj/micron_dd_easiest_and_briefest_explanation_for/",
        "created": 1624292376.0
    },
    {
        "author": "Shark0710",
        "created_utc": 1623159870,
        "id": "nv4chf",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Nokia, Qualcomm and UScellular hit extended-range 5G world record over mmWave",
        "url": "https://finance.yahoo.com/news/nokia-qualcomm-uscellular-hit-extended-113000325.html",
        "created": 1623188670.0
    },
    {
        "author": "moneygrabber007",
        "created_utc": 1623081331,
        "id": "nufxy6",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Below is a breakdown of a recent WSJ article about 5G in the US. I added some bullets throughout the article  based on some research.  Even though I disagree with a few of the author's points, I think it's a solid article and helped me understand 5G a bit more. \n\nAt the end, I included some of my own opinions. Hopefully this helps everyone better understand what is going on right now. I have a large position in one of these companies. I have decided to keep it out of this sub, but if you check my post history I am sure you can figure it out. \n\n**The U.S. Is Back in the 5G Game**\n\n*By* Stu Woo*,* May 26, 2021 12:00 pm ET\n\nThe U.S. government has upended the **$35 billion-a-year cellular-equipment industry**, ushering in a new era of competition and giving U.S. companies a shot at re-entering a sector they vacated years ago.\n\n· The $35 billion number they reference here only refers to the US. 2020 estimates the industry in the mid $400 billion range and most projections see this industry growing to the mid $500 billion range by 2023 and mid $700 billion range by 2027. \n\nIn the past five years, only China’s Huawei Technologies Co., Sweden’s Ericsson and Finland’s Nokia Corp. captured more than a 20% share of revenue in the wireless-equipment market, according to Dell’Oro Group, a research firm. **No other competitor consistently cracked even 10%.**\n\n· Huawei: 2020 revenue was $136.7 billion, not publicly traded so no market cap, 180,000+ employees\n\n· Ericsson (ERIC): 2020 revenue of $25.3 billion, market cap of $44.4 billion, valuation of 1.75X, 100K employees\n\n· Nokia (NOK): 2020 revenue of $24.96 billion, market cap of $29.8 billion, valuation of 1.19X, 92k employees\n\nNow that landscape is [changing](https://www.wsj.com/articles/huawei-loses-cellular-gear-market-share-outside-china-11615118400?mod=article_inline). Pushed by Washington’s campaign to cripple Huawei over cybersecurity concerns, **countries representing more than 60% of the world’s cellular-equipment market are considering or have already enacted restrictions against Huawei**, says Dell’Oro Group. And to take advantage of that opening, the U.S. government—as well as governments in the U.K. and European Union—are considering financial support and other measures to boost domestic cellular-equipment makers trying to crack the three incumbents’ stranglehold on the market.\n\nThe result is a newly competitive market that is reminiscent of the 1990s, when bygone industry giants such as Lucent, Motorola, Nortel, Siemens and Alcatel fought for a piece of a growing telecom-equipment pie.\n\n· Lucent merged with Alcatel in 2006 to form Alcatel-Lucent. Nokia absorbed Alcatel-Lucent in 2016. \n\n· Motorola split into Motorola Mobility and Motorola Solutions in 2011. Google acquired Motorola Mobility which, focuses on phones, in 2012 which was then sold to Lenovo in 2015. Motorola Solutions (MSI) 2020 revenue of $7.4 billion, market cap of $35.2 billion, valuation of 4.76X, 18K employees.\n\no MSI appears to focus on smaller, private networks especially in public safety. \n\n· Nortel: Went bankrupt in 2009 and Ericsson purchased most of its telecommunication assets over the next few years. \n\n· Siemens (SIEGY): 2020 revenue of $69.4 billion, market cap of $140.6 billion, valuation of 2.03X, 293k employees (manufactures switchboards and 5G routers)\n\n“It’s got a Wild West feel to it,” says Bill Plummer, a former Nokia and Huawei executive now working at JMA Wireless, a Syracuse, N.Y., 5G company. “We haven’t seen this since probably the eve of the dot-com bust—this dynamic and thriving competitive environment in wireless.”\n\nThat new environment could benefit everyone—other than, of course, Huawei, Ericsson and Nokia. It will give a host of competitors a chance to win business that only a couple of years ago seemed out of reach. And the new competitive fervor should increase innovation and lower costs for wireless carriers, which could pass on savings—and the fruits of those innovations—to customers.\n\nAmerican officials further say the new competitive landscape is crucial to U.S. efforts to counter China’s influence in developing 5G technology, **the next generation of wireless technology that will serve as the building blocks for all sorts of future technologies—whether in robot-run factories, heart-rate monitors, or any number of industries and products. The country that dominates 5G will be well-positioned to lead the technology industry in terms of profits and talent in the years ahead.**\n\n**The 3G days**\n\nAfter a vibrant start to the 3G era in the 2000s, when manufacturers throughout North America, Europe and Asia competed, equipment manufacturers started consolidating amid pressure from Huawei and another Chinese company, ZTE Corp. which were both selling increasingly competitive hardware at lower prices. In 2016, Nokia’s acquisition of Alcatel-Lucent, itself a merger of French and American companies, created today’s three-giant oligopoly.\n\nThe Trump administration began loosening the trio’s grip on the market in 2018 when it started urging allies to blacklist industry leader Huawei over national-security concerns. **The campaign worked: Huawei lost market share outside China to both Ericsson and Nokia last year**, according to Dell’Oro Group, as governments enacted or considered restrictions on Huawei’s equipment.\n\n“The big change over the past couple of years is pressure on Huawei,” says James Barford, a telecom analyst for Enders Analysis. “Even in countries where there is no formal ban, you’re going to be thinking twice” about using equipment from the Chinese company.\n\nThe stranglehold of the big three was further weakened by Nokia’s blunder in procuring expensive chips for its 5G equipment—a mistake that resulted in its equipment costing more upfront, as well as consuming more power. That’s an issue for wireless carriers, which can spend roughly 20% of operating expenses on energy. Nokia says it has since moved to cheaper, power-efficient chips, but damage was done: Some carriers looked elsewhere for supplies.\n\n· This appears to still be up in the air, but Pekka Lundmark, Nokia’s CEO, seemed adamant in an interview after Q1 that chips are no longer an issue for Nokia. We shall see. \n\nWith both Huawei and Nokia under pressure, that left Ericsson as the market leader outside China. But that, in turn, made wireless carriers’ executives wary. They say they want more competition to increase innovation and reduce costs.\n\nThe result has been an opening for a whole new generation of competitors—and the Wild West environment.\n\n**The open gambit**\n\nSome carriers are turning to Samsung Electronics Co. , the South Korean smartphone giant that is a relative newcomer to the wireless-infrastructure industry. It ranked fifth behind the three giants and China’s ZTE in 2020, but won a major victory last year when Verizon Communications Inc. switched suppliers from Nokia to Samsung.\n\n· ZTE: 2020 revenue of $15.86 billion, market cap of $21.84 billion, valuation of 1.38X, 74k employees (traded on Hong Kong and Shenzhen Stock Exchanges)\n\n· Samsung: 2020 revenue of $212 billion, market cap of $500 billion, valuation of 2.36X, 109k or 284K employees (traded on Korean Stock Market)\n\nBut it’s the possibility of buying 5G equipment using open-standards software that has the most potential for roiling the competitive order.\n\nTo understand why, consider that the cellular equipment that transmits signals to phones consists of three parts: the antenna, hardware that sits on a pole directly under the antenna, and more hardware at the pole’s base. **Huawei, Ericsson and Nokia currently sell all three parts in a bundle, and they aren’t interoperable**. For instance, a Huawei antenna doesn’t work with Ericsson electronics under the antenna.\n\nIt would be like buying a Dell laptop that works with only a Dell monitor and Dell printer. And it means customers have limited options on price, quality and features.\n\nEnter a new technology based on open standards, dubbed **Open RAN**, or radio access network. Companies making equipment based on these standards **allow wireless carriers to mix and match the antennas with different under-antenna hardware and centralized electronics**. That gives carriers more options for cost and quality.\n\n· Huawei: Does not believe in the use of Open RAN.\n\n· Ericsson: working on Open RAN, part of the O RAN Alliance.\n\n· Nokia: working on Open RAN, part of the O RAN Alliance.\n\n· ZTE: working on Open RAN, part of the O RAN Alliance.\n\n· Samsung: working on Open RAN, part of the O RAN Alliance.\n\nThe U.S. government is a major backer of the open-software efforts, which officials say could boost both U.S. national security and business. It potentially can help U.S. businesses by creating openings for new players, and because these new efforts rely less on hardware (where the U.S. has fallen behind) and more on software (where companies such as [**Microsoft**](https://www.wsj.com/market-data/quotes/MSFT) **Corp**. and [**International Business Machines**](https://www.wsj.com/market-data/quotes/IBM) **Corp**. can potentially play a role).\n\n· Microsoft: Partnership with Ericsson focuses on the auto industry. Partnership with Nokia focuses on cloud solutions for enterprise. Dealings with Huawei appear to be smartphone based, not 5G. \n\n· IBM: Has partnered with Ericsson in the past, but appears to be working more closely with Nokia and Samsung recently. \n\n“We may be able to increase security, reduce our exposure to any single foreign vendor, lower costs and push the equipment market to where the United States is uniquely skilled—in software,” Federal Communications Commission Acting Chairwoman Jessica Rosenworcel said in March.\n\nIf U.S. companies do indeed become major players in 5G equipment, then they can also play a bigger role in setting global standards for telecom equipment. That’s an arena where China has made great strides. U.S. officials prefer that companies in the U.S. and allied democracies set wireless standards, which they believe would lead to greater, less hackable security.\n\nPresident Biden and Japanese Prime Minister Suga Yoshihide last month agreed that the U.S. and Japan would collaborate to advance open 5G networks “by fostering innovation and by promoting trustworthy vendors and diverse markets,” the White House said. Congress this year enacted a law to establish a Commerce Department fund that would award grants to support the use of such open-standards equipment in the U.S. A bipartisan group of lawmakers backing the bill requested $750 million for the fund in fiscal year 2022.\n\nIn the U.K., a government-appointed task force to help British wireless carriers transition away from Huawei equipment recommended that new equipment makers, or those using open-standards software, represent 25% of the country’s wireless infrastructure by the mid-2020s. The task force recommended government incentives for wireless carriers buying such equipment, and for suppliers to locate research facilities in the U.K. The European Union this year started examining similar options.\n\n**The focus of newcomers**\n\nSeveral smaller U.S. companies—such as [Airspan Networks](https://www.wsj.com/market-data/quotes/AIRO), Altiostar, Mavenir, JMA and Parallel Wireless—are focused on 5G equipment using open software. Ericsson and Nokia are also shifting to using some open-standard software.\n\nThe new challengers have signed deals with some big carriers. [AT&amp;T](https://www.wsj.com/market-data/quotes/T) Inc. is testing open-standards equipment and plans to gradually introduce it, while newcomer wireless-carrier [Dish Network](https://www.wsj.com/market-data/quotes/DISH) Corp. has said its entire network would rely on such infrastructure.\n\n· [Airspan Networks](https://www.wsj.com/market-data/quotes/AIRO) (AIRO): 2020 revenue was $54.7 million, market cap of 11.9 million, valuation of 0.22X, 900 employees\n\n· Altiostar: 2020 revenue was $10-50 million, not publicly traded so no market cap, 359 employees, they are pre IPO and Qualcomm is an investor\n\n· Mavenir (MVNR): 2020 revenue was $462 million, market cap of $1.72 billion, valuation of 3.72X, 4,200employees\n\n· JMA: 2020 revenue was $369 million, not publicly traded so no market cap, 1,000 employees\n\n· Parallel Wireless: 2020 revenue was $75 million , not publicly traded so no market cap, 450 employees\n\n· Dish Network Corp: Rumored to be trying to become the 4th major US network behind Verizon, AT&amp;T, and T-Mobile. Partnered with Nokia on 5G software. Has worked with Ericsson in the past, but has been working closer with Mavenir and Qualcomm lately. \n\n· AT&amp;T: Has 5 year deal with Nokia for 5G services. Also has a deal with Nokia on 5G software. Partners with Ericsson on Private 5G Networks. Appears to be trying to move away from Huawei, but still works with them outside of US. \n\nDell’Oro Group predicts that equipment using open standards, from both newcomers and incumbents transitioning into the new market, **will capture 10% of the market by 2025**.\n\n“The operators say, ‘We need choice, we need a strong ecosystem,’ ” says Thierry Maupilé, a former Motorola and [Cisco Systems](https://www.wsj.com/market-data/quotes/CSCO) Inc. executive who now works at Altiostar, which provides software for open-standards 5G equipment. **“You have a playing field that has been reduced to a few companies.”**\n\nStill, **open-standards equipment remains in its early stages**, and it is too soon to know whether it will be a major player. Wireless carriers say their tests of open-standards equipment show some drawbacks. The new technology can be less energy-efficient than today’s conventional systems. And while the open-standards equipment can be used in rural areas, its performance isn’t yet up to snuff in densely populated urban areas.\n\n**But wireless carriers expect the open-standards equipment to be on par with Huawei, Ericsson and Nokia equipment in three or four years.**\n\n“For us, it is critical to maintain competition in our vendor system,” says Michael Trabbia, chief technology officer at French carrier Orange SA. **“We cannot end up with only two players.”**\n\n· The two players are of course Nokia and Ericsson with Huawei more and more out of the picture with more than 60% of the world’s cellular-equipment market are considering or have already enacted restrictions against them. Similar bans are being placed on ZTE so Nokia and Ericsson should continue to gain market share. This could also help Samsung, but I feel like their focus is elsewhere as a company. \n\n· I’ve kept things fact based up until now and will close with an opinion. Nokia and Ericsson appear to have an establishing duopoly in an industry that the US government has now twice admitted is massively important to the future technological success of all countries. \n\n· So much so that they are looking to spend money to try to help US based competitors of Nokia and Ericsson. The new competitors this article mentions are all small and well behind what the tech giants provide. Even with US funding they are not too worrisome. Mavenir seems like the most legitimate threat, but they already have a valuation multiple higher than Nokia and Ericsson. I don’t really see a fund of $750 million dollars split across 5 companies making much of a difference at the end of the day either. \n\n· Open RAN may be the future, but that is long ways away. This article suggests that a move to Open RAN in the US will hurt Nokia and Ericsson and help the smaller guys. I do not believe that will be the case. The tech giants will stay ahead of the smaller guys the same way they have done with hardware. And even if they do not the article states that it should make up only 10% of the market by 2021.",
        "subreddit": "investing",
        "title": "Investing in 5G: A Breakdown of a Recent WSJ Article and Why I think Nokia and Ericsson Have a Legitimate Duopoly Emerging in a Growing Industry",
        "url": "https://www.reddit.com/r/investing/comments/nufxy6/investing_in_5g_a_breakdown_of_a_recent_wsj/",
        "created": 1623110131.0
    },
    {
        "author": "livestrong2209",
        "created_utc": 1624890882,
        "id": "o9lhk5",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**Weekly Monday Morning Under Valued Stocks to Watch (6-28-2021)**\n\n&amp;#x200B;\n\n|Symbol|Name|Price|52 Week High|52 Week Low|Analysts Rating|\n|:-|:-|:-|:-|:-|:-|\n|QCOM|QUALCOMM|138.21|167.94|86.68|Buy|\n|ET|Energy Transfer LP|10.43|11.55|4.98|Buy|\n|JHG|Janus Henderson Group|38.63|40.39|18.80|Hold|\n|VIAC|ViacomCBS Inc|45.19|101.87|21.67|Hold|\n\n*DO NOT BASE ANY INVESTMENT DECISION UPON ANY MATERIALS FOUND ON THIS POST.*\n\n*We are not registered as a securities broker-dealer or an investment adviser either with the U.S. Securities and Exchange Commission (the “SEC”) or with any state securities regulatory authority. We are neither licensed nor qualified to provide investment advice.*\n\nCheck out our latest discussion at - [**r/UnderValuedStocks**](https://www.reddit.com/r/UnderValuedStocks/)",
        "subreddit": "wallstreetbets",
        "title": "Weekly Monday Morning Under Valued Stocks to Watch (6-28-2021)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o9lhk5/weekly_monday_morning_under_valued_stocks_to/",
        "created": 1624919682.0
    },
    {
        "author": "Best_Bat5882",
        "created_utc": 1624763601,
        "id": "o8oz87",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Celona Joins Qualcomm Smart Cities Accelerator Program to Support the Deployment of Private 5G Networks",
        "url": "https://www.globenewswire.com/news-release/2021/06/24/2252517/0/en/Celona-Joins-Qualcomm-Smart-Cities-Accelerator-Program-to-Support-the-Deployment-of-Private-5G-Networks.html",
        "created": 1624792401.0
    },
    {
        "author": "willtab",
        "created_utc": 1624558364,
        "id": "o76l4i",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " **$WUGI 5G Technology ETF**\n\n WUGI is an actively-managed ETF, been holding for a month with nice gains that dont appear to slow down.  \n\nWe agree that 5G will empower the next generation of technology that will  rise the global digital economy. \n\n5G is not a light-switch; it is an evolution. They invest in that long-term growth with adjusting allocations  dynamically as the 5G cycle evolves. \n\nThere 5G assumptions are based on 4 Pillars.. \n\n1.  **Semis are the nucleus of 5G**:  Every existing device and every facet of the 5G cycle must be upgraded with new semiconductor technology to run faster and smarter, while being more energy-efficient. 5G will require a massive expansion of semiconductor content.  **Because everything needs a Semi now! From your cellphone to your washing machines, Cars, Smart Homes, Drones. Heaviest investment sector of this ETF, companies like $AMD $TSMC $NVDA $QCOM.**\n2.  **Cloud giants push into Edge Computing**:   Edge Computing and 5G are interlinked technologies as both are poised to significantly improve the performance of applications (faster speed) and enable huge amounts of data to be processed in real-time (low latency). Applications running on edge locations demand lower latency and reduced bandwidth. **FAAMG stocks come into play here and are VERY important.**\n3.  **Cloud-native software to manage data**:  5G will result in a massive amount of new data. The ability to continuously filter and process this new data in real-time will be critical. A new generation of database platforms, big data analytics, and agile software development tools are emerging to help individuals and businesses build digital experiences. **$NVDA and its Datacenter come to play, $NET, $TWLO, $AMZN AWS. The growth will not slow down.** \n4.  **Enabling Technologies**:  When all 5G building blocks are in place, the potential big winners will likely be the enabling technologies (think of Instagram and Netflix in the 4G cycle), giving rise to a wave of new 5G business applications, devices, and services. **Companies like $SE with huge gaming plataforms, as the cycle evolves there will be clearer players here.**\n\n**% Top 10 Holdings**: Sea Ltd 7.98%  NVIDIA Corp 7.97%  AMD 7.94% Meituan Dianping 5.85% Marvell Technology Group Ltd 5.44% Qualcomm Inc 5.26%  Bilibili Inc 4.32%  Taiwan Semiconductors 4.09% Google 4.05% Microsoft Corp 3.70% \n\n**% Top Industry Group**: Software 36.14% Internet 22.27% Commercial Services 3.84% Computers 0.97% \n\nHope this helps!\n\nGood Luck!",
        "subreddit": "stocks",
        "title": "$WUGI ETF is a great opportunity to Invest on time in the 5G Technology and Semiconductor Industry.",
        "url": "https://www.reddit.com/r/stocks/comments/o76l4i/wugi_etf_is_a_great_opportunity_to_invest_on_time/",
        "created": 1624587164.0
    },
    {
        "author": "SouthCoastAtlien",
        "created_utc": 1624371612,
        "id": "o5o8vs",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "GSAT QCOM. QCOM last year started making chips for GSAT and the shorts have destroyed GSAT. GSAT has the lowest atmospheric orbiting satellites which in turn will take 5G to every walk of the life in the world. GSAT TAKE IT THERE !!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o5o8vs/gsat_qcom_qcom_last_year_started_making_chips_for/",
        "created": 1624400412.0
    },
    {
        "author": "lepus_timeo",
        "created_utc": 1623161438,
        "id": "nv4we9",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "$NOK &amp; $QCOM +11km 5G extended-range mmWave world record",
        "url": "/r/WallStreetWise5G_6G/comments/nv4sbs/nok_qcom_11km_5g_extendedrange_mmwave_world_record/",
        "created": 1623190238.0
    },
    {
        "author": "Best_Bat5882",
        "created_utc": 1624763502,
        "id": "o8oybw",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "https://www.globenewswire.com/news-release/2021/06/24/2252517/0/en/Celona-Joins-Qualcomm-Smart-Cities-Accelerator-Program-to-Support-the-Deployment-of-Private-5G-Networks.html",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o8oybw/httpswwwglobenewswirecomnewsrelease202106242252517/",
        "created": 1624792302.0
    },
    {
        "author": "Jimenezmf777",
        "created_utc": 1624143363,
        "id": "o3rxp1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Wassup fam! Been in this stock for a while now. I don’t consider myself as a day trader or short term investor, I go for the long haul. A good stock that I found and I got faith on is, GSAT a telecommunications (GPS, 5g, service provider, etc) the company has made progress over the years and is worth investing in. It has made partnerships with XCOM, QUALCOMM, NOKIA, JEEP and currently some part in Europe, they are worldwide. Take in mind that these partnerships happen within a year! They also have a good cash flow for this year due to gov’t policies and received early payments of 37.5m around that area. I’m currently in it at 5k shares at 1.40. It has a potential of growing 8+ a share. Currently sitting at 1.27 aftermarket, it’s a good range of buying. Not a professional advisor. If there’s any questions about the company drop a comment and I’ll respond to the best of my knowledge. Just trying to spread the wealth!",
        "subreddit": "StockMarket",
        "title": "GSAT A WORLDWIDE PROVIDER",
        "url": "https://www.reddit.com/r/StockMarket/comments/o3rxp1/gsat_a_worldwide_provider/",
        "created": 1624172163.0
    },
    {
        "author": "aapkialoo",
        "created_utc": 1624454801,
        "id": "o6cskw",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I have been researching 5g stocks. Apple, Verizon, Qualcomm, SWKS. Planning to invest in Qualcomm. Is it the right time ?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o6cskw/i_have_been_researching_5g_stocks_apple_verizon/",
        "created": 1624483601.0
    },
    {
        "author": "Stay10ToesDown",
        "created_utc": 1624978093,
        "id": "oa9rtu",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " $BRQS ; Intel and Qualcomm are in...$BRQS is ready for 10x \n\nI really like this stock, let me know y'alls' thoughts",
        "subreddit": "wallstreetbets",
        "title": "Volume Jump This AM: $BRQS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oa9rtu/volume_jump_this_am_brqs/",
        "created": 1625006893.0
    },
    {
        "author": "inverse_action",
        "created_utc": 1622962516,
        "id": "ntfsf0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Please let me know what you think. I am in my late 30s and started to invest last year. :D Thanks\n\n**NVDA** 24.92%\n\n**SQ** 11.36%\n\n**TSLA** 7.79%\n\n**ILMN** 7.41%\n\n**MSFT** 5.93%\n\n**AAPL** 5.65%\n\n**ISRG** 3.93%\n\n**OPEN** 2.90%\n\n**U** 2.81%\n\n**VRTX** 2.48%\n\n**AVGO** 2.24%\n\n**EDIT** 2.15%\n\n**BNGO** 2.03%\n\n**MU** 1.98%\n\n**TWST** 1.82%\n\n**AMAT** 1.65%\n\n**QCOM** 1.59%\n\n**GDOT** 1.47%\n\n**SKLZ** 1.44%\n\n**PLTR** 1.42%\n\n**BIDU** 1.37%\n\n**ABBV** 1.33%\n\n**EXAS** 1.26%\n\n**CRSP** 1.07%\n\n**NVTA** 0.97%\n\n**BDSI** 0.85%",
        "subreddit": "investing_discussion",
        "title": "Feedback for my portfolio!",
        "url": "https://www.reddit.com/r/investing_discussion/comments/ntfsf0/feedback_for_my_portfolio/",
        "created": 1622991316.0
    },
    {
        "author": "dalk55582",
        "created_utc": 1623848549,
        "id": "o14cof",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "Canadian public wearables company following the lead of APPLE and QUALCOMM",
        "url": "https://www.reddit.com/r/pennystocks/comments/o14cof/canadian_public_wearables_company_following_the/",
        "created": 1623877349.0
    },
    {
        "author": "DaVibes",
        "created_utc": 1623750873,
        "id": "o0alze",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "investing_discussion",
        "title": "Qualcomm Says It Would Be Open To Investing In Arm",
        "url": "https://focusinvesting.biz/qualcomm-says-it-would-be-open-to-investing-in-arm/",
        "created": 1623779673.0
    },
    {
        "author": "Jimenezmf777",
        "created_utc": 1624491406,
        "id": "o6ot8y",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Earlier this year, Verizon, AT&amp;T and T-Mobile collectively spent almost $100 billion on C-band spectrum licenses for 5G. Incredibly, all that spending didn't even cover the billions of additional dollars in network equipment that will be necessary to put that spectrum into use.\n\nNow, as the dust settles on all those eye-watering expenditures, investors are beginning to look at other spectrum license holders in a new light.\n\n\"We believe Globalstar and its sponsors, after years of development, support and patience, are at long last starting to realize a return on satellite system and spectrum assets, making 2021 an excellent time, in our opinion, to buy Globalstar before the market digests this change,\" wrote the financial analysts at B. Riley Securities in a recent note to investors. The analysts gave Globalstar's stock a \"buy\" rating.\n\nGlobalstar is one of a handful of companies that holds spectrum licenses that could eventually make their way into terrestrial 5G networks. Whether those licenses will underpin a private 5G network for an enterprise or a public 5G network for a big mobile network operator remains to be seen.\n\n ⬆️ The partnerships of XCOM LABS and QUALCOMM will benefit GSATs spectrum\n\nhttps://www.lightreading.com/5g/are-globalstar-anterix-nextnav-and-ligado-ushering-in-new-era-of-5g/a/d-id/770372",
        "subreddit": "RobinHoodPennyStocks",
        "title": "AT&amp;T, Verizon and T-Mobile Vs GSAT",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/o6ot8y/att_verizon_and_tmobile_vs_gsat/",
        "created": 1624520206.0
    },
    {
        "author": "kribz666",
        "created_utc": 1622760677,
        "id": "nrqb07",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi everyone,\n\nI was looking at stock movements after earnings release and I wanted to get a sense of how long it takes for the stock to recover after a movement the next day. I had a very simple strategy where I would buy a stock sometime before the date of earnings (to be calibrated also) and either sell it if it rises or hold on until it recovers (if it ever does). I looked at historic movements to spot stocks with highest potential to do +/-5% move, and filter to keep those with minimum recovery periods. Recovery is basically when the stock price meets the price before the earnings release.\n\nI compiled all this into this dashboard where you can look at these numbers by symbol here: [earnings-watcher.tech](https://earnings-watcher.tech/)\n\nHere are some symbols with lowest/highest recovery periods:\n\n**$MMI, $AMPH, $EVH, $SNPS**: around *1 day*\n\n**$NEOG, $BNGO, $MAGS:** around *40 days*\n\n**$ENG, $KODKL**: around *100 days*\n\nHappy to hear your thoughts and discuss the code if interested. Enjoy!",
        "subreddit": "pennystocks",
        "title": "Recovery periods for movements after earnings releases",
        "url": "https://www.reddit.com/r/pennystocks/comments/nrqb07/recovery_periods_for_movements_after_earnings/",
        "created": 1622789477.0
    },
    {
        "author": "kribz666",
        "created_utc": 1622760795,
        "id": "nrqcfl",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hi everyone,\n\nI was looking at stock movements after earnings release and I wanted to get a sense of how long it takes for the stock to recover after a movement the next day. I had a very simple strategy where I would buy a stock sometime before the date of earnings (to be calibrated also) and either sell it if it rises or hold on until it recovers (if it ever does). I looked at historic movements to spot stocks with highest potential to do +/-5% move, and filter to keep those with minimum recovery periods. Recovery is basically when the stock price meets the price before the earnings release.\n\nI compiled all this into this dashboard where you can look at these numbers by symbol here: [earnings-watcher.tech](https://earnings-watcher.tech/)\n\nHere are some symbols with lowest/highest recovery periods:\n\n**$MMI, $AMPH, $EVH, $SNPS**: around *1 day*\n\n**$NEOG, $BNGO, $MAGS:** around *40 days*\n\n**$ENG, $KODKL**: around *100 days*\n\nHappy to hear your thoughts and discuss the code if interested. Enjoy!",
        "subreddit": "investing",
        "title": "Recovery periods for movements post earnings releases",
        "url": "https://www.reddit.com/r/investing/comments/nrqcfl/recovery_periods_for_movements_post_earnings/",
        "created": 1622789595.0
    },
    {
        "author": "kribz666",
        "created_utc": 1622760739,
        "id": "nrqbqm",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hi everyone,\n\nI was looking at stock movements after earnings release and I wanted to get a sense of how long it takes for the stock to recover after a movement the next day. I had a very simple strategy where I would buy a stock sometime before the date of earnings (to be calibrated also) and either sell it if it rises or hold on until it recovers (if it ever does). I looked at historic movements to spot stocks with highest potential to do +/-5% move, and filter to keep those with minimum recovery periods. Recovery is basically when the stock price meets the price before the earnings release.\n\nI compiled all this into this dashboard where you can look at these numbers by symbol here: [earnings-watcher.tech](https://earnings-watcher.tech/)\n\nHere are some symbols with lowest/highest recovery periods:\n\n**$MMI, $AMPH, $EVH, $SNPS**: around *1 day*\n\n**$NEOG, $MAGS:** around *40 days*\n\n**$ENG, $KODKL**: around *100 days*\n\nHappy to hear your thoughts and discuss the code if interested. Enjoy!",
        "subreddit": "stocks",
        "title": "Recovery periods for movements post earnings releases",
        "url": "https://www.reddit.com/r/stocks/comments/nrqbqm/recovery_periods_for_movements_post_earnings/",
        "created": 1622789539.0
    },
    {
        "author": "kribz666",
        "created_utc": 1622750791,
        "id": "nrmmj1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi everyone,\n\nI was looking at stock movements after earnings release and I wanted to get a sense of how long it takes for the stock to recover after a movement the next day. I had a very simple strategy where I would buy a stock sometime before the date of earnings (to be calibrated also) and either sell it if it rises or hold on until it recovers (if it ever does). I looked at historic movements to spot stocks with highest potential to do +/-5% move, and filter to keep those with minimum recovery periods. Recovery is basically when the stock price meets the price before the earnings release.\n\nI compiled all this into this dashboard where you can look at these numbers by symbol here: [earnings-watcher.tech](https://earnings-watcher.tech/)\n\nHere are some symbols with lowest/highest recovery periods:\n\n**$MMI, $AMPH, $EVH, $SNPS**: around *1 day*\n\n**$NEOG, $BNGO, $MAGS:** around *40 days*\n\n**$ENG, $KODKL**: around *100 days*\n\nHappy to hear your thoughts and discuss the code if interested. Enjoy!",
        "subreddit": "StockMarket",
        "title": "Recovery period after stock movement following earnings release",
        "url": "https://www.reddit.com/r/StockMarket/comments/nrmmj1/recovery_period_after_stock_movement_following/",
        "created": 1622779591.0
    },
    {
        "author": "kribz666",
        "created_utc": 1622750820,
        "id": "nrmmxl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi everyone,\n\nI was looking at stock movements after earnings release and I wanted to get a sense of how long it takes for the stock to recover after a movement the next day. I had a very simple strategy where I would buy a stock sometime before the date of earnings (to be calibrated also) and either sell it if it rises or hold on until it recovers (if it ever does). I looked at historic movements to spot stocks with highest potential to do +/-5% move, and filter to keep those with minimum recovery periods. Recovery is basically when the stock price meets the price before the earnings release.\n\nI compiled all this into this dashboard where you can look at these numbers by symbol here: [earnings-watcher.tech](https://earnings-watcher.tech/)\n\nHere are some symbols with lowest/highest recovery periods:\n\n**$MMI, $AMPH, $EVH, $SNPS**: around *1 day*\n\n**$NEOG, $BNGO, $MAGS:** around *40 days*\n\n**$ENG, $KODKL**: around *100 days*\n\nHappy to hear your thoughts and discuss the code if interested. Enjoy!",
        "subreddit": "options",
        "title": "Recovery period after stock movement following earnings release",
        "url": "https://www.reddit.com/r/options/comments/nrmmxl/recovery_period_after_stock_movement_following/",
        "created": 1622779620.0
    }
]