[
    {
        "author": "TheLifeandTimesofTim",
        "created_utc": 1633199490,
        "id": "q00nqh",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "# Altus’ Business and Competitive Position \n\nAltus is a clean electrification company that develops, owns, and operates solar systems and energy storage for commercial customers, communities, and residential customers. Altus has been profitable for years, with 50-60% EBITDA margins, and expects to grow EBITDA by \\~77% annually through 2024.\n\n**Altus is led by highly capable, seasoned founders**:\n\n* Lars Norell (co-founder and co-CEO) was previously a Principal and Managing Director at Cohen &amp; Company where he served as Head of Capital Markets and subsequently led the Alternative Assets effort. Before joining Cohen &amp; Company, Norell was an MD and Co-Head of US Structured Credit Products at Merrill Lynch. \n* Greg Felton (co-founder and co-CEO) was a partner at Goldman Sachs and the Chief Investment Officer of the Credit Alternatives platform at Goldman Sachs Asset Management.\n\n**Altus is ahead of the pack and expanding its service offerings; capital from + partnership with CBRE should put it even further ahead**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3zg3h3pvw2r71.png?width=1420&amp;format=png&amp;auto=webp&amp;s=b6e5189474922c2f4a25224c172c5b81d299cfce\n\n*Two of the largest players in commercial real estate are on Altus’ side* \n\n* CBAH was formed by CBRE and Blackstone has been a long-time investor in Altus (its ownership is currently 17%). \n* Through Blackstone, Altus has access to the most efficient debt and tax equity financing within a fragmented industry where others do not. \n* CBRE is the world’s largest commercial real estate services firm. CBRE manages 7 billion square feet of commercial real estate and $8 billion of energy spend annually.  \n   * (More detail on CBRE’s ability to directly add value on p.3)\n* CBRE also currently possesses over 20 billion data points stored in its Enterprise Data Platform for the CRE assets it operates; CBRE plans to leverage its Data &amp; Analytic capabilities to create a new software tool capable of analyzing client portfolios to aid in identifying attractive opportunities for Altus Power and for clients.\n* CBRE and Blackstone give Altus a considerable edge over competitors.\n\n*Altus’ customers are highly reliable*\n\n* Not a single payment default in its history of more than a decade\n\n*Multiple additional growth opportunities*\n\n* Altus is beginning to build out EV charging stations at office buildings, which are an ideal place to install EV chargers given that employee cars sit idle all day long. And unlike most charging stations, users can actually see that their electricity is coming directly from a clean source.\n* U.S. cumulative **installed battery storage** is anticipated to **grow at \\~49% annually** to 54 GWh2 by 2030.\n\n## The CBAH Transaction and Valuation\n\n**Interests between all stakeholders are aligned to an exceptional degree and CBRE is in a position to add substantial value**\n\n* Existing investors and management are not only rolling 100% but are also investing $25M in the PIPE.\n* CBRE is investing $75M in the PIPE and has provided a commitment to backstop up to $150M of SPAC redemptions at the same terms as the PIPE.\n* Moreover, CBAH agreed to the “SAIL” promote structure from the get-go, which means the entire promote (which is already capped at 15%) is earned over time as share price appreciates. \n   * The first sponsor shares are earned when shares reach $12.\n\n*\\* Notes regarding CBAH warrants: $11.00 strike price and ¼ warrant coverage \\**\n\n**Altus is valued at an EBITDA multiple discount to** ***qualitatively*** **comparable (residential) solar companies, which have inferior financials and growth** \n\n[\\*as of 10\\/01](https://preview.redd.it/fsx37cetx2r71.png?width=2328&amp;format=png&amp;auto=webp&amp;s=718bd491723d2aa7595c037b6f29160c3cf85a79)\n\n**Altus’ projections are conservative and CBRE can meaningfully add value** \n\n* Their current 900+ MW pipeline represents a \\~2.0x coverage over the 445 MW required to achieve 2022 annualized EBITDA\n* Further, the projections do *not* include the potentially massive windfall from their partnership with CBRE.\n* Unlike the vast majority of SPAC sponsors, CBRE is not only highly incentivized to add value, they are actually in a position to do so in a direct and substantial way.\n\n**CBRE Direct Value Add**\n\n[Note: 2023 EV is conservative given that SPWR is currently valued at \\~28 x 2022 EBITDA.](https://preview.redd.it/033etx89y2r71.png?width=1244&amp;format=png&amp;auto=webp&amp;s=f9d465df62327901b831ad144e7871e400dd036e)\n\n# Potential Risks and Concerns Identified and Addressed\n\n**Altus’ employee count to market cap ratio is dramatically low than peers**\n\nAlthough the comps cited in the investor presentation appear to be *truly comparable* in terms of the quality of leadership, product offering, market position, scale, etc., Altus currently employs far fewer people than its peers (according to LinkedIn).\n\nhttps://preview.redd.it/ux2htm2my2r71.png?width=944&amp;format=png&amp;auto=webp&amp;s=901e6a9348875cc7822ceca069e0d710999d8ee6\n\nThis difference is eye-catching; and it’s possibly indicative of a less robust and capable company. To the extent that meeting projections will require increased hiring efforts, both recruiting and integrating capable employees could prove to be a major hurdle. \n\nThere is reason to think this might *not* be cause for concern, though. This low ratio could very well be a result of Altus operating predominantly in the commercial, industrial, and community solar markets – where customer offtake is much larger and a far smaller salesforce is needed compared to the residential marketplace. Indeed, Altus cites a low customer acquisition cost as a positive differentiator between it and residential solar companies and its margins are significantly higher. (Altus is compared to residential solar companies since there are no public commercial solar companies.) Relatedly, Altus states in the presentation that they rely on contractors and third parties for both installation and sales sourcing. So Altus may employ a relatively high number of contract workers and/or manual workers who do not show up in online searches. \n\n**Public comps are volatile and are now considerably lower (\\~10-15%) than they were when the CBAH deal was announced**\n\nThere is risk of this downward trend extending to the date of the merger (Q4 2021). With that said, this is already factored into the valuation math on p.2, which demonstrates Altus’ discount to comps relative to both 2022 and 2023 EBITDA. And volatility is a double-edged sword, especially with respect to the value of warrants, which should benefit from higher volatility (theoretically, at least). \n\n**Altus lacks a significant technological moat**\n\nAltus does not produce its panels, nor does it have sophisticated proprietary energy storage technology like Stem. Altus does, however, have some software technology IP and data. Here’s what Norell said about this during the analyst day presentation:\n\n&gt;Two years ago \\[we built\\] our own monitoring software, which we named Gaia, and since that time we have also built asset registries and stored all the data coming out of our designs and systems and equipment choices and added the functionalities described on this page... what we were planning to do next is to scale Gaia in two directions... for asset servicing, predictive maintenance of our solar assets using machine learning and AI, and for origination of new customers and assets, develop a customer interface that we can use to originate both commercial and community solar customers. We’ve started collaborating with CBRE on both of these initiatives.\n\nNevertheless, the ultimate benefit of this software and data is not all that clear. So it’s reasonable to assign it little to no value at this point. However, where Altus may have an underappreciated moat is in financing and managing its projects. Unlike residential solar, which has standardized financing, each commercial solar project has a high degree of customization and complexity. Often the work and expense involved in acquiring a customer and securing financing makes deals with commercial customers unworkable. ([Forbes](https://www.google.com/search?q=untpped+comercial+and+industrial+solar&amp;oq=un&amp;aqs=chrome.0.69i59l2j0i67j35i39j69i60j69i61j69i60l2.839j0j7&amp;sourceid=chrome&amp;ie=UTF-8)) As mentioned on p.1, Altus is run by executives with deep expertise in structuring complex financial agreements. And Altus’ partnership with Blackstone Credit increases this edge.  \n\nFurther, there are plenty of companies that have achieved significant growth and outperformance despite lacking a technological or consumer brand moat. The most relevant example that jumps to mind is Public Storage (PSA). In the past 20 years, PSA has doubled the S&amp;P 500’s performance – outpacing the S&amp;P by \\~500%. ([WSJ](https://www.wsj.com/articles/wall-streets-hidden-gem-is-in-public-storage-1455556303)) In the past 10 and 5 years, PSA has outperformed by \\~130% and 60% respectively. This shows the value creation of companies that have exceptional management and execution, especially when such companies are operating in an industry with strong secular growth. There is good reason to believe that Altus is such a company.\n\nDisclaimers: I'm not a financial advisor and this is not financial advice.\n\nDisclosure: I hold 110,000 CBAH warrants.",
        "subreddit": "SPACs",
        "title": "The Unique CBAH/Altus Opportunity",
        "url": "https://www.reddit.com/r/SPACs/comments/q00nqh/the_unique_cbahaltus_opportunity/",
        "created": 1633228290.0
    },
    {
        "author": "AppleGingerTequila",
        "created_utc": 1633396720,
        "id": "q1k63c",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hi im 20 years old and i wont be needing money i put into the stock market for at least the next 10-15 years. Basically i dont mind letting my stocks sit idle and will keep investing without pulling out. My current portfolio is:\n\nETFS:-\n\nQQQ-20%\n\nVUG-10%\n\nVOO-20%\n\nSOXX-20% \n\nTOTAL ETF%= 70%\n\n&amp;#x200B;\n\nStocks:-\n\nDIS- 6%\n\nASTS- 4%\n\nSoFi- 3%\n\nSQ- 7%\n\nCRWD-5%\n\nCRM-5%\n\nTOTAL STOCK%=30%\n\n&amp;#x200B;\n\nAny advice on whether i should change things around or suggestions of other stocks/etfs would be greatly appreciated. Also pls let me know if my % allocations are alright. Thanks!",
        "subreddit": "StockMarket",
        "title": "New to investing so i would love to hear your feedback on my portfolio!",
        "url": "https://www.reddit.com/r/StockMarket/comments/q1k63c/new_to_investing_so_i_would_love_to_hear_your/",
        "created": 1633425520.0
    },
    {
        "author": "mike_oc23",
        "created_utc": 1633486381,
        "id": "q2ayen",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Ticker: ACN  \nCurrent Price: $325.12  \nDividend Yield: 1.08%  \nDividend Frequency: Paid Quarterly\n\n**Background**  \n[Accenture](https://www.accenture.com/us-en?c=acn_glb_brandexpressiongoogle_11607915&amp;n=psgs_1020&amp;&amp;c=ad_usadfy17_10000001&amp;n=psgs_Brand-%7c-US-%7c-Exact_accenture&amp;gclid=CjwKCAjw7--KBhAMEiwAxfpkWLS_UJeHUUiIaKtOXPfMbCM5iGXkVYNhXkr9H1ErSKEW9pc35OHVkRoCqkgQAvD_BwE&amp;gclsrc=aw.ds) is a multinational business services company that specializes in IT services. The company was founded in 1989 and is headquartered in Dublin, Ireland. Accenture has 624,000 employees, owns 7,900 patents worldwide, and rank among the [largest](https://www.marketbeat.com/stocks/sectors/business-services/) business service companies with a market cap over $200 billion. Accenture is a member of the [S&amp;P 100](https://markets.businessinsider.com/index/components/s&amp;p_100) and [Fortune Global 500](https://fortune.com/global500/2021/search/). Accenture's clients make up [91 of the Fortune Global 100 and more than three-quarters of the Fortune Global 500](https://newsroom.accenture.com/fact-sheet/), including key players such as Microsoft, SAP, Oracle, Salesforce, and Workday.\n\n**Financials**\n\n* Revenue: $50.53 Billion\n* Net Income: $5.91 Billion\n* Profit Margin: 11.69%\n* Total Cash: $8.17 Billion\n* Total Debt: $3.51 Billion\n* Current Ratio: 1.25\n* PE Ratio: 37.47\n* [More Key Statistics Here](https://finance.yahoo.com/quote/ACN/key-statistics?p=ACN)\n\n**Growth &amp; Dividends**  \n[Here](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=2005&amp;firstMonth=1&amp;endYear=2021&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;leverageType=0&amp;leverageRatio=0.0&amp;debtAmount=0&amp;debtInterest=0.0&amp;maintenanceMargin=25.0&amp;leveragedBenchmark=false&amp;reinvestDividends=true&amp;showYield=false&amp;showFactors=false&amp;factorModel=3&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=ACN&amp;allocation1_1=100&amp;symbol2=SPY&amp;allocation2_2=100) is performance dating back to 2005 with dividends reinvested compared to the S&amp;P 500 index, and [here](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=2005&amp;firstMonth=1&amp;endYear=2021&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;leverageType=0&amp;leverageRatio=0.0&amp;debtAmount=0&amp;debtInterest=0.0&amp;maintenanceMargin=25.0&amp;leveragedBenchmark=false&amp;reinvestDividends=false&amp;showYield=true&amp;showFactors=false&amp;factorModel=3&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=ACN&amp;allocation1_1=100&amp;symbol2=SPY&amp;allocation2_2=100) is with dividends held as income. The investor's dividend yield grew from 1.11% in 2005 to 12.15% in 2020. There was a dip in dividend income in 2019 when Accenture transitioned from semi annual dividends to quarterly payments. See [here](https://www.nasdaq.com/market-activity/stocks/acn/dividend-history) for dividend history. Accenture has a dividend payout ratio of around 40% showing signs of sustainability for future payments.",
        "subreddit": "stocks",
        "title": "Dividends Plus Growth - Accenture (ACN)",
        "url": "https://www.reddit.com/r/stocks/comments/q2ayen/dividends_plus_growth_accenture_acn/",
        "created": 1633515181.0
    },
    {
        "author": "banshee612",
        "created_utc": 1633317202,
        "id": "q0x5kq",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Sorry to be another person posting about $KPLT but this squeeze is going to last because there are 14 MILLION shares shorted. 12,000,000! Stocks NEED to be covered. 32%&gt; CTB. Insiders keep buying. New deal with Salesforce for their commerce cloud. Intagrated partner with $AFRM (AFFIRM),maybe Amazon",
        "url": "https://www.reddit.com/gallery/q0x5kq",
        "created": 1633346002.0
    },
    {
        "author": "prostockadvice",
        "created_utc": 1633485205,
        "id": "q2amno",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "We are officially in October and it is proving to be rather turbulent. Coming off of one of the worst days all year, the major indices did rebound and take back some of the losses. Today is a write up where I go through all the old alerts, push a reset, and create many new ones. \n\nIt was no surprise that we the S&amp;P had its first red month all year last month. The question is will our portfolios keep being drug down by inflation and debt ceiling woes. If you are not already, now is the time to dollar cost average on your long term positions, and pick yourself out some new mid term positions that you think will perform well in the winter months. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#  First let's take a look at some of my favorites.\n\n**TQQQ** has given up a lot of ground since it's all time high on September 7th. It is now approaching the 180MA, and the RSI is really low. It could be a great time to average into this position. If you prefer options, a bounce of the 180 alerts has been set. \n\nhttps://preview.redd.it/6ceb8y1sjqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=3611585e424b757718c9dba3f0afefadb634c9a8\n\n **UPRO** is not as bad as **TQQQ**, and that is quite normal according to Trend Spider's seasonality. Usually this time of year, the Nasdaq does worse out of all the indices. Now we see that tech is getting hammered. I'd also DCA into this one.  \n\nhttps://preview.redd.it/vh23d1szjqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=0a31491eb4a487f24f2f872db5e11f32ca41e89e\n\n **UDOW** is probably a great pick up right now for your buy and hold portfolio. It is riding along the 180MA, and if you can get an entry there, start to DCA.  \n\nhttps://preview.redd.it/o66oyzrzjqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=3dc213a55397d60bda38aba21253948b96b66579\n\n **SOXL** is notorious in our community for money printing swings. I'd say it might have bottomed out of now. There seems to be a 50/50 chance over the past decade that SOXL is up/down in October. Since it is already down, I'd say grab some, and continue to as long as it is going down. Red day buy; green day hold. Let it run until mid November. Hope you are paying attention :D \n\nhttps://preview.redd.it/j6vay1szjqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=514b94aa0482e335d9bb7f44031b54edef361497\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#  Crypto \n\n **CRO**, the native Crypto.com token and one of my favorites right now has made a wonderful recovery bounce off of the 180MA. It is now back at 18 cents. Don't sleep on this one. They are now the sponsors of the UFC and the Philadelphia 76ers. I think this is a 10x play. I think the right play here is buy what you can afford: $400, $4000 or $40000. Stake those in their app (for up to 14%apy), since it is a long term play anyways we don't need to use this money. After, you will unlock their metal Visa card. My recommendation is run all your monthly expenses through it and you'll be getting 2-5% back in **CRO** which you continue holding.  \n\nhttps://preview.redd.it/wowtpr22kqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=6294fca8217fde87067615877a990b4f57565db3\n\n \n\n**BTC** has made a huge recovery this week, and if you are already diversified with BTC exposure congratulate yourself. If not, maybe its time to start considering it. If traditional equity markets are not doing well, money sometimes flows to crypto - and vice versa. \n\nhttps://preview.redd.it/4g8tbdb3kqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=c1fcc81b846310ed2c490c7dd4498fc90d0cda68\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n#  Alerts \n\n A **WMT** opportunity found by my VIP Discord members. First of all, the seasonality improves a lot in November and the RSI looks way to over sold. I like a bounce off of the the lower support of a paralell channel that it seems to be trading in. This could be a good chance for some EOY calls either now, or wait for bounce.  \n\nhttps://preview.redd.it/qztvc4h8kqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=012816a5a8ba2a561beaadecb7a9fee4cc4d3b7a\n\n **XHB**, a homebuilders ETF, LEAPS look ripe for the picking. This would be a long term position with exposure to the US new homes sector, which I don't think will slow down any time soon.  \n\nhttps://preview.redd.it/d3sallk9kqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=09d918825aedf4ff92ceb2917309b12ba69ccba8\n\n Here is an interesting opportunity for some puts on **CRM** I believe to have found. We are close to all time high, and the seasonality starts to suck going into December. I can't really say the exact point where we buy the puts, but I think maybe around $280. We can even buy vertical spreads for $270/$260 with a December expiration. \n\nhttps://preview.redd.it/kctpebkakqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=e3d15a26bfe10680a774553e53c78204b3a97a3e\n\n **NKE** has also taken a beating and will probably have decent holiday sales as always. Actually, this alert was already set and expired before it triggered. It is basically riding along the 180MA and the YTD VWAP. Could be a good pick up now, or wait for a confirmation bounce.  \n\nhttps://preview.redd.it/nu6sb4jbkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=d8f911359729ed6031498e5aae401a786bf2ff98\n\n Same with my **HD** alert. It triggered last week but I was on vacation and missed it. If you bought, you'd be making money. I'll be resetting the alerts for a VWAP bounce and trying again.  \n\nhttps://preview.redd.it/tb2uejeckqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=985ad4ea1a62d29579da96945a756cc0da8a614c\n\n I'm still liking these **SPOT** puts as I don't believe in the long term growth of this company. It seems like the resistance drawn out is true and is holding. If continues, there is an opportunity to arb calls and puts between the resistance and glass bottom (yellow). \n\nhttps://preview.redd.it/hcie2cgdkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=10f8bd58cebd73066512ce8e675a98095ac1cdae\n\n Still continue to play **DIS** on its yoyo like bounce on the glass bottom. Usually **DIS's** seasonality improves in the winter months, especially in November. I still like EOY calls, probably taking profit in November.  \n\nhttps://preview.redd.it/2lclpzaekqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=329098a02d6d7b241e153cb149a12cb84693ba8a\n\n It is interesting that this time, when BTC ran, **EBON** didn't. One of my highest conviction plays, I'll wait for the bounce down from the 50MA as usual. **EBON** is a crap company, with crap products, that industry insiders joke about.  \n\nhttps://preview.redd.it/ozpj252fkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=3bb701f35e2d14a8945e771a8787425fc8698885\n\n **MCB** is a tricky play, but, like I thought, it is holding resistance. I think its a matter of time before it pulls back. If we see it break the resistance, then I'll cut. Go small here.  \n\nhttps://preview.redd.it/vf7usk4gkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=d18e08d1ea0c8c33cbfbf1fc788e3566e3ec7ffb\n\n **SBUX** is around major supports and has somewhat of a nice volume shelf propping it up. Seasonality is good for October and November as cold caffeine addicted shoppers go out and need warm pick-me-uppers. I like calls off of the volume shelf expiring EOY and taking profits possibly in November.  \n\nhttps://preview.redd.it/n2lkvt0hkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=bfe6ac15beda08ad064d92c429436c65b943e2f0\n\n Lastly for today, I still like **T** puts off of the 50MA. Another company that I don't believe in long term growth; this is a good opportunity to continue the ride down. I would keep positions small and take profits quick, although it seems that there is more than a 50% chance that month over month is negative.  \n\nhttps://preview.redd.it/rpqh90yhkqr71.png?width=1156&amp;format=png&amp;auto=webp&amp;s=0dca69da6cd687c47ad06854a75b9fa5779f1ccd\n\n \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n    Disclaimer: The comments opinions and analysis expressed herein are for informational and educational purpose only and should not be considered as individual advice or recommendations.",
        "subreddit": "options",
        "title": "15 Excellent Options Set Ups for Q4",
        "url": "https://www.reddit.com/r/options/comments/q2amno/15_excellent_options_set_ups_for_q4/",
        "created": 1633514005.0
    },
    {
        "author": "banshee612",
        "created_utc": 1633407733,
        "id": "q1n9zy",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "AS REQUESTED - $KPLT: Untapped Short Squeeze Data Galore. CTB MAX 75%, Avg 37%. Dark pool = 55% of volume. FTD : Heavy, AMZN + AFRM rumor, New partnership with Salesforce, 96m Outstanding shares, .5 days to cover. Multiple sources of info, but relatively close data.",
        "url": "https://www.reddit.com/gallery/q1n9zy",
        "created": 1633436533.0
    },
    {
        "author": "Tomkila",
        "created_utc": 1633364187,
        "id": "q18pbd",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "“Subscription/Recurring Billing Management Market Research Report by Industry, by Deployment, by Payment Mode, by Region - Global Forecast to 2025 - Cumulative Impact of COVID-19”\nTweet this\nThe Global Subscription/Recurring Billing Management Market size was estimated at USD 5,122.88 Million in 2020 and expected to reach USD 5,941.43 Million in 2021, at a Compound Annual Growth Rate (CAGR) 16.02% to reach USD 10,772.14 Million by 2025.\n\nCompetitive Strategic Window:\n\nThe Competitive Strategic Window analyses the competitive landscape in terms of markets, applications, and geographies to help the vendor define an alignment or fit between their capabilities and opportunities for future growth prospects. It describes the optimal or favorable fit for the vendors to adopt successive merger and acquisition strategies, geography expansion, research &amp; development, and new product introduction strategies to execute further business expansion and growth during a forecast period.\n\nFPNV Positioning Matrix:\n\nThe FPNV Positioning Matrix evaluates and categorizes the vendors in the Subscription/Recurring Billing Management Market based on Business Strategy (Business Growth, Industry Coverage, Financial Viability, and Channel Support) and Product Satisfaction (Value for Money, Ease of Use, Product Features, and Customer Support) that aids businesses in better decision making and understanding the competitive landscape.\n\nMarket Share Analysis:\n\nThe Market Share Analysis offers the analysis of vendors considering their contribution to the overall market. It provides the idea of its revenue generation into the overall market compared to other vendors in the space. It provides insights into how vendors are performing in terms of revenue generation and customer base compared to others. Knowing market share offers an idea of the size and competitiveness of the vendors for the base year. It reveals the market characteristics in terms of accumulation, fragmentation, dominance, and amalgamation traits.\n\nThe report provides insights on the following pointers:\n\n1. Market Penetration: Provides comprehensive information on the market offered by the key players\n\n2. Market Development: Provides in-depth information about lucrative emerging markets and analyze penetration across mature segments of the markets\n\n3. Market Diversification: Provides detailed information about new product launches, untapped geographies, recent developments, and investments\n\n4. Competitive Assessment &amp; Intelligence: Provides an exhaustive assessment of market shares, strategies, products, certification, regulatory approvals, patent landscape, and manufacturing capabilities of the leading players\n\n5. Product Development &amp; Innovation: Provides intelligent insights on future technologies, R&amp;D activities, and breakthrough product developments\n\nThe report answers questions such as:\n\n1. What is the market size and forecast of the Global Subscription/Recurring Billing Management Market?\n\n2. What are the inhibiting factors and impact of COVID-19 shaping the Global Subscription/Recurring Billing Management Market during the forecast period?\n\n3. Which are the products/segments/applications/areas to invest in over the forecast period in the Global Subscription/Recurring Billing Management Market?\n\n4. What is the competitive strategic window for opportunities in the Global Subscription/Recurring Billing Management Market?\n\n5. What are the technology trends and regulatory frameworks in the Global Subscription/Recurring Billing Management Market?\n\n6. What is the market share of the leading vendors in the Global Subscription/Recurring Billing Management Market?\n\n7. What modes and strategic moves are considered suitable for entering the Global Subscription/Recurring Billing Management Market?\n\nMarket Dynamics\n\nDrivers\n\nRising Penetration of Electronic Media and Devices Coupled with Advanced Subscription &amp; Billing Software\nGrowing Demand for Integrated Subscription and Billing Platform\nIncreasing Customer Awareness and Subscription Base\nGrowing Adoption of Subscription and Billing Solutions across Various Industries\nRestraints\n\nComplex Customization &amp; ROI Risk for Businesses and Customer Concern Regarding Security\nOpportunities\n\nScalability of SaaS Business Model\nUpgradation of Legacy System and Scalability Associated with SaaS Business Model\nAdoption of Emerging Technologies and the Economic Growth of Countries such as India and China\nThe Need to Systemize Management is Facilitated by Integration of Back-End Systems\nChallenges\n\nLimited Technical Skills and Expertise\nAdvanced Cost Associated with System Transformation\nCompanies Mentioned\n\n2Checkout.com, Inc. by VeriFone Holdings, Inc.\nActivePlatform\nAmazon.com, Inc.\nAria Systems, Inc.\nBluSynergy\nBraintree by PayPal Holdings, Inc.\nCerillion PLC\nCleverbridge AG\nConga\nDXC Technology Company\nFastSpring\nFreshBooks\nLogiSense Corporation\nOracle Corporation\nRecurly, Inc.\nSalesforce.com, Inc.\nSAP SE\nStripe\nTransverse, LLC\nZoho Corporation Pvt. Ltd.\nZuora, Inc.",
        "subreddit": "StockMarket",
        "title": "Insights on the Subscription/Recurring Billing Management Global Market to 2025 - Featuring ActivePlatform, Amazon and FastSpring Among Others - ResearchAndMarkets.com",
        "url": "https://www.reddit.com/r/StockMarket/comments/q18pbd/insights_on_the_subscriptionrecurring_billing/",
        "created": 1633392987.0
    },
    {
        "author": "banshee612",
        "created_utc": 1633408432,
        "id": "q1nga8",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Ring the alarm- AS REQUESTED - $KPLT: Untapped Short Squeeze Data Galore. CTB MAX 75%, Avg 37%. Dark pool = 55% of volume. FTD : Heavy, AMZN + AFRM rumor, New partnership with Salesforce, 96m Outstanding shares, .5 days to cover. Multiple sources of info, but relatively close data.",
        "url": "https://www.reddit.com/gallery/q1nga8",
        "created": 1633437232.0
    }
]