[
    {
        "author": "FinancialWhoas",
        "created_utc": 1637170268,
        "id": "qw4dbk",
        "num_comments": 149,
        "num_crossposts": 0,
        "selftext": "TLDR:  I did a bunch of math based on some reasonably good ideas to determine a  selection of stocks worth investing in. Tables of stocks found below.  My diamond hands are so rough on my fleshy...forearms. I can't type anymore.\n\n# Observations/Assumptions\n\nBefore  you jump down my throat, these are simplified observations/assumptions,  not internationally agreed upon mandates from heaven. Okay, now you can  jump down my throat.\n\n* Companies  with strong financials, a competitive advantage, good management, a  sustainable business model, etc. tend to do better than companies  missing one or more of those attributes.\n* For most people it is impossible to time the market\n* Stock prices have all available information priced into them.\n* The markets are relatively efficient over the long-term.\n* [Index funds have been shown to be the most successful stock investing instrument for most people](https://freakonomics.com/podcast/stupidest-money/)\n* [Index  fund returns, such as the S&amp;P 500, are now predominately determined  by a handful of extremely large, mostly tech stocks.](https://www.investopedia.com/top-10-s-and-p-500-stocks-by-index-weight-4843111)\n* [Most funds do not beat the index over a long period](https://finance.yahoo.com/news/dont-pay-investment-adviser-beat-144400899.html).\n* The cost of stock trades at most firms is now $0.00 (yes, simplified)\n* During times of volatility, companies that had poor financials will likely find it challenging to survive.\n* [Zombie companies](https://finance.yahoo.com/news/zombie-companies-hiding-uncomfortable-truth-183246812.html) are able to survive for longer periods during times of extremely cheap debt.\n* Index funds have these 3 issues that are hard to get around:\n   * You are unable to effectively [Tax-Loss Harvest](https://www.investopedia.com/articles/taxes/08/tax-loss-harvesting.asp)  even though many of the holdings that make up the index would have had  losses, thereby reducing the return compared to directly investing in  that same set of stocks in the same proportions.\n   * You have no control over the holdings within the fund and may be supporting things you don’t want to support.\n   * Due  to the way the index works, any large stock that becomes part of the  index is potentially a huge drag on the index. This happened when Tesla  was going to be added on 12/21/2020, which was announced on 11/16/2020,  forcing funds to buy the stock at the same time driving up the price,  which had already been driven up by people buying the stock knowing it  was then going to get added to the index forcing more people to buy the  stock. If you think it sounds kind of circular, that’s because it is.\n\n# Hypothesis\n\nUsing  industry benchmarking against the best of the best of the best  companies in each industry in order to purchase only the best companies  in equal measure should provide a well-diversified portfolio that over  the long term should be able to beat the S&amp;P 500.\n\n# Experiment 2020\n\n750  largest US stocks were analyzed against their peers in their industry  (Industry details available further down the post). Stocks were given a  score based on their relative percentage compared to the industry index.  For example, each companies’ average ROE of the last 4 years was  compared to this index value with the following type of breakdown:\n\n* ROE &lt; Index ROE = Poor = 1\n* ROE &gt; Index ROE = Moderate = 2\n* ROE &gt; 150% of Index ROE = Great = 3\n\nFor  example, the ROE communication services industry index value used was  10.10%. If a communication services company had a ROE average of 9%,  they would receive a poor rating. If they had a ROE of 10.5% they would  receive a moderate rating. If they had a ROE of 25% they would receive a  great rating.\n\nThis was done for all of the metrics below:\n\n* ROE\n* Revenue Growth %\n* EBITDA %\n* FCF %\n\nThe  relative scores used for each of the metrics was tweaked until there  was a good distribution of results. e.g., if the 150% revenue growth  only found 5 companies with a Great rating, that may need to be  decreased to 125% for a better distribution.\n\nAny stock that received a poor in any of the 4 metrics was eliminated.\n\n[ROE Example](https://preview.redd.it/t7l27u9tu6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=f904309edb170cc8679189ea62f7bbe057646a3d)\n\nROE Example\n\nThat left 53 stocks. EBITDA was then analyzed to see if it was declining, and if so, it too was eliminated.\n\nThis  left 45 stocks. These 45 were reviewed more thoroughly. What did the  company do? What were their competitive advantages? Are they currently  in any lawsuits? Does their debt look out of control? Do I see them  being a long-term sustainable choice? Is their IP about to expire? Has  WSB said it's a buy? Essentially boiling down to: Is there any reason  that I want to exclude them?\n\nThat left 26 across 7 sectors.\n\n[Industries 2020 Experiment Breakdown](https://preview.redd.it/3gurx91wu6081.png?width=366&amp;format=png&amp;auto=webp&amp;s=0e37aa1afdb655721fc83dff4e75867923e48cc1)\n\n**2020 Industry Breakdown**\n\nThese  26 stocks were bought in equal amounts in July 2020, August 2020, and  September 2020. To easily perform time weighted analysis of these stocks  and determine if there was an opportunity cost, 10% of the total  purchase each period was also allocated to VFIAX.\n\n2020 Experiment Results July, August, and September 2020 purchases to 11/16/2021\n\n* **S&amp;P 500** total return reinvested dividends: **49.09%**\n* **My 26 Stock Index** including reinvested dividends: **61.53%**\n\nCan we do it again this year? Should we go bigger? Yes.\n\n# Experiment 2021\n\n2,850  tickers of the largest US stocks were identified as the initial list.  The stocks had their last 5 years averaged for each of nine metrics:\n\n* Revenue Growth % - shows growth rate of the company\n* Profit Margin – shows how effective the business is at making money\n* Operating Margin – shows how much money the company earns on its revenue\n* FCF Margin – shows how efficient a company is with their cash\n* EBITDA Margin – shows a companies’ operating profitability\n* ROE – shows how well management balances profits, leverage, and assets to make money\n* ROA – shows how effectively a company utilizes its assets to generate profits\n* ROIC – shows how effective the company is at using its money to generate returns\n* Debt/Equity Ratio – shows the financial stability of a company\n\nMore  metrics were used due to the increased data set. These stocks were then  grouped by industry, and the average of the averages is taken to  determine the industry average for the last 5 years; I switched to  median based on a few outliers really throwing the average for some of  the metrics. If that was confusing, here is an example:\n\n·  3 stocks that make up an industry averaged -10%, 15%, and 20% ROE over  the last 5 years. The median over the last 5 years for that industry is  then 15% and all 3 of those stocks will be compared to that benchmark.\n\nEach  stock was compared against its Industry benchmark for each of the  metrics and given a score 1=Poor, 2=Good, 3=Great as well as a composite  score out of 27, from 9 metrics with a max score of 3 in each of the  metrics. The scores are based on how much better they are then the  average. I measured them against the benchmark using the same  methodology as previously performed: Poor &lt; 100%, Good &lt; 150%,  Great &gt; 150%. Again, these may be tweaked slightly depending on the  particular metric to find a useful distribution.\n\nI  also ranked every stock against the entire list for each of the metrics  and overall. For those wondering, the best stock in this ranking was  CORT with a score of 2,097 and the worst TICKER THAT SHALL NOT BE NAMED (evidently a stock that cannot be named because I was banned the first time I posted this) with a score of  23,095. Because the overall rank is a combination of 9 categories with  values ranging from 1-2791, the theoretical best a company could do  would be 9 and the theoretical worst a company could do would be 25,119.  Anyone wondering why the number of stocks doesn’t match the original  input (congratulations on your reading comprehension), this is primarily  due to mergers/acquisitions or the stock being taken private. Another  stock was acquired during the analysis, changing the max number yet  again.\n\nHere is an example showing Aerospace &amp; Defense scoring:\n\n[Aerospace &amp; Defense scoring](https://preview.redd.it/5r8i1qb0v6081.png?width=615&amp;format=png&amp;auto=webp&amp;s=947be14d943204b8211c0933e9c1f1a41d4a1986)\n\nHere is an example showing growth scoring (the Revenue Growth column is the company’s most recent year):\n\n[Growth Scoring](https://preview.redd.it/a2nq8c1av6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=c1f79a62b587bf6f1530f5beefda1b174b5d7d43)\n\nHere is an example of the visualizations for the data:\n\n[Data Visualization Example](https://preview.redd.it/5d41vcvdv6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=26567d730e1d668ccef856a18497fab38345577b)\n\nI  applied a series of filters to eliminated unwanted noise. I looked at  the top 5 stocks per industry (extending out for any ties), any stock  that scored a 25, 26, or 27 on the composite, or any stock that had a  high enough overall rank to justify being reviewed.\n\nNext,  I read the description of \\~300 stocks and looked through their  financials for any inconsistencies, such as one huge year throwing off  their average, profit margins higher than operating margins, highly  leveraged companies with poor growth, etc. My favorite find was that  Chemed Corporation provides hospice/palliative care and owns  Roto-Rooter. Yes, I did end up keeping them (how could you not?), no  there are not great synergies between the sectors of the business, yes,  they are aware of this. I also eliminated industries I wasn’t interested  in reviewing, such as REITS due to the need to look at different  metrics like FFO, Oil and Gas because it’s oil and gas, etc. These  activities eliminated \\~150. I would like to get back to REITs, but I’d  need to build a separate model.\n\nI  then looked at each stock in more detail compared to its peers that made  the cut. Are all the rest of them in the double digits for growth, are  the profit margins substantially less, which one is in a better debt  situation, did WSB say it's a buy, etc. Who deserves to be on this list?  This eliminated \\~75.\n\nWe were down  to 84 stocks at this point. I then looked at each company's investor  presentation, annual report, etc. to better understand what the company  does, their revenue model, risks, etc. I was not nearly as thorough on  this portion this year compared to last year just due to the substantial  increase in companies, 26 vs 84. My hourly wage at McDonald was going  to be better than my returns from the analysis if I took too long. I  only eliminated 1 company which left us at the grand total of 83  companies across 31 industries. Breakdown below:\n\n[Industry Breakdown](https://preview.redd.it/0bmcwyuiv6081.png?width=390&amp;format=png&amp;auto=webp&amp;s=0df395664265ef942ff736c889108711216e76ed)\n\nI then purchased all of these in equal proportion in April, May, and July of 2021.\n\n2021 Experiment Results April, May, and July 2021 purchases to 11/16/2021:\n\n* **S&amp;P 500** total return including reinvested dividends: **11.93%**\n* **My 2021 Stock Index** including reinvested dividends: **14.26%**\n\n# Industry Classification\n\n* For Experiment 2020, the Sector was used to determine how companies should be compared.\n   * This is made up of 11 sectors such as Information Technology, Communication Services, Utilities, etc.\n   * This  seemed to be too restrictive and compared companies against each other  that aren’t really accurate comparisons. See the example on ROE below.\n* For Experiment 2021 I used the Microsoft Excel Stock function to pull industries for all the stocks.\n   * This looks like it pulls data mostly from Industry and Sub-industry.\n   * This was successful on 98% of the stocks and for the final 2% I manually classified based on the taxonomy in the [Global Industry Classification Standard](https://en.wikipedia.org/wiki/Global_Industry_Classification_Standard).\n   * I  ended up needing to collapse the structure a little further. Originally  there were 55 classes with many of the classes having less than 10  stocks. I was able to collapse this to 44 classes. This will likely be  tweaked a little further next year as I had mathematical issues dealing  with averages/medians that were negative. There were also just too many  categories with similar enough results that they could be combined such  as biotech and pharmaceutical.\n\n# 2020 Stocks\n\nABMD\n\nADBE\n\nANET\n\nBWXT\n\nCRL\n\nDG\n\nENR\n\nETSY\n\nEXEL\n\nICLR\n\nISRG\n\nKLAC\n\nLKQ\n\nLRCX\n\nMNST\n\nMPWR\n\nMTCH\n\nOLED\n\nPAYC\n\nPHM\n\nTER\n\nTTD\n\nUI\n\nVEEV\n\nVMW\n\nVRTX\n\n# 2021 Stocks\n\nAAON\n\nAAPL\n\nACN\n\nADBE\n\nAEIS\n\nALGN\n\nAMAT\n\nANET\n\nAPH\n\nATR\n\nATVI\n\nAX\n\nBLD\n\nCDNS\n\nCGNX\n\nCHD\n\nCHE\n\nCORT\n\nCPRT\n\nDLB\n\nDORM\n\nEPAM\n\nESNT\n\nETSY\n\nEW\n\nEXPD\n\nEXPO\n\nFAST\n\nFB\n\nFIX\n\nFOXF\n\nFTNT\n\nGGG\n\nGOOG\n\nGRMN\n\nHEI.A\n\nHELE\n\nIDA\n\nINS\n\nINTC\n\nINTU\n\nIRBT\n\nISRG\n\nCCSI\n\nZD\n\nKLAC\n\nLRCX\n\nLULU\n\nMASI\n\nMED\n\nMKSI\n\nMKTX\n\nMNST\n\nMORN\n\nMPWR\n\nMSFT\n\nNMIH\n\nNRC\n\nNVDA\n\nODFL\n\nOLED\n\nOLLI\n\nPAYC\n\nPAYX\n\nPRLB\n\nQLYS\n\nREGN\n\nRMR\n\nROAD\n\nSCCO\n\nSFBS\n\nSLP\n\nSTMP\n\nTDY\n\nTER\n\nTREX\n\nTROW\n\nTTD\n\nTYL\n\nUI\n\nV\n\nVEEV\n\nVRTX\n\nWAL\n\nYETI\n\n# Notes\n\nI  partnered up for both the 2020 and 2021 experiments. This was critical  for both expanding my initial idea, brainstorming methods to build the  model, and reviewing the work done for errors. This was a team effort,  and I by no means deserve all the credit or hate.\n\nAll returns are showing reinvested dividends in the total return.\n\n\\*I  am not a financial advisor or anything else I should put here to ensure  it is clear that I did this for myself and am sharing my results and am  in no way forcing you to push buttons to buy things you don’t  understand or requiring justification for this run on sentence and  henceforth.\n\n\\*\\*\\*\\*. Past results are no guarantee of future returns.",
        "subreddit": "wallstreetbets",
        "title": "One Word For You: I Bet I Can Beat the S&amp;P 500",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qw4dbk/one_word_for_you_i_bet_i_can_beat_the_sp_500/",
        "created": 1637199068.0
    },
    {
        "author": "newbienewme",
        "created_utc": 1637742347,
        "id": "r10dbb",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "So I have been looking at screening stocks to find good \"boring but solid\" long-term buy-and-hold candidates, the ones that steady go up year-after-year with hopefully little volatility. \n\nMy screens are typically\n\n* growth both in EPS and Sales quarter-over-quarter of 20%\n* high margins\n* little short float (less volatility, I presume)\n* P/E not excessive (say &lt;30 or &lt;35)\n* ROE should be high &gt;20%\n\nWhat I then get out of this are a lot of the big-tech stocks that have been some of the winners in the stock-market in the last year like GOOGL, FB and AAPL, as you maybe would expect, and I find that a good sign.\n\n**My question is, why does this screen also produce manyof stock that have no price momentum at all? They seem to be moving sideways at least for the past year even though they have had growth in their fundamentals.** \n\nSome examples:\n\n[International Money Express](https://finviz.com/quote.ashx?t=IMXI)(-4.7% in 1 year)\n\n[Monster Beverage](https://finviz.com/quote.ashx?t=MNST)(+5% in a year)\n\n[Lam Research Corporation](https://finviz.com/quote.ashx?t=LRCX)( 3% in the last six months, isn't there a semiconductor boom now?)\n\n[Aspen Technology](https://finviz.com/quote.ashx?t=AZPN) (17% in a year)\n\nWhile some of these stocks have gone up in the past year, when viewed against the 27% gain in the S&amp;P500, they have underperformed.\n\n*Are these overlook/forgotten stocks?* \n\n*Is it that they will \"at some point\" start growing, or will they just stay like this?* \n\nOr, what is more likely a*m I missing some important factor in my screen? Have investors for some reason soured on these stock and sold off, causing multiples to contract? If so,* ***how do I reduce the risk of the same happening to my buy-and-hold portfolio in the future? If it is not enough to seek out good companies, but you also need to factor in change in investor sentiment, how do you screen for that?*** \n\n(disclosure: I only hold a little GOOGL and index funds at the moment)",
        "subreddit": "stocks",
        "title": "Why do some stocks with apparently strong fundamentals move sideways for years while others take off?",
        "url": "https://www.reddit.com/r/stocks/comments/r10dbb/why_do_some_stocks_with_apparently_strong/",
        "created": 1637771147.0
    },
    {
        "author": "GeauxFourIt",
        "created_utc": 1636737806,
        "id": "qsg45t",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Long LRCX - Jan 2024 Calls $560 Strike Price - YOLO",
        "url": "https://i.redd.it/bh4ojwc587z71.png",
        "created": 1636766606.0
    },
    {
        "author": "FinancialWhoas",
        "created_utc": 1637167647,
        "id": "qw3f2w",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "TLDR: I did a bunch of math based on some reasonably good ideas to determine a selection of stocks worth investing in. Tables of stocks found below. My diamond hands are so rough on my fleshy...forearms. I can't type anymore.\n\n# Observations/Assumptions\n\nBefore you jump down my throat, these are simplified observations/assumptions, not internationally agreed upon mandates from heaven. Okay, now you can jump down my throat.\n\n* Companies with strong financials, a competitive advantage, good management, a sustainable business model, etc. tend to do better than companies missing one or more of those attributes.\n* For most people it is impossible to time the market\n* Stock prices have all available information priced into them.\n* The markets are relatively efficient over the long-term.\n* [Index funds have been shown to be the most successful stock investing instrument for most people](https://freakonomics.com/podcast/stupidest-money/)\n* [Index fund returns, such as the S&amp;P 500, are now predominately determined by a handful of extremely large, mostly tech stocks.](https://www.investopedia.com/top-10-s-and-p-500-stocks-by-index-weight-4843111)\n* [Most funds do not beat the index over a long period](https://finance.yahoo.com/news/dont-pay-investment-adviser-beat-144400899.html).\n* The cost of stock trades at most firms is now $0.00 (yes, simplified)\n* During times of volatility, companies that had poor financials will likely find it challenging to survive.\n* [Zombie companies](https://finance.yahoo.com/news/zombie-companies-hiding-uncomfortable-truth-183246812.html) are able to survive for longer periods during times of extremely cheap debt.\n* Index funds have these 3 issues that are hard to get around:\n   * You are unable to effectively [Tax-Loss Harvest](https://www.investopedia.com/articles/taxes/08/tax-loss-harvesting.asp) even though many of the holdings that make up the index would have had losses, thereby reducing the return compared to directly investing in that same set of stocks in the same proportions.\n   * You have no control over the holdings within the fund and may be supporting things you don’t want to support.\n   * Due to the way the index works, any large stock that becomes part of the index is potentially a huge drag on the index. This happened when Tesla was going to be added on 12/21/2020, which was announced on 11/16/2020, forcing funds to buy the stock at the same time driving up the price, which had already been driven up by people buying the stock knowing it was then going to get added to the index forcing more people to buy the stock. If you think it sounds kind of circular, that’s because it is.\n\n# Hypothesis\n\nUsing industry benchmarking against the best of the best of the best companies in each industry in order to purchase only the best companies in equal measure should provide a well-diversified portfolio that over the long term should be able to beat the S&amp;P 500.\n\n# Experiment 2020\n\n750 largest US stocks were analyzed against their peers in their industry (Industry details available further down the post). Stocks were given a score based on their relative percentage compared to the industry index. For example, each companies’ average ROE of the last 4 years was compared to this index value with the following type of breakdown:\n\n* ROE &lt; Index ROE = Poor = 1\n* ROE &gt; Index ROE = Moderate = 2\n* ROE &gt; 150% of Index ROE = Great = 3\n\nFor example, the ROE communication services industry index value used was 10.10%. If a communication services company had a ROE average of 9%, they would receive a poor rating. If they had a ROE of 10.5% they would receive a moderate rating. If they had a ROE of 25% they would receive a great rating.\n\nThis was done for all of the metrics below:\n\n* ROE\n* Revenue Growth %\n* EBITDA %\n* FCF %\n\nThe relative scores used for each of the metrics was tweaked until there was a good distribution of results. e.g., if the 150% revenue growth only found 5 companies with a Great rating, that may need to be decreased to 125% for a better distribution.\n\nAny stock that received a poor in any of the 4 metrics was eliminated.\n\nExample below on ROE:\n\n[ROE Example](https://preview.redd.it/unapdml3m6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=76d615130616fb32c179674306cb461d3c0dcb2d)\n\nThat left 53 stocks. EBITDA was then analyzed to see if it was declining, and if so, it too was eliminated.\n\nThis left 45 stocks. These 45 were reviewed more thoroughly. What did the company do? What were their competitive advantages? Are they currently in any lawsuits? Does their debt look out of control? Do I see them being a long-term sustainable choice? Is their IP about to expire? Has WSB said it's a buy? Essentially boiling down to: Is there any reason that I want to exclude them?\n\nThat left 26 across 7 sectors. \n\n**2020 Industries**\n\n[2020 Industry Breakdown](https://preview.redd.it/o9llcazgm6081.png?width=386&amp;format=png&amp;auto=webp&amp;s=64e5c541e836a173e373113b5d13cc5b7648f57a)\n\nThese 26 stocks were bought in equal amounts in July 2020, August 2020, and September 2020. To easily perform time weighted analysis of these stocks and determine if there was an opportunity cost, 10% of the total purchase each period was also allocated to VFIAX.\n\n2020 Experiment Results July, August, and September 2020 purchases to 11/16/2021\n\n* **S&amp;P 500** total return reinvested dividends: **49.09%**\n* **My 26 Stock Index** including reinvested dividends: **61.53%**\n\nCan we do it again this year? Should we go bigger? Yes.\n\n# Experiment 2021\n\n2,850 tickers of the largest US stocks were identified as the initial list. The stocks had their last 5 years averaged for each of nine metrics:\n\n* Revenue Growth % - shows growth rate of the company\n* Profit Margin – shows how effective the business is at making money\n* Operating Margin – shows how much money the company earns on its revenue\n* FCF Margin – shows how efficient a company is with their cash\n* EBITDA Margin – shows a companies’ operating profitability\n* ROE – shows how well management balances profits, leverage, and assets to make money\n* ROA – shows how effectively a company utilizes its assets to generate profits\n* ROIC – shows how effective the company is at using its money to generate returns\n* Debt/Equity Ratio – shows the financial stability of a company\n\nMore metrics were used due to the increased data set. These stocks were then grouped by industry, and the average of the averages is taken to determine the industry average for the last 5 years; I switched to median based on a few outliers really throwing the average for some of the metrics. If that was confusing, here is an example:\n\n· 3 stocks that make up an industry averaged -10%, 15%, and 20% ROE over the last 5 years. The median over the last 5 years for that industry is then 15% and all 3 of those stocks will be compared to that benchmark.\n\nEach stock was compared against its Industry benchmark for each of the metrics and given a score 1=Poor, 2=Good, 3=Great as well as a composite score out of 27, from 9 metrics with a max score of 3 in each of the metrics. The scores are based on how much better they are then the average. I measured them against the benchmark using the same methodology as previously performed: Poor &lt; 100%, Good &lt; 150%, Great &gt; 150%. Again, these may be tweaked slightly depending on the particular metric to find a useful distribution.\n\nI also ranked every stock against the entire list for each of the metrics and overall. For those wondering, the best stock in this ranking was CORT with a score of 2,097 and the worst was CYCN with a score of 23,095. Because the overall rank is a combination of 9 categories with values ranging from 1-2791, the theoretical best a company could do would be 9 and the theoretical worst a company could do would be 25,119. Anyone wondering why the number of stocks doesn’t match the original input (congratulations on your reading comprehension), this is primarily due to mergers/acquisitions or the stock being taken private. Another stock was acquired during the analysis, changing the max number yet again.\n\nHere is an example showing Aerospace &amp; Defense scoring:\n\n[Aerospace and Defense Example Scoring](https://preview.redd.it/s80995tpo6081.png?width=615&amp;format=png&amp;auto=webp&amp;s=58fbc4aa6a06985cbedd1d4bf26d678b94bcc977)\n\nHere is an example showing growth scoring (the Revenue Growth column is the company’s most recent year):\n\n[Growth Scoring](https://preview.redd.it/12pnpz90p6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=e4d32a3469e261be37cba38f28c9ca39ef0552e0)\n\nHere is an example of the visualizations for the data:\n\n[Data Visualizations](https://preview.redd.it/112baw12p6081.png?width=624&amp;format=png&amp;auto=webp&amp;s=1c55275971eba7f3f0d316f84a275da53572fcf8)\n\nI applied a series of filters to eliminated unwanted noise. I looked at the top 5 stocks per industry (extending out for any ties), any stock that scored a 25, 26, or 27 on the composite, or any stock that had a high enough overall rank to justify being reviewed.\n\nNext, I read the description of \\~300 stocks and looked through their financials for any inconsistencies, such as one huge year throwing off their average, profit margins higher than operating margins, highly leveraged companies with poor growth, etc. My favorite find was that Chemed Corporation provides hospice/palliative care and owns Roto-Rooter. Yes, I did end up keeping them (how could you not?), no there are not great synergies between the sectors of the business, yes, they are aware of this. I also eliminated industries I wasn’t interested in reviewing, such as REITS due to the need to look at different metrics like FFO, Oil and Gas because it’s oil and gas, etc. These activities eliminated \\~150. I would like to get back to REITs, but I’d need to build a separate model.\n\nI then looked at each stock in more detail compared to its peers that made the cut. Are all the rest of them in the double digits for growth, are the profit margins substantially less, which one is in a better debt situation, did WSB say it's a buy, etc. Who deserves to be on this list? This eliminated \\~75.\n\nWe were down to 84 stocks at this point. I then looked at each company's investor presentation, annual report, etc. to better understand what the company does, their revenue model, risks, etc. I was not nearly as thorough on this portion this year compared to last year just due to the substantial increase in companies, 26 vs 84. My hourly wage at McDonald was going to be better than my returns from the analysis if I took too long. I only eliminated 1 company which left us at the grand total of 83 companies across 31 industries. Breakdown below:\n\n**Industry**\n\n[Industry Breakdown](https://preview.redd.it/r9rt903pp6081.png?width=388&amp;format=png&amp;auto=webp&amp;s=95168c9e7c65cf548f4bd7c4be45ffaf9b1ac46b)\n\nI then purchased all of these in equal proportion in April, May, and July of 2021.\n\n2021 Experiment Results April, May, and July 2021 purchases to 11/16/2021:\n\n* **S&amp;P 500** total return including reinvested dividends: **11.93%**\n* **My 2021 Stock Index** including reinvested dividends: **14.26%**\n\n# Industry Classification\n\n* For Experiment 2020, the Sector was used to determine how companies should be compared.\n   * This is made up of 11 sectors such as Information Technology, Communication Services, Utilities, etc.\n   * This seemed to be too restrictive and compared companies against each other that aren’t really accurate comparisons. See the example on ROE below.\n* For Experiment 2021 I used the Microsoft Excel Stock function to pull industries for all the stocks.\n   * This looks like it pulls data mostly from Industry and Sub-industry.\n   * This was successful on 98% of the stocks and for the final 2% I manually classified based on the taxonomy in the [Global Industry Classification Standard](https://en.wikipedia.org/wiki/Global_Industry_Classification_Standard).\n   * I ended up needing to collapse the structure a little further. Originally there were 55 classes with many of the classes having less than 10 stocks. I was able to collapse this to 44 classes. This will likely be tweaked a little further next year as I had mathematical issues dealing with averages/medians that were negative. There were also just too many categories with similar enough results that they could be combined such as biotech and pharmaceutical.\n\n# 2020 Stocks\n\nABMD\n\nADBE\n\nANET\n\nBWXT\n\nCRL\n\nDG\n\nENR\n\nETSY\n\nEXEL\n\nICLR\n\nISRG\n\nKLAC\n\nLKQ\n\nLRCX\n\nMNST\n\nMPWR\n\nMTCH\n\nOLED\n\nPAYC\n\nPHM\n\nTER\n\nTTD\n\nUI\n\nVEEV\n\nVMW\n\nVRTX\n\n# 2021 Stocks\n\nAAON\n\nAAPL\n\nACN\n\nADBE\n\nAEIS\n\nALGN\n\nAMAT\n\nANET\n\nAPH\n\nATR\n\nATVI\n\nAX\n\nBLD\n\nCDNS\n\nCGNX\n\nCHD\n\nCHE\n\nCORT\n\nCPRT\n\nDLB\n\nDORM\n\nEPAM\n\nESNT\n\nETSY\n\nEW\n\nEXPD\n\nEXPO\n\nFAST\n\nFB\n\nFIX\n\nFOXF\n\nFTNT\n\nGGG\n\nGOOG\n\nGRMN\n\nHEI.A\n\nHELE\n\nIDA\n\nINS\n\nINTC\n\nINTU\n\nIRBT\n\nISRG\n\nCCSI\n\nZD\n\nKLAC\n\nLRCX\n\nLULU\n\nMASI\n\nMED\n\nMKSI\n\nMKTX\n\nMNST\n\nMORN\n\nMPWR\n\nMSFT\n\nNMIH\n\nNRC\n\nNVDA\n\nODFL\n\nOLED\n\nOLLI\n\nPAYC\n\nPAYX\n\nPRLB\n\nQLYS\n\nREGN\n\nRMR\n\nROAD\n\nSCCO\n\nSFBS\n\nSLP\n\nSTMP\n\nTDY\n\nTER\n\nTREX\n\nTROW\n\nTTD\n\nTYL\n\nUI\n\nV\n\nVEEV\n\nVRTX\n\nWAL\n\nYETI\n\n# Notes\n\nI partnered up for both the 2020 and 2021 experiments. This was critical for both expanding my initial idea, brainstorming methods to build the model, and reviewing the work done for errors. This was a team effort, and I by no means deserve all the credit or hate.\n\nAll returns are showing reinvested dividends in the total return.\n\n\\*I am not a financial advisor or anything else I should put here to ensure it is clear that I did this for myself and am sharing my results and am in no way forcing you to push buttons to buy things you don’t understand or requiring justification for this run on sentence and henceforth.\n\n\\*\\*\\*\\*. Past results are no guarantee of future returns.",
        "subreddit": "wallstreetbets",
        "title": "One Word For You: I Bet I Can Beat the S&amp;P 500",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qw3f2w/one_word_for_you_i_bet_i_can_beat_the_sp_500/",
        "created": 1637196447.0
    },
    {
        "author": "RedditUser10110",
        "created_utc": 1636756544,
        "id": "qsmq1p",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Loaded some calls $LRCX",
        "url": "https://i.redd.it/1e2nnqu0s8z71.jpg",
        "created": 1636785344.0
    },
    {
        "author": "seigy",
        "created_utc": 1636239707,
        "id": "qobi7c",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Over the past several weeks there has been a lot of commitments to spend money from both the public and private sectors. I have attempted to capture the biggest spending plans to follow the money for my investments. Even with reading and watching market news as much as I can, I cannot catch it all so please help me to add any big spending plans I missed or call me out if you think I am drifting off a money flow assessment.\n\nI have lumped these into groups based on core businesses.  Many of the stocks could be substituted for like companies (I selected ones that come up on some of my different stock screeners or are trending). To reiterate, I am going with themes here not always these specific stocks. For transparency, I do own maybe 25% of the different companies listed below and will buy some of the others on Monday.\n\nSemiconductor fabs and foundries: Samsung $205B/3yrs, Micron $150B/10yrs, Intel $115B/3yrs, Taiwan Semi $100B/3yrs, United Micro $2B in 2022, SK Hynix $235B/10yrs. *Major plays* $LRCX, $ASML, $AMAT, $TER. *Minor plays* $NUE, $X, $CLF, $VMC, $FCX, $URI, $CAT.\n\nGovernment infrastructure bill: $550B/5yrs. *Major plays* $URI, $CAT, $VMC, $NUE, $X, $CLF, $FCX, $VMC.\n\nBig Tech: Apple $450B/5yrs, FB $10B/yr. *Major plays* $NVDA, $AMD, $INTC, $MU, $WDC, $STM, $ADI, $ON, $TXN.  *Minor plays* $LRCX, $ASML, $AMAT, $TER, $TSM, $GFS, $UMC, $NUE, $X, $CLF, $VMC, $FCX, $URI, $CAT.\n\nEVs: GM $35B/4yrs, Ford $30B/4yrs, Toyota $14B/10yrs. *Major plays* $NUE, $X, $CLF, $WOR, $AA, $ALB, $LAC, $ABML, $FCX, $SCCO, $MP, $LYC, $NXPI, $TXN, $NVDA, $ON. *Minor plays* $URI, $CAT, $VMC, $FCX, $HON, $EMR, $PH, $ETN, $TSM, $GFS, $UMC.",
        "subreddit": "stocks",
        "title": "Following the money flows from Oct/Nov announcements",
        "url": "https://www.reddit.com/r/stocks/comments/qobi7c/following_the_money_flows_from_octnov/",
        "created": 1636268507.0
    },
    {
        "author": "Messi-00",
        "created_utc": 1636237710,
        "id": "qoav1u",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "All three had a pretty decent spike on Friday with NVDA. They all seem very bullish atm as well. I’m leaning towards splitting between the three. \nAll three have them have beat expected earning for the last three quarters. As for P/E’s: LRCX-20.6 AMAT-26.66 and KLAC-23.6. I know fundamentals don’t mean anything anymore but none of these three seem (that?) overvalued. The semiconductor market looking very juicy for long term holds.\nIf anyone thinks any of these stand ahead of the rest please share your thoughts!",
        "subreddit": "wallstreetbets",
        "title": "LRCX AMAT or KLAC??",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qoav1u/lrcx_amat_or_klac/",
        "created": 1636266510.0
    },
    {
        "author": "2WorksForYou",
        "created_utc": 1637101726,
        "id": "qvjyiu",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\n*here is a detailed breakdown of the most notable position changes among marquee hedge funds:*\n\nAPPALOOSA\n\n* Top new buys: ALIT, WMT, OVV\n* Top exits: EMR, NFLX, BP, RDS/A, RDS/B\n* Boosted stakes in: M, GT, EQT, AR, GOOG, XOP, OXY, KSS, DHI, PHM\n* Cut stakes in: MU, AMZN, BABA, PCG, FB, ET, TWTR, UBER, FCX, XLE\n\nBAUPOST GROUP\n\n* Top new buys: DBX, JOBY, LFG, OB\n* Top exits: AUR, CZOO\n* Boosted stakes in: SSNC, VRNT, TBPH\n* Cut stakes in: EBAY, PCG, WLTW, QRVO, INTC, IFF, PSTH\n\nBERKSHIRE HATHAWAY\n\n* Top new buys: RPRX, FND\n* Top exits: MRK, LBTYK, OGN\n* Boosted stakes in: CVX\n* Cut stakes in: ABBV, CHTR, BMY, V, MA, MMC, USB\n\nCOATUE MANAGEMENT\n\n* Top new buys: MSFT, BLND, AFRM, BEKE, NTLA, ABSI, HOOD, TOST, CRBU, SUNL\n* Top exits: DDOG, CHPT, ROOT, AI, LMND, SKLZ, LAZR, COIN, MVIS, SOFI\n* Boosted stakes in: BZ, MQ, JD, CFLT, DDL, SNAP, GH, CVAC, LI, RBLX\n* Cut stakes in: AMZN, NUAN, RUN, SQ, PYPL, TSLA, SHOP, PTON, Z, FB\n\nCORVEX MANAGEMENT\n\n* Top new buys: FIVN, UBER, USFD, SMFR, SLGC, SKYA, SRAD, APO\n* Top exits: DOMA, TWND, HZON, ROVR, CZOO, LIDR, XME, LGV\n* Boosted stakes in: ZNGA, CRM, MSFT, JPM, FB, DIS, CCEP\n* Cut stakes in: ATUS, EXC, TMUS, BLMN, AMZN, GOOGL\n\nD1 CAPITAL PARTNERS\n\n* Top new buys: HOOD, WRBY, TXRH, NFLX, OPEN, PH, TPX, MASI, NTES, SGHT\n* Top exits: BKNG, U, CMG, DECK, TUYA, BHG, LTCH, BZ, FUTU, WDH\n* Boosted stakes in: EXPE, STNE, TMUS, DIS, BBWI, BLL, FTV, PTON, PODD, PINS\n* Cut stakes in: AMZN, FB, SNOW, EW, MSFT, CVNA, PCOR, DHR, CRWD, SQSP\n\nDUQUESNE FAMILY OFFICE\n\n* Top new buys: CPNG, LYV, ZM, PRCT, OSCR, STNE, ABCL, FSLY, LAD, CFLT\n* Top exits: NFLX, CMI, GE, MA, V, USFD, CAT, GM, ON, BLDR\n* Boosted stakes in: GOOGL, EXPE, BKNG, DISH, OPCH, FTCH, COUP, AMZN, RETA\n* Cut stakes in: MSFT, TMUS, CVNA, PLTR, TECK, FB, FCX, INTU, PENN, SMAR\n\nELLIOTT INVESTMENT MANAGEMENT\n\n* Top new buys: SC, CTXS, HTA, VAL, APA, 1865300D\n* Top exits: EDR, SNAP, DBX, PINS, TTD, HRB\n* Cut stakes in: ARNC, FYBR, ETWO, BTU\n\nGREENLIGHT CAPITAL\n\n* Top new buys: SLV, FREY, SNAX\n* Top exits: SPY, JOBY, SNX, OPAD, DNA, CCCS, APG, IONQ, XOS, UWMC\n* Boosted stakes in: TECK, ODP, BHF, LIVN, MYPS, SONO, GLD, CPRI, JACK, CHNG\n* Cut stakes in: CNXC, CC, REZI, FUBO, SATS, AER, EXPE, ADMP, AGCB, GPOR\n\nICAHN\n\n* Top new buys: SWX\n* Boosted stakes in: DAN, IEP\n* Cut stakes in: OXY\n\nJANA PARTNERS\n\n* Top new buys: M, VVV, BKSY\n* Boosted stakes in: THS, VG, CONE\n* Cut stakes in: SPY, LH, EHC\n\nLANSDOWNE\n\n* Top new buys: WRK, FSLR, CTRA, CF, AGI, CCJ\n* Top exits: LRCX, MU, AER, UAL, LUV, ENIA, TMUS, RBLX, SSO, UVXY\n* Boosted stakes in: NVT, ILMN, GE, TSM, ADI, BKNG, IEUR\n* Cut stakes in: FCX, CARR, ETN, VMC, AMAT, DAL, RYAAY, EGO, OTIS, WMG\n\nMAVERICK CAPITAL\n\n* Top new buys: INST, CRBU, EHTH, SPIR, STZ, CCL, AAP, SHW, OLPX, PZZA\n* Top exits: BABA, AON, BECN, CZOO, TSM, HIMS, DGNS, SBUX, XMTR, KVSA\n* Boosted stakes in: V, WDAY, SE, ATVI, CRIS, LRCX, RCKT, NFLX, TWLO, DECK\n* Cut stakes in: CPNG, FB, LIVN, ALNY, ADSK, FLT, IFF, GOOG, CCK, MELI\n\nMELVIN CAPITAL MANAGEMENT\n\n* Top new buys: AFRM, MAR, SQ, MCD, ASML, VSCO, WMG, CRL, BURL, OLPX\n* Top exits: V, JD, PYPL, LVS, ADSK, CRWD, NTES, TGT, UBER, SHOP\n* Boosted stakes in: SNAP, BILL, MA, BBWI, LYV, HLT, FB, DT, EFX, DDOG\n* Cut stakes in: AMZN, EXPE, FICO, GOOGL, ALGN, ATVI, USFD, VMEO, VAC, IAA\n\nOMEGA ADVISORS\n\n* Top new buys: LVS\n* Top exits: FOE, CS, PNTM, CRBN, JWSM, ANAC, APSG\n* Boosted stakes in: CTRA, BHC, PFSI, WSC, GM, DMAC, VRT, SRGA, FLMN, ASPU\n* Cut stakes in: NAVI, MP, OCN, BBDC, TRN, FCRD, ABR\n\nSOROBAN CAPITAL\n\n* Top new buys: RKLB, ALCC, LICY, CPAR, POND\n* Top exits: ATUS, DOMA, SPIR, ATIP, VYGG, ME, PAYO, SUNL, BGRY, TALK\n* Boosted stakes in: UNP, PLNT, WAB, MA, CSX, LOW, FB, V, KIND, ML\n* Cut stakes in: ADI, AMZN, MSFT, NFLX\n\nSOROS FUND MANAGEMENT\n\n* Top new buys: HRC, JPM, UNH, CPNG, EQT, XLE, GS, HYZN, MTB, INTU\n* Top exits: OTIS, QS, CLVT, IFF, W, UPST, AXTA, TXN, S, NXPI\n* Boosted stakes in: INFO, NUAN, PPD, ARMK, CRM, ACN, GM, SYF, BKNG, VICI\n* Cut stakes in: FIGS, QQQ, ATVI, MGLN, ELAN, AMZN, DIS, LBRDK, GOOGL, XLU\n\nSTARBOARD VALUE \n\n* Top new buys: HUN, CYXT, BRDS, ENFA, VPCC, TREB, DKDCA, BTTX, HCIC, CPAR\n* Top exits: IWN, KVSC, ROIV, STRC, OPAD, LILM, RBOT, SPIR, ROVR, GDEV\n* Boosted stakes in: IWM, AUS, MTAC, KVSB, LNFA, FVT, TWND, PLMI, PRPB, ACAH\n* Cut stakes in: MD, BOX, CTVA, IWR, ELAN, PZZA, ACM, MMSI, ON\n\nTEMASEK HOLDINGS\n\n* Top new buys: ETWO, USIG, ONEM, BLND, POSH, DUOL, IRNT, HLTH, PATH, MNDY\n* Top exits: CTVA, SOFI, COPX, PICK, KREF, BIDU, TAL, BZ, EDU, MSFT\n* Boosted stakes in: GOVT, SCHP, GRCL, BGNE, SNOW, IAU, XME, FIXX, EWY, AFRM\n* Cut stakes in: BABA, INFO, RBLX, DIDI, ABNB, MA, DCT, NTLA, LCTU, CRM\n\nTIGER GLOBAL\n\n* Top new buys: WRBY, HOOD, BLND, VTEX, MTTR, SPIR, TOST, BKSY, AVPT, ALCC\n* Top exits: TAL\n* Boosted stakes in: SNOW, SE, DASH, DDOG, OZON, WDAY, XM, SQ, OSCR, ONTF\n* Cut stakes in: RBLX, APO, PTON, JD, SPOT, YSG, UBER, CVNA, INTU, DESP",
        "subreddit": "wallstreetbets",
        "title": "new meta",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qvjyiu/new_meta/",
        "created": 1637130526.0
    },
    {
        "author": "GeauxFourIt",
        "created_utc": 1637344142,
        "id": "qxlj1b",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "LRCX UPDATE - GAIN",
        "url": "https://i.redd.it/ogpbcrw6bl081.png",
        "created": 1637372942.0
    },
    {
        "author": "GeauxFourIt",
        "created_utc": 1637088512,
        "id": "qveyao",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "LRCX YOLO UPDATE",
        "url": "https://i.redd.it/xcwo927370081.png",
        "created": 1637117312.0
    },
    {
        "author": "Messi-00",
        "created_utc": 1636237114,
        "id": "qoaoat",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "All three had a pretty decent spike on Friday with NVDA. They all seem very bullish atm as well. I’m leaning towards splitting between the three but if anyone thinks any of these stand ahead of the rest please share your thoughts!",
        "subreddit": "wallstreetbets",
        "title": "LRCX AMAT or KLAC??",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qoaoat/lrcx_amat_or_klac/",
        "created": 1636265914.0
    },
    {
        "author": "GeauxFourIt",
        "created_utc": 1638210872,
        "id": "r52b3w",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "LRCX - Baby Gains",
        "url": "https://i.redd.it/s6yqs1mhwk281.jpg",
        "created": 1638239672.0
    }
]