[
    {
        "author": "djyosco88",
        "created_utc": 1614817486,
        "id": "lx8dqb",
        "num_comments": 523,
        "num_crossposts": 0,
        "selftext": "Been red the past few weeks. While our portfolios are probably hurting, it’s also sale time!\n\nMaybe not for everything and maybe not tomorrow. But what is your watch list?\n\nI’m keeping my eye on...\n\nCOST\nNVDA\nAMD\nARKK\nARKG\nCRSR\nSPCE\n\nI want to add to these positions. My whole account is bleeding profusely but there long holds so I’ll make it though.",
        "subreddit": "stocks",
        "title": "What are we buying during this sale",
        "url": "https://www.reddit.com/r/stocks/comments/lx8dqb/what_are_we_buying_during_this_sale/",
        "created": 1614846286.0
    },
    {
        "author": "GordonGekkoVienna",
        "created_utc": 1617094843,
        "id": "mgbnlp",
        "num_comments": 385,
        "num_crossposts": 0,
        "selftext": "ARK's new space ETF makes no sense at all. The second largest position is another ETF. Also included are: JD.COM, NVIDIA, DEERE&amp;CO, AMAZON, ALPHABET, GARMIN, ALIBABA, NETFLIX. And those are just the inappropriate companies I knew about without having to look. Is ARK preparing us to watch netflix while mowing the lawn on mars?\n\nI am only surprised that there is no TSLA inside. Does anyone know what this is about? I realize that there are not many \"space\" stocks, but then I leave the project instead of filling the ETF with illogical companies.\n\nHere I have a link to the list of holdings:\n\nhttps://ark-funds.com/wp-content/fundsiteliterature/holdings/ARK_SPACE_EXPLORATION_&amp;_INNOVATION_ETF_ARKX_HOLDINGS.pdf",
        "subreddit": "stocks",
        "title": "Is ARK totally crazy?",
        "url": "https://www.reddit.com/r/stocks/comments/mgbnlp/is_ark_totally_crazy/",
        "created": 1617123643.0
    },
    {
        "author": "billwaters",
        "created_utc": 1614829328,
        "id": "lxbssi",
        "num_comments": 319,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Just a $110k loss in less than a month due to NVDA and TLSA put credit spreads, just keep scrolling",
        "url": "https://i.redd.it/xitvl9f1nxk61.jpg",
        "created": 1614858128.0
    },
    {
        "author": "learner4f",
        "created_utc": 1617095950,
        "id": "mgbwkw",
        "num_comments": 197,
        "num_crossposts": 0,
        "selftext": "It's official - ARKX is available for trading today (3/30/2021).\n\nHere is the top 20 holdings in ARKX (sorted from largest weight to smallest weight):\n\nCompany Ticker Weight(%) Shares Market Value($)\n\nTRIMBLE INC TRMB 8.47 1156 $86,353.20\n\nTHE 3D PRINTING ETF PRNT UF 6.1 1636 $62,168.00\n\nKRATOS DEFENSE &amp; SECURITY KTOS 5.62 2203 $57,322.06\n\nL3HARRIS TECHNOLOGIES INC LHX 4.97 255 $50,729.70\n\n[JD.COM](https://jd.com/) INC-ADR JD 4.91 610 $50,062.70\n\nKOMATSU LTD 6301 JT 4.56 1547 $46,545.40\n\nLOCKHEED MARTIN CORP LMT 4.47 125 $45,588.75\n\nIRIDIUM COMMUNICATIONS INC IRDM 4.23 1132 $43,163.16\n\nTHALES SA HO FP 3.9 407 $39,789.41\n\nBOEING CO/THE BA 3.48 145 $35,506.15\n\nNVIDIA CORP NVDA 3.32 66 $33,895.62\n\nSPIRIT AEROSYSTEMS HOLD-CL A SPR 3.26 687 $33,209.58\n\nDEERE &amp; CO DE 3.18 87 $32,389.23\n\n[AMAZON.COM](https://amazon.com/) INC AMZN 2.99 10 $30,520.30\n\nTERADYNE INC TER 2.74 235 $27,969.70\n\nALPHABET INC-CL C GOOG 2.59 13 $26,462.15\n\nDASSAULT SYSTEMES SE DSY 2.55 121 $26,035.27\n\nTELEDYNE TECHNOLOGIES INC TDY 2.55 65 $26,050.70\n\nGARMIN LTD GRMN 2.01 160 $20,539.20\n\nVIRGIN GALACTIC HOLDINGS INC SPCE 1.95 672 $19,884.48\n\n&amp;#x200B;\n\n I can't post the entire list because it might contain \"forbidden\" tickers, and mods will delete this post.\n\nFor the entire list and more info, you can search for \"ARK Space Exploration ETF (ARKX) - Holdings Reveal\" on youtube ( sorry, mods keep deleting my post because of youtube link).\n\nHopefully, the information here will be useful to everyone.",
        "subreddit": "investing",
        "title": "ARK Space Exploration ETF (ARKX) - Holdings Reveal",
        "url": "https://www.reddit.com/r/investing/comments/mgbwkw/ark_space_exploration_etf_arkx_holdings_reveal/",
        "created": 1617124750.0
    },
    {
        "author": "datamonkeyz",
        "created_utc": 1615742166,
        "id": "m4zabk",
        "num_comments": 172,
        "num_crossposts": 0,
        "selftext": "Reports of the [semiconductor shortage](https://thehill.com/policy/technology/538474-biden-to-sign-executive-order-addressing-chip-supply-chain-shortage) in early February had me take deeper look into the industry. Wanted to share my thoughts with the sub!\n\nThe market is essentially split into two parts. Companies like AMD, NVIDIA, and QCOM design chips. Companies like TSM, UMC, and Samsung produce them. The shortage here is exclusively on the production side. We can't make chips fast enough and many industries (car makers in particular) are complaining really loudly about the shortage. Some of this is self-inflicted and short-term. Automakers cut back production forecasts because of COVID and rely heavily on just-in-time production supply chains to cut back on costs. This means that they were largely caught with their pants down when demand started to pick back up. \n\nThere are strong longer-term trends driving the shortage here too. Cars are getting more complicated and EVs need more/better hardware/chips. Right now, auto-makers are generally looking at 14nm chips ([Tesla's MCU2](https://onlyusedtesla.com/teslas-media-control-unit-mcu1-vs-mcu2/) is based on the Intel AtomE8000). This is an older process node, Intel was [releasing 14nm chips](https://en.wikipedia.org/wiki/List_of_Intel_Core_i5_processors#Skylake_microarchitecture_(6th_generation)) in 2015. I think ultimately, car production is going to have to be cut back, prices are going to go up, automakers are going to rush to lock in future supply, and producers (not designers) are going to benefit.\n\nThe producer market is really interesting. It takes a LONG time to spin up a new factory (fab). Generally speaking, it's 3-4 years before a factory goes from planning to production. We can't really throw money at this problem to fix this in the short-term. The producer market is also very clearly split into two parts: those who can make 10nm chips and below and those who can't. This [chart](https://s3.i-micronews.com/uploads/2021/03/ILLUS_HIGH-PERFORMANCE-PACKAGING_Overview_SemiconIndustry_YOLE_March2021.jpg) breaks it down at a high level. There are only three companies that can make chips that we'll want in the next 5 years (Intel, Samsung, TSMC), and one of them can't really do it. Intel has gotten 10nm reasonably figured [out but can't break 7.](https://www.tomshardware.com/news/intel-announces-delay-to-7nm-processors-now-one-year-behind-expectations) They've given up the production race and [plan on outsourcing](https://www.bloomberg.com/news/articles/2021-01-08/intel-talks-with-tsmc-samsung-to-outsource-some-chip-production) their future designs to TSMC and Samsung. \n\nBetween Samsung and TSM, TSM is investing much more aggressively for the future. They've already planning on building out a 5nm production line in Arizona for [\\~20K wafers](https://www.theburnin.com/industry/tsmc-increasing-spending-arizona-chip-factory-35b-2021-03-09/) which should increase their global production by 20%. There are [rumors](https://www.tomshardware.com/news/tsmc-arizona-fab-potential-expansion) that they are expanding production to 100K wafers which would double their global 5nm capacity. Samsung is still figuring out [where they want to build](https://www.anandtech.com/show/16483/samsung-in-the-usa-a-17-billion-usd-fab-by-late-2023). It also looks like [TSM](https://www.pcgamer.com/tsmc-3nm-2021-apple-chips/) is going to beat [Samsung](https://www.theburnin.com/industry/samsung-beginning-3nm-chip-mass-production-2022-2020-11-19/) to 3nm by almost a full year. \n\nThat said, the stock is not cheap. It's got a PE ratio of 53. But the steep technological moat, aggressive investment in future production, and long-term demand increases (cars/computers/phones aren't getting any simpler or less popular) makes me confident they'll grow into their price. \n\nTLDR: We need more chips. TSM makes the best chips.",
        "subreddit": "stocks",
        "title": "My Take on Semiconductors - TSMC DD",
        "url": "https://www.reddit.com/r/stocks/comments/m4zabk/my_take_on_semiconductors_tsmc_dd/",
        "created": 1615770966.0
    },
    {
        "author": "DestroyerOfPussy69",
        "created_utc": 1615302351,
        "id": "m189zy",
        "num_comments": 116,
        "num_crossposts": 0,
        "selftext": "**Advanced Micro Devices ($AMD) is undervalued, well positioned against competition, and poised to take further market share in rapidly growing and high demand industries.**\n\nAMD is mainly known for its presence in the gaming industry, and some of you may remember it as one of the OG WSB meme stocks. This subreddit has seen the potential of AMD multiple times in the past, and I believe the recent AMD dip has created an excellent opportunity.\n\n**First, let's look at how AMD compares to some of its competition:**\n\n* If you are into PC gaming at all, you will be aware of how CPU sentiment has shifted greatly away from INTC in favor of AMD.\n\n* The main reasons AMD CPUs are becoming more and more preferable are because they offer significantly more bang for your buck versus Intel CPUs, INTC has recently had disappointing new product releases, even high budget PCs are often abandoning Intel entirely.\n[CPU Comparison](https://www.cpubenchmark.net/high_end_cpus.html)\n\n* AMD just released new GPUs last week, which are superior in performance and more affordable than many of NVDA's top of the line models. Even though they are still high in price, this shows that AMD is very able and willing to compete with NVDA's top of the line GPUs. They sold out initially within a couple hours of release.\n[GPU Comparison](https://www.tomshardware.com/reviews/gpu-hierarchy,4388.html)\n\n* AMD produces both the CPUs and GPUs in both the Playstation 5 and Xbox Series X. These consoles only just released a few months ago and will be in extremely high demand for the next 5 years or more.\n[How AMD gained hold of the console market](https://itigic.com/ps5-vs-xbox-series-x-why-use-amd-cpu-gpu/)\n\nNVDA Market Cap: $290B\nINTC Market Cap: $245B\n**AMD Market Cap: $89.5B**\n\nMorningstar's research indicates that AMD's fundamental value is around $80 price per share. Meanwhile, they estimate NVDA's fundamental value to be around $330. These estimates tend to be conservative, yet even after this correction that tech has endured, most remain well above their fundamental value - except AMD.\n\n**As I am typing this, AMD is currently under $75 price per share. Even if AMD somehow had extremely minimal future growth (I will further outline why future growth will actually be astronomical), it would still fundamentally be valued at $80 per share AT LEAST, and that's with boomer estimates.**\n\nI don't claim that NVDA or INTC are bad companies, rather I seek to point out that AMD is being underestimated by Wall Street. There's more than enough room for all of these companies to have a future in the gaming industry and adjacent industries.\n\n[The gaming industry experienced record growth in 2020, and isn't stopping any time soon.](https://www.marketwatch.com/story/videogames-are-a-bigger-industry-than-sports-and-movies-combined-thanks-to-the-pandemic-11608654990)\n\nI see some claims that the end of lockdowns will mean less people playing video games or using computers, I don't think this claim is even worth seriously addressing. If you seriously think that you may be a little out of touch.\n\n**Other Industries AMD Will Succeed In**\n\nWhile my primary focus has been on AMD's success in the gaming industry, their GPU's are also widely used for mining the digital currencies that cannot be named or discussed on this subreddit, but it is still worth mentioning that market and the large demand that it brings. We've also seen NVDA branch off into the autonomous driving and AI industries, AMD could easily do the same.\n\n[AMD CEO, Lisa Su, has previously expressed interest in branching towards EV and AI industries, and says AMD's technology is already there. (This is the best link I can find at the moment)](https://www.reddit.com/r/AMD_Stock/comments/b4w1hm/is_amd_getting_more_serious_about_autonomous/)\n\n**Semiconductor Shortage?**\n\nSome people cite the recent semiconductor shortage as a reason to be bearish on AMD and related companies. While this is an issue, it is clearly short term, and I think these shortages have been more than priced in by now, especially for AMD. [Demand is extremely high, which is good, and AMD is working on increasing their capacity.](https://www.crn.com/news/components-peripherals/lisa-su-shortages-constrained-amd-s-record-2020-and-will-continue) Lisa Su says she expects shortages to ease the second half of 2021, adding that they will have added capacity in the second half of 2021.\n\nThe demand for AMD products is extremely high, this is clearly bullish in the long term. AMD’s technology will continue to be very valuable in many industries, the potential for growth here is still astronomical. Lisa Su is a great CEO who has brought AMD in a great and very competitive direction, and there are few CEOs better suited to successfully navigate any future speedbumps.\n\nIf that still doesn’t sooth your mind, [the Biden Administration has already committed to easing the shortage.](https://www.cnbc.com/2021/02/24/biden-signs-executive-order-to-address-chip-shortage-through-a-supply-chain-review.html)\n\n**Positions?**\n\nI tried to keep this analysis relatively short and sweet. I believe I have made a compelling case to be bullish on AMD in the coming months/year. IV on $AMD calls at the moment is extremely low, historically low. As low as 45% on many, making this a great time to buy, shares are also a fantastic choice. I recommend you give yourself enough time in case AMD continues to dip along with the rest of tech, but YOLO to your heart’s content if you wish to do so.\n\n$AMD $100c 7/16, $AMD $120c 01/21/22\n\n**TL;DR: AMD is undervalue, buy calls or shares**\n\nI dream of a day the front page of r/wallstreetbets is once again flooded with the face and worship of Lisa Su.",
        "subreddit": "wallstreetbets",
        "title": "It is time to return to tradition. Re-introducing the OG meme stock, $AMD. A play based on actual logic and not mindlessly flinging poo at a board to see what sticks.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m189zy/it_is_time_to_return_to_tradition_reintroducing/",
        "created": 1615331151.0
    },
    {
        "author": "Cliving01",
        "created_utc": 1615216890,
        "id": "m0hxew",
        "num_comments": 108,
        "num_crossposts": 0,
        "selftext": "Shoutout to u/TheGeffez for this great DD\n\n$BB DD thread: Why this retard believes the fair market value for $BB is $45. Obligatory 🚀🚀🚀🚀🚀🚀🚀\n\nI'm not a financial advisor, just a retard YOLO'ing my savings into long calls, so make your own decisions.\n\nTLDR: Blackberry is the market leader in an industry that McKinsey projects will fucking 🚀🚀🚀 to $750BN by 2030. BlackBerry has already grown their annual revenue for 2020 by 15.04% from 2019, so stap in your tendies because BB are going to the fucking moon. [https://www.mckinsey.com/\\~/media/mckinsey/industries/automotive%20and%20assembly/our%20insights/monetizing%20car%20data/monetizing-car-data.ashx](https://www.mckinsey.com/~/media/mckinsey/industries/automotive%20and%20assembly/our%20insights/monetizing%20car%20data/monetizing-car-data.ashx) \n\nOther relevant DD:\n\n* Market position analysis - [https://new.reddit.com/r/wallstreetbets/comments/l4ehan/blackberry\\_dd/](https://new.reddit.com/r/wallstreetbets/comments/l4ehan/blackberry_dd/) \n* BB Comprehensive guide - [https://new.reddit.com/r/wallstreetbets/comments/le53ol/comprehensive\\_guide\\_about\\_bb\\_and\\_how\\_it\\_shall/](https://new.reddit.com/r/wallstreetbets/comments/le53ol/comprehensive_guide_about_bb_and_how_it_shall/) \n* Amazon/BB partnership in the AV space - [https://new.reddit.com/r/wallstreetbets/comments/l5sno2/blackberry\\_bb\\_why\\_you\\_need\\_it/](https://new.reddit.com/r/wallstreetbets/comments/l5sno2/blackberry_bb_why_you_need_it/) \n* Other BB analysis - [https://new.reddit.com/r/wallstreetbets/comments/l0a1p5/the\\_full\\_dd\\_on\\_bb\\_an\\_elon\\_muskjeff\\_bezos\\_sandwich/](https://new.reddit.com/r/wallstreetbets/comments/l0a1p5/the_full_dd_on_bb_an_elon_muskjeff_bezos_sandwich/) \n\n1) BB has nothing to do with smartphones. Throw those 2007 notions out of your mind and bring yourself to the future\n\n2) Whilst the whole stock market has been pissing themselves for years over EV/AV industry speculation, the reality is that these are hardware companies with low margin, and limited scale potential.\n\nEven Tesla, owned and run by the richest man in the world, has yet to build more than 500,000 cars in one year. Meanwhile Tesla competitors springing up everywhere with both new challengers such as NIO and old money fucks getting into EV such as VW and GM (GM in December 2020 announced 100% by 2030 all cars would be 100% EV).\n\nTHE REAL FUCKING MONEY is not in EV production which has low margin and low scale, but in data monetization which is high margin (and being software) has unlimited scale. In the same way that Google makes only $18Bn revenue from hardware sales (phone, nest sales etc) but makes $120Bn from data monetization, $BB is going to to the fucking moon with $200BN revenue + by 2030 with 10% net whilst Tesla and other big auto are fighting over 4% margins (Tesla net profit in 2020 = 4% whilst **BB sat at a juicy 10.15%**).\n\nThis industry is going to the fucking moon, and BB is the only one with a front row ticket 🚀🚀🚀🚀🚀🚀🚀. This shit is like investing in Google or Amazon in the year 2000, by the time the mainstream saw the potential 5 years later, shit was already at pluto\n\nu/just an everyday life couldn't have put it better: \"Zombie cars and QNX\n\nQNX is the first commercial microkernel RTOS. What the fuck does that even mean nerd? For anyone like me who's not a software genius, I've done some research so we all know what we're getting into. A Real Time Operating System is developed to focus processing power on two most important things: Speed and Accuracy. This is different from shit like Windows and Mac OS (General Purpose OS or GPOS) as they spread processing power throughout the system because there isn't exactly anything that's significantly more important than the others. However, when you're using a self-driving program you need the hardware to perform the action at the exact time and speed. Your self driving program brakes too late? Crash into the car ahead of you. Your self program turns the wheel too late or too soon? Crash into a wall.\n\nBlackberry has been working on this technology since 2014. But car makers literally couldn't develop autonomous vehicles fast enough. So these guys have just been twiddling their fucking thumbs.\n\nFast forward to now, where the rise of Tesla has made everyone and their momma make a self driving EV. Everyone is trying to make their own autopilot program but not their own OS. So who's OS are they using?\n\nSONY? Blackberry QNX. Baidu? QNX baby. XPENG? Blackberry as well. If you read the article, you'll see XPEV is using DESAY's autopilot program that's built on QNX. Know who else is using DESAY autopilot? Li Auto But what about Nio you might ask? Well on NIO day, it was announced that NIO will be using Nvidia DRIVE....which is also built on QNX. What about the Apple car? There's no confirmation yet, but rumors of them reaching out to both Canoo and Hyundai makes me skeptical that Apple has succeeded in creating their own RTOS even after rumors of them starting 7 years ago. But even if they did... it doesn't even matter.\n\nYou might have noticed that I didn't mention Tesla at all. That's because they have developed their own Linux-based Operating system, which Tesla has been having trouble getting it approved by US safety regulations. QNX on the other hand, already is. $BB to the fucking moon🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\"\n\n3) BB is a cash flow positive, growing company with near nil competitors in an industry that is skyrocketing. Despite this, the boomer fucks who still believe BB is a smartphone company, have in their own glorious act of autism, have massively shorted BB bringing the share price down. \n\nBB is a growth company in a growth industry, these hedge funds are going to need to borrow more money if they want to buy tendies after the wider market realizes the market inefficiency that is an undervalued BB. u/Tradergurue went into a lot of detail in his $BB short interest post here [https://new.reddit.com/r/wallstreetbets/comments/l8pg8x/short\\_interest\\_in\\_bb\\_its\\_increasing/](https://new.reddit.com/r/wallstreetbets/comments/l8pg8x/short_interest_in_bb_its_increasing/) \n\nTLDR: hedge funds caught with their dicks in their hands are about to get Royally Fucked as the market corrects itself with a BB rise over the next month",
        "subreddit": "wallstreetbets",
        "title": "BB IS THE REAL DEAL!! This is not a short squeeze but a GREAT long term investment!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m0hxew/bb_is_the_real_deal_this_is_not_a_short_squeeze/",
        "created": 1615245690.0
    },
    {
        "author": "WallStreetWarrants",
        "created_utc": 1615319494,
        "id": "m1en5b",
        "num_comments": 96,
        "num_crossposts": 0,
        "selftext": "The first major item here is the news that there may be a virtual event on March 23rd (this is why I'll be looking at picking up some March 26th expiration calls that are close to ATM).\n\n&amp;#x200B;\n\n1. Rumor of an [Apple](https://www.macrumors.com/2021/03/08/apple-event-march-23-kang/) even on March 23rd, some items that may be coming:\n   1. [AirTags](https://www.macrumors.com/guide/airtags/) \\- not that exciting, just their version of Tile\n   2. [AirPods](https://9to5mac.com/2020/01/15/60-million-airpods-sold-in-2019/) \\- Apple has sold 60 million of these in 2019....that's 71% of true wireless headphone revenue\n   3. Potential for new Mac / iPad updates. The iMac Pro has been discontinued so it's possible they make an announcement around a Mac product here. \n\nCompany Fundamentals:\n\n* From the above you'll see they have a commanding share of the true wireless headphone market. Any additional updates to the AirPods would be a great revenue generator. As much as people roasted the over the ear AirPods max...they're sold out everywhere and people were paying 2x the price to get them off eBay. \n* Looking below there is a steady increase in revenue from the iPad, Mac...and significant growth from \"other\" which would be your AirPods, that new AirTag and other accessories. \n\nhttps://preview.redd.it/kg6p08vh32m61.png?width=2874&amp;format=png&amp;auto=webp&amp;s=bc707889b683a6bd52a8e5e6627d6acacc8a12d8\n\nFor those of you who understand how the 10yr relates to equity markets and how inflation = bad news for Apple...It's trading at an attractive P/E right now compared to other companies. It has a lower P/E than Microsoft, Amazon, NVIDIA, Adobe etc. \n\nhttps://preview.redd.it/cfh8d1qw32m61.png?width=2846&amp;format=png&amp;auto=webp&amp;s=e3a0c4692e6c980db9f6d851249503bb4e14cd4e\n\nThey had their best earnings report ever last quarter, and the stock dropped after, and continued to do so from $140 down to a low of $116 yesterday. \n\n*Processing img luqayw4542m61...*\n\nApple is below it's price it entered 2021 at, which to me flashes a huge buy sign as this is oversold. While tech might not have growth like it did in 2021, and just because $AAPL has mountains of cash, I don't think any pending inflation fears should sway anyone away from thinking this is as blue chip as you can get. \n\nhttps://preview.redd.it/sakohte942m61.png?width=2872&amp;format=png&amp;auto=webp&amp;s=532ef16995b0222365efbee51cd7d0b38d18d9ee",
        "subreddit": "wallstreetbets",
        "title": "Why you need to take a serious look at $AAPL before the March 23rd rumored event.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m1en5b/why_you_need_to_take_a_serious_look_at_aapl/",
        "created": 1615348294.0
    },
    {
        "author": "LuxGang",
        "created_utc": 1615233157,
        "id": "m0ocqu",
        "num_comments": 86,
        "num_crossposts": 0,
        "selftext": "So I've been looking at the semi's for a while now, and I feel this pullback is a great opportunity to pick some stuff up on discount. The problem is limited cash so I have to pick just 1.\n\nI'm debating between AMD, NVDA, ASML, and TSM. I suppose I could also just pick the semi conductor ETF, but that's not nearly as fun.\n\nAny thoughts on what seems to have the most attractive risk/reward at current valuations?",
        "subreddit": "stocks",
        "title": "Looking to buy a semi-conductor stock while they're out of favour. What to pick!?",
        "url": "https://www.reddit.com/r/stocks/comments/m0ocqu/looking_to_buy_a_semiconductor_stock_while_theyre/",
        "created": 1615261957.0
    },
    {
        "author": "billwaters",
        "created_utc": 1614829420,
        "id": "lxbttu",
        "num_comments": 84,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Just a $110k loss in less than a month due to NVDA and TSLA put credit spreads, just keep scrolling",
        "url": "https://i.redd.it/8sfbos7enxk61.jpg",
        "created": 1614858220.0
    },
    {
        "author": "No_Werewolf_1214",
        "created_utc": 1615675155,
        "id": "m4hcrr",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "How do y’all feel about playing bull-side semi plays over the next few months given the current yield volatility and rotation uncertainty? \n\nI’m currently holding 0.39-0.48 Delta call debit spreads for QCOM, AVGO, and NVDA (April and June expirations), and was considering opening up some complimentary 0.35-0.38(ish) range call credit spreads for the April plays to capture up-front premium and mitigate downside days for the CCSs. \n\nAny thoughts on near-term semis plays (in general) or the specific  picks/strategy listed above would be much appreciated.",
        "subreddit": "options",
        "title": "Semiconductor plays - NVDA, AVGO, QCOM (Too soon?)",
        "url": "https://www.reddit.com/r/options/comments/m4hcrr/semiconductor_plays_nvda_avgo_qcom_too_soon/",
        "created": 1615703955.0
    },
    {
        "author": "TheAlmostReddit",
        "created_utc": 1615474074,
        "id": "m2rs4h",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "So I'm a new investor and had a question. I have Nvidia in my portfolio as a company I want to invest in. I think the company will grow and I use their products blah blah blah. However, the stock price right now is roughly $500 which is a bit expensive. \n\nHow can you tell if a stock is currently overpriced or not? How can I tell if a stock has room to grow? For example this same reason keeps me from investing in amazon. I feel like I am focusing too much on price tags but I don't know what else to look at and how to determine if a stock is overpriced or not.\n\nJust to be clear I am not asking how to tell if a stock WILL go up or not. I'm asking how to come to a reasonable conclusion that a stocks price has room to grow.",
        "subreddit": "stocks",
        "title": "Can you tell if a stock is overpriced or not?",
        "url": "https://www.reddit.com/r/stocks/comments/m2rs4h/can_you_tell_if_a_stock_is_overpriced_or_not/",
        "created": 1615502874.0
    },
    {
        "author": "Drew_Woodruff",
        "created_utc": 1614796913,
        "id": "lx13n5",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "**Pretext and hypotheticals:**\n\nGameStop goes to +$150 before earnings (No MOASS trigger in this scenario)\n\nGameStop has positive Q4 Earnings (Positive console launches, holiday season)\n\n&gt;From the Q3 earnings report ([https://news.gamestop.com/news-releases/news-release-details/gamestop-reports-third-quarter-results-positive-start-fourth](https://news.gamestop.com/news-releases/news-release-details/gamestop-reports-third-quarter-results-positive-start-fourth))  \n&gt;  \n&gt;\" Due to the uncertainty around the duration and evolving impact of COVID-19, the Company is continuing to suspend guidance, however it expects to realize positive comparable store sales results and profitability in the fiscal fourth quarter**.**  For fiscal November 2020, comparable store sales increased 16.5% and total net sales were $791.1 million compared to $747.6 million in fiscal November 2019. \"  \n&gt;  \n&gt;Also something not mentioned but I think could be relevant ([https://trends.google.com/trends/explore?date=today%205-y&amp;geo=US&amp;q=gamestop%20near%20me](https://trends.google.com/trends/explore?date=today%205-y&amp;geo=US&amp;q=gamestop%20near%20me))  \n&gt;  \n&gt;Google trend for \"gamestop near me\" looks positive for holiday season (you can throw in target, bestbuy, etc for comparibles)\n\nNow, market sentiment and technicals support 100% bullish all things gaming, per continued hypothetical\n\n**What stocks will see the gains in the mad dash towards gaming?**\n\nIll start this retarded discussion by mentioning;\n\n$EA (sports games monopoly)\n\n$ATVI (overwatch porn)\n\n$TTWO (GTA 6 cash cow)\n\n$U (Unity software for VR anime titties)\n\n$RBLX (Kids version of GTA 6, IPO)\n\n$NVDA (all GPUs on GameStop's website still sold out)\n\n$TSLA (When they ever roll out a dedicated GameStop App)\n\n&amp;#x200B;\n\nHonorable mentions while I'm at it - I think golfing stocks ($GOLF $ELY $DS) might be good long holds because golf had an increase in players due to covid (kid in my weekly golf outings says 3x number of highschool tryouts this year) and increase in NBA popularity (nba and golf are hand in hand, plus CHINA DEMAND). If we become rich, we take over the golfing scene. If we don't, hedge funds will always be golfers. Also, NBA Top Shot collectibles (NFT bullshit) are in a crazy demand rn and that just dropped 2-3 months ago.\n\nI am not a financial advisor, I just like the stocks.\n\nDisclosure: I have a couple shares of most of them, but I am 85% in $GME and 10% in AMC (dip, dip, dip-a-delphia)\n\n🚀🚀🚀🚀👨‍🚀💎🙌🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "When GameStonk moons, what stocks will follow the gaming revolution?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx13n5/when_gamestonk_moons_what_stocks_will_follow_the/",
        "created": 1614825713.0
    },
    {
        "author": "ClumsyMedic",
        "created_utc": 1614864098,
        "id": "lxkct3",
        "num_comments": 67,
        "num_crossposts": 0,
        "selftext": "Hey all. I’m a very new trader, since September of 2019. I’ve been lurking a while around and have been investing heavily into tech/ev/clean energy. About half my portfolio are ETFs (some VOO, ARK funds, ICLN, TAN) and the remainder in the the more common MSFT, AMD, NVIDIA, TSLA, NIO, ev charging. I’m getting pretty disheartened about the last couple of weeks. I’m still up 6% from when I started but my ATH was a 32% gain. I trimmed a handful of positions the other day, especially the more volatile stocks and ate the 30%-40% losses. \n\nI’ve been through some of the corrections with I’ll placed deposits, namely in September immediately after I put in 15k just before the dip. And my last deposit was another 15k just before this dip. \n\nI guess I have another question about the outlook of these stocks longer term.  Would an “established” stock that’s overvalued that corrects bounce back to the previous ath levels\n\nSorry for the stressed out post, I know there a lot of them now of days, I just don’t think I could take these extra red days where I’m down 5k a day.\n\nEdit:  thanks for all the replies. It’s keeping my anxiety somewhat at bay. I’ll be holding what I currently have and to clarify, I’ve sold off about 4K work of stock from my 55k invested. I’ve just never experienced this much red before and I’ve been kicking myself as to why I didn’t sell off more earlier. But hindsight is 2020 and I’ve learned some lessons along the way",
        "subreddit": "stocks",
        "title": "Debating just selling everything and going VOO",
        "url": "https://www.reddit.com/r/stocks/comments/lxkct3/debating_just_selling_everything_and_going_voo/",
        "created": 1614892898.0
    },
    {
        "author": "mhong90",
        "created_utc": 1616880962,
        "id": "mena26",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": " \n\n***Current holdings:***\n\n* AAPL - Adding more with dips\n* AMZN\n* Cost\n* GOOGL\n* HD\n* MSFT - Waiting for a bigger dip around 225-230\n* NVDA - Adding if it dips below 500 again.\n* TGT\n\n***Wanting to add or eliminate.***\n\n* NFLX\n* NTDOY\n* SNE\n* LOW\n* DIS\n* AMD\n* FB\n* PYPL\n\n***Looking for advice to diversify more, I literally know nothing about small and medium stocks, need some stocks to look into.***",
        "subreddit": "stocks",
        "title": "Portfolio Advice",
        "url": "https://www.reddit.com/r/stocks/comments/mena26/portfolio_advice/",
        "created": 1616909762.0
    },
    {
        "author": "investingdegenerate",
        "created_utc": 1615168658,
        "id": "m055mx",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "In 10 years we have experienced the rise in tech, ridesharing, ecommerce, AI, EV's and more. Now as one might not know what the next 10 years would hold im curious to know what some of the communities thoughts are. If you were to build a portfolio today, with the goal of growing it over the next 10 years, what would you put in it and how would you subdivide it. \n\n&amp;#x200B;\n\nMy ideas\n\n**Tech-20%**\n\nFAANG\n\nCRM\n\nTQQQ etf\n\nMSFT\n\nPaypal\n\nTwilio\n\nWorkday\n\nARKK\n\n&amp;#x200B;\n\n**Consumer oriented- 15%**\n\nTarget\n\nWalmart\n\nPENN\n\nWYNN\n\nVerizon\n\nAt&amp;t\n\n**Automotive-15%**\n\nFord\n\nGM\n\nTesla\n\n**Finance/Banking- 20%**\n\nGS\n\nCiti\n\nJPM\n\nAXP\n\nVisa\n\nSQ\n\nMA\n\nARKF\n\n**AI-20%**\n\n**Nvidia**\n\n**AMD**\n\nTSM\n\nQcom\n\nCrwd\n\nPLTR\n\nIntel\n\n**The Classics-10%**\n\nCoca-cola\n\nPepisco\n\nAnheuser bush\n\nBA\n\nJohnson and Johnson\n\nPFE\n\nDIS\n\nExon\n\nCVX\n\nBP\n\n&amp;#x200B;\n\nPlease let me know how you would do it or what you would change",
        "subreddit": "investing",
        "title": "Designing a profile from scratch for the long haul",
        "url": "https://www.reddit.com/r/investing/comments/m055mx/designing_a_profile_from_scratch_for_the_long_haul/",
        "created": 1615197458.0
    },
    {
        "author": "mhong90",
        "created_utc": 1616877639,
        "id": "mem6uo",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "I’ve been wanting to get into NVDA for a little while now, the stock a little choppy, what do you guys think is a good entry point? I have only 1 stock at 476 which I kinda regret not buying more at the time.",
        "subreddit": "stocks",
        "title": "NVDA entry point?",
        "url": "https://www.reddit.com/r/stocks/comments/mem6uo/nvda_entry_point/",
        "created": 1616906439.0
    },
    {
        "author": "hdsd99",
        "created_utc": 1615271881,
        "id": "m10qih",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "Hi all, long time lurker here and I've found this subreddit to be tremendously useful!  With the recent tech stock beatdown, here are some of the stocks I am eyeing and looking to buy: \n\n- Corsair (CRSR) : had stellar earnings and they make fantastic products in the gaming and PC hardware space.  They're making good acquisitions in the streaming space.  \n\n- Salesforce (CRM) : another solid company that has taken a big beating for no apparent reason.  They recently acquired Slack and I dont see any other competitor being remotely close in the CRM space. \n\n- Square (SQ): revolutionizing payments for small businesses and making key moves in the crypto space.  \n\n- Cloudflare (NET): yet to turn profitable but a great tech company that is growing rapidly. \n\n- Snowflake (SNOW): another tech company that was overvalued upon IPO and climbed all the way to $429 before being brought back to earth.  Currently trading at  $213\n\n- Costco (COST): solid company that has a loyal following and great business model.  \n\n- Taiwan Semiconductor Manufacturing (TSM): market leader in chip manufacturing and with the current shortage in chips,  their future looks great. \n\n- Teladoc (TDOC): one of the big companies in the telemedicine space that should thrive in the post covid world as more patients want the convenience of seeing their doctor from the comfort of their own home. \n\n- Bristol Myers Squibb (BMY): pharma giant that made key acquisitions recently (Celgene and Myokardia) that should boost their pipeline and revenue.  Also pays good dividend. \n\n- Facebook (FB) : social media giant that isn't going away anytime soon.  Would be interesting to see how they leverage Oculus to boost their revenue.  \n\n- CVS (CVS) : pharmacy giant that should get a boost from covid vaccine rollout and their new in-house clinics. \n\n- Tattooed Chef (TTCF): fast growing company in the plant based protein and healthy frozen foods space.  They have products in almost all major retailers and are rapidly expanding.  \n\n- Nvidia (NVDA): leader in GPU space and a tech giant.  \n\n- Palantir (PLTR): big data company with a revolutionary product that is just getting started.  \n\n- Qualcomm (QCOM): makes chips for phones and are well established for the 5G Era\n\n- American Tower Corp (AMT): they make/ rent out cell signal towers and should benefit from the move to 5G\n\n- Planet13 Holdings (PLNHF): they make giant superstores for Marijuana sale and are set to have their own brand of products \n\nOf course I would also add Apple, Visa, Microsoft, and Amazon if they dipped enough. \n\nWhat stocks did I miss?  Are there any others you would suggest keeping an eye on during the recent sell-off?  Thank you!",
        "subreddit": "StockMarket",
        "title": "Beaten down stocks I am eyeing in this market",
        "url": "https://www.reddit.com/r/StockMarket/comments/m10qih/beaten_down_stocks_i_am_eyeing_in_this_market/",
        "created": 1615300681.0
    },
    {
        "author": "Mr-Pink_",
        "created_utc": 1615972708,
        "id": "m6wdly",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "What Warren Buffet calls the ‘economic moat’ we refer to as ‘competitive advantage’. The term refers to a companies ability to keep competition at bay over the long term life cycle of the business, maintain majority market share and favourable economics. What force is stopping or limiting the competitions capability to compete? What stops the competition from cutting their lunch? A company can have one or more of the five types of economic moats: intangible assets, cost advantage, efficient scale, switching costs, network effect. \n\nHere are Some examples of the economic moats/competitive advantage of some companies (or what I believe to be the moat) :\n\nApple — Apple’s brand power, the belief in its product superiority by consumers and its ability to create a large cult following, allows the company to price its products at double the competitions and still outsell the competition in the market place. \n\nCoca-Cola — The powerful brand behind Coke gives them the ability to demand higher margins and outsell the competition. Coke the brand is directly associated with happiness. Coke is a product where the customer will reject the competitions equivalent at a discount, and buy the Coke product at a premium. \n\nIntel — Intels vertical integration and its operations across the entire supply chain line in the chip sector, gives intel the ability to outdo the competition on every level and hold majority market share. One year intel will focus on chip innovation, the next year it will focus on production innovation and capabilities. Despite fierce competition from AMD and NVIDIA, intel has maintained its market share of the industry.\n\nAmazon.com — Amazon is an operating system for society and daily lives of individuals. It has created a cult following who truly believe Amazon is a necessity of life equal to water, food and oxygen. Some Amazon prime members have and do become suicidal when they lose access to their account. The brand has made itself into an integral part of the day to day lives of individuals, and has made life without Amazon inconceivable for its customers. \n\nFacebook — Facebook takes advantage of network effects, product and brand power. As more people start using Facebook, then more people will be attracted to Facebook because their friends and everyone they know use it, it becomes a social necessity. Facebooks product and brand is so powerful, even its strongest and fiercest critics still use it. \n\n[Economic Moats](https://www.investopedia.com/terms/e/economicmoat.asp)",
        "subreddit": "ValueInvesting",
        "title": "Economic Moats/Competitive Advantage",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/m6wdly/economic_moatscompetitive_advantage/",
        "created": 1616001508.0
    },
    {
        "author": "Visible_Antelope5010",
        "created_utc": 1614701654,
        "id": "lw5odk",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Introducing ... $SOXL. A 3X Bullish ETF of 80% Semiconductors 20% Semiconductor materials chain. Meaning it goes up 3x or down with it’s holdings. \n\n😍Love that leverage since stocks only go ⬆️ \n\nDo you like Semiconductors? Y/N \n\n\\-Are you bullish on NVDA/AMD 🚀🚀🚀 Y/N\n\n\\-Do you think there’s a Semiconductor shortage? Y/N\n\n\\-Do you like 3x Leverage? \n\n\\-Bears🌈🐻say: “ShoRtaGe MeANs     LeSs PrOFitS”\n\n\\-Yes, they might be constrained now, but it’s only a matter of time, Supply vs Demand. Semiconductor manufacturers will raise prices leading to increased profit that scales with inflation! Semiconductors go brrrr 💵 💵 💵 \n\nDo you really want to bet against:\n\n\\-Stimmy?💉💰💰💰\n\n\\-Government (Nat’l Security) interventions?🕵️🕵️‍♂️\n\n\\-Increased cryptomining, gaming, and EV/AI chip usage? 🚀🚀🚀\n\nLook around and see how hard it is to buy a current GPU at MSRP!\n\nSOXL Just split 15:1, this isn’t really technically bullish sign as it moves 3x based off of its holdings, however: calls, covered calls, puts, etc are cheaper for you to play!\n\n(620 —&gt; 41 per share as of today) \n\n...To me; it’s bullish AF, it means more people can play.\n\nFor the retards (like me): \n\nLove the call options on dips- 3x leverage off of 100x leverage from option(s) = Get Tendies or Die Tryin’  🍗 💀 \n\n1 yr return: +105.96% 😍 \n\nHoldings: (80% Semiconductor Manufactures, 20% Semiconductor Equipment)\n\nTop Holdings:\n\nBroadcom Limited, Qualcomm, Intel, Texas Instruments, Nvidia, AMD, Intel, Micron Technology, Taiwan Seminductor, Analog Devices, Applied Material, Lam Research (See Direxion Website)\n\n⚠️Warning ⚠️ : tanks hard on dips but that’s when you buy MOAR calls for insane gains.\n\nSee Posted Positions:Shares @ ATHs &amp; dips (pre split)\n\nCalls @ ATHs &amp; dips \n\n(My Entry: Everyday) - Shares\n\nCalls at dips\n\n📷📷\n\n*Processing img n1vvvtye3nk61...*\n\n*Processing img cw8tg1ze3nk61...*",
        "subreddit": "wallstreetbets",
        "title": "$SOXL 3X Semiconductor play 🚛🚛🚛🔌🔌🔌",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lw5odk/soxl_3x_semiconductor_play/",
        "created": 1614730454.0
    },
    {
        "author": "ryanpaulowenirl",
        "created_utc": 1615371358,
        "id": "m1uekk",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Hedge funds are buying, insiders are buying, they probably have some price reduction due to AMD and Nvidia being so popular and taking away the shine. They are trading at about 12x P/E compared to Nvidia which is 50x and the industry avg which is about 25x there CEO has invented chip tech not just a businessman, also started a company that did really well and got sold to Dell and the Glass Door reviews are also pretty good. There Tangle Lake processer for Quantum Computing also looks interesting.",
        "subreddit": "stocks",
        "title": "Is Intel INTC undervalued?",
        "url": "https://www.reddit.com/r/stocks/comments/m1uekk/is_intel_intc_undervalued/",
        "created": 1615400158.0
    },
    {
        "author": "omniron",
        "created_utc": 1615257835,
        "id": "m0wvvb",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Nvidia YOLO + GME put over the past month",
        "url": "https://www.reddit.com/gallery/m0wvvb",
        "created": 1615286635.0
    },
    {
        "author": "learner4f",
        "created_utc": 1617095589,
        "id": "mgbtqd",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "It's official - ARKX is available for trading today (3/30/2021).\n\nHere is the top 20 holdings in ARKX (sorted from largest weight to smallest weight):\n\nCompany Ticker Weight(%) Shares Market Value($)\n\nTRIMBLE INC TRMB 8.47 1156 $86,353.20\n\nTHE 3D PRINTING ETF PRNT UF 6.1 1636 $62,168.00\n\nKRATOS DEFENSE &amp; SECURITY KTOS 5.62 2203 $57,322.06\n\nL3HARRIS TECHNOLOGIES INC LHX 4.97 255 $50,729.70\n\n[JD.COM](https://jd.com/) INC-ADR JD 4.91 610 $50,062.70\n\nKOMATSU LTD 6301 JT 4.56 1547 $46,545.40\n\nLOCKHEED MARTIN CORP LMT 4.47 125 $45,588.75\n\nIRIDIUM COMMUNICATIONS INC IRDM 4.23 1132 $43,163.16\n\nTHALES SA HO FP 3.9 407 $39,789.41\n\nBOEING CO/THE BA 3.48 145 $35,506.15\n\nNVIDIA CORP NVDA 3.32 66 $33,895.62\n\nSPIRIT AEROSYSTEMS HOLD-CL A SPR 3.26 687 $33,209.58\n\nDEERE &amp; CO DE 3.18 87 $32,389.23\n\n[AMAZON.COM](https://amazon.com/) INC AMZN 2.99 10 $30,520.30\n\nTERADYNE INC TER 2.74 235 $27,969.70\n\nALPHABET INC-CL C GOOG 2.59 13 $26,462.15\n\nDASSAULT SYSTEMES SE DSY 2.55 121 $26,035.27\n\nTELEDYNE TECHNOLOGIES INC TDY 2.55 65 $26,050.70\n\nGARMIN LTD GRMN 2.01 160 $20,539.20\n\nVIRGIN GALACTIC HOLDINGS INC SPCE 1.95 672 $19,884.48\n\n \n\nI can't post the entire list because it might contain \"forbidden\" tickers, and mods will delete this post.\n\nFor the entire list and more info, you can search for \"ARK Space Exploration ETF (ARKX) - Holdings Reveal\" on youtube ( sorry, mods keep deleting my post because of youtube link).\n\nHopefully, the information here will be useful to everyone.",
        "subreddit": "stocks",
        "title": "ARK Space Exploration ETF (ARKX) - Holdings Reveal",
        "url": "https://www.reddit.com/r/stocks/comments/mgbtqd/ark_space_exploration_etf_arkx_holdings_reveal/",
        "created": 1617124389.0
    },
    {
        "author": "eddyjqt5",
        "created_utc": 1615484402,
        "id": "m2vxyl",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "Hi guys today I'd like to direct your attention to Roku Inc. This stock is famously one of Cathie Woods top holdings, representing 5.97% of ARKK and 3.9% of ARKW, the third and fifth largest holdings respectively. Recently it has taken a beating and has dipped from its high of $487 down to its current price of $353. It had a historical high of $53B market cap that has now dropped down to $45B. Many people rightly regard many of ARK funds holdings cautiously with good reason- they're highly overvalued and present a lot of risk to investors who fear they may be buying at the top. With the recent downturn in prices, I think it's a good time to see if ROKU is still overvalued.\n\n\n**The Business**\n\nFor those who are unfamiliar Roku is a brand of hardware media player that integrates content apps such as Netflix, Hulu, Disney+ etc into one platform. Roku delivers its hardware in two forms: streaming devices and licensing its operating system to smart TV manufacturers. \n\nStreaming devices\n\nRoku has 5 streaming devices that are available to date. Streaming devices can be attached to the side of your television to deliver the Roku platform. Competitors include Google Chromecast, Amazing Fire stick, Nvidia Shield, Apple TV\n\nROKU Express - 40$. Your standard Roku box that can be hooked up to your TV with an HDMI cable\nROKU Premiere - $45 Just the ROKU Express but with HD\nROKU Streaming Stick - $70. This is a wireless version of the ROKU Premiere. \nROKU Ultra - $100. This is the most high quality, premium product line and basically the Premiere but even better with 4K . \nROKU Streambar - $130 Roku Ultra but with a sound system included. \n\nROKU TVs\n\nRoku licenses its software platform to television manufacturers so they can integrate them into their smart TVs. TV manufacturers get a cheap deal that allows them to create a better product without having to hire a team of developers to create their own platform from the ground up, and ROKU can gain more product adoption and users as fast as possible. \n\nCurrently it is no exaggeration to say that ROKU is dominating the smart TV field. It is the number one smart TV platform and is integrated into approximately 40% of smart TVs sold in the USA and 31% in Canada. Roku has long term deals with all of the major TV manufacturers: Sharp, Hisense, Sky, Sanyo, TCL, etc. Their competitors in this space include Samsung who developed their own OS Tizon, LGs webOS, and the Android OS. \n\nIn the long term, there is no doubt that consumers are shifting away from cable TV and towards streaming and Roku is a streaming company well poised to take market control here. Many older audiences who consume media are confused by how streaming works and aren't the best at navigating a Google Chromecast or Apple TV cast device. Roku is one the most intuitive product that allows this demographic to seamlessly transition into the internet streaming age. I believe this is one of their biggest differentiators as their UI/UX is extremely easy and efficient to use, and just in my anecdotal experience there's always some technical problem with other products that I never run into with ROKU. \n\nAs of EOY 2020 Roku had 51 million active users- compare that with other streaming companies such as Netflix (204M), Amazon (150M), Disney+(87M), Hulu (39M). Their cheap ROKU streaming products and ROKU smart TV's are highly accessible and easy to set up making customer acquisition rates grow at 40%+ YOY. Their strategy is generally selling cheap products upfront to get these customers onboard, then monetize them after. This will continue as ROKU expands further into Mexico and Brazil this year. \n\n\n**Revenue Streams**\n\nRoku has two revenue streams: Player and Platform revenue. \n\nPlayer revenue is the proceeds Roku receives from selling its Roku devices. This is the lower margin and lower revenue generating revenue stream. \n\n2020 Player revenue: 510M, up 30% YOY. \n\nPlatform revenue is the proceeds Roku receives from advertising, licensing, and subscriptions. This makes up the bulk of Rokus revenue streams and has very low cost of revenue. It's effectively how well Roku can monetize its user base- and Roku has done impressively well in this regard. \n\nKey Metric: Average revenue per user \n2020 ARPU 28.76 (24%)\n2019 ARPU 23.14 (29%)\n2018 ARPU 17.95 (30%)\n2017 ARPU 13.78 (76%)\n2016 ARPU 7.83 \n\nWhile Netflix averaged $13.32 revenue per user in 2020 Roku has averaged $28.76 per user. Roku is able to accomplishes their great ARPU mainly through their best in class advertising options. Roku has an impressive mix of advertising options that maintain a non-invasive experience for the customer while providing tons of value for the marketer. Roku's advertising options include:\n\nFor advertisers and marketers\n\n* OneView Ad management: This is Roku's native, built in, integrated platform for demand side marketers. Roku feels that there is an increasing desire for self-serve flexibility from marketers, and OneView is the perfect product for that. OneView is a self-serve option for marketers who would like to purchase ads on Roku and integrates all of Roku's data available for marketers to use at their disposal. Previously Roku acquired Dataxu DSP and integrated it into OneView, allowing OneView to be even more efficient at obtaining and filtering the data marketers want. \n\n* Brand Experiences: Basically this allows companies to purchase space on Roku's home screen to push their product. Example would be below where Microsoft not only advertised their Surface laptop but also offered a free movie rental. \n\nhttps://imgur.com/a/mrRoWs1\n\nFor content creators and publishers:\n\n* Homescreen Ads: allows purchases of space on the home screen directly to push shows. \n\n* Screensaver ads: Roku has a screensaver that turns on when you leave your device untouched for too long. Companies can purchase screensaver space to advertise\n\n* Video ads when users watch the free Roku channel (can purchase either 15 seconds or 30 seconds)\n\n* Primetime Ads: Allows companies to purchase slots on Roku home page for their shows at peak streaming hours. \n\nHere is an example of Disney pushing their new movie \"Soul\" by purchasing ad space\n\nhttps://imgur.com/gallery/EZAjBCo\n\nIn March 2021 Roku also announced it is expanding its partnership with Nielsen, as Roku will acquire Nielsens Advanced video advertising (AVA) business. This includes video automatic content recognition, ad content measurement tech, and dynamic ad insertion tech. This will be huge for ROKU as it will now be able to integrate the Nielsen \"always on\" digital ad ratings into its OneView platform for marketers. \n\nIt is important to note here that Roku will only show advertisements to users if they are watching from the Roku channel. If users are watching Netflix or any of the other third party app such as Hulu they will not view advertisements. Again, Roku stresses a non-invasive advertising strategy for its users. \n\n**Financials and Valuation**\n\n*Income Statement*\n\nRoku is posting another unprofitable year while they attempt to expand as much as possible, although 2020 was very nearly a break-even year with net 17M in losses. Q3 and Q4 for Roku this year were profitable, and I personally expect ROKU to be break profit overall for 2021. Roku's weakest quarters historically are the first two of the year with sales and profit picking up in Q3 and Q4, and Roku guidance points towards that trend continuing for the 2021 year. \n\nRoku offered guidance for the Q1 2021 with 51% YOY increase to $485M and EBITDA of $31M. Overall, Q1 is expected to be unprofitable as usual for Roku, as it is their weakest quarter historically. There is an estimated $40M in stock based compensation in Q1 as well as $10M in depreciation, and management has estimated net income at roughly $(20M). This is still a large improvement YOY from the $(55M) from Q1 2020. \n\n\n*Balance Sheet*\n\nCurrent Ratio sits at 2.5 so Roku is safely able to continue operating without a problem for the near future. \n\nTheir largest liability is \"accrued liabilities\" which increased 75% YOY. This is largely due to the fact that Roku has been acquiring rights to stream content for free on their ROKU channel and has doubled their payments due to content publishers. Their marketing accrued liabilities increase 6 fold as they attempt to expand even further, and the lease payments for a new office doubled as they expanded their facilities. Aside from this their debt remains in line with the 2019 year with no other notable debts. \n\n*Cash Flow*\n\nRoku has 1.1B in cash however was only able to increase net cash by 140M through operating activities- vast majority of its cash is raised via financing another round in May 2020. There is continued risk of share dilution here. \n\n*DCF*\n\nVery basic construction of DCF here, forecasted out 5 years with a WACC of 10 and perpetuity growth rate of 3%. Revenues growing at 45% down to 38%. Net profit margin projected to be 5% in 2021 up to 15% in 2025. Ultimately yielded approximately $105B in total value, $722 per share (assuming no more share dilution). Again, it was a just a back of the napkin DCF so there was no sensitivity tables or even de-levering FCF etc. \n\nI believe that this is in line with ROKU's potential to become a 90 billion market cap company. \n\n*Multiples Valuation*\n\nEV/Revenue multiple\n\nRoku EV = 44,642,527,000\nEV/Revenue = 25.12\n\nThe deal with Roku is that its competitors are large players- Google, Amazon, Nvidia, Apple, and Netflix. Of these, we can only reliably compare Roku multiples with Netflix as its too difficult to reliably separate the streaming segments out of the other companies financials. \n\nNetflix EV= 304B\nNetflix EV/Revenue= 12.16\n\nAs you can see, despite Netflix carrying loads of debt Netflix still has the more reasonable valuation. There is continued risk here that ROKU is overvalued. \n\n\n**The Bull case**\n\nRoku continues its growth as outlined in my DCF of 45% down to 30% in the next 7 years. I believe this is entirely possible as Rokus platform revenue is growing at a 70% rate and should only increase as their ARPU increases. \n\nRoku has an insane ARPU compared to other companies. While Netflix may have 4 times the users, it has far slower growth in ARPU as the business model doesn't allow for much monetization. Reed Hastings in January 2021 reiterated that Netflix will not monetize its users any further by offering advertising options because it would be too difficult to compete with the big players in advertisement (Google/Amazon/Facebook). \n\nRoku has proven Netflix wrong in this area for certain. The bull case is Roku continues to grow its ARPU- giving extremely conservative estimates of growing at 12% per year ARPU could level off in 3 years at $40. \n\nAs Roku expands its user base further globally the ARPU could potentially even have years where it contracts after that. However, I won't say that I can confidently give any bull case regarding international expansion as no guidance was offered in the reports or conference calls. \n\nROKU has also been acquiring more and more content rights to add to the ROKU Channel. Roku recently acquired rights to Quibi and stated in the conference call that they will continue the trend in the future. \n\n**Bear Case**\n\nAt this point insolvency in the foreseeable future is too unlikely to be considered for Roku. However, there absolutely is a future where growth may slow down after COVID as peoples lives return to normalcy more. COVID provided many growth opportunities for Roku with people staying at home all day, and as that tapers off there is a chance growth will as well. \n\nRoku is still overvalued at a 25x revenue multiple. It's not as expensive as PLTR or SNOW, but just purely by revenue multiples it's more overvalued than Tesla at any point in 2020. \n\n**Conclusion**\n\nYou can draw your own conclusion from the information I've laid out, but I believe Roku is a great pickup right now. \n\nRoku's greatest strength is its focus on monetizing its users and the plethora of advertising options available for advertisers. It's $28 ARPU beats out Facebook, Netflix, Pinterest, and many other companies by far. Granted it does not have the international reach of those companies which should bring the ARPU down, but even comparing their US audience ARPU Roku blows surpasses many other advertisement based businesses. \n\nIt's recent partnership with Nielsen is fantastic for advertisers and should give them more tools at their disposal. I believe that the market that Roku operates in will only grow, as cable cutting continues, and that out of all its competitors Roku has the best offerings for advertisers.",
        "subreddit": "stocks",
        "title": "Taking Another Look at ROKU",
        "url": "https://www.reddit.com/r/stocks/comments/m2vxyl/taking_another_look_at_roku/",
        "created": 1615513202.0
    },
    {
        "author": "third_legatron",
        "created_utc": 1617164440,
        "id": "mgxzem",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "I have found that the newer traders are the ones that are getting hit hardest the most. I understand why, I've been into stocks for years at this point, and many laughed at my picks in may because I didn't dabble in many of the high flyers or \"meme stocks.\" \n\nWhile I did miss out on gains because of my risk tolerance, instead I have solidified a solid growth and value portfolio that has worked for me throughout covid and even before. Many of the people that make a lot of money quickly in the market, underestimate the difficulty that it actually takes when the market inevitably calms down. This past year was a result of market euphoria and an astronomical amount of greed, which left many who had unrealized gains, with unrealized losses, and they are confused about what to do. \n\nWhen I first started investing, I have seen this scenario and I fell prey a bit. An example that comes to my mind was W.A.TT, a zombie company who spiked to 20$ only to be a worthless stock now. I cut my losses early, but it was lucky I did, because I wasn't knowledgeable to even know why I bought it aside from the point it was vertical. \n\nAfter that, I got smarter and bought nvidia, for around $200 a share, and then when at the end of 2018, the market sputtered and nvidia corrected heavily due to the nature of it's sector. I unknowingly screwed myself out of future gains because I didn't know the financials and didn't read enough, and I bought the RIGHT company, for the wrong reason. I sold for a loss. If I had held that, (and my other speculative, GREAT, buys, my portfolio would've tripled in 3 years. But I didn't understand why the stocks move downward. \n\nThis is long and I apologise, but by doing the wrong things, it's led me to doing the right things, and my portfolio is calm and gaining through covid and through this rotation. When it comes to individual stock picking, you have to treat it like a job and read. Read everything you can. When it comes to market sentiment, it should almost be irrelevant. All stocks will go down, but if you hold stocks that you know won't stay down, you're stress levels will not be as high as someone who jumped into something with no entry or exit strategy. \n\nI will say that this isn't necessarily a guide and I won't give any specifics on how much of anything you should have, but understanding what should be present in a solid, safer growth/value portfolio to avoid losing large chunks of money during cyclical swings and market moves. Losing money is unavoidable in the market at some point, but being in a position to where it won't destroy confidence or your portfolio, is avoidable, and with work very achievable. \n\nA solid base for a portfolio is necessary, and I would say it should almost always include dividend stocks that you are willing to go long on. Safety should be majority of your portfolio, the big blue chips are boring, but they are your anchors, and will let your portfolio breathe naturally on down and up days and mitigate large swings. If youre like me and choose to use margin for leverage, dividends pay for your margin interest as well, but I don't recommend margin to people as it involves larger risk in general. \n\nThe next part Is what helped me during covid so much, you look ahead and start to think of things as a contrarian, and realize that not all of your picks are correct, and you may need to adjust accordingly based on fundamentals. NEVER get attached to a stock, sometimes if you get gains on a speculative pick, you should take them, especially based on the market in late 2020. The rotation was written on the wall. \n\nBanks are safe havens as well, but more fickle, I own many banks but for me, I would not open positions on them now, I have however , since I've owned them, averaged up, which lowers my overall gains, but leaves me with much more room to fall before I have to potentially adjust the position, IF, the fall in price is a reflection of fundamentals.\n\nValue stocks are getting less valuable. When you're building a portfolio, knowing how to find and assess value is important and ultimately up to the individual. A simple thing I do, which many may not agree is, I pick 3 stocks, one risky, one safe, and one moderate. I'll use the examples respectively, beyond meat (risk) , simply good foods (moderate) and kraft heinz. They all are completely different companies with vastly different markets I understand, but they all expose to food space with different amounts is risk in a sector. Now kraft may be a great base to my portfolio, but do I need less risk? Or is my dividend and safety base at a level where I am comfortable? Then I'd evaluate my overall portfolio risk tolerance and see if first of all, any of my picks should even be in my portfolio, and I usually will try and think and discover reasons why they don't, rather than why they should. \n\nTech is something I do not like exposure to majority of the time, i keep it under 10%. But many great growth stocks are tech, but patience and cash are the next part of a portfolio, holding a cash position is important for being able to patiently wait and open riskier positions at a safer price, which in the cyclical nature of say, semiconductors (currently relative), can be hard. Opening a position in a good, healthy TECH, company all at once is not the best move in my opinion. Opening a position with the view that it may go down and will give you exposure and potential to average down, is a good mindset. Tech is a fickle industry and cyclical, and earnings are less important than guidance, unless the market is the way it is now, in which value is stealing the spotlight, imo, providing cheaper/ish entries to tech. \n\nOil will always provide dividends, and by their nature will let you average down. Oil especially, as a regulated business due to opec, you are at the mercy of a business that is not really traded on the free market. Supply and demand will sometimes get so out of synch and provide good buying opportunities. I bought oil early, in may, halliburton , exxon suncor and devon. Contrarian plays last year, but this year's quick in and out fad. It took patience, but I cashed out quite nicely, and still hold some for the dividends. \n\nIndustrials, deserve a part in anyone's portfolio. It goes without saying that this should be a decent chunk of your portfolio, they are cyclical ny nature and may swing based on office encumbants and world issues, but they are the backbone of the world and when you can pick a convicted and tried and true winner, can be of great value and safe , long term growth. \n\nCommodities are commodities and always should have some exposure, these are stocks that I tend to adjust the most, as they face fundamental changes often and are subject to world trade/trends sometimes (clothing). When it comes to food, I tend to pick safer, dividend oriented companies, I try to pick these up only if I see them with great value attached, near all time highs, I tend to wait and watch. \n\nMining stocks are good to go right now, but they are a bit risky, ones with dividends and in relation to precious metals may see a bit of a boom, but that is honestly and industry I don't dabble in much, I have my picks, but due diligence and understanding how they make money is important.\n\nIn my opinion, risk is for chumps, anything over 3% of your portfolio in gamblingesque stocks, is a bit more fugazzi than it is fun, and can lead to impulsive moves of you don't regulate your mindset. Also, this is about portfolios and for newer people who may have had a hard time with this VERY SMALL market move that somehow ruined people's portfolios. Limited risk does not mean limited gain. Unless your a trader. And I'm not, so I'm boring. But I make money, I hope any of this helps. Went on a bit long but I wanted to get into some sectors that have really helped me since before covid, and throughout as well since I was able to recognize the bargains in price. \n\nThe more you watch the numbers, the better you understand the numbers. But don't watch them everyday, or you can become paranoid, be convicted, do research, and whenever buying anything, that behind the stock, it has fundamental value. Even growth stocks that get slashed in half SOMETIMES can be good holds, but you must be prepared to adjust of you're not right. Knowledge is power, and knowledge will keep your money busy.",
        "subreddit": "stocks",
        "title": "Building a long portfolio for newer investors and understanding individual sectors.",
        "url": "https://www.reddit.com/r/stocks/comments/mgxzem/building_a_long_portfolio_for_newer_investors_and/",
        "created": 1617193240.0
    },
    {
        "author": "EchoWxlf",
        "created_utc": 1615749578,
        "id": "m51y2d",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Dear Member,   \nHello fellow degenerate gambler! May I introduce you to the Pretty Decent Crew's newsletter for the trading week ending on March 19th? \n\nFirst things first, I'm going to keep using the sorta-kinda-gold-but-on-a-computer and banned tickers as recommendations because they make money. If you don't like it, find a different newsletter and I'll keep napping on my piles of virtual cash sitting in my SPAC bed. This is my return from ban by WSB for it and most of those degenerates are better at making memes than they are at investing so I guess I kind of had it coming. Sooooo here we go again! \n\nWe're going to pick up right where we left off with some serious consideration of the wants/needs of people who are leaving the pandemic lockdown with hopes and aspirations of having a good time again. We got Carnival Cruise lines for a smash hit a few weeks back and we're going to find more (full disclosure: I'm definitely going to play them again). Our other acknowledgement is that virtual cash is tearing right now. That isn't going to stop. Grab a ticket for the tendie train and ride it until the wheels fall off. If you're not in already, just get what you can. Imagine you're buying and holding a super special magic version of SPY shares.   \nCRWD - 3/19 $220c  \nMy weekly pick is going to be CRWD. They've had a terrible week/month and are sitting $53 under their 52-week high. They've been wildly successful at beating earnings and continuing to improve their per/share outcomes. Here is the deal, everybody loves a good ramp up to earnings report, but the earning report itself could screw everything up. My take is this: the stimmy is getting delivered and they're going to beat earnings while trading at \\~80% of ATH. Will it return to ATH? Doubtful. It will more than likely take a serious upturn and hopefully push for $220. I'm going to grab the $220c for 3/19 and hopefully dump within a day. Maybe before the earnings even deliver...   \nCCL - 7/16 $40c  \nI have to do it. The goal is open season for ALL adults in the US by May 1st. Give that 4 weeks and we're looking summer travel dead in the eyes. We all know your redneck cousins in Nebraska are excited to get back on a boat for fake vacations to the carribean. They've got Facebook posts to catch up on. I'm looking at the July 16th $40c for movement back to $10 under their pre-pandemic numbers ($30 under ATH). As always, do NOT hold these when you hit your profit goal %. Dump that   \nNVDA - 5/21 $610c  \nHere is the wild card for you. Nvidia is trading at $100 under ATH and their progress as a companies shows absolutely no signs of slowing down at all. Given the landscape, they've had a terrible month, but the company is not only solid, but they're increasing demand with the need for GPUs related to mining. The 5/21 date is paired along with the earnings report that will happen then. We all know they're going to produce an insane amount of profit and when that hits, we're going to cash in big time.   \nSNDL - 3/19 $1.5p  \nIf you're a real degenerate gambler looking to get yourself high blood pressure, play this one with me. Sundial Growers delivers earnings after close on Wednesday. We all know the future legalization of marijuana is going to make them a huge company, but right now they're trash and we all know it. They're the penny stock of weed companies. They've had a GREAT week leading up to earnings. I'm going to wait until the end of the day Tuesday or Wednesday to watch it go up more. When it hits $1.50+, I'm going to grab some puts. Here is the delicate part: it doesn't move much at all in comparison to those option prices. So what we're going to do is grab $1.50 puts for 3/19 that are already almost ITM. Then hold those babies when they flop on earnings. Full disclosure: this is an absolutely STUPID play, but it's going to be hilarious if it works.   \nGood luck this week! May the power of J-Pow be with you in Tendie Land.   \nSincerely,   \nLehman Brothers' Risk Management Department ",
        "subreddit": "wallstreetbets",
        "title": "The Return of Reliable Mediocrity - Uncertainty You Can Trust",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m51y2d/the_return_of_reliable_mediocrity_uncertainty_you/",
        "created": 1615778378.0
    },
    {
        "author": "ABAPatil",
        "created_utc": 1614846422,
        "id": "lxfzv8",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Though NVDA had amazing quarter and PT is $700. I didn't see yield is going to affect that much. Look at the GOOGL stock, its not moving below 2k, but NVDA still taking toll in spite of industry need chip supply. Can't think through the logic of going way down. \n\nI bough NVDA calls at 78 and now they are selling at 50ish. I don't know whether I should hold them or sell. What do you guys think?",
        "subreddit": "options",
        "title": "Holding NVDA Dec call and down 30%",
        "url": "https://www.reddit.com/r/options/comments/lxfzv8/holding_nvda_dec_call_and_down_30/",
        "created": 1614875222.0
    },
    {
        "author": "NrdRage",
        "created_utc": 1617230138,
        "id": "mhhj5q",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "# Precursor:  Note I have this flaired as \"discussion\".  It means just that.  This is really more of a ghetto ass megathread to talk about infinite money plays to avoid having to actually work the jobs spending the infinite money.  Add your 2 cents.\n\n# \n\nHello, Vault dweller!  I see you're here because you watched a speech from Sleepy about spending 2 trillion dollars on infrastructure, and you want to turn that into tendies.  I happen to have the flow chart for his plan in front of me, and am happy to walk you through on how you could theoretically play this on the market so you can stop being a cog in the machine and get off the hamster wheel, which is exactly what these types of bills aim to prevent you from doing because they need your blood.  Keep in mind that this discussion is based solely on the odd belief that a bunch of other politicians are going to come together and agree to spend all this money, so this is pretty much theorycraft.\n\n&amp;#x200B;\n\n# First, we have 620 billion for transportation, of which 115bln will be for the shit we drive on (freeways, bridges, etc.) and 20,000 miles of road.\n\n&amp;#x200B;\n\n**Likelihood of passing:  Actually fairly high as a line item.**  It's been proven time and again that there's no better stimulus to a faltering economy (even if it's faltering as a result of us shooting ourselves in the foot then crying about a crime) than a large public works project.  And this is one of those things everybody can get behind.\n\n&amp;#x200B;\n\nYour plays here are going to be industrials like **$CAT**, who will make the bulldozers, **$CMI** (or **$CUM** for you Europoors), who will make the engines, and even **$X**, who will sell a lot of steel.  Also don't sdleep on **$DE**, who doesn't make the construction equipment, but still has products that stand to benefit from large public works projects.  Of these, **$CAT** is by far the strongest play here, and I've been talking them up for a while now.  But don't sleep on plays like **$NUE**, which has a lot of room to run, and **$ETN**, a Boomer stonk that is near its highs, but will not only come to the trough for a lot of integration contracts, but recently bought up an EV charging company.  There's an outfit out there called **$BIPC** that most of you have probably never heard of, but don't be surprised to see this thing touch the triple digits if it looks like there's appetite to pass this spend on infrastructure.  \n\n&amp;#x200B;\n\n**Disclaimers:**  I'm long $CAT and $NUE in my fun money account, and $CMI in my managed portfolio.\n\n&amp;#x200B;\n\n# Further within that 620bln is 85bln for public transportation\n\n&amp;#x200B;\n\nThis one is harder to peg, because Sleepy still thinks horses and carriages are a thing.  But he seems to want to divert most of that money towards rail, and then send what's left to individual metropoli to enhance their public transport sector.  The former is easy - invest in steel, **$CSX**, and for a stealthy Boomer play, **$PCAR**.  The latter is trickier.  Sleepy made much ado about clean energy, but you have to read between the lines to find the companies that stand to benefit from this.  Your surefire winners in this space are going to be **$QS** and **$PLUG**, and **$CHPT**.  **$FCEL** has a seat at this table, as well.  Maybe an argument could be made for **BLDP**, and I'm sure there are a billion others - feel free to discuss below.  A stealth play with a LOT of runway as a result of a recent beatdown will be **$WKHS** and, if you think this is going to pass, you should absolutely buy some.  But, dear reader, I posit to you a better stealth play, courtesy of the Los Angeles public transit authority (and, if you're a longtime reader, you'll know I've been talking this one up for quite some time):  **$CLNE**.  Renewable nat gas to power any system that needs better capabilities than electric can provide and with a lower curve towards adoption.  There are going to be a lot of companies fighting over who gets to make the bus or the battery, but relatively few companies are in the running for who's going to provide the energy.\n\n&amp;#x200B;\n\n**Disclaimers:**  Long $PLUG, $WKHS, and $CLNE.  \n\n# 174bln in EV tax credits\n\n**Likelihood of passing:** I'm actually not optimistic.  There are reasons there are limits to the tax credits given out, and it will be easy for fiscal conservatives to state that it's not fair that Joe the Plumber has to subsidize NrdRage's $100,000 sports sedan just because it uses grid energy.  You can get bylines and votes by speaking out against this.  (And, to be fair, I think it's stupid that I can get the taxpayers to help pay for my toys - but I absolutely make you do it if it's allowed).\n\n\\-Aka \"Elon once again has convinced the government to hand him stacks of taxpayer money\".  **$TSLA** is the far and away winner here in the short term.  But if this happens, expect **$VWAGY** and **$F** to race to get their hands on that cash.  And don't sleep on **Lewcid Motors** here.\n\n\\-500,000 charging stations by 2030 is the stated goal.   **$BLNK** and **$CHPT** are your obvious plays here, but there's a little known company called **Beam Global** running around out there (you'll have to find the ticker symbol on your own because reasons) that, if this line item gets passed, you can expect to be able to speak about freely here.  They would be a tricky play, because the moment their shit started going parabolic, they would dilute (don't say I didn't warn you!), but there's money to be made there if this becomes a thing.\n\n&amp;#x200B;\n\n**Disclaimers:**  At any given point, I can be in almost any of these.\n\n&amp;#x200B;\n\n# 180bln to upgrade labs and research facilities at colleges and government campuses\n\n&amp;#x200B;\n\n**Likelihood of passing:**  Incredibly low, at least at these numbers.  The fact that Sleepy wants to divert some of this money in his INFRASTRUCTURE plan that have nothing to do with INFRASTRUCTURE (including 30 billion dollars to \"address gender and racial inequality\") basically signals this line item is being included as a negotiating chip to give up in order to win a vote or two.\n\n&amp;#x200B;\n\nThe one (and ONLY) interesting play I see here from this that could get some bipartisan support comes in the form of a stonk I talked about a few weeks ago, and would bigly benefit from any spend in this space to upgrade facilities:  **$BE.**  The research labs at places like Cal Tech have been relying entirely upon **$BE's** servers for years now, thanks to California's bullshit grid, and are basically a proof of function for every other lab and facility in the country that doesn't want to rely on a severely outdated grid to provide reliable power.  Given that one of the only things about this proposal that everybody is going to get behind is the need to update our power infrastructure, don't be surprised to see a fairly good chunk of money get carved out for the purposes of making research facilities grid independent.\n\n**Disclaimer:**  Long $BE and was actually a seed investor for just this reason\n\n&amp;#x200B;\n\n# 300bln for manufacturing\n\n**Likelihood of passing:**  For most of it?  Not a fucking chance.   They want to give 50bln to the National Science Foundation, 50bln to the Department of Commerce, and 50bln to studies.  There's no way.  But tucked away in here is something interesting:  50bln in incentives to semiconductor companies to build fab infrastructure.  The lobbyists for everybody from the automakers to the defense industry right to the gaming hardware companies will want to buy votes for that.\n\n&amp;#x200B;\n\nThere are a lot of interesting plays here, and you should absolutely read my DD on commodity semiconductors for a much more in depth talk about that and why only certain ones should be looked at for this play.  What I'll lead with is this:  There are reasons why the smart money has been absolutely PILING IN to commodity chip companies the last week.  Matter of fact**, $MU** just crossed $90 and is now worth more than **$AMD** as of this afternoon.  $ON is still my far-and-away best in breed, and that thing has made a lot of us a ton of money.  **$INTC t**hreatens to build a fab plant in Arizona every couple of years and never does, but if the government gave them cash, that might tip them over the edge.  **$AMAT** is a good sneaky play and, if you can afford it, **$LRCX** is going to get a cut of that.  The TL:DR here is you should definitely have semis in your portfolio, but not Theta Semiconductor **$TSM.**\n\n&amp;#x200B;\n\n**Position Disclaimers:**  Long $AMD, $ON, $NVDA\n\n&amp;#x200B;\n\n# 120bln for electrical grid improvements\n\n**Likelihood of passing:**  Let's be honest, this will get kicked down the road again.  A lot of this money is actually in the form of tax credits to entice companies to move to renewable energy generation and storage.  If any of this money gets doled out, expect **$TSLA** and **$BE** to receive a large amount of this money, as well as **$ETN** as the leader in how to integrate these various systems.  BUT, if it happens, a great stealth play is going to be **$PWR**.  If by some miracle this money is allocated, don't be surprised to see these dudes in the 120's just off froth.\n\n&amp;#x200B;\n\nLong $TSLA and $BE\n\n# Unknown $$$ to replace lead pipes for clean water\n\n**Likelihood of passing:**  Almost nil.  That's a chopping block item that will get passed down to local municipalities to deal with (or, more accurately, not).  Further, I've got no expertise in the clean water space, so have no companies to recommend other than the requisite heavy machinery needed to dig, trench, and replace (so **$CAT** and, to a lesser extent**, $DE**).  If anybody has expertise here, please speak up and if you make a compelling case, I'll copy-pasta you into this space and give you the credit for the knowledge.\n\n&amp;#x200B;\n\n# 100bln for broadband infrastructure\n\n&amp;#x200B;\n\n**Likelihood of passing:**  Oh, you can bet every lobbyist affected from **$LUMN** to **$CSMCA** to **$TMUS** (thanks to buying Sprint's trunks) will be buying those votes.  Getting paid for the privilege to gouge the consumer?  They'll be all about this.  But more importantly, this again talks about the importance of having a semiconductor in your portfolio, because all the 5G rollout as a result of this will fall directly to these guys.  See above for my thoughts on semis.\n\n**Position Disclaimers:**  Pretty sure I'm not in any of the highlighted companies; see above for the semis.\n\n# 300bln to build affordable homes, public housing, etc.\n\n&amp;#x200B;\n\n**Likelihood of passing:**  Never in a million years.  Not even worth discussing.  Same goes for the 100bln to go to schools and childcare facilities.  And ESPECIALLY the 500bln to pay for disabled/elder care, which is a pure pork item.  If you're going to play this fairy tale, **$URI** and a company called **$TEX** (they make the Genie lifts) would be profitable\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nThe rest of his plan centers around taxes.  He specifically called $AMZN to the mat.  You know what Wall Street thinks about taxes.\n\n&amp;#x200B;\n\nAll my love,\n\n&amp;#x200B;\n\n\\-Chad Dickens",
        "subreddit": "wallstreetbets",
        "title": "Wait, you actually BELIEVED Sleepy? Um. OK, wow is life about to fuck you good. But sure, let's play along. A playbook on how to play Sleepy's infrasatructure plan.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhhj5q/wait_you_actually_believed_sleepy_um_ok_wow_is/",
        "created": 1617258938.0
    },
    {
        "author": "I_Like_Tech_Drawings",
        "created_utc": 1615244542,
        "id": "m0snbw",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "The more I think about it the stranger it seems. Big funds rotating from Tech/Growth to consumer? Ok fine. I guess. BUT... Those of you who were around the \"other\" reddit sub this time last year knew what the popular pumped/memed stocks were. Correct me if I'm wrong: MSFT, AAPL, AMD, NVDA, TSLA.... AND.... the comically absurd one people may also remember, SPCE (Virgin Galactic. Go ahead and look at the 6 month SPCE chart and tell me it isn't shockingly similar to the aforementioned tech stocks (Yes I know TSLA isn't tech, which bolsters my point even further) )... The question is... Are the 9 million users strong dumping their previous \"Meme\" holdings to put into GME? \nIf you are someone who has specifically sold your positions in the aforementioned stocks to buy GME, would you please leave a comment? Would love to see if my hypothesis holds true at all. Thank you.",
        "subreddit": "stocks",
        "title": "I think I just realized something. Is tech crashing in part due to GME and the \"Other\" sub? \"Bronalysis\" included, would love your input.",
        "url": "https://www.reddit.com/r/stocks/comments/m0snbw/i_think_i_just_realized_something_is_tech/",
        "created": 1615273342.0
    },
    {
        "author": "Mycatiskoolerthanyou",
        "created_utc": 1617011333,
        "id": "mflxj2",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "[https://www.channelnewsasia.com/news/business/analysis--money-no-object-as-governments-race-to-build-chip-arsenals-14497940](https://www.channelnewsasia.com/news/business/analysis--money-no-object-as-governments-race-to-build-chip-arsenals-14497940)\n\nIntel Government subsidized foundry plant. Meant to DIRECTLY compete with TSMC\n\n[https://www.businesswire.com/news/home/20210323005981/en/Intel-CEO-Pat-Gelsinger-Announces-%E2%80%98IDM-2.0%E2%80%99-Strategy-for-Manufacturing-Innovation-and-Product-Leadership/](https://www.businesswire.com/news/home/20210323005981/en/Intel-CEO-Pat-Gelsinger-Announces-%E2%80%98IDM-2.0%E2%80%99-Strategy-for-Manufacturing-Innovation-and-Product-Leadership/)\n\nCurrent plans for INTEL. Remember, NVIDIA is priced to what its FUTURE price is not what its current valuation is.\n\nThere is a  article I cant post titled Be Fearful when others are greedy\n\n  Quotes from article\n\n* Intel is a very solid company that has a better growth track record than most give it credit for.\n* The company's underlying performance has been very reliable over the last five years, and the company hit new record results in 2020.\n* Share prices and underlying results do sometimes not seem tied too closely, which allows investors to exploit irrational market movements.\n* Buy when shares are a bargain due to the market's (oftentimes excessive) worries.\n\nAs well as this excerpt\n\nThere were big ups and downs in Intel's share price, which can't be explained by the underlying financial results the company generated. Instead, these major up and down moves in Intel's share price can be described by valuation changes that were, I believe, primarily driven by news items that do not necessarily have a direct financial impact",
        "subreddit": "wallstreetbets",
        "title": "So intel is gonna RIP. Be Greedy When Others Are Fearful",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mflxj2/so_intel_is_gonna_rip_be_greedy_when_others_are/",
        "created": 1617040133.0
    },
    {
        "author": "filth100",
        "created_utc": 1615229398,
        "id": "m0muo6",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Is there a reason why anyone would chose NVIDIA or AMD over TSMC? From a fundamental standpoint (I understand that fundamentals play a much smaller part within this current market) TSMC seems far superior. It has a better P/B ratio, has confirmed deals with Apple locked in which contribute to about 14% of their earnings, sell chips to AMD and NVIDIA in fact a decent portion of AMD’s deal with PlayStation was made through buying chips from TSMC. So does anyone have any reasons? I hope people know I’m not being conceited I just want to get as much of a understanding as possible",
        "subreddit": "stocks",
        "title": "Chip makers $NVDA vs $AMD vs $TSM",
        "url": "https://www.reddit.com/r/stocks/comments/m0muo6/chip_makers_nvda_vs_amd_vs_tsm/",
        "created": 1615258198.0
    },
    {
        "author": "GoodTee",
        "created_utc": 1615389430,
        "id": "m1zrnf",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Researching semiconductors. $nvda isn’t the answer I don’t think. Anyone have good DD on anything. There’s a company in Norway called Elkem $elk in THEIR market. Interesting learning that US Semi’s really don’t manufacture much. I think manufacturing is the key.",
        "subreddit": "stocks",
        "title": "💎Semiconductors 💎",
        "url": "https://www.reddit.com/r/stocks/comments/m1zrnf/semiconductors/",
        "created": 1615418230.0
    },
    {
        "author": "itskayyuhvin",
        "created_utc": 1615814936,
        "id": "m5koyh",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "With crypto, meme stocks, and reopening stocks highlighted right now, semiconductor stocks are quietly gaining traction. Reminder that domestic semiconductor firms have reached out to the government for aid due to the global shortage of chips. The US govt is currently reviewing and we should see in the next month or two how they'll help. Here's some semiconductors I'm eyeing. I'm just keeping it domestic since I doubt federal aid will go to stocks like TSM.\n\n&amp;#x200B;\n\nMU (Micron Technology)\n\n\\- They went out of their way mid quarter and RAISED their guidance for the next quarter. Demand for semiconductors are exploding so they upped their targets across the board.\n\n\\- Several price targets raises ( Daiwa Securities 140$, Citi 100$, Cowen 90$)\n\n&amp;#x200B;\n\nINTC (Intel Corporation)\n\n\\- Senator Buying.  Senator Carper bought stocks. I like to follow trades like this. Keep in mind a senator bought PENN weeks before the S&amp;P500 announcement\n\n\\-  World's leading maker of x86 CPUs for PCs and servers \n\n&amp;#x200B;\n\nON (On Semiconductor) \n\n\\- One of the few cheaper semiconductors that hasn't ran too hard yet. Around 38$ right now. \n\n\\- Several price targets at 45+\n\n\\- Beat earnings and gave good guidance.\n\n&amp;#x200B;\n\nOther semiconductor stocks could include AMD, NVDA. I personally don't like AMD. It's always burned me and I feel like there's heavy manipulation on that stock to keep it under 100. NVDA is already high priced so itll be hard to run up more but very possible if the treasury yields isn't wack again.",
        "subreddit": "stocks",
        "title": "Semiconductor Stocks Sleeping Giant",
        "url": "https://www.reddit.com/r/stocks/comments/m5koyh/semiconductor_stocks_sleeping_giant/",
        "created": 1615843736.0
    },
    {
        "author": "CMurr1711",
        "created_utc": 1615318887,
        "id": "m1ef5q",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hey All - Here are my main thoughts as to why I have such a overwhelming part of my portfolio in AMD.\n\nFeel free to disagree, agree or critique. We are all obviously bullish on AMD but we don't need an echo chamber!\n\nBullish:\n- Zen has been a hit and the road map into Zen 4 looks to keep kicking Intel while it's down.\n- Recent offerings from the Radeon group have been increasingly more competitive, even rivaling Nvidia's core business on a fraction of Nvidia's R+D budget.\n- Zen 3 continues to show excellence in incorporating Chipley technology. Chiplet technology allows for greater yields at the foundary, product flexibility and lower costs.\n- This experience should transfer to Chiplet GPU technology - allowing for the Radeon group to perhaps take a measurable lead on Nvidia for a generation or two while they catch up.\n- Epyc Milan looks dynamite and AMD will be able to gain market share in the computer server market. Recent hires in this area will help AMD gain more adoption.\n- New chiplet CNDA data center GPU's on the horizon.\n- New software stack incoming to compete with Nvidia's DLSS. This upscaling is rumored to provide a 2x performance boost and will be integrated into each games engine. Adoption by game companies is almost guaranteed since both consoles use and are set up to use the same technology.\n- Business world views Lisa Su and AMD as \"execution machines\" - Moore's Law is Dead video. Product roadmaps and goals have consistently met and goals beaten expectations.\n- Extensive business relationships with Microsoft and Sony.\n- Mass OEM adoption seems to be happening in both Laptop and Desktop market.\n- Xilinx merger adds massive revenue and capabilities.\n- Because Lisa Su.\n\nBearish:\n- Capacity issues at TSMC have restricted profits at times.\n- They are competing with 2 monster companies in Intel and Nvidia in their core business areas.\n- Semiconductor stocks are volatile by nature.\n- Post Pandemic conditions might reduce profit margins.\n\nThat being said I'm confident the Bullish thesis is much more powerful than the Bearish one.\n\nPlease feel free to reply with any other bullish or bearish arguments. The more we can discuss the better informed everyone is.",
        "subreddit": "wallstreetbets",
        "title": "A Non-Technical Bullish Thesis on AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m1ef5q/a_nontechnical_bullish_thesis_on_amd/",
        "created": 1615347687.0
    },
    {
        "author": "Visible_Antelope5010",
        "created_utc": 1614699566,
        "id": "lw4t8w",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Introducing ... $SOXL. A 3X Bullish ETF of 80% Semiconductors 20% Semiconductor materials chain. Meaning it goes up 3x or down with it’s holdings. \n😍Love that leverage since stocks only go ⬆️ \n\nDo you like Semiconductors? Y/N \n-Are you bullish on NVDA/AMD 🚀🚀🚀 Y/N\n-Do you think there’s a Semiconductor shortage? Y/N\n-Do you like 3x Leverage? \n                -Bears🌈🐻say: “ShoRtaGe MeANs     LeSs PrOFitS”\n\n-Yes, they might be constrained now, but it’s only a matter of time, Supply vs Demand. Semiconductor manufacturers will raise prices leading to increased profit that scales with inflation! Semiconductors go brrrr 💵 💵 💵 \n\nDo you really want to bet against:\n-Stimmy?💉💰💰💰\n-Government (Nat’l Security) interventions?🕵️🕵️‍♂️\n-Increased cryptomining, gaming, and EV/AI chip usage? 🚀🚀🚀\n\nLook around and see how hard it is to buy a current GPU at MSRP!\n\nSOXL Just split 15:1, this isn’t really technically bullish sign as it moves 3x based off of its holdings, however: calls, covered calls, puts, etc are cheaper for you to play!\n\n(620 —&gt; 41 per share as of today) \n\n...To me; it’s bullish AF, it means more people can play.\nFor the retards (like me): \n\nLove the call options on dips- 3x leverage off of 100x leverage from option(s) = Get Tendies or Die Tryin’  🍗 💀 \n\n1 yr return: +105.96% 😍 \n\nHoldings: (80% Semiconductor Manufactures, 20% Semiconductor Equipment)\n\nTop Holdings:\nBroadcom Limited, Qualcomm, Intel, Texas Instruments, Nvidia, AMD, Intel, Micron Technology, Taiwan Seminductor, Analog Devices, Applied Material, Lam Research (See Direxion Website)\n\n⚠️Warning ⚠️ : tanks hard on dips but that’s when you buy MOAR calls for insane gains.\n\nSee Posted Positions:Shares @ ATHs &amp; dips (pre split)\n                 Calls @ ATHs &amp; dips \n\n(My Entry: Everyday) - Shares\nCalls at dips",
        "subreddit": "smallstreetbets",
        "title": "Tired of Meme Stocks? $SOXL 3X Semiconductor play 🚛🚛🚛🔌🔌🔌",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lw4t8w/tired_of_meme_stocks_soxl_3x_semiconductor_play/",
        "created": 1614728366.0
    },
    {
        "author": "learn-and-earn-",
        "created_utc": 1615924402,
        "id": "m6hrff",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Franklin Templeton released a bunch of  thematic active ETFs in February 2020 &amp; March 2021. They seem pretty interesting, with a disruption/innovation theme to each of them. Matthew Moberg &amp; Joyce Lin are the fund managers.\n\nAll these ETFs have done very well in the recent past (but then again, 2020 was an exceptional year &amp; past performance doesn't imply future), but they have fallen quite a bit over the past 1 month, giving us potential entry points to \"buy the dip.\" Here's my humble attempt at a summary:\n\n[**Disruptive Commerce ETF $BUYZ**](https://www.franklintempleton.com/investor/investments-and-solutions/investment-options/etfs/portfolio/29096/franklin-disruptive-commerce-etf/BUYZ)**:**\n\n1. Claims to invest in innovative companies benefitting from transformation in the e-commerce space\n2. Claims to provide access to companies that are related to new online markets, streamlined procurement systems, and game-changing ways to deliver goods and services\n3. Portfolio: large growth, where its top 5 holdings are popular ECommerce plays: $SE, $SHOP, $FVRR, $AMZN, $MELI, followed by interesting choices like $SQ, $PYPL, $DOCU, $UBER and $TDOC\n4. Performance: +173.76% over the past year, -0.01% YTD, -16.25% over the last 1 month\n5. Expense Ratio: 0.50%\n\n&amp;#x200B;\n\n[**Exponential Data ETF $XDAT:**](https://www.franklintempleton.com/investor/investments-and-solutions/investment-options/etfs/overview/30780/franklin-exponential-data-etf/XDAT)\n\n1. Claims to invest in companies focused on or expected to benefit from the creation, collection, cleaning, analyzing, storage, securing, transport, selling, and/or use of data\n2. Claims to provide access to companies that the investment manager believes benefit from or facilitate big data, data infrastructure, data analytics, and innovative use cases and applications of data which include artificial intelligence, augmented and virtual reality, software-as-a-service, personalized advertising and personalized healthcare among others\n3. Portfolio: large growth, mainly tech as top holdings: $SNAP, $PINS, $FB, $GOOG, $TTD, $TWLO etc.\n4. Performance: was formed only in January 2021, -2.71% YTD, -9.31% over the last 1 month\n5. Expense Ratio: 0.50%\n\n&amp;#x200B;\n\n[**Genomic Advancements ETF $HELX**](https://www.franklintempleton.com/investor/investments-and-solutions/investment-options/etfs/overview/29097/franklin-genomic-advancements-etf/HELX)**:**\n\n1. Claims to invest in innovative companies related to genomic-based technologies designed to enhance the quality of life\n2. Claims to provide access to companies benefitting from or facilitating the use of new research including DNA sequencing, gene editing and personalized medicine\n3. Portfolio: mid-cap growth, with top holdings: Intellia, Repligen, Wuxi Biologics, Illumina, Natera etc. Has an around \\~38% overlap with the more famous $ARKG\n4. Performance: +126.11% over the past year, -2.03% YTD, -16.28% over the last 1 month\n5. Expense Ratio: 0.50%\n\n&amp;#x200B;\n\n[**Intelligent Machines ETF $IQM**](https://www.franklintempleton.com/investor/investments-and-solutions/investment-options/etfs/overview/29098/franklin-intelligent-machines-etf/IQM)**:**\n\n1. Claims to invest in innovative companies furthering techniques that automate or enhance everyday tasks\n2. Claims to provide access to companies that are developing technologies that support machine learning as well as those using automated processes\n3. Portfolio: large growth, with interestingly diversified top holdings: $TSLA, $AAPL, $ISRG, $TSM, $AXON, $ADSK, $NVDA etc.\n4. Performance: +137.14% over the past year, -0.36% YTD, -10.64% over the last 1 month\n5. Expense Ratio: 0.50%\n\n&amp;#x200B;\n\n**So, what do you people think about them? Which ones do you like / see room for medium-to-long term growth?**\n\nThanks for reading!",
        "subreddit": "investing",
        "title": "Franklin Templeton Thematic ETFs (BUYZ, XDAT, HELX, IQM)",
        "url": "https://www.reddit.com/r/investing/comments/m6hrff/franklin_templeton_thematic_etfs_buyz_xdat_helx/",
        "created": 1615953202.0
    },
    {
        "author": "FutureCo",
        "created_utc": 1617029668,
        "id": "mfrao5",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Holdings are listed. Tomorrow, ARKX start trading. PDF says holdings are listed as of 03/26/2021.\n\nhttps://ark-funds.com/wp-content/fundsiteliterature/holdings/ARK_SPACE_EXPLORATION_&amp;_INNOVATION_ETF_ARKX_HOLDINGS.pdf\n\nInterestingly, ARKX will contain PRNT, which is ARK's 3D printing ETF as their #2 component.\n\nRank | Company | Ticker | CUSIP | Shares | Market Value($) | Weight(%)\n--- |              --- | ---      | ------  | -------- | ----------------   | -------------\n1 | TRIMBLE INC | TRMB | 896239100 | 1156 | $86,353.20 | 8.47\n2 | THE 3D PRINTING ETF | PRNT | UF 00214Q500 | 1636 | $62,168.00 | 6.10\n3 | KRATOS DEFENSE &amp; SECURITY | KTOS | 50077B207 | 2203 | $57,322.06 | 5.62\n4 | L3HARRIS TECHNOLOGIES INC | LHX | 502431109 | 255 | $50,729.70 | 4.97\n5 | JD.COM INC-ADR | JD | 47215P106 | 610 | $50,062.70 | 4.91\n6 | KOMATSU LTD 6301 | JT | 6496584 | 1547 | $46,545.40 | 4.56\n7 | LOCKHEED MARTIN CORP | LMT | 539830109 | 125 | $45,588.75 | 4.47\n8 | IRIDIUM COMMUNICATIONS INC | IRDM | 46269C102 | 1132 | $43,163.16 | 4.23\n9 | THALES SA | HO FP | 4162791 | 407 | $39,789.41 | 3.90\n10 | BOEING CO/THE | BA | 97023105 | 145 | $35,506.15 | 3.48\n11 | NVIDIA CORP | NVDA | 67066G104 | 66 | $33,895.62 | 3.32\n12 | SPIRIT AEROSYSTEMS HOLD-CL A | SPR | 848574109 | 687 | $33,209.58 | 3.26\n13 | DEERE &amp; CO | DE | 244199105 | 87 | $32,389.23 | 3.18\n14 | AMAZON.COM INC | AMZN | 23135106 | 10 | $30,520.30 | 2.99\n15 | TERADYNE INC | TER | 880770102 | 235 | $27,969.70 | 2.74\n16 | ALPHABET INC-CL C | GOOG | 02079K107 | 13 | $26,462.15 | 2.59\n17 | DASSAULT SYSTEMES SE | DSY | 5330047 | 121 | $26,035.27 | 2.55\n18 | TELEDYNE TECHNOLOGIES INC | TDY | 879360105 | 65 | $26,050.70 | 2.55\n19 | GARMIN LTD | GRMN | B3Z5T14 | 160 | $20,539.20 | 2.01\n20 | VIRGIN GALACTIC HOLDINGS INC | SPCE | 92766K106 | 672 | $19,884.48 | 1.95\n21 | RAVEN INDUSTRIES INC | RAVN | 754212108 | 512 | $17,454.08 | 1.71\n22 | AIRBUS SE AIR | FP | 4012250 | 144 | $16,583.72 | 1.63\n23 | AEROVIRONMENT INC | AVAV | 8073108 | 138 | $16,395.78 | 1.61\n24 | ALIBABA GROUP HOLDING-SP ADR | BABA | 01609W102 | 72 | $16,362.72 | 1.60\n25 | ELBIT SYSTEMS LTD | ESLT | 2311614 | 108 | $15,082.20 | 1.48\n26 | US DOLLAR | USD | - | 13003.12 | $13,003.12 | 1.27\n27 | NETFLIX INC | NFLX | 64110L106 | 25 | $12,701.25 | 1.25\n28 | HEICO CORP | HEI | 422806109 | 94 | $11,605.24 | 1.14\n29 | HONEYWELL INTERNATIONAL INC | HON | 438516106 | 53 | $11,582.09 | 1.14\n30 | WORKHORSE GROUP INC | WKHS | 98138J206 | 803 | $10,800.35 | 1.06\n31 | TAIWAN SEMICONDUCTOR-SP ADR | TSM | 874039100 | 89 | $10,373.84 | 1.02\n32 | TENCENT HOLDINGS LTD-UNS ADR | TCEHY | 88032Q109 | 128 | $10,365.44 | 1.02\n33 | ANSYS INC | ANSS | 03662Q105 | 30 | $10,288.80 | 1.01\n34 | SYNOPSYS INC | SNPS | 871607107 | 42 | $10,195.50 | 1.00\n35 | XILINX INC | XLNX | 983919101 | 83 | $10,220.62 | 1.00\n36 | MEITUAN-CLASS B | 3690 | BGJW376 | 244 | $9,484.63 | 0.93\n37 | AUTODESK INC | ADSK | 52769106 | 31 | $8,339.31 | 0.82\n38 | ATLAS CREST INVESTMENT COR-A | ACIC | 49284102 | 730 | $7,409.50 | 0.73\n39 | REINVENT TECHNOLOGY-CLASS A | RTP | BLPHSK8 | 734 | $7,472.12 | 0.73",
        "subreddit": "StockMarket",
        "title": "ARKX Holdings Posted",
        "url": "https://www.reddit.com/r/StockMarket/comments/mfrao5/arkx_holdings_posted/",
        "created": 1617058468.0
    },
    {
        "author": "thinkB4WeSpeak",
        "created_utc": 1615523898,
        "id": "m39ui4",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Plus has received more than 10,000 preorders for its autonomous truck driving system, which is expected to be commercially available in 2022 in the U.S., China and Europe.\n\nPlus, a self-driving truck technology company, has made several recent announcements:\n\nThe company will use NVIDIA DRIVE Orin system-on-a-chip (SoC) in its autonomous driving systems.A former Navistar exec has joined Plus as chief platform officer.Plus recently raised $200 million in new funding.\n\nPlus was founded in 2016 and specializes in self-driving technology for large-scale autonomous transport. The company is starting mass production of its autonomous driving system for heavy trucks this year. \n\nAccording to a press release, the company will expand its feature set and operating design domain over time through over-the-air software updates. By working with the NVIDIA engineering team to further evolve its system, Plus will make it possible for trucks powered by its system to achieve fail-operational performance for on-road safety.\n\n“Enormous computing power is needed to process the trillions of operations that our autonomous driving system runs every fraction of a second. NVIDIA Orin is a natural choice for us and the close collaboration with the NVIDIA team on a custom design for our system helps us achieve our commercialization goals,\" says Hao Zheng, Plus CTO and cofounder. \"We have received more than 10,000 pre-orders of our system, and will continue to develop our next-generation product based on the NVIDIA DRIVE platform as we deliver the systems to our customers.\"\n\nThe Plus autonomous driving system is designed to make long-haul trucks safer and more efficient. Because of the size and weight of heavy trucks, which can total 80,000 lbs. with a fully-loaded trailer, they need more time to come to a stop and to maneuver.\n\nPlus’ system uses lidar, radar and cameras to provide a 360° view of the truck’s surroundings. Data gathered through the sensors help the system identify objects nearby, plan its course, predict the movement of those objects and finally control the vehicle to make it move safely.\n\nThe NVIDIA Orin, which can deliver 254 trillion operations per second, can handle the large number of concurrent operations and support deep neural networks to process and make decisions using the data on heavy trucks outfitted with the Plus autonomous driving system. Orin is also designed for ISO 26262 Functional Safety ASIL-D at the system level for safety.\n\n“Plus and its automated trucks are delivering true social benefits today through improved safety and efficiency,” says Rishi Dhall, vice president of autonomous vehicles, NVIDIA. \n\nTo support the global deployment of its self-driving truck technology, Plus has added two new senior hires; Mooney, who was most recently senior vice president of global product development at Navistar and Chuck Joseph, who joined from Amazon’s Global Transportation Technology Group.\n\nThe company also closed $200 million in new funding in February led by new investors Guotai Junan International, CPE, and Wanxiang International Investment. Existing investors including Full Truck Alliance (FTA) also participated. Plus will use the funding to develop a sales and support network to help fleets integrate the Plus automated trucking system into their daily operations. The company will also scale deployments in the U.S. and China, and expand internationally to Europe and other parts of Asia.\n\nPlus also recently announced collaborations with Amazon AWS, Blackberry QNX, and Ouster\n\n\n\n\n\n\nhttps://www.forconstructionpros.com/trucks/trucks-accessories/heavy-trucks-class-7-8/article/21319412/plus-plus-nvidia-partner-on-heavy-truck-autonomous-driving-system",
        "subreddit": "stocks",
        "title": "Plus, NVIDIA Partner on Heavy Truck Autonomous Driving System",
        "url": "https://www.reddit.com/r/stocks/comments/m39ui4/plus_nvidia_partner_on_heavy_truck_autonomous/",
        "created": 1615552698.0
    },
    {
        "author": "prostockadvice",
        "created_utc": 1615980499,
        "id": "m6yatq",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Yesterday tech and semis continued their upward push as cyclicals and the 10 year treasury fell were down at opening bell. Currently the 10 year is 1.621%. Today will be mostly overshadowed by this two day long Fed meeting. \n\n“This Fed meeting is one of the most important ones for the market in a long time. It is the first we have had after the recent inflation rate rise and concerns about inflation,” said Tom Martin, senior portfolio manager at Globalt Investments in Atlanta.\n\nData showed that retail sales dropped in February and the winter storms in Texas led to a plunge in US factory output last month. \n\n**Markets**: \n\n* SPY: -0.13%\n* QQQ: +0.55%\n* DIA: -0.37%\n\n**Notable Recent Picks:** \n\n* $CCIV: +8.40%\n* $RBLX: +6.72%\n* $NXE: +5.5%\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nYesterday my portfolio finished up almost 1%, and that was due to mostly $SOXL and semis leading the way. It was up much more at opening bell, but the ARK ETFs suffered as the day went on. The only position that I had filled was the $EBON $10 PUT 30DTE at $2.50. \n\n*Processing img mq8g5xavpkn61...*\n\n \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**Adding to the Watchlist:**\n\n$**VWAGY**: Volkswagen AG, known internationally as the Volkswagen Group, is a German multinational automotive manufacturing corporation headquartered in Wolfsburg, Lower Saxony, Germany and indirectly majority owned by the Porsche and Piëch family. \n\nAfter years as the undisputed king of the electric car, Tesla(TSLA) could be matched sale for sale by Volkswagen([VLKAF](https://money.cnn.com/quote/quote.html?symb=VLKAF&amp;source=story_quote_link)) as early as 2022, according to analysts at UBS, who predict that [Europe's biggest carmaker](http://www.cnn.com/2021/03/15/business/volkswagen-batteries-electric-cars/index.html) will go on to sell 300,000 more battery electric vehicles than Tesla in 2025. \"Tesla is not only about electric vehicles. Tesla is also very strong in software. They really run the car as a device. They are making good progress on the autonomous thing. But yes ... we are going to challenge Tesla,\" Volkswagen CEO Herbert Diess. “We will accelerate our transformation journey in 2021 and beyond,” Chief Executive Officer Herbert Diess told reporters. VW’s newly formed management board “is set to unleash value,” he said.\n\nVW is really going to surprise a lot of Americans with how fast they will transform their fleet and with their EV sales in the coming years. Although I wish that Ford, $F, would make such a heavy handed push towards electric, they aren't and the next best thing to Tesla is more than likely going to be Volkswagen. \n\nVolkswagen doesn't trade on the U.S. stock markets. However, you can buy it on the OTC exchange where it trades under the ticker symbol “VWAGY.” While volumes on the OTC exchange can be a concern, VWAGY stock has an average volume of over 350,000 shares, which looks decent. \n\nI was skeptical at first because of the bad reviews on the ID.4, however the more I looked into $VWAGY the more I liked it. \n\n* Target Price: $90\n* Entry: &lt;$35\n* Risk: 4\n* Timeframe: 10-18 months\n\nhttps://preview.redd.it/a2jb41hxpkn61.png?width=1156&amp;format=png&amp;auto=webp&amp;s=3b40cf1ae73b3dfbcbdde8800bd34c3612727d9e\n\n \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n$**FLGT**: Fulgent Genetics is a technology company providing comprehensive testing solutions through its scalable platform. They provide physicians with clinically actionable diagnostic information to improve the quality of patient care. Fulgent Genetics announced that the U.S. Centers for Disease Control and Prevention (“CDC”) has awarded the company a contract to provide genomic sequencing of samples of SARS-CoV-2 on an ongoing basis, leveraging its Next Generation Sequencing (“NGS”) capabilities. \n\nFor me this is a short term play on this news. I'd be interested in a vertical spread or just a call. More or less, I think this will continue trading around the 50 day MA. (purple line)\n\n* Target Price: $150\n* Entry: \\~$105\n* Risk: 4\n* Timeframe: 3-5 months\n\nhttps://preview.redd.it/xxeldqpypkn61.png?width=1151&amp;format=png&amp;auto=webp&amp;s=7d30af05eb7fdf58203cad39c29c23b6601126fa\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_ \n\n**Notable Mentions:**\n\n$**CCIV**: I believe that it is worth mentioning that this SPAC is in very, very good deal territory. After the merger was confirmed with Lucid Motors, this SPAC, almost overnight, dropped almost half. Now after this growth sell off and transition into cyclicals, $CCIV has lost out more. Considering Lucid will have cars on the street later this year, this is a great opportunity.  If you've been following my journey, you will know this isn't the first, nor the last, time I've mentioned this SPAC. \n\nDuring the last few weeks, we've had entries set around $24 - and earlier this year I was also buying it before the massive run up to $65 (taking profit). So far, I feel pretty confident calling this one. \n\nhttps://preview.redd.it/dx1t7280qkn61.png?width=1149&amp;format=png&amp;auto=webp&amp;s=f165d5f2361902d962389a5a83a52c2a8e667388\n\n \\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n$**SOXL/SOXX**: It is not a well kept secret that these semiconductor ETFs have been doing very well. Even yesterday most everything finished red, but $SOXL was up 4%. $SOXL was my best performer in 2020 by far. There is a global shortage of chips, and it is causing delays Tesla or NIO car productions, for example. \n\nBelieve it or not this dip we are in right now, was bigger for $SOXL than the Covid-19 dip from March by a noticeable amount. Companies like AMD, Nvidia, or Taiwan Semiconductor are not going anywhere, anytime soon and there will just be a bigger demand in the future, in my opinion. It seems that $SOXL is about to cross back above the 50 MA, which is a pretty big deal. I would be buying as much as I can and not looking back. \n\nhttps://preview.redd.it/1xo2i1g1qkn61.png?width=1149&amp;format=png&amp;auto=webp&amp;s=d6a2503f39bbb266710981aff0a7ec442994c2fd\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n Note: Risk (1 out of 5) is my opinion of how risky the stock and these plays are; 1 being the lowest and 5 is the highest.  \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n Disclaimer: The comments opinions and analysis expressed herein are for informational and educational purpose only and should not be considered as individual advice or recommendations.",
        "subreddit": "options",
        "title": "Journey to $1 Million - March 17th, 2021",
        "url": "https://www.reddit.com/r/options/comments/m6yatq/journey_to_1_million_march_17th_2021/",
        "created": 1616009299.0
    },
    {
        "author": "akokaz1",
        "created_utc": 1615986444,
        "id": "m6zzhm",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Teradyne Inc, Ticker: **TER (+38% mentions)**\n\nMarket cap: $19.5Bn\n\nTeradyne Inc supplies automation test equipment for semiconductors, wireless products, data storage and complex electronic systems in the consumer electronic, automotive, industrial, communications and aerospace sector.\n\nEssentially, the chip powering the phone or laptop you are reading this from has most likely been tested by Teradyne.\n\nTeradynes biggest customers include Samsung, Qualcomm, Nvidia, Intel, Boeing, Texas Instruments, 3M, and IBM.\n\nDon’t have time to read the whole thing? I’ll summarise below\n\n3 main reasons why I like this stock:\n\n* Overall semiconductor market future\n* Finances and balance sheet\n* Cathie Wood investment\n\n2 possible downsides:\n\n* Low future earnings forecasts\n* Recent price volatility\n\nFuture\n\nAlmost everything requires a semiconductor now, and that will only grow further in the future, some of the biggest examples are:\n\n* The majority of mobile phones sold nowadays are smartphones, and while that growth has slowed down over the last few years, 1.5 billion a year are still sold.\n* The ecosystem surrounding mobile phones is growing rapidly, think tablets, smart watches, headphones, laptops, speakers.\n* Internet-of-things devices are booming, think Alexa, smart lighting, ovens, fridges,heating, mirrors etc.\n* Car technology (especially in electric cars) is mostly driven by semiconductor technology, shifting further and further away from analog technology\n* Gaming, from Playstations to VR headsets, again all require semiconductor technology\n* Automated manufacturing\n\nEven without COVID, supply cannot keep up. There have been huge shortages this year for semiconductors causing pinches everywhere *(have you tried purchasing a PS5 recently?)* meaning lots of pent-up demand, even without, a number of HUGE factories have been built or will be built that are expected to ramp up supply. examples of those:\n\n* [Samsung’s $17bn factory](https://www.extremetech.com/computing/319926-samsung-files-documents-to-build-new-17-billion-fab-in-the-united-states)\n* [TSM’s $12bn plant](https://www.fool.com/investing/2020/05/15/taiwan-semiconductor-to-build-a-12-billion-chip-pl.aspx)\n* [Intel’s $7bn plant, completed in 2020](https://hexus.net/tech/news/cpu/145990-intel-fab-42-now-ready-pump-leading-edge-products/)\n* [List of all current fabrication plants to give you an idea of size of market](https://en.wikipedia.org/wiki/List_of_semiconductor_fabrication_plants)\n\nAll of this will require automation and testing.\n\nLong-term, it’s very safe to assume that irrespective of economic or technological shifts, semiconductor demand will not only sustain, but surge. A few things on the horizon that will likely affect this:\n\n* 5G technology being rolled out worldwide\n* Space technology &amp; tourism growth\n* AI &amp; data technology\n\nThe biggest kicker? Teradyne provide the majority of the automation and testing for all of these sectors, meaning any growth here only benefits them.\n\nFurthermore, to me they are also proofed from the whole *“economy opening up means a move away from tech“* as it’s not like people will stop using electronic devices, unlike companies like Zoom which will see a big drop in usership as normality returns.\n\nFinances\n\nEven during a COVID year, Teradyne grew revenues from $2.29bn to $3.12bn, an increase of 36%.\n\nThey grew their net income even further, going from $467m to $784m, an increase of 67%.\n\nEarnings per share *(profit by number of shares)* also grew, from $2.6 to $4.28 (**+64%**) last year which is astounding. (*general consensus is anything above 25% growth is good).*\n\nWhen taking the price of the stock into account, and looking at Price-to-Earnings ratio *(Price of the stock vs the earnings per share of a stock, the lower the better)* Teradyne has a PE ratio of 24.9x, which is way better than the industry average of 38x.\n\nFrom a debt position, Teradyne is very healthy with an equity-to-debt ratio *(the lower the better, below 1 means more equity than debt)* of 0.18.\n\nCathie Wood Investment\n\nCathie Wood, the very aggressive bullish investor whos ETF [ARK Invest](https://finance.yahoo.com/quote/ARKK/performance/) saw returns of 152% last year, [has recently purchased a further 139,619 shares](https://247wallst.com/investing/2021/03/12/cathie-woods-ark-invest-buys-and-sells-3-12/) to add to the current position.\n\nExtra purchasing here shows long-term confidence, as this was added after ARK had to rebalance and sell some Teradyne shares last year.\n\nPossible Downsides\n\nSome analysts are predicting modest future revenue growth at 5.8%, compared to the industry average of 16.2%.\n\nFurthermore, the price this year has seen some large volatility, suffering from the sell-off that affected technology and growth stocks earlier this year. If more sell-offs ensue, this could cause the price to drop further in the short term.\n\nSummary\n\nTeradyne commands a large portion of a market that is only growing further every year. A financially healthy and well managed company, with high revenue and EPS growth, along with some strong investment backing. While there may be some volatility in the price of the stock short-term, long-term this company still has tremendous potential.",
        "subreddit": "investing",
        "title": "Research on Teradyne Inc, a stock seeing an increase in chatter over the last few weeks.",
        "url": "https://www.reddit.com/r/investing/comments/m6zzhm/research_on_teradyne_inc_a_stock_seeing_an/",
        "created": 1616015244.0
    },
    {
        "author": "thinkB4WeSpeak",
        "created_utc": 1615523940,
        "id": "m39uwn",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Plus has received more than 10,000 preorders for its autonomous truck driving system, which is expected to be commercially available in 2022 in the U.S., China and Europe.\n\nPlus, a self-driving truck technology company, has made several recent announcements:\n\nThe company will use NVIDIA DRIVE Orin system-on-a-chip (SoC) in its autonomous driving systems.A former Navistar exec has joined Plus as chief platform officer.Plus recently raised $200 million in new funding.\n\nPlus was founded in 2016 and specializes in self-driving technology for large-scale autonomous transport. The company is starting mass production of its autonomous driving system for heavy trucks this year. \n\nAccording to a press release, the company will expand its feature set and operating design domain over time through over-the-air software updates. By working with the NVIDIA engineering team to further evolve its system, Plus will make it possible for trucks powered by its system to achieve fail-operational performance for on-road safety.\n\n“Enormous computing power is needed to process the trillions of operations that our autonomous driving system runs every fraction of a second. NVIDIA Orin is a natural choice for us and the close collaboration with the NVIDIA team on a custom design for our system helps us achieve our commercialization goals,\" says Hao Zheng, Plus CTO and cofounder. \"We have received more than 10,000 pre-orders of our system, and will continue to develop our next-generation product based on the NVIDIA DRIVE platform as we deliver the systems to our customers.\"\n\nThe Plus autonomous driving system is designed to make long-haul trucks safer and more efficient. Because of the size and weight of heavy trucks, which can total 80,000 lbs. with a fully-loaded trailer, they need more time to come to a stop and to maneuver.\n\nPlus’ system uses lidar, radar and cameras to provide a 360° view of the truck’s surroundings. Data gathered through the sensors help the system identify objects nearby, plan its course, predict the movement of those objects and finally control the vehicle to make it move safely.\n\nThe NVIDIA Orin, which can deliver 254 trillion operations per second, can handle the large number of concurrent operations and support deep neural networks to process and make decisions using the data on heavy trucks outfitted with the Plus autonomous driving system. Orin is also designed for ISO 26262 Functional Safety ASIL-D at the system level for safety.\n\n“Plus and its automated trucks are delivering true social benefits today through improved safety and efficiency,” says Rishi Dhall, vice president of autonomous vehicles, NVIDIA. \n\nTo support the global deployment of its self-driving truck technology, Plus has added two new senior hires; Mooney, who was most recently senior vice president of global product development at Navistar and Chuck Joseph, who joined from Amazon’s Global Transportation Technology Group.\n\nThe company also closed $200 million in new funding in February led by new investors Guotai Junan International, CPE, and Wanxiang International Investment. Existing investors including Full Truck Alliance (FTA) also participated. Plus will use the funding to develop a sales and support network to help fleets integrate the Plus automated trucking system into their daily operations. The company will also scale deployments in the U.S. and China, and expand internationally to Europe and other parts of Asia.\n\nPlus also recently announced collaborations with Amazon AWS, Blackberry QNX, and Ouster\n\n\n\n\n\n\n\n\n\n\nhttps://www.forconstructionpros.com/trucks/trucks-accessories/heavy-trucks-class-7-8/article/21319412/plus-plus-nvidia-partner-on-heavy-truck-autonomous-driving-system",
        "subreddit": "investing",
        "title": "Plus, NVIDIA Partner on Heavy Truck Autonomous Driving System",
        "url": "https://www.reddit.com/r/investing/comments/m39uwn/plus_nvidia_partner_on_heavy_truck_autonomous/",
        "created": 1615552740.0
    },
    {
        "author": "AAces_Wild",
        "created_utc": 1614723944,
        "id": "lwe8t3",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "DISCLAIMER: Please do your own research - no investment is without risk, and may lose value.\n\nMarket Cap = 146M. Share price at close = $7.91\n\nSECTOR: Information Technology, INDUSTRY: Technology Hardware, Storage &amp; Peripherals\n\nSummary: One Stop Systems, Inc. designs, manufactures, and markets custom **high-speed computing systems** for high-performance edge computing applications in the US and internationally. Its GPU expansion units add hundreds of computing cores and teraflops of computing performance to virtually any original equipment manufacturer server. OSS' flash storage arrays provide hundreds of terabytes of storage and **millions of input/output operations per second** (see applications, below). It also offers servers for PCI express-over-cable expansion; desktop expansion appliances in various configurations that add input/output flexibility to any user's desktop system; **PCIe expansions,** and ruggedized mobile high-performance compute devices to meet specialized requirements for devices deployed at the edge in **various environmental conditions**. One Stop Systems, Inc. was founded in 1998 and is headquartered in Escondido, California. \n\nAPPLICATIONS \\- buckle in, exciting stuff.\n\nWith wide-ranging applications like AI, autonomous cars, and military technologies we don't even know exist yet (laser tech, threat detection, missile targeting), \"edge computing\" is sure to expand and meet growing demand for high-performance computing able to provide millions of actionable data points every second. In January 2021, OSS announced their 4th military contract via project “Orange Gear,” an AI system that enables U.S. Navy aircraft to conduct real-time AI-powered threat detection. Shooting down enemy assets, what guides the weapon? OSS enables the second-to-second calculations to achieve such precision. \n\nInteresting fact: OSS chief sales and marketing officer Jim Ison says they are going to “expand the support of wartime theater applications for [land, sea, air and space](http://www.globenewswire.com/fr/news-release/2021/01/05/2153506/0/en/OSS-Wins-Fourth-Program-with-Major-Military-Contractor.html).” ***SPACE***. What an incredible hint of things to come! The final frontier, space exploration represents a vast yet untapped potential area of edge computing expansion. Heck, the previous administration just created a new *branch of the military* specifically for protecting America’s interests above the stratosphere. Also consider that the USA, with a defense budget of $700 billion annually, will likely purchase American-made edge computing tech in-house, avoiding adversaries like China. OSS seems here to stay.\n\nWhile military contracts might not whet your appetite, consider autonomous driving. OSS’ ingenious “AI on the Fly” enables in-vehicle “ruggedized” autonomous driving. Here is a company rep, much smarter than myself, excited to provide more detail on [OSS' computing devices](https://www.youtube.com/watch?v=MAagBi_j4cA&amp;ab_channel=InsideHPCReport) in self-driving vehicles.\n\nSo what is a PCIe? The PCIe is the motherboard site that interfaces with a computer's graphics cards, hard drive adapter, SSDs, Wi-Fi, and Ethernet hardware connections. In June 2020, OSS introduced the [world’s first](https://www.globenewswire.com/news-release/2020/06/22/2051412/0/en/OSS-Introduces-World-s-First-PCIe-Gen-4-Expansion-System-for-NVIDIA-A100-PCIe-GPUs.html#:~:text=(Nasdaq%3A%20OSS)%2C%20a,20X%20over%20the%20previous%20generation) PCIe Gen4 Expansion System that fully supports NVIDIA A100 Tensor Core GPUs, which can boost computing performance up to 20X over the previous generation. The OSS Gen4 Expansion System allows system developers to scale out almost any Gen4 server by adding up to eight NVIDIA A100 GPUs. The system is ideal for boosting the performance of compute-intensive applications like **AI training, AI inference, video analytics and XR rendering**. What is XR rendering? X is just a placeholder! Virtual, Mixed, or Augmented reality (VR, MR, or AR, respectively) experiences include those where users generate new forms of reality by bringing digital objects into the physical world and those that see the bringing physical world objects into the digital world. Yes, OSS also powers augmented reality applications.\n\nINDUSTRY - is there growth to “Edge Computing” as a field? \n\n[MarketsandMarkets](https://www.marketsandmarkets.com/Market-Reports/edge-computing-market-133384090.html#:~:text=Edge%20computing%20can%20be%20used,%2C%20healthcare%2C%20and%20many%20others) projects the global edge computing market to grow from **$3.6 billion in 2020 to $15.7 billion by 2025**, at a Compound Annual Growth Rate (CAGR) of 34.1% during the forecast period. Factors such as the growing adoption of Internet of Things (IoT) across industries; rising demand for low-latency processing and real-time, automated decision-making solutions; and a need for surmounting exponentially increasing data volumes and network traffic.\n\nPARTNERSHIPS\n\nOSS is diversified in its partnerships with the big boys - Apple, Nvidia, Intel, AMD, Boeing, IBM, Lenovo, HP, and [many others](https://www.onestopsystems.com/partners).\n\nMEAT AND POTATOES - finances \n\nFollowing IPO in 2018, OSS already generates $60 million in revenue, increasing 45% YOY. \n\nHow about its market share? To find a company’s size, or “market cap,” multiply the current share price by the number of shares. OSS clocks in with 16,620,000 shares x $7.91 = 131M. For a company with a 130M market cap, $60M in revenue represents very strong revenue (46%) to its size. For comparison’s sake, NVDA market cap is 335B and generates 16.7B annually (5%). With 31% institutional ownership – and [increasing](https://fintel.io/so/us/oss) – this is certainly on the radar of the big players.\n\nA note about earnings per share (EPS) - OSS’ earnings announcement is coming between March 19 and 25. Based on two analyst forecasts, the consensus EPS forecast for the quarter is $0.04 with 12.17M revenue. Indeed, OSS has quickly transformed itself into a profitable enterprise with [consistent revenue beats](https://seekingalpha.com/symbol/OSS/earnings) to boot. \n\nBALANCE SHEET\n\nIn short, OSS has 40M in assets, 11M in liabilities and 2M total debt. \n\n*Processing img 0357jvc0uok61...*\n\nLEADERSHIP\n\nFormerly the interim head, now-CEO [David Raun](https://www.globenewswire.com/news-release/2020/06/25/2053412/0/en/OSS-Appoints-David-Raun-Technology-Industry-Veteran-as-President-CEO.html) has two decades of experience in the PCIe area, and led PLX Technology to record revenue and profits before getting acquired by Broadcom (AVGO).\n\nCOMPETITORS\n\nForget the stellar partnerships, what about the competition? Within the well-differentiated industry of Hardware, Storage, and Peripherals are 40 companies ranging from Apple to Ricoh. The direct competitor to watch for is Supermicro (SMCI). SMCI, however, makes no mention of cloud-readiness in its press release (coincidentally publicized merely hours after OSS, on the very same day - nervous, perhaps?). \n\nOn the other hand, the OSS 4UV can connect almost any Gen 4 server to eight A100 PCIe GPUs and two NICs, also offering a complete NVIDIA GPU **cloud-ready solution** with the OSS 4UV pre-installed in an OSS 2U-EOS-4a Gen 4 server.\n\nOFFERING\n\nPremarket Tuesday, March 2nd, OSS announced a 1.5M share offering to an institutional investor. Remarkably, OSS showed strength into the mid-morning, after opening at $7.56 it hit a high of $8.79 before succumbing to general market weakness and closing at $7.91, down 11% (see daily chart below). A green candle the day after an offering? Sounds like a great dip to buy. \n\nTECHNICALS\n\nhttps://preview.redd.it/tf412r4quok61.jpg?width=1522&amp;format=pjpg&amp;auto=webp&amp;s=d061155dc969bb6663af3fd38c9d1014ed799264\n\nVolume has been readily coming in. A stock that previously traded around 40k volume is now averaging big volumes, over 1M+ daily. What happened? I think institutions are beginning to catch on. Currently above the 5, 20, and 50 moving averages, OSS bounced nicely off the 20 MA during a big intra-day rally (40%+) on March 1st, 2021 hitting a fresh 52-week high of $9.50 without apparent news. \n\nCONCLUSIONS\n\nInvestors should ask the question, \"where could this company be in 2 to 3 years?\" With OSS, we have a case study in a profitable company meeting big revenue expectations relatively soon after IPO, invaluable partnerships, military contracts, and anticipatory growth in the industry and beyond.\n\nPOSITIONS: I am in for 1300 shares at $8.60.",
        "subreddit": "pennystocks",
        "title": "One Stop Systems ($OSS) DD: supercomputing is the future",
        "url": "https://www.reddit.com/r/pennystocks/comments/lwe8t3/one_stop_systems_oss_dd_supercomputing_is_the/",
        "created": 1614752744.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1614793616,
        "id": "lwzt2s",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "i have a heavy tech weighted portfolio and while I'm not overly worried I'm wondering if I should be adding JPM and BAC and more industrials to my portfolio or maybe even just adding to my Total Market index.\n\nI realize people are running scared from tech now due to various reasons and the rising 10 yr.\n\nI'm in it though for at least 10 years or more.  Should I be worried about tech and chasing recent market rotations?  I thought that wasn't the thing to do? I feel like I'd be betraying my tech 😆!!  Just joking.\n\nI also see that on average banks and industrials have been rather bad performers for over a decade.\n\nI realize they're \"beat up\", but why would people be moving their money into banks if they don't return much??\n\nIs it that they \"have no where else to put their money\" when rotating from tech?\n\nI realize also it's mostly the big money or smart money that moves the market and not small timers like me.\n\nSo should I just hold my tech?\n\nI'm not just tech though, I'm diversified.\n\nHere are some holdings for example.\n\nIndexes about 18% of portfolio combined\n\n FSKAX AARK VTWG FDIS FSPTX\n\n\nStocks. About up to 5% each\n\nAAPL MSFT make up 18% combined.\n\nUp to 5% each. \n\nCRWD HON NEE NVDA SQ PYPL TSLA UNP AVGO ASML LRCX TMO UNH TSM DG WMT",
        "subreddit": "stocks",
        "title": "Should you chase financials and industrials, etc?",
        "url": "https://www.reddit.com/r/stocks/comments/lwzt2s/should_you_chase_financials_and_industrials_etc/",
        "created": 1614822416.0
    },
    {
        "author": "TeddyToothpick",
        "created_utc": 1615725728,
        "id": "m4unh4",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "This probably isn't ground breaking stuff here, but the next gen of tech, gaming, software looks to be geared towards VR/AR. It's taken a long time, but theres finally real progress and what will follow is mainstream adoption, and not just in online gaming. The possibilities are pretty endless, like people are actually buying pizzas in decentraland ffs. (R.I.P REITs)\n\n\nThis new generation of how we can interact and monetize the internet is really picking up speed, with the likes of crypto and NFTs, decentraland etc getting a lot of attention. Granted a lot of that will fall away when the big boys like facebook and apple come stomping through, apple releasing their apple glasses very soon, but for now its getting headlines. \n\nWhat i'm looking out for is the smaller companies that are ready to hit the big time (no shit). Whether they supply the components or raw materials or software, there quite a few avenues to explore.\n\nThere's not many stocks that i've found that interest me (a lot like NVDA are already well known etc) so wondering if anyone has found a gem theyd like to share. \n\nI've already looked at CETX, ESI.PA and of course VUZI which has been getting a load of hype lately.\n\nAny thoughts?",
        "subreddit": "smallstreetbets",
        "title": "AR/VR companies.",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/m4unh4/arvr_companies/",
        "created": 1615754528.0
    },
    {
        "author": "gonfreeces1993",
        "created_utc": 1616874282,
        "id": "mel2p0",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "APPL\n\nATVI\n\nGOOG\n\nGOOGL\n\nIWM\n\nSPY\n\nQQQ\n\nBGS\n\nMAIN\n\nLOW\n\nCSWC\n\nVYM\n\nPG\n\nT\n\nABBV\n\nMMM\n\nJPM\n\nBRK.A\n\nBRK.B\n\nJNJ\n\nPFE\n\nPM \n\nIBM\n\nKMI\n\nMO\n\nEPB\n\nENB\n\nO\n\nNHI\n\nHEP\n\nSPXU\n\nVXUS\n\nVTI\n\nVOO\n\nWBA\n\nDIS\n\nWMT\n\nNVDA\n\nTSLA\n\nAMZN\n\nCOKE\n\nSPXL\n\nTQQQ\n\nThis is basically just a list from a lot of Google searches and some companies that I just like in general. I'm looking for any other suggestions, or critiques. The goal, if I do come into some money,  is to not have to work ever again. So trustworthy dividend stocks and \"safe\" growth. I'll of course put a percentage towards risky fun stuff, but that's not what this post is about. My first post was removed for a certain stocks name being used, so I omitted it. I think you can safely assume what I'm referring to though.",
        "subreddit": "stocks",
        "title": "If I Make Money From A Certain Event That's Going On, I Have A List Of Stocks To Buy Into After. I'm Looking For Suggestions Or Critiques",
        "url": "https://www.reddit.com/r/stocks/comments/mel2p0/if_i_make_money_from_a_certain_event_thats_going/",
        "created": 1616903082.0
    },
    {
        "author": "growthinvestor123",
        "created_utc": 1615672260,
        "id": "m4gcs0",
        "num_comments": 9,
        "num_crossposts": 1,
        "selftext": "[Plus.ai](https://Plus.ai), &gt; $1bn valuation (likely more now w/ the interest in the sector) autonomous driverless truck  company, recently announced that it would equip its systems [w/ NVIDIA](https://www.thetrucker.com/trucking-news/equipment-tech/self-driving-truck-tech-developer-plus-to-launch-next-gen-system-for-heavy-duty-trucks).\n\nBuried in the release - Apparently it also recently partnered with $BB for QNX **and** AWS. Some of you may have already seen this but this was news to me.\n\nSaw a lot about partnerships from Blackberry with OEMs but one of the criticisms from the laymen is that its software has been around a while with old school manufacturers like GM / Ford (implying it's stale) - It says a lot that a cutting edge domestic autonomous driving business l[eads with $BB QNX](https://www.autofutures.tv/2020/11/17/plus-chooses-blackberry-to-power-its-automated-driving-system-for-heavy-duty-trucks/).\n\nIn addition - We all know electtric vehicles and autonomous driving is hot. But of all the applications, long-haul trucking, where routes are defined and largely over monotonous, consistent highway, are probably going to be the soonest to be completely disrupted.\n\nTLDR - Man I love this stock. $BB to the mooooooooon!! But in a steady, safe, and responsible fashion, as Papa Chen would want.",
        "subreddit": "wallstreetbets",
        "title": "New $BB Partnership - Heavy Truck Autonomous Driving",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m4gcs0/new_bb_partnership_heavy_truck_autonomous_driving/",
        "created": 1615701060.0
    },
    {
        "author": "Mr-Pink_",
        "created_utc": 1615972423,
        "id": "m6wb43",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "What Warren Buffet calls the ‘economic moat’ we refer to as ‘competitive advantage’. The term refers to a companies ability to keep competition at bay over the long term life cycle of the business, maintain majority market share and favourable economics. What force is stopping or limiting the competitions capability to compete? What stops the competition from cutting their lunch? A company can have one or more of the five types of economic moats: intangible assets, cost advantage, efficient scale, switching costs, network effect. \n\nHere are Some examples of the economic moats/competitive advantage of some companies (or what I believe to be the moat) :\n\nApple — Apple’s brand power, the belief in its product superiority by consumers and its ability to create a large cult following, allows the company to price its products at double the competitions and still outsell the competition in the market place. \n\nCoca-Cola — The powerful brand behind Coke gives them the ability to demand higher margins and outsell the competition. Coke the brand is directly associated with happiness. Coke is a product where the customer will reject the competitions equivalent at a discount, and buy the Coke product at a premium. \n\nIntel — Intels vertical integration and its operations across the entire supply chain line in the chip sector, gives intel the ability to outdo the competition on every level and hold majority market share. One year intel will focus on chip innovation, the next year it will focus on production innovation and capabilities. Despite fierce competition from AMD and NVIDIA, intel has maintained its market share of the industry.\n\nAmazon.com — Amazon is an operating system for society and daily lives of individuals. It has created a cult following who truly believe Amazon is a necessity of life equal to water, food and oxygen. Some Amazon prime members have and do become suicidal when they lose access to their account. The brand has made itself into an integral part of the day to day lives of individuals, and has made life without Amazon inconceivable for its customers. \n\nFacebook — Facebook takes advantage of network effects, product and brand power. As more people start using Facebook, then more people will be attracted to Facebook because their friends and everyone they know use it, it becomes a social necessity. Facebooks product and brand is so powerful, even its strongest and fiercest critics still use it. \n\n[Economic Moats](https://www.investopedia.com/terms/e/economicmoat.asp)",
        "subreddit": "investing",
        "title": "Economic Moat/Competitive advantage",
        "url": "https://www.reddit.com/r/investing/comments/m6wb43/economic_moatcompetitive_advantage/",
        "created": 1616001223.0
    },
    {
        "author": "Catinzahat",
        "created_utc": 1615876948,
        "id": "m62wg1",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": " \n\nWhat is the true intrinsic core value of a stock? Is it the price a stock is selling for on the market? sure if you want to sell it. But what about people holding a stock; what is the value of a stock to it's holders? The value of a stock you are holding is not it's perception by the general public or it's past performance - those things can change at any moment (technically everything can change but some change more than others). The true core intrinsic value of a stock is it's predictive value + the value of it's assets, patents and other transferable intellectual and materialistic property of a company. Always assume the predictive value to be zero. Then what you have left is the brick, gold, metal and cartoon characters like the Avengers and Batman. Marvel may go bankrupt one moment but may rise again in the future thanks to it's copyrighted characters and patents. The value left over is what someone is willing to pay for a hostile takeover or a merger.\n\nIf Disney goes bankrupt today then it's assets will still have value. If Microsoft goes bankrupt, if AAPL goes bankrupt. All these companies will have value to their stocks because not only are these guys the leaders in technology but they are also the inventors. These guys are the #1 authority in not just technology and communication; they also share a cozy relationships with governments around the world because they have all the knowledge and data. Netflix was chill when it was new as it was the leader and the inventor, but it's inventions could easily be copied - now everyone is doing what they were long ago. MSFT and AAPL will not go bankrupt that easily because too many powerful people are invested into it. We ourselves are invested into it's technology and above all they have the power to change their own perception and predictive value. They can morph the environment around them to make it adaptable for them to survive.\n\nI already explained Disney and MSFT and AAPL. Verizon is very similar as it has towers and contracts throughout America. Those contracts alone amount to billions. What does TSLA have (an example with a very high PE ratio). TSLA has Elon Musk. Elon Musk is sending rockets into space to create a network for fast internet that anyone in the world can use. This internet may end up coordinating with and having a close relationship with TSLA; thus giving TSLA vehicles an edge in self-driving AI among other things. TSLA has and continues to work on patents that are revolutionizing battery tech. One can safely say that TSLA is not only a technology hub but it is also a \"creator\". So in short we can say that assets that are sellable and transferrable in the now and in the future define a stock's value. TSLA is an abnormal example because unlike MSFT or AAPL we don't know the true potential of it's future inventions. But it's predictive value must be higher than zero because it is not a company that is sitting around doing nothing. We do know that the guy behind it is a creator and he likes to hire engineers who feel the same way. This is why this stock can grow infinitely more. I am 5% into TSLA right now.\n\nNow let's talk about the idea of Americans investing in Chinese companies. What happens if NIO goes bankrupt, can an American take over the company? No they cannot. Can NIO merge with another company if it wants to? no not without China's approval. Are NIO and XPENG #1 in creating technology that can be sold off or transferred? no not at all. They have a contract with Nvidia but Nvidia is a separate company. How reliable are their revenue figures? we have no idea because these companies make up things all the time - Americans cannot regulate or monitor them at all. Why are they selling shares in US then? because people make money off of it. Can the companies effect environment in America to make it more suitable for them? no but they can do it in China. Again, for the Chinese these might be good investments.\n\nWhat happens if the thing in Myanmar ends up leading to a conflict between China and America? Chinese companies get sanctioned. Your stock hits rock bottom over night. Americans have about zero protection for their stock holdings in China. You can't own land or a company without a Chinese citizen in charge. These guys aren't creating anything so not like they have value beyond their assets or name. China isn't Afghanistan that will bend over backwards to please American shareholders.\n\nWhat is happening right now is that these companies are being bumped up overnight by a select few hands and then just like your average pyramid scheme - people are throwing their money into them. Sure a stock can rise and get you profit in the long run but these stocks only have value because of hype and perception - which amounts to nothing at the core. China is already sanctioning BABA - it has not been hit by sanctions from America just yet. Look at what happened to Huawei. Tech is the future no doubt, but if you are looking for stable growth rather than a reverse-buffet then I suggest going into an ETF like QQQ.\n\nYou are walking on a thin rope when you invest in companies we are about to go to war with. These companies are riding along the TSLA hype train but they have nothing of their own to offer. They have bots spamming our forums convincing people to become future bag holders. Look at Lenovo's yearly net revenue; around 15 billion a year. NIO's net revenue is less than a billion. Lenovo is worth 15 billion in marketcap whereas NIO is worth 70 billion lol. How many people outside China use Lenovo laptops vs NIO cars? I wouldn't invest in either company but you get what I mean. This will probably be my last post. But once again I recommend investing in an ETF like QQQ. I expect big gains in the future. Don't become the lost generation. Especially us millennials; we have suffered a lot at the hands of manipulators and liars.\n\n[https://en.wikipedia.org/wiki/Lost\\_Decade\\_(Japan)](https://en.wikipedia.org/wiki/Lost_Decade_(Japan))",
        "subreddit": "wallstreetbets",
        "title": "Why I would refrain from investing in Chinese companies like NIO and BABA. And instead invest in stable American tech",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m62wg1/why_i_would_refrain_from_investing_in_chinese/",
        "created": 1615905748.0
    },
    {
        "author": "familydroid02",
        "created_utc": 1614699316,
        "id": "lw4pp6",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "so my ape brain wants to sell my nvidia so i can get in on gme \n\nmaybe i can lose it fast with gme, nvidia was supposed to move a little over this gfx card houseshit...but looks stale atm.. ima thinking get out of it and come back later \n\ntoughts , critizims, insults, all are welcome",
        "subreddit": "wallstreetbets",
        "title": "Sell Nvidia to Buy GME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lw4pp6/sell_nvidia_to_buy_gme/",
        "created": 1614728116.0
    },
    {
        "author": "PolarPole",
        "created_utc": 1614801303,
        "id": "lx2sm5",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Opinion on nvidia",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx2sm5/opinion_on_nvidia/",
        "created": 1614830103.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1614798971,
        "id": "lx1wss",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "NVDA 03/05 $555 gamble",
        "url": "https://i.redd.it/2ff05zzv4vk61.jpg",
        "created": 1614827771.0
    },
    {
        "author": "spade883",
        "created_utc": 1617153592,
        "id": "mguvv1",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "If you all are investing in Vanguard Information Technology ETF (VGT) I would highly encourage you to look into Fidelity MSCI Information Technology Index ETF (FTEC). FTEC has virtually the same portfolio composition as VGT but with a lower expense ratio. FTEC expense ratio is 0.08% while VGT is 0.10%.. To make this post even better FTEC has a dividend yield of 1.01% while VGT's is 0.76%. Let me know your thoughts!\n\n&amp;#x200B;\n\nThe top ten companies for FTEC are:\n\nAAPL Apple Inc  19.66%\n\nMSFT Microsoft Corp  15.83%\n\nV Visa Inc Class A  3.39%\n\nNVDA NVIDIA Corp  3.21%\n\nMA Mastercard Inc A 3.00%\n\nPYPL PayPal Holdings Inc 2.75%\n\nINTC Intel Corp  2.45%\n\nADBE Adobe Inc  2.09%\n\nCRM Salesforce.com Inc 1.87%\n\nCSCO Cisco Systems Inc 1.80%\n\n&amp;#x200B;\n\nThe top ten companies for VGT are (couldn’t find the breakdown):\n\nApple Inc.\n\nMicrosoft Corp.\n\nNVIDIA Corp.\n\nVisa Inc.\n\nMastercard Inc.\n\nPayPal Holdings Inc.\n\nIntel Corp.\n\nAdobe Inc.\n\nsalesforce.com Inc.\n\nBroadcom Inc.",
        "subreddit": "investing",
        "title": "A better ETF than VGT.... FTEC!",
        "url": "https://www.reddit.com/r/investing/comments/mguvv1/a_better_etf_than_vgt_ftec/",
        "created": 1617182392.0
    },
    {
        "author": "PBJBlitzkrieg",
        "created_utc": 1615351041,
        "id": "m1ph0m",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "The Most Undervalued SPAC of 2021, SVAC.\n\nStarboard Acquisition ($SVAC - $10.06) – Cyxtera\n\nOVERVIEW :\n\nCyxtera, the 3rd largest data center group in the world, has agreed to go public via Starboard Acquisition Corp ($SVAC). This may be one of the most unglamorous and un-exciting SPAC mergers to date, but my belief is that this is one of the cleanest, if not the cleanest, companies to go public through a SPAC, and will ultimately be a major player in the market within the data center category.\nFirst, let’s start with Cyxtera’s business model. What you’re looking at here is two-fold. Cyxtera is both a REIT as a large owner of 61 data centers across 29 markets on 4 continents, but also an integrated tech company – providing colocation (equipment, space, and bandwith rentals) to their customers. In short, they house data – literally and technologically. The business model is relatively simple. Customers sign contracts (guaranteed income) for data housing in one or multiple of Cyxtera’s facilities, and in return gain flexibility and access to agility for their data needs. Every large company in the world uses the types of facilities and technology that Cyxtera provides – from State Farm to the New York Yankees to Nvidia.\n\nFINANCIALS &amp; STRATEGY:\n\nDiving into some deeper data about Cyxtera, we can learn about the financial health of Cyxtera, and how they utilize their revenues that they collect through their contracts. First, and extremely importantly, Cyxtera is already both profitable and operating at scale. 2020 revenues of $690M and adjusted EBITDA of $213M is a showstopper for a company that is coming to market through a SPAC, many of which are pre-revenue and have a long ramp time to profitability. The deal with Starboard Acquisition values Cyxtera at $3.4 Billion – with only room for growth – as the need for the services that Cyxtera offers only growing substantially year over year.\nStaggeringly, only 3% of Cyxtera’s revenue go towards customer retention. For anybody not in marketing, that is an absolutely astounding number. Only needing 3% of your revenue to retain customers at scale would have any financial executive or investor frothing at the mouth and falling over themselves to be a part of it. In turn, 70% of Cyxtera’s revenue goes towards growth, expansion, and development. That is in a class of it’s own, truly. Those dollars go towards building an extensive partner ecosystem, built efficiently through a go-to-market strategy that creates a symbiotic relationship between Cyxtera and their partners. Partners of Cyxtera enjoy integration capabilities, meaning they can sell Cyxtera’s services as a part of their own, expanding the suite of t ools they can offer to prospective clients. The closer you can get to a one stop shop in the technology space, the more likely you are to attract business – this is the overall goal.\n\nDid I mention that the management of $SVAC (not Cyxtera) has already succ essfully run and sold a similar companyinthepast?TheexecutivechairmanpreviouslyranTerremarkWorldwide,whichsold to Verizon, and coincidentally, ultimately ended up in the hands of the largest player in the data center space, Equinix.\n\nMARKET COMPARISONS:\n\nLogically, it’s important to evaluate the space that any new public company is entering. In Cyxtera’s case, they are the 3rd largest player. The largest players are $EQIX and $DLR. For the purposes of this writeup, we will only look at comparisons from a market perspective.\n\n$EQIX\nMost recent closing price: $622.71 Shares outstanding: 89M\nMarket Cap: $55 Billion Institutional Ownership %: 95%\nEqix is a massive data center player, arguably the best there is. Here, it’s important to compare outstanding shares to the number Cyxtera will have. In this case, Cyxtera will have an approximately equal number of shares – and has rapidly growing institutional ownership, with 82% positive change in recent weeks on $SVAC and a total % of 59% currently.\n\n$DLR\nMost recent closing price: $135.08 Shares outstanding: 280M\nMarket Cap: $37 Billion Institutional Ownership %: 96%\nDLR is the 2nd largest data center player. They have over 3x the outstanding shares of Cyxtera &amp; $EQIX. You’ll notice that DLR is trading at 13x the price that $SVAC sits today. These are not perfect comps, but this is what the world values these types of companies at. These aren’t even outlandish valuations – and data centers often carry very respectable dividends. In this case, 3.44%.\nPlayers in this space typically trade at 6-9x their sales, approximately 7-23x free cash flow, and over 20x EBITDA. As it stands, considering the nature of SPACs, $SVAC is not anywhere near these numbers. But, Cyxtera will get there – the industry itself has proven it over and over. The growth in share price over time is inevitable.\n\nMERGER:\n\nThe final piece to touch on for now will be how this business combination will take place. This is a VERY special SPAC deal and has incentives that have gone unnoticed by the market. Shares of $SVAC include a 1/6 warrant. The units include 1/6 warrant in ADDITION to a share to compensate for the risk of holding through the business combination. This makes $SVAC set up in a better space than almost any other SPAC trading near NAV price. In addition, if the ticker does poorly as it moves towards the business combination, you’ll receive additional warrants to compensate for the risk. These units are excessively attractive.\nThe deal itself, my goodness. Insider shares are locked for a year OR until the stock hits $12. This means if you get in below this number, you are very unlikely to suffer through dilution/redemption that will create downwards pressure.\n\nCONCLUSION:\n\nUltimately – the decision is yours to make. Personally – I like the stock. This is an opportunity to purchase a stake in a company that is significantly undervalued and unnoticed at it’s current price, and with some of the cleanest financials on the market, it’s hard to ignore the safety that this ticker brings – especially welcome safety in a tumultuous time in world history. Adjusted to include the warrants that are included in the units, you’re looking at the lowest priced SPAC that has announced a deal, period. The lowest price, with one of the highest and most stable potentials of any SPAC out there. Data centers are cash cows, and this one hasn’t even begun to moo in the market. I see potential for a huge amount of growth in a rapid period, with very competent management and a solid market strategy leading the way. At $10, there’s not a better deal on the market. Analysts have called the potential ‘explosive’. I call it kingmaking.\n\nOh – if you aren’t convinced yet - Cyxtera also announced expansion today. And the market missed it, because no ticker was mentioned. Check it out here:\n\nhttps://www.businesswire.com/news/home/20210309005171/en/Cyxtera-Expands-Enterprise-Bare- Metal-Service-to-Amsterdam-and-Frankfurt\n\nREFERENCE MATERIAL:\n\nhttps://seekingalpha.com/article/4412584-svac-market-overlooking-tontine- warrants?utm_campaign=twitter_automated&amp;utm_content=article&amp;utm_medium=social&amp;utm_sourc e=twitter_automated\n\nhttps://www.sec.gov/Archives/edgar/data/1794905/ 000110465921025980/tm217463d1_ex99-2.htm\n\nhttps://www.fool.com/investing/2021/03/06/a-major-data-center-player-is-going-public- through/?source=eptyholnk0000202&amp;utm_source=yahoo- host&amp;utm_medium=feed&amp;utm_campaign=article",
        "subreddit": "investing",
        "title": "The most undervalued SPAC left, SVAC.",
        "url": "https://www.reddit.com/r/investing/comments/m1ph0m/the_most_undervalued_spac_left_svac/",
        "created": 1615379841.0
    },
    {
        "author": "Complete-Zucchini-87",
        "created_utc": 1615922873,
        "id": "m6h6ln",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I'm paranoid. Why is that? Why they look **exactly the same?**",
        "subreddit": "options",
        "title": "AMD and NVDA have exactly the same charts!",
        "url": "https://www.reddit.com/r/options/comments/m6h6ln/amd_and_nvda_have_exactly_the_same_charts/",
        "created": 1615951673.0
    },
    {
        "author": "pltr_gang_rise_up",
        "created_utc": 1615311456,
        "id": "m1bokv",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "My fellow autists, degenerates, gambling addicts, and of course, my dear retards: It is I - u/pltr_gang_rise_up and I am here to share with you a true post in the spirits of WallStreetBets and would like to put on your radar - SOXL. \n\n**Backstory:**\n\n**Semiconductors,** as most are aware, are in short supply. There has been some movement by world leaders to improve supply chains in order to get the semiconductors to the place they need to be. Some car manufacturers have had to cut production in vehicles due to this ongoing issue. I believe this issue will be fixed in due time, but probably not in the immediate future. \n\n**What is SOXL?**\n\n**SOXL** is a Leveraged ETF that invests in the biggest semiconductor manufacturers in the world (INTC, AMD, QCOM, TSM, etc). \n\nBe careful, this is a \"Leveraged\" ETF - and therefore it's rather aggressive and aiming for high returns. Do some more research here if you want. Essentially it means, if the sector of semiconductors does well, the fund will do well. \n\n**Breakdown:**\n\nNow, they recently had a 15:1 split on their shares, which were trading at about $636 in February. This brought the public float to **99.40M.**\n\nWhen looking into a company, I like to start with what they own, followed by who owns them.\n\n**What they own:**\n\nHere is a breakdown of the assets that SOXL owns with their 1.46bn market cap:\n\nDreyfus Government Cash Management Institutional Shs\t11.00%\n\nFinancial Square Treasury Instruments Fund FST Shares\t9.39%\n\nBroadcom Inc.\t5.22%\n\nQualcomm Inc.\t4.96%\n\nIntel Corp.\t4.94%\n\nTexas Instruments Inc.\t4.88%\n\nNVIDIA \t4.67%\n\nMicron Technology Inc.\t2.81%\n\nTaiwan Semiconductor Manufacturing Co. Ltd. ADR\tTSM\t2.69%\n\nAnalog Devices Inc.\t2.54%\n\nApplied Materials Inc.\t2.51%\n\nLam Research Corp.\t2.50%\n\nKLA Corp.\t2.41%\n\nNXP Semiconductors N.V.\t2.40%\n\nAdvanced Micro Devices Inc.\t2.37%\n\nASML Holding N.V.\t2.22%\n\nMicrochip Technology Inc.\t2.16%\n\nXilinx Inc.\t2.01%\t\n\nMarvell Technology Group Ltd.\t1.92%\n\nSkyworks Solutions Inc.\t1.53%\n\nTeradyne Inc.\t1.20%\n\nQorvo Inc.\t1.14%\n\nMonolithic Power Systems MPWR\t0.99%\n\nON Semiconductor Corp.\t0.81%\n\nEntegris Inc.\t0.78%\n\n&amp;#x200B;\n\n**Now, I'm not sure what the first two are, but that throws up a potential flag.** These two entities represent nearly 20% of the portfolio owned. It could be nothing more than some type of government investment in such a company, as it is critical right now. \n\n**Who owns them?:**\n\nLooks like mostly hedge funds. No one really of note other than Citadel and Susquehanna. \n\n**Short Interest:**\n\nNot a heavily shorted stock. About 3.4m shares are available to short with a ratio of about 25%.\n\n**Technicals** (got me excited):\n\n&amp;#x200B;\n\nhttps://preview.redd.it/a7ndly6se1m61.png?width=1018&amp;format=png&amp;auto=webp&amp;s=698eae9b1d4ff4726eac546d2a6a8f4bb753fbc6\n\nHere we have a bounce just under the (white) 200sma. On this 4h chart, the bottom represents the buy/sell volume over time. the middle represents where we're at in terms of a squeeze. You also can see heavy buy volume at the bottom followed by a potential turn up ahead in the next few days. TONS of buy volume since the beginning of the month. \n\nThe daily was also looking nice:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/id2j5879f1m61.png?width=452&amp;format=png&amp;auto=webp&amp;s=23cbb6a2b7af021cadc9d35a9d2f8413c636cb90\n\nThere is an AIM on the indicator, meaning at this point the next logical step might be a shot to the upside in the next week. There was heavy call and put volume on the $37 strike, which seemed quite coincidental. Why that level? There were more calls than puts. The OI is still over 10k on the option. \n\nMy target is $42 by 3/19. But I encourage you to do your own analysis and come up with your own targets. I happen to think this is a good potential trade. I think in this case, the probability in my belief is to the upside.",
        "subreddit": "wallstreetbets",
        "title": "SOXL will rock your SOXL",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m1bokv/soxl_will_rock_your_soxl/",
        "created": 1615340256.0
    },
    {
        "author": "nprovein",
        "created_utc": 1615862392,
        "id": "m5z34p",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Hey, with the rumor about the Intel XE discrete gpu on the horizon, would it be a good idea to bet on Intel stocks? Supposedly some info leaked that they may be able to compete against the AMD 6800 and Nvidia 3070 in terms of performance. At the same time, Intel owns their own fabs so the the chip production shortage may not hit them as hard as it did AMD and Nvidia. \n\nWhat are your guy's thoughts on the matter?",
        "subreddit": "Wallstreetbetsnew",
        "title": "Intel betting question?",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/m5z34p/intel_betting_question/",
        "created": 1615891192.0
    },
    {
        "author": "Mr-Pink_",
        "created_utc": 1615972657,
        "id": "m6wd6b",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "What Warren Buffet calls the ‘economic moat’ we refer to as ‘competitive advantage’. The term refers to a companies ability to keep competition at bay over the long term life cycle of the business, maintain majority market share and favourable economics. What force is stopping or limiting the competitions capability to compete? What stops the competition from cutting their lunch? A company can have one or more of the five types of economic moats: intangible assets, cost advantage, efficient scale, switching costs, network effect. \n\nHere are Some examples of the economic moats/competitive advantage of some companies (or what I believe to be the moat) :\n\nApple — Apple’s brand power, the belief in its product superiority by consumers and its ability to create a large cult following, allows the company to price its products at double the competitions and still outsell the competition in the market place. \n\nCoca-Cola — The powerful brand behind Coke gives them the ability to demand higher margins and outsell the competition. Coke the brand is directly associated with happiness. Coke is a product where the customer will reject the competitions equivalent at a discount, and buy the Coke product at a premium. \n\nIntel — Intels vertical integration and its operations across the entire supply chain line in the chip sector, gives intel the ability to outdo the competition on every level and hold majority market share. One year intel will focus on chip innovation, the next year it will focus on production innovation and capabilities. Despite fierce competition from AMD and NVIDIA, intel has maintained its market share of the industry.\n\nAmazon.com — Amazon is an operating system for society and daily lives of individuals. It has created a cult following who truly believe Amazon is a necessity of life equal to water, food and oxygen. Some Amazon prime members have and do become suicidal when they lose access to their account. The brand has made itself into an integral part of the day to day lives of individuals, and has made life without Amazon inconceivable for its customers. \n\nFacebook — Facebook takes advantage of network effects, product and brand power. As more people start using Facebook, then more people will be attracted to Facebook because their friends and everyone they know use it, it becomes a social necessity. Facebooks product and brand is so powerful, even its strongest and fiercest critics still use it. \n\n[Economic Moats](https://www.investopedia.com/terms/e/economicmoat.asp)",
        "subreddit": "StockMarket",
        "title": "Economic Moats/Competitive Advantage",
        "url": "https://www.reddit.com/r/StockMarket/comments/m6wd6b/economic_moatscompetitive_advantage/",
        "created": 1616001457.0
    },
    {
        "author": "Short_Squeeze_Master",
        "created_utc": 1615220323,
        "id": "m0j85r",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "$NVDA Institutional short interest on the rise. Major Long opportunity. Strong support here. Can anyone say short squeeze?\n\nNVDA is the Next GME",
        "subreddit": "investing_discussion",
        "title": "$NVDA Institutional short interest on the rise. Major Long opportunity. Strong support here. Can anyone say short squeeze? NVDA is the Next GME",
        "url": "https://www.reddit.com/r/investing_discussion/comments/m0j85r/nvda_institutional_short_interest_on_the_rise/",
        "created": 1615249123.0
    },
    {
        "author": "Elighttice",
        "created_utc": 1615633261,
        "id": "m445og",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Is Nvidia overpriced?",
        "url": "https://i.redd.it/kagxqmpn1sm61.jpg",
        "created": 1615662061.0
    },
    {
        "author": "Tomusina",
        "created_utc": 1615244431,
        "id": "m0slwm",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Can someone explain to me what happened with NVIDIA today?",
        "url": "https://www.reddit.com/r/stocks/comments/m0slwm/can_someone_explain_to_me_what_happened_with/",
        "created": 1615273231.0
    },
    {
        "author": "RewtDooDoo",
        "created_utc": 1617197929,
        "id": "mh6b92",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "https://ca.finance.yahoo.com/news/hut-8-taps-luxor-mining-113000852.html\n\nLooks like HUT is forming a partnership to utilize their recently purchased Nvidia CMP chips to mine ethereum while also utilizing a blockchain switching algorithm that determines the most profitable alt coins to mine and switches accordingly.\n\nThis is not financial advice, do your own dd.\nPosition 400 shares @ 9.66",
        "subreddit": "CanadianInvestor",
        "title": "HUT8 taps Luxor mining for hashrate execution",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/mh6b92/hut8_taps_luxor_mining_for_hashrate_execution/",
        "created": 1617226729.0
    },
    {
        "author": "komoru-1",
        "created_utc": 1615222002,
        "id": "m0jvo7",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "They were in ITM when I bought them but now they’ve take a hit. I’m going to hold but would it be wiser to take the loss and invest somewhere else? I have calls that end mid April for snowflake, nvidia, and Apple. The snow one was because there earnings at first did me right but I held them too long but the other two I felt would rise nicely. A little worried holding them at the moment but probably just gonna ride it out but just wondering if you guys think it’s worth it or a waste.",
        "subreddit": "stocks",
        "title": "I have calls on mostly tech that expire in April.",
        "url": "https://www.reddit.com/r/stocks/comments/m0jvo7/i_have_calls_on_mostly_tech_that_expire_in_april/",
        "created": 1615250802.0
    },
    {
        "author": "ickygerm",
        "created_utc": 1614802906,
        "id": "lx3dpl",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I'm fairly new to options trading and over the past few weeks I've been dabbling in different strategies with a relatively small amount of cash just to get my feet wet with the concepts. Having been burned by a couple debit spreads gone south (thanks NVDA) I wanted to try out credit spreads. \n\nLet's say in this scenario I sell a 12.5/12 put credit spread expiring 3/5 on MRO for $.37 credit and $.13 held as collateral. I'm bullish on MRO and it's currently at $11.82. \n\nAm I retarded for selling an ITM spread and thinking that it won't be profitable for the buyer to exercise even if the short leg is ITM on expiration? I feel like I'm missing something outrageously obvious but I'm not sure.\n\nDon't hold back, tell it to me straight.",
        "subreddit": "options",
        "title": "ITM Put Credit Spread question",
        "url": "https://www.reddit.com/r/options/comments/lx3dpl/itm_put_credit_spread_question/",
        "created": 1614831706.0
    },
    {
        "author": "Short_Squeeze_Master",
        "created_utc": 1615403879,
        "id": "m25wqm",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "$NVDA Institutional short interest on the rise. Major Long opportunity. Strong support here. Can anyone say short squeeze? NVDA is the Next GME",
        "url": "https://www.reddit.com/r/investing/comments/m25wqm/nvda_institutional_short_interest_on_the_rise/",
        "created": 1615432679.0
    },
    {
        "author": "Wet-Monies",
        "created_utc": 1617050631,
        "id": "mfz21r",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "NVDA and SENS stock analysis",
        "url": "https://www.reddit.com/r/investing/comments/mfz21r/nvda_and_sens_stock_analysis/",
        "created": 1617079431.0
    },
    {
        "author": "Vulgar-Captain",
        "created_utc": 1617057111,
        "id": "mg1dxu",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hi wonderful ppl,\n\nI’m wondering if it starts to make sense to swap out ARKQ with two slightly lower return but much lower risk sector ETFs.\n\nI liked ARKQ bcoz it’s inclusive off both growth stars (read TESLA) and some staple one with ambitions to rock, like Deere, Komatsu and Nvidia. And of course it brings in 3D, proto and Autodesk.\n\nBut ROBO + FIDU can possibly do the same combo, with a lower rate. FIDU includes 3M, Deere, CAT, Honeywell, etc. \n\nThoughts?",
        "subreddit": "stocks",
        "title": "Replace ARKQ with FIDU&amp;ROBO?",
        "url": "https://www.reddit.com/r/stocks/comments/mg1dxu/replace_arkq_with_fidurobo/",
        "created": 1617085911.0
    },
    {
        "author": "Short_Squeeze_Master",
        "created_utc": 1615415412,
        "id": "m2at8a",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "$NVDA Institutional short interest on the rise. Major Long opportunity. Strong support here. Can anyone say short squeeze? NVDA is the Next GME",
        "url": "https://www.reddit.com/r/investing/comments/m2at8a/nvda_institutional_short_interest_on_the_rise/",
        "created": 1615444212.0
    },
    {
        "author": "norcalnatv",
        "created_utc": 1615923054,
        "id": "m6h93l",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "why NVDA ARM acquisition should be approved",
        "url": "https://www.reddit.com/r/investing/comments/m6h93l/why_nvda_arm_acquisition_should_be_approved/",
        "created": 1615951854.0
    },
    {
        "author": "norcalnatv",
        "created_utc": 1615924807,
        "id": "m6hx1x",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "NVDA + ARM should be approved",
        "url": "https://www.reddit.com/r/investing/comments/m6hx1x/nvda_arm_should_be_approved/",
        "created": 1615953607.0
    },
    {
        "author": "Short_Squeeze_Master",
        "created_utc": 1615217209,
        "id": "m0i1lq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "$NVDA Institutional short interest on the rise.",
        "url": "https://www.reddit.com/r/investing/comments/m0i1lq/nvda_institutional_short_interest_on_the_rise/",
        "created": 1615246009.0
    },
    {
        "author": "ABAPatil",
        "created_utc": 1617212430,
        "id": "mhbeer",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "NVDA: why option value so less increased?",
        "url": "https://www.reddit.com/r/options/comments/mhbeer/nvda_why_option_value_so_less_increased/",
        "created": 1617241230.0
    },
    {
        "author": "norcalnatv",
        "created_utc": 1615924389,
        "id": "m6hr98",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Why NVDA ARM acquisition should be approved",
        "url": "https://www.reddit.com/r/investing/comments/m6hr98/why_nvda_arm_acquisition_should_be_approved/",
        "created": 1615953189.0
    },
    {
        "author": "Mediocre_Suspect_203",
        "created_utc": 1615947548,
        "id": "m6ps17",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Did anyone recognize NexOptic on the market NXO?\nAi Technology is big in coming.\nNexOptic work with Nvidia Qualcomm and arm together.\nBut would it be a good long turn investment?",
        "subreddit": "CanadianInvestor",
        "title": "NexOptic and ai Technology",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/m6ps17/nexoptic_and_ai_technology/",
        "created": 1615976348.0
    },
    {
        "author": "itsnotthatbad21",
        "created_utc": 1615257210,
        "id": "m0wp6a",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "NVDA calls x19 500 strk 04/01 Still holding",
        "url": "https://i.redd.it/iay95fugzwl61.jpg",
        "created": 1615286010.0
    },
    {
        "author": "Visible_Antelope5010",
        "created_utc": 1614700562,
        "id": "lw57ow",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Introducing ... $SOXL. A 3X Bullish ETF of 80% Semiconductors 20% Semiconductor materials chain. Meaning it goes up 3x or down with it’s holdings. \n\n😍Love that leverage since stocks only go ⬆️ \n\nDo you like Semiconductors? Y/N \n\n\\-Are you bullish on NVDA/AMD 🚀🚀🚀 Y/N\n\n\\-Do you think there’s a Semiconductor shortage? Y/N\n\n\\-Do you like 3x Leverage? (let the pros do some of the work!) \n\n \n\nBears🌈🐻say: “ShoRtaGe MeANs LeSs PrOFitS”\n\nRe: Yes, they might be constrained now, but it’s only a matter of time, Supply vs Demand. Semiconductor manufacturers will raise prices leading to increased profit that scales with inflation. Semiconductors go brrrr 💵 💵 💵 \n\nDo you really want to bet against:\n\n\\-Stimmy?💉💰💰💰\n\n\\-Government (Nat’l Security) interventions?🕵️🕵️‍♂️\n\n\\-Increased cryptomining, gaming, and EV/AI chip usage? 🚀🚀🚀\n\nLook around and see how hard it is to buy a current GPU at MSRP!\n\n&amp;#x200B;\n\nSOXL Just split 15:1, this isn’t really technically bullish sign as it moves 3x based off of its holdings, however: calls, covered calls, puts, etc are cheaper for you to play!\n\n(620 —&gt; 41 per share as of today) \n\n...To me; it’s bullish AF, it means more people can play.\n\nFor the retards (like me): \n\nLove the call options on dips- 3x leverage off of 100x leverage from option(s) = Get Tendies or Die Tryin’  🍗 💀 \n\n1 yr return: +105.96% 😍 \n\nHoldings: (80% Semiconductor Manufactures, 20% Semiconductor Equipment)\n\nTop Holdings:\n\nBroadcom Limited, Qualcomm, Intel, Texas Instruments, Nvidia, AMD, Intel, Micron Technology, Taiwan Seminductor, Analog Devices, Applied Material, Lam Research (See Direxion Website)\n\n⚠️Warning ⚠️ : tanks harder on dips but that’s when you buy MOAR calls for insane gains.\n\nShares @ ATHs &amp; dips 1455 (68 pre split)\n\nCalls @ ATHs &amp; dips \n\n&amp;#x200B;\n\nPosting today cause: dipped\n\n📷📷",
        "subreddit": "wallstreetbets",
        "title": "Tired of Meme Stocks? $SOXL 3X Semiconductor play 🚛🚛🚛🔌🔌🔌",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lw57ow/tired_of_meme_stocks_soxl_3x_semiconductor_play/",
        "created": 1614729362.0
    },
    {
        "author": "jarofmy",
        "created_utc": 1617122692,
        "id": "mgkae8",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "There is a lot of talk about \"being good people\" when we moon from GME but when I post a question to try and help people in my life who are unaware of GME, my post gets removed from r/GME which is sad to see, I am just looking for answers. There are people in my life that I cannot convince to invest in GME. Does that mean I want them to suffer? Absolutely not. What the fuck is wrong with people. The only people I want to suffer are the hedgefunds, not normal people.\n\nAlthough my portfolio is 100% GME across 3 brokers, I can't convince my family members. I can't blame them, as they're from an older generation and do not really understand what is going on. Despite this, I do not want to see people close to me suffer as a result of hedgies completely fucking over the market to cover their positions.\n\nThey're mainly invested in things like Tesla, NVidia, SPY and other boomer-type stocks. I don't know much other than GME and told them maybe water ($AWK) would be a good idea. They think gold/silver. Any advice would be great.\n\nAs for me, I am hodling to the moon.",
        "subreddit": "wallstreetbets",
        "title": "In case GME causes a market crash, where should family members who aren't aware of GME re-allocate their money?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mgkae8/in_case_gme_causes_a_market_crash_where_should/",
        "created": 1617151492.0
    },
    {
        "author": "ciulla1227",
        "created_utc": 1615632404,
        "id": "m43z0b",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Nvidia and all other GPU common sense",
        "url": "https://www.reddit.com/r/investing/comments/m43z0b/nvidia_and_all_other_gpu_common_sense/",
        "created": 1615661204.0
    },
    {
        "author": "learn-and-earn-",
        "created_utc": 1615923744,
        "id": "m6hijg",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Franklin Templeton released a bunch of  thematic active ETFs in February 2020 &amp; March 2021. They seem pretty interesting, with a disruption/innovation theme to each of them. Matthew Moberg &amp; Joyce Lin are the fund managers.\n\nAll these ETFs have done very well in the recent past (but then again, 2020 was an exceptional year &amp; past performance doesn't imply future), but they have fallen quite a bit over the past 1 month, giving us potential entry points to \"buy the dip.\" Here's my humble attempt at a summary:  \n\n\n[**Disruptive Commerce ETF $BUYZ**](https://www.franklintempleton.com/investor/investments-and-solutions/investment-options/etfs/portfolio/29096/franklin-disruptive-commerce-etf/BUYZ)**:**\n\n1. Claims to invest in innovative companies benefitting from transformation in the e-commerce space\n2. Claims to provide access to companies that are related to new online markets, streamlined procurement systems, and game-changing ways to deliver goods and services\n3. Portfolio: large growth, where its top 5 holdings are popular ECommerce plays: $SE, $SHOP, $FVRR, $AMZN, $MELI, followed by interesting choices like $SQ, $PYPL, $DOCU, $UBER and $TDOC\n4. Performance: +173.76% over the past year, -0.01% YTD, -16.25% over the last 1 month\n5. Expense Ratio: 0.50%\n\n&amp;#x200B;\n\n[**Exponential Data ETF $XDAT:**](https://www.franklintempleton.com/investor/investments-and-solutions/investment-options/etfs/overview/30780/franklin-exponential-data-etf/XDAT)\n\n1. Claims to invest in companies focused on or expected to benefit from the creation, collection, cleaning, analyzing, storage, securing, transport, selling, and/or use of data\n2. Claims to provide access to companies that the investment manager believes benefit from or facilitate big data, data infrastructure, data analytics, and innovative use cases and applications of data which include artificial intelligence, augmented and virtual reality, software-as-a-service, personalized advertising and personalized healthcare among others\n3. Portfolio: large growth, mainly tech as top holdings: $SNAP, $PINS, $FB, $GOOG, $TTD, $TWLO etc.\n4. Performance: was formed only in January 2021, -2.71% YTD, -9.31% over the last 1 month\n5. Expense Ratio: 0.50%\n\n&amp;#x200B;\n\n[**Genomic Advancements ETF $HELX**](https://www.franklintempleton.com/investor/investments-and-solutions/investment-options/etfs/overview/29097/franklin-genomic-advancements-etf/HELX)**:**\n\n1. Claims to invest in innovative companies related to genomic-based technologies designed to enhance the quality of life\n2. Claims to provide access to companies benefitting from or facilitating the use of new research including DNA sequencing, gene editing and personalized medicine\n3. Portfolio: mid-cap growth, with top holdings: Intellia, Repligen, Wuxi Biologics, Illumina, Natera etc. Has an around \\~38% overlap with the more famous $ARKG\n4. Performance: +126.11% over the past year, -2.03% YTD, -16.28% over the last 1 month\n5. Expense Ratio: 0.50%\n\n&amp;#x200B;\n\n[**Intelligent Machines ETF $IQM**](https://www.franklintempleton.com/investor/investments-and-solutions/investment-options/etfs/overview/29098/franklin-intelligent-machines-etf/IQM)**:**\n\n1. Claims to invest in innovative companies furthering techniques that automate or enhance everyday tasks\n2. Claims to provide access to companies that are developing technologies that support machine learning as well as those using automated processes\n3. Portfolio: large growth, with interestingly diversified top holdings: $TSLA, $AAPL, $ISRG, $TSM, $AXON, $ADSK, $NVDA etc. \n4. Performance: +137.14% over the past year, -0.36% YTD, -10.64% over the last 1 month\n5. Expense Ratio: 0.50%\n\n&amp;#x200B;\n\n**So, what do you people think about them? Which ones do you like / see room for medium-to-long term growth?** \n\nThanks for reading!",
        "subreddit": "StockMarket",
        "title": "Franklin Templeton Thematic ETFs (BUYZ, XDAT, HELX, IQM)",
        "url": "https://www.reddit.com/r/StockMarket/comments/m6hijg/franklin_templeton_thematic_etfs_buyz_xdat_helx/",
        "created": 1615952544.0
    },
    {
        "author": "akokaz1",
        "created_utc": 1615987041,
        "id": "m706k5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Teradyne Inc, Ticker: **TER (+38% mentions)**\n\nMarket cap: $19.5Bn\n\nTeradyne Inc supplies automation test equipment for semiconductors, wireless products, data storage and complex electronic systems in the consumer electronic, automotive, industrial, communications and aerospace sector.\n\nEssentially, the chip powering the phone or laptop you are reading this from has most likely been tested by Teradyne.\n\nTeradynes biggest customers include Samsung, Qualcomm, Nvidia, Intel, Boeing, Texas Instruments, 3M, and IBM.\n\nDon’t have time to read the whole thing? I’ll summarise below\n\n3 main reasons why I like this stock:\n\n* Overall semiconductor market future\n* Finances and balance sheet\n* Cathie Wood investment\n\n2 possible downsides:\n\n* Low future earnings forecasts\n* Recent price volatility\n\n### Future\n\nAlmost everything requires a semiconductor now, and that will only grow further in the future, some of the biggest examples are:\n\n* The majority of mobile phones sold nowadays are smartphones, and while that growth has slowed down over the last few years, 1.5 billion a year are still sold.\n* The ecosystem surrounding mobile phones is growing rapidly, think tablets, smart watches, headphones, laptops, speakers.\n* Internet-of-things devices are booming, think Alexa, smart lighting, ovens, fridges,heating, mirrors etc.\n* Car technology (especially in electric cars) is mostly driven by semiconductor technology, shifting further and further away from analog technology\n* Gaming, from Playstations to VR headsets, again all require semiconductor technology\n* Automated manufacturing\n\nEven without COVID, supply cannot keep up. There have been huge shortages this year for semiconductors causing pinches everywhere *(have you tried purchasing a PS5 recently?)* meaning lots of pent-up demand, even without, a number of HUGE factories have been built or will be built that are expected to ramp up supply. examples of those:\n\n* [Samsung’s $17bn factory](https://www.extremetech.com/computing/319926-samsung-files-documents-to-build-new-17-billion-fab-in-the-united-states)\n* [TSM’s $12bn plant](https://www.fool.com/investing/2020/05/15/taiwan-semiconductor-to-build-a-12-billion-chip-pl.aspx)\n* [Intel’s $7bn plant, completed in 2020](https://hexus.net/tech/news/cpu/145990-intel-fab-42-now-ready-pump-leading-edge-products/)\n* [List of all current fabrication plants to give you an idea of size of market](https://en.wikipedia.org/wiki/List_of_semiconductor_fabrication_plants)\n\nAll of this will require automation and testing.\n\nLong-term, it’s very safe to assume that irrespective of economic or technological shifts, semiconductor demand will not only sustain, but surge. A few things on the horizon that will likely affect this:\n\n* 5G technology being rolled out worldwide\n* Space technology &amp; tourism growth\n* AI &amp; data technology\n\nThe biggest kicker? Teradyne provide the majority of the automation and testing for all of these sectors, meaning any growth here only benefits them.\n\nFurthermore, to me they are also proofed from the whole *“economy opening up means a move away from tech“* as it’s not like people will stop using electronic devices, unlike companies like Zoom which will see a big drop in usership as normality returns.\n\n### Finances\n\nEven during a COVID year, Teradyne grew revenues from $2.29bn to $3.12bn, an increase of 36%.\n\nThey grew their net income even further, going from $467m to $784m, an increase of 67%.\n\n&amp;#x200B;\n\n*Processing img et37l5sf9ln61...*\n\nEarnings per share *(profit by number of shares)* also grew, from $2.6 to $4.28 (**+64%**) last year which is astounding. (*general consensus is anything above 25% growth is good).*\n\nWhen taking the price of the stock into account, and looking at Price-to-Earnings ratio *(Price of the stock vs the earnings per share of a stock, the lower the better)* Teradyne has a PE ratio of 24.9x, which is way better than the industry average of 38x.\n\nFrom a debt position, Teradyne is very healthy with an equity-to-debt ratio *(the lower the better, below 1 means more equity than debt)* of 0.18.\n\n### Cathie Wood Investment\n\nCathie Wood, the very aggressive bullish investor whos ETF [ARK Invest](https://finance.yahoo.com/quote/ARKK/performance/) saw returns of 152% last year, [has recently purchased a further 139,619 shares](https://247wallst.com/investing/2021/03/12/cathie-woods-ark-invest-buys-and-sells-3-12/) to add to the current position.\n\nExtra purchasing here shows long-term confidence, as this was added after ARK had to rebalance and sell some Teradyne shares last year.\n\n### Possible Downsides\n\nSome analysts are predicting modest future revenue growth at 5.8%, compared to the industry average of 16.2%.\n\nFurthermore, the price this year has seen some large volatility, suffering from the sell-off that affected technology and growth stocks earlier this year. If more sell-offs ensue, this could cause the price to drop further in the short term.\n\n&amp;#x200B;\n\n[Choppy price action for TER this year, dropping from all time highs of $148.](https://preview.redd.it/lxmx8hhh9ln61.png?width=1456&amp;format=png&amp;auto=webp&amp;s=ec2e87089db55b57a7494d10096876124ffd1b66)\n\n### Summary\n\nTeradyne commands a large portion of a market that is only growing further every year. A financially healthy and well managed company, with high revenue and EPS growth, along with some strong investment backing. While there may be some volatility in the price of the stock short-term, long-term this company still has tremendous potential.\n\n&amp;#x200B;\n\nNone of this is financial advice, only my personal opinion. please do your own research before dealing into any stocks.",
        "subreddit": "StockMarket",
        "title": "Research on Teradyne Inc, a stock that has seen rising chatter online.",
        "url": "https://www.reddit.com/r/StockMarket/comments/m706k5/research_on_teradyne_inc_a_stock_that_has_seen/",
        "created": 1616015841.0
    },
    {
        "author": "ArtichokeOk9708",
        "created_utc": 1615468290,
        "id": "m2pr2t",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Morning Stock Review Looking to BUY $CRSP $TDOC $NVDA $MRVL",
        "url": "https://youtube.com/watch?v=QML81D6B8Rg&amp;feature=share",
        "created": 1615497090.0
    },
    {
        "author": "Wonderful_Quail5766",
        "created_utc": 1615477475,
        "id": "m2t53u",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi everyone. NVDA is still the best chip company in the world and the best stock on the market. The tech pullback hit NVDA hard. It’s a great time to buy and hold.",
        "subreddit": "wallstreetbets",
        "title": "Friendly reminder to buy NVDA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m2t53u/friendly_reminder_to_buy_nvda/",
        "created": 1615506275.0
    },
    {
        "author": "learner4f",
        "created_utc": 1617095062,
        "id": "mgbpf7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "It's official - ARKX is available for trading today (3/30/2021).\n\nHere is the top 20 holdings in ARKX (sorted from largest weight to smallest weight):\n\nCompany \t                    Ticker \t   Weight(%)\tShares \tMarket Value($) \n\nTRIMBLE INC \t                TRMB \t   8.47\t        1156\t$86,353.20 \n\nTHE 3D PRINTING ETF \t        PRNT UF    6.1\t        1636\t$62,168.00 \n\nKRATOS DEFENSE &amp; SECURITY \t    KTOS \t   5.62\t        2203\t$57,322.06 \n\nL3HARRIS TECHNOLOGIES INC \t    LHX \t   4.97\t        255\t    $50,729.70 \n\n[JD.COM](https://JD.COM) INC-ADR \t                JD \t       4.91\t        610\t    $50,062.70 \n\nKOMATSU LTD \t                6301 JT    4.56\t \t\t1547\t$46,545.40 \n\nLOCKHEED MARTIN CORP \t        LMT \t   4.47\t\t\t125\t\t$45,588.75 \n\nIRIDIUM COMMUNICATIONS INC \t    IRDM \t   4.23\t\t\t1132\t$43,163.16 \n\nTHALES SA \t                    HO FP \t   3.9\t\t\t407\t\t$39,789.41 \n\nBOEING CO/THE \t                BA \t       3.48\t\t\t145\t\t$35,506.15 \n\nNVIDIA CORP \t                NVDA \t   3.32\t\t\t66\t\t$33,895.62 \n\nSPIRIT AEROSYSTEMS HOLD-CL A \tSPR \t   3.26\t\t\t687\t\t$33,209.58 \n\nDEERE &amp; CO \t                    DE \t       3.18\t\t\t87\t\t$32,389.23 \n\n[AMAZON.COM](https://AMAZON.COM) INC \t                AMZN \t   2.99\t\t\t10\t\t$30,520.30 \n\nTERADYNE INC \t                TER \t   2.74\t\t\t235\t\t$27,969.70 \n\nALPHABET INC-CL C \t            GOOG \t   2.59\t\t\t13\t\t$26,462.15 \n\nDASSAULT SYSTEMES SE \t        DSY \t   2.55\t\t\t121\t\t$26,035.27 \n\nTELEDYNE TECHNOLOGIES INC \t    TDY \t   2.55\t\t\t65\t\t$26,050.70 \n\nGARMIN LTD \t                    GRMN \t   2.01\t\t\t160\t\t$20,539.20 \n\nVIRGIN GALACTIC HOLDINGS INC \tSPCE \t   1.95\t\t\t672\t\t$19,884.48 \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9y6rsfq8s4q61.png?width=481&amp;format=png&amp;auto=webp&amp;s=bfc250d13cca08bfe03c993dbb47fb370cd5c9f1\n\n \n\nI can't post the entire list because it might contain \"forbidden\" tickers, and mods will delete this post.\n\nSo for the entire list and more info, please see [this](https://youtu.be/azitiTKxdBA)\n\nHopefully, the information here will be useful to everyone.",
        "subreddit": "StockMarket",
        "title": "ARK Space Exploration ETF (ARKX) - Holdings Reveal",
        "url": "https://www.reddit.com/r/StockMarket/comments/mgbpf7/ark_space_exploration_etf_arkx_holdings_reveal/",
        "created": 1617123862.0
    },
    {
        "author": "akokaz1",
        "created_utc": 1615986811,
        "id": "m703vu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Teradyne Inc, Ticker: **TER (+38% mentions)**\n\nMarket cap: $19.5Bn\n\nTeradyne Inc supplies automation test equipment for semiconductors, wireless products, data storage and complex electronic systems in the consumer electronic, automotive, industrial, communications and aerospace sector.\n\nEssentially, the chip powering the phone or laptop you are reading this from has most likely been tested by Teradyne.\n\nTeradynes biggest customers include Samsung, Qualcomm, Nvidia, Intel, Boeing, Texas Instruments, 3M, and IBM.\n\nDon’t have time to read the whole thing? I’ll summarise below:\n\n3 main reasons why I like this stock (GME puns end here):\n\n* Overall semiconductor market future\n* Finances and balance sheet\n* Cathie Wood investment\n\n2 possible downsides:\n\n* Low future earnings forecasts\n* Recent price volatility\n\n# Future\n\nAlmost everything requires a semiconductor now, and that will only grow further in the future, some of the biggest examples are:\n\n* The majority of mobile phones sold nowadays are smartphones, and while that growth has slowed down over the last few years, 1.5 billion a year are still sold.\n* The ecosystem surrounding mobile phones is growing rapidly, think tablets, smart watches, headphones, laptops, speakers.\n* Internet-of-things devices are booming, think Alexa, smart lighting, ovens, fridges,heating, mirrors etc.\n* Car technology (especially in electric cars) is mostly driven by semiconductor technology, shifting further and further away from analog technology\n* Gaming, from Playstations to VR headsets, again all require semiconductor technology\n* Automated manufacturing\n\nEven without COVID, supply cannot keep up. There have been huge shortages this year for semiconductors causing pinches everywhere *(have you tried purchasing a PS5 recently?)* meaning lots of pent-up demand, even without, a number of HUGE factories have been built or will be built that are expected to ramp up supply. examples of those:\n\n* [Samsung’s $17bn factory](https://www.extremetech.com/computing/319926-samsung-files-documents-to-build-new-17-billion-fab-in-the-united-states)\n* [TSM’s $12bn plant](https://www.fool.com/investing/2020/05/15/taiwan-semiconductor-to-build-a-12-billion-chip-pl.aspx)\n* [Intel’s $7bn plant, completed in 2020](https://hexus.net/tech/news/cpu/145990-intel-fab-42-now-ready-pump-leading-edge-products/)\n* [List of all current fabrication plants to give you an idea of size of market](https://en.wikipedia.org/wiki/List_of_semiconductor_fabrication_plants)\n\nAll of this will require automation and testing.\n\nLong-term, it’s very safe to assume that irrespective of economic or technological shifts, semiconductor demand will not only sustain, but surge. A few things on the horizon that will likely affect this:\n\n* 5G technology being rolled out worldwide\n* Space technology &amp; tourism growth\n* AI &amp; data technology\n\nThe biggest kicker? Teradyne provide the majority of the automation and testing for all of these sectors, meaning any growth here only benefits them.\n\nFurthermore, to me they are also proofed from the whole *“economy opening up means a move away from tech“* as it’s not like people will stop using electronic devices, unlike companies like Zoom which will see a big drop in usership as normality returns.\n\n# Finances\n\nEven during a COVID year, Teradyne grew revenues from $2.29bn to $3.12bn, an increase of 36%.\n\nThey grew their net income even further, going from $467m to $784m, an increase of 67%.\n\n&amp;#x200B;\n\n*Processing img 0i9lfxyo8ln61...*\n\nEarnings per share *(profit by number of shares)* also grew, from $2.6 to $4.28 (**+64%**) last year which is astounding. (*general consensus is anything above 25% growth is good).*\n\nWhen taking the price of the stock into account, and looking at Price-to-Earnings ratio *(Price of the stock vs the earnings per share of a stock, the lower the better)* Teradyne has a PE ratio of 24.9x, which is way better than the industry average of 38x.\n\nFrom a debt position, Teradyne is very healthy with an equity-to-debt ratio *(the lower the better, below 1 means more equity than debt)* of 0.18.\n\nCathie Wood Investment\n\nCathie Wood, the very aggressive bullish investor whos ETF [ARK Invest](https://finance.yahoo.com/quote/ARKK/performance/) saw returns of 152% last year, [has recently purchased a further 139,619 shares](https://247wallst.com/investing/2021/03/12/cathie-woods-ark-invest-buys-and-sells-3-12/) to add to the current position.\n\nExtra purchasing here shows long-term confidence, as this was added after ARK had to rebalance and sell some Teradyne shares last year.\n\nPossible Downsides\n\nSome analysts are predicting modest future revenue growth at 5.8%, compared to the industry average of 16.2%.\n\nFurthermore, the price this year has seen some large volatility, suffering from the sell-off that affected technology and growth stocks earlier this year. If more sell-offs ensue, this could cause the price to drop further in the short term.\n\n&amp;#x200B;\n\n*Processing img gobsit0q8ln61...*\n\n# Summary\n\nTeradyne commands a large portion of a market that is only growing further every year. A financially healthy and well managed company, with high revenue and EPS growth, along with some strong investment backing. While there may be some volatility in the price of the stock short-term, long-term this company still has tremendous potential.\n\n*None of this is investment advice, please do your own research before taking out any positions.*",
        "subreddit": "InvestmentClub",
        "title": "My research on Teradyne Inc, a stock that my algorithm has picked up as having increase chatter and sentiment online.",
        "url": "https://www.reddit.com/r/InvestmentClub/comments/m703vu/my_research_on_teradyne_inc_a_stock_that_my/",
        "created": 1616015611.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1614754396,
        "id": "lwnjtx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "Loss 50% on $NVDA calls. Only thing left is GME and SPY calls.",
        "url": "https://i.redd.it/pxmybrb6grk61.jpg",
        "created": 1614783196.0
    },
    {
        "author": "UnkownPlayer109",
        "created_utc": 1614784677,
        "id": "lww99d",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Nvidia, what is happening",
        "url": "https://www.reddit.com/r/stocks/comments/lww99d/nvidia_what_is_happening/",
        "created": 1614813477.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1614795590,
        "id": "lx0l8r",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "Won $2000 from a scratch off ticket recently. NVDA, pls continue the magic",
        "url": "https://i.redd.it/vdtcch2uuuk61.jpg",
        "created": 1614824390.0
    },
    {
        "author": "Theboardlord1",
        "created_utc": 1614800256,
        "id": "lx2eof",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Nvidia 550 to 515",
        "url": "https://www.reddit.com/r/stocks/comments/lx2eof/nvidia_550_to_515/",
        "created": 1614829056.0
    },
    {
        "author": "Ubermench666",
        "created_utc": 1615434585,
        "id": "m2h4wr",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Sold nflx for a 3500 % return NVDA for about 850% return. Bought it at 11$ - held for about 7 years. Investing not trading works.",
        "url": "https://i.redd.it/3vyftwnvmbm61.jpg",
        "created": 1615463385.0
    },
    {
        "author": "Mediocre_Suspect_203",
        "created_utc": 1615947482,
        "id": "m6prd1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Did anyone recognize NexOptic on the market NXO?\nAi Technology is big in coming.\nNexOptic work with Nvidia Qualcomm and arm together.\nBut would it be a good long turn investment?",
        "subreddit": "CanadianInvestor",
        "title": "NexOptic and ai Technology",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/m6prd1/nexoptic_and_ai_technology/",
        "created": 1615976282.0
    },
    {
        "author": "Mr-Pink_",
        "created_utc": 1615972555,
        "id": "m6wcc1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "What Warren Buffet calls the ‘economic moat’ we refer to as ‘competitive advantage’. The term refers to a companies ability to keep competition at bay over the long term life cycle of the business, maintain majority market share and favourable economics. What force is stopping or limiting the competitions capability to compete? What stops the competition from cutting their lunch? A company can have one or more of the five types of economic moats: intangible assets, cost advantage, efficient scale, switching costs, network effect. \n\nHere are Some examples of the economic moats/competitive advantage of some companies (or what I believe to be the moat) :\n\nApple — Apple’s brand power, the belief in its product superiority by consumers and its ability to create a large cult following, allows the company to price its products at double the competitions and still outsell the competition in the market place. \n\nCoca-Cola — The powerful brand behind Coke gives them the ability to demand higher margins and outsell the competition. Coke the brand is directly associated with happiness. Coke is a product where the customer will reject the competitions equivalent at a discount, and buy the Coke product at a premium. \n\nIntel — Intels vertical integration and its operations across the entire supply chain line in the chip sector, gives intel the ability to outdo the competition on every level and hold majority market share. One year intel will focus on chip innovation, the next year it will focus on production innovation and capabilities. Despite fierce competition from AMD and NVIDIA, intel has maintained its market share of the industry.\n\nAmazon.com — Amazon is an operating system for society and daily lives of individuals. It has created a cult following who truly believe Amazon is a necessity of life equal to water, food and oxygen. Some Amazon prime members have and do become suicidal when they lose access to their account. The brand has made itself into an integral part of the day to day lives of individuals, and has made life without Amazon inconceivable for its customers. \n\nFacebook — Facebook takes advantage of network effects, product and brand power. As more people start using Facebook, then more people will be attracted to Facebook because their friends and everyone they know use it, it becomes a social necessity. Facebooks product and brand is so powerful, even its strongest and fiercest critics still use it. \n\n[Economic Moats](https://www.investopedia.com/terms/e/economicmoat.asp)",
        "subreddit": "stocks",
        "title": "Economic Moats/Competitive Advantage",
        "url": "https://www.reddit.com/r/stocks/comments/m6wcc1/economic_moatscompetitive_advantage/",
        "created": 1616001355.0
    },
    {
        "author": "akokaz1",
        "created_utc": 1615987299,
        "id": "m709l5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Teradyne Inc, Ticker: **TER (+38% mentions)**\n\nMarket cap: $19.5Bn\n\nTeradyne Inc supplies automation test equipment for semiconductors, wireless products, data storage and complex electronic systems in the consumer electronic, automotive, industrial, communications and aerospace sector.\n\nEssentially, the chip powering the phone or laptop you are reading this from has most likely been tested by Teradyne.\n\nTeradynes biggest customers include Samsung, Qualcomm, Nvidia, Intel, Boeing, Texas Instruments, 3M, and IBM.\n\nDon’t have time to read the whole thing? I’ll summarise below\n\n3 main reasons why I like this stock:\n\n* Overall semiconductor market future\n* Finances and balance sheet\n* Cathie Wood investment\n\n2 possible downsides:\n\n* Low future earnings forecasts\n* Recent price volatility\n\n### Future\n\nAlmost everything requires a semiconductor now, and that will only grow further in the future, some of the biggest examples are:\n\n* The majority of mobile phones sold nowadays are smartphones, and while that growth has slowed down over the last few years, 1.5 billion a year are still sold.\n* The ecosystem surrounding mobile phones is growing rapidly, think tablets, smart watches, headphones, laptops, speakers.\n* Internet-of-things devices are booming, think Alexa, smart lighting, ovens, fridges,heating, mirrors etc.\n* Car technology (especially in electric cars) is mostly driven by semiconductor technology, shifting further and further away from analog technology\n* Gaming, from Playstations to VR headsets, again all require semiconductor technology\n* Automated manufacturing\n\nEven without COVID, supply cannot keep up. There have been huge shortages this year for semiconductors causing pinches everywhere *(have you tried purchasing a PS5 recently?)* meaning lots of pent-up demand, even without, a number of HUGE factories have been built or will be built that are expected to ramp up supply. examples of those:\n\n* [Samsung’s $17bn factory](https://www.extremetech.com/computing/319926-samsung-files-documents-to-build-new-17-billion-fab-in-the-united-states)\n* [TSM’s $12bn plant](https://www.fool.com/investing/2020/05/15/taiwan-semiconductor-to-build-a-12-billion-chip-pl.aspx)\n* [Intel’s $7bn plant, completed in 2020](https://hexus.net/tech/news/cpu/145990-intel-fab-42-now-ready-pump-leading-edge-products/)\n* [List of all current fabrication plants to give you an idea of size of market](https://en.wikipedia.org/wiki/List_of_semiconductor_fabrication_plants)\n\nAll of this will require automation and testing.\n\nLong-term, it’s very safe to assume that irrespective of economic or technological shifts, semiconductor demand will not only sustain, but surge. A few things on the horizon that will likely affect this:\n\n* 5G technology being rolled out worldwide\n* Space technology &amp; tourism growth\n* AI &amp; data technology\n\nThe biggest kicker? Teradyne provide the majority of the automation and testing for all of these sectors, meaning any growth here only benefits them.\n\nFurthermore, to me they are also proofed from the whole *“economy opening up means a move away from tech“* as it’s not like people will stop using electronic devices, unlike companies like Zoom which will see a big drop in usership as normality returns.\n\n### Finances\n\nEven during a COVID year, Teradyne grew revenues from $2.29bn to $3.12bn, an increase of 36%.\n\nThey grew their net income even further, going from $467m to $784m, an increase of 67%.\n\n&amp;#x200B;\n\n[5 Year Net Income for Teradyne, rising from -$43m in 2016 to $784m in 2020. Return on Equity was 42.49&amp;#37;](https://preview.redd.it/h23vdc1aaln61.png?width=467&amp;format=png&amp;auto=webp&amp;s=7be5437b649cbc2b03a13cadadd0ca0eee90ef6b)\n\nEarnings per share *(profit by number of shares)* also grew, from $2.6 to $4.28 (**+64%**) last year which is astounding. (*general consensus is anything above 25% growth is good).*\n\nWhen taking the price of the stock into account, and looking at Price-to-Earnings ratio *(Price of the stock vs the earnings per share of a stock, the lower the better)* Teradyne has a PE ratio of 24.9x, which is way better than the industry average of 38x.\n\nFrom a debt position, Teradyne is very healthy with an equity-to-debt ratio *(the lower the better, below 1 means more equity than debt)* of 0.18.\n\n### Cathie Wood Investment\n\nCathie Wood, the very aggressive bullish investor whos ETF [ARK Invest](https://finance.yahoo.com/quote/ARKK/performance/) saw returns of 152% last year, [has recently purchased a further 139,619 shares](https://247wallst.com/investing/2021/03/12/cathie-woods-ark-invest-buys-and-sells-3-12/) to add to the current position.\n\nExtra purchasing here shows long-term confidence, as this was added after ARK had to rebalance and sell some Teradyne shares last year.\n\n### Possible Downsides\n\nSome analysts are predicting modest future revenue growth at 5.8%, compared to the industry average of 16.2%.\n\nFurthermore, the price this year has seen some large volatility, suffering from the sell-off that affected technology and growth stocks earlier this year. If more sell-offs ensue, this could cause the price to drop further in the short term.\n\n&amp;#x200B;\n\n[Choppy price action for TER this year, dropping from all time highs of $148.](https://preview.redd.it/e5rxrx48aln61.png?width=1456&amp;format=png&amp;auto=webp&amp;s=27d012a19c15c1664614c9c953adcee881b4020f)\n\n### Summary\n\nTeradyne commands a large portion of a market that is only growing further every year. A financially healthy and well managed company, with high revenue and EPS growth, along with some strong investment backing. While there may be some volatility in the price of the stock short-term, long-term this company still has tremendous potential.",
        "subreddit": "wallstreetbets",
        "title": "Teradyne Inc DD, a stock with increasing online chatter",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m709l5/teradyne_inc_dd_a_stock_with_increasing_online/",
        "created": 1616016099.0
    },
    {
        "author": "learner4f",
        "created_utc": 1617095445,
        "id": "mgbsl3",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "It's official - ARKX is available for trading today (3/30/2021).\n\nHere is the top 20 holdings in ARKX (sorted from largest weight to smallest weight):\n\nCompany Ticker Weight(%) Shares Market Value($)\n\nTRIMBLE INC TRMB 8.47 1156 $86,353.20\n\nTHE 3D PRINTING ETF PRNT UF 6.1 1636 $62,168.00\n\nKRATOS DEFENSE &amp; SECURITY KTOS 5.62 2203 $57,322.06\n\nL3HARRIS TECHNOLOGIES INC LHX 4.97 255 $50,729.70\n\n[JD.COM](https://jd.com/) INC-ADR JD 4.91 610 $50,062.70\n\nKOMATSU LTD 6301 JT 4.56 1547 $46,545.40\n\nLOCKHEED MARTIN CORP LMT 4.47 125 $45,588.75\n\nIRIDIUM COMMUNICATIONS INC IRDM 4.23 1132 $43,163.16\n\nTHALES SA HO FP 3.9 407 $39,789.41\n\nBOEING CO/THE BA 3.48 145 $35,506.15\n\nNVIDIA CORP NVDA 3.32 66 $33,895.62\n\nSPIRIT AEROSYSTEMS HOLD-CL A SPR 3.26 687 $33,209.58\n\nDEERE &amp; CO DE 3.18 87 $32,389.23\n\n[AMAZON.COM](https://amazon.com/) INC AMZN 2.99 10 $30,520.30\n\nTERADYNE INC TER 2.74 235 $27,969.70\n\nALPHABET INC-CL C GOOG 2.59 13 $26,462.15\n\nDASSAULT SYSTEMES SE DSY 2.55 121 $26,035.27\n\nTELEDYNE TECHNOLOGIES INC TDY 2.55 65 $26,050.70\n\nGARMIN LTD GRMN 2.01 160 $20,539.20\n\nVIRGIN GALACTIC HOLDINGS INC SPCE 1.95 672 $19,884.48\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/isnhw7oys4q61.png?width=481&amp;format=png&amp;auto=webp&amp;s=9323f7b6b95751b7a430b0b6874f70c8a03a22de\n\n I can't post the entire list because it might contain \"forbidden\" tickers, and mods will delete this post. \n\nFor the entire list and more info, you can search for \"ARK Space Exploration ETF (ARKX) - Holdings Reveal\" on youtube ( sorry, mods keep deleting my post because of youtube link).\n\nHopefully, the information here will be useful to everyone.",
        "subreddit": "wallstreetbets",
        "title": "ARK Space Exploration ETF (ARKX) - Holdings Reveal",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mgbsl3/ark_space_exploration_etf_arkx_holdings_reveal/",
        "created": 1617124245.0
    },
    {
        "author": "Krame_blockchain",
        "created_utc": 1615317847,
        "id": "m1e1dm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "NVDA AMD and mining crazies",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m1e1dm/nvda_amd_and_mining_crazies/",
        "created": 1615346647.0
    },
    {
        "author": "jeffreyianni",
        "created_utc": 1614835209,
        "id": "lxdeqe",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I really like $NVDA but my margin account might bury me.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxdeqe/i_really_like_nvda_but_my_margin_account_might/",
        "created": 1614864009.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1614752444,
        "id": "lwn1qj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "Lost 50% on my $NVDA calls. Time to bounce back if GME plays out.",
        "url": "https://imgur.com/a/F9M0MXz",
        "created": 1614781244.0
    },
    {
        "author": "ScrewThisHyundai",
        "created_utc": 1615229474,
        "id": "m0mvwf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Thoughts on NVIDIA - NVDA",
        "url": "https://www.reddit.com/r/stocks/comments/m0mvwf/thoughts_on_nvidia_nvda/",
        "created": 1615258274.0
    },
    {
        "author": "Wet-Monies",
        "created_utc": 1617050300,
        "id": "mfyxmw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "https://youtu.be/b9Z-1-s7RH4",
        "subreddit": "investing_discussion",
        "title": "SENS and NVDA analysis",
        "url": "https://www.reddit.com/r/investing_discussion/comments/mfyxmw/sens_and_nvda_analysis/",
        "created": 1617079100.0
    },
    {
        "author": "who-wants-to-playgta",
        "created_utc": 1614707276,
        "id": "lw809c",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I have to mention that I'm 14 so you guys can understand me a bit. I just sold my only Nvidia share, which I used to increase my pocket money. I've now put all the money into gme shares. So I hereby ask you guys for not letting me down. Otherwise, I think my father would not allow me to put all my money into stocks and I would have to wait until I am 18 to continue trading.",
        "subreddit": "wallstreetbets",
        "title": "Sold everything for GME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lw809c/sold_everything_for_gme/",
        "created": 1614736076.0
    },
    {
        "author": "Tiny-Ad5603",
        "created_utc": 1614763308,
        "id": "lwpq7q",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Nanorepro and NVIDIA invest now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lwpq7q/nanorepro_and_nvidia_invest_now/",
        "created": 1614792108.0
    },
    {
        "author": "Jackmor4",
        "created_utc": 1615286862,
        "id": "m13z1p",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "* Dow Jones, S&amp;P 500 and Nasdaq 100 closed +0.97%, -0.54%, and -2.92% respectively\n* 10-Year Treasury yield continued to edge higher, closing at a fresh 12-month high of 1.599%\n* Rising yields may weigh on the technology sector, buoying cyclically sensitive names\n\nReflation, Stimulus, Yields, Gold, Asia-Pacific at Open:\nWall Street equities had another mixed session as reflation hopes inspired investors to rotate out from growth and into value names. The Dow Jones index finished up 0.97%, while the Nasdaq 100 index tumbled 2.92%. The technology sector continued to underperform cyclically-sensitive ones such as energy, financials and consumer discretionary. Rising yields further weighed on the tech sector, which tends to offer lower dividend yields and thus are more susceptible to profit-taking activity.\nProspects for reopening also encouraged market participants to liquidate the white-hot tech stocks, which have largely outperformed during the pandemic. Heavy losses were seen among the Nasdaq 100 index components overnight, with NVIDIA (-6.97%), Tesla (-5.84%) and PayPal (-5.42%) among the worst performers.",
        "subreddit": "StockMarket",
        "title": "DOW JONES, NIKKEI 225, ASX 200 INDEX OUTLOOK:",
        "url": "https://www.reddit.com/r/StockMarket/comments/m13z1p/dow_jones_nikkei_225_asx_200_index_outlook/",
        "created": 1615315662.0
    }
]