[
    {
        "author": "spacegrab",
        "created_utc": 1623691262,
        "id": "nzrwq2",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Digital Storage is in everything. Cars, Cloud, Phones, PCs, Laptops. It's kinda odd this doesn't get shared more here, but hey this isn't the old WSB we're used to anymore. \n\nhttps://www.westerndigital.com/solutions/automotive-transportation\n\n&gt; The automotive and transportation industries are on the cusp of a disruptive technology phase. Vehicles are not simply mechanical engines but are now data centers on wheels, driving a new generation of storage infrastructure needs. As cars become connected and autonomous, massive amounts of data are being created and consumed. This requires new approaches in data processing that improve communications and interactions between humans and vehicles, vehicles and vehicles (V2V), and vehicles and infrastructures (V2I), while enabling a better and safer driving experience. This places massive demands on data storage and processing at the edge while pushing the boundaries of cloud-based services in the core.\n\nWhat we didn't expect was CHIA driving up the costs of traditional HDD storage. HD prices are going to end up going parabolic the way miners have strangled the shit out of the GPU space, driving gaming enthuiasts to desperation lengths and overpaying for GPUs. Just look at NVDA's price run over the last month.\n\nThe run-up for the storage sector is lagging but following the trend as Seagate (7/27) and WDC (7/28) prepare for ER next month. There will be a significant surge (5-10%) over the next week. Analysts have already lifted price targets; guessing this closes around $80 at the end of June. Easy weekly skimmings. \n\nWDC $75 6/18c",
        "subreddit": "wallstreetbets",
        "title": "Disk-Drive DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nzrwq2/diskdrive_dd/",
        "created": 1623720062.0
    },
    {
        "author": "commodoregoat",
        "created_utc": 1623000704,
        "id": "ntqwp7",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "$WDC has good growth prospects due to a surge in HDD demand, and good earnings prospects.\n\nChia uses spare storage space on hard drives to verify transactions. This is considered to be the 'green' alternative to ASIC and GPUs. \n\n- Increased HDD demand:\n\nChia has gone up massively in recent months, driving a rush to purchase hard drives in order to mine it. As such, there have been hard drive shortages recently due to the increased demand. Much like GPU and semi-conductor stocks, we can expect good price action (and have already seen it) for hard drive manufacturer stocks. \n\n' \"In recent weeks the demand and pricing for high capacity [hard disk drives, or HDDs] has seen a material step higher ... and enterprise [solid state drive, or SSD] prices have also moved higher,\" analysts at Bank of America wrote in a Thursday report. The \"primary upside driver\" for that rising demand, according to BofA: chia. '\n\nWestern Digital is a market leader in the production of HDD's, producing some of the highest quality hard drives that have the best life expectancy, and a good warranty. As Chia transactions are very taxing on HDD's, buyers will be looking for the most durable hard drives. Which is why I am focusing my attention on Western Digital versus another stock such as Seagate. Western Digital is probably the best known manufacturer of hard drives, and usually a top choice for consumers. \n\n- Earnings:\n\nWestern Digital is also an attractive pick due to it's earnings outlook. Analysts are still raising their earnings estimates for the company. The growing optimism on earnings prospects are driving estimates higher, which should get reflected in its stock price.\n\nEarnings estimates for the next quarter and full year are increasingly being driven higher and higher. The company is likely to earn $1.46 per share for the current quarter, representing a change of +18.7%. Two estimates have moved higher in the past 30 days. For the full year, the company is expected to earn $3.83 per share, +25.99% over last year.  \n\n\nThe stock has gained 12.3% over the past four weeks. As earnings growth and the Chia frenzy are both likely to drive the stock higher -  in my opinion, it is a good buy, and I have added it to my portfolio.",
        "subreddit": "wallstreetbets",
        "title": "$WDC Western Digital is being driven up by Chia and earnings prospects",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ntqwp7/wdc_western_digital_is_being_driven_up_by_chia/",
        "created": 1623029504.0
    },
    {
        "author": "commodoregoat",
        "created_utc": 1623058454,
        "id": "nu8axj",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Chia, a 'green' alternative to GPU mining has caused a global shortage of hard discs. I commented on the increased demand, and the earnings expectations in my previous DD.\n\nChia uses a proof of space approach to mining that relies on using empty hard disc space. The high profitability of mining thiscaused a surge in demand for hard discs.\n\nHowever, Chia mining is largely popular in Central and SE Asia right now, with some movement in the West. I expect as more people become aware of this, particularly in the West - it will lead to a shortage of hard discs and SSD's much like the current GPU shortage. There is already a shortage of HDD's/SSD's due to the initial surge of Chia interest causing a buyup of these items. However, as it gains traction, and as people realise how this is much more highly profitable in comparison to GPU mining currently - the demand will be similar to that of GPU's. \n\nThis initial surge I mention, has indeed already caused a surge in the stock prices. With Western digital share price being $52 at the start of the year and now around $77/78. Seagate is also up from $60 to $99. \n\nHoffman, the president of Chia Network, says he 'is suprised at the speed at which the hard disc capacity devoted to Chia has grown and admits that this is likely to caused disruptions to the supply chain for some time.'.\n\nIn summary, Chia is more profitable and more energy efficient than GPU mining. Hard drive demand has already spiked leading to shortages. I expect as this grows in profitability in Asia and the west, it will lead to further shortages much like that we see of HDD's.\nTherefore driving up the stock price as already has been shown.",
        "subreddit": "wallstreetbets",
        "title": "$WDC Western Digital DD: Part 2",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nu8axj/wdc_western_digital_dd_part_2/",
        "created": 1623087254.0
    },
    {
        "author": "hoccmich",
        "created_utc": 1624641401,
        "id": "o7s45u",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hello. New to options. I've read multiple articles where closing an option is often the better choice than exercising it. However, crunching the numbers in the example below, it seems exercising is better? But perhaps I am mistaken...\n\nI bought one contract $STX 2 JUL 21 85 CALL at $2.4.  \n\nCurrent mark is $2.725 for open profit of $32.50\n\nCurrent price of stock is trading at 86.95. If I exercise and buy 100 shares at 85, then sell at 86.95, I profit $195. Read there is a TD option exercise fee of $19.99. So that will reduce profit down to $175.\n\nExercising (+$175) still seems more profitable than selling call option (+$32.50). Am I missing something (i.e. other fees, math wrong, incorrect info, etc.)? Thank you.",
        "subreddit": "options",
        "title": "Exercising Call Option vs Closing Call Option Contract - $STX",
        "url": "https://www.reddit.com/r/options/comments/o7s45u/exercising_call_option_vs_closing_call_option/",
        "created": 1624670201.0
    },
    {
        "author": "commodoregoat",
        "created_utc": 1622908388,
        "id": "nsyqj1",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "\n$WDC has good growth prospects due to a surge in HDD demand, and good earnings prospects.\nChia uses spare storage space on hard drives to verify blockchain transactions. This is considered to be the 'green' alternative to other GPU based mining.\n\nIncreased HDD demand:\n\nChiaCoin has gone up massively in recent months, driving a rush to purchase hard drives in order to mine it. As such, there have been hard drive shortages recently due to the increased demand. Much like GPU and semi-conductor stocks, we can expect good price action (and have already seen it) for hard drive manufacturer stocks.\n' \"In recent weeks the demand and pricing for high capacity [hard disk drives, or HDDs] has seen a material step higher ... and enterprise [solid state drive, or SSD] prices have also moved higher,\" analysts at Bank of America wrote in a Thursday report. The \"primary upside driver\" for that rising demand, according to BofA: chia. '\nWestern Digital is a market leader in the production of HDD's, producing some of the highest quality hard drives that have the best life expectancy, and a good warranty. As ChiaCoin mining is very taxing on HDD's, buyers will be looking for the most durable hard drives. Which is why I am focusing my attention on Western Digital versus another stock such as Seagate. Western Digital is probably the best known manufacturer of hard drives, and usually a top choice for consumers.\n\nEarnings:\n\nWestern Digital is also an attractive pick due to it's earnings outlook. Analysts are still raising their earnings estimates for the company. The growing optimism on earnings prospects are driving estimates higher, which should get reflected in its stock price.\nEarnings estimates for the next quarter and full year are increasingly being driven higher and higher. The company is likely to earn $1.46 per share for the current quarter, representing a change of +18.7%. Two estimates have moved higher in the past 30 days. For the full year, the company is expected to earn $3.83 per share, +25.99% over last year.\nThe stock has gained 12.3% over the past four weeks. As earnings growth and the ChiaCoin frenzy are both likely to drive the stock higher - in my opinion, it is a good buy, and I will be adding it to my portfolio today.\n\nFurther DD on the impact of Chia mining:\nChia, a 'green' alternative to GPU mining has caused a global shortage of hard discs. I commented on the increased demand, and the earnings expectations in my previous DD.\n\nChia uses a proof of space approach to mining that relies on using empty hard disc space. The high profitability of mining this coin caused a surge in demand for hard discs.\n\nHowever, Chia mining is largely popular in Central and SE Asia right now, with some movement in the West. I expect as more people become aware of this, particularly in the West - it will lead to a shortage of hard discs and SSD's much like the current GPU shortage. There is already a shortage of HDD's/SSD's due to the initial surge of Chia interest causing a buyup of these items. However, as it gains traction, and as people realise how this is much more highly profitable in comparison to GPU mining currently - the demand will be similar to that of GPU's.\n\nThis initial surge I mention, has indeed already caused a surge in the stock prices. With Western digital share price being $52 at the start of the year and now around $77/78. Seagate is also up from $60 to $99.\n\nHoffman, the president of Chia Network, says he 'is suprised at the speed at which the hard disc capacity devoted to Chia has grown and admits that this is likely to caused disruptions to the supply chain for some time.'.\n\nIn summary, Chia is more profitable and more energy efficient than GPU mining. Hard drive demand has already spiked leading to shortages. I expect as this grows in profitability in Asia and the west, it will lead to further shortages much like that we see of HDD's. Therefore driving up the stock price as already has been shown.",
        "subreddit": "wallstreetbets",
        "title": "Mega DD $WDC Western Digital is being driven up by 'green' ChiaCoin mining and good earnings prospects",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nsyqj1/mega_dd_wdc_western_digital_is_being_driven_up_by/",
        "created": 1622937188.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1623189480,
        "id": "nvfqin",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**Winners**\n\nWinner of the day by sector | **SP500**:\n\n**Sector |** Company **| Ticker |** % Price Change\n\n1. **Industrials** | Generac Holdings Inc. | **GNRC** | 6.26%  \n2. **Health Care** | Align Technology, Inc. | **ALGN** | 1.64%  \n3. **Information Technology** | Seagate Technology Holdings PLC | **STX** | 2.21%  \n4. **Communication Services** | News Corp Class B | **NWS** | 3.78%  \n5. **Consumer Discretionary** | Gap Inc | **GPS** | 2.87%  \n6. **Utilities** | NRG Energy Inc | **NRG** | 4.46%  \n7. **Financials** | Hartford Financial Services Group Inc | **HIG** | 1.10%  \n8. **Materials** | Albemarle Corporation | **ALB** | 3.06%  \n9.  **Real Estate** | Equinix Inc | **EQIX** | 2.72%  \n10. **Consumer Staples** | SYSCO Corporation | **SYY** | 0.60%  \n11. **Energy** | Diamondback Energy Inc | **FANG** | 2.81%  \n\n\n**Losers**\n\nLoser of the day by sector | **SP500**:\n\n**Sector | Company | Ticker | % Price Change**\n\n1. Industrials | **United Parcel Service, Inc.** | UPS | **-1.44%**  \n2. Health Care | **Organon &amp; Co** |  OGN | **-7.64%**  \n3. Information Technology | **Micron Technology, Inc.** | MU | **-4.18%**  \n4.  Communication Services | **DISCOVERY COMMUNICATIONS INC. Common Stock** | DISCA | **-3.84%**  \n5. Consumer Discretionary | **Ford Motor Company** | F | **-1.54%**  \n6. Utilities | **CMS Energy Corporation** | CMS | **-3.93%**  \n7. Financials | **Huntington Bancshares Incorporated** | HBAN | **-2.37%**  \n8. Materials | **Newmont Corporation** | NEM | **-2.22%**  \n9. Real Estate | **American Tower Corp** | AMT | **-0.92%**  \n10. Consumer Staples | **Philip Morris International Inc.** | PM | **-2.19%**  \n11. Energy | **APA Corp (US)** | APA | **-1.20%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 6/8/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/nvfqin/sp500_winners_and_losers_682021/",
        "created": 1623218280.0
    },
    {
        "author": "TheOv3rminD",
        "created_utc": 1624764916,
        "id": "o8paso",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Seagate Technology Holdings PLC 86.50 USD +23.98 (38.36%) past 6 months  \nWestern Digital Corp 70.75 USD +20.69 (41.33%) past 6 months\n\nIf I would have just taken my $3,000 and bought WD stock, I would have $4,230 Right now. Instead I have a pile of hard drives that no one will ever want to buy and a bunch of half fried SSD's...",
        "subreddit": "wallstreetbets",
        "title": "Hey Guy's, You Know That Chia Thing I Lost a Bunch of Money on....",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o8paso/hey_guys_you_know_that_chia_thing_i_lost_a_bunch/",
        "created": 1624793716.0
    },
    {
        "author": "Keeninsight111",
        "created_utc": 1624842081,
        "id": "o99pit",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I have 65k invested in Eros Stx..... This company is on the verge of blowing up. It was suppressed due to COVID even though last summer's merger between EROS and STX made them a stronger and more efficient company.  Putting aside merger related costs, they were profitable even during COVID....To their fault,  most of their press releases mainly hit their site, EROSSTX.COM, but don't hit the mainstream media sites.  If you look on their site at their pipeline of projects brewing for the past many months,  it's easy to recognize that they'll be putting out hit after hit in the near future.  Also,  the EROS NOW streaming side will improve soon with COVID being suppressed in India,  and their citizens continuing to gain greater internet and smartphone access. It's only a matter of time before this shoots up. They're making all the right moves...GOLDEN TOUCH !!!",
        "subreddit": "wallstreetbets",
        "title": "ESGC TO THE MOON IN THE FACE OF SHORTS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o99pit/esgc_to_the_moon_in_the_face_of_shorts/",
        "created": 1624870881.0
    },
    {
        "author": "Outside-Demand5755",
        "created_utc": 1622893426,
        "id": "nsty15",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "eros stx $ESGC, the Indian netflix, is the new $AMC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nsty15/eros_stx_esgc_the_indian_netflix_is_the_new_amc/",
        "created": 1622922226.0
    },
    {
        "author": "BoyYeetzWorld",
        "created_utc": 1623264767,
        "id": "nw3b95",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Xfinite and Eros Now, a leading over-the-top (OTT) South Asian entertainment platform owned by global entertainment company Eros STX Global Corporation (NYSE: ESGC), have announced that their partnership with Xfinite's Mzaalo platform, a gamified video streaming service on track to reach 10 million\n\nhttps://www.ecryptocurrency.co/2021/06/09/algorand-xfinite-and-eros-have-expanded-their-partnership-for-a-blockchain-based-content-engagement-program/",
        "subreddit": "stocks",
        "title": "Algorand: Xfinite and Eros have expanded their partnership for a blockchain-based content engagement program.",
        "url": "https://www.reddit.com/r/stocks/comments/nw3b95/algorand_xfinite_and_eros_have_expanded_their/",
        "created": 1623293567.0
    }
]