[
    {
        "author": "King_Bum420",
        "created_utc": 1630943723,
        "id": "pj24hx",
        "num_comments": 974,
        "num_crossposts": 0,
        "selftext": "This journey began for me with a random conversation. I was at a grocery store on my break from work and while I was looking at different Greek yogurts, I overheard a man say something I couldn’t believe. I turned around and said “Sir… I’m sorry, what did you just say?” He introduced himself as the owner of the grocery store (locally owned in St.Pete/Clearwater FL area) the gentlemen proceeded to tell me that **last year he paid around $4,000 for a crate of food…he said one year later, that same EXACT CRATE IS NOW $14,000.** This conversation was just 3 weeks ago. \n\nSo…when I got into my car I had an idea. I wonder what the U.S. Dollar index is trading at…I’m sure it’s bloody red (I assumed) what I saw literally made my jaw drop. I’m not joking…**at that time the U.S. dollar happened to be at a 9 month high.** I couldn’t fucking believe it. At that moment I knew…we had fucked up. https://imgur.com/a/tBVu4f1\n\nAfter already doing mini DD on why the U.S. dollar might fall just days before (just watching random videos on YouTube about Dr. Burry and stock shit) \n\nI immediately opened a position in my car to profit from this current situation. Which was call options in $TBT. An ETF with 2x inverse exposure on 20+ U.S Treasury bonds. In simple terms, this is a bet on hyperinflation. **I believe that the Federal Reserve WILL BE FORCED to raise rates (as that is their main tool in their toolkit to fight inflation) faster than ANYONE is anticipating. Which in turn would collapse bond prices.** Making the calls print. I currently have a small position right now.\n\nThe dollar index after J. POW’s Jackson Hole Speech. 😂 https://imgur.com/a/hiN5OFy\n\nNow this brings me to the U.S. stock market. I sold all my stocks 2 days ago. I have long exposure in only one position currently. A $50/$80 call debit spread in VIAC. Simply put, if I’m wrong and the market just keeps going, then the $350 I payed for spread will generate nearly $3,000 if VIAC is over $80 on expiration, which is in 2 years.\n\n                  Technical Analysis\n\nLet me start with my TA  first…which is alarming. https://imgur.com/a/kmLCxPX \n\n**This was yesterday, Friday, September 3.**\n\nHere is one from Thursday, September 2.\n\nhttps://imgur.com/a/PE0F6F5\n\n**$SPY is at a critical resistance level…I mean…it literally is hitting the fucking roof here**… and with everything going on in the world…you want more?!?? Sorry to burst your bubble…but how was that even theoretically feasible? It’s impossible in my opinion. \n\nLet me explain why…\n\n              Updated GDP Forecasts\n\n**Am I literally the only one who saw on Thursday that Morgan Stanley updated their forecast for the third quarter GDP expectations??? Let me fill you in on a little secret…THEY CUT THEIR FUCKING ESTIMATES BY MORE THAN HALF!!!!!**\n\nFor fucks sake people, **THIS IS HUGE!!** This is a quote from a brand new article literally posted 45 minutes ago from the Washington Post! \n\n**“The team at Morgan Stanley led by chief U.S. economist Ellen Zentner just slashed its forecast for gross domestic product growth this quarter to 2.9% from 6.5%.”**\n\n**Gross domestic product is a key indicator of economic activity in the United States. So…yeah we’re fucked. Which in turn has an impact on some companie’s future earnings… and we all know that Wall Street has extremely high expectations now…** \n\n             Wall Street‘a High Expectations\n\nSo far, 88% of S&amp;P 500 companies have beaten earnings per share estimates for the second quarter of 2021, according to data provider FactSet.\n\nThe strong results put the S&amp;P 500 on track to be the best quarter for beats since FactSet started tracking the data in 2008. 😳 So…. What happens if the economy literally comes to a stand still? Which in my opinion is slowly happening and what will happen. You could have a slow correction based on this alone, just on companies missing earnings….which I guarantee that will happen… it’s going to be an earnings miss galore. \n\n                     Lumber/Gold Ratio\n\nSimply put, when lumber goes up that means people are building homes and buying homes and it is a metric of strong economic growth.\n\nWhen gold goes down (safe haven assest, less risk) that is associated with times where stocks and real estate are up, which makes them more attractive and gold less attractive.\n\n**So investors use this ratio to decide when to play offense and when to play defense while managing an active portfolio.**\n\nThis ratio calculates how many contracts of Lumber you can buy with an ounce of gold.\n\nGet it? Good. Now feast your eyes on this  https://imgur.com/a/dlpfsfZ \n\nI like this one better compared to the DOW 30. \nhttps://imgur.com/a/cvYyXsB\n\nThe lumber/gold ratio **HAS PLUMMETED** in the last 2 months…literally fucking straight down. Which is a key indicator for an upcoming correction/crash. (Remember…play defense)\n\nSide note: Lumber has gone up tremendously the last week because of the hurricane situation. But…gold was up big this week as well…and say prayers for the people suffering from Hurricane Ida.\n\n                Consumer Confidence\n\n**In simple terms, increased consumer confidence indicates economic growth in which consumers are spending money, indicating higher consumption.**\n\nSo…for the month of July The Conference Board of consumer confidence which gets its data from a survey of about 3,000 households which asks respondents to rate the relative level of current and future economic conditions including labor availability, business conditions, and overall economic situation.\n\n**They reported 125.10 on the index for the month of July. Boy…were they in for a surprise. The month of August has a consensus estimate of 123.0, the number was 113.9….a very surprising miss. I wasn’t surprised at all to be honest with you.**\n\n\n                      Conclusion\n\n**Let me be clear…I believe Jerome Powell with his magical money printer and rising inflation will be the reason the market falls, also the fact that the government is just handing out free money to every single person with excess stimulus, it’s going to collapse our financial system possibly…also with all the over leveraging you have the perfect brew of a shit storm. Also with rising delta concerns, the new variant “Mu” and mass evictions will soon begin…**\n\n**Since the start of 2013  the SPY has hit 329 all time highs. This is more than the epic run from 1989-2000 where SPY hit 327 all time highs.**\n\nNo big deal right? \n\n**This is a chart of the total assets held in all Federal Reserve Banks.** https://imgur.com/a/l8S1SYP\n\nNo big deal right?\n\n**Median American home prices have now surpassed the 2006 housing bubble peak.** https://imgur.com/a/KJ3KIsi\n\nNo big deal right? \n\n**I mean FOR FUCKS SAKES!!!! I literally could go on and on…. But you get the point by now…let’s not forget the craziness in the Middle East right now, massive devastating storms crippling our country, rising food costs, I’m sure gas will be very high soon. Also, expect to see companies raising their national minimum wage. YOU WILL SEE THIS TREND. Don’t get me started on the mass evictions as well…and the FED has been buying MORTGAGE BACKED Securities… The very financial instrument the collapse of economy in 2008.**\n\nNow…**my positions.** Take this into consideration… I’m 28 years old and I have about $4,000 combined in all of my different portfolios. I may or may not have just got out of prison 9 months ago after completing a 5 year prison sentence. So…Not financial advice. \n\n**Short term:** sold 4 different Call options on SPY via call credit spreads. \n$455/$456 9/15 exp- 2 sold\n$456/457 9/13 exp- 2 sold\n\nBought 3 $10 puts in $BFI 9/17 exp \n\n**Long term:**\n\nOne $13 call option in $HIBS (this security blew up 200%-300% in the span of days during the covid crash)\nIt basically shorts TSLA and other ridiculous growth stocks… I looked at their top 10 holdings and like seven out of 10 of them are at all time highs lol. \n\n2 calls in $TECS $5 strike price. 1/21/22 exp. This is a 3x bear inverse of tech stocks. It’s holdings are like AAPL and MSFT. I want to short stocks that are trading at all time highs. Because when this house of cards finally crumbles they will fall the hardest. **There WILL BE MARGIN CALLS.** You can bet on that. \n\n1 call option in $TBT exp 1/20/23 (hyperinflation bet/Fed raising rates quicker)\n\nOne $50/$80 call debit spread in $VIAC \nExp. 1/22/23 (long exposure to act as my hedge if by some divine miracle I’m wrong) \n\n**My last position:**\n\n**$2,500 in Cash.**\n\nSimply put…**cash is a position.** People seem to forget that. And I will simply buy the dip in my favorite companies… my choice of extremely cheap shares. Trust me… I already have my shopping list ready. \n\nGood luck out there guys. **Timing this is almost impossible**…but my timeline is within 6 months we will experience at least a 15% correction if not a full blown apocalyptic market crash. It’s hard to really assess the damage on how bad it will be. And for those who refuse to take the needle out of their arms, enjoy getting margin called and losing all of your money!\n\n**The company PLTR has positioned themselves for what they call a “Black swan event”by purchasing $50 million in solid gold bars.Not gold ETFs. Solid gold bars…Let me remind you that they deal with information.**\n\nI’m not saying you should sell all of your stocks like me, I’m saying that maybe it’s time to scale back a bit on the margin, move some money into cash and maybe sell some of those positions that are up big. Don’t forget Sleepy Joe is going to raise long term capital gains tax, possibly very soon, from like 20% to as high as 43.4% if you make over $1m… another bearish catalyst for the market… I literally could go on and on guys…. It’s pretty obvious at this point…we’ll at least to me, but what do I know, I just got out of prison last December. \n\nEdit:\nTLTR: just read the bold shit…",
        "subreddit": "wallstreetbets",
        "title": "Imminent Market Crash DD. Why I believe the U.S. stock market and U.S. Dollar will fall.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pj24hx/imminent_market_crash_dd_why_i_believe_the_us/",
        "created": 1630972523.0
    },
    {
        "author": "King_Bum420",
        "created_utc": 1630777019,
        "id": "phvyg9",
        "num_comments": 706,
        "num_crossposts": 0,
        "selftext": "\nThis journey began for me with a random conversation. I was at a grocery store on my break from work and while I was looking at different Greek yogurts, I overheard a man say something I couldn’t believe. I turned around and said “Sir… I’m sorry, what did you just say?” He introduced himself as the owner of the grocery store (locally owned in St.Pete/Clearwater FL area) the gentlemen proceeded to tell me that last year he paid around $4,000 for a crate of food…he said one year later, that same EXACT CRATE IS NOW $14,000.\n\nSo…when I got into my car I had an idea. I wonder what the U.S. Dollar index is trading at…I’m sure it’s bloody red (I assumed) what I saw literally made my jaw drop. I’m not joking…at that time the U.S. dollar happened to be at a 9 month high. I couldn’t fucking believe it. At that moment I knew…we had fucked up. https://imgur.com/a/tBVu4f1\n\nAfter already doing mini DD on why the U.S. dollar might fall just days before (just watching random videos on YouTube about Dr. Burry and stock shit) \n\nI immediately opened a position in my car to profit from this current situation. Which was call options in $TBT. An ETF with 2x inverse exposure on 20+ U.S Treasury bonds. In simple terms, this is a bet on hyperinflation. I believe that the Federal Reserve WILL BE FORCED to raise rates (as that is their main tool in their toolkit to fight inflation) faster than ANYONE is anticipating. Which in turn would collapse bond prices. Making the calls print. I currently have a small position right now.\n\nNow this brings me to the U.S. stock market. I sold all my stocks 2 days ago. I have long exposure in only one position currently. A $50/$80 call debit spread in VIAC. Simply put, if I’m wrong and the market just keeps going, then the $350 I payed for spread will generate nearly $3,000 if VIAC is over $80 on expiration, which is in 2 years.\n\n                  Technical Analysis\n\nLet me start with my TA  first…which is alarming. https://imgur.com/a/kmLCxPX \n\nThis was yesterday, Friday, September 3. \n\n$SPY is at a critical resistance level…I mean…it literally is hitting the fucking roof here… and with everything going on in the world…you want more?!?? Sorry to burst your bubble…but how was that even theoretically feasible? It’s impossible in my opinion. \n\nLet me explain why…\n\n              Updated GDP Forecasts\n\nAm I literally the only one who saw on Thursday that Morgan Stanley updated their forecast for the third quarter GDP expectations??? Let me fill you in on a little secret…THEY CUT THEIR FUCKING ESTIMATES BY MORE THAN HALF!!!!! \n\nFor fucks sake people, THIS IS HUGE!! This is a quote from a brand new article literally posted 45 minutes ago from the Washington Post! \n\n“The team at Morgan Stanley led by chief U.S. economist Ellen Zentner just slashed its forecast for gross domestic product growth this quarter to 2.9% from 6.5%.” \n\nI can’t make this shit up. I started writing my DD before they posted that article, before that you could only find a Seeking Alpha article that you have to pay to read… I discovered this off of my live updates of Bloomberg news. I’m actually having trouble trying to find the article I originally read…I wish I was joking. Whatever…weird. \n\nGross domestic product is a key indicator of economic activity in the United States. So…yeah we’re fucked. Which in turn has a DIRECT impact on companie’s future earnings… and we all know that Wall Street has extremely high expectations now…\n\n                     Lumber/Gold Ratio\n\nSimply put, when lumber goes up that means people are building homes and buying homes and it is a metric of strong economic growth.\n\nWhen gold goes down (safe haven assest, less risk) that is associated with times where stocks and real estate are up, which makes them more attractive and gold less attractive.\n\nSo investors use this ratio to decide when to play offense and when to play defense while managing an active portfolio.\n\nThis ratio calculates how many contracts of Lumber you can buy with an ounce of gold.\n\nGet it? Good. Now feast your eyes on this  https://imgur.com/a/dlpfsfZ \n\nThe lumber/gold ratio HAS PLUMMETED in the last 2 months…literally fucking straight down. Which is a key indicator for an upcoming correction/crash. (Remember…play defense)\n\nSide note: Lumber has gone up tremendously the last week because of the hurricane situation. But…gold was up big this week as well…and say prayers for the people suffering from Hurricane Ida.\n\n                Consumer Confidence\n\nIn simple terms, increased consumer confidence indicates economic growth in which consumers are spending money, indicating higher consumption.\n\nSo…for the month of July The Conference Board of consumer confidence which gets its data from a survey of about 3,000 households which asks respondents to rate the relative level of current and future economic conditions including labor availability, business conditions, and overall economic situation.\n\nThey reported 125.10 on the index for the month of July. Boy…were they in for a surprise. The month of August has a consensus estimate of 123.0, the number was 113.9….a very surprising miss. I wasn’t surprised at all to be honest with you. \n\n\n                      Conclusion\n\nLet me be clear…I personally don’t believe the delta variant has anything to do with this. I don’t want to get politics involved in this post but it is imperative for me to do so but if I do I’ll go down the rabbit hole in the post will probably get taken off. \n\nSince the start of 2013  the SPY has hit 329 all time highs. This is more than the epic run from 1989-2000 where SPY hit 327 all time highs. \n\nNo big deal right? \n\nThis is a chart of the total assets held in all Federal Reserve Banks. https://imgur.com/a/l8S1SYP\n\nNo big deal right?\n\nMedian American home prices have now surpassed the 2006 housing bubble peak. https://imgur.com/a/KJ3KIsi\n\nNo big deal right? \n\nI mean FOR FUCKS SAKES!!!! I literally could go on and on…. But you get the point by now…let’s not forget the craziness in the Middle East right now, massive devastating storms crippling our country, rising food costs, I’m sure gas will be very high soon. Also, expect to see companies raising their national minimum wage. YOU WILL SEE THIS TREND. \n\nNow…my positions. Take this into consideration… I’m 28 years old and I have about $4,000 combined in all of my different portfolios. I may or may not have just got out of prison 9 months ago after completing a 5 year prison sentence. So…Not financial advice. \n\nShort term: sold 4 different Call options on SPY via call credit spreads. \n$455/$456 9/15 exp- 2 sold\n$456/457 9/13 exp- 2 sold\n\nBought 3 $10 puts in $BFI 9/17 exp \n\nLong term: \n\nOne $13 call option in $HIBS (this security blew up 200%-300% in the span of days during the covid crash)\nIt basically shorts TSLA and other ridiculous growth stocks… I looked at their top 10 holdings and like seven out of 10 of them are at all time highs lol. \n\n2 calls in $TECS $5 strike price. 1/21/22 exp. This is a 3x bear inverse of tech stocks. It’s holdings are like AAPL and MSFT. I want to short stocks that are trading at all time highs. Because when this house of cards finally crumbles they will fall the hardest. There WILL BE MARGIN CALLS. You can bet on that. \n\n1 call option in $TBT exp 1/20/23 (hyperinflation bet/Fed raising rates quicker)\n\nOne $50/$80 call debit spread in $VIAC \nExp. 1/22/23 (long exposure to act as my hedge if by some divine miracle I’m wrong) \n\nMy last position:\n\n$2,500 in Cash.\n\nSimply put…cash is a position. People seem to forget that. And I will simply buy the dip in my favorite companies… my choice of extremely cheap shares. Trust me… I already have my shopping list ready. \n\nGood luck out there guys. Timing this is almost impossible…but my timeline is within 6 months we will experience at least a 15% correction if not a full blown apocalyptic market crash. It’s hard to really assess the damage on how bad it will be. And for those who refuse to take the needle out of their arms, enjoy getting margin called and losing all of your money!",
        "subreddit": "stocks",
        "title": "Imminent Market Crash DD. Why I believe the U.S. stock market and U.S. Dollar will fall.",
        "url": "https://www.reddit.com/r/stocks/comments/phvyg9/imminent_market_crash_dd_why_i_believe_the_us/",
        "created": 1630805819.0
    },
    {
        "author": "mountain__pew",
        "created_utc": 1630892334,
        "id": "pips17",
        "num_comments": 287,
        "num_crossposts": 0,
        "selftext": "I see MSFT, AAPL, GOOG, and etc get recommended as buy-and-hold stocks all the time. While I do own a good amount of these stocks, I wonder what blue chips were the MSFT, AAPL, and GOOG 20-30 years ago and failed. And why did they fail.",
        "subreddit": "stocks",
        "title": "What are some of the blue chip stocks that failed in the last 20-30 years?",
        "url": "https://www.reddit.com/r/stocks/comments/pips17/what_are_some_of_the_blue_chip_stocks_that_failed/",
        "created": 1630921134.0
    },
    {
        "author": "mill3rtime22",
        "created_utc": 1631129368,
        "id": "pkhgdk",
        "num_comments": 193,
        "num_crossposts": 0,
        "selftext": "While I know most of you smooth brains won't be able to get that reference I'm just gonna go over some quick facts.\n\nWebsite for reference [https://www.microvision.com/](https://www.microvision.com/)\n\nMVIS has many uses for it's technology but the two main verticals are Automotive Lidar &amp; AR/VR.\n\n**Automotive Lidar -** Microvision just completed what they claim (with good reason) is their \"Best in Class\" Long Range Lidar unit. It is an actual product that they are track testing and showing off at the IAA Mobility Conference in Germany. Look at the live demo they have up vs. our competitors: \n\n* Luminars Lidar Live Demo: [https://streamable.com/c8v23x](https://streamable.com/c8v23x)\n* Continental Lidar Live Demo: [https://streamable.com/gyee85](https://streamable.com/gyee85)\n* Velodyne Lidar Live Demo: [https://streamable.com/lhtsw2](https://streamable.com/lhtsw2)\n* Microvision Live Demo: [https://streamable.com/paywxe](https://streamable.com/paywxe)\n\nAs you can see by the point cloud and refresh rate MVIS sure looks best in class. MVIS is currently on the path of scaling for production and looking for partners.\n\nMarket Size - The global lidar market size is projected to reach **$6.77 Billion by 2026** and virtually every car company is investing/looking to utilize Lidar in the future for assisted and automated driving. It could be in every new vehicle. Luminar (LAZR) the inferior product as you can easily see by the videos above IPO'd last year with a market cap of $8.1 Billion.\n\n**AR/VR** \\- Microvision produces the MEMS Laser Beam Scanning display engine found in the Microsoft Hololens 2. It was confirmed through a tear down before and just officially via MVIS's last ASM. Also, since Microsoft produces the IVAS (rugged Hololens 2 for military use) it is highly speculated that MVIS is the engine inside that also.  \n\nMarket Size - According to a comprehensive research report by Market Research Future (MRFR), “Global AR and VR Market information By Technology, By Component, By Device Type and Vertical - Forecast till 2027” the market to reach **USD 766 billion by 2025.** Also, Microsoft just won an army contract this year **worth up to $21.9 Billion.** \n\nGoogle the Hololens 2 or IVAS units to see all the cool futuristic shit they can do. I'm not gonna spoon feed you everything.\n\n**Stock Info**\n\nCurrent Market Cap = $2.24 Billion\n\n52 Week High = $28\n\n52 Week Low = $1.38\n\nEstimated Short Interest = 29.75m or 18.29% of FF\n\n Q2 2021 shares held by institutions: **42,174,027 (25.7%)** \n\n**Summary**\n\nSince Sumit Sharma took over as CEO he continues to deliver on his promise to increase shareholder value. The company is open for a buyout, strategic alternative, or going it alone with it's amazing technology. Whatever will be the best route to **INCREASE SHAREHOLDER VALUE**. At it's current share price we are way **UNDERVALUED.** There is more DD out there on the technologies, different verticals, and how we are at an inflection point for these things to pop. Go look at the MVIS subreddit and the meta thread there of DD I can't link.",
        "subreddit": "wallstreetbets",
        "title": "$MVIS - Microvision is more bullish than a Lambo",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pkhgdk/mvis_microvision_is_more_bullish_than_a_lambo/",
        "created": 1631158168.0
    },
    {
        "author": "mat025",
        "created_utc": 1630856236,
        "id": "pifa8n",
        "num_comments": 180,
        "num_crossposts": 0,
        "selftext": "My top tech stocks watchlist that pays dividends:\n\n|Ticker|AAPL|MSFT|AVGO|CSCO|INTC|NVDA|TXN|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|Yield|0.57%|0.74%|2.89%|2.49%|2.6%|0.07%|2.15%|\n|PE|30.20|37.78|19.92|18.79|11.89|76.98|25.73|\n|Payout|17.22%|28.11%|57.65%|46.54%|30.89%|5.39%|55.28%|\n|Div Growth YR|9|17|10|10|7|0|15|\n|CAGR 5yr|9.3%|9.52%|50%|9.21%|6.12%|7.66%|21.83%|\n|YOY Rev|13.26%|14.68%|8.46%|\\-0.01%|0.57%|36.16%|9.04%|\n|My Buy Alert|Hold|Hold|BUY|Hold|BUY|Hold|Hold|\n\nMy buying criteria is PE less than **20**, Payout less than **80%**, Dividend growth year at least **1 year,** CAGR for **5** years higher than **3%**, YOY revenue growth higher than **0%**. \n\nSource: my own spreadsheet and seekingalpha.com",
        "subreddit": "investing",
        "title": "My top tech stocks to watch that pays dividends",
        "url": "https://www.reddit.com/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/",
        "created": 1630885036.0
    },
    {
        "author": "DarthTrader357",
        "created_utc": 1630527289,
        "id": "pg22p0",
        "num_comments": 146,
        "num_crossposts": 0,
        "selftext": "[https://ofdollarsanddata.com/no-this-isnt-a-repeat-of-the-dot-com-bubble/](https://ofdollarsanddata.com/no-this-isnt-a-repeat-of-the-dot-com-bubble/)\n\nIronic that bulls said \"we aren't in a bubble because 27 P/E isn't as bad as the 44 P/E of 22 years ago\".\n\nIronic because now our P/E is at 37 after stellar - great - earnings growth from 2nd Quarter. So even all that Earnings growth wasn't able to absorb the P/E ballooning. That includes MSFT trading at 38.09 P/E right now.\n\nThe US CAPE ratio is actually in pretty disastrous territory:\n\n[https://siblisresearch.com/data/cape-ratios-by-country/](https://siblisresearch.com/data/cape-ratios-by-country/)\n\nAnd to any Bull-siders....of course no one can really \"time\" when a bubble will pop.\n\nAlso no one can really say that inflation or continued Earnings growth won't deflate the bubble gently.\n\nBut you have to start asking yourself how will the P/E come down from these highs, because there are only three options:\n\n* Earnings Growth near term (2 to 3 years).\n* Inflation (5 year terms)\n* Market Correction\n\nDo you really think Earnings will double in the next 2 or 3 years across the board? That's your bet to take.",
        "subreddit": "options",
        "title": "Are we in a bubble?",
        "url": "https://www.reddit.com/r/options/comments/pg22p0/are_we_in_a_bubble/",
        "created": 1630556089.0
    },
    {
        "author": "senecadocet1123",
        "created_utc": 1630582311,
        "id": "pgg0b6",
        "num_comments": 99,
        "num_crossposts": 0,
        "selftext": "So, Alibaba is of course the most discussed stock in the last month on this sub, I think. So I decided to discuss Tencent, instead.\n\nI think Tencent is simply incredible. Let's see why:\n\n&amp;#x200B;\n\n* **WeChat** \n\nThey own WeChat/Weixin (Weixin is for mainland China, WeChat for everywhere else. I will call it WeChat). WeChat is.. WeChat. Mohnish pabrai calls it \"a bazooka Tencent can fire at will\". It has 1.25 billion users. What can you do on WeChat? Everything. Text, pay for stuff, play games, shop online, anything. Imagine if the following app existed:\n\n* Need something on Amazon? No problem, you can do it directly from WeChat through its mini-app.\n* Need to pay something in a shop? Use TenPay.\n* Need a ride on Uber? Use WeChat mini-app.\n* Need to order food on DoorDash? WeChat.\n\nReplace Amazon with JD, Uber with Didi, DoorDash with Meituan, and you have WeChat. \n\nWeChat is a bazooka beause, if Tencent decides to partner with someone and allows them to integrate in their ecosystem, that business will explode. It happened with Pinduoduo, which mainly works on WeChat: it grew 100% last year.\n\nSince it runs the platform, Tencent gets a commission. Also, it stores all the data that goes through these apps. In 2020, revenue from WeChat was 16.7 billion dollars, out of 74.6 billion in total. WeChat has 3.2 million mini programs on its platform, which transacted 1.6 trillion RMB (247 billion $) in 2020. To get how much this thing is growing, in 2017 it was 210 billion RMB (32b).\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n* **Tencent's empire**\n\nTencent has an impressive number of businesses: they have a subscription revenue which is 62% that of Netflix; a media ads business (bigger than the Nyt), games, cloud, mobile payment services. Their business is so wide it is hard to navigate. Some examples:\n\n1. **Gaming**: Tencent has around 50% of market share in China in the mobile gaming industry. In 2020 they made 29.3 billions from games. In 2021 it is probably going to be lower. Online gaming industry in 2020 was 58b, it is expected to grow to 86b in 2027. Mobile gaming is projected to be 70% of the online gaming market in China by then.\n2. **TenPay**: There are two ways to pay for stuff in China: TenPay and AliPay. While in the West switched from cash to cards, and are still in transition, China has skipped a step and went directly to mobile payments. In 2018 already, a walloping 83% of all payments in China were made through mobile. Now it is around 90%. Cards are useless, in China: they account for less than 5% of payments. In the Western world, Google pay and Apple Pay are only now eroding the empire of Visa, Mastercard, American Express etc. China, on the other hand, was to Tencent and Alibaba like a smooth field: they just took over. Apple pay now has around 500 million users world-wide. Tencent has 900 millions. From the last financial report, Tencent shows that revenue of the financial technology and corporate services business increased by 40% year-on-year to RMB 41.9 billion (6. billions). China's mobile payment market is projected to reach 88.4 Billion usd by the year 2027, trailing a CAGR of 47.3%.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n* **Tencent's fantastic portfolio**:\n\nBefore you do a cf analysis of Tencent, you need to know that Tencent has a portfolio that is currently valued around 250 billions usd at present. It is like a financial version of Cthulhu, with tentacles everywhere. It is quite hard to navigate/find information about it. They say they are currently invested in over 700 companies, of which only 103 are publicly traded. This guy has put up a [spreadsheet](https://docs.google.com/spreadsheets/d/1owpL6WmMK30X19Kw3BziAw39rGJbsfIMOOexdtvAkxU/edit) for you that tracks the most notable public ones.\n\nSome notable busineness Tencent owns (percentages might not be accurate):\n\na) Gaming:\n\n* 100% Riot Games (League of Legends)\n* 40% Epic Games (Fortnite)\n* 81.4% Supercell (Clash of Clans)\n* 10% BlueHole (PUBG)\n* 80% Grinding Gear Games (Path of Exile)\n* 5% Activision Blizzard.\n* 20% Kingsoft (gaming competitor in China &amp; cloud business)\n\n&amp;#x200B;\n\nb) Finance:\n\n* 30% Webank (biggest online bank in China)\n* 2%? Khatabook (digital payments in India)\n* 25% Gojek (same in Indonesia)\n\n&amp;#x200B;\n\nc) Social:\n\n* 50.1% Huya (twitch-like)\n* 38% Douyu (twitch-like)\n* 12% Snapchat\n\n&amp;#x200B;\n\nd) Music:\n\n* 58% Tencent music\n* 6.8% Spotify\n* 10% Universal music group\n\n&amp;#x200B;\n\ne) E-commerce:\n\n* 25% Sea ltd (which also makes games, does mobile payments etc)\n* 18% JD\n* 17% Pinduodo\n* 7% Vipshop\n\n&amp;#x200B;\n\nf) Other\n\n* 20% Meituan (Doordash of China)\n* 15% Nio (ev)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n* **Valuation**\n\nHow do you value Tencent? Currently, Tencent has a market cap of 619.72b, with a P/E of 24 and P/fcf (trailing 12 months) of 22 (Do not forget the investment portfolio, as well). fcf grew 29.4% a year in the last 10 years. Tencent has Microsoft-style profit margins of 35%. Revenue is growing at more than 30% a year, which is insane for a company this size. With its impressive portfolio, Tencent is poised to have a leading role in a country that is growing it GDP at 7%, that soon will catch up with the US, and where around 500 million people are projected to reach middle class in the next 10 years, something which will benefit tech companies the most. Of course, the risks are China regulations, in particular its anti-monopoly campaign; China in general: VIE structure, accounting standards etc. Here is an earnings based model, but take it with a grain of salt. \n\nDiscount rate: 14%. Based on eps without nri. 20 years.\n\n* Best scenario (20%): year 1-10: 25% growth, y 10-20: 10%. Value: 112.13\n* Normal scenario (60%): y1-10: 18%; y10-20: 10%. Value: 70.38\n* Worst scenario (20%): y1-10: 15%. y10-20: 8%. Value: 55.27\n* Fair value: 75.7\n* current price: 64.56. Undervalued by 17.25 % for a 14% return.  \n\n\nOf course it's all about assumptions. If you raise margin of safety, cut down growth estimates etc, you will get a very different number. I think I used a fairly conservative growth estimate, though. I personally think the upside for Tencent is insane., even though it is a behemoth already. It is one of my strongest buys.\n\n&amp;#x200B;\n\nI might consider doing a separate post about the risks of investing in Tencent: China regulations etc. For now.. thanks for reading!\n\nSources:\n\n[https://www.businessofapps.com/data/wechat-statistics/](https://www.businessofapps.com/data/wechat-statistics/)\n\n[https://www.notboring.co/p/tencent-the-ultimate-outsider](https://www.notboring.co/p/tencent-the-ultimate-outsider)\n\n[https://finance.yahoo.com](https://finance.yahoo.com) &amp; [gurufocus.com/](https://gurufocus.com/)\n\n[https://www.statista.com/topics/4322/apple-pay/](https://www.statista.com/topics/4322/apple-pay/)\n\n[https://daxueconsulting.com/payment-methods-in-china/](https://daxueconsulting.com/payment-methods-in-china/)\n\n[https://static.www.tencent.com/uploads/2021/04/08/960eae1f18dd716fd3a7d704e123d7a5.pdf](https://static.www.tencent.com/uploads/2021/04/08/960eae1f18dd716fd3a7d704e123d7a5.pdf)\n\n[https://min.news/en/economy/aa274e1f9ba05e4b8a246a71d9035681.html](https://min.news/en/economy/aa274e1f9ba05e4b8a246a71d9035681.html)\n\n[https://www.globenewswire.com/en/news-release/2020/10/08/2105516/28124/en/Global-Contactless-Payment-Transaction-Market-Report-2020-2027-Market-Expected-to-Grow-at-a-CAGR-of-49-7-U-S-Market-is-Estimated-at-10-Billion-While-China-is-Forecast-to-Grow-at-47.html](https://www.globenewswire.com/en/news-release/2020/10/08/2105516/28124/en/Global-Contactless-Payment-Transaction-Market-Report-2020-2027-Market-Expected-to-Grow-at-a-CAGR-of-49-7-U-S-Market-is-Estimated-at-10-Billion-While-China-is-Forecast-to-Grow-at-47.html)\n\n[https://www.globenewswire.com/en/news-release/2021/05/04/2222088/28124/en/China-Online-Gaming-Market-Report-2021-Market-was-Valued-58-Billion-in-2020-and-is-Expected-to-Reach-to-86-Billion-by-2027-Top-Players-are-Tencent-NetEase-Kingsoft-Changyou-Shanda-.html](https://www.globenewswire.com/en/news-release/2021/05/04/2222088/28124/en/China-Online-Gaming-Market-Report-2021-Market-was-Valued-58-Billion-in-2020-and-is-Expected-to-Reach-to-86-Billion-by-2027-Top-Players-are-Tencent-NetEase-Kingsoft-Changyou-Shanda-.html)\n\n[https://kr-asia.com/key-stat-mobile-games-to-take-over-70-of-chinas-gaming-market-in-2020](https://kr-asia.com/key-stat-mobile-games-to-take-over-70-of-chinas-gaming-market-in-2020)",
        "subreddit": "ValueInvesting",
        "title": "Tencent is simply incredible (deep dive).",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/pgg0b6/tencent_is_simply_incredible_deep_dive/",
        "created": 1630611111.0
    },
    {
        "author": "jheffer44",
        "created_utc": 1630861775,
        "id": "pigz3i",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": " I have the following LEAPS.. (all MSFT)\n\n* June 17th 2020 - 200 call (up 192%)\n* June 16th 2023 - 220 call (up 89%)\n* Jan 20 2023 - 260 call (up 174%)\n* Mar 17th 2023 - 255 call (up 83%)\n\nI've been following the strategy of Youtube user \"InTheMoney\" and buying calls that are already in somewhat deep in the money so the theta decay doesn't destroy me... ([https://www.youtube.com/watch?v=95suqaJcFtU](https://www.youtube.com/watch?v=95suqaJcFtU))\n\nI have previously sold a June 16th 2021 - 160 call and bought two more calls with that profit (listed above)\n\nThe question I have for you all is when do you normally sell your LEAPS positions? I have nothing but confidence in MSFT so I am leaning towards holding until about 2-3 months until expiration. If there is one thing in life I've learned in my short career of trading, its to hold... Just looking for other thoughts/opinions on the matter, thanks!",
        "subreddit": "wallstreetbets",
        "title": "When do you normally sell LEAPS?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pigz3i/when_do_you_normally_sell_leaps/",
        "created": 1630890575.0
    },
    {
        "author": "nobjos",
        "created_utc": 1630932412,
        "id": "piyri4",
        "num_comments": 71,
        "num_crossposts": 0,
        "selftext": "A recurring theme over the past year has been one ‘expert’ after another bashing index funds calling them a massive bubble that is waiting to pop.   \n\n[ ](https://i.redd.it/z8f8yutkpvl71.gif)\n\n&gt;Could Index Funds Be ‘Worse Than Marxism’? – [The Atlantic](https://www.theatlantic.com/ideas/archive/2021/04/the-autopilot-economy/618497/)  \n&gt;  \n&gt;This \\[index funds\\] is very much like the bubble in synthetic asset-backed CDOs before the Great Financial Crisis. It will be the Greatest Speculative Bubble of All Time in All Things – [Michael Burry](https://www.cnbc.com/2019/09/04/the-big-shorts-michael-burry-says-he-has-found-the-next-market-bubble.html)  \n&gt;  \n&gt;Is Passive Investment Actively Hurting the Economy? - [The New Yorker](https://www.newyorker.com/business/currency/is-passive-investment-actively-hurting-the-economy)\n\nBut at the same time, we have investors like Warren Buffet who still swear by a low-cost index fund and recommends it over his own Berkshire Hathaway stock! So, in this week’s issue, we analyze both sides of the argument and see if we \\[1\\] should be worried about the index fund bubble!\n\n**The Problem**\n\nThe argument against the index fund is a logical one. The basic premise is that index funds affect the price discovery of stocks in the market. If a stock is bid up just based on the presence in an index and not by analyzing the underlying asset, then it can lead to a bubble-like scenario where you are buying more and more just because the asset prices are going up.\n\n[ ](https://preview.redd.it/a04wyrgmpvl71.png?width=1260&amp;format=png&amp;auto=webp&amp;s=1693f22d16deb337345e5accb8f360de959707a7)\n\nIf you look at the above chart, you could see that in the first 4 months of 2021, a fund inflow of more than $20 Billion occurred just to the Vanguard 500 index fund. There are arguments stating that in the US, index funds make up [more than 50% of the fund market.](https://www.theatlantic.com/ideas/archive/2021/04/the-autopilot-economy/618497/) (This exponential growth is not a surprising one given my last analysis showed that passive funds have summarily beaten active funds over the last 2 decades)\n\nIf you think about this, more than half of the money that is flowing into the market is now just buying stocks that are on an index without doing any underlying stock analysis. The problem becomes that companies get more and more investment just because they are big and not because of their future growth prospects. So the question becomes\n\n**Is the index fund affecting the integrity of the stock market?**\n\nThe problem with the fund inflow statistics is that stock price is not decided solely based on fund inflow but majorly by trading.\n\n[ ](https://preview.redd.it/cjlyt4unpvl71.png?width=629&amp;format=png&amp;auto=webp&amp;s=67be6be3b3604712dd017a823da8aee69116019e)\n\nIf you look at this [study done by Vanguard](https://personal.vanguard.com/pdf/ISGBEL.pdf) \\[2,3\\], it destroys the price discovery argument. It shows that only 5% of the overall trading volume is captured by index funds. The rest of 95% of trading is made by active traders, pension funds, and institutional investors who do individual stock analyses.\n\nAdding to this, even if the index funds become large enough to create significant price distortions, it’s something that the active fund managers can benefit from as it would give them more opportunities to short overvalued companies and create outsized returns. The fact that it’s not happening right now shows that we are not anywhere near a situation where the index fund is big enough to fundamentally alter the market\\[4\\].\n\nNow that we know that index funds are not causing any price distortions, one has to wonder\n\n**why there is a sudden rise in concerns regarding an index fund bubble over the past 2-3 years?**\n\nI believe that this issue is being brought up by institutions and active fund managers as there is a drastic shift from active to passive management over the last few years.\n\n[ ](https://preview.redd.it/pq1b3fbppvl71.png?width=713&amp;format=png&amp;auto=webp&amp;s=699fc8dd9d5f2dee76f47e6f02763c8b352084b6)\n\nThe above chart from Morningstar showcases that active funds on average lost more than $150B every year over the 2014-18 period and this trend is only becoming worse for the active funds. This trend is also replicated worldwide with more than $300B is pulled out of active funds and $500B is pushed into index funds every year (as of 2016).\n\nFinally, as of 2019, for the first time, more money is being pushed into passive than active funds! All of this must be ringing alarm bells across active funds as their income is directly dependent on the total asset under management.\n\n**Alternatives to index funds**\n\nWhile researching this topic, I came across some genuine concerns about index funds. The most important of them being that you might not be as diversified as you expect investing in an index fund.\n\nAs of Aug 2021, the top 5 tech stocks (AAPL, MSFT, GOOGL, AMZN &amp; FB) account for more than 23% of the S&amp;P500! While this worked out great for the overall index over that last decade given the tech rally, any long-term downturn for tech stocks will significantly affect your portfolio.\n\nThere are two alternatives that I found to the regular market cap based index fund allocation\n\n[Equal-weighted index funds](https://www.lynalden.com/equal-weighted-index-funds/): Equal-weighted index fund allocates your capital equally across the stocks in the given index. For Eg. in S&amp;P500 index, all the 500 companies would get an equal proportion of your index. This will avoid your portfolio becoming concentrated on a few highly overvalued stocks!\n\n[ ](https://preview.redd.it/ikn5px2rpvl71.png?width=615&amp;format=png&amp;auto=webp&amp;s=ff145127fe86a728e0ebd0663d8566341163aa3a)\n\n[Reverse weighted index funds:](https://www.etftrends.com/smart-beta-channel/an-etf-that-beats-sp-500-by-turning-it-upside-down/) This one is for the more adventurous, where the investments are made by turning S&amp;P500 upside down on its head! The smallest companies on the list get the largest share of investment! Even though this reduces your exposure to large tech stocks and blue-chip companies (which get a lot of attention and is possibly overvalued), your investments will be concentrated on smaller companies that are inherently volatile and can produce outsized returns! Even though this strategy has beaten the traditional index returns, you still have to consider that this type of fund was introduced [just two years ago](https://www.barrons.com/articles/sp-500-index-fund-reverse-weighting-51557430544).\n\n**Conclusion**\n\nI believe that the index fund bubble narrative is over-blown and is being predominantly driven active fund managers who are trying to stop losing their business to the passive funds every year. All the data from our research shows that we are nowhere near a situation where index funds can alter the price discovery in any significant way!\n\nWhile the index fund bubble might be getting undeserved attention, it's always a good thing to check if you are comfortable with the current skewness of your portfolio towards tech stocks. After all, the tech rally over the last decade has undoubtedly benefitted all our portfolios, but we should also be ready for when the party inevitably comes to a close!\n\nUntil next week :)\n\n**Footnotes**\n\n\\[1\\] This is the first time in an analysis where I cannot claim to be unbiased as a substantial portion of my portfolio (&gt;90%) is tied up in an index fund. So take all the arguments with a grain of salt!\n\n\\[2\\] *Setting the record straight: Truths about indexing* is an excellent study done by Vanguard in 2018 where they review the rationale for indexing’s efficacy, quantify the benefits of indexing to investors, clarify the definition of indexing, and explore the validity of claims that indexing has an adverse impact on the capital markets.\n\n\\[3\\] This study also showcases that ETF trading (creation/redemption mechanism of exchange-traded funds (ETFs)) has minimal impact on the underlying securities as only 6% of the trading is involved in primary market trading with the rest being in the secondary market.\n\n\\[4\\] This is also known as the Grossman-Stigliztz paradox:- There would be a point where indexing would become big enough to affect price discovery, then active managers would be able to profit off that, and more and more people would move to the active funds. Finally, in an efficient market, an equilibrium point would be reached where neither party (index funds or active fund managers) would be able to beat each other.",
        "subreddit": "wallstreetbets",
        "title": "The Index Fund 'Bubble' - Should you be worried?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/piyri4/the_index_fund_bubble_should_you_be_worried/",
        "created": 1630961212.0
    },
    {
        "author": "Puzzleheaded_Bill_10",
        "created_utc": 1630713199,
        "id": "phgqi2",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nPhones, TVs, tablets, Keyboards, Key fobs, cars... ETC\n\nMany things in this world require semi conductors! Its only a thriving technological world. I am a salesperson at a Large FCA Store (Stellantis) Dealership in the midwest, and we are sitting on less vehicles today for sale in September, 2021 than we had in July, 2021. \n\n**Ram trucks factories are shut down right now. Ford trucks are 6 months out. If you want to order a new Cadillac Escalade, expect your new Cadillac to be manufactured next Summer!**\n\n&amp;#x200B;\n\nWith rising demand in Electronics TSMC says has begun construction at its Arizona chip factory site. **June 1** (Reuters) - Taiwan Semiconductor Manufacturing Co Ltd (2330.TW) (TSMC) has started construction at a site in Arizona where it plans to spend $12 billion to build a computer chip factory, its chief executive said on Tuesday. \n\n[https://www.scmp.com/tech/big-tech/article/3146266/arizona-group-courts-taiwanese-chip-companies-new-agreement-following](https://www.scmp.com/tech/big-tech/article/3146266/arizona-group-courts-taiwanese-chip-companies-new-agreement-following)\n\n&amp;#x200B;\n\nI think we may see a rise in Semi Conductors in the years to come. Everything that requires a button in your car, fire stick remote controller, xbox controller, keyboard etc... requires a semi conductor.\n\nThe problem with the vehicle shortage is that the vehicle manufactures planned to schedule less chips in February 2021 for the vehicles of 2021 sales. They thought they would sell less vehicles this year because of the Covid, however, earlier this year, things opened and mask came off.  The car manufactures decided to instead order the same amount of chips as they usually do yearly, but the orders were already booked for other manufactures that needed chips. This is why you dont see a shortage in Smart phones, and computers, or TVS. The chip factories are producing chips for them first now before they can produce for car manufactures. It isn't because of a covid factory shut down...\n\nThis gives me reason to believe that demand will only increase for Semi Conductors and since TSM holds the most market in this area and they can generally control pricing. \n\nThis shows that the demand of current electrical devices int he world is actually far greater than we expected!\n\n&amp;#x200B;\n\nSolid LongTerm Lifetime investment company\n\n&amp;#x200B;\n\n*At todays share price on September 3rd, 2021*\n\n*The P/E Ratio of TSM is 32X* \n\n*Apple P/E Ratio is 29X*\n\n*Microsoft P/E ratio is 37X*\n\n*Tesla P/E ratio is 170X*\n\n&amp;#x200B;\n\n*Average analyst target of $147/share.*\n\nHigh of $200 and Low of $105\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n TSMC formed in 1987, located HQ in Hsinchu, Taiwan.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5xnxfeghadl71.jpg?width=700&amp;format=pjpg&amp;auto=webp&amp;s=439f443755a78bf1d3196f0dbf40094a440d3308\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1on5sfgiadl71.jpg?width=881&amp;format=pjpg&amp;auto=webp&amp;s=daec6d79172b837788407a8a9aa424e314dc045c\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qyjqrmekadl71.jpg?width=280&amp;format=pjpg&amp;auto=webp&amp;s=7d23b13907924b9618d8f9def091308fbe0b0227\n\nhttps://preview.redd.it/dm7llfz59dl71.png?width=2388&amp;format=png&amp;auto=webp&amp;s=c0f312c9e543ffed4b23af9e395ced2ee39513dd\n\n&amp;#x200B;\n\nhttps://preview.redd.it/f5o61y339dl71.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=2b523709807728fb9e2e3493a8049ab218f24da6\n\n&amp;#x200B;\n\nhttps://preview.redd.it/um88hin29dl71.jpg?width=1504&amp;format=pjpg&amp;auto=webp&amp;s=5552a028558c76441675d3bec3cedb4a722e5cd1\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wv6gsi509dl71.jpg?width=1440&amp;format=pjpg&amp;auto=webp&amp;s=0f984f64edabdb85ef83e3ae665395b55e299a0b\n\n&amp;#x200B;\n\nhttps://preview.redd.it/vwgxhayfcdl71.jpg?width=2119&amp;format=pjpg&amp;auto=webp&amp;s=a610a0371e7d27e6506ddec9a2f3ffbdea533bd2\n\nToday i bought 100 calls, (2 days after earnings) purchase and am expecting more long term purchased investments into this company. I expect better than expected earnings, because last week, a representative said that we can expect order tightness of conductors to follow into next year.\n\nIF you look at the earnings chart, each quarter they have gone closer to matching expected earnings, and this next earnings should either be the same or better than expected.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wwytehz9kdl71.jpg?width=1433&amp;format=pjpg&amp;auto=webp&amp;s=cd956b5e18823258858fe0d581354dba52e06bfc",
        "subreddit": "wallstreetbets",
        "title": "Lets talk about TSM Stock \"Taiwan Semiconductor\" The rise of Electronic devices",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phgqi2/lets_talk_about_tsm_stock_taiwan_semiconductor/",
        "created": 1630741999.0
    },
    {
        "author": "waxingeloquence",
        "created_utc": 1630954167,
        "id": "pj5rdz",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": " \\*\\*\\*Disclaimers &amp; Disclosures: This article is meant for discussion and entertainment purposes only. The following is not investment advice, nor a recommendation to buy or sell any security/investment. Investments always carry risk, so DYOR.\n\nWe are traders &amp; private investors who see the value of Reddit in creating and growing an investing community.\n\nStocks included in this article: WBA, AAPL, MSFT, GS, CVS, RAD, WMT, TGT, UNH, CI, DG, JNJ, PG, AMZN, BRK/A, BRK/B.\n\nWe are long WBA.\n\n\\*\\*\\*\n\n&amp;#x200B;\n\nWalgreens ($WBA) is a safe and cheap stock, selling at a discount, with an improving underlying business, and ripe for a buyout. In addition to a healthy 4% dividend, Walgreens is also a major potential takeover target in the healthcare/pharmaceutical space. Selling at attractive valuations, and as both a Dow component and a best-of-breed player in the pharmacy business, we think Walgreens represents a huge investment opportunity. Furthermore, with cheap valuations, a low Beta, and lower correlation to the broader market, we believe WBA is a top defensive play &amp; income producer, and could be added as a core position to anyone’s portfolio. Including WBA in your portfolio is highly likely to reduce overall portfolio volatility and risk, and improve your performance.\n\n**Our price target for $WBA is $74, an upside of approximately 50%.**\n\nBelow are the 6 main reasons we’re bullish on WBA.\n\n&amp;#x200B;\n\n**1)** **WBA is a Dow component.**\n\nWalgreens stock ($WBA) is a Dow component. As one of only 30 stocks in the Dow Jones Industrial Average (the oldest and most historically-followed U.S. market index dating back to the late 1800s), WBA is now considered one of the select large-cap companies which (together) accurately represent the overall market.\n\nThough WBA has a small weighting in the Dow (only \\~1% when compared to 3% for Apple (AAPL), 5% for Microsoft (MSFT), and 7% for Goldman Sachs (GS), for example), it still stands to benefit greatly from being one of the most visible and widely-followed stocks as part of the Dow index. Moreover, with $Billions (or Trillions) of Dollars in passive investing, a lot of money flows to index funds. As index funds are bought, money is then invested into WBA, which pushes the price up.\n\nWBA has A LOT of room to go. Its stock price can increase and earn a higher weighting, which could then trigger a “virtuous cycle”, where the stock price increases --&gt; WBA weighting increases --&gt; more passive (and active) money flows into WBA --&gt; the stock price increases --&gt; the positive cycle repeats.\n\nIn short, as a (relatively new) part of the Dow, WBA stock stands to gain. As it benefits from passive/index investing, its market cap can be $Billions larger. The honor of being one of the few companies in the Dow will keep WBA stock visible to investors and will keep the stock supported in a big way.\n\n&amp;#x200B;\n\n**2)** **Best-of-Breed in Pharmacy/Healthcare**\n\nWalgreens is clearly one o f the largest players and best-of-breed companies in the Pharmacy/Healthcare space. Not only is WBA’s inclusion in the Dow a huge statement that WBA is best-of-breed, but also the lack of competition and alternative choices in pharmacy stocks is a huge advantage to WBA. With only CVS ($CVS) and Rite-aid ($RAD) as similar peers in the entire market (and with worse financials!), WBA is a clear #1 investment choice.\n\n&amp;#x200B;\n\n**3)** **4% Dividend**\n\nA 4% dividend makes WBA an income investment opportunity, in addition to the growth and stock price increases we expect to see in the near future. Not only is WBA a relatively safe stock with a low Beta (lower volatility than the broader market), but also the excellent 4% dividend payment is already half of the stock market’s yearly average return (8%) going back 100+ years.\n\nIts further possible that WBA’s dividend can continue to grow sustainably; in fact, WBA is a blue-chip dividend powerhouse and officially a member of the \"Dividend Aristocrats\", companies which have increased their dividend for 25+ consecutive years. Walgreens has increased its dividend for 45 years and running.\n\n&amp;#x200B;\n\n**4)** **Attractive Valuations**\n\nWBA has very attractive valuations, and the stock is selling at a major discount. Investors have a chance right now to buy the stock and a great company at a bargain, right before the stock price could rise by 50%+.\n\nWhy is the stock so cheap? The company has shown poor stock performance over the past few years mostly due to poor earnings performance, low profitability, and high debt. Fortunately, things are improving and the stock hasn’t yet reflected the good news. It will soon be priced in, and the stock price will rise.\n\nHow do we know it’s cheap? Why is the stock a “buy”? WBA stock sells at attractive low multiples (1) on an absolute basis (10x forward P/E, 2x P/B, 9x P/FCF), (2) on an historical basis (lowest P/S and near 15-year low P/B and P/FCF), and (3) on a peer comparables basis (WBA is selling at significantly cheaper valuation multiples than Walmart (WMT), Johnson &amp; Johnson (JNJ), Procter &amp; Gamble (PG), Target (TGT), Dollar General (DG), United Health (UNH), Cigna (CI), etc.).\n\nIn other words, the stock is cheap on nearly all fronts, and potentially offering a major value investment. If WBA had multiples more comparable to its peer group, the stock would be trading at a significantly higher price. As market participants come to realize this market mispricing/inefficiency, the stock price is likely to adjust higher.\n\n&amp;#x200B;\n\n**5)** **Improving Business**\n\nWalgreens’ business and future prospects seem to be improving. With a new CEO at the helm (the first African American female CEO of a Fortune 500 company), along with critical strategic decisions/initiatives likely upcoming, WBA is very well-positioned to grow and gain market share.\n\nWith most locations (physical stores) in very good condition still looking new, located on prime real estate, and acting as top places to get vaccinated against Covid-19, there is plenty more time in WBA’s bullish cycle. (see: [https://www.netleaseadvisor.com/tenant/walgreens/](https://www.netleaseadvisor.com/tenant/walgreens/) )\n\nWe will look at the upcoming year’s revenue, income, and cash flows to judge WBA’s progress and performance.\n\n&amp;#x200B;\n\n**6)** **Takeover Target / Buyout**\n\nThe cherry on top for Walgreens ($WBA) stock is a takeover.\n\nWalgreens is an attractive takeover target. Especially in the retail/pharmaceutical/healthcare space, Walgreens presents a market-moving opportunity for a large public company or private equity group. In fact, this was attempted not too long ago when in late-2019 KKR ($KKR) showed interest in taking WBA private in the largest private-equity buyout of all-time (see: [https://www.theguardian.com/business/2019/nov/11/walgreens-boots-alliance-kkr-buyout-offer](https://www.theguardian.com/business/2019/nov/11/walgreens-boots-alliance-kkr-buyout-offer) ). The takeover offer at the time was $70-80/share, 40-60% higher than current prices.\n\nThere is clearly significant interest in WBA, and it’s been quiet for a little while. The sleeping lion (or bull?) could wake up at any moment.\n\nA takeover has been attempted at much higher prices by private equity buyers. The existence of such investor interest and possible takeover offers provides (1) a strong catalyst for a soaring stock price, and (2) a floor to the stock, which will support the stock at or above current prices. If the stock price drops too far, buyers are highly likely to step in.\n\nAdditionally, though maybe unlikely, both Amazon ($AMZN) and Warren Buffett / Berkshire Hathaway ($BRK/A)($BRK/B) could be potential buyers. Amazon has shown much interest in expanding into Pharma/Drugs/Prescriptions as well as expanding its retail operation. WBA seems to be a great potential fit; and at only $50-100B, WBA is not such a big purchase for the $2 Trillion market cap Amazon.\n\nWarren Buffett and/or Berkshire Hathaway could also be a potential investor. WBA fits many of the criteria which Buffett and other value investors look for. Additionally, Buffett and a joint venture between Amazon, Berkshire, and JP Morgan (called “Haven”) showed strong interest in disrupting the healthcare sector until recently disbanding (see: [https://www.cnbc.com/2021/01/04/haven-the-amazon-berkshire-jpmorgan-venture-to-disrupt-healthcare-is-disbanding-after-3-years.html](https://www.cnbc.com/2021/01/04/haven-the-amazon-berkshire-jpmorgan-venture-to-disrupt-healthcare-is-disbanding-after-3-years.html) ).\n\nIt seems painfully clear that Amazon ($AMZN), Berkshire ($BRK/A)($BRK/B), and other major players are highly-interested in gaining a foothold in the space which Walgreens ($WBA) already dominates. If takeover interest materializes, or if Buffett decides to invest more heavily in WBA, you can bet there will be a lot of attention on the stock, and the stock price is likely to be much higher.",
        "subreddit": "stocks",
        "title": "Walgreens DD ($WBA): Safe Stock, Selling at a Discount, 4% Dividend, Improving Business --&gt; Price Target $74 (50% upside).",
        "url": "https://www.reddit.com/r/stocks/comments/pj5rdz/walgreens_dd_wba_safe_stock_selling_at_a_discount/",
        "created": 1630982967.0
    },
    {
        "author": "waxingeloquence",
        "created_utc": 1631017640,
        "id": "pjm2dy",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": " \\*\\*\\*Disclaimers &amp; Disclosures: This article is meant for discussion and entertainment purposes only. The following is not investment advice, nor a recommendation to buy or sell any security/investment. Investments always carry risk, so DYOR.\n\nWe are traders &amp; private investors who see the value of Reddit in creating and growing an investing community.\n\nStocks included in this article: WBA, AAPL, MSFT, GS, CVS, RAD, WMT, TGT, UNH, CI, DG, JNJ, PG, AMZN, BRK/A, BRK/B.\n\nWe are long WBA.\n\n\\*\\*\\*\n\n&amp;#x200B;\n\nWalgreens ($WBA) is a safe and cheap stock, selling at a discount, with an improving underlying business, and ripe for a buyout. In addition to a healthy 4% dividend, Walgreens is also a major potential takeover target in the healthcare/pharmaceutical space. Selling at attractive valuations, and as both a Dow component and a best-of-breed player in the pharmacy business, we think Walgreens represents a huge investment opportunity. Furthermore, with cheap valuations, a low Beta, and lower correlation to the broader market, we believe WBA is a top defensive play &amp; income producer, and could be added as a core position to anyone’s portfolio. Including WBA in your portfolio is highly likely to reduce overall portfolio volatility and risk, and improve your performance.\n\n**Our price target for $WBA is $74, an upside of approximately 50%.**\n\nBelow are the 6 main reasons we’re bullish on WBA.\n\n&amp;#x200B;\n\n**1)** **WBA is a Dow component.**\n\nWalgreens stock ($WBA) is a Dow component. As one of only 30 stocks in the Dow Jones Industrial Average (the oldest and most historically-followed U.S. market index dating back to the late 1800s), WBA is now considered one of the select large-cap companies which (together) accurately represent the overall market.\n\nThough WBA has a small weighting in the Dow (only \\~1% when compared to 3% for Apple (AAPL), 5% for Microsoft (MSFT), and 7% for Goldman Sachs (GS), for example), it still stands to benefit greatly from being one of the most visible and widely-followed stocks as part of the Dow index. Moreover, with $Billions (or Trillions) of Dollars in passive investing, a lot of money flows to index funds. As index funds are bought, money is then invested into WBA, which pushes the price up.\n\nWBA has A LOT of room to go. Its stock price can increase and earn a higher weighting, which could then trigger a “virtuous cycle”, where the stock price increases --&gt; WBA weighting increases --&gt; more passive (and active) money flows into WBA --&gt; the stock price increases --&gt; the positive cycle repeats.\n\nIn short, as a (relatively new) part of the Dow, WBA stock stands to gain. As it benefits from passive/index investing, its market cap can be $Billions larger. The honor of being one of the few companies in the Dow will keep WBA stock visible to investors and will keep the stock supported in a big way.\n\n&amp;#x200B;\n\n**2)** **Best-of-Breed in Pharmacy/Healthcare**\n\nWalgreens is clearly one o f the largest players and best-of-breed companies in the Pharmacy/Healthcare space. Not only is WBA’s inclusion in the Dow a huge statement that WBA is best-of-breed, but also the lack of competition and alternative choices in pharmacy stocks is a huge advantage to WBA. With only CVS ($CVS) and Rite-aid ($RAD) as similar peers in the entire market (and with worse financials!), WBA is a clear #1 investment choice.\n\n&amp;#x200B;\n\n**3)** **4% Dividend**\n\nA 4% dividend makes WBA an income investment opportunity, in addition to the growth and stock price increases we expect to see in the near future. Not only is WBA a relatively safe stock with a low Beta (lower volatility than the broader market), but also the excellent 4% dividend payment is already half of the stock market’s yearly average return (8%) going back 100+ years.\n\nIts further possible that WBA’s dividend can continue to grow sustainably; in fact, WBA is a blue-chip dividend powerhouse and officially a member of the \"Dividend Aristocrats\", companies which have increased their dividend for 25+ consecutive years. Walgreens has increased its dividend for 45 years and running.\n\n&amp;#x200B;\n\n**4)** **Attractive Valuations**\n\nWBA has very attractive valuations, and the stock is selling at a major discount. Investors have a chance right now to buy the stock and a great company at a bargain, right before the stock price could rise by 50%+.\n\nWhy is the stock so cheap? The company has shown poor stock performance over the past few years mostly due to poor earnings performance, low profitability, and high debt. Fortunately, things are improving and the stock hasn’t yet reflected the good news. It will soon be priced in, and the stock price will rise.\n\nHow do we know it’s cheap? Why is the stock a “buy”? WBA stock sells at attractive low multiples (1) on an absolute basis (10x forward P/E, 2x P/B, 9x P/FCF), (2) on an historical basis (lowest P/S and near 15-year low P/B and P/FCF), and (3) on a peer comparables basis (WBA is selling at significantly cheaper valuation multiples than Walmart (WMT), Johnson &amp; Johnson (JNJ), Procter &amp; Gamble (PG), Target (TGT), Dollar General (DG), United Health (UNH), Cigna (CI), etc.).\n\nIn other words, the stock is cheap on nearly all fronts, and potentially offering a major value investment. If WBA had multiples more comparable to its peer group, the stock would be trading at a significantly higher price. As market participants come to realize this market mispricing/inefficiency, the stock price is likely to adjust higher.\n\n&amp;#x200B;\n\n**5)** **Improving Business**\n\nWalgreens’ business and future prospects seem to be improving. With a new CEO at the helm (the first African American female CEO of a Fortune 500 company), along with critical strategic decisions/initiatives likely upcoming, WBA is very well-positioned to grow and gain market share.\n\nWith most locations (physical stores) in very good condition still looking new, located on prime real estate, and acting as top places to get vaccinated against Covid-19, there is plenty more time in WBA’s bullish cycle. \n\nWe will look at the upcoming year’s revenue, income, and cash flows to judge WBA’s progress and performance.\n\n&amp;#x200B;\n\n**6)** **Takeover Target / Buyout**\n\nThe cherry on top for Walgreens ($WBA) stock is a takeover.\n\nWalgreens is an attractive takeover target. Especially in the retail/pharmaceutical/healthcare space, Walgreens presents a market-moving opportunity for a large public company or private equity group. In fact, this was attempted not too long ago when in late-2019 KKR ($KKR) showed interest in taking WBA private in the largest private-equity buyout of all-time (see: [https://www.theguardian.com/business/2019/nov/11/walgreens-boots-alliance-kkr-buyout-offer](https://www.theguardian.com/business/2019/nov/11/walgreens-boots-alliance-kkr-buyout-offer) ). The takeover offer at the time was $70-80/share, 40-60% higher than current prices.\n\nThere is clearly significant interest in WBA, and it’s been quiet for a little while. The sleeping lion (or bull?) could wake up at any moment.\n\nA takeover has been attempted at much higher prices by private equity buyers. The existence of such investor interest and possible takeover offers provides (1) a strong catalyst for a soaring stock price, and (2) a floor to the stock, which will support the stock at or above current prices. If the stock price drops too far, buyers are highly likely to step in.\n\nAdditionally, though maybe unlikely, both Amazon ($AMZN) and Warren Buffett / Berkshire Hathaway ($BRK/A)($BRK/B) could be potential buyers. Amazon has shown much interest in expanding into Pharma/Drugs/Prescriptions as well as expanding its retail operation. WBA seems to be a great potential fit; and at only $50-100B, WBA is not such a big purchase for the $2 Trillion market cap Amazon.\n\nWarren Buffett and/or Berkshire Hathaway could also be a potential investor. WBA fits many of the criteria which Buffett and other value investors look for. Additionally, Buffett and a joint venture between Amazon, Berkshire, and JP Morgan (called “Haven”) showed strong interest in disrupting the healthcare sector until recently disbanding (see: [https://www.cnbc.com/2021/01/04/haven-the-amazon-berkshire-jpmorgan-venture-to-disrupt-healthcare-is-disbanding-after-3-years.html](https://www.cnbc.com/2021/01/04/haven-the-amazon-berkshire-jpmorgan-venture-to-disrupt-healthcare-is-disbanding-after-3-years.html) ).\n\nIt seems painfully clear that Amazon ($AMZN), Berkshire ($BRK/A)($BRK/B), and other major players are highly-interested in gaining a foothold in the space which Walgreens ($WBA) already dominates. If takeover interest materializes, or if Buffett decides to invest more heavily in WBA, you can bet there will be a lot of attention on the stock, and the stock price is likely to be much higher.",
        "subreddit": "wallstreetbets",
        "title": "Walgreens DD ($WBA): Safe Stock, Selling at a Discount, 4% Dividend, Improving Business --&gt; Price Target $74 (50% upside).",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pjm2dy/walgreens_dd_wba_safe_stock_selling_at_a_discount/",
        "created": 1631046440.0
    },
    {
        "author": "Speeeeedislife",
        "created_utc": 1631143997,
        "id": "pklvu7",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/63yxovjq6dm71.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=e5e1507d8259cbc4fad3d4644f2732ef85d1acab\n\nOriginal post: [https://www.reddit.com/r/wallstreetbets/comments/pd45fl/mvis\\_bet/](https://www.reddit.com/r/wallstreetbets/comments/pd45fl/mvis_bet/)\n\nFor those too lazy to click, Microvision (MVIS) offers the best in class lidar solution for both ADAS and eventually autonomous driving, addressing SWAP-C (size, weight, power, cost), and Tier 1 / OEM requirements.\n\nAll other lidar companies at present have major hang ups with SWAP-C, eg: Luminar is based on SWIR 1550nm which uses exotic and costly raw materials (InGaAs) for both laser generation and reading signal, this is why Luminar acquired OptoGration to help bring cost down, unfortunately for them they're still several orders of magnitude over materials used for 905nm which Microvision uses.\n\nThere's flash based systems, spinning buckets, etc, the point is Microvision figured it all out, this is what they've been doing for the last 20 years (laser beam steering), they make the light engines for the Microsoft Hololens 2 and IVAS units, they're not some shit based SPAC with a twenty year old CEO issuing insane shares to himself. I will say though, Microvision has had POOR revenues for essentially forever, they're just now getting royalties from their work with Hololens and IVAS finally, they're turning over a new leaf and that is what makes this a good opportunity and BET, the market believes they're overvalued right now, once they sign one partnership for lidar the market will correct.\n\nWhich brings us to today, the IAA Mobility show in Germany is currently taking place and for the first time Microvision is publicly showing their family of lidar units and specs. The cat is getting out of the bag and coincidentally the whole general market AND lidar sector has taken a big shit, so right now is a great entry point. For those that bought weeklies, we're probably toast.\n\nHere's video of live footages taken from various lidar booths during IAA: [https://www.youtube.com/watch?v=Bsrp3QQ-Abg](https://www.youtube.com/watch?v=Bsrp3QQ-Abg) (notice the difference in resolution between people standing / walking)\n\nUnless there's a big upswing in volume for the entire lidar sector very soon I would not buy weeklies but either get shares or buy cheaper OTM LEAPs.\n\nAnother thing to note, the company doesn't talk about it's augmented reality (AR) / near eye display (NED) vertical anymore, despite Microsoft just getting awarded a $20bn contract for IVAS and MVIS receiving royalties, the CEO on the last few ECs has mentioned automotive lidar as their primary focus. Interestingly Drew Markham was added on as general counsel several months ago and her experience is in M&amp;A and transferring of IP. I'm speculating that the AR vertical is currently in the works of being sold off to Microsoft.\n\nI'll add comments later for other tidbits of DD, I should get back to work right now.\n\nPositions:\n\nhttps://preview.redd.it/f6jpncvw6dm71.png?width=1069&amp;format=png&amp;auto=webp&amp;s=2a7eca7bafa3737ba33fe74f0f222748a3175370",
        "subreddit": "wallstreetbets",
        "title": "MVIS IAA Mobility - DD (leave me alone bot, no more imgur links)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pklvu7/mvis_iaa_mobility_dd_leave_me_alone_bot_no_more/",
        "created": 1631172797.0
    },
    {
        "author": "mike_oc23",
        "created_utc": 1631152968,
        "id": "pkocvt",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Hi Everyone,\n\nMy main investing account is with another brokerage but I decided to set up a mini side portfolio with Robinhood (I know there are issues with Robinhood but it will work fine for what I'm doing). Since I want the majority of my money going towards my main account, I came up with a budget for my situation that will pretty much be unnoticeable in terms of DCA.\n\nI am starting with $100 and splitting it evenly between AAPL, AMZN, GOOGL, MSFT, and TSLA so $20 on each of them. Then I'm setting a recurring investment of $1 for each of them weekly so $5/week or around $22/month. So it's pretty much the cost of a streaming service monthly. \n\nI back tested this scenario and was surprised to see how much it actually grew - from the initial $100 to $43.5k over the last 10yrs with just adding $22/month! I'm not expecting these companies to continue at the same growth rate moving forward but I am happy with my picks and obviously it can be adjusted based on preferences but I thought you all might like to see this scenario especially if you're young and don't have a lot of capital to put in.\n\n[Back Testing Here](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=1985&amp;firstMonth=1&amp;endYear=2021&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=100&amp;annualOperation=1&amp;annualAdjustment=22&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=2&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;reinvestDividends=true&amp;showYield=false&amp;showFactors=false&amp;factorModel=3&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=AAPL&amp;allocation1_1=20&amp;symbol2=AMZN&amp;allocation2_1=20&amp;symbol3=GOOGL&amp;allocation3_1=20&amp;symbol4=MSFT&amp;allocation4_1=20&amp;symbol5=TSLA&amp;allocation5_1=20)",
        "subreddit": "investing",
        "title": "A Little Bit Can Go A Long Way",
        "url": "https://www.reddit.com/r/investing/comments/pkocvt/a_little_bit_can_go_a_long_way/",
        "created": 1631181768.0
    },
    {
        "author": "djOH1",
        "created_utc": 1630518642,
        "id": "pfz5e5",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "So I’m 19 and started investing this year, made some dumb plays on some stocks at start of year and now I have made a pie on trading212 with the following holdings\n\nAmd (23%)\nMSFT (22%)\nAAPL (22%)\nNVDA (15%)\nTLSA (7%)\nPLTR (5%)\nSQ (3%)\nNIO (3%)\n\nNIO and PLTR are my risk plays but something tells me I need more whilst also I want to put it all into AAPL, MSFT NVDA &amp; AMD\n\nSo my question is do I keep adding to this pie I made or do I pick some individual stocks like my top 4 and then some\n\nFor extra info I’m still living at home with minimal bills to pay and earn around 230 a week with my job so I’m putting pretty much everything into stocks and crypto but I’m unsure on the pie so any advice is appreciated \n\nThanks guys",
        "subreddit": "stocks",
        "title": "About to turn 20 and need some advice",
        "url": "https://www.reddit.com/r/stocks/comments/pfz5e5/about_to_turn_20_and_need_some_advice/",
        "created": 1630547442.0
    },
    {
        "author": "sschmidt17",
        "created_utc": 1630599406,
        "id": "pgl39m",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "I'm a big believer in investing in what you know and use. For examples, I shop at Dick's Sporting Goods often, drink Celsius Energy drinks and listen to Spotify daily.   \n\nOutside of the obvious big tech names like Google, Microsoft and Amazon, what are some stocks in which their product/service you use on a near daily basis?",
        "subreddit": "stocks",
        "title": "What are some stock company's product/services that you use?",
        "url": "https://www.reddit.com/r/stocks/comments/pgl39m/what_are_some_stock_companys_productservices_that/",
        "created": 1630628206.0
    },
    {
        "author": "mat025",
        "created_utc": 1630856081,
        "id": "pif8jm",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "My top tech stocks watchlist that pays dividends:\n\n|Ticker|AAPL|MSFT|AVGO|CSCO|INTC|NVDA|TXN|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|Yield|0.57%|0.74%|2.89%|2.49%|2.6%|0.07%|2.15%|\n|PE|30.20|37.78|19.92|18.79|11.89|76.98|25.73|\n|Payout|17.22%|28.11%|57.65%|46.54%|30.89%|5.39%|55.28%|\n|Div Growth YR|9|17|10|10|7|0|15|\n|CAGR 5yr|9.3%|9.52%|50%|9.21%|6.12%|7.66%|21.83%|\n|YOY Rev|13.26%|14.68%|8.46%|\\-0.01%|0.57%|36.16%|9.04%|\n|My Buy Alert|Hold|Hold|BUY|Hold|BUY|Hold|Hold|\n\nMy buying criteria is PE less than **20**, Payout less than **80%**, Dividend growth year at least **1 year,** CAGR for **5** years higher than **3%**, YOY revenue growth higher than **0%**. \n\nSource: My own spreadsheet and seekingalpha.com",
        "subreddit": "ValueInvesting",
        "title": "My top tech stocks to watch that pays dividends",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/",
        "created": 1630884881.0
    },
    {
        "author": "ThinkOutsideTheBox73",
        "created_utc": 1631065253,
        "id": "pk0v5i",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "SPACs",
        "title": "$SRNG - Could This Be The Next Apple Or Microsoft? How This Little-Known $15 Billion-Dollar Company Is Coding Life And Bringing DNA Into The Digital Age",
        "url": "https://www.forbes.com/sites/billfrist/2021/09/07/could-this-be-the-next-apple-or-microsoft-how-this-little-known-15-billion-dollar-company-is-coding-life-and-bringing-dna-into-the-digital-age/?sh=74f5ddfc6ce9",
        "created": 1631094053.0
    },
    {
        "author": "UltimateTraders",
        "created_utc": 1630758782,
        "id": "phqq42",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Good morning everyone. Happy Saturday and thank you so much for taking a time out to read my post. I figured a topic like this can help others, or comfort others as well as share strategies so we can all do better, or make changes to be positive.\n\nWe are on an epic run of amazing proportions. I have been trading since the 90s and the Nasdaq boom, Nasdaq 5,000 at that time was epic…. However, nothing I have ever seen is even close to the Nasdaq dropping near 6,000 March 2020 and now record highs every single day 15,500+ in a short period… so I was curious for most of you which times were better. The first 4 months of trading/investing or the last 4 months…\n\nThis may sound odd because the DOW, SP, NASDAQ keep making new highs…however it is more of the blue chips and mega caps making new highs everyday. The Indexes and ETFS are all cap weighted except for the DOW, which means stocks like AAPL, AMZN, GOOG, FB, MSFT, NVDA, TSLA can carry the market to new highs without aid….\n\nFor myself, I actually am not hitting record highs, I do take a lot of money out for real estate but even if I did not I know I would not be…however the first 4 months I was! At that time a lot of the stocks I trade were making new highs. FEBRUARY/MARCH/APRIL especially….. JUNE/JULY for me were very rough and AUGUST I was coming back..\n\nPlease share some ideas, experience or strategies so we can all help one another. Thank you.",
        "subreddit": "stocks",
        "title": "We have had 8 months already in the trading year so far, were the first 4 months better for you? Jan-April or May thru August?",
        "url": "https://www.reddit.com/r/stocks/comments/phqq42/we_have_had_8_months_already_in_the_trading_year/",
        "created": 1630787582.0
    },
    {
        "author": "HamsterTop",
        "created_utc": 1630692418,
        "id": "phaiys",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "I have been trading 0 DTE iron condors usually on Friday with a Strike that has 90-92% Prob. OTM for both the put and credit spreads on AMZN, MSFT, TSLA, SPX. I have not had a losing trade yet and I guess my questions is this too good to be true?",
        "subreddit": "options",
        "title": "Iron Condor...fool proof?",
        "url": "https://www.reddit.com/r/options/comments/phaiys/iron_condorfool_proof/",
        "created": 1630721218.0
    },
    {
        "author": "CheeznChill",
        "created_utc": 1631050198,
        "id": "pjwfxl",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "When I started trading I was trying to follow the mantra of \"don't invest more than you're willing to lose.\" This resulted in sort of a max of $400-500 that I would put in per individual stock and I definitely had too many going at once to see any legit profit. \n\nI have also read that I should have specific rules set and follow them, setting emotions aside. With this, I have set my initial investment around $1-2K as well as buying puts to hedge potential drops and/or setting Stop Limits for a % I would be willing to lose. My goal is to hit around a 20-30% ROI before selling. There are a few I plan to just buy and Hold, but others I would like to swing trade over the span of a few months. \n\nThe more I think about it, wouldn't it be better to put far more (10-20K) into a stock that is very likely to increase in value over time, like blue chip stocks - wait for it to drop to a 20-50 day MA, invest and look to get out when that 20% is hit. \n\nBut you can't time the market! I know, I know but stocks like MSFT, AAPL, JNJ, PG and many others aren't likely to just drop to 0 even if they do have a pullback (which is when I would buy). Plus, I would have purchased a Put and/or set a stop loss with what I'm comfortable losing. \n\nHow hard do you all go in on your initial investment and do you really need to up the ante to see consistently high returns? What are your thoughts on going in heavy on a strong stock and swing trading it?",
        "subreddit": "stocks",
        "title": "What is your typical initial investment?",
        "url": "https://www.reddit.com/r/stocks/comments/pjwfxl/what_is_your_typical_initial_investment/",
        "created": 1631078998.0
    },
    {
        "author": "Dramatic_Investing",
        "created_utc": 1630867648,
        "id": "piisbq",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "This is on Verb Technology. This Nasdaq listed company has a super low Market Cap and float. \n\nI think they have big potential. This is very much in the \"growth stage\" category of company but they are making huge progress.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/pojpfddycql71.png?width=1399&amp;format=png&amp;auto=webp&amp;s=369caca2fef58847973601a453fe728cb284ee5e\n\nPartnerships now too with Microsoft\n\nIn the short-term they could have an acquisition very soon to provide a catalyst, and this coupled with some other good news and a decent portion of the float sold short could provide an opportunity for a squeeze here too.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/q3aht6j0dql71.png?width=1354&amp;format=png&amp;auto=webp&amp;s=b04a475a136a819941b711d9c3a53c8c152bd3d5\n\nBut my thoughts, as usual, are mainly for the medium to long-term and I think this is well worth a look. And they have a fair amount of Institutional ownership too. With major investors invested.\n\nhttps://preview.redd.it/gs4on1m7dql71.png?width=1364&amp;format=png&amp;auto=webp&amp;s=943d4f97f1a0a1f82023e37e69612d1939dc60e6\n\nSo check this out. And as always feel free to share!\n\nhttps://youtu.be/RXouiDG53oM",
        "subreddit": "pennystocks",
        "title": "RISKY - But at this price it looks very attractive - $VERB",
        "url": "https://www.reddit.com/r/pennystocks/comments/piisbq/risky_but_at_this_price_it_looks_very_attractive/",
        "created": 1630896448.0
    },
    {
        "author": "UltimateTraders",
        "created_utc": 1630758731,
        "id": "phqpq8",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Good morning everyone. Happy Saturday and thank you so much for taking a time out to read my post. I figured a topic like this can help others, or comfort others as well as share strategies so we can all do better, or make changes to be positive.\n\nWe are on an epic run of amazing proportions. I have been trading since the 90s and the Nasdaq boom, Nasdaq 5,000 at that time was epic…. However, nothing I have ever seen is even close to the Nasdaq dropping near 6,000 March 2020 and now record highs every single day 15,500+ in a short period… so I was curious for most of you which times were better. The first 4 months of trading/investing or the last 4 months…\n\nThis may sound odd because the DOW, SP, NASDAQ keep making new highs…however it is more of the blue chips and mega caps making new highs everyday. The Indexes and ETFS are all cap weighted except for the DOW, which means stocks like AAPL, AMZN, GOOG, FB, MSFT, NVDA, TSLA can carry the market to new highs without aid….\n\nFor myself, I actually am not hitting record highs, I do take a lot of money out for real estate but even if I did not I know I would not be…however the first 4 months I was! At that time a lot of the stocks I trade were making new highs. FEBRUARY/MARCH/APRIL especially….. JUNE/JULY for me were very rough and AUGUST I was coming back..\n\nPlease share some ideas, experience or strategies so we can all help one another. Thank you.",
        "subreddit": "smallstreetbets",
        "title": "We have had 8 months already in the trading year so far, were the first 4 months better for you? Jan-April or May thru August? Are you pleased with the results? Change Strategy? Curious so we can brain storm.",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/phqpq8/we_have_had_8_months_already_in_the_trading_year/",
        "created": 1630787531.0
    },
    {
        "author": "Apex_Sylvia",
        "created_utc": 1631136085,
        "id": "pkjh9k",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "AAPL - 20\nMSFT - 15\nO - 10\nQQQ - 1\nVOO - 1 \nSE - 1 \n\nI’m not totally sold on SE so I’m just holding 1 share to see how it performs. I still have $2,600 left to spend. I’m 26, so while I want dividends, I don’t want to invest a ton of money into it; I prefer to just gradually build it until I’m about 40 and then I’ll dump boat loads into it. What do you think I’m lacking in? Should I look into health care, medicine, etc? For example, Johnson and Johnson, moderna, etc? How about growth and value? Financial institutions? I don’t want too much technology so I’m gonna restrain from buying any more (besides maybe Apple since it’s pretty cheap)",
        "subreddit": "stocks",
        "title": "Opinions on portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/pkjh9k/opinions_on_portfolio/",
        "created": 1631164885.0
    },
    {
        "author": "mhong90",
        "created_utc": 1630600188,
        "id": "pglc9n",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I DCA about 2k of my income into stocks that I currently have every month but I have another 25k just sitting because I am unable to find more stocks I like. Is it better to to wait for new stocks to pop up on my radar or just DCA weekly into the ones I have already?\n\n**Current Portfolio**\n\n* AAPL - 13.74%\n* AMD - 9.31%\n* AMZN - 9.58%\n* FB - 8.84%\n* GOOGL - 10.52%\n* MSFT - 11.26%\n* NVDA - 13.86%\n\n**Currently on my watch list that I actually considering.**\n\n* ULTA\n* TGT\n\n**Slightly Interested**\n\n* SBUX\n* V\n* MA",
        "subreddit": "stocks",
        "title": "Recently lumped sum over 18k into some stocks I like, I still have 25k left.",
        "url": "https://www.reddit.com/r/stocks/comments/pglc9n/recently_lumped_sum_over_18k_into_some_stocks_i/",
        "created": 1630628988.0
    },
    {
        "author": "Speeeeedislife",
        "created_utc": 1631128670,
        "id": "pkh852",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/o0a2xn5jvbm71.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=85ea4bb2e4f24ad9b8b7d5118ffe0cc32d54dd0e\n\nOriginal post: [https://www.reddit.com/r/wallstreetbets/comments/pd45fl/mvis\\_bet/](https://www.reddit.com/r/wallstreetbets/comments/pd45fl/mvis_bet/)\n\nFor those too lazy to click, Microvision (MVIS) offers the best in class lidar solution for both ADAS and eventually autonomous driving, addressing SWAP-C (size, weight, power, cost), and Tier 1 / OEM requirements.\n\nAll other lidar companies at present have major hang ups with SWAP-C, eg: Luminar is based on SWIR 1550nm which uses exotic and costly raw materials (InGaAs) for both laser generation and reading signal, this is why Luminar acquired OptoGration to help bring cost down, unfortunately for them they're still several orders of magnitude over materials used for 905nm which Microvision uses. \n\nThere's flash based systems, spinning buckets, etc, the point is Microvision figured it all out, this is what they've been doing for the last 20 years (laser beam steering), they make the light engines for the Microsoft Hololens 2 and IVAS units, they're not some shit based SPAC with a twenty year old CEO issuing insane shares to himself. I will say though, Microvision has had POOR revenues for essentially forever, they're just now getting royalties from their work with Hololens and IVAS finally, they're turning over a new leaf and that is what makes this a good opportunity and BET, the market believes they're overvalued right now, once they sign one partnership for lidar the market will correct.\n\nWhich brings us to today, the IAA Mobility show in Germany is currently taking place and for the first time Microvision is publicly showing their family of lidar units and specs. The cat is getting out of the bag and coincidentally the whole general market AND lidar sector has taken a big shit, so right now is a great entry point. For those that bought weeklies, we're probably toast.\n\nHere's video of live footages taken from various lidar booths during IAA: [https://www.youtube.com/watch?v=Bsrp3QQ-Abg](https://www.youtube.com/watch?v=Bsrp3QQ-Abg) (notice the difference in resolution between people standing / walking)\n\nHere are my positions: [https://i.imgur.com/5s6tFfe.png](https://i.imgur.com/5s6tFfe.png)\n\nUnless there's a big upswing in volume for the entire lidar sector very soon I would not buy weeklies but either get shares or buy cheaper OTM LEAPs.\n\nAnother thing to note, the company doesn't talk about it's augmented reality (AR) / near eye display (NED) vertical anymore, despite Microsoft just getting awarded a $20bn contract for IVAS and MVIS receiving royalties, the CEO on the last few ECs has mentioned automotive lidar as their primary focus. Interestingly Drew Markham was added on as general counsel several months ago and her experience is in M&amp;A and transferring of IP. I'm speculating that the AR vertical is currently in the works of being sold off to Microsoft.\n\nI'll add comments later for other tidbits of DD, I should get back to work right now.",
        "subreddit": "wallstreetbets",
        "title": "MVIS IAA Mobility - DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pkh852/mvis_iaa_mobility_dd/",
        "created": 1631157470.0
    },
    {
        "author": "Tyfighter666",
        "created_utc": 1631034247,
        "id": "pjr7yt",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Ok I'm going to try again. I came up with a real great acronym for FAANG. I recently saw FAANG and also FAAMG. I've decided to combine the two with a good title. I present to you FGMAAN. FB, GOOGL, MSFT, AMZN, AAPL, NFLX It's a set of stocks, a super hero, it's going to the moon, and you can invest in him today. \nSay it with me folks, FGMAAN to the . . . \nAll funniness aside. I do think there is a case to be made for a catchy name and adding both Netflix and Microsoft to the traditional FAANG stocks. \n\nI think we need FGMAAN now more than ever. Also apparently the mods keep removing the post because I put an A between the F and G and that word isn't allowed or something. This is a legitimate use for an acronym and I think it has real potential here for investing.\n\nWhat do y'all think? FGMAAN to the moon?",
        "subreddit": "wallstreetbets",
        "title": "New FAANG",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pjr7yt/new_faang/",
        "created": 1631063047.0
    },
    {
        "author": "nd123181",
        "created_utc": 1630902032,
        "id": "pis65y",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "About 6 months ago, I bought a deep ITM AAPL LEAPS option expiring in about 2 years, when stock was trading below $120. I’ve been making nice premiums selling CC weekly or biweekly as well. Now I’m thinking of selling it for more than $3K in profits and then buying an AAPL and MSFT/SPY LEAP options that are just about AT THE MONEY (with DTE in 1.5-2 years) with and intent of selling them after 9-12 months.\n\nWould the switch/move be a wise decision you think? Can I immediately start selling Covered Calls against these ATM LEAPS options as long as the CC strike prices are above the LEAPS options’ strike prices? \n\nI know that many variables come into play here, but I’m definitely going with stable stocks. Asking for a generalized opinion. Thanks.",
        "subreddit": "options",
        "title": "Which is generally more profitable: ATM or Deep ITM?",
        "url": "https://www.reddit.com/r/options/comments/pis65y/which_is_generally_more_profitable_atm_or_deep_itm/",
        "created": 1630930832.0
    },
    {
        "author": "ScratchyBallsack",
        "created_utc": 1630751839,
        "id": "php7bb",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Been investing for a while for long term but genuinely just winging it and getting by (thanks RR, AMC and MSFT!). I feel like I should at some point learn to at least be retarded with confidence tho\n\nWhere do you retards find info that helped you out? For a long term investor should I even really worry or just keep slapping money into stocks that have steadily growing graphs? \n\nI really dont know shit. I usually see a steadily increasing graph and I click buy :^)",
        "subreddit": "wallstreetbets",
        "title": "Where do you guys source your info about companies and learn in general about investing?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/php7bb/where_do_you_guys_source_your_info_about/",
        "created": 1630780639.0
    },
    {
        "author": "mike_oc23",
        "created_utc": 1631152895,
        "id": "pkoc66",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Hi Everyone,\n\nMy main investing account is with another brokerage but I decided to set up a mini side portfolio with Robinhood (I know there are issues with Robinhood but it will work fine for what I'm doing). Since I want the majority of my money going towards my main account, I came up with a budget for my situation that will pretty much be unnoticeable in terms of DCA.\n\nI am starting with $100 and splitting it evenly between AAPL, AMZN, GOOGL, MSFT, and TSLA so $20 on each of them. Then I'm setting a recurring investment of $1 for each of them weekly so $5/week or around $22/month. So it's pretty much the cost of a streaming service monthly. \n\nI back tested this scenario and was surprised to see how much it actually grew - from the initial $100 to $43.5k over the last 10yrs with just adding $22/month! I'm not expecting these companies to continue at the same growth rate moving forward but I am happy with my picks and obviously it can be adjusted based on preferences but I thought you all might like to see this scenario especially if you're young and don't have a lot of capital to put in.\n\n[Back Testing Here](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=1985&amp;firstMonth=1&amp;endYear=2021&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=100&amp;annualOperation=1&amp;annualAdjustment=22&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=2&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;reinvestDividends=true&amp;showYield=false&amp;showFactors=false&amp;factorModel=3&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=AAPL&amp;allocation1_1=20&amp;symbol2=AMZN&amp;allocation2_1=20&amp;symbol3=GOOGL&amp;allocation3_1=20&amp;symbol4=MSFT&amp;allocation4_1=20&amp;symbol5=TSLA&amp;allocation5_1=20)",
        "subreddit": "stocks",
        "title": "A Little Bit Can Go A Long Way",
        "url": "https://www.reddit.com/r/stocks/comments/pkoc66/a_little_bit_can_go_a_long_way/",
        "created": 1631181695.0
    },
    {
        "author": "UltimateTraders",
        "created_utc": 1630758691,
        "id": "phqpe1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Good morning everyone. Happy Saturday and thank you so much for taking a time out to read my post. I figured a topic like this can help others, or comfort others as well as share strategies so we can all do better, or make changes to be positive.\n\nWe are on an epic run of amazing proportions. I have been trading since the 90s and the Nasdaq boom, Nasdaq 5,000 at that time was epic…. However, nothing I have ever seen is even close to the Nasdaq dropping near 6,000 March 2020 and now record highs every single day 15,500+ in a short period… so I was curious for most of you which times were better. The first 4 months of trading/investing or the last 4 months…\n\nThis may sound odd because the DOW, SP, NASDAQ keep making new highs…however it is more of the blue chips and mega caps making new highs everyday. The Indexes and ETFS are all cap weighted except for the DOW, which means stocks like AAPL, AMZN, GOOG, FB, MSFT, NVDA, TSLA can carry the market to new highs without aid….\n\nFor myself, I actually am not hitting record highs, I do take a lot of money out for real estate but even if I did not I know I would not be…however the first 4 months I was! At that time a lot of the stocks I trade were making new highs. FEBRUARY/MARCH/APRIL especially….. JUNE/JULY for me were very rough and AUGUST I was coming back..\n\nPlease share some ideas, experience or strategies so we can all help one another. Thank you.",
        "subreddit": "pennystocks",
        "title": "We have had 8 months already in the trading year so far, were the first 4 months better for you? Jan-April or May thru August? Are you pleased with the results? Change Strategy? Curious so we can brain storm.",
        "url": "https://www.reddit.com/r/pennystocks/comments/phqpe1/we_have_had_8_months_already_in_the_trading_year/",
        "created": 1630787491.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1631134091,
        "id": "pkivui",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, September 8, 2021**\n\n*Hey Psychos! So there was no recap yesterday, got mixed up and didn't have the time*\n\nStocks fell today, extending the previous day’s decline in the S&amp;P 500 (SPY) and Dow Jones (DIA) as market participants continue to digest the recent August Job Report and concerns surrounding rising coronavirus infections across the US. The tech-heavy Nasdaq (QQQ) 0.33% down while the SPY and DIA fell 0.11% and 0.2% respectively. The Russell 2000 (IWM), which tracks the performance of small-caps, fell 1.10%.\n\nYung-Yu Ma. Chief Investment Strategist at BMO Capital said, “We think the fundamental drivers of strong earnings, an accommodative Fed, and a still healthy appetite for risk taking are really what’s going to support the market for the rest of the year.” \n\nThe Labor Department released their monthly unemployment report, which showed hiring in August slow down dramatically as the US continues to battle massive spikes in coronavirus Delta cases in certain parts of the country, mainly the South/Southeast (according to the CDC, roughly ⅓ of all COVID-related hospitalizations are in Texas and Florida as both states deal with record coronavirus cases and low hospital capacity). Due to this surge and the reimposition of pandemic-era restrictions in areas with high transmission rates, employment numbers came in shockingly low compared to estimates and the previous month’s numbers. Here are the numbers.\n\n* **Change in non-farm payrolls:** \\+235,000 vs. +733,000 expected and a revised +1.053 million in July\n* **Unemployment rate, August:** 5.2% vs. 5.2% expected and 5.4% in July\n* **Average hourly earnings, month-over-month:** 0.6% vs. 0.3% expected and 0.4% in July \n* **Average hourly earnings, year-over-year:** 4.3% vs. 3.9% expected and 4.0% in July\n\nPresident Biden said of the report, “While I know some wanted to see a larger number today and so did I, what we’ve seen this year is continued growth, month after month, in job creation. This is the kind of growth that makes our economy stronger.”\n\nMembers of the Fed have consistently signaled they will be looking especially closely at labor market data to determine when to start tapering the pandemic-era quantitative easing program. Federal Reserve Governor Christopher Waller said the August Jobs Report could be his signal to hit the “substantial further progress mark” the Fed stipulated in December and begin tapering. He said, “I think that one more good job report if it’s in the 850,000 to 1 million range will be sufficient to claim substantial further progress in employment for tapering.” August was not the report they were looking for. \n\nIn its latest Beige Book, which is basically a report by the Federal Reserve on current economic conditions, members said the economy downshifted slightly due to Delta variant concerns. The report stated, “The deceleration in economic activity was largely attributable to a pullback in dining out, travel, and tourism in most Districts, reflecting safety concerns due to the rise of the Delta variant, and, in many cases, international travel restrictions.” \n\nIn the US, the surge in infections in certain parts of the nation continues unabated, with hospitalizations this weekend roughly 300% higher than Labor Day weekend in 2020, according to data from Johns Hopkins University. The surge in patients comes as the highly contagious Delta variant continues to spread across the US, and coincided with a weekend that saw a spike in travel. According to the Transportation Security Administration, more than 3.5 million people travelled across the country on Friday and Saturday for the Labor Day holiday, despite the Centers for Disease Control and Prevention’s recommendation for unvaccinated people to refrain from traveling. \n\n[https://www.theguardian.com/us-news/2021/sep/07/us-covid-patients-hospitals-surge](https://www.theguardian.com/us-news/2021/sep/07/us-covid-patients-hospitals-surge)\n\n[https://www.kq2.com/content/news/Health-officials-urge-caution-as-students-return-to-class-after-long-holiday-weekend--575252751.html](https://www.kq2.com/content/news/Health-officials-urge-caution-as-students-return-to-class-after-long-holiday-weekend--575252751.html)\n\nIn other news, the battle between Elon Musk and Jeff Bezos is heating up! Last week, SpaceX sent a filing to the Federal Communications Commission (FCC) accusing Amazon of using regulatory and legal means to stifle and slowdown competition. SpaceX said, “While SpaceX has proceeded to deploy more than 1,700 satellites, Amazon has yet to even attempt to address the radiofrequency interference and orbital debris issues that must be resolved before Amazon can deploy its constellation” and suggested “as it falls behind competitors \\[Amazon\\] is more than willing to use regulatory and legal processes to create obstacles designed to delay those competitors from leaving Amazon even further behind” (ouch).\n\nIn response, Amazon said, Whether it is launching satellites with unlicensed antennas, launching rockets without approval, building an unapproved launch tower, or re-opening a factory in violation of a shelter-in-place order, the conduct of SpaceX and other Musk-led companies makes their view plain: rules are for other people, and those who insist upon or even simply request compliance are deserving of derision and ad hominem attacks. If the FCC regulated hypocrisy, SpaceX would keep the commission very busy.” SpaceX won this one IMO, that was a nasty burn. \n\n**Highlights**\n\n* Job openings in July as measured by JOLTS soared by a staggering 749,000 — hitting yet another all-time high just shy of 11 million open jobs, enough to eliminate most of the current slack in the labor market.\n* El Salvador became the first country in the world to roll out a digital currency as a form of legal tender, allowing businesses and customers to transact using blockchain. There are some initial teething problems with the launch of the Chivo, the country’s wallet app and locals being unfamiliar with the technology. Digital currencies also fell, though I don’t know unknown if the drop is correlated to the launch in El Salvador\n* Damn, the buy-now-pay-later (BNPL) market is red-hot right now. Following Sqaure’s (SQ) acquisition of Afterpay for $29 billion and Amazon (AMZN) partnering up with Affirm (AFRM) to offer BNPL on Amazon, PayPal (PYPL) is now stepping into the arena by acquiring Japanese BNPL firm Paidy for $2.7 billion\n* Twitter (TWTR) launched a global test of a tool it calls Communities, a feature similar to Facebook Groups that gives users a way to tweet to people with similar interests. This follows the recent launch of Super Follows, where content creators can charge their followers for their content. \n* Applied Materials (AMAT) announced it was releasing two new tools aimed at improving efficiency of making a new class of chips for electric vehicles. The machines announced on Wednesday are designed for chips made from a material called silicon carbide. Such chips are gaining traction in electric vehicles like those made by Tesla Inc because they are more efficient and lighter in weight than standard silicon chips for transmitting power from a car's battery to its motors, helping improve range. Silicon carbide chips are difficult to manufacture because the material is very hard\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* ASML target raised by Wells Fargo (WFC) from $800 to$975 at Overweight. Stock currently around $856. ASML is probably the most important and influential tech company you’ve never heard of.\n* Chipotle (CMG) with two target raises. Stock c currently around $1905\n   * Cowen from $2080 from $2250 at Overweight\n   * BTIG Research from $1850 to $2150 at Outperform\n* Coupa Software with a host of target raises following earnings. Average price target $300 at Overweight. Stock currently around $250\n* Microsoft (MSFT) target raised by Jefferies Financial from $335 to $345 at Buy. Stock currently around $300\n* Netflix (NFLX) target raised by JP Morgan from $625 to $705 at Overweight. Stock currently around $605\n* UiPath (PATH) target raised by Morgan Stanley from $72 to $74 at Overweight. Stock currently around $56\n* State Street (STT) target raised by Morgan Stanley from $117 to $122 at Overweight. Stock currently around $87\n* Atlassian (TEAN) target raised by Robert W Baird from $345 to $400 at Outperform. Stock currently around $382\n* Upstart (UPST) target raised by Piper Sandler from $192 to $300 at Outperform. Stock currently around $274\n\n“Numberless are the world's wonders, but none More wonderful than man.” - Sophocles",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, September 8, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/pkivui/here_is_a_market_recap_for_today_wednesday/",
        "created": 1631162891.0
    },
    {
        "author": "professorfundamental",
        "created_utc": 1631013309,
        "id": "pjl0rn",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Another user asked for this information, and I think it can be helpful in seeing one perspective on what the market thinks is going to happen. 10SEPT expirations for calls and for puts. lmk if you see mistakes\n\nwatchlist is from high volume stocks/etfs with high volume options, but a bit dated\n\n&amp;#x200B;\n\n**The calls first, from highest to lowest:** \n\n*Ticker   Price  ATM/u*   \n\n1. GME 202.75 0.076152898   \n2. RIDE 6.25 0.064   \n3. VXRT 8.710000038 0.049368542   \n4. RIOT 34.43000031 0.047632878   \n5. KODK 7.21999979 0.047091414   \n6. EDIT 68.25 0.046886447   \n7. SPCE 24.28000069 0.0461285   \n8. UVXY 21.23999977 0.043785311   \n9. BB 11.06999969 0.03794038   \n10. TLRY 13.59000015 0.035320088   \n11. INO 8.520000458 0.035211266   \n12. NKLA 10.46000004 0.034416826  \n13.  IQ 9.970000267 0.034102306  \n14.  LULU 388.3299866 0.030901554  \n15.  BBBY 27.02000046 0.029607697   \n16. PCG 9.149999619 0.029508198   \n17. PDD 102.2300034 0.029345592   \n18. FSR 14.01000023 0.02926481   \n19. LMND 77.31999969 0.029099845   \n20. NCLH 24.62000084 0.028432168   \n21. MRO 11.63000011 0.028374892   \n22. XPEV 39.75 0.028176101  \n23.  QS 22.45000076 0.02806236   \n24. X 26.21999931 0.027841343   \n25. M 21.71999931 0.02762431   \n26. BLNK 32.97000122 0.02669093   \n27. UNG 16.42000008 0.025578563   \n28. VXX 24.94000053 0.025260625   \n29. OSTK 69.51000214 0.025032369   \n30. PLUG 26.39999962 0.024621212   \n31. SPWR 21.82999992 0.024278516  \n32.  APA 19.67000008 0.023894255  \n33.  HYLN 8.850000381 0.023728813  \n34.  CGC 16.96999931 0.023571009   \n35. FSLY 46.68999863 0.023559649   \n36. GPS 25.11000061 0.023496614   \n37. ACB 7.389999866 0.02300406   \n38. TNA 93.79000092 0.022923552   \n39. ET 9.649999619 0.022797928   \n40. CCL 22.95999908 0.022648085   \n41. PTON 98.55999756 0.022524351   \n42. ROKU 342.269989 0.02249686  \n43.  SNAP 75.08000183 0.021710175   \n44. UAL 46.22000122 0.021635655   \n45. UBER 40.31999969 0.021577381   \n46. DAL 40.25 0.021118012   \n47. NET 130.4400024 0.021005826   \n48. HAL 20.17000008 0.020823004   \n49. FCX 36.13999939 0.020752629  \n50.  DOCU 310.0499878 0.020641833  \n51.  PLTR 26.63999939 0.020270271   \n52. LI 30.28000069 0.02014531  \n53.  BIDU 162.9799957 0.019941098   \n54. RKT 17.09000015 0.019894675 \n55.   DKNG 61.02000046 0.019829564   \n56. OXY 25.92000008 0.019675926   \n57. BABA 170.3000031 0.019671168   \n58. BYND 114.9700012 0.019570322   \n59. NIO 40.36999893 0.019568987   \n60. SPLK 158.4400024 0.019565766   \n61. PBR 10.44999981 0.019138756  \n62.  JD 79.85500336 0.019034499   \n63. CRWD 278.230011 0.018689573   \n64. AAL 19.37000084 0.018585441   \n65. DDOG 138.0599976 0.018325366  \n66.  CHWY 76.75 0.018241042   \n67. OIH 186.7599945 0.018151639  \n68.  SNOW 310 0.017870968   \n69. WYNN 100.3000031 0.01784646   \n70. ZM 298.2900085 0.017767943   \n71. TQQQ 151.4499969 0.017761638  \n72.  ABNB 158 0.017341772  \n73.  XOP 84.51999664 0.016919073   \n74. FEYE 18.54999924 0.016711591   \n75. NVDA 228.4299927 0.016635294   \n76. USO 48.65999985 0.016440608   \n77. MGM 42.54000092 0.016220028   \n78. SQ 269.7399902 0.016200787  \n79.  TWTR 64.66000366 0.016084131 \n80.   AMD 109.9199982 0.01592067  \n81.  SHOP 1554.25 0.01576323   \n82. WFC 44.16999817 0.015621463   \n83. VALE 19.07999992 0.015199161 \n84.   AMRN 5.289999962 0.015122873  \n85.  EWZ 35.84999847 0.014783822  \n86.  BA 218.1699982 0.014667461   \n87. MPC 58.24000168 0.01459478   \n88. PINS 56.59000015 0.014490193   \n89. TEVA 9.479999542 0.013713081   \n90. KRE 65.18000031 0.013654495 \n91.   XBI 134.1900024 0.013264774   \n92. TSLA 733.5700073 0.013086686  \n93.  FXI 41.47000122 0.013021461   \n94. ATVI 81.18000031 0.01293422   \n95. XLE 48.61999893 0.012751954   \n96. NFLX 590.5300293 0.012446446 \n97.   BAC 41.04999924 0.012180268 \n98.   CVS 87.47000122 0.01211844 \n99.   C 71.16999817 0.012083743   \n100. XRT 95.63999939 0.011919699  \n101.  DIS 181 0.011823204   \n102. MU 73.80999756 0.011380572   \n103. SMH 273.2900085 0.010940759  \n104.  F 12.89000034 0.010861132   \n105. XOM 54.86999893 0.010752688   \n106. VZ 55.43000031 0.010463648   \n107. TSM 123.9700012 0.010405743   \n108. XLF 38.06999969 0.010244287   \n109. DBX 32.38999939 0.01018833   \n110. ADBE 666.5900269 0.010051155   \n111. GDX 33.27999878 0.009915866   \n112. GOLD 20.29999924 0.009852217   \n113. SLV 22.87999916 0.009615385  \n114.  PFE 46.84000015 0.009607173   \n115. CRM 267.0799866 0.009472818 \n116.   INTC 53.50999832 0.009157167  \n117.  MSFT 301.1400146 0.009131965   \n118. GILD 71.95999908 0.009032796   \n119. V 225.1100006 0.008973391   \n120. PYPL 289.1300049 0.008750389  \n121.  GS 411.3099976 0.008582335   \n122. AMZN 3478.050049 0.008539268   \n123. EEM 53.11999893 0.008471386   \n124. SBUX 117.1900024 0.008106494   \n125. QCOM 144.6300049 0.008089608   \n126. T 27.55999947 0.007982584   \n127. KO 56.72999954 0.007932311   \n128. IWM 227.9600067 0.00776452  \n129.  JPM 159.4900055 0.007273183   \n130. MO 50.97000122 0.007259172  \n131.  WMT 149.25 0.007236181   \n132. FB 376.2600098 0.007069579 \n133.   GOOG 2895.5 0.006838197  \n134.  COST 462.5499878 0.006701978 \n135.   TGT 244.3099976 0.006549057   \n136. ABBV 111.6200027 0.006540046   \n137. TLT 148.1799927 0.006478607   \n138. EFA 82.06999969 0.00609236   \n139. CSCO 59.41999817 0.006058566  \n140.  XLU 69.48999786 0.005756224  \n141.  JNJ 175.0399933 0.00571298  \n142.  QQQ 381.5700073 0.005031842   \n143. DIA 354.1400146 0.004630937   \n144. SPY 453.0799866 0.003906595   \n145. HYG 88.01000214 0.001363481     \n\n&amp;#x200B;\n\nsome options traders think of the ATM/u number as a percent. If so, then GME at the top of the list has a 7.6% chance of being higher than it is now (or higher than the ATM call strike price to be exact), whereas HYG has a .1% chance of being higher than it is now. Remember, these are just for the calls, so it might be that the market places more value on the ATM put than it does on the ATM calls. \n\n&amp;#x200B;\n\n**Here are the puts:** \n\n  \n\n*Ticker     Price    ATM/u*\n\n1. TLRY 13.59000015 0.148638703\n2. BB 11.06999969 0.134598016\n3. VXRT 8.710000038 0.127439724\n4. ET 9.649999619 0.092227983\n5. MRO 11.63000011 0.073086844\n6. AMRN 5.289999962 0.060491494\n7. RKT 17.09000015 0.059098888\n8. F 12.89000034 0.049650891\n9. RIOT 34.43000031 0.048794655\n10. LI 30.28000069 0.040951122\n11. SQ 269.7399902 0.040668794\n12. GME 202.75 0.035462392\n13. SPCE 24.28000069 0.035420098\n14. UVXY 21.23999977 0.034839925\n15. DKNG 61.02000046 0.031465093\n16. UNG 16.42000008 0.031059683\n17. XPEV 39.75 0.030188679\n18. SLV 22.87999916 0.029720281\n19. PLUG 26.39999962 0.028409091\n20. RIDE 6.25 0.0256\n21. AAL 19.37000084 0.024780587\n22. SNAP 75.08000183 0.024107618\n23. BLNK 32.97000122 0.023051258\n24. EDIT 68.25 0.021978022\n25. CRWD 278.230011 0.021205477\n26. KODK 7.21999979 0.018005541\n27. PTON 98.55999756 0.01755276\n28. UAL 46.22000122 0.017092167\n29. HAL 20.17000008 0.016856718\n30. HYLN 8.850000381 0.015819208\n31. FSR 14.01000023 0.015703069\n32. GDX 33.27999878 0.01532452\n33. PLTR 26.63999939 0.015015015\n34. DDOG 138.0599976 0.014703752\n35. FEYE 18.54999924 0.014555257\n36. VXX 24.94000053 0.014434643\n37. BBBY 27.02000046 0.014433753\n38. TSLA 733.5700073 0.014381722\n39. LMND 77.31999969 0.014226591\n40. CGC 16.96999931 0.012964055\n41. NVDA 228.4299927 0.012870464\n42. PFE 46.84000015 0.012809564\n43. PDD 102.2300034 0.012618605\n44. FSLY 46.68999863 0.011779825\n45. WFC 44.16999817 0.011546299\n46. SHOP 1554.25 0.010892714\n47. CCL 22.95999908 0.010452962\n48. GPS 25.11000061  0.01035444\n49. BAC 41.04999924 0.010231425\n50. ACB 7.389999866 0.00947226\n51. NIO 40.36999893 0.009412931\n52. NET 130.4400024 0.009352959\n53. OSTK 69.51000214 0.008631851\n54. EWZ 35.84999847 0.008368201\n55. INO 8.520000458 0.008215962\n56. IQ 9.970000267 0.008024072\n57. ZM 298.2900085 0.007844715\n58. TSM 123.9700012 0.007501815\n59. PINS 56.59000015 0.007068387\n60. XOP 84.51999664 0.006980597\n61. AMD 109.9199982 0.006641194\n62. NCLH 24.62000084 0.006498781\n63. DBX 32.38999939 0.006483483\n64. DAL 40.25 0.006459627\n65. MU 73.80999756 0.006367701\n66. TWTR 64.66000366 0.006186204\n67. SPLK 158.4400024 0.005995961\n68. SNOW 310 0.005483871\n69. TNA 93.79000092 0.00543768\n70. SPWR 21.82999992 0.005038937\n71. JD 79.85500336 0.005009079\n72. PBR 10.44999981 0.004784689\n73. C 71.16999817 0.004777294\n74. XLE 48.61999893 0.004730564\n75. BYND 114.9700012 0.004609898\n76. MPC 58.24000168 0.004464286\n77. OIH 186.7599945 0.004337117\n78. MGM 42.54000092 0.004231312\n79. VALE 19.07999992 0.004192872\n80. FCX 36.13999939 0.004150526\n81. QS 22.45000076 0.004008909\n82. ATVI 81.18000031 0.003941858\n83. OXY 25.92000008 0.003858025\n84. NKLA 10.46000004 0.003824092\n85. INTC 53.50999832 0.003363857\n86. PCG 9.149999619 0.003278689\n87. XLF 38.06999969 0.003152088\n88. MSFT 301.1400146 0.003088264\n89. XBI 134.1900024 0.003055369\n90. IWM 227.9600067 0.002939112\n91. XRT 95.63999939 0.00250941\n92. TQQQ 151.4499969 0.002509079\n93. ABBV 111.6200027 0.002329332\n94. WYNN 100.3000031 0.002293121\n95. UBER 40.31999969 0.002232143\n96. T 27.55999947 0.002177068\n97. CSCO 59.41999817 0.001851229\n98. HYG 88.01000214 0.001817975\n99. DOCU 310.0499878 0.001741655\n100. APA 19.67000008 0.001525165\n101. USO 48.65999985 0.001438553\n102. EFA 82.06999969 0.001340319\n103. BIDU 162.9799957 0.001288502\n104. FXI 41.47000122 0.001205691\n105. SBUX 117.1900024 0.001194641\n106. MO 50.97000122 0.001177163\n107. GOOG 2895.5 0.001170782\n108. X 26.21999931 0.001144165\n109. WMT 149.25 0.001139028\n110. QQQ 381.5700073 0.001126923\n111. QCOM 144.6300049 0.001106271\n112. XOM 54.86999893 0.001093494\n113. TEVA 9.479999542 0.001054852\n114. V 225.1100006 0.001021723\n115. GILD 71.95999908 0.000972763\n116. NFLX 590.5300293 0.000948301\n117. EEM 53.11999893 0.000941265\n118. FB 376.2600098 0.000930208\n119. M 21.71999931 0.00092081\n120. BA 218.1699982 0.000825045\n121. CVS 87.47000122 0.000800274\n122. COST 462.5499878 0.000799914\n123. AMZN 3478.050049 0.000715918\n124. KO 56.72999954 0.000705094\n125. ABNB 158 0.000696203\n126. ADBE 666.5900269 0.000690079\n127. PYPL 289.1300049 0.000657144\n128. CHWY 76.75 0.000651466\n129. SMH 273.2900085 0.00062205\n130. KRE 65.18000031 0.000613685\n131. JPM 159.4900055 0.000564299\n132. TLT 148.1799927 0.000539884\n133. SPY 453.0799866 0.000507637\n134. GOLD 20.29999924 0.000492611\n135. TGT 244.3099976 0.000491179\n136. LULU 388.3299866 0.000463523\n137. DIA 354.1400146 0.000451799\n138. XLU 69.48999786 0.000431717\n139. CRM 267.0799866 0.000411862\n140. DIS 181 0.00038674\n141. JNJ 175.0399933 0.000228519\n142. VZ 55.43000031 0.000180408\n143. BABA 170.3000031 0.00017616\n144. ROKU 342.269989 0.000146084\n145. GS 411.3099976 0.000121563 \n\n&amp;#x200B;\n\nI included the prices for the stock/etf so you can see which ones might be \"bargins\" for people with small accounts. \n\n&amp;#x200B;\n\nYou can see that the biggest values for puts are *way* bigger than the biggest values for calls. But, to for example, GME (top of the calls list) is given only a 3.5% chance of going lower, whereas the calls give it a 7.6% chance of going higher.",
        "subreddit": "options",
        "title": "Most expensive calls and most expensive puts (ATM premium/underlying price) for 145 tickers.",
        "url": "https://www.reddit.com/r/options/comments/pjl0rn/most_expensive_calls_and_most_expensive_puts_atm/",
        "created": 1631042109.0
    },
    {
        "author": "Kashmiri-pandit",
        "created_utc": 1630594780,
        "id": "pgjl7g",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Dial Into The Return To the Office With Poly -- Barron's\nMentioned:\tLOGI MSFT POLY RNG ZM\nThe producer of conference-room products and office headsets is recovering after a merger. And its stock is inexpensive. \nBy Eric J. Savitz \n\nThis should be a magical moment for Plantronics, the producer of conference-room products and office headsets, better known as Poly. \n\nWith a gradual return to the office, there is expected to be a surge in \"hybrid meetings\" -- mixing in-person and virtual participants. Poly CEO Dave Shull estimates that there are about 50 million conference rooms globally, and that 10% or less are equipped for videoconferencing. That is a huge potential opportunity for Poly (ticker: POLY) and its competitors. \n\nShares of Poly, meanwhile, have been driven down to bargain-basement levels by the fallout from an ill-fated merger three years ago. At a recent $32, the stock now trades for about 0.7 times anticipated revenue for the March 2023 fiscal year, and just under eight times projected profits for the same period. \n\nIn comparison, Logitech International (LOGI), which has an overlapping set of products, trades for about 3.2 times revenue and 22 times projected profits for the same period. \n\nAt such deeply discounted levels, investors willing to be patient could reap rich rewards as a turnaround gets underway at Poly.",
        "subreddit": "wallstreetbets",
        "title": "POLY, At a recent $32, the stock now trades for about 0.7 times anticipated revenue for the March 2023 fiscal year, and just under eight times projected profits for the same period. In comparison, Logitech International (LOGI), 22 times.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgjl7g/poly_at_a_recent_32_the_stock_now_trades_for/",
        "created": 1630623580.0
    },
    {
        "author": "AztecSandy",
        "created_utc": 1630682516,
        "id": "ph7b1i",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "TOM SIEBEL: Well I think we're right on track with what we communicated when we took the company public. So far, we've exceeded expectations every quarter. We're on the growth trajectory that we projected. We have become the world's leading provider of enterprise AI applications.\n\nWe just formed a very, very strategic relationship with Google Cloud where the almost 4,000-strong sales person organization at Google Cloud will be selling all of our applications globally, so that dramatically increases our sales capacity, say, by a couple of orders of magnitude.\n\nAnd I think the company's right on track, and you know, I don't really watch the stock price day to day. That's not my job. I think, as far as I'm concerned, we have $1 billion cash in the bank. We have enough money to do what we need to do. The market can just close for five years, and I think if it opens, then all the shareholders will be happy.\n\n- Some strong words. I was going to ask you about the stock move. I know you don't like to comment on it, but we are seeing it under some pressure today, so I just wonder what you think investors are missing in terms of the growth story that C3 AI is on right now.\n\nTOM SIEBEL: Well, let's think about this. We deliver 40 turnkey enterprise AI applications a day, for banking, for manufacturing, for oil and gas, financial services, telecommunications, and manufacturing. Google Cloud decided they wanted-- these are very, very high value applications, where these companies are realizing billions of dollars a year annual economic benefit from these apps.\n\nNow, the Google Cloud decided that they wanted to change the competitive dynamics of the hyperscaler market, and lead with turnkey enterprise applications rather than CPU seconds and storage as they compete against the other hyperscalers.\n\nIt's a new think about this in terms of, maybe they needed to approach a partner who had a portfolio of applications like that. How many doors are there to knock on in the world? There's virtually only one. We're the only company in this business. We're the only pure play in enterprise application software in the world, in applications, other than, say, toys. Like, toys would be storage, or toys would be virtualization, or toys would be a machine learning library. We don't deliver toys, we deliver applications.\n\nSo we're the only company in this game. This is a-- probably a $300 to $400 billion addressable market, and I think we're going about establishing a market leadership position in that space, and that's the big picture. And I think we have three, four, five, ten years to execute that strategy. If we execute it, this will be one of the great technology companies in the world.\n\n- Yeah, let's use that five year frame here, then. Because you know, I felt like when we were at the IPO stage, right? When was that? A year ago, more than a year ago, right? When we're looking at the growth rate, right? And you came on, and you were kind of honest about, we're not going to run 75% growth all the time. It's going to moderate a little bit, and we've seen that now in terms of, kind of, subscription revenue here up 29%, total revenue up 29% year over year.\n\nI mean, when you look at that five year time frame, and position it where the stock's trading now, I mean, what is it that you would tell investors about where you'll be in five years if all the things pan out? The Google Cloud partnership, and also the government contracts that it sounded like analysts might not have been projecting quite correctly.\n\nTOM SIEBEL: Well, I think, you know, again, whatever the stock did this morning is, you know, it'll do what it does. And the 29% growth rate will put us in the top decile, certainly, of high growth companies in enterprise application software. The analysts' predictions are that our growth rate will accelerate in the coming years.\n\nAnd I think the company is right on track. It's all good. I think we're very pleased. We're pleased with our Microsoft partnership, our Google partnership, our Baker Hughes partnership, FIS partnership. This company is right on track, and I'm quite pleased with the results.\n\n- You've got a pretty broad footprint right now across sectors, whether that's in manufacturing or financials. A long list here in terms of your research on enterprise AI. Where are you seeing the biggest growth right now? What are you most excited about?\n\nTOM SIEBEL: I think in the long run-- so today, we're huge in energy, oil and gas-- excuse me, energy efficiency, telecommunications, manufacturing, aerospace, defense, intelligence. In the long run, I'm personally most excited about precision health. Precision health will be the largest commercial application of AI, where we will be able to do very precise disease prediction, and therefore be able to intervene clinically and avoid the diagnosis.\n\nWe'll have AI-assisted medicine, genome specific medical protocols. I think the economic and social benefits that will accrue from applying AI to precision health are going to be really staggering. This will-- people will live longer, they will be healthier, we will deliver health care at lower cost, and we will do it-- we'll deliver-- using devices like this, we will be delivering health care to a massively large, previously underserved communities.\n\nSQUEEEEZE! (Nacho libre voice)",
        "subreddit": "wallstreetbets",
        "title": "C3.ai 🥵",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ph7b1i/c3ai/",
        "created": 1630711316.0
    },
    {
        "author": "Dangerous_Contact439",
        "created_utc": 1631046696,
        "id": "pjvawy",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hello:\n\nI am doing covered calls on some long term bullish stable stocks (AAPL, MSFT) and few volatile ones like SQ, RBLX, PENN - I don't mind holding these for long term -  but at the same time I would like to have exit strategy if things go south - esp since market is trading at all time highs, or bad earnings call etc.\n\nIs it best to do CC's and close the position if stock falls or do spreads? \n\nwhich option strategy would you recommend to have protection from stock falling &gt; 10% or more?\n\nappreciate the responses",
        "subreddit": "options",
        "title": "Covered calls exit strategy",
        "url": "https://www.reddit.com/r/options/comments/pjvawy/covered_calls_exit_strategy/",
        "created": 1631075496.0
    },
    {
        "author": "seacobs",
        "created_utc": 1630890560,
        "id": "pipccu",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I am trying to look for solid picks, so I am looking for stocks that are loved by analysts and hedge funds. After doing some research I found quite a few stocks I would be willing to buy. GPN, V, MA, FIS, CI, EHC just to name a few. I won't mention stocks like FB and MSFT, because I sold them recently and I am not sure they are going to keep going up. What are you looking to buy in the coming weeks?",
        "subreddit": "stocks",
        "title": "Stocks loved by analysts and hedge funds?",
        "url": "https://www.reddit.com/r/stocks/comments/pipccu/stocks_loved_by_analysts_and_hedge_funds/",
        "created": 1630919360.0
    },
    {
        "author": "tadhg8811",
        "created_utc": 1631162772,
        "id": "pkqx53",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "In April 2020, ecommerce spending exploded globally. In 8 short weeks, US ecommerce spending as a % of total retail sales grew from 16% to 27%. $SHOP and $AMZN have seen their TAM grow massively and their valuations have grown to reflect this.\n\nWhat if I told you something very similar is happening right now in enterprise SaaS?\n\nAmazingly, in 2020, cloud/SaaS spending is still only 9.1% of total global IT spend. But this in changing. Spending on  cloud/SaaS is expected to grow by 18.4% in 2021 alone.\n\nMuch in the same way that the pandemic has made ecommerce a core part of any retail company’s strategy, it has made SaaS a core part of every company’s plans.\n\nOn-premise software just doesn’t make sense in a remote-first world.\n\nJust like Amazon and Shopify have benefited from the eccommerce explosion, companies like $WDAY, $CRM, $MSFT and $OKTA will benefit from the SaaS explosion.\n\nRead more here: https://tadhg.substack.com/p/the-saas-market-opportunity-is-way",
        "subreddit": "stocks",
        "title": "The SaaS Explosion",
        "url": "https://www.reddit.com/r/stocks/comments/pkqx53/the_saas_explosion/",
        "created": 1631191572.0
    },
    {
        "author": "davetawin",
        "created_utc": 1630922395,
        "id": "piwgtd",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "More than ten years have passed since the world witnessed the most popular cryptocurrency, Bitcoin, and the exceptional functionalities with blockchain. After many years of evolution, there are many blockchain project ideas under development, and many have already captured the attention of people and industries all over the world. You can find various decentralized applications in the present times for trading and access a wide range of functionalities with the available options.\n\n1. Microsoft: Microsoft recently announced that they have partnered with EY for developing its notable blockchain applications. The blockchain application features the capabilities for managing content rights and royalties. Game publishers such as Ubisoft and Xbox were the foremost users of this new blockchain system.\n2. HSBC: HSBC is undoubtedly one of the notable players in the financial domain with a vision for futuristic blockchain project ideas. One of the prominent projects of HSBC is Digital Vault. This is a blockchain-based platform that focuses on the digitalization of all transaction records\n3. Morpheus Network: Morpheus Network is a supply chain SaaS middleware platform seamlessly integrating legacy and emerging technologies like blockchain. They provide supply chain managers with shipment and item visibility to automate and optimize safe and secure supply chains saving time and money. They've worked with some prominent organizations like SENSA, the Argentinian Government and Horizen Global in the past. They're also rumoured to be partnering with Coca Cola anytime now.\n4. Visa: One of the projects of Visa is “Visa B2B Connect” It uses blockchain infrastructure from Chain to offer a better financial solution in cross-border payments. In reality, this project can offer a cost-effective, secure, transparent, and fast way to process all global payments.\n5. Honeywell: Honeywwell has also emerged as one of the pioneers of enterprise blockchain technology alongside other top names in the tech domain. It is a renowned industrial conglomerate, has successfully migrated over 2 million aviation quality documents to a blockchain ledger platform.\n6. Samsung: The IT branch of Samsung, i.e. SamsungSDS has developed various blockchain projects for local hospitals, airports, and governments. Samsung is capable of making the most of the Nexledger blockchain platform to mark its presence in the blockchain ecosystem.\n7. Door: The goal of Doortoken is to identify and track ownership of Real Property in the USA to Digital Currency via the $ETH Blockchain. Anyone who joins the Network bypasses the middleman of Big Ad Tech and can benefit directly from every ad they click, and product they buy. They're currently the #1 Ad Referral Network for crypto.\n8. MetLife: MetLife is working on a bunch of blockchain project ideas, and one of them is Vitana. Recently, MetLife’s Singapore based technology research facility Lumen Labs Global released a whitepaper for the Vitana project. It’s a project geared towards parametric insurance.\n\nWhat are some of the other interesting and unique projects this year on the blockchain?",
        "subreddit": "investing_discussion",
        "title": "Top Unique Blockchain Projects in 2021",
        "url": "https://www.reddit.com/r/investing_discussion/comments/piwgtd/top_unique_blockchain_projects_in_2021/",
        "created": 1630951195.0
    },
    {
        "author": "Disastrous_Assist583",
        "created_utc": 1630864027,
        "id": "piho24",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "as the title said, im\nlooking for a way to invest around 3k in something more or less risky. i am currently 20 years old and a part time-student. its money i technically could afford to lose, but obviously not my goal. most of my money rn is in an all world etf. also got some amazon, apple and microsoft. any suggestions for stocks with a bit more risk?",
        "subreddit": "wallstreetbets",
        "title": "how to invest 3k",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/piho24/how_to_invest_3k/",
        "created": 1630892827.0
    },
    {
        "author": "MillennialBets",
        "created_utc": 1630959309,
        "id": "pj7i53",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hi, r/options! This is a stock ranker that looks at all stocks that have options. Clicking on the ticker links to a search for subreddit posts mentioning the ticker with News, DD, or Discussion Flairs. The post is updated once an hour.\n\n Last update: 16:15:00\n\n\n\n**Top 5 Stocks by % Increase -**  \n\n  \n| Ticker |  Price | Change | %Change | 52wk high |  \n| ------- | ---------- | ---------- | --------- | ---------: |  \n| [MDB](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/MDB) | 507.41 | 105.76 | +26.33% | 508.97 |\n| [NGD](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/NGD) | 1.33 | 0.17 | +14.66% | 2.4 |\n| OOMA | 22.62 | 2.89 | +14.65% | 24.89 |\n| SYBX | 3.07 | 0.37 | +13.7% | 5.11 |\n| MLSS | 2.04 | 0.19 | +10.27% | 4.85 |\n\n  \n**Lowest 5 Stocks by % Decrease -**  \n\n  \n| Ticker |  Price | Change | % Change | 52wk high |  \n| ------- | ---------- | ---------- | --------- | ---------: |  \n| CLIR | 2.2 | -0.81 | -26.91% | 6 |\n| [EVLO](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/EVLO) | 9.12 | -2.14 | -19.0% | 19.93 |\n| [WPG](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/WPG) | 1.49 | -0.23 | -13.37% | 16.55 |\n| NKTX | 28.99 | -3.63 | -11.13% | 79.16 |\n| [LE](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/LE) | 28.25 | -2.85 | -9.16% | 44.4 |\n\n\n  12 hour Reddit Rankings : \n\n  Ticker | Total Posts | DD | Discussion | News | Misc.\n------|-----|-----|------|-----|-----\n[**CLOV**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/CLOV)|12 |1 |3 |0 |8\n[**TSLA**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/TSLA)|8 |2 |2 |0 |4\n[**AMC**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AMC)|4 |1 |3 |0 |0\n[**AAPL**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AAPL)|3 |3 |0 |0 |0\n[**PLTR**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/PLTR)|3 |2 |1 |0 |0\n[**GME**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/GME)|3 |1 |2 |0 |0\n[**DOW**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/DOW)|3 |2 |0 |0 |1\n[**MSFT**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/MSFT)|3 |3 |0 |0 |0\n[**IRS**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/IRS)|2 |1 |1 |0 |0\n[**MT**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/MT)|2 |1 |1 |0 |0\n\n\n 48 hour Reddit Rankings : \n\n  Ticker | Total Posts | DD | Discussion | News | Misc.\n------|-----|-----|------|-----|-----\n[**CLOV**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/CLOV)|45 |3 |5 |0 |37\n[**TSLA**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/TSLA)|16 |4 |4 |1 |7\n[**AAPL**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AAPL)|13 |5 |3 |0 |5\n[**BBIG**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/BBIG)|9 |2 |5 |0 |2\n[**SPRT**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/SPRT)|9 |3 |4 |0 |2\n[**AMC**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AMC)|8 |1 |5 |1 |1\n[**VIH**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/VIH)|8 |4 |0 |2 |2\n[**WISH**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/WISH)|7 |0 |1 |0 |6\n[**GME**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/GME)|7 |2 |3 |0 |2\n[**MSFT**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/MSFT)|6 |3 |2 |0 |1",
        "subreddit": "options",
        "title": "Options Stock Ranker for Sep-06-2021",
        "url": "https://www.reddit.com/r/options/comments/pj7i53/options_stock_ranker_for_sep062021/",
        "created": 1630988109.0
    },
    {
        "author": "molecularscissors",
        "created_utc": 1630667187,
        "id": "ph2zxd",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "TLDR\n\nThis article was written by Dogefather's protégé › who ascertains as a result of research › to provide thorough › readable › analysis. His trading strategy is Long only › Value › Growth › with a medium to long-term horizon. Dogeboy is generally wary of tech stocks › as this sector is ripe for disruption. However › due to TEAM's steady predictability &amp; rapidly growing revenues › he aggressively solicits a posture of Atlassian long game › as one can make room in a portfolio for tech companies that are the disruptors &amp; carry a moat. \n\nConnected Enterprise\n\nAtlassian › TEAM › produces software that helps teams work together more efficiently &amp; effectively › offering a broad set of › easy to deploy &amp; use tools ⤳ Jira › Confluence › Bitbucket › Trello.\n\n83% of Fortune 500 companies use Atlassian software products › utilized by more than 212K customers at both large &amp; small organizations › for open teamwork models &amp; autonomous project planning &amp; management › that provides an environment for enterprises to experiment &amp; optimize employee experience › for frictionless work environments › business partners › in a connected vendor ecosystem › for easy interaction back &amp; forth &amp; quick response to market signals › &amp; connect with customers › to deepen relationships via those processes.\n\nAs teamwork becomes increasingly digital › investing in a connected enterprise is the clear path forward for 10 million monthly active users who use Atlassian cloud collaboration management tools &amp; help desk solutions › to support a variety of collaboration styles &amp; provide standardization to innovate &amp; cut costs. \n\nAtlassian operates in 4 segments ⤳ 1 › subscriptions › term licenses &amp; cloud agreements ⤳ 2 › maintenance › annual maintenance contracts that provide support &amp; periodic updates &amp; are generally attached to perpetual license sales ⤳ 3 › perpetual license › upfront sale for indefinite usage of the software ⤳ 4 › other › training › strategic consulting &amp; revenue from the Atlassian Marketplace app store.\n\nFirst Mover Advantage\n\nWhat sets Atlassian apart is its first mover advantage in its core market. Given the time sensitive nature &amp; delivery windows of most software projects › most of Atlassian's customers simply don’t have the appetite for risking project execution nor the time to adopt a new platform. This has resulted in creating a moat ›  as there are indirect costs associated with the learning curve &amp; switching altogether to another platform. \n\nAtlassian delivers the tools &amp; platforms that developers need to build applications › with every company in every sector becoming a software-driven company › there will be almost infinite demand for new applications. As developers raced to build new applications to help their companies cope with the pandemic › they gravitated toward the tools that enabled them to work the fastest &amp; most efficiently. Every company from the smallest mom &amp; pop shop to the largest multinational realized with utmost clarity that they would live or die by software.\n\n“We are a multi-product company. We differ from many companies that get product/market fit &amp; grow to $500 million in revenue before their second product. We introduced a second product › Confluence › before we reached that scale. We found that customers perceived that software documentation is poor — we developed a product for document collaboration that’s like a Google Doc on steroids. We have multi-product in our DNA. We now have 14 different products.” ⤳ Cameron Deatsch - Chief Revenue Officer.\n\nAtlassian applies the now-popular agile systems development mindset to all its operations. \n\n“As far as process › we use an agile approach. This differs › from the traditional waterfall approach › in which system requirements are developed over two years &amp; handed off to the systems development people to build. With agile › we start with customer goals &amp; iteratively build versus the goals. Every two weeks we ship something &amp; learn from it. We can apply this approach to marketing › closing the books › &amp; so on. We have daily stand-ups &amp; two week sprints.\"\n\nCustomer Growth\n\nAtlassian products meet a unique market need for business customers › modernizing collaboration through human-centered technology ⤳ including office productivity tools › video conferencing platforms › file synchronization › sharing solutions › content management apps &amp; more ⤳ empowering companies to design experiences that unlock less fragmented workflows &amp; bring people together in seamless › interconnected &amp; digital experiences.\n\nThey are able to land customers at a low cost with little human intervention. In the latest quarter › Atlassian brought in 17k new customers who never talked to people at Atlassian or its partners › equating to a robust 9.5% sequential QoQ growth › driven by 5.7k  Trello accounts › as a result of new product features &amp; TEAM’s recent sales funnel optimization initiatives.\n\nThe addressable market size in total is an estimated $125 billion › in terms of potential users › including 800 million knowledge workers at the highest level › drilling down to 100 million technical team members &amp; 23 million software developers. Atlassian noted during the recent industry conference › the company continues to out its online ecosystem › with a marketplace for over 4k apps that utilize its product technology ⤳ recently launched Forge › which provides runtime for these apps.\n\nAtlassian invents new products through processes propelled by its employees. › it builds on its strengths ⤳ a focus on teams› of which there are many different kinds in different industries › come up with new products by looking at customer use cases &amp; trends outside the norm. Service management is the fastest growing product.\n\nRevenue Growth\n\nAtlassian continues its strong track record of growth › Q3’21 revenue growing 38% YoY › driven by subscription revenue growth of 43% YoY. Subscription now comprises 62% of TEAM’s total revenue &amp; its recurring nature helps to smooth out the revenue stream › resulting in higher predictability.\n\nAtlassian has grown impressively over the past few years because it adopts a low-cost web-based marketing &amp; lean transactional operating model › going without a traditional enterprise salesforce &amp; marketing team. Atlassian has a large opportunity ahead › demonstrating strong profitability relative to peers › with a gross profit margin of 84% › far higher than the 49% sector average › a strong balance sheet &amp; plenty of cash to fund future growth initiatives › its FCF margin is 43% › comparing favorably to 12.6% sector median. \n\nGiven the subscription-heavy nature of the business › Atlassian's revenue stream has resulted in sequential quarterly revenue growth over at least the past 3 years &amp; this includes pandemic quarters. Atlassian stopped new sales of server license › increased pricing &amp; created pull-forward effects that incentivize users to renew early › leading to strong revenue &amp; billings growth. Atlassian has demonstrated impressive revenue growth since its IPO in 2015 › growing by 513% over this timeframe to $1.96 billion for the trailing 12 months. Atlassian maintains a fortress balance sheet to fund growth initiatives, with $1.56 billion in cash &amp; short-term investments › no long-term debt, and just $206M in capital leases.\n\nTEAM has outperformed the market in the last year with a price return of ↑ 91.4% while the SPY ETF gained ↑ 30.1%. TEAM has also outperformed the stock market ETF in the last 3 month &amp; 2 week periods returning ↑ 62.1% &amp; ↑ 11.3% › respectively › SPY returned ↑ 8.3% &amp; ↑ 3.2%. Last quarter › Atlassian reported $560 million in Revenue &amp; $.24 earnings per share › this beat revenue expectation by $35 million &amp; exceeded earnings estimates by $.06.\n\nValuation\n\nPotential for competition from legacy software provider Microsoft › MSFT › in the space in which TEAM operates. Atlassian will directly compete against ServiceNow › NOW › as it encroaches on the service desk space. Atlassian’s formal planning processes are adjusted so it can adapt to new threats or opportunities. That’s what happened last year when a competitor’s IPO gave it extra capital to spend on marketing to Atlassian’s customers. Atlassian reprioritized go-to-market resources to keep customer acquisition up in light of that competitor’s spending. One product leader got less. They have OKRs &amp; they adjust.\n\nDisclosure\n\nWithout data › you're just another 🤷🏻‍♂️ with an opinion ⤳ Dogeboy’s 17 Sep 21 calls are ↑ 770%",
        "subreddit": "wallstreetbets",
        "title": "📈 Atlassian › TEAM › Gives Expression to Ineluctable Disruption",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ph2zxd/atlassian_team_gives_expression_to_ineluctable/",
        "created": 1630695987.0
    },
    {
        "author": "mohonmondol",
        "created_utc": 1630992986,
        "id": "pjgt1a",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Microsoft Office 2013 Professional Plus 32/64 Bit",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pjgt1a/microsoft_office_2013_professional_plus_3264_bit/",
        "created": 1631021786.0
    },
    {
        "author": "LocustFunds",
        "created_utc": 1630578257,
        "id": "pgf2qx",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/m2w2vtsbg2l71.png?width=1138&amp;format=png&amp;auto=webp&amp;s=1a3694c07d373a8143a5ef139ed696ef39ac9ddd\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wlfopokcg2l71.png?width=1143&amp;format=png&amp;auto=webp&amp;s=ab42e191e3400301e9bde8f2548f526073e1b3a7\n\n&amp;#x200B;\n\nhttps://preview.redd.it/dxkvyu2eg2l71.png?width=1763&amp;format=png&amp;auto=webp&amp;s=b5bfcc206da6d3ce88a2b4651abd32210aab11b0\n\n&amp;#x200B;\n\nhttps://preview.redd.it/nlqboxzmg2l71.png?width=1763&amp;format=png&amp;auto=webp&amp;s=50edc048dec2b537b5a41c3696ee79dd9b9eae34\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cpysnnbng2l71.png?width=1748&amp;format=png&amp;auto=webp&amp;s=b7e434adb6adff4c4ceb651958ffd9dfe41b609c",
        "subreddit": "options",
        "title": "Total Option Flows on the first day of the month for the Big 10 AMZN, TSLA, AAPL, FB, MSFT, GOOG, NFLX, NVDA, PYPL, ADBE + SPYG &amp; XLK. Index Flows, TRIN, A/D and Breadth.",
        "url": "https://www.reddit.com/r/options/comments/pgf2qx/total_option_flows_on_the_first_day_of_the_month/",
        "created": 1630607057.0
    },
    {
        "author": "babbldev",
        "created_utc": 1630598337,
        "id": "pgkqjj",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "We ran analysis on the sentiment of various financial news sources and pulled the Top mentioned tickers in the news for the month of August 2021\n\n&amp;#x200B;\n\nHeres what we found.\n\n1. [$AAPL](https://twitter.com/search?q=%24AAPL&amp;src=cashtag_click)  \n\n2. [$TSLA](https://twitter.com/search?q=%24TSLA&amp;src=cashtag_click)  \n\n3. [$AMZN](https://twitter.com/search?q=%24AMZN&amp;src=cashtag_click)  \n\n4. [$GOOG](https://twitter.com/search?q=%24GOOG&amp;src=cashtag_click)  \n\n5. [$FB](https://twitter.com/search?q=%24FB&amp;src=cashtag_click) \n\n6. [$MSFT](https://twitter.com/search?q=%24MSFT&amp;src=cashtag_click) \n\n7. [$GOOGL](https://twitter.com/search?q=%24GOOGL&amp;src=cashtag_click)  \n\n8. [$DIS](https://twitter.com/search?q=%24DIS&amp;src=cashtag_click)  \n\n9. [$COIN](https://twitter.com/search?q=%24COIN&amp;src=cashtag_click) \n\n10. [$T](https://twitter.com/search?q=%24T&amp;src=cashtag_click)  \n\nBonus: [$NFLX](https://twitter.com/search?q=%24NFLX&amp;src=cashtag_click)  \n\n&amp;#x200B;\n\n  \n\n\nhttps://preview.redd.it/gj2xwprf34l71.png?width=1362&amp;format=png&amp;auto=webp&amp;s=2ace7fde3a2b88ebc3996187ecd0a157bdb0ca15",
        "subreddit": "StockMarket",
        "title": "Top mentioned tickers in the news for the month of August 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/pgkqjj/top_mentioned_tickers_in_the_news_for_the_month/",
        "created": 1630627137.0
    },
    {
        "author": "TheYoloGod-",
        "created_utc": 1631106401,
        "id": "pka5h2",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[https://investors.cloverhealth.com/news-releases/news-release-details/clover-assistant-now-supports-all-fhir-enabled-ehrs](https://investors.cloverhealth.com/news-releases/news-release-details/clover-assistant-now-supports-all-fhir-enabled-ehrs) \n\n\"Clover continues to invest in platform capabilities that advance adoption of FHIR, and now the Clover Assistant has the technical foundation to facilitate integrations with all FHIR-enabled EHRs (Electronic Health Records), such as athenahealth, Cerner and Epic, as well as any cloud platform with centralized FHIR storage, including Amazon Web Services, Microsoft Azure, and Google Cloud. Clover is continuing to develop highly intuitive integrations within each EHR and cloud service. Embracing these interoperability standards is a demonstration of Clover’s commitment to breaking down healthcare data silos with the goal of bringing personalized, data-driven recommendations to physicians at the point of care.\"  \n\n\n “We’re thrilled to support FHIR because it has so much potential to break down data silos and give physicians the information they need at the moment it will have the most impact on their patients’ health. As we continue to develop new capabilities, I think our doctors will find them incredibly valuable when managing their Clover patients.”",
        "subreddit": "wallstreetbets",
        "title": "New News: Clover Assistant Now Supports All FHIR-Enabled EHRss EXTREMELY BULLISH",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pka5h2/new_news_clover_assistant_now_supports_all/",
        "created": 1631135201.0
    },
    {
        "author": "ZavierKonz",
        "created_utc": 1631149971,
        "id": "pknjbo",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "My portfolio is quite tech heavy right now, stocks and ETF. I do like investing in tech but I want to diversify more. I have two tax-free accounts here in Canada, and I intend to keep most of these stocks and ETFs for a long period of time. Here's what I have right now:\n\n**Tax-free savings account (holding 5+ years)**\n\n9% - AAPL\n\n10% - ASTS\n\n8% - CRSR\n\n17% - MSFT\n\n17% - QQQ\n\n15% - SMH\n\n24% - VGT\n\nLike I said, super tech heavy. I'm also aware of the big overlap. This is an account I'm willing to take more risks with. Looking to add some clean energy, cyber security and other \"future tech\" ETFs. Any recommendations?\n\n**Tax-free retirement funds (holding 30+ years):**\n\n40% - SCHD\n\n40% - VYM\n\n20% - VOO\n\nThis is very focused on dividends, since this account is tax-free for gains and dividends, and I'm not willing to take as much risk with this one. Any thoughts?\n\nStill very new to stocks and ETFs, looking for any type of feedback. Don't be shy, roast me!",
        "subreddit": "stocks",
        "title": "Need advise on my tech heavy portfolio",
        "url": "https://www.reddit.com/r/stocks/comments/pknjbo/need_advise_on_my_tech_heavy_portfolio/",
        "created": 1631178771.0
    },
    {
        "author": "Adept_Chip",
        "created_utc": 1630704041,
        "id": "phe532",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " Reportlinker.com announces the release of the report \"Global AI in Computer Vision Market By Offering, By Machine Learning Model, By Function, By Application, By End User, By Regional Outlook, COVID-19 Impact Analysis Report and Forecast, 2021 - 2027\" - https://www.reportlinker.com/p06131405/?utm\\_source=GNW  \nThe AI in a computer or a computer-enabled robotic system makes it capable to manage information and generate results in decision making, learning, and solving problems. The results are produced in such a manner that they are quite similar to the thought process of humans.  \n\n\nComputer vision is one of the domains of computer science. It is focused on reproducing the intricacy of the human vision system. This enables the computers to recognize and process objects from the presented images and videos in a similar manner like humans. As a huge amount of data is generated on daily basis, it is important to have the application of computer vision. Therefore, it is the key catalyst for the growth of computer vision. The precision rates of object detection have been improving with superior and advanced hardware and algorithms in computer vision. The percentage of accuracy reached from 50% to 99%, so computers are responding more quickly to visual inputs as compared to humans.  \n\n\nThe increasing need for automation and quality inspection, growing demand for computer vision systems in non-conventional applications are the major factors driving the growth of the AI in computer vision market. Moreover, the increasing need for ASICs is also expected to boost the growth of the market. Similarly, favorable policies and government initiatives to support industrial integration and adoption of AI into the edge devices are likely to create new growth avenues for the market players. However, increasing security concerns associated with cloud-based image processing and analytics are likely to restraint market growth.  \n\n\nCOVID-19 Impact  \n\n\nThe sudden outbreak of the COVID-19 has impacted various industries. Though, it had a negligible impact on AI in the computer vision market. The outbreak of the COVID-19 has caused a major impediment to the export-oriented economies from a regional point of view. It is due to the temporary closure of manufacturing units. For example, the automotive industry of Germany has been rigorously affected because most of the automobile trade in this region takes place with China and Italy. Apart from the issues related to imports and exports, the manufacturing industry growth in Germany has also been hampered by the shutdown of manufacturing plants and reduces speed in operations in order to curb the spread of COVID-19.  \n\n\nOffering Outlook  \n\n\nBased on Offering, the market is segmented into Software and Hardware. Hardware segment is further bifurcated across Processor, Memory and Storage. The software segment would exhibit highest growth rate during the forecast period. Software tools in combination with a suite of computer vision software help an individual to interface with a camera and a production line. It automatically carries out location analysis, image improvement, flaw detection, character recognition, symbol recognition, character verification, and several other functions.  \n\n\nMachine Learning Model Outlook  \n\n\nBased on Machine Learning Model, the market is segmented into Supervised Learning and Unsupervised Learning &amp; Reinforcement Learning. Supervised learning segment would garner a higher share of the AI in the computer vision market in 2020. The increasing adoption of supervised learning in different healthcare applications mainly medical imaging and their usage in different sensors and devices that includes modern facial recognition algorithms are likely to promote the growth of this segment.  \n\n\nFunction Outlook  \n\n\nBased on Function, the market is segmented into Inference and Training. Inspection, measurement, identification, and locating the product are the major applications of computer vision systems in diverse industries. Apart from it, AI-enabled vision systems have methods of developing novel applications like 3D model building, optical character recognition, retail, medical imaging, automobile safety, surveillance &amp; traffic monitoring, morphing, and augmented reality.  \n\n\nApplication Outlook  \n\n\nBased on Application, the market is segmented into Non-industrial and Industrial. The non-industrial segment procured the largest share of AI in the computer vision market in 2020. In the non-industrial market, the increasing demand for camera-enabled smartphones in both front and rear ends is boosting the AI in computer vision market, mainly in the consumer segment. Furthermore, the industrial segment is likely to grow at a higher rate due to the adoption of modern technologies.  \n\n\nEnd User Outlook  \n\n\nBased on End User, the market is segmented into Consumer Electronics, Automotive, Retail, Healthcare, Security &amp; Surveillance, Manufacturing and Others. The Consumer Electronics segment would procure the largest share over the forecast period. There is a growing demand for AI-enabled computer vision systems mainly in consumer electronics like smartphones, laptops, and desktops. This factor is expected to drive the growth of the AI in computer vision market over the forecast period. Healthcare would exhibit the highest CAGR over the forecast period. It is attributed to fact that AI-enabled computer vision technology is finding its applications in radiology and medical imaging.  \n\n\nRegional Outlook  \n\n\nBased on Regions, the market is segmented into North America, Europe, Asia Pacific, and Latin America, Middle East &amp; Africa. Based on region, North America would garner the largest share of the global AI in the computer vision market. The presence of key market players of AI technology including IBM (US), Google (US), Intel (US), Microsoft (US), NVIDIA (US), and Facebook (US) in this region is complementing the growth of the market. In recent years, government interventions have been increased due to rising concerns about the security of crucial infrastructure and sensitive data. This has resulted in the higher adoption of AI in computer vision, especially in security applications.  \n\n\nThe major strategies followed by the market participants are Product Launches. Based on the Analysis presented in the Cardinal matrix; Microsoft Corporation, Intel Corporation, Amazon.com, Inc., Facebook, Inc., and Google, Inc. are the forerunners in the AI in Computer Vision Market. Companies such as NVIDIA Corporation, Basler AG, and Xilinx, Inc. are some of the key innovators in the market.  \n\n\nThe market research report covers the analysis of key stake holders of the market. Key companies profiled in the report include NVIDIA Corporation, Intel Corporation, Microsoft Corporation, IBM Corporation, Qualcomm, Inc., Amazon.com, Inc., Xilinx, Inc., Google, Inc., Facebook, Inc., and Basler AG.  \n\n\nRecent strategies deployed in AI in Computer Vision Market  \n\n\nPartnerships, Collaborations, and Agreements:  \n\n\nApr-2021: Intel teamed up with John Deere, an American manufacturing company. The companies announced a pilot program, which depends on AI &amp; computer vision to identify defects in manufacturing regarding the welding process.  \n\n\nOct-2020: Microsoft partnered with SoftBank, a Japanese multinational conglomerate holding company. This partnership aimed to allow developers to transmit data from Arm-based Internet of Things (IoT) devices to Azure Cloud and also enable developers to easily target a wide variety of Arm-based devices such as intelligent computer-vision-enabled cameras, AI gateways, connected vehicles, and intelligent appliances.  \n\n\nSep-2020: Basler formed a collaboration with Axiomtek, a leader in designing and manufacturing industrial computer products. This collaboration aimed to provide integrated, all-in-one machine vision solutions for factory &amp; machine automation. In addition, the companies also aimed to help manufacturers &amp; system integrators instantly create their own quality inspection applications to make manufacturing processes effective and competitive.  \n\n\nSep-2020: NVIDIA collaborated with HCL Technologies, an Indian multinational information technology services and consulting company. Under this collaboration, HCL joined NVIDIA Partner Network (NPN) to utilize the expanded opportunities in the Artificial Intelligence (AI) space. In addition, HCL also unveiled NEXT.ai, HCL’s AI Lab, aimed at upskilling engineers and architects using AI solutions all over the hardware &amp; software technology stacks, which would improve their offerings to develop AI-led solutions for various HCL customers over various industry verticals.  \n\n\nAcquisition and Mergers:  \n\n\nMay-2021: Basler announced a merger with Silicon Software, a globally recognized technology leader in the programming of FPGA processors. Basler acquired Silicon Software in 2018 and operated it as an independent company under the group structure. Some functions like logistics, production, sales, and technical support were merged after the acquisition, and now the other functional units are followed step by step.  \n\n\nSep-2020: NVIDIA came into an agreement to acquire Arm Limited, a British semiconductor, and software design company. Through this acquisition, NVIDIA would integrate its leading AI computing platform with Arm’s vast ecosystem to make the premier computing enterprise for the age of artificial intelligence, fuelling the innovation and also expanding into big, high-growth markets.  \n\n\nFeb-2020: Facebook took over Scape Technologies, a computer vision startup. This acquisition aimed to support the social media site’s interest in next-generation techs like AI and virtual reality.  \n\n\nProduct Launches and Product Expansions:  \n\n\nApr-2021: Basler introduced a new AI machine vision platform. This platform is based on the artificial intelligence (AI) &amp; machine learning (ML) services provided by Amazon Web Services. The platform involves a 5 MPixel Basler ace camera with GigE interface &amp; the NVIDIA Jetson TX2NX module. Additionally, Basler’s pylon Camera Software Suite is integrated with the AWS Panorama Device SDK, allowing customers to implement and operate AI/ML applications on edge gadgets with device management and precision monitoring support.  \n\n\nApr-2021: Xilinx launched the Kria portfolio of adaptive system-on-modules (SOMs), production-ready small form factor incorporated with boards. Kria adaptive SOMs are the latest way of bringing adaptive computing to AI &amp; software developers, which are coupled with a comprehensive software stack and pre-built, production-grade accelerated applications.  \n\n\nApr-2021: NVIDIA unveiled the next-generation AI-enabled processor for autonomous vehicles, NVIDIA DRIVE Atlan. This product is the latest addition to NVIDIA’s centralized compute roadmap for autonomous vehicles, and it integrates AI &amp; software with enhancements in networking, computing, and security for extraordinary levels of performance &amp; security.  \n\n\nApr-202: NVIDIA launched a new class of NVIDIA-Certified System. It brings AI under the reach of companies, which operate their applications on industry-standard enterprise data center infrastructure. In addition, this new class involves high-volume enterprise servers from leading manufacturers, which can operate the NVIDIA AI Enterprise software portfolio and certified for VMware vSphere 7, which is known as the world’s most broadly utilized compute virtualization platform.  \n\n\nMar- 2021: Facebook introduced SEER, a deep learning solution. This solution aimed to register images on the Internet regardless of curated and labeled data sets. Through the major improvements that are underway in natural language processing (NLP) that includes natural language interference, machine translation, and question answering, SEER utilizes an innovative billion-parameter, self-supervised computer vision model capable of learning from any online image.  \n\n\nMar-2021: Xilinx expanded its UltraScale+ portfolio for markets with the latest applications, which need ultra-compact &amp; intelligent edge solutions. The latest Artix and Zynq UltraScale+ devices can meet a broad range of applications under the industrial, healthcare, vision, broadcast, automotive, consumer, and networking markets.  \n\n\nMar-2021: NVIDIA introduced new updates to CUDA-X AI Software. The NVIDIA CUDA-X AI is a deep learning library for all researchers &amp; software developers to develop high-performance GPU-accelerated applications for recommendation systems, interactive AI, and computer vision.  \n\n\nFeb-2021: Xilinx unveiled a set of tools &amp; services for AI-based video analytics, gathered within the Smart World banner. The core of this offering is the Xilinx Video Machine-learning Streaming Server (VMSS) that helps use cases that include virtual fencing, facial recognition, traffic monitoring, crowd statistics, and object detection.  \n\n\nJan-2021: Intel released a facial recognition feature to its Intel RealSense portfolio. RealSense ID consists of an active depth-sensing camera along with a specified system-on-chip involving Intel’s specialized facial authentication neural network. This product includes the improvements in computer vision &amp; neural networks that made facial recognition &amp; authentication more comprehensive.  \n\n\nDec-2020: Amazon Web Services released Amazon Lookout for Equipment, Amazon Monitron, the AWS Panorama SDK, the AWS Panorama Appliance, and Amazon Lookout for Vision. These five new machine learning services assist industrial &amp; manufacturing clients to implement the intelligence in their production procedures to enhance operational efficiency, security, quality control, and workplace safety.  \n\n\nJul-2020: Qualcomm Technologies introduced the Qualcomm QCS610 and Qualcomm QCS410 system-on-chips (SoCs) to the Qualcomm Vision Intelligence Platform. The QCS610 and QCS410 are developed to bring top-quality camera technology that includes robust artificial intelligence &amp; machine learning features earlier only available to high-end devices, into mid-tier camera categories.  \n\n\nScope of the Study  \n\n\nMarket Segments covered in the Report:  \n\n\nBy Offering  \n\n\n• Software  \n\n\n• Hardware  \n\n\no Processor  \n\n\no Memory  \n\n\no Storage  \n\n\nBy Machine Learning Model  \n\n\n• Supervised Learning  \n\n\n• Unsupervised Learning &amp; Reinforcement Learning  \n\n\nBy Function  \n\n\n• Inference  \n\n\n• Training  \n\n\nBy Application  \n\n\n• Non-industrial  \n\n\n• Industrial  \n\n\nBy End User  \n\n\n• Consumer Electronics  \n\n\n• Automotive  \n\n\n• Retail  \n\n\n• Healthcare  \n\n\n• Security &amp; Surveillance  \n\n\n• Manufacturing  \n\n\n• Others  \n\n\nBy Geography  \n\n\n• North America  \n\n\no US  \n\n\no Canada  \n\n\no Mexico  \n\n\no Rest of North America  \n\n\n• Europe  \n\n\no Germany  \n\n\no UK  \n\n\no France  \n\n\no Russia  \n\n\no Spain  \n\n\no Italy  \n\n\no Rest of Europe  \n\n\n• Asia Pacific  \n\n\no China  \n\n\no Japan  \n\n\no India  \n\n\no South Korea  \n\n\no Singapore  \n\n\no Malaysia  \n\n\no Rest of Asia Pacific  \n\n\n• LAMEA  \n\n\no Brazil  \n\n\no Argentina  \n\n\no UAE  \n\n\no Saudi Arabia  \n\n\no South Africa  \n\n\no Nigeria  \n\n\no Rest of LAMEA  \n\n\nCompanies Profiled  \n\n\n• NVIDIA Corporation  \n\n\n• Intel Corporation  \n\n\n• Microsoft Corporation  \n\n\n• IBM Corporation  \n\n\n• Qualcomm, Inc.  \n\n\n• Amazon.com, Inc.  \n\n\n• Xilinx, Inc.  \n\n\n• Google, Inc.  \n\n\n• Facebook, Inc.  \n\n\n• Basler AG  \n\n\nUnique Offerings  \n\n\n• Exhaustive coverage  \n\n\n• Highest number of market tables and figures  \n\n\n• Subscription based model available  \n\n\n• Guaranteed best price  \n\n\n• Assured post sales research support with 10% customization free  \n\n\nFull report: [https://www.reportlinker.com/p06131405/?utm\\_source=GNW](https://www.globenewswire.com/Tracker?data=M5qOYb4OcGQWiacO4kJkMrxmFu9clcBJDzVi7cB65UwYu_2eGAm72l1wxA97l1-usGC8uxi7p3oL--noFR9T80jDOx_CZx0D3JPoeXElYZUVQefJEQnz42weQXBL3Ertj1bmetkywPJqkocyZk1qkDICixaXR3kEsDrymG7LIXGcrk6h0CUXlDjlPSQgjkFe)",
        "subreddit": "investing",
        "title": "Global AI in Computer Vision Market By Offering, By Machine Learning Model, By Function, By Application, By End User, By Regional Outlook, COVID-19 Impact Analysis Report and Forecast, 2021 - 2027",
        "url": "https://www.reddit.com/r/investing/comments/phe532/global_ai_in_computer_vision_market_by_offering/",
        "created": 1630732841.0
    },
    {
        "author": "Tyfighter666",
        "created_utc": 1631031477,
        "id": "pjqafk",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I recently saw FAANG and also FAAMG. I've decided to combine the two with an amazing title. I present to you FAGMAN. FB, AAPL, GOOGL, MSFT, AMZN, NFLX It's a set of stocks, a super hero, it's going to the moon, and you can invest in him today. \nSay it with me folks, FAAGMAN to the moon!",
        "subreddit": "wallstreetbets",
        "title": "FAAGMAN",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pjqafk/faagman/",
        "created": 1631060277.0
    },
    {
        "author": "orphanewhoremonster",
        "created_utc": 1630644456,
        "id": "pgyabe",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "MSFT LEAPS Wait for 2024? Exp?",
        "url": "https://www.reddit.com/r/stocks/comments/pgyabe/msft_leaps_wait_for_2024_exp/",
        "created": 1630673256.0
    },
    {
        "author": "jclines12",
        "created_utc": 1630698862,
        "id": "phcjn7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Really liking VIH as a potential short squeeze.\n- About 40% of float is short\n- Tiny float (only 19 million shares)\n- $10 NAV\n- 69% of float held by institutions\n- Merging with Bakkt with is backed by Microsoft and Starbucks and is 81% owned by the CEO of the NYSE\n\nPSA I own 10/15 12.5 calls",
        "subreddit": "wallstreetbets",
        "title": "Why $VIH is a potential short squeeze candidate",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phcjn7/why_vih_is_a_potential_short_squeeze_candidate/",
        "created": 1630727662.0
    },
    {
        "author": "waxingeloquence",
        "created_utc": 1631017147,
        "id": "pjlxrg",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \\*\\*\\*Disclaimers &amp; Disclosures: This article is meant for discussion and entertainment purposes only. The following is not investment advice, nor a recommendation to buy or sell any security/investment. Investments always carry risk, so DYOR.\n\nWe are traders &amp; private investors who see the value of Reddit in creating and growing an investing community.\n\nStocks included in this article: WBA, AAPL, MSFT, GS, CVS, RAD, WMT, TGT, UNH, CI, DG, JNJ, PG, AMZN, BRK/A, BRK/B.\n\nWe are long WBA.\n\n\\*\\*\\*\n\n&amp;#x200B;\n\nWalgreens ($WBA) is a safe and cheap stock, selling at a discount, with an improving underlying business, and ripe for a buyout. In addition to a healthy 4% dividend, Walgreens is also a major potential takeover target in the healthcare/pharmaceutical space. Selling at attractive valuations, and as both a Dow component and a best-of-breed player in the pharmacy business, we think Walgreens represents a huge investment opportunity. Furthermore, with cheap valuations, a low Beta, and lower correlation to the broader market, we believe WBA is a top defensive play &amp; income producer, and could be added as a core position to anyone’s portfolio. Including WBA in your portfolio is highly likely to reduce overall portfolio volatility and risk, and improve your performance.\n\n**Our price target for $WBA is $74, an upside of approximately 50%.**\n\nBelow are the 6 main reasons we’re bullish on WBA.\n\n&amp;#x200B;\n\n**1)** **WBA is a Dow component.**\n\nWalgreens stock ($WBA) is a Dow component. As one of only 30 stocks in the Dow Jones Industrial Average (the oldest and most historically-followed U.S. market index dating back to the late 1800s), WBA is now considered one of the select large-cap companies which (together) accurately represent the overall market.\n\nThough WBA has a small weighting in the Dow (only \\~1% when compared to 3% for Apple (AAPL), 5% for Microsoft (MSFT), and 7% for Goldman Sachs (GS), for example), it still stands to benefit greatly from being one of the most visible and widely-followed stocks as part of the Dow index. Moreover, with $Billions (or Trillions) of Dollars in passive investing, a lot of money flows to index funds. As index funds are bought, money is then invested into WBA, which pushes the price up.\n\nWBA has A LOT of room to go. Its stock price can increase and earn a higher weighting, which could then trigger a “virtuous cycle”, where the stock price increases --&gt; WBA weighting increases --&gt; more passive (and active) money flows into WBA --&gt; the stock price increases --&gt; the positive cycle repeats.\n\nIn short, as a (relatively new) part of the Dow, WBA stock stands to gain. As it benefits from passive/index investing, its market cap can be $Billions larger. The honor of being one of the few companies in the Dow will keep WBA stock visible to investors and will keep the stock supported in a big way.\n\n&amp;#x200B;\n\n**2)** **Best-of-Breed in Pharmacy/Healthcare**\n\nWalgreens is clearly one o f the largest players and best-of-breed companies in the Pharmacy/Healthcare space. Not only is WBA’s inclusion in the Dow a huge statement that WBA is best-of-breed, but also the lack of competition and alternative choices in pharmacy stocks is a huge advantage to WBA. With only CVS ($CVS) and Rite-aid ($RAD) as similar peers in the entire market (and with worse financials!), WBA is a clear #1 investment choice.\n\n&amp;#x200B;\n\n**3)** **4% Dividend**\n\nA 4% dividend makes WBA an income investment opportunity, in addition to the growth and stock price increases we expect to see in the near future. Not only is WBA a relatively safe stock with a low Beta (lower volatility than the broader market), but also the excellent 4% dividend payment is already half of the stock market’s yearly average return (8%) going back 100+ years.\n\nIts further possible that WBA’s dividend can continue to grow sustainably; in fact, WBA is a blue-chip dividend powerhouse and officially a member of the \"Dividend Aristocrats\", companies which have increased their dividend for 25+ consecutive years. Walgreens has increased its dividend for 45 years and running.\n\n&amp;#x200B;\n\n**4)** **Attractive Valuations**\n\nWBA has very attractive valuations, and the stock is selling at a major discount. Investors have a chance right now to buy the stock and a great company at a bargain, right before the stock price could rise by 50%+.\n\nWhy is the stock so cheap? The company has shown poor stock performance over the past few years mostly due to poor earnings performance, low profitability, and high debt. Fortunately, things are improving and the stock hasn’t yet reflected the good news. It will soon be priced in, and the stock price will rise.\n\nHow do we know it’s cheap? Why is the stock a “buy”? WBA stock sells at attractive low multiples (1) on an absolute basis (10x forward P/E, 2x P/B, 9x P/FCF), (2) on an historical basis (lowest P/S and near 15-year low P/B and P/FCF), and (3) on a peer comparables basis (WBA is selling at significantly cheaper valuation multiples than Walmart (WMT), Johnson &amp; Johnson (JNJ), Procter &amp; Gamble (PG), Target (TGT), Dollar General (DG), United Health (UNH), Cigna (CI), etc.).\n\nIn other words, the stock is cheap on nearly all fronts, and potentially offering a major value investment. If WBA had multiples more comparable to its peer group, the stock would be trading at a significantly higher price. As market participants come to realize this market mispricing/inefficiency, the stock price is likely to adjust higher.\n\n&amp;#x200B;\n\n**5)** **Improving Business**\n\nWalgreens’ business and future prospects seem to be improving. With a new CEO at the helm (the first African American female CEO of a Fortune 500 company), along with critical strategic decisions/initiatives likely upcoming, WBA is very well-positioned to grow and gain market share.\n\nWith most locations (physical stores) in very good condition still looking new, located on prime real estate, and acting as top places to get vaccinated against Covid-19, there is plenty more time in WBA’s bullish cycle. (see: [https://www.netleaseadvisor.com/tenant/walgreens/](https://www.netleaseadvisor.com/tenant/walgreens/) )\n\nWe will look at the upcoming year’s revenue, income, and cash flows to judge WBA’s progress and performance.\n\n&amp;#x200B;\n\n**6)** **Takeover Target / Buyout**\n\nThe cherry on top for Walgreens ($WBA) stock is a takeover.\n\nWalgreens is an attractive takeover target. Especially in the retail/pharmaceutical/healthcare space, Walgreens presents a market-moving opportunity for a large public company or private equity group. In fact, this was attempted not too long ago when in late-2019 KKR ($KKR) showed interest in taking WBA private in the largest private-equity buyout of all-time (see: [https://www.theguardian.com/business/2019/nov/11/walgreens-boots-alliance-kkr-buyout-offer](https://www.theguardian.com/business/2019/nov/11/walgreens-boots-alliance-kkr-buyout-offer) ). The takeover offer at the time was $70-80/share, 40-60% higher than current prices.\n\nThere is clearly significant interest in WBA, and it’s been quiet for a little while. The sleeping lion (or bull?) could wake up at any moment.\n\nA takeover has been attempted at much higher prices by private equity buyers. The existence of such investor interest and possible takeover offers provides (1) a strong catalyst for a soaring stock price, and (2) a floor to the stock, which will support the stock at or above current prices. If the stock price drops too far, buyers are highly likely to step in.\n\nAdditionally, though maybe unlikely, both Amazon ($AMZN) and Warren Buffett / Berkshire Hathaway ($BRK/A)($BRK/B) could be potential buyers. Amazon has shown much interest in expanding into Pharma/Drugs/Prescriptions as well as expanding its retail operation. WBA seems to be a great potential fit; and at only $50-100B, WBA is not such a big purchase for the $2 Trillion market cap Amazon.\n\nWarren Buffett and/or Berkshire Hathaway could also be a potential investor. WBA fits many of the criteria which Buffett and other value investors look for. Additionally, Buffett and a joint venture between Amazon, Berkshire, and JP Morgan (called “Haven”) showed strong interest in disrupting the healthcare sector until recently disbanding (see: [https://www.cnbc.com/2021/01/04/haven-the-amazon-berkshire-jpmorgan-venture-to-disrupt-healthcare-is-disbanding-after-3-years.html](https://www.cnbc.com/2021/01/04/haven-the-amazon-berkshire-jpmorgan-venture-to-disrupt-healthcare-is-disbanding-after-3-years.html) ).\n\nIt seems painfully clear that Amazon ($AMZN), Berkshire ($BRK/A)($BRK/B), and other major players are highly-interested in gaining a foothold in the space which Walgreens ($WBA) already dominates. If takeover interest materializes, or if Buffett decides to invest more heavily in WBA, you can bet there will be a lot of attention on the stock, and the stock price is likely to be much higher.",
        "subreddit": "wallstreetbets",
        "title": "Walgreens DD ($WBA): Safe Stock, Selling at a Discount, 4% Dividend, Improving Business --&gt; Price Target $74 (50% upside).",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pjlxrg/walgreens_dd_wba_safe_stock_selling_at_a_discount/",
        "created": 1631045947.0
    },
    {
        "author": "seacobs",
        "created_utc": 1630890396,
        "id": "pipars",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Stocks loved by analysts and hedge funds? GPN, V, MA, FIS, CI, EHC just to name a few. I won't mention the ones like FB and MSFT, because I sold them recently and I am not sure they are going to keep going up.",
        "subreddit": "stocks",
        "title": "Stocks loved by analysts and hedge funds?",
        "url": "https://www.reddit.com/r/stocks/comments/pipars/stocks_loved_by_analysts_and_hedge_funds/",
        "created": 1630919196.0
    },
    {
        "author": "Cpt-Sparklez-gym-plz",
        "created_utc": 1630637626,
        "id": "pgwjzg",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " ( NOTE : this stock was originally brought to my attention by RamenNoodles1776, although im adding various things on to it, the backbone of the argument is by the noodle man )\n\n**introduction**\n\nAlright you pieces of shit, it's time for post #2, and this time it's a less substantiated boy: Cyxtera ( CYXT ). They're a global leader in data center colocation and interconnection services. Now if you're brain dead like I am, I'll tell you what that means : in essence their business is based in a variety of data analyzing, managing, and protection services ( cyber shit ). Now normally this wouldn’t mean much, BUT due to Biden’s push for cybersecurity as of late, as well as several other factors, it's actually incredibly well poised to explode and reach andromeda.\n\n**Bullet time**\n\nNow i could post all about their earnings, volume movement, target estimation, outlook, but you’re lazy ass doesn't want to look at that so I'll just be loud, quick and decisive with some handy dandy bullet points :\n\n* In the last week or so their stocks has increased 10%\n* Still merely under 10$ in price per share, their so low right now that an increase in their price would magnify gains greater than any blue-chip could reach\n* Regardless of the actual performance of the company their placement as a market leader gives them an intrinsic advantage in data service opportunities provided by the government ( oooooo big boy words )\n* Considering major companies like google, Microsoft and amazon all have extremely large portions of themselves dedicated to data, it is not unwise to assume \n\n**The Real shit**\n\n\\****Alright time for some fuckin graphs.***\n\nThis first graph provides information regarding the speculated data services over the next 6 years.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lwlp3sozc7l71.png?width=600&amp;format=png&amp;auto=webp&amp;s=9efc951faee4b1adab0d77263cd28468fcf14181\n\nhttps://preview.redd.it/g5op8tozc7l71.png?width=318&amp;format=png&amp;auto=webp&amp;s=d4c17582bc4ff91cb4afd762eda89278631e67b0\n\nNow, if you have eyes, one can see that this is clearly an exponential trend which would of course coincide with a positive change in CYXT’s stock price as well. Now you may ask yourself “ well why hasn't it gone up yet then ya fuckin doofus”. Well ya piece of shit, I'll tell you : amazon and other companies like it have been mostly monopolizing data services and Cyxtera hasn’t been in a position to fight back. HOWEVER, Biden has made a strong push towards antitrust scrutiny of amazon and other such companies. Thus allowing for it to get a foothold that will allow it to hulk jump into space. \n\nAs was said before, its a major data management company but it’s been faced with a variety of compounding factors that's been holding it down, with the biggest being : IT'S PRETTY NEW.\n\nIt's not just coming out dicks swinging right outta the gate it has to first develop a reputation and develop itself before people start putting money into it, and the time for that is very close at hand.\n\nIn Conclusion\n\nBuy it or don’t buy it, no matter what your choice is, feel free to...\n\n# Suck my meat on soft\n\nSummary : ( courtesy of RamenNoodles1776 )\n\nCyxtera finally hit 1.5 billion market cap, this new spac venture is well positioned to take advantage of Biden's push for cyber security. They are the third largest data colocation center in the world and went public with the svac spac purchase in august, which is now CYXT. They essentially have a secure path to hold all of business data acting as a giant server that has locations all over the world.🚀🚀🚀🚀🚀🚀\n\n*Noodle man Disclaimer, I do have a small amount of call options out through November on CYXT (after their quarterly report) and am in no way a financial advisor. This is an opportunity my amatuer self has noticed, let me know what you all think.*",
        "subreddit": "wallstreetbets",
        "title": "Cyxtera ( CYTX ) is gonna burn your dick off in the wake of its thrusters in its blast off to ANDROMEDA, increase profits by over and up to 10,000%",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgwjzg/cyxtera_cytx_is_gonna_burn_your_dick_off_in_the/",
        "created": 1630666426.0
    },
    {
        "author": "AztecSandy",
        "created_utc": 1630681285,
        "id": "ph6wb5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Definitely a big opportunity! Next in line for biggest tech company. Partnerships with google, Microsoft and other big companies. AI roles in oil, energy, precision health etc. SQUEEEZE (nacho libre) voice.",
        "subreddit": "wallstreetbets",
        "title": "C3.ai 🥵",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ph6wb5/c3ai/",
        "created": 1630710085.0
    },
    {
        "author": "MillennialBets",
        "created_utc": 1630528895,
        "id": "pg2m5d",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hi, r/options! This is a stock ranker that looks at all stocks that have options. Clicking on the ticker links to a search for subreddit posts mentioning the ticker with News, DD, or Discussion Flairs. The post is updated once an hour.\n\n Last update: 16:41:28\n\n\n\n**Top 5 Stocks by % Increase -**  \n\n  \n| Ticker |  Price | Change | %Change | 52wk high |  \n| ------- | ---------- | ---------- | --------- | ---------: |  \n| [AMBA](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AMBA) | 131.81 | 28.24 | +27.27% | 137.21 |\n| OMEX | 6.4 | 0.85 | +15.32% | 8.69 |\n| [PVH](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/PVH) | 120.73 | 15.94 | +15.21% | 121.56 |\n| [FUTU](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/FUTU) | 109.38 | 14.19 | +14.91% | 204.25 |\n| ICLK | 5.52 | 0.71 | +14.76% | 19.1 |\n\n  \n**Lowest 5 Stocks by % Decrease -**  \n\n  \n| Ticker |  Price | Change | % Change | 52wk high |  \n| ------- | ---------- | ---------- | --------- | ---------: |  \n| [SPRT](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/SPRT) | 24.19 | -7.17 | -22.86% | 59.69 |\n| SY | 5.25 | -0.6 | -10.26% | 17.4 |\n| KOLD | 12.64 | -1.41 | -10.04% | 58.85 |\n| ACIU | 7.36 | -0.77 | -9.47% | 12.61 |\n| [SPRO](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/SPRO) | 17.51 | -1.74 | -9.04% | 23.64 |\n\n\n  12 hour Reddit Rankings : \n\n  Ticker | Total Posts | DD | Discussion | News | Misc.\n------|-----|-----|------|-----|-----\n[**AAPL**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AAPL)|4 |2 |0 |1 |1\n[**ARKK**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/ARKK)|4 |0 |3 |0 |1\n[**BABA**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/BABA)|3 |2 |0 |0 |1\n[**SKLZ**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/SKLZ)|3 |0 |0 |0 |3\n[**CHWY**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/CHWY)|3 |1 |0 |0 |2\n[**AMC**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AMC)|3 |0 |0 |2 |1\n[**GME**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/GME)|3 |0 |0 |1 |2\n[**A**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/A)|2 |0 |1 |0 |1\n[**RH**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/RH)|2 |1 |0 |0 |1\n[**SOFI**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/SOFI)|2 |1 |0 |1 |0\n\n\n 48 hour Reddit Rankings : \n\n  Ticker | Total Posts | DD | Discussion | News | Misc.\n------|-----|-----|------|-----|-----\n[**AAPL**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AAPL)|23 |4 |4 |5 |10\n[**BABA**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/BABA)|16 |4 |3 |2 |7\n[**SKLZ**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/SKLZ)|16 |1 |0 |0 |15\n[**AMC**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/AMC)|14 |4 |3 |3 |4\n[**GME**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/GME)|14 |4 |2 |2 |6\n[**HOOD**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/HOOD)|11 |1 |1 |3 |6\n[**MSFT**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/MSFT)|10 |0 |2 |0 |8\n[**TSLA**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/TSLA)|9 |4 |1 |0 |4\n[**CRSR**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/CRSR)|8 |1 |3 |0 |4\n[**MS**](https://www.reddit.com/r/MillennialBets/wiki/index/stocks/MS)|6 |4 |0 |2 |0",
        "subreddit": "options",
        "title": "Options Stock Ranker for Sep-01-2021",
        "url": "https://www.reddit.com/r/options/comments/pg2m5d/options_stock_ranker_for_sep012021/",
        "created": 1630557695.0
    },
    {
        "author": "babbldev",
        "created_utc": 1630967359,
        "id": "pja3dt",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Here is a list of the MOST OPTIMISTIC TICKERS/CRYPTOS for the week of (8/30 - 9/3)   \n\nNot as many cryptos on the list this week in the side of optimism but its only the first week into the month so we have lots of time still. \n\n1. [$MSI](https://twitter.com/search?q=%24MSI&amp;src=cashtag_click) Motorola Solutions \n\n2. [$QQQ](https://twitter.com/search?q=%24QQQ&amp;src=cashtag_click) Invesco QQQ \n\n3. [$WBA](https://twitter.com/search?q=%24WBA&amp;src=cashtag_click) Walgreens Boots Alliance \n\n4. [$ADA](https://twitter.com/search?q=%24ADA&amp;src=cashtag_click) Cardano \n\n5. [$PYPL](https://twitter.com/search?q=%24PYPL&amp;src=cashtag_click) PayPal \n\n6. [$GNRC](https://twitter.com/search?q=%24GNRC&amp;src=cashtag_click) Generac Holdings \n\n7. [$MSFT](https://twitter.com/search?q=%24MSFT&amp;src=cashtag_click) Microsoft \n\n8. [$ABBV](https://twitter.com/search?q=%24ABBV&amp;src=cashtag_click) AbbVie \n\n9. [$AMD](https://twitter.com/search?q=%24AMD&amp;src=cashtag_click) Advanced Micro Devices \n\n10. [$EA](https://twitter.com/search?q=%24EA&amp;src=cashtag_click) Electronic Arts \n\n11. [$CTLT](https://twitter.com/search?q=%24CTLT&amp;src=cashtag_click) Catalent Inc. \n\nSee anything on your list that you think should have been talked about more? See anything on here that you don't think should be on here? let us know! \n\n&amp;#x200B;\n\nhttps://preview.redd.it/4lqff1m7lyl71.jpg?width=829&amp;format=pjpg&amp;auto=webp&amp;s=d8a1f92d909a392bba7494f47acba626c8ecb038",
        "subreddit": "StockMarket",
        "title": "MOST OPTIMISTIC CRYPTOS/TICKERS week of (8/30 - 9/3)",
        "url": "https://www.reddit.com/r/StockMarket/comments/pja3dt/most_optimistic_cryptostickers_week_of_830_93/",
        "created": 1630996159.0
    },
    {
        "author": "jclines12",
        "created_utc": 1630699102,
        "id": "phcmd5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Really liking VIH as a potential short squeeze.\n- About 40% of float is short\n- Tiny float (only 19 million shares)\n- $10 NAV\n- 69% of float held by institutions\n- Merging with Bakkt with is backed by Microsoft and Starbucks and is 81% owned by the CEO of the NYSE\n\nPSA I own 10/15 12.5 calls",
        "subreddit": "wallstreetbets",
        "title": "Why $VIH is a short squeeze candidate",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phcmd5/why_vih_is_a_short_squeeze_candidate/",
        "created": 1630727902.0
    },
    {
        "author": "jclines12",
        "created_utc": 1630698579,
        "id": "phcgji",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Really liking VIH as a potential short squeeze.\n- About 40% of float is short\n- Tiny float (only 19 million shares)\n- $10 NAV\n- 69% of float held by institutions\n- Merging with Bakkt with is backed by Microsoft and Starbucks and is 81% owned by the CEO of the NYSE\n\nPSA I own 10/15 12.5 calls",
        "subreddit": "wallstreetbets",
        "title": "$VIH potential short squeeze candidate",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phcgji/vih_potential_short_squeeze_candidate/",
        "created": 1630727379.0
    },
    {
        "author": "jclines12",
        "created_utc": 1630699377,
        "id": "phcprh",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Really liking VIH as a potential short squeeze.\n- About 40% of float is short\n- Tiny float (only 19 million shares)\n- $10 NAV\n- 69% of float held by institutions\n- Merging with Bakkt with is backed by Microsoft and Starbucks and is 81% owned by the CEO of the NYSE\n\nPSA I own 10/15 12.5 calls",
        "subreddit": "wallstreetbets",
        "title": "Why $VIH is a short squeeze candidate",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phcprh/why_vih_is_a_short_squeeze_candidate/",
        "created": 1630728177.0
    },
    {
        "author": "Flat-Farm-8291",
        "created_utc": 1630870305,
        "id": "pijm7d",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "A company that implement AI and works with Microsoft and Adobe, based on their financial statements, revenue is increasing and new investment was there.",
        "subreddit": "wallstreetbets",
        "title": "What do you guys think about C3AI",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pijm7d/what_do_you_guys_think_about_c3ai/",
        "created": 1630899105.0
    },
    {
        "author": "tadhg8811",
        "created_utc": 1631162648,
        "id": "pkqvzz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "In April 2020, ecommerce spending exploded globally. In 8 short weeks, US ecommerce spending as a % of total retail sales grew from 16% to 27%. $SHOP and $AMZN have seen their TAM grow massively and their valuations have grown to reflect this.\n\nWhat if I told you something very similar is happening right now in enterprise SaaS?\n\nAmazingly, in 2020, cloud/SaaS spending is still only 9.1% of total global IT spend. But this in changing. Spending on  cloud/SaaS is expected to grow by 18.4% in 2021 alone.\n\nMuch in the same way that the pandemic has made ecommerce a core part of any retail company’s strategy, it has made SaaS a core part of every company’s plans.\n\nOn-premise software just doesn’t make sense in a remote-first world.\n\nJust like Amazon and Shopify have benefited from the eccommerce explosion, companies like $WDAY, $CRM, $MSFT and $OKTA will benefit from the SaaS explosion.\n\nRead more here: https://tadhg.substack.com/p/the-saas-market-opportunity-is-way",
        "subreddit": "StockMarket",
        "title": "The SaaS Explosion",
        "url": "https://www.reddit.com/r/StockMarket/comments/pkqvzz/the_saas_explosion/",
        "created": 1631191448.0
    },
    {
        "author": "ZavierKonz",
        "created_utc": 1631149867,
        "id": "pknibr",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " My portfolio is quite tech heavy right now, stocks and ETF. I do like investing in tech but I want to diversify more. I have two tax-free accounts, and I intend to keep most of these stocks and ETFs for a long period of time. Here's what I have right now:\n\nTFSA **(holding 5+ years)**\n\n9% - AAPL\n\n10% - ASTS\n\n8% - CRSR\n\n17% - MSFT\n\n17% - QQQ\n\n15% - SMH\n\n24% - VGT\n\nLike I said, super tech heavy. I'm also aware of the big overlap. This is an account I'm willing to take more risks with. Looking to add some clean energy, cyber security and other \"future tech\" ETFs. Any recommendations?\n\nRRSP **(holding 30+ years):**\n\n40% - SCHD\n\n40% - VYM\n\n20% - VOO\n\nThis is very focused on dividends, since this account is tax-free for gains and dividends, and I'm not willing to take as much risk with this one. Any thoughts?\n\nStill very new to stocks and ETFs, looking for any type of feedback.",
        "subreddit": "CanadianInvestor",
        "title": "Need advise on my tech heavy portfolio",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/pknibr/need_advise_on_my_tech_heavy_portfolio/",
        "created": 1631178667.0
    },
    {
        "author": "PositiveKarmaaa",
        "created_utc": 1631018821,
        "id": "pjmdm4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "What’s up my stoner friends. I re-rolled all the highlights from last week to this Monday on the stock market.  \n\nNon-farm data came out last Friday. It brought some concerns to the market, but I’m gonna stick to my plan and keep buying more promising stocks. \n\n# Highlights:\n\n# 1. Non farm data2. Reddit IPO  3. Windows11 launches on 10/5\n\n\\-\n\n# Non farm payrolls out \n\nThe rising of Delta cases caused a dramatic drop - the monthly employment numbers went WAY lower than expected: 23.5k VS 72.5K, the unemployment rate also dropped to 5.2% compared to July.  \n\nMany experts consider this a signal of postponing “ the taper,” which is a clear sign of slower growth along with uncertainty in the market. However, as wages and unemployment rate shows, it’s not as bad as it looks. \n\nIn this case, I remain bullish in the short run. \n\n\\-\n\n# Reddit IPO = WSB IPO? \n\nThe birthplace of our beloved MEME stock, Reddit, is seeking to hire advisers for their IPO next year to GIT MORE $$$$. Targeting a 15$ billion valuation when listed on the stock market. I’m expecting mayhem on meme stocks a week before Reddit’s IPO.  We’ll sit and wait before the show begins.  \n\n\\-\n\n# Windows 11 is one month away\n\nThe long awaited new windows OS will be released on October 5th as MSFT recently announced. It will be a free upgrade for you as long as you have a legit windows 10 in your devices. \n\nThat being said, as usual, the upgrade will roll out in phases - current windows 10 users will likely be offered an upgrade weeks after new products. Analysts estimate it will contribute 19% of MSFT’s profit for 2021.  \n\nI personally am a big fan of MSFT in terms of their business model and outlook. New OS seems pretty decent and clean. So I will be adding more MSFT into my long term portfolio. Again. 📷\n\nIf you feel the same way about Windows11, also checkout my take on MSFT here:   \n\n\nAlthough it won’t be as nice and peaceful as last week, I’m still expecting slightly bullish on the market this week ahead overall.  Uncertainty isn’t a bearish sign in this case as nothing fundamentally impacts the market in the short run.   \n\n\nThanks for your time, good luck and stay high.",
        "subreddit": "StockMarket",
        "title": "1 min read - Smoking-Highlight of last Week (8/30~9/6)",
        "url": "https://www.reddit.com/r/StockMarket/comments/pjmdm4/1_min_read_smokinghighlight_of_last_week_83096/",
        "created": 1631047621.0
    },
    {
        "author": "Prize_Cancel9331",
        "created_utc": 1630764082,
        "id": "phs2yn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Netflix, even though it didnt break 600 yesterday, its certainly still bullish and especially after being in a channel for the last 7 months, i think its due for a break out relatively soon. Also with the miss in jobs and more stimulus entering the market as well as the tapering not starting until November (probably) Id say this next week is a break out week . Now i could be completely wrong and netflix could again go back down to low 500s but idk TA showed a strong support at 580s. \n\nI dont have any positions in it yet but plan on opening a call.\n\nModerna , on the weekly chart it shows that the stock has been respecting the lower 300s support and just now is breaking out of that 3ish week long channel , we will see what happens next week but over all im bullish on it after that break out, i have a few calls for next week and hoping they print.\n\nMsft, I  love this stock, one thing about it is that after it breaks out it consolidates for a bit before breaking out again. Its been coslidating around 300s for a while now so im expecting a break out soon. Plan on opening a position in it after seeing next weeks price action.\n\nFacebook \\^ same applies as msft.\n\nGoogle is a monster expecting it to probably each 3k this week if im being honest, usually after a pull google hits new highs and it did have a pull back this friday so yeah.\n\nOther than that i really have nothing else to say except whats yalls views on these stocks? Also what do yall use for TA? I tend to use 5,20,50,200 emas , vwap and the regular trend lines on the daily and weelky chart how about yall?",
        "subreddit": "stocks",
        "title": "My views on some stocks",
        "url": "https://www.reddit.com/r/stocks/comments/phs2yn/my_views_on_some_stocks/",
        "created": 1630792882.0
    },
    {
        "author": "SprinklesCharacter65",
        "created_utc": 1630514152,
        "id": "pfxl7x",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "MSFT has a chance of breaking the 304.19 barrier",
        "url": "https://kaizenn.me/analisis-del-precio-msft-tiene-posibilidades-de-romper-la-barrera-de-los-30419",
        "created": 1630542952.0
    },
    {
        "author": "dhpw2",
        "created_utc": 1630494145,
        "id": "pfrkoo",
        "num_comments": 506,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of ESG investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "stocks",
        "title": "Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/stocks/comments/pfrkoo/cathie_woods_ark_files_for_new_transparency_etf/",
        "created": 1630522945.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1630500205,
        "id": "pft42l",
        "num_comments": 167,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of ESG investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "investing",
        "title": "Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/investing/comments/pft42l/cathie_woods_ark_files_for_new_transparency_etf/",
        "created": 1630529005.0
    },
    {
        "author": "dhpw2",
        "created_utc": 1630494457,
        "id": "pfrncw",
        "num_comments": 148,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of Environmental, Social and Governance  investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "wallstreetbets",
        "title": "Another One! Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfrncw/another_one_cathie_woods_ark_files_for_new/",
        "created": 1630523257.0
    },
    {
        "author": "MVST_100_OR_BUST6",
        "created_utc": 1630500749,
        "id": "pft9ja",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "This makes zero sense to me. I was expecting red but a 20% dump is insane given its $70 ATH. The confusion is that for the past several days/weeks people have been warning about this date for a long time. So effectively it should have been priced in with all the weak hands leaving, and for at least the option IV should have increased yet it wasnt, and now puts more than doubled. Also at times when the market is overly sure of event X going in Y direction, the absolute opposite happens. Its pretty fucking wild that we pretty much all called it. Usually that never happens. Anyone who bought puts was granted the easiest play ever. \n\nYou can claim its the PIPE dumping but I dont think the Saudis are stupid enough to dump all their shares in pre-market. There are no short shares available. It seems like retail is all selling NOW despite being warned extensively.",
        "subreddit": "SPACs",
        "title": "Why is LCID Tanking?",
        "url": "https://www.reddit.com/r/SPACs/comments/pft9ja/why_is_lcid_tanking/",
        "created": 1630529549.0
    },
    {
        "author": "WhatsFoodG",
        "created_utc": 1630498326,
        "id": "pfslld",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Listen up you autistic retards this shit is serious. Coinbase has basically been hoeing hardcore since its direct listing in April. This bitch has been getting reamed for 4 months BUT \\*cue picture\\* let's take a look at the chart and see what's up\n\n&amp;#x200B;\n\n[COIN Daily Chart](https://preview.redd.it/x6qvq5tiuvk71.png?width=2358&amp;format=png&amp;auto=webp&amp;s=e3eec4721d35b1315ec0be5e51129e93926fc00f)\n\nNow i ain't no fucking artist and i may have a learning disability but I know a cup when i see one and if you look at this chart, even in ur peripheries you'll notice a small cup and handle that's formed in between the support lines, you'll also notice the middle support line recently did an r/S flip i.e. went from being a resistance line to support line.\n\n&amp;#x200B;\n\nNow with the small cup in place it may be high time for Coinbase to continue this trend up and fill up the bigger cup by flying back to the 420-450 range. Also the velocity at which alt currencies move if there is a decent rally in the next few weeks, there's potential this sees an even bigger push to go back up where it came from. The MACD looks bullish with potentially indicating this reversal will become a rally. \n\n&amp;#x200B;\n\n However, the fundamentals are also insanely undervalued right now. I'm talking this thing has a mufuckin current PE ratio of 28 only considering the first 2 quarters this year i.e. NOT COUNTING any estimates from q3 and q4 this year. I'm talking they made rev of about a billion dollars in FY2020 with about 350 mill in net income, Q1 2021 they made over 1.6 billion in revenue and more than doubled net income relative to the ENTIRE PREVIOUS YEAR.  Q2 2021 they made revenue of 2.23 billion netting 1.6 fucking billion in a damn quarter. They're literally reaching exponential growth as we speak and lets be honest the industry they're in is primed to grow substantially in the foreseeable future. Now if you look at their guidance for q3 and q4 they are not expecting to beat the net income of q2 but they also expect continued profitability and could potentially beat forecasts IF certain coins that are traded on their platform rally hard. For comparison, Square is trading at a FORWARD PE (2024) of 73, PayPal FORWARD PE 2024 of 32, I could go on and on. So really their current annual PE is considerably less than 28 once earnings come in for q3 and q4.\n\n&amp;#x200B;\n\nThis is a cash cow of a company fundamentals and technicals seem to be aligning nicely. I think you can't go wrong with far out leaps however you must know that I am retarded and you would be an even bigger retard if you listened to me, jk you prolly can't even read so I'm not worried.\n\n&amp;#x200B;\n\nTL:DR COIN to the moon fam!!!\n\nEdit: I’m not currently in a position but considering loading the $300 calls exp dec 21",
        "subreddit": "wallstreetbets",
        "title": "Code Green: COIN Breakout Imminent!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfslld/code_green_coin_breakout_imminent/",
        "created": 1630527126.0
    },
    {
        "author": "OnlyOneBetter",
        "created_utc": 1630498039,
        "id": "pfsiyq",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": " Dear \\*\\*\\*\\*,\n\nIn response to new Financial Industry Regulatory Authority (FINRA) rules related to pattern day trading, we are updating our policy (which will go into effect on or about September 14, 2021). Because your account was noted for pattern day trading in the past year, we wanted to make sure you're aware of the change and how it could impact your account.\n\n**Understanding the new policy.** In line with the new FINRA rules, our new policy allows for only one flag removal within the life of an account. This means that if your account is flagged again in the future, the flag cannot be removed. Previously, our policy allowed the flag to be removed from an account up to three times within a rolling year before the account was flagged permanently.\n\n**What if your account is flagged?** If your account is flagged for pattern day trading, you'll have to maintain a minimum equity balance of $25,000 at the start of each trading day to continue day trading. If you place a day trade in a flagged account with a balance under $25,000 in equity, you'll be restricted to closing transactions until you bring your equity above $25,000.\n\nTo learn more about the pattern day trading rule and how to avoid breaking it, please view our [FAQ](https://www.tdameritrade.com/why-td-ameritrade/contact-us/top-faqs.html) or [*The Ticker Tape*](https://tickertape.tdameritrade.com/trading/avoid-violating-pattern-day-trader-rule-18005).\n\n**Questions? We're here for you.** If you have questions or if we can help you with this process in any way, please don't hesitate to let us know. Just reply to this message.\n\nSincerely,\n\nTD Ameritrade Client Services",
        "subreddit": "wallstreetbets",
        "title": "Our new pattern day trading policy* may affect how you trade. - Just got this yesterday from TD Ameritrade - Thankfully I am now over the PDT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfsiyq/our_new_pattern_day_trading_policy_may_affect_how/",
        "created": 1630526839.0
    },
    {
        "author": "saunders1987",
        "created_utc": 1630491227,
        "id": "pfqwfg",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Hi all.\n\nIf I close a position in say GME at 100k and that will now be sitting in my broker account. And I decide to withdraw that to my bank account, then the next day I close another position at say 200k, then withdraw that, and so on and so on. \nDo I pay capital gains on every transaction I take out, or is it the total amount I gain in the year? Like if I close all positions for 100m and take it all out in separate amounts, do I pay in 1 big lump, or I  individual withdrawals? \n\nHope this makes sense!",
        "subreddit": "investing",
        "title": "Capital gains tax question form UK",
        "url": "https://www.reddit.com/r/investing/comments/pfqwfg/capital_gains_tax_question_form_uk/",
        "created": 1630520027.0
    },
    {
        "author": "Dwarfy_8395",
        "created_utc": 1630496425,
        "id": "pfs41c",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I've been checking the 212 Trading application ever since they introduced their new T&amp;C and all of my shares are being lent out 100% every time I check.\n\nhttps://ibb.co/5xK7yV1\n\nThis month I receive their statement and it shows that 0% of my shares are being lent out.\n\nhttps://ibb.co/bmKWKg8\n\nI feel this behavior is suspicious and I've contacted their customer care, they've escalated the issue with one of their team and I should receive and email in the coming days.\n\nIs there anything I can do about this? Is this legal? Appreciate anyone that understands more about this stuff. Hopefully this is a correct sub since I fail the requirements for anywhere else",
        "subreddit": "investing",
        "title": "212 Trading lending shares but now showing on statements.",
        "url": "https://www.reddit.com/r/investing/comments/pfs41c/212_trading_lending_shares_but_now_showing_on/",
        "created": 1630525225.0
    },
    {
        "author": "exploding-implosion",
        "created_utc": 1630495769,
        "id": "pfrygj",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I’ve been here browsing you guys’ posts for some months now. This has led to me becoming very interested in this field. How would you guys recommend getting started for a typical noob with minimal Robinhood experience? Any recommended trading platforms or individuals who make informative blogs?\n\nI realize nobody is immune to taking an L in this line of business, but I’d just like to get aimed in the right direction and hopefully gain some off my investments to put away for the future. Let me know what you guys think, if I’m asking in the wrong place just let me know!",
        "subreddit": "wallstreetbets",
        "title": "Getting started",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfrygj/getting_started/",
        "created": 1630524569.0
    },
    {
        "author": "WallPuzzleheaded8134",
        "created_utc": 1630497474,
        "id": "pfsdee",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Citadel trying to slip away quietly.  Silly rabbit,  trix are for kids\n\nhttps://fxnewsgroup.com/forex-news/retail-forex/citadel-securities-seeks-to-nix-short-squeeze-conspiracy-allegations/\n\nApes need to stand watch and cover the gaps in a really long defense wall.  Part of this long unnecessary post is me filling in because of the mods.  When reading this article this morning, noticing it has not been shared on any threads yet, I realized these slimmy players are in the business of letting little guys like us win battles but lose the war.  Can we make a few bucks sure, do they really care, no,  what they really want to make sure of, is that we do not disrupt the money printing machine scheme, sadly on the backs of unsuspecting victims,  that like before,  and now again,  will ultimately carry the bag. Let's make sure to stand the line and hold these bad actors accountable. \n\nKeep digging,  keep studying,  keep turning those shiny smooth 🧠 surfaces into wrinkles that look like g m e chart. Keep sniffing green crayons",
        "subreddit": "wallstreetbets",
        "title": "Citadel Securities seeks to nix “short squeeze” conspiracy allegations",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfsdee/citadel_securities_seeks_to_nix_short_squeeze/",
        "created": 1630526274.0
    },
    {
        "author": "phoenixODST",
        "created_utc": 1630479907,
        "id": "pfolow",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Came into some hardship about a month ago and was forced to sell some shares of a company I didn’t wanna sell. Being that I’m down in said company I sold some at a loss. I still have a large position but being that I did sell some and got through my life dip and I bought into myself and made a large profit, I wanna put it back into my stock. It’s been almost 2 months now I know it’s either 30-60 days but It always seems that TD Ameritrade shoves it right up into my little hole and tickles my guts with this. It seems no matter how many YouTube videos I watch I’m still left confused. Can some explain to me like I’m 5 years old and can’t color within the lines how and when I can buy back into this company without my buyin price hitting the atmosphere. plz and spank you.",
        "subreddit": "StockMarket",
        "title": "Wash sale",
        "url": "https://www.reddit.com/r/StockMarket/comments/pfolow/wash_sale/",
        "created": 1630508707.0
    },
    {
        "author": "MrStonks33",
        "created_utc": 1630491018,
        "id": "pfquol",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "The case for a horse... that works.\n\nWKHS may be the best kept non-secret stock on the market right now.\n\nLong story short. EV is big, EV is growing. Why not electric deliver vehicles? A company who ALREADY has EV delivery trucks IN HAND is slowly growing. Their stock however, is falling. Buy Low Sell High. \n\nThe stock is heavily shorted, and the shorts have come very close to burying this old horse into the ground. Not looking good. The shorts gained even more ground when WKHS lost the USPS truck contract. We'll get to that in a minute.\n\nHere's the good news. The stock is 100% utilized. It has a low float, it has a low market cap, and THEY ALREADY HAVE A PRODUCT IN HAND WAITING TO BE PURCHASED. Here's the best part. They made claims of corruption against the U.S. Government, USPS, and Oskosh when they lost the USPS contract. USPS and Oshkosh tried to get the case thrown out, but the judge denied that motion and is now allowing arguments in mid-Sept.\n\nWith shorts out the ass, and the stock 100% utilized. This is the equivilent of a home filling up with natural gas. \n\nAll you need is a spark, aka a judge siding with WKHS in arguments.\n\nThis is not a pump and dump, this stock was trading between 15 and 40 until the USPS contract fiasco.\n\n52 week LOW HIGH 7.07-42.96 (Price as of post stands at 9.90)\n1.19 B market cap\n123.95m shares\n36% shares held by institution.\n38% short interest\n\nYou do you.\nI am just a retard.\nNot financial advice.\n\nCredit Goes To Nick Quattrini for the DD. I’m just sharing.",
        "subreddit": "wallstreetbets",
        "title": "WKHS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfquol/wkhs/",
        "created": 1630519818.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1630500331,
        "id": "pft5c8",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of sustainable investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "wallstreetbets",
        "title": "Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pft5c8/cathie_woods_ark_files_for_new_transparency_etf/",
        "created": 1630529131.0
    },
    {
        "author": "opticalpuss",
        "created_utc": 1630493767,
        "id": "pfrh5k",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I'm a highly paid salary executive who loves nothing more than chicken sandwiches and large soft drinks. I have noticed more and more frequently that when I pull into my favourite drive through in my Tesla to first complain about mask mandates then order a bourbon bacon cheeseburger with no bourbon because I'm a recovering addict that some locations have closed or have limited staff.\n\nThese staffing shortages came on recently due to so many free handouts that the lazy employees don't feel like working. When real Americans were true and proud, work was good and I got to yell at the workers and they couldn't do shit about it. And now free money has them lazy.\n\nGo ahead and remove my post but I say short these companies now because when I finally did get my sandwich I'm pretty sure it did have bourbon in it so now I went to the liquor store and bought a handle of Jack Daniels and am so enraged I might call corporate on my land line to complain. I might even sue them.\n\nBefore I call I'm going to get good and gacked out so they can feel my rage through the phone. These fucking lazy FUCKS!\n\nMASK MANDATE CAN KISS MY ASS IM NOT GETTING THE VACCINE YOU FUCKING SANDWICH SLINGING BITCH MAKE MY SANDWICH WHAT THE FUCK! MANDATES ARE FOR GAY MEN! MANDATE IS WHAT YOURE GONNA HAVE IN PRISON WHEN MY LAWYER PUTS YOUR ASS IN PRISON FOR FUCKING UP MY ORDER YOU FUCKING SANDWICH FUCK! MAKE MY SANDWICH!  \n\nTake a downer.\n\nAll time highs for Yum brands yet everyone is quitting after being underpaid and over-stressed. Wave 5 or whatever this is has the stressors going back up. People feel the need to express their political frustrations to the counter sandwich maker. GrubHub adds more stress on the counter sandwich maker gang. We've all worked at Wendy's and we feel for them.\n\nEarnings are expected to go up. Everyone on the street has them being successful as far as I can tell from my five minutes of googling and review of yahoo finance.\n\nMy positions: I'm not trading I can't trade I'm not approved for options and I don't have Robinhood. I can't believe you've read this far, honestly. I clicked on DD because I like big titties.\n\nKeywords: Yolo, GME, Tenders, Moon, 🚀🚀🚀\n\nFurther: all the hedge funds are expecting big things from Yum. Let's get those hedgies!",
        "subreddit": "wallstreetbets",
        "title": "The Wendy's Counter Sandwich Guy Keeps Fucking Up My Order",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfrh5k/the_wendys_counter_sandwich_guy_keeps_fucking_up/",
        "created": 1630522567.0
    },
    {
        "author": "bigheb13",
        "created_utc": 1630501305,
        "id": "pftfm8",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "EEMD NOW",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pftfm8/eemd_now/",
        "created": 1630530105.0
    },
    {
        "author": "trevortins",
        "created_utc": 1630484987,
        "id": "pfpmlj",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I currently use wealthsimple trade and have a Canadian dividend portfolio. I’ve wanted to invest in U.S stocks for a while but have stayed away from them due to fees. Now that national bank offers commission free trading and doesn’t charge you to convert to US dollars is it worth it to switch? I currently have a tsfa and would just need to transfer over the account.",
        "subreddit": "CanadianInvestor",
        "title": "Should I switch to National Bank for my broker and leave wealth simple trade?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/pfpmlj/should_i_switch_to_national_bank_for_my_broker/",
        "created": 1630513787.0
    },
    {
        "author": "OnlyOneBetter",
        "created_utc": 1630497921,
        "id": "pfshuc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "Our new pattern day trading policy* may affect how you trade. - Just got this yesterday from TD Ameritrade - Thankfully I am now over the PDT",
        "url": "https://www.reddit.com/r/options/comments/pfshuc/our_new_pattern_day_trading_policy_may_affect_how/",
        "created": 1630526721.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1630500094,
        "id": "pft30p",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of ESG investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "wallstreetbets",
        "title": "Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pft30p/cathie_woods_ark_files_for_new_transparency_etf/",
        "created": 1630528894.0
    },
    {
        "author": "dhpw2",
        "created_utc": 1630494189,
        "id": "pfrl31",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of ESG investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "wallstreetbets",
        "title": "Another One! Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfrl31/another_one_cathie_woods_ark_files_for_new/",
        "created": 1630522989.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1630494015,
        "id": "pfrjcz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "The meme stock scheduled posts will run Mon to Fri and won't be a sticky; you're probably seeing this because automod sent you here or you woke up early Wall St time; good morning!\n\n------\n\nWelcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a day.  I get it, you want to talk about what's popular, what's hot, and that 1.. single.. stock you like.. well here you go!  Some helpful links just for you:\n\n* [Previous meme stock threads](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%28common+OR+meme%29&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)\n* [Previous discussions on overlooked (and possibly undervalued) stocks](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoverlooked&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)\n* [General discussions](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Adiscussion&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)\n* [The **original GME megathread**](https://www.reddit.com/r/stocks/comments/layb68/rstocks_gme_megathread/) with a ton of useful information\n* [Use Finviz for aggregated news on your favorite stock](https://finviz.com/quote.ashx?t=gme)\n\nAn important message from our mod u/TCGYT [regarding meme stocks.](https://www.reddit.com/r/stocks/wiki/meme-stocks-warning)\n\nLastly if you need professional help:\n\n* Problem Gambling:  Call/Text: 1-800-522-4700 or [chat online now.](https://WWW.NCPGAMBLING.ORG/CHAT)\n* Crisis Hotline (24/7): 1-800-273-TALK (8255) (Veterans, press 1) or Text “HOME” to 741-741",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Thread on Meme Stocks Wednesday - Sep 01, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/pfrjcz/rstocks_daily_thread_on_meme_stocks_wednesday_sep/",
        "created": 1630522815.0
    },
    {
        "author": "WhatsFoodG",
        "created_utc": 1630497540,
        "id": "pfsdzj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Listen up you autistic retards this shit is serious. Coinbase has basically been hoeing hardcore since its direct listing in April. This bitch has been getting reamed 4 and a half months and counting but \\*cue picture\\* let's take a look at the chart and see what's up\n\n&amp;#x200B;\n\n[CB Daily Chart](https://preview.redd.it/aqjaxo37nvk71.png?width=2358&amp;format=png&amp;auto=webp&amp;s=478a56b2d64a8f5278121224d85d13646b93ade2)\n\nNow i ain't no fucking artist and i may have a learning disability but I know a cup when i see one and if you look at this chart, even in ur peripheries you'll notice a small cup and handle that's formed in between the support lines, you'll also notice the middle support line recently did an r/S flip i.e. went from being a resistance line to support line.\n\nNow with the small cup in place it may be high time for Coinbase to continue this trend up and fill up the bigger cup by flying back to the 420-450 range. Also the velocity at which alt currencies move if there is a decent rally in the next few weeks, there's potential this sees an even bigger push to go back up where it came from. The MACD looks bullish with potentially indicating this reversal will become a rally. \n\n However, the fundamentals are also insanely undervalued right now. I'm talking this thing has a mufuckin current PE ratio of 28 only considering the first 2 quarters this year i.e. NOT COUNTING any estimates from q3 and q4 this year. I'm talking they made rev of about a billion dollars in FY2020 with about 350 mill in net income, Q1 2021 they made over 1.6 billion in revenue and more than doubled net income relative to the ENTIRE PREVIOUS YEAR.  Q2 2021 they made revenue of 2.23 billion netting 1.6 fucking billion in a damn quarter. They're literally reaching exponential growth as we speak and lets be honest the industry they're in is primed to grow substantially in the foreseeable future. Now if you look at their guidance for q3 and q4 they are not expecting to beat the net income of q2 but they also expect continued profitability and could potentially beat forecasts IF certain coins that are traded on their platform rally hard. For comparison, Square is trading at a FORWARD PE (2024) of 73, PayPal FORWARD PE 2024 of 32, I could go on and on. So really their current annual PE is considerably less than 28 once earnings come in for q3 and q4.\n\nThis is a cash cow of a company fundamentals and technicals seem to be aligning nicely. I think you can't go wrong with far out leaps however you must know that I am retarded and you would be an even bigger retard if you listened to me, jk you prolly can't even read so I'm not worried.\n\nTL:DR COIN to the moon fam!!!",
        "subreddit": "wallstreetbets",
        "title": "Code Green: Coinbase breakout is imminent!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfsdzj/code_green_coinbase_breakout_is_imminent/",
        "created": 1630526340.0
    },
    {
        "author": "valeriedulaxo",
        "created_utc": 1630480578,
        "id": "pfoqsz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "literally hornyyyy as helll , my pussy is throbbing for some dick lol . I don’t want to be alone right now but if i could have it my way i would be getting dick as of now . i  swear i day dream daily about a big cock being rammed in my ass , but i have never tried anal before 🤔 wouldn’t mind giving it a shot though lol . but yeah , if any of you guys see this right now i need some sexual assistance because my pussy is aching for some dick , the second best thing would be to atleast speak with someone who can get me off as i help them get theirself off as well 🤷🏽‍♀️😍💦",
        "subreddit": "wallstreetbets",
        "title": "21 f . Sextttt meeeee 😩",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfoqsz/21_f_sextttt_meeeee/",
        "created": 1630509378.0
    },
    {
        "author": "PodejrzaneAmogus",
        "created_utc": 1630485232,
        "id": "pfpo91",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "u/PodejrzaneAmogus is hot, buy now !",
        "url": "https://i.redd.it/1g3l9p83suk71.png",
        "created": 1630514032.0
    },
    {
        "author": "SituationLive4406",
        "created_utc": 1630501223,
        "id": "pftejg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\n22nd Century (XXII) Announces the Completion of Its Trifecta of Market Sectors with Tobacco, Cannabis, and Now Hops\n\nMassive IP portfolio on the Tobacco and Cannabis Plants. **Now hops also?** I would say they have all major areas covered. (I will dive more into that later) no pun intended.\n\nGood day everyone,\n\nWe are updating coverage on **22nd Century Group, Inc. (NASDAQ: XXII),** a leading plant-based, biotechnology company that is focused on tobacco harm reduction, very-low nicotine content tobacco, and hemp/cannabis research.\n\nCurrent price $3.57/share (at market close Aug. 31, 2021)\n\nOn August 16, 2021, XXII moved to the NASDAQ Exchange from the NYSE-American. The company participated in the closing bell ceremony on the same day. The company believes the move will increase their visibility and exposure to investors.\n\nWhen I look at [the company stock chart](https://stockcharts.com/h-sc/ui?s=XXII), I see how XXII has come off recent dips this year. On April 26th, the shares peaked at $6.07, then dipped to $3.56 on May 13th. On July 1st the shares had climbed back to $4.63 before consolidating to today’s level. XXII shares have now crossed their 200 DMA of $3.34 and are **approaching their 50 DMA of $3.67/share in a bullish manner**.\n\nI often note insider holdings as a value metric because the insiders have a vested interest in the company’s success. Insider ownership isn’t very high (under 3%) at XXII, but the institutional ownership (all data per YF) is at 36.4% of the outstanding shares. **Some of the big guns are holding XXII shares like Blackrock (5.99%) and Vanguard (4.68%). ETF Managers Group is holding 7.38% of the company’s shares.** Hedge funds prefer the companies they invest in to perform sooner rather than later.\n\nWhen we last covered XXII in July, we talked about the company’s trifecta of core products, tobacco, cannabis, and an unknown third leg. I spent some time trying to figure out what that third product was going to be. Since XXII was already in the tobacco and cannabis sectors I thought the new market would be psilocybin. Boy was I wrong. While psilocybin is an exciting and developing market, it is still relatively small and in it’s infancy. XXII doesn’t chase small markets.\n\nIn a [letter to shareholders](https://finance.yahoo.com/news/22nd-century-group-enters-global-132000137.html) published Monday, August 30th, CEO James Mish said “I am proud to announce our third plant-based franchise – the global **specialty hops market**. Like our existing franchises, the hop plant market is ripe for disruption and offers opportunities for 22nd Century to provide unique and significant competitive advantages to commercial partners. The addition of hops, a critical input for the $500 billion global brewing industry as well as a growing source of medically-important molecules, expands our total addressable markets to an estimated $1.3 trillion.”\n\n95% of all hops are used to make beer. The rising demand for microbrew and craft beers is driving the specialty hops market where distinctive flavors, aromas and nutritional uses are important in creating unique and differentiated products. The XXII R&amp;D program objectives include creating new proprietary hop plants and valuable IP using their know-how and technologies, utilizing double haploids, gene-editing, molecular breeding, and other non-GMO technology.\n\nXXII is establishing a new subsidiary in the Netherlands, 22nd Century Group Europe B.V., to open new revenue opportunities in hops, as well as serve their tobacco and hemp/cannabis plant franchises through an expanded global footprint.\n\nXXII is on the move now with a move toward globalization and a new product pipeline that may generate revenues quickly. The demand for proprietary, specialized, non-GMO hops is high and XXII has the tools to provide them.\n\n7/23/2021 Cowen Initiated Coverage Outperform $5.00\n\n**On the tobacco front**, earlier in August, the company announced that they were highly confident their MRTP (modified risk tobacco products) application has completed the FDA’s scientific review process and is now in the documentation process, the final stage before the FDA announces its decision. While the company’s VLN cigarettes were approved for sale in 2019, this important designation will allow 22nd Century to communicate key features of VLN® King and VLN® Menthol King, including the headline claim of “95% less nicotine.” VLN® tastes, smells, and smokes like a conventional cigarette. Both the FDA and the Biden administration have been looking for ways to curb illness, and consequently healthcare expenses, associated with cigarette smoking.\n\n**On the cannabis front**, XXII has been building its network of partnerships to maximize the upstream segment of the cannabinoid value chain since 2019. Components of 22nd Century’s proprietary value chain include: plant profiling tailored to the needs of customers (CannaMetrix), genetics to deliver differentiated traits to maximize yield of a specific cannabinoid or deliver a certain taste or fragrance profile (KeyGene), and commercial-scale plant breeding and cultivation of disruptive plant lines as well as year-round ingredient extraction/purification (Extractas Bioscience, Sawatch Agriculture, Folium Botanical, Aurora Cannabis, Needle Rock Farms, and Panacea).\n\nThe XXII “trifecta” of market sectors it participates in is now complete with tobacco, cannabis, and hops. As CEO Mish pointed out above, these three sectors address an **estimated market of $1.3T**. Sometimes we get lost with those numbers but each **1% of a $1.3T market potential is $13B**.\n\nStay tuned for more coverage on 22nd Century Group coming very soon.\n\n&amp;#x200B;\n\nAbout 22nd Century Group, Inc.  \n22nd Century Group, Inc. (Nasdaq: XXII) is a leading plant biotechnology and intellectual property company focused on improving health and wellness through plant science. 22nd Century uses modern plant breeding technologies, gene-editing, and molecular breeding to deliver value to its customers in the life science and consumer products industries by creating new, proprietary tobacco, hemp/cannabis and hop plants with optimized alkaloid and flavonoid profiles as well as improved yields and valuable agronomic traits. 22nd Century was founded to build intellectual property related to nicotine biosynthesis in the tobacco plant and to commercialize its proprietary reduced nicotine content (RNC) tobacco plants, which have become the cornerstone of FDA’s comprehensive plan to address the enormous amount of death and disease caused by addiction to smoking. **The Company has also begun to leverage its plant science expertise and existing partnerships to create and commercialize new, proprietary hemp/cannabis and hop plants to optimize their genetics and create valuable new intellectual property.**\n\n[Privacy policy and disclaimer](https://mailchi.mp/tradersnewssource/exciting-report-in-a-hot-sector-coming-tomorrow-649728?e=[UNIQID])",
        "subreddit": "weedstocks",
        "title": "Hundreds of patents for gene-editing on the Cannabis Plant (XXII)",
        "url": "https://www.reddit.com/r/weedstocks/comments/pftejg/hundreds_of_patents_for_geneediting_on_the/",
        "created": 1630530023.0
    },
    {
        "author": "Golfman74",
        "created_utc": 1631026635,
        "id": "pjoojd",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Skyworks (SWKS) Yolo - I like the stonk",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pjoojd/skyworks_swks_yolo_i_like_the_stonk/",
        "created": 1631055435.0
    },
    {
        "author": "Golfman74",
        "created_utc": 1631026496,
        "id": "pjomv9",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Skyworks (SWKS) Yolo",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pjomv9/skyworks_swks_yolo/",
        "created": 1631055296.0
    },
    {
        "author": "Golfman74",
        "created_utc": 1631026778,
        "id": "pjoq67",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Skyworks (SWKS) Yolo - I like the stonk",
        "url": "https://www.reddit.com/gallery/pjoq67",
        "created": 1631055578.0
    },
    {
        "author": "marlinmarlin99",
        "created_utc": 1630695333,
        "id": "phbfst",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": " \n\nBased in Tel-Aviv, Israel, REE  Automotive has managed to stay out of consumer-facing EV news because  its tech has mostly been aimed at other manufacturers, with its role  centered on that of a developer and supplier. Its scheduled  establishment of a US foothold should bring it more publicity, landing  in a city that is rapidly becoming an EV tech hub.\n\nIn  the EV industry and start-up world**, REE is arguably best known for  skateboard platform**s, with the company's calling card being the  industry's flattest EV platform. Dubbed REEcorner, the platform packs  the powertrain, steering, suspension and braking components into the  arch of the wheel, **offering other automakers a ready architecture on  which many different types of vehicle bodies can be fitted.** The compact  module between the chassis and the wheel, therefore, is designed to be  scalable and modular—what the company calls \"agnostic\" to the design and  size of the final vehicle.\n\nThe  **planned Austin facility** will include an integration center, the company  says, that will offer REE's technology to future and current partners in  North America, including Magna International, allowing for the  construction of prototypes.\n\nREE  Automotive has been developing EV chassis that combine the powertrain,  steering, suspension, and braking into a slim platform.\n\nThe  platforms are designed to be scalable and modular, suitable for  vehicles with all types of bodies and different sizes and weight  classes.\n\nREE Automotive will set up US headquarters in Austin, Texas, which is already a tech hub, to work with partners in the US.\n\n**Catalyst:**\n\n# REE is about to participate in a series of conferences starting next week which will provide a huge bump to the price.\n\n1. Cowen's  4th Annual Global Transportation &amp; Sustainable Mobility  ConferencePresentation scheduled for Thursday, September 9 at 9:20am ET  Register to webcast\n2. Morgan Stanley Virtual 9th Annual Laguna Conference Tuesday, September 14\n3. Evercore ISI Autotech &amp; AI ForumPresentation scheduled for Wednesday, September 22 at 8am ET Register to webcast\n4. DA  Davidson 20th Annual Diversified Industrials &amp; Services Conference  Presentation scheduled for Thursday, September 23 at 11am ET Register to  webcast",
        "subreddit": "wallstreetbets",
        "title": "$REE Automotive Catalyst ..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phbfst/ree_automotive_catalyst/",
        "created": 1630724133.0
    },
    {
        "author": "cru3211",
        "created_utc": 1630607844,
        "id": "pgnvma",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Matterport will create a digital clone of our world for the metaverse.\n\nBefore I explain how, check out my previous DD posts for some context.  \n[MTTR Bringing 3D Photogrammetry Experiences](https://www.reddit.com/r/wallstreetbets/comments/ou2ap9/mttr_bringing_3d_photogrammetry_experiences_to/)  \n[MTTR Explosive Potential](https://www.reddit.com/r/wallstreetbets/comments/p3469k/mttr_update_explosive_avenues_of_potential/)\n\nNow, you’re probably wondering “What is the metaverse u/cru3211?”\n\nLet me tell you.\n\n# The Metaverse\n\nThe **metaverse** is a paradigm shift in the way we organize ourselves as a society. It’s an evolutionary embodiment of technology &amp; the internet. It’s commonly envisioned as a “second layer” to our world. Sort of like… a virtual clone of it… that’s digitized. See where this is going?\n\nThis is the **spatial web**. It represents an emerging three-dimensional web experience. It’ll blow the old internet out of the water.\n\nresearch: metaverse, web 3.0, and spatial web for more insights.\n\nMSG me and I’ll ramble more about the metaverse. For now, just understand that it’s an inevitable innovation that will see widespread growth within the next decade. Matterport is likely (but not guaranteed) to be a part of this evolution.\n\n# Government Contract\n\nMatterport has entered the public sector to digitize the valuable assets of the US government.\n\n&amp;#x200B;\n\n&gt;“Through the use of Matterport’s technology, federal agencies will be  \nable to *digitize and index* government facilities, infrastructure and  \nother assets such ***as airplanes, ships and submarines.”***  \n&gt;  \n&gt;  \n“For example, in the event of an emergency, digital twins of  \n**buildings, roads, bridges, tunnels, water supplies or electrical grids** can be instantly viewed and analyzed by authorized users to  \nrespond more efficiently”  \n&gt;  \n&gt;  \n“Access to 3D digital twins and the spatial data behind them can fuel  \na multitude of use cases such as **emergency response, military**  \n**training and historical preservation**.” - George Hoyem at In-Q-Tel\n\nHow could you not be bullish? They’re creating a private searchable 3D database. This is immensely powerful. Imagine being able to visualize the entire underground infrastructure of NYC without having to dig everything up? \n\n# Collaboration Tool\n\nYou know how on Google docs you can live collaborate with other users on a doc? I use it all the time. Matterport just added that for digital twins. That leads me to my next point.\n\n# Prediction:\n\nI’ve come to believe that Google will want Matterport. I have no evidence of this, it’s just a feeling. This is because the two companies align in a variety of ways. (I guess Google could just develop their own tech, but I just feel like they might take the easy route and acquire.)\n\n* Google Earth has exteriors of 3D buildings, but not interiors. Imagine how Matterport’s 3D dataset could be utilized for that tool?\n* Matterport and Google are both platform companies with a focus on big data and indexing that data.\n* Google Real-estate searching was removed about a decade ago, but what if this was the catalyst for them to bring it back. I predict that Google will bring back real estate searching but integrate it with 3D interactive experiences.\n* Google’s AI research could be fueled by Matterport’s datasets.\n* Matterport could be integrated with Google’s suite of apps.\n\n**My positions:**  \n100 shares at $14. Some calls expiring from Sept – December ranging from $17.5 - $25.",
        "subreddit": "wallstreetbets",
        "title": "$MTTR | METAVERSE FUTURES",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgnvma/mttr_metaverse_futures/",
        "created": 1630636644.0
    },
    {
        "author": "marlinmarlin99",
        "created_utc": 1630693404,
        "id": "phaud9",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " Based in Tel-Aviv, Israel, REE Automotive has  managed to stay out of consumer-facing EV news because its tech has  mostly been aimed at other manufacturers, with its role centered on that  of a developer and supplier. Its scheduled establishment of a US  foothold should bring it more publicity, landing in a city that is  rapidly becoming an EV tech hub.\n\nIn the EV  industry and start-up world, REE is arguably best known for skateboard  platforms, with the company's calling card being the industry's flattest  EV platform. Dubbed REEcorner, the platform packs the powertrain,  steering, suspension and braking components into the arch of the wheel,  offering other automakers a ready architecture on which many different  types of vehicle bodies can be fitted. The compact module between the  chassis and the wheel, therefore, is designed to be scalable and  modular—what the company calls \"agnostic\" to the design and size of the  final vehicle.\n\nThe planned Austin facility will  include an integration center, the company says, that will offer REE's  technology to future and current partners in North America, including  Magna International, allowing for the construction of prototypes.\n\n&amp;#x200B;\n\n* **REE Automotive has been developing EV  chassis that combine the powertrain, steering, suspension, and braking  into a slim platform.**\n* **The platforms are  designed to be scalable and modular, suitable for vehicles with all  types of bodies and different sizes and weight classes.**\n* **REE Automotive will set up US headquarters in Austin, Texas, which is already a tech hub, to work with partners in the US.**\n\n&amp;#x200B;\n\nCatalyst: \n\n# REE is about to participate in a series of conferences starting next week which will provide a huge bump to the price of the stock . Its take a beating but the price is currently at its low. \n\n Read the news: [https://www.wdrb.com/news/national/ree-automotive-to-participate-in-series-of-investor-conferences/article\\_2f4f412c-dd7b-5e4f-8b6e-5849cd913b56.html](https://www.wdrb.com/news/national/ree-automotive-to-participate-in-series-of-investor-conferences/article_2f4f412c-dd7b-5e4f-8b6e-5849cd913b56.html)\n\n[Cowen's 4th Annual Global Transportation &amp; Sustainable Mobility Conference](https://www.globenewswire.com/Tracker?data=Ynts0B9b1DK8XQgnJTK5jiERwsvaQSxVkRiMg-kuwd7tSh6XUU9kwZIB1SHanOd-d5KoMYON2PQw%E2%80%94qki-9%E2%80%94nF3O5sW-Lj4zjCsyn50Ef5qXAZYBTPSavwnEJG4wthOXxKu7jJ-gpBA7wzkx1zKbeSYf7dqQ5VGldFzpzhLJEB3BjEpZx%E2%80%94GYCCPDYoeVC6tdUh2xTyqQlGO96yxw0GCyO6TwbirNV37mSI5tQ6FGuTmTt0W05ytu43mdHVmIG5jyogjI%E2%80%94abdPKAOzjNIhJzsik%E2%80%94vF7bCSg3ANCKWwLozSS7A=)Presentation scheduled for Thursday, September 9 at 9:20am ET [Register to webcast](https://www.globenewswire.com/Tracker?data=clRq8UotEHim061za7lt3BzRiK19usL9Lszv1mtebYqzRWE0cABwh88bRenqp3aoEcmqu5Z77r2ZOz5yyd4KpvzJ7JwzS9rzhfgkXaFzeqyddd7A6m9%E2%80%94jzlv4ELCY5Y68LY16Y51dDIemRkKmNG%E2%80%94Jmbaq0iaar3sFYaxb3hRc5i3TJjEo6FcfAEUr5519UkV0Rw3phAUkgSe%E2%80%94uroHucxzQ==)\n\nMorgan Stanley Virtual 9th Annual Laguna Conference Tuesday, September 14\n\n[Evercore ISI Autotech &amp; AI Forum](https://www.globenewswire.com/Tracker?data=IP-azQjO0Ny01ztp%E2%80%948RCMuMAUZONZruPN-iiXs09-dN3oUEl6RQ2w7u6Y32yx8YcoQlmlL3-Hx6mVlMQ7kxIfKNpZCyQbjdu9lXH6l3cpBBraXyivnbGzzO7OeysD66RVMwkWA-gpHHRuzPhYT50HsHkpyKpHwY5byfhIk1wHn0BEhA9QnoMO96rOM94XpsO)Presentation scheduled for Wednesday, September 22 at 8am ET [Register to webcast](https://www.globenewswire.com/Tracker?data=clRq8UotEHim061za7lt3A-6iYAKOqZmgGEAsCSrjeKEYOjUkSizooRDHimN2x5oKmKOpPFpf-i0X2QeZUsq5YI%E2%80%94a17YkqfH14oxxXSVf9-eCym%E2%80%94MknNdrBOze4YPtnuUSrYTwqbFYSl9xQNFUW061h6vVW-vX6TkVoq6y2JMQ18of0xLd-Q8rMqIQV9PPkNsyRPm1dSLgiZcuj0k4TimGHLLSFWRSs1bhu1Wod2EM8=)\n\nDA  Davidson 20th Annual Diversified Industrials &amp; Services Conference  Presentation scheduled for Thursday, September 23 at 11am ET [Register to webcast](https://www.globenewswire.com/Tracker?data=clRq8UotEHim061za7lt3GpJRorO5P2yMR7xTic6lufIke00GyEgU8IXbQKnCzfl-Cu9NNSkTYttEj1Do4TKtM5mk2ybLi9YbpcR4Nnsjn7FgiM%E2%80%94IMjKm58oKdOtS7odDyPnDkFSoZLCZrO7tb1sKYevTI3pqrguP0-OajI0p%E2%80%94vcpTA%E2%80%94DUvD4hG9ZnGxvy%E2%80%94SEckXZuLgzjSCEw1ctmYJLw==)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nMy position: I currently hold 4k stocks and will be getting some more\n\n[https://imgur.com/a/k6mI4Sd](https://imgur.com/a/k6mI4Sd)",
        "subreddit": "wallstreetbets",
        "title": "$REE Automotive YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phaud9/ree_automotive_yolo/",
        "created": 1630722204.0
    },
    {
        "author": "marlinmarlin99",
        "created_utc": 1630695076,
        "id": "phbcz3",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Based in Tel-Aviv, Israel, REE Automotive has managed to stay out of consumer-facing EV news because its tech has mostly been aimed at other manufacturers, with its role centered on that of a developer and supplier. Its scheduled establishment of a US foothold should bring it more publicity, landing in a city that is rapidly becoming an EV tech hub.\n\nIn the EV industry and start-up world, REE is arguably best known for skateboard platforms, with the company's calling card being the industry's flattest EV platform. Dubbed REEcorner, the platform packs the powertrain, steering, suspension and braking components into the arch of the wheel, offering other automakers a ready architecture on which many different types of vehicle bodies can be fitted. The compact module between the chassis and the wheel, therefore, is designed to be scalable and modular—what the company calls \"agnostic\" to the design and size of the final vehicle.\n\nThe planned Austin facility will include an integration center, the company says, that will offer REE's technology to future and current partners in North America, including Magna International, allowing for the construction of prototypes.\n\nREE Automotive has been developing EV chassis that combine the powertrain, steering, suspension, and braking into a slim platform.\n\nThe platforms are designed to be scalable and modular, suitable for vehicles with all types of bodies and different sizes and weight classes.\n\n REE Automotive will set up US headquarters in Austin, Texas, which is already a tech hub, to work with partners in the US.\n\n**Catalyst:**\n\n# REE is about to participate in a series of conferences starting next week which will provide a huge bump to the price. \n\n1. Cowen's 4th Annual Global Transportation &amp; Sustainable Mobility ConferencePresentation scheduled for Thursday, September 9 at 9:20am ET Register to webcast\n2. Morgan Stanley Virtual 9th Annual Laguna Conference Tuesday, September 14\n3. Evercore ISI Autotech &amp; AI ForumPresentation scheduled for Wednesday, September 22 at 8am ET Register to webcast\n4. DA Davidson 20th Annual Diversified Industrials &amp; Services Conference Presentation scheduled for Thursday, September 23 at 11am ET Register to webcast\n\n**My position:** \n\nI currently hold 4k stocks and will be getting some more\n\n[https://imgur.com/a/k6mI4Sd](https://imgur.com/a/k6mI4Sd)",
        "subreddit": "wallstreetbets",
        "title": "$REE Automotive YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phbcz3/ree_automotive_yolo/",
        "created": 1630723876.0
    },
    {
        "author": "marlinmarlin99",
        "created_utc": 1630695333,
        "id": "phbfst",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": " \n\nBased in Tel-Aviv, Israel, REE  Automotive has managed to stay out of consumer-facing EV news because  its tech has mostly been aimed at other manufacturers, with its role  centered on that of a developer and supplier. Its scheduled  establishment of a US foothold should bring it more publicity, landing  in a city that is rapidly becoming an EV tech hub.\n\nIn  the EV industry and start-up world**, REE is arguably best known for  skateboard platform**s, with the company's calling card being the  industry's flattest EV platform. Dubbed REEcorner, the platform packs  the powertrain, steering, suspension and braking components into the  arch of the wheel, **offering other automakers a ready architecture on  which many different types of vehicle bodies can be fitted.** The compact  module between the chassis and the wheel, therefore, is designed to be  scalable and modular—what the company calls \"agnostic\" to the design and  size of the final vehicle.\n\nThe  **planned Austin facility** will include an integration center, the company  says, that will offer REE's technology to future and current partners in  North America, including Magna International, allowing for the  construction of prototypes.\n\nREE  Automotive has been developing EV chassis that combine the powertrain,  steering, suspension, and braking into a slim platform.\n\nThe  platforms are designed to be scalable and modular, suitable for  vehicles with all types of bodies and different sizes and weight  classes.\n\nREE Automotive will set up US headquarters in Austin, Texas, which is already a tech hub, to work with partners in the US.\n\n**Catalyst:**\n\n# REE is about to participate in a series of conferences starting next week which will provide a huge bump to the price.\n\n1. Cowen's  4th Annual Global Transportation &amp; Sustainable Mobility  ConferencePresentation scheduled for Thursday, September 9 at 9:20am ET  Register to webcast\n2. Morgan Stanley Virtual 9th Annual Laguna Conference Tuesday, September 14\n3. Evercore ISI Autotech &amp; AI ForumPresentation scheduled for Wednesday, September 22 at 8am ET Register to webcast\n4. DA  Davidson 20th Annual Diversified Industrials &amp; Services Conference  Presentation scheduled for Thursday, September 23 at 11am ET Register to  webcast",
        "subreddit": "wallstreetbets",
        "title": "$REE Automotive Catalyst ..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phbfst/ree_automotive_catalyst/",
        "created": 1630724133.0
    },
    {
        "author": "cru3211",
        "created_utc": 1630607844,
        "id": "pgnvma",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Matterport will create a digital clone of our world for the metaverse.\n\nBefore I explain how, check out my previous DD posts for some context.  \n[MTTR Bringing 3D Photogrammetry Experiences](https://www.reddit.com/r/wallstreetbets/comments/ou2ap9/mttr_bringing_3d_photogrammetry_experiences_to/)  \n[MTTR Explosive Potential](https://www.reddit.com/r/wallstreetbets/comments/p3469k/mttr_update_explosive_avenues_of_potential/)\n\nNow, you’re probably wondering “What is the metaverse u/cru3211?”\n\nLet me tell you.\n\n# The Metaverse\n\nThe **metaverse** is a paradigm shift in the way we organize ourselves as a society. It’s an evolutionary embodiment of technology &amp; the internet. It’s commonly envisioned as a “second layer” to our world. Sort of like… a virtual clone of it… that’s digitized. See where this is going?\n\nThis is the **spatial web**. It represents an emerging three-dimensional web experience. It’ll blow the old internet out of the water.\n\nresearch: metaverse, web 3.0, and spatial web for more insights.\n\nMSG me and I’ll ramble more about the metaverse. For now, just understand that it’s an inevitable innovation that will see widespread growth within the next decade. Matterport is likely (but not guaranteed) to be a part of this evolution.\n\n# Government Contract\n\nMatterport has entered the public sector to digitize the valuable assets of the US government.\n\n&amp;#x200B;\n\n&gt;“Through the use of Matterport’s technology, federal agencies will be  \nable to *digitize and index* government facilities, infrastructure and  \nother assets such ***as airplanes, ships and submarines.”***  \n&gt;  \n&gt;  \n“For example, in the event of an emergency, digital twins of  \n**buildings, roads, bridges, tunnels, water supplies or electrical grids** can be instantly viewed and analyzed by authorized users to  \nrespond more efficiently”  \n&gt;  \n&gt;  \n“Access to 3D digital twins and the spatial data behind them can fuel  \na multitude of use cases such as **emergency response, military**  \n**training and historical preservation**.” - George Hoyem at In-Q-Tel\n\nHow could you not be bullish? They’re creating a private searchable 3D database. This is immensely powerful. Imagine being able to visualize the entire underground infrastructure of NYC without having to dig everything up? \n\n# Collaboration Tool\n\nYou know how on Google docs you can live collaborate with other users on a doc? I use it all the time. Matterport just added that for digital twins. That leads me to my next point.\n\n# Prediction:\n\nI’ve come to believe that Google will want Matterport. I have no evidence of this, it’s just a feeling. This is because the two companies align in a variety of ways. (I guess Google could just develop their own tech, but I just feel like they might take the easy route and acquire.)\n\n* Google Earth has exteriors of 3D buildings, but not interiors. Imagine how Matterport’s 3D dataset could be utilized for that tool?\n* Matterport and Google are both platform companies with a focus on big data and indexing that data.\n* Google Real-estate searching was removed about a decade ago, but what if this was the catalyst for them to bring it back. I predict that Google will bring back real estate searching but integrate it with 3D interactive experiences.\n* Google’s AI research could be fueled by Matterport’s datasets.\n* Matterport could be integrated with Google’s suite of apps.\n\n**My positions:**  \n100 shares at $14. Some calls expiring from Sept – December ranging from $17.5 - $25.",
        "subreddit": "wallstreetbets",
        "title": "$MTTR | METAVERSE FUTURES",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgnvma/mttr_metaverse_futures/",
        "created": 1630636644.0
    },
    {
        "author": "marlinmarlin99",
        "created_utc": 1630693404,
        "id": "phaud9",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " Based in Tel-Aviv, Israel, REE Automotive has  managed to stay out of consumer-facing EV news because its tech has  mostly been aimed at other manufacturers, with its role centered on that  of a developer and supplier. Its scheduled establishment of a US  foothold should bring it more publicity, landing in a city that is  rapidly becoming an EV tech hub.\n\nIn the EV  industry and start-up world, REE is arguably best known for skateboard  platforms, with the company's calling card being the industry's flattest  EV platform. Dubbed REEcorner, the platform packs the powertrain,  steering, suspension and braking components into the arch of the wheel,  offering other automakers a ready architecture on which many different  types of vehicle bodies can be fitted. The compact module between the  chassis and the wheel, therefore, is designed to be scalable and  modular—what the company calls \"agnostic\" to the design and size of the  final vehicle.\n\nThe planned Austin facility will  include an integration center, the company says, that will offer REE's  technology to future and current partners in North America, including  Magna International, allowing for the construction of prototypes.\n\n&amp;#x200B;\n\n* **REE Automotive has been developing EV  chassis that combine the powertrain, steering, suspension, and braking  into a slim platform.**\n* **The platforms are  designed to be scalable and modular, suitable for vehicles with all  types of bodies and different sizes and weight classes.**\n* **REE Automotive will set up US headquarters in Austin, Texas, which is already a tech hub, to work with partners in the US.**\n\n&amp;#x200B;\n\nCatalyst: \n\n# REE is about to participate in a series of conferences starting next week which will provide a huge bump to the price of the stock . Its take a beating but the price is currently at its low. \n\n Read the news: [https://www.wdrb.com/news/national/ree-automotive-to-participate-in-series-of-investor-conferences/article\\_2f4f412c-dd7b-5e4f-8b6e-5849cd913b56.html](https://www.wdrb.com/news/national/ree-automotive-to-participate-in-series-of-investor-conferences/article_2f4f412c-dd7b-5e4f-8b6e-5849cd913b56.html)\n\n[Cowen's 4th Annual Global Transportation &amp; Sustainable Mobility Conference](https://www.globenewswire.com/Tracker?data=Ynts0B9b1DK8XQgnJTK5jiERwsvaQSxVkRiMg-kuwd7tSh6XUU9kwZIB1SHanOd-d5KoMYON2PQw%E2%80%94qki-9%E2%80%94nF3O5sW-Lj4zjCsyn50Ef5qXAZYBTPSavwnEJG4wthOXxKu7jJ-gpBA7wzkx1zKbeSYf7dqQ5VGldFzpzhLJEB3BjEpZx%E2%80%94GYCCPDYoeVC6tdUh2xTyqQlGO96yxw0GCyO6TwbirNV37mSI5tQ6FGuTmTt0W05ytu43mdHVmIG5jyogjI%E2%80%94abdPKAOzjNIhJzsik%E2%80%94vF7bCSg3ANCKWwLozSS7A=)Presentation scheduled for Thursday, September 9 at 9:20am ET [Register to webcast](https://www.globenewswire.com/Tracker?data=clRq8UotEHim061za7lt3BzRiK19usL9Lszv1mtebYqzRWE0cABwh88bRenqp3aoEcmqu5Z77r2ZOz5yyd4KpvzJ7JwzS9rzhfgkXaFzeqyddd7A6m9%E2%80%94jzlv4ELCY5Y68LY16Y51dDIemRkKmNG%E2%80%94Jmbaq0iaar3sFYaxb3hRc5i3TJjEo6FcfAEUr5519UkV0Rw3phAUkgSe%E2%80%94uroHucxzQ==)\n\nMorgan Stanley Virtual 9th Annual Laguna Conference Tuesday, September 14\n\n[Evercore ISI Autotech &amp; AI Forum](https://www.globenewswire.com/Tracker?data=IP-azQjO0Ny01ztp%E2%80%948RCMuMAUZONZruPN-iiXs09-dN3oUEl6RQ2w7u6Y32yx8YcoQlmlL3-Hx6mVlMQ7kxIfKNpZCyQbjdu9lXH6l3cpBBraXyivnbGzzO7OeysD66RVMwkWA-gpHHRuzPhYT50HsHkpyKpHwY5byfhIk1wHn0BEhA9QnoMO96rOM94XpsO)Presentation scheduled for Wednesday, September 22 at 8am ET [Register to webcast](https://www.globenewswire.com/Tracker?data=clRq8UotEHim061za7lt3A-6iYAKOqZmgGEAsCSrjeKEYOjUkSizooRDHimN2x5oKmKOpPFpf-i0X2QeZUsq5YI%E2%80%94a17YkqfH14oxxXSVf9-eCym%E2%80%94MknNdrBOze4YPtnuUSrYTwqbFYSl9xQNFUW061h6vVW-vX6TkVoq6y2JMQ18of0xLd-Q8rMqIQV9PPkNsyRPm1dSLgiZcuj0k4TimGHLLSFWRSs1bhu1Wod2EM8=)\n\nDA  Davidson 20th Annual Diversified Industrials &amp; Services Conference  Presentation scheduled for Thursday, September 23 at 11am ET [Register to webcast](https://www.globenewswire.com/Tracker?data=clRq8UotEHim061za7lt3GpJRorO5P2yMR7xTic6lufIke00GyEgU8IXbQKnCzfl-Cu9NNSkTYttEj1Do4TKtM5mk2ybLi9YbpcR4Nnsjn7FgiM%E2%80%94IMjKm58oKdOtS7odDyPnDkFSoZLCZrO7tb1sKYevTI3pqrguP0-OajI0p%E2%80%94vcpTA%E2%80%94DUvD4hG9ZnGxvy%E2%80%94SEckXZuLgzjSCEw1ctmYJLw==)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nMy position: I currently hold 4k stocks and will be getting some more\n\n[https://imgur.com/a/k6mI4Sd](https://imgur.com/a/k6mI4Sd)",
        "subreddit": "wallstreetbets",
        "title": "$REE Automotive YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phaud9/ree_automotive_yolo/",
        "created": 1630722204.0
    },
    {
        "author": "marlinmarlin99",
        "created_utc": 1630695076,
        "id": "phbcz3",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Based in Tel-Aviv, Israel, REE Automotive has managed to stay out of consumer-facing EV news because its tech has mostly been aimed at other manufacturers, with its role centered on that of a developer and supplier. Its scheduled establishment of a US foothold should bring it more publicity, landing in a city that is rapidly becoming an EV tech hub.\n\nIn the EV industry and start-up world, REE is arguably best known for skateboard platforms, with the company's calling card being the industry's flattest EV platform. Dubbed REEcorner, the platform packs the powertrain, steering, suspension and braking components into the arch of the wheel, offering other automakers a ready architecture on which many different types of vehicle bodies can be fitted. The compact module between the chassis and the wheel, therefore, is designed to be scalable and modular—what the company calls \"agnostic\" to the design and size of the final vehicle.\n\nThe planned Austin facility will include an integration center, the company says, that will offer REE's technology to future and current partners in North America, including Magna International, allowing for the construction of prototypes.\n\nREE Automotive has been developing EV chassis that combine the powertrain, steering, suspension, and braking into a slim platform.\n\nThe platforms are designed to be scalable and modular, suitable for vehicles with all types of bodies and different sizes and weight classes.\n\n REE Automotive will set up US headquarters in Austin, Texas, which is already a tech hub, to work with partners in the US.\n\n**Catalyst:**\n\n# REE is about to participate in a series of conferences starting next week which will provide a huge bump to the price. \n\n1. Cowen's 4th Annual Global Transportation &amp; Sustainable Mobility ConferencePresentation scheduled for Thursday, September 9 at 9:20am ET Register to webcast\n2. Morgan Stanley Virtual 9th Annual Laguna Conference Tuesday, September 14\n3. Evercore ISI Autotech &amp; AI ForumPresentation scheduled for Wednesday, September 22 at 8am ET Register to webcast\n4. DA Davidson 20th Annual Diversified Industrials &amp; Services Conference Presentation scheduled for Thursday, September 23 at 11am ET Register to webcast\n\n**My position:** \n\nI currently hold 4k stocks and will be getting some more\n\n[https://imgur.com/a/k6mI4Sd](https://imgur.com/a/k6mI4Sd)",
        "subreddit": "wallstreetbets",
        "title": "$REE Automotive YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phbcz3/ree_automotive_yolo/",
        "created": 1630723876.0
    }
]