[
    {
        "author": "iam6ft10",
        "created_utc": 1619896397,
        "id": "n2p5a3",
        "num_comments": 229,
        "num_crossposts": 0,
        "selftext": "  \n\n***CLOVER HEALTH (Ticker: CLOV)*** \n\n***Revenue Model***\n\n***…***\n\nTheir membership acquisition is highly seasonal, with January being the highest enrollment month as a result of Medicare’s annual election period at the end of the year. Their members generally enroll for a full calendar year, creating a highly predictable revenue stream for that year and meaningful opportunities for them to re-enroll members for years to come.\n\n***Member Enrollment***\n\nTheir revenue growth rate and long-term profitability are affected by their ability to increase their number of members, which requires that they both continue to enroll new members in their MA plans and retain existing members. Their membership expanded from **42,592** as of December 31, 2019, to **58,056** as of December 31, 2020**, an increase of 15,464 members**, primarily under Medicare’s annual election period process. \n\n***Market Coverage***\n\nThey are focused on driving membership growth through geographic and market share expansion and are allocating resources and taking strategic actions to increase Their share in existing markets and enter into new markets. As a result, their revenue, growth rate and long-term profitability are also affected by their ability to achieve both objectives. **As of December 31, 2020**, they **offered plans in 34 MA markets across seven states** with **8% market** **share** of the individual, non-special needs plans (“non-SNP”) MA enrollees in these markets. **They have launched in 74 additional MA markets, expanding their footprint by an additional state, in 2021.**\n\n**Total MA Market Growth 2021 YTD vs 2020:** **From 34 to 108 MA markets - 217% YOY Growth**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/j4pxmy4s5kw61.jpg?width=999&amp;format=pjpg&amp;auto=webp&amp;s=8d3a82ea7ee0fdbc4d819bb9f7773b02092273f6\n\n**Total Revenue Per Member (2019):** **$10,853 per member**\n\n**Total Revenue Per Member (2020):**  **$11,590 per member**\n\n**Total Revenue Growth YOY 2019-2020:** **46%**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**MACHINE LEARNING IS THE BUSINESS OPPORTUNITY**\n\nThey are singularly focused on creating great, sustainable healthcare to improve every life. They have centered Their strategy on building and deploying technology that they believe **will enable them to solve a significant data problem while avoiding the limitations of legacy approaches**. Currently, as a next-generation Medicare Advantage insurer, they leverage their flagship software platform, the Clover Assistant, to provide America’s seniors with PPO and HMO plans that are the obvious choice for Medicare-eligible consumers. \n\nThey call Their plans “Obvious” because they believe they are highly affordable—offering most of Their members the lowest average out-of-pocket costs for primary care physician co-pays, specialist co-pays, drug deductibles and drug costs in their markets—and provide wide network access and the same cost-sharing (co-pays and deductibles) for physicians who are in- and out-of-network. **By empowering physicians with data-driven, personalized insights at the point of care through their software platform, they believe they can improve clinical decision-making and viably offer these “Obvious” plans at scale, through an asset-light approach. They reach a broad array of consumers, including traditionally underserved populations.**\n\nThey drive adoption and use of the Clover Assistant across their network of primary care physicians (“PCPs”) by focusing on continuously improving its user-centric design, highly actionable and real-time clinical content, enhanced and rapid payment for Clover Assistant visits and simple onboarding. \n\nAs of December 31, 2020, over 2,400 PCPs had contracted to use the Clover Assistant to manage Their members’ care. High PCP engagement with the Clover Assistant enables real-time, data-driven decision-making for Their members at the point of care and drives rapid software iteration**: the more that physicians use the Clover Assistant, the more it learns** and furthers the precision of personalized data-driven recommendations. **They combine their payor data with physician-generated data and use this powerful closed feedback loop to continuously tune their clinical rules and machine learning models**, as well as to select and prioritize future software capabilities. \n\n**The use and continuous improvement of the Clover Assistant has resulted in not only improved clinical decision-making but also strong plan performance.** The platform also facilitates identifying and engaging with their most at-risk members for their clinical programs designed to provide additional targeted care support, which is designed to further drive better plan performance. Taken together, they believe these enhancements will allow them to return a material portion of their savings to members through their “Obvious” plans and to continuously lower their members’ out-of-pocket costs and provide them with market-leading benefits.",
        "subreddit": "wallstreetbets",
        "title": "CLOV Due Diligence Summary - Using Machine Learning and AI to Disrupt an Archaic Business Model Industry - 46% YOY Revenue Growth - 217% YOY MA Market Growth",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n2p5a3/clov_due_diligence_summary_using_machine_learning/",
        "created": 1619925197.0
    },
    {
        "author": "BoredBillionaire",
        "created_utc": 1619972553,
        "id": "n39wvn",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "I'm a long term CLOV investor and do not believe the recent price action reflects a squeeze of any kind. More likely that wall street investors woke up to CLOV potential because of [this](https://innovation.cms.gov/media/document/gpdc-model-participant-announcement) CMS update that announces CLOV participation in 10 US states in PY 2021. (This is my first reddit post so here goes)\n\nBelow is why I (a regular, retail investor) have held on to CLOV shares and warrants in my portfolio and why I believe getting in on this stock under $15 is a no brainer (disclaimer: I’m not a financial advisor and this is NOT investment advice, do your own DD before investing):\n\n1. **Business Model:** Clover Health is a Medicare Advantage insurance company. [Sources of revenue for MA insurers](https://www.medicalnewstoday.com/articles/how-is-medicare-advantage-funded) include premiums and payments via CMS, most of which goes to hospitals and doctors. In MA, specially under plans offered by CLOV, premiums are negligible so for our purpose payments made by CMS (government) are the lifeblood of MA plans such as Clover. You may be wondering so what? Well, let’s put things in perspective. The US federal govt spent $1.2 Trillion on healthcare in 2019, $644 Billion of this went to Medicare of which $270B was spent on MA. All or most of this growing annual budget goes to fund MA plans such as Clover for services they provide members. The problem is, there are too many visits and hospitalizations (than are needed). What if there was an innovative startup that used innovation (pay doctors fixed fees per visit) and technology (Clover Assistant software with telehealth features) such that federal government paid out LESS per member to such a company vs. competition ([target outcome of Direct Contracting](https://www.cms.gov/newsroom/fact-sheets/direct-contracting)) for HIGHER quality of care. Great ability to capture market share from legacy insurers and help lower government spending (more on this later) – a WIN-WIN situation for insurer and the govt. This is why Clover’s business model is so fool proof!  \n***TLDR:*** ***Clover operates in a space that is majority funded by government, and its unique business model helps it gain market share***\n2. **Competition:** Now let’s talk competition. Competitors such as Humana, United Health, CVS/Aetna have for years delivered medical insurance but hardly innovated in a way that was positive for federal spending. They continued charging seniors on plan premiums, while trying to receive as much funding as possible from the fed to grow their profits. Why make the process more efficient when all we do to get paid is to broker insurance plans in a highly regulated industry. Clover with its innovation is miles ahead of the competition by getting a nice head start (started in 2014, while other [insurers are just getting started with the innovation)](https://medcitynews.com/2021/02/mercy-humana-partner-to-expand-access-to-virtual-value-based-care/) and the Clover Assistant software will constantly help it become more efficient i.e. achieve better results for its members, at a lower cost to CMS!! CLOV is also MORE HOLISTIC than TDOC in services, while targeting a LOWER TAM i.e. only Seniors right now. Only a matter of time that they expand beyond MA and offer plans for the general population.  \n***TLDR: Clover is disrupting competition through its use of technology.***\n3. **Software:** Now the bit about software. This IS Clover’s secret ingredient. The development is led by an ex-Googler (Andrew Toy, President at Clover Health) to radically transform software used to treat seniors through massive digitization, and interactive UI. This in turn helps doctors improve outcomes for patients. And they are giving it away for free!!! Why would a physician not use software that helped him/her improve the standard of care for their patients while being easy to use and access and FREE. Imagine, Marc Benioff giving away Salesforce for free to sales reps all over. When this software becomes the standard of care because of the years of head start they have in this space, Clover Health could eventually license this to the other insurers and health care providers i.e. additional sources of revenue.  \n***TLDR: The Clover Assistant software is the secret ingredient that helps the company deliver efficient care and achieve better outcomes.***\n4. **Growth:** Ok so we briefly spoke about licensing as an additional mode of revenue, now let’s focus on others. 2) Current projections indicate 14% annual organic growth of MA population, this growth is likely to go bonkers when Biden reduces the Medicare eligible age to 60, as [promised](https://joebiden.com/fact-sheet-how-joe-biden-would-help-you-get-health-insurance-coverage-during-the-coronavirus-crisis/) in his campaign. Evergreen and ever-growing TAM 3) Direct Contracting introduced by CMS is basically a risk sharing model that incentivizes insurers to make treatment of seniors more efficient and cost effective. Insurers that can achieve a lower cost of treatment and fewer hospital visits for the same condition, they are likely to be held in favor by CMS when allotting MA counties every year. Now, if you remember the bit about software, Clover is in the best position to do this…as long as doctors continue to use the Clover Assistant software to treat seniors. This may sound like a risky bet, but it really isn’t….60%+ of Clover members see a PCP that uses the Clover Assistant software. Clover’s [long-term goal](https://investors.cloverhealth.com/static-files/ed2bc09d-cd96-4759-897e-862c2b250213) is to get to a 70%+ rate. 4) End 2020, Clover offered MA plans in 34 counties but this will grow based on participation in more states as per the [CMS Direct Contracting plan for 2021](https://innovation.cms.gov/media/document/gpdc-model-participant-announcement).  \n***TLDR: Growth in MA membership, direct contracting, geographic expansion, potential to license its software are all lucrative growth avenues.***\n5. **Customers:** Let’s now put some light on the target demographic…seniors. Clover is promising them the lowest cost plans ($0 premiums, low/no co-pays) which are highly flexible (telehealth on Clover Assistant) to their needs. Why not? In addition, Clover is developing partnerships with Walmart and other retailers to market their plans which is likely to result in an ever-growing customer and incentivized partner base.\n6. **Media:** The media has lambasted this company quite vocally including on CNBC despite little of substance…except that there was a short-seller report and questions asked about the CEO. To his credit, Cramer recently invited Clover Health to Mad Money…now, when this interview happens it is likely to introduce the company to a pretty massive list of retail investors (the buy and hold kind) and when they realize how undervalued Clover is, they will likely pick up a good portion of the float, causing fewer and fewer shares to be available.\n7. **Management:** If one reads through the exec incentive structure in [SPAC prospectus](https://www.sec.gov/Archives/edgar/data/1801170/000119312520316032/d69158d424b3.htm#toc69158_24), they would soon realize that the CEO has most of his interest in the company tied to the stock – he does not receive a salary. More importantly, both CEO and President performance-based incentive plans do not kick in until CLOV reaches and maintains a volume weighted average price of $30 for a 90-day period. Consider also, **Lee Shapiro who sits on the board of Clover Health is the former CFO of Livongo (now part of TDOC, ARK fav) while Chelsea Clinton adds serious weight and is actively involved as a board member.**\n8. **Valuation:** SPAC merger docs value the company at $3.7B. Currently, because of the short seller report and the massive short-interest in the company, it is valued at \\~$3B, which is \\~4x 2021E sales. With projected revenues for 2021 of $835M (mid-point), and applying a 8x sales multiple, Clover’s valuation needs to be at least $6.7B+ market cap implying a $16+ PT. With expected 24%+ growth in 2021, and premium multiple for high growth companies (note that the float is only 25% of shares outstanding), I believe a $20-25 target is more in line with current valuations. When medicare eligible age limit is lowered to 60 by Biden later this year or perhaps early next, this PT will need to be re-evaluated…upward. Also consider the fact that this company is NOT zero revenue now, promising billions in 2025 and beyond….it had sales of $670M in sales in 2020 and growing!! Consider also that the industry-leader in the telehealth space – TDOC – and a Cathie Wood &amp; ARK fav currently trades at 16x sales. Similar multiple for CLOV implies a $33 PT.  \n***TLDR: Whichever way you cut it, CLOV is very undervalued right now. Near term $25-30 PT and longer term has LMND-like potential in healthcare insurance***\n\nI am long CLOV because I believe that it is trying to solve a very hard and complex problem in healthcare. It deserves a lot more credit and people rooting for it to succeed.",
        "subreddit": "wallstreetbets",
        "title": "why CLOV will explode sooner or later (DD)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n39wvn/why_clov_will_explode_sooner_or_later_dd/",
        "created": 1620001353.0
    },
    {
        "author": "Erland_Brynjar",
        "created_utc": 1619966921,
        "id": "n37uyq",
        "num_comments": 144,
        "num_crossposts": 0,
        "selftext": "Buffett warned newbie investors that picking great companies is more complicated than just selecting a promising industry.\n\n\"There's a lot more to picking stocks than figuring out what's going to be a wonderful industry in the future,\" said Buffett.\n\nBuffett put up a slide of all the auto companies from years go that started with the letter \"M;\" however, the list was so long it didn't fit on one slide. The \"Oracle of Omaha\" had to narrow the list to automobile manufactures that started with \"Ma\" to fit the names on one page.\n\nBuffett said there were about 2,000 companies that entered the auto business in the 1900's because investors and entrepreneurs expected the industry to have an amazing future. In 2009, there were three automakers left and two went bankrupt, said Buffett.\n\nWhether it’s technology, EVs, renewables, marijuana or cyber security, many will enter these budding industries, and most will not make it. It isn’t good enough to pick the sector or industry that’ll grow most, you either need to time your exits perfectly, or hope you have the few that survive to cover your losses on the many that don’t.",
        "subreddit": "CanadianInvestor",
        "title": "Buffett: There's a lot more to investing than picking a budding industry",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/n37uyq/buffett_theres_a_lot_more_to_investing_than/",
        "created": 1619995721.0
    },
    {
        "author": "TheBoom129",
        "created_utc": 1619980581,
        "id": "n3cqdc",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Howdy, for those who are considering buying options this week I found several hidden opportunities to make 50-100% gains in the weekly options. The plays are to be brought on market open ( within the 1st 2 minutes of the market opening). It will require limit order of the previous close , don’t worry as your order would be fill at the Theoretical Option price at the open. \n\n1. Ma - 210507- Call- 382 strike price - The PUT prices are so high it caused the Mm to buy a shit ton of shares to drive the prices of the put down on Friday . The puts @ the current moment are still high, will led to the Option Mm to buy the stock up to cause the puts prices to drop while making the calls option in increase. The call option  is way below the deviation of the price. \n\n2.  Swks - 210507 - Call- 182.5 strike price. Price is currently Out of the deviation chart  and similar to MA, the puts are far too high. This one would force the put sellers and option Mm to buy up the stock to increases the price action.",
        "subreddit": "wallstreetbets",
        "title": "Several opportunities for Options gains",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n3cqdc/several_opportunities_for_options_gains/",
        "created": 1620009381.0
    }
]