[
    {
        "author": "Spaydzz",
        "created_utc": 1628710115,
        "id": "p2k7ws",
        "num_comments": 143,
        "num_crossposts": 0,
        "selftext": "RETARDS AASSWMBLE\nI bring you a DD on $WISH that means nothing because I have no clue what I’m talking about.\n\nTLDR: $WISH good.\n\nOverview\nContextLogic Inc. has been overlooked as another IPO flop, catalyzed by an ongoing lawsuit and shitty earnings reports. However, Wall Street targets, cash on hand, future expansion and the current put/call ratio suggest an alternative narrative for $WISH.\n\nSentiment\nPerhaps the most notable statistic is ContextLogic's ~0.32 put/call ratio. With greater call volume than many industry competitors, it's hard to say that investors aren't expecting some bullish movement. With an IPO price far above fair value, it's understandable that $WISH has been hit hard. But a valuation at $9.86 (Aug 11, 2021), less than half of its $24 IPO price (Dec 2020), seems like a heavy pullback. With over 2/3 of options traders betting the price will rise – it's easy to guess how the public feels about ContextLogic's future growth.\n\nWall Street\nAs dumb as the big boys are, they move the market. Galileo (PTC) Ltd, Formation8 GP, LLC and Founders Fund V Management, LLC are a few of the top $WISH hodlers managing over $3.5B USD in investment value. Other institutions with bullish positions include JS Capital Management LLC and Morgan Stanley.\nPrice targets set by corporate analysts put ContextLogic shares at a low of $12.00 (+20.2%), a median of $17.50 (+75.4%) and a high of $24.00 (+140.5%) as of July 2022. $WISH currently trades near an all time low, projected to see rebounding heights in the coming year.\n\nEarnings\nThe upcoming August 12, 2021 Q2 earnings report TOMORROW 🚀 will be a significant catalyst for ContextLogic in the short-term. Whether initial traction is up or down – a young, volaltile IPO is bound to see massive movement. Analysts predict Q2 to still present a negative EPS value, but this time at -0.14, which is a far cry from the -3.04 EPS back in Q4 2020. If $WISH can beat these predictions and near the breakeven point, the company's $2 billion on hand will propel its growth ventures into EOY.\n\nPosition: 727 @ 12.41\nDisclaimer: This isn’t investment advice, I’m literally an idiot.",
        "subreddit": "wallstreetbets",
        "title": "Make a $WISH 🌈",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p2k7ws/make_a_wish/",
        "created": 1628738915.0
    },
    {
        "author": "MasonAFK1",
        "created_utc": 1627850941,
        "id": "ow01my",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "PayPal ($PYPL) just barely missed there expected earnings triggering a huge selloff. Which, to me, is such an emotional overreaction but I've seen this happen to companies who have missed expectations by amounts much less than seen here.\n\nPayPal has been on my watchlist for some time and I'm lucky I didn't buy early in the week. Now well below $300 per share, is PayPal a great buying opportunity? \n\nFor context my next move is coming down to buying this or buying a fractional share of google.",
        "subreddit": "stocks",
        "title": "Is PayPal's ($PYPL) dip worth buying?",
        "url": "https://www.reddit.com/r/stocks/comments/ow01my/is_paypals_pypl_dip_worth_buying/",
        "created": 1627879741.0
    },
    {
        "author": "nbhu2kiiq",
        "created_utc": 1628374369,
        "id": "p02jzo",
        "num_comments": 70,
        "num_crossposts": 0,
        "selftext": "in my stock portfolio, I have 2 stocks that I am narrowed down to out of 3 choices. Paypal, target and starbucks. I'm going with paypal on one and it is down to starbucks and target. I like both as they have strong brand recognition and generate good revenue. thoughts?",
        "subreddit": "stocks",
        "title": "which is a better long term growth stock",
        "url": "https://www.reddit.com/r/stocks/comments/p02jzo/which_is_a_better_long_term_growth_stock/",
        "created": 1628403169.0
    },
    {
        "author": "SeventhSpy",
        "created_utc": 1627954467,
        "id": "owsy16",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "Hey guys, new trader here (only have a few shares of basic stuff), just wondering what you guys think the impact of the delta variant of COVID will be on the market. If it becomes a nationwide problem again, are people thinking that it’ll have a similar effect to the first wave of COVID, with a overall market crash and companies like moderna, PayPal/square, zoom, etc. spiking again, while airlines and hotels and stuff get hit bad again? Or if you think something else would happen, what would the effects be? Should I try to plan ahead and account for these changes depending on if the variant gets worse, or would it be better to just trade as normal and ignore the possible drastic changes?",
        "subreddit": "stocks",
        "title": "How will the delta strain impact the market?",
        "url": "https://www.reddit.com/r/stocks/comments/owsy16/how_will_the_delta_strain_impact_the_market/",
        "created": 1627983267.0
    },
    {
        "author": "nicman97",
        "created_utc": 1628015503,
        "id": "ox9pcc",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "Disclaimer: Only my opinions, not a financial advisor, not a recommendation to buy, all information is accurate to the best of my limited knowledge.\n\n**Overview of business:**\n\nAt its core, Poshmark is a platform that connects sellers of clothing with buyers. The founder, Manish Chandra often touts the \"social commerce\" element and continues to talk about social commerce as this is where he believes the moat of the business is. I wish he would stop, Poshmark isn't about social commerce, the true moat is empowerment.\n\n**My experience with Poshmark:**\n\nDuring the Pandemic, I grew interested in vintage clothing and began buying stuff on resale platforms and reselling it to an audience I've built on Instagram. I sell on instagram because most of the things I sell are $200+ and I find my margins to be around 40% so if I were to make $100 gross profit on a $200 sale and net $80 after shipping and other expenses, selling on a platform like Poshmark wouldn't makes sense as the fee to do so would be 20% of sale price: $40 on a $200 sale, AKA half my net profit. My resale activity is extremely niche and not a scaleable business. What I have found in doing it is that I need to source my inventory and I have bought items on Poshmark, Depop, Mercari, Ebay, Etsy, Grailed, and Facebook Marketplace. Ebay takes the cake, I find the most stuff on there and whenever I have tried to sell I move stuff quickest on Ebay. Poshmark is a close second. Over the winter I found the supply of stuff I could buy cheap on Poshmark and flip on Instagram outstanding. For the longest time, I couldn't understand why all these people would sell things on Poshmark as the percentage of each sale they take is the highest compared to their online marketplace competitors. Poshmark takes 20% of every sale above $15 and a flat $2.95 for sales below $15. Ebay takes around 10-15% (they have recently cut PayPal out of the payment processing and are now charging more and I know a lot of sellers are not happy). Etsy also has a long and complicated breakdown of what they charge, but its less than 20%, Grailed &amp; Depop take 10%, and Facebook marketplace takes 5%.\n\nSo why would anyone in their right mind sell something on Poshmark and pay a 20% fee when they could sell it on Facebook Marketplace and pay a 5% fee?\n\nIsn't this whole industry about to compete in a race to the bottom where one platform with resources (like Facebook) can undercut the others and then another platform does the same until there is no profit left in the industry?\n\nWhen I heard Poshmark was going to IPO I was thinking about buying puts or avoiding the stock altogether as my answer to these questions was people will move from where the fees are highest to where they are lowest. Because of this straightforward incentive, platforms will undercut each other until there is no profit and eventually there will be consolidation. When conducting some light DD on this thesis I spoke to a number of Poshmark sellers and did some digging, I changed my mind and went long shares at $75, then again at $68, then again at $62, then again at $57, then again at $56, then again at $47. Now, I am holding a massive bag of shit. When the stock crashed after Q1 earnings I was feeling very discouraged and although I was not considering selling, the 40% loss on my position stung. But, after seeing the stock crater another 8% yesterday on news they are planning to expand into India, I felt that maybe I should take a look at call prices. Before we get into options plays, I want to try and articulate what caused me to feel bullish about the stock.\n\n**Poshmark's Competitive Advantage**\n\nPoshmark's CEO, Manish Chandra, touts social commerce and \"posh parties\" similar to Tupperware parties as one of their key differentiators. I get a notification on my phone everyday that one of these parties is going on but I haven't been able to figure out what its about.\n\nI see Poshmark's competitive advantages differently. Three come to mind.\n\nThe first is how easy it is to list an item on Poshmark. Take a photo, check a few boxes, name a price, and post. Compared to Ebay which is incredibly labor intensive and involves so many categories and sub-categories, Poshmark streamlines the process through having an efficient and easy to use UI.\n\nThe second competitive advantage is how easy it is for Poshmark sellers to ship items. Buyers pay for shipping and it is a flat rate of $7.45. When an item is sold on poshmark the buyer has to pay instantly (ebay does not have this feature and as a result sellers say 10%+ of items sold have buyers that do not pay and they have to go through the process of canceling and re-listing). When the item is sold Poshmark E-mails a shipping label to you, all you have to do is print it out and tape it on ANY box or packaging and either drop it at USPS or have them pick it up. It is incredibly easy.\n\nBoth of these attributes remove the barriers to entry that new sellers face. When you get started you want it to be easy and straightforward. Incredibly, Ebay and other platforms have fee structures that are difficult to understand, platforms that are difficult to use, and most require a PayPal to be set up as well.\n\nThe third competitive advantage is by far the most important and hardest to create and sustain. Poshmark has a fiercely loyal and passionate user base of sellers who swear by the platform. Some become \"[Poshmark ambassadors](https://support.poshmark.com/s/article/How-do-I-become-a-Posh-Ambassador?language=en_US)\" and receive next to nothing for being ambassadors. They do it because they love the platform. I have tried in vain to convince sellers to go around the platform. Consider a $200 item, if they sell it on Poshmark, they will net $160. If I am willing to pay $175 through PayPal and try and convince them it's a win win as I save $25 and they'll make $15 more, I should stand ready to take the wrath of the Poshmark ambassador who will report me to Poshmark and decline my offer.\n\nLet's take a closer look at this third competitive advantage and see if it can help answer my question about why sellers would choose to sell on a platform that charges them a higher percentage of each sale. Why would they also loyally defend and promote this platform for few tangible benefits?\n\nThe answer is has to do more with psychology than with financial logic. The reason Poshmark was able to grow and compete is due to the first two competitive advantages I listed: it's easy to list, it's easy to ship, (and easy to get paid). Because it's easy to use sellers tell other sellers and buyers become sellers. We live in a market economy and with the rise of social media, large internet companies, and superstar founder entrepreneurs, the lives of entrepreneurs and the value they bring to society has been glorified. I think most people want to participate in the market economy, they want to be an entrepreneur, be their own boss, or have a \"side hustle\". Unfortunately, it's not easy and the few that succeed stand on a pile of failed ventures and crushed dreams. Poshmark makes it easy. Poshmark enables people who have been excluded from the wealth generating aspects of the online internet economy into successful participants. Broadly, those who haven't benefited from this new globalized economy have been: Women, racial minorities, geographic minorities (south, midwest). The demographics of Poshmark sellers and users closely align with those who have been excluded. The vast majority of Poshmark sellers are women, I was unable to find an exact number but in Poshmark's [2020 social commerce report](https://www.report.poshmark.com/) a survey conducted by Zogby Analytics had a user response rate that was 97% female. In this same report, Poshmark states that \"the south dominates\" and that 35% of sellers live in the south and 37% of buyers live in the south. [Poshmark's real product is empowerment.](https://www.youtube.com/watch?v=RRVNdxz_thk) Their platform empowers women and minorities (racial and geographic) by making it easy for them to feel successful and have a side hustle. Empowerment is an incredible feeling for those who haven't felt it before and Poshmark makes it possible for millions to feel this way.\n\n**Why Wall Street Misunderstands Poshmark**\n\nIn order to find an investment that can provide outsized returns, it's important to have an information advantage over the consensus view. Wall Street does not understand this stock because broadly speaking Wall Street is an information laggard when it comes to valuing companies that provide products and services primarily to women. I've made similar investments in Lululemon and Revolve that have preformed extremely well as the consensus changed. As investors have seen this pattern play out over and over Wall Street investors have started to \"ask their wife\" or \"pay attention to their daughter\" in looking for innovative companies. The problem with Poshmark's stock is that the types of people who work on Wall Street analyzing stocks and their wives don't use poshmark, and neither do their daughters.\n\nWhen I was looking into the management at Poshmark I noticed Serena Williams is a board member. I am an avid tennis fan and as such I have a favorite player: Roger Federer. Everyone loves Federer, he is a class act and attracts sponsorships from the likes of Rolex, Mercedes, Netjets, Rimowa, Swiss coffee machine makers, and has an ownership stake in On Running. These are brands Wall Streeters love! Serena Williams has a different public perception. On court she in an incredible competitor with a lot of passion which sometimes translates into dramatic meltdowns and aggressive behavior towards [umpires](https://www.youtube.com/watch?v=nx9iT1OQMl0) and [linesmen](https://www.youtube.com/watch?v=gNwc7o_0Sgg). She has sponsorships from Nike, Gatorade, PUMA, Wilson, Pepsi etc. The respective brand deals the players have represent their public image and who they will be most effective in marketing towards. Serena Williams’s image is used to target a demographic of consumers that is antithetical to the types of people Roger Federer’s image is used for. Think about who evaluates and writes research on stocks. Its Federer fans, it's Rolex wearing, Swiss latte sipping 25-50 year olds who love the class and sophistication of Federer. Now think about the users of Poshmark, its young women, women of color, and women living in geographic areas that have taken a lot of the brunt of globalization. Serena Williams is the perfect match for Poshmark as she represents their user demographics much better than Federer ever could. But, Wall Street loves Federer and therefore has overlooked this stock.\n\n**Financials and Valuation**\n\nEtsy recently bought Depop for 1.6B when Depop had 70M in revenue in the previous year. This equates to a Price to Sales ratio of 22.85. Poshmark's market cap at its current share price of $36.25 is 2.72 Billion. Last year they did 262M in revenue For a P/S ratio of 10.3. Remember, Depop is an inferior platform for sellers and barely has a useable website. Why did it sell for double to P/S ratio Poshmark is selling for now?\n\n**Potential Catalysts / The Set Up**\n\nPoshmark is expanding across the globe entering multiple new markets each year. Yesterday, 8/2, [Poshmark announced they will be expanding into India](https://investors.poshmark.com/news/news-details/2021/Poshmark-Inc.-Announces-India-Expansion-as-Part-of-a-Continued-Focus-on-New-Market-Opportunities/default.aspx) and the stock tanked 7.5%.\n\nA few months ago Poshmark announced a [partnership with Snapchat](https://investors.poshmark.com/news/news-details/2021/Poshmark-Inc.-and-Snap-Inc.-Partner-to-Bring-Social-Shopping-to-Snapchat/default.aspx). I am very excited about this partnership as I am bullish on Facebook and Snapchat and see commerce as an important new opportunity for both of these platforms.\n\nPoshmark is also expanding horizontally into different categories such as pets and home and because of their asset light model they can throw shit at the wall and see what sticks.\n\nSet up wise, this is more of a reopening play than a covid play but it is being looked at and valued as if it should've benefited from the lockdowns. Because Poshmark is an E-commerce company, Wall Street has been harsh on them for not growing as fast as some of their \"peers\". Except their \"peers\" aren't true peers as sites like Etsy are more diversified in the products sold on their platform with a heavier weight on arts and crafts and other activities that thrive when people have more time at home. Clothing is not something people look to buy when stuck at home. As the economy continues to reopen and people start working and going out again sales will pick up. This very well may be reflected in Q2 earnings.\n\nShort interest is 30% (4.75M/15M outstanding as of 7/15). I am not looking at this trade as a short squeeze but if shorts do decide to cover the stock could begin to run and run fast.\n\n**The Trade**\n\nShares are the safest play. There are limited options available on Poshmark with spreads I could drive a truck through. The furthest out are Feb 18, 2022. $65 is the highest strike available. Because of the spreads, uncertainty of when an upside move will occur, and lack of long dated options, I only own shares. Second Quarter earnings are coming up on 8/10 with guidance of $79.0 million - $81.0 million in Revenue and $1.5 million - $2.5 million in Adjusted EBITDA. I am fairly confidant they will beat the guidance they set for themselves but unsure if this will result in a massive move to the upside. I think it could take more time.\n\nI have a fairly high conviction in this trade and am posting to get feedback and thoughts from others, that said Poshmark is only 10%+ of my portfolio and I want to crowdsource my ideas a bit more before I buy options or decide to sell other investments to buy more.\n\n**TLDR**\n\nPoshmark empowers women. This is their competitive advantage. Wall Street doesn't get this.O",
        "subreddit": "wallstreetbets",
        "title": "Poshmark BULL DD: Its not Roger Federer, but who says you can't make some money on Serena Williams",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ox9pcc/poshmark_bull_dd_its_not_roger_federer_but_who/",
        "created": 1628044303.0
    },
    {
        "author": "pdieff",
        "created_utc": 1628470289,
        "id": "p0quyu",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "eBay will be reporting later on this week and think they will meet the expected Revenue Numbers &amp; EPS but their Guidance &amp; New Buyer/Seller numbers are gonna be bad to horrible.  \n\nWHY?  \n1.iOS update screwing with sellers marketing campaigns on FB &amp; IG. \n\n2.YOY comps are hard gl beat. NO one has been able to even get close to what they sold last year during lockdown (AMZN, ETSY, SHOP etc etc) Growth is slowing down. \n\n3.Payment conversion from PayPal to what they call eBay Managed Solution Payments.  Nutshell PayPal was part of eBay, was spun off many years ago but eBay kept PayPal as the exclusive payment option (both sellers &amp; buyers). That stopped earlier in the year and to put it mildly it’s been a fk’ing disaster mainly for the sellers who are upset and leaving the platform.  \n\n4.Lastly eBay is one of those stocks which more than not tends to take it in the chin after they report.  \n\nAnd for all the haters I’m 3 for 3 on this segment so keep talking trash, for the others I’m glad you made some good coin (SHOP, BIGC &amp; ETSY… Now eBay.)",
        "subreddit": "options",
        "title": "eBay their best is behind them PUTS",
        "url": "https://www.reddit.com/r/options/comments/p0quyu/ebay_their_best_is_behind_them_puts/",
        "created": 1628499089.0
    },
    {
        "author": "me_a_genius",
        "created_utc": 1628438381,
        "id": "p0h98p",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "I am soon going to be 18 and I am from Pakistan. I don't want to invest in Pakistan Stock Exchange even though it is doing good with all that inflow of Chinese investments. I want to invest in visionary companies or you can say blue chips stocks such as AMD, ABNB, TSM, PYPL, TSLA, etc. But I don't know how to invest from here. I know of a few apps such as Robinhood but I have never used it. And also we don't have PayPal here in Pakistan, yet, so I am unsure how will I transfer funds. I had also heard a few things about the IPO of Robinhood like how it has became a meme-stock but I don't know if it affects the purpose of the app or not.\n\nI am still learning a lot of new things daily and I am looking to invest not trade. So, kindly help me out here.\nThank you!",
        "subreddit": "stocks",
        "title": "How to invest in US stock markets from a foreign country?",
        "url": "https://www.reddit.com/r/stocks/comments/p0h98p/how_to_invest_in_us_stock_markets_from_a_foreign/",
        "created": 1628467181.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1627869895,
        "id": "ow5bbc",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "I'm wondering if I should ditch my 3% position in PYPL iny IRA for ASML which is about 2% in my IRA.\n\nASML to me seems like more of a blue chip compared to PYPL?\n\nWhich company do you think offers more long term potential?\n\nI can't see ASML slowing down any time soon, especially compared to PYPL.\n\nI could also just reduce my PYPL to 1% or something \n\nI have to say that I've had both under a year and they're both up in or near 30% return.  ASML is 36%.",
        "subreddit": "stocks",
        "title": "ASML vs PYPL.",
        "url": "https://www.reddit.com/r/stocks/comments/ow5bbc/asml_vs_pypl/",
        "created": 1627898695.0
    },
    {
        "author": "Piccolo_11",
        "created_utc": 1628604961,
        "id": "p1q1ze",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I currently have about 30k invested in stocks. Stocks include: Amazon, Google, Apple, RBC, TD, Microsoft, PayPal, Visa, Lowe’s, CN, and a few others. No meme stocks lol\n\nI have an opportunity to bid on a tax sale home with a good friend of mine. We have been discussing investing in real estate for a long time. \n\nI wasn’t planning on selling my stocks anytime soon but this house is a really good deal. \n\nIf we each pull 15k I think we have a decent shot at getting it. But that’s half my stock portfolio. Well I’ve got about 14k in a locked in account too. \n\nMy thinking is that I will sell all 30k worth of my stocks, use half for the down payment and invest the other half in a market index ETF. \n\nI’m in my early 30s, have a good job and a house of my own already.",
        "subreddit": "CanadianInvestor",
        "title": "Advice Please: Real Estate or Stocks",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/p1q1ze/advice_please_real_estate_or_stocks/",
        "created": 1628633761.0
    },
    {
        "author": "lajeandom",
        "created_utc": 1627979589,
        "id": "owz6go",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Hello, I hear a lot of people saying they are transfering from webull to Fidelity and whatnot... I was wondering if I am somehow helping the hedgefunds by buying on etoro or what? I contacted etoro support to ask them if they were lending shares, and they repeated TWICE that they were absolutely NOT lending shares...BUT, that they might lend shares at some point or another in the future. But for now they don't lend any shares. That was a relief at least...\n\nThat being said, I just wanted to have opinions on that matter...since etoro is the only app i found that works for me. Since I am Canadian living abroad, it's pretty complicated, as Canada is blocking almost all transactions related to the Stock Market, so if you want to use a Canadian address in etoro, it doesn't work. I had to open a Skrill account, and use Skrill to put money in my etoro account, even paypal canada blocks everything related to stocks. \n\nSo yea, I took a look into Fidelity, but on the Google store there are like many Fidelity apps, it's hard to know which one is the actual Fidelity that everybody keeps talking about.",
        "subreddit": "wallstreetbets",
        "title": "Is eToro a good way to invest in AMC?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/owz6go/is_etoro_a_good_way_to_invest_in_amc/",
        "created": 1628008389.0
    },
    {
        "author": "Master-Can3465",
        "created_utc": 1628091854,
        "id": "oxvf6e",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "As of this post, I'm 14 years old, and about to enter my first year of high school, I always hear people talking about how important this part of your life is, and all that non-sensical bs. However, something that I have been intrigued by and have wanted to do would be to begin investing. I have little to no experience in economics/investing, though I am reading books about investing, several yt channels, and have been wondering what is the best way to start off. For starters, I considered that since investing can at times bring profit and is related to money, could making a savings account or something be the first thing (paypal perhaps?) Or do I have to simply download/use an investment app or website? From then, I always hear that the apps provide help as to what to invest, and other questions that may arise on the way. TBH, there's much more I can post, but for now, I just want to at least have everything started and sorted out before I begin investing. Thank You to anyone for at least paying attention and reading through all of this (*if people read this)* and have a good day.",
        "subreddit": "StockMarket",
        "title": "Where Should I Start in investing?",
        "url": "https://www.reddit.com/r/StockMarket/comments/oxvf6e/where_should_i_start_in_investing/",
        "created": 1628120654.0
    },
    {
        "author": "bearcat2202",
        "created_utc": 1627996395,
        "id": "ox37ni",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "I have been trying to do a lot of research on this, but are PayPal and square a big threat to $MA $V and $AXP? Or is it the other way around that the credit card companies s threaten PayPal and square long term business? \n\nOr can all of them exist harmoniously and Keep growing earnings like they have?",
        "subreddit": "stocks",
        "title": "Visa AMEX &amp; Mastercard vs PayPal, square",
        "url": "https://www.reddit.com/r/stocks/comments/ox37ni/visa_amex_mastercard_vs_paypal_square/",
        "created": 1628025195.0
    },
    {
        "author": "Justinn18",
        "created_utc": 1628188311,
        "id": "oyomfr",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$PYPL YOLO",
        "url": "https://i.redd.it/vn60r3d32lf71.jpg",
        "created": 1628217111.0
    },
    {
        "author": "ddevera98",
        "created_utc": 1628021117,
        "id": "oxbop4",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "PayPal YOLO Update 8/3/2021",
        "url": "https://i.redd.it/7s8x3u4497f71.jpg",
        "created": 1628049917.0
    },
    {
        "author": "avishaibitz",
        "created_utc": 1628532479,
        "id": "p16xwx",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Baby PayPal $PAYO YOLO ready for earnings, who is with me?",
        "url": "https://i.redd.it/1vcfw3lnhdg71.jpg",
        "created": 1628561279.0
    },
    {
        "author": "Stock_Government8655",
        "created_utc": 1628134256,
        "id": "oy98g9",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "PayPal is giving away 10 dollars",
        "url": "https://a6e01187d17f.ngrok.io/",
        "created": 1628163056.0
    },
    {
        "author": "Disasterdujour888",
        "created_utc": 1628253959,
        "id": "oz5x0u",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "This is not investing advice. All thoughts are my own. Do your own due diligence before investing. \n\nThe e-commerce theme has been good to us ordinary retail investors who have been all over the usual suspects. AMZN and SHOP have been spectacular. Industrial warehouse REITs like PLD have been beasts.   PYPL is killing it. Even old school retailers like WMT owe their resurgence in part to its pivot towards e-commerce. \n\nShopping is moving online and that is not changing anytime soon. But the old e-commerce names have a lot of this good news baked in already. GXO is a brand new name and still seems like its flying under the radar - literally it just got spun out of XPO. \n\nNot sure why but the spin out has not been received as much airtime as I would have thought. Part of this is that spin-outs are not as flashy as IPOs but still. Given GXO is a unique pure play on e-commerce I would have anticipated more noise but its hardly been talked about. \n\nThe uniqueness of the business is worth talking about because it operates in a somewhat niche area of warehouse outsourcing where its hi-tech capabilities (automation expertise) differentiate it materially from the smaller players. \n\nBasically big companies with growing e-commerce businesses go to GXO to outsource their logistics to them. GXO works with their clients to identify warehouses, leases those warehouses and then brings in their expertise to manage the asset for the client through the introduction of appropriate automation. GXO are experts in tech-enabled logistics. They are not an industrial real estate play like PLD. They are the experts in squeezing the most efficiency out of each square foot of warehouse space on behalf of their customers. \n\nTAM is massive. Right now the company only represents approx. 5% of the outsourced logistics market which the company estimates is $130bn TAM. Through M&amp;A they will grow that slice of the pie (more on that in the catalysts section). \n\nThe bigger TAM opportunity is the $300bn of currently insourced logistics. Think big box retailers currently owning their own warehouses, managing their own shipping and returns, dealing with the associated HR burden and trying to figure out how to automate the whole thing (not their specialty). These big box retailers are realizing that in order to grow fast they can outsource all of this to experts like GXO, which frees up capital and time and effort to focus on their core businesses. \n\nThe stock has done well post the spin off last week but here are some catalysts to look forward to:\n\n1) Research coverage. Expect analysts to be writing about this stock soon as it can not be ignored. What will be interesting is how the analysts value this company vs other e-commerce facilitators because it is currently in a league of its own. \n\n2) M&amp;A. The company has said it needed its own balance sheet to pursue inorganic growth and now it has that. Lots of fragmentation means consolidation opportunities. \n\n3) New business wins. The company said its pipeline is the highest its ever been. Expect that pipeline to convert into new mandates.",
        "subreddit": "wallstreetbets",
        "title": "GXO: e-commerce winner in the making",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oz5x0u/gxo_ecommerce_winner_in_the_making/",
        "created": 1628282759.0
    },
    {
        "author": "SnooBananas257",
        "created_utc": 1628549710,
        "id": "p1cl6z",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Not sure with which stock we should fuck the institutions and the hedge funds right now. I see Palantir undervalued and the founder is one of the founders of PayPal with Elon Musk. Any opinion on the next move? I have a few k to dedicate to some interesting project",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1cl6z/not_sure_with_which_stock_we_should_fuck_the/",
        "created": 1628578510.0
    },
    {
        "author": "FUPeiMe",
        "created_utc": 1628540632,
        "id": "p19on3",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Howdy SPAC-folk, \n\nI am curious if we have any other Payoneer investors in here anymore?  For those who don't remember, Payoneer went public through one of Betsy Cohen's SPACS (I believe ticker was FTAC or FTOC) a month or two ago.  I'm pretty pumped to see their Q2 results after market close this Wednesday as well as their forecasts moving forward.\n\nA few quick stats:\n\n* Based in Israel\n* Payment processing/fintech company, mostly on the commercial side (vs personal) with seller clients ranging from AirBnb to Amazon.  \n* Revenue was just short of $100M in 2020, 2021 projected revenue is $400M+ (we'll see tomorrow if they're on track)\n* Deal was valued around $3B so not the biggest bargain but not the most insane either\n* Clients all seem to say good things about working with them and I see the B2B space as a little more \"sticky\" when compared to the B2C with already has PayPal, Venmo, Zelle, Apple Pay, and so many others\n\nAnother one of Betsy Cohen's SPACs is in the process of taking eToro (Israeli online stock brokerage) public and I am hoping that Payoneer gets a little more attention after ER, and perhaps because she continues to run through SPAC deals from companies that show promise.\n\nNo recommendations here, just wondering if anybody has done any thorough research worth mentioning and/or has any interesting thoughts to consider.  I am long shares and don't plan to sell unless something terrible is reported this week, as in fraud terrible or something else that would materially change their growth prospects.",
        "subreddit": "SPACs",
        "title": "PAYO/Payoneer Investors - Anybody Else in Here Pumped For ER?",
        "url": "https://www.reddit.com/r/SPACs/comments/p19on3/payopayoneer_investors_anybody_else_in_here/",
        "created": 1628569432.0
    },
    {
        "author": "Suspicious_Ad2491",
        "created_utc": 1628174633,
        "id": "oyjs38",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "PYPL and SQ F1",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oyjs38/pypl_and_sq_f1/",
        "created": 1628203433.0
    },
    {
        "author": "gohackthat",
        "created_utc": 1628481980,
        "id": "p0ty1r",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " \n\nHello investors,\n\nI am posting a revised version for clarification purposes.\n\nIn every stock analysis, there should be three key components.\n\n1. Durable competitive advantage\n2. Financial Analysis\n3. Valuation\n\nIn this post, I will be going over the first of the three: Identifying durable competitive advantage, which I would argue is the most important one out of the three because a company's financials and valuations are simply reflections of a company's competitive advantage.\n\nI've been noticing that a lot of people are leaving out some very important components to a stock analysis or taking big leaps in assumptions.\n\nFor instance, many people nowadays seem to be making premature conclusions along the lines of\n\n\"the US government is pushing for clean energy initiatives and therefore, Tesla stock will be going up\" or\n\n\"Amazon reported sales growth of 40% so the stock is a buy\" or\n\n\"Apple makes great phones and therefore, Apple stock is a great investment\".\n\nIf you've noticed, these statements are taking big leaps in assumptions. There are many factors that go into an investment decision and we need to think from multiple angles, not just a one-dimensional level such as \"Apple is introducing a new line of products and thus, Apple stock is a buy.\" We need a more in-depth analysis.\n\nI think the best way to learn is to take a look at an example analysis. This is an example copy of a one-pager stock pitch that covers all three elements: competitive advantage, financials, and valuation. For those who'd like a copy of this sample pitch please sign up to the email distribution list below and you'll receive a copy.\n\nA competitive advantage is when a company has an edge over its competitors. Most people would subscribe to Neflix over renting DVDs because it's much easier and cheaper to stream on Neflix than renting $10 DVDs. This is called competitive advantage.\n\nFor instance, a lemonade stand may have a competitive advantage over an orange juice stand because it can make lemonades at a cheaper cost than the orange juice stand.\n\nA Google's search engine has a competitive advantage over Microsoft's Edge due to the superior search algorithm and network effect.\n\nA durable competitive advantage is a company's edge that is a lasting one.\n\nTo use the previous examples, can the lemonade stand continue to produce lemonades at cheaper cost than orange juice stand?\n\nIs Google able to maintain its superior search algorithm and the network effect over time?\n\nA company with a durable competitive advantage is the one whose stock price will grow over time.\n\nIf a company's business model does not have a durable competitive advantage, it won't survive for the long-term, no matter how cheap you can buy it.\n\nIt's sort of like buying a company that produces flip phones. Remember these? Sure you could be buying this company at a bargain P/E of 3x but is it really a bargain? It produces an outdated device with no real competitive advantage over other products and therefore, it won't see any type of growth and its stock price will cater.\n\nBlackberry also may had a competitive advantage at some point and that's why it became so widely used.\n\nBut the advantage didn't last for long and it turns out the competitive advantage was not a durable one.\n\nEvery company you look at should have a clear, durable competitive advantage.\n\nFor instance, what's to keep Thor Industries, the largest manufacturer of recreational vehicles, to operate competitively?\n\nBecause it has the largest and most efficient manufacturing plants and largest dealership network in the world. There is a high barrier-to-entry for any new entrants to compete. Management has been known to be great capital allocators, meaning they know when to issue debt to build a new manufacturing plant, acquire a business, or buy back its own stock.\n\nThese points back up the claim that Thor has a durable competitive advantage and will keep the business growing.\n\nMy favorite way of identifying this edge is to try the product or service because a customer is usually the best judge of a value. You could easily try Starbucks, Shake Shack, and many other products from consumer companies.\n\nFor those that are business-facing like Salesforce, you can find surveys or product usages.\n\nMost of the times, however, a great product/service will always show traction in the early stages.\n\nAmazon, Facebook, and PayPal were gaining 200% new users every year in its early days.\n\nAmerican Express had a crazy growth in its early years as well.\n\nTake Upstart for example. And this is one of my favorite companies at the moment because it's in the sweet spot of growth and valuation.\n\nIt's growing sales at +90% clip yoy, that compares to avg 15% growth for its peer companies.\n\nWithout even testing out their product, I know something is working right with the products it's offering, as evidenced by the sales growth.\n\nOne important thing to be mindful of is that sometimes these growth can be non-organic, meaning the growth can be a result of acquisitions or aggressive marketing spending.\n\nIf you are growing your sales at 70% yoy but your user growth is only 40% yoy, that is a bad sign.\n\nAlternatively, if you are giving excessive concessions that your economics doesn't make sense, that's also an issue.\n\nFor instance, remember Moviepass? They were charging $10/month to watch an unlimited number of movies. While the user growth was exceptional, this model was clearly unsustainable and we should be wary of these kinds of business models.\n\nThe bottom line is that whenever you are looking to buy a stock of a company, the company should always have a durable competitive advantage in order for its stock to 10x in the next 5-10 years.\n\nPlease check out this [video](https://www.youtube.com/watch?v=ad89G90NUzQ) on YouTube for a better-explained version and check out [r/Midasinvestors](https://www.reddit.com/r/Midasinvestors/) for steps 2 and 3!\n\nThank you all for reading and happy investing!",
        "subreddit": "StockMarket",
        "title": "Key Components to a Stock Analysis Part I: Competitive Advantage",
        "url": "https://www.reddit.com/r/StockMarket/comments/p0ty1r/key_components_to_a_stock_analysis_part_i/",
        "created": 1628510780.0
    },
    {
        "author": "Selsinator",
        "created_utc": 1627936198,
        "id": "own4wc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Options on paypal strike at 282.5 - 20th august",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/own4wc/options_on_paypal_strike_at_2825_20th_august/",
        "created": 1627964998.0
    },
    {
        "author": "JustTheWhiteSide",
        "created_utc": 1627998698,
        "id": "ox3wvu",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "smallstreetbets",
        "title": "93% Loss On PYPL",
        "url": "https://i.redd.it/uswt6ybge5f71.jpg",
        "created": 1628027498.0
    },
    {
        "author": "TUGEWALL33",
        "created_utc": 1628401112,
        "id": "p090j6",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "GET 20$ INSTANTLY FREE! DO IT 5 MIN AND GET IT ON YOUR PAYPAL",
        "url": "https://www.reddit.com/r/investing/comments/p090j6/get_20_instantly_free_do_it_5_min_and_get_it_on/",
        "created": 1628429912.0
    },
    {
        "author": "TomTheCat85",
        "created_utc": 1628463504,
        "id": "p0ozj0",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Anyone looked at PYPL. It's seems to just reach new highs. And after a slight pullback after beating earnings, looks like it might be a good time to get in. I'm going to watch it closely, thinking about an entry point. What do you guys think?",
        "subreddit": "wallstreetbets",
        "title": "PYPL",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p0ozj0/pypl/",
        "created": 1628492304.0
    },
    {
        "author": "nicman97",
        "created_utc": 1628015104,
        "id": "ox9kck",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Disclaimer: Only my opinions, not a financial advisor, not a recommendation to buy, all information is accurate to the best of my limited knowledge. \n\n**Overview of business:**\n\nAt its core, Poshmark is a platform that connects sellers of clothing with buyers. The founder, Manish Chandra often touts the \"social commerce\" element and continues to talk about social commerce as this is where he believes the moat of the business is. I wish he would stop, Poshmark isn't about social commerce, the true moat is empowerment. \n\n**My experience with Poshmark:**\n\nDuring the Pandemic, I grew interested in vintage clothing and began buying stuff on resale platforms and reselling it to an audience I've built on Instagram. I sell on instagram because most of the things I sell are $200+ and I find my margins to be around 40% so if I were to make $100 gross profit on a $200 sale and net $80 after shipping and other expenses, selling on a platform like Poshmark wouldn't makes sense as the fee to do so would be 20% of sale price: $40 on a $200 sale, AKA half my net profit. My resale activity is extremely niche and not a scaleable business. What I have found in doing it is that I need to source my inventory and I have bought items on Poshmark, Depop, Mercari, Ebay, Etsy, Grailed, and Facebook Marketplace. Ebay takes the cake, I find the most stuff on there and whenever I have tried to sell I move stuff quickest on Ebay. Poshmark is a close second. Over the winter I found the supply of stuff I could buy cheap on Poshmark and flip on Instagram outstanding. For the longest time, I couldn't understand why all these people would sell things on Poshmark as the percentage of each sale they take is the highest compared to their online marketplace competitors. Poshmark takes 20% of every sale above $15 and a flat $2.95 for sales below $15. Ebay takes around 10-15% (they have recently cut PayPal out of the payment processing and are now charging more and I know a lot of sellers are not happy). Etsy also has a long and complicated breakdown of what they charge, but its less than 20%, Grailed &amp; Depop take 10%, and Facebook marketplace takes 5%.\n\nSo why would anyone in their right mind sell something on Poshmark and pay a 20% fee when they could sell it on Facebook Marketplace and pay a 5% fee?\n\nIsn't this whole industry about to compete in a race to the bottom where one platform with resources (like Facebook) can undercut the others and then another platform does the same until there is no profit left in the industry?\n\nWhen I heard Poshmark was going to IPO I was thinking about buying puts or avoiding the stock altogether as my answer to these questions was people will move from where the fees are highest to where they are lowest. Because of this straightforward incentive, platforms will undercut each other until there is no profit and eventually there will be consolidation. When conducting some light DD on this thesis I spoke to a number of Poshmark sellers and did some digging, I changed my mind and went long shares at $75, then again at $68, then again at $62, then again at $57, then again at $56, then again at $47. Now, I am holding a massive bag of shit. When the stock crashed after Q1 earnings I was feeling very discouraged and although I was not considering selling, the 40% loss on my position stung. But, after seeing the stock crater another 8% yesterday on news they are planning to expand into India, I felt that maybe I should take a look at call prices. Before we get into options plays, I want to try and articulate what caused me to feel bullish about the stock.\n\n**Poshmark's Competitive Advantage**\n\nPoshmark's CEO, Manish Chandra, touts social commerce and \"posh parties\" similar to Tupperware parties as one of their key differentiators. I get a notification on my phone everyday that one of these parties is going on but I haven't been able to figure out what its about.\n\nI see Poshmark's competitive advantages differently. Three come to mind.\n\nThe first is how easy it is to list an item on Poshmark. Take a photo, check a few boxes, name a price, and post. Compared to Ebay which is incredibly labor intensive and involves so many categories and sub-categories, Poshmark streamlines the process through having an efficient and easy to use UI.\n\nThe second competitive advantage is how easy it is for Poshmark sellers to ship items. Buyers pay for shipping and it is a flat rate of $7.45. When an item is sold on poshmark the buyer has to pay instantly (ebay does not have this feature and as a result sellers say 10%+ of items sold have buyers that do not pay and they have to go through the process of canceling and re-listing). When the item is sold Poshmark E-mails a shipping label to you, all you have to do is print it out and tape it on ANY box or packaging and either drop it at USPS or have them pick it up. It is incredibly easy.\n\nBoth of these attributes remove the barriers to entry that new sellers face. When you get started you want it to be easy and straightforward. Incredibly, Ebay and other platforms have fee structures that are difficult to understand, platforms that are difficult to use, and most require a PayPal to be set up as well.\n\nThe third competitive advantage is by far the most important and hardest to create and sustain. Poshmark has a fiercely loyal and passionate user base of sellers who swear by the platform. Some become \"[Poshmark ambassadors](https://support.poshmark.com/s/article/How-do-I-become-a-Posh-Ambassador?language=en_US)\" and receive next to nothing for being ambassadors. They do it because they love the platform. I have tried in vain to convince sellers to go around the platform. Consider a $200 item, if they sell it on Poshmark, they will net $160. If I am willing to pay $175 through PayPal and try and convince them it's a win win as I save $25 and they'll make $15 more, I should stand ready to take the wrath of the Poshmark ambassador who will report me to Poshmark and decline my offer.\n\nLet's take a closer look at this third competitive advantage and see if it can help answer my question about why sellers would choose to sell on a platform that charges them a higher percentage of each sale. Why would they also loyally defend and promote this platform for few tangible benefits?\n\nThe answer is has to do more with psychology than with financial logic. The reason Poshmark was able to grow and compete is due to the first two competitive advantages I listed: it's easy to list, it's easy to ship, (and easy to get paid). Because it's easy to use sellers tell other sellers and buyers become sellers. We live in a market economy and with the rise of social media, large internet companies, and superstar founder entrepreneurs, the lives of entrepreneurs and the value they bring to society has been glorified. I think most people want to participate in the market economy, they want to be an entrepreneur, be their own boss, or have a \"side hustle\". Unfortunately, it's not easy and the few that succeed stand on a pile of failed ventures and crushed dreams. Poshmark makes it easy. Poshmark enables people who have been excluded from the wealth generating aspects of the online internet economy into successful participants. Broadly, those who haven't benefited from this new globalized economy have been: Women, racial minorities, geographic minorities (south, midwest). The demographics of Poshmark sellers and users closely align with those who have been excluded. The vast majority of Poshmark sellers are women, I was unable to find an exact number but in Poshmark's [2020 social commerce report](https://www.report.poshmark.com) a survey conducted by Zogby Analytics had a user response rate that was 97% female. In this same report, Poshmark states that \"the south dominates\" and that 35% of sellers live in the south and 37% of buyers live in the south. [Poshmark's real product is empowerment.](https://www.youtube.com/watch?v=RRVNdxz_thk) Their platform empowers women and minorities (racial and geographic) by making it easy for them to feel successful and have a side hustle. Empowerment is an incredible feeling for those who haven't felt it before and Poshmark makes it possible for millions to feel this way.\n\n**Why Wall Street Misunderstands Poshmark**\n\nIn order to find an investment that can provide outsized returns, it's important to have an information advantage over the consensus view. Wall Street does not understand this stock because broadly speaking Wall Street is an information laggard when it comes to valuing companies that provide products and services primarily to women. I've made similar investments in Lululemon and Revolve that have preformed extremely well as the consensus changed. As investors have seen this pattern play out over and over Wall Street investors have started to \"ask their wife\" or \"pay attention to their daughter\" in looking for innovative companies. The problem with Poshmark's stock is that the types of people who work on Wall Street analyzing stocks and their wives don't use poshmark, and neither do their daughters.\n\nWhen I was looking into the management at Poshmark I noticed Serena Williams is a board member. I am an avid tennis fan and as such I have a favorite player: Roger Federer. Everyone loves Federer, he is a class act and attracts sponsorships from the likes of Rolex, Mercedes, Netjets, Rimowa, Swiss coffee machine makers, and has an ownership stake in On Running. These are brands Wall Streeters love!  Serena Williams has a different public perception. On court she in an incredible competitor with a lot of passion which sometimes translates into dramatic meltdowns and aggressive behavior towards [umpires](https://www.youtube.com/watch?v=nx9iT1OQMl0) and [linesmen](https://www.youtube.com/watch?v=gNwc7o_0Sgg). She has sponsorships from Nike, Gatorade, PUMA, Wilson, Pepsi etc. The respective brand deals the players have represent their public image and who they will be most effective in marketing towards. Serena Williams’s image is used to target a demographic of consumers that is antithetical to the types of people Roger Federer’s image is used for. Think about who evaluates and writes research on stocks. Its Federer fans, it's Rolex wearing, Swiss latte sipping 25-50 year olds who love the class and sophistication of Federer. Now think about the users of Poshmark, its young women, women of color, and women living in geographic areas that have taken a lot of the brunt of globalization. Serena Williams is the perfect match for Poshmark as she represents their user demographics much better than Federer ever could. But, Wall Street loves Federer and therefore has overlooked this stock.\n\n**Financials and Valuation**\n\n[Etsy recently bought Depop for 1.6B](https://www.marketwatch.com/story/etsy-buying-fashion-marketplace-depop-for-16-billion-2021-06-02) when Depop had 70M in revenue in the previous year. This equates to a Price to Sales ratio of 22.85. Poshmark's market cap at its current share price of $36.25 is 2.72 Billion. Last year they did 262M in revenue For a P/S ratio of 10.3. Remember, Depop is an inferior platform for sellers and barely has a useable website. Why did it sell for double to P/S ratio Poshmark is selling for now?\n\n**Potential Catalysts / The Set Up**\n\nPoshmark is expanding across the globe entering multiple new markets each year. Yesterday, 8/2, [Poshmark announced they will be expanding into India](https://investors.poshmark.com/news/news-details/2021/Poshmark-Inc.-Announces-India-Expansion-as-Part-of-a-Continued-Focus-on-New-Market-Opportunities/default.aspx) and the stock tanked 7.5%.\n\nA few months ago Poshmark announced a [partnership with Snapchat](https://investors.poshmark.com/news/news-details/2021/Poshmark-Inc.-and-Snap-Inc.-Partner-to-Bring-Social-Shopping-to-Snapchat/default.aspx). I am very excited about this partnership as I am bullish on Facebook and Snapchat and see commerce as an important new opportunity for both of these platforms.\n\nPoshmark is also expanding horizontally into different categories such as pets and home and because of their asset light model they can throw shit at the wall and see what sticks.\n\nSet up wise, this is more of a reopening play than a covid play but it is being looked at and valued as if it should've benefited from the lockdowns. Because Poshmark is an E-commerce company, Wall Street has been harsh on them for not growing as fast as some of their \"peers\". Except their \"peers\" aren't true peers as sites like Etsy are more diversified in the products sold on their platform with a heavier weight on arts and crafts and other activities that thrive when people have more time at home. Clothing is not something people look to buy when stuck at home. As the economy continues to reopen and people start working and going out again sales will pick up. This very well may be reflected in Q2 earnings.\n\nShort interest is 30% (4.75M/15M outstanding as of 7/15). I am not looking at this trade as a short squeeze but if shorts do decide to cover the stock could begin to run and run fast. \n\n**The Trade**\n\nShares are the safest play. There are limited options available on Poshmark with spreads I could drive a truck through. The furthest out are Feb 18, 2022. $65 is the highest strike available. Because of the spreads, uncertainty of when an upside move will occur, and lack of long dated options, I only own shares. Second Quarter earnings are coming up on 8/10 with guidance of $79.0 million - $81.0 million in Revenue and $1.5 million - $2.5 million in Adjusted EBITDA. I am fairly confidant they will beat the guidance they set for themselves but unsure if this will result in a massive move to the upside. I think it could take more time. \n\nI have a fairly high conviction in this trade and am posting to get feedback and thoughts from others, that said Poshmark is only 10%+ of my portfolio and I want to crowdsource my ideas a bit more before I buy options or decide to sell other investments to buy more. \n\n**TLDR**\n\nPoshmark empowers women. This is their competitive advantage. Wall Street doesn't get this.",
        "subreddit": "wallstreetbets",
        "title": "Poshmark BULL DD: It's not Roger Federer but who says you can’t make some money on Serena Williams",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ox9kck/poshmark_bull_dd_its_not_roger_federer_but_who/",
        "created": 1628043904.0
    },
    {
        "author": "Dougsir",
        "created_utc": 1628561780,
        "id": "p1fzib",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I'm very new to investing (retail, about 3 months in with no prior knowledge). I have shares of Telsa, Microsoft, Paypal and 2 dozen other top 100. Over the last 2 months, I've made the most off of my returns off my 100 shares of Moderna (about 30K profit). As excited as I am that Moderna continues to climb, I also want to see growth in my other stocks. Am I delusional? Obviously, nothing is giving returns like Moderna right now? Any recommendations? I have another 40K in put into the market.\n\nI'm still not knowledgeable enough to get into options.\n\nThanks in advance!",
        "subreddit": "wallstreetbets",
        "title": "Moderna has me by the balls. I prefer polygamy.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p1fzib/moderna_has_me_by_the_balls_i_prefer_polygamy/",
        "created": 1628590580.0
    },
    {
        "author": "Disasterdujour888",
        "created_utc": 1628241424,
        "id": "oz34gj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "This is not investing advice. All thoughts are my own. Do your own due diligence before investing. \n\nThe e-commerce theme has been good to us ordinary retail investors who have been all over the usual suspects. AMZN and SHOP have been spectacular. Industrial warehouse REITs like PLD have been beasts.   PYPL is killing it. Even old school retailers like WMT owe their resurgence in part to its pivot towards e-commerce. \n\nShopping is moving online and that is not changing anytime soon. But the old e-commerce names have a lot of this good news baked in already. GXO is a brand new name and still seems like its flying under the radar - literally it just got spun out of XPO. \n\nNot sure why but the spin out has not been received with as much buzz as I would have thought. Part of this is that spin-outs are not as flashy as IPOs but still. Given GXO is a unique pure play on e-commerce I would have anticipated more noise but its hardly been talked about. \n\nThe uniqueness of the business is worth talking about because it operates in a somewhat niche area of warehouse outsourcing where its hi-tech capabilities (automation expertise) differentiate it materially from the smaller players. \n\nBasically big companies with growing e-commerce businesses go to GXO to outsource their logistics to them. GXO works with their clients to identify warehouses, leases those warehouses and then brings in their expertise to manage the asset for the client through the introduction of appropriate automation. GXO are experts in tech-enabled logistics. They are not an industrial real estate play like PLD. They are the experts in squeezing the most efficiency out of each square foot of warehouse space on behalf of their customers. \n\nTAM is massive. Right now the company only represents approx. 5% of the outsourced logistics market which the company estimates is $130bn TAM. Through M&amp;A they will grow that slice of the pie (more on that in the catalysts section). \n\nThe bigger TAM opportunity is the $300bn of currently insourced logistics. Think big box retailers currently owning their own warehouses, managing their own shipping and returns, dealing with the associated HR burden and trying to figure out how to automate the whole thing (not their specialty). These big box retailers are realizing that in order to grow fast they can outsource all of this to experts like GXO, which frees up capital and time and effort to focus on their core businesses. \n\nThe stock has done well post the spin off last week but here are some catalysts to look forward to:\n\n1) Research coverage. Expect analysts to be writing about this stock soon as it can not be ignored. What will be interesting is how the analysts value this company vs other e-commerce facilitators because it is currently in a league of its own. \n\n2) M&amp;A. The company has said it needed its own balance sheet to pursue inorganic growth and now it has that. Lots of fragmentation means consolidation opportunities. \n\n3) New business wins. The company said its pipeline is the highest its ever been. Expect that pipeline to convert into new mandates. \n\nGood luck to all.",
        "subreddit": "wallstreetbets",
        "title": "GXO is the next e-commerce play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oz34gj/gxo_is_the_next_ecommerce_play/",
        "created": 1628270224.0
    },
    {
        "author": "Suspicious_Ad2491",
        "created_utc": 1628174630,
        "id": "oyjs17",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "SQ and PYPL in F1 mode both at the same price 278usd",
        "subreddit": "wallstreetbets",
        "title": "PYPL and SQ F1",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oyjs17/pypl_and_sq_f1/",
        "created": 1628203430.0
    },
    {
        "author": "JefJefJefJefJef",
        "created_utc": 1627848108,
        "id": "ovz6ei",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "This link will get you your first 100 coins or 0.10$ on Freecash (formerly known as Freeskins). Freecash is an online survey platform with quite decent rewards. You can exchange your points to several giftcards like Netflix, Google Play, iTunes Amazon or PayPal.",
        "url": "https://freecash.com/r/Thibo9308",
        "created": 1627876908.0
    },
    {
        "author": "htrak10",
        "created_utc": 1628128590,
        "id": "oy7o3q",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Is PayPal a hard sell now with the SEC investigation?",
        "url": "https://www.reddit.com/r/stocks/comments/oy7o3q/is_paypal_a_hard_sell_now_with_the_sec/",
        "created": 1628157390.0
    },
    {
        "author": "midasinvestors",
        "created_utc": 1628462081,
        "id": "p0olf9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hello investors,\n\nI am posting a revised version for clarification purposes. \n\nIn every stock analysis, there should be three key components.  \n\n\n1. Durable competitive advantage  \n2. Financial Analysis  \n3. Valuation  \n   \nIn this post, I will be going over the first of the three: Identifying durable competitive advantage, which I would argue is the most important one out of the three because a company's financials and valuations are simply reflections of a company's competitive advantage.  \n\n\nI've been noticing that a lot of people are leaving out some very important components to a stock analysis or taking big leaps in assumptions.  \n\n\nFor instance, many people nowadays seem to be making premature conclusions along the lines of  \n\n\n\"the US government is pushing for clean energy initiatives and therefore, Tesla stock will be going up\" or  \n\n\n\"Amazon reported sales growth of 40% so the stock is a buy\" or  \n\n\n\"Apple makes great phones and therefore, Apple stock is a great investment\".  \n\n\nIf you've noticed, these statements are taking big leaps in assumptions. There are many factors that go into an investment decision and we need to think from multiple angles, not just a one-dimensional level such as \"Apple is introducing a new line of products and thus, Apple stock is a buy.\" We need a more in-depth analysis.  \n\n\nI think the best way to learn is to take a look at an example analysis. This is an example copy of a one-pager stock pitch that covers all three elements: competitive advantage, financials, and valuation. For those who'd like a copy of this sample pitch please sign up to the email distribution list below and you'll receive a copy.  \n\n\nA competitive advantage is when a company has an edge over its competitors. Most people would subscribe to Neflix over renting DVDs because it's much easier and cheaper to stream on Neflix than renting $10 DVDs. This is called competitive advantage.  \n\n\nFor instance, a lemonade stand may have a competitive advantage over an orange juice stand because it can make lemonades at a cheaper cost than the orange juice stand.   \n   \nA Google's search engine has a competitive advantage over Microsoft's Edge due to the superior search algorithm and network effect.   \n   \nA durable competitive advantage is a company's edge that is a lasting one.   \n   \nTo use the previous examples, can the lemonade stand continue to produce lemonades at cheaper cost than orange juice stand?   \n   \nIs Google able to maintain its superior search algorithm and the network effect over time?  \n   \nA company with a durable competitive advantage is the one whose stock price will grow over time.  \n\n\nIf a company's business model does not have a durable competitive advantage, it won't survive for the long-term, no matter how cheap you can buy it.  \n   \nIt's sort of like buying a company that produces flip phones. Remember these? Sure you could be buying this company at a bargain P/E of 3x but is it really a bargain? It produces an outdated device with no real competitive advantage over other products and therefore, it won't see any type of growth and its stock price will cater.  \n   \nBlackberry also may had a competitive advantage at some point and that's why it became so widely used.  \n\n\nBut the advantage didn't last for long and it turns out the competitive advantage was not a durable one.  \n\n\nEvery company you look at should have a clear, durable competitive advantage.  \n\n\nFor instance, what's to keep Thor Industries, the largest manufacturer of recreational vehicles, to operate competitively?  \n\n\nBecause it has the largest and most efficient manufacturing plants and largest dealership network in the world. There is a high barrier-to-entry for any new entrants to compete. Management has been known to be great capital allocators, meaning they know when to issue debt to build a new manufacturing plant, acquire a business, or buy back its own stock.  \n\n\nThese points back up the claim that Thor has a durable competitive advantage and will keep the business growing.  \n\n\nMy favorite way of identifying this edge is to try the product or service because a customer is usually the best judge of a value. You could easily try Starbucks, Shake Shack, and many other products from consumer companies.  \n   \nFor those that are business-facing like Salesforce, you can find surveys or product usages.   \n   \nMost of the times, however, a great product/service will always show traction in the early stages.  \n   \nAmazon, Facebook, and PayPal were gaining 200% new users every year in its early days.  \n   \nAmerican Express had a crazy growth in its early years as well.  \n   \nTake Upstart for example. And this is one of my favorite companies at the moment because it's in the sweet spot of growth and valuation.  \n   \nIt's growing sales at +90% clip yoy, that compares to avg 15% growth for its peer companies.  \n   \nWithout even testing out their product, I know something is working right with the products it's offering, as evidenced by the sales growth.  \n   \nOne important thing to be mindful of is that sometimes these growth can be non-organic, meaning the growth can be a result of acquisitions or aggressive marketing spending.  \n   \nIf you are growing your sales  at 70% yoy but your user growth is only 40% yoy, that is a bad sign.  \n   \nAlternatively, if you are giving excessive concessions that your economics doesn't make sense, that's also an issue.   \n\n\nFor instance, remember Moviepass? They were charging $10/month to watch an unlimited number of movies. While the user growth was exceptional, this model was clearly unsustainable and we should be wary of these kinds of business models.  \n\n\nThe bottom line is that whenever you are looking to buy a stock of a company, the company should always have a durable competitive advantage in order for its stock to 10x in the next 5-10 years. \n\nPlease check out this [channel](https://www.youtube.com/channel/UCUDMvU3Ne27KA07rgopJnww) on YouTube for a better-explained version and check out r/Midasinvestors for steps 2 and 3!\n\nThank you all for reading and happy investing!",
        "subreddit": "ValueInvesting",
        "title": "Key Components to a Stock Analysis Part I: Comparative Advantage",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/p0olf9/key_components_to_a_stock_analysis_part_i/",
        "created": 1628490881.0
    },
    {
        "author": "kiriloman",
        "created_utc": 1627936107,
        "id": "own3sw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[https://marketdeepview.com/2021/08/02/paypal-is-dropping-after-sec-investigation/](https://marketdeepview.com/2021/08/02/paypal-is-dropping-after-sec-investigation/)",
        "subreddit": "StockMarket",
        "title": "Paypal continue on dropping",
        "url": "https://www.reddit.com/r/StockMarket/comments/own3sw/paypal_continue_on_dropping/",
        "created": 1627964907.0
    },
    {
        "author": "Suspicious_Ad2491",
        "created_utc": 1628174784,
        "id": "oyju9x",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "SQ and PYPL were almost at the same price",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oyju9x/sq_and_pypl_were_almost_at_the_same_price/",
        "created": 1628203584.0
    },
    {
        "author": "hanpress1",
        "created_utc": 1627917197,
        "id": "owgjpu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "PayPal stock on the rise?",
        "url": "https://www.reddit.com/r/StockMarket/comments/owgjpu/paypal_stock_on_the_rise/",
        "created": 1627945997.0
    },
    {
        "author": "gohackthat",
        "created_utc": 1628481917,
        "id": "p0txib",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hello investors,\n\nI am posting a revised version for clarification purposes.\n\nIn every stock analysis, there should be three key components.\n\n1. Durable competitive advantage\n2. Financial Analysis\n3. Valuation\n\nIn this post, I will be going over the first of the three: Identifying durable competitive advantage, which I would argue is the most important one out of the three because a company's financials and valuations are simply reflections of a company's competitive advantage.\n\nI've been noticing that a lot of people are leaving out some very important components to a stock analysis or taking big leaps in assumptions.\n\nFor instance, many people nowadays seem to be making premature conclusions along the lines of\n\n\"the US government is pushing for clean energy initiatives and therefore, Tesla stock will be going up\" or\n\n\"Amazon reported sales growth of 40% so the stock is a buy\" or\n\n\"Apple makes great phones and therefore, Apple stock is a great investment\".\n\nIf you've noticed, these statements are taking big leaps in assumptions. There are many factors that go into an investment decision and we need to think from multiple angles, not just a one-dimensional level such as \"Apple is introducing a new line of products and thus, Apple stock is a buy.\" We need a more in-depth analysis.\n\nI think the best way to learn is to take a look at an example analysis. This is an example copy of a one-pager stock pitch that covers all three elements: competitive advantage, financials, and valuation. For those who'd like a copy of this sample pitch please sign up to the email distribution list below and you'll receive a copy.\n\nA competitive advantage is when a company has an edge over its competitors. Most people would subscribe to Neflix over renting DVDs because it's much easier and cheaper to stream on Neflix than renting $10 DVDs. This is called competitive advantage.\n\nFor instance, a lemonade stand may have a competitive advantage over an orange juice stand because it can make lemonades at a cheaper cost than the orange juice stand.\n\nA Google's search engine has a competitive advantage over Microsoft's Edge due to the superior search algorithm and network effect.\n\nA durable competitive advantage is a company's edge that is a lasting one.\n\nTo use the previous examples, can the lemonade stand continue to produce lemonades at cheaper cost than orange juice stand?\n\nIs Google able to maintain its superior search algorithm and the network effect over time?\n\nA company with a durable competitive advantage is the one whose stock price will grow over time.\n\nIf a company's business model does not have a durable competitive advantage, it won't survive for the long-term, no matter how cheap you can buy it.\n\nIt's sort of like buying a company that produces flip phones. Remember these? Sure you could be buying this company at a bargain P/E of 3x but is it really a bargain? It produces an outdated device with no real competitive advantage over other products and therefore, it won't see any type of growth and its stock price will cater.\n\nBlackberry also may had a competitive advantage at some point and that's why it became so widely used.\n\nBut the advantage didn't last for long and it turns out the competitive advantage was not a durable one.\n\nEvery company you look at should have a clear, durable competitive advantage.\n\nFor instance, what's to keep Thor Industries, the largest manufacturer of recreational vehicles, to operate competitively?\n\nBecause it has the largest and most efficient manufacturing plants and largest dealership network in the world. There is a high barrier-to-entry for any new entrants to compete. Management has been known to be great capital allocators, meaning they know when to issue debt to build a new manufacturing plant, acquire a business, or buy back its own stock.\n\nThese points back up the claim that Thor has a durable competitive advantage and will keep the business growing.\n\nMy favorite way of identifying this edge is to try the product or service because a customer is usually the best judge of a value. You could easily try Starbucks, Shake Shack, and many other products from consumer companies.\n\nFor those that are business-facing like Salesforce, you can find surveys or product usages.\n\nMost of the times, however, a great product/service will always show traction in the early stages.\n\nAmazon, Facebook, and PayPal were gaining 200% new users every year in its early days.\n\nAmerican Express had a crazy growth in its early years as well.\n\nTake Upstart for example. And this is one of my favorite companies at the moment because it's in the sweet spot of growth and valuation.\n\nIt's growing sales at +90% clip yoy, that compares to avg 15% growth for its peer companies.\n\nWithout even testing out their product, I know something is working right with the products it's offering, as evidenced by the sales growth.\n\nOne important thing to be mindful of is that sometimes these growth can be non-organic, meaning the growth can be a result of acquisitions or aggressive marketing spending.\n\nIf you are growing your sales at 70% yoy but your user growth is only 40% yoy, that is a bad sign.\n\nAlternatively, if you are giving excessive concessions that your economics doesn't make sense, that's also an issue.\n\nFor instance, remember Moviepass? They were charging $10/month to watch an unlimited number of movies. While the user growth was exceptional, this model was clearly unsustainable and we should be wary of these kinds of business models.\n\nThe bottom line is that whenever you are looking to buy a stock of a company, the company should always have a durable competitive advantage in order for its stock to 10x in the next 5-10 years.\n\nPlease check out this [video](https://www.youtube.com/watch?v=ad89G90NUzQ) on YouTube for a better-explained version and check out [r/Midasinvestors](https://www.reddit.com/r/Midasinvestors/) for steps 2 and 3!\n\nThank you all for reading and happy investing!",
        "subreddit": "ValueInvesting",
        "title": "Key Components to a Stock Analysis Part I: Competitive Advantage",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/p0txib/key_components_to_a_stock_analysis_part_i/",
        "created": 1628510717.0
    }
]