[
    {
        "author": "BannedForGloating69",
        "created_utc": 1611781540,
        "id": "l6ee2g",
        "num_comments": 133,
        "num_crossposts": 0,
        "selftext": "**DO NOT LISTEN TO PEOPLE SAYING NOK HYPE ARE BOTS. THESE ARE FUDDERS TRYING TO GET IN CHEAPER OR EXIT POSITIONS. THE HYPE IS REAL**\n\nNokia is now a market leader in networking and enterprise level technology, essentially providing infrastructure for all types of networks. They also manufacture telecommunications equipment and engage in licensing. The most exciting opportunity in their current business model is 5G, which could be the main catalyst for this seemingly boring stock to finally break through resistance and become a valuable asset in portfolios. I'll give some key updates and price targets below. \n\n\nPartnerships and beneficiary of 5G rollouts\n\n\nFor starters, it's been a common thesis that 5G will be the greatest investing opportunity of the decade, yet Nokia remains in a flat/downward pattern on the chart. They've recently earned several contracts that will give them a stronger moat in the 5G domain as well as steady revenues and growth opportunities. Recent contracts come from a very diverse group of partners, including: \n\n-A 5 year deal with T-Mobile, in which T-Mobile will power it's 2.5GHz mid-band spectrum using Nokia's AirScale Radio platform. In addition, Nokia will facilitate T-Mobile to upgrade it's mid-band LTE network to a 5G network. \n\n-Secured a government contract via the National Cybersecurity Center for Excellence. Nokia was selected as the tech provider and collaborator for the 5G Cybersecurity Project. The federal agency plans to utilize Nokia's technology for the transition to 5G from 4G. The project intends to identify 5G use cases to highlight the efficacy of the components of 5G architecture against security threats as part of a government initiative to beef up it's cyber security and anti-spying tools.\n\n-Partnership with Google Cloud in which the 2 firms will work in unison on businesses' digital transformation at the network edge through both 5G connectivity and cloud-native applications and capabilities. The partnership's purpose is to develop solutions for communication service providers to modernize network infrastructure and ensure smooth transitions to cloud-native 5G-core. This will likely build an ecosystem of services that deployable anywhere, from network edge, to public clouds, private clouds, and carrier networks. \n\n-Nokia has also recently announced partnerships with M1 for 5G solutions in Singarpore, as well as TeleZ to deploy key infrastructure solutions for TeleZ subsribers in Sweden, Lativa, Lithuania, and Estonia. They were also awarded a contract by NASA for $14.1 million to build 4G infrastructure on the moon. \n\n\nNokia has more than 220 large enterprise customers across industries worldwide, of which at least 30 have deployed 5G. They were also in a geopolitical battle in which the U.S. expressed interest in owning a piece of the company, and in response Finland built it's stake in Nokia via Solidium Oy, the state's equity-asset manager, to 1 billion euros($1.2b usd). Nokia also intends to repurchase 500 million shares in the coming months, so demand for the stock is picking up on all levels. \n\n\nIn addition to infrastructure, licensing is a huge part of Nokia's business model that will benefit from 5G. The \"Nokia Technologies\" Arm handles patent licensing, technology licensing, and brand licensing. This includes an industry-leading patent portfolio including ~20,000 patent families including ~3500 5G standard essential patent families. \n\n\nSo why is a company with so many valuable assets and recently announced deals/partnerships still trading flat and so seemingly undervalued? The short answer is the former CEO made several bad choices which gave Nokia's competitors an upper hand on the current 5G landscape and put NOK share price in a long term downtrend which has gave it a reputation as a boring stock with an ugly chart. However, with new CEO Pekka Lundmark's expertise in driving returns to shareholders, as well as the scrutiny and subsequent bans of Huawei opening the door for competition, Nokia now has a much needed breath of life and a chance to gain market share to become the biggest beneficiary of the 5G revolution. The new CEO is determined to get Nokia to the top and pull in solid returns to shareholders, as evidenced by the slew of recent contracts/partnerships along with his plans for spending aggressively on R&amp;D, as well as developing a leaner business model by cutting unnecessary expenses and unprofitable endeavors. \n\n\nNokia is primed for growth as they plan into several emerging, high growth markets including 5G, IoT, Edge computing, Network Encryption, Cloud Radio Access, Software Defined Infrastructure(SDI), Cloud Managed LAN, Optical Communications and Networking, as well as established high growth markets such as Smart Wearables, Defense/Security, and LTE. \n\n\n\nDespite the slew of positive news surrounding Nokia and their partnerships/contracts, the stock is still very undervalued, even at today's price surge. \n\nThat may soon change, as the stock's chart is beginning to signal incoming volatility. The implied volatility(IV) and volume for NOK call options are indicating big moves in the coming months. Open interest is on the rise as well. \n\n\n\n\nNOK is trading at a Price/Book ratio of 1.3x, compared to it's peers average of 4.0x and the sector average 2.2x \n\nNOK is also undervalued in terms of Price/LTM sales. It has a ratio of 0.9x, it's peers trade at an average of 3.9x, and the sector average of 1.8x\n\nTo establish the Fair Value Estimate, we'll use 2 models taking input from previous NOK financials, as well as data from competitors. (Competitors include: CSCO, ERIC, MSI, MSFT, and AAPL.\n\nP/E Multiples: $14.94 target \n\nEarnings Power Value: $15.64 target \n\nThe average for the 2 models imply a Fair Value Estimate of $15.29 \n\n\n\n\nThese estimates are based on historical data, therefore are fair values for the current price and past performance, not taking into account the market share and recurring revenue recently secured. I believe over the 3 months ad beyond the fair value will be much higher as earnings begin to reflect the value and growth from 5G contracts and recurring revenues. \n\n\nEven currently, those estimates are a bit low as Nokia's closest competitor, Ericsson, has a market cap that is nearly 70% higher than Nokia, despite the two having very similar financials and even trailing Nokia in several key metrics. \n\n\n\nAt NOK's current share price of, it remains undervalued as ERIC is only ahead of NOK in 2 key categories, EBITDA and Profit Margin, and ERIC is only outperforming NOK by a slim margin in these categories. I believe NOK should be valued much higher, than ERIC since they are gaining contracts MUCH faster than ERIC and also Huawei, which would imply a share price of $7.11 before any buybacks place shares into the treasury, which would increase the price even further. \n\n\nNokias Fair value is over $25\n\nThis is based on competitor ERIC who is valued 68.4% higher despite having trailing NOK in almost every key metric for valuation, and the valuation of Huawei who is losing tons of revenue and contracts in favor of Nokia",
        "subreddit": "wallstreetbets",
        "title": "$NOK ain't done yet. Don't listen to the \"bot\" fud that started after the run began, N💰K🚀A is our next way out",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l6ee2g/nok_aint_done_yet_dont_listen_to_the_bot_fud_that/",
        "created": 1611810340.0
    },
    {
        "author": "BrandinoGames",
        "created_utc": 1610512022,
        "id": "kw8xmn",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "# While there are many more companies that are discussed much more than TSMC (NYSE:TSM) on here, such as Apple, AMD, Intel, NVIDIA, etc, TSMC is a hidden gem that is getting ready to take off over the next few years. Here's why:\n\nTSMC was founded in 1987 with the intent of bringing Taiwan into the global tech market. Morris Chang, who previously worked at Texas Instruments for over 30 years, is the founder and former CEO of TSMC and widely regarded as the \"godfather of computer chips\". TSMC is currently the world's largest semiconductor producer, with over half of semiconductor revenue from TSMC. Other notable competitors include GlobalFoundries (AMD used them for Zen and Zen+, switching to TSMC for Zen 2 and Zen 3), Intel, and Samsung. TSMC is a pioneer in the pure-play foundry business, meaning that they do not produce any chips for their own products. Instead, they manufacture and sell chips to companies, meaning that those who choose to source chips from TSMC do not have to build expensive silicon fabrication plants to manufacture their own chips. TSMC currently operates 10 different silicon fabs, manufacturing over 10,000 different products using over 250 distinct technologies to cater to 499 different customers in 2019.\n\nNot only is TSMC the largest semiconductor foundry, it is also a pioneer in advancing semiconductor production and performance. Currently, TSMC has 7 customers for its new 5nm chips, including Apple, for A14/X chips and ARM-based chips for Mac products, Qualcomm and MediaTek for 5G smartphone chips, AMD, for next-generation Zen 4 CPUs, Bitmain, Intel, and NVIDIA. TSMC is also currently engineering its N4 chips, built on a 4nm process node, its 3nm chips, and its 2nm chips, which will use new GAAFET (Gate All Around Field Effect Transistor) technology instead of the traditional FinFET technology.\n\n**So who are some of TSMC's biggest and most notable customers?**\n\n# Apple Inc (NASDAQ:AAPL)\n\nApple is the world's largest company in terms of market capitalization (2.17 Trillion), and has become widely popular due to its heavy and cohesive integration between its products and widespread use by many prominent figures. Currently, it offers many products such as laptops, phones, smart watches, smart TV products, fitness products, and more. It also offers many services and software products, which all integrate with each other via iCloud, continuity software such as Handoff, and more. Recently, Apple has confirmed that they are cutting support for Intel CPUs on their Mac products in a few years, meaning they will shift to using entirely Apple Silicon chips for all of their Mac products. This is in addition to Apple using their own chips for all other products that they currently produce - iPhones, iPads, smart watches, etc.\n\nApple is one of TSMC's largest customers, and that is only expected to grow as they ramp up production for their M1 and next generation ARM chips for Macs. Apple's M1 chips are a strong competitor to AMD and Intel CPUs, especially if they can scale well up to 32 and 64 cores. They are extremely efficient and consume drastically less power than x86-based CPUs (Intel and AMD CPUs), meaning that thermal requirements are much lower. Macs have typically been targeted by PC enthusiasts as an overpriced, underperforming lineup, but we may see that change as Apple's new chips perform extremely well.\n\nApple reported a yearly revenue of 274.5 billion US Dollars in 2020, roughly a 5% increase from 2019. Since Apple relies on TSMC for their chips, and Apple's Mac lineup is likely to become more popular, I would expect that TSMC's revenue from Apple will increase more than we've seen in previous years.\n\n# Advanced Micro Devices (NASDAQ:AMD)\n\nAMD has certainly made a huge return since Lisa Su became CEO in 2014 and the production of Ryzen, which was widely popular due to its high core counts and high price to performance compared to Intel. Now, Ryzen has developed into a strong all-around player, sporting high core counts and great single thread performance. Currently, AMD Ryzen 5000 desktop CPUs outperform Intel's current generation Comet Lake CPUs in games, which is the first time that AMD has surpassed Intel in gaming performance.\n\nAMD has slowly been regaining market share, both in the PC enthusiast side and the server side. In the past two years, AMD has doubled their server market share from 4.5% to 8%. This may not seem like much, but considering that server upgrades are not frequent and those who buy Intel server CPUs are more likely to stick with Intel, that is a massive increase. On the PC enthusiast side, AMD CPUs have accounted for 84% of CPUs sold on mindfactory.de, a German PC Retailer. This is a massive increase considering that in 2016, before the release of Ryzen, Intel accounted for roughly 75% of CPU sales on mindfactory.de.\n\nAMD launched their Zen 3 chips in 2020, which was followed by huge demand and a shortage of these CPUs. This was in part due to demand at TSMC not being able to keep up with AMD's orders. Zen 3 CPUs perform extremely well, and next-generation Zen 4 CPUs, which will be on TSMC's 5nm process, point to a shortage of fab space at TSMC.\n\n# Qualcomm (NASDAQ:QCOM)\n\nQualcomm is a semiconductor company that creates wireless technology chips, CPUs, software, and services related to wireless technology. Their most prominent products include their Snapdragon CPUs, used in phones from some of the largest smartphone companies such as Samsung, LG, OnePlus, Xiaomi, Motorola, and more. They also produce application specific processors for things like cameras, IoT devices, kiosks, robots, and a lot more. Additionally, Qualcomm offers desktop CPUs, such as their Snapdragon 8cx. Qualcomm also produces various connectivity chips for things such as WiFi (onboard chips in laptops, desktop Wifi cards, routers, modems, etc), Bluetooth, and internet connectivity chips on smartphones.\n\nCurrently, Qualcomm relies on TSMC for the production of its Snapdragon chips. Although Samsung beat out TSMC for the production of Qualcomm's upcoming 5G chips, mobile chips accounted for 44.8% of Qualcomm's total revenue in 2020, while RF Front End chips (smartphone internet connectivity chips) accounted for just 9.8% of Qualcomm's total revenue.\n\n# NVIDIA (NASDAQ:NVDA)\n\nNVIDIA has been a long time customer of TSMC, dating all the way back to 1998 when NVIDIA switched over to TSMC's 350nm process for the Riva TNT. Since then, TSMC has manufactured nearly every NVIDIA chip up until RTX 3000 series, also known as Ampere. NVIDIA decided to switch to Samsung's 8N 8nm process node, likely due to financial reasons or fab capacity reasons.\n\nHowever, NVIDIA is allegedly moving back to TSMC to manufacture more Ampere GPUs using their 7nm process. There could be a few reasons for this - TSMC might have offered NVIDIA a deal, or capacity for 7nm fabs may have opened up due to large customers such as Apple and AMD shifting more focus towards TSMC's 5nm process.\n\nNVIDIA's RTX 3000 series GPUs, also known as Ampere, are a massive improvement in the GPU space compared to previous generations and just for performance in general. The RTX 3070 performs similarly to an RTX 2080ti, where the former has an MSRP of 499 USD and the latter has an MSRP of 999 USD. In addition to much greater price/performance, Ampere GPUs also heavily increase ray tracing performance so games that can take advantage of ray tracing hardware are actually playable. They are extremely popular, and currently Ampere GPUs are selling anywhere from 200 to upwards of 1500 dollars of their MSRP. NVIDIA is also huge in the AI/Computing space, teaming up with NIO for AI-based self-driving computation, Photoshop, for neural filters, and also  powers some of the fastest supercomputers in the world. In regards to AMD, NVIDIA blows the new RX 6000 series GPUs out of the water for things like streaming performance and workstation performance.\n\n# Intel (NASDAQ:INTC)\n\nWhile Intel has traditionally manufactured most of their products (Internet connectivity products, processors, chipsets, etc), Intel is reportedly shifting a fair amount of their chips to TSMC. Recently, Intel announced they would use TSMC for 7nm Xe graphics chips on their CPUs. In October of 2020, Intel CEO Bob Swan said Intel would decide by January whether it was going to expand its 7nm production, outsource it to a foundry, or both. Intel has severely underperformed in the CPU space compared to AMD, but if they decide to shift some production to TSMC, this could mean that Intel will make a strong return into the CPU space and strong entry into the GPU space.\n\n# Cool, but what does this mean?\n\nAgain, TSMC is the largest foundry, outclassing the likes of Samsung, GlobalFoundries, and other similar companies. There is an insane amount of demand for TSMC's chips, and they are extremely competitive compared to other manufacturers. TSMC has customers such as Apple, AMD, and Qualcomm, which all have great products and are only expected to grow with the release of new technology such as CPUs or 5G networking. Many of its customers are expected to have massive growth over the coming years, meaning that TSMC will reap some of those profits.\n\n# Ok, but why should I buy now?\n\nI mean, TSMC is already up over 100% over the past year, isn't it too late to buy in?\n\nWhen you consider its most important clients, all of them are going to use TSMC for future products that are important to their respective segments. Apple has just begun their venture into producing their own CPUs for Mac products, the release of DDR5 and PCIe 5.0 is right around the corner with AMD's Zen 4 processors, set to release late 2021 or 2022, Qualcomm producing next generation Snapdragon CPUs (and we may see 5G production shifted to TSMC), Intel actually producing competitive CPUs once again (which might be with TSMC), and NVIDIA continuing to dominate in the computing space and the GPU space. Considering that all of these things are happening in the next few years, TSMC is getting ready to take off.\n\nPositions: Currently holding 4/21 calls, will definitely roll calls and load up on more once we get closer to expiry",
        "subreddit": "wallstreetbets",
        "title": "[Serious DD] TSMC - A Hidden Gem Offering Free Money",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kw8xmn/serious_dd_tsmc_a_hidden_gem_offering_free_money/",
        "created": 1610540822.0
    },
    {
        "author": "Historical-Comment36",
        "created_utc": 1610655929,
        "id": "kxdyg8",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": " **TL:DR**\n\n* This is Part 2 of what is now going to be a three part deep dive on Smartsheet (Ticker: SMAR).\n* This second part walks you through the beginning of my four piece framework of trying to figure out if the stock can 10x from here: (1) Leadership (2) Risks (3) Price and (4) Growth.\n* In this second part, we are just going to focus on (1) Leadership. As I was writing, I found that Leadership is a very important part of the Smartsheet story and it needed its own article to do it justice. You can read [Part 1 here](https://onthemarkpicks.com/2021/01/01/deep-dive-2-part-1-of-2-smartsheet-solving-the-productivity-paradox/).\n* Smartsheet is an exciting SaaS company that’s helping businesses be more productive and get the most out of their people\n* I am not a financial advisor and this is not investment advice. These are just my opinions to help facilitate learning and discussion.\n\nHi everyone, thanks for coming back for Part 2. I’m excited to bring you more research and insights on Smartsheet (NYSE: SMAR). Let’s dive in.\n\n**Can we 10X from here?**\n\nFor someone like me that is on the younger side and with a longer investment time horizon, and probably you if you are reading this, an important question to ask yourself is “Do I think this investment could 10x from here?”. In other words, could this investment one day be 10 times what it is worth today? To try to answer this question, I will work through a pre-determined framework that I believe gives us the best path to find out.\n\nThe framework includes:\n\nLeadership – Desire, Purpose and Ownership\n\nRisk Considerations\n\nPrice Considerations\n\nExplosive Business Growth\n\n**1. Leadership – Desire, Purpose, Ownership**\n\nFor a company to do something as spectacular as 10x, we are going to need to see really strong and talented leadership. In Chris Mayer’s excellent book “100 Baggers”, he dedicates a part of the book to talk about the importance of what he calls “Owner Operators”. By this he means that the CEO of the company owns a substantial amount of stock in the company themselves. Why is this important? If the CEO has their own personal wealth at stake in the company’s stock (just like we do as shareholders) their interests are more aligned with shareholders and maximizing returns for shareholders than they would be if that CEO had no skin in the game. It’s also better in my opinion if the CEO of the company was also the founder of the company. For these founder-CEO’s that have money invested in their own company, it really is like their baby. Would you rather have your money invested with someone who views the company as their baby or with someone who was just hired to watch this kid (the company)?\n\nIn the case of Smartsheet, we check all the boxes when it comes to leadership. Mark Mader is not only an Owner Operator, he is also a co-founder. I touched on this a little bit in part 1, but Mark co-founded Smartsheet along with Brent Frei in 2005. They both played football (American football) for Dartmouth College, an Ivy League School. They met in the fall of 1988 when Mark was a freshman on the team and Brent, who had graduated the prior year, was serving as a Graduate Assistant for the team.\n\nAfter that season, Brent moved on to begin a career in computer engineering. Mark quit the football team after 1 year. In an interview with Forbes, he said that after his freshman season he thought it was too much to juggle Ivy League academics and being a NCAA Division 1 athlete. Mark started focusing solely on academics until a tragedy struck. One of his best friends from his high school football team got into an accident and was critically injured. His friend would never be able to play football again. This had a profound impact on Mark. He said in the interview that knowing one of his friends would never be able to play again made him realize that if he still has the ability to play football, he needs to go do it. He went to his old coach, told him the story about his friend and asked for his spot on the team back. The coach accepted and Mark went on to finish his career in the fall of 1991 as a 6’4”, 245lb offensive lineman.\n\nMark said that this experience with his friend and re-joining the football team taught him not to take anything for granted. He said ever since then he tries to do his best with everything and make the most out of every opportunity. That mindset has served him well as he now sits as a CEO of a $8.5 billion company. But he’s really just getting started. That mindset lives on today. The day that he took Smartsheet public, April 27, 2018, he was asked if he plans on celebrating the achievement, he said “We have 74,000 customers that don’t want us to party, they want us to work on the product.” How did Mark get to the point where he was CEO of a tech company with 74,000 customers that raised $150 million during their IPO? I’ll share with you a little more history behind the company.\n\nAfter Brent Frei left Dartmouth, he started his career in computer engineering as I mentioned before. His career started with Motorola in 1989, then he went to Microsoft in 1991, and then he founded his first company, Onyx Software in 1994. It didn’t take long before his buddy from college, Mark Mader, would come join him at the start-up. Mark joined in 1995 and eventually worked his way up to an Executive role within the firm.\n\nThe focus of Onyx was Customer Relationship Management (CRM) software. Brent was the CEO and Mark became the SVP of Global Services. Brent led the company through an IPO in 1999 right before the tech bubble burst. It was really unfortunate timing because a lot of their customers were dotcoms that went out of business. Brent was still able to lead them through stiff competition with Salesforce in the early 2000’s until he hit a plateau in 2004. He decided to step down from the company he had founded 10 years earlier. On his last call with investors, he was quoted as saying “I believe it’s the right time for me to turn over the reins to a new CEO who can take Onyx to new heights over the next decade,”. All the while, Mark was there in the background learning and observing. He saw what went right – they built a large publicly traded company from scratch. And he saw what went wrong – their growth stalled as they lost market share to Salesforce.\n\nOnly a year after resigning from Onyx, Brent was on to his next big move and he again recruited his friend Mark to help. They were going to found Smartsheet, a company to help improve the way people work. This time, Mark was a Co-Founder along with Brent and had a much bigger influence on the company. His influence got even larger in 2017, 12 years after the founding, when Brent left to found his 3rd company, TerraClear. Brent left to go back to his roots in Idaho where he grew up on the family farm. His new start-up TerraClear seeks to solve one of the largest unsolved problems in farming today – clearing rocks from farming land. As crazy as that sounds, apparently it’s a big issue. Hence the name, TerraClear. Brent is still on the Board of Directors of Smartsheet.\n\nGoing back to the IPO date (April 27, 2018), which was only 4 months after Brent had left, Mark was asked by the press what he had learned from being at Onyx when they went public. Mark was very clear in his response and said that one of the main lessons from Onyx was to “not get too enamored with your product”. With Smartsheet, he wants to make sure they’re always improving the product and the user experience. He also said that investors don’t buy a stock based on what you’ve done in the past, but what you plan to do. “If you are always looking at the rear view mirror, then you are not running the business” he said. This is exactly how I want the leaders of companies I invest in to be thinking. He is very forward thinking, customer focused, and humble. There is a lot of evidence to corroborate that he has followed through on the statements he made that day.\n\nOne of the first pieces of evidence I found that supports my thesis of Mark being very focused on the product and user experience is the incredible ratings that the product has received from its customers. I use a tool called Net Promoter Score (NPS) which is one of the most reliable and unbiased ways to find out what a customers true experience with a business is and how likely they would be to recommend it to a friend. For Smartsheet, their NPS is extremely high. It’s on a scale of -100 to 100 so anything above 0 is considered to be good. If the rating is above 0, it essentially more people would recommend the product to a friend than they would tell them not to use it. Smartsheet has an NPS of 80, which is honestly one of the highest I have ever seen.\n\nFurther evidence to support Mark and the rest of management’s commitment to product quality and user experience is the exceptional ratings the product has on the Apple App Store. This is just for the mobile version of the product, the app that you can download on your phone just like you would download the mobile version of Outlook. The rating in the App Store is 4.8/5. That’s very impressive as well.\n\nBased on how customers are responding to the product, I think it’s fair to say that Mark was not [B.S.ing](https://b.s.ing/) his way through that interview on IPO day. He and his management team really have been focused on creating a stellar product and the results are showing. When I say that “Desire and Purpose” are important traits of a leader of a company it means that I want to see a leader who has a real desire to do what he/she is doing as the CEO of the company, believes in their product(s) and services, and has a real purpose for why they want to do that. I can tell that Mark is committed to the mission of improving the way people work. Being one of the founders, and having written an E-Book on the “Productivity Paradox” that I mentioned in Part 1, I think this mission is very near and dear to his heart and that he has a desire to see the impact and scale of his company grow well into the future. As shareholders, that’s what we want.\n\nAnother way to see if the leader of the company has “Desire and Purpose” is to see how his/her employees perceive them. Do the employees look up to this person? Do they feel motivated to work hard because they know what they’re doing is meaningful and can make a positive difference in people’s lives? One way I have of gaining insight into this is to look at the company’s Glassdoor ratings and specifically the rating of the CEO. In the case of Smartsheet, the positive story continues. The company has a 4.1/5 rating on Glassdoor and Mark has a 90% approval rate from his employees which is well above average. To me this shows he’s communicating the company’s purpose to the employees very well and is motivating them to actualize that purpose.\n\nThere’s one other piece of evidence I stumbled upon that gives good insight into the culture that Mark and his management team are building at Smartsheet. They were recently (12/17/20) awarded “Best Company Culture” and “Best Companies for Women” by Comparably. Below you can see a screenshot of the headline from a Business Wire article about this. It’s one thing to be awarded for “Best Company Culture” but to also be a “Best Companies for Women” when you’re in a heavily male dominated industry such as computer software, that really says something. It speaks to the culture of diversity and inclusiveness that Mark is building there which goes a long way in the year 2021 when social issues are at the forefront of people’s minds more than ever. The modern enterprise has to build a culture of diversity and inclusiveness if they want to retain the most talented employees and keep them motivated. Smartsheet is doing a good job of this.\n\nSource – Smartsheet making headlines for their outstanding company culture.\n\nI think we’ve found a lot of evidence to support that this leadership team has a strong desire to fulfil their purpose. It’s evident that they want to help improve the way people work and that they’ve invested heavily into making this happen while keeping employees motivated and focused on the goal. The last piece I look at for leadership is ownership. Does the CEO have a personal financial stake in the company? This is such a key thing to look for because as I mentioned earlier in the article, if leadership themselves owns a substantial amount of shares, then their interests and motivations will align with us, the shareholders. They essentially are a shareholder too, just like us. On top of the desire and purpose that we’ve established is present, there’s also a financial incentive for Mark and the team to lead the company to success, and ultimately, a higher share price.\n\nCurrently, Mark holds 490,267 shares which comes out to a value of $34 million as of this writing (1/14/21). I’d consider that substantial for an individual person. Even more noteworthy is that Brent owns 3.2 million shares which comes out to a value of $218 million. Brent owns that much of the company still and he’s not even involved beyond being on the Board of Directors. I think that’s a testament to how much confidence he has in Mark to lead Smartsheet to new heights. Also, it’s important to keep in mind that he left Smartsheet to help with his family business. He saw his 80 year old Dad picking up rocks on the farm with his bare hands and realized he wanted to help solve this problem in the farming industry. Leaving Smartsheet was not like when he left Onyx because the business was plateauing. As a matter of fact, Smartsheet was rapidly growing at that time and was about to go public. The fact that he still has $218 million worth of shares in the company shows he still believes in the company and what Mark can do with it now and in the future.\n\nThis concludes Part 2 of my Smartsheet deep dive. Hope you enjoyed and be sure to subscribe so you can stay tuned for Part 3, our next pick, and news &amp; updates about existing picks.\n\nDisclosure: I am long SMAR. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article.",
        "subreddit": "wallstreetbets",
        "title": "Smartsheet (NYSE: SMAR) - Deep Dive Research",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kxdyg8/smartsheet_nyse_smar_deep_dive_research/",
        "created": 1610684729.0
    },
    {
        "author": "alfen-dave",
        "created_utc": 1610000346,
        "id": "ks7bnx",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "''Motherboard vendor Gigabyte says its customers can expect Intel’s Rocket Lake desktop CPUs to arrive in March. \n\nThe vendor made the announcement in a press release discussing how existing Z490 Gigabyte motherboards that use PCI Express 4.0 will support the upcoming CPUs. “The latest 11th Gen. Intel Core processors will be launched on March 2021,” the statement says.\n\nThe news comes after rival motherboard maker MSI mentioned in a tech forum that Intel’s Rocket Lake is scheduled to land at the end of March. ''\n\n\n\nhttps://www.pcmag.com/news/gigabyte-intels-rocket-lake-desktop-cpus-will-arrive-in-march\n\n\n\n\n\nInteresting. We all obviously know it wont compete with what AMD has performance wise, but if it has a decent pricing on it, it might be interesting to short some calls on it.\n\nMight top at 60$ by Spring (and will surely crash right down)\nafter.",
        "subreddit": "wallstreetbets",
        "title": "[Ready your Calls] Intel's Rocket Lake Desktop CPUs Will Arrive in March",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ks7bnx/ready_your_calls_intels_rocket_lake_desktop_cpus/",
        "created": 1610029146.0
    },
    {
        "author": "Historical-Comment36",
        "created_utc": 1610655329,
        "id": "kxdr5k",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": " **TL:DR**\n\n* This is Part 2 of what is now going to be a three part deep dive on Smartsheet (Ticker: SMAR).\n* This second part walks you through the beginning of my four piece framework of trying to figure out if the stock can 10x from here: (1) Leadership (2) Risks (3) Price and (4) Growth.\n* In this second part, we are just going to focus on (1) Leadership. As I was writing, I found that Leadership is a very important part of the Smartsheet story and it needed its own article to do it justice. You can read [Part 1 here](https://onthemarkpicks.com/2021/01/01/deep-dive-2-part-1-of-2-smartsheet-solving-the-productivity-paradox/).\n* Smartsheet is an exciting SaaS company that’s helping businesses be more productive and get the most out of their people\n* I am not a financial advisor and this is not investment advice. These are just my opinions to help facilitate learning and discussion.\n\nHi everyone, thanks for coming back for Part 2. I’m excited to bring you more research and insights on Smartsheet (NYSE: SMAR). Let’s dive in.\n\n**Can we 10X from here?**\n\nFor someone like me that is on the younger side and with a longer investment time horizon, and probably you if you are reading this, an important question to ask yourself is “Do I think this investment could 10x from here?”. In other words, could this investment one day be 10 times what it is worth today? To try to answer this question, I will work through a pre-determined framework that I believe gives us the best path to find out.\n\nThe framework includes:\n\nLeadership – Desire, Purpose and Ownership\n\nRisk Considerations\n\nPrice Considerations\n\nExplosive Business Growth\n\n**1. Leadership – Desire, Purpose, Ownership**\n\nFor a company to do something as spectacular as 10x, we are going to need to see really strong and talented leadership. In Chris Mayer’s excellent book “100 Baggers”, he dedicates a part of the book to talk about the importance of what he calls “Owner Operators”. By this he means that the CEO of the company owns a substantial amount of stock in the company themselves. Why is this important? If the CEO has their own personal wealth at stake in the company’s stock (just like we do as shareholders) their interests are more aligned with shareholders and maximizing returns for shareholders than they would be if that CEO had no skin in the game. It’s also better in my opinion if the CEO of the company was also the founder of the company. For these founder-CEO’s that have money invested in their own company, it really is like their baby. Would you rather have your money invested with someone who views the company as their baby or with someone who was just hired to watch this kid (the company)?\n\nIn the case of Smartsheet, we check all the boxes when it comes to leadership. Mark Mader is not only an Owner Operator, he is also a co-founder. I touched on this a little bit in part 1, but Mark co-founded Smartsheet along with Brent Frei in 2005. They both played football (American football) for Dartmouth College, an Ivy League School. They met in the fall of 1988 when Mark was a freshman on the team and Brent, who had graduated the prior year, was serving as a Graduate Assistant for the team.\n\nAfter that season, Brent moved on to begin a career in computer engineering. Mark quit the football team after 1 year. In an interview with Forbes, he said that after his freshman season he thought it was too much to juggle Ivy League academics and being a NCAA Division 1 athlete. Mark started focusing solely on academics until a tragedy struck. One of his best friends from his high school football team got into an accident and was critically injured. His friend would never be able to play football again. This had a profound impact on Mark. He said in the interview that knowing one of his friends would never be able to play again made him realize that if he still has the ability to play football, he needs to go do it. He went to his old coach, told him the story about his friend and asked for his spot on the team back. The coach accepted and Mark went on to finish his career in the fall of 1991 as a 6’4”, 245lb offensive lineman.\n\nMark said that this experience with his friend and re-joining the football team taught him not to take anything for granted. He said ever since then he tries to do his best with everything and make the most out of every opportunity. That mindset has served him well as he now sits as a CEO of a $8.5 billion company. But he’s really just getting started. That mindset lives on today. The day that he took Smartsheet public, April 27, 2018, he was asked if he plans on celebrating the achievement, he said “We have 74,000 customers that don’t want us to party, they want us to work on the product.” How did Mark get to the point where he was CEO of a tech company with 74,000 customers that raised $150 million during their IPO? I’ll share with you a little more history behind the company.\n\nAfter Brent Frei left Dartmouth, he started his career in computer engineering as I mentioned before. His career started with Motorola in 1989, then he went to Microsoft in 1991, and then he founded his first company, Onyx Software in 1994. It didn’t take long before his buddy from college, Mark Mader, would come join him at the start-up. Mark joined in 1995 and eventually worked his way up to an Executive role within the firm.\n\nThe focus of Onyx was Customer Relationship Management (CRM) software. Brent was the CEO and Mark became the SVP of Global Services. Brent led the company through an IPO in 1999 right before the tech bubble burst. It was really unfortunate timing because a lot of their customers were dotcoms that went out of business. Brent was still able to lead them through stiff competition with Salesforce in the early 2000’s until he hit a plateau in 2004. He decided to step down from the company he had founded 10 years earlier. On his last call with investors, he was quoted as saying “I believe it’s the right time for me to turn over the reins to a new CEO who can take Onyx to new heights over the next decade,”. All the while, Mark was there in the background learning and observing. He saw what went right – they built a large publicly traded company from scratch. And he saw what went wrong – their growth stalled as they lost market share to Salesforce.\n\nOnly a year after resigning from Onyx, Brent was on to his next big move and he again recruited his friend Mark to help. They were going to found Smartsheet, a company to help improve the way people work. This time, Mark was a Co-Founder along with Brent and had a much bigger influence on the company. His influence got even larger in 2017, 12 years after the founding, when Brent left to found his 3rd company, TerraClear. Brent left to go back to his roots in Idaho where he grew up on the family farm. His new start-up TerraClear seeks to solve one of the largest unsolved problems in farming today – clearing rocks from farming land. As crazy as that sounds, apparently it’s a big issue. Hence the name, TerraClear. Brent is still on the Board of Directors of Smartsheet.\n\nGoing back to the IPO date (April 27, 2018), which was only 4 months after Brent had left, Mark was asked by the press what he had learned from being at Onyx when they went public. Mark was very clear in his response and said that one of the main lessons from Onyx was to “not get too enamored with your product”. With Smartsheet, he wants to make sure they’re always improving the product and the user experience. He also said that investors don’t buy a stock based on what you’ve done in the past, but what you plan to do. “If you are always looking at the rear view mirror, then you are not running the business” he said. This is exactly how I want the leaders of companies I invest in to be thinking. He is very forward thinking, customer focused, and humble. There is a lot of evidence to corroborate that he has followed through on the statements he made that day.\n\nOne of the first pieces of evidence I found that supports my thesis of Mark being very focused on the product and user experience is the incredible ratings that the product has received from its customers. I use a tool called Net Promoter Score (NPS) which is one of the most reliable and unbiased ways to find out what a customers true experience with a business is and how likely they would be to recommend it to a friend. For Smartsheet, their NPS is extremely high. It’s on a scale of -100 to 100 so anything above 0 is considered to be good. If the rating is above 0, it essentially more people would recommend the product to a friend than they would tell them not to use it. Smartsheet has an NPS of 80, which is honestly one of the highest I have ever seen.\n\nFurther evidence to support Mark and the rest of management’s commitment to product quality and user experience is the exceptional ratings the product has on the Apple App Store. This is just for the mobile version of the product, the app that you can download on your phone just like you would download the mobile version of Outlook. The rating in the App Store is 4.8/5. That’s very impressive as well.\n\nBased on how customers are responding to the product, I think it’s fair to say that Mark was not [B.S.ing](https://b.s.ing/) his way through that interview on IPO day. He and his management team really have been focused on creating a stellar product and the results are showing. When I say that “Desire and Purpose” are important traits of a leader of a company it means that I want to see a leader who has a real desire to do what he/she is doing as the CEO of the company, believes in their product(s) and services, and has a real purpose for why they want to do that. I can tell that Mark is committed to the mission of improving the way people work. Being one of the founders, and having written an E-Book on the “Productivity Paradox” that I mentioned in Part 1, I think this mission is very near and dear to his heart and that he has a desire to see the impact and scale of his company grow well into the future. As shareholders, that’s what we want.\n\nAnother way to see if the leader of the company has “Desire and Purpose” is to see how his/her employees perceive them. Do the employees look up to this person? Do they feel motivated to work hard because they know what they’re doing is meaningful and can make a positive difference in people’s lives? One way I have of gaining insight into this is to look at the company’s Glassdoor ratings and specifically the rating of the CEO. In the case of Smartsheet, the positive story continues. The company has a 4.1/5 rating on Glassdoor and Mark has a 90% approval rate from his employees which is well above average. To me this shows he’s communicating the company’s purpose to the employees very well and is motivating them to actualize that purpose.\n\nThere’s one other piece of evidence I stumbled upon that gives good insight into the culture that Mark and his management team are building at Smartsheet. They were recently (12/17/20) awarded “Best Company Culture” and “Best Companies for Women” by Comparably. Below you can see a screenshot of the headline from a Business Wire article about this. It’s one thing to be awarded for “Best Company Culture” but to also be a “Best Companies for Women” when you’re in a heavily male dominated industry such as computer software, that really says something. It speaks to the culture of diversity and inclusiveness that Mark is building there which goes a long way in the year 2021 when social issues are at the forefront of people’s minds more than ever. The modern enterprise has to build a culture of diversity and inclusiveness if they want to retain the most talented employees and keep them motivated. Smartsheet is doing a good job of this.\n\nSource – Smartsheet making headlines for their outstanding company culture.\n\nI think we’ve found a lot of evidence to support that this leadership team has a strong desire to fulfil their purpose. It’s evident that they want to help improve the way people work and that they’ve invested heavily into making this happen while keeping employees motivated and focused on the goal. The last piece I look at for leadership is ownership. Does the CEO have a personal financial stake in the company? This is such a key thing to look for because as I mentioned earlier in the article, if leadership themselves owns a substantial amount of shares, then their interests and motivations will align with us, the shareholders. They essentially are a shareholder too, just like us. On top of the desire and purpose that we’ve established is present, there’s also a financial incentive for Mark and the team to lead the company to success, and ultimately, a higher share price.\n\nCurrently, Mark holds 490,267 shares which comes out to a value of $34 million as of this writing (1/14/21). I’d consider that substantial for an individual person. Even more noteworthy is that Brent owns 3.2 million shares which comes out to a value of $218 million. Brent owns that much of the company still and he’s not even involved beyond being on the Board of Directors. I think that’s a testament to how much confidence he has in Mark to lead Smartsheet to new heights. Also, it’s important to keep in mind that he left Smartsheet to help with his family business. He saw his 80 year old Dad picking up rocks on the farm with his bare hands and realized he wanted to help solve this problem in the farming industry. Leaving Smartsheet was not like when he left Onyx because the business was plateauing. As a matter of fact, Smartsheet was rapidly growing at that time and was about to go public. The fact that he still has $218 million worth of shares in the company shows he still believes in the company and what Mark can do with it now and in the future.\n\nThis concludes Part 2 of my Smartsheet deep dive. Hope you enjoyed and be sure to subscribe so you can stay tuned for Part 3, our next pick, and news &amp; updates about existing picks.\n\nDisclosure: I am long SMAR. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article.",
        "subreddit": "StockMarket",
        "title": "Smartsheet (NYSE: SMAR) - Deep Dive Research",
        "url": "https://www.reddit.com/r/StockMarket/comments/kxdr5k/smartsheet_nyse_smar_deep_dive_research/",
        "created": 1610684129.0
    },
    {
        "author": "TripleBrain",
        "created_utc": 1611652182,
        "id": "l5abof",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Financials:\nTicker Symbol: BB\nPrice: $15.00\nMarket Cap: $7.9B\nTrailing 12-month Revenue: $1.04B\n2020 Q3 Revenue: 0.02\nEstimate 2020 Q4 EPS: 0.01\nPrice-to-Sale: 8.13\n\nNote: This was copy/pasted from my Google Doc, so all figures and charts are hidden. Message me directly for the link if you’re interested. I included figure legends for some reference. \n\nIf you’re reading this post, then you probably haven’t given your boss the middle finger and retired yourself on your new private island funded by the gains from the Gamestop (wallstreetbets) crusade against the MM’s. I missed that train after having unloaded my $5,000 leap calls position on GME back in November - but gains come and go. \nI’ve already made a post on why I believe Shift is a great investment both in the short term and long term, so if you’re interested, you can check out my post history for more on that. \n\nThis time around, I’ve got my eyes set on BB. I’ve started a position in September (before the WSB hype-train began) and I’m here to share my findings as comprehensively and analytically as possible. At this time, I do not believe BB is assessed properly and it’s valuation has astronomical potential if the cards are played correctly by BB management. \n\nFirst and foremost, I owned a Blackberry ages ago when it was actually cool to have one of those keyboard on screen devices. It was a flex-phone for sure and people loved it for some time. From 2009-2012, Blackberry was on top of the smartphone world having created an aesthetically pleasing device, both functional and practical for professionals to get their day-to-day tasks done on the phone. In the midst of this smartphone revolution, Apple had already released its iPhone in 2007, and garnered attention from the tech world for its design, accessibility, and the branding. Between 2010 and 2012, Apple iPhone sales jumped nearly 400% from 39.99M units to 125.05M - the rest was history. At around the same time, other smartphone manufacturers upped their antics with new technology (Samsung, Motorola, Nokia, etc), ultimately overshadowing the classic Blackberry devices that were once so loved.\n\n\n\nFast forward to 2013, current CEO John Chen was appointed to make a difference at Blackberry, which by then had reduced revenue by 50% since 2011. Their CEO made a swift move to downsize the company from smartphone designer/manufacturer to a more diversified, stable, and less competitive market (at the time). By 2014, just less than one year under Chen’s leadership, Blackberry quietly transitioned into the cybersecurity software space, building OS platforms to ensure the safety and encryption of data for automobile companies like VW, BMW, Audi, Ford, GM, Honda, Hyundai, Jaguar Land Rover, Kia, Maserati, Mercedes, among others. This OS platform, known as QNX, is responsible for delivering advanced driver assistance, controlling digital instrument clusters and connectivity modules, as well as support hands free communication technology and infotainment in your beloved cars. Fun fact, QNX was originally imbedded into Blackberry's tablet devices, and was later acquired in 2010 by Blackberry from Harman International for $200M.\n\n\nFigure 1: Blackberry QNX/Spark sales progression 2016-2020 demonstrates consistent growth and sales margins are beginning to reach near 90% levels, suggesting lower overhead costs associated with maintaining and improving the software.\n\n\nThe QNX OS is now used in over 175 million vehicles worldwide! In 2017, Blackberry reported that the QNX software is sold at a $3-5 per unit vehicle, which amounts to roughly $700M in revenue from QNX between 2010-2017. This isn’t a substantial figure, but within the last 3-4 years, the EV automotive industry has grown exponentially (see figure below), and the increased reliance of technology and data in cars creates an enormous demand for software and cybersecurity. Data encryption is extremely valuable, and Blackberry is waiting at the gate with all arms wide open to capture this market. This demand will not only increase the flux of QNX sales but may also give Blackberry leverage to increase the cost per unit vehicle of this technology. \n\n\nFigure 2: EV sales from 2008-2018, representing a 3.5% growth in the total market share of the automotive industry. \n\n\n\n\n\n\n\nFigure 3&amp;4: Supporting EV market demand and EV cybersecurity demand correlation, both figures overlay perfectly to show that the growth in the EV space inevitably creates an appreciation from cybersecurity. Ensuring the safety of driver data is incredibly important and essential for companies to build roadmaps and products that best serve the consumers. Expected automotive cybersecurity market growth is at 18.5% CAGR!\n\n\nSo the big question is competition. Why can’t Blackberry competitors (like Apple, Argus, Herman, Centri, Arxan, etc.) just crush Blackberry? \nKeep in mind that BlackBerry is already integrated with some of the largest automakers in the world, and there hasn’t been any major issues, data breaches, or anything especially faulty with QNX. Car manufacturers will avoid the cost of integrating new or alternative technologies into their vehicles if QNX poses insignificant issues. The time to develop another partnership, pairing new OS systems, and marketing would not make sense for an already frail industry with low margins. Moreover, a history into the OS performance shows that QNX sets a benchmark for reliability and diverse functionality:\n\n\nFigure 5: QNX wide range application in a typical vehicle. QNX is fully equipped in the infotainment, instrumental clusters, Hypervisor Safety system, and OTA software update instruments. \n\nNote, brands that have already integrated QXN technology are also making shifts towards fully EV vehicles, among this, are other emerging EV companies tapping into this space (i.e. Xpeng, Ronovo, Damon Motorcycle, BYD, etc.). The potential finds its way into uncharted territories as even bonafide manufacturers like GM, Ford, VW are all QXN customers making a quick transition towards full EV. This not only bolsters the potential reach of QXN technology, but makes it more desirable as an OS to compete against none other than Tesla at this moment. The $3-$5 per unit vehicle for QXN technology may be revisited and increased by multiple folds.\n\nNow, taking our eyes off the bread n’ butter QXN OS technology, let me introduce to you Blackberry’s rather new Spark Suite cyber security technology. John Chen puts the demand for the product best in his 2019 interview, explaining that the digital transformation across businesses around the world creates target points for cyber criminals to breach into sensitive data and the increased volume of IoT endpoints, Spark Suites provides a consolidated and simplified security software to prevent these attacks. One such customer is Australia’s largest payment processing company, BPAY, similar to that of Paypal, which employs Spark Suite to manage all of its endpoint security. See below for a sample of Blackberry Spark Suite’s interphase:\n\n\nFigure 6: An overview of the interactive layer screen for Blackberry Spark Suite’s technology, showing a simplified but consolidated security system to protect companies all around the world from cyber attacks and data breaches. \n\nSpark Suite Description Direct from Blackberry’s Page: \n\n“UES: AI-Enabled Security Across All Endpoints \nBlackBerry Spark is built to enable a Zero Trust security environment, focused on protection across any endpoint and continuously validating that trust at every event or transaction. By validating user actions, it continuously authenticates users to deliver a Zero Touch experience that improves security with no user interruption. \nUEM: Advanced Device and Application Management\nYour network is expanding with more endpoints than ever before. With a combination of security innovation, management tools, platform stability, deep experience across operational environments, and enhanced productivity applications, BlackBerry Spark Suites deliver the right capabilities to support your endpoint management and workforce productivity needs.”\nFor additional reference, the global endpoint security market size is expected to grow from USD 12.8 billion in 2019 to USD 18.4 billion by 2024, at a Compound Annual Growth Rate (CAGR) of 7.6% during the forecast period. This figure, which was assessed in 2019, is subject to change more towards an undervaluation than not. Global endpoint security is the backbone of essentially all tech-based companies because sensitive data, field-collected data, and internal data are all vital and confidential information. Of course, there are major competitors in this space as well, but with Blackberry having a mover’s advantage and the longest list of patented technology, they are going to be a dominant force and a recognizable name for potential partners. \n\nHere is a comprehensive list of products offered by Blackberry: \n\n\nFigure 7: Blackberry product offerings include endpoint security, personal and enterprise communication security, alerts and crisis communication services, endpoint management, mobile and digital applications for personal and workplace uses, transportation, QXN embedded technology and software, and antivirus for consumer protection. \nThe collective global market size enjoyed by Blackberry at this time is broken down roughly on the below:\n\n\nAutomotive cyber security\n1.15B - 1.35B (Projected 7.8B by 2030)\nGlobal cyber security\n112.1B\nCommunication security\n11.1B\nEndpoint Management\n25.9B\nEstimated Total (Underestimation)\n150-155B\n\nThis is a very rough, but under-evaluation of Blackberry’s market exposure, as I did not incorporate the more niche products and services markets offered by Blackberry. I also avoided including the 39,000 patents which I have no way to quantify the actual value. These patents, however, are a major part of the future roadmap to Blackberry’s continued success and growth as they are segways into partnerships and licensing deals (particularly in the security and smartphone space). But back to the market share. At a modest 5% average market share across all the board in the future, the annual revenue can reach $7.5B. This is of course current numbers, with project market sizes subject to significant increases with the digital transformation rippling across the globe. At a fair 8x earnings multiple, I anticipate Blackberry to reach $144 per share in the future (~2-3 years if fast). In 2021, if all goes well (pandemic wanes, EV boom, cybersecurity security demands increase), I value Blackberry at $30-32 per share. \n\nDisclaimer: This is not investment advice. Purely educational. Your decisions are based on your own risk taking. \n\nDisclosure: I am long BB and hold June/Jan2022 ITM/OTM options.",
        "subreddit": "StockMarket",
        "title": "Blackberry DD: Comprehensive Analysis and Market Exposure Discussion",
        "url": "https://www.reddit.com/r/StockMarket/comments/l5abof/blackberry_dd_comprehensive_analysis_and_market/",
        "created": 1611680982.0
    },
    {
        "author": "1Man1Mission",
        "created_utc": 1611523195,
        "id": "l47wzb",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Sup glue sniffers. I’ve seen some Nokia thirst posts over the past couple weeks, and figured I’d look into the company. I used to have a windows phone, and while the OS was absolute shit, the phone itself was solid. NOK also ended trading at 4.20 on Friday so I figured why not look into it.  After briefly looking over the past couple quarterly reports, I’ve found Nokia is as resilient as the phones it manufactures. Today I’m discussing the long term case for Nokia.\n\n**DISCLAIMER:** I don’t get paid for this. I’m not a professional. I’m not giving financial advice. I won’t have a lot of pretty charts in this so just eat some fucking crayons like you normally do.\n\n&amp;#x200B;\n\n**The Gossip**\n\nAs some of you less smooth-brained retards know, Nokia has been getting shat on from shareholder’s perspective over the past couple years. Seeing a few big dips in share price both in 2019 and 2020 (which I will explain later). It appears that a lot of traders have left the company by the wayside for corporations like Motorola (MSI) and Cisco (CSCO). \n\n**I see you lookin’**\n\nInvestment Journalists have already been discussing speculative success for Nokia long-term. \n\nHere are some examples:\n\n[https://investorplace.com/2019/12/nokia-short-term-pain-clouding-long-term-future/](https://investorplace.com/2019/12/nokia-short-term-pain-clouding-long-term-future/)\n\n[https://www.fool.com/investing/2020/07/12/where-will-nokia-be-in-5-years.aspx](https://www.fool.com/investing/2020/07/12/where-will-nokia-be-in-5-years.aspx) (I include this link also to provide context for the link posted right after this. It’s also a great example of how Motley fool is bullshit by playing both sides of the fence so it can claim credit for its “predictions”)\n\n[https://www.rcrwireless.com/20210121/5g/nokia-china-mobile-trial-ai-powered-radio-access-live-5g-network](https://www.rcrwireless.com/20210121/5g/nokia-china-mobile-trial-ai-powered-radio-access-live-5g-network)\n\nWant more linked articles supporting my claim? Google it retard. This is not your wife’s boyfriend’s powerpoint presentation.\n\nAnother quick little read (I know it’s hard for you sweety but hang in there) to provide context for my next point.\n\nhttps://finance.yahoo.com/news/cramer-shares-thoughts-nokia-intel-140851142.html  \n\nCramer said he prefers growth but with Nokia's long-existing foothold in many facets of the telecom industry AND Pekka Lundmark's EXPLICTLY EXPRESSED focus for Nokia's efforts on dominating a specific niches of mobile access:\n\n&gt;“We have a strong position in technologies that are important for critical networks, such as open and virtualized radio access networks and we are on course for a 100% cloud-native software portfolio,” \n\nWe are looking at serious growth within a particular spectrum (spectrum, like frequency spectrum HAHA TELECOM JOKE) and I think it dubious to dismiss Nokia's potential for growth where it *wants* to grow.\n\n**Oh look blue crayons**\n\nHere is a nice, smol-brained visual expression of Nokia’s 2020 weighted 5G conversion rate so that you fuckwits can grasp what’s going on.\n\n&amp;#x200B;\n\n[Source: https:\\/\\/www.nokia.com\\/system\\/files\\/2020-10\\/nokia\\_results\\_2020\\_q3.pdf \\(pg. 4\\)](https://preview.redd.it/73g1gglcjcd61.png?width=627&amp;format=png&amp;auto=webp&amp;s=d71f43fd792c1559a7df369c1c4198252f7697d1)\n\nThe dotted square represents all of Nokia’s existing 4G footprint at the end of 2018 and the dark blue represents where a 5G footprint has been created to replace it. Notice that some dark blue exists outside the dotted square? That’s all NEW STUFF LOOKIE THERE FELLA UR SO SMART. At the same time, some of the 4G footprint remains because of interest in providing service to..um.. legacy products? \n\nAs of the Q3 report, Nokia owns 27% of the 4G + 5G mobile radio market share- excluding the Chinese market for that matter. This hasn't been a company that has lacked resources or experience, but direction and focus; there is a LOT to telecommunications and there are many doors this company can take. It has the connections, money, and focus necessary to achieve these long-term goals that its leaders set. If done right, 2021 won’t be a year of killer cash flow and revenue, but will establish Nokia with one massive cock.\n\nI know it’s not exactly flashy/sexy and won’t see immediate results in the next two or three quarters, but the newly appointed Chief Technical Officer, Nishant “Big Daddy” Batra knows R&amp;D and knows the ins and outs of Cloud Service Programs. Nokia has some BIG brain boys steering the ship. Let’s talk about something you troglodytes can follow: money.\n\n&amp;#x200B;\n\n*Processing img mhfymmoejcd61...*\n\nNet sales, operating profit, and margin are on track for another consistent year albeit *slightly* lower than 2019. This is good news considering that it lost a large north american customer this previous year due to its lackluster 5G footprint WHICH Lundmark (the aforementioned new president of Nokia) has explicitly stated that this will be the primary focus: R&amp;D in tech that will position it as a long-term leader in the 5G space. They can do it too. I’ll dumb it down for you retards:\n\nBoys, this is FISCALLY-DISCIPLINED leadership. \n\n“BuT sHoUldN’T aLL lEadErShIp bE gOoD wItH mOneY??”\n\nFirst, shut the fuck up and let me explain. There was a major dip in share price in 2019 after Nokia announced that it would not be paying dividends for two consecutive quarters. The boomers and gay bears in r/investing didn’t like the sound of that and decided to sell to really stick it to Nokia, and bought shit like CRUS because MMs told their sheep to. \n\n**Nokia cut dividends temporarily in order to offset the cost of rolling out 5G tech**. [https://www.bloomberg.com/news/articles/2019-10-24/nokia-cuts-earnings-outlook-and-pauses-dividend-to-invest-in-5g](https://www.bloomberg.com/news/articles/2019-10-24/nokia-cuts-earnings-outlook-and-pauses-dividend-to-invest-in-5g)\n\nIt was supposed to be a short term biting of the bullet for shareholders in order to see long term benefits, but God forbid people didn’t get their 19 cent-a-share dividends. There has been open discussion of bringing back dividends within the next couple years if the company sees continued growth in its cash flow, Nokia mentions the possibility of:\n\n&gt;“an earnings-based growing dividend of approximately 40% to 70% of non-IFRS diluted EPS, taking into account Nokia’s cash position and expected cash flow generation.” \n\n*source: https://www.nasdaq.com/articles/buy-nokia-stock-before-the-company-resumes-dividends-2020-10-21*\n\nIf Nokia officially announces a re-rolling out of dividends, boomers will get  **Rock. Fucking. Hard.** and slurp up shares on the cheap. This is where speculation comes in and is **ultimately why I am posting this shit in WSB.** Nokia has some major competition, minus Huawei in the United States which is a big fucking deal and I’m amazed how that escapes people considering the recent contracts Nokia secured with the US government. Some of that competition currently has the leg up on Nokia and betting on them is risky, but if Nokia can prove within the next year that it has a plan, we have got some SERIOUS upward potential.\n\nAlso, check the options activity on Nokia for the next 2 weeks leading up to its Q4 report. It’s getting me \\~frisky\\~\n\nI could further dissect additional strategies associated with Nokia’s portfolio including what else it has it’s toes in, but big picture: Nokia will begin to hone in on a specific set of specializations (5G and Cloud-native software services). \n\nOh and you degenerates aren’t paying me.\n\nTL;DR Nokia has potential for skyward trajectory with its new leadership.",
        "subreddit": "wallstreetbets",
        "title": "A Closer Glance at Nokia",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l47wzb/a_closer_glance_at_nokia/",
        "created": 1611551995.0
    },
    {
        "author": "Gr3ylok",
        "created_utc": 1612101869,
        "id": "l9cw2c",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "As  the title suggests I was wondering if there is a script or tool  somewhere out there to make my LL120 fans and ram change from red to  green light and back to green when bitcoin changes (or any other  coin/stock for that matter). I'm currently using iCue for the fans and  and I can use MSI Dragon Center for the RAM or through RGBFusion (I'd  love to get rid of it but that runs the RGB+Display of my AURUS AIO)\n\nTL:DR  is it possible to have my RGB turn from red to green or the other way  around when Bitcoin (or another coin/stock/commodity) changes price?",
        "subreddit": "StockMarket",
        "title": "RGB (iCue+RGBFusion) based on stockprices?",
        "url": "https://www.reddit.com/r/StockMarket/comments/l9cw2c/rgb_icuergbfusion_based_on_stockprices/",
        "created": 1612130669.0
    },
    {
        "author": "Braj728",
        "created_utc": 1611777086,
        "id": "l6crf2",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "I'm a retard with $10k and severe nostalgia, what do I do with it? Do I go Nokia, BlackBerry or Motorola",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l6crf2/im_a_retard_with_10k_and_severe_nostalgia_what_do/",
        "created": 1611805886.0
    },
    {
        "author": "TheOneEyedMan",
        "created_utc": 1611980872,
        "id": "l8dr2e",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Someone's probably already seen this. I'm just a nobody living in the woods who just bought a gaming laptop and thought, \"Huh, lookit the news.\" Checked the stock out of curiosity. Look at Micro-Star International Co Ltd and Motorola Solutions Inc. How about that.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/l8dr2e/someones_probably_already_seen_this_im_just_a/",
        "created": 1612009672.0
    },
    {
        "author": "Historical-Comment36",
        "created_utc": 1610655812,
        "id": "kxdx2g",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " **TL:DR**\n\n* This is Part 2 of what is now going to be a three part deep dive on Smartsheet (Ticker: SMAR).\n* This second part walks you through the beginning of my four piece framework of trying to figure out if the stock can 10x from here: (1) Leadership (2) Risks (3) Price and (4) Growth.\n* In this second part, we are just going to focus on (1) Leadership. As I was writing, I found that Leadership is a very important part of the Smartsheet story and it needed its own article to do it justice. You can read [Part 1 here](https://onthemarkpicks.com/2021/01/01/deep-dive-2-part-1-of-2-smartsheet-solving-the-productivity-paradox/).\n* Smartsheet is an exciting SaaS company that’s helping businesses be more productive and get the most out of their people\n* I am not a financial advisor and this is not investment advice. These are just my opinions to help facilitate learning and discussion.\n\nHi everyone, thanks for coming back for Part 2. I’m excited to bring you more research and insights on Smartsheet (NYSE: SMAR). Let’s dive in.\n\n**Can we 10X from here?**\n\nFor someone like me that is on the younger side and with a longer investment time horizon, and probably you if you are reading this, an important question to ask yourself is “Do I think this investment could 10x from here?”. In other words, could this investment one day be 10 times what it is worth today? To try to answer this question, I will work through a pre-determined framework that I believe gives us the best path to find out.\n\nThe framework includes:\n\nLeadership – Desire, Purpose and Ownership\n\nRisk Considerations\n\nPrice Considerations\n\nExplosive Business Growth\n\n**1. Leadership – Desire, Purpose, Ownership**\n\nFor a company to do something as spectacular as 10x, we are going to need to see really strong and talented leadership. In Chris Mayer’s excellent book “100 Baggers”, he dedicates a part of the book to talk about the importance of what he calls “Owner Operators”. By this he means that the CEO of the company owns a substantial amount of stock in the company themselves. Why is this important? If the CEO has their own personal wealth at stake in the company’s stock (just like we do as shareholders) their interests are more aligned with shareholders and maximizing returns for shareholders than they would be if that CEO had no skin in the game. It’s also better in my opinion if the CEO of the company was also the founder of the company. For these founder-CEO’s that have money invested in their own company, it really is like their baby. Would you rather have your money invested with someone who views the company as their baby or with someone who was just hired to watch this kid (the company)?\n\nIn the case of Smartsheet, we check all the boxes when it comes to leadership. Mark Mader is not only an Owner Operator, he is also a co-founder. I touched on this a little bit in part 1, but Mark co-founded Smartsheet along with Brent Frei in 2005. They both played football (American football) for Dartmouth College, an Ivy League School. They met in the fall of 1988 when Mark was a freshman on the team and Brent, who had graduated the prior year, was serving as a Graduate Assistant for the team.\n\nAfter that season, Brent moved on to begin a career in computer engineering. Mark quit the football team after 1 year. In an interview with Forbes, he said that after his freshman season he thought it was too much to juggle Ivy League academics and being a NCAA Division 1 athlete. Mark started focusing solely on academics until a tragedy struck. One of his best friends from his high school football team got into an accident and was critically injured. His friend would never be able to play football again. This had a profound impact on Mark. He said in the interview that knowing one of his friends would never be able to play again made him realize that if he still has the ability to play football, he needs to go do it. He went to his old coach, told him the story about his friend and asked for his spot on the team back. The coach accepted and Mark went on to finish his career in the fall of 1991 as a 6’4”, 245lb offensive lineman.\n\nMark said that this experience with his friend and re-joining the football team taught him not to take anything for granted. He said ever since then he tries to do his best with everything and make the most out of every opportunity. That mindset has served him well as he now sits as a CEO of a $8.5 billion company. But he’s really just getting started. That mindset lives on today. The day that he took Smartsheet public, April 27, 2018, he was asked if he plans on celebrating the achievement, he said “We have 74,000 customers that don’t want us to party, they want us to work on the product.” How did Mark get to the point where he was CEO of a tech company with 74,000 customers that raised $150 million during their IPO? I’ll share with you a little more history behind the company.\n\nAfter Brent Frei left Dartmouth, he started his career in computer engineering as I mentioned before. His career started with Motorola in 1989, then he went to Microsoft in 1991, and then he founded his first company, Onyx Software in 1994. It didn’t take long before his buddy from college, Mark Mader, would come join him at the start-up. Mark joined in 1995 and eventually worked his way up to an Executive role within the firm.\n\nThe focus of Onyx was Customer Relationship Management (CRM) software. Brent was the CEO and Mark became the SVP of Global Services. Brent led the company through an IPO in 1999 right before the tech bubble burst. It was really unfortunate timing because a lot of their customers were dotcoms that went out of business. Brent was still able to lead them through stiff competition with Salesforce in the early 2000’s until he hit a plateau in 2004. He decided to step down from the company he had founded 10 years earlier. On his last call with investors, he was quoted as saying “I believe it’s the right time for me to turn over the reins to a new CEO who can take Onyx to new heights over the next decade,”. All the while, Mark was there in the background learning and observing. He saw what went right – they built a large publicly traded company from scratch. And he saw what went wrong – their growth stalled as they lost market share to Salesforce.\n\nOnly a year after resigning from Onyx, Brent was on to his next big move and he again recruited his friend Mark to help. They were going to found Smartsheet, a company to help improve the way people work. This time, Mark was a Co-Founder along with Brent and had a much bigger influence on the company. His influence got even larger in 2017, 12 years after the founding, when Brent left to found his 3rd company, TerraClear. Brent left to go back to his roots in Idaho where he grew up on the family farm. His new start-up TerraClear seeks to solve one of the largest unsolved problems in farming today – clearing rocks from farming land. As crazy as that sounds, apparently it’s a big issue. Hence the name, TerraClear. Brent is still on the Board of Directors of Smartsheet.\n\nGoing back to the IPO date (April 27, 2018), which was only 4 months after Brent had left, Mark was asked by the press what he had learned from being at Onyx when they went public. Mark was very clear in his response and said that one of the main lessons from Onyx was to “not get too enamored with your product”. With Smartsheet, he wants to make sure they’re always improving the product and the user experience. He also said that investors don’t buy a stock based on what you’ve done in the past, but what you plan to do. “If you are always looking at the rear view mirror, then you are not running the business” he said. This is exactly how I want the leaders of companies I invest in to be thinking. He is very forward thinking, customer focused, and humble. There is a lot of evidence to corroborate that he has followed through on the statements he made that day.\n\nOne of the first pieces of evidence I found that supports my thesis of Mark being very focused on the product and user experience is the incredible ratings that the product has received from its customers. I use a tool called Net Promoter Score (NPS) which is one of the most reliable and unbiased ways to find out what a customers true experience with a business is and how likely they would be to recommend it to a friend. For Smartsheet, their NPS is extremely high. It’s on a scale of -100 to 100 so anything above 0 is considered to be good. If the rating is above 0, it essentially more people would recommend the product to a friend than they would tell them not to use it. Smartsheet has an NPS of 80, which is honestly one of the highest I have ever seen.\n\nFurther evidence to support Mark and the rest of management’s commitment to product quality and user experience is the exceptional ratings the product has on the Apple App Store. This is just for the mobile version of the product, the app that you can download on your phone just like you would download the mobile version of Outlook. The rating in the App Store is 4.8/5. That’s very impressive as well.\n\nBased on how customers are responding to the product, I think it’s fair to say that Mark was not [B.S.ing](https://b.s.ing/) his way through that interview on IPO day. He and his management team really have been focused on creating a stellar product and the results are showing. When I say that “Desire and Purpose” are important traits of a leader of a company it means that I want to see a leader who has a real desire to do what he/she is doing as the CEO of the company, believes in their product(s) and services, and has a real purpose for why they want to do that. I can tell that Mark is committed to the mission of improving the way people work. Being one of the founders, and having written an E-Book on the “Productivity Paradox” that I mentioned in Part 1, I think this mission is very near and dear to his heart and that he has a desire to see the impact and scale of his company grow well into the future. As shareholders, that’s what we want.\n\nAnother way to see if the leader of the company has “Desire and Purpose” is to see how his/her employees perceive them. Do the employees look up to this person? Do they feel motivated to work hard because they know what they’re doing is meaningful and can make a positive difference in people’s lives? One way I have of gaining insight into this is to look at the company’s Glassdoor ratings and specifically the rating of the CEO. In the case of Smartsheet, the positive story continues. The company has a 4.1/5 rating on Glassdoor and Mark has a 90% approval rate from his employees which is well above average. To me this shows he’s communicating the company’s purpose to the employees very well and is motivating them to actualize that purpose.\n\nThere’s one other piece of evidence I stumbled upon that gives good insight into the culture that Mark and his management team are building at Smartsheet. They were recently (12/17/20) awarded “Best Company Culture” and “Best Companies for Women” by Comparably. Below you can see a screenshot of the headline from a Business Wire article about this. It’s one thing to be awarded for “Best Company Culture” but to also be a “Best Companies for Women” when you’re in a heavily male dominated industry such as computer software, that really says something. It speaks to the culture of diversity and inclusiveness that Mark is building there which goes a long way in the year 2021 when social issues are at the forefront of people’s minds more than ever. The modern enterprise has to build a culture of diversity and inclusiveness if they want to retain the most talented employees and keep them motivated. Smartsheet is doing a good job of this.\n\nSource – Smartsheet making headlines for their outstanding company culture.\n\nI think we’ve found a lot of evidence to support that this leadership team has a strong desire to fulfil their purpose. It’s evident that they want to help improve the way people work and that they’ve invested heavily into making this happen while keeping employees motivated and focused on the goal. The last piece I look at for leadership is ownership. Does the CEO have a personal financial stake in the company? This is such a key thing to look for because as I mentioned earlier in the article, if leadership themselves owns a substantial amount of shares, then their interests and motivations will align with us, the shareholders. They essentially are a shareholder too, just like us. On top of the desire and purpose that we’ve established is present, there’s also a financial incentive for Mark and the team to lead the company to success, and ultimately, a higher share price.\n\nCurrently, Mark holds 490,267 shares which comes out to a value of $34 million as of this writing (1/14/21). I’d consider that substantial for an individual person. Even more noteworthy is that Brent owns 3.2 million shares which comes out to a value of $218 million. Brent owns that much of the company still and he’s not even involved beyond being on the Board of Directors. I think that’s a testament to how much confidence he has in Mark to lead Smartsheet to new heights. Also, it’s important to keep in mind that he left Smartsheet to help with his family business. He saw his 80 year old Dad picking up rocks on the farm with his bare hands and realized he wanted to help solve this problem in the farming industry. Leaving Smartsheet was not like when he left Onyx because the business was plateauing. As a matter of fact, Smartsheet was rapidly growing at that time and was about to go public. The fact that he still has $218 million worth of shares in the company shows he still believes in the company and what Mark can do with it now and in the future.\n\nThis concludes Part 2 of my Smartsheet deep dive. Hope you enjoyed and be sure to subscribe so you can stay tuned for Part 3, our next pick, and news &amp; updates about existing picks.\n\nDisclosure: I am long SMAR. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article.",
        "subreddit": "investing_discussion",
        "title": "Smartsheet (NYSE: SMAR) - Deep Dive Research",
        "url": "https://www.reddit.com/r/investing_discussion/comments/kxdx2g/smartsheet_nyse_smar_deep_dive_research/",
        "created": 1610684612.0
    },
    {
        "author": "seekingbetas",
        "created_utc": 1611793951,
        "id": "l6j1kh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "Motorola Routers and Networking equipment",
        "url": "https://www.reddit.com/r/pennystocks/comments/l6j1kh/motorola_routers_and_networking_equipment/",
        "created": 1611822751.0
    },
    {
        "author": "Historical-Comment36",
        "created_utc": 1610655060,
        "id": "kxdnqu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**TL:DR**\n\n* This is Part 2 of what is now going to be a three part deep dive on Smartsheet (Ticker: SMAR). \n* This second part walks you through the beginning of my four piece framework of trying to figure out if the stock can 10x from here: (1) Leadership (2) Risks (3) Price and (4) Growth.\n* In this second part, we are just going to focus on (1) Leadership. As I was writing, I found that Leadership is a very important part of the Smartsheet story and it needed its own article to do it justice. You can read [Part 1 here](https://onthemarkpicks.com/2021/01/01/deep-dive-2-part-1-of-2-smartsheet-solving-the-productivity-paradox/).\n* Smartsheet is an exciting SaaS company that’s helping businesses be more productive and get the most out of their people\n* I am not a financial advisor and this is not investment advice. These are just my opinions to help facilitate learning and discussion.\n\nHi everyone, thanks for coming back for Part 2. I’m excited to bring you more research and insights on Smartsheet (NYSE: SMAR). Let’s dive in.\n\n**Can we 10X from here?**\n\nFor someone like me that is on the younger side and with a longer investment time horizon, and probably you if you are reading this, an important question to ask yourself is “Do I think this investment could 10x from here?”. In other words, could this investment one day be 10 times what it is worth today? To try to answer this question, I will work through a pre-determined framework that I believe gives us the best path to find out.\n\nThe framework includes:\n\nLeadership – Desire, Purpose and Ownership\n\nRisk Considerations\n\nPrice Considerations\n\nExplosive Business Growth\n\n**1. Leadership – Desire, Purpose, Ownership**\n\nFor a company to do something as spectacular as 10x, we are going to need to see really strong and talented leadership. In Chris Mayer’s excellent book “100 Baggers”, he dedicates a part of the book to talk about the importance of what he calls “Owner Operators”. By this he means that the CEO of the company owns a substantial amount of stock in the company themselves. Why is this important? If the CEO has their own personal wealth at stake in the company’s stock (just like we do as shareholders) their interests are more aligned with shareholders and maximizing returns for shareholders than they would be if that CEO had no skin in the game. It’s also better in my opinion if the CEO of the company was also the founder of the company. For these founder-CEO’s that have money invested in their own company, it really is like their baby. Would you rather have your money invested with someone who views the company as their baby or with someone who was just hired to watch this kid (the company)?\n\nIn the case of Smartsheet, we check all the boxes when it comes to leadership. Mark Mader is not only an Owner Operator, he is also a co-founder. I touched on this a little bit in part 1, but Mark co-founded Smartsheet along with Brent Frei in 2005. They both played football (American football) for Dartmouth College, an Ivy League School. They met in the fall of 1988 when Mark was a freshman on the team and Brent, who had graduated the prior year, was serving as a Graduate Assistant for the team.\n\nAfter that season, Brent moved on to begin a career in computer engineering. Mark quit the football team after 1 year. In an interview with Forbes, he said that after his freshman season he thought it was too much to juggle Ivy League academics and being a NCAA Division 1 athlete. Mark started focusing solely on academics until a tragedy struck. One of his best friends from his high school football team got into an accident and was critically injured. His friend would never be able to play football again. This had a profound impact on Mark. He said in the interview that knowing one of his friends would never be able to play again made him realize that if he still has the ability to play football, he needs to go do it. He went to his old coach, told him the story about his friend and asked for his spot on the team back. The coach accepted and Mark went on to finish his career in the fall of 1991 as a 6’4”, 245lb offensive lineman.\n\nMark said that this experience with his friend and re-joining the football team taught him not to take anything for granted. He said ever since then he tries to do his best with everything and make the most out of every opportunity. That mindset has served him well as he now sits as a CEO of a $8.5 billion company. But he’s really just getting started. That mindset lives on today. The day that he took Smartsheet public, April 27, 2018, he was asked if he plans on celebrating the achievement, he said “We have 74,000 customers that don’t want us to party, they want us to work on the product.” How did Mark get to the point where he was CEO of a tech company with 74,000 customers that raised $150 million during their IPO? I’ll share with you a little more history behind the company.\n\nAfter Brent Frei left Dartmouth, he started his career in computer engineering as I mentioned before. His career started with Motorola in 1989, then he went to Microsoft in 1991, and then he founded his first company, Onyx Software in 1994. It didn’t take long before his buddy from college, Mark Mader, would come join him at the start-up. Mark joined in 1995 and eventually worked his way up to an Executive role within the firm.\n\nThe focus of Onyx was Customer Relationship Management (CRM) software. Brent was the CEO and Mark became the SVP of Global Services. Brent led the company through an IPO in 1999 right before the tech bubble burst. It was really unfortunate timing because a lot of their customers were dotcoms that went out of business.  Brent was still able to lead them through stiff competition with Salesforce in the early 2000’s until he hit a plateau in 2004. He decided to step down from the company he had founded 10 years earlier. On his last call with investors, he was quoted as saying “I believe it’s the right time for me to turn over the reins to a new CEO who can take Onyx to new heights over the next decade,”. All the while, Mark was there in the background learning and observing. He saw what went right – they built a large publicly traded company from scratch. And he saw what went wrong – their growth stalled as they lost market share to Salesforce.\n\nOnly a year after resigning from Onyx, Brent was on to his next big move and he again recruited his friend Mark to help. They were going to found Smartsheet, a company to help improve the way people work. This time, Mark was a Co-Founder along with Brent and had a much bigger influence on the company. His influence got even larger in 2017, 12 years after the founding, when Brent left to found his 3rd company, TerraClear. Brent left to go back to his roots in Idaho where he grew up on the family farm. His new start-up TerraClear seeks to solve one of the largest unsolved problems in farming today – clearing rocks from farming land. As crazy as that sounds, apparently it’s a big issue. Hence the name, TerraClear. Brent is still on the Board of Directors of Smartsheet.\n\nGoing back to the IPO date (April 27, 2018), which was only 4 months after Brent had left, Mark was asked by the press what he had learned from being at Onyx when they went public. Mark was very clear in his response and said that one of the main lessons from Onyx was to “not get too enamored with your product”. With Smartsheet, he wants to make sure they’re always improving the product and the user experience. He also said that investors don’t buy a stock based on what you’ve done in the past, but what you plan to do. “If you are always looking at the rear view mirror, then you are not running the business” he said. This is exactly how I want the leaders of companies I invest in to be thinking. He is very forward thinking, customer focused, and humble. There is a lot of evidence to corroborate that he has followed through on the statements he made that day.\n\nOne of the first pieces of evidence I found that supports my thesis of Mark being very focused on the product and user experience is the incredible ratings that the product has received from its customers. I use a tool called Net Promoter Score (NPS) which is one of the most reliable and unbiased ways to find out what a customers true experience with a business is and how likely they would be to recommend it to a friend. For Smartsheet, their NPS is extremely high. It’s on a scale of -100 to 100 so anything above 0 is considered to be good. If the rating is above 0, it essentially more people would recommend the product to a friend than they would tell them not to use it. Smartsheet has an NPS of 80, which is honestly one of the highest I have ever seen. \n\nFurther evidence to support Mark and the rest of management’s commitment to product quality and user experience is the exceptional ratings the product has on the Apple App Store. This is just for the mobile version of the product, the app that you can download on your phone just like you would download the mobile version of Outlook. The rating in the App Store is 4.8/5. That’s very impressive as well.\n\nBased on how customers are responding to the product, I think it’s fair to say that Mark was not [B.S.ing](https://B.S.ing) his way through that interview on IPO day. He and his management team really have been focused on creating a stellar product and the results are showing. When I say that “Desire and Purpose” are important traits of a leader of a company it means that I want to see a leader who has a real desire to do what he/she is doing as the CEO of the company, believes in their product(s) and services, and has a real purpose for why they want to do that. I can tell that Mark is committed to the mission of improving the way people work. Being one of the founders, and having written an E-Book on the “Productivity Paradox” that I mentioned in Part 1, I think this mission is very near and dear to his heart and that he has a desire to see the impact and scale of his company grow well into the future. As shareholders, that’s what we want.\n\nAnother way to see if the leader of the company has “Desire and Purpose” is to see how his/her employees perceive them. Do the employees look up to this person? Do they feel motivated to work hard because they know what they’re doing is meaningful and can make a positive difference in people’s lives? One way I have of gaining insight into this is to look at the company’s Glassdoor ratings and specifically the rating of the CEO. In the case of Smartsheet, the positive story continues. The company has a 4.1/5 rating on Glassdoor and Mark has a 90% approval rate from his employees which is well above average. To me this shows he’s communicating the company’s purpose to the employees very well and is motivating them to actualize that purpose.\n\nThere’s one other piece of evidence I stumbled upon that gives good insight into the culture that Mark and his management team are building at Smartsheet. They were recently (12/17/20) awarded “Best Company Culture” and “Best Companies for Women” by Comparably. Below you can see a screenshot of the headline from a Business Wire article about this. It’s one thing to be awarded for “Best Company Culture” but to also be a “Best Companies for Women” when you’re in a heavily male dominated industry such as computer software, that really says something. It speaks to the culture of diversity and inclusiveness that Mark is building there which goes a long way in the year 2021 when social issues are at the forefront of people’s minds more than ever. The modern enterprise has to build a culture of diversity and inclusiveness if they want to retain the most talented employees and keep them motivated. Smartsheet is doing a good job of this.\n\nSource – Smartsheet making headlines for their outstanding company culture.\n\nI think we’ve found a lot of evidence to support that this leadership team has a strong desire to fulfil their purpose. It’s evident that they want to help improve the way people work and that they’ve invested heavily into making this happen while keeping employees motivated and focused on the goal. The last piece I look at for leadership is ownership. Does the CEO have a personal financial stake in the company? This is such a key thing to look for because as I mentioned earlier in the article, if leadership themselves owns a substantial amount of shares, then their interests and motivations will align with us, the shareholders. They essentially are a shareholder too, just like us. On top of the desire and purpose that we’ve established is present, there’s also a financial incentive for Mark and the team to lead the company to success, and ultimately, a higher share price.\n\nCurrently, Mark holds 490,267 shares which comes out to a value of $34 million as of this writing (1/14/21). I’d consider that substantial for an individual person. Even more noteworthy is that Brent owns 3.2 million shares which comes out to a value of $218 million. Brent owns that much of the company still and he’s not even involved beyond being on the Board of Directors. I think that’s a testament to how much confidence he has in Mark to lead Smartsheet to new heights. Also, it’s important to keep in mind that he left Smartsheet to help with his family business. He saw his 80 year old Dad picking up rocks on the farm with his bare hands and realized he wanted to help solve this problem in the farming industry. Leaving Smartsheet was not like when he left Onyx because the business was plateauing. As a matter of fact, Smartsheet was rapidly growing at that time and was about to go public. The fact that he still has $218 million worth of shares in the company shows he still believes in the company and what Mark can do with it now and in the future.\n\nThis concludes Part 2 of my Smartsheet deep dive. Hope you enjoyed and be sure to subscribe so you can stay tuned for Part 3, our next pick, and news &amp; updates about existing picks.\n\nDisclosure: I am long SMAR. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article.",
        "subreddit": "SecurityAnalysis",
        "title": "Smartsheet (NYSE: SMAR) - Deep Dive Research",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/kxdnqu/smartsheet_nyse_smar_deep_dive_research/",
        "created": 1610683860.0
    },
    {
        "author": "Durham_Operations",
        "created_utc": 1612065955,
        "id": "l9433m",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "$MSI - that is the biggest BS wall I have ever seen!",
        "url": "https://v.redd.it/r3ith1rudle61",
        "created": 1612094755.0
    },
    {
        "author": "Gr3ylok",
        "created_utc": 1612102317,
        "id": "l9d0ut",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "As   the title suggests I was wondering if there is a script or tool   somewhere out there to make my LL120 fans and ram change from red to   green light and back to green when bitcoin changes (or any other   coin/stock for that matter). I'm currently using iCue for the fans and   and I can use MSI Dragon Center for the RAM or through RGBFusion (I'd   love to get rid of it but that runs the RGB+Display of my AURUS AIO)\n\nTL:DR   is it possible to have my RGB turn from red to green or the other way   around when Bitcoin (or another coin/stock/commodity) changes price?",
        "subreddit": "options",
        "title": "RGB (iCue+RGBFusion) based on stockprices?",
        "url": "https://www.reddit.com/r/options/comments/l9d0ut/rgb_icuergbfusion_based_on_stockprices/",
        "created": 1612131117.0
    }
]