[
    {
        "author": "marlinmarlin99",
        "created_utc": 1630695333,
        "id": "phbfst",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": " \n\nBased in Tel-Aviv, Israel, REE  Automotive has managed to stay out of consumer-facing EV news because  its tech has mostly been aimed at other manufacturers, with its role  centered on that of a developer and supplier. Its scheduled  establishment of a US foothold should bring it more publicity, landing  in a city that is rapidly becoming an EV tech hub.\n\nIn  the EV industry and start-up world**, REE is arguably best known for  skateboard platform**s, with the company's calling card being the  industry's flattest EV platform. Dubbed REEcorner, the platform packs  the powertrain, steering, suspension and braking components into the  arch of the wheel, **offering other automakers a ready architecture on  which many different types of vehicle bodies can be fitted.** The compact  module between the chassis and the wheel, therefore, is designed to be  scalable and modular—what the company calls \"agnostic\" to the design and  size of the final vehicle.\n\nThe  **planned Austin facility** will include an integration center, the company  says, that will offer REE's technology to future and current partners in  North America, including Magna International, allowing for the  construction of prototypes.\n\nREE  Automotive has been developing EV chassis that combine the powertrain,  steering, suspension, and braking into a slim platform.\n\nThe  platforms are designed to be scalable and modular, suitable for  vehicles with all types of bodies and different sizes and weight  classes.\n\nREE Automotive will set up US headquarters in Austin, Texas, which is already a tech hub, to work with partners in the US.\n\n**Catalyst:**\n\n# REE is about to participate in a series of conferences starting next week which will provide a huge bump to the price.\n\n1. Cowen's  4th Annual Global Transportation &amp; Sustainable Mobility  ConferencePresentation scheduled for Thursday, September 9 at 9:20am ET  Register to webcast\n2. Morgan Stanley Virtual 9th Annual Laguna Conference Tuesday, September 14\n3. Evercore ISI Autotech &amp; AI ForumPresentation scheduled for Wednesday, September 22 at 8am ET Register to webcast\n4. DA  Davidson 20th Annual Diversified Industrials &amp; Services Conference  Presentation scheduled for Thursday, September 23 at 11am ET Register to  webcast",
        "subreddit": "wallstreetbets",
        "title": "$REE Automotive Catalyst ..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phbfst/ree_automotive_catalyst/",
        "created": 1630724133.0
    },
    {
        "author": "cru3211",
        "created_utc": 1630607844,
        "id": "pgnvma",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Matterport will create a digital clone of our world for the metaverse.\n\nBefore I explain how, check out my previous DD posts for some context.  \n[MTTR Bringing 3D Photogrammetry Experiences](https://www.reddit.com/r/wallstreetbets/comments/ou2ap9/mttr_bringing_3d_photogrammetry_experiences_to/)  \n[MTTR Explosive Potential](https://www.reddit.com/r/wallstreetbets/comments/p3469k/mttr_update_explosive_avenues_of_potential/)\n\nNow, you’re probably wondering “What is the metaverse u/cru3211?”\n\nLet me tell you.\n\n# The Metaverse\n\nThe **metaverse** is a paradigm shift in the way we organize ourselves as a society. It’s an evolutionary embodiment of technology &amp; the internet. It’s commonly envisioned as a “second layer” to our world. Sort of like… a virtual clone of it… that’s digitized. See where this is going?\n\nThis is the **spatial web**. It represents an emerging three-dimensional web experience. It’ll blow the old internet out of the water.\n\nresearch: metaverse, web 3.0, and spatial web for more insights.\n\nMSG me and I’ll ramble more about the metaverse. For now, just understand that it’s an inevitable innovation that will see widespread growth within the next decade. Matterport is likely (but not guaranteed) to be a part of this evolution.\n\n# Government Contract\n\nMatterport has entered the public sector to digitize the valuable assets of the US government.\n\n&amp;#x200B;\n\n&gt;“Through the use of Matterport’s technology, federal agencies will be  \nable to *digitize and index* government facilities, infrastructure and  \nother assets such ***as airplanes, ships and submarines.”***  \n&gt;  \n&gt;  \n“For example, in the event of an emergency, digital twins of  \n**buildings, roads, bridges, tunnels, water supplies or electrical grids** can be instantly viewed and analyzed by authorized users to  \nrespond more efficiently”  \n&gt;  \n&gt;  \n“Access to 3D digital twins and the spatial data behind them can fuel  \na multitude of use cases such as **emergency response, military**  \n**training and historical preservation**.” - George Hoyem at In-Q-Tel\n\nHow could you not be bullish? They’re creating a private searchable 3D database. This is immensely powerful. Imagine being able to visualize the entire underground infrastructure of NYC without having to dig everything up? \n\n# Collaboration Tool\n\nYou know how on Google docs you can live collaborate with other users on a doc? I use it all the time. Matterport just added that for digital twins. That leads me to my next point.\n\n# Prediction:\n\nI’ve come to believe that Google will want Matterport. I have no evidence of this, it’s just a feeling. This is because the two companies align in a variety of ways. (I guess Google could just develop their own tech, but I just feel like they might take the easy route and acquire.)\n\n* Google Earth has exteriors of 3D buildings, but not interiors. Imagine how Matterport’s 3D dataset could be utilized for that tool?\n* Matterport and Google are both platform companies with a focus on big data and indexing that data.\n* Google Real-estate searching was removed about a decade ago, but what if this was the catalyst for them to bring it back. I predict that Google will bring back real estate searching but integrate it with 3D interactive experiences.\n* Google’s AI research could be fueled by Matterport’s datasets.\n* Matterport could be integrated with Google’s suite of apps.\n\n**My positions:**  \n100 shares at $14. Some calls expiring from Sept – December ranging from $17.5 - $25.",
        "subreddit": "wallstreetbets",
        "title": "$MTTR | METAVERSE FUTURES",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgnvma/mttr_metaverse_futures/",
        "created": 1630636644.0
    },
    {
        "author": "marlinmarlin99",
        "created_utc": 1630693404,
        "id": "phaud9",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " Based in Tel-Aviv, Israel, REE Automotive has  managed to stay out of consumer-facing EV news because its tech has  mostly been aimed at other manufacturers, with its role centered on that  of a developer and supplier. Its scheduled establishment of a US  foothold should bring it more publicity, landing in a city that is  rapidly becoming an EV tech hub.\n\nIn the EV  industry and start-up world, REE is arguably best known for skateboard  platforms, with the company's calling card being the industry's flattest  EV platform. Dubbed REEcorner, the platform packs the powertrain,  steering, suspension and braking components into the arch of the wheel,  offering other automakers a ready architecture on which many different  types of vehicle bodies can be fitted. The compact module between the  chassis and the wheel, therefore, is designed to be scalable and  modular—what the company calls \"agnostic\" to the design and size of the  final vehicle.\n\nThe planned Austin facility will  include an integration center, the company says, that will offer REE's  technology to future and current partners in North America, including  Magna International, allowing for the construction of prototypes.\n\n&amp;#x200B;\n\n* **REE Automotive has been developing EV  chassis that combine the powertrain, steering, suspension, and braking  into a slim platform.**\n* **The platforms are  designed to be scalable and modular, suitable for vehicles with all  types of bodies and different sizes and weight classes.**\n* **REE Automotive will set up US headquarters in Austin, Texas, which is already a tech hub, to work with partners in the US.**\n\n&amp;#x200B;\n\nCatalyst: \n\n# REE is about to participate in a series of conferences starting next week which will provide a huge bump to the price of the stock . Its take a beating but the price is currently at its low. \n\n Read the news: [https://www.wdrb.com/news/national/ree-automotive-to-participate-in-series-of-investor-conferences/article\\_2f4f412c-dd7b-5e4f-8b6e-5849cd913b56.html](https://www.wdrb.com/news/national/ree-automotive-to-participate-in-series-of-investor-conferences/article_2f4f412c-dd7b-5e4f-8b6e-5849cd913b56.html)\n\n[Cowen's 4th Annual Global Transportation &amp; Sustainable Mobility Conference](https://www.globenewswire.com/Tracker?data=Ynts0B9b1DK8XQgnJTK5jiERwsvaQSxVkRiMg-kuwd7tSh6XUU9kwZIB1SHanOd-d5KoMYON2PQw%E2%80%94qki-9%E2%80%94nF3O5sW-Lj4zjCsyn50Ef5qXAZYBTPSavwnEJG4wthOXxKu7jJ-gpBA7wzkx1zKbeSYf7dqQ5VGldFzpzhLJEB3BjEpZx%E2%80%94GYCCPDYoeVC6tdUh2xTyqQlGO96yxw0GCyO6TwbirNV37mSI5tQ6FGuTmTt0W05ytu43mdHVmIG5jyogjI%E2%80%94abdPKAOzjNIhJzsik%E2%80%94vF7bCSg3ANCKWwLozSS7A=)Presentation scheduled for Thursday, September 9 at 9:20am ET [Register to webcast](https://www.globenewswire.com/Tracker?data=clRq8UotEHim061za7lt3BzRiK19usL9Lszv1mtebYqzRWE0cABwh88bRenqp3aoEcmqu5Z77r2ZOz5yyd4KpvzJ7JwzS9rzhfgkXaFzeqyddd7A6m9%E2%80%94jzlv4ELCY5Y68LY16Y51dDIemRkKmNG%E2%80%94Jmbaq0iaar3sFYaxb3hRc5i3TJjEo6FcfAEUr5519UkV0Rw3phAUkgSe%E2%80%94uroHucxzQ==)\n\nMorgan Stanley Virtual 9th Annual Laguna Conference Tuesday, September 14\n\n[Evercore ISI Autotech &amp; AI Forum](https://www.globenewswire.com/Tracker?data=IP-azQjO0Ny01ztp%E2%80%948RCMuMAUZONZruPN-iiXs09-dN3oUEl6RQ2w7u6Y32yx8YcoQlmlL3-Hx6mVlMQ7kxIfKNpZCyQbjdu9lXH6l3cpBBraXyivnbGzzO7OeysD66RVMwkWA-gpHHRuzPhYT50HsHkpyKpHwY5byfhIk1wHn0BEhA9QnoMO96rOM94XpsO)Presentation scheduled for Wednesday, September 22 at 8am ET [Register to webcast](https://www.globenewswire.com/Tracker?data=clRq8UotEHim061za7lt3A-6iYAKOqZmgGEAsCSrjeKEYOjUkSizooRDHimN2x5oKmKOpPFpf-i0X2QeZUsq5YI%E2%80%94a17YkqfH14oxxXSVf9-eCym%E2%80%94MknNdrBOze4YPtnuUSrYTwqbFYSl9xQNFUW061h6vVW-vX6TkVoq6y2JMQ18of0xLd-Q8rMqIQV9PPkNsyRPm1dSLgiZcuj0k4TimGHLLSFWRSs1bhu1Wod2EM8=)\n\nDA  Davidson 20th Annual Diversified Industrials &amp; Services Conference  Presentation scheduled for Thursday, September 23 at 11am ET [Register to webcast](https://www.globenewswire.com/Tracker?data=clRq8UotEHim061za7lt3GpJRorO5P2yMR7xTic6lufIke00GyEgU8IXbQKnCzfl-Cu9NNSkTYttEj1Do4TKtM5mk2ybLi9YbpcR4Nnsjn7FgiM%E2%80%94IMjKm58oKdOtS7odDyPnDkFSoZLCZrO7tb1sKYevTI3pqrguP0-OajI0p%E2%80%94vcpTA%E2%80%94DUvD4hG9ZnGxvy%E2%80%94SEckXZuLgzjSCEw1ctmYJLw==)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nMy position: I currently hold 4k stocks and will be getting some more\n\n[https://imgur.com/a/k6mI4Sd](https://imgur.com/a/k6mI4Sd)",
        "subreddit": "wallstreetbets",
        "title": "$REE Automotive YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phaud9/ree_automotive_yolo/",
        "created": 1630722204.0
    },
    {
        "author": "marlinmarlin99",
        "created_utc": 1630695076,
        "id": "phbcz3",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Based in Tel-Aviv, Israel, REE Automotive has managed to stay out of consumer-facing EV news because its tech has mostly been aimed at other manufacturers, with its role centered on that of a developer and supplier. Its scheduled establishment of a US foothold should bring it more publicity, landing in a city that is rapidly becoming an EV tech hub.\n\nIn the EV industry and start-up world, REE is arguably best known for skateboard platforms, with the company's calling card being the industry's flattest EV platform. Dubbed REEcorner, the platform packs the powertrain, steering, suspension and braking components into the arch of the wheel, offering other automakers a ready architecture on which many different types of vehicle bodies can be fitted. The compact module between the chassis and the wheel, therefore, is designed to be scalable and modular—what the company calls \"agnostic\" to the design and size of the final vehicle.\n\nThe planned Austin facility will include an integration center, the company says, that will offer REE's technology to future and current partners in North America, including Magna International, allowing for the construction of prototypes.\n\nREE Automotive has been developing EV chassis that combine the powertrain, steering, suspension, and braking into a slim platform.\n\nThe platforms are designed to be scalable and modular, suitable for vehicles with all types of bodies and different sizes and weight classes.\n\n REE Automotive will set up US headquarters in Austin, Texas, which is already a tech hub, to work with partners in the US.\n\n**Catalyst:**\n\n# REE is about to participate in a series of conferences starting next week which will provide a huge bump to the price. \n\n1. Cowen's 4th Annual Global Transportation &amp; Sustainable Mobility ConferencePresentation scheduled for Thursday, September 9 at 9:20am ET Register to webcast\n2. Morgan Stanley Virtual 9th Annual Laguna Conference Tuesday, September 14\n3. Evercore ISI Autotech &amp; AI ForumPresentation scheduled for Wednesday, September 22 at 8am ET Register to webcast\n4. DA Davidson 20th Annual Diversified Industrials &amp; Services Conference Presentation scheduled for Thursday, September 23 at 11am ET Register to webcast\n\n**My position:** \n\nI currently hold 4k stocks and will be getting some more\n\n[https://imgur.com/a/k6mI4Sd](https://imgur.com/a/k6mI4Sd)",
        "subreddit": "wallstreetbets",
        "title": "$REE Automotive YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phbcz3/ree_automotive_yolo/",
        "created": 1630723876.0
    }
]