[
    {
        "author": "willyumn",
        "created_utc": 1617320661,
        "id": "mi84qf",
        "num_comments": 267,
        "num_crossposts": 0,
        "selftext": "For context, I'm 22, make $25/hr but have pretty much no bills since I live with my parents, so my risk tolerance is pretty high. I have about 55 shares of Tesla after \"un-diversifying\" and selling all my other stock. I'm pretty much all in. I cannot find any other company that i can put my money in where growth is seemingly inevitable. I do own bitcoin but what are some equities that I can purchase over the next few months, or all at once with 10k cash? \n\nI have a tiny % of my portfolio in Oracle, Trimble, Crispr, Upstart, Square, Paypal, to give you an idea of what types of stocks I'm attracted to. (data, fintech, autonomy). I'm averse to companies with binary outcomes like bio, pharma, etc. Any interesting leads? :)",
        "subreddit": "stocks",
        "title": "Where should I put $10k?",
        "url": "https://www.reddit.com/r/stocks/comments/mi84qf/where_should_i_put_10k/",
        "created": 1617349461.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1617654798,
        "id": "mku6oi",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "**Dow +1.13%, S&amp;P 500 +1.44%, Nasdaq +1.67%, Russell 2000 +0.49%**  \n\n\n* **Synopsis**\n   * US equities rallied Monday with S&amp;P 500 and Dow both setting new record closes. Growth outperformed value, though both factors saw good gains. Consumer discretionary was the leader with travel and leisure names faring well. Communications services performed well with FB and GOOGL strength. Tech was boosted by AAPL and MSFT. Energy was the only sector lower on the day. Treasuries were mostly firmer led by the five year point of the curve after rates saw some upward pressure on Good Friday when equities were closed. 10s finished above 1.70% again. Dollar weakened vs both yen and euro. Gold finished fractionally higher. WTI crude ended down 4.6%.\n   * **Market was largely supported by combination of upbeat recovery sentiment following better March employment data and fairly well behaved bond yields**. Nonfarm payrolls surged 916K, well above the 660K consensus, while net upward revisions to prior months totaled 156K. Economist takeaways were positive, highlighting the broad-based job creation, the room for further recovery over the next few months in the industries most adversely impacted by the pandemic and the lack of upward pressure on wages. Fits with broader reopening momentum seen in high-frequency indicators surrounding mobility, card spending, air travel and dining out.\n   * **ISM services hit record high** in March. **Biden said not worried about a tax increase hurting economy** amid heightened debate about how to best fund infrastructure stimulus. **Manchin reiterated corporate tax rate should settle at 25%**, **not 28%**, and more money should come from high earners. **Yellen said US working with G20 on global minimum tax**. Also called on other nations to avoid pre-emptive fiscal tightening. **US vaccine outperformance continues** with seven-day average of 3M+ doses per day, seemingly overshadowing some concerns about a **potential fourth wave**. Multiple reports discussed **dampened momentum behind retail investors**.\n   * **GOOGL** secured favorable ruling from SCOTUS in Android copyright infringement case. **TSLA** Q1 deliveries hit a new record high and beat consensus expectations. **PLTR** boosted by \\~$90M NNSW contract. **PINS** has reportedly held talks to acquire photography app VSCO. **PXD** to acquire DoublePoint Energy in a cash and stock deal with an EV of $6.4B. **DAL** forced to cancel \\~100 flights due to a staffing shortage. **GME** announced 3.5M share secondary offering. **NVTA** higher on Softbank-led investment. **TPCO** board blessed higher takeover bid. **BVH** announced intent to acquire the 7% of **BXG** it does not already own. **LEAF** to be acquired by **GHC** for $323M in cash.\n\n&amp;#x200B;\n\n* **Digest**\n   * **Most sectors finished higher, with growth groups outperforming:**\n      * **Consumer discretionary** led the market with strength from AMZN, auto names, and travel/leisure names (NCLH submitted plans to CDC for cruise resumptions). The megacap internets were stronger in **communication services**. MSFT and AAPL helped boost **tech**, with the semi space mostly higher as well. **Consumer staples** were a touch behind on food losses though good gains among drug stores, grocers, and beverages. **Industrials** trailed a bit though transports, A&amp;D, and multis performed well. **Materials** **lagged somewhat with packaging performing well while precious metal miners lagged. Financials** lagged with banks mixed and tech lending lower. **Healthcare** was a relative underperformer. MedTech stocks were generally better but there was some scattered weakness in biotech and pharma. **Energy** was the only sector lower, with E&amp;Ps and oil-services firms weaker alongside crude oil.\n   * **Big beat for March payrolls:**\n      * Nonfarm payrolls surged 916K in March, the biggest gain since last August and well above the 660K consensus. In addition, the net upward revision to prior months totaled 156K. The unemployment rate fell by 0.2pp to 6.0%, in line with expectations. Household employment increased 609K, the participation rate rose 0.1pp to 61.5% and the employment-population ratio increased 0.2pp to 57.8%. Average hourly earnings fell 0.1% m/m vs expectations for a 0.1% gain, with compositional changes flagged as an overhang. Economist takeaways were positive, highlighting the broad-based job creation (Goldman Sachs said industry breadth hit a 9-month high) and the further room for recovery over the next few months in the industries most adversely impacted by the pandemic. There was some discussion about a return to the pre-pandemic level of jobs by year-end.\n   * **ISM non-manufacturing index posted record high:**\n      * **ISM non-manufacturing index** for March soared to 63.7, beating 58.5 estimate and up from prior month 55.3. Highest reading in series history (from 1997). Business activity index up 13.9 at 69.4, new orders index up 15.3 at 67.2, employment index up 4.5 at 57.2. Prices index rose 2.2 to 74. Respondents noted lifting of Covid restrictions has unleashed pent-up demand while capacity constraints remain a challenge. Elsewhere, March **Markit services PMI** at 60.4, up 0.4% from flash; above Feb's 59.8. Highest since Jul-14. New orders, input, output cost series up sharply. Production, employment, expectations also rose. February **factory orders** were -0.8% as expected following +2.7% in the prior month, while durable goods orders revised down a tenth to -1.2% for the month. Thursday's **initial claims** (719K prior) and Friday's March **producer price index** (cons 0.5%, prior 0.5%) are the only other major data releases this week.\n\n&amp;#x200B;\n\n* **Afternoon headlines:**\n* **Markets:**\n   * Equity market growing less concerned about rising Treasury yields ([Bloomberg](https://www.bloomberg.com/news/articles/2021-04-05/yield-scare-that-shocked-stocks-in-february-barely-registers-now?sref=J9GPLx1B))\n   * Q1 M&amp;A financing hit highest level since 2018 ([Bloomberg](https://bloom.bg/3rTkrQf))\n* **Economic policy/stimulus:**\n   * Manchin says he won't support raising corporate tax to 28%, but could see 25% ([Bloomberg](https://bloom.bg/2PVjcTe))\n   * Treasury Secretary Yellen calls for global minimum corporate tax rate ([WSJ](https://on.wsj.com/3fJPBqQ))\n   * New York lawmakers reach agreement to raise taxes on wealthiest residents to highest combined rate in US ([Bloomberg](https://bloom.bg/3uleVaH))\n   * Democrats prepare plan to tax multinational corporations (NY Times)\n* **Corporate:**\n   * Supreme Court rules Alphabet didn't commit copyright infringement in using Oracle code in Android OS ([Bloomberg](https://bloom.bg/2PASSxW))\n   * UBS estimates one in 11 retail stores will close in the next five years ([Bloomberg](https://bloom.bg/3dDjkPo))\n* **Crypto:**\n   * Cryptocurrency market capitalization hits record $2T, with bitcoin at $1.1T ([Reuters](https://reut.rs/3mkXioB))\n\n&amp;#x200B;\n\n* **Notable Gainers:**\n   * \\+21.3% **LEAF** (Leaf Group): Agreed to be acquired by Graham Holdings Company (GHC) for $8.50 a share in cash in a deal valued at $323M; represents a \\~21% premium to prior close.\n   * \\+13.5% **AMC** (AMC Entertainment Holdings): Upgraded to buy from neutral at B. Riley; has been impressed with management's response to Covid headwinds and strengthening balance sheet; elsewhere noted strong weekend performance of Godzilla vs Kong demonstrates pent-up demand.\n   * \\+7.2% **NCLH** (Norwegian Cruise Line Holdings): Submitted plans to CDC to resume cruise operations from US ports in July; said it would recommence operations with 100% vaccinated guests and crew, operate with reduce capacity initially.\n   * \\+5.1% **RBLX** (Roblox): Initiated buy/overweight at Morgan Stanley, Goldman Sachs, Bank of America, Truist; analysts noted strong user growth runway for kids in gaming/social networking while already leading in engagement; also opportunities through subscription tier launch, expansion into China, branded content, education, ecommerce.\n   * \\+4.4% **TSLA** (Tesla): Reported Q1 deliveries of 184,800 vehicles, ahead of 168,000 consensus and representing a new a record high; upside came despite some concerns about a miss stemming from supply chain challenges that have impacted the global auto industry.\n   * \\+4.2% **GOOGL** (Alphabet): SCOTUS ruled 6-2 Alphabet did not commit copyright infringement over software in Android devices; at issue was whether Google's use of Oracle's (ORCL) Java programming language constituted a \"fair use\" and was thus protected from copyright infringement claims.\n   * \\+3.9% **JBLU** (JetBlue Airways): Upgraded to outperform from market perform at Raymond James. Cited recovery in near-international market, opportunity for margin expansion through Northeast alliance with AAL and new cost controls.\n   * \\+3.4% **FB** (Facebook): Barron's cover story positive; noted stickiness of both consumers and advertisers; also cited valuation with shares at 26x forward earnings vs historical average of 32x, and only largely in line with S&amp;P 500; innovation and hidden assets another positive; noted investors already cognizant of risks.\n   * \\+3.1% **NVTA** (Invitae): Confirmed a group led by Softbank Group (9984.JP) will make an investment of $1.15B in convertible senior notes to support future growth initiatives; initial conversion price of $43.18/sh represents a \\~10% premium to Friday's close.\n   * \\+2.3% **PINS** (Pinterest): Company has held talks to buy photography app VSCO, according to NY Times report; noted VSCO was last valued at $550M.\n   * \\+1.6% **PLTR** (Palantir Technologies): Announced it has been selected by the National Nuclear Security Administration for 5-year, $89.9M contract for Safety Analytics, Forecasting, and Evaluation Reporting (SAFER) project that will\n   * \\+1.4% **CZR** (Caesars Entertainment): Upgraded to overweight from equal weight at Morgan Stanley; argued market grossly underestimating recovery in Las Vegas gaming; noted promising booking trends and increasing pricing power; also positive on sports betting exposure.\n* **Notable Decliners:**\n   * \\-17.2% **ACAD** (Acadia Pharmaceuticals): FDA said application for pimavanserin in dementia-related psychosis cannot be approved in its current form; cited multiple flaws with Phase 2 and 3 studies; analysts noted FDA criticisms worse than feared.\n   * \\-7.6% **PXD** (Pioneer Natural Resources): To acquire Double Point Energy in a $6.4B cash and stock deal; Pioneer shareholders to own \\~89% of combined company, DoublePoint owners remaining 11%; downgraded to sector weight from overweight at KeyBanc, saying it is one of the highest purchase prices in years.\n   * \\-2.4% **GME** (Gamestop): Announced ATM equity offering program for up to 3.5M shares; proceeds to help further accelerate its transformation and strengthen balance sheet; stock up over 900% ytd and 6,700% in last 12 months.\n* **S&amp;P 500 Sector Performance**\n   * **Outperformers:** Consumer Disc. +2.28%, Tech +2.02%, Communication Svcs. +2.27%\n   * **Underperformers:** Energy (2.41%), REITs +0.59%, Healthcare +0.66%, Financials +0.74%, Utilities +1.09%, Materials +1.22%, Industrials +1.27%, Consumer Spls. +1.28%\n* **Data**\n* DXY: 92.6, (0.45)\n* €-$ +0.0055 or +0.47% to 1.1812\n* £-$ +0.0079 or +0.57% to 1.3904\n* $-¥ (0.47) or (0.42%) to 110.20\n* €-¥ +0.04 or +0.03% to 130.15\n* 2-year yield (2) bps to 0.16%\n* 10-year yield (1) bps to 1.71%\n* 30-year yield (0) bps to 2.36%\n* WTI Crude (May 21): ($2.69) or (4.38%) to $58.76\n* Gold (Jun 21): +$0.40 or +0.02% to $1728.8\n* Breadth on the NYSE is positive 1.57:1; breadth on the Nasdaq is positive 1.29:1\n* Index Performance\n   * Month/Quarter-to-date: Dow +1.65%, S&amp;P +2.64%, Nasdaq +3.46%, Russell +2.00%\n   * Year-to-date: Dow +9.54%, S&amp;P +8.57%, Nasdaq +6.34%, Russell +14.69%",
        "subreddit": "stocks",
        "title": "U.S. Market Recap - Monday, April 5, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mku6oi/us_market_recap_monday_april_5_2021/",
        "created": 1617683598.0
    },
    {
        "author": "Rasputincello",
        "created_utc": 1618459693,
        "id": "mr790f",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "We know they want to invest in industries they know (\"consumer and, within the technology sector, software and fintech\") and where their expertise and networks can \"create value, including through add-on acquisitions, governance enhancements, capital structure optimization, improvements to operations and risk management (including ESG, practices and metrics) and attracting and expanding institutional following and ownership.\"\n\n  \nI'm not going to discuss the team because that info is readily available on the company website: [www.cohnrobbins.com](https://www.cohnrobbins.com/home/default.aspx). There's also a good post here: [https://spacteams.com/crhc-spac-a-lineup-of-box-office-wall-street-names/](https://spacteams.com/crhc-spac-a-lineup-of-box-office-wall-street-names/)\n\n  \nI really can't find much about Cliff Robbins investments. His fund, Blue Harbour, targeted undervalued \"small and midcap companies that could return 30 to 50 percent over a two- to three-year investment horizon\". Also \"Clifton Robbins doesn't invest in a company unless its management is receptive to his ideas.\"\n\nLet's get to it. These are the private companies I found where Cohn is a chairman or advisor.   \n\n\n# 1) nanopay  \n\n# Canada based Fintech company serving customers in Canada, USA, Brazil \n\n* Platform built using hybrid blockchain technology that combines features of blockchain and conventional databases. The result is a secure, tamper resistant, high performance platform that is low cost and easy to use. \n* Much faster than any decentralized blockchain payments solution. Up to 50k transactions per second. At least 2,500x faster than decentralized blockchain solutions. \n* End-to-end protection. All transactions are private, authorized, and indisputable once completed. State-of-the-art cryptography to encrypt all data, not just sensitive data. Their security far exceeds that of most banks. 256-bit encryption \n* 95% automated development \n\nLinks:  \n\n[https://nanopay.net/](https://nanopay.net/) \n\n[https://www.linkedin.com/company/nanopay/](https://www.linkedin.com/company/nanopay/) \n\nInteresting CEO, Laurence Cook. Worked for 3 years on the Federal Reserve’s Faster Payment Task Force.  \n\n&amp;#x200B;\n\n# 2) Spring Labs \n\n# California based start-up focused on secure/private information exchange \n\n“Spring Labs was founded by members of the founding team and board of Avant, a lending platform and technology company that has served more than 600,000 customers and originated nearly $5 billion of loans through the Avant platform. Avant was recently ranked the 5th most valuable Fintech startup worth over $1 billion by Inc. Magazine. Through building Avant, the Spring Labs team witnessed firsthand the misaligned incentives and security problems of today's credit and identity ecosystem. The company is looking to revolutionize the credit and identity sharing process through a decentralized network that enables a more transparent, efficient and secure model for sharing information related to identity and credit.”  \n\nI don’t believe they have a working product yet. Their plan is divided into 3 stages, here is my summary. \n\n(Stage 01) build proprietary applications within financial services. This phase will focus on solving industry-specific use cases to prove out utilization. \n\n(Stage 02) network development, partner with leading financial services institutions and produce dedicated applications via 3rd party development. \n\n(Stage 03) 3rd parties can build applications on the Spring Protocol via a self-service model without engaging directly with Spring Labs. This open platform will enable others to leverage our data anonymization and value exchange technology \n\nStage 01 Apps: Spring Protect, Spring Defend, Spring Verify   \nStage 02 Apps: National Mortgage Registry, International Bank Data Sharing, Telecom and Utility Data Sharing, Loan Registry (Industry-specific)   \nStage 03 Apps: HIPAA-Compliant Medical Record Exchange, Genomic Sequencing Data Exchange,  \n\nSharing Economy Reputation Network, US Auto/Mortgage Title Registry, Self-Sovereign Data Marketplace, Cross-Border Self-Sovereign Identity Service \n\nOn the surface this company seems overly ambitious. But their team and advisors are so well qualified that it makes me believe in them. You be the judge. This industry needs more security, that’s for sure. If you disagree please read this headline from Fox Business: “Fed's Powell warns cyber threats pose bigger danger to US economy than 2008-style financial crisis” \n\nTheir list of advisors is almost scary tbh. \n\nGary Cohn - Former Director of the U.S. National Economic Council \n\nSheila Bair - Former Chair of the FDIC \n\nAndreas Beroutsos - Former Global Head of Financial Institutions at McKinsey \n\nRaj Date - First-ever Deputy Director of the U.S. Consumer Financial Protection Bureau (CFPB) \n\nRay Lane - Former President &amp; COO of Oracle \n\nBobby Mehta - Former CEO of Transunion \n\nNigel Morris - Co-founder of Capital One \n\nManolo Sanchez - Former Chairman &amp; CEO of BBVA Compass \n\nGuy Schory - Former Head of Strategic Initiatives at eBay &amp; PayPal \n\n&amp;#x200B;\n\nLinks: \n\n[https://www.springlabs.com/](https://www.springlabs.com/) \n\n[https://www.linkedin.com/company/springlabs/](https://www.linkedin.com/company/springlabs/) \n\nCuriously, the Executive Chairman seeded or was an early investor in Draftkings and Skillz \n\n&amp;#x200B;\n\n# 3) Hoyos Integrity \n\n# Secure Technology Services Company based in Florida \n\nThis company’s tech is very, very solid. I believe they have a monopoly in they niche, and their niche is ever-growing.  \n\n“Hoyos Integrity combines the top handset developers with the leaders in biometrics and security to bring a new approach to mobile privacy to protect critical personal and corporate information and provide peace of mind. Hoyos Integrity executives &amp; engineers have designed, built, and shipped over 150 million phones in their tenures at Multinational Fortune 100 companies.  \n\nThe Founder/CEO, Hector Thaddeuss Hoyos, is a leader in the biometrics and IT industries. As the founder and president of various cutting-edge companies with extreme vision, he has created state-of-the-art tech such as fingerprint, face and iris identification systems, and interactive financial transaction systems. He holds 100+ patents issued/pending, co-created an IEEE standard (2410), and has developed solutions being used by millions of people around the world. \n\n**Products:** \n\n* **Hoyos Phone:** Basically the most secure smartphone ever. Uses an OS that is not open and has zero vulnerabilities. Our devices run a military-grade, NSA certified operating system (Integrity 178B) that has not had a single hack in over 20 years of government use. Integrity 178B is the same OS that currently safeguards military and commercial aircraft, government agency systems, critical infrastructure and the US nuclear arsenal. The phones are USA made to monitor every aspect of the supply chain for QA, but also to ensure the chip in every Hoyos device is clean. \"We eliminate the threat of intrusion in the manufacturing process.\"\n* **Biometrics and Transactional Secure Systems (BATS):** (*Yes, it uses Blockchain technology*) BATS is the foundation of Hoyos’ secured solutions. \"As traditional enterprise security stores ID data in a single location, it creates a single point of mass attack for hackers. With BATS, user data is secure, encrypted and it is architectured to have no single point of attack, increasing security by orders of magnitude.\"\n* **Hoyos Biometrika:** Users never have to remember passwords or login information. Biometrika is device-agnostic and works with rear camera (Mano), front camera (Caras) and microphone (Voz). Comprehensive with liveness detection of user attempting to access device. \n* **Hoyos Wallet:** attached to the account owner’s biometrics, the Hoyos Wallet is the ultimate authentication and encryption method that ties together advanced, multi-biometric security and control, the IEEE 2410 standard compliant BATS and the decentralized blockchain architecture. It significantly reduces a large attack surface down to a single user. A hacker would have to target a single user and capture exact biometric vectors that have been fused to the private key.  \n* **Frictionless Instant Payment System (FIPS):** built on Hoyos’ Digital; assures privacy as no user data is mined; biometrically protects every transaction; holds any digital fiat or tokenized currency; is hot/online; and is fully regulatory compliant. \n\nLinks: \n\n[https://hoyosintegrity.com/](https://hoyosintegrity.com/) \n\n# 4) Gro Intelligence \n\nThis company **harvests large amounts of agricultural data** from around the world and **organizes it**. With all these data they can **identify and even forecast anything that could be driving the supply or the demand of agricultural products**. \n\nThey collect data from: satellites, weather stations, govt agencies, commodity exchanges, trade organizations. Last year, the CEO said on an interview that they process over 800 trillion data points a day. \n\nNow this company is really interesting and I'm sure Cathie Wood would love to invest on this one since it's definitely a disruptive innovator. Their technology can be used by any company that relies on agricultural products, which include companies in industries like chemical, pharmaceutical, manufacturing, textiles, food, etc. Other industries, like banks, can also find this data useful.\n\n[https://gro-intelligence.com/](https://gro-intelligence.com/about/team)  \n[https://youtu.be/RvVrizTKChU](https://youtu.be/RvVrizTKChU)[https://www.nytimes.com/2021/01/08/business/a-start-up-raises-money-in-a-bid-to-create-business-benchmarks-for-climate-risk.html](https://www.nytimes.com/2021/01/08/business/a-start-up-raises-money-in-a-bid-to-create-business-benchmarks-for-climate-risk.html)  \n\n\n# 5) Starling Trust \n\n# Applied Behavioral Sciences Company based in Washington DC \n\n“Starling marries behavioral science and AI (Alternative Intelligence) to uncover the invisible team dynamics that drive organizational outcomes — allowing you to identify leading indicators of trouble and to spot where management intervention is likely to achieve success. By distilling critical data-driven insights from the everyday interactions that define operational reality, Starling equips you to promote desired performance proactively, and to demonstrate a forward-looking risk management capability.” \n\nI’m sure Top executives find value in this, especially in companies going through culture change. I would not invest because I don’t really understand how they could put a price on their service. Feel free to offer insight in the comments.  \n\nThis is the CEO’s About on Linked in: “At Starling, I help organizations to create, protect, and restore value. My background is in risk management and investigative intelligence. I've led successful engagements in over 50 countries” \n\nLinks:\n\n[https://starlingtrust.com/](https://starlingtrust.com/why-starling/)  \n\n[https://www.linkedin.com/in/stephen-j-scott-783690/](https://www.linkedin.com/in/stephen-j-scott-783690/) \n\n&amp;#x200B;\n\n6) Parkside Securities \n\nGlobal Stock Trading and Clearing Platform  \n\n“Parkside is simplifying global access to US stocks through regulatory innovation and modern technology. We’re a registered US broker-dealer providing access to US stocks for individuals around the world - starting with Asia. Soon you can invest globally using your local currency, low fees and no minimums.” \n\n[https://www.parksidesecurities.com/#/](https://www.parksidesecurities.com/#/) \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**7) Infinite Arthroscopy Inc. / Indago**  \n\n**Biomedical Innovation Company** \n\nI’m not going to deep into this one because it seems to be outside of the scope of the SPAC. They have one product, “ArthroFree™ is the premier wireless arthroscopic camera system\\* defining the new standard for minimally invasive surgery.” [https://www.indago.io/](https://www.indago.io/) \n\n**8) Abyrx**  \n\nAbyrx was created in 2013 with its acquisition of the HEMASORB Resorbable Hemostatic Bone Putty portfolio and the right to develop Bezwada Biomedical’s polymer technology for bone applications. **The company** **develops, manufactures and provides advanced biomaterials and therapeutic devices** for use during surgical procedures. Abyrx is privately-held and located in Irvington, NY. The company's products are protected by over 50 issued and pending patents. [https://www.abyrx.com/](https://www.abyrx.com/) \n\n**9) Machine Zone** \n\nMobile Gaming Company best known for its widely advertised freemium mobile MMO strategy games Game of War: Fire Age and Mobile Strike, which were both simultaneously ranked among the top ten highest-grossing mobile games in 2016. It also developed Final Fantasy XV: A New Empire. \n\nOn May, 2020 Machine Zone was acquired by AppLovin, a mobile gaming giant. Gary Cohn helped negotiate the deal. which is going to IPO in soon and it’s targeting a $30 billion valuation. AppLovin is backed by KKR where, coincidentally, Cliff S. Robbins worked from 1987 until 2000. \n\n[https://markets.businessinsider.com/news/stocks/applovin-kkr-backed-gaming-targets-30-billion-valuation-us-ipo-2021-4-1030282238](https://markets.businessinsider.com/news/stocks/applovin-kkr-backed-gaming-targets-30-billion-valuation-us-ipo-2021-4-1030282238) \n\n*Disclaimer: This is not financial advice. I'm no one's financial advisor. If you lose money, it's your own fault.*  \n*Disclosure: I own over 1,300 common shares of CRHC. Will keep adding.*",
        "subreddit": "SPACs",
        "title": "Deep Dive into CRHC, Gary Cohn's companies",
        "url": "https://www.reddit.com/r/SPACs/comments/mr790f/deep_dive_into_crhc_gary_cohns_companies/",
        "created": 1618488493.0
    },
    {
        "author": "2rofl2",
        "created_utc": 1618777048,
        "id": "mtkjpk",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Cloudflare is a grossly undervalued company. Matthew Prince is positioning Cloudflare to compete and win head-on with AWS. [He doesn't appear to be cucking out.](https://twitter.com/search?q=eastdakota%20amazon&amp;src=typed_query)\n\nCloudflare's DNS and CDN services are today far superior to Amazon's Route53 and CloudFront. It is not even close. I expect Cloudflare to clone the most important AWS features and accelerate revenue growth thanks to their privileged position as the unquestioned best at the DNS level.\n\nThis company has reported 50% annualized growth in every one of the seven quarters they've been public and I believe that revenue growth will actually accelerate under conservative assumptions. \n\nCloudflare's only competitor, AWS, is in Oracle-style money extraction mode. AWS' customers are being bled dry and WILL leave.",
        "subreddit": "wallstreetbets",
        "title": "I think Cloudflare $NET is better than AWS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mtkjpk/i_think_cloudflare_net_is_better_than_aws/",
        "created": 1618805848.0
    },
    {
        "author": "NPRjunkieDC",
        "created_utc": 1617305056,
        "id": "mi2vza",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Insider Ownership is calculated as the total number of shares owned by insiders (shareholders who own more than 5% of the corporation or an officer or director of the company) divided by the total Shares Outstanding.\n\nA high value of insider ownership means that those working for the company have a large stake in the success of the company. This is sometimes seen as a sign that those running the company will work hard to ensure its success or believe the company's stock price will rise.\n\nOverall, if there is insider buying, it could be a bullish sign for a company’s stock.\n\nThere is only one reason why an insider would buy their stock. They believe that it is undervalued and that the price of the shares will rise.\n\nI took a look at my own stocks and found that many of my favorite had insider ownership well over 10%\n\nOTC:\nKAVL (72%) + \nBRLL (57%) + \nPONGF (29%) +\nBNXAF (16%) +\nKROEF (16%) +\nSXOOF (15%) +\nSLGBF (14%) + \nCWSFF (12.5%) +\nBTZI (11%) + \nNPPTF (11%) +\nABML (10%)\n\nNON-OTC:\nCURI (52%) +\nFLNT (43%) +\nUSIO (37%) +\nTAPM (32%) +\nHIMX (22%) +\nZDGE (16%) + \nPERI (15%) +\nRSI (11%) + \n\nA few others I found from mid-caps to very large companies. \n\nBSRR (10%) +\nBRO (17%) +\nCHMG (29%) +\nSRGA (12%)\n\nROL (57%) +\nHRL (47%) +\nORCL (40%) +\nNWS (40%) + \nFOX (40%) + \nURBN (39%) + \nMS (20%) +\nUA (17%) +\nMET (15%) + \nCYTH (3%) +",
        "subreddit": "StockMarket",
        "title": "Stocks with high insider ownership are some of my favorite",
        "url": "https://www.reddit.com/r/StockMarket/comments/mi2vza/stocks_with_high_insider_ownership_are_some_of_my/",
        "created": 1617333856.0
    },
    {
        "author": "bigdigdoug",
        "created_utc": 1617840022,
        "id": "mmfdw0",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": " I posted this on Monday in a couple other subs but unfortunately I didnt get in - was asked to post it here but it will probably get removed and/or downvoted. \n\nI'm currently watching from the sidelines as it has pulled back pretty good today. I'm keeping an eye for it to either drop back below the 200MA and possibly fizzle out or get back above the 50MA and hold. Its OTC which has been getting hammered as of late so definitely proceed with caution. \n\n \n\n[$RKFL](https://finance.yahoo.com/quote/RKFL?p=RKFL&amp;.tsrc=fin-srch)\n\nSource: [Here](https://www.goldmanresearch.com/202104011316/Opportunity-Research/blockchain-crypto-payments-pioneer-to-transform-ecommerce.html)\n\n**COMPANY SNAPSHOT**\n\nRocketFuel Blockchain, Inc. is global payments processing company offering highly efficient 1-click check-out solutions to eCommerce merchants and their customers. RocketFuel’s solution focuses on enhanced customer privacy protection eliminating the risk of data breach while improving speed, security and ease of use. RocketFuel users are able to enjoy seamless check-out using their favorite cryptocurrencies or direct bank transfers and forget the clunky cart and card paradigm of the past. RocketFuel merchants are able to implement new impulse buying schemes and generate new sales channels unavailable in current eCommerce solutions.\n\n**INVESTMENT HIGHLIGHTS**\n\n**RKFL is an early mover as a global provider of one-click online payment options using Bitcoin and 40+ other cryptocurrencies.** Moreover, RKFL is the first cryptocurrency payment service to provide a seamless one-click checkout experience.\n\n**The market is huge and growing at an enviable rate.** According to Markets and Markets, the blockchain technology market is expected to reach the $39.7B mark in 2025, up from $3B in 2020.\n\n**Current eCommerce methods are outdated, problematic, and costly, while the Company’s platform is designed to improve the merchant and customer experience.** Implementation should lead to lower merchant costs, potential recurring business and may foster customer loyalty. \n\n**Management has a proven track record of developing new technologies, bringing them to market, and generating value for the investors.** The CEO has exited 5 other companies. Thus, we envision RKFL emerging as a takeover candidate.\n\n**Our forecasts suggest sales will jump from $1.8M to $40M in 3 years, with meaningful EPS.** Stocks tend to generate their greatest gains when the transition from early adoption to mass market appeal begins, which could begin in late 2021.\n\n**Our 6-12-month target of $6.15 reflects a reasonable 4x our FY24 sales estimate of $40M and roughly 28x our $0.22 EPS forecast.** This target could prove to be conservative if adoption accelerates.\n\n* Price as of 3/31/21$1.32\n* 52 Wk High - Low$3.25 - $0.50\n* Est. Shares Outstanding24.2M\n* Market Capitalization$31.9M\n* Average Volume17,008\n* Exchange:OTCQB\n\n**COMPANY INFORMATION**\n\n**RocketFuel** **Blockchain, Inc.**  \n**201 Spear Street, Suite 1100**  \n**San Francisco CA 94105**\n\nWeb:     [www.RocketFuelBlockchain.com](http://www.rocketfuelblockchain.com/)\n\nEmail:   [info@rocketfuelblockchain.com](mailto:info@rocketfuelblockchain.com%0d)  \nPhone : 424.256.8560\n\n***The View from 30,000 Feet***\n\nBlockchain payments innovator **RocketFuel** **Blockchain, Inc. (OTCQB – RKFL)** is poised to transform the global eCommerce industry, in our view. The Company is an early mover as a global provider of one-click online payment options using Bitcoin and dozens of other cryptocurrencies. Moreover, RocketFuel is the first cryptocurrency payment service to provide a seamless and elegant one-click checkout experience that today's digital and mobile-centric consumers have come to expect from eCommerce marketplaces, such as **Amazon (NASDAQ – AMZN)**. \n\nThe RocketFuel platform, based on patent-pending technology, enables merchants and consumers to easily complete payment for goods and services using 43 different cryptocurrencies or direct bank transfer in a completely secure environment. A significant benefit of the Company’s approach is that the entire shopping cart checkout process can be executed via a distributed ledger or blockchain. Thus, merchant websites will no longer required to operate complex, and costly payment and check-out infrastructures. With the one-click checkout used on RocketFuel-partnered sites, consumers will enjoy unrivalled convenience .\n\nAs is typically the case with new technologies and applications with a broad scope, we expect early adopters to dominate usage during 2021 as online merchants shopping cart and payment solutions providers implement the crypto acceptance functionality, with mass market utilization occurring in 2022. With estimates suggesting that the number of (non-Facebook) crypto wallet holders will grow to 250M+ in the next 2-3 years, up from 68M today, substantial adoption lies ahead.   \n\n***The Problem***\n\neCommerce has enjoyed wide, mainstream adoption and in many cases has emerged as the shopping method of choice for consumers during the COVID-19 pandemic. Unfortunately, for merchants and consumers alike, many of the payment system setups and associated technologies in place today have underlying issues, which in turn have a deleterious effect on merchant/consumer transaction execution.\n\nFor consumers, payment systems and shopping cart utilization can be awkward and clunky, require multiple steps and redirects to 3rd parties, and may not be secure, resulting in a less than stellar customer experience. For merchants, the current eCommerce payment infrastructure is even more problematic. In most cases, merchants are required to use an intermediary, costing billions in excess expenses annually. Roughly 1 in 5 carts leave without completing a transaction because consumers do not trust the merchant’s system. Plus, in most cases, fees are high, payments are delayed, and exorbitant fees due to fraud, fraud prevention, and chargebacks related to the inefficient back-end operations can be excessive, reducing profits.\n\n***The Solution*** \n\nIn contrast, by leveraging modern blockchain technology and its proprietary platform, RocketFuel offers consumers a single-click pay solution, pay with crypto or direct bank transfer option with no redirects or filling out forms as the information is stored at once. The process is seamless-simple, efficient, secure, and convenient. Merchants generate higher shopping cart conversion, pay lower fees, have greater security, transparency, less fraud, and improved cash flow. With a better experience for both sides of the transaction, and improved order and shipping fulfillment, merchants can foster loyalty and generate recurring business. \n\n***Today and Tomorrow***\n\nThe Company launched its first product in a live environment in March 2021 and with two travel merchant customers and a tax auditing firm in hand, management intends to continue to develop the check-out technology with several larger U.S. eCommerce merchants, social media and blogsites. With connections to several larger eCommerce merchants, near term sales and marketing efforts will focus on a few “big fish” rather than many smaller merchants and will scale up initiatives as funding permits. We believe that the Company will also target specific verticals that may be a source of early adopters and crypto wallet holders in verticals such as online gambling, gaming, and with merchants selling high ticket items. In conjunction with this targeted approach, RocketFuel may utilize social media to generate awareness and attract consumer influencers. Given that the phase from early adoption to mass market adoption can take 12-18 months, we believe that the Company could enjoy exponential merchant sign-ups going forward, along with consumer utilization, from 2021-2022, with the greatest recurring platform utilization by consumers beginning in 2023. \n\n***Financial Forecasts and Valuation***\n\nIt is difficult to accurately project the deployment and adoption success of a new technology and application such as the unique RocketFuel blockchain and crypto payment service.  However, given the underlying growth rates in blockchain ledger utilization for financial and payment transactions, as well as the proliferation of crypto wallet adoption, it is clear that major upside exists. Widespread adoption and growth are further affirmed by the Company’s underlying offering which solves major unmet needs in eCommerce for merchants and consumers alike. As with many young companies, it comes down to efficient execution. The management has a strong, proven track record of developing new technologies, bringing them to market, and generating value for the investors. The CEO has exited 5 other companies.\n\nWe should note that our forecasts largely reflect the typical growth inherent in new technology firms from early mover/early adopter stage to mass market appeal. Plus, the speed with which adoption in the online world occurs tends to be faster than most historical segments, further bolstering our investment thesis and projected growth rates. The variables in our forecasts tend to be the average fee percentage charged to merchants as well as revenue derived via license. It is too early in the maturation cycle to firmly estimate such revenue breakdowns or figures.\n\nTo simplify and streamline our initial forecasts, we have estimated $100M in business transacted at an average fee of 1.8% for Year 1 (Apr 2021-Mar 2022), reduced to 1.5% on $800M in transactions in FY23E and $2.5B in transactions for FY24E. While we believe additional revenue streams could be booked in FY23E, we view such contribution as a bonus at this time. However, we do project $2.5M in licensing revenue and other fees in FY24E. Based on this model, we project revenue of $1.8M in FY22E with a loss of $2.45M, or ($0.09) and revenue of $12M in FY23E with net profit of $650K, or $0.02. We preliminarily project $40M in revenue ($37.5M in transaction fees and $2.5M in licensing fees) for FY24E with net of $7.3M, or $0.22, and a net margin of 18.3%.\n\nGiven the game-changing technology and its resultant impact on the use of cryptocurrencies along with ecommerce efficiency and volume, we believe that RKFL could be afforded premium valuations as adoption occurs. Going forward, we recommend investors value the Company based on milestone events such as merchant signup as we view 2021 as a key infrastructure, proof-of-concept year, with major revenue growth in the cards in 2022 (fiscal 2023). Our 6-12-month target of $6.15 reflects a reasonable 4x our FY24 (CY23) sales estimate of $40M and roughly 28x our $0.22 EPS forecast. This target could prove to be conservative if adoption accelerates later this year or in early 2022.\n\nFinally, we believe that as a critical mass adoption among merchant occurs, the Company could emerge as a takeover candidate by a leading payment services or provider entity. RocketFuel’s leadership has an enviable history of building and selling technology start-ups at key inflection points. While this event may not occur, it may have an occasional impact on valuation and should provide further confidence in management’s capabilities.\n\n**INDUSTRY PRIMER: BLOCKCHAIN**\n\n📷\n\nAccording to a recent report by Markets and Markets, the blockchain technology market is expected to reach the $39.7B mark in 2025, up from $3B in 2020.\n\nA blockchain, also known as a “distributed ledger technology,” is a sequential, ever-growing, time-stamped set of records used to secure transactions across multiple devices that are grouped in blocks and maintained by disparate participants. Each block is interdependent, making alterations of records economically difficult if not outright impossible.\n\nTransactions in money, equities, bonds, titles, deeds, contracts, and virtually all other kinds of assets can be implemented and stored securely, privately, and from peer to peer, because trust is established by network consensus, cryptography, collaboration, and sophisticated code---without intermediaries. Given the opportunities associated with such a disruptive technology, many firms in varied industries are actively operating in the space to transact business, agreements and financial transactions more efficiently.\n\nCommercial and central banks across the world are now using blockchain technology for payment processing and issuing of their digital currencies. The technology enables cross-border payments that are less expensive and faster as compared to traditional systems. The remittance cost within the blockchain is 2% to 3% of the total amount as compared to other third parties as blockchain does not require third-party authentication. Even governments are introducing CBDCs (Central Bank Digital Currency) to replace cash and traditional fiat-currencies. Plus, they are putting social media behemoths such as Facebook and Google under scrutiny for their lack of privacy protection and data security.\n\nOne of the most popular applications of blockchain is cryptocurrency. Trading in cryptocurrency is relatively easy compared to other assets. You can begin trading just by signing up for various wallets on the market. Furthermore, there are different types of wallet apps, each with its own advantages, such as levels of security, accessibility, and more. The most popular and well-known wallet is Coinbase with 639,885 daily active users (DAUs). If Facebook’s Libra initiative to its 2B users is successful, this figure will be dwarfed in short order.\n\nThe payments segment dominated the market in 2020 and accounted for more than 44.0% share of the global revenue. Blockchain technology improves payment system efficiency, minimizes operating costs, and offers transparency. These benefits provided by blockchain technology are increasing its use in payment solutions, thus, driving the segment growth. At the same time, blockchain reduces the need for middlemen in payment processing, which is also a major factor driving the segment growth.\n\nBitcoin (the largest cryptocurrency) is the most popular application of blockchain, but increasingly this innovative technology can be used in various business and commercial purposes. The elimination of the middleman in various transactions and processes promises a much more efficient workflow using blockchain. Additionally, increasing concerns about privacy and security make blockchain an ideal technological pipeline for modern processes.\n\nEnter the eCommerce application.\n\n**ROCKETFUEL: THE GAME-CHANGER**\n\nWhen validating a new market or technology, it is instructive to review history as it tends to repeat itself. Most major technology breakthroughs and disruptions had a few things in common:\n\n* A large, inefficient market, usually based on old technologies and processes, generating problems and unnecessary cost for all stakeholders.\n* A new technology allowing new companies to invent new solutions that address these problems.\n\nSome examples include improved internet technology which enabled Amazon to evolve our commerce habits from brick and mortar to digital and mobile technology innovations and evolutions that have led to Uber and Lyft transforming transportation.  The payments industry is no different. Its architecture and operations are still based on a 40-year-old physical card with a chip and limited fraud prevention capabilities. In contrast, digital technologies such as blockchain and cryptocurrencies are prompting the replacement of the old architecture with a new efficient, lower cost approach. y changes the way payments are made.\n\nThere is a huge inefficient market (the payment market) causing problems for all stakeholders. There is a technology that has the potential to fix it. Enter RocketFuel Blockchain.\n\nRocketFuel is a new frictionless blockchain based payment solution for eCommerce merchants to accept payments in crypto or cash via bank transfer and receive payment and shipping information in one one-click transaction without the need for payment intermediaries. In anticipation of a major proliferation in crypto utilization for payments and business, large eCommerce and retail merchants now accept crypto as a payment method. In fact, over one-third of all small and medium-sized U.S. companies already accept Bitcoin as a B2B payment source.\n\nThe eCommerce space is estimated to be $3.5T, yet it represents less than 15% of total commerce. PayPal, a significant player in the online payments arena with over 350M users, allowed users to buy and sell crypto and just announced its “Checkout for Crypto” feature. This function, allows users to instantly convert their Bitcoin, Ethereum, Litecoin, or Bitcoin Cash to US dollars (with no additional transaction fees) that PayPal then uses to complete the transaction. In our view, this is a validation of the RocketFuel approach and will likely capture its share of this function. Still, since it lacks the 1-click convenience and appears to still be clunky and expensive relative to our forecast of the RocketFuel pricing, RocketFuel remains in the driver’s seat.\n\nAs mentioned above, existing solutions are costly, impact conversion, not secure, leads to fraud, and will eventually go the way of the milkman. Merchants and consumers alike crave security, convenience, transparency, low cost and trust.  \n\n***The*** ***RocketFuel*** ***Approach***\n\nThe Company provides check-out and payment systems directly on the check-out page that securely automate and simplify the way online payment and shipping information is received by merchants from their customers. The check-out systems are designed to enhance customers’ data protection, enabling consumers to pay for goods and services using cryptocurrencies or by direct transfers from their bank accounts without exposing spending credentials such as credit card data. At the same time, the check-out systems are designed to increase the speed, security and ease of use for both customers and merchants and include a merchant portal that provides detailed transactions and metrics about payments received by the merchant.\n\nThey also include a customer portal where shoppers are able to track their payments, configure payment defaults and connect with various cryptocurrency exchanges and banks to facilitate payment to merchants. Merchants are able to integrate a unique pop-up user interface that allows customers to pay directly from their ecommerce checkout page with no need to redirect to another website or web page.\n\nData is key and the merchant portal is updated instantly when a payment transaction is made on the merchant website. The merchant is notified of the transaction and can see the transaction details, including the customer that made the transaction, the transaction amount and the transaction items. This information is added to the merchant dashboard where various metrics are tracked and displayed to the merchant, including information about the various cryptocurrencies that are used for payments to that merchant and the funds received by the merchant from the different currencies.\n\nCustomers of merchants that use the RocketFuel payment solution are able to track their payments in their online portal. They are also able to track payments they made to all the merchants that are integrated with the RocketFuel payment technology within one consolidated user portal. They are able to connect to multiple exchanges including Coinbase, Binance, Kraken, Gemini and others to pay directly from them. They can also pay from any cryptocurrency wallet. Customers are able to connect with multiple bank accounts to pay from as well.\n\n📷The “single-click” RocketFuel check-out solution is based on a streamlined check-out process for eCommerce purchases. The payment user interface is displayed as a stand-alone popup that allows the creation of new accounts as well as payment directly from crypto exchanges, crypto wallets, and bank accounts, with no redirects to browser tabs or pages. This can be integrated as a plugin on the merchant checkout page or as a browser extension. The plugin comes integrated with popular ecommerce platforms including WooCommerce, Shopify, Prestashop and others. The payment interface is designed for both web and mobile checkout experiences. Merchants are able to integrate the RocketFuel payment interface to their checkout page with software development kits (SDKs) that are available via the merchant portal. Application programming interfaces (APIs) are also available to the merchant for deeper integration into backend systems, ERP platforms, and other third-party platforms.\n\nCryptocurrencies are stored in different types of cryptocurrency wallets. These wallets can include mobile wallets, web wallets, desktop wallets, hardware wallets, and exchange wallets. Currently, it can be a difficult, confusing and multi-step process to use these wallets to make cryptocurrency payments. With RocketFuel’s blockchain solution, cryptocurrency holders can use any of the above digital wallets to make payment for products or services to any RocketFuel merchant with 1, 2, or 3 steps.\n\nUsing the “single-click” RocketFuel check-out technology and check-out button, consumers will no longer be re-directed to a third-party  With the RocketFuel solution, eCommerce merchants will need no contact or other information exchange with the consumer in order to receive their payment or shipping details. Instead, they will have immediate visibility of payments from customers via the RocketFuel payment system, which may be integrated into merchants’ fulfillment centers.\n\nLooking ahead, the technology will also be used for different scenarios, including paying for services, paying invoices, and other payment strategies. In addition, under a future version of the payment system, advertisements in which the entire check-out process is embedded will be able to be placed on third party websites and sales may be completely finalized there. Thus, the platform will enable eCommerce strategies that can include advertisements with a fully integrated check-out process. This prospective feature is unlike any other currently in use today and could eventually be a significant driver of revenue, once completed. Such advertisements will provide significant new sales channels to retailers that are simply not possible with legacy check-out solutions.\n\nIn addition to potential competition from PayPal, the primary competitor remains Bitpay, which is already well established as the leading crypto payment technology in the market, having been founded in 2011. Given that RocketFuel offers a better user experience for crypto payments, allows payment from dozens of other cryptocurrencies, and other wallets, and exchanges, RocketFuel’s diversity is a major strength.  RocketFuel also offers services that Bitpay currently does not, such as providing merchants immediate visibility of payment transactions, real time metrics of transactions and customers, easy integration to ecommerce checkout as well as deep integration to backend platforms. Furthermore, with an average of 72,000 transactions per month, it will not take significant merchant penetration for RocketFuel to surpass Bitpay, in our view.\n\n***Target Markets*** \n\nThe Company’s initial target market is the travel industry and RockeFuel already has signed up two sizable customers: Sky Tours and Military Fares. It should be noted that worldwide sales of flight tickets sold online in 2019 was $540B and the 2 largest reservations systems generate more than $10B in yearly revenue, making this vertical a hot commodity. Management plans to target travel merchant and web platforms. Given the complexity of the intermediaries and reservation systems, high costs and notoriously delayed payments, the RocketFuel solution can simplify the payment process and customers no longer have to provide sensitive information. We believe other verticals such as online gambling, the procurement of gift cards, and high-ticket items could prove to be lucrative for the Company. As a result, we expect sales and marketing headcount to rise over the next 12-18 months, in conjunction with rapid deployment and implementation of existing and future solutions.\n\n**ROCKETFUEL BLOCKCHAIN LEADERSHIP TEAM**\n\n**Gert Funk, Chairman, Founder, Chief Product Officer**\n\nGert Funk has over 15 years as a payment service provider for international eCommerce merchants. A serial entrepreneur since 1990, he is the founder of RocketFuel Blockchain, Inc. Gert has been an expert in blockchain technology and applications for eCommerce since 2015.\n\n**Peter Jensen, Chief Executive Officer**\n\nPeter Jensen is an experienced executive with extensive global experience within enterprise software. After holding sales and marketing positions within Oracle, Symantec, and VMware in Europe and the US, Peter has been focusing on building and growing start-ups in Silicon Valley as CEO and VP of Sales. Examples include Thinstall (acquired  by VMware), StopTheHacker (acquired by Cloudflare), ParStream (acquired by CISCO), SPanugo (acquired by IBM), and others. He is currently the CEO of RocketFuel Blockchain, a fintech software company providing a payment solution that allows eCommerce merchants to receive Crypto payments.\n\n**Bennett** **Yankowitz, Chief Financial Officer**\n\nBennett Yankowitz is an expert in ICO law with more than 30 years of experience as a corporate attorney with leading law firms. Ben specializes in securities, financial and merger and acquisition transactions. He holds law degrees from the University of Southern California and the University of Cambridge.\n\n**Rohan Hall, Chief Technology Officer**\n\nRohan Hall has over 30 years of experience in the technology sector, Rohan is a noted and published author and Fintech company founder. A serial entrepreneur and Blockchain expert, Rohan has had successful blockchain exits.\n\n**FINANCIAL FORECASTS**\n\n*(Analyst’s Note: These forecasts are our own and we did not receive guidance or projections from RKFL management.)*\n\nOur forecasts largely reflect the typical growth inherent in new technology firms from early mover/early adopter stage to mass market appeal. Plus, the speed with which adoption in the online world occurs tends to be faster than most historical segments, further bolstering our investment thesis and projected growth rates. The variables in our forecasts tend to be in the average fee percentage charged to merchants as well as revenue derived via license. It is too early in the maturation cycle to estimate such revenue breakdowns or figures.\n\nTo simplify and streamline our initial forecasts, we have estimated $100M in business transacted at an average fee of 1.8% for FY22E or Year 1 (Apr 2021-Mar 2022), reduced to 1.5% on $800M in transactions in FY23E and $2.5B in transactions for FY24E. While we believe additional revenue streams could be booked in FY23E, we view such contribution as a bonus at this time. However, we do project $2.5M in licensing revenue and other fees in FY24E. Based on this model, we project revenue of $1.8M in FY22E with a loss of $2.45M, or ($0.09) as management begins meaningful sales and marketing expenses to build awareness and execute merchant signups in key verticals such as the travel industry and online gambling. \n\nIn FY23E, we forecast significant revenue growth with top line reaching the $12M mark. Total operating expenses are estimated to reach $8.25M with expanded sales and marketing expenses, along with R&amp;D, reflecting upgrades to the core functionality. Based on this model, net profit is slated to reach $650K, or $0.02, with a slight rise in shares outstanding to reflect a modest fundraise in conjunction with a prospective up-list to NASDAQ. We preliminarily project $40M in revenue ($37.5M in transaction fees and $2.5M in licensing fees) for FY24E with net of $7.3M, or $0.22, and a net margin of 18.3%.\n\nIt should be noted that while there are not material direct COGS, we have allocated some indirect expenses to arrive at a gross margin of around 72-73% for all years. We believe that this is conservative and may have to be adjusted higher, thereby raising profitability and our price target.\n\n**RISK FACTORS**\n\nIn our view, the Company’s biggest risks are straightforward: the timing and magnitude of broad adoption of its core technology and applications by both merchants and consumers. Secondary risks include changes in the regulatory environment affecting utilization along with marketing effectiveness. Competitive risks include lower pricing, more effective sales/marketing, greater functionality and features. The aforementioned risks could come from larger competitors, existing firms, or new entrants. Still, these future concerns are consistent with firms of RocketFuel’s size and early mover standing. Moreover, we believe that the Company’s seasoned management team is prepared to overcome these hurdles and generate significant top-line growth, deployment and  implementations.\n\nVolatility and liquidity are typical concerns for microcap stocks that trade on the over the counter (OTC) stock market. In addition to a recent funding access announcement regarding Triton Funds, management may seek to raise additional capital next year in conjunction with an up-list to NASDAQ, to fund corporate expansion and potential M&amp;A. An overriding financial benefit as a public company is the favorable access to and the availability of capital to fund product launches, consistent marketing campaigns and other initiatives. Since the proceeds of any future funding would be used in large part to advance major business development and sales, we believe that any dilutive effect from such a funding could be offset by related increases in market value.\n\n**VALUATION AND CONCLUSION**\n\nRKFL is an early mover as a global provider of one-click online payment options using Bitcoin and 40+ other cryptocurrencies. Moreover, RKFL is the first cryptocurrency payment service to provide a seamless one-click checkout experience. The market is huge and growing at an enviable rate. According to Markets and Markets, the blockchain technology market is expected to reach the $39.7B mark in 2025, up from $3B in 2020.\n\nCurrent eCommerce methods are outdated, problematic, and costly, while the Company’s platform is designed to improve the merchant and customer experience. Implementation should lead to lower merchant costs, potential recurring business and may foster customer loyalty. \n\nManagement has a proven track record of developing new technologies, bringing them to market, and generating value for the investors. The CEO has exited 5 other companies. Thus, we envision RKFL emerging as a takeover candidate. At present, our forecasts suggest sales will jump from $1.8M to $40M in 3 years, with meaningful EPS. Stocks tend to generate their greatest gains when the transition from early adoption to mass market appeal begins, which could begin in late 2021.\n\nGiven the game-changing technology and its resultant impact on the use of cryptocurrencies along with ecommerce efficiency and volume, we believe that RKFL could be afforded premium valuations as adoption occurs. Going forward, we recommend investors value the Company based on milestone events such as merchant signup as we view 2021 as a key infrastructure, proof-of-concept year, with major revenue growth in the cards in 2022 (fiscal 2023). Our 6-12-month target of $6.15 reflects a reasonable 4x our FY24 (CY23) sales estimate of $40M and roughly 28x our $0.22 EPS forecast. This target could prove to be conservative if adoption accelerates later this year or in early 2022.\n\nFinally, we believe that as a critical mass adoption among merchant occurs, the Company could emerge as a takeover candidate by a leading payment services or provider entity. RocketFuel’s leadership has an enviable history of building and selling technology start-ups at key inflection points. While this event may not occur, it may have an occasional impact on valuation and should provide further confidence in management’s capabilities.",
        "subreddit": "pennystocks",
        "title": "Blockchain, Crypto Payments Pioneer to Transform eCommerce",
        "url": "https://www.reddit.com/r/pennystocks/comments/mmfdw0/blockchain_crypto_payments_pioneer_to_transform/",
        "created": 1617868822.0
    },
    {
        "author": "swingorswole",
        "created_utc": 1618842208,
        "id": "mu1p92",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hi all, I have a call credit spread on $orcl at $75/$77.5 (tight spread, lesson learned) that expires 5/21. $orcl is really making a big run right now and I'm currently ITM on both my short and long. It's only 1 contract, so this won't break me, but I'd like to use it as a learning lesson.\n\nI sold the vertical for $0.41 credit and it will currently cost $1.91 debit to buy it back. With a $2.5 spread, my max loss is $250 - $41 = $209.\n\nOkay, so this is $orcl right now:\n\n[https://www.tradingview.com/x/5xTdiiL9/](https://www.tradingview.com/x/5xTdiiL9/)\n\nMy thesis was that $orcl would continue in the channel for a bit when I sold this vertical. Looking back at the chart, honestly, I should have sold a bull put spread in March instead of a bear call spread, but my thinking at the time was, again, that $orcl would stay in the channel.\n\nSeeing this trade go south, I see these options:\n\n* **ASSUMPTION**: Stock will go down  \nLet theta work, assume that $orcle will not use the previous upper band as support and will instead fall back into the channel, leaving me OTM in the next few weeks. Worst case: take $209 loss\n* **ASSUMPTION**: Stock will find support ITM  \nBTC now at $1.91 debit for a realized loss of $150\n* **ASSUMPTION**: Stock will find support ITM  \nBTC the long leg, take the shares on the short leg, sell CC's (I don't want $orcl shares so I am not really very interested in this, just listing to be safe in case somebody believes it's the best option)\n\nAm I missing any outcomes/pivots here I should analyze? Also, what would you do and why?",
        "subreddit": "options",
        "title": "bear call spread 5/21 on $orcl going south, need input",
        "url": "https://www.reddit.com/r/options/comments/mu1p92/bear_call_spread_521_on_orcl_going_south_need/",
        "created": 1618871008.0
    },
    {
        "author": "SnooPies6243",
        "created_utc": 1618924192,
        "id": "mupxxy",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Disclaimer: The content on this note is being provided for information purposes only. This note does not provide tax, legal, insurance or investment advice. You alone are solely responsible for determining whether any investment, security or strategy or any other product or service, is appropriate or suitable for you based on your investment objectives and personal and financial situation. You are also responsible for evaluating the merits and risks associated with the use of the information on this note before making any decisions based on such information or other content. See the entire disclaimer at the end of this note.\n\n**\\*\\*\\* Estimated due diligence reading time: 10 minutes \\*\\*\\***\n\n**THESIS**: I am optimistic regarding Amazon stocks based on the company’s sound fundamentals, bullish news sentiment, positive social media comments and fair value estimates with upside.\n\nIn the following sections, I will share my due diligence in bullet points format. I’ve always felt it’s the easiest way to digest a large amount of information.\n\nIf you only have 1 minute to read, read the company description and the main bull/bear arguments.  \nIf you have 10 minutes to spare, read the entire document.\n\nI’m also devoted to mental models and aim to avoid cognitive biases when investing. Hence, I’ll wrap up the note by applying the “anchoring bias” concept to my Amazon stock analysis.\n\nIf you feel my analysis is missing something important, any feedback, comments or questions are welcome!\n\n**Company Description**\n\n* Amazon is America's **biggest online retailer.**\n* The firm was created in 1994 and today averages over **200 million unique visitors per month.**\n* Founder Jeff Bezos owns 11.1% of Amazon. Institutional investors hold majority ownership (58.55%) of the outstanding shares that they control.\n* **The company is mainly focused on e-retail, computing services and digital content.**\n* Amazon is the **3rd largest company in the world** in terms of revenue.\n* The company is **responsible for \\~50% of US e-commerce spending.**\n* Amazon averages more than USD17 million in sales per hour.\n* The firm operates an online marketplace in 14 of the 20 leading economies in the world.\n* The company has a **catalogue of \\~12 million products.**\n* The firm's international net sales stand at over USD386 billion.\n* Section sources &amp; further reading: [1](https://ir.aboutamazon.com/overview/default.aspx), [2](https://www.repricerexpress.com/amazon-statistics/), [3](https://www.investopedia.com/articles/active-trading/111115/why-all-worlds-top-10-companies-are-american.asp), [4](https://money.cnn.com/quote/shareholders/shareholders.html?symb=AMZN&amp;subView=institutional) &amp; [5](https://www.ecommercegermany.com/blog/how-to-rock-your-amazon-sales-statistics-and-tips-for-2020).\n\n**Main Bull Arguments**\n\n* Amazon is the **USA's biggest online retailer and accounts for around \\~50% of the nation's total e-commerce sales.**\n* Amazon’s **better than expected revenue and cash flow in recent years** have further strengthened its financial profile.\n* The company has a l**arger share of the e-commerce sector than its competitors and benefits from various revenue streams.**\n\n**Main Bear Arguments**\n\n* **Difficulty penetrating new retail categories (i.e., luxury goods)**. Amazon’s operational setup must adjust to personalized preferences and higher-end e-commerce experiences.\n* Third-party businesses sold +60% during Prime Day vs. 2019. **Third-party sales lead Amazon to lose control on inventory, pricing, and Prime benefits.**\n* **Customers are increasingly going directly to retailers.** Platforms such as Shopify and Square, payment options as PayPal and GooglePay are offering the convenience of the Amazon experience.\n\n**Analysts Positive Highlights**\n\n* Amazon's impressive track record with regards to **strategic vision and execution.**\n* The company's **improved financial profile**, especially its better than expected revenue and cash flow over the last several years.\n* Its **leading position across multiple online retail segments.**\n* Amazon's **high likelihood to become further embedded in consumer shopping patterns.**\n* Section sources &amp; further reading: [1](https://www.fitchratings.com/entity/amazoncom-inc-96631782), [2](https://www.fitchratings.com/research/corporate-finance/fitch-rates-amazoncom-inc-proposed-notes-a-affirms-long-term-idr-at-a-outlook-positive-01-06-2020), [3](https://finance.yahoo.com/news/whole-foods-market-inc-moodys-230306224.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAHt8MGH8sCMv6QIdDZHbCjndAcVx1EkQj0taYwbB47uZD6ZSjTyknP97Vgxh1IzVP27TQtZgELSpW4BByN-Z1QPLMqJ1IPQ1tjdnIBWIYckx5ZXCg_cZcSxcV_E-WWne1YLB4vkA8GHnSmfFgtT3F0omG2qHs6a9gRXWRPlPrcuI), [4](https://www.dailyfx.com/forex/market_alert/2021/02/02/Dow-Jones-SP-500-Recover-Amazon-and-Google-Earnings-Impress.html), [5](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/moody-s-upgrades-amazon-on-cloud-business-strength-57036229) &amp; [6](https://www.investopedia.com/top-10-s-and-p-500-stocks-by-index-weight-4843111).\n\n**Analysts Negative Highlights**\n\n* The firm's **long-term operating path uncertainty, considering its potential to expand to new verticals.**\n* **Amazon's regulatory compliance** with regards to scale and business practices.\n* The company's **significant investments in potentially margin dilutive areas** or unproven business opportunities.\n* Its **use of third-party merchant sales data**, which is currently being investigated by the EU.\n* Section sources &amp; further reading: [1](https://www.fitchratings.com/entity/amazoncom-inc-96631782), [2](https://www.fitchratings.com/research/corporate-finance/fitch-rates-amazoncom-inc-proposed-notes-a-affirms-long-term-idr-at-a-outlook-positive-01-06-2020), [3](https://finance.yahoo.com/news/whole-foods-market-inc-moodys-230306224.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAHt8MGH8sCMv6QIdDZHbCjndAcVx1EkQj0taYwbB47uZD6ZSjTyknP97Vgxh1IzVP27TQtZgELSpW4BByN-Z1QPLMqJ1IPQ1tjdnIBWIYckx5ZXCg_cZcSxcV_E-WWne1YLB4vkA8GHnSmfFgtT3F0omG2qHs6a9gRXWRPlPrcuI), [4](https://www.dailyfx.com/forex/market_alert/2021/02/02/Dow-Jones-SP-500-Recover-Amazon-and-Google-Earnings-Impress.html), [5](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/moody-s-upgrades-amazon-on-cloud-business-strength-57036229) &amp; [6](https://www.investopedia.com/top-10-s-and-p-500-stocks-by-index-weight-4843111).\n\n**Peer Comments**\n\n* Some of Amazon's peers are eBay (USA), Alibaba (China), Rakuten (Japan), and Newegg (USA).\n* All of those are online-only retailers.\n* **Versus its online-retail peers, Amazon compares positively in terms of revenue and disruptive innovation.**\n* **Unlike its peers, the company benefits from a number of profitable revenue streams.**\n* **As a result, Amazon currently has a far greater share of the market than any of its competitors.**\n* Section sources &amp; further reading: [1](https://www.bigcommerce.com/blog/amazon-competitors/), [2,](https://www.investopedia.com/ask/answers/120314/who-are-amazons-amzn-main-competitors.asp#:~:text=Amazon's%20retail%20store%20rivals%20include,Oracle%2C%20Microsoft%2C%20and%20IBM) [3](https://www.investopedia.com/ask/answers/120314/who-are-amazons-amzn-main-competitors.asp), [4 ](https://www.fitchratings.com/research/corporate-finance/fitch-rates-amazoncom-inc-proposed-notes-a-affirms-long-term-idr-at-a-outlook-positive-01-06-2020)&amp; [5](https://www.csimarket.com/stocks/compet_glance.php?code=AMZN).\n\n**Latest Management Presentation**\n\n* According to Amazon's investor presentations, management focuses on addressing the following issues:\n* **Founder/CEO Jeff Bezos will transition to Executive Chair**, Andy Jassy to become CEO (he's led AWS since inception in 2003).\n* **Fair pricing.** In 2020, the company suspended over 6'000 selling accounts for suspected price gouging.\n* **Low-carbon economy.** Amazon aims to reach 80% renewable energy by 2024 and 100% by 2030.\n* **Reduction in packaging waste**. Since 2008, the Frustration-Free Packaging program has saved over 810'000 tones of packaging material.\n* **Amazon Web Services efficiency.** The company's servers and facilities are now far more efficient than any in-house data centre.\n* **Job creation.** Amazon created 100'000 new positions across the fulfilment and delivery network in March 2020.\n* Section sources &amp; further reading: [1](https://www.s2.q4cdn.com/299287126/files/doc_financials/2020/ar/2019-Annual-Report.pdf), [2,](https://www.s2.q4cdn.com/299287126/files/doc_financials/2020/ar/updated/2020-Proxy-Statement.pdf) [3](https://www.s2.q4cdn.com/299287126/files/doc_financials/2020/q4/Webslides_Q420_Final.pdf), [4 ](https://www.s2.q4cdn.com/299287126/files/doc_financials/2020/q3/Webslides_Q320_Final.pdf)&amp; [5](https://www.ir.aboutamazon.com/news-release/news-release-details/2021/Amazon.com-Announces-Fourth-Quarter-Results/default.aspx).\n\n**Recent Financial Results**\n\n* **For 2020, Amazon announced an increase of net sales by 38% vs. 2019** to $386.1 billion.\n* 2020 Fiscal Year: Net sales of $386.06 billion. 61.2% were North America and International accounted for 27%.\n* **2020 net income was $21.33 billion (+84.1% from 2019)**. AWS revenue hit $45.37 billion, subscriptions $25.21 billion, other $21.48 billion.\n* 2020 spending (billions) on fulfilment was $58.52; on marketing $22.01, technology and content $42.74, general and administrative $6.67 billion.\n* **2020 operating cash flow increased 72%** to $66.1 billion (trailing twelve months); free cash flow increased to $31 billion.\n* Section sources &amp; further reading: [1](https://www.press.aboutamazon.com/news-releases/news-release-details/amazoncom-announces-third-quarter-results), [2,](https://www.ir.aboutamazon.com/news-release/news-release-details/2021/Amazon.com-Announces-Fourth-Quarter-Results/default.aspx) [3](https://www.finance.yahoo.com/news/amazon-reports-4q-2020-earnings-results-152012181.html), [4 ](https://www.nasdaq.com/articles/amazon-amzn-q4-earnings-surpass-estimates-sales-rise-y-y-2021-02-03)&amp; [5](https://www.money.cnn.com/quote/forecast/forecast.html?symb=amzn).\n\n**Main Risks**\n\n* **Intense competition.** A number of Amazon's competitors have greater resources and/or brand recognition.\n* **Strain of expansion.** Failure to effectively manage company growth may negatively impact the company's financial position.\n* **Limited experience in new market segments.** The firm may fail to recoup investments in newer activities.\n* **Growth rate fluctuation.** The business is directly impacted by worldwide economic and business conditions.\n* **Inventory risk.** Changes in consumer demand, new product launches, and seasonality have the potential to adversely affect operating results.\n* **Government regulation.** Unfavourable changes to laws and regulations may expose Amazon to civil and criminal penalties.\n* Section sources &amp; further reading: [1](https://www.sec.gov/Archives/edgar/data/1018724/000101872420000004/amzn-20191231x10k.htm), [2,](https://www.digitalcommerce360.com/2020/09/01/despite-its-enormous-strengths-amazon-does-have-some-weaknesses/) [3](https://www.bloomberg.com/news/articles/2020-04-30/amazon-predicts-shrinking-profit-on-pandemic-expenses), [4 ](https://www.politico.eu/article/data-at-risk-amazon-security-threat/)&amp; [5](https://www.investopedia.com/articles/markets/100215/biggest-risks-investing-amazon-stock.asp).\n\n**Company History Milestones**\n\n* **1994. Jeff Bezos sets up an online bookstor**e from the garage of his Seattle home and invests USD10'000.\n* **1997. Amazon goes public at USD18 per share** and warns investors of significant losses due to ongoing investments.\n* **1998. The firm expands into music** and acquires companies in the United Kingdom and Germany.\n* **1999. The company launches its third-party seller marketplace and becomes the biggest online sales platform in the world.**\n* **2001. Amazon.com reports its first net profit in 4Q01**.\n* **2018. Amazon becomes the 3rd largest smart devices seller in the USA.**\n* Section sources &amp; further reading: [1](https://www.businessinsider.com/jeff-bezos-amazon-history-facts-2017-4), [2,](https://www.edition.cnn.com/interactive/2018/10/business/amazon-history-timeline/index.html) [3](https://www.bbc.com/news/business-48884596;%20https://www.aboutamazon.com/facts), [4 ](https://www.companieshistory.com/amazon-com/)&amp; [5](https://markets.businessinsider.com/news/stocks/amazon-stock-price-4000-price-target-investment-drivers-2021-bofa-2021-1-1029991974).\n\n**Revenue Streams**\n\n* **Amazon contains many businesses, but it presents profits at the company level.**\n* Amazon publishes revenue for AWS (Amazon Web Services), USA, and International Operations.\n* **For 2020 Amazon reported net sales of USD 386bn and net income of USD 21bn.**\n* **Revenue breakdown (2019): online stores (50.5%), third party seller services (19.2%), AWS (12.5%),** physical stores (6.1%), subscriptions (6.9%), other-ads (5%).\n* **Revenue by region (2019): 69% US**, 8% Germany, 6% Japan, 6% UK and 11% Rest of the world.\n* **Amazon's revenue growth rates since 2018 are 31%, 20.5% and 37.6% for 2020 vs 2019.**\n* Section sources &amp; further reading: [1](https://www.digitalcommerce360.com/article/amazon-sales/), [2,](https://www.visualcapitalist.com/how-amazon-makes-its-money/) [3](https://www.ben-evans.com/benedictevans/2021/3/14/do-amazon-ads-bring-in-more-cash-than-aws), [4](https://s2.q4cdn.com/299287126/files/doc_financials/2020/ar/updated/2020-Proxy-Statement.pdf), [5](https://d18rn0p25nwr6d.cloudfront.net/CIK-0001018724/336d8745-ea82-40a5-9acc-1a89df23d0f3.pdf) &amp; [6](https://www.macrotrends.net/stocks/charts/AMZN/amazon/revenue).\n\n**Business Model**\n\n* **Amazon is a handful of businesses running internally**. It isn’t one; it’s hundreds of Amazon creating more Amazon.\n* Profits generated by some of its most profitable businesses are reinvested into new businesses.\n* **Jeff Bezos is known for focusing on cash flow instead of earnings**. Amazon long term goal: \"optimize free cash flow\".\n* **Like many other retailers, Amazon noticed that time spent on its website allows for selling content and advertisement.**\n* By the end of 2020, Amazon acknowledged it has a \"rapidly evolving business model\" and a \"highly volatile stock.\"\n* 2020 Amazon's top 100 product searches: 51 electronics, 22 home, 9 media, 3 clothing, 2 food and 13 other.\n* Section sources &amp; further reading: [1](https://www.ben-evans.com/benedictevans/2021/3/14/do-amazon-ads-bring-in-more-cash-than-aws), [2,](https://www.zenithmedia.com/make-no-mistake-the-time-for-retail-media-is-now/) [3](https://d18rn0p25nwr6d.cloudfront.net/CIK-0001018724/336d8745-ea82-40a5-9acc-1a89df23d0f3.pdf), [4](https://d18rn0p25nwr6d.cloudfront.net/CIK-0001018724/336d8745-ea82-40a5-9acc-1a89df23d0f3.pdf), [5](https://s2.q4cdn.com/299287126/files/doc_financials/2020/ar/updated/2020-Proxy-Statement.pdf) &amp; [6](https://s2.q4cdn.com/299287126/files/doc_financials/2020/q4/Webslides_Q420_Final.pdf).\n\n**Recent Scandals**\n\n* **The \"tax avoidance\" scandal erupted in 2012 and is still under investigation.**\n* **The company was accused of failing to pay corporation tax in the United Kingdom.**\n* Amazon was found to have reported all European sales via a Luxembourg-based unit to avoid paying UK tax.\n* In 2016, the company's UK corporation tax bill halved year-on-year despite a rise in profits.\n* Amazon claims to pay all the necessary taxes in the countries in which it operates.\n* Section sources &amp; further reading: [1](https://www.theguardian.com/business/2012/dec/03/amazon-google-starbucks-tax-avoidance), [2,](https://www.taxjustice.net/2018/08/10/why-is-amazon-still-paying-little-tax-in-the-uk/) [3](https://www.pcr-online.biz/2018/03/19/a-non-exhaustive-list-of-amazon-scandals/), [4](https://www.theguardian.com/technology/2019/sep/03/amazon-accused-of-handing-over-diddly-squat-in-corporation-tax-despite-tripling-payment) &amp; [5.](https://www.managementstudyguide.com/amazons-tax-evasion-game.htm)\n\n**Corporate Social Responsibility (CSR) Considerations**\n\n* Amazon is committed to creating a sustainable business through innovation.\n* The company aims to minimize the impact of its operations through the use of 100'000 electric delivery vehicles.\n* The firm is conscious of the need to reduce water consumption at its data centres.\n* Amazon is one of few companies in the world that has pledged to go carbon neutral by 2040.\n* In 2020, the firm launched the Climate Pledge Fund to support sustainable technological development.\n* Section sources &amp; further reading: [1](https://www.managementweekly.org/amazon-corporate-social-responsibility/), [2,](https://www.aboutamazon.com/planet) [3](https://www.sustainability.aboutamazon.com/pdfBuilderDownload?name=sustainability-all-in-december-2020), [4](https://www.sustainability.aboutamazon.com/governance/unsdgs) &amp; [5.](https://www.aws.amazon.com/blogs/publicsector/mission-meeting-environmental-sustainability-goals/)\n\n**Interesting / Fun Fact**\n\n* **As of Q420, 53% of Amazon's sales were third-party.**\n* **With the company taking \\~13% of each sale**, its financial security remains secure.\n* **In 2020, the firm generated USD80.46 billion in third-party sales revenue alone.**\n* Third-party sales now constitute the company's second-largest revenue segment.\n* **86% of all Amazon's third-party sellers are profitable.**\n* Section sources &amp; further reading: [1](https://www.businessinsider.com/10-mind-blowing-facts-about-amazoncom-2013-3), [2,](https://www.facts.net/science/technology/amazon-facts/) [3](https://techjury.net/blog/amazon-statistics/#gref), [4](https://www.bigcommerce.com/blog/amazon-statistics/#a-shopping-experience-beyond-compare), [5](https://www.statista.com/statistics/259782/third-party-seller-share-of-amazon-platform/) &amp;[ 6.](https://www.junglescout.com/amazon-seller-report/)\n\n**Frequently Asked Questions About Amazon**\n\n* How important is the cloud computing business to Amazon?\n* Where (region, country) does Amazon make most of its income?\n* Which sectors is the company planning to expand into?\n* What are Amazon's main challenges?\n* Amazon isn't \"only\" an e-retailing business. What are other Amazon's main businesses?\n\n**Indicators To Watch Out That Could Impact Amazon’s Stock Price**\n\n* US Consumer Inflation. Higher inflation, less purchasing power from the large US customer base.\n* Producer Price by Industry: Computer and Electronic Manufacturing.\n* Producer Price Index by Commodity: Advertising Space and Time Sales: Internet Advertising Sales, Excluding Internet Advertising Sold by Print Publishers.\n* News on Antitrust and Monopoly.\n* ISM Non-Manufacturing Index, Amazon's: diluted earnings per share, price to book value and revenues.\n\n**News Sentiment**\n\n* As part of my analysis, I like to check recent news sentiment.\n* Tip Ranks shows this information via their free account.\n* According to them, **Amazon’s news sentiment for the last 7 days is 84% bullish and 16 bearish.**\n\n**Social Media Sentiment**\n\n* As part of my analysis, I also like to check recent social media sentiment.\n* Stocktwits shows this information under their free account.\n* According to them, **their community is currently 82% bullish on Amazon.**\n\n**Fair Price / Valuations**\n\n* As part of my analysis, I also like to check valuation metrics from sell-side analysts.\n* Morningstar shows this under their premium account.\n* According to them, **Amazon stock is currently 19% undervalued and they see the fair value at USD4’000 (today’s price is at USD3’374).**\n* This said, **if I look at sell-side 12-month forecasts from Yahoo Finance, the price could move between USD3’048 and USD5’200 (with an average of USD4’009).**\n\n**Bonus Topic: Avoid anchoring bias when investing in Amazon Stock**\n\n**Anchoring Bias Explained**\n\nWe, humans, tend to rely too heavily on the first piece of information we see. When we are trying to make estimates or predictions, unconsciously, we use an initial value as a reference point; this is anchoring bias. It can give you an unrealistic perception of an investment that leads to poor financial outcomes; it is one of the most common cognitive biases.\n\nEvery day, loads of information bombard our lives; as a way of simplifying its processing, our brains tend to take mental shortcuts. These shortcuts help our brains save energy, be more efficient and reach decisions quickly. However, they can also be problematic, especially when deciding where to invest our money.\n\nSuppose we are looking for a gift and find something we like at a specific price; we'll likely compare all other potential gifts to the price of that initially seen. All other products will seem cheap or expensive compared and anchored to the initial present we found. Once the anchor's value exists, it defines all future estimates.\n\n**How anchoring bias affects your Amazon investment?**\n\nImagine yourself deciding whether to invest in a company. Once you see today's price, you become anchored. You subconsciously compare all new information to the starting point you created. Your anchor will be defined by that initial price rather than by the stock's intrinsic value. To determine the stock's fair value, ask yourself: \"if I didn't know the price, how much would I pay for an investment with those specific features, risks, and potential rewards?\"\n\nIf we are considering investing in Amazon, we would anchor ourselves to today's price (\\~USD3,374). On the contrary, if we owned Amazon stocks, we would likely anchor ourselves to our purchase price. With the forecasts presented above, we may anchor Amazon stock at today's price (USD3,374). We may also assign a relatively low likelihood of Amazon trading below analysts’ low forecast estimate of USD3’048 (-10% from today) or above analysts’ high forecast estimate of USD5’200 (+54% from today).\n\n**How to overcome the anchoring bias when investing in Amazon?**\n\nIn order to overcome the anchoring bias, I follow these four steps:\n\n1. I practice identifying anchoring biases, rationalizing my decisions, and most importantly, reflecting on the fair value of my investments.\n2. I thoroughly research potential investments and make sure sell-side analyst estimates are a good reference for me. I place my anchor where I see the value, not where others tell me to.\n3. I think about the volatility (swing in prices) of my investment and compare it to similar investments. For example, when thinking about Amazon, I ask myself: What percentage of my portfolio would I be willing to put in a stock that trades at USD3’374 and could go down to USD3’048 or up to USD5’200?\n4. I make a rational assessment of the company as the basis for where to buy or sell Amazon. The company challenges and the long/short term nature of my investments are decisive for me.\n\n**MISCELLANEOUS**: If you liked the due diligence above, I am planning on posting similar pieces in the following [link](https://www.investories.co/).\n\n**DISCLAIMER:** The content on this note is being provided for information purposes only. This note does not provide tax, legal, insurance or investment advice, and nothing on this note should be construed as an offer to sell, a solicitation of an offer to buy, or a recommendation for any security by the author or any third party. You alone are solely responsible for determining whether any investment, security or strategy. or any other product or service, is appropriate or suitable for you based on your investment objectives and personal and financial situation and for evaluating the merits and risks associated with the use of the information on this note before making any decisions based on such information or other content. You should consult an attorney or tax professional regarding your specific legal or tax situation.\n\nPast performance is no guarantee of future results. Therefore, you should not assume that the future performance of any specific investment or investment strategy will be profitable or equal to corresponding past performance levels. Inherent in any investment is the potential for loss. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. The author of this note is not a fiduciary by virtue of any person’s use of or access to this note. The author of this note is not a licensed securities dealer, broker or investment bank.",
        "subreddit": "stocks",
        "title": "Amazon: from garage bookstore to global marketplace",
        "url": "https://www.reddit.com/r/stocks/comments/mupxxy/amazon_from_garage_bookstore_to_global_marketplace/",
        "created": 1618952992.0
    },
    {
        "author": "theJamesGosling",
        "created_utc": 1618518396,
        "id": "mrnbs0",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Chainlink Is Building an Off-Chain Oracle Network",
        "url": "https://www.coindesk.com/chainlink-2-0-building-off-chain-oracle-network",
        "created": 1618547196.0
    },
    {
        "author": "Sgt-Bullish",
        "created_utc": 1618453913,
        "id": "mr5rre",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Oracle seems to have niches in mid size company ERP systems (netsuite), and has one of the two main database product lines (SQL Server is the other). Along side this, it has the major competitor to SAP for larger size company ERP systems with Oracle Cloud.\nIt still doesn’t have quite the economic moat that other companies do, and it’s continued acquisitions means it has a lot of smaller product lines that are not major players in their respective markets.\n\nThe price seems reasonable (although has been increasing this quarter quite well, so not as much of a discount as it was). P/E is 18, and 30% of the EPS TTM has been paid out in dividends so has plenty of coverage.\n\nThe earnings have shown steady growth. The recent loss of Google as a client isn’t great, but they have also been late to the SaaS model that provide more revenue dispersed over a period of time. I think the trend in earnings is starting to show the accumulation of SaaS product clients and could be poised to continue moving upward.",
        "subreddit": "ValueInvesting",
        "title": "Oracle",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/mr5rre/oracle/",
        "created": 1618482713.0
    },
    {
        "author": "Spaceballs-the-Login",
        "created_utc": 1617940425,
        "id": "mn8zj5",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "This is how I pick stocks now, by consulting the oracle",
        "url": "https://www.reddit.com/r/aww/comments/mn8uv3/gorillas_give_the_best_dating_advice/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf",
        "created": 1617969225.0
    },
    {
        "author": "uncle_dougie",
        "created_utc": 1617655250,
        "id": "mkucj9",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Google will stop using Oracle's finance software and adopt SAP instead\n\n\nhttps://www.google.com/amp/s/www.cnbc.com/amp/2021/04/05/google-will-stop-using-oracle-finance-software-switch-to-sap.html",
        "subreddit": "wallstreetbets",
        "title": "GOOGLE dropping Oracle. Take your puts/short position in oracle!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mkucj9/google_dropping_oracle_take_your_putsshort/",
        "created": 1617684050.0
    },
    {
        "author": "elirberman",
        "created_utc": 1618669866,
        "id": "msrsbz",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "ORACLE TO THE MOON🚀🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/msrsbz/oracle_to_the_moon/",
        "created": 1618698666.0
    },
    {
        "author": "3DPrintedMoney",
        "created_utc": 1618768126,
        "id": "mthmy1",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Warren       Buffet’s Birdshiter  Hackaway has disclosed a sizable stake in       DeadEndGames at year-end  2020, after previously being allowed to keep       the stockholding  undisclosed.\n\nBirdshiter        (ticker: BRK.B) held 14.7 million shares of DeadEndGames (GME)   worth      $276.9 million at the end of 2020, according to a regulatory   filing  on     Tuesday. The DeadEndGames stake is up sharply from the   end of the    third   quarter, when Birdshiter owned 8.4 million   DeadEndGames shares    worth   $85.6 million. This was disclosed in a   13-F filing for the end    of the   fourth quarter and an amended 13-F   for the end of the third    quarter.\n\nThe     DeadEndGames    purchase was likely orchestrated by Buffet, the CEO,   who   oversees the    company’s huge equity portfolio. Birdshiter   requested and   received    confidentiality from the U.S. Securities and   Exchange   Commission for    the DeadEndGames stakes at the end of the   third quarter,   presumably    because it was continuing to build   positions in the stock in   the    fourth quarter and didn’t want public   disclosure in mid-November  to     disrupt its accumulation of the   stock.\n\nIn a statement by the Oracle of Omyham :\n\n\"DFV        beat me to it because I don't know how to turn on a computer nor    use    an  App-Po phone. DeadEndGames is a value stock and I am big  fan   of     brick-and-mortar retailers. I spend 12 hours a day reading  the    newspaper    and finally got to the letter “G” in the business  section    of  newspaper   on July, 2020. It hits me like a mini stroke  caused by    my  daily   consumption of coke, ah... cola. Sorry about  that, I need  to    take my   medication.\n\n(Intermission)\n\nSo anyways... Where am I? Who am I? Who are you?\n\nHmm...        ah yes. I spend 8 hours a week playing bridge with Bill (Gates),      where   else can you buy a deck of cards from? DeadEndGames. People      around the   world needs to pass the time at home during the  pandemic     with  something  to do. What better way then with cards and  board  games?    With  new  management coming on board shortly, led by  Ryan  Cohen this    is a  deeply  undervalued company and will corner  the  market and  build   an  economic  moat! Birdshiter Hackaway also   acquired an  undisclosed   amount  of  preferred shares in the company   and is on the  board of   directors.\n\n'Easy peasy lemon squeezy shortly shorties!”\n\n\\-Sage of Omyham\n\nI can't wait for my Sudoku puzzle books to arrive!",
        "subreddit": "Wallstreetbetsnew",
        "title": "Shitpost to pass the time before Monday 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/mthmy1/shitpost_to_pass_the_time_before_monday/",
        "created": 1618796926.0
    },
    {
        "author": "Rajonmia3031",
        "created_utc": 1617389989,
        "id": "mir0n9",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Due to the nature of blockchain systems, they are not able to access real world data. Bridge oracle system is a technology through which external data can be injected. There are various type of oracle systems. Each type of oracle has its own api contract. The only thing one should do is importing the appropriate api. There is the possibility to join to Bridge oracle system as an Enterprise oracle service. Service providers can make money by joining to Bridge system and selling dedicated data. Clients can pay for their requests using both TRX and BRG. Of course BRG payment includes discount.",
        "subreddit": "investing",
        "title": "First Ever Public Oracle System on TRON Network",
        "url": "https://www.reddit.com/r/investing/comments/mir0n9/first_ever_public_oracle_system_on_tron_network/",
        "created": 1617418789.0
    },
    {
        "author": "DaVibes",
        "created_utc": 1617741143,
        "id": "mll0ux",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "https://focusinvesting.biz/google-plans-to-migrate-its-internal-financial-software-from-oracle-to-sap/",
        "subreddit": "investing_discussion",
        "title": "Google Plans To Migrate Its Internal Financial Software From Oracle To SAP",
        "url": "https://www.reddit.com/r/investing_discussion/comments/mll0ux/google_plans_to_migrate_its_internal_financial/",
        "created": 1617769943.0
    },
    {
        "author": "_gm90_",
        "created_utc": 1617522821,
        "id": "mjrul6",
        "num_comments": 330,
        "num_crossposts": 0,
        "selftext": "What stocks are you buying and holding for the next 5-20 years? \n\nIt’s pretty obvious that technology will be as big as ever - Im in Apple and Microsoft \n\nElectric cars will be huge - I’m in Tesla \n\nDisney - Disney plus set to overtake Netflix, Disney theme parks will expand and grow ( I’m in Disney) \n\nCash is slowing being removed from society - I’m in PayPal, square, visa, jp Morgan \n\nYolo play - I’m in pltr (got in at 21 dollars) I believe there’s a high chance of it being massive in the future\n\nGaming - I’m in draftkings, competitive gaming is a growing industry \n\n\nI am considering adding crsp with its discounting price \n\nWhat other industries or stocks should I consider?",
        "subreddit": "stocks",
        "title": "Long term stocks",
        "url": "https://www.reddit.com/r/stocks/comments/mjrul6/long_term_stocks/",
        "created": 1617551621.0
    },
    {
        "author": "willyumn",
        "created_utc": 1617320661,
        "id": "mi84qf",
        "num_comments": 267,
        "num_crossposts": 0,
        "selftext": "For context, I'm 22, make $25/hr but have pretty much no bills since I live with my parents, so my risk tolerance is pretty high. I have about 55 shares of Tesla after \"un-diversifying\" and selling all my other stock. I'm pretty much all in. I cannot find any other company that i can put my money in where growth is seemingly inevitable. I do own bitcoin but what are some equities that I can purchase over the next few months, or all at once with 10k cash? \n\nI have a tiny % of my portfolio in Oracle, Trimble, Crispr, Upstart, Square, Paypal, to give you an idea of what types of stocks I'm attracted to. (data, fintech, autonomy). I'm averse to companies with binary outcomes like bio, pharma, etc. Any interesting leads? :)",
        "subreddit": "stocks",
        "title": "Where should I put $10k?",
        "url": "https://www.reddit.com/r/stocks/comments/mi84qf/where_should_i_put_10k/",
        "created": 1617349461.0
    },
    {
        "author": "ticklemypicklesir",
        "created_utc": 1617567562,
        "id": "mk3zox",
        "num_comments": 239,
        "num_crossposts": 0,
        "selftext": "Using the lower end of  Paysafe’s forecasted EBITDA ($500M), $1.5B revenue, an EV adjusted for  $1.8B debt, and applying the post-merger pro forma 720M outstanding  shares, here are Paysafe’s potential share prices based solely on sector  peer **EV/EBITDA ratios:**\n\n⁃ PayPal : $269B EV/ $4.47B EBITDA\n\n    \t= 60.2x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $28.2B EV / SP: $39.28   \n\n⁃ Repay : $2.2B EV/ $30M EBITDA\n\n    \t = 73.3x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $34.8B EV / SP: $48.43   \n\n⁃ Shift 4 : $7.7B EV/ $90M EBITDA\n\n    \t= 85x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $41B EV / SP: $56.91   \n\n⁃ Nuvei : $15B EV/ $171M EBITDA\n\n    \t= 87.7x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $42B EV / SP: $58.40   \n\n⁃ Adyen : $56B EV/ $273M EBITDA\n\n    \t= 205x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $101B EV / SP: $139   \n\n⁃ Square : $107B EV/ $357M EBITDA\n\n    \t= 299.7x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $148B EV / SP: $205.64   \n\n⁃ [Bill.com](https://bill.com/) : $13.2B EV/ -$15.6M EBITDA\n\n    \t= 308x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $152B EV / SP: $211.39   \n\n⁃ Affirm: $21.6B EV/ -$68M EBITDA\n\n    \t= 317x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $156.7B EV /SP: $217.64   \n\nEV/Revenue ratio , non-public company’s with estimated revenue per recent funding rounds:\n\n⁃ Stripe : $95B EV/ $1.8B est. rev\n\n    \t= 52.8x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $77.3B EV / SP: $107.44   \n\n⁃ Chime : $30B EV/ $600M est. rev\n\n    \t= 50x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $73.2B EV /SP: $101.67   \n\n⁃ Checkout : $15B EV/ $100M est. rev\n\n    \t= 150x &amp;amp;gt;&amp;amp;gt;&amp;amp;gt; Paysafe $223.2B EV / SP: $310   \n\nNote: Most of these companies have negative earnings and smaller margins than Paysafe.\n\nI’m  not suggesting it’s worth this much, but for reference, averaging the  above multiples would put BFT/Paysafe’s share price at $135.98\n\nMore realistically, taking the average from the lowest four puts the share price at $50.75.\n\nPaysafe is the number 1 digital wallet in Igaming and is used by the top sports gambling company Draftkings. As all SPACs do now, it sold off big today with the ticker change so there has never been a better time to buy than now! \n\nNote : I’m long PSFE with 3,350 shares @15.47\n\nCredit all the numbers to u/greensymbiote",
        "subreddit": "wallstreetbets",
        "title": "$PSFE (Paysafe) the most undervalued fintech play on the market. Popular analyst Steve Grasso has been calling for it to triple.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mk3zox/psfe_paysafe_the_most_undervalued_fintech_play_on/",
        "created": 1617596362.0
    },
    {
        "author": "prettyboyv",
        "created_utc": 1617322503,
        "id": "mi8p2x",
        "num_comments": 199,
        "num_crossposts": 0,
        "selftext": "First of all, I would like to say that in this analysys I did not want to dwell too much into the technical aspects of the PLTR's software product or the financial performance of the company.  I am well aware that those are one of the most important fundamental elements when valuing a business and I did spend a lot of time on them while doing my research, before ultimately deciding to invest in the company. However I believe that most of the redditors on this forum , especially those that are already investors, already have at least basic understanding of PLTR's financial situation and the specifications of its software. In this thesis I will try to give my perspective about why I think PLTR is a low bottom company with significant potential for growth, based on more \"abstract\" and less known factors.\n\n&amp;#x200B;\n\n \n\nFirst of all, let's take a look at the commercial side of its business. Currently BP and Airbus contracts are responsible for 20 percent of the PLTR's revenue and some analyst think that such high-concentration is bad. However, they said the same think about PLTR's government work when the stock debuted. In short, they said that it is very worrying that PLTR generates such a high-percentage of its revenue from the U.S government and tried to convince investors to value PLTR not as a soft company, but as a defence contractor. I am glad that I did not listen to them at that time and bought the stock at 10 dollars, cuz my thinking was that if the U.S government values the PLTR's software so highly it is extremely likely that commercial businesess will do the same. Do you get where I am going? If Airbus and BP are paying the company more than 100 million dollars combined per year, then that means that PLTR's software is extremely efficient and if used right, could potentially safe customers hundreds of millions dollars of expenses or lost revenue. If you want more confirmation about how important the software could be for the business, have in mind that when partnering with the U.S Agency for Disease Control and Prevention, there are rumours that as early as January 2020 Palantir was able to build confidential models that showed the potential for a rapidly rising outbreak. Palantir then rushed in mid-February to recall staff from abroad and order them into a four-week quarantine. Now imagine if you knew about this as early as PLTR. March puts for the win.\n\nEven forgetting about the software and PLTR's growing revenue, let's take a look at some other factors that can't be measured by financial modelling. Currently PLTR is the only SaasS company in the world that is in talks to receive Impact Level 6 certification from the DoD. That means that PLTR will have access to classified information. Yeah, that is the kind of information that if you share with unauthorised personnel you go to prison for commiting treason against the state. Furthermore, the marine that participated in the operation of killing Bin Laden said in his book that PLTR soft. was instrumental in the sucess of the mission. To top it off , PLTR's lobbyist include figures like retired Marine Corps Brig. Gen. Terry Pau and ex- US State Secretary Condoleezza Rais and the new Director of National Intelligence in the Biden admin- Avril Haines is a former employee. Well, I think that we can say with great certainty that PLTR has become extremely important for the U.S government operations. If history has taught us anything, it is that if  the U.S government values something , it will not shy away from spending millions of taxpayers dollars to keep it afloat. But it as not only the U.S government. PLTR has won numerous contracts with government agencies of other countries like the British NHS and PLTR's head of operation in Israel- Hamutal Meridor, served as senior director of Verint, with deep ties to Unit 8200. Unit 8200  is an Israeli Intelligence Corps *unit* of the Israel Defense Forces responsible for collecting signal intelligence (SIGINT) and code decryption.\n\nIf you are still not sure about PLTR's importance maybe you would like to know more about who is behind the company. Peter Thiel is a cofounder and the current largest shareholder. Yeah, that is right-Peter fucking Thiel. This guy was a business associate with Elon Musk in Paypal, he was the first investor in Facebook and a mentor of Zuckerberg and is a close friend of Chamath. He also bankrupted Gawker, cuz they had the audacity to leak the news that he is homosexual. Many people believe that he is one of the most well-connected men in the world and it comes at no surprise that he is a member of The Bilderberg group ( conspiracy theorists believe that these guys control the world) . I forgot to mention that his nickname is King Midas, cuz everything that he touches turns to gold.\n\nPalantir's other cofounder and current Ceo- Alex Karp is also a pretty interesting guy to say the least. He is a juris doctor from Stanford University, and a doctorate in neoclassical social theory from Goethe-Universität, Frankfurt, Germany. He is also a regular participant in the Davos economic forum. Oh, he also actively practices Tai Chi and Quidong. Yes, this guy actually studied the blade, how could you not trust him?\n\nTo sum it up, I will use Alex Karp's own words: “We are going to deliver the world’s best software with the world’s most efficient way of delivering it. Investors will decide what that’s worth to them. And I think you’ll find in a number of years that there will be a consensus: Palantir is a truly special software company that is arguably the most important software company in the world.” -Karp the day they went public\n\nPS: English is not my mother tongue and I wrote this piece in a rush, so please excuse me if there are any grammatical or spelling errors.",
        "subreddit": "stocks",
        "title": "PLTR is a low bottom company and has become too important to fail. Here is my bullish thesis.",
        "url": "https://www.reddit.com/r/stocks/comments/mi8p2x/pltr_is_a_low_bottom_company_and_has_become_too/",
        "created": 1617351303.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1617469898,
        "id": "mjcpfw",
        "num_comments": 196,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n# Table of Contents\n\n1. TL;DR\n2. Purpose\n3. The Employment Problem\n4. The Education Solution\n5. Autodesk's Role\n\n[Engaging with Industry 4.0](https://preview.redd.it/kz4g5qfd3zq61.png?width=3840&amp;format=png&amp;auto=webp&amp;s=e45fab6fc951bf329cd89d8beccad8fe7504bb89)\n\n# TL;DR\n\nMeaningful, sustainable, long-term employment.\n\nThe current administration and Federal Reserve are continuing to progress in setting the stage for long-term investments in the American economy. In combination with the USMCA trade deal of 2020, the US will see 250B in investments over 8 years for infrastructure refactoring. We take a look at how Autodesk is a core benefactor of the economic models that govern these investments. I expect Autodesk to triple in size by 2024.\n\n[Autodesk Revenues](https://preview.redd.it/aj4qbyf05zq61.png?width=1276&amp;format=png&amp;auto=webp&amp;s=dfff18884011a16bded7ba20d46e3772fad4a6fe)\n\n# Purpose\n\nTo be frank, I was surprised by the hunger for knowledge and I really enjoyed debating some of the rather brazen people here. WSB has grown and in my view, our committed analysts tend to run head-to-head with Wall Street analysts. We have on-the-ground experience as laborers, customers, and digital-natives that they often filter out of a privileged ignorance.\n\nPart of this is also due to the fact that I believe that investing in securities will become increasingly complex yet accessible for a typical retail investor which will either result in isolation OR incentivize cooperation.\n\n\\- Does the average retail investor really understand the core regulatory influences in investments like Square, PayPal, or even rob-the-hood? **(Square DD Complete)**\n\n\\- How do we compare social media incentives? **(Pinterest DD Complete)**\n\n\\- What really is customer service? **(GameStop DD Complete)**\n\n\\- Are we familiar with new international trades that increase Mexican-Texan manufacturing? **(Kansas City Southern Rail DD Complete)**\n\n**-** What are elements behind US lagging industrial sector? **(You are here)**\n\n\\- Is the average retail investor familiar with the network models that govern software like Fastly and Twilio? *(Cloud Compute DD in Progress)*\n\n\\- Do we understand the consequences of STEAM education (Science, technology, engineering, arts, mathematics)? *(Roblox DD in Progress)*\n\n\\- How knowledgable are we of fashion trends that make Nike and Foot Locker valuable?\n\nAt the end of the day, I am an educator and I believe that the goal of education is to engage a reader into a deeper curiosity or discussion, so that’s why I’m sharing my writing. I’m not here to convince you that this stock is even a good choice - but to explore the economics behind it.\n\n# The Employment Problem\n\n&gt;The **Fourth Industrial Revolution** (or **Industry 4.0**) is the ongoing automation of traditional manufacturing and industrial practices, using modern smart technology. Large-scale machine-to-machine communication (M2M) and the internet of things (IoT) are integrated for increased automation, improved communication and self-monitoring, and production of smart machines that can analyze and diagnose issues without the need for human intervention.\n\n&amp;#x200B;\n\n[A Skill Gap Problem](https://preview.redd.it/sbi6dmoy6zq61.png?width=711&amp;format=png&amp;auto=webp&amp;s=1cad0f9dc367ce723290f7ae65f97f702812041d)\n\nUltimately, the US is doing a pretty good job at maintaining  its engineering and architecture sectors, but there has been a glaring issue with a skill-gap that effects certain regions more than others. This is largely due to the strained relationship between increase automation vs. difficulty of learning the new tools associated with automation. People get left behind, especially when employment is lost in one factory and a worker is left to join another manufacturer with different standards, machines, or tools. In a nutshell, the barrier to entry for sustainable employment in the industrial sector has gone up in almost every facet.\n\nTools like Autodesk sit at the heart of these kinds of problems, where being able to understand and utilize a tool like Autodesk will dramatically increase your ability to get hired. In the information age, skills associated with Autodesk are ultimately as valuable as learning how to code in software or knowing the value of legislation and finance in other white-collar sectors. Autodesk lags behind these competitive sectors because the nature of industry it exists in with high capital expenditures. \n\nThe problem is a bottleneck problem, and solving the bottleneck will produce a far leaner and more efficient pipeline for industrial productivity, employment, and societal satisfaction.\n\n*Processing img kvm8z2md8zq61...*\n\n# The Education Solution\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ly24pppuezq61.png?width=512&amp;format=png&amp;auto=webp&amp;s=3ab25ce2945104acb0f3c4d3816cb713db1af238\n\nThe reality here is that the education sector is also a slow-mover where shortcuts carry heavy competitive consequences. Another big element in this process is that high-level skills are ultimately dependent on adoption and communication demands. We need adaptable engineers to be familiar with a fundamental skill set that speak similar \"languages\". Autodesk has generally positioned itself to be one of those tools in a similar way that organizations like Adobe has positioned itself.\n\nWhat I believe will happen is that the incentive of certifications and accelerated programs will increase dramatically as a way to boost lucrative employment and adoption of skills. These training programs will effectively become tickets initiate a good career.\n\nhttps://preview.redd.it/mj3rk4a2gzq61.png?width=2528&amp;format=png&amp;auto=webp&amp;s=bde08f5487ed3afdd3a760fc1b3d7a019eb89ca6\n\nhttps://preview.redd.it/xib18z21hzq61.png?width=638&amp;format=png&amp;auto=webp&amp;s=5bb74a3b31dda0b750b0cb19fdfc4f97a2a4515b\n\n# AutoDesk's Role\n\nAutoDesk targets the EAC sector (engineering, architecture, and construction), so it helps to think about AutoDesk as software that can handle large scale developments focusing on the nature of smaller designs like intricate screws or cars. There is a lot of work that must be completed, with a strong societal demand. This can range from multi-year developments of hospital building in rural areas, or the construction of off-shore windmill farms. This inevitably creates a powerful compounding effect with employment and Autodesk's subscription model and increasing mobile capacities.  \n\n\n\\- As employment increases, subscriptions begin to increase.\n\n\\- As subscription increases, projects of scale are adopted.\n\n\\- As projects of scale increase, employment increases.\n\n\\- As employment increases, the length of subscription increases.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/vk4hin3cozq61.png?width=936&amp;format=png&amp;auto=webp&amp;s=b569a74582ac2699904727002ae3663f530a95c7\n\nThe following is a list of Autodesk's relationship with various opportunities in the near and longterm.\n\n\\- **LEED architecture certification in civil sectors with Autodesk's architecture platform, Revit.** \n\n&gt;**Leadership in Energy and Environmental Design** (**LEED**) is a green building certification program used worldwide. Developed by the non-profit U.S. Green Building Council (USGBC) it includes a set of rating systems for the design, construction, operation, and maintenance of green buildings, homes, and neighborhoods which aims to help building owners and operators be environmentally responsible and use resources efficiently.\n\nhttps://preview.redd.it/ee4tjnc7lzq61.png?width=740&amp;format=png&amp;auto=webp&amp;s=cc84dacfe3b87538cc1c390b3122001ee54d911a\n\nhttps://preview.redd.it/343gkyy4lzq61.png?width=2518&amp;format=png&amp;auto=webp&amp;s=e85ead7fa9f1d7dbabf9550db845312a6bf417b6\n\nhttps://preview.redd.it/vv0kyc9plzq61.png?width=1606&amp;format=png&amp;auto=webp&amp;s=5895ef4b34a6d7979b441a65bedd24794ff7cba1\n\n\\- **Water maintenance system certifications with AutoDesk's end-to-end water system software, Innovyze**\n\n&gt;Innovyze is a global leader in building innovative, industry-leading software for the water industry for over 35 years; serving thousands of clients including the largest utilities, construction design firms, consultancies and refining plants around the world.\n\nhttps://preview.redd.it/osvbe3xwlzq61.png?width=2540&amp;format=png&amp;auto=webp&amp;s=01171822c0c5d78e9957d1121cbc6df64c2994c8\n\nhttps://preview.redd.it/12v4ndv3mzq61.png?width=1602&amp;format=png&amp;auto=webp&amp;s=7e5127af358c0be7792cc83c71a4b58bc6715d84\n\n\\- Robotics certifications with Autodesk robotics software, Powermill\n\n&gt;Fusion 360 with PowerMill CAM software provides expert CNC programming strategies for complex 3- and 5-axis manufacturing (the functional space where robots can move around). \n\nhttps://preview.redd.it/8pfyslzknzq61.png?width=2364&amp;format=png&amp;auto=webp&amp;s=9661fcf9fed560a4a1d1fb39021723a85c462742\n\nhttps://preview.redd.it/d2tg9g6pqzq61.png?width=1588&amp;format=png&amp;auto=webp&amp;s=6359ad43ec16be671ce0dd208932892399cf7745\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nCover: [https://luna1.co/3edd28.jpg](https://luna1.co/3edd28.jpg)",
        "subreddit": "wallstreetbets",
        "title": "Understanding The Infrastructure Bill: The Federal Goals, Employment Solutions, and AutoDesk's Role in the Post-COVID Economy.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mjcpfw/understanding_the_infrastructure_bill_the_federal/",
        "created": 1617498698.0
    },
    {
        "author": "Beachside_Investing",
        "created_utc": 1617386399,
        "id": "mipqlu",
        "num_comments": 170,
        "num_crossposts": 0,
        "selftext": "$TSLA - Just beat delivery expectations and is simply one of the best stocks to own. Look for Tesla to get over 700.00 this week on the news.\n\n$MP - Chinese tariffs on rare earth metals could send MP Materials flying. MP provides the only rare earth metal mining facility in the United States, and has so much potential for future business.\n\n$PYPL - PayPal is still in the midst of a pretty significant dip. Look for them to bounce back to 300.00 in the next few weeks. Cash is becoming outdated, finance is becoming simpler and easier.\n\n$GME - The obvious one people want to see. BUT, I’m seeing a real corner of the market being created by WSB. Look at GME, AMC, etc. and they’re all slowly being lifted by this community. We’ve almost created our own portion of the market with these stocks. I see them continuing to slowly gain.",
        "subreddit": "wallstreetbets",
        "title": "Top Stock Picks: Week of 4/5",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mipqlu/top_stock_picks_week_of_45/",
        "created": 1617415199.0
    },
    {
        "author": "chivemath",
        "created_utc": 1617477661,
        "id": "mjf9lr",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "Bitcoin is becoming an increasingly popular payment option among many companies.\nFast-food chains, big tech firms, and leading drinks companies are embracing cryptocurrencies.\nRarely does a news cycle go by without some mention of bitcoin's growing popularity, from fans and skeptics alike.\nts prices on trading exchanges tumbled around Thanksgiving last year — only to roar back and set an all-time high of $19,857 on November 30: a 177% year-to-date increase that put the S&amp;P 500's 14% rise to shame, as Insider previously reported. \nThen, last month, the cryptocurrency hit an all-time high, with prices surging to $60,000. One quirk of the increase meant that two pizzas bought by crypto legend Laszlo Hanyecz would have effectively been worth $613 million.\nBitcoin's volatility is well-publicized and has led many investors, including Warren Buffet, to criticize it and other cryptocurrencies as \"risky\" and \"worthless.\" Such warnings have not dissuaded more companies from accepting the currency as an official payment option, however. \nIn February, Elon Musk announced that Tesla would accept bitcoin as a form of payment for all models of its cars in the US. In addition, Twitter's CEO and founder, Jack Dorsey, teamed up with Jay-Z for a bitcoin endowment. The pair will invest 500 bitcoins to develop the currency in India and Africa.\nAlthough Tesla stole the headlines, there are also hundreds of other notable companies that accept the cryptocurrency as a valid form of payment, across various industries.",
        "subreddit": "investing",
        "title": "More companies, including PayPal and Starbucks, are accepting bitcoin and other cryptocurrencies as payment, despite volatility warnings",
        "url": "https://www.reddit.com/r/investing/comments/mjf9lr/more_companies_including_paypal_and_starbucks_are/",
        "created": 1617506461.0
    },
    {
        "author": "Velaryon1007",
        "created_utc": 1617396813,
        "id": "mite0k",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Hello there!\n\nAs the title suggests, I'm currently looking for sectors in which to invest other than Tech (I'm already quite tech heavy). \n\nI'm 21, I have read quite a bit about this and with 2 years of experience in this world, prefered to start early because \"Time in the market beats timing the market\", with a moderate risk tolerance. \nI understand the benefit of being diversified, but I personally think that knowing the sector that you are invested in gives 95% of the time better results than \"diversifying for the sake of doing it\", that's why I went tech heavy for a start.\n\nI have no preference between value or growth, but I value some kind of stability AND dividends (aiming for looong term holding). \n150% a month plays are nice, but I prefer avoiding the -60% that comes the following week / month. \n\nMy current holdings are:\n\n26% TSM (Semiconductor manufacturing)\n26% AAPL (Tech)\n24% NVDA (Tech / Semic / IA)\n24% LOGI (Computer peripherials)\n\nThe portfolio took a beating last month, but It's already well into the green realm. The beating is what showed me that I should consider diversifying to other sectors (after looking at them in depth) for the sake of stability. \n\nCurrently considering: \n\nVolkswagen (Automotive sector, future safe EV play, nice div., Germany's prefered child)\n\nBlackrock (Financial sector, too-big-to-fall, the \"safest\" I found)\n\nPaypal (FinTech with a foot into the crypto world lately)\n\nAnd a couple of spanish small caps (I'm from Spain) that I know locally that will grow during the upcoming years. \n\nAny suggestion of which I should choose, or what sector should I look into? (Green energy might be recovering, but I find it to be still overvalued for an entry point. Got a friend really burned with ICLN's European version, IQQH).\n\nThanks!",
        "subreddit": "stocks",
        "title": "Looking for diversification advice!",
        "url": "https://www.reddit.com/r/stocks/comments/mite0k/looking_for_diversification_advice/",
        "created": 1617425613.0
    },
    {
        "author": "Marijuana_420_",
        "created_utc": 1617489864,
        "id": "mjj5yw",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Initiative Q is an attempt by ex-PayPal guys to create a new payment system instead of payment cards that were designed in the 1950s. The system uses its own currency, the Q, and to get people to start using the system once it's ready they are allocating Qs for free to people that sign up now (the amount drops as more people join - so better to join early). Signing up is free and they only ask for your name and an email address. There's nothing to lose but if this payment system becomes a world leading payment method your Qs can be worth a lot. If you missed getting bitcoin seven years ago, you wouldn't want to miss this.\n\nHere is my invite link: https://initiativeq.com/invite/Ye7onIZde5\n\nThis link will stop working once I’m out of invites. Let me know after you registered, because I need to verify you on my end.",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Limited space! Please download app after you sign up!",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/mjj5yw/limited_space_please_download_app_after_you_sign/",
        "created": 1617518664.0
    },
    {
        "author": "itskayyuhvin",
        "created_utc": 1617277135,
        "id": "mhtfal",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "This post will detail some speculation on why believe Bitcoin will soon break 60k and potentially move to 70k within the next month or two. I'm fairly confident the bull run for Bitcoin is not over yet and will continue into this year before we see a correction.\n\n\\-Current Price of BTC around time of this post is around 58k-\n\n**External Catalysts**\n\nThe past few weeks there have been an onslaught of positive news for BTC . To name a few major ones:\n\n\\- Paypal is now incorporating use and everyday people can exchange BTC and other cryptocurrency.\n\n\\- Square, Tesla, and several other companies have included it in their balance sheet. Microstrategy essentially embraced their whole mission around it. Overstock accepts BTC as payment.\n\n\\- Spending will be high with the stimulus package and other bills under Democrats. BTC can be seen as a hedge to the dollar\n\n\\- Visa and other credit cards have also started incorporating it.\n\n*More importantly, there are major catalysts that will be coming this April that will likely propel it forward more:*\n\n\\- BTC ETFs are already being submitted by major institutions like Fidelity. When the GOLD ETF was introduced, the value of gold went on bull run the year to follow.\n\n\\- Coinbase IPO will be happening in April if there are no more delays. This one is **major**! Just the event will get the talk of cryptocurrency spread and be the chatter of the month.\n\n\\- Literally today Chipotle is getting in on the fun too with their Burrito or Bitcoin event: [https://newsroom.chipotle.com/2021-03-30-Burritos-Or-Bitcoin-Chipotle-To-Give-Away-200k-In-Free-Burritos-And-Bitcoin-To-Celebrate-National-Burrito-Day](https://newsroom.chipotle.com/2021-03-30-Burritos-Or-Bitcoin-Chipotle-To-Give-Away-200k-In-Free-Burritos-And-Bitcoin-To-Celebrate-National-Burrito-Day)\n\n**Technical Analysis:**\n\nBTC this week reached almost 60k three times this week.\n\nKey levels of Resistance: 60k, 64.5k\n\nKey levels of Support: 53k, 51k\n\nSettling at 58k is very bullish at it means it is bouncing *above* the 9-day and 21-day moving averages. If it's able to hold this it should be able to get to around 62k. If it passes the mental wall there, it can easily surge to 70k before correcting. If it fails to support 55k then we could see a downside\n\n**Tickers that follow Bit Coin: $MARA, $RIOT, $CAN**\n\nI chose three tickers to focus on that will likely benefit from a rally. I know there are other ones like SOS, BTBT, FTFT but those are high risk from what I've seen having short reports written up on them. And when Bitcoin goes down, they go down hard. Let me know if there are any new tickers that follow Bitcoin too.\n\n**MARA**\n\n\\- Bitcoin mining company I've been following since it was 5$. Has strong support\n\n\\- Recent News: To Launch the First North American-Based Bitcoin Mining Pool.\n\n\\- Reached a 52week high over 50+ today\n\n**RIOT**\n\n\\- Same as MARA a crypto mining company I've followed since it was 10$. It's always been slightly ahead of MARA but it seems the gap is closing.\n\n\\- Recently reported GREAT earnings 300% surprise in EPS\n\n\\- Heavily shorted (20%) which may be why it has not been climbing as hard in following BTC, but will easily soar multiple levels if Bit rallies hard enough.\n\n\\- Reached over 70 last time BTC ran\n\n**CAN**\n\n\\- The only Chinese stock I singled out that could see a strong run correlated with Bitcoin if it were to run this month.\n\n\\- Canaan manufactures equipment used for mining Bitcoin. As the price rises, more and more companies are enticed to mine.\n\n\\- Reached around 40 last time BTC ran\n\n*Bearish Warning:*\n\n\\- In the past when Bitcoin has ran, there has always been a big correction afterwards. Invest at your own risk.\n\n\\- Offerings can happen if the price climbs too much",
        "subreddit": "StockMarket",
        "title": "Writing on the Wall: Bitcoin and how to play it with MARA, RIOT, CAN",
        "url": "https://www.reddit.com/r/StockMarket/comments/mhtfal/writing_on_the_wall_bitcoin_and_how_to_play_it/",
        "created": 1617305935.0
    },
    {
        "author": "SoloTheFord",
        "created_utc": 1617299568,
        "id": "mi0wcz",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "This is an excerpt from previous DD but i want to share so people have a chance to make their own choice and do their own research before this stock blows up...\n\nPaysafe (NYSE:PSFE). The merger is legally official, it's going to be a massive cash cow. You've got online gambling, sports betting, big casinos shifting online, privacy payment provider e-wallets, the main branch with its own payment cards accepted internationally and seamlessly, also allowing private crypto purchases, not to mention their probability of supporting the fledgling esports igaming industry. All in one package. It is going to be colossal. Paypal is having issues just keeping their shit together with simple crypto transactions, people are pissed, moving to better providers like Square (which is also a great growth stock btw). The iGaming(online gambling) industry is already in the hundred billions of dollars per annum and Paysafe is a major payment processor at the forefront with a long and trusted track record if any of you are familiar with Neteller and Skrill formerly Moneybookers etc. \n\nIf BFT - Foley's track record on the other hand is any example of success, they can prop it up massively. The best of both worlds as BFT is also bringing insurance and investment holding companies along with it for some icing on the cake. \n\nPaypal is weakening and they are falling behind in these markets, they are too vanilla and wont touch any of this and are too busy un-clusterf*cking their already KYC users frozen or blocked btc transactions, besides people want ease of use without borders and no bullshit verification processes. I had history over a decade ago working directly with the digital payment providers currently under Paysafe when online gambling was basically outlawed in North America not to mention taking client orders which we still did anyway on regulated soil (come at me FBI) Im in Canada we had authorities do walk throughs of our offices all the time. Digressing. With BFT hovering around $14-$17 which to be honest is a goddamn steal right now, once it transitions into PSFE I estimate it will hit $40+ within the first few months, with far reaching upside, smack in between 2 crazy global industries that are on fire rn: crypto and igaming.\n\nLittle ex employee insider information for you right there. \n\n Jk, as i said, its all public knowledge, but these payment providers are proverbial money printers and not the bad kind and with all the Casinos shifting their business online/covid/crypto/kids stealings mom's credit card betting on their favourite twitch streamers to win at CS:GO, Fortnite,half joking. I'd say most current online betting money is in sports and poker in the 18-40 age range, you get the odd rich Boomers who drop 40k a day on coin flips or how many injuries there will be in a game, sick shit like that, who bets 40k on a coin flip? The rest are grannies hitting slots.  \n\nThe US is also lifting a lot of sanctions Federally and by state IIRC, relating to online gambling; BFT/PSFE is practically a lock. I highly suggest to anyone pick up BFT stock asap or at very least get some early wet feet. I personally own a few hundred and plan to buy more.",
        "subreddit": "StockMarket",
        "title": "$PSFE now live and its a steal.",
        "url": "https://www.reddit.com/r/StockMarket/comments/mi0wcz/psfe_now_live_and_its_a_steal/",
        "created": 1617328368.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1617268735,
        "id": "mhrha8",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Paysafe has finally just gone public with a new Board of Directors, much less debt, lots more cash, new M&amp;A plans and a new ticker: PSFE During yesterday's ticker change, there were several reports of people having no access to their accounts and/or suddenly being faced with an abrupt change in margin requirements from 25% to 100%. Many suggest this was intentional manipulation to give institutions cheaper shares. Regardless, this may have created a good buying opportunity for us too. For those interested, here's some comprehensive DD.\n\nPaysafe is a unique combination of fintech, iGaming, sports betting and banking all rolled into one stock. Whether you like him or not, this is essentially why NBC’s Jim Cramer recently said, “There is something about Paysafe that may be the ultimate stock for this moment.” (video link below) Market analyst Steve Grasso says, “It’s the most excited I’ve been about a stock in a long time.” Grasso, by the way, has repeated called for it to triple ($45-50). So why is that?\n\nPaysafe offers a scalable electronic payment platform used by Draftkings, Roblox, Spotify, eToro, Fortnight, Coinbase, Amazon, Twitch, EA, 888, ApplePay, Youtube, Visa, Microsoft, Xbox, Amelco, William Hill, Ceasar's, Betfair, Pokerstars, PayLease, ESL Gaming, Luckbox, bet365, Lotto among many others.\n\nPaysafe is ranked No. 2 globally in the digital wallet space with presence in 120 countries and No. 4 globally in integrated merchant processing.\n\nImportantly, Paysafe is the No. 1 global leader in iGaming eCash network (currently 36% of revenue) with 10-15X growth projected. US iGaming continues to be legalized state by state, growing revenue by 234% in just the last year. “At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”\n\nPaysafe is enabled for digital currency (a type that shall not be mentioned in these parts) without having to go through fiat. It recently partnered with Coinbase to expand options in US and it just launched PaysafeCash in US. (Now in 40 currencies and 30 global markets enabling easier cross border payments.)\n\nPerhaps most central to this recent merger is Bill Foley, Fidelity’s Chairman of the Board and now the Chairman of Paysafe, who has a proven track record for generating exponential synergistic inorganic growth. For example, in just the last five years, he grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B). He also grew FIS from $2.5 billion to over $91 billion (36.4X) and he says, “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.”\n\nOf their expansion plans Foley says, “We’ve got a wide landscape we can attack. It’s pretty exciting.” “It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else.” “I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody. That’s why I got so excited about Paysafe Group Holdings Limited as its position in iGaming is really second to none.” “Whether it’s a lottery or slot machines or sportsbetting opening in a state, it’s our job to be there first and to make sure we dominate. We’re focusing on gaming, particularly sportsbetting, in the United States as it becomes legal and we’ve got a wide landscape we can attack. It’s pretty exciting.”\n\nAlong with Bill Foley, Paysafe's newly announced Board of Directors includes a former Morgan Stanley CEO, a former Chairman of the American Gaming Association and CEO of MGM Resorts International, a legal and regulatory expert in the multi-jurisdictional online and retail gambling industries, the CEO of Dun &amp; Bradstreet and CEO of Black Knight, two senior Managing Directors from Blackstone and two senior Managing Directors from CVC,\n\nBetween the new Board of Directors, Bill Foley’s proven expertise in rapid M&amp;A growth and Paysafe’s massive market share and diverse assets, including the world’s second largest digital wallet, $362 million in free cash flow, 30-35% margins (21% CAGR), a projected $100-110 billion in transactional volume and $1.5 billion revenue, it is inevitable that institutional investors will, by necessity, include PSFE in their portfolios.\n\nPaysafe’s industry leading risk management and international regulatory expertise gives them an edge in spaces where competitors have hesitated like iGaming, sportsbetting, alternative currency trading as well as offering essential banking and ecommerce services to the \"unbanked\" (1.7 billion globally). Paysafe has a global platform with integrated cloud technology (Snowflake) allowing for easier migration of eCash, integration of payment methods and expansion into global banking as a service. Paysafe is so diversified that they've identified a $58 trillion TAM.\n\nFurther, major investment funds know that fintechs are the future. Fund manager Cathie Wood says, “Fintechs are going to, we believe, gut banks.” Similarly, Jackie Reses, board member of the SF Federal Reserve and fmr Head of Square Capital, calls for fintech “taking over and revolutionizing banking” representing “a wholesale transition” of a $16 trillion market cap.\n\nAnalyst Michael Del Grosso recently initiated coverage saying, \"We believe PSFE represents a relatively scarce asset within the payments industry given its unique business strategy, geographical footprint, and focus on the iGaming industry. Our forecasts imply revenue growth at the high-end of management's guidance and we believe there is upside to our forecasts in the event of state-level legalization of iGaming. PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States.\"\n\nInvestors should be aware that there is are post-merger lockup periods before insiders can sell their shares: PIPE: = 176 days. Private Equity = 86 days (roughly 6 and 3 months respectively accounting for trading days and weekends). Something to be aware of but there are several signals that these parties aren't in any rush to sell. Eli Nagler, a Senior Managing Director at Blackstone, recently said: “Today is a significant milestone for Paysafe and a testament to the excellent work of their world-class management team over several years. We believe Paysafe has a long runway for further growth and look forward to remaining part of the team and seeing their continued success as a public company.” Regarding Blackstone and CVC, who now have four senior managing directors on Paysafe’s Board, Foley said, “They rolled a significant amount of their investment which is a confidence builder. They didn’t take all their money off the table… All of these things put together really created the confidence among the investor base to invest in the PIPE and then support the stock.” Also, the PIPE investors are primarily insurance companies known for long term hold strategies and they are closely associated with Bill Foley. As Foley recently said, “Having a large PIPE basically validates the transaction.… The companies that I’m affiliated with actually invested roughly a billion dollars in the PIPE and forward purchase agreements so Paysafe was always a really protected asset, besides the fact that it’s a great asset.”\n\nBill Foley says Paysafe may be his “best investment ever.” He says, “It’s a fortress. It’s got a moat.” “We have a proven strategy of winning as new global markets open. And most importantly, we have unrivaled regulatory risk and technical expertise.”\n\nAs an aside, even though, “Roughly 75% of online gambling operators use Paysafe for processing payments” many in the US haven’t yet heard of it yet. Partially because much of its presence is in back-end processing. Through its several new partnerships (Coinbase, Microsoft Rentmoola), Paysafe is just now rolling out its offerings in the U.S. In Europe, where it is more commonly used, Trustpilot rates Paysafe as “Excellent” (4.7/5 stars) with over 20,000 reviews, and Skrill (owned by Paysafe) 4/5 stars “great” with over 16,000 reviews, while competitor PayPal is rated \"poor\" only 1/5 stars with over 16,000 reviews. Further, Paysafe was winner of the American Gambling Awards’ “Payment Processor of the Year,” and owns Openbucks, Neteller and Skrill, 2019 winner “Best Digital Wallet” for best consumer take up and most innovative technology with “greatest potential to disrupt current ecosystems.” Also, Paysafe won “Best Omni-Channel Payment Solution” 2021 MPE Award and the gaming industry SAGSE award for “Best Payment Method.”\n\nTo give a sense of their pace and progress, these are some of Paysafe’s recent announcements that were made before going public and have not been factored into the current valuation:\n\nDec. 15 — Paysafe launches Paysafecash in the US\n\nDec. 21 — Paysafe partners with Amelco to plug US sports books into unified payments platform\n\nDec. 23 — Paysafe enables online cash payments for Microsoft\n\nJan 11 — Paysafe partners with Colorado’s BetWildwood\n\nFeb 1 — Paysafe expands Virginia Lottery partnership\n\nFeb 17 — Paysafe partners with Luckbox to roll out Skrill and Neteller payment services\n\nFeb 18 — Paysafe expands partnership with ESL Gaming, the world’s largest esports company\n\nFeb 23 — Paysafe’s Skrill launches new fiat-to-digital currency\n\nFeb 25 — Paysafe partners with Austria’s A1 esports League\n\nMar 1 — Paysafe partners with RentMoola to enable US renters to pay rent with Paysafecash eCash\n\nMar 12 — Leeds United announces partnership with Skrill\n\nMar 15 — Paysafe expands U.S. partnership with PointsBet\n\nMar 16 — Paysafe partners with Provema to enable online cash payments\n\nMar 25 -- Paysafe’s Skrill expands digital currency offering to US with Coinbase\n\n&amp;#x200B;\n\nFortunately for shareholders, even before Foley’s value creation play book is put into action, Paysafe is currently undervalued compared to sector peers.\n\nSince market analyst Steve Grasso continues to his repeat his calls for a triple ($45-50), I've looked more closely at EV / EBITDA, EV / Revenue and EV / Free cash flow multiples of sector peers, including PayPal, Nuvei, Repay, Shift 4, Adyen, Square, Affirm, Stripe, Chime and a few others, using cross-referenced data from Nasdaq, WSJ, Morningstar, Macrotrends, Yahoo Finance. The conservative average of those three multiples puts Paysafe’s post-merger pro forma share value at around $46.52:\n\n&amp;#x200B;\n\nPaysafe’s share price using the average multiples from the full list of sector peers:\n\nEV/EBITDA ratio : $122.09\n\nEV/Rev ratio : $83.91\n\nEV/FCF ratio : $87.86\n\nAverage: $97.95\n\n&amp;#x200B;\n\nMore realistic share prices, after eliminating all outliers with very high multiples:\n\nEV/EBITDA ratio :$50.75\n\nEV/Rev ratio : $44.64\n\nEV/FCF ratio : $44.18\n\nAverage :$46.52\n\n&amp;#x200B;\n\nNote: Unlike Paysafe, nearly half of these publicly traded fintechs still do not report positive cash flow. Also, these multiples reflect a collective 27% pull back from recent highs so interest rate risks have been somewhat factored in.\n\nAlso, Paysafe's CFO noted that their conservative 11% growth projection is tied to the general fintech market at large. They have deliberately excluded both M&amp;A plans that are apparently already underway and US iGaming growth that may potentially grow 10x or more over the next 5 years. Further, the above comps include fintechs with slower or similar growth while still commanding much higher multiples. For example, Shift4 reported only 4% y-o-y growth and GPN's growth projection is on par with Paysafe's.",
        "subreddit": "wallstreetbets",
        "title": "Paysafe goes public with new ticker: PSFE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhrha8/paysafe_goes_public_with_new_ticker_psfe/",
        "created": 1617297535.0
    },
    {
        "author": "beefjerkytothemoon21",
        "created_utc": 1617546130,
        "id": "mjx59l",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Initiative Q is an attempt by ex-PayPal guys to create a new payment system instead of payment cards that were designed in the 1950s. The system uses its own currency, the Q, and to get people to start using the system once it's ready they are allocating Qs for free to people that sign up now (the amount drops as more people join - so better to join early). Signing up is free and they only ask for your name and an email address. There's nothing to lose but if this payment system becomes a world leading payment method your Qs can be worth a lot. If you missed getting bitcoin seven years ago, you wouldn't want to miss this.\n\nHere is my invite link: https://initiativeq.com/invite/uhfxoWzSbP\n\nThis link will stop working once I’m out of invites. Let me know after you registered, because I need to verify you on my end.",
        "subreddit": "StockMarket",
        "title": "Initiative Q",
        "url": "https://www.reddit.com/r/StockMarket/comments/mjx59l/initiative_q/",
        "created": 1617574930.0
    },
    {
        "author": "Equivalent-Branch850",
        "created_utc": 1617478914,
        "id": "mjfog4",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "How to invest in crypto through PayPal",
        "url": "https://www.reddit.com/r/investing/comments/mjfog4/how_to_invest_in_crypto_through_paypal/",
        "created": 1617507714.0
    },
    {
        "author": "ShopRus",
        "created_utc": 1617304394,
        "id": "mi2ncb",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "check for all details at pinterest  [(1) Pinterest](https://www.pinterest.com/pin/842384305301230133/)",
        "subreddit": "wallstreetbets",
        "title": "$20 - 100 PayPal Cash in minutes",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mi2ncb/20_100_paypal_cash_in_minutes/",
        "created": 1617333194.0
    },
    {
        "author": "Marijuana_420_",
        "created_utc": 1617505035,
        "id": "mjnjlm",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Initiative Q is an attempt by ex-PayPal guys to create a new payment system instead of payment cards that were designed in the 1950s. The system uses its own currency, the Q, and to get people to start using the system once it's ready they are allocating Qs for free to people that sign up now (the amount drops as more people join - so better to join early). Signing up is free and they only ask for your name and an email address. There's nothing to lose but if this payment system becomes a world leading payment method your Qs can be worth a lot. If you missed getting bitcoin seven years ago, you wouldn't want to miss this.\n\nHere is my invite link: https://initiativeq.com/invite/awb_aPR3T\n\nThis link will stop working once I’m out of invites. Let me know after you registered, because I need to verify you on my end.",
        "subreddit": "RobinHoodPennyStocks",
        "title": "Limited space! Please don’t forget to install app after sign up!",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/mjnjlm/limited_space_please_dont_forget_to_install_app/",
        "created": 1617533835.0
    },
    {
        "author": "khobi84",
        "created_utc": 1617285751,
        "id": "mhvym2",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Bearish $QRVO",
        "url": "http://tradefibs.blogspot.co.uk",
        "created": 1617314551.0
    },
    {
        "author": "khobi84",
        "created_utc": 1617285578,
        "id": "mhvwh4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Bearish $QRVO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhvwh4/bearish_qrvo/",
        "created": 1617314378.0
    }
]