[
    {
        "author": "footash",
        "created_utc": 1637620091,
        "id": "qzxqpd",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " \n\nThree of the world’s four largest sector-based exchange-traded funds (ETFs) face a shake-up due to proposed changes in their composition that would reclassify major companies in information technology indexes as financial or industrial.\n\nS&amp;P Dow Jones Indices LLC and MSCI Inc. have launched a consultation on a potential revamp of the widely followed global industry classification standards (GICS) that determine in which sector each company is placed.\n\nThis debate could have meaningful consequences, with the weighting of banks in the US$45.7-billion Financial Select Sector SPDR Fund [XLF-A](https://www.theglobeandmail.com/investing/markets/stocks/XLF-A/), as well as other ETFs, such as US$11.6-billion Vanguard Financials ETF [VFH-A](https://www.theglobeandmail.com/investing/markets/stocks/VFH-A/), falling below one-third, from a peak of 45.4 per cent in 2013 according to S&amp;P data, if the proposed changes come into force.\n\nHowever, the US$49-billion Technology Select Sector SPDR Fund [XLK-A](https://www.theglobeandmail.com/investing/markets/stocks/XLK-A/), the world’s largest sector ETF, according to data from TrackInsight SAS, and the US$48.2-billion Vanguard Information Technology Index ETF [VGT-A](https://www.theglobeandmail.com/investing/markets/stocks/VGT-A/) would become both more cyclical – prone to rise and fall in line with the economy – and more concentrated as the sector is stripped of several stocks, including three of its eight largest.\n\n“Some of the largest information technology companies in the S&amp;P 500 Index could be changing sectors,” says Todd Rosenbluth, head of ETF and mutual fund research at CFRA Research.\n\n“At least seven of its large-cap company sector constituents are potentially moving to a new sector,” Mr. Rosenbluth adds, with the knock-on effect that “banks would no longer dominate broad financial ETFs.”\n\nMSCI and S&amp;P are proposing that “transaction and payment processing companies” are switched from the information technology sector of the GICS framework to the financial sector.\n\nThis would impact companies such as Visa Inc. [V-N](https://www.theglobeandmail.com/investing/markets/stocks/V-N/), Mastercard Inc. [MA-N](https://www.theglobeandmail.com/investing/markets/stocks/MA-N/) and PayPal Holdings Inc. [PYPL-Q](https://www.theglobeandmail.com/investing/markets/stocks/PYPL-Q/), which have a combined market capitalization of more than US$1-trillion and are, respectively, the fourth-, sixth- and eighth-largest stocks in the IT sector.\n\nThe technology category would be further denuded by being stripped of its data-processing and outsourced services, and payroll processing subindustry groupings, which would be switched to the industrial sector under the proposals. This would impact companies such as Fidelity National Information Services Inc. [FIS-N](https://www.theglobeandmail.com/investing/markets/stocks/FIS-N/), Broadridge Financial Solutions Inc. [BR-N](https://www.theglobeandmail.com/investing/markets/stocks/BR-N/), and Automatic Data Processing Inc. [AFP-Q](https://www.theglobeandmail.com/investing/markets/stocks/ADP-Q/).\n\nThe proposed changes would result in heightened concentration in the technology sector, coming as they do on top of a 2018 reshuffle that saw Facebook Inc., now known as Meta Platforms Inc. [FB-Q](https://www.theglobeandmail.com/investing/markets/stocks/FB-Q/), Twitter Inc. [TWTR-N](https://www.theglobeandmail.com/investing/markets/stocks/TWTR-N/), Snap Inc. [SNAP-N](https://www.theglobeandmail.com/investing/markets/stocks/SNAP-N/) and Alphabet Inc. [GOOGL-Q](https://www.theglobeandmail.com/investing/markets/stocks/GOOGL-Q/), the parent of Google, transferred to communications services.\n\nMicrosoft Corp. [MSFT-Q](https://www.theglobeandmail.com/investing/markets/stocks/MSFT-Q/) and Apple Inc. [AAPL-Q](https://www.theglobeandmail.com/investing/markets/stocks/AAPL-Q/) already account for a combined 44.7 per cent of the S&amp;P 500 Information Technology index, even before the latest proposals.\n\nHowever, Matthew Bartolini, head of SPDR Americas research at State Street Global Advisors, says ETFs such as his firm’s Technology Select Sector SPDR Fund would be unlikely to increase their exposure to Microsoft and Apple much further.\n\nUnder the rules of the Technology Select Sector Index, tracked by Technology Select Sector SPDR Fund, an individual company’s weight is capped at 23 per cent, while the sum of stocks with weights greater than 4.8 per cent cannot exceed 50 per cent of the index.\n\nThese rules mean the weighting of the two giants, as well as Nvidia Corp. [NVDA-Q](https://www.theglobeandmail.com/investing/markets/stocks/NVDA-Q/), the third-largest stock in the sector, effectively cannot rise any further, meaning that the weighting of the next ranked companies, such as Adobe Systems Inc. [ADBE-Q](https://www.theglobeandmail.com/investing/markets/stocks/ADBE-Q/), Salesforce.com Inc. [CRM-N](https://www.theglobeandmail.com/investing/markets/stocks/CRM-N/) and Cisco Systems Inc. [CSCO-Q](https://www.theglobeandmail.com/investing/markets/stocks/CSCO-Q/), will need to be bumped up artificially to take the slack.\n\nMr. Bartolini says this is unlikely to significantly affect the Technology Select Sector SPDR Fund’s performance, though.\n\n“What we see currently in funds is some difference relative to the S&amp;P 500 \\[IT index\\] itself because of the capping. We have to overweight some smaller names, but historically these weighting differences haven’t had a significant impact on the fund because we are still diversified within the sector itself. The movement of the sector will drive the sector’s return,” Mr. Bartolini says.\n\nThe proposed changes would be likely to increase the level of risk in technology funds such as the Technology Select Sector SPDR Fund. Visa, Mastercard and PayPal have five-year betas of between 1.1 and 0.92, according to S&amp;P Capital IQ, meaning they broadly tend to rise and fall in line with the wider market. Most other tech stocks have higher betas than that, meaning they tend to be more volatile.\n\nThe switch, assuming it happens, may also have a downward impact on the valuation of the likes of Mastercard. While there’s no logical reason for a company to be rated more lowly simply because it has changed sector – it is still the same business – a company that has been transferred will now be measured against a different peer group.\n\nFinancial Select Sector SPDR Fund, the financial sector ETF, trades on a price-to-book ratio of just 1.7 and a price-to-earnings ratio of 13.8, compared to 11.5 and 28.6, respectively, for Technology Select Sector SPDR Fund.\n\n“There is likely to be some market impact because these companies are being judged against a different peer group,” Mr. Rosenbluth says.\n\nBased on current valuations, Visa, Mastercard and PayPal would be among the five-largest constituents of the financial sector, alongside JPMorgan Chase &amp; Co. [JPM-M-N](https://www.theglobeandmail.com/investing/markets/stocks/JPM-M-N/) and Bank of America Corp. [BAC-N](https://www.theglobeandmail.com/investing/markets/stocks/BAC-N/).\n\nThey would be likely to damp volatility in the sector, given that the larger banks typically have betas of about 1.5.\n\n“It’s rare to think of tech as low risk but does this reduce the risk profile of the financial sector? I think it does,” Mr. Rosenbluth says. The trio of newcomers were likely to have stronger growth prospects than banks and insurers, he adds, but be more expensive, while rendering the financial sector less interest rate sensitive.\n\nAs a consequence, the weighting of the banking industry within the financial sector would fall from 39 per cent to 31 per cent, on current valuations.\n\nMSCI and S&amp;P are currently consulting on the proposals, with a decision due in February.",
        "subreddit": "CanadianInvestor",
        "title": "Major sector ETFs face risk of large tech companies being reclassified - V/MA/PYPL could be moved from IT to Financial sector. https://www.theglobeandmail.com/investing/globe-advisor/advisor-etfs/article-major-sector-etfs-face-risk-of-large-tech-companies-being-reclassified/",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/qzxqpd/major_sector_etfs_face_risk_of_large_tech/",
        "created": 1637648891.0
    },
    {
        "author": "kribz666",
        "created_utc": 1636143699,
        "id": "qnjr8b",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "follow up on[this post](https://www.reddit.com/r/EarningsWatcher/comments/qky00i/opportunities_in_options_around_earnings_this_week/)\n\nThis Week Recap: **Accuracy: 65% | Average PnL: +30%** \n\n&amp;#x200B;\n\n**$WU predicted to beat +/-4.5%** \n\n=&gt; stock moved -5% very shortly then within +/-3% \n\n=&gt; *PnL on 19p / 19c nov19: 0% if exited* PS: gains were possible during a short window   \n\n&amp;#x200B;\n\n**$AEE predicted to beat -/+3%**\n\n =&gt; stock moved +3% \n\n=&gt; *PnL on 85p / 85c nov19: -20% if exited*\n\n&amp;#x200B;\n\n **$AMEH predicted to beat +/-11%** \n\n=&gt; stock moved +22% \n\n=&gt; *PnL on 75p / 75c nov19 : +90%* \n\n&amp;#x200B;\n\n**$ATUS predicted to beat +/-8%** \n\n=&gt; stock moved +10%\n\n =&gt; *PnL on 16p / 17c nov19: +30%* \n\n&amp;#x200B;\n\n**$PNW predicted to beat +/-3%** \n\n=&gt; stock moved +2.5% \n\n=&gt; *PnL on 60p / 65c nov19: -10% if exited* \n\nPS: it was hard to get a good break even close the model threshold, thus the loss  \n\n&amp;#x200B;\n\n**win or not** = stocking moving higher than the model threshold (average historic)\n\n **PnL:** on positions that had a break even close to the model threshold with enough time to exit, close to average user on our discord (even thought i throw in risky ones where br was higher like for pnw)",
        "subreddit": "smallstreetbets",
        "title": "Recap Of Recommended Positions This Week: 65% win rate and +30% overall PnL",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/qnjr8b/recap_of_recommended_positions_this_week_65_win/",
        "created": 1636172499.0
    }
]