[
    {
        "author": "Sufficient_Nature368",
        "created_utc": 1612368647,
        "id": "lbqzep",
        "num_comments": 182,
        "num_crossposts": 5,
        "selftext": "This will be long....Sorry in advance. I decided I'd like to research Michael Burry since I've seen so many people talking about him on here and this is just what I've discovered about him and his methods.\n\n**Quick Facts:**\n\n* Founder of hedge fund Scion Capital 2000-2008. Closed to focus on personal investments\n* Best known for seeing the subprime mortgage crisis (2007-2010) and profiting from it\n* Investment style is built upon Benjamin Graham and David Dodd’s 1934 book Security Analysis: \"All my stock picking is 100% based on the concept of a margin of safety.\"\n\n**Strategy:**\n\n* Michael Burry's strategy as he states is not very complex. He tries to buy shares of unpopular companies when the look like roadkill, and sell them when they've been cleaned up a bit. Lets take a look at his Q2 2020 Positions, top buys, and top sells. There are a few that are not big surprises but check it out.\n\n|Stock|Shares|Market Value|% of Portfolio|\n|:-|:-|:-|:-|\n|GOOG / Alphabet Inc Class C (CALL)|80,000\t| $113,089,000 | 35.87 |\n| FB / Facebook Inc (CALL) | 93,200 | $21,163,000 | 6.71 |\n| BKNG / Booking Holdings Inc (CALL) | 11,600 | $18,471,000 | 5.86 |\n| GS / Goldman Sachs Group (CALL) | 73,600 | $14,545,000 | 4.61 |\n| GME / Gamestop Corp | 2,750,000 | $11,935,000 | 3.79 |\n| WDC / Western Digital Inc (CALL) | 270,000 | $11,921,000 | 3.78 |\n| BBBY / Bed Bath &amp; Beyond Inc | 1,000,000 | $10,600,000 | 3.36 |\n| DISCA / Discovery Inc | 500,000 | $10,550,000 | 3.35 |\n| TCOM / Trip.com Inc | 325,000 | $8,424,000 | 2.67 |\n| QRVO / Qorvo Inc | 75,000 | $8,290,000 | 2.63 |\n\n* **Top Buys**\n   * GOOG / Alphabet Inc Class C (CALL)\n   * FB / Facebook Inc (CALL)\n   * BKNG / Booking Holdings Inc (CALL)\n   * GS / Goldman Sachs Group (CALL)\n   * WDC / Western Digital Inc (CALL)\n* **Top Sells**\n   * Jack / Jack In The Box Inc\n   * FB / Facebook Inc\n   * BA / Boeing Inc\n   * MAXR / Maxar Technologies Ltd\n   * QRVO / Qorvo Inc\n\nMr. Burry's weapon of choice is his **research** and that it's critical for him to understand a company's value before laying down a dime and that 100% of his stock picking is based on the concept of margin of safety introduced in the book \"Security Analysis\" which I am reading through right now and dang is it huge lol. He also states that he has his own version of their technique, but that the net is that he wants to protect his downside to prevent permanent loss of capital. Specific, known catalyst are not necessary. Sheer, outrageous value is enough.\n\nHe cares little about the level of the general market and puts few restrictions on potential investments. They can be large-cap stocks, small cap, mid cap, micro cap, tech or non-tech and finds out-of-favor industries a particularly fertile ground for best-of-breed shares at **steep discounts**.\n\n**How does he determine the discount?**\n\n* Focuses on free cash flow and enterprise value (Market capitalization less cash plus debt)\n* Screen companies by look at enterprise value/EBITDA ratio. Accepted ratio varies with the industry and it position in the economic cycle\n* If stock passes loose screen, looks harder to determine specific price and value of a company\n   * Takes into account off-balance sheet items and true free cash flow\n   * Ignores price-earning ratios\n   * Return of equity is deceptive and dangerous\n   * Prefers minimal debt\n   * Adjust book value to a realistic number\n* Invest in rare birds - asset plays, and to a lesser extent, arbitrage opportunities and companies selling at less than two-thirds of net value\n* Will mix in with companies favored by Warren Buffet **IF** they become available at good prices. Deserving of longer holding periods.\n\n**How many Stocks does he hold?**\n\n* Likes to hold 12 to 18 stocks diversified among various depressed industries, and tends to be fully invested. Provides enough room for his best ideas and helps with volatility.\n* Feels volatility is no relation to risk.\n\n**Tax Implications**\n\n* Not concerned much about tax. Know his portfolio turnover will generally exceed 50% annually, and at 20% the long-term tax benefits of low-turnover pretty much disappear.\n\n**When he buys**\n\n* He mixes barebones technical analysis into his strategy. \n* Prefers to buy within 10% to 15% of a 52-week low that has shown itself to offer some price support. If a stock other than a rare bird breaks a new low, in most cases he cuts the loss.\n   * Balances the fact that he is turning his back on potentially greater value with the fact that since implementing this rule he hasn't had a single misfortunate blow up his entire portfolio\n\n&amp;#x200B;\n\n&gt;In the end, investing is neither a science nor an art - it is a scientific art.\n\n&amp;#x200B;\n\n**Works Cited**\n\n[https://acquirersmultiple.com/2020/08/michael-burrys-top-10-holdings-q2-2020-plus-top-buys-sells/](https://acquirersmultiple.com/2020/08/michael-burrys-top-10-holdings-q2-2020-plus-top-buys-sells/)\n\n[https://acquirersmultiple.com/2017/11/michael-burry-search-for-unpopular-companies-that-look-like-road-kill/](https://acquirersmultiple.com/2017/11/michael-burry-search-for-unpopular-companies-that-look-like-road-kill/)\n\n[https://en.wikipedia.org/wiki/Michael\\_Burry](https://en.wikipedia.org/wiki/Michael_Burry)",
        "subreddit": "ValueInvesting",
        "title": "Michael Burry's Investment Strategy",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/lbqzep/michael_burrys_investment_strategy/",
        "created": 1612397447.0
    },
    {
        "author": "POTUS-JebKush",
        "created_utc": 1612222116,
        "id": "lahib2",
        "num_comments": 101,
        "num_crossposts": 0,
        "selftext": "# TL;DR\n\n**Hostess Brands (TWNK)** has high (\\~15%) short interest (more than AMC or BB) setting the stage for a short squeeze, additional upside from a gamma squeeze, is extremely memeable, AND has a fundamentally sound business with strong cash flows and organic growth trading at a reasonable valuation. ***Not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade.***\n\nTwinkies to the moon: [https://imgur.com/a/sUYpaue](https://imgur.com/a/sUYpaue)\n\n# Intro\n\nSup guys. So I know a bunch of us are now looking for the next big opportunity to pile into. Unfortunately we probably won’t see a squeeze of GME’s magnitude for awhile since that kind of short interest is insanely rare, but I think we might have found an opportunity that is pretty low hanging fruit AND is significantly better relative value than the other names people are piling into. It has what the finance community call “asymmetric upside” (more upside potential than downside risk), for the reasons I’ll describe below.\n\n**So what’s the target?** ***Hostess Brands (NASDAQ: TWNK)***. You probably know them as the company that makes Twinkies, but they also make Cupcakes, DingDongs, HoHos, Donettes and Zingers (can’t make this up)…now they’re going to make us some Tendies™ as well.\n\nFor some historical context, the company was private-equity owned for awhile and then went public via a SPAC in 2016 (before SPAC's were as cool as they are today). The previous owners have fully sold out now, so the entire shares outstanding are pretty much public float today and there’s no more downward pressure on the stock price from their share sales.\n\nThe company also has warrants from the SPAC (effectively long-dated call options) that trade under TWNKW. They trade as half warrants, so need two warrants to form one share and are ITM at $11.50 per one full share and expire in November 2021.\n\n**So what’s the thesis?** We think there’s an opportunity to wring out the short sellers in this name and potentially even further upside from a gamma squeeze if we can get enough call option volume. From a fundamental standpoint, the business is extremely stable (as it was a pretty ideal candidate for an LBO), and trades at a slight discount to its peers.\n\n# Technical Thesis\n\n1. **High short interest = squeeze opportunity** – Roughly 15% short interest today, higher than AMC which is last reported at 10-15% (see end of post for reference) and BB at 5-10%. This seems low in comparison to GME, but again this company has no structural problems that we’re aware of (can’t really say the same for movie theaters or mall-based retailers right now) and has actually been performing pretty well. Also, anything above 20% short interest is considered pretty high in the normal world. This level of short interest on a solid business smells like opportunity to squeeze out a couple of greedy hedge funds.\n2. **Limited liquidity and trading volume will make it difficult for shorts to cover** – Average 3-month daily trading volume of 1.4mm shares (roughly 1% of the float). It would take about *13+ DAYS* for the shorts to fully cover if they were to buy up all the average daily trading volume. Current $2bn market cap is also in the perfect sweet spot for the WSB pool of capital (especially since many of us have our tendies tied up in GME right now). If you’re looking for a bit of tendie diversification, this is the name.\n3. **The potential for a Gamma squeeze is all further upside** – There’s actually been option activity picking up on this company. ***On Friday, Nasdaq reported that call options for 2.6mm of underlying shares traded hands on TWNK. This is with limited mention of TWNK online thus far (based on my keyword search through reddit)****.* See [this report](https://www.nasdaq.com/articles/notable-friday-option-activity%3A-twnk-wdc-nvcr-2021-01-29). Most of those options were sold OTM at the $17.50 strike price. Things are moving quick here and we might not be the only ones that have sniffed out this opportunity. In order to create the biggest upside, buying the highest strike call option is ideal. As the price moves closer to ITM on those options, the market makers will have to buy more shares to hedge. The IV is still really low on this name.\n\n# Fundamental Thesis\n\n1. **Snacking continues to be king.** Large market, resilient, growing. 95% of U.S. adults snack daily, and the average American snacks 3x-5x per day. The snacking category generates \\~$150bn in annual sales and is expected to continue growing mid-single-digits driven by the need for convenience as consumers (at least pre-COVID-19) are busier than ever. Lots of room for multiple winners in the industry, of which I think Hostess will continue to be one.\n2. **Strong organic growth story**. Organic sales have grown \\~6% per year on average over the last number of years. Hostess Brands is growing – and likely gaining share.\n3. **Strong brand value and nostalgia factor with millennials.** Some of you might be old enough to remember this but during 2012, when the company filed for bankruptcy (due to the heavy debt burden from its buyout), consumers freaked out that the company would discontinue production of their beloved Twinkies, triggering a mad scramble to buy up all available supply of Twinkies. ***At the peak Twinkies sold on Ebay for $22,000 (see article*** [***here***](https://www.theatlantic.com/technology/archive/2012/11/on-ebay-the-starting-bid-for-a-single-twinkie-is-now-5-000/265346/)***).***\n4. **The acquisition of Voortman Cookies in 2020 rides the healthy snack trend.** Voortman sells crème wafers and sugar free cookies (new product categories for Hostess), and markets as having no artificial colors, no artificial flavors, no high-fructose corn syrup, and no trans-fat (playing the “better-for-you” snack trend). Voortman is one of the fastest growing independent sweet snacking brands of scale in North America, and should be able to accelerate growth by leveraging Hostess’ existing distribution footprint.\n5. **COVID-19 re-opening should drive a bounce-back in convenience store traffic, which is the company’s primary sales channel and may also increase demand as consumers become busy again (and thus snack more).** Management plans to keep growing within the convenience store channel, which is a growing end-market and should rebound as the world re-opens. As consumers get back to their busy pre-COVID-19 lives, they may also go back to snacking more out of convenience.\n\n# Potential Risks\n\n1. **Changing consumer preferences, especially to healthy.** The recent acquisition of Voortman Cookies in 2020 allows Hostess to further capitalize on the healthy trend.\n2. **Pretty high leverage for a public company.** They have roughly $950mm of net debt, or \\~4x leverage on Adj. EBITDA (Adj. EBITDA is a proxy for cash flow). This is pretty high leverage for a public company (but quite low in private equity land). Leverage increased to \\~4.5x in the beginning of 2020 after the acquisition of Voortman Cookies (up from \\~3.4x before the acquisition), but has steadily declined to \\~4x today as Adj. EBITDA has grown. Given their cash flow profile, would not be surprised to see them continue to deleverage.\n3. **Customer concentration.** The Company’s largest customer is Walmart, which was \\~24% of sales. Top ten customers accounted for \\~62% of sales in 2019. Some risk with customer concentration, but Hostess Brands is such a well-known and entrenched brand that I don’t think retail stores will do anything irrational.\n4. **Rebound of COVID-19.** Risk that COVID-19 cases rise again, possibly hurting traffic and sales through retail stores, increasing costs, or causing supply chain disruptions. On the flip side, the snack category seems to have held steady from consumers staying at home and snacking more.\n\n# Appendix\n\n* **TWNK Q3'20 investor presentation**: [Q3'20 Investor Presentation (November 2020)](https://www.hostessbrands.com/static-files/2a95b8c5-1127-4d0c-867b-d9437adc9036)\n* TWNK acquisition of Voortman Cookies investor presentation: [Acquisition of Voortman Cookies (December 2019)](https://www.hostessbrands.com/static-files/27c9ebfa-9448-4987-ae0f-b6b23c794ee6)\n* **Reference for TWNK short interest:** [Yahoo Finance](https://finance.yahoo.com/quote/TWNK/key-statistics?p=TWNK)\n* **Reference for AMC short interest of 10-15%:** [S3 Partners Tweet (1/29/21)](https://twitter.com/ihors3/status/1355987915105566721) and [AMC Short Interest Calculation](https://www.reddit.com/r/stocks/comments/l9cjuc/amc_short_interest_is_often_overstated_and/)\n* ***Disclaimer: I own a position in the Stock (TWNK); Warrants (TWNKW); August 20, 2021 $17.50 Call Options (TWNK210820C17.5); and August 20, 2021 $20.00 Call Options (TWNK210820C20)***\n* ***Disclaimer: This is not financial advice and is purely written for entertainment purposes. Please conduct your own diligence. Past performance is not indicative of future results.***\n\n# Conclusion\n\nIf you’re looking for a little tendie diversification or finding the next oversold stock, look no further. This stacks up as a much better opportunity than AMC or BB given the higher short interest and more stable business fundamentals. Also, we can also potentially create even more upside with a gamma squeeze if we are able to buy more call options at the high strike prices.\n\n***Again, this is not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade (and hopefully does not require much capital). Bringing this to your attention now before it starts to trade away from us or before the hedge funds exit their shorts. More than happy to hear any feedback from you guys.***",
        "subreddit": "wallstreetbets",
        "title": "Twinkies for Tendies: Long Thesis on Hostess Brands (TWNK) (Owner of Twinkies)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lahib2/twinkies_for_tendies_long_thesis_on_hostess/",
        "created": 1612250916.0
    },
    {
        "author": "POTUS-JebKush",
        "created_utc": 1612217235,
        "id": "lafmq2",
        "num_comments": 71,
        "num_crossposts": 0,
        "selftext": "# TL;DR\n\n**Hostess Brands (TWNK)** has high (\\~15%) short interest (more than AMC or BB) setting the stage for a short squeeze, additional upside from a gamma squeeze, is an iconic brand, AND has a fundamentally sound business with strong cash flows and organic growth trading at a reasonable valuation. ***Not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade.***\n\n[https://imgur.com/a/sUYpaue](https://imgur.com/a/sUYpaue)\n\n# Intro\n\nSup guys. So I know a bunch of us are now looking for the next big opportunity to pile into. Unfortunately we probably won’t see a squeeze of GME’s magnitude for awhile since that kind of short interest is insanely rare, but I think we might have found an opportunity that is pretty low hanging fruit AND is significantly better relative value than the other names people are piling into. It has what the finance community call “asymmetric upside” (more upside potential than downside risk), for the reasons I’ll describe below.\n\n**So what’s the target?** ***Hostess Brands (NASDAQ: TWNK)***. You probably know them as the company that makes Twinkies, but they also make Cupcakes, DingDongs, HoHos, Donettes and Zingers (can’t make this up)…\n\nFor some historical context, the company was private-equity owned for awhile and then went public in 2016. The previous owners have fully sold out now, so the entire shares outstanding are pretty much public float today and there’s no more downward pressure on the stock price from their share sales.\n\nThe company also has warrants from the their IPO (effectively long-dated call options) that trade under TWNKW. They trade as half warrants, so need two warrants to form one share and are ITM at $11.50 per one full share and expire in November 2021.\n\n**So what’s the thesis?** We think there’s an opportunity to wring out the short sellers in this name and potentially even further upside from a gamma squeeze if we can get enough call option volume. From a fundamental standpoint, the business is extremely stable (as it was a pretty ideal candidate for an LBO), and trades at a slight discount to its peers.\n\n# Technical Thesis\n\n1. **High short interest = squeeze opportunity** – Roughly 15% short interest today, higher than AMC which is last reported at 10-15% (see end of post for reference) and BB at 5-10%. This seems low in comparison to GME, but again this company has no structural problems that we’re aware of (can’t really say the same for movie theaters or mall-based retailers right now) and has actually been performing pretty well. Also, anything above 20% short interest is considered pretty high in the normal world. This level of short interest on a solid business smells like opportunity to squeeze out a couple of greedy hedge funds.\n2. **Limited liquidity and trading volume will make it difficult for shorts to cover** – Average 3-month daily trading volume of 1.4mm shares (roughly 1% of the float). It would take about *13+ DAYS* for the shorts to fully cover if they were to buy up all the average daily trading volume. Current $2bn market cap is also in the perfect sweet spot for the retail pool of capital. If you’re looking for a bit of diversification, this is the name.\n3. **The potential for a Gamma squeeze is all further upside** – There’s actually been option activity picking up on this company. ***On Friday, Nasdaq reported that call options for 2.6mm of underlying shares traded hands on TWNK. This is with limited mention of TWNK online thus far (based on my keyword search through reddit)****.* See [this report](https://www.nasdaq.com/articles/notable-friday-option-activity%3A-twnk-wdc-nvcr-2021-01-29). Most of those options were sold OTM at the $17.50 strike price. Things are moving quick here and we might not be the only ones that have sniffed out this opportunity. In order to create the biggest upside, buying the highest strike call option is ideal. As the price moves closer to ITM on those options, the market makers will have to buy more shares to hedge. The IV is still really low on this name.\n\n# Fundamental Thesis\n\n1. **Snacking continues to be king.** Large market, resilient, growing. 95% of U.S. adults snack daily, and the average American snacks 3x-5x per day. The snacking category generates \\~$150bn in annual sales and is expected to continue growing mid-single-digits driven by the need for convenience as consumers (at least pre-COVID-19) are busier than ever. Lots of room for multiple winners in the industry, of which I think Hostess will continue to be one.\n2. **Strong organic growth story**. Organic sales have grown \\~6% per year on average over the last number of years. Hostess Brands is growing – and likely gaining share.\n3. **Strong brand value and nostalgia factor with millennials.** Some of you might be old enough to remember this but during 2012, when the company filed for bankruptcy (due to the heavy debt burden from its buyout), consumers freaked out that the company would discontinue production of their beloved Twinkies, triggering a mad scramble to buy up all available supply of Twinkies. ***At the peak Twinkies sold on Ebay for $22,000 (see article*** [***here***](https://www.theatlantic.com/technology/archive/2012/11/on-ebay-the-starting-bid-for-a-single-twinkie-is-now-5-000/265346/)***).***\n4. **The acquisition of Voortman Cookies in 2020 rides the healthy snack trend.** Voortman sells crème wafers and sugar free cookies (new product categories for Hostess), and markets as having no artificial colors, no artificial flavors, no high-fructose corn syrup, and no trans-fat (playing the “better-for-you” snack trend). Voortman is one of the fastest growing independent sweet snacking brands of scale in North America, and should be able to accelerate growth by leveraging Hostess’ existing distribution footprint.\n5. **COVID-19 re-opening should drive a bounce-back in convenience store traffic, which is the company’s primary sales channel and may also increase demand as consumers become busy again (and thus snack more).** Management plans to keep growing within the convenience store channel, which is a growing end-market and should rebound as the world re-opens. As consumers get back to their busy pre-COVID-19 lives, they may also go back to snacking more out of convenience.\n\n# Potential Risks\n\n1. **Changing consumer preferences, especially to healthy.** The recent acquisition of Voortman Cookies in 2020 allows Hostess to further capitalize on the healthy trend.\n2. **Pretty high leverage for a public company.** They have roughly $950mm of net debt, or \\~4x leverage on Adj. EBITDA (Adj. EBITDA is a proxy for cash flow). This is pretty high leverage for a public company (but quite low in private equity land). Leverage increased to \\~4.5x in the beginning of 2020 after the acquisition of Voortman Cookies (up from \\~3.4x before the acquisition), but has steadily declined to \\~4x today as Adj. EBITDA has grown. Given their cash flow profile, would not be surprised to see them continue to deleverage.\n3. **Customer concentration.** The Company’s largest customer is Walmart, which was \\~24% of sales. Top ten customers accounted for \\~62% of sales in 2019. Some risk with customer concentration, but Hostess Brands is such a well-known and entrenched brand that I don’t think retail stores will do anything irrational.\n4. **Rebound of COVID-19.** Risk that COVID-19 cases rise again, possibly hurting traffic and sales through retail stores, increasing costs, or causing supply chain disruptions. On the flip side, the snack category seems to have held steady from consumers staying at home and snacking more.\n\n# Appendix\n\n* **TWNK Q3'20 investor presentation**: [Q3'20 Investor Presentation (November 2020)](https://www.hostessbrands.com/static-files/2a95b8c5-1127-4d0c-867b-d9437adc9036)\n* TWNK acquisition of Voortman Cookies investor presentation: [Acquisition of Voortman Cookies (December 2019)](https://www.hostessbrands.com/static-files/27c9ebfa-9448-4987-ae0f-b6b23c794ee6)\n* **Reference for TWNK short interest:** [Yahoo Finance](https://finance.yahoo.com/quote/TWNK/key-statistics?p=TWNK)\n* **Reference for AMC short interest of 10-15%:** [S3 Partners Tweet (1/29/21)](https://twitter.com/ihors3/status/1355987915105566721) and [AMC Short Interest Calculation](https://www.reddit.com/r/stocks/comments/l9cjuc/amc_short_interest_is_often_overstated_and/)\n* ***Disclaimer: I own a position in the Stock (TWNK); Warrants (TWNKW); August 20, 2021 $17.50 Call Options (TWNK210820C17.5); and August 20, 2021 $20.00 Call Options (TWNK210820C20)***\n* ***Disclaimer: This is not financial advice and is purely written for entertainment purposes. Please conduct your own diligence. Past performance is not indicative of future results.***\n\n# Conclusion\n\nIf you’re looking for a little diversification or finding the next oversold stock, look no further. This stacks up as a much better opportunity than AMC or BB given the higher short interest and more stable business fundamentals. Also, we can also potentially create even more upside with a gamma squeeze if we are able to buy more call options at the high strike prices.\n\n***Again, this is not intended to distract from other holdings you may have. This is purely a tangential opportunity that felt like way too obvious of a trade (and hopefully does not require much capital). Bringing this to your attention now before it starts to trade away from us or before the hedge funds exit their shorts. More than happy to hear any feedback from you guys.***",
        "subreddit": "stocks",
        "title": "Long Thesis on Hostess Brands (TWNK) (Owner of Twinkies)",
        "url": "https://www.reddit.com/r/stocks/comments/lafmq2/long_thesis_on_hostess_brands_twnk_owner_of/",
        "created": 1612246035.0
    },
    {
        "author": "CryoSaint",
        "created_utc": 1612244335,
        "id": "laolti",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "Long Thesis on Hostess Brands (TWNK) (Owner of Twinkies)\n\nI posted this TWNK long thesis in r/stocks, [here](https://www.reddit.com/r/stocks/comments/lafmq2/long_thesis_on_hostess_brands_twnk_owner_of/), but think it has a home in r/options as well given the 15% short interest, low IV, cheap options, and potential for gamma squeeze. Appreciate any and all thoughts.\n\n# TL;DR\n\n**Hostess Brands (TWNK)** has high (\\~15%) short interest (more than AMC or BB) setting the stage for a short squeeze, additional upside from a gamma squeeze, is an iconic brand, AND has a fundamentally sound business with strong cash flows and organic growth trading at a reasonable valuation. ***Not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade.***\n\n# Intro\n\nSup guys. So I know a bunch of us are now looking for the next big opportunity to pile into. Unfortunately we probably won’t see a squeeze of GME’s magnitude for awhile since that kind of short interest is insanely rare, but I think we might have found an opportunity that is pretty low hanging fruit AND is significantly better relative value than the other names people are piling into. It has what the finance community call “asymmetric upside” (more upside potential than downside risk), for the reasons I’ll describe below.\n\n**So what’s the target?** ***Hostess Brands (NASDAQ: TWNK)***. You probably know them as the company that makes Twinkies, but they also make Cupcakes, DingDongs, HoHos, Donettes and Zingers (can’t make this up)…\n\nFor some historical context, the company was private-equity owned for awhile and then went public in 2016. The previous owners have fully sold out now, so the entire shares outstanding are pretty much public float today and there’s no more downward pressure on the stock price from their share sales.\n\nThe company also has warrants from the their IPO (effectively long-dated call options) that trade under TWNKW. They trade as half warrants, so need two warrants to form one share and are ITM at $11.50 per one full share and expire in November 2021.\n\n**So what’s the thesis?** We think there’s an opportunity to wring out the short sellers in this name and potentially even further upside from a gamma squeeze if we can get enough call option volume. From a fundamental standpoint, the business is extremely stable (as it was a pretty ideal candidate for an LBO), and trades at a slight discount to its peers.\n\n# Technical Thesis\n\n1. **High short interest = squeeze opportunity** – Roughly 15% short interest today, higher than AMC which is last reported at 10-15% (see end of post for reference) and BB at 5-10%. This seems low in comparison to GME, but again this company has no structural problems that we’re aware of (can’t really say the same for movie theaters or mall-based retailers right now) and has actually been performing pretty well. Also, anything above 20% short interest is considered pretty high in the normal world. This level of short interest on a solid business smells like opportunity to squeeze out a couple of greedy hedge funds.\n2. **Limited liquidity and trading volume will make it difficult for shorts to cover** – Average 3-month daily trading volume of 1.4mm shares (roughly 1% of the float). It would take about *13+ DAYS* for the shorts to fully cover if they were to buy up all the average daily trading volume. Current $2bn market cap is also in the perfect sweet spot for the retail pool of capital. If you’re looking for a bit of diversification, this is the name.\n3. **The potential for a Gamma squeeze is all further upside** – There’s actually been option activity picking up on this company. ***On Friday, Nasdaq reported that call options for 2.6mm of underlying shares traded hands on TWNK. This is with limited mention of TWNK online thus far (based on my keyword search through reddit)****.* See [this report](https://www.nasdaq.com/articles/notable-friday-option-activity%3A-twnk-wdc-nvcr-2021-01-29). Most of those options were sold OTM at the $17.50 strike price. Things are moving quick here and we might not be the only ones that have sniffed out this opportunity. In order to create the biggest upside, buying the highest strike call option is ideal. As the price moves closer to ITM on those options, the market makers will have to buy more shares to hedge. The IV is still really low on this name.\n\n# Fundamental Thesis\n\n1. **Snacking continues to be king.** Large market, resilient, growing. 95% of U.S. adults snack daily, and the average American snacks 3x-5x per day. The snacking category generates \\~$150bn in annual sales and is expected to continue growing mid-single-digits driven by the need for convenience as consumers (at least pre-COVID-19) are busier than ever. Lots of room for multiple winners in the industry, of which I think Hostess will continue to be one.\n2. **Strong organic growth story**. Organic sales have grown \\~6% per year on average over the last number of years. Hostess Brands is growing – and likely gaining share.\n3. **Strong brand value and nostalgia factor with millennials.** Some of you might be old enough to remember this but during 2012, when the company filed for bankruptcy (due to the heavy debt burden from its buyout), consumers freaked out that the company would discontinue production of their beloved Twinkies, triggering a mad scramble to buy up all available supply of Twinkies. ***At the peak Twinkies sold on Ebay for $22,000 (see article*** [***here***](https://www.theatlantic.com/technology/archive/2012/11/on-ebay-the-starting-bid-for-a-single-twinkie-is-now-5-000/265346/)***).***\n4. **The acquisition of Voortman Cookies in 2020 rides the healthy snack trend.** Voortman sells crème wafers and sugar free cookies (new product categories for Hostess), and markets as having no artificial colors, no artificial flavors, no high-fructose corn syrup, and no trans-fat (playing the “better-for-you” snack trend). Voortman is one of the fastest growing independent sweet snacking brands of scale in North America, and should be able to accelerate growth by leveraging Hostess’ existing distribution footprint.\n5. **COVID-19 re-opening should drive a bounce-back in convenience store traffic, which is the company’s primary sales channel and may also increase demand as consumers become busy again (and thus snack more).** Management plans to keep growing within the convenience store channel, which is a growing end-market and should rebound as the world re-opens. As consumers get back to their busy pre-COVID-19 lives, they may also go back to snacking more out of convenience.\n\n# Potential Risks\n\n1. **Changing consumer preferences, especially to healthy.** The recent acquisition of Voortman Cookies in 2020 allows Hostess to further capitalize on the healthy trend.\n2. **Pretty high leverage for a public company.** They have roughly $950mm of net debt, or \\~4x leverage on Adj. EBITDA (Adj. EBITDA is a proxy for cash flow). This is pretty high leverage for a public company (but quite low in private equity land). Leverage increased to \\~4.5x in the beginning of 2020 after the acquisition of Voortman Cookies (up from \\~3.4x before the acquisition), but has steadily declined to \\~4x today as Adj. EBITDA has grown. Given their cash flow profile, would not be surprised to see them continue to deleverage.\n3. **Customer concentration.** The Company’s largest customer is Walmart, which was \\~24% of sales. Top ten customers accounted for \\~62% of sales in 2019. Some risk with customer concentration, but Hostess Brands is such a well-known and entrenched brand that I don’t think retail stores will do anything irrational.\n4. **Rebound of COVID-19.** Risk that COVID-19 cases rise again, possibly hurting traffic and sales through retail stores, increasing costs, or causing supply chain disruptions. On the flip side, the snack category seems to have held steady from consumers staying at home and snacking more.\n\n# Appendix\n\n* **TWNK Q3'20 investor presentation**: [Q3'20 Investor Presentation (November 2020)](https://www.hostessbrands.com/static-files/2a95b8c5-1127-4d0c-867b-d9437adc9036)\n* TWNK acquisition of Voortman Cookies investor presentation: [Acquisition of Voortman Cookies (December 2019)](https://www.hostessbrands.com/static-files/27c9ebfa-9448-4987-ae0f-b6b23c794ee6)\n* **Reference for TWNK short interest:** [Yahoo Finance](https://finance.yahoo.com/quote/TWNK/key-statistics?p=TWNK)\n* **Reference for AMC short interest of 10-15%:** [S3 Partners Tweet (1/29/21)](https://twitter.com/ihors3/status/1355987915105566721) and [AMC Short Interest Calculation](https://www.reddit.com/r/stocks/comments/l9cjuc/amc_short_interest_is_often_overstated_and/)\n* ***Disclaimer: I own a position in the Stock (TWNK); Warrants (TWNKW); August 20, 2021 $17.50 Call Options (TWNK210820C17.5); and August 20, 2021 $20.00 Call Options (TWNK210820C20)*** \n* ***Disclaimer: This is not financial advice and is purely written for entertainment purposes. Please conduct your own diligence. Past performance is not indicative of future results.***\n\n# Conclusion\n\nIf you’re looking for a little diversification or finding the next oversold stock, look no further. This stacks up as a much better opportunity than AMC or BB given the higher short interest and more stable business fundamentals. Also, we can also potentially create even more upside with a gamma squeeze if we are able to buy more call options at the high strike prices.\n\n***Again, this is not intended to distract from other holdings you may have. This is purely a tangential opportunity that felt like way too obvious of a trade (and hopefully does not require much capital). Bringing this to your attention now before it starts to trade away from us or before the hedge funds exit their shorts. More than happy to hear any feedback from you guys.***",
        "subreddit": "wallstreetbets",
        "title": "Great info on TWNK. I did not write this!! Just copied..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/laolti/great_info_on_twnk_i_did_not_write_this_just/",
        "created": 1612273135.0
    },
    {
        "author": "POTUS-JebKush",
        "created_utc": 1612218859,
        "id": "lag9pd",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "I posted this TWNK long thesis in r/stocks, [here](https://www.reddit.com/r/stocks/comments/lafmq2/long_thesis_on_hostess_brands_twnk_owner_of/), but think it has a home in r/options as well given the 15% short interest, low IV, cheap options, and potential for gamma squeeze. Appreciate any and all thoughts.\n\n# TL;DR\n\n**Hostess Brands (TWNK)** has high (\\~15%) short interest (more than AMC or BB) setting the stage for a short squeeze, additional upside from a gamma squeeze, is an iconic brand, AND has a fundamentally sound business with strong cash flows and organic growth trading at a reasonable valuation. ***Not intended to distract from HOLDING THE LINE ON GME. This is purely a tangential opportunity that felt like way too obvious of a trade.***\n\n[https://imgur.com/a/sUYpaue](https://imgur.com/a/sUYpaue)\n\n\n# Intro\n\nSup guys. So I know a bunch of us are now looking for the next big opportunity to pile into. Unfortunately we probably won’t see a squeeze of GME’s magnitude for awhile since that kind of short interest is insanely rare, but I think we might have found an opportunity that is pretty low hanging fruit AND is significantly better relative value than the other names people are piling into. It has what the finance community call “asymmetric upside” (more upside potential than downside risk), for the reasons I’ll describe below.\n\n**So what’s the target?** ***Hostess Brands (NASDAQ: TWNK)***. You probably know them as the company that makes Twinkies, but they also make Cupcakes, DingDongs, HoHos, Donettes and Zingers (can’t make this up)…\n\nFor some historical context, the company was private-equity owned for awhile and then went public in 2016. The previous owners have fully sold out now, so the entire shares outstanding are pretty much public float today and there’s no more downward pressure on the stock price from their share sales.\n\nThe company also has warrants from the their IPO (effectively long-dated call options) that trade under TWNKW. They trade as half warrants, so need two warrants to form one share and are ITM at $11.50 per one full share and expire in November 2021.\n\n**So what’s the thesis?** We think there’s an opportunity to wring out the short sellers in this name and potentially even further upside from a gamma squeeze if we can get enough call option volume. From a fundamental standpoint, the business is extremely stable (as it was a pretty ideal candidate for an LBO), and trades at a slight discount to its peers.\n\n# Technical Thesis\n\n1. **High short interest = squeeze opportunity** – Roughly 15% short interest today, higher than AMC which is last reported at 10-15% (see end of post for reference) and BB at 5-10%. This seems low in comparison to GME, but again this company has no structural problems that we’re aware of (can’t really say the same for movie theaters or mall-based retailers right now) and has actually been performing pretty well. Also, anything above 20% short interest is considered pretty high in the normal world. This level of short interest on a solid business smells like opportunity to squeeze out a couple of greedy hedge funds.\n2. **Limited liquidity and trading volume will make it difficult for shorts to cover** – Average 3-month daily trading volume of 1.4mm shares (roughly 1% of the float). It would take about *13+ DAYS* for the shorts to fully cover if they were to buy up all the average daily trading volume. Current $2bn market cap is also in the perfect sweet spot for the retail pool of capital. If you’re looking for a bit of diversification, this is the name.\n3. **The potential for a Gamma squeeze is all further upside** – There’s actually been option activity picking up on this company. ***On Friday, Nasdaq reported that call options for 2.6mm of underlying shares traded hands on TWNK. This is with limited mention of TWNK online thus far (based on my keyword search through reddit)****.* See [this report](https://www.nasdaq.com/articles/notable-friday-option-activity%3A-twnk-wdc-nvcr-2021-01-29). Most of those options were sold OTM at the $17.50 strike price. Things are moving quick here and we might not be the only ones that have sniffed out this opportunity. In order to create the biggest upside, buying the highest strike call option is ideal. As the price moves closer to ITM on those options, the market makers will have to buy more shares to hedge. The IV is still really low on this name.\n\n# Fundamental Thesis\n\n1. **Snacking continues to be king.** Large market, resilient, growing. 95% of U.S. adults snack daily, and the average American snacks 3x-5x per day. The snacking category generates \\~$150bn in annual sales and is expected to continue growing mid-single-digits driven by the need for convenience as consumers (at least pre-COVID-19) are busier than ever. Lots of room for multiple winners in the industry, of which I think Hostess will continue to be one.\n2. **Strong organic growth story**. Organic sales have grown \\~6% per year on average over the last number of years. Hostess Brands is growing – and likely gaining share.\n3. **Strong brand value and nostalgia factor with millennials.** Some of you might be old enough to remember this but during 2012, when the company filed for bankruptcy (due to the heavy debt burden from its buyout), consumers freaked out that the company would discontinue production of their beloved Twinkies, triggering a mad scramble to buy up all available supply of Twinkies. ***At the peak Twinkies sold on Ebay for $22,000 (see article*** [***here***](https://www.theatlantic.com/technology/archive/2012/11/on-ebay-the-starting-bid-for-a-single-twinkie-is-now-5-000/265346/)***).***\n4. **The acquisition of Voortman Cookies in 2020 rides the healthy snack trend.** Voortman sells crème wafers and sugar free cookies (new product categories for Hostess), and markets as having no artificial colors, no artificial flavors, no high-fructose corn syrup, and no trans-fat (playing the “better-for-you” snack trend). Voortman is one of the fastest growing independent sweet snacking brands of scale in North America, and should be able to accelerate growth by leveraging Hostess’ existing distribution footprint.\n5. **COVID-19 re-opening should drive a bounce-back in convenience store traffic, which is the company’s primary sales channel and may also increase demand as consumers become busy again (and thus snack more).** Management plans to keep growing within the convenience store channel, which is a growing end-market and should rebound as the world re-opens. As consumers get back to their busy pre-COVID-19 lives, they may also go back to snacking more out of convenience.\n\n# Potential Risks\n\n1. **Changing consumer preferences, especially to healthy.** The recent acquisition of Voortman Cookies in 2020 allows Hostess to further capitalize on the healthy trend.\n2. **Pretty high leverage for a public company.** They have roughly $950mm of net debt, or \\~4x leverage on Adj. EBITDA (Adj. EBITDA is a proxy for cash flow). This is pretty high leverage for a public company (but quite low in private equity land). Leverage increased to \\~4.5x in the beginning of 2020 after the acquisition of Voortman Cookies (up from \\~3.4x before the acquisition), but has steadily declined to \\~4x today as Adj. EBITDA has grown. Given their cash flow profile, would not be surprised to see them continue to deleverage.\n3. **Customer concentration.** The Company’s largest customer is Walmart, which was \\~24% of sales. Top ten customers accounted for \\~62% of sales in 2019. Some risk with customer concentration, but Hostess Brands is such a well-known and entrenched brand that I don’t think retail stores will do anything irrational.\n4. **Rebound of COVID-19.** Risk that COVID-19 cases rise again, possibly hurting traffic and sales through retail stores, increasing costs, or causing supply chain disruptions. On the flip side, the snack category seems to have held steady from consumers staying at home and snacking more.\n\n# Appendix\n\n* **TWNK Q3'20 investor presentation**: [Q3'20 Investor Presentation (November 2020)](https://www.hostessbrands.com/static-files/2a95b8c5-1127-4d0c-867b-d9437adc9036)\n* TWNK acquisition of Voortman Cookies investor presentation: [Acquisition of Voortman Cookies (December 2019)](https://www.hostessbrands.com/static-files/27c9ebfa-9448-4987-ae0f-b6b23c794ee6)\n* **Reference for TWNK short interest:** [Yahoo Finance](https://finance.yahoo.com/quote/TWNK/key-statistics?p=TWNK)\n* **Reference for AMC short interest of 10-15%:** [S3 Partners Tweet (1/29/21)](https://twitter.com/ihors3/status/1355987915105566721) and [AMC Short Interest Calculation](https://www.reddit.com/r/stocks/comments/l9cjuc/amc_short_interest_is_often_overstated_and/)\n* ***Disclaimer: I own a position in the Stock (TWNK); Warrants (TWNKW); August 20, 2021 $17.50 Call Options (TWNK210820C17.5); and August 20, 2021 $20.00 Call Options (TWNK210820C20)*** \n* ***Disclaimer: This is not financial advice and is purely written for entertainment purposes. Please conduct your own diligence. Past performance is not indicative of future results.***\n\n# Conclusion\n\nIf you’re looking for a little diversification or finding the next oversold stock, look no further. This stacks up as a much better opportunity than AMC or BB given the higher short interest and more stable business fundamentals. Also, we can also potentially create even more upside with a gamma squeeze if we are able to buy more call options at the high strike prices.\n\n***Again, this is not intended to distract from other holdings you may have. This is purely a tangential opportunity that felt like way too obvious of a trade (and hopefully does not require much capital). Bringing this to your attention now before it starts to trade away from us or before the hedge funds exit their shorts. More than happy to hear any feedback from you guys.***",
        "subreddit": "options",
        "title": "Long Thesis on Hostess Brands (TWNK) (Owner of Twinkies)",
        "url": "https://www.reddit.com/r/options/comments/lag9pd/long_thesis_on_hostess_brands_twnk_owner_of/",
        "created": 1612247659.0
    },
    {
        "author": "HowDoesIStonks",
        "created_utc": 1612942430,
        "id": "lgom07",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I love sustainability SPACs and have already bought into most of them. So I've been looking around for more near NAV SPACs which might target an ESG or sustainability focused company and I found these four. They all have ESG mandates and/or are considering sustainability focused companies, however many are also considering other sectors as well, like FinTech, so they aren't guaranteed to go green. All are currently trading between $10-11.\n\n# ARBG : Aequi Acquisition Corp.\n\n&gt;We expect to favor potential technologically driven target companies in the consumer industry. In addition, a target company must demonstrate a dedication to Diversity, Equity and Inclusion (“DE&amp;I”) and strong Environmental, Social and Governance (“ESG”) principles. \\[...\\]  \n&gt;  \n&gt;Our acquisition and value creation strategy is to acquire a data-centric, growth-orientated consumer company in a sector such as, retail, education, financial technology, media &amp; gaming, healthcare &amp; wellness, legal, and/or procurement &amp; eco-friendly packaging.\n\nAlso\n\n&gt;In addition, our sponsor is committing to donate 10% of the founder shares it holds to advance social and economic mobility following the consummation of the initial business combination.\n\nI think that's really cool and shows they are probably serious about ESG and not just ESGwashing.\n\nLeadership: Hope S. Taitz, CEO of ELY Capital, Co-founder of Catalyst Partners, former BOD Girls Who Code. Joy Seppala, founder of SISU Capital. Previously Head of the Special Situations Investment Group at Banque Paribas.\n\n# PIAI : Prime Impact Acquisition I\n\n&gt;We believe that advances in Artificial Intelligence (AI), machine learning, cloud computing, mobile applications, automation throughout global supply chains, clean energy solutions, autonomous vehicles and the consumer and industrial IoT will drive sustained growth and accelerate the digital transformation of the enterprise and lead to significant value creation. The development and application of these new technologies are expected to create massive opportunities within new and existing sectors, such as technology, media and telecom (TMT), medicine and healthcare (Med Tech) and traditional industries (Industrial Tech).  \\[...\\]  \n&gt;  \n&gt;It is our goal to acquire companies that can evolve to exploit the opportunities and navigate the challenges of the complex, data-centric global economy. We will target companies that are benefiting from the disruptive impact of new technologies and the continuing growth in developing markets, such as China and India.  \n&gt;  \n&gt;We intend to drive long-term growth and build a successful public company through disciplined strategic execution and a commitment to environmental sustainability, social responsibility and strong corporate governance (ESG).\n\nLeadership: Mike Cordano, former President and COO of Western Digital Corporation. Mark Long, former CFO of Western Digital Corporation. Jim McLean, founder of Silicon Valley Data Capital.\n\n# MLAC : Malacca Straits Acquisition Co Ltd\n\n&gt;Our business strategy is to identify and complete our initial business combination with a company which is currently part of a Southeast Asian business conglomerate in the media, food processing, renewable energy and healthcare industries, though we will also look for opportunities outside these sectors, which we believe can be positioned for success in Southeast Asian markets as well as other markets in Asia and beyond, which is complementary to the experience of our management team.\n\nLeadership: Kenneth Ng, founder of Ark Pacific Capital Management Limited, ED of Sprint Power Technology Limited, an EV consulting and engineering services company. Previously ED of Elliott Advisors (HK) Limited, Hong Kong arm of the hedge fund Elliott Associates. Stanley Wang, founder of K2 Venture Capital Company Limited, which invests in Southeast Asian FinTech and AI companies.\n\n# AVAN : Avanti Acquisition Corp.\n\n&gt;Consistent with our strategy, we have identified the following general criteria and guidelines which we believe are important in evaluating potential target businesses. We intend to seek to acquire companies that we believe: have a clear European focus; have an identifiable current and/or future nexus with the United States making them suitable for a NYSE listing; \\[...\\] Based in part on the above general criteria and guidelines, we do not currently expect to consider target businesses that operate primarily in the following sectors: Real Estate; Banking and Insurance, except Fintech companies; Natural Resources and Infrastructure, except renewable sources of energy companies; Biotech; and Pure Media, Publishing and Advertising, except new business model or Tech angle companies.\n\nAlso an ESG mention\n\n&gt;NNS Group and Sienna Capital share the same business principles and investment approach, which include: seeking sustainable growth of portfolio assets and ultimately long-term value creation through consistent and disciplined implementation of environmental, social and governance principles and sustainable business practices;\n\nLeadership: Nassef Sawiris, founder NNS Group, former CEO of OCI NV and Orascom Construction Industries SAE. Colin Hall, former CEO  of Sienna Capital.\n\nDisclaimer: It's not a sure thing that any of these SPACs will target a green company. I am not a financial advisor. Disclosure: I bought 10 commons 50 warrants of each.",
        "subreddit": "SPACs",
        "title": "Four near NAV SPACs considering ESG and green targets",
        "url": "https://www.reddit.com/r/SPACs/comments/lgom07/four_near_nav_spacs_considering_esg_and_green/",
        "created": 1612971230.0
    },
    {
        "author": "STVMAIN",
        "created_utc": 1612188145,
        "id": "la3pea",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "some really cheap stocks $SDC, $ENDP, $WDC ,$BB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/la3pea/some_really_cheap_stocks_sdc_endp_wdc_bb/",
        "created": 1612216945.0
    },
    {
        "author": "newyorkcash",
        "created_utc": 1612453417,
        "id": "lcies7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "WDC price target raised by Baird to $85 from $50.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lcies7/wdc_price_target_raised_by_baird_to_85_from_50/",
        "created": 1612482217.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1614778597,
        "id": "lwu16p",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to Wednesday! Here are your pre-market stock movers &amp; news on this Wednesday, March 3rd, 2021-\n\n*****\n\n# [5 things to know before the stock market opens Wednesday](https://www.cnbc.com/2021/03/03/5-things-to-know-before-the-stock-market-opens-march-3-2021.html)\n\n*****\n\n&gt; # 1. Dow futures jump after Tuesday’s early gain fizzles and reverses\n\n&gt; * The Dow is set to rise 200 points Wednesday after late-day selling reversed strong gains earlier in Tuesday’s session. Coming off their best days since November, the 30-stock average Tuesday fell 0.5% and the Nasdaq dropped 1.7% as tech stocks pulled back. The S&amp;P 500 slid 0.8%, a day after its biggest one-day advance since June.\n\n&gt; * The latest ADP report on private sector employment is set for release at 8:30 a.m. ET, one hour before Wall Street’s open. U.S. companies are expected to have added 225,000 new jobs in February compared to January of gains 174,000 positions. The ADP lately has not been the best predictor of the government’s monthly jobs report, which comes out Friday.\n\n*****\n\n&gt; # 2. Senate to begin debate soon on $1.9 trillion Covid relief bill\n\n&gt; * The Senate is expected to start debate as soon as Wednesday on its version of the House-passed, $1.9 trillion Covid relief bill. However, it excludes a federal minimum wage boost to $15 per hour. President Joe Biden on Tuesday urged Democrats to stand united and approve the measure, even as some party moderates sought to dial back parts of the package. Democrats, with the slimmest of margins in the Senate, are using special rules that would allow them to pass the bill without GOP support.\n\n*****\n\n&gt; # 3. U.S. will have enough Covid vaccines for ‘every adult’ by end of May\n\n&gt; * The U.S. will have a large enough supply of coronavirus vaccines to inoculate “every adult in America” by the end of May, two months earlier than previously expected, Biden said at the White House on Tuesday. The announcement came as the administration works to increase production of Johnson &amp; Johnson’s newly cleared single-shot vaccine, and rival Merck agrees to pitch in.\n\n&gt; * The Republican governors of Texas and Mississippi both announced Tuesday that they’re lifting mask mandates in their states and allowing businesses to reopen at full capacity even as the decline in new daily Covid-19 cases slows. CDC Director Dr. Rochelle Walensky on Monday warned states against lifting public health restrictions too quickly.\n\n*****\n\n&gt; # 4. America’s biggest firms push for path to citizenship for ‘Dreamers’\n\n&gt; * America’s biggest companies are urging Congress to establish a permanent path to citizenship for undocumented immigrants brought to the U.S. as children. In a letter Wednesday, a coalition of more than 100 companies and trade associations — including Facebook, General Motors, Marriott, Target, Visa and Uber — asked Senate leaders Chuck Schumer, D-N.Y., and Mitch McConnell, R-Ky., to pass the bipartisan Dream Act of 2021. The move comes as Biden and Democrats on Capitol Hill look to immigration as a major legislative priority.\n\n*****\n\n&gt; # 5. Stocks to watch: Rocket Companies, Las Vegas Sands, Oscar Health\n\n&gt; * Rocket Companies fell 6% in Wednesday’s premarket trading after more than doubling over the past three sessions. On Tuesday, the Quicken Loans and Rocket Mortgage parent surged over 71% on no apparent news. The heavily shorted stock appears to have garnered bullish interest from day traders on Reddit’s WallStreetBets forum.\n\n&gt; * Casino operator Las Vegas Sands said Wednesday it would sell its Vegas real estate and operations to private equity giant Apollo Global Management for about $6.25 billion. The properties include the Venetian Resort Las Vegas and the Sands Expo and Convention Center. Shares of Las Vegas Sands were up almost 3% in the premarket. Apollo fell nearly 1%.\n\n&gt; * Oscar Health is set to debut Wednesday on the New York Stock Exchange. The health insurance startup backed by Google-parent Alphabet priced its initial public offering Tuesday evening at $39 per share, above the already-raised expected range of $36 to $38. The IPO gives Oscar Health a market value of $7.7 billion ahead of trading.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mFJEZLD.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/DZktsvp.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #1!](https://i.postimg.cc/Yq2hHN9S/econcal1.png)**)\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #2!](https://i.postimg.cc/FFV78Chq/econcal2.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zRvHdP7.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/PbURZ3R.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/oqzviWR.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/HGdMXO8.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/978P5c5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK!](https://i.imgur.com/2Ltoqja.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.postimg.cc/d0wfH06g/upgradesdowngrades1.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.postimg.cc/52wGSzBw/upgradesdowngrades2.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.postimg.cc/nh8gm2DF/upgradesdowngrades3.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/85n5bWw.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/3PemF5S.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/0YIFXZl.png)**)\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/03/03/stocks-making-the-biggest-moves-in-the-premarket-lyft-las-vegas-sands-wendys-more.html)**)\n\n*****\n\n&gt; **Lyft (LYFT)** – The ride-hailing company said that last week saw the highest level of ride volume since the pandemic took hold last March. As a result, Lyft expects to report a smaller quarterly loss than it had previously projected. Lyft shares jumped 5.6% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** LYFT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LYFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LYFT)**)\n\n*****\n\n&gt; **Las Vegas Sands (LVS)** – The casino operator’s shares rose 3% in the premarket after it announced a deal to sell its Las Vegas properties to private-equity firms Apollo Global (APO) and VICI Properties for $6.25 billion. The sale includes The Venetian Resort Las Vegas and the Sands Expo and Convention Center. Apollo Global shares gained 2.1%.\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n&gt; **Wendy’s (WEN)** – The restaurant chain missed estimates by a penny a share, with quarterly earnings of 17 cents per share. Revenue came in short of forecasts as well. Global comparable sales rose 4.7%, shy of the FactSet consensus estimate of 5.7% due primarily to international weakness. Its shares fell 3.3% in the premarket.\n\n&gt; #**STOCK SYMBOL:** WEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WEN)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** – The discount retailer earned $2.13 per share for the fourth quarter, beating estimates by 2 cents a share. Revenue essentially was in line with expectations. Comparable-store sales rose 4.9%, short of the 5.5% estimate of analysts surveyed by FactSet. The company’s shares fell 2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **Hewlett Packard Enterprise (HPE)** – HPE beat estimates by 11 cents a share, with quarterly earnings of 52 cents per share. The enterprise computing hardware maker’s revenue came in above forecasts as well. The company issued strong guidance for both the current quarter and full year, as it continues to benefit from the pandemic-inspired digital transformation.\n\n&gt; #**STOCK SYMBOL:** HPE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HPE)**)\n\n*****\n\n&gt; **Box (BOX)** – Box reported quarterly earnings of 22 cents per share, 5 cents a share above estimates. Revenue beat projections as well. The online data storage company also issued a better-than-expected full-year outlook and expects that the current quarter will see revenue above $200 million for the first time.\n\n&gt; #**STOCK SYMBOL:** BOX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BOX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BOX)**)\n\n*****\n\n&gt; **Nordstrom (JWN)** – Nordstrom earned 21 cents per share for its latest quarter, 7 cents a share above estimates. The retailer also reported better-than-expected revenue. Nordstrom was helped by a boost in digital sales as well as growth in its off-price operation, but the retailer warned that it would have to clear excess holiday inventory through that off-price channel. Shares fell 2.6% in premarket action.\n\n&gt; #**STOCK SYMBOL:** JWN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=JWN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/JWN)**)\n\n*****\n\n&gt; **FuboTV (FUBO)** – FuboTV reported quarterly revenue in excess of $100 million for the first time, with the live sports streaming company reporting a better-than-expected $105.1 million in sales. Subscriber numbers jumped 73% from a year earlier to a total of 548,000. Its shares fell 4% in the premarket, however, following a nearly 50% year-to-date jump.\n\n&gt; #**STOCK SYMBOL:** FUBO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FUBO)**)\n\n*****\n\n&gt; **Rocket Companies (RKT)** – Rocket shares have been volatile in premarket trading after more than doubling over the past three sessions. The Quicken Loans and Rocket Mortgage parent has been garnering increasing attention in online forums, with investors noting the high level of short interest. Rocket shares fell 5.5% in premarket action.\n\n&gt; #**STOCK SYMBOL:** RKT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RKT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RKT)**)\n\n*****\n\n&gt; **Urban Outfitters (URBN)** – Urban Outfitters beat estimates by 2 cents a share, with quarterly earnings of 30 cents per share. The apparel retailer’s revenue fell slightly below Wall Street forecasts, however, and gross profit margins dropped more than 3 percentage points from a year earlier. Its shares fell 1.6% in the premarket.\n\n&gt; #**STOCK SYMBOL:** URBN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=URBN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/URBN)**)\n\n*****\n\n&gt; **Ross Stores (ROST)** – Ross Stores sank 3.1% in the premarket after it reported quarterly earnings of 67 cents per share, below the $1.00 a share consensus estimate. The discount retailer’s revenue came in below estimates as well, hurt by pandemic-related store closures in California.\n\n&gt; #**STOCK SYMBOL:** ROST\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ROST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ROST)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, March 3rd, 2021! :)**",
        "subreddit": "stocks",
        "title": "(3/3) Wednesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/stocks/comments/lwu16p/33_wednesdays_premarket_stock_movers_news/",
        "created": 1614807397.0
    },
    {
        "author": "Puzzleheaded_Web_551",
        "created_utc": 1614806345,
        "id": "lx4mu4",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": " \n\nI imported SIMM (Single Inline Memory Modules), between 1994 and 2006, for my branded computers.\n\nIn that time period, I watched the \"chip\" market more than I did the precious metals market - they moved daily and prices for each type of module was set by noon, each day.\n\nMy companies imported tens of thousands of SIMMs from Singapore, Taiwan, China, Spain, and a few other countries. The paperwork required at customs, in Anchorage, was due to an \"Anti Dumping Tax\". This was to prevent North Korean manufactured chips to be imported (as it should be). At the time, Goldstar became a producer of IC (Integrated Circuitry), chips as it could not keep up with the television innovations. BUT... Goldstar was a SOUTH Korean company, with no embargo, yet monitored closely. Thy produced a great product, however, they were also counterfeited easier and therefore, \"a radioactive\" product.\n\n&gt;***Side Note:***\n\nLG Semicon LLC, was a producer, specializing in IC chips. One company bought the other and both Goldstar and LG Semicon became what we now know as LG.\n\nBack in those days tracking the manufacturing of chips was crucial (no pun intended), because of the daily swing of the prices. The determining factors (which I looked at), were :\n\n* Production capacity of each factory.\n* Daily production numbers of computers.\n* Intel ($INTC), AMD, ($AMD), Microsoft ($MSFT), Compaq, HP ($HP - Hewlett Packard, at one time, \"absorbed\" Packard Bell Computers), and other mass consumers/assemblers of IC chips for PCBs (Printed Circuit Board), including details of motherboard designs and IC requirements.\n* Mother Nature and her wrath \"overseas\".\n\nThe computer makers, DELL ($DELL), Gateway, and Compaq always had first choice of available chips, due to their deep pockets and demand.\n\nA few companies in Asian countries figured out that by closing a factory, for a day or a week, they could, effectively, increase their profits quickly. This effected the entire \"Technology Sector\", although it did not exist yet.\n\n&gt;**Points:**\n\n* Always ask \"Why\".\n* \"Due Diligence\" is not just 2 levels deep. Sometimes you have to find out who is selling the sand/silica, first.\n* In this market, \"What goes down, usually comes up\". Write that down.\n* VIVA LA #REDDIT AND FREE TRADE !!",
        "subreddit": "wallstreetbets",
        "title": "CHIP SHORTTAGE - REAL OR MEMOREX",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx4mu4/chip_shorttage_real_or_memorex/",
        "created": 1614835145.0
    },
    {
        "author": "whereismynut",
        "created_utc": 1614715571,
        "id": "lwb7id",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": " You may be seeing that this company is down today but I believe that because the hype from the recent boom is blowing over. I have some updated comments from users below so give them credit.  \n\n**PLEASE BE AWARE OF FEES FROM FIDELITY AND OTHER BROKERAGES.** ETrade currently has a 5 dollar fee. (fair imo) (just trying to be transparent from what I read up on recently.)\n\n&amp;#x200B;\n\nbasically, copy and paste of  recently published end of Quarter Highlights and my previous post from last week.\n\n&gt;• \t $1.6m Mooring Tensioner project led by Carnegie awarded funding by  Blue  Economy Cooperative Research Centre and formally commences with  project  partner  \n•\tHewlett Packard  Enterprise Company  (HPE) and Carnegie sign Collaboration Agreement to  develop reinforcement  learning-based controller for CETO and commence  work  \n•\tMicrosoft awards Carnegie  with an AI for Earth grant providing  computational resources and  support for a project to enhance Carnegie’s  Wave Predictor   \n• \tOceantera, a southeast Asian  project developer, and Carnegie sign  Collaboration Agreement to explore  potential projects in SE Asia and  share knowledge and expertise  \n•\t Hydrogen opportunities explored and further knowledge developed  through  ongoing internal investigations and via industry relationships  \n• \tGarden Island Microgrid resumes operation following temporary   disconnection required for Department of Defence’s own electrical   upgrades  \n•\tEuropean Commission  releases new EU  Strategy on Offshore Renewable Energy supporting a  vision of at least  1000 MW of ocean energy by 2030 and 60 GW by 2050\n\nI encourage you guys to read their quarterly report.\n\n[https://www.carnegiece.com/portfolio/quarterly-activities-report-4/](https://www.carnegiece.com/portfolio/quarterly-activities-report-4/)\n\nthey're  investing to integrate their technology, reduce costs on their own  tech, and on creating energy. (that's my own understanding.) for  example,\n\n&gt;Hydrogen  opportunities were investigated during the quarter and continue with a  growing interest in the space from industry and government. The  synergies between wave energy and hydrogen production strengthen  productionstrengthen the case and Carnegie has been particularly focused  on opportunities that encompass existing target markets such as  islands,  remote areas, and marine energy consumers including fish  farming. In parallel, enabling technologies are being developed by a  variety of companies that are complementary to Carnegie’s activities.   For example, electrolyzers,  the  devices  that  produce  hydrogen  from   water and  electricity,  are being developed can now use seawater as  their hydrogen source rather than freshwater  \nHydrogen   is most likely to play a  role as long/medium-term storage or as a   fuel source for vessels and generators. Carnegie’s role in the Blue  Economy CRCis providing good insight into the topic of hydrogen in the  marine space and opportunities will continue to be identified.\n\nthis  is basically a long-term play and they will specify it in there as  well. Imo I see the demand for renewable energy. I feel like there will  be heavy reform on how Companies and consumers use energy in the  following 50 years. they specify that in the report.\n\n&gt;Carnegie  continues to seegrowing vision and support for offshore renewables  around the world as demonstrated by actions such as the European  Commission publishing a dedicated EU strategy on offshore renewable  energyin November 2020(An EU Strategy to harness thepotential  of   offshore  renewable  energy  for  a  climate  neutral  future). The EU’s  strategysupports an objective of achievingat least1 GW of ocean energy  by 2030 and 60 GW of oceanenergy  by  2050.  It  alsoproposes  a   strategyto  make  offshore  renewable  energy  a  corecomponent of  Europe’s energy system by 2050.In  the  US,the  new  President  has   significantly  elevated  the  issue  of  climate  change  withrenewed   commitment  to  the  Paris  Agreement.  Carnegie  sees  this  as  highly   positive  andexpects support measures for marine renewables to  increaseas a result\n\nThey  basically go on about all the collab theyre making with the companies  listed above and the fundings they're getting and how the tech works.  Check it out. This isn't financial advice.\n\ntdlr long play at a good price. long term potential.\n\nEdits: add info and fix errors. Price updates\n\n2/26/21-  0.0069+0.0023 (+50.00%)\n\n3/1/21- 0.0072 0.0002 (+2.86%)\n\nuser feed back.\n\n u/[Art-of-Intuition](https://www.reddit.com/user/Art-of-Intuition/) \\-   \n\nFocusing on the technical resource  within the U.S. exclusive economic zone that can be harnessed for  large-scale (megawatt- to gigawatt-scale) energy generation, the report  found that the total marine energy resource in the 50 states amounts to  2,300 TWh/yr – equivalent to approximately 57% of U.S. generation in  2019.\n\n[https://www.offshore-energy.biz/nrel-publishes-marine-energy-resource-report-for-united-states/](https://www.offshore-energy.biz/nrel-publishes-marine-energy-resource-report-for-united-states/)\n\nWave  energy potential is massive! With all the millions of EVs coming online  in the next several years the world will need to quickly generate more  energy and marine energy will have to be a big part of that plan.\n\nCarnegie  has hundreds of patents the reason HPE, Microsoft, and Enel Energy are  partnering with them is for the intellectual property. Carnegie’s long  term plan is to license their wave technology to a larger company ( i.e.  Siemens, GE etc.) this is a long play 2-3 years from now. Buy and hold!\n\n u/[GoingRamboMCAT](https://www.reddit.com/user/GoingRamboMCAT/) \\-  In 100k shares here, incredible partnerships w/ Hewlett-Packard and  Microsoft. Defense contracts, government support, and licensure deals in  play. Ton of potential here! In for the long-haul. \n\n u/[leavemealone559](https://www.reddit.com/user/leavemealone559/) \\-  Bought 3k shares for 10 dollars yesterday thru Fidelity and after I  bought I check my positions and I’m like wtf how am I negative $50  already !? Foreign stock transfer fees :( now It has to hit .02 before I  can break even lmao \n\n u/[Fourfourfourfour44](https://www.reddit.com/user/Fourfourfourfour44/) \\-  12 billion shares outstanding :(",
        "subreddit": "pennystocks",
        "title": "CARNEGIE CLEAN ENERGY LTD SHS 0.0055 -0.0006 (-10.06%) - Why now you should buy and hold for a long-term investment.",
        "url": "https://www.reddit.com/r/pennystocks/comments/lwb7id/carnegie_clean_energy_ltd_shs_00055_00006_1006/",
        "created": 1614744371.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1614893130,
        "id": "lxvuo4",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, March 4, 2021**\n\nStocks slumped Thursday once again, continuing the recent sellof. The tech-heavy Nasdaq (QQQ) led the selloff, falling 1.64%. The S&amp;P 500 (SPY) fell 1.24% and the Dow Jones (DIA) fell 1.07%. At session lows, both the Nasdaq and S&amp;P 500 erased 2021’s gains. \n\nThe moves lower came even after a new report on weekly unemployment claims came in better than expected, pointing to improving employment trends. \n\n* **Initial jobless claims:** 745,000 vs. 750,000 expected and a revised 736,000 during the prior week. \n* **Continuing claims:** 4.295 million vs. 4.300 million expected and 4.419 million during the prior week\n\nDuring a public appearance Thursday afternoon, Federal Reserve Chairman Jerome Powell said Thursday that the central bank will be “patient” in keeping interest rates near zero, even if inflationary pressures start to rise. Powell cautioned that as the COVID-19 vaccine rollout continues, the Fed could see signs of rising prices amid surging consumer spending. But the Fed chairman noted that he does not expect higher inflation to turn into anything resembling the double-digit inflation of the 1970s. He said, “If we do see what we believe is likely a transitory increase in inflation, where longer-term inflation expectations are broadly stable at levels consistent with our framework and goals, I expect that we will be patient.”\n\nAs Treasury yields continue to rise, market participants are increasingly rotating out of high-growth names that led the markets in 2020. Technology stocks came under exceptional selling pressure as traders turned their focus to stocks poised to benefit more directly from an impending economic reopening. At the same time, the recent, rapid rise in Treasury yields has also deterred investors from growth stocks, with interest rates closely tied to borrowing costs for companies and consumers. The 10-year Treasury yield climbed to around 1.544% at the time of writing. \n\nIn other news, lawmakers in the Senate are set to begin debating President Biden’s $1.9 trillion stimulus, which was passed by the House of Representatives recently. Democrats are racing to push the legislation forward before the mid-March expiry of augmented Federal unemployment benefits. Republicans do not support the bill because of its size, but through a process called reconciliation, Democrats will be able to pass the bill without support from the other side of the aisle.\n\n**Highlights**\n\n* The decisions by Britain and the United States to suspend retaliatory tariffs will create space for negotiations on an ongoing dispute between Boeing (BA) and Airbus, White House Press Secretary Jen Psaki said on Thursday. \n* President Biden said his administration expects to have enough COVID-19 vaccines for any adult that wants it by the end of May, pulling the targets two months closer than the previous government estimate.\n* U.S. mortgage rates extended their recent leg higher to break above 3% for the first time since July 2020, raising concerns that the housing market's breakneck growth last year may sharply lose momentum.\n* Square (SQ) announced it took a majority stake in music platform Tidal that is owned by rapper Jay-Z. Jay-Z will be added to the board of directors at Square. \n* **Please note that the stock price was written in the morning and does not account for intraday changes.**\n* Airbnb (ABNB) with a host of target raises just over the $200 mark. Stock around $175. Including by Credit Suisse, Piper Sandler, Canaccord Genuity, &amp; Needham\n* Adaptive Biotechnologies (ADPT) had a price target raise by Morgan Stanley from $46 to $60\n* Big target raise for Alarm.com (ALRM) by Raymond James from $75 to $115 at STRONG-BUY\n* American Eagle Outfitters (AEO) target raise\n   * Citigroup from $29 to $32\n   * UBS Group from $31 to $37\n   * Jeffries Financial $30 to $32\n* Broadcom (AVGO) had a price target raise by Oppenheimer from $500 to $575 at OUTPERFORM\n* Carvana (CVNA) received a price target raise by JMP Securities from $250 to $290 at MARKET OUTPERFORM\n* Etsy (ETSY) with host of target raises\n   * Goldman Sachs $178 to $286 BUY\n   * Canaccord Genuity $215 to $270 BUY\n   * Morgan Stanley $93 to $123 UNDERWEIGHT\n   * Roth Capital $235 to $245 BUY\n   * Needham $155 to $235 BUY\n* Fisker (FSR) with a Target raise by Morgan Stanley from $27 to $40 at OVERWEIGHT\n* Futu Holdings (FUTU) Citigroup raise target from $120 to $245 at BUY. This is a big one!\n* Guardant Health (GH) had a price target raise by Morgfan Stanley $MS from $130 to $175\n* HP (HPQ) with a price target raise by Morgan Stanley from $30 to $38 at OVERWEIGHT\n* Liveperson (LPSN)  with a host of target raises. We like it at current elvels with this week’s selloff.\n   * Mizuho $75 to $90 BUY\n   * Needham $65 to $71\n   * Rosenblatt $73 to $75 BUY\n* PetIQ (PETQ) price target raised by Raymond James $35 to $45 OUTPERFORM\n* Renewables Energy Group (REGI) target raised by H.C. Wainwright from $70 to $115 at BUY. This is timely, especially with the selloff. We like it.\n* Twitter (TWTR) with a host of target raises by Goldman Sachs, Pivotal Research, Canaccord Genuity, KeyCorp, Rosenblatt. Most at BUY or OVERWEIGHT with end price target between $90 and $100\n* Shake Shack (SHAK) with host of target raises\n   * Deutsche Bank $70 to $107 HOLD\n   * Piper Sandler $122 to $135 OVERWEIGHT\n   * Morgan Stnaley $87 to $95 EQUAL WEIGHT\n\n“The first rule of investment is ‘buy low and sell high’, but many people fear to buy low because of the fear of the stock dropping even lower. Then you may ask: ‘When is the time to buy low?’ The answer is: When there is maximum pessimism.” - Sir John Templeton",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, March 4, 2021.",
        "url": "https://www.reddit.com/r/stocks/comments/lxvuo4/here_is_a_market_recap_for_today_thursday_march_4/",
        "created": 1614921930.0
    },
    {
        "author": "Blueeyessmokeydog",
        "created_utc": 1614866091,
        "id": "lxl0l6",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "https://www.reddit.com/r/CanadianInvestor/comments/kj2uu8/some_noob_dd_for_some_interesting_canadian/\n\n(Link is deleted now, but I posted this when PyroGenisis was around $3/share and HPQ was around 85c.)\n**Here's the deleted post**\n&gt;Some noob DD from me. I think these stocks are a great long term hold. Don't use this as advice, do your own DD. Informative purposes only\n\n&gt;I've been looking at PyroGenesis (PYR.TO) ever since they announced they were looking to uplist on NASDAQ. PyroGenesis Canada Inc. designs, develops, manufactures, and commercializes advanced plasma processes and systems in Canada and internationally. They are involved in Metals, Waste management, Innovation &amp; Custom Process development (HPQ-Silicon), Plasma Torches (see previous DD by /u/Greasyfork\n\n&gt;Two of their main products piqued my interest- \n\n&gt;1)- Plasma torches\n\n&gt;These plasma torches are an environmentally friendly alternative to using fossil fuels in the Iron Pelletization industry. Currently PyroGenesis is the only company that has a patent for such a process in the industry. \n\n&gt;Just recently, they announced they had a contract with a major iron ore supplier equaling $3.6M\n\n&gt;https://finance.yahoo.com/news/pyrogenesis-signs-initial-plasma-torch-213000493.html &gt;https://finance.yahoo.com/news/pyrogenesis-signs-additional-1-1mm-133500724.html\n\n&gt;It also mentions there that \"The Client, which has committed to reduce its greenhouse gas (“GHG”) emissions, has over ten (10) plants, each possibly requiring up to 50 plasma torches.\" - That's approx $500-600M future revenue that the client has committed to purchase exclusively from PyroGenesis. PyroGenesis will also be providing after sale services to this client for additional revenue\n\n&gt;That is just ONE contract with one company. Expect many more contracts over the years as more companies decide to ditch fossil fuels and go with a more green solution\n\n&gt;2- Innovation &amp; Custom Process development (HPQ-Silicon)\n\n&gt;That brings to the second company on my radar, HPQ Silicon Resources (HPQ.V, OTC:URAGF) They are involved in the exploration, mining, and production of silicon metals, solar grade silicon metals, and porous silicon wafers.\n\n&gt;A few months ago, PyroGenesis &amp; HPQ Silicon signed an agreement to develop The PUREVAPTM NSiR process. Once up and runing, HPQ NANO can deliver to advanced materials companies and battery manufacturers a cost competitive, tailor-made product, that can replace graphite in batteries and thereby allow the deployment of truly powerful next generation Li-ion batteries\n\n&gt;https://finance.yahoo.com/news/hpq-silicon-pyrogenesis-sign-nano-170500452.html\n\n&gt;PyroGenesis then sold the IP rights of the PUREVAP™ NSiR process which included a 10% royalty for any sales which PyroGenesis can convert into a 50% ownership of HPQ\n\n&gt;https://finance.yahoo.com/news/pyrogenesis-signs-3m-contract-hpq-174600535.html\n\n&gt;Before they even started any production, they already have an order for the material from a major Car manufacturer \n\n&gt;https://finance.yahoo.com/news/hpq-nano-receives-first-order-190300952.html\n\n&gt;And earlier today, they announced that their first reactor has been commissioned and is ready to start production. \n\n&gt;https://finance.yahoo.com/news/hpq-nano-reaches-major-milestones-141000141.html\n\nSince that post- there have been a number of developments- PyroGenesis stock price is now at $7.7ish (peak of $12) (which IMO is a great buy-in point) &amp; HPQ price is around $1.1 (peak of ~$1.6)\n\nJanuary 12- they announced implementation of a NCIB- When the company thinks their share price is undervalued, they can opt to buy back some shares thus reducing supply &amp; increasing value for shareholders\nhttps://finance.yahoo.com/news/pyrogenesis-announces-implementation-ncib-133500312.html\n\nJan 21- HPQ announced that their Gen1 Nano Silicon Reactor Exceeds Expectations\nhttps://finance.yahoo.com/news/pyrogenesis-announces-implementation-ncib-133500312.html\n\nFeb 02- PyroGenesis filed form 40-f with the SEC\nhttps://finance.yahoo.com/news/pyrogenesis-files-form-40-f-204300768.html\n\nFeb 18- Nasdaq application all but approved\nhttps://finance.yahoo.com/news/pyrogenesis-provides-listing-application-nasdaq-192500547.html\n\nLast time the market had a bit of a correction (Feb 23) and the stock price went from around $11 to $7ish, the company put put a press release specifically stating that everything was on track, no financing planned, company has cash, etc\n\nYesterday, they announced a new appointment to the board of directors-Mr. Ben Naccarato who has over 30 years of experience in the sector. BUT what I found interesting was tucked away at the end of the press release- \n\n\"Separately, the Company is pleased to announce today that it has entered into a lease agreement for an additional 31, 632 sq. ft. which will almost double its existing manufacturing footprint in Montreal, QC, Canada.\"\n\nSo they are planning on doubling their manufacturing capability\nhttps://finance.yahoo.com/news/pyrogenesis-pleased-announce-appointment-mr-212000379.html\n\nAll in all, I think this is a very good long term investment- they are the only leaders in the Plasma industry and they have 2 (other) products that I havent mentioned, they are the only non-US based company to have their equipment on US navy aircraft carriers and have a lot of other things going for them\n\nAs always, I am not a financial advisor, I just like the stock. do you own DD",
        "subreddit": "CanadianInvestor",
        "title": "A follow up to a previous DD post I did- PyroGenesis &amp; HPQ Silicon",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/lxl0l6/a_follow_up_to_a_previous_dd_post_i_did/",
        "created": 1614894891.0
    },
    {
        "author": "tim202012",
        "created_utc": 1614794300,
        "id": "lx02lm",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Besides a simple Buy or Sell can an experienced person explain whether HPQ would be good to keep or sell as I have been talked into purchasing a lot of shares. they are down and I want to know if I should cut my losses or keep waiting as he promises it will go up. claims it will be revolutionary for the battery market with electric vehicles.",
        "subreddit": "CanadianInvestor",
        "title": "calling all you pros need advice HPQ",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/lx02lm/calling_all_you_pros_need_advice_hpq/",
        "created": 1614823100.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1614893205,
        "id": "lxvvo1",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, March 4, 2021**\n\nStocks slumped Thursday once again, continuing the recent selloff. The tech-heavy Nasdaq (QQQ) led the selloff, falling 1.64%. The S&amp;P 500 (SPY) fell 1.24% and the Dow Jones (DIA) fell 1.07%. At session lows, both the Nasdaq and S&amp;P 500 erased 2021’s gains. \n\nThe moves lower came even after a new report on weekly unemployment claims came in better than expected, pointing to improving employment trends. \n\n* **Initial jobless claims:** 745,000 vs. 750,000 expected and a revised 736,000 during the prior week. \n* **Continuing claims:** 4.295 million vs. 4.300 million expected and 4.419 million during the prior week\n\nDuring a public appearance Thursday afternoon, Federal Reserve Chairman Jerome Powell said Thursday that the central bank will be “patient” in keeping interest rates near zero, even if inflationary pressures start to rise. Powell cautioned that as the COVID-19 vaccine rollout continues, the Fed could see signs of rising prices amid surging consumer spending. But the Fed chairman noted that he does not expect higher inflation to turn into anything resembling the double-digit inflation of the 1970s. He said, “If we do see what we believe is likely a transitory increase in inflation, where longer-term inflation expectations are broadly stable at levels consistent with our framework and goals, I expect that we will be patient.”\n\nAs Treasury yields continue to rise, market participants are increasingly rotating out of high-growth names that led the markets in 2020. Technology stocks came under exceptional selling pressure as traders turned their focus to stocks poised to benefit more directly from an impending economic reopening. At the same time, the recent, rapid rise in Treasury yields has also deterred investors from growth stocks, with interest rates closely tied to borrowing costs for companies and consumers. The 10-year Treasury yield climbed to around 1.544% at the time of writing. \n\nIn other news, lawmakers in the Senate are set to begin debating President Biden’s $1.9 trillion stimulus, which was passed by the House of Representatives recently. Democrats are racing to push the legislation forward before the mid-March expiry of augmented Federal unemployment benefits. Republicans do not support the bill because of its size, but through a process called reconciliation, Democrats will be able to pass the bill without support from the other side of the aisle.\n\n**Highlights**\n\n* The decisions by Britain and the United States to suspend retaliatory tariffs will create space for negotiations on an ongoing dispute between Boeing (BA) and Airbus, White House Press Secretary Jen Psaki said on Thursday. \n* President Biden said his administration expects to have enough COVID-19 vaccines for any adult that wants it by the end of May, pulling the targets two months closer than the previous government estimate.\n* U.S. mortgage rates extended their recent leg higher to break above 3% for the first time since July 2020, raising concerns that the housing market's breakneck growth last year may sharply lose momentum.\n* Square (SQ) announced it took a majority stake in music platform Tidal that is owned by rapper Jay-Z. Jay-Z will be added to the board of directors at Square. \n* **Please note that the stock price was written in the morning and does not account for intraday changes.**\n* Airbnb (ABNB) with a host of target raises just over the $200 mark. Stock around $175. Including by Credit Suisse, Piper Sandler, Canaccord Genuity, &amp; Needham\n* Adaptive Biotechnologies (ADPT) had a price target raise by Morgan Stanley from $46 to $60\n* Big target raise for Alarm.com (ALRM) by Raymond James from $75 to $115 at STRONG-BUY\n* American Eagle Outfitters (AEO) target raise\n   * Citigroup from $29 to $32\n   * UBS Group from $31 to $37\n   * Jeffries Financial $30 to $32\n* Broadcom (AVGO) had a price target raise by Oppenheimer from $500 to $575 at OUTPERFORM\n* Carvana (CVNA) received a price target raise by JMP Securities from $250 to $290 at MARKET OUTPERFORM\n* Etsy (ETSY) with host of target raises\n   * Goldman Sachs $178 to $286 BUY\n   * Canaccord Genuity $215 to $270 BUY\n   * Morgan Stanley $93 to $123 UNDERWEIGHT\n   * Roth Capital $235 to $245 BUY\n   * Needham $155 to $235 BUY\n* Fisker (FSR) with a Target raise by Morgan Stanley from $27 to $40 at OVERWEIGHT\n* Futu Holdings (FUTU) Citigroup raise target from $120 to $245 at BUY. This is a big one!\n* Guardant Health (GH) had a price target raise by Morgfan Stanley $MS from $130 to $175\n* HP (HPQ) with a price target raise by Morgan Stanley from $30 to $38 at OVERWEIGHT\n* Liveperson (LPSN)  with a host of target raises. We like it at current elvels with this week’s selloff.\n   * Mizuho $75 to $90 BUY\n   * Needham $65 to $71\n   * Rosenblatt $73 to $75 BUY\n* PetIQ (PETQ) price target raised by Raymond James $35 to $45 OUTPERFORM\n* Renewables Energy Group (REGI) target raised by H.C. Wainwright from $70 to $115 at BUY. This is timely, especially with the selloff. We like it.\n* Twitter (TWTR) with a host of target raises by Goldman Sachs, Pivotal Research, Canaccord Genuity, KeyCorp, Rosenblatt. Most at BUY or OVERWEIGHT with end price target between $90 and $100\n* Shake Shack (SHAK) with host of target raises\n   * Deutsche Bank $70 to $107 HOLD\n   * Piper Sandler $122 to $135 OVERWEIGHT\n   * Morgan Stnaley $87 to $95 EQUAL WEIGHT\n\n“The first rule of investment is ‘buy low and sell high’, but many people fear to buy low because of the fear of the stock dropping even lower. Then you may ask: ‘When is the time to buy low?’ The answer is: When there is maximum pessimism.” - Sir John Templeton",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, March 4, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/lxvvo1/here_is_a_market_recap_for_today_thursday_march_4/",
        "created": 1614922005.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1614778742,
        "id": "lwu2vs",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to Wednesday! Here are your pre-market stock movers &amp; news on this Wednesday, March 3rd, 2021-\n\n*****\n\n# [5 things to know before the stock market opens Wednesday](https://www.cnbc.com/2021/03/03/5-things-to-know-before-the-stock-market-opens-march-3-2021.html)\n\n*****\n\n&gt; # 1. Dow futures jump after Tuesday’s early gain fizzles and reverses\n\n&gt; * The Dow is set to rise 200 points Wednesday after late-day selling reversed strong gains earlier in Tuesday’s session. Coming off their best days since November, the 30-stock average Tuesday fell 0.5% and the Nasdaq dropped 1.7% as tech stocks pulled back. The S&amp;P 500 slid 0.8%, a day after its biggest one-day advance since June.\n\n&gt; * The latest ADP report on private sector employment is set for release at 8:30 a.m. ET, one hour before Wall Street’s open. U.S. companies are expected to have added 225,000 new jobs in February compared to January of gains 174,000 positions. The ADP lately has not been the best predictor of the government’s monthly jobs report, which comes out Friday.\n\n*****\n\n&gt; # 2. Senate to begin debate soon on $1.9 trillion Covid relief bill\n\n&gt; * The Senate is expected to start debate as soon as Wednesday on its version of the House-passed, $1.9 trillion Covid relief bill. However, it excludes a federal minimum wage boost to $15 per hour. President Joe Biden on Tuesday urged Democrats to stand united and approve the measure, even as some party moderates sought to dial back parts of the package. Democrats, with the slimmest of margins in the Senate, are using special rules that would allow them to pass the bill without GOP support.\n\n*****\n\n&gt; # 3. U.S. will have enough Covid vaccines for ‘every adult’ by end of May\n\n&gt; * The U.S. will have a large enough supply of coronavirus vaccines to inoculate “every adult in America” by the end of May, two months earlier than previously expected, Biden said at the White House on Tuesday. The announcement came as the administration works to increase production of Johnson &amp; Johnson’s newly cleared single-shot vaccine, and rival Merck agrees to pitch in.\n\n&gt; * The Republican governors of Texas and Mississippi both announced Tuesday that they’re lifting mask mandates in their states and allowing businesses to reopen at full capacity even as the decline in new daily Covid-19 cases slows. CDC Director Dr. Rochelle Walensky on Monday warned states against lifting public health restrictions too quickly.\n\n*****\n\n&gt; # 4. America’s biggest firms push for path to citizenship for ‘Dreamers’\n\n&gt; * America’s biggest companies are urging Congress to establish a permanent path to citizenship for undocumented immigrants brought to the U.S. as children. In a letter Wednesday, a coalition of more than 100 companies and trade associations — including Facebook, General Motors, Marriott, Target, Visa and Uber — asked Senate leaders Chuck Schumer, D-N.Y., and Mitch McConnell, R-Ky., to pass the bipartisan Dream Act of 2021. The move comes as Biden and Democrats on Capitol Hill look to immigration as a major legislative priority.\n\n*****\n\n&gt; # 5. Stocks to watch: Rocket Companies, Las Vegas Sands, Oscar Health\n\n&gt; * Rocket Companies fell 6% in Wednesday’s premarket trading after more than doubling over the past three sessions. On Tuesday, the Quicken Loans and Rocket Mortgage parent surged over 71% on no apparent news. The heavily shorted stock appears to have garnered bullish interest from day traders on Reddit’s WallStreetBets forum.\n\n&gt; * Casino operator Las Vegas Sands said Wednesday it would sell its Vegas real estate and operations to private equity giant Apollo Global Management for about $6.25 billion. The properties include the Venetian Resort Las Vegas and the Sands Expo and Convention Center. Shares of Las Vegas Sands were up almost 3% in the premarket. Apollo fell nearly 1%.\n\n&gt; * Oscar Health is set to debut Wednesday on the New York Stock Exchange. The health insurance startup backed by Google-parent Alphabet priced its initial public offering Tuesday evening at $39 per share, above the already-raised expected range of $36 to $38. The IPO gives Oscar Health a market value of $7.7 billion ahead of trading.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mFJEZLD.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/DZktsvp.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #1!](https://i.postimg.cc/Yq2hHN9S/econcal1.png)**)\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #2!](https://i.postimg.cc/FFV78Chq/econcal2.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zRvHdP7.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/PbURZ3R.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/oqzviWR.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/HGdMXO8.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/978P5c5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK!](https://i.imgur.com/2Ltoqja.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.postimg.cc/d0wfH06g/upgradesdowngrades1.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.postimg.cc/52wGSzBw/upgradesdowngrades2.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.postimg.cc/nh8gm2DF/upgradesdowngrades3.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/85n5bWw.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/3PemF5S.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/0YIFXZl.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* OCGN\n* KMPH\n* RKT\n* TRXC\n* UWMC\n* OVID\n* FUBO\n* DIA\n* HZON\n* GENE\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/03/03/stocks-making-the-biggest-moves-in-the-premarket-lyft-las-vegas-sands-wendys-more.html)**)\n\n*****\n\n&gt; **Lyft (LYFT)** – The ride-hailing company said that last week saw the highest level of ride volume since the pandemic took hold last March. As a result, Lyft expects to report a smaller quarterly loss than it had previously projected. Lyft shares jumped 5.6% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** LYFT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LYFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LYFT)**)\n\n*****\n\n&gt; **Las Vegas Sands (LVS)** – The casino operator’s shares rose 3% in the premarket after it announced a deal to sell its Las Vegas properties to private-equity firms Apollo Global (APO) and VICI Properties for $6.25 billion. The sale includes The Venetian Resort Las Vegas and the Sands Expo and Convention Center. Apollo Global shares gained 2.1%.\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n&gt; **Wendy’s (WEN)** – The restaurant chain missed estimates by a penny a share, with quarterly earnings of 17 cents per share. Revenue came in short of forecasts as well. Global comparable sales rose 4.7%, shy of the FactSet consensus estimate of 5.7% due primarily to international weakness. Its shares fell 3.3% in the premarket.\n\n&gt; #**STOCK SYMBOL:** WEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WEN)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** – The discount retailer earned $2.13 per share for the fourth quarter, beating estimates by 2 cents a share. Revenue essentially was in line with expectations. Comparable-store sales rose 4.9%, short of the 5.5% estimate of analysts surveyed by FactSet. The company’s shares fell 2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **Hewlett Packard Enterprise (HPE)** – HPE beat estimates by 11 cents a share, with quarterly earnings of 52 cents per share. The enterprise computing hardware maker’s revenue came in above forecasts as well. The company issued strong guidance for both the current quarter and full year, as it continues to benefit from the pandemic-inspired digital transformation.\n\n&gt; #**STOCK SYMBOL:** HPE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HPE)**)\n\n*****\n\n&gt; **Box (BOX)** – Box reported quarterly earnings of 22 cents per share, 5 cents a share above estimates. Revenue beat projections as well. The online data storage company also issued a better-than-expected full-year outlook and expects that the current quarter will see revenue above $200 million for the first time.\n\n&gt; #**STOCK SYMBOL:** BOX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BOX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BOX)**)\n\n*****\n\n&gt; **Nordstrom (JWN)** – Nordstrom earned 21 cents per share for its latest quarter, 7 cents a share above estimates. The retailer also reported better-than-expected revenue. Nordstrom was helped by a boost in digital sales as well as growth in its off-price operation, but the retailer warned that it would have to clear excess holiday inventory through that off-price channel. Shares fell 2.6% in premarket action.\n\n&gt; #**STOCK SYMBOL:** JWN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=JWN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/JWN)**)\n\n*****\n\n&gt; **FuboTV (FUBO)** – FuboTV reported quarterly revenue in excess of $100 million for the first time, with the live sports streaming company reporting a better-than-expected $105.1 million in sales. Subscriber numbers jumped 73% from a year earlier to a total of 548,000. Its shares fell 4% in the premarket, however, following a nearly 50% year-to-date jump.\n\n&gt; #**STOCK SYMBOL:** FUBO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FUBO)**)\n\n*****\n\n&gt; **Rocket Companies (RKT)** – Rocket shares have been volatile in premarket trading after more than doubling over the past three sessions. The Quicken Loans and Rocket Mortgage parent has been garnering increasing attention in online forums, with investors noting the high level of short interest. Rocket shares fell 5.5% in premarket action.\n\n&gt; #**STOCK SYMBOL:** RKT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RKT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RKT)**)\n\n*****\n\n&gt; **Urban Outfitters (URBN)** – Urban Outfitters beat estimates by 2 cents a share, with quarterly earnings of 30 cents per share. The apparel retailer’s revenue fell slightly below Wall Street forecasts, however, and gross profit margins dropped more than 3 percentage points from a year earlier. Its shares fell 1.6% in the premarket.\n\n&gt; #**STOCK SYMBOL:** URBN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=URBN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/URBN)**)\n\n*****\n\n&gt; **Ross Stores (ROST)** – Ross Stores sank 3.1% in the premarket after it reported quarterly earnings of 67 cents per share, below the $1.00 a share consensus estimate. The discount retailer’s revenue came in below estimates as well, hurt by pandemic-related store closures in California.\n\n&gt; #**STOCK SYMBOL:** ROST\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ROST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ROST)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, March 3rd, 2021! :)**",
        "subreddit": "smallstreetbets",
        "title": "(3/3) Wednesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lwu2vs/33_wednesdays_premarket_stock_movers_news/",
        "created": 1614807542.0
    },
    {
        "author": "tim202012",
        "created_utc": 1614794251,
        "id": "lx01xy",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "calling all the pros Need Help HPQ",
        "url": "https://www.reddit.com/r/investing/comments/lx01xy/calling_all_the_pros_need_help_hpq/",
        "created": 1614823051.0
    },
    {
        "author": "Revolutionary-Owl315",
        "created_utc": 1614815457,
        "id": "lx7q0f",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "The new way to build a house.... Print it!! HPQ🚀🚀🚀🚀🐸🐸🐸🐸",
        "url": "https://youtu.be/XHSYEH133HA",
        "created": 1614844257.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1614778539,
        "id": "lwu0fq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to Wednesday! Here are your pre-market stock movers &amp; news on this Wednesday, March 3rd, 2021-\n\n*****\n\n# [5 things to know before the stock market opens Wednesday](https://www.cnbc.com/2021/03/03/5-things-to-know-before-the-stock-market-opens-march-3-2021.html)\n\n*****\n\n&gt; # 1. Dow futures jump after Tuesday’s early gain fizzles and reverses\n\n&gt; * The Dow is set to rise 200 points Wednesday after late-day selling reversed strong gains earlier in Tuesday’s session. Coming off their best days since November, the 30-stock average Tuesday fell 0.5% and the Nasdaq dropped 1.7% as tech stocks pulled back. The S&amp;P 500 slid 0.8%, a day after its biggest one-day advance since June.\n\n&gt; * The latest ADP report on private sector employment is set for release at 8:30 a.m. ET, one hour before Wall Street’s open. U.S. companies are expected to have added 225,000 new jobs in February compared to January of gains 174,000 positions. The ADP lately has not been the best predictor of the government’s monthly jobs report, which comes out Friday.\n\n*****\n\n&gt; # 2. Senate to begin debate soon on $1.9 trillion Covid relief bill\n\n&gt; * The Senate is expected to start debate as soon as Wednesday on its version of the House-passed, $1.9 trillion Covid relief bill. However, it excludes a federal minimum wage boost to $15 per hour. President Joe Biden on Tuesday urged Democrats to stand united and approve the measure, even as some party moderates sought to dial back parts of the package. Democrats, with the slimmest of margins in the Senate, are using special rules that would allow them to pass the bill without GOP support.\n\n*****\n\n&gt; # 3. U.S. will have enough Covid vaccines for ‘every adult’ by end of May\n\n&gt; * The U.S. will have a large enough supply of coronavirus vaccines to inoculate “every adult in America” by the end of May, two months earlier than previously expected, Biden said at the White House on Tuesday. The announcement came as the administration works to increase production of Johnson &amp; Johnson’s newly cleared single-shot vaccine, and rival Merck agrees to pitch in.\n\n&gt; * The Republican governors of Texas and Mississippi both announced Tuesday that they’re lifting mask mandates in their states and allowing businesses to reopen at full capacity even as the decline in new daily Covid-19 cases slows. CDC Director Dr. Rochelle Walensky on Monday warned states against lifting public health restrictions too quickly.\n\n*****\n\n&gt; # 4. America’s biggest firms push for path to citizenship for ‘Dreamers’\n\n&gt; * America’s biggest companies are urging Congress to establish a permanent path to citizenship for undocumented immigrants brought to the U.S. as children. In a letter Wednesday, a coalition of more than 100 companies and trade associations — including Facebook, General Motors, Marriott, Target, Visa and Uber — asked Senate leaders Chuck Schumer, D-N.Y., and Mitch McConnell, R-Ky., to pass the bipartisan Dream Act of 2021. The move comes as Biden and Democrats on Capitol Hill look to immigration as a major legislative priority.\n\n*****\n\n&gt; # 5. Stocks to watch: Rocket Companies, Las Vegas Sands, Oscar Health\n\n&gt; * Rocket Companies fell 6% in Wednesday’s premarket trading after more than doubling over the past three sessions. On Tuesday, the Quicken Loans and Rocket Mortgage parent surged over 71% on no apparent news. The heavily shorted stock appears to have garnered bullish interest from day traders on Reddit’s WallStreetBets forum.\n\n&gt; * Casino operator Las Vegas Sands said Wednesday it would sell its Vegas real estate and operations to private equity giant Apollo Global Management for about $6.25 billion. The properties include the Venetian Resort Las Vegas and the Sands Expo and Convention Center. Shares of Las Vegas Sands were up almost 3% in the premarket. Apollo fell nearly 1%.\n\n&gt; * Oscar Health is set to debut Wednesday on the New York Stock Exchange. The health insurance startup backed by Google-parent Alphabet priced its initial public offering Tuesday evening at $39 per share, above the already-raised expected range of $36 to $38. The IPO gives Oscar Health a market value of $7.7 billion ahead of trading.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mFJEZLD.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/DZktsvp.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #1!](https://i.postimg.cc/Yq2hHN9S/econcal1.png)**)\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR LINK #2!](https://i.postimg.cc/FFV78Chq/econcal2.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/zRvHdP7.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/PbURZ3R.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/oqzviWR.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/HGdMXO8.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/978P5c5.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK!](https://i.imgur.com/2Ltoqja.png)**)\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.postimg.cc/d0wfH06g/upgradesdowngrades1.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.postimg.cc/52wGSzBw/upgradesdowngrades2.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.postimg.cc/nh8gm2DF/upgradesdowngrades3.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/85n5bWw.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #2!](https://i.imgur.com/3PemF5S.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!](https://i.imgur.com/0YIFXZl.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* OCGN\n* KMPH\n* RKT\n* TRXC\n* UWMC\n* OVID\n* FUBO\n* DIA\n* HZON\n* GENE\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/03/03/stocks-making-the-biggest-moves-in-the-premarket-lyft-las-vegas-sands-wendys-more.html)**)\n\n*****\n\n&gt; **Lyft (LYFT)** – The ride-hailing company said that last week saw the highest level of ride volume since the pandemic took hold last March. As a result, Lyft expects to report a smaller quarterly loss than it had previously projected. Lyft shares jumped 5.6% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** LYFT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LYFT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LYFT)**)\n\n*****\n\n&gt; **Las Vegas Sands (LVS)** – The casino operator’s shares rose 3% in the premarket after it announced a deal to sell its Las Vegas properties to private-equity firms Apollo Global (APO) and VICI Properties for $6.25 billion. The sale includes The Venetian Resort Las Vegas and the Sands Expo and Convention Center. Apollo Global shares gained 2.1%.\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n&gt; **Wendy’s (WEN)** – The restaurant chain missed estimates by a penny a share, with quarterly earnings of 17 cents per share. Revenue came in short of forecasts as well. Global comparable sales rose 4.7%, shy of the FactSet consensus estimate of 5.7% due primarily to international weakness. Its shares fell 3.3% in the premarket.\n\n&gt; #**STOCK SYMBOL:** WEN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=WEN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WEN)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** – The discount retailer earned $2.13 per share for the fourth quarter, beating estimates by 2 cents a share. Revenue essentially was in line with expectations. Comparable-store sales rose 4.9%, short of the 5.5% estimate of analysts surveyed by FactSet. The company’s shares fell 2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **Hewlett Packard Enterprise (HPE)** – HPE beat estimates by 11 cents a share, with quarterly earnings of 52 cents per share. The enterprise computing hardware maker’s revenue came in above forecasts as well. The company issued strong guidance for both the current quarter and full year, as it continues to benefit from the pandemic-inspired digital transformation.\n\n&gt; #**STOCK SYMBOL:** HPE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=HPE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/HPE)**)\n\n*****\n\n&gt; **Box (BOX)** – Box reported quarterly earnings of 22 cents per share, 5 cents a share above estimates. Revenue beat projections as well. The online data storage company also issued a better-than-expected full-year outlook and expects that the current quarter will see revenue above $200 million for the first time.\n\n&gt; #**STOCK SYMBOL:** BOX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=BOX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BOX)**)\n\n*****\n\n&gt; **Nordstrom (JWN)** – Nordstrom earned 21 cents per share for its latest quarter, 7 cents a share above estimates. The retailer also reported better-than-expected revenue. Nordstrom was helped by a boost in digital sales as well as growth in its off-price operation, but the retailer warned that it would have to clear excess holiday inventory through that off-price channel. Shares fell 2.6% in premarket action.\n\n&gt; #**STOCK SYMBOL:** JWN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=JWN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/JWN)**)\n\n*****\n\n&gt; **FuboTV (FUBO)** – FuboTV reported quarterly revenue in excess of $100 million for the first time, with the live sports streaming company reporting a better-than-expected $105.1 million in sales. Subscriber numbers jumped 73% from a year earlier to a total of 548,000. Its shares fell 4% in the premarket, however, following a nearly 50% year-to-date jump.\n\n&gt; #**STOCK SYMBOL:** FUBO\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FUBO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FUBO)**)\n\n*****\n\n&gt; **Rocket Companies (RKT)** – Rocket shares have been volatile in premarket trading after more than doubling over the past three sessions. The Quicken Loans and Rocket Mortgage parent has been garnering increasing attention in online forums, with investors noting the high level of short interest. Rocket shares fell 5.5% in premarket action.\n\n&gt; #**STOCK SYMBOL:** RKT\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=RKT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RKT)**)\n\n*****\n\n&gt; **Urban Outfitters (URBN)** – Urban Outfitters beat estimates by 2 cents a share, with quarterly earnings of 30 cents per share. The apparel retailer’s revenue fell slightly below Wall Street forecasts, however, and gross profit margins dropped more than 3 percentage points from a year earlier. Its shares fell 1.6% in the premarket.\n\n&gt; #**STOCK SYMBOL:** URBN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=URBN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/URBN)**)\n\n*****\n\n&gt; **Ross Stores (ROST)** – Ross Stores sank 3.1% in the premarket after it reported quarterly earnings of 67 cents per share, below the $1.00 a share consensus estimate. The discount retailer’s revenue came in below estimates as well, hurt by pandemic-related store closures in California.\n\n&gt; #**STOCK SYMBOL:** ROST\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=ROST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ROST)**)\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Wednesday, March 3rd, 2021! :)**",
        "subreddit": "StockMarket",
        "title": "(3/3) Wednesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/StockMarket/comments/lwu0fq/33_wednesdays_premarket_stock_movers_news/",
        "created": 1614807339.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1615177256,
        "id": "m07myi",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Watchlist 3-8-21 👀\n\nKEEP EYES ON CRUDE OIL – CRUDE is UP = MARKET DOWN\n\nDow futures rose on Sunday evening as a new stimulus package from Washington headed toward final passage this week . President Joe Biden is expected to sign it into law before unemployment aid programs expire on March 14.\n\n“10-year yields finally caught up to other asset markets. This is putting pressure on valuations, especially for the most expensive stocks that had reached nosebleed valuations,” Mike Wilson, the chief U.S. equity strategist at Morgan Stanley, said in a note.\n\nOn the economic front, investors will get a look at wholesale inventory data from January on Monday. Several economic measures in recent weeks have shown a recovery that is picking up steam, including a better-than-expected February jobs report released on Friday.\n\nHOT SECTORS:\n\n1. House Goods \\^PRPL \\^LCUT \\^LUG \\^SNBR\n2. Financial Technology \\^FUTU \\^MFH\n3. Homebuilding/ Households Goods \\^GMS \\^KNH \\^JELD \\^CNR\n4. Computers, Phones &amp; Household Electronics \\^WDC \\^DBD \\^HPQ \\^SCSC\n5. Oil &amp; Gas \\^HPR \\^WTI \\^CPE \\^PVAC\n6. Natural Gas Utilities \\^OGS \\^NWN \\^SWX \\^SJI\n\nAH RUNNERS TURN POTENTIAL PM GAPPERS: $ANCN $TKAT $ADPT $LOGC $SGBX $CAPR $GBS $OCGN\n\nOil &amp; Gas Drilling\n\nCrude oil is up 2.83% at $67\n\nWatching $RIG $ENSV $BORR $BTU $CDEV $MRO $OXY $APA $HAL $USEG $ICD $CEI $HUSA\n\nCRYPTO/BLOCKCHAIN PLAYS:\n\nBITCOIN OVER 50K\n\n$WKEY with BTC weekend run and news on Friday the market has not reacted to, WISeKey's WISeToken Utility Token, a Blockchain-Based Asset for Machine-to-Machine Interactions is Now Integrated into the Oracle Blockchain.\n\nSympathy/Related: #MOGO #NXTD #MGI #EQOS #BRQS #AIKI4 #IZEA #AEHL #DPW #PBTS #MARA #PHUN #RIOT #EBON #HIVE #BRQS #IPDN #SOS\n\nRENEWABLE ENERGY:\n\n$OEG has earnings coming up\n\n$TRCH has pending merger news\n\nSympathy/Related: #WWR #PECK #PLUG #CLSK #FCEL #SUNW #AMTX #PEIX #ENG #SPI #WATT #ALAC #OPTT #SYPR #CBAT #WWR\n\nTECHNICALS:\n\n$RKT - potential short squeeze. Ex Dividend date is 3/9.\n\n$LOTZ - trending on Stocktwits, potential WSB squeeze\n\nRumor\n\n$CLBS upgraded by Zacks to 10$. just changed trend and is climbing...\n\n$LMPX - LMP Announces Closings on its Stage 1 Acquisitions and Expects its Highest Revenue and Gross Profit this Month in the History of the Company.\n\n$AUVI – NEWS - SteriLumen tweeted that the LEDs in their devices have been proven to kill Coronavirus in seconds. Unusual volume on Friday and it seems to be on a uptrend. With the news it could see a jump to test resistance at the $9.64 and it breaks, the next line of resistance is $10.16.\n\n$SRNE Lee’s Pharmaceutical Announces its Anti-PD-L1 Antibody Socazolimab, Licensed From Sorrento Therapeutics, Receives Clearance to Start Phase 3 Trial as a First-line Treatment of Extensive-stage Small-Cell Lung Cancer\n\nALL look ready for a bounce solely based on oversold chart and stimulus plays\n\n&amp;#x200B;\n\n*Processing img kqf0s1podql61...*\n\nBack Burners: \\^BNGO \\^EYES \\^EARS \\^GHSI",
        "subreddit": "smallstreetbets",
        "title": "Watchlist 3-8-21 👀",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/m07myi/watchlist_3821/",
        "created": 1615206056.0
    },
    {
        "author": "pythonmine",
        "created_utc": 1614717027,
        "id": "lwbqt9",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "YOLOed on $HPQ - 10% growth in a week ain't bad",
        "url": "https://i.redd.it/e0yn4nu6dok61.jpg",
        "created": 1614745827.0
    },
    {
        "author": "tim202012",
        "created_utc": 1614794185,
        "id": "lx010u",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "need advice HPQ",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx010u/need_advice_hpq/",
        "created": 1614822985.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1614721491,
        "id": "lwdcn5",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, March 2, 2021**\n\nStocks retreated on Tuesday, pulling back after rallying yesterday, underscoring how volatile the market is right now. Market participants continue to focus on the Treasury yields, a new coronavirus vaccine from Johnson &amp; Johnson (JNJ), and additional stimulus from Washington. \n\nThe yield on the 10-year Treasury yield retreated to hover below 1.45% after spiking to a one-year high of 1.61% last week. The swift rise in interest rates last week spooked equity investors last week, with rates reflecting inflationary fears and impacting both corporate and consumer borrowing costs. Last week, during his testimony to Congress, Chair of the Federal Reserve Jerome Powell tried to temper fears over higher rates and inflationary pressures. He said,  rising Treasury yields are a statement of confidence on the part of markets that we’ll have a robust and ultimately complete \\[economic\\] recovery.” Central Bank officials from the United Kingdom and Australia echoed Powell’s sentiments and committed to maintaining accommodative fiscal policies. \n\nOver the weekend, the US Food and Drug Administration (FDA) granted emergency use authorization to Johnson &amp; Johnson’s (JNJ) single-dose coronavirus vaccine, making it the third vaccine approved in the US.  [The company has already begun shipping its COVID-19 vaccine ](https://www.jnj.com/johnson-johnson-announces-u-s-cdc-advisory-committee-recommends-first-single-shot-covid-19-vaccine-for-adults-18-and-older-in-u-s)and expects to deliver more than 100 million doses of the single-shot vaccines during the first half of 2021, including more than 20 million by the end of March. \n\nIn Washington D.C., Senate Majority Leader Chuck Schumer said the Senate is scheduled to begin debating the $1.9 trillion stimulus bill that the House of Representatives recently passed this week, though he did not specify when a vote would be held. \n\n**Highlights**\n\n* Rocket Mortgage (RKT) soared over 70% today, sending the stock to record highs and continuing a dizzying rally in the last few days. Shares were even halted at one point today. In a note to clients, S3 Analytics said, “RKT’s stock price and short selling activity is reminiscent of another recent high flying meme stock – GameStop Inc (GME). Both stocks saw their share price spike due to high retail buying interest (predominantly due to significant social media activity) and an options based gamma squeeze. Both stocks also had/have relatively high short interest and high stock borrow rates which imply strong short-selling demand and limited stock borrow supply.\"\n* After posting strong earnings and rising more than 8% after-hours yesterday, Zoom’s (ZM) stock price cratered today, with the stock going from 8% up to more than 9% down in today’s session.\n* After posting disappointing earnings, NIO’s stock also cratered today, falling more than 12% in today’s session.\n* After the recent controversies, Alibaba (BABA) co-founder Jack MA is now the fourth richest person in China, falling from first place. \n* In a memo to employees, Ant Group’s executive chairman Eric Jing said an IPO was still in the cards.\n* Vizio Holdings, a maker of smart TVs, has filed for an IPO. The company has sold 82.2 million televisions and 11.8 million sound bars since its founding in 2002, the prospectus said.\n* \\***Please note current stock prices were written in the morning pre-market and do not reflect intraday volatility.**\n* C3 AI (AI) target raised by Needham &amp; Co from $193 to $195 at Buy. Stock currently around $121\n* Broadcom (AVGO) target raised by Credit Suisse from $480 to $580 at Outperform. Stock currently around $490\n* Biohaven Pharma (BHVN) target raised by Mizuho from $93 to $103 at Buy. Stock currently around $86\n* Catalent (CTLT) target raised by Argus from $130 to $140 at Buy. Stock currently around $116\n* Intuit (INTU) with a host of target raises. Consensus price target around $450 at Buy. Stock currently around $406\n* Jazz Pharma (JAZZ) target raised by Piper Sandler frm $175 to $205 at Overweight. Stock currently around $169\n* Logitech (LOGI) target raised by Morgan Stanley from $116 to $122 at Overweight. Stock currently around $107.50\n* Oshkosh (OSK) with two target raises. Stock currently around $110. \n   * Citigroup from $100 to $130 at Buy\n   * Raymond James from $100 to $125 at Outperform\n* Palo Alto Networks (PANW) with two target raises. Stock currently around $367\n   * Mizuho from $450 to $475 at Buy\n   * Argus from $410 to $440 at Buy\n* Snapchat (SNAP) with a host of target raises. Consensus price target around $80 at Buy. Stock currently around $67\n* Square (SQ) with a host of target raises. Consensus price target around $300 at Buy. Stock currently around $241\n* Sarepta Therapeutics (SRPT) target raised by SVB Leerink from $125 to $126 at Outperform. Stock currently around $87\n* Workday (WDAY) target raised by Jefferies Financial from $280 to $325 at Buy. Stock currently around $252\n\n“The true investor welcomes volatility ... a wildly fluctuating market means that irrationally low prices will periodically be attached to solid businesses.” - Warren Buffet",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Tuesday, March 2, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/lwdcn5/here_is_a_market_recap_for_today_tuesday_march_2/",
        "created": 1614750291.0
    }
]