[
    {
        "author": "willyumn",
        "created_utc": 1617320661,
        "id": "mi84qf",
        "num_comments": 267,
        "num_crossposts": 0,
        "selftext": "For context, I'm 22, make $25/hr but have pretty much no bills since I live with my parents, so my risk tolerance is pretty high. I have about 55 shares of Tesla after \"un-diversifying\" and selling all my other stock. I'm pretty much all in. I cannot find any other company that i can put my money in where growth is seemingly inevitable. I do own bitcoin but what are some equities that I can purchase over the next few months, or all at once with 10k cash? \n\nI have a tiny % of my portfolio in Oracle, Trimble, Crispr, Upstart, Square, Paypal, to give you an idea of what types of stocks I'm attracted to. (data, fintech, autonomy). I'm averse to companies with binary outcomes like bio, pharma, etc. Any interesting leads? :)",
        "subreddit": "stocks",
        "title": "Where should I put $10k?",
        "url": "https://www.reddit.com/r/stocks/comments/mi84qf/where_should_i_put_10k/",
        "created": 1617349461.0
    },
    {
        "author": "Ironleg01",
        "created_utc": 1617615806,
        "id": "mkgvvq",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "This is great article from Seeking Alpha but since it's against the rules to link SA articles here I'll just copy/paste.\n\n**Vertical Software.** Analyst Jason Celino thinks the plan would \"accelerate digitization opportunities across the architecture and construction industry.\"\n\n1. **Bentley Systems** (NASDAQ:BSY) gets 60% of total revenue from infrastructure, so the plan could lead to \"meaningful multiyear tailwinds.\"\n2. **Autodesk** (NASDAQ:ADSK) exposure to infrastructure of 15-20% of revenue and the \"completion of its Innoyze acquisition, providing solutions for water infrastructure assets, gives us incremental confidence.\"\n3. **Trimble** (NASDAQ:TRMB) has 25-30% of revenue from infrastructure \"geospatial, construction, and civil engineering offerings are well positioned.\"\n\n**Communication Services.** Analyst Brandon Nispel says the bill \"is positive for infrastructure providers (tower operators) and neutral to negative for network providers (wireless carriers and cable operators).\"\n\n1. **American Tower** (NYSE:AMT), **Crown Castle** (NYSE:CCI), **SBA Communications** (NASDAQ:SBAC) are picks in towers, which will be helped by improving investment in wireless networks.\n2. **Altice USA** (NYSE:ATUS), **Cable One** (NYSE:CABO), **Charter Communications** (NASDAQ:CHTR), **Comcast** (NASDAQ:CMCSA), **WildOpenWest** (NYSE:WOW) may see a hit to discretionary cash flow due to a higher corporate tax rate.\n3. **AT&amp;T*\" (NYSE:T), **T-Mobile U.S.** (NASDAQ:TMUS) and **Verizon** (NYSE:VZ) are the most at risk of a corporate tax rate hike, with T and VZ seeing incremental taxes of $1.5B to $2B.\n\n**Entertainment and Video Games.** Analyst Tyler Parker says the plan for bringing high-speed broadband to every American will help domestic online vide games\n\n1. **Activision** (NASDAQ:ATVI), **Electronic Arts** (NASDAQ:EA), **Take-Two Interactive** (NASDAQ:TTWO) and **Ubisoft** (UBISFY) could see tailwinds.\n\n**Semiconductors.** Analysts John Vinh and Wes Twigg say \"expansion incentives would likely be a tailwind for semiconductor equipment demand while easing the capex burden on manufacturers.\"\n\n1. **Applied Materials** (NASDAQ:AMAT), **ASML** (NASDAQ:ASML), **Advanced Energy Industries** (NASDAQ:AEIS), KLA (NASDAQ:KLAC), **Lam Research** (NASDAQ:LRCX) and **Teradyne** (NASDAQ:TER) would benefit in equipment names.\n2. **Analog Devices** (NASDAQ:ADI), **Intel** (NASDAQ:INTC), **Micron** (NASDAQ:MU), **ON Semiconductor** (NASDAQ:ON) and **Texas Instruments** (NASDAQ:TXN) are picks among those with domestic manufacturing footprints.\n\n**Utilities.** Analyst Sophie Karp notes the majority of the impact on the sector would not come from direct spending, but from fiscal incentives.\n\n1. **American Electric Power** (NASDAQ:AEP), **Southern** (NYSE:SO), **Duke Energy** (NYSE:DUK), **Dominion Energy** (NYSE:D), **Entergy** (NYSE:ETR) and **Edison International** (NYSE:EIX) can benefit from incremental grid investment initiatives and electrifications trends from an EV tide that will \"lift all boats.\"\n2. **Eversource Energy** (NYSE:ES), **Avangrid** (NYSE:AGR), **Public Service Enterprise Group** (NYSE:PEG), **NextEra Energy** (NYSE:NEE), **Xcel Energy** (NASDAQ:XEL), **AEP**, **Sunrun** (NASDAQ:RUN), **Sunova Energy** (NYSE:NOVA) will be helped by the extension of the investment tax credit and the production tax credit further boosting commercial solar and wind.\n3. **Public Service Enterprise Group*\" (PEG), **Excelon** (NASDAQ:EXC) and **Energy Harbor** (OTCPK:ENGH) would benefit from any concrete federal program to support nuclear energy.\n4. **First Solar** (NASDAQ:FSLR) may get a boost if solar installers can bypass Chinese tariffs.\n\n**Oil and Gas Exploration and Production.** Analyst Leo Mariani says the plan \"is likely to have a bit of a long-term negative for traditional U.S. oil E&amp;Ps if it accelerates the transition away from fossil fuels for transportation purposes, but we generally think that other variables that normally impact the price of oil over the next few years are much more likely to affect energy stocks as opposed to the impacts of this bill, which will take a healthy part of this decade and into the next to make a material impact.\"\n\n**Life Science Tools.** Analyst Paul Knight says \"a specific call-out of 'biotechnology' as a key technology investment is positive.\"",
        "subreddit": "stocks",
        "title": "Best stocks for Biden's infrastructure plan",
        "url": "https://www.reddit.com/r/stocks/comments/mkgvvq/best_stocks_for_bidens_infrastructure_plan/",
        "created": 1617644606.0
    },
    {
        "author": "boredlearning1234",
        "created_utc": 1618406119,
        "id": "mqqc57",
        "num_comments": 92,
        "num_crossposts": 0,
        "selftext": "Hi everyone, long time viewer of this forum but first time poster. Back in April 2020 at 22 years old, I decided to take a chance while laid off for COVID to invest a lot of my savings into the market and it’s paid off well, I’m up ~35% on my original investment to date. But now I’m really torn some of the stocks I’m holding have considerable gains: ENB, TD, and MFC which all have a ~30-35% gain to date in my account and all pay dividends &amp; AC which I’m up 58% on to date. My issue is, I am now struggling to want to buy more of these stocks because the cost is so much higher now than it was before so I would be averaging up significantly but, I’m also struggling to sell them because I know they are “hold forever” type of stocks. \n\nI am worried I’m going to become stagnant in my investments because I’m adverse to purchasing more knowing I’ll probably never get gains like this again, but I know I need to purchase more in order to grow my account. I recently purchased RY, GWO, TRMB, &amp; IFC, and really just not the bullet and tried to look past the high pricing but I struggle knowing I’m only going to see an average return these days (Although I’m up 15% on Trimble). I also constantly wonder about the “bubble” people are talking about, and I’ve kept a significant amount of cash out of the market because I’m nervous to continue to invest and lose it, knowing I’ve been so lucky for so long and peoples luck can sometimes run out. Does anyone have any similar experience and if so, can you provide me with some advice on how you look past the significant higher purchasing price now and how to stop psyching myself out? \n\nI do not need the money right now from the gains, I have a car loan and a student loan totalling about $32000, but they are both 0% interest so I am less inclined to pull money out of my investments to pay them off instead I am just making more than the monthly payments to pay them off faster. The only reason I consider selling these stocks is to lock in the gains or because I convince myself I’m only holding them due to being greedy and I’m going to lose all my gains one day and that maybe we are in a bubble. \n\nSorry if this is wordy and rambling, I am just really at a point where I feel almost stuck and I need some help on how to get past that feeling. P.S. I did not name all of my holdings, just the ones I find relevant for this post.",
        "subreddit": "CanadianInvestor",
        "title": "I Bought Dividend Stocks at the Bottom, Now I’m torn...",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/mqqc57/i_bought_dividend_stocks_at_the_bottom_now_im_torn/",
        "created": 1618434919.0
    },
    {
        "author": "Equivalent-Branch850",
        "created_utc": 1617652302,
        "id": "mkt948",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Trading in the new space exploration ETF from Ark Invest began on Tuesday, as Cathie Wood’s firm looks to tap the growing space industry.\n\n“Space is already an invisible backbone to our economy and we think that’s only going to become more so as [satellite] constellations launch,” Ark Invest analyst Sam Korus told CNBC’s Morgan Brennan on “Power Lunch.”\n\nShares of ARKX slipped about 1% in its first day of trading, with the stock closing at $20.30 a share.\n\nARKX’s 39 stocks includes pure-play space companies like Iridium and Virgin Galactic, as well as defense and aerospace giants such as Kratos, L3Harris, Lockheed Martin and Boeing.\n\nBut the ETF also includes names not traditionally connected to the space industry, such Chinese e-commerce firms JD.com and Alibaba, or agriculture businesses like Trimble and Deere.\n\n“We’ve all seen the memes going around on Twitter,” Korus said, acknowledging public skepticism of ARKX’s holdings.\n\n“The fact that people are dismissing this out of hand is very reassuring to us, and kind of demonstrates the type of research that we’re doing and how we can be unique,” he added.\n\nKorus gave the example of Netflix, which has a 1.25% weighting in ARKX.\n\n“Netflix ... has 200 million paying subscribers. In the U.S. alone, there’s over 40 million people who don’t have access to broadband and so, if a satellite solution can bring access to those customers and expand the addressable market and the topline for Netflix, then this is something that is very important,” Korus said.\n\nWhile none of the seven SPACs that recently announced mergers with space companies are in ARKX, Korus noted that Ark is “constantly evaluating these companies.”\n\n“I think with SPACs it’s important to remember that a lot these are almost at the pre-IPO stage,” Korus said. “We really want to be sure that we’re picking the winners long term, particularly in aerospace – where many companies do go bust and things get delayed.”",
        "subreddit": "investing",
        "title": "Ark Invest’s space exploration ETF ARKX begins trading today, slips 1%",
        "url": "https://www.reddit.com/r/investing/comments/mkt948/ark_invests_space_exploration_etf_arkx_begins/",
        "created": 1617681102.0
    },
    {
        "author": "GardenCat1551",
        "created_utc": 1619798948,
        "id": "n1x4tu",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Hello!  I'm very inexperienced with chart patterns and I just wanted to ask.  Does 1 cent of difference between two points turn an ascending triangle into a rising wedge?  \n\nI was trying to interpret TRMBs movements.  It took a big dive today and earnings is next week... \n\n&amp;#x200B;\n\nThe last two highpoint have a .01 difference in their opening values, but around .75 cent difference in the daily high... I was wondering what value I should use when drawing the pattern.  Either way I'm also wondering if that small of a difference would constitute a wedge as opposed to an ascending triangle... thanks!",
        "subreddit": "StockMarket",
        "title": "Q: Rising Wedge vs Ascending Triangle: Specifically on TRMB",
        "url": "https://www.reddit.com/r/StockMarket/comments/n1x4tu/q_rising_wedge_vs_ascending_triangle_specifically/",
        "created": 1619827748.0
    },
    {
        "author": "nobjos",
        "created_utc": 1617370884,
        "id": "mikm42",
        "num_comments": 378,
        "num_crossposts": 0,
        "selftext": "**Preamble:** One of the main questions that I had and I see recurring on this sub is how to identify and invest in emerging stocks before it becomes mainstream news. I did not have the time to actively track social media and decided to build a program that does it for me.\n\n**How it works:** The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth. I added sentiment analysis to the findings so as to check the general sentiment (whether what is being talked about the stock is positive or negative).\n\nHere is the stock picked by the program and my DD\n\n**Stock:**   **Taiwan Semiconductor Manufacturing Company ($TSM)**\n\nWeek on Week increase in mentions: **130%**\n\nMonth on Month increase in mentions: **324%**\n\nAverage sentiment across mentions: **+29.5%**\n\n**DD**\n\n**Core Product**\n\nTSMC was founded in 1987 by Morris Chang, who previously had worked in Texas Instruments. TSMC can be considered as possibly the most important company in the world that few people have heard of. This is because it is practically a chokepoint of the $470 Billion semiconductor industry and is instrumental in supplying chips to almost all the major players. Currently, the company supplies to Apple for their A14 chips and ARM-based chips for their Mac products, Qualcomm, MediaTek, AMD, Intel, and Nvidia.\n\nThe company is the world’s largest semiconductor foundry. They are in the pure-play foundry business. This means that they do not produce any processors for their own products but they manufacture and sell chips to companies such as AMD, Intel, and Apple. The main reason for which companies such as Apple and AMD source chips from TSMC is that they do not have to build their own expensive silicon fabrication plants (the CapEx of the plans run into 10s of billions of dollars and it takes an extremely long time to set up) to manufacture their chips. TSMC is currently the world’s 11th largest company by market capitalization ($554 B).\n\n&amp;#x200B;\n\n[TSMC absolutely dominates the advanced chip market ](https://preview.redd.it/qx1btw29krq61.png?width=624&amp;format=png&amp;auto=webp&amp;s=61ce94bf883480c99f5e74a43bdea79bbf9d4d9f)\n\nAs you can see from the above chart, TSMC absolutely dominates the advanced chip market (&lt;10nm, think phone processors) which also has the highest margins. The company effectively controls more than half (54% to be exact) of the world’s made-to-order chip market.\n\n**Financials**\n\nTSMC posted its best-ever quarter in Q4’20 with revenues jumping 22% to a record $12.68 Billion and profits increasing 23% to $5.1 Billion. They are also expected to invest heavily this year with capital expenditure for production and development of advanced chips to be between $25-$28 Billion. (60% higher than the amount TSMC spend in 2020)\n\nThey also have a very strong financial position with $23 Billion in cash vs a long-term liability of only $10 billion (YE 2020). The company has also predicted a record first-quarter revenue between $12.7 Billion and $13 Billion, which is almost a 30% growth from the same period last year. We do have to note that their share price has jumped more than 140% over the past 12 months giving it the current valuation of $554 Billion.\n\n**Potential and Hype Factors**\n\n**Technology moat:** Compared to peers, TSMC is easily the leader in chip production technology. The company has delivered over 1 Billion 7nm chips by 2020 whereas Intel is still trying to master its 7nm development process. For those who are unaware of chip manufacturing, in general, the smaller the node size (measured in nanometer (nm)), the better the performance and power management. This is why the companies making the top-end chips want the smallest node size available.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/w6mw9ehakrq61.png?width=624&amp;format=png&amp;auto=webp&amp;s=a70944796b31b7b971e743f497854c29d9b797d1\n\nTSMC is currently in the process of producing 5nm chips (20% of their total wafer revenue) and is already ramping up for 3nm production by the end of 2022. It takes a long time to spin up a new silicon fabrication factory (3-4 years is the average time it takes for a factory to go from planning to production).\n\nThis leadership in technology would be one of the key drivers for growth in the coming years. The $28 Billion Capex spending also reflects on the management’s confidence about the long-term demand for the advanced chips.\n\n**Strong long-term demand:** Even though the current shortage faced by automakers is mainly due to a supply chain issue, cars, in general, are getting more and more complicated and EV’s tend to need better hardware and chips. This will force the automakers to rush to lock in future supply. Even though the margins produced from the auto-chips are not as high as the phones/laptops, the producers of the chips are definitely going to benefit in the long run.\n\n**Risk and Competition**\n\nThere are multiple risks associated with TSMC. First and foremost, at the current valuation, the stock is definitely not cheap. The current PE ratio is 33 which puts them in the same bucket as Apple and AMD. While this might be representative of their future growth potential, it is on the higher side for a manufacturing company.\n\nThe company might face a short-term crisis in production as Taiwan is currently facing its most severe water shortage in 56 years. Taiwan’s chipmakers have begun stocking up on truckloads of water to prepare for shortages. During a similar drought in 2015, Taiwan was forced to implement water restrictions for industrial companies. This can cause a significant impact on the top and bottom line as TSMC is currently producing at 100% capacity. A weakening USD can also have a significant impact on TSMC’s EPS as \\~99% of their sales are in US dollars whereas only 15% of its COGS is in US dollars.\n\nA long-term risk for TSMC is that their increasingly dominant position in chip manufacturing is starting to attract political attention. The current shock from the auto chip shortage is forcing governments to bring vital supply chains back into their countries in order to make them less vulnerable to disruption. In the US, lawmakers are citing the chip shortage as proof that the country needs to revive more semiconductor manufacturing at home. This has forced TSMC to build a $12 billion plant in Arizona. This political climate can be beneficial for Intel, given their current foray into fabrication. (I do not think Intel can effectively compete with TSMC in fabrication without significant help in trade restrictions. As we can see from the process roadmap, Intel is currently years behind TSMC in the manufacturing process and they could not make their products work even when they had the best process technology years back)\n\n**Conclusion**\n\nTSMC is currently one of the world’s largest companies and they are definitely not resting on their laurels. They have been continuously working on building more capacity and advancing their nodes. Even though there are some short-term and long-term risks in terms of their exposure to the US dollar, rising geopolitical tensions, etc., I believe TSMC’s current technological moat, a monopoly level market share in advanced chips, and the rising use of smartphones and IoT devices put TSMC in a very strong position over the long term!\n\n*Disclaimer: I am not a financial advisor. I currently do not own any stock of TSM. Please do your own extensive research before investing in any stock*",
        "subreddit": "wallstreetbets",
        "title": "I built a program that tracks mentions and sentiment of stocks across Reddit and Twitter to find rising stocks! This week's top stock and its DD: Taiwan Semiconductor ($TSM)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/",
        "created": 1617399684.0
    },
    {
        "author": "Ironleg01",
        "created_utc": 1617615806,
        "id": "mkgvvq",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "This is great article from Seeking Alpha but since it's against the rules to link SA articles here I'll just copy/paste.\n\n**Vertical Software.** Analyst Jason Celino thinks the plan would \"accelerate digitization opportunities across the architecture and construction industry.\"\n\n1. **Bentley Systems** (NASDAQ:BSY) gets 60% of total revenue from infrastructure, so the plan could lead to \"meaningful multiyear tailwinds.\"\n2. **Autodesk** (NASDAQ:ADSK) exposure to infrastructure of 15-20% of revenue and the \"completion of its Innoyze acquisition, providing solutions for water infrastructure assets, gives us incremental confidence.\"\n3. **Trimble** (NASDAQ:TRMB) has 25-30% of revenue from infrastructure \"geospatial, construction, and civil engineering offerings are well positioned.\"\n\n**Communication Services.** Analyst Brandon Nispel says the bill \"is positive for infrastructure providers (tower operators) and neutral to negative for network providers (wireless carriers and cable operators).\"\n\n1. **American Tower** (NYSE:AMT), **Crown Castle** (NYSE:CCI), **SBA Communications** (NASDAQ:SBAC) are picks in towers, which will be helped by improving investment in wireless networks.\n2. **Altice USA** (NYSE:ATUS), **Cable One** (NYSE:CABO), **Charter Communications** (NASDAQ:CHTR), **Comcast** (NASDAQ:CMCSA), **WildOpenWest** (NYSE:WOW) may see a hit to discretionary cash flow due to a higher corporate tax rate.\n3. **AT&amp;T*\" (NYSE:T), **T-Mobile U.S.** (NASDAQ:TMUS) and **Verizon** (NYSE:VZ) are the most at risk of a corporate tax rate hike, with T and VZ seeing incremental taxes of $1.5B to $2B.\n\n**Entertainment and Video Games.** Analyst Tyler Parker says the plan for bringing high-speed broadband to every American will help domestic online vide games\n\n1. **Activision** (NASDAQ:ATVI), **Electronic Arts** (NASDAQ:EA), **Take-Two Interactive** (NASDAQ:TTWO) and **Ubisoft** (UBISFY) could see tailwinds.\n\n**Semiconductors.** Analysts John Vinh and Wes Twigg say \"expansion incentives would likely be a tailwind for semiconductor equipment demand while easing the capex burden on manufacturers.\"\n\n1. **Applied Materials** (NASDAQ:AMAT), **ASML** (NASDAQ:ASML), **Advanced Energy Industries** (NASDAQ:AEIS), KLA (NASDAQ:KLAC), **Lam Research** (NASDAQ:LRCX) and **Teradyne** (NASDAQ:TER) would benefit in equipment names.\n2. **Analog Devices** (NASDAQ:ADI), **Intel** (NASDAQ:INTC), **Micron** (NASDAQ:MU), **ON Semiconductor** (NASDAQ:ON) and **Texas Instruments** (NASDAQ:TXN) are picks among those with domestic manufacturing footprints.\n\n**Utilities.** Analyst Sophie Karp notes the majority of the impact on the sector would not come from direct spending, but from fiscal incentives.\n\n1. **American Electric Power** (NASDAQ:AEP), **Southern** (NYSE:SO), **Duke Energy** (NYSE:DUK), **Dominion Energy** (NYSE:D), **Entergy** (NYSE:ETR) and **Edison International** (NYSE:EIX) can benefit from incremental grid investment initiatives and electrifications trends from an EV tide that will \"lift all boats.\"\n2. **Eversource Energy** (NYSE:ES), **Avangrid** (NYSE:AGR), **Public Service Enterprise Group** (NYSE:PEG), **NextEra Energy** (NYSE:NEE), **Xcel Energy** (NASDAQ:XEL), **AEP**, **Sunrun** (NASDAQ:RUN), **Sunova Energy** (NYSE:NOVA) will be helped by the extension of the investment tax credit and the production tax credit further boosting commercial solar and wind.\n3. **Public Service Enterprise Group*\" (PEG), **Excelon** (NASDAQ:EXC) and **Energy Harbor** (OTCPK:ENGH) would benefit from any concrete federal program to support nuclear energy.\n4. **First Solar** (NASDAQ:FSLR) may get a boost if solar installers can bypass Chinese tariffs.\n\n**Oil and Gas Exploration and Production.** Analyst Leo Mariani says the plan \"is likely to have a bit of a long-term negative for traditional U.S. oil E&amp;Ps if it accelerates the transition away from fossil fuels for transportation purposes, but we generally think that other variables that normally impact the price of oil over the next few years are much more likely to affect energy stocks as opposed to the impacts of this bill, which will take a healthy part of this decade and into the next to make a material impact.\"\n\n**Life Science Tools.** Analyst Paul Knight says \"a specific call-out of 'biotechnology' as a key technology investment is positive.\"",
        "subreddit": "stocks",
        "title": "Best stocks for Biden's infrastructure plan",
        "url": "https://www.reddit.com/r/stocks/comments/mkgvvq/best_stocks_for_bidens_infrastructure_plan/",
        "created": 1617644606.0
    },
    {
        "author": "nobjos",
        "created_utc": 1617629862,
        "id": "mkkw54",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I had posted the previous picks from my program and my analysis here and the response I received was amazing. I have been working on improving the program and have made the program public.\n\nHow it works: The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth and increasing chatter.\n\nHere is the stock picked by the program and my DD\n\n**Stock:** **Taiwan Semiconductor Manufacturing Company ($TSM)**\n\nWeek on Week increase in mentions: **130%**\n\nMonth on Month increase in mentions: **324%**\n\nAverage sentiment across mentions: **+29.5%**\n\n**DD**\n\n**Core Product**\n\nTSMC was founded in 1987 by Morris Chang, who previously had worked in Texas Instruments. TSMC can be considered as possibly the most important company in the world that few people have heard of. This is because it is practically a chokepoint of the $470 Billion semiconductor industry and is instrumental in supplying chips to almost all the major players. Currently, the company supplies to Apple for their A14 chips and ARM-based chips for their Mac products, Qualcomm, MediaTek, AMD, Intel, and Nvidia.\n\nThe company is the world’s largest semiconductor foundry. They are in the pure-play foundry business. This means that they do not produce any processors for their own products but they manufacture and sell chips to companies such as AMD, Intel, and Apple. The main reason for which companies such as Apple and AMD source chips from TSMC is that they do not have to build their own expensive silicon fabrication plants (the CapEx of the plans run into 10s of billions of dollars and it takes an extremely long time to set up) to manufacture their chips. TSMC is currently the world’s 11th largest company by market capitalization ($554 B).\n\n[TSM Dominates in the advanced chip market](https://imgur.com/YImkCdg)\n\n As you can see from the above chart, TSMC absolutely dominates the advanced chip market (&lt;10nm, think phone processors) which also has the highest margins. The company effectively controls more than half (54% to be exact) of the world’s made-to-order chip market.\n\n**Financials**\n\nTSMC posted its best-ever quarter in Q4’20 with revenues jumping 22% to a record $12.68 Billion and profits increasing 23% to $5.1 Billion. They are also expected to invest heavily this year with capital expenditure for production and development of advanced chips to be between $25-$28 Billion. (60% higher than the amount TSMC spend in 2020)\n\nThey also have a very strong financial position with $23 Billion in cash vs a long-term liability of only $10 billion (YE 2020). The company has also predicted a record first-quarter revenue between $12.7 Billion and $13 Billion, which is almost a 30% growth from the same period last year. We do have to note that their share price has jumped more than 140% over the past 12 months giving it the current valuation of $554 Billion.\n\n**Potential and Hype Factors**\n\n**Technology moat:** Compared to peers, TSMC is easily the leader in chip production technology. The company has delivered over 1 Billion 7nm chips by 2020 whereas Intel is still trying to master its 7nm development process. For those who are unaware of chip manufacturing, in general, the smaller the node size (measured in nanometer (nm)), the better the performance and power management. This is why the companies making the top-end chips want the smallest node size available.\n\n[Current status of foundry roadmap!](https://imgur.com/q7NKNgA)\n\n TSMC is currently in the process of producing 5nm chips (20% of their total wafer revenue) and is already ramping up for 3nm production by the end of 2022. It takes a long time to spin up a new silicon fabrication factory (3-4 years is the average time it takes for a factory to go from planning to production).\n\nThis leadership in technology would be one of the key drivers for growth in the coming years. The $28 Billion Capex spending also reflects on the management’s confidence about the long-term demand for the advanced chips.\n\n**Strong long-term demand:** Even though the current shortage faced by automakers is mainly due to a supply chain issue, cars, in general, are getting more and more complicated and EV’s tend to need better hardware and chips. This will force the automakers to rush to lock in future supply. Even though the margins produced from the auto-chips are not as high as the phones/laptops, the producers of the chips are definitely going to benefit in the long run.\n\n**Risk and Competition**\n\nThere are multiple risks associated with TSMC. First and foremost, at the current valuation, the stock is definitely not cheap. The current PE ratio is 33 which puts them in the same bucket as Apple and AMD. While this might be representative of their future growth potential, it is on the higher side for a manufacturing company.\n\nThe company might face a short-term crisis in production as Taiwan is currently facing its most severe water shortage in 56 years. Taiwan’s chipmakers have begun stocking up on truckloads of water to prepare for shortages. During a similar drought in 2015, Taiwan was forced to implement water restrictions for industrial companies. This can cause a significant impact on the top and bottom line as TSMC is currently producing at 100% capacity. A weakening USD can also have a significant impact on TSMC’s EPS as \\~99% of their sales are in US dollars whereas only 15% of its COGS is in US dollars.\n\nA long-term risk for TSMC is that their increasingly dominant position in chip manufacturing is starting to attract political attention. The current shock from the auto chip shortage is forcing governments to bring vital supply chains back into their countries in order to make them less vulnerable to disruption. In the US, lawmakers are citing the chip shortage as proof that the country needs to revive more semiconductor manufacturing at home. This has forced TSMC to build a $12 billion plant in Arizona. This political climate can be beneficial for Intel, given their current foray into fabrication. (I do not think Intel can effectively compete with TSMC in fabrication without significant help in trade restrictions. As we can see from the process roadmap, Intel is currently years behind TSMC in the manufacturing process and they could not make their products work even when they had the best process technology years back)\n\n**Conclusion**\n\nTSMC is currently one of the world’s largest companies and they are definitely not resting on their laurels. They have been continuously working on building more capacity and advancing their nodes. Even though there are some short-term and long-term risks in terms of their exposure to the US dollar, rising geopolitical tensions, etc., I believe TSMC’s current technological moat, a monopoly level market share in advanced chips, and the rising use of smartphones and IoT devices put TSMC in a very strong position over the long term!\n\n*Disclaimer: I am not a financial advisor. I currently do not own any stock of TSM. Please do your own extensive research before investing in any stock*",
        "subreddit": "stocks",
        "title": "I analyze mentions and sentiment of stocks across social media to find stocks! This week's top stock and its DD: Taiwan Semiconductor ($TSM)",
        "url": "https://www.reddit.com/r/stocks/comments/mkkw54/i_analyze_mentions_and_sentiment_of_stocks_across/",
        "created": 1617658662.0
    },
    {
        "author": "nobjos",
        "created_utc": 1617371010,
        "id": "miknjx",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I had posted the previous picks from my program and my analysis here and the response I received was amazing. I have been working on improving the program and have made the program public.\n\nHow it works: The program is built using Python and uses both Twitter and Reddit API to stream comments and tweets and spot tickers that are exhibiting accelerated growth and increasing chatter.\n\n**Stock: Taiwan Semiconductor Manufacturing Company ($TSM)**\n\nWeek on Week increase in mentions: **130%**\n\nMonth on Month increase in mentions: **324%**\n\nAverage sentiment across mentions: **+29.5%**\n\n**DD**\n\n**Core Product**\n\nTSMC was founded in 1987 by Morris Chang, who previously had worked in Texas Instruments. TSMC can be considered as possibly the most important company in the world that few people have heard of. This is because it is practically a chokepoint of the $470 Billion semiconductor industry and is instrumental in supplying chips to almost all the major players. Currently, the company supplies to Apple for their A14 chips and ARM-based chips for their Mac products, Qualcomm, MediaTek, AMD, Intel, and Nvidia.\n\nThe company is the world’s largest semiconductor foundry. They are in the pure-play foundry business. This means that they do not produce any processors for their own products but they manufacture and sell chips to companies such as AMD, Intel, and Apple. The main reason for which companies such as Apple and AMD source chips from TSMC is that they do not have to build their own expensive silicon fabrication plants (the CapEx of the plans run into 10s of billions of dollars and it takes an extremely long time to set up) to manufacture their chips. TSMC is currently the world’s 11th largest company by market capitalization ($554 B).\n\n[link](https://imgur.com/a/xjIQeh4) for pure-play foundry revenue split (2020)\n\nAs you can see from the above chart, TSMC absolutely dominates the advanced chip market (&lt;10nm, think phone processors) which also has the highest margins. The company effectively controls more than half (54% to be exact) of the world’s made-to-order chip market.\n\n**Financials**\n\nTSMC posted its best-ever quarter in Q4’20 with revenues jumping 22% to a record $12.68 Billion and profits increasing 23% to $5.1 Billion. They are also expected to invest heavily this year with capital expenditure for production and development of advanced chips to be between $25-$28 Billion. (60% higher than the amount TSMC spend in 2020)\n\nThey also have a very strong financial position with $23 Billion in cash vs a long-term liability of only $10 billion (YE 2020). The company has also predicted a record first-quarter revenue between $12.7 Billion and $13 Billion, which is almost a 30% growth from the same period last year. We do have to note that their share price has jumped more than 140% over the past 12 months giving it the current valuation of $554 Billion.\n\n**Potential and Hype Factors**\n\n**Technology moat:** Compared to peers, TSMC is easily the leader in chip production technology. The company has delivered over 1 Billion 7nm chips by 2020 whereas Intel is still trying to master its 7nm development process. For those who are unaware of chip manufacturing, in general, the smaller the node size (measured in nanometer (nm)), the better the performance and power management. This is why the companies making the top-end chips want the smallest node size available.\n\n[link](https://imgur.com/a/UCg09sC) for current standings of different companies in the foundry process roadmaps\n\nTSMC is currently in the process of producing 5nm chips (20% of their total wafer revenue) and is already ramping up for 3nm production by the end of 2022. It takes a long time to spin up a new silicon fabrication factory (3-4 years is the average time it takes for a factory to go from planning to production).\n\nThis leadership in technology would be one of the key drivers for growth in the coming years. The $28 Billion Capex spending also reflects on the management’s confidence about the long-term demand for the advanced chips.\n\n**Strong long-term demand:** Even though the current shortage faced by automakers is mainly due to a supply chain issue, cars, in general, are getting more and more complicated and EV’s tend to need better hardware and chips. This will force the automakers to rush to lock in future supply. Even though the margins produced from the auto-chips are not as high as the phones/laptops, the producers of the chips are definitely going to benefit in the long run.\n\n**Risk and Competition**\n\nThere are multiple risks associated with TSMC. First and foremost, at the current valuation, the stock is definitely not cheap. The current PE ratio is 33 which puts them in the same bucket as Apple and AMD. While this might be representative of their future growth potential, it is on the higher side for a manufacturing company.\n\nThe company might face a short-term crisis in production as Taiwan is currently facing its most severe water shortage in 56 years. Taiwan’s chipmakers have begun stocking up on truckloads of water to prepare for shortages. During a similar drought in 2015, Taiwan was forced to implement water restrictions for industrial companies. This can cause a significant impact on the top and bottom line as TSMC is currently producing at 100% capacity. A weakening USD can also have a significant impact on TSMC’s EPS as \\~99% of their sales are in US dollars whereas only 15% of its COGS is in US dollars.\n\nA long-term risk for TSMC is that their increasingly dominant position in chip manufacturing is starting to attract political attention. The current shock from the auto chip shortage is forcing governments to bring vital supply chains back into their countries in order to make them less vulnerable to disruption. In the US, lawmakers are citing the chip shortage as proof that the country needs to revive more semiconductor manufacturing at home. This has forced TSMC to build a $12 billion plant in Arizona. This political climate can be beneficial for Intel, given their current foray into fabrication. (I do not think Intel can effectively compete with TSMC in fabrication without significant help in trade restrictions. As we can see from the process roadmap, Intel is currently years behind TSMC in the manufacturing process and they could not make their products work even when they had the best process technology years back)\n\n**Conclusion**\n\nTSMC is currently one of the world’s largest companies and they are definitely not resting on their laurels. They have been continuously working on building more capacity and advancing their nodes. Even though there are some short-term and long-term risks in terms of their exposure to the US dollar, rising geopolitical tensions, etc., I believe TSMC’s current technological moat, a monopoly level market share in advanced chips, and the rising use of smartphones and IoT devices put TSMC in a very strong position over the long term!\n\n*Disclaimer: I am not a financial advisor. I currently do not own any stock of TSM. Please do your own extensive research before investing in any stock*",
        "subreddit": "stocks",
        "title": "I analyze mentions and sentiment across social media to find rising stocks! This week's top stock and its DD: Taiwan Semiconductor ($TSM)",
        "url": "https://www.reddit.com/r/stocks/comments/miknjx/i_analyze_mentions_and_sentiment_across_social/",
        "created": 1617399810.0
    },
    {
        "author": "AlternativeWind1888",
        "created_utc": 1617703601,
        "id": "ml89q5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Whales are everywhere. They can crush the exchanges or can raise theme. So the whales can make someone bankrupt or make themselves profits. For example: TXN's (a random coin) price is $1 and there is only twenty one million TXN coins. A whale can buy nineteen million of theme and can make the price higher then when he sell every TXN that he owned the price will again $1!\n\n   We have to change it. We have enough power to change it. But how? Let's discus at the comment place right down.",
        "subreddit": "wallstreetbets",
        "title": "We Can Crush The Wall Street Again",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ml89q5/we_can_crush_the_wall_street_again/",
        "created": 1617732401.0
    }
]