[
    {
        "author": "Business-Apartment96",
        "created_utc": 1638568356,
        "id": "r89xzw",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Nvidia don’t need to own ARM to make sht. They paid the licensing for that sht. They made the acquisition for around 40 billion before Nvidia became a 800 billion+ company. If the deal goes through, they have to pay JAP BANK 80 billion worth of cash/stocks for this shtty company that barely makes a billion even though it has 90% market share in the world. How the fuk nvidia supposed to make their money back from this shtty deal? We have Fuking META to send us to the 🌚. FUK YOU ARM. NVIDIA IS A SOFTWARE COMPANY NOW.  Nvidia paid a 1.5 billion fine to Jap Bank to save 40 billions in company values is Fuking worth it if this deal don’t go through.",
        "subreddit": "wallstreetbets",
        "title": "Guys, buy Nvidia now after the ARM deal is all but cancelled. Saving Nvidia 80 billions in cash/stocks.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r89xzw/guys_buy_nvidia_now_after_the_arm_deal_is_all_but/",
        "created": 1638597156.0
    },
    {
        "author": "DECABLOO",
        "created_utc": 1638562176,
        "id": "r87wvc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "what about NVDA guys? What do u think is going to happen?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r87wvc/what_about_nvda_guys_what_do_u_think_is_going_to/",
        "created": 1638590976.0
    },
    {
        "author": "Outrageous_Bat8429",
        "created_utc": 1638393890,
        "id": "r6pmo5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "There seemed to be unlimited potential. “Good fundementals!” is what everyone kept saying. “It has to re-bound soon!” I read everywhere. But UP Fintech (TIGR) continued to make new lows each week. I saw each 5-10% drop as an opportunity to average down. Now I’m holding almost 2,000 shares at $12.74 and there’s still no bottom to be seen. Maybe the next support is at $0. “Be greedy when others are fearful” is my motto, or rather, my rationale to dollar cost average in case of this being the next short squeeze. It’s crazy how well the sunk cost fallacy can encourage you to make long-term horrible decisions. I’m not in debt and am no where near retirement, but damn...do I wish I bought $NVIDIA.",
        "subreddit": "wallstreetbets",
        "title": "Tied up half my net worth in a Chinese Fintech company that is now going to zero",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6pmo5/tied_up_half_my_net_worth_in_a_chinese_fintech/",
        "created": 1638422690.0
    },
    {
        "author": "Recoil42",
        "created_utc": 1638478321,
        "id": "r7h092",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[https://www.cnbc.com/2021/12/02/ftc-sues-to-block-nvidias-40-billion-acquisition-of-arm.html](https://www.cnbc.com/2021/12/02/ftc-sues-to-block-nvidias-40-billion-acquisition-of-arm.html)\n\n&gt;The Federal Trade Commission on Thursday sued to block [Nvidia](https://www.cnbc.com/quotes/NVDA)’s $40 billion acquisition of Arm from SoftBank on antitrust grounds.  \n&gt;  \n&gt;The deal has faced scrutiny from regulators since it was announced last year. The U.S. action is the biggest hurdle it has faced yet, and threatens whether the deal will be completed.  \n&gt;  \n&gt;“The proposed vertical deal would give one of the largest chip companies control over the computing technology and designs that rival firms rely on to develop their own competing chips,” the FTC [said in an announcement](https://www.ftc.gov/news-events/press-releases/2021/12/ftc-sues-block-40-billion-semiconductor-chip-merger).",
        "subreddit": "investing",
        "title": "FTC sues to block Nvidia’s $40 billion acquisition of Arm",
        "url": "https://www.reddit.com/r/investing/comments/r7h092/ftc_sues_to_block_nvidias_40_billion_acquisition/",
        "created": 1638507121.0
    },
    {
        "author": "Conservativeprick",
        "created_utc": 1638501045,
        "id": "r7ouur",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[https://www.ftc.gov/news-events/press-releases/2021/12/ftc-sues-block-40-billion-semiconductor-chip-merger](https://www.ftc.gov/news-events/press-releases/2021/12/ftc-sues-block-40-billion-semiconductor-chip-merger)  \n\n\n\"The Federal Trade Commission today sued to block U.S. chip supplier  Nvidia Corp.’s $40 billion acquisition of U.K. chip design provider Arm  Ltd. Semiconductor chips power the computers and technologies that are  essential to our modern economy and society. The proposed vertical deal  would give one of the largest chip companies control over the computing  technology and designs that rival firms rely on to develop their own  competing chips. The FTC’s complaint alleges that the combined firm  would have the means and incentive to stifle innovative next-generation  technologies, including those used to run datacenters and  driver-assistance systems in cars.                       \n\n“The FTC is suing to block the largest semiconductor chip merger in  history to prevent a chip conglomerate from stifling the innovation  pipeline for next-generation technologies,” said FTC Bureau of  Competition Director Holly Vedova. “Tomorrow’s technologies depend on  preserving today’s competitive, cutting-edge chip markets. This proposed  deal would distort Arm’s incentives in chip markets and allow the  combined firm to unfairly undermine Nvidia’s rivals. The FTC’s lawsuit  should send a strong signal that we will act aggressively to protect our  critical infrastructure markets from illegal vertical mergers that have  far-reaching and damaging effects on future innovations.”",
        "subreddit": "wallstreetbets",
        "title": "FTC Sues to Block $40 Billion Semiconductor Chip Merger",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7ouur/ftc_sues_to_block_40_billion_semiconductor_chip/",
        "created": 1638529845.0
    },
    {
        "author": "Nachious",
        "created_utc": 1638539258,
        "id": "r7zi0j",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Aljazeera.com: US sues to block Nvidia deal to buy British chipmaker Arm.\nhttps://www.aljazeera.com/economy/2021/12/2/us-sues-to-block-nvidia-deal-to-british-chip-maker-arm",
        "subreddit": "wallstreetbets",
        "title": "Need your input.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7zi0j/need_your_input/",
        "created": 1638568058.0
    },
    {
        "author": "DECABLOO",
        "created_utc": 1638562663,
        "id": "r88376",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "What about NVDA? What do you think will happen. I am quite sure it will continue to decrease... The block of today was a disaster for Softbank...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r88376/what_about_nvda_what_do_you_think_will_happen_i/",
        "created": 1638591463.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1638570863,
        "id": "r8asf1",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Friday, December 3, 2021**\n\nStocks sank today to end the week lower, with technology and growth stocks cratering as market participants digested further updates regarding the Omicron variant and recent marks made by Fed Chair Jerome Powell, alongside the Labor Department’s November jobs report. The S&amp;P 500 (SPY) closed the week -1.2% lower, the tech-heavy Nasdaq (QQQ) slid -2.6% and the Dow Jones (DIA) fell -1.83%. The Russell 2000 (IWM), which tracks the performance of small-caps, closed the week a whopping -5.24% lower. \n\n**Notable Numbers Today**\n\n* S&amp;P 500 (SPY): -0.87%\n* Nasdaq (QQQ): -1.74%\n* Dow Jones (DIA): -0.11%\n* Russell 2000 (IWM): -2.05%\n* VIX: +8.71%\n* NVIDIA: -4.46%\n* Tesla (TSLA): -6.42%\n* DocuSign (DOCU): -42.22%\n* Asana (ASAN): -26.40%\n* Marvell Tech (MRVL): +17.70%\n\nDevelopment surrounding the new Omicron variant remains front and center of the market’s attention. So far, at least five US states have reported at least one case of the variant and over three dozen countries globally. A new report by the World Health Organization (WHO) has so far seen “a suggestion that there is increased transmissibility” of the Omicron variant. However, the report notes that it is still too soon and not enough data is available to make any conclusions yet. \n\nVaccine makers released new, less optimistic commentary regarding how effective existing vaccines are against the new Omicron variant. Moderna CEO Stephane Bancel said their current vaccine would likely see a “material drop” in effectiveness against the Omicron variant. \n\nHe said, “There is no world, I think, where \\[the effectiveness\\] is the same level we had with \\[the\\] Delta \\[variant\\]. I think it’s going to be a material drop. I just don’t know how much because we need to wait for the data. But all the scientists I’ve talked to . . . are like, ‘This is not going to be good’.”\n\n[https://www.ft.com/content/27def1b9-b9c8-47a5-8e06-72e432e0838f](https://www.ft.com/content/27def1b9-b9c8-47a5-8e06-72e432e0838f)\n\nMoreover, the market move today coincides with the release of the Labor Department’s November job report, which showed a disappointing hiring rate even as the unemployment rate fell to a fresh pandemic-era low. Here are the numbers\n\n* Payroll Gains: +210,000 vs +550,000 expected\n* Unemployment Rate: 4.2% vs 4.6% in October\n\nJim Smiegiel, Chief Investment Officer at SEI Investments, said “The markets ... have been pricing in, really, a worst-case scenario. I think the market is now switching gears a little bit and perhaps lessening the intensity of the potential for negative outcomes. The big issue still remains more about the world government's reaction to the variant and what that means from a lockdown perspective. And that's what the market is still kind of struggling with at this stage.\" \n\nJ. Pow’s latest remarks before the Senate Banking Committee further spooked the markets, after he said he would back off from using the word “transitory” to describe rising inflation. This is very notable because the Central bank has been using the T-word since the beginning of the year, when it warned that steep differences in year-over-year comparisons and supply-chain bottlenecks would lead to elevated inflation. \n\nPowell said, ““We tend to use \\[the word transitory\\] to mean that it won’t leave a permanent mark in the form of higher inflation. I think it’s probably a good time to retire that word and try to explain more clearly what we mean.”\n\nMoreover, Powell suggested the Central Bank was considering completing its asset purchase taper “a few months sooner” than previously telegraphed. Market participants expected a more supportive stance, especially with the new COVID variant, but instead Powell suggested his priority was now on curbing higher than expected inflation. \n\nCharlie Ripley, senior investment strategist at Allianz Investment, said “Chairman Powell’s commentary course-corrected the view on inflation and the potential need for quicker policy adjustment. The reality is hotter inflation coupled with a strong economic backdrop could end the Fed’s bond buying program as early as the first quarter of next year. Ultimately, the transitory view on inflation has officially come to an end as Powell’s comments reinforced the notion that elevated prices are likely to persist well into next year. With potential changes in policy on the horizon, market participants should expect additional market volatility in this uncharted territory.\" \n\nOn a personal note, I am taking this opportunity to do some very small dip buying (no more than ¼ position). As usual I believe the market is overreacting (as it tends to do). While it is important to acknowledge the risks present in the market, and be prepared to act if they arise, I personally believe Omicron fears are overblown (I remember we had the same song and dance when Delta was first discovered). More concerning is the Fed’s change in attitude towards inflation. That said, the only thing discussed so far has been accelerating the timeline for tapering asset purchases. As I have said for months at this point, I am not worried about tapering. If/when the Fed begins discussing raising interest rates, then I will step back and reassess. \n\n**Highlights**\n\n* Shares of DocuSign (DOCU) cratered more than 40% after posting disappointing earnings and lowering guidance. Like Zoom (ZM), Teladoc (TDOC), and Peloton (PTON) before, this is the latest COVID stock to crater in value. \n* Shares of Chinese ride-hailing company DIDI gapped down once again after announcing plans to delist from the New York Stock Exchange amid regulatory pressures from the Chinese government. This is one of the most spectacular IPO failures I have ever seen and probably just the beginning. I’m glad I divested all my shares in Chinese companies, I wouldn’t trust a single dollar of mine in that environment. At this point, I’m expecting Alibaba (BABA) to delist at some point. \n* As a reminder, a lot of times, when you buy Chinese stock, you aren’t really buying a share of the company, usually you are being what is called an American Depositary Receipt, which is basically just a contract representing a number of shares, not an actual piece of the company\n* The Federal Trade Commission sued NVIDIA (NDA) to block the proposed $40 billion acquisition of Arm. Unfortunately, it doesn’t look like the deal will go through given all the regulatory backlash in both the US, UK and EU. Sad for me, NVIDIA is my favorite stock in the market. \n* Ford Motor (F) expects to be the world's second largest electric vehicle manufacturer within two years, with annual production capacity of nearly 600,000, according to Lisa Drake, the Chief Operating Officer. \n* Shares of sport-betting company DraftKings (DKNG) sank to 52-week lows, losing more than 50% of its value in the last three months. Penn National Gaming (PENN) is following a similar trend. \n* Cathie Wood’s flagship Ark Innovation ETF (ARKK) hit a 52-week low today, after falling 25% in the month amid the broad tech-selloff. \n* Shares of Grab (GRAB), the largest ride-hailing and digital payment solution in Southeast Asia, failed spectacularly in its first day of trading following the largest ever merger, which valued the company at over $40 billion. Has not been a good week for foreign stocks.  \n* Qualcomm (QCOM) on Wednesday released a new chip designed for gaming-specific handheld devices offering 5G connectivity, a potential new mobile platform for video gamers offering more flexibility to play streaming games on the go. QCOM said it partnered with hardware company Razer to create an initial test device for gamers.\n\n“The greatest glory in living lies not in never falling, but in rising every time we fall.” *-Nelson Mandela*",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, December 3, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/r8asf1/here_is_a_market_recap_for_today_friday_december/",
        "created": 1638599663.0
    },
    {
        "author": "Vagscaper",
        "created_utc": 1638581030,
        "id": "r8e5yf",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I’ve had a decent size holding of Nvidia for about six months. Roughly 50k. I just recently enlarged that position significantly and now we’re seeing turbulence. I know, poor timing. These recent events have me wondering what my fellow investors honestly feel about where Nvidia’s share price will go from here. Thoughts?",
        "subreddit": "stocks",
        "title": "Thoughts on NVDA during this pullback?",
        "url": "https://www.reddit.com/r/stocks/comments/r8e5yf/thoughts_on_nvda_during_this_pullback/",
        "created": 1638609830.0
    },
    {
        "author": "itsBhaR",
        "created_utc": 1638414492,
        "id": "r6x625",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Finally stocks are going down. Hope this trend continues down for a few weeks. \n\nWhat stocks/etfs do you think are on sale right now to have good gains in next 5 to 10 years? - FB, DIVO, ABNB, NFLX, ARKQ, VYM?\n\nWhat to add more of NVDA, TSLA, QCOM, MSFT but they aren't coming down as much. \n\nWhat are some good stock/etfs those where high for a few months and start coming down significantly for a past a few days?",
        "subreddit": "stocks",
        "title": "What stocks/etfs on sale?",
        "url": "https://www.reddit.com/r/stocks/comments/r6x625/what_stocksetfs_on_sale/",
        "created": 1638443292.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1638570834,
        "id": "r8as26",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, December 3, 2021**\n\nStocks sank today to end the week lower, with technology and growth stocks cratering as market participants digested further updates regarding the Omicron variant and recent marks made by Fed Chair Jerome Powell, alongside the Labor Department’s November jobs report. The S&amp;P 500 (SPY) closed the week -1.2% lower, the tech-heavy Nasdaq (QQQ) slid -2.6% and the Dow Jones (DIA) fell -1.83%. The Russell 2000 (IWM), which tracks the performance of small-caps, closed the week a whopping -5.24% lower. \n\n**Notable Numbers Today**\n\n* S&amp;P 500 (SPY): -0.87%\n* Nasdaq (QQQ): -1.74%\n* Dow Jones (DIA): -0.11%\n* Russell 2000 (IWM): -2.05%\n* VIX: +8.71%\n* NVIDIA: -4.46%\n* Tesla (TSLA): -6.42%\n* DocuSign (DOCU): -42.22%\n* Asana (ASAN): -26.40%\n* Marvell Tech (MRVL): +17.70%\n\nDevelopment surrounding the new Omicron variant remains front and center of the market’s attention. So far, at least five US states have reported at least one case of the variant and over three dozen countries globally. A new report by the World Health Organization (WHO) has so far seen “a suggestion that there is increased transmissibility” of the Omicron variant. However, the report notes that it is still too soon and not enough data is available to make any conclusions yet. \n\nVaccine makers released new, less optimistic commentary regarding how effective existing vaccines are against the new Omicron variant. Moderna CEO Stephane Bancel said their current vaccine would likely see a “material drop” in effectiveness against the Omicron variant. \n\nHe said, “There is no world, I think, where \\[the effectiveness\\] is the same level we had with \\[the\\] Delta \\[variant\\]. I think it’s going to be a material drop. I just don’t know how much because we need to wait for the data. But all the scientists I’ve talked to . . . are like, ‘This is not going to be good’.”\n\n[https://www.ft.com/content/27def1b9-b9c8-47a5-8e06-72e432e0838f](https://www.ft.com/content/27def1b9-b9c8-47a5-8e06-72e432e0838f)\n\nMoreover, the market move today coincides with the release of the Labor Department’s November job report, which showed a disappointing hiring rate even as the unemployment rate fell to a fresh pandemic-era low. Here are the numbers\n\n* Payroll Gains: +210,000 vs +550,000 expected\n* Unemployment Rate: 4.2% vs 4.6% in October\n\nJim Smiegiel, Chief Investment Officer at SEI Investments, said “The markets ... have been pricing in, really, a worst-case scenario. I think the market is now switching gears a little bit and perhaps lessening the intensity of the potential for negative outcomes. The big issue still remains more about the world government's reaction to the variant and what that means from a lockdown perspective. And that's what the market is still kind of struggling with at this stage.\" \n\nJ. Pow’s latest remarks before the Senate Banking Committee further spooked the markets, after he said he would back off from using the word “transitory” to describe rising inflation. This is very notable because the Central bank has been using the T-word since the beginning of the year, when it warned that steep differences in year-over-year comparisons and supply-chain bottlenecks would lead to elevated inflation. \n\nPowell said, ““We tend to use \\[the word transitory\\] to mean that it won’t leave a permanent mark in the form of higher inflation. I think it’s probably a good time to retire that word and try to explain more clearly what we mean.”\n\nMoreover, Powell suggested the Central Bank was considering completing its asset purchase taper “a few months sooner” than previously telegraphed. Market participants expected a more supportive stance, especially with the new COVID variant, but instead Powell suggested his priority was now on curbing higher than expected inflation. \n\nCharlie Ripley, senior investment strategist at Allianz Investment, said “Chairman Powell’s commentary course-corrected the view on inflation and the potential need for quicker policy adjustment. The reality is hotter inflation coupled with a strong economic backdrop could end the Fed’s bond-buying program as early as the first quarter of next year. Ultimately, the transitory view on inflation has officially come to an end as Powell’s comments reinforced the notion that elevated prices are likely to persist well into next year. With potential changes in policy on the horizon, market participants should expect additional market volatility in this uncharted territory.\" \n\nOn a personal note, I am taking this opportunity to do some very small dip-buying (no more than ¼ position). As usual, I believe the market is overreacting (as it tends to do). While it is important to acknowledge the risks present in the market and be prepared to act if they arise, I personally believe Omicron fears are overblown (I remember we had the same song and dance when Delta was first discovered). More concerning is the Fed’s change in attitude towards inflation. That said, the only thing discussed so far has been accelerating the timeline for tapering asset purchases. As I have said for months at this point, I am not worried about tapering. If/when the Fed begins discussing raising interest rates, then I will step back and reassess. \n\n**Highlights**\n\n* Shares of DocuSign (DOCU) cratered more than 40% after posting disappointing earnings and lowering guidance. Like Zoom (ZM), Teladoc (TDOC), and Peloton (PTON) before, this is the latest COVID stock to crater in value. \n* Shares of Chinese ride-hailing company DIDI gapped down once again after announcing plans to delist from the New York Stock Exchange amid regulatory pressures from the Chinese government. This is one of the most spectacular IPO failures I have ever seen and probably just the beginning. I’m glad I divested all my shares in Chinese companies, I wouldn’t trust a single dollar of mine in that environment. At this point, I’m expecting Alibaba (BABA) to delist at some point. \n* As a reminder, a lot of times, when you buy Chinese stock, you aren’t really buying a share of the company, usually you are being what is called an American Depositary Receipt, which is basically just a contract representing a number of shares, not an actual piece of the company\n* The Federal Trade Commission sued NVIDIA (NDA) to block the proposed $40 billion acquisition of Arm. Unfortunately, it doesn’t look like the deal will go through given all the regulatory backlash in both the US, UK and EU. Sad for me, NVIDIA is my favorite stock in the market. \n* Ford Motor (F) expects to be the world's second largest electric vehicle manufacturer within two years, with annual production capacity of nearly 600,000, according to Lisa Drake, the Chief Operating Officer. \n* Shares of sport-betting company DraftKings (DKNG) sank to 52-week lows, losing more than 50% of its value in the last three months. Penn National Gaming (PENN) is following a similar trend. \n* Cathie Wood’s flagship Ark Innovation ETF (ARKK) hit a 52-week low today, after falling 25% in the month amid the broad tech-selloff. \n* Shares of Grab (GRAB), the largest ride-hailing and digital payment solution in Southeast Asia, failed spectacularly in its first day of trading following the largest ever merger, which valued the company at over $40 billion. Has not been a good week for foreign stocks.  \n* Qualcomm (QCOM) on Wednesday released a new chip designed for gaming-specific handheld devices offering 5G connectivity, a potential new mobile platform for video gamers offering more flexibility to play streaming games on the go. QCOM said it partnered with hardware company Razer to create an initial test device for gamers.\n\n“The greatest glory in living lies not in never falling, but in rising every time we fall.” *-Nelson Mandela*",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, December 3, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/r8as26/here_is_a_market_recap_for_today_friday_december/",
        "created": 1638599634.0
    },
    {
        "author": "ESComments",
        "created_utc": 1638628980,
        "id": "r8r1vq",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Even after the surge this year, most of them are still trading at valuations far below other tech companies. Historically, it's a cyclical business right. However that is based on decades' worth of trends which have less relevance in today's economy. Semiconductors these days can turn profits rain or shine and the worst they encounter is a slowdown in growth. Not a surprise given the explosion of connected cars and IOT. Meanwhile software companies lose money for years at nosebleed valuations and no one bats an eye. Where is the logic. And why does NVDA get 10X the premium of everything else (GPUs yes, but the valuation is too extreme).",
        "subreddit": "investing",
        "title": "Why is valuation for semiconductors so poor?",
        "url": "https://www.reddit.com/r/investing/comments/r8r1vq/why_is_valuation_for_semiconductors_so_poor/",
        "created": 1638657780.0
    },
    {
        "author": "Dynasty__93",
        "created_utc": 1638625006,
        "id": "r8ptp5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Everyone and their brother agreed back earlier this year to invest the kitchen sink in semiconductor stocks/etfs. I myself invested as much as I could into SOXX and well as TSM and invested some into NVDA. I am up approx. 16%, 4% and 110% respectively. When is it time to sell you ask? \n\nIn my opinion, for many of these, never. The only one I am considering selling is TSM, and that would have to do with the possibility of a Chinese invasion into Taiwan. SOXX and NVDA will not be sold by me for sure this decade, or probably the one after that. \n\nSeems to me some on this sub want to sell now because they have made say a nice 20% profit, which beats the market average. ~~If~~ when NVDA goes up another 100% in the next 2 years you will regret it in my honest opinion.",
        "subreddit": "investing",
        "title": "Does everyone have the same opinion on when to sell their semiconductor stocks/etfs?",
        "url": "https://www.reddit.com/r/investing/comments/r8ptp5/does_everyone_have_the_same_opinion_on_when_to/",
        "created": 1638653806.0
    },
    {
        "author": "looperino_memes",
        "created_utc": 1638591804,
        "id": "r8hf4d",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "NVDA, MSFT, GOOG, AAPL. Why should anyone who is new to investing ever buy these? What is the growth potential really? Aren't these companies in the trillions already?\n\nFor example, if you show me a company worth a billion dollars, then maybe that company can reach 100B. A 100X.\n\nFor the mega tech companies, is 10x even possible at this point?",
        "subreddit": "stocks",
        "title": "Why do people buy massively large companies?",
        "url": "https://www.reddit.com/r/stocks/comments/r8hf4d/why_do_people_buy_massively_large_companies/",
        "created": 1638620604.0
    },
    {
        "author": "ramsdesk",
        "created_utc": 1638407970,
        "id": "r6uy3e",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Similar to NVDA",
        "url": "https://www.reddit.com/r/stocks/comments/r6uy3e/similar_to_nvda/",
        "created": 1638436770.0
    },
    {
        "author": "spaceset51",
        "created_utc": 1638368361,
        "id": "r6fs38",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Lately I have been growing my account and feel the need to add positions. I started out just investing in 7 companies, but that has expanded to 9. The list of companies is down below and I just want to clarify that I am a little overweight in my technology positions. Any suggestions. Am I not taking enough risk or taking in too much risk.\n\nAAPL\nMSFT\nAMD\nNVDA\nTMO\nHD\nJPM\nDIS\nTGT",
        "subreddit": "stocks",
        "title": "Am I taking on too much risk?",
        "url": "https://www.reddit.com/r/stocks/comments/r6fs38/am_i_taking_on_too_much_risk/",
        "created": 1638397161.0
    },
    {
        "author": "iamthejuanyouseek",
        "created_utc": 1638373896,
        "id": "r6huiu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Is anyone familiar with this company and the Lidar technology in general? From what I've gathered the Nvidia Drive system uses it. Aside from vehicles it looks like its used in computing and AI. OUST has been on a decline since its open about a year ago. Slowly coming back up though just not sure how much momentum it can hold. Seems pretty under the radar at the moment. Even stocktwits only has a couple thousand followers. Any insights? Possible moon?",
        "subreddit": "wallstreetbets",
        "title": "Ouster partnered with Nvidia and Lidar technology?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6huiu/ouster_partnered_with_nvidia_and_lidar_technology/",
        "created": 1638402696.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1638617701,
        "id": "r8nvm0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n        \n|Ticker|Company|# Mentions (24H)|Percent Change (24H)|Mentions and Charts|\n|:-|:-|:-|:-|:-|\n|SPY|SPDR S&amp;P 500 ETF Trust|[517](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=all)|15.92|[See Specific Mentions](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=all)\n|BABA|Alibaba Group Holding Limited|[344](https://www.memebergterminal.com/stock/Alibaba%20Group%20Holding%20Limited/BABA?utm_source=rsmb&amp;utm_medium=all)|17.41|[See Specific Mentions](https://www.memebergterminal.com/stock/Alibaba%20Group%20Holding%20Limited/BABA?utm_source=rsmb&amp;utm_medium=all)\n|DOCU|DocuSign Inc|[341](https://www.memebergterminal.com/stock/DocuSign%20Inc/DOCU?utm_source=rsmb&amp;utm_medium=all)|36.95|[See Specific Mentions](https://www.memebergterminal.com/stock/DocuSign%20Inc/DOCU?utm_source=rsmb&amp;utm_medium=all)\n|GME|GameStop Corp|[264](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=all)|30.05|[See Specific Mentions](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=all)\n|TSLA|Tesla Inc|[222](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=all)|40.51|[See Specific Mentions](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=all)\n|AMC|AMC Entertainment Holdings Inc|[161](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=all)|15.83|[See Specific Mentions](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=all)\n|PLTR|Palantir Technologies Inc|[127](https://www.memebergterminal.com/stock/Palantir%20Technologies%20Inc/PLTR?utm_source=rsmb&amp;utm_medium=all)|41.11|[See Specific Mentions](https://www.memebergterminal.com/stock/Palantir%20Technologies%20Inc/PLTR?utm_source=rsmb&amp;utm_medium=all)\n|NVDA|NVIDIA Corporation|[118](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb&amp;utm_medium=all)|-3.28|[See Specific Mentions](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb&amp;utm_medium=all)\n|AMD|Advanced Micro Devices Inc|[114](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb&amp;utm_medium=all)|22.58|[See Specific Mentions](https://www.memebergterminal.com/stock/Advanced%20Micro%20Devices%20Inc/AMD?utm_source=rsmb&amp;utm_medium=all)\n|ARKK|ARK ETF Trust - ARK Innovation ETF|[113](https://www.memebergterminal.com/stock/ARK%20ETF%20Trust%20-%20ARK%20Innovation%20ETF/ARKK?utm_source=rsmb&amp;utm_medium=all)|140.43|[See Specific Mentions](https://www.memebergterminal.com/stock/ARK%20ETF%20Trust%20-%20ARK%20Innovation%20ETF/ARKK?utm_source=rsmb&amp;utm_medium=all)\n|MSFT|Microsoft Corporation|[103](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb&amp;utm_medium=all)|66.13|[See Specific Mentions](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb&amp;utm_medium=all)\n|SOFI|SoFi Technologies Inc. Common Stock|[97](https://www.memebergterminal.com/stock/SoFi%20Technologies%20Inc.%20Common%20Stock/SOFI?utm_source=rsmb&amp;utm_medium=all)|136.59|[See Specific Mentions](https://www.memebergterminal.com/stock/SoFi%20Technologies%20Inc.%20Common%20Stock/SOFI?utm_source=rsmb&amp;utm_medium=all)\n|AAPL|Apple Inc|[91](https://www.memebergterminal.com/stock/Apple%20Inc/AAPL?utm_source=rsmb&amp;utm_medium=all)|-41.29|[See Specific Mentions](https://www.memebergterminal.com/stock/Apple%20Inc/AAPL?utm_source=rsmb&amp;utm_medium=all)\n|DKNG|DraftKings Inc|[85](https://www.memebergterminal.com/stock/DraftKings%20Inc/DKNG?utm_source=rsmb&amp;utm_medium=all)|4.94|[See Specific Mentions](https://www.memebergterminal.com/stock/DraftKings%20Inc/DKNG?utm_source=rsmb&amp;utm_medium=all)\n|QQQ|Invesco QQQ Trust Series 1|[84](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=all)|9.09|[See Specific Mentions](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=all)\n|SQ|Square Inc|[78](https://www.memebergterminal.com/stock/Square%20Inc/SQ?utm_source=rsmb&amp;utm_medium=all)|77.27|[See Specific Mentions](https://www.memebergterminal.com/stock/Square%20Inc/SQ?utm_source=rsmb&amp;utm_medium=all)\n|DIDI|DiDi Global Inc|[71](https://www.memebergterminal.com/stock/DiDi%20Global%20Inc/DIDI?utm_source=rsmb&amp;utm_medium=all)|10.94|[See Specific Mentions](https://www.memebergterminal.com/stock/DiDi%20Global%20Inc/DIDI?utm_source=rsmb&amp;utm_medium=all)\n|VTI|Vanguard Index Funds - Vanguard Total Stock Market ETF|[66](https://www.memebergterminal.com/stock/Vanguard%20Index%20Funds%20-%20Vanguard%20Total%20Stock%20Market%20ETF/VTI?utm_source=rsmb&amp;utm_medium=all)|43.48|[See Specific Mentions](https://www.memebergterminal.com/stock/Vanguard%20Index%20Funds%20-%20Vanguard%20Total%20Stock%20Market%20ETF/VTI?utm_source=rsmb&amp;utm_medium=all)\n|FB|Meta Platforms Inc.|[63](https://www.memebergterminal.com/stock/Meta%20Platforms%20Inc./FB?utm_source=rsmb&amp;utm_medium=all)|-17.11|[See Specific Mentions](https://www.memebergterminal.com/stock/Meta%20Platforms%20Inc./FB?utm_source=rsmb&amp;utm_medium=all)\n|HOOD|Robinhood Markets Inc. Class A Common Stock|[63](https://www.memebergterminal.com/stock/Robinhood%20Markets%20Inc.%20Class%20A%20Common%20Stock/HOOD?utm_source=rsmb&amp;utm_medium=all)|50.00|[See Specific Mentions](https://www.memebergterminal.com/stock/Robinhood%20Markets%20Inc.%20Class%20A%20Common%20Stock/HOOD?utm_source=rsmb&amp;utm_medium=all)\n|WISH|ContextLogic Inc|[63](https://www.memebergterminal.com/stock/ContextLogic%20Inc/WISH?utm_source=rsmb&amp;utm_medium=all)|-38.24|[See Specific Mentions](https://www.memebergterminal.com/stock/ContextLogic%20Inc/WISH?utm_source=rsmb&amp;utm_medium=all)\n### Data source credits: Memeberg Terminal. For realtime mention counts and to see the specific comments people made about a ticker instead of just aggregate numbers, visit the source of this data @ [https://memebergterminal.com](https://memebergterminal.com?utm_source=rsmbfoot&amp;utm_medium=all)",
        "subreddit": "options",
        "title": "I scraped Reddit for the top ticker mentions in the last 24H. Here are the results (Saturday December 04, 2021)",
        "url": "https://www.reddit.com/r/options/comments/r8nvm0/i_scraped_reddit_for_the_top_ticker_mentions_in/",
        "created": 1638646501.0
    },
    {
        "author": "PeekingPotato",
        "created_utc": 1638346848,
        "id": "r69z5l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey there guys, I just started analyzing stocks more and I thought I´ll try to do that and post it here. That´s my first analysis for NVDA. If you have any feedback for me that would be great and highly appreciated. If you have questions feel free to ask, I´ll try to answer everything.\n\nToday we will look through the basics of NVIDIA´s business and then see if we can come up with a fair value for NVDA´s stock using discounted free cashflow.\n\nThis is not financial advice and I do not own shares in NVIDIA. Nevertheless I will try to stay as unbiased and objective as I can. Always do your own due diligence.\n\nFirst let´s review their different revenue streams. Their biggest stream, around **45%** of their sales comes from **Gaming**. The **Data Center** makes up around **41%**. Another **8%** comes from **Professional Visualization**. Then there is **3%** from **OEM**, and another **2%** from **Automotive**.\n\nFor the valuation:\n\nWe take **analyst estimates**, we discount that by our **required return of 9,2%**. Then we use the **perpetual growth rate of 2,5%** and that gave us a fair value for NVDA´s stock of **$327 per share**. But because we have to account for **NVDA´s equity** as well, our **fair value of equity** would be **$311 per share**.\n\nNow feel free to include a margin of safety to that.\n\nWith NVDA´s price being at **$326** **per share** right now, it´s kind of fairly valued. That´s why I think buying *heavily* might not be a good idea. Although you can always dollar-cost-average. That´s where you invest every month the same amount.\n\n**Where I see NVDA´s stock price in 5 years.** We can calculate where the price might be in 5 years with the **Earnings Per Share (EPS TTM)**, the **Estimated Growth Rate** and the **Future P/E Value**. With this method I get a stock price of **$868 per share** which is definitely higher than what it is now. \n\n**What I´ll do.** I believe NVIDIA is here to stay. I think they will stay for a long time and innovate even more. That´s why, although the price is not exactly where I would want it to be (I want to include a margin of safety), I will maybe start to **dollar-cost-average**. That way I won´t mind the volatile market and hold for the longterm.\n\nThank you for reading and I hope I´ll see you again.",
        "subreddit": "stocks",
        "title": "Is NVDA a good buy right now?",
        "url": "https://www.reddit.com/r/stocks/comments/r69z5l/is_nvda_a_good_buy_right_now/",
        "created": 1638375648.0
    },
    {
        "author": "BurnerBurnerBurns20",
        "created_utc": 1638387005,
        "id": "r6my4u",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "CNBC’s Jim Cramer said Wednesday he’s not ready to sell any shares Nvidia yet, even though he recently booked some profits in two other big charitable trust winners Advanced Micro Devices and Ford.\n\nhttps://www.cnbc.com/2021/12/01/cramer-says-hes-not-ready-to-sell-nvidia-sees-stock-at-10-trillion-one-day.html\n\nCramer told “Fast Money Halftime Report” he believes that Nvidia could be a $10 trillion stock one day. Shares soared 145% year-to-date to an over $800 billion stock market value.\n\nIt’s no secret that Cramer loves Nvidia, the largest maker of graphics and artificial intelligence chips in the world. He’s even named his dog Nvidia. On television and in his investing club, the “Mad Money” host has praised CEO Jensen Huang’s vision for how the metaverse — or omniverse, which is Nvidia’s preferred term — can be used by businesses to reduce wastefulness and increase efficiency.",
        "subreddit": "stocks",
        "title": "Jim Cramer says he’s not ready to take profits in Nvidia, sees stock at $10 trillion one day",
        "url": "https://www.reddit.com/r/stocks/comments/r6my4u/jim_cramer_says_hes_not_ready_to_take_profits_in/",
        "created": 1638415805.0
    },
    {
        "author": "CuriousGam",
        "created_utc": 1638398695,
        "id": "r6rje4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "yeah, after watching the market for months I want to push some money into stocks, but would like to ask about some details.\n\n&amp;#x200B;\n\n30years, single, job,\n\nin a country with a social system,\n\nemergency fund exists,\n\nno plans for that money\n\n&amp;#x200B;\n\nPlan:\n\n\\~40% All World ETF\n\n\\~40% single stocks\n\napple, Nvidia, MSFT, Cloudflare, Autodesk, Costco, PP, (V + MA..dunno), Intel, SQ, AMZN, Zalando               Qualcomm, intel, Biotech, maybe some EV, battery, stuff etc\n\n\\~20% Those that shall not be named, gambling\n\n&amp;#x200B;\n\nI would put roughly 30% of my income into the things that currently look good... or just into the All World.\n\n&amp;#x200B;\n\n* I guess my split makes sense?\n* How many share should you get? Or what min % should a position have? I mean, is there a reason to get a single stock of multiple companies?\n* Considering that I am mostly looking at Tech stuff, would it be better to take an Technology ETF instead of all that single stocks?\n* Or would it even be useful to take several ETFs (Tech+ Biotech+ Fin+EV) instead of a single one?\n* And in those ETF´s, better take those with a lot of companies or with few? Those with a high% of the Top10 or not?",
        "subreddit": "stocks",
        "title": "Never invested, single stocks or ETF´s?",
        "url": "https://www.reddit.com/r/stocks/comments/r6rje4/never_invested_single_stocks_or_etfs/",
        "created": 1638427495.0
    },
    {
        "author": "r2002",
        "created_utc": 1638485787,
        "id": "r7jomt",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[Source](https://www.cnbc.com/2021/12/02/ftc-sues-to-block-nvidias-40-billion-acquisition-of-arm.html):\n\n* “The proposed vertical deal would give one of the largest chip companies control over the computing technology and designs that rival firms rely on to develop their own competing chips,” the FTC said in an announcement.\n\n* Nvidia stock was up over 2% on Thursday before the announcement, and did not move significantly on the news. The FTC complaint is not yet public.\n\n* FTC Chair Lina Khan, who was appointed by President Joe Biden to lead the agency shortly after her confirmation to the agency earlier this year, has signaled an interest in more robust antitrust enforcement. \n\n* The trial before the FTC’s own administrative law judge is set to begin on Aug. 9, 2022.\n\nThis is [not wholly a surprise](https://finance.yahoo.com/news/nvidias-latest-earnings-report-is-nail-in-coffin-for-40-billion-arm-deal-analyst-172042020.html) to people paying attention. Perhaps that's why price of NVDA didn't really move that much on the news (for now).\n\nAny thoughts on the effect on NVDA? Would this tougher FTC enforcement affect other big acquisitions you're counting on for other companies?",
        "subreddit": "stocks",
        "title": "FTC sues to block Nvidia acquisition of ARM",
        "url": "https://www.reddit.com/r/stocks/comments/r7jomt/ftc_sues_to_block_nvidia_acquisition_of_arm/",
        "created": 1638514587.0
    },
    {
        "author": "NewBlock",
        "created_utc": 1638504484,
        "id": "r7q0vi",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "To preface this, I'm only advising this for young investors, 18-25.\n\n&amp;#x200B;\n\nMost of reddit is quick to recommend you throw all of your money into an ETF, but I disagree. In my opinion, ETFs are more for preserving wealth. Individual stocks is where you gain that wealth. When you're at a young age, your risk tolerance should be way higher than when you're in your 40s. I'm not saying gamble your money on a high-risk penny stock, but you should be putting most of your portfolio in individual stocks. Find a few sectors you like, and find companies within those sectors that have historically performed well and have positive earnings growth.\n\n&amp;#x200B;\n\nI will take 5 sectors and compare popular stocks within those sectors against the 1-year performance of the S&amp;P500 \n\nEnergy: \n\nXOM - 52%\n\nCVX - 28%\n\nCOP - 72%\n\nMRO - 151%\n\nSU - 45%\n\nTotal 1yr performance : 69%\n\n&amp;#x200B;\n\nIndustrials:\n\nLPX - 94%\n\nSEB - 17%\n\nOC - 20%\n\nBLDR - 104%\n\nNLSN - 15%\n\nTotal 1yr performance: 51%\n\n&amp;#x200B;\n\nFinancial:\n\nMA - (-5%)\n\nSOFI - 57%\n\nAXP - 27%\n\nPYPL - (12%)\n\nV - (5%)\n\nTotal 1yr performance: 12%\n\n&amp;#x200B;\n\nShipping:\n\nZIM - 376%\n\nSBLK - 157%\n\nGOGL - 125%\n\nTGH - 87%\n\nSTNG - 12%\n\nTotal 1yr performance: 151%\n\n&amp;#x200B;\n\nTechnology:\n\nNVDA - 139%\n\nNFLX - 24%\n\nAMD - 63%\n\nNET - 124%\n\nINTC - (3%)\n\nTotal 1yr performance: 70%\n\n&amp;#x200B;\n\n**Total 1yr performance of all these stocks combined: 71%**\n\n**Total 1yr performance of the S&amp;P500: 25%**\n\nPicking individual stocks nearly tripled the performance of the S&amp;P500 over the course of a year. While you did take on more risk, this should be considered encouraged at a younger age. As you get older you should gradually move portions of your portfolio over to more blue chips and ETFs. Anyways, I constantly see people saying only to put stocks into ETFs, but I'm curious to hear your thoughts.",
        "subreddit": "stocks",
        "title": "Unpopular opinion: why you shouldn't waste your time in ETFs.",
        "url": "https://www.reddit.com/r/stocks/comments/r7q0vi/unpopular_opinion_why_you_shouldnt_waste_your/",
        "created": 1638533284.0
    },
    {
        "author": "Universe-Science",
        "created_utc": 1638504896,
        "id": "r7q5m0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "We hear so many discussions forecasting a market crash because the P/E ratio has reached 40 and is about to pass the P/E ratio of 2002! The current P/E ratio for S&amp;P is just about 22 and is estimated to lower a bit by end of 2022. How many companies were making billion dollars in 2002? Yes some companies like TESLA and NVDA may have a very high P/E ratio (whether justifiable or not, is not the subject of this post) but many great companies like Apple with great forward-looking earnings have a P/E ratio of less than 30. Don't forget that companies with a great outlook but not profitable like Roku have paid their price and their shares have plunged more than 50% in 2021. Here are two links that you can look at the real data not bullshit posted on Reddit: \n\n[https://ycharts.com/indicators/sp\\_500\\_pe\\_ratio\\_forward\\_estimate](https://ycharts.com/indicators/sp_500_pe_ratio_forward_estimate)\n\nand \n\n[https://www.cnbc.com/2021/10/13/sp-500-earnings-begin-with-headwind-not-seen-since-covid-bottom.html](https://www.cnbc.com/2021/10/13/sp-500-earnings-begin-with-headwind-not-seen-since-covid-bottom.html)",
        "subreddit": "stocks",
        "title": "S&amp;P 500 P/E ratio - currently 22 - Forwar looking 21",
        "url": "https://www.reddit.com/r/stocks/comments/r7q5m0/sp_500_pe_ratio_currently_22_forwar_looking_21/",
        "created": 1638533696.0
    },
    {
        "author": "Stallzy",
        "created_utc": 1638503000,
        "id": "r7pin0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey everyone was wondering if you guys might know why NFLX has dropped so much this month compared to other stocks I'm holding like AMD, MSFT, NVDA, but mainly holding EQQQ and VUSA.\n\nSeems like a great chance to buy the dip perhaps right now as I bought at the start of November near all time highs and now the price is at pre Squid Game levels I believe. Sucks for me a little as I'm down 6% but I believe they'll continue to keep putting out great content and I don't see online content consumption reducing at all. The movie theater seems to becoming more and more a thing of the past but maybe that's my take with nearly 3 months short of not going out for 2 years lol :D",
        "subreddit": "stocks",
        "title": "What's caused NFLX to drop? Just COVID? Pre Squid Game levels, good dip? (Down 6+% this month)",
        "url": "https://www.reddit.com/r/stocks/comments/r7pin0/whats_caused_nflx_to_drop_just_covid_pre_squid/",
        "created": 1638531800.0
    },
    {
        "author": "IAmCursedSoIMustSin",
        "created_utc": 1638563779,
        "id": "r88hzv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I lost 20000 on nvidia calls today so I decided to yolo everything I had left on Casey’s, the gas station",
        "url": "https://i.redd.it/yh246fyf1e381.png",
        "created": 1638592579.0
    },
    {
        "author": "harmlessloafofbread",
        "created_utc": 1638590176,
        "id": "r8gxn7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I'm no tech genius, but I'm looking at Intel, who has a GPU coming out in a couple months.  They've got high revenues, subsidies, industry connections, a ton of new Fab, a ton of 3nm TSMC capacity, and enough capital to catch up to Nvidia.\n\nBut the real reason Intel will trump Nvidia is ASICS will be more useful for machine learning.  GPU are great early on, but theres never a case where power usage is irrelevant outside of development. Bitcoin is a good example of this, nobody is buying up GPU to mine bitcoins; so assuming theres some huge future market for this is crazy.\n\nSo the real question is who can build machine learning and ASICS in the US, and offer it as an all in one solution to everyone?\n\n[https://www.tomshardware.com/news/intel-darpa-structured-asics](https://www.tomshardware.com/news/intel-darpa-structured-asics)",
        "subreddit": "stocks",
        "title": "Debate: Why Nvidia is Silly",
        "url": "https://www.reddit.com/r/stocks/comments/r8gxn7/debate_why_nvidia_is_silly/",
        "created": 1638618976.0
    },
    {
        "author": "snkbrdng",
        "created_utc": 1638544242,
        "id": "r817k0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Ok you degenerates missed TSLA, NVDA and AMD, oh yeah and you’re an idiot. \n\nBoom. New play AMD CEO Dr. Lisa Su (long live Dr Su) said during latest earnings call AMD is going close its acquisition of Xilinx. Every shareholder of Xilinx will get 1.72 shares of AMD for their 1 share of XLNX. Today the market has 14% discount on this but it is converging. \n\nIf you like AMD buy Xilinx today and when merger closes by end of month boom you just got a Black Friday sale AMD stock.\n\nIf you’re a true degenerate you’ll buy some 0 DTE crap that will expire worthless.",
        "subreddit": "wallstreetbets",
        "title": "Lisa Su 1 month play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r817k0/lisa_su_1_month_play/",
        "created": 1638573042.0
    },
    {
        "author": "jmj_daytrader",
        "created_utc": 1638539414,
        "id": "r7zjsh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nGoodmorning traders, keeping my eyes on market leaders, aapl,nvda, tesla,xlf, amzn and goog. IF they hold and rally so does the market but if this rally fails you will see signs here first. The path is laid out for a further flush down, but will it? How many more bears will be shaken out before we set lows for the month and get a real bounce to close the year. I was looking for a test above 461/462 before we resume sell side activity. \n\nExplanation in premarket video on personal tread\n\nKey support levels will be 455, 454/453 area and possibly 449 area. Key resistance levels will be 458 premarket, 460/461 and 463areas.  Today's scenarios... \n\n1) Range day structure. Establish 1st range low around 454/453 area. Then chopping back toward 460/461 area and possibly pushing the boundaries lower at some point.  \n\n2) Trange day (rounded reversal) we take off up from open until we get to the midday chop area of 460/461 area or next support area. After a sideways move we look for a move back towards 454/453.  \n\n3) Trend up day structure.  we open gap up we fade back into support around or before yesterdays close 457.4. We will see a little sideways action before reversing taking off toward 460/461. We stop and get our midday chop. We start the second half of the day with a choppy range before a possible fade into the close.",
        "subreddit": "options",
        "title": "Jobs Friday the fight is on... xmas rally or xmas fail. 12/3/21 Premarket outlook Technical Analysis on the SPY.",
        "url": "https://www.reddit.com/r/options/comments/r7zjsh/jobs_friday_the_fight_is_on_xmas_rally_or_xmas/",
        "created": 1638568214.0
    },
    {
        "author": "Available_Wonder_688",
        "created_utc": 1638539109,
        "id": "r7zgbw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Let's raise Nvidia stock.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7zgbw/lets_raise_nvidia_stock/",
        "created": 1638567909.0
    },
    {
        "author": "thespitfire69",
        "created_utc": 1638409796,
        "id": "r6vk4f",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi guys,\n\nFirst time posting, appreciate any feedback. I'm aware some of the capitalized stock tickers aren't proper stock tickers just some rough notes I took.\n\nHere's some positions Im thinking of buying 65% now and 35% of position later on dips.\n\nLet me know your thoughts, I haven't decided on allocations. Pokemon cards will be 2% max haha, just buying some sealed booster boxes.\n\nInvestment horizon 1.5-2.5 years.\n\nHACK? (Cybersecurity ETF)\nVaccine stocks?\nNVIDIA\nPokemon cards?\nAMD\nQUALCOMM\nINTEL\nGOOG\nAPPL\nCARBON CREDITS\nS&amp;P500 ETF\nDividend ETF?\nMLM Stagflation Hedge ETF\nLynas? (Rare earth metals)",
        "subreddit": "wallstreetbets",
        "title": "Thoughts on my positions?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6vk4f/thoughts_on_my_positions/",
        "created": 1638438596.0
    },
    {
        "author": "llPOGIl",
        "created_utc": 1638413907,
        "id": "r6wyvl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hello everyone,\n\nI have $65k realized short term gains for 2021 as of now. I also have a stock position where I’m down $17k.\n\nI’m wondering is it strategically better to\n\nA). Pay tax on the $65k gains at 24% tax rate and sell the stock position for $17k loss in 2022 to start the year with $17k tax credit.\n\nOr \n\nB). Sell the stock position for $17k loss and tax harvest to have a realized short term gains of $48k instead. And use the principal to buy Nvidia or Apple.\n\nThank you ahead of time for your input.",
        "subreddit": "stocks",
        "title": "Tax Loss Harvest Question",
        "url": "https://www.reddit.com/r/stocks/comments/r6wyvl/tax_loss_harvest_question/",
        "created": 1638442707.0
    },
    {
        "author": "AlE833",
        "created_utc": 1638399595,
        "id": "r6rvwp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "As the title suggests, I believe the stock gravy train is ending by the completion of this year. \n\nWhat do I mean by this? I mean, we won’t be seeing an ‘everything rally’ like we have seen the last two years especially. Already, we have seen those mid-cap tech stocks bleed as investors flock to the FAANG stocks. \n\nIf you look at the charts for the past two years or so, you’ll see huge gains for practically every stock. Those gains happened because of liquidity and zero interest rates. The Fed is going to raise interest rates next year. This is normal but because of the huge gains already, we won’t see that repeat itself. That’s what I mean by the end of the gravy train. \n\nHow much will rates go up and how quickly? No one knows. But it could have a huge effect on values. We have seen stocks just because of this Covid variant. Rates will shock the system and you’ll have panic selling. \n\nI’m going to keep buying into my SPY and QQQ ETFs, and with stocks I’m sticking to tried and true - Google, Microsoft, Apple, Tesla and Nvidia. We are heading towards a future where these companies will continue to dominate and innovate.",
        "subreddit": "stocks",
        "title": "Gravy train is ending soon",
        "url": "https://www.reddit.com/r/stocks/comments/r6rvwp/gravy_train_is_ending_soon/",
        "created": 1638428395.0
    },
    {
        "author": "Serrot69",
        "created_utc": 1638392574,
        "id": "r6p4ij",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I’m up on Nvidia over 150%, and I’m debating selling it in favor of buying a semiconductor ETF. I still believe in the sector but I think Nvidia is currently overvalued.\n\nMoreover, Jim Cramer said he ain’t selling any Nvidia, which is clearly a sell signal lol",
        "subreddit": "stocks",
        "title": "Would you take profits on Nvidia in favor of SMH?",
        "url": "https://www.reddit.com/r/stocks/comments/r6p4ij/would_you_take_profits_on_nvidia_in_favor_of_smh/",
        "created": 1638421374.0
    },
    {
        "author": "SomeKindOfSorbet",
        "created_utc": 1638371197,
        "id": "r6gtla",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I'm pretty new to stock trading, so don't hesitate to point out anything I omitted that you think would be worth mentioning regarding Intel.\n\nSo Intel seems to be one of those tech underdogs who no one thinks will perform well in the future because they haven't been innovative at all in the past few years compared to companies like AMD and such. To me, this looks like a long-term buy opportunity:\n\n-  Financials look pretty healthy from what I know.\n\n- 2.80% dividend yield is a big nice-to-have if you're gonna hold the stock patiently for a few years.\n\n- P/E ratio is one of the lowest in the tech market right now, meaning that the company has a lot of room to grow if the expectations become optimistic. And in the case of a market crash, it would be one of the safest bets in the tech market because of its healthy P/E ratio (correct me if I'm wrong on this one).\n\n- They announced an increase in capital spending for the next year, so they are likely trying to get back the ground that they've lost in their technological advancement.\n\n- They're soon going to compete in the discrete GPU market too, so that can't do them any wrong.\n\n- With their own semiconductor foundries, they have an upper edge in manufacturing costs and can avoid a lot of supply chain related issues. And with the never-ending chip shortage, they might be able to make more chips at more affordable costs than AMD and Nvidia, who are bound in their production by TSMC's production capacity. Surely, their manufacturing processes are not as good as TSMC and Samsung's 5-7 nm processes, but it looks like they plan on catching up with them within the next few years. \n\n- They still have their place in the lower-end desktop/mobile CPU market, as their lower-end CPU's are much cheaper than AMD's. They offer the cheapest CPU's with integrated graphics on the market right now. Even if they don't grow anytime soon, I doubt they will run out of revenue sources, especially with the chip shortage going on.\n\nMy plan would be to hold the stock for a few years and cash in those nice dividends while waiting for the stock to become a growth one. I think Intel has already reached its floor price, and it would be very unlikely that the stock price goes any lower considering that it has strong fundamentals.\n\nWhat do you think?",
        "subreddit": "investing",
        "title": "Intel as a long-term investment",
        "url": "https://www.reddit.com/r/investing/comments/r6gtla/intel_as_a_longterm_investment/",
        "created": 1638399997.0
    },
    {
        "author": "iamthejuanyouseek",
        "created_utc": 1638373454,
        "id": "r6hoig",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Had anyone looked into OUST yet?? NVIDIA partner?",
        "url": "https://www.reddit.com/gallery/r6hoig",
        "created": 1638402254.0
    },
    {
        "author": "UnusualArcher",
        "created_utc": 1638368664,
        "id": "r6fw14",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "With a marketcap of 814B, I wonder how many more upside it can have? It’s starting to be close to a 1T company. It doubled its marketcap in the last 6 months. I like the company, I didn’t get in before, but now I fear that it’s starting to get overpriced. What do you think?",
        "subreddit": "CanadianInvestor",
        "title": "Is it too late to invest in NVDA?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/r6fw14/is_it_too_late_to_invest_in_nvda/",
        "created": 1638397464.0
    },
    {
        "author": "Vagscaper",
        "created_utc": 1638364657,
        "id": "r6ejpa",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Bullish AF on NVDA",
        "url": "https://i.redd.it/3t8v33mrlx281.jpg",
        "created": 1638393457.0
    },
    {
        "author": "wishihadaps42",
        "created_utc": 1638381539,
        "id": "r6ksgb",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Buy more vgt and nvidia or do you think tech peaked for this year?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6ksgb/buy_more_vgt_and_nvidia_or_do_you_think_tech/",
        "created": 1638410339.0
    },
    {
        "author": "FoodCooker62",
        "created_utc": 1638423430,
        "id": "r701rh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "So we now know that anything that's not a behemoth of a company or one that's in semiconductors/EV isn't worth pennies on the dollar anymore, but small cap investors should prepare for a lot more potential pain. \n\nThe market has been hollowing out for months, transferring money from small &amp; mid caps to the large indexes. However, any time the large indexes have a down day the small &amp; mid caps just drop twice as much anyway. Beware that the S&amp;P is ridiculously overvalued, it could easily go back to 4000 or less. If that happens, I have no illusions of what will happen to small caps. \n\nJust some food for thought for those buying the dips on small cap. Apple is still 165, microsoft is still 330. Nvidia is still 315. They could all lose 30% tomorrow and still be way overvalued. Small caps won't stand strong in the wake of such events. Don't go all in on these dips.",
        "subreddit": "stocks",
        "title": "Mega caps completely control this market, and that's bad for small &amp; mid caps",
        "url": "https://www.reddit.com/r/stocks/comments/r701rh/mega_caps_completely_control_this_market_and/",
        "created": 1638452230.0
    },
    {
        "author": "DECABLOO",
        "created_utc": 1638562475,
        "id": "r880rz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "What about NVDA? What do you think will happen? I am quite sure i will continue to decrease in the next couple of days...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r880rz/what_about_nvda_what_do_you_think_will_happen_i/",
        "created": 1638591275.0
    },
    {
        "author": "DECABLOO",
        "created_utc": 1638562176,
        "id": "r87wvc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "what about NVDA guys? What do u think is going to happen?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r87wvc/what_about_nvda_guys_what_do_u_think_is_going_to/",
        "created": 1638590976.0
    },
    {
        "author": "Outrageous_Bat8429",
        "created_utc": 1638393890,
        "id": "r6pmo5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "There seemed to be unlimited potential. “Good fundementals!” is what everyone kept saying. “It has to re-bound soon!” I read everywhere. But UP Fintech (TIGR) continued to make new lows each week. I saw each 5-10% drop as an opportunity to average down. Now I’m holding almost 2,000 shares at $12.74 and there’s still no bottom to be seen. Maybe the next support is at $0. “Be greedy when others are fearful” is my motto, or rather, my rationale to dollar cost average in case of this being the next short squeeze. It’s crazy how well the sunk cost fallacy can encourage you to make long-term horrible decisions. I’m not in debt and am no where near retirement, but damn...do I wish I bought $NVIDIA.",
        "subreddit": "wallstreetbets",
        "title": "Tied up half my net worth in a Chinese Fintech company that is now going to zero",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6pmo5/tied_up_half_my_net_worth_in_a_chinese_fintech/",
        "created": 1638422690.0
    },
    {
        "author": "Recoil42",
        "created_utc": 1638478321,
        "id": "r7h092",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[https://www.cnbc.com/2021/12/02/ftc-sues-to-block-nvidias-40-billion-acquisition-of-arm.html](https://www.cnbc.com/2021/12/02/ftc-sues-to-block-nvidias-40-billion-acquisition-of-arm.html)\n\n&gt;The Federal Trade Commission on Thursday sued to block [Nvidia](https://www.cnbc.com/quotes/NVDA)’s $40 billion acquisition of Arm from SoftBank on antitrust grounds.  \n&gt;  \n&gt;The deal has faced scrutiny from regulators since it was announced last year. The U.S. action is the biggest hurdle it has faced yet, and threatens whether the deal will be completed.  \n&gt;  \n&gt;“The proposed vertical deal would give one of the largest chip companies control over the computing technology and designs that rival firms rely on to develop their own competing chips,” the FTC [said in an announcement](https://www.ftc.gov/news-events/press-releases/2021/12/ftc-sues-block-40-billion-semiconductor-chip-merger).",
        "subreddit": "investing",
        "title": "FTC sues to block Nvidia’s $40 billion acquisition of Arm",
        "url": "https://www.reddit.com/r/investing/comments/r7h092/ftc_sues_to_block_nvidias_40_billion_acquisition/",
        "created": 1638507121.0
    },
    {
        "author": "Conservativeprick",
        "created_utc": 1638501045,
        "id": "r7ouur",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[https://www.ftc.gov/news-events/press-releases/2021/12/ftc-sues-block-40-billion-semiconductor-chip-merger](https://www.ftc.gov/news-events/press-releases/2021/12/ftc-sues-block-40-billion-semiconductor-chip-merger)  \n\n\n\"The Federal Trade Commission today sued to block U.S. chip supplier  Nvidia Corp.’s $40 billion acquisition of U.K. chip design provider Arm  Ltd. Semiconductor chips power the computers and technologies that are  essential to our modern economy and society. The proposed vertical deal  would give one of the largest chip companies control over the computing  technology and designs that rival firms rely on to develop their own  competing chips. The FTC’s complaint alleges that the combined firm  would have the means and incentive to stifle innovative next-generation  technologies, including those used to run datacenters and  driver-assistance systems in cars.                       \n\n“The FTC is suing to block the largest semiconductor chip merger in  history to prevent a chip conglomerate from stifling the innovation  pipeline for next-generation technologies,” said FTC Bureau of  Competition Director Holly Vedova. “Tomorrow’s technologies depend on  preserving today’s competitive, cutting-edge chip markets. This proposed  deal would distort Arm’s incentives in chip markets and allow the  combined firm to unfairly undermine Nvidia’s rivals. The FTC’s lawsuit  should send a strong signal that we will act aggressively to protect our  critical infrastructure markets from illegal vertical mergers that have  far-reaching and damaging effects on future innovations.”",
        "subreddit": "wallstreetbets",
        "title": "FTC Sues to Block $40 Billion Semiconductor Chip Merger",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7ouur/ftc_sues_to_block_40_billion_semiconductor_chip/",
        "created": 1638529845.0
    },
    {
        "author": "Nachious",
        "created_utc": 1638539258,
        "id": "r7zi0j",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Aljazeera.com: US sues to block Nvidia deal to buy British chipmaker Arm.\nhttps://www.aljazeera.com/economy/2021/12/2/us-sues-to-block-nvidia-deal-to-british-chip-maker-arm",
        "subreddit": "wallstreetbets",
        "title": "Need your input.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7zi0j/need_your_input/",
        "created": 1638568058.0
    },
    {
        "author": "itsBhaR",
        "created_utc": 1638414492,
        "id": "r6x625",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Finally stocks are going down. Hope this trend continues down for a few weeks. \n\nWhat stocks/etfs do you think are on sale right now to have good gains in next 5 to 10 years? - FB, DIVO, ABNB, NFLX, ARKQ, VYM?\n\nWhat to add more of NVDA, TSLA, QCOM, MSFT but they aren't coming down as much. \n\nWhat are some good stock/etfs those where high for a few months and start coming down significantly for a past a few days?",
        "subreddit": "stocks",
        "title": "What stocks/etfs on sale?",
        "url": "https://www.reddit.com/r/stocks/comments/r6x625/what_stocksetfs_on_sale/",
        "created": 1638443292.0
    },
    {
        "author": "ramsdesk",
        "created_utc": 1638407970,
        "id": "r6uy3e",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Similar to NVDA",
        "url": "https://www.reddit.com/r/stocks/comments/r6uy3e/similar_to_nvda/",
        "created": 1638436770.0
    },
    {
        "author": "spaceset51",
        "created_utc": 1638368361,
        "id": "r6fs38",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Lately I have been growing my account and feel the need to add positions. I started out just investing in 7 companies, but that has expanded to 9. The list of companies is down below and I just want to clarify that I am a little overweight in my technology positions. Any suggestions. Am I not taking enough risk or taking in too much risk.\n\nAAPL\nMSFT\nAMD\nNVDA\nTMO\nHD\nJPM\nDIS\nTGT",
        "subreddit": "stocks",
        "title": "Am I taking on too much risk?",
        "url": "https://www.reddit.com/r/stocks/comments/r6fs38/am_i_taking_on_too_much_risk/",
        "created": 1638397161.0
    },
    {
        "author": "iamthejuanyouseek",
        "created_utc": 1638373896,
        "id": "r6huiu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Is anyone familiar with this company and the Lidar technology in general? From what I've gathered the Nvidia Drive system uses it. Aside from vehicles it looks like its used in computing and AI. OUST has been on a decline since its open about a year ago. Slowly coming back up though just not sure how much momentum it can hold. Seems pretty under the radar at the moment. Even stocktwits only has a couple thousand followers. Any insights? Possible moon?",
        "subreddit": "wallstreetbets",
        "title": "Ouster partnered with Nvidia and Lidar technology?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6huiu/ouster_partnered_with_nvidia_and_lidar_technology/",
        "created": 1638402696.0
    },
    {
        "author": "PeekingPotato",
        "created_utc": 1638346848,
        "id": "r69z5l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey there guys, I just started analyzing stocks more and I thought I´ll try to do that and post it here. That´s my first analysis for NVDA. If you have any feedback for me that would be great and highly appreciated. If you have questions feel free to ask, I´ll try to answer everything.\n\nToday we will look through the basics of NVIDIA´s business and then see if we can come up with a fair value for NVDA´s stock using discounted free cashflow.\n\nThis is not financial advice and I do not own shares in NVIDIA. Nevertheless I will try to stay as unbiased and objective as I can. Always do your own due diligence.\n\nFirst let´s review their different revenue streams. Their biggest stream, around **45%** of their sales comes from **Gaming**. The **Data Center** makes up around **41%**. Another **8%** comes from **Professional Visualization**. Then there is **3%** from **OEM**, and another **2%** from **Automotive**.\n\nFor the valuation:\n\nWe take **analyst estimates**, we discount that by our **required return of 9,2%**. Then we use the **perpetual growth rate of 2,5%** and that gave us a fair value for NVDA´s stock of **$327 per share**. But because we have to account for **NVDA´s equity** as well, our **fair value of equity** would be **$311 per share**.\n\nNow feel free to include a margin of safety to that.\n\nWith NVDA´s price being at **$326** **per share** right now, it´s kind of fairly valued. That´s why I think buying *heavily* might not be a good idea. Although you can always dollar-cost-average. That´s where you invest every month the same amount.\n\n**Where I see NVDA´s stock price in 5 years.** We can calculate where the price might be in 5 years with the **Earnings Per Share (EPS TTM)**, the **Estimated Growth Rate** and the **Future P/E Value**. With this method I get a stock price of **$868 per share** which is definitely higher than what it is now. \n\n**What I´ll do.** I believe NVIDIA is here to stay. I think they will stay for a long time and innovate even more. That´s why, although the price is not exactly where I would want it to be (I want to include a margin of safety), I will maybe start to **dollar-cost-average**. That way I won´t mind the volatile market and hold for the longterm.\n\nThank you for reading and I hope I´ll see you again.",
        "subreddit": "stocks",
        "title": "Is NVDA a good buy right now?",
        "url": "https://www.reddit.com/r/stocks/comments/r69z5l/is_nvda_a_good_buy_right_now/",
        "created": 1638375648.0
    },
    {
        "author": "BurnerBurnerBurns20",
        "created_utc": 1638387005,
        "id": "r6my4u",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "CNBC’s Jim Cramer said Wednesday he’s not ready to sell any shares Nvidia yet, even though he recently booked some profits in two other big charitable trust winners Advanced Micro Devices and Ford.\n\nhttps://www.cnbc.com/2021/12/01/cramer-says-hes-not-ready-to-sell-nvidia-sees-stock-at-10-trillion-one-day.html\n\nCramer told “Fast Money Halftime Report” he believes that Nvidia could be a $10 trillion stock one day. Shares soared 145% year-to-date to an over $800 billion stock market value.\n\nIt’s no secret that Cramer loves Nvidia, the largest maker of graphics and artificial intelligence chips in the world. He’s even named his dog Nvidia. On television and in his investing club, the “Mad Money” host has praised CEO Jensen Huang’s vision for how the metaverse — or omniverse, which is Nvidia’s preferred term — can be used by businesses to reduce wastefulness and increase efficiency.",
        "subreddit": "stocks",
        "title": "Jim Cramer says he’s not ready to take profits in Nvidia, sees stock at $10 trillion one day",
        "url": "https://www.reddit.com/r/stocks/comments/r6my4u/jim_cramer_says_hes_not_ready_to_take_profits_in/",
        "created": 1638415805.0
    },
    {
        "author": "CuriousGam",
        "created_utc": 1638398695,
        "id": "r6rje4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "yeah, after watching the market for months I want to push some money into stocks, but would like to ask about some details.\n\n&amp;#x200B;\n\n30years, single, job,\n\nin a country with a social system,\n\nemergency fund exists,\n\nno plans for that money\n\n&amp;#x200B;\n\nPlan:\n\n\\~40% All World ETF\n\n\\~40% single stocks\n\napple, Nvidia, MSFT, Cloudflare, Autodesk, Costco, PP, (V + MA..dunno), Intel, SQ, AMZN, Zalando               Qualcomm, intel, Biotech, maybe some EV, battery, stuff etc\n\n\\~20% Those that shall not be named, gambling\n\n&amp;#x200B;\n\nI would put roughly 30% of my income into the things that currently look good... or just into the All World.\n\n&amp;#x200B;\n\n* I guess my split makes sense?\n* How many share should you get? Or what min % should a position have? I mean, is there a reason to get a single stock of multiple companies?\n* Considering that I am mostly looking at Tech stuff, would it be better to take an Technology ETF instead of all that single stocks?\n* Or would it even be useful to take several ETFs (Tech+ Biotech+ Fin+EV) instead of a single one?\n* And in those ETF´s, better take those with a lot of companies or with few? Those with a high% of the Top10 or not?",
        "subreddit": "stocks",
        "title": "Never invested, single stocks or ETF´s?",
        "url": "https://www.reddit.com/r/stocks/comments/r6rje4/never_invested_single_stocks_or_etfs/",
        "created": 1638427495.0
    },
    {
        "author": "r2002",
        "created_utc": 1638485787,
        "id": "r7jomt",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[Source](https://www.cnbc.com/2021/12/02/ftc-sues-to-block-nvidias-40-billion-acquisition-of-arm.html):\n\n* “The proposed vertical deal would give one of the largest chip companies control over the computing technology and designs that rival firms rely on to develop their own competing chips,” the FTC said in an announcement.\n\n* Nvidia stock was up over 2% on Thursday before the announcement, and did not move significantly on the news. The FTC complaint is not yet public.\n\n* FTC Chair Lina Khan, who was appointed by President Joe Biden to lead the agency shortly after her confirmation to the agency earlier this year, has signaled an interest in more robust antitrust enforcement. \n\n* The trial before the FTC’s own administrative law judge is set to begin on Aug. 9, 2022.\n\nThis is [not wholly a surprise](https://finance.yahoo.com/news/nvidias-latest-earnings-report-is-nail-in-coffin-for-40-billion-arm-deal-analyst-172042020.html) to people paying attention. Perhaps that's why price of NVDA didn't really move that much on the news (for now).\n\nAny thoughts on the effect on NVDA? Would this tougher FTC enforcement affect other big acquisitions you're counting on for other companies?",
        "subreddit": "stocks",
        "title": "FTC sues to block Nvidia acquisition of ARM",
        "url": "https://www.reddit.com/r/stocks/comments/r7jomt/ftc_sues_to_block_nvidia_acquisition_of_arm/",
        "created": 1638514587.0
    },
    {
        "author": "NewBlock",
        "created_utc": 1638504484,
        "id": "r7q0vi",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "To preface this, I'm only advising this for young investors, 18-25.\n\n&amp;#x200B;\n\nMost of reddit is quick to recommend you throw all of your money into an ETF, but I disagree. In my opinion, ETFs are more for preserving wealth. Individual stocks is where you gain that wealth. When you're at a young age, your risk tolerance should be way higher than when you're in your 40s. I'm not saying gamble your money on a high-risk penny stock, but you should be putting most of your portfolio in individual stocks. Find a few sectors you like, and find companies within those sectors that have historically performed well and have positive earnings growth.\n\n&amp;#x200B;\n\nI will take 5 sectors and compare popular stocks within those sectors against the 1-year performance of the S&amp;P500 \n\nEnergy: \n\nXOM - 52%\n\nCVX - 28%\n\nCOP - 72%\n\nMRO - 151%\n\nSU - 45%\n\nTotal 1yr performance : 69%\n\n&amp;#x200B;\n\nIndustrials:\n\nLPX - 94%\n\nSEB - 17%\n\nOC - 20%\n\nBLDR - 104%\n\nNLSN - 15%\n\nTotal 1yr performance: 51%\n\n&amp;#x200B;\n\nFinancial:\n\nMA - (-5%)\n\nSOFI - 57%\n\nAXP - 27%\n\nPYPL - (12%)\n\nV - (5%)\n\nTotal 1yr performance: 12%\n\n&amp;#x200B;\n\nShipping:\n\nZIM - 376%\n\nSBLK - 157%\n\nGOGL - 125%\n\nTGH - 87%\n\nSTNG - 12%\n\nTotal 1yr performance: 151%\n\n&amp;#x200B;\n\nTechnology:\n\nNVDA - 139%\n\nNFLX - 24%\n\nAMD - 63%\n\nNET - 124%\n\nINTC - (3%)\n\nTotal 1yr performance: 70%\n\n&amp;#x200B;\n\n**Total 1yr performance of all these stocks combined: 71%**\n\n**Total 1yr performance of the S&amp;P500: 25%**\n\nPicking individual stocks nearly tripled the performance of the S&amp;P500 over the course of a year. While you did take on more risk, this should be considered encouraged at a younger age. As you get older you should gradually move portions of your portfolio over to more blue chips and ETFs. Anyways, I constantly see people saying only to put stocks into ETFs, but I'm curious to hear your thoughts.",
        "subreddit": "stocks",
        "title": "Unpopular opinion: why you shouldn't waste your time in ETFs.",
        "url": "https://www.reddit.com/r/stocks/comments/r7q0vi/unpopular_opinion_why_you_shouldnt_waste_your/",
        "created": 1638533284.0
    },
    {
        "author": "Universe-Science",
        "created_utc": 1638504896,
        "id": "r7q5m0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "We hear so many discussions forecasting a market crash because the P/E ratio has reached 40 and is about to pass the P/E ratio of 2002! The current P/E ratio for S&amp;P is just about 22 and is estimated to lower a bit by end of 2022. How many companies were making billion dollars in 2002? Yes some companies like TESLA and NVDA may have a very high P/E ratio (whether justifiable or not, is not the subject of this post) but many great companies like Apple with great forward-looking earnings have a P/E ratio of less than 30. Don't forget that companies with a great outlook but not profitable like Roku have paid their price and their shares have plunged more than 50% in 2021. Here are two links that you can look at the real data not bullshit posted on Reddit: \n\n[https://ycharts.com/indicators/sp\\_500\\_pe\\_ratio\\_forward\\_estimate](https://ycharts.com/indicators/sp_500_pe_ratio_forward_estimate)\n\nand \n\n[https://www.cnbc.com/2021/10/13/sp-500-earnings-begin-with-headwind-not-seen-since-covid-bottom.html](https://www.cnbc.com/2021/10/13/sp-500-earnings-begin-with-headwind-not-seen-since-covid-bottom.html)",
        "subreddit": "stocks",
        "title": "S&amp;P 500 P/E ratio - currently 22 - Forwar looking 21",
        "url": "https://www.reddit.com/r/stocks/comments/r7q5m0/sp_500_pe_ratio_currently_22_forwar_looking_21/",
        "created": 1638533696.0
    },
    {
        "author": "Stallzy",
        "created_utc": 1638503000,
        "id": "r7pin0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey everyone was wondering if you guys might know why NFLX has dropped so much this month compared to other stocks I'm holding like AMD, MSFT, NVDA, but mainly holding EQQQ and VUSA.\n\nSeems like a great chance to buy the dip perhaps right now as I bought at the start of November near all time highs and now the price is at pre Squid Game levels I believe. Sucks for me a little as I'm down 6% but I believe they'll continue to keep putting out great content and I don't see online content consumption reducing at all. The movie theater seems to becoming more and more a thing of the past but maybe that's my take with nearly 3 months short of not going out for 2 years lol :D",
        "subreddit": "stocks",
        "title": "What's caused NFLX to drop? Just COVID? Pre Squid Game levels, good dip? (Down 6+% this month)",
        "url": "https://www.reddit.com/r/stocks/comments/r7pin0/whats_caused_nflx_to_drop_just_covid_pre_squid/",
        "created": 1638531800.0
    },
    {
        "author": "snkbrdng",
        "created_utc": 1638544242,
        "id": "r817k0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Ok you degenerates missed TSLA, NVDA and AMD, oh yeah and you’re an idiot. \n\nBoom. New play AMD CEO Dr. Lisa Su (long live Dr Su) said during latest earnings call AMD is going close its acquisition of Xilinx. Every shareholder of Xilinx will get 1.72 shares of AMD for their 1 share of XLNX. Today the market has 14% discount on this but it is converging. \n\nIf you like AMD buy Xilinx today and when merger closes by end of month boom you just got a Black Friday sale AMD stock.\n\nIf you’re a true degenerate you’ll buy some 0 DTE crap that will expire worthless.",
        "subreddit": "wallstreetbets",
        "title": "Lisa Su 1 month play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r817k0/lisa_su_1_month_play/",
        "created": 1638573042.0
    },
    {
        "author": "jmj_daytrader",
        "created_utc": 1638539414,
        "id": "r7zjsh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nGoodmorning traders, keeping my eyes on market leaders, aapl,nvda, tesla,xlf, amzn and goog. IF they hold and rally so does the market but if this rally fails you will see signs here first. The path is laid out for a further flush down, but will it? How many more bears will be shaken out before we set lows for the month and get a real bounce to close the year. I was looking for a test above 461/462 before we resume sell side activity. \n\nExplanation in premarket video on personal tread\n\nKey support levels will be 455, 454/453 area and possibly 449 area. Key resistance levels will be 458 premarket, 460/461 and 463areas.  Today's scenarios... \n\n1) Range day structure. Establish 1st range low around 454/453 area. Then chopping back toward 460/461 area and possibly pushing the boundaries lower at some point.  \n\n2) Trange day (rounded reversal) we take off up from open until we get to the midday chop area of 460/461 area or next support area. After a sideways move we look for a move back towards 454/453.  \n\n3) Trend up day structure.  we open gap up we fade back into support around or before yesterdays close 457.4. We will see a little sideways action before reversing taking off toward 460/461. We stop and get our midday chop. We start the second half of the day with a choppy range before a possible fade into the close.",
        "subreddit": "options",
        "title": "Jobs Friday the fight is on... xmas rally or xmas fail. 12/3/21 Premarket outlook Technical Analysis on the SPY.",
        "url": "https://www.reddit.com/r/options/comments/r7zjsh/jobs_friday_the_fight_is_on_xmas_rally_or_xmas/",
        "created": 1638568214.0
    },
    {
        "author": "Available_Wonder_688",
        "created_utc": 1638539109,
        "id": "r7zgbw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Let's raise Nvidia stock.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r7zgbw/lets_raise_nvidia_stock/",
        "created": 1638567909.0
    },
    {
        "author": "thespitfire69",
        "created_utc": 1638409796,
        "id": "r6vk4f",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi guys,\n\nFirst time posting, appreciate any feedback. I'm aware some of the capitalized stock tickers aren't proper stock tickers just some rough notes I took.\n\nHere's some positions Im thinking of buying 65% now and 35% of position later on dips.\n\nLet me know your thoughts, I haven't decided on allocations. Pokemon cards will be 2% max haha, just buying some sealed booster boxes.\n\nInvestment horizon 1.5-2.5 years.\n\nHACK? (Cybersecurity ETF)\nVaccine stocks?\nNVIDIA\nPokemon cards?\nAMD\nQUALCOMM\nINTEL\nGOOG\nAPPL\nCARBON CREDITS\nS&amp;P500 ETF\nDividend ETF?\nMLM Stagflation Hedge ETF\nLynas? (Rare earth metals)",
        "subreddit": "wallstreetbets",
        "title": "Thoughts on my positions?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6vk4f/thoughts_on_my_positions/",
        "created": 1638438596.0
    },
    {
        "author": "llPOGIl",
        "created_utc": 1638413907,
        "id": "r6wyvl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hello everyone,\n\nI have $65k realized short term gains for 2021 as of now. I also have a stock position where I’m down $17k.\n\nI’m wondering is it strategically better to\n\nA). Pay tax on the $65k gains at 24% tax rate and sell the stock position for $17k loss in 2022 to start the year with $17k tax credit.\n\nOr \n\nB). Sell the stock position for $17k loss and tax harvest to have a realized short term gains of $48k instead. And use the principal to buy Nvidia or Apple.\n\nThank you ahead of time for your input.",
        "subreddit": "stocks",
        "title": "Tax Loss Harvest Question",
        "url": "https://www.reddit.com/r/stocks/comments/r6wyvl/tax_loss_harvest_question/",
        "created": 1638442707.0
    },
    {
        "author": "AlE833",
        "created_utc": 1638399595,
        "id": "r6rvwp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "As the title suggests, I believe the stock gravy train is ending by the completion of this year. \n\nWhat do I mean by this? I mean, we won’t be seeing an ‘everything rally’ like we have seen the last two years especially. Already, we have seen those mid-cap tech stocks bleed as investors flock to the FAANG stocks. \n\nIf you look at the charts for the past two years or so, you’ll see huge gains for practically every stock. Those gains happened because of liquidity and zero interest rates. The Fed is going to raise interest rates next year. This is normal but because of the huge gains already, we won’t see that repeat itself. That’s what I mean by the end of the gravy train. \n\nHow much will rates go up and how quickly? No one knows. But it could have a huge effect on values. We have seen stocks just because of this Covid variant. Rates will shock the system and you’ll have panic selling. \n\nI’m going to keep buying into my SPY and QQQ ETFs, and with stocks I’m sticking to tried and true - Google, Microsoft, Apple, Tesla and Nvidia. We are heading towards a future where these companies will continue to dominate and innovate.",
        "subreddit": "stocks",
        "title": "Gravy train is ending soon",
        "url": "https://www.reddit.com/r/stocks/comments/r6rvwp/gravy_train_is_ending_soon/",
        "created": 1638428395.0
    },
    {
        "author": "Serrot69",
        "created_utc": 1638392574,
        "id": "r6p4ij",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I’m up on Nvidia over 150%, and I’m debating selling it in favor of buying a semiconductor ETF. I still believe in the sector but I think Nvidia is currently overvalued.\n\nMoreover, Jim Cramer said he ain’t selling any Nvidia, which is clearly a sell signal lol",
        "subreddit": "stocks",
        "title": "Would you take profits on Nvidia in favor of SMH?",
        "url": "https://www.reddit.com/r/stocks/comments/r6p4ij/would_you_take_profits_on_nvidia_in_favor_of_smh/",
        "created": 1638421374.0
    },
    {
        "author": "SomeKindOfSorbet",
        "created_utc": 1638371197,
        "id": "r6gtla",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I'm pretty new to stock trading, so don't hesitate to point out anything I omitted that you think would be worth mentioning regarding Intel.\n\nSo Intel seems to be one of those tech underdogs who no one thinks will perform well in the future because they haven't been innovative at all in the past few years compared to companies like AMD and such. To me, this looks like a long-term buy opportunity:\n\n-  Financials look pretty healthy from what I know.\n\n- 2.80% dividend yield is a big nice-to-have if you're gonna hold the stock patiently for a few years.\n\n- P/E ratio is one of the lowest in the tech market right now, meaning that the company has a lot of room to grow if the expectations become optimistic. And in the case of a market crash, it would be one of the safest bets in the tech market because of its healthy P/E ratio (correct me if I'm wrong on this one).\n\n- They announced an increase in capital spending for the next year, so they are likely trying to get back the ground that they've lost in their technological advancement.\n\n- They're soon going to compete in the discrete GPU market too, so that can't do them any wrong.\n\n- With their own semiconductor foundries, they have an upper edge in manufacturing costs and can avoid a lot of supply chain related issues. And with the never-ending chip shortage, they might be able to make more chips at more affordable costs than AMD and Nvidia, who are bound in their production by TSMC's production capacity. Surely, their manufacturing processes are not as good as TSMC and Samsung's 5-7 nm processes, but it looks like they plan on catching up with them within the next few years. \n\n- They still have their place in the lower-end desktop/mobile CPU market, as their lower-end CPU's are much cheaper than AMD's. They offer the cheapest CPU's with integrated graphics on the market right now. Even if they don't grow anytime soon, I doubt they will run out of revenue sources, especially with the chip shortage going on.\n\nMy plan would be to hold the stock for a few years and cash in those nice dividends while waiting for the stock to become a growth one. I think Intel has already reached its floor price, and it would be very unlikely that the stock price goes any lower considering that it has strong fundamentals.\n\nWhat do you think?",
        "subreddit": "investing",
        "title": "Intel as a long-term investment",
        "url": "https://www.reddit.com/r/investing/comments/r6gtla/intel_as_a_longterm_investment/",
        "created": 1638399997.0
    },
    {
        "author": "iamthejuanyouseek",
        "created_utc": 1638373454,
        "id": "r6hoig",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Had anyone looked into OUST yet?? NVIDIA partner?",
        "url": "https://www.reddit.com/gallery/r6hoig",
        "created": 1638402254.0
    },
    {
        "author": "UnusualArcher",
        "created_utc": 1638368664,
        "id": "r6fw14",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "With a marketcap of 814B, I wonder how many more upside it can have? It’s starting to be close to a 1T company. It doubled its marketcap in the last 6 months. I like the company, I didn’t get in before, but now I fear that it’s starting to get overpriced. What do you think?",
        "subreddit": "CanadianInvestor",
        "title": "Is it too late to invest in NVDA?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/r6fw14/is_it_too_late_to_invest_in_nvda/",
        "created": 1638397464.0
    },
    {
        "author": "Vagscaper",
        "created_utc": 1638364657,
        "id": "r6ejpa",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Bullish AF on NVDA",
        "url": "https://i.redd.it/3t8v33mrlx281.jpg",
        "created": 1638393457.0
    },
    {
        "author": "wishihadaps42",
        "created_utc": 1638381539,
        "id": "r6ksgb",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Buy more vgt and nvidia or do you think tech peaked for this year?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6ksgb/buy_more_vgt_and_nvidia_or_do_you_think_tech/",
        "created": 1638410339.0
    },
    {
        "author": "FoodCooker62",
        "created_utc": 1638423430,
        "id": "r701rh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "So we now know that anything that's not a behemoth of a company or one that's in semiconductors/EV isn't worth pennies on the dollar anymore, but small cap investors should prepare for a lot more potential pain. \n\nThe market has been hollowing out for months, transferring money from small &amp; mid caps to the large indexes. However, any time the large indexes have a down day the small &amp; mid caps just drop twice as much anyway. Beware that the S&amp;P is ridiculously overvalued, it could easily go back to 4000 or less. If that happens, I have no illusions of what will happen to small caps. \n\nJust some food for thought for those buying the dips on small cap. Apple is still 165, microsoft is still 330. Nvidia is still 315. They could all lose 30% tomorrow and still be way overvalued. Small caps won't stand strong in the wake of such events. Don't go all in on these dips.",
        "subreddit": "stocks",
        "title": "Mega caps completely control this market, and that's bad for small &amp; mid caps",
        "url": "https://www.reddit.com/r/stocks/comments/r701rh/mega_caps_completely_control_this_market_and/",
        "created": 1638452230.0
    },
    {
        "author": "Outrageous_Bat8429",
        "created_utc": 1638393890,
        "id": "r6pmo5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "There seemed to be unlimited potential. “Good fundementals!” is what everyone kept saying. “It has to re-bound soon!” I read everywhere. But UP Fintech (TIGR) continued to make new lows each week. I saw each 5-10% drop as an opportunity to average down. Now I’m holding almost 2,000 shares at $12.74 and there’s still no bottom to be seen. Maybe the next support is at $0. “Be greedy when others are fearful” is my motto, or rather, my rationale to dollar cost average in case of this being the next short squeeze. It’s crazy how well the sunk cost fallacy can encourage you to make long-term horrible decisions. I’m not in debt and am no where near retirement, but damn...do I wish I bought $NVIDIA.",
        "subreddit": "wallstreetbets",
        "title": "Tied up half my net worth in a Chinese Fintech company that is now going to zero",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6pmo5/tied_up_half_my_net_worth_in_a_chinese_fintech/",
        "created": 1638422690.0
    },
    {
        "author": "itsBhaR",
        "created_utc": 1638414492,
        "id": "r6x625",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Finally stocks are going down. Hope this trend continues down for a few weeks. \n\nWhat stocks/etfs do you think are on sale right now to have good gains in next 5 to 10 years? - FB, DIVO, ABNB, NFLX, ARKQ, VYM?\n\nWhat to add more of NVDA, TSLA, QCOM, MSFT but they aren't coming down as much. \n\nWhat are some good stock/etfs those where high for a few months and start coming down significantly for a past a few days?",
        "subreddit": "stocks",
        "title": "What stocks/etfs on sale?",
        "url": "https://www.reddit.com/r/stocks/comments/r6x625/what_stocksetfs_on_sale/",
        "created": 1638443292.0
    },
    {
        "author": "ramsdesk",
        "created_utc": 1638407970,
        "id": "r6uy3e",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Similar to NVDA",
        "url": "https://www.reddit.com/r/stocks/comments/r6uy3e/similar_to_nvda/",
        "created": 1638436770.0
    },
    {
        "author": "spaceset51",
        "created_utc": 1638368361,
        "id": "r6fs38",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Lately I have been growing my account and feel the need to add positions. I started out just investing in 7 companies, but that has expanded to 9. The list of companies is down below and I just want to clarify that I am a little overweight in my technology positions. Any suggestions. Am I not taking enough risk or taking in too much risk.\n\nAAPL\nMSFT\nAMD\nNVDA\nTMO\nHD\nJPM\nDIS\nTGT",
        "subreddit": "stocks",
        "title": "Am I taking on too much risk?",
        "url": "https://www.reddit.com/r/stocks/comments/r6fs38/am_i_taking_on_too_much_risk/",
        "created": 1638397161.0
    },
    {
        "author": "iamthejuanyouseek",
        "created_utc": 1638373896,
        "id": "r6huiu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Is anyone familiar with this company and the Lidar technology in general? From what I've gathered the Nvidia Drive system uses it. Aside from vehicles it looks like its used in computing and AI. OUST has been on a decline since its open about a year ago. Slowly coming back up though just not sure how much momentum it can hold. Seems pretty under the radar at the moment. Even stocktwits only has a couple thousand followers. Any insights? Possible moon?",
        "subreddit": "wallstreetbets",
        "title": "Ouster partnered with Nvidia and Lidar technology?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6huiu/ouster_partnered_with_nvidia_and_lidar_technology/",
        "created": 1638402696.0
    },
    {
        "author": "PeekingPotato",
        "created_utc": 1638346848,
        "id": "r69z5l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey there guys, I just started analyzing stocks more and I thought I´ll try to do that and post it here. That´s my first analysis for NVDA. If you have any feedback for me that would be great and highly appreciated. If you have questions feel free to ask, I´ll try to answer everything.\n\nToday we will look through the basics of NVIDIA´s business and then see if we can come up with a fair value for NVDA´s stock using discounted free cashflow.\n\nThis is not financial advice and I do not own shares in NVIDIA. Nevertheless I will try to stay as unbiased and objective as I can. Always do your own due diligence.\n\nFirst let´s review their different revenue streams. Their biggest stream, around **45%** of their sales comes from **Gaming**. The **Data Center** makes up around **41%**. Another **8%** comes from **Professional Visualization**. Then there is **3%** from **OEM**, and another **2%** from **Automotive**.\n\nFor the valuation:\n\nWe take **analyst estimates**, we discount that by our **required return of 9,2%**. Then we use the **perpetual growth rate of 2,5%** and that gave us a fair value for NVDA´s stock of **$327 per share**. But because we have to account for **NVDA´s equity** as well, our **fair value of equity** would be **$311 per share**.\n\nNow feel free to include a margin of safety to that.\n\nWith NVDA´s price being at **$326** **per share** right now, it´s kind of fairly valued. That´s why I think buying *heavily* might not be a good idea. Although you can always dollar-cost-average. That´s where you invest every month the same amount.\n\n**Where I see NVDA´s stock price in 5 years.** We can calculate where the price might be in 5 years with the **Earnings Per Share (EPS TTM)**, the **Estimated Growth Rate** and the **Future P/E Value**. With this method I get a stock price of **$868 per share** which is definitely higher than what it is now. \n\n**What I´ll do.** I believe NVIDIA is here to stay. I think they will stay for a long time and innovate even more. That´s why, although the price is not exactly where I would want it to be (I want to include a margin of safety), I will maybe start to **dollar-cost-average**. That way I won´t mind the volatile market and hold for the longterm.\n\nThank you for reading and I hope I´ll see you again.",
        "subreddit": "stocks",
        "title": "Is NVDA a good buy right now?",
        "url": "https://www.reddit.com/r/stocks/comments/r69z5l/is_nvda_a_good_buy_right_now/",
        "created": 1638375648.0
    },
    {
        "author": "BurnerBurnerBurns20",
        "created_utc": 1638387005,
        "id": "r6my4u",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "CNBC’s Jim Cramer said Wednesday he’s not ready to sell any shares Nvidia yet, even though he recently booked some profits in two other big charitable trust winners Advanced Micro Devices and Ford.\n\nhttps://www.cnbc.com/2021/12/01/cramer-says-hes-not-ready-to-sell-nvidia-sees-stock-at-10-trillion-one-day.html\n\nCramer told “Fast Money Halftime Report” he believes that Nvidia could be a $10 trillion stock one day. Shares soared 145% year-to-date to an over $800 billion stock market value.\n\nIt’s no secret that Cramer loves Nvidia, the largest maker of graphics and artificial intelligence chips in the world. He’s even named his dog Nvidia. On television and in his investing club, the “Mad Money” host has praised CEO Jensen Huang’s vision for how the metaverse — or omniverse, which is Nvidia’s preferred term — can be used by businesses to reduce wastefulness and increase efficiency.",
        "subreddit": "stocks",
        "title": "Jim Cramer says he’s not ready to take profits in Nvidia, sees stock at $10 trillion one day",
        "url": "https://www.reddit.com/r/stocks/comments/r6my4u/jim_cramer_says_hes_not_ready_to_take_profits_in/",
        "created": 1638415805.0
    },
    {
        "author": "CuriousGam",
        "created_utc": 1638398695,
        "id": "r6rje4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "yeah, after watching the market for months I want to push some money into stocks, but would like to ask about some details.\n\n&amp;#x200B;\n\n30years, single, job,\n\nin a country with a social system,\n\nemergency fund exists,\n\nno plans for that money\n\n&amp;#x200B;\n\nPlan:\n\n\\~40% All World ETF\n\n\\~40% single stocks\n\napple, Nvidia, MSFT, Cloudflare, Autodesk, Costco, PP, (V + MA..dunno), Intel, SQ, AMZN, Zalando               Qualcomm, intel, Biotech, maybe some EV, battery, stuff etc\n\n\\~20% Those that shall not be named, gambling\n\n&amp;#x200B;\n\nI would put roughly 30% of my income into the things that currently look good... or just into the All World.\n\n&amp;#x200B;\n\n* I guess my split makes sense?\n* How many share should you get? Or what min % should a position have? I mean, is there a reason to get a single stock of multiple companies?\n* Considering that I am mostly looking at Tech stuff, would it be better to take an Technology ETF instead of all that single stocks?\n* Or would it even be useful to take several ETFs (Tech+ Biotech+ Fin+EV) instead of a single one?\n* And in those ETF´s, better take those with a lot of companies or with few? Those with a high% of the Top10 or not?",
        "subreddit": "stocks",
        "title": "Never invested, single stocks or ETF´s?",
        "url": "https://www.reddit.com/r/stocks/comments/r6rje4/never_invested_single_stocks_or_etfs/",
        "created": 1638427495.0
    },
    {
        "author": "thespitfire69",
        "created_utc": 1638409796,
        "id": "r6vk4f",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi guys,\n\nFirst time posting, appreciate any feedback. I'm aware some of the capitalized stock tickers aren't proper stock tickers just some rough notes I took.\n\nHere's some positions Im thinking of buying 65% now and 35% of position later on dips.\n\nLet me know your thoughts, I haven't decided on allocations. Pokemon cards will be 2% max haha, just buying some sealed booster boxes.\n\nInvestment horizon 1.5-2.5 years.\n\nHACK? (Cybersecurity ETF)\nVaccine stocks?\nNVIDIA\nPokemon cards?\nAMD\nQUALCOMM\nINTEL\nGOOG\nAPPL\nCARBON CREDITS\nS&amp;P500 ETF\nDividend ETF?\nMLM Stagflation Hedge ETF\nLynas? (Rare earth metals)",
        "subreddit": "wallstreetbets",
        "title": "Thoughts on my positions?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6vk4f/thoughts_on_my_positions/",
        "created": 1638438596.0
    },
    {
        "author": "llPOGIl",
        "created_utc": 1638413907,
        "id": "r6wyvl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hello everyone,\n\nI have $65k realized short term gains for 2021 as of now. I also have a stock position where I’m down $17k.\n\nI’m wondering is it strategically better to\n\nA). Pay tax on the $65k gains at 24% tax rate and sell the stock position for $17k loss in 2022 to start the year with $17k tax credit.\n\nOr \n\nB). Sell the stock position for $17k loss and tax harvest to have a realized short term gains of $48k instead. And use the principal to buy Nvidia or Apple.\n\nThank you ahead of time for your input.",
        "subreddit": "stocks",
        "title": "Tax Loss Harvest Question",
        "url": "https://www.reddit.com/r/stocks/comments/r6wyvl/tax_loss_harvest_question/",
        "created": 1638442707.0
    },
    {
        "author": "AlE833",
        "created_utc": 1638399595,
        "id": "r6rvwp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "As the title suggests, I believe the stock gravy train is ending by the completion of this year. \n\nWhat do I mean by this? I mean, we won’t be seeing an ‘everything rally’ like we have seen the last two years especially. Already, we have seen those mid-cap tech stocks bleed as investors flock to the FAANG stocks. \n\nIf you look at the charts for the past two years or so, you’ll see huge gains for practically every stock. Those gains happened because of liquidity and zero interest rates. The Fed is going to raise interest rates next year. This is normal but because of the huge gains already, we won’t see that repeat itself. That’s what I mean by the end of the gravy train. \n\nHow much will rates go up and how quickly? No one knows. But it could have a huge effect on values. We have seen stocks just because of this Covid variant. Rates will shock the system and you’ll have panic selling. \n\nI’m going to keep buying into my SPY and QQQ ETFs, and with stocks I’m sticking to tried and true - Google, Microsoft, Apple, Tesla and Nvidia. We are heading towards a future where these companies will continue to dominate and innovate.",
        "subreddit": "stocks",
        "title": "Gravy train is ending soon",
        "url": "https://www.reddit.com/r/stocks/comments/r6rvwp/gravy_train_is_ending_soon/",
        "created": 1638428395.0
    },
    {
        "author": "Serrot69",
        "created_utc": 1638392574,
        "id": "r6p4ij",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I’m up on Nvidia over 150%, and I’m debating selling it in favor of buying a semiconductor ETF. I still believe in the sector but I think Nvidia is currently overvalued.\n\nMoreover, Jim Cramer said he ain’t selling any Nvidia, which is clearly a sell signal lol",
        "subreddit": "stocks",
        "title": "Would you take profits on Nvidia in favor of SMH?",
        "url": "https://www.reddit.com/r/stocks/comments/r6p4ij/would_you_take_profits_on_nvidia_in_favor_of_smh/",
        "created": 1638421374.0
    },
    {
        "author": "SomeKindOfSorbet",
        "created_utc": 1638371197,
        "id": "r6gtla",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I'm pretty new to stock trading, so don't hesitate to point out anything I omitted that you think would be worth mentioning regarding Intel.\n\nSo Intel seems to be one of those tech underdogs who no one thinks will perform well in the future because they haven't been innovative at all in the past few years compared to companies like AMD and such. To me, this looks like a long-term buy opportunity:\n\n-  Financials look pretty healthy from what I know.\n\n- 2.80% dividend yield is a big nice-to-have if you're gonna hold the stock patiently for a few years.\n\n- P/E ratio is one of the lowest in the tech market right now, meaning that the company has a lot of room to grow if the expectations become optimistic. And in the case of a market crash, it would be one of the safest bets in the tech market because of its healthy P/E ratio (correct me if I'm wrong on this one).\n\n- They announced an increase in capital spending for the next year, so they are likely trying to get back the ground that they've lost in their technological advancement.\n\n- They're soon going to compete in the discrete GPU market too, so that can't do them any wrong.\n\n- With their own semiconductor foundries, they have an upper edge in manufacturing costs and can avoid a lot of supply chain related issues. And with the never-ending chip shortage, they might be able to make more chips at more affordable costs than AMD and Nvidia, who are bound in their production by TSMC's production capacity. Surely, their manufacturing processes are not as good as TSMC and Samsung's 5-7 nm processes, but it looks like they plan on catching up with them within the next few years. \n\n- They still have their place in the lower-end desktop/mobile CPU market, as their lower-end CPU's are much cheaper than AMD's. They offer the cheapest CPU's with integrated graphics on the market right now. Even if they don't grow anytime soon, I doubt they will run out of revenue sources, especially with the chip shortage going on.\n\nMy plan would be to hold the stock for a few years and cash in those nice dividends while waiting for the stock to become a growth one. I think Intel has already reached its floor price, and it would be very unlikely that the stock price goes any lower considering that it has strong fundamentals.\n\nWhat do you think?",
        "subreddit": "investing",
        "title": "Intel as a long-term investment",
        "url": "https://www.reddit.com/r/investing/comments/r6gtla/intel_as_a_longterm_investment/",
        "created": 1638399997.0
    },
    {
        "author": "iamthejuanyouseek",
        "created_utc": 1638373454,
        "id": "r6hoig",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Had anyone looked into OUST yet?? NVIDIA partner?",
        "url": "https://www.reddit.com/gallery/r6hoig",
        "created": 1638402254.0
    },
    {
        "author": "UnusualArcher",
        "created_utc": 1638368664,
        "id": "r6fw14",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "With a marketcap of 814B, I wonder how many more upside it can have? It’s starting to be close to a 1T company. It doubled its marketcap in the last 6 months. I like the company, I didn’t get in before, but now I fear that it’s starting to get overpriced. What do you think?",
        "subreddit": "CanadianInvestor",
        "title": "Is it too late to invest in NVDA?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/r6fw14/is_it_too_late_to_invest_in_nvda/",
        "created": 1638397464.0
    },
    {
        "author": "Vagscaper",
        "created_utc": 1638364657,
        "id": "r6ejpa",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Bullish AF on NVDA",
        "url": "https://i.redd.it/3t8v33mrlx281.jpg",
        "created": 1638393457.0
    },
    {
        "author": "wishihadaps42",
        "created_utc": 1638381539,
        "id": "r6ksgb",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Buy more vgt and nvidia or do you think tech peaked for this year?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6ksgb/buy_more_vgt_and_nvidia_or_do_you_think_tech/",
        "created": 1638410339.0
    },
    {
        "author": "earthWindFI",
        "created_utc": 1638376315,
        "id": "r6isiq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Thesis**\n\n* SIMO is a supplier of computer memory and benefits from the rise of datacenters, EV, smartphones, and other consumer tech\n* SIMO is a major supplier of Micron Technology (MU) 🚀\n* Revenues grew 100% Y/Y in Q3 2021\n* SIMO management forecasts revenue of $1.5B in 2022 (+50% growth over 2021) 🚀🚀\n* Most analysts are significantly under-pricing the company, only modelling $1B of revenue in 2022 (implying no growth) -- see sources below\n* The only analyst properly reflecting $1.5B revenue in 2022 has a **PT of $115 (60% upside) 🚀🚀**🚀\n\n&amp;#x200B;\n\n\\-----\n\n**Company Overview**\n\nSilicon Motion Technology (SIMO) is the global leader in supplying NAND flash controllers for solid state storage devices and the merchant leader in supplying SSD controllers.\n\nSIMO has the broadest portfolio of controller technologies and their controllers are widely used in embedded storage products such as SSDs and eMMC+UFS devices, which are found in smartphones, PCs and commercial and industrial applications.\n\nSIMO has have shipped over six billion NAND controllers in the last ten years, more than any other company in the world.\n\nMore NAND flash components, including current and up-coming generations of 3D flash produced by Intel, Kioxia, Micron, Samsung, SK Hynix, Western Digital and YMTC, are supported by Silicon Motion controllers than any other company. SIMO's customers include NAND flash makers, module makers, hyperscalers and OEMs. \n\nSIMO supplies customized high-performance hyperscale data center and industrial SSD solutions. SIMO's customers include most of the NAND flash vendors, storage device module makers and leading OEMs.\n\n**SIMO has a current share price of \\~$72 with a P/E ratio of \\~18x**\n\n&amp;#x200B;\n\n\\-----\n\n**Management Guidance**\n\nOn SIMO's [Q2 2021 earnings call](https://www.fool.com/earnings/call-transcripts/2021/07/30/silicon-motion-technology-corporation-simo-q2-2021/), management guided towards significant revenue growth in 2022:\n\n&gt;Based on our latest sales projection, our annual run rate is expected to be already at least $1 billion by this year's fourth quarter. **We expect sales of ultimately exceed $1 billion next year** as we add meaningful incremental foundry capacity already committed to us and from continued execution of our four prong initiative, which includes upselling a richer mix of products. Sales next year will include the rapid scaling of a higher value, high-volume PCIe Gen4 SSD controller.  \n&gt;  \n&gt;**Our customers have also provided us with purchase orders for the next year, and the order book today already exceeds $1.5 billion.** Our strong order book is a result of many years of hard work. No last minute opportunistic procurement audit of all the shelf parts by customers. We have been building our business pipeline for many years, leading to these purchase orders. Our OEM projects typically kick off one to three years before initial sales, depending on product capacity.  \n&gt;  \n&gt;**Already, our order book for next year is at least $1.5 billion, and our team is currently working to ensure we can deliver this. Next quarter, we will provide an update on our work. And at the start of next year, we will provide our official 2022 revenue guidance**.  \n&gt;  \n&gt;I will say, our client revenue will continue to grow. Although PCIe Gen3 next year growth rate will be modestly, but PCIe Gen will grow very strong to carry because we have a very large design share in PC OEM. We stated almost 50% higher by end of the next year so that we have eight different customer, five on NAND maker with our PCIe Gen4 controller and ramping next year. For eMMC+UFS, we also will grow very, very strongly. It also depends how many wafer we can secure.  \n&gt;  \n&gt;We say it's going not to grow for a certain level, **we guarantee is exceed the $1 billion of revenue next year**. But we think the backlog will continue to pile up by end of this year. But we'll continue to work very hard to secure more wafer, especially in mature technology because many eMMC are in 55, 40-nanometer and 28 meter, these mature technology wafer are in severe allocation from all foundry makers. So this is very critical, how fast we can porting, work with TSMC as well as other foundry that can grow overall the eMMC+UFS business.\n\n&amp;#x200B;\n\nThis guidance was confirmed on SIMO's [Q3 2021 earnings call](https://www.fool.com/earnings/call-transcripts/2021/10/28/silicon-motion-technology-corporation-simo-q3-2021/):\n\n&gt; In the third quarter, sales and earnings reached another quarterly company record. **Revenue grew 15% sequentially and over 100% year-over-year to $254 million**  \n&gt;  \n&gt;We expect this situation of demanding excess of supply to continue through next year since foundry capacity will likely only start improving in 2023. Our order book remains strong and continues to be well in excess of $1.5 billion for next year.   \n&gt;  \n&gt;**In the third quarter, we delivered $1 billion in revenue run rate a quarter ahead of when we had previously communicated and expect our revenue run rate to increase further in the fourth quarter** as we focus on managing our product mix, customer allocation and pricing. We have already received foundry wafer allocation for 2022. **That is incremental to what we have this year, and we are confident we can grow ourselves next year toward our $1.5 billion order book.**  \n&gt;  \n&gt;I think based on the third quarter revenue and fourth quarter guidance, we are ready at a $1 billion sale revenue rate with our current wafer supply. We have already received foundry wafer allocation for 2022 as we state. **That's incremental to what we have this year, and we are confident we can grow our sales next year to around $1.5 billion.** We believe the demand will continue to exceed supply next year, but I think we definitely will continue to negotiate and discover TSMC to gain more wafer supply. Regarding the $1.5 billion backlog, I think we -- **our backlog remained very solid with the purchase order of 2022, continued to be well in excess of $1.5 billion**. Most of the backlog consists SSD and eMMC+UFS controller order \\[Indecipherable\\] 23:35. An OEM order is strong because our customers have been gaining share, and we have been gaining share of \\[Indecipherable\\] 23:41 as these customers. We believe we have secured about 50% of all PC OEM and PCIe Gen four socket for next year. But we have seen, however, some adjustment in our order book with the softening of order for channel market product and strengthening our product for OEM customer. For example, we are seeing demand for SSD by global PC OEM continue to strengthen, our current client SSD for retail market, especially in China, softening. \n\n&amp;#x200B;\n\nI repeat: management guarantees that revenue will exceed $1B in 2022.\n\nNow what do the anal(ysts) think?\n\n&amp;#x200B;\n\n\\-----\n\n**Analyst Estimates**\n\n* Morgan Stanley research: price target of $78 with only $1B of revenue modelled in 2022 / 2023\n\nhttps://preview.redd.it/zq7z1bccey281.png?width=473&amp;format=png&amp;auto=webp&amp;s=8fe6bf8cde6597ea7db096112c377fa7771dd3c3\n\n* Bank of America research: price target of $80 with only \\~$850M of revenue modelled in 2022 / 2023\n\nhttps://preview.redd.it/ia6skvysey281.png?width=502&amp;format=png&amp;auto=webp&amp;s=f326906c0291c5bf0a9323ae7a3f7a1ecb52418b\n\nNeedham is the only analyst properly reflecting $1.5B of revenue in 2022. Key points from Needham's Oct. 28 research report:\n\n* \"$1BN In the Bag, $1.5BN In the Cards - Stock Doesn't Reflect This At All\"\n* **Price Target: $115.00**\n\n&amp;#x200B;\n\n\\-----\n\n**Recommendation**\n\nI recommend you hold shares or calls with 3-6+ months to expiry.\n\nShort term catalysts:\n\n* Nov. 30: SIMO @ the 2021 Wells Fargo Virtual TMT Summit\n* Dec. 2: SIMO @ the Credit Suisse 25th Annual Technology Conference\n* Feb. 2022: SIMO reports Q4 2021 earnings\n\n Position: I hold $70 June 2022 calls.",
        "subreddit": "wallstreetbets",
        "title": "$SIMO DD: an undervalued play in computer memory with short-term catalysts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6isiq/simo_dd_an_undervalued_play_in_computer_memory/",
        "created": 1638405115.0
    }
]