[
    {
        "author": "AthleteHuman8233",
        "created_utc": 1628527613,
        "id": "p159pk",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "eToro was founded as RetailFX in 2007[11] in Tel Aviv, by brothers Yoni Assia and Ronen Assia together with David Ring.[12]\n\nIn 2010, the firm released the eToro OpenBook social investment platform, along with its CopyTrading feature, that enables investors to view, follow and copy the network's top traders automatically.[13] Later that year, the firm released its first Android app for access via mobile devices.[14]\n\nBetween 2007 and 2013, the company raised $31.5 million in four rounds of funding.[15][16] In December 2014, it raised $27 million from Russian and Chinese investors.[17] In December 2017, it joined CoinDash as partners to develop Blockchain-based social trading.[18] In 2018, it raised a further $100 million in a private funding round.[19] Overall, more than $162 million has been invested in the company by investment firms Spark Capital, SBI Holdings, Germany’s CommerzVentures, Chinese bank Ping An Insurance, Russian state-owned financial firm Sberbank,[20] Korea Investment Partners, technology-focused BRM Group, and China Minsheng Financial Holdings.[5][21][22]\n\nIn 2013, the firm introduced the capability to invest in stocks and CFDs, with an initial offering of 110 stock products.[23] The same year, it was authorized to offer its services in the UK by the FCA regulatory authority, under the subsidiary eToro UK.[24] In January 2014, the firm added cryptocurrencies to its investment instruments.[25][26]\n\nIn April 2014, the firm added 130 British and German stocks composing the FTSE 100 Index and the DAX30 indices to the company's stock selection.[27]\n\nIn 2017, it launched a CopyPortfolio feature, enabling investors to copy investment portfolios from the best-performing traders.[28]\n\nIn 2018, it launched a cryptcurrency wallet for Android and iOS.[29][30] In May 2018, it entered the US market by offering 10 cryptocurrencies:[31] In November 2018, it announced the launch of GoodDollar, a non-profit, open-source community project aimed to reduce global wealth inequality through universal basic income (UBI) using blockchain technology.[32]\n\nIn March 2019, eToro acquired Danish blockchain company Firmo for an undisclosed sum.[33][34] In October 2019, eToro released a sentiment-based crypt portfolio using AI technology to evaluate Twitter's current positive or negative impressions of digital assets.[35] In November 2019, the firm acquired Delta, a crypt portfolio tracker application company, based in Belgium.[36][37]\n\nAs of May 2020, the firm had 13 million registered accounts.[38] In March 2021, eToro announced that it is planning to become a publicly traded company through a reverse subsidiary merger with FinTech Acquisition Corp V (NASDAQ:FTCV), a Special Purpose Acquisition Company (SPAC) backed by former Bancorp CEO Betsy Z. Cohen.[39][40] The combined company will operate as eToro Group Ltd and have an implied estimated enterprise value of $10.4 billion at closing with $650 million in funding coming from private investment in public equity (PIPE) from Softbank Vision Fund 2,[41] Third Point, Fidelity Management, Wellington Management, ION Investment Group and Research Co.[42][43]",
        "subreddit": "wallstreetbets",
        "title": "What are your thoughts on Etoro?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p159pk/what_are_your_thoughts_on_etoro/",
        "created": 1628556413.0
    },
    {
        "author": "GreenTecher",
        "created_utc": 1627826865,
        "id": "ovsr1i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Most investors have probably never heard of exosomes until Codiak’s (NASDAQ: CDAK) chief exec, Doug Williams, made his pitch about this cool molecules at the JP Morgan conference two weeks ago. So for starters, let's define what is an exosome. Exosomes are extracellular vesicles (EVs) of endosomal origin that range in size between 30 and 150nm. Exosomes are secreted by a wide range of cells, since virtually all living cells utilize exosome-mediated communication. Exosomes carry cell-specific cargos of proteins, lipids, and nucleic acids that are selectively taken up by recipient cells.  In essence, these are a critical building block of organic life and have a myriad of unexplored biopharma applications.  \n\nThe cargo contained within exosomes can offer information for a wide range of diseases, therefore exosomes can also act as prognostic indicators and predictors of a patient’s response to a specific course of treatment.  Exosome-based diagnostics are minimally invasive, offering both ease-of-use and speed of detection. Numerous approaches are being researched for creating drug-loaded exosomes and they can exert powerful effects. For example, if a patient has a disease caused by a missing or defective protein or microRNA, the patient’s exosomes can be isolated, modified with the appropriate siRNA or protein, and injected back into the patient for treatment.\n\nFor these reasons, exosomes have gone from being overlooked to rapidly gaining momentum as a novel strategy for accessing the therapeutic effects of cells without the risks and difficulties of administering cells to patients.  Exosome-related technologies have been developing rapidly over the past few years. Substantial growth is expected for the market as they get highly integrated into the elite healthcare fields such as liquid biopsy, precision medicine and regenerative medicine.\n\nWithin the past 5 years, there have been at least 7 major partnership deals within the exosome industry, 8 large venture capital events, and 2 landmark acquisitions.  Today, the exosome industry is witnessing rising numbers of clinicals trials investigating exosome therapeutics and diagnostics. Here are some listed companies taking exosome science to the next level:\n\n**Innocan Pharma (CSE: INNO) (FSE: IP4) (OTCQB: INNPF) Combining Exosomes &amp; CBD**\n\nInnocan Pharma, in collaboration with a Tel Aviv university team, is developing a revolutionary cell therapy - based technology, loaded with CBD (Cannabidiol), designed to target coronavirus infected lung cells and central nervous system diseases. Innocan’s CLX Therapy holds the potential to provide a highly synergistic effect of anti-inflammatory properties and help in the recovery of infected lung cells. This product is planned to act as a \"guided missile\" to the infected lungs, combining the cell healing properties of exosomes and the anti-inflammatory properties of CBD.\n\nInnocan's CBD Loaded Exosome (CLX) Therapy project demonstrates the capability of having reliable large-scale production of exosomes and is an important milestone in the CLX Therapy development process. Innocan managed to produce trillions of exosomes in a short period of time in a 3-dimensional bioreactor, and that may lead to economic large-scale exosome production for the CLX. This achievement is expected to pave the way for larger tests and studies.  Combine its CLX program R&amp; with their established credentials as a cannabis/CBD powerhouse, and in a final evaluation this company holds a lot of long-term promise for making strong and early inroads into the exosome market.\n\n**Sarepta Therapeutics (NASDAQ: SRPT) and Codiak BioSciences (NASDAQ: CDAK)**\n\nOn June 22, 2020, Sarepta Therapeutics and Codiak BioSciences signed a global research and option agreement to design and develop engineered exosome therapeutics to deliver gene therapy, gene editing and RNA technologies for neuromuscular diseases. The engineered exosome approach offers the potential to effectively deliver genetic therapeutics without triggering the adaptive immune response. The two-year agreement includes up to five neuromuscular targets. Codiak is eligible to receive up to $72.5 million in upfront and near-term license payments plus research funding.  That equates to a lot of capital that, if invested wisely, can go back into research for the next generation of exosome studies and clinical trials.\n\n**Jazz Pharmaceuticals (NASDAQ: JAZZ) and Codiak BioSciences (NASDAQ: CDAK)**\n\nOn January 03, 2019, Jazz Pharmaceuticals and Codiak BioSciences signed a strategic collaboration agreement focused on the research, development and commercialization of exosome therapeutics to treat cancer. Codiak granted Jazz an exclusive, worldwide, royalty-bearing license to develop, manufacture and commercialize therapeutic candidates directed at five targets to be developed using Codiak’s engEx precision engineering platform for exosome therapeutics. The targets focus on oncogenes that have been well validated in hematological malignancies and solid tumors but have been undruggable with current modalities. Codiak received a $56 million upfront payment.\n\nIn sum, the companies explored above are all approaching the budding exosome industry from different angles.  Innocan’s point-of-departure is CBD and its range of applications in the biomed/pharma sectors. Likewise, Codiak, Sarepta, and Jazz are all making powermoves to determine the efficacy of exosome therapies in diverse areas such as immune disorders and hematological malignancies.",
        "subreddit": "investing_discussion",
        "title": "Emerging Bulls (INNO SRPT CDAK JAZZ) in the Biopharma Exosome Market",
        "url": "https://www.reddit.com/r/investing_discussion/comments/ovsr1i/emerging_bulls_inno_srpt_cdak_jazz_in_the/",
        "created": 1627855665.0
    },
    {
        "author": "mat025",
        "created_utc": 1630856236,
        "id": "pifa8n",
        "num_comments": 180,
        "num_crossposts": 0,
        "selftext": "My top tech stocks watchlist that pays dividends:\n\n|Ticker|AAPL|MSFT|AVGO|CSCO|INTC|NVDA|TXN|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|Yield|0.57%|0.74%|2.89%|2.49%|2.6%|0.07%|2.15%|\n|PE|30.20|37.78|19.92|18.79|11.89|76.98|25.73|\n|Payout|17.22%|28.11%|57.65%|46.54%|30.89%|5.39%|55.28%|\n|Div Growth YR|9|17|10|10|7|0|15|\n|CAGR 5yr|9.3%|9.52%|50%|9.21%|6.12%|7.66%|21.83%|\n|YOY Rev|13.26%|14.68%|8.46%|\\-0.01%|0.57%|36.16%|9.04%|\n|My Buy Alert|Hold|Hold|BUY|Hold|BUY|Hold|Hold|\n\nMy buying criteria is PE less than **20**, Payout less than **80%**, Dividend growth year at least **1 year,** CAGR for **5** years higher than **3%**, YOY revenue growth higher than **0%**. \n\nSource: my own spreadsheet and seekingalpha.com",
        "subreddit": "investing",
        "title": "My top tech stocks to watch that pays dividends",
        "url": "https://www.reddit.com/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/",
        "created": 1630885036.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1630853093,
        "id": "piecl7",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "You can't beat the market! You can't bear the market! Baloney! I get so tired of hearing that!\n\nI went to portfolio visualizer and typed in 4 random stocks that even aren't tech!\n\nTMO SHW UNH MCD\n\nFrom 1990 to 2021\n$10k investment is now $2.8 million! \n\nVTSMX (Vanguard Total Market)\n$10k is now $179k ..... Zzz zzz\n\n\nThen I try this.\nTMO SHW UNH CSCO HON PG\n\n1990 to 2021\n$10k is now $3.1million\n\nWhy does everyone always say you can't beat the market?\n\nI can do it with other random stocks also.  Why can't you beat the market?",
        "subreddit": "stocks",
        "title": "I beat the market ..... It's easy!",
        "url": "https://www.reddit.com/r/stocks/comments/piecl7/i_beat_the_market_its_easy/",
        "created": 1630881893.0
    },
    {
        "author": "mat025",
        "created_utc": 1630856081,
        "id": "pif8jm",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "My top tech stocks watchlist that pays dividends:\n\n|Ticker|AAPL|MSFT|AVGO|CSCO|INTC|NVDA|TXN|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|Yield|0.57%|0.74%|2.89%|2.49%|2.6%|0.07%|2.15%|\n|PE|30.20|37.78|19.92|18.79|11.89|76.98|25.73|\n|Payout|17.22%|28.11%|57.65%|46.54%|30.89%|5.39%|55.28%|\n|Div Growth YR|9|17|10|10|7|0|15|\n|CAGR 5yr|9.3%|9.52%|50%|9.21%|6.12%|7.66%|21.83%|\n|YOY Rev|13.26%|14.68%|8.46%|\\-0.01%|0.57%|36.16%|9.04%|\n|My Buy Alert|Hold|Hold|BUY|Hold|BUY|Hold|Hold|\n\nMy buying criteria is PE less than **20**, Payout less than **80%**, Dividend growth year at least **1 year,** CAGR for **5** years higher than **3%**, YOY revenue growth higher than **0%**. \n\nSource: My own spreadsheet and seekingalpha.com",
        "subreddit": "ValueInvesting",
        "title": "My top tech stocks to watch that pays dividends",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/",
        "created": 1630884881.0
    },
    {
        "author": "cryptohick",
        "created_utc": 1630506429,
        "id": "pfv0gr",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I have some Jan 22 50C CSCO LEAPS that I’d like to roll out and possibly(?) down. Better to do on a green or red day?\n\nIs there an argument for or against rolling deeper ITM for a slight fee, or keep the 50 strike price?\n\nI picked them up months ago when I he underlying was mid-40s and already sold half the initial contracts to recoup my initial investment. Still feeling bullish on the underlying, though, and want to push DTE out as far as I can.\n\nThank you!",
        "subreddit": "options",
        "title": "Ideal time to roll out LEAPS in the green?",
        "url": "https://www.reddit.com/r/options/comments/pfv0gr/ideal_time_to_roll_out_leaps_in_the_green/",
        "created": 1630535229.0
    },
    {
        "author": "professorfundamental",
        "created_utc": 1631013309,
        "id": "pjl0rn",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Another user asked for this information, and I think it can be helpful in seeing one perspective on what the market thinks is going to happen. 10SEPT expirations for calls and for puts. lmk if you see mistakes\n\nwatchlist is from high volume stocks/etfs with high volume options, but a bit dated\n\n&amp;#x200B;\n\n**The calls first, from highest to lowest:** \n\n*Ticker   Price  ATM/u*   \n\n1. GME 202.75 0.076152898   \n2. RIDE 6.25 0.064   \n3. VXRT 8.710000038 0.049368542   \n4. RIOT 34.43000031 0.047632878   \n5. KODK 7.21999979 0.047091414   \n6. EDIT 68.25 0.046886447   \n7. SPCE 24.28000069 0.0461285   \n8. UVXY 21.23999977 0.043785311   \n9. BB 11.06999969 0.03794038   \n10. TLRY 13.59000015 0.035320088   \n11. INO 8.520000458 0.035211266   \n12. NKLA 10.46000004 0.034416826  \n13.  IQ 9.970000267 0.034102306  \n14.  LULU 388.3299866 0.030901554  \n15.  BBBY 27.02000046 0.029607697   \n16. PCG 9.149999619 0.029508198   \n17. PDD 102.2300034 0.029345592   \n18. FSR 14.01000023 0.02926481   \n19. LMND 77.31999969 0.029099845   \n20. NCLH 24.62000084 0.028432168   \n21. MRO 11.63000011 0.028374892   \n22. XPEV 39.75 0.028176101  \n23.  QS 22.45000076 0.02806236   \n24. X 26.21999931 0.027841343   \n25. M 21.71999931 0.02762431   \n26. BLNK 32.97000122 0.02669093   \n27. UNG 16.42000008 0.025578563   \n28. VXX 24.94000053 0.025260625   \n29. OSTK 69.51000214 0.025032369   \n30. PLUG 26.39999962 0.024621212   \n31. SPWR 21.82999992 0.024278516  \n32.  APA 19.67000008 0.023894255  \n33.  HYLN 8.850000381 0.023728813  \n34.  CGC 16.96999931 0.023571009   \n35. FSLY 46.68999863 0.023559649   \n36. GPS 25.11000061 0.023496614   \n37. ACB 7.389999866 0.02300406   \n38. TNA 93.79000092 0.022923552   \n39. ET 9.649999619 0.022797928   \n40. CCL 22.95999908 0.022648085   \n41. PTON 98.55999756 0.022524351   \n42. ROKU 342.269989 0.02249686  \n43.  SNAP 75.08000183 0.021710175   \n44. UAL 46.22000122 0.021635655   \n45. UBER 40.31999969 0.021577381   \n46. DAL 40.25 0.021118012   \n47. NET 130.4400024 0.021005826   \n48. HAL 20.17000008 0.020823004   \n49. FCX 36.13999939 0.020752629  \n50.  DOCU 310.0499878 0.020641833  \n51.  PLTR 26.63999939 0.020270271   \n52. LI 30.28000069 0.02014531  \n53.  BIDU 162.9799957 0.019941098   \n54. RKT 17.09000015 0.019894675 \n55.   DKNG 61.02000046 0.019829564   \n56. OXY 25.92000008 0.019675926   \n57. BABA 170.3000031 0.019671168   \n58. BYND 114.9700012 0.019570322   \n59. NIO 40.36999893 0.019568987   \n60. SPLK 158.4400024 0.019565766   \n61. PBR 10.44999981 0.019138756  \n62.  JD 79.85500336 0.019034499   \n63. CRWD 278.230011 0.018689573   \n64. AAL 19.37000084 0.018585441   \n65. DDOG 138.0599976 0.018325366  \n66.  CHWY 76.75 0.018241042   \n67. OIH 186.7599945 0.018151639  \n68.  SNOW 310 0.017870968   \n69. WYNN 100.3000031 0.01784646   \n70. ZM 298.2900085 0.017767943   \n71. TQQQ 151.4499969 0.017761638  \n72.  ABNB 158 0.017341772  \n73.  XOP 84.51999664 0.016919073   \n74. FEYE 18.54999924 0.016711591   \n75. NVDA 228.4299927 0.016635294   \n76. USO 48.65999985 0.016440608   \n77. MGM 42.54000092 0.016220028   \n78. SQ 269.7399902 0.016200787  \n79.  TWTR 64.66000366 0.016084131 \n80.   AMD 109.9199982 0.01592067  \n81.  SHOP 1554.25 0.01576323   \n82. WFC 44.16999817 0.015621463   \n83. VALE 19.07999992 0.015199161 \n84.   AMRN 5.289999962 0.015122873  \n85.  EWZ 35.84999847 0.014783822  \n86.  BA 218.1699982 0.014667461   \n87. MPC 58.24000168 0.01459478   \n88. PINS 56.59000015 0.014490193   \n89. TEVA 9.479999542 0.013713081   \n90. KRE 65.18000031 0.013654495 \n91.   XBI 134.1900024 0.013264774   \n92. TSLA 733.5700073 0.013086686  \n93.  FXI 41.47000122 0.013021461   \n94. ATVI 81.18000031 0.01293422   \n95. XLE 48.61999893 0.012751954   \n96. NFLX 590.5300293 0.012446446 \n97.   BAC 41.04999924 0.012180268 \n98.   CVS 87.47000122 0.01211844 \n99.   C 71.16999817 0.012083743   \n100. XRT 95.63999939 0.011919699  \n101.  DIS 181 0.011823204   \n102. MU 73.80999756 0.011380572   \n103. SMH 273.2900085 0.010940759  \n104.  F 12.89000034 0.010861132   \n105. XOM 54.86999893 0.010752688   \n106. VZ 55.43000031 0.010463648   \n107. TSM 123.9700012 0.010405743   \n108. XLF 38.06999969 0.010244287   \n109. DBX 32.38999939 0.01018833   \n110. ADBE 666.5900269 0.010051155   \n111. GDX 33.27999878 0.009915866   \n112. GOLD 20.29999924 0.009852217   \n113. SLV 22.87999916 0.009615385  \n114.  PFE 46.84000015 0.009607173   \n115. CRM 267.0799866 0.009472818 \n116.   INTC 53.50999832 0.009157167  \n117.  MSFT 301.1400146 0.009131965   \n118. GILD 71.95999908 0.009032796   \n119. V 225.1100006 0.008973391   \n120. PYPL 289.1300049 0.008750389  \n121.  GS 411.3099976 0.008582335   \n122. AMZN 3478.050049 0.008539268   \n123. EEM 53.11999893 0.008471386   \n124. SBUX 117.1900024 0.008106494   \n125. QCOM 144.6300049 0.008089608   \n126. T 27.55999947 0.007982584   \n127. KO 56.72999954 0.007932311   \n128. IWM 227.9600067 0.00776452  \n129.  JPM 159.4900055 0.007273183   \n130. MO 50.97000122 0.007259172  \n131.  WMT 149.25 0.007236181   \n132. FB 376.2600098 0.007069579 \n133.   GOOG 2895.5 0.006838197  \n134.  COST 462.5499878 0.006701978 \n135.   TGT 244.3099976 0.006549057   \n136. ABBV 111.6200027 0.006540046   \n137. TLT 148.1799927 0.006478607   \n138. EFA 82.06999969 0.00609236   \n139. CSCO 59.41999817 0.006058566  \n140.  XLU 69.48999786 0.005756224  \n141.  JNJ 175.0399933 0.00571298  \n142.  QQQ 381.5700073 0.005031842   \n143. DIA 354.1400146 0.004630937   \n144. SPY 453.0799866 0.003906595   \n145. HYG 88.01000214 0.001363481     \n\n&amp;#x200B;\n\nsome options traders think of the ATM/u number as a percent. If so, then GME at the top of the list has a 7.6% chance of being higher than it is now (or higher than the ATM call strike price to be exact), whereas HYG has a .1% chance of being higher than it is now. Remember, these are just for the calls, so it might be that the market places more value on the ATM put than it does on the ATM calls. \n\n&amp;#x200B;\n\n**Here are the puts:** \n\n  \n\n*Ticker     Price    ATM/u*\n\n1. TLRY 13.59000015 0.148638703\n2. BB 11.06999969 0.134598016\n3. VXRT 8.710000038 0.127439724\n4. ET 9.649999619 0.092227983\n5. MRO 11.63000011 0.073086844\n6. AMRN 5.289999962 0.060491494\n7. RKT 17.09000015 0.059098888\n8. F 12.89000034 0.049650891\n9. RIOT 34.43000031 0.048794655\n10. LI 30.28000069 0.040951122\n11. SQ 269.7399902 0.040668794\n12. GME 202.75 0.035462392\n13. SPCE 24.28000069 0.035420098\n14. UVXY 21.23999977 0.034839925\n15. DKNG 61.02000046 0.031465093\n16. UNG 16.42000008 0.031059683\n17. XPEV 39.75 0.030188679\n18. SLV 22.87999916 0.029720281\n19. PLUG 26.39999962 0.028409091\n20. RIDE 6.25 0.0256\n21. AAL 19.37000084 0.024780587\n22. SNAP 75.08000183 0.024107618\n23. BLNK 32.97000122 0.023051258\n24. EDIT 68.25 0.021978022\n25. CRWD 278.230011 0.021205477\n26. KODK 7.21999979 0.018005541\n27. PTON 98.55999756 0.01755276\n28. UAL 46.22000122 0.017092167\n29. HAL 20.17000008 0.016856718\n30. HYLN 8.850000381 0.015819208\n31. FSR 14.01000023 0.015703069\n32. GDX 33.27999878 0.01532452\n33. PLTR 26.63999939 0.015015015\n34. DDOG 138.0599976 0.014703752\n35. FEYE 18.54999924 0.014555257\n36. VXX 24.94000053 0.014434643\n37. BBBY 27.02000046 0.014433753\n38. TSLA 733.5700073 0.014381722\n39. LMND 77.31999969 0.014226591\n40. CGC 16.96999931 0.012964055\n41. NVDA 228.4299927 0.012870464\n42. PFE 46.84000015 0.012809564\n43. PDD 102.2300034 0.012618605\n44. FSLY 46.68999863 0.011779825\n45. WFC 44.16999817 0.011546299\n46. SHOP 1554.25 0.010892714\n47. CCL 22.95999908 0.010452962\n48. GPS 25.11000061  0.01035444\n49. BAC 41.04999924 0.010231425\n50. ACB 7.389999866 0.00947226\n51. NIO 40.36999893 0.009412931\n52. NET 130.4400024 0.009352959\n53. OSTK 69.51000214 0.008631851\n54. EWZ 35.84999847 0.008368201\n55. INO 8.520000458 0.008215962\n56. IQ 9.970000267 0.008024072\n57. ZM 298.2900085 0.007844715\n58. TSM 123.9700012 0.007501815\n59. PINS 56.59000015 0.007068387\n60. XOP 84.51999664 0.006980597\n61. AMD 109.9199982 0.006641194\n62. NCLH 24.62000084 0.006498781\n63. DBX 32.38999939 0.006483483\n64. DAL 40.25 0.006459627\n65. MU 73.80999756 0.006367701\n66. TWTR 64.66000366 0.006186204\n67. SPLK 158.4400024 0.005995961\n68. SNOW 310 0.005483871\n69. TNA 93.79000092 0.00543768\n70. SPWR 21.82999992 0.005038937\n71. JD 79.85500336 0.005009079\n72. PBR 10.44999981 0.004784689\n73. C 71.16999817 0.004777294\n74. XLE 48.61999893 0.004730564\n75. BYND 114.9700012 0.004609898\n76. MPC 58.24000168 0.004464286\n77. OIH 186.7599945 0.004337117\n78. MGM 42.54000092 0.004231312\n79. VALE 19.07999992 0.004192872\n80. FCX 36.13999939 0.004150526\n81. QS 22.45000076 0.004008909\n82. ATVI 81.18000031 0.003941858\n83. OXY 25.92000008 0.003858025\n84. NKLA 10.46000004 0.003824092\n85. INTC 53.50999832 0.003363857\n86. PCG 9.149999619 0.003278689\n87. XLF 38.06999969 0.003152088\n88. MSFT 301.1400146 0.003088264\n89. XBI 134.1900024 0.003055369\n90. IWM 227.9600067 0.002939112\n91. XRT 95.63999939 0.00250941\n92. TQQQ 151.4499969 0.002509079\n93. ABBV 111.6200027 0.002329332\n94. WYNN 100.3000031 0.002293121\n95. UBER 40.31999969 0.002232143\n96. T 27.55999947 0.002177068\n97. CSCO 59.41999817 0.001851229\n98. HYG 88.01000214 0.001817975\n99. DOCU 310.0499878 0.001741655\n100. APA 19.67000008 0.001525165\n101. USO 48.65999985 0.001438553\n102. EFA 82.06999969 0.001340319\n103. BIDU 162.9799957 0.001288502\n104. FXI 41.47000122 0.001205691\n105. SBUX 117.1900024 0.001194641\n106. MO 50.97000122 0.001177163\n107. GOOG 2895.5 0.001170782\n108. X 26.21999931 0.001144165\n109. WMT 149.25 0.001139028\n110. QQQ 381.5700073 0.001126923\n111. QCOM 144.6300049 0.001106271\n112. XOM 54.86999893 0.001093494\n113. TEVA 9.479999542 0.001054852\n114. V 225.1100006 0.001021723\n115. GILD 71.95999908 0.000972763\n116. NFLX 590.5300293 0.000948301\n117. EEM 53.11999893 0.000941265\n118. FB 376.2600098 0.000930208\n119. M 21.71999931 0.00092081\n120. BA 218.1699982 0.000825045\n121. CVS 87.47000122 0.000800274\n122. COST 462.5499878 0.000799914\n123. AMZN 3478.050049 0.000715918\n124. KO 56.72999954 0.000705094\n125. ABNB 158 0.000696203\n126. ADBE 666.5900269 0.000690079\n127. PYPL 289.1300049 0.000657144\n128. CHWY 76.75 0.000651466\n129. SMH 273.2900085 0.00062205\n130. KRE 65.18000031 0.000613685\n131. JPM 159.4900055 0.000564299\n132. TLT 148.1799927 0.000539884\n133. SPY 453.0799866 0.000507637\n134. GOLD 20.29999924 0.000492611\n135. TGT 244.3099976 0.000491179\n136. LULU 388.3299866 0.000463523\n137. DIA 354.1400146 0.000451799\n138. XLU 69.48999786 0.000431717\n139. CRM 267.0799866 0.000411862\n140. DIS 181 0.00038674\n141. JNJ 175.0399933 0.000228519\n142. VZ 55.43000031 0.000180408\n143. BABA 170.3000031 0.00017616\n144. ROKU 342.269989 0.000146084\n145. GS 411.3099976 0.000121563 \n\n&amp;#x200B;\n\nI included the prices for the stock/etf so you can see which ones might be \"bargins\" for people with small accounts. \n\n&amp;#x200B;\n\nYou can see that the biggest values for puts are *way* bigger than the biggest values for calls. But, to for example, GME (top of the calls list) is given only a 3.5% chance of going lower, whereas the calls give it a 7.6% chance of going higher.",
        "subreddit": "options",
        "title": "Most expensive calls and most expensive puts (ATM premium/underlying price) for 145 tickers.",
        "url": "https://www.reddit.com/r/options/comments/pjl0rn/most_expensive_calls_and_most_expensive_puts_atm/",
        "created": 1631042109.0
    },
    {
        "author": "Redhander",
        "created_utc": 1630615920,
        "id": "pgqi77",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I have several LEAPS on CSCO, DIS, PENN, ZNGA, ABCL these are very long plays like Jan 2023 or Jan 2022. Does it make sense to do some wider butterflies on these long positions. I have done Call selling but it always seems like I have to close the call out at a loss. I can close out a butterfly at a loss but usually that loss is Much smaller like less than 100 bucks as the stock leaves the profit area.",
        "subreddit": "options",
        "title": "Does anyone use butterfly's during long LEAPS plays on slow movers?",
        "url": "https://www.reddit.com/r/options/comments/pgqi77/does_anyone_use_butterflys_during_long_leaps/",
        "created": 1630644720.0
    },
    {
        "author": "cryptohick",
        "created_utc": 1630506429,
        "id": "pfv0gr",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I have some Jan 22 50C CSCO LEAPS that I’d like to roll out and possibly(?) down. Better to do on a green or red day?\n\nIs there an argument for or against rolling deeper ITM for a slight fee, or keep the 50 strike price?\n\nI picked them up months ago when I he underlying was mid-40s and already sold half the initial contracts to recoup my initial investment. Still feeling bullish on the underlying, though, and want to push DTE out as far as I can.\n\nThank you!",
        "subreddit": "options",
        "title": "Ideal time to roll out LEAPS in the green?",
        "url": "https://www.reddit.com/r/options/comments/pfv0gr/ideal_time_to_roll_out_leaps_in_the_green/",
        "created": 1630535229.0
    }
]