[
    {
        "author": "icchipcompanyWu",
        "created_utc": 1638412009,
        "id": "r6wbdj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Micron and UMC Expand Business Partnership to Strengthen Customer Supply Chain",
        "url": "https://www.12chip.com/article/company-news/micron-and-umc-expand-business-partnership-to-strengthen-customer-supply-chain.html?lang=en-us",
        "created": 1638440809.0
    },
    {
        "author": "slutpriest",
        "created_utc": 1638465673,
        "id": "r7cc95",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\n## What Are Long-Term Equity Anticipation Securities (LEAPS)?\n\nThe term long-term equity anticipation securities (LEAPS) refers to publicly traded [options contracts](https://www.investopedia.com/terms/o/optionscontract.asp) with [expiration dates](https://www.investopedia.com/terms/e/expiration-date.asp) that are longer than one year, and typically up to three years from issue. They are functionally identical to most other listed options, except with longer times until expiration. A LEAPS contract grants a buyer the right, but not the obligation, to purchase or sell (depending on if the option is a call or a put, respectively) the [underlying asset](https://www.investopedia.com/terms/u/underlying-asset.asp) at the predetermined price on or before its expiration date.  \n\n\n*Taken from the tutorial section in the Discord I run.*\n\n**Generally, a LEAP is considered a very long option.** An 9 month call/put is still considered a LEAP, even though it's not over a year.\n\nI know that I've touched on LEAPS before but this explanation might offer more **help to people who cannot watch the stock or day trade.** So if you want that gambling feeling without worrying about what the stock does every day, I suggest you get a LEAP option.  \n\n\nWhen you are looking for a good LEAP to get, I would recommend intrinsically valuable stocks or ETF's that are considered 'low risk' like the SPY and waiting for big dips. I know I mention this a lot, but what does this mean?\n\n&amp;#x200B;\n\n**Intrinsically valuable companies, are companies that will, generally, ALWAYS go up. Ask yourself, what are people, humans, ALWAYS going to need?**\n\n&amp;#x200B;\n\nHomes\n\nClothes\n\nGroceries\n\nCars\n\nFinancial Systems\n\nMedicine\n\netc etc.\n\nThe list goes on, but you get the idea. Homes is at the top of my list for one reason, take a look at HD and you'll see what I mean.\n\nCOST is another example. There are many. \n\nGenerally the stock always goes up, but what if it was going down and taking a 'dip'?\n\n&amp;#x200B;\n\nExample: Stock is 200 bucks.\n\n&amp;#x200B;\n\n*\"Why should I get a 205 strike for next year, instead of next month?\"*\n\n&amp;#x200B;\n\n**You're buying time. AKA Extrinsic value**  \n[https://www.theoptionsguide.com/options-premium.aspx#intrinsic-value](https://www.theoptionsguide.com/options-premium.aspx#intrinsic-value)  \n\n\nThe 205 leaps for next week and the 205 leaps for next year, **are probably both intrinsically worth the same, but the LEAP has way more time (or extrinsic) value left to burn through**, where as the one for next week, does not. **It has dripped out.** It is now burning Intrinsic value because there is only 1 week left. So don't hold the LEAP till the last week or even month IMO. Remember, LEAPS will make your account print hard, you just HAVE to be patient and know when to sell them. Think about it. Sure, that 205 that's cheap could run to 210, but what if you had a whole year? What if you had a call of 205 strike, held it, and then 6 months go by and now the stock is at 250? That call would be worth **THOUSANDS.**\n\nExample 2: I bought an MU LEAP 3 weeks ago when the stock was at $75. The leap was 400+ days out. the 100c was the strike. I bought it for $500. If you now look at the same LEAP it is around 1k.  \n\n\n100% Gain in 3 weeks. Let's say I hold that for another 6 months instead of cashing it out. Let's then say that MU rips to 150 next year. That single LEAP is going to be worth thousands alone. \n\nThat said, \n\nI refer you to my friend Warren. Let's take his advice when others are fearful, and let us be greedy.\n\n&amp;#x200B;\n\n[https://i.imgur.com/ja9eQNn.png](https://i.imgur.com/ja9eQNn.png)  \n\n\nYou can't time the dip right, but if you did get in on the next BIG run up, **and get an at the money(ATM) call for at least 1 or 2 years out** you would probably see a profit anytime between then unless the entire financial system crashes. And I mean big profit.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nThe next thing you want to look at is **How much debt do they owe? How much 'Free Flow Cash' does this company have and make every quarter or annually?**\n\n&amp;#x200B;\n\nYou can look at these yourself by typing into google : **\"XYZ free flow cash\"** or **\"XYZ long term debt\"**\n\n&amp;#x200B;\n\nIt will show you. Generally if a company has at least half of it's free flow cash (FFC) to it's long term debt (LTD) Then that means it has a lot of cash to pay those interest payments and bills with.\n\n&amp;#x200B;\n\n**You want to look for companies that have low debt-to-equity ratios.**\n\n&amp;#x200B;\n\nThis will help you find out how much that company is really worth.\n\n&amp;#x200B;\n\nThis is exactly why GME blew up the way it did besides all the retards buying and holding it.\n\n&amp;#x200B;\n\nGME cleared a lot of its LTD and acquired a bunch of FFC thanks to that Cohen guy.\n\n&amp;#x200B;\n\nIs the company worth 250 or whatever? Hell no, but that's a story for another time.\n\n&amp;#x200B;\n\nAfter you find a good company you need pull up the **BIGGER CHART** and look, where was the last consolidation? aka support? **Should I wait a month or two before jumping in? Maybe more?**\n\n&amp;#x200B;\n\n*\"Past performance is always indicative of future results\"* or whatever that Benjamin Graham guy said. \n\n&amp;#x200B;\n\nIn conclusion, please be careful and remember LEAPS are expensive for a reason, you're buying time.  \n\n\nAny questions or comments, please feel free to leave below or contact me directly. Thank you.",
        "subreddit": "options",
        "title": "LEAP options explained.",
        "url": "https://www.reddit.com/r/options/comments/r7cc95/leap_options_explained/",
        "created": 1638494473.0
    },
    {
        "author": "UGHTETHER",
        "created_utc": 1638662953,
        "id": "r92ulj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Micron $MU : A Rating Equal To Taiwan Semiconductor Manufacturing Company Limited Rather Than Intel Is Imminent",
        "url": "https://seekingalpha.com/article/4472043-micron-equal-rating-to-tsmc-rather-than-intel",
        "created": 1638691753.0
    },
    {
        "author": "comaye",
        "created_utc": 1638371505,
        "id": "r6gxmo",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Micron Comeback Continues",
        "url": "https://i.redd.it/zdq7h3t46y281.jpg",
        "created": 1638400305.0
    },
    {
        "author": "UGHTETHER",
        "created_utc": 1638663306,
        "id": "r92yhk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\n* The focus will be a detailed comparison of the operational metrics of Micron to TSMC and Intel over the last decade.\n* Although the three companies operate in different segments of the semiconductor space, they share a common heritage in being manufacturers with a moat of intellectual property (IP).\n* The effectiveness of each company's capital allocation can be assessed via the revenue growth generated and the profit margins achieved.\n* Thence the valuation rating ascribed by Mr Market. Micron’s transformation renders it far more a peer to TSMC, but alas it's currently valued like ailing Intel!\n* The penny's about to drop - the market will soon grant Micron a significant valuation rerating. Price target: $235 within two years.",
        "subreddit": "wallstreetbets",
        "title": "Micron: A Rating Equal To Taiwan Semiconductor Manufacturing Company Limited Rather Than Intel Is Imminent",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r92yhk/micron_a_rating_equal_to_taiwan_semiconductor/",
        "created": 1638692106.0
    },
    {
        "author": "earthWindFI",
        "created_utc": 1638376315,
        "id": "r6isiq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Thesis**\n\n* SIMO is a supplier of computer memory and benefits from the rise of datacenters, EV, smartphones, and other consumer tech\n* SIMO is a major supplier of Micron Technology (MU) 🚀\n* Revenues grew 100% Y/Y in Q3 2021\n* SIMO management forecasts revenue of $1.5B in 2022 (+50% growth over 2021) 🚀🚀\n* Most analysts are significantly under-pricing the company, only modelling $1B of revenue in 2022 (implying no growth) -- see sources below\n* The only analyst properly reflecting $1.5B revenue in 2022 has a **PT of $115 (60% upside) 🚀🚀**🚀\n\n&amp;#x200B;\n\n\\-----\n\n**Company Overview**\n\nSilicon Motion Technology (SIMO) is the global leader in supplying NAND flash controllers for solid state storage devices and the merchant leader in supplying SSD controllers.\n\nSIMO has the broadest portfolio of controller technologies and their controllers are widely used in embedded storage products such as SSDs and eMMC+UFS devices, which are found in smartphones, PCs and commercial and industrial applications.\n\nSIMO has have shipped over six billion NAND controllers in the last ten years, more than any other company in the world.\n\nMore NAND flash components, including current and up-coming generations of 3D flash produced by Intel, Kioxia, Micron, Samsung, SK Hynix, Western Digital and YMTC, are supported by Silicon Motion controllers than any other company. SIMO's customers include NAND flash makers, module makers, hyperscalers and OEMs. \n\nSIMO supplies customized high-performance hyperscale data center and industrial SSD solutions. SIMO's customers include most of the NAND flash vendors, storage device module makers and leading OEMs.\n\n**SIMO has a current share price of \\~$72 with a P/E ratio of \\~18x**\n\n&amp;#x200B;\n\n\\-----\n\n**Management Guidance**\n\nOn SIMO's [Q2 2021 earnings call](https://www.fool.com/earnings/call-transcripts/2021/07/30/silicon-motion-technology-corporation-simo-q2-2021/), management guided towards significant revenue growth in 2022:\n\n&gt;Based on our latest sales projection, our annual run rate is expected to be already at least $1 billion by this year's fourth quarter. **We expect sales of ultimately exceed $1 billion next year** as we add meaningful incremental foundry capacity already committed to us and from continued execution of our four prong initiative, which includes upselling a richer mix of products. Sales next year will include the rapid scaling of a higher value, high-volume PCIe Gen4 SSD controller.  \n&gt;  \n&gt;**Our customers have also provided us with purchase orders for the next year, and the order book today already exceeds $1.5 billion.** Our strong order book is a result of many years of hard work. No last minute opportunistic procurement audit of all the shelf parts by customers. We have been building our business pipeline for many years, leading to these purchase orders. Our OEM projects typically kick off one to three years before initial sales, depending on product capacity.  \n&gt;  \n&gt;**Already, our order book for next year is at least $1.5 billion, and our team is currently working to ensure we can deliver this. Next quarter, we will provide an update on our work. And at the start of next year, we will provide our official 2022 revenue guidance**.  \n&gt;  \n&gt;I will say, our client revenue will continue to grow. Although PCIe Gen3 next year growth rate will be modestly, but PCIe Gen will grow very strong to carry because we have a very large design share in PC OEM. We stated almost 50% higher by end of the next year so that we have eight different customer, five on NAND maker with our PCIe Gen4 controller and ramping next year. For eMMC+UFS, we also will grow very, very strongly. It also depends how many wafer we can secure.  \n&gt;  \n&gt;We say it's going not to grow for a certain level, **we guarantee is exceed the $1 billion of revenue next year**. But we think the backlog will continue to pile up by end of this year. But we'll continue to work very hard to secure more wafer, especially in mature technology because many eMMC are in 55, 40-nanometer and 28 meter, these mature technology wafer are in severe allocation from all foundry makers. So this is very critical, how fast we can porting, work with TSMC as well as other foundry that can grow overall the eMMC+UFS business.\n\n&amp;#x200B;\n\nThis guidance was confirmed on SIMO's [Q3 2021 earnings call](https://www.fool.com/earnings/call-transcripts/2021/10/28/silicon-motion-technology-corporation-simo-q3-2021/):\n\n&gt; In the third quarter, sales and earnings reached another quarterly company record. **Revenue grew 15% sequentially and over 100% year-over-year to $254 million**  \n&gt;  \n&gt;We expect this situation of demanding excess of supply to continue through next year since foundry capacity will likely only start improving in 2023. Our order book remains strong and continues to be well in excess of $1.5 billion for next year.   \n&gt;  \n&gt;**In the third quarter, we delivered $1 billion in revenue run rate a quarter ahead of when we had previously communicated and expect our revenue run rate to increase further in the fourth quarter** as we focus on managing our product mix, customer allocation and pricing. We have already received foundry wafer allocation for 2022. **That is incremental to what we have this year, and we are confident we can grow ourselves next year toward our $1.5 billion order book.**  \n&gt;  \n&gt;I think based on the third quarter revenue and fourth quarter guidance, we are ready at a $1 billion sale revenue rate with our current wafer supply. We have already received foundry wafer allocation for 2022 as we state. **That's incremental to what we have this year, and we are confident we can grow our sales next year to around $1.5 billion.** We believe the demand will continue to exceed supply next year, but I think we definitely will continue to negotiate and discover TSMC to gain more wafer supply. Regarding the $1.5 billion backlog, I think we -- **our backlog remained very solid with the purchase order of 2022, continued to be well in excess of $1.5 billion**. Most of the backlog consists SSD and eMMC+UFS controller order \\[Indecipherable\\] 23:35. An OEM order is strong because our customers have been gaining share, and we have been gaining share of \\[Indecipherable\\] 23:41 as these customers. We believe we have secured about 50% of all PC OEM and PCIe Gen four socket for next year. But we have seen, however, some adjustment in our order book with the softening of order for channel market product and strengthening our product for OEM customer. For example, we are seeing demand for SSD by global PC OEM continue to strengthen, our current client SSD for retail market, especially in China, softening. \n\n&amp;#x200B;\n\nI repeat: management guarantees that revenue will exceed $1B in 2022.\n\nNow what do the anal(ysts) think?\n\n&amp;#x200B;\n\n\\-----\n\n**Analyst Estimates**\n\n* Morgan Stanley research: price target of $78 with only $1B of revenue modelled in 2022 / 2023\n\nhttps://preview.redd.it/zq7z1bccey281.png?width=473&amp;format=png&amp;auto=webp&amp;s=8fe6bf8cde6597ea7db096112c377fa7771dd3c3\n\n* Bank of America research: price target of $80 with only \\~$850M of revenue modelled in 2022 / 2023\n\nhttps://preview.redd.it/ia6skvysey281.png?width=502&amp;format=png&amp;auto=webp&amp;s=f326906c0291c5bf0a9323ae7a3f7a1ecb52418b\n\nNeedham is the only analyst properly reflecting $1.5B of revenue in 2022. Key points from Needham's Oct. 28 research report:\n\n* \"$1BN In the Bag, $1.5BN In the Cards - Stock Doesn't Reflect This At All\"\n* **Price Target: $115.00**\n\n&amp;#x200B;\n\n\\-----\n\n**Recommendation**\n\nI recommend you hold shares or calls with 3-6+ months to expiry.\n\nShort term catalysts:\n\n* Nov. 30: SIMO @ the 2021 Wells Fargo Virtual TMT Summit\n* Dec. 2: SIMO @ the Credit Suisse 25th Annual Technology Conference\n* Feb. 2022: SIMO reports Q4 2021 earnings\n\n Position: I hold $70 June 2022 calls.",
        "subreddit": "wallstreetbets",
        "title": "$SIMO DD: an undervalued play in computer memory with short-term catalysts",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6isiq/simo_dd_an_undervalued_play_in_computer_memory/",
        "created": 1638405115.0
    },
    {
        "author": "Spiritual_Bat4503",
        "created_utc": 1638638710,
        "id": "r8ufa2",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Recently I was reading this article-[https://lillianli.substack.com/p/china-semiconductors-and-the-push-de2](https://lillianli.substack.com/p/china-semiconductors-and-the-push-de2)\n\nThe author writes a newsletter that focuses on businesses in China with a focus on tech, it is really great and I would recommend it if you have investments in China.\n\nChina is spending a huge amount of money to achieve semiconductor independence from the US, and they still continue to be significantly behind in the game of high end chips due to lack of EUV equipment.\n\nHowever something that caught my eye was of YMTC(Yangtze Memory Technologies) which has made significant growth in the lagging-edge memory market and are also doing good work in the bleeding-edge side.\n\nMy question would be, can anybody provide quality insight what this would mean for Micron who derive 75% of revenue from DRAM? Could it hurt them, or is inconsequential?",
        "subreddit": "ValueInvesting",
        "title": "Micron has got competition from China?",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/r8ufa2/micron_has_got_competition_from_china/",
        "created": 1638667510.0
    },
    {
        "author": "Outrageous_Bat8429",
        "created_utc": 1638393890,
        "id": "r6pmo5",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "There seemed to be unlimited potential. “Good fundementals!” is what everyone kept saying. “It has to re-bound soon!” I read everywhere. But UP Fintech (TIGR) continued to make new lows each week. I saw each 5-10% drop as an opportunity to average down. Now I’m holding almost 2,000 shares at $12.74 and there’s still no bottom to be seen. Maybe the next support is at $0. “Be greedy when others are fearful” is my motto, or rather, my rationale to dollar cost average in case of this being the next short squeeze. It’s crazy how well the sunk cost fallacy can encourage you to make long-term horrible decisions. I’m not in debt and am no where near retirement, but damn...do I wish I bought $NVIDIA.",
        "subreddit": "wallstreetbets",
        "title": "Tied up half my net worth in a Chinese Fintech company that is now going to zero",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6pmo5/tied_up_half_my_net_worth_in_a_chinese_fintech/",
        "created": 1638422690.0
    },
    {
        "author": "itsBhaR",
        "created_utc": 1638414492,
        "id": "r6x625",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Finally stocks are going down. Hope this trend continues down for a few weeks. \n\nWhat stocks/etfs do you think are on sale right now to have good gains in next 5 to 10 years? - FB, DIVO, ABNB, NFLX, ARKQ, VYM?\n\nWhat to add more of NVDA, TSLA, QCOM, MSFT but they aren't coming down as much. \n\nWhat are some good stock/etfs those where high for a few months and start coming down significantly for a past a few days?",
        "subreddit": "stocks",
        "title": "What stocks/etfs on sale?",
        "url": "https://www.reddit.com/r/stocks/comments/r6x625/what_stocksetfs_on_sale/",
        "created": 1638443292.0
    },
    {
        "author": "ramsdesk",
        "created_utc": 1638407970,
        "id": "r6uy3e",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Similar to NVDA",
        "url": "https://www.reddit.com/r/stocks/comments/r6uy3e/similar_to_nvda/",
        "created": 1638436770.0
    },
    {
        "author": "spaceset51",
        "created_utc": 1638368361,
        "id": "r6fs38",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Lately I have been growing my account and feel the need to add positions. I started out just investing in 7 companies, but that has expanded to 9. The list of companies is down below and I just want to clarify that I am a little overweight in my technology positions. Any suggestions. Am I not taking enough risk or taking in too much risk.\n\nAAPL\nMSFT\nAMD\nNVDA\nTMO\nHD\nJPM\nDIS\nTGT",
        "subreddit": "stocks",
        "title": "Am I taking on too much risk?",
        "url": "https://www.reddit.com/r/stocks/comments/r6fs38/am_i_taking_on_too_much_risk/",
        "created": 1638397161.0
    },
    {
        "author": "iamthejuanyouseek",
        "created_utc": 1638373896,
        "id": "r6huiu",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Is anyone familiar with this company and the Lidar technology in general? From what I've gathered the Nvidia Drive system uses it. Aside from vehicles it looks like its used in computing and AI. OUST has been on a decline since its open about a year ago. Slowly coming back up though just not sure how much momentum it can hold. Seems pretty under the radar at the moment. Even stocktwits only has a couple thousand followers. Any insights? Possible moon?",
        "subreddit": "wallstreetbets",
        "title": "Ouster partnered with Nvidia and Lidar technology?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6huiu/ouster_partnered_with_nvidia_and_lidar_technology/",
        "created": 1638402696.0
    },
    {
        "author": "PeekingPotato",
        "created_utc": 1638346848,
        "id": "r69z5l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey there guys, I just started analyzing stocks more and I thought I´ll try to do that and post it here. That´s my first analysis for NVDA. If you have any feedback for me that would be great and highly appreciated. If you have questions feel free to ask, I´ll try to answer everything.\n\nToday we will look through the basics of NVIDIA´s business and then see if we can come up with a fair value for NVDA´s stock using discounted free cashflow.\n\nThis is not financial advice and I do not own shares in NVIDIA. Nevertheless I will try to stay as unbiased and objective as I can. Always do your own due diligence.\n\nFirst let´s review their different revenue streams. Their biggest stream, around **45%** of their sales comes from **Gaming**. The **Data Center** makes up around **41%**. Another **8%** comes from **Professional Visualization**. Then there is **3%** from **OEM**, and another **2%** from **Automotive**.\n\nFor the valuation:\n\nWe take **analyst estimates**, we discount that by our **required return of 9,2%**. Then we use the **perpetual growth rate of 2,5%** and that gave us a fair value for NVDA´s stock of **$327 per share**. But because we have to account for **NVDA´s equity** as well, our **fair value of equity** would be **$311 per share**.\n\nNow feel free to include a margin of safety to that.\n\nWith NVDA´s price being at **$326** **per share** right now, it´s kind of fairly valued. That´s why I think buying *heavily* might not be a good idea. Although you can always dollar-cost-average. That´s where you invest every month the same amount.\n\n**Where I see NVDA´s stock price in 5 years.** We can calculate where the price might be in 5 years with the **Earnings Per Share (EPS TTM)**, the **Estimated Growth Rate** and the **Future P/E Value**. With this method I get a stock price of **$868 per share** which is definitely higher than what it is now. \n\n**What I´ll do.** I believe NVIDIA is here to stay. I think they will stay for a long time and innovate even more. That´s why, although the price is not exactly where I would want it to be (I want to include a margin of safety), I will maybe start to **dollar-cost-average**. That way I won´t mind the volatile market and hold for the longterm.\n\nThank you for reading and I hope I´ll see you again.",
        "subreddit": "stocks",
        "title": "Is NVDA a good buy right now?",
        "url": "https://www.reddit.com/r/stocks/comments/r69z5l/is_nvda_a_good_buy_right_now/",
        "created": 1638375648.0
    },
    {
        "author": "BurnerBurnerBurns20",
        "created_utc": 1638387005,
        "id": "r6my4u",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "CNBC’s Jim Cramer said Wednesday he’s not ready to sell any shares Nvidia yet, even though he recently booked some profits in two other big charitable trust winners Advanced Micro Devices and Ford.\n\nhttps://www.cnbc.com/2021/12/01/cramer-says-hes-not-ready-to-sell-nvidia-sees-stock-at-10-trillion-one-day.html\n\nCramer told “Fast Money Halftime Report” he believes that Nvidia could be a $10 trillion stock one day. Shares soared 145% year-to-date to an over $800 billion stock market value.\n\nIt’s no secret that Cramer loves Nvidia, the largest maker of graphics and artificial intelligence chips in the world. He’s even named his dog Nvidia. On television and in his investing club, the “Mad Money” host has praised CEO Jensen Huang’s vision for how the metaverse — or omniverse, which is Nvidia’s preferred term — can be used by businesses to reduce wastefulness and increase efficiency.",
        "subreddit": "stocks",
        "title": "Jim Cramer says he’s not ready to take profits in Nvidia, sees stock at $10 trillion one day",
        "url": "https://www.reddit.com/r/stocks/comments/r6my4u/jim_cramer_says_hes_not_ready_to_take_profits_in/",
        "created": 1638415805.0
    },
    {
        "author": "CuriousGam",
        "created_utc": 1638398695,
        "id": "r6rje4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "yeah, after watching the market for months I want to push some money into stocks, but would like to ask about some details.\n\n&amp;#x200B;\n\n30years, single, job,\n\nin a country with a social system,\n\nemergency fund exists,\n\nno plans for that money\n\n&amp;#x200B;\n\nPlan:\n\n\\~40% All World ETF\n\n\\~40% single stocks\n\napple, Nvidia, MSFT, Cloudflare, Autodesk, Costco, PP, (V + MA..dunno), Intel, SQ, AMZN, Zalando               Qualcomm, intel, Biotech, maybe some EV, battery, stuff etc\n\n\\~20% Those that shall not be named, gambling\n\n&amp;#x200B;\n\nI would put roughly 30% of my income into the things that currently look good... or just into the All World.\n\n&amp;#x200B;\n\n* I guess my split makes sense?\n* How many share should you get? Or what min % should a position have? I mean, is there a reason to get a single stock of multiple companies?\n* Considering that I am mostly looking at Tech stuff, would it be better to take an Technology ETF instead of all that single stocks?\n* Or would it even be useful to take several ETFs (Tech+ Biotech+ Fin+EV) instead of a single one?\n* And in those ETF´s, better take those with a lot of companies or with few? Those with a high% of the Top10 or not?",
        "subreddit": "stocks",
        "title": "Never invested, single stocks or ETF´s?",
        "url": "https://www.reddit.com/r/stocks/comments/r6rje4/never_invested_single_stocks_or_etfs/",
        "created": 1638427495.0
    },
    {
        "author": "thespitfire69",
        "created_utc": 1638409796,
        "id": "r6vk4f",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi guys,\n\nFirst time posting, appreciate any feedback. I'm aware some of the capitalized stock tickers aren't proper stock tickers just some rough notes I took.\n\nHere's some positions Im thinking of buying 65% now and 35% of position later on dips.\n\nLet me know your thoughts, I haven't decided on allocations. Pokemon cards will be 2% max haha, just buying some sealed booster boxes.\n\nInvestment horizon 1.5-2.5 years.\n\nHACK? (Cybersecurity ETF)\nVaccine stocks?\nNVIDIA\nPokemon cards?\nAMD\nQUALCOMM\nINTEL\nGOOG\nAPPL\nCARBON CREDITS\nS&amp;P500 ETF\nDividend ETF?\nMLM Stagflation Hedge ETF\nLynas? (Rare earth metals)",
        "subreddit": "wallstreetbets",
        "title": "Thoughts on my positions?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6vk4f/thoughts_on_my_positions/",
        "created": 1638438596.0
    },
    {
        "author": "llPOGIl",
        "created_utc": 1638413907,
        "id": "r6wyvl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hello everyone,\n\nI have $65k realized short term gains for 2021 as of now. I also have a stock position where I’m down $17k.\n\nI’m wondering is it strategically better to\n\nA). Pay tax on the $65k gains at 24% tax rate and sell the stock position for $17k loss in 2022 to start the year with $17k tax credit.\n\nOr \n\nB). Sell the stock position for $17k loss and tax harvest to have a realized short term gains of $48k instead. And use the principal to buy Nvidia or Apple.\n\nThank you ahead of time for your input.",
        "subreddit": "stocks",
        "title": "Tax Loss Harvest Question",
        "url": "https://www.reddit.com/r/stocks/comments/r6wyvl/tax_loss_harvest_question/",
        "created": 1638442707.0
    },
    {
        "author": "AlE833",
        "created_utc": 1638399595,
        "id": "r6rvwp",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "As the title suggests, I believe the stock gravy train is ending by the completion of this year. \n\nWhat do I mean by this? I mean, we won’t be seeing an ‘everything rally’ like we have seen the last two years especially. Already, we have seen those mid-cap tech stocks bleed as investors flock to the FAANG stocks. \n\nIf you look at the charts for the past two years or so, you’ll see huge gains for practically every stock. Those gains happened because of liquidity and zero interest rates. The Fed is going to raise interest rates next year. This is normal but because of the huge gains already, we won’t see that repeat itself. That’s what I mean by the end of the gravy train. \n\nHow much will rates go up and how quickly? No one knows. But it could have a huge effect on values. We have seen stocks just because of this Covid variant. Rates will shock the system and you’ll have panic selling. \n\nI’m going to keep buying into my SPY and QQQ ETFs, and with stocks I’m sticking to tried and true - Google, Microsoft, Apple, Tesla and Nvidia. We are heading towards a future where these companies will continue to dominate and innovate.",
        "subreddit": "stocks",
        "title": "Gravy train is ending soon",
        "url": "https://www.reddit.com/r/stocks/comments/r6rvwp/gravy_train_is_ending_soon/",
        "created": 1638428395.0
    },
    {
        "author": "Serrot69",
        "created_utc": 1638392574,
        "id": "r6p4ij",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I’m up on Nvidia over 150%, and I’m debating selling it in favor of buying a semiconductor ETF. I still believe in the sector but I think Nvidia is currently overvalued.\n\nMoreover, Jim Cramer said he ain’t selling any Nvidia, which is clearly a sell signal lol",
        "subreddit": "stocks",
        "title": "Would you take profits on Nvidia in favor of SMH?",
        "url": "https://www.reddit.com/r/stocks/comments/r6p4ij/would_you_take_profits_on_nvidia_in_favor_of_smh/",
        "created": 1638421374.0
    },
    {
        "author": "SomeKindOfSorbet",
        "created_utc": 1638371197,
        "id": "r6gtla",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I'm pretty new to stock trading, so don't hesitate to point out anything I omitted that you think would be worth mentioning regarding Intel.\n\nSo Intel seems to be one of those tech underdogs who no one thinks will perform well in the future because they haven't been innovative at all in the past few years compared to companies like AMD and such. To me, this looks like a long-term buy opportunity:\n\n-  Financials look pretty healthy from what I know.\n\n- 2.80% dividend yield is a big nice-to-have if you're gonna hold the stock patiently for a few years.\n\n- P/E ratio is one of the lowest in the tech market right now, meaning that the company has a lot of room to grow if the expectations become optimistic. And in the case of a market crash, it would be one of the safest bets in the tech market because of its healthy P/E ratio (correct me if I'm wrong on this one).\n\n- They announced an increase in capital spending for the next year, so they are likely trying to get back the ground that they've lost in their technological advancement.\n\n- They're soon going to compete in the discrete GPU market too, so that can't do them any wrong.\n\n- With their own semiconductor foundries, they have an upper edge in manufacturing costs and can avoid a lot of supply chain related issues. And with the never-ending chip shortage, they might be able to make more chips at more affordable costs than AMD and Nvidia, who are bound in their production by TSMC's production capacity. Surely, their manufacturing processes are not as good as TSMC and Samsung's 5-7 nm processes, but it looks like they plan on catching up with them within the next few years. \n\n- They still have their place in the lower-end desktop/mobile CPU market, as their lower-end CPU's are much cheaper than AMD's. They offer the cheapest CPU's with integrated graphics on the market right now. Even if they don't grow anytime soon, I doubt they will run out of revenue sources, especially with the chip shortage going on.\n\nMy plan would be to hold the stock for a few years and cash in those nice dividends while waiting for the stock to become a growth one. I think Intel has already reached its floor price, and it would be very unlikely that the stock price goes any lower considering that it has strong fundamentals.\n\nWhat do you think?",
        "subreddit": "investing",
        "title": "Intel as a long-term investment",
        "url": "https://www.reddit.com/r/investing/comments/r6gtla/intel_as_a_longterm_investment/",
        "created": 1638399997.0
    },
    {
        "author": "iamthejuanyouseek",
        "created_utc": 1638373454,
        "id": "r6hoig",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Had anyone looked into OUST yet?? NVIDIA partner?",
        "url": "https://www.reddit.com/gallery/r6hoig",
        "created": 1638402254.0
    },
    {
        "author": "UnusualArcher",
        "created_utc": 1638368664,
        "id": "r6fw14",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "With a marketcap of 814B, I wonder how many more upside it can have? It’s starting to be close to a 1T company. It doubled its marketcap in the last 6 months. I like the company, I didn’t get in before, but now I fear that it’s starting to get overpriced. What do you think?",
        "subreddit": "CanadianInvestor",
        "title": "Is it too late to invest in NVDA?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/r6fw14/is_it_too_late_to_invest_in_nvda/",
        "created": 1638397464.0
    },
    {
        "author": "Vagscaper",
        "created_utc": 1638364657,
        "id": "r6ejpa",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Bullish AF on NVDA",
        "url": "https://i.redd.it/3t8v33mrlx281.jpg",
        "created": 1638393457.0
    },
    {
        "author": "wishihadaps42",
        "created_utc": 1638381539,
        "id": "r6ksgb",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Buy more vgt and nvidia or do you think tech peaked for this year?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6ksgb/buy_more_vgt_and_nvidia_or_do_you_think_tech/",
        "created": 1638410339.0
    }
]