[
    {
        "author": "junglehuck",
        "created_utc": 1613749766,
        "id": "lnj00p",
        "num_comments": 723,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part.  I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth.  So, feel free to add to this list but here are stocks I like - both long and short.\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "stocks I like - for the hedge funds buying tech to track this",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/",
        "created": 1613778566.0
    },
    {
        "author": "Mycatiskoolerthanyou",
        "created_utc": 1613632440,
        "id": "lmgn13",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "There has been a surprise reshuffle of executive positions\n\n[SUS AS FUCK Reshuffle](https://www.globenewswire.com/news-release/2021/01/19/2161032/0/en/HP-Announces-Executive-Leadership-Appointments.html) I talked to a few people in the company and they DID NOT make them aware of this.\n\nHead counsel resigns\n\n[Head Lawyer fuckin dips](https://www.law.com/corpcounsel/2021/01/20/hp-chief-legal-officer-to-step-down-passing-reins-to-her-deputy/?slreturn=20210118020319)\n\nEX Intelligence chief on the board  Judith (“Jami”) Miscik \n\n Miscik currently serves as the Chief Executive Officer and Vice Chair of Kissinger Associates, an international geopolitical consulting firm, founded by Henry Kissinger in1982. She is also Vice Chair of the Council on Foreign Relations. \n\n[Deep state?](https://www.globenewswire.com/news-release/2021/02/01/2167307/0/en/HP-Inc-Names-Jami-Miscik-to-Board-of-Directors.html)\n\nLeaders are LEAVING\n\n Hewlett Packard Enterprise has hired away the head of PC and printer behemoth HP Inc.’s graphics solutions business for Europe, Middle East and Africa, Simon Ewington , as its new vice president of worldwide distribution. \n\n[Department heads running](https://www.crn.com/news/data-center/hpe-snatches-away-hp-channel-veteran-to-oversee-worldwide-distribution)\n\nPositions\n\n[Don't laugh at MEEEE](https://imgur.com/a/XRbQZHV)\n\nGetting 25$ puts at open",
        "subreddit": "wallstreetbets",
        "title": "Short the SHIT out of HPQ. Or the CIA is taking it over Deep state BOOGALOO?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lmgn13/short_the_shit_out_of_hpq_or_the_cia_is_taking_it/",
        "created": 1613661240.0
    },
    {
        "author": "HateMyBossSoIReddit",
        "created_utc": 1614057706,
        "id": "lqa6ml",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "**The basics:**\n\nThe story of SOS is longer than just 2021, but since most of the drama is about recent news, I started my DD there. \n \n \nThe year begins with SOS’ (Formerly China Rapid Finance XRF) pivot towards crypto mining along with new hires who know about the industry. \nOne of their main hires who they deemed press release worthy is **Dr. Eric H. Yan**[^1](https://finance.yahoo.com/news/dr-huazhong-eric-yan-renowned-130000244.html): “an expert in cryptocurrency mining, security and insurance technologies” Continued, “Dr. Yan is expected to utilize his cryptocurrency mining, protection, insurance expertise and his industry resources to lead SOS's efforts to set up a new business to apply blockchain-based security and insurance technologies in the safeguard of cryptocurrencies and digital assets, and strategically upgrade SOS's existing portfolios of products and services. SOS plans to set up a new wholly owned subsidiary SOS Digital Technologies Inc., to be led by Dr Yan.”\n\n**Who the hell is Dr. Yan** you may ask? I don’t know. He seems like a swell guy that knows some stuff about some things. **But** the people you should be paying attention to have already been working with the company for over two years.\n\nAdded in 2018, their board of directors include two notable names:\n\n**Russell Krauss[^1](https://seekingalpha.com/pr/17279768-china-rapid-finance-names-former-hewlett-packard-executive-co-ceo)[ ^2](https://www.wsj.com/market-data/quotes/SOS/company-people/executive-profile/152328740): A former Hewlett-Packard executive, named Co-Chief Executive Officer (Co-CEO) and Vice Chairman.** “Mr. Krauss brings with him more than two decades of proven P&amp;L leadership experience and an impressive **track record of implementing innovative initiatives at major technology ventures and Fortune 500 companies, including technology giant Hewlett-Packard.** Prior to taking on the current Co-CEO role, Mr. Krauss has served on the XRF Board since 2016 as an independent non-executive director.”\n\n**Krauss’ role is not only as a member their board of directors, but a position as Co-CEO.**\n\nA notable foreshadowing quote from SOS’ founder upon his addition in 2018[^1](https://seekingalpha.com/pr/17279768-china-rapid-finance-names-former-hewlett-packard-executive-co-ceo): “Mr. Krauss will help us accelerate this corporate transformation as we **launch a series of new initiatives.**” Did SOS recognize the buzz and profit around crypto back in 2018 and finally decide to shift towards it? Who knows.\n\n\nIn addition to Krauss, **Doug L. Brown[^1](https://www.wsj.com/market-data/quotes/SOS/company-people/executive-profile/16275576): 13 Year Former Vice Chairman of Investment Banking at Morgan Stanley and Co-Chairman for Morgan Stanley Investment Management, Inc. (a subsidiary of Morgan Stanley)** (While also actively on the board of Transamerica Corp., Shanghai Harvest Network Technology Co. Ltd. and Chairman &amp; Chief Executive Officer at DLB Capital LLC.)\n\n\nBack to 2021, news continued to buzz around SOS after it announced it acquired a private crypto company FXK Tech Corporation “FXK Tech Corporation(\"FXK\"), a Canadian-based company, specializing in the blockchain technology **consulting** and operations and support for **cryptocurrency exchanges** and cloud crypto algorithmic power exchanges”\n\n**The website is dead! And it’s Chinese!! How can a Canadian based website be in Chinese?! Is this a fake company?! Sell??**\n\nAdmittedly information on this company is scarce. There are what I assume to be remains of a defunct website. I do not know how large or small this company was, or what exactly was purchased from them. Was it a framework for an unfinished crypto exchange that went bust after the 2017-18 crypto burst? Is it a proprietary program, code, blockchain insurance framework, a full buyout of its consulting information, or something completely different? Who knows. According to Dr Yan, “FXK is a leader in cryptocurrency and crypto algorithmic power exchange technologies. [Acquisition] will expedite the executions of our strategy in cryptocurrencies and cloud crypto mining and security and insurance.”[^1](https://finance.yahoo.com/news/sos-ltd-enters-non-binding-130000981.html) \n\n**What I have found**, is they claim to be in Richmond, BC which supposedly is over half Chinese which may explain the inclusion of Chinese on their defunct website. This is the weakest link in my DD but may bring the biggest possibilities: Keyword **Exchanges**. If SOS has an eye on opening a cryptocurrency exchange it could mean being one of the first publicly traded crypto exchanges. (I say \"one of\" because Coinbase intends to go public sometime soon with immense hype behind it[^1](https://www.forbes.com/advisor/investing/coinbase-ipo-direct-listing/)). This is a total unknown so take it with a bag of salt.\n\nShortly after, SOS announced its purchase order of miners from Hy International Group New York Inc.[^1](http://www.hyfth.com/product.html)\n\n**but the Hy website has spelling errors! They won’t respond to my emails about buying a miner!!1 fake company?! SELL??**\n\nAs anyone who has browsed Alibaba or Amazon knows, Chinese to English translation doesn’t come across well. Their business is no doubt tied to China, however they are incorporated in New York[^1](https://opencorporates.com/companies/us_ny/5811734) and based on their corporate address their office is rented from Quest Workspaces[^1](https://www.google.com/search?q=800+3RD+AVE%2C+SUITE+2800&amp;rlz=1C1SQJL_enUS768US768&amp;oq=800+3RD+AVE%2C+SUITE+2800&amp;aqs=chrome.0.69i59l2j69i60l3.554571j0j9&amp;sourceid=chrome&amp;ie=UTF-8)[ ^2](https://questworkspaces.com/locations/new-york-city/) at a location in the heart of New York. Yes, Quest Workspaces offers both physical and virtual offices. No, I don't know which type Hy International uses. I don’t know the size of this company, their clients, their inventory, or how they use their offices. I assume they use it as a stepping stone to be more exposed to potential American customers for their Chinese supply of miners. Remember: China is the main miner of bitcoin and the largest global producer of crypto miners[^1](https://www.forbes.com/sites/rogerhuang/2021/12/29/the-chinese-mining-centralization-of-bitcoin-and-ethereum/).\n\n**What I have found**, is the purchase order of miners SOS made was orders of magnitude any lone individual would ever attempt to buy. They ordered **15,645 mining rigs** for over **$20 million**. Is anyone really surprised they don't respond to a cold-call g-mail in English about buying miners during an unprecedented miner shortage? An article from January states “a global chip shortage is choking the production of miners” with a mining rig merchant stating “prices on the second-hand market have jumped 50% to 60% over the past year, while prices of new equipment more than doubled”[^1](https://www.reuters.com/article/us-crypto-currency-china-mining/global-chip-shortage-hits-chinas-bitcoin-mining-sector-idUSKBN29R1AY)\n\nLong story short, the jump in crypto prices have created a **huge demand for miners**. I wouldn’t be surprised if some of these companies receive **hundreds to thousands of prospective emails per day** trying to squeeze out new mining rigs from them, and again, **their primary language is Chinese**.\n\n\n**they are a cayman islands entity, so they’re fake.. right?? Sell!!1**\n\nThat is correct, however, anyone who dabbles in Chinese stocks knows that when you invest in certain Chinese companies you are actually investing in a shell of that company, what’s called a Variable Interest Entity (VIE), which is used as a work-around to allow CCP control over Chinese business entities while still benefiting from the capital flow of foreign investment. The biggest example of this is Alibaba (BABA), which admittedly has created some scares for investors, and yes, this framework is not ideal, **but obviously this framework hasn’t stopped these stocks prices from appreciating greatly.**\n\nMore information on VIE’s here[^1](https://www.dailymail.co.uk/wires/reuters/article-2748861/Alibabas-VIE-structure.html)[ ^2](https://lawecommons.luc.edu/cgi/viewcontent.cgi?article=1181&amp;context=lucilr) (Or google it)\n\nIf anyone has anything to add feel free, but those be the basics on the SOS drama",
        "subreddit": "pennystocks",
        "title": "$SOS Stock",
        "url": "https://www.reddit.com/r/pennystocks/comments/lqa6ml/sos_stock/",
        "created": 1614086506.0
    },
    {
        "author": "whereismynut",
        "created_utc": 1614181121,
        "id": "lrfpej",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "Stumbled upon this recently and did some minor DD on this but let have a discussion on what you feel about CWGYF.\n\nbasically, copy and paste of  recently published end of Quarter Highlights\n\n&gt;•\t $1.6m Mooring Tensioner project led by Carnegie awarded funding by Blue  Economy Cooperative Research Centre and formally commences with project  partner    \n&gt;  \n&gt;•\tHewlett Packard Enterprise Company  (HPE) and Carnegie sign Collaboration Agreement to develop reinforcement  learning-based controller for CETO and commence work    \n&gt;  \n&gt;•\tMicrosoft awards Carnegie with an AI for Earth grant providing  computational resources and support for a project to enhance Carnegie’s  Wave Predictor     \n&gt;  \n&gt;•\tOceantera, a southeast Asian  project developer, and Carnegie sign Collaboration Agreement to explore  potential projects in SE Asia and share knowledge and expertise    \n&gt;  \n&gt;•\tHydrogen opportunities explored and further knowledge developed  through ongoing internal investigations and via industry relationships    \n&gt;  \n&gt;•\tGarden Island Microgrid resumes operation following temporary  disconnection required for Department of Defence’s own electrical  upgrades    \n&gt;  \n&gt;•\tEuropean Commission releases new EU  Strategy on Offshore Renewable Energy supporting a vision of at least  1000 MW of ocean energy by 2030 and 60 GW by 2050 \n\nI encourage you guys to read their quarterly report.\n\n[https://www.carnegiece.com/portfolio/quarterly-activities-report-4/](https://www.carnegiece.com/portfolio/quarterly-activities-report-4/)\n\n&amp;#x200B;\n\nthey're investing to integrate their technology, reduce costs on their own tech, and on creating energy. (that's my own understanding.) for example,\n\n&gt;Hydrogen opportunities were investigated during the quarter and continue with a growing interest in the space from industry and government. The synergies between wave energy and hydrogen production strengthen productionstrengthen the case and Carnegie has been particularly focused on opportunities that encompass existing target markets such as islands,  remote areas, and marine energy consumers including fish farming. In parallel, enabling technologies are being developed by a variety of companies that are complementary to Carnegie’s activities.  For example, electrolyzers,  the  devices  that  produce  hydrogen  from  water and  electricity,  are being developed can now use seawater as their hydrogen source rather than freshwater  \n&gt;  \n&gt;Hydrogen  is most likely to play a  role as long/medium-term storage or as a  fuel source for vessels and generators. Carnegie’s role in the Blue Economy CRCis providing good insight into the topic of hydrogen in the marine space and opportunities will continue to be identified.\n\nthis is basically a long-term play and they will specify it in there as well. Imo I see the demand for renewable energy. I feel like there will be heavy reform on how Companies and consumers use energy in the following 50 years. they specify that in the report.\n\n&gt;Carnegie continues to seegrowing vision and support for offshore renewables around the world as demonstrated by actions such as the European Commission publishing a dedicated EU strategy on offshore renewable energyin November 2020(An EU Strategy to harness thepotential  of  offshore  renewable  energy  for  a  climate  neutral  future). The EU’s strategysupports an objective of achievingat least1 GW of ocean energy by 2030 and 60 GW of oceanenergy  by  2050.  It  alsoproposes  a  strategyto  make  offshore  renewable  energy  a  corecomponent of Europe’s energy system by 2050.In  the  US,the  new  President  has  significantly  elevated  the  issue  of  climate  change  withrenewed  commitment  to  the  Paris  Agreement.  Carnegie  sees  this  as  highly  positive  andexpects support measures for marine renewables to increaseas a result\n\nThey basically go on about all the collab theyre making with the companies listed above and the fundings they're getting and how the tech works. Check it out. This isn't financial advice.\n\n&amp;#x200B;\n\ntdlr long play at a good price. long term potential.\n\nEdits: add info and fix errors.\n\n&amp;#x200B;",
        "subreddit": "pennystocks",
        "title": "Carnegie Clean Energy Limited (CWGYF) (+12.50%)",
        "url": "https://www.reddit.com/r/pennystocks/comments/lrfpej/carnegie_clean_energy_limited_cwgyf_1250/",
        "created": 1614209921.0
    },
    {
        "author": "GreenGreenGains",
        "created_utc": 1613057453,
        "id": "lhn2ze",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "I've been following this company for a bit now and thought I would share what I've been seeing over the past few months because I know there are lots of people in here looking for new penny stocks to do some DD on and invest in.\n\nI'll get you started on this one.\n\nI initially found this ticker after buying some shares of Ocean Power Technologies (OPTT) in the Fall and wondering if there were any similar companies being publicly traded. They're called Carnegie Clean Energy, formerly known as Carnegie Wave Energy. They've been around since the 80's and have recently been through quite a shake up. In the late 2010's they finally got rid of their CEO who was raking in nearly a million dollars a year and bleeding the company dry while failing to deliver on company promises. They've since shifted their focus to perfecting their wave energy AI and Tech. They've been doing so well in that field that as of this past Fall they are in partnerships with Microsoft($MSFT) AND Hewlett Packard($HPE). Both companies awarded their work access to their AI and computing capabilities because they believe they are producing game changing technology.\n\nThey've also recently turned their Solar Micro-grid on which powers Australia's largest Naval Base. The Naval Base had been undergoing some important updates mandated by AUS and is now fully functional again and receiving energy from the Micro-grid, which is bringing fresh revenue streams to the company. Their Micro-grid is also part of their off shore energy project which takes ocean energy and turns it into electricity while ALSO desalinating the water and putting it through a reverse osmosis filter to be used for drinking water.\n\nThe shares are currently trading at .0025 (that's 2000 shares for 5 bucks), up from it's all time low of .0001 which it hit right before their solar grid went live and their quarterly report came out. See the report and other news here: [www.carnegiece.com/news](https://www.carnegiece.com/news)\n\nSince hitting it's all time low, it's volume has been spiking, breaking it's all time volume high several times in the past two weeks. Volume in the beginning of January was nearly non existent. Now it's trading in the millions on a daily basis and rising. From what I've seen on different stock forums and chats, it is mostly German investors that have been hopping on this stock so far, or at least there isn't much, if any, chatter about it on the American forums. I've seen some people write it off because of the large float, but peruse the trending penny stocks that have seen large leaps recently and you'll find several with floats larger than $CWGYF.\n\nThe rest of the DD is up to you. Personally I'll be joining the Germans on this boat as it looks like a well positioned Green Energy play that's just now emerging from the basement and opening the doors at the ground floor entry level. If you like green energy and also getting in on the ground floor, this one could be for you. A $5 dollar investment might turn into $1, but I think it's much more likely it will turn into $60+. Start with a number bigger than 5 and... well you get it.\n\nCarnegie Clean Energy, where they want to know, \"Can We Get You Ferraris?\" - $CWGYF\n\nNote: ALWAYS do your own DD. Never buy anything until you have made an informed decision to do so on your own.",
        "subreddit": "StockMarket",
        "title": "Quite Possibly The Next Big Green Energy Stock To Rocket From Sub Penny Status - Carnegie Clean Energy - $CWGYF(CanWeGetYouFerraris?)",
        "url": "https://www.reddit.com/r/StockMarket/comments/lhn2ze/quite_possibly_the_next_big_green_energy_stock_to/",
        "created": 1613086253.0
    },
    {
        "author": "JustinGill14",
        "created_utc": 1613963252,
        "id": "lpdmh3",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "First of all do your own DD. No one is being forced here to but this I'm just giving the info I see.\n\nI see a lot of users are concerned that this could be a P&amp;D and with good reason.\n\nSo, make your own decision and evaluate your own risk.\n\nA lot of people want proof so here's proof.\n\nFirst photo of the 5g module that they acquired from Compal Electronics. This is before its assigned to Tri-Cascade\n\n[https://fccid.io/GKRRXMG1/External-Photos/External-Photos-4802275](https://fccid.io/GKRRXMG1/External-Photos/External-Photos-4802275)\n\nNow after changed id with approval from FCC granted you can check this for yourself on the link provided.\n\n[https://fccid.io/GKRRXMG1/External-Photos/External-Photos-4802275](https://fccid.io/GKRRXMG1/External-Photos/External-Photos-4802275)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/80w47n263yi61.jpg?width=922&amp;format=pjpg&amp;auto=webp&amp;s=f4bc548face71558e3f115ece72218101dbf4442\n\n&amp;#x200B;\n\nCompal's electronic clients are the following Apple Inc., Acer, Lenovo, Dell, Toshiba, Hewlett-Packard, and Fujitsu.\n\nThat's a huge market they capture and they just generated 32 Billion USD. SRMX is way undervalued and here's clear proof.\n\nAll of this stuff has happened in the past 3-4 months FCC actually just released the top photos two weeks ago. \n\nExpect big PRs to blow this out of the water\n\nP.S. I'm always open to different ideas maybe I'm wrong and I have got all the info messed up. We're all just tryna make some money.",
        "subreddit": "pennystocks",
        "title": "$SRMX FCC GRANTED ONLY 3 MONTHS AGO. RELEASED TO PUBLIC TWO WEEKS AGO. EXPECT BIG PRS TO DROP SOON",
        "url": "https://www.reddit.com/r/pennystocks/comments/lpdmh3/srmx_fcc_granted_only_3_months_ago_released_to/",
        "created": 1613992052.0
    },
    {
        "author": "zech_meme",
        "created_utc": 1613994000,
        "id": "lpm0sn",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": " \n\nMIAMI &amp; NEW YORK--([BUSINESS WIRE](https://www.businesswire.com/))--Cyxtera Technologies, Inc. (“Cyxtera” or the “Company”), a global leader in mission-critical retail colocation and interconnection services, and Starboard Value Acquisition Corp. (“SVAC”) (NASDAQ: SVAC), a publicly traded special purpose acquisition company, announced the signing of a definitive business combination agreement today.\n\nFormed through the 2017 carve-out of CenturyLink’s (now Lumen) data center and colocation business, Cyxtera has grown to become the largest privately held data center provider of retail colocation services globally. Today, the Company’s footprint of 61 data centers in 29 markets around the world serves more than 2,300 leading enterprises, service providers and government agencies, including Capgemini, Cognizant, Cloudflare, Fujitsu, HPE, Nvidia, and Zenlayer. Upon completion of the transaction, the combined company will be the third largest publicly held global provider of retail colocation and interconnection services. Cyxtera generated estimated revenues of $690 million and Adjusted EBITDA of $213 million in 2020, its first full year of stable operations following the completion of the carve-out, with a plan to drive significant revenue and EBITDA growth in the future.  \n\n\n \n\nMIAMI &amp; NEW YORK--([BUSINESS WIRE](https://www.businesswire.com/))--Cyxtera Technologies, Inc. (“Cyxtera” or the “Company”), a global leader in mission-critical retail colocation and interconnection services, and Starboard Value Acquisition Corp. (“SVAC”) (NASDAQ: SVAC), a publicly traded special purpose acquisition company, announced the signing of a definitive business combination agreement today.\n\nFormed through the 2017 carve-out of CenturyLink’s (now Lumen) data center and colocation business, Cyxtera has grown to become the largest privately held data center provider of retail colocation services globally. Today, the Company’s footprint of 61 data centers in 29 markets around the world serves more than 2,300 leading enterprises, service providers and government agencies, including Capgemini, Cognizant, Cloudflare, Fujitsu, HPE, Nvidia, and Zenlayer. Upon completion of the transaction, the combined company will be the third largest publicly held global provider of retail colocation and interconnection services. Cyxtera generated estimated revenues of $690 million and Adjusted EBITDA of $213 million in 2020, its first full year of stable operations following the completion of the carve-out, with a plan to drive significant revenue and EBITDA growth in the future.",
        "subreddit": "SPACs",
        "title": "Cyxtera Agrees to Merge With Publicly Listed Starboard Value Acquisition Corp. in $3.4 Billion Transaction $SVAC DA",
        "url": "https://www.reddit.com/r/SPACs/comments/lpm0sn/cyxtera_agrees_to_merge_with_publicly_listed/",
        "created": 1614022800.0
    },
    {
        "author": "Kac985",
        "created_utc": 1613751320,
        "id": "lnjmb1",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Fuck all the hedge funds keeping track of stocks mentioned on here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnjmb1/fuck_all_the_hedge_funds_keeping_track_of_stocks/",
        "created": 1613780120.0
    },
    {
        "author": "FikerGaming",
        "created_utc": 1613766331,
        "id": "lnplr1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " So hedge funds use alot time and money to find what stocks are trending on WSB sub pages. so here are some to help them out. They need our help, you are welcome hedge funds.\n\nfeel free to copy this and spread it.\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "subreddit": "Wallstreetbetsnew",
        "title": "The hedge funds need our Help.",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lnplr1/the_hedge_funds_need_our_help/",
        "created": 1613795131.0
    },
    {
        "author": "Mazer_Rac",
        "created_utc": 1612220588,
        "id": "lagxns",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "TL;DR: We're being defrauded! Register your certificates! Hold Wall St. accountable! There are links at the bottom on how to register your certificates in your name using DRS. There is also a SEC link that explains different forms of stock ownership and how brokers will commonly use \"street ownership\" where they just use a spreadsheet to track stocks internally, they're the only one who knows who owns what. They're making shares up out of thin air, depriving you of your voting and dividend rights and keeping it secret.\n\nI also recommend screenshotting how many shares you have in case they start deleting them like the did in Canada with CMKM.\n\n&amp;#x200B;\n\nRead this paper: [https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/](https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/)\n\n&amp;#x200B;\n\nNo, seriously, retard, read it. It's an article covering the research of a PhD in economics who has witnessed first hand what I'm about to tell you and is a big deal herself.\n\n&amp;#x200B;\n\nOur shares in $GME most likely don't exist. Wall St. has been perpetuating the biggest and most widespread fraud in human history. They were almost caught in 2008, but (to their relief) it only affected one sector of the economy and they were bailed out.\n\n&amp;#x200B;\n\nWhat is a fail to deliver? A fail to deliver is a concept used on Wall St. to denote when a lent share (for shorting or any other reason) isn't paid back. You would think that these companies would be mad that they're getting shafted for a share, but no, they're paid some hush money called an \"entitlement\" and they keep quiet. They keep quiet because it was never their money to begin with -- they tell the trader that they have the share and the broker pockets the entitlement.\n\n&amp;#x200B;\n\n&gt;Why naked short? When one broker can sell shares to your broker and simply fail to deliver at settlement, the broker does not have to bear the expense of stock borrowing. And the system lets them. Or they could avoid the expense of borrowing by short selling shares and marking them long. Sometimes, when the sellers really own the shares, their brokers may not transfer them to buyers. That and naked shorting both yield fails to deliver.  \n&gt;  \n&gt;If the shares ever arrive, the broker sends the money to the seller‘s broker. But once the trader knows that the broker agrees to fail to deliver his sell orders, he or she knows that all fails will persist and is free to naked short millions of shares for years to wait for the desired price drop.  \n&gt;  \n&gt;People who buy the undelivered shares get an “entitlement,” and the money they paid stays with their broker, who can use it, interest free. The dollar value of shares purchased but not received is a free loan from the investor to the broker. The investors don‘t know. The broker is not required to tell the client that he took the payment and did not receive any shares. \n\n&amp;#x200B;\n\nWe've been thinking that the big thing going on here is a naked short, but it's **so** much larger than that. My guess is that retail $GME holders on WSB alone hold over 100% of the available-to-trade shares and the brokers are losing their minds. Doesn't it seem odd that they're lying all over the news and putting articles out about \"losing interest\" and \"moving to silver\" and yelling and crying every day over the overleveraged short position of **ONE** hedge fund? It seemed odd to me, too. They're worried because they're on the verge of being found out as a system and causing a crash just like what happened in '29\n\n&amp;#x200B;\n\n&gt;But in a system wracked with fraud, traders engage in naked short selling, when they sell stock they don‘t own and never buy to deliver. So now there are two shares, the real one that was never delivered and a phantom “entitlement” given the unsuspecting buyer which is recorded as such by his broker. And which the buyer can now sell! Because the brokers pretend there are real shares there.  \n&gt;  \n&gt;Making two shares out of one is among the swindles that crashed the market in 1929. It was called “watering the stock.\n\n&amp;#x200B;\n\nThis has happened before, too. In Canada.\n\n&amp;#x200B;\n\n&gt;CMKM was a Canadian company with an interest in diamonds. The shareholders didn‘t know that mineral rights they were told about were owned by the founders, not the company. Criminal and civil complaints ensued. A reform management changed the company name to New Horizons Holdings, Inc with a plan to raise capital for the purchase of oil or gas assets. If successful, they would be able to return the shares to trading status with the hope of restoring value to shareholders.  \n&gt;  \n&gt;NHH directed all shareholders to obtain their stock certificates and exchange them for new shares. That‘s when the masses of phantom shares and corruption of some big brokers came into stark view. Many investors discovered that their brokers had taken their money and never bought or received CMKM shares.  \n&gt;  \n&gt;Trimbath, who worked investigating the scam, calls theses victims “UnShareholders,” investors who reported that their share positions were deleted by their brokers and/or where brokers refused to provide them with share certificates registered in the investors‘ names so they could meet the exchange requirements of a “bona fide shareholder.” She said, “Documents I saw suggested three brokerage firms probably took payments from investors for shares that were never received from the selling broker… Charles Schwab, Chase Bank and RBC Dain.”  \n&gt;  \n&gt;The investors had “phantom shares.” They were allocated a fail to receive on the broker‘s own books, but payment money was taken from their cash accounts, and they continued to receive statements showing share positions for CMKM.  \n&gt;  \n&gt;She said, “Investors submitted documentation showing that each of these brokers deleted their CMKM share positions at a time when we can demonstrate that the firms had no shares either in the depository or on the books of the issuer.” They deleted the evidence of the phantom shares.\\\\\n\n&amp;#x200B;\n\nThey're not obligated to tell us that they don't actually own the underlying stock certificate and they're paying \"unqualified\" dividends to us to make us think that we do -- oh, by the way, these dividends are taxed as income and aren't eligible for dividend tax rates. Another way they're ramming our ass.\n\n&amp;#x200B;\n\n&gt;When settlement failures happen, the shares you buy may not be in your brokerage account regardless of what your broker statement says.  \n&gt;  \n&gt;Let‘s say that your broker gets one of these fails to receive. First of all, they don‘t tell you that they got a fail to receive. If you were an institutional buyer or a high-value client, they will tell you that they failed to receive and they will give you some monetary compensation for the delay and inconvenience. They don‘t tell individual retail investors. If they did, they would have to share the revenue they earn on investors‘ money already paid them for the shares, since brokers don‘t have to transfer money for shares they fail to receive.  \n&gt;  \n&gt;The question then becomes, “Well, how did I get dividends?” You didn‘t really get dividends, you got “dividends in lieu.” That means the broker sent money (maybe part of *your* money) as dividends. You will know this if your 1099 from the broker says “unqualified dividends.” They are generally considered ordinary income and not eligible for dividend tax rates.  \n&gt;  \n&gt;Sometimes, a large broker with many clients seeking the same stock will receive only part of a particular share order. Some clients get real shares, others phantom entitlements. Trimbath said an investor might ask, “How did I get picked out for that?” She said, “The problem is, we don‘t know. And they won‘t tell us. If you were assigned the fail to receive, then the broker has many options, none of which they have to tell you.”\n\nOh, and they're fucking our voting rights! They're letting us vote and then throwing out the votes they don't like. Legally.\n\n&amp;#x200B;\n\n&gt;Before the 2008 crash, at an annual proxy meeting, Bank of America counted 130% of its shares voted, that is, they received 30% more votes than they had shares outstanding. That‘s just the number of people who actually voted their shares! Imagine how many shares were sold beyond what they actually authorized and issued. This violates the voting rights of shareholders and reduces effective corporate governance.  \n&gt;  \n&gt;Trimbath pointed out, Let‘s say it‘s the merger of Compaq and Hewlett Packard. Let‘s say that there are a lot of these extra shares around and they have more votes than shares coming in. And let‘s say that your broker/dealer is JP Morgan, who was actually one of the advisors on that merger deal. They stood to gain more in fees if the merger went through than if it was voted down. Do you think that they would be so careful about your vote that if you voted against something they were in favor of that they would not be tempted to only turn in the votes that they thought should be counted, those that were most favorable to their position, as opposed to trying to make sure that everything was done according to the rules. But, there are no rules! They just make them up as they go along.  \n&gt;  \n&gt;She said, They can, in fact, throw out your vote and just not count it. They can randomly assign your vote to some real proxy that wasn‘t voted. They can vote what shares they actually do have proportionally based on how many phantom votes come in. It‘s all done in secrecy. They don‘t have to tell you, they don‘t have to tell the NYSE, they don‘t have to tell anyone. They don‘t have to tell the company whose shares they voted.  \n&gt;  \n&gt;And the SEC isn‘t interested. To deal with over-voting, the SEC didn‘t say, Stop telling clients they have voting shares when they don‘t. It said, Don‘t submit more votes than shares you are holding. And brokers could choose which votes they wanted to submit!\n\n&amp;#x200B;\n\nThey even have cutsy little names for their fuckery and fraud.\n\n&amp;#x200B;\n\n&gt;Even a university economist who spent 2004 at the SEC studying fails acknowledged in so many words that the broker-dealers do it on purpose. Leslie Boni (now with a hedge fund in Southern California) attributed the extraordinary increase in settlement failures to investment decisions known as “**strategic failures**.”  \n&gt;  \n&gt;Trimbath noted that in 2007, “The Federal Reserve Bank of New York‘s Treasury Markets Practices Group (TMPG) describes several intentionally abusive practices such as **“slamming the wire**” (holding back deliveries until immediately before the close with the intention of causing settlement fails) and requests from traders for settlement operations to “**hold the box**” (a demand to delay settlement of an executed trade). The fact that these practices are colloquially named and described in such detail indicates that they are common causes of settlement failures.”\n\n&amp;#x200B;\n\nOh! Everyone saying it's illegal to naked short? Only sort of. Only for the stock of certain financial companies. That's right, they only made it illegal to drive down the valuation of their buddies. *(Edit: they did extend this rule to all companies later in the year after pressure from businesses)*\n\n&amp;#x200B;\n\n&gt;The SEC continued to declare that fails to deliver were not an indication of naked short selling. That changed when Goldman Sachs and other financial firms needed to be protected. Trimbath pointed out that not till the banks/broker-dealers began to see massive numbers of fails to deliver in their own shares did the SEC put a short-selling ban in place – but only for the shares of banks, insurance companies and securities firms, including the very culprits responsible for the dirty system.\n\n&amp;#x200B;\n\nAgain, it's a big problem.\n\n&amp;#x200B;\n\n&gt;Securities and Exchange Commission: In the first two weeks of July 2019, 914,261,864 shares valued at over $17 billion failed to deliver in settlement from the clearing house, an average of about $1.9 billion every settlement day.\n\n&amp;#x200B;\n\nAnd that's with all of the shady shit they can do to hide the numbers.\n\n&amp;#x200B;\n\n&gt;Trimbath blames the massive fails on the DTCC and its subsidiaries, DTC (Depository Trust Company), the vault that holds the shares, and NSCC (National Securities Clearing Corp), which clears and settles trades, that is, handles the exchange of money and shares which are registered in the accounts of its members, the big banks/broker-dealers.  \n&gt;  \n&gt;The Securities and Exchange Act of 1933 specifically gave the clearing house the right to require that shares and securities be delivered for settlement. It allows them to punish those who don‘t deliver by refusing to have them in the system.  \n&gt;  \n&gt;Trimbath said, “The DTCC has for years ignored that.  \n&gt;  \n&gt;She said, “The 2007 Reg SHO amendment says you cannot short again without borrowing: but only DTCC and SEC know who failed to deliver, so how is that functional?”  \n&gt;  \n&gt;Till 2013, in fact, the NSCC had a program to automatically borrow shares from DTC members to cover fails before settlement. DTC members can still lend shares from their accounts.  \n&gt;  \n&gt;She said the DTCC creates a mirage that there aren‘t any fails, or are many fewer than appears. Wall Street benefits from a service that automatically resubmits settlement failures, what the DTCC calls “fail transactions.” Many trades that fail to settle are required to be re-submitted, where they receive new settlement dates, in essence, erasing the fail to deliver by creating a new record. When this happens, the records show that the fail transactions are no longer outstanding; the next day begins with zero fails.\n\n&amp;#x200B;\n\nSome estimates put the number at 50,000% larger or **$400 billion in phantom trading per WEEK**.\n\n&amp;#x200B;\n\nThe DTCC, who is supposed to make sure that you actually have a physical stock certificate underneath what the broker tells you that you have is enabling this. They're a private corporation and they're in league with the brokers.\n\n&amp;#x200B;\n\n&gt;The answer is that the banks and brokers who use DTCC‘s services, who process trades there, who fail to deliver there, are insiders who sit on the DTCC Board of Directors. And the feeble SEC, dominated by the industry it is supposed to regulate, fails to require the DTCC to impose sanctions on errant members.\n\n&amp;#x200B;\n\nThe DTCC, the brokers, and fucking **CONGRESS** are blocking any efforts to fix this.\n\n&amp;#x200B;\n\n&gt;Harmer said in the film that the DTCC sabotaged their efforts. And that SEC chair William Donaldson also opposed them. Harmer said, To him, the whole business of trading securities belongs to the major brokers, they are the ones who are running this, and you folks down in Washington should not meddle in this or you‘re going to upset the apple cart.  \n&gt;  \n&gt;According to Harmer, They also got to Chairman Shelby.  And so, Shelby said to Bennett — I think we oughta wait and give the SEC a chance to come in and explain their position. And so, we were simply the victims of a very effectively executed strategy to make sure that there were no hearings on this, and even to make sure that Senator Bennett did not introduce the bill.  \n&gt;  \n&gt;A story in *The Washington Post* in 2012 helped explain the lack of enthusiasm in Congress for reforming the processes that lead to phantom shares. “In 2008, for instance, 17 lawmakers reported investing hundreds of thousands of dollars in short-selling funds,” including bets against U.S. Treasury bonds, the Dow Jones Industrial Average and the S&amp;P 500.  \n&gt;  \n&gt;The SEC‘s “reforms” had little effect. Compared to $6 billion in daily fails in 2003, the number was $7.4 billion for February 2020.\n\n&amp;#x200B;\n\nWe can uncover their fuckery! Demand that your broker register your certificates in your name! Show the world that we own more than 100% of $GME's float!\n\n&amp;#x200B;\n\nYou can use DRS to register your stocks in your name. Get in contact with your broker and ask them to register them in your name through the Direct Registration System.\n\n&amp;#x200B;\n\nSEC Info on DRS and how your stock is actually owned: [https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html](https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html)\n\nSEC FAQ on DRS: [https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html#faq](https://www.sec.gov/reportspubs/investor-publications/investorpubsholdsechtm.html#faq)\n\nWrite-up on how to use DRS: [https://the-international-investor.com/investment-faq/holding-shares-direct-registration](https://the-international-investor.com/investment-faq/holding-shares-direct-registration)\n\n&amp;#x200B;\n\nSource: [https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/](https://www.thekomisarscoop.com/2020/03/how-phantom-shares-on-wall-street-threaten-u-s-companies-and-investors/)\n\nMore reading: [https://www.wsj.com/articles/SB943287246835296769](https://www.wsj.com/articles/SB943287246835296769)",
        "subreddit": "Wallstreetbetsnew",
        "title": "$GME Holders We are Being DEFRAUDED by the DTCC and our Broker/Lenders! What We Can Do!",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lagxns/gme_holders_we_are_being_defrauded_by_the_dtcc/",
        "created": 1612249388.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612204514,
        "id": "laadl9",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "options",
        "title": "$HPE Calls",
        "url": "https://www.reddit.com/r/options/comments/laadl9/hpe_calls/",
        "created": 1612233314.0
    },
    {
        "author": "balloonglue556",
        "created_utc": 1613754500,
        "id": "lnkxxm",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part. I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth. So, feel free to add to this list but here are \nstocks I like - both long and short. $COCK and $ASS are definitely the Vlad's favorite \n\nThanks u/junglehuck for the list of stocks I like a lot \n\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "I like these stocks so much (SEC &amp; HEDGies plz do not look at this post)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnkxxm/i_like_these_stocks_so_much_sec_hedgies_plz_do/",
        "created": 1613783300.0
    },
    {
        "author": "molson99999",
        "created_utc": 1612833793,
        "id": "lfr7ef",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "Is HPE a good bet or just another 5G stock?",
        "url": "https://www.reddit.com/r/investing/comments/lfr7ef/is_hpe_a_good_bet_or_just_another_5g_stock/",
        "created": 1612862593.0
    },
    {
        "author": "molson99999",
        "created_utc": 1612834934,
        "id": "lfrk28",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "I'm new to investing, looking at all things 5G, like HPE",
        "url": "https://www.reddit.com/r/investing/comments/lfrk28/im_new_to_investing_looking_at_all_things_5g_like/",
        "created": 1612863734.0
    },
    {
        "author": "Crafty-Light-5952",
        "created_utc": 1613508901,
        "id": "lldedi",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Faithfinder (Aibang) platform and HPE cryptocurrency",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lldedi/faithfinder_aibang_platform_and_hpe_cryptocurrency/",
        "created": 1613537701.0
    },
    {
        "author": "JaytotheEnny",
        "created_utc": 1613762830,
        "id": "lno8kc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I heard about all of the hedge funds working really, really hard on building these trackers that crawl through all of our posts looking for the next big hit. I feel so bad for those little-widdle hedgie funds and wanted to put together a great list for them. \n\n MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JAP, JAP, JAP JAP, JAP JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TATE, TATE, TATE, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Here are some stocks that I like- for all those trackers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lno8kc/here_are_some_stocks_that_i_like_for_all_those/",
        "created": 1613791630.0
    },
    {
        "author": "Vegetable-Guidance39",
        "created_utc": 1612826248,
        "id": "lfoqez",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "HPE Going Live March 10th look it up now and thank me later.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lfoqez/hpe_going_live_march_10th_look_it_up_now_and/",
        "created": 1612855048.0
    },
    {
        "author": "Justgivemoney",
        "created_utc": 1612987325,
        "id": "lh2cwh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$HPE TO THE MOON... maybe",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lh2cwh/hpe_to_the_moon_maybe/",
        "created": 1613016125.0
    },
    {
        "author": "sourdoughbreddit",
        "created_utc": 1614376738,
        "id": "lt8yj4",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Should we keep an eye on HPE?",
        "url": "https://i.redd.it/owi578gd9wj61.jpg",
        "created": 1614405538.0
    },
    {
        "author": "bgc9140",
        "created_utc": 1614028323,
        "id": "lq0244",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Carnegie Clean Energy Limited (CWGYF)- Deals with Microsoft and Hewlett Packard",
        "url": "https://www.reddit.com/r/stocks/comments/lq0244/carnegie_clean_energy_limited_cwgyf_deals_with/",
        "created": 1614057123.0
    },
    {
        "author": "junglehuck",
        "created_utc": 1613749766,
        "id": "lnj00p",
        "num_comments": 723,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part.  I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth.  So, feel free to add to this list but here are stocks I like - both long and short.\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "stocks I like - for the hedge funds buying tech to track this",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/",
        "created": 1613778566.0
    },
    {
        "author": "Sufficient_Nature368",
        "created_utc": 1612368647,
        "id": "lbqzep",
        "num_comments": 182,
        "num_crossposts": 5,
        "selftext": "This will be long....Sorry in advance. I decided I'd like to research Michael Burry since I've seen so many people talking about him on here and this is just what I've discovered about him and his methods.\n\n**Quick Facts:**\n\n* Founder of hedge fund Scion Capital 2000-2008. Closed to focus on personal investments\n* Best known for seeing the subprime mortgage crisis (2007-2010) and profiting from it\n* Investment style is built upon Benjamin Graham and David Dodd’s 1934 book Security Analysis: \"All my stock picking is 100% based on the concept of a margin of safety.\"\n\n**Strategy:**\n\n* Michael Burry's strategy as he states is not very complex. He tries to buy shares of unpopular companies when the look like roadkill, and sell them when they've been cleaned up a bit. Lets take a look at his Q2 2020 Positions, top buys, and top sells. There are a few that are not big surprises but check it out.\n\n|Stock|Shares|Market Value|% of Portfolio|\n|:-|:-|:-|:-|\n|GOOG / Alphabet Inc Class C (CALL)|80,000\t| $113,089,000 | 35.87 |\n| FB / Facebook Inc (CALL) | 93,200 | $21,163,000 | 6.71 |\n| BKNG / Booking Holdings Inc (CALL) | 11,600 | $18,471,000 | 5.86 |\n| GS / Goldman Sachs Group (CALL) | 73,600 | $14,545,000 | 4.61 |\n| GME / Gamestop Corp | 2,750,000 | $11,935,000 | 3.79 |\n| WDC / Western Digital Inc (CALL) | 270,000 | $11,921,000 | 3.78 |\n| BBBY / Bed Bath &amp; Beyond Inc | 1,000,000 | $10,600,000 | 3.36 |\n| DISCA / Discovery Inc | 500,000 | $10,550,000 | 3.35 |\n| TCOM / Trip.com Inc | 325,000 | $8,424,000 | 2.67 |\n| QRVO / Qorvo Inc | 75,000 | $8,290,000 | 2.63 |\n\n* **Top Buys**\n   * GOOG / Alphabet Inc Class C (CALL)\n   * FB / Facebook Inc (CALL)\n   * BKNG / Booking Holdings Inc (CALL)\n   * GS / Goldman Sachs Group (CALL)\n   * WDC / Western Digital Inc (CALL)\n* **Top Sells**\n   * Jack / Jack In The Box Inc\n   * FB / Facebook Inc\n   * BA / Boeing Inc\n   * MAXR / Maxar Technologies Ltd\n   * QRVO / Qorvo Inc\n\nMr. Burry's weapon of choice is his **research** and that it's critical for him to understand a company's value before laying down a dime and that 100% of his stock picking is based on the concept of margin of safety introduced in the book \"Security Analysis\" which I am reading through right now and dang is it huge lol. He also states that he has his own version of their technique, but that the net is that he wants to protect his downside to prevent permanent loss of capital. Specific, known catalyst are not necessary. Sheer, outrageous value is enough.\n\nHe cares little about the level of the general market and puts few restrictions on potential investments. They can be large-cap stocks, small cap, mid cap, micro cap, tech or non-tech and finds out-of-favor industries a particularly fertile ground for best-of-breed shares at **steep discounts**.\n\n**How does he determine the discount?**\n\n* Focuses on free cash flow and enterprise value (Market capitalization less cash plus debt)\n* Screen companies by look at enterprise value/EBITDA ratio. Accepted ratio varies with the industry and it position in the economic cycle\n* If stock passes loose screen, looks harder to determine specific price and value of a company\n   * Takes into account off-balance sheet items and true free cash flow\n   * Ignores price-earning ratios\n   * Return of equity is deceptive and dangerous\n   * Prefers minimal debt\n   * Adjust book value to a realistic number\n* Invest in rare birds - asset plays, and to a lesser extent, arbitrage opportunities and companies selling at less than two-thirds of net value\n* Will mix in with companies favored by Warren Buffet **IF** they become available at good prices. Deserving of longer holding periods.\n\n**How many Stocks does he hold?**\n\n* Likes to hold 12 to 18 stocks diversified among various depressed industries, and tends to be fully invested. Provides enough room for his best ideas and helps with volatility.\n* Feels volatility is no relation to risk.\n\n**Tax Implications**\n\n* Not concerned much about tax. Know his portfolio turnover will generally exceed 50% annually, and at 20% the long-term tax benefits of low-turnover pretty much disappear.\n\n**When he buys**\n\n* He mixes barebones technical analysis into his strategy. \n* Prefers to buy within 10% to 15% of a 52-week low that has shown itself to offer some price support. If a stock other than a rare bird breaks a new low, in most cases he cuts the loss.\n   * Balances the fact that he is turning his back on potentially greater value with the fact that since implementing this rule he hasn't had a single misfortunate blow up his entire portfolio\n\n&amp;#x200B;\n\n&gt;In the end, investing is neither a science nor an art - it is a scientific art.\n\n&amp;#x200B;\n\n**Works Cited**\n\n[https://acquirersmultiple.com/2020/08/michael-burrys-top-10-holdings-q2-2020-plus-top-buys-sells/](https://acquirersmultiple.com/2020/08/michael-burrys-top-10-holdings-q2-2020-plus-top-buys-sells/)\n\n[https://acquirersmultiple.com/2017/11/michael-burry-search-for-unpopular-companies-that-look-like-road-kill/](https://acquirersmultiple.com/2017/11/michael-burry-search-for-unpopular-companies-that-look-like-road-kill/)\n\n[https://en.wikipedia.org/wiki/Michael\\_Burry](https://en.wikipedia.org/wiki/Michael_Burry)",
        "subreddit": "ValueInvesting",
        "title": "Michael Burry's Investment Strategy",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/lbqzep/michael_burrys_investment_strategy/",
        "created": 1612397447.0
    },
    {
        "author": "FoundersSociety",
        "created_utc": 1612744434,
        "id": "lezsok",
        "num_comments": 163,
        "num_crossposts": 0,
        "selftext": "if you love money, pls read &amp; don't delete \n\n /thanks \n\n&amp;#x200B;\n\n Zomedica is an animal health company focused on meeting the needs of clinical veterinarians in ways that promote both patient and practice health. Our mission is to advance the effectiveness and financial well-being of veterinary practitioners by delivering professionally beneficial diagnostic products and services. \n\nThe main reason we are excited about Zomedica \n\nvia ZOMEDICA NEWS RELEASE 12/07/2020 -  *Zomedica Completes Internal “Launch Team” for Upcoming TRUFORMA™ Commercialization* \n\n **Protected by approximately 70 issued and pending patents, the TRUFORMA diagnostic platform uses Bulk Acoustic Wave (“BAW”) technology, developed by Qorvo (NASDAQ: QRVO), to provide a non-optical and fluorescence-free detection system for use at the point-of-care. BAW technology, also used in cell phones and in the world’s most advanced radar and communications systems, is an extremely reliable and precise technology. Zomedica expects to begin commercial sales of TRUFORMA on March 30, 2021.** \n\n[How much they can make ](https://preview.redd.it/6z2uywl2d5g61.png?width=1059&amp;format=png&amp;auto=webp&amp;s=8302496c3f60d813a04068ddf419d8696c9d3d73)\n\n[Why they will go up ](https://preview.redd.it/qxfp7to1d5g61.png?width=951&amp;format=png&amp;auto=webp&amp;s=5e0eafa09b46f5665b0c9962a03425e6344116c5)\n\n[blackrock invests more into ZOM](https://preview.redd.it/0jr84w50d5g61.png?width=1146&amp;format=png&amp;auto=webp&amp;s=03503ad87ee1cf183470da7a2804176ef198bea8)\n\n[pOTential Price Points](https://preview.redd.it/t2lilrzzc5g61.jpg?width=1017&amp;format=pjpg&amp;auto=webp&amp;s=b4dc41d1c415bc080d08e92793f5b0f3a48cdcc9)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nfor the love of god please dont delete this posts just trying to help us all make more money",
        "subreddit": "wallstreetbets",
        "title": "My fellow 🚀nauts, Why $ZOM =🚀 🚀 - A simplistic DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lezsok/my_fellow_nauts_why_zom_a_simplistic_dd/",
        "created": 1612773234.0
    },
    {
        "author": "Kac985",
        "created_utc": 1613751320,
        "id": "lnjmb1",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Fuck all the hedge funds keeping track of stocks mentioned on here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnjmb1/fuck_all_the_hedge_funds_keeping_track_of_stocks/",
        "created": 1613780120.0
    },
    {
        "author": "KillerAc1",
        "created_utc": 1613368082,
        "id": "lk6y63",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Hi! I've been getting into investing a lot recently, and I'm doing this mainly for my own experience. I'll take any feedback or comments y'all have. Let me know what you think of my first list!\n\nTo start off, I want to disclose how I picked this list. I used Morgan Stanley's stock screener to find tickers with their \"overweight\" rating and a price below their given price target (if applicable). Next, I would cross-reference that with RH and Zack's stock analysis. Finally, I would search for each ticker on Reddit in order to see what the sentiment towards the stock was. After compiling the list, I went through each stock individually again and assigned it a ranking of 1-5 (1 being safe, 5 being more speculative/risky), as well as providing a hypothetical dollar amount that I would invest in at the current price.\n\nThe goal of this list was to pick a balanced portfolio between aggressive growth and long term consistency. I have a huge bias towards semiconductors, biomedical, tech, and industrial/material.\n\nI'll start with the stocks I gave a 1 rating\n\n1. MSFT, GOOGL, AMZN, FB, AAPL ($8k in each)\n\nI believe these will be here for a loooong time as well as continue to grow. These seem pretty safe to me and make up the foundation of this portfolio\n\nNow we get to stocks with a 2 rating. These are my favorites, as I see them having high growth potential and staying power (still riskier than 1s, however)\n\n2. NVDA, AMD, TXG, AMAT, MT, VALE, RTX, TDG, QRVO, NIO, TSLA ($5k in each)\n\n Now we get on to the 3s! These will follow a similar pattern of higher risk, less amount invested.\n\n3. TER, LRCX, ON, MCHP, FSLY, CRSR, RDSB, DOCU ($3k in each)\n\nNow we get to the 4s. These are mostly speculative\n\n4. SPCE, ANTM, NET, ACAD, ABCL ($2k in each)\n\nThat list was pretty short. The 5s will be the most risky/most speculative. They will have the lowest amount invested in them.\n\n5. TGH, SEDG, HUM, AMKR.\n\nOh and positions: 20 VOO, 62 QQQ, 28 LIT, and 54 PLTR. If you made it to the end of this post, thank you!",
        "subreddit": "stocks",
        "title": "My first attempt at a stocks to watch list/DD",
        "url": "https://www.reddit.com/r/stocks/comments/lk6y63/my_first_attempt_at_a_stocks_to_watch_listdd/",
        "created": 1613396882.0
    },
    {
        "author": "stee4vendetta",
        "created_utc": 1613546616,
        "id": "llor9h",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "With president Biden expected to sign the executive order to give the semiconductor industry a boost, there are several companies set to benefit from the cash injection:\n\nAMD, Analog Devices, Cree, GlobalFoundries, Intel, Lattice Semiconductor, Marvell Semiconductor, Maxim, Micron Technology, ON Semiconductor, Qorvo, Qualcomm, Silicon Labs, Skyworks, Texas Instruments, Western Digital, Xilinx and the SIA.\n\nA lot of these companies have very affordable stock and steady growth. Do with this information as you will.",
        "subreddit": "wallstreetbets",
        "title": "POTENTIAL EARNING ALERT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/llor9h/potential_earning_alert/",
        "created": 1613575416.0
    },
    {
        "author": "FikerGaming",
        "created_utc": 1613766331,
        "id": "lnplr1",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " So hedge funds use alot time and money to find what stocks are trending on WSB sub pages. so here are some to help them out. They need our help, you are welcome hedge funds.\n\nfeel free to copy this and spread it.\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "subreddit": "Wallstreetbetsnew",
        "title": "The hedge funds need our Help.",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lnplr1/the_hedge_funds_need_our_help/",
        "created": 1613795131.0
    },
    {
        "author": "Arj_123",
        "created_utc": 1612831272,
        "id": "lfqee7",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "So I like to swing trade more often, and I especially love the ones which went down unreasonably   \nSince its an earnings season, I got into ones that went down right after their earnings.  \nI believe the following have a good chance at rebounding back to their price levels before earnings.  \nIBM  - recent pltr partnership and has good growth in its ai sector.  \nQCOM - leader of 5g in U.S, overreaction imho,  same with QRVO which beat estimates but still went down\n\nI also got in and closed INTC.  \nso yea guys add in more stocks you think will rebound after going down due to earnings results.",
        "subreddit": "investing",
        "title": "Swing plays for this month (earnings season)",
        "url": "https://www.reddit.com/r/investing/comments/lfqee7/swing_plays_for_this_month_earnings_season/",
        "created": 1612860072.0
    },
    {
        "author": "bayareabiotech",
        "created_utc": 1613072351,
        "id": "lhspdx",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "WDC and QRVO...... the world runs on chips?????",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lhspdx/wdc_and_qrvo_the_world_runs_on_chips/",
        "created": 1613101151.0
    },
    {
        "author": "balloonglue556",
        "created_utc": 1613754500,
        "id": "lnkxxm",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part. I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth. So, feel free to add to this list but here are \nstocks I like - both long and short. $COCK and $ASS are definitely the Vlad's favorite \n\nThanks u/junglehuck for the list of stocks I like a lot \n\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "I like these stocks so much (SEC &amp; HEDGies plz do not look at this post)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnkxxm/i_like_these_stocks_so_much_sec_hedgies_plz_do/",
        "created": 1613783300.0
    },
    {
        "author": "contrariantrade",
        "created_utc": 1613927205,
        "id": "lp1g41",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Stock Analysis : Qorvo (QRVO) | Stocks To Buy Now? 🤔",
        "url": "https://youtube.com/watch?v=dtWQjmfWjq8&amp;feature=share",
        "created": 1613956005.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1612474170,
        "id": "lcqp7v",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, February 4, 2021**\n\nStocks rose again today, extending this week’s remarkable rally further. The market’s quick recovery is encouraging given last week was the market’s worst since October. Market participants largely shook off concerns over heightened volatility following last week’s historic, Reddit-fueled rally in stocks like Gamestop (GME) and AMC and turned their attention back to corporate earnings reports and positive news on the vaccine and stimulus fronts coming out of Washington. The S&amp;P 500 (SPY) closed 1.12% up, the Nasdaq (QQQ) closed 1.18% up, and the Dow (DIA) closed 1.10% up.\n\nThe Democratic-controlled Senate voted to move forward with a process to fast track approval of President Biden’s new coronavirus stimulus package. The Senate opened debates on budget resolutions for the fiscal year of 2021, with the intention of including parts of Biden’s stimulus package with a simple majority.  In Congress, budget resolutions only need a simply 50+1 majority rather than the 60-vote supermajority required to pass major bills. In this manner, Democrats would be able to pass the stimulus without Republican support. The House of Representatives is expected to adopt a similar move soon. \"With this budget resolution, the Democratic Congress is paving the way for the landmark Biden-Harris coronavirus package that will crush the virus and deliver real relief to families and communities in need,\" Pelosi and Schumer said in a joint statement. As a reminder, in the Senate, there remains a 50/50 split between Democrats and Republicans, but Kamala Harris, as the Vice President, has the power to cast a tie-breaking vote if need be.\n\nToday, the White House announced a plan to ship coronavirus vaccines directly to retail pharmacies like CVS in an effort to boost the pace of vaccinations. The move is expected to raise the [weekly supply of shots by 1 million to 11.5 million.](https://www.whitehouse.gov/briefing-room/statements-releases/2021/02/02/fact-sheet-president-biden-announces-increased-vaccine-supply-initial-launch-of-the-federal-retail-pharmacy-program-and-expansion-of-fema-reimbursement-to-states/)\n\n**Highlights**\n\n* Some notable earnings after the bell are: Snap (SNAP), Gilead (GILD), Pinterest (PINS) and Peloton (PTON) after market close.\n* Weekly Unemployment claims came in at 779,000, below the 830,000 estimate.\n* Ford (F) said it will cut its output of F-150 pickups due to a shortage in the semiconductors needed.\n* Gamestop (GME) and other “meme stocks” continue to be under heavy pressure. Gamestop pulled back another 42% today, with the stock around $53 at the time of writing.\n* Apple (AAPL) is close to a deal with Hyundai-Kia to make an Apple-branded autonomous electric vehicle at a Kia plant in Georgia, CNBC reported late Wednesday, citing “multiple” sources who briefed CNBC on the plan. This is a developing story we will keep track of\n* AbbVie (ABBV) with 3 price target raises. Stock currently around $107\n   * Mizuho from $117 to $126\n   * Royal Bank of Canada from $129 to $135\n   * SVB Leerink from $128 to $140\n* Align Tech (ALGN) with 3 target raises. Stock currently around $546\n   * Evercore from $625 to $680\n   * Credit Suisse from $618 to $630 \n   * SVB Leerinkl from $620 to $680\n* Digital Turbine (APPS) with mulitple target raises. Consensus price target around $85 with Buy rating. Stock currently around $64. This is one we really like\n* Aptiv (APTV) target raised by Morgan Stanley (MS) from $160 to $200 at Overweight. Stock currently around $143\n* Biogen (BIIB) target raised by HC Wainwright from $289 to $305 at Buy. Stock currently around $263\n* Chipotle (CMG) target raised by Loop Capital from $1600 to $1800 at Buy. Stock currently around $1500\n* After positive earnings report, (EBAY) with a host of target upgrades. Consensus price target around $75 at Overweight. Stock currently around $58\n* HCA Healthcare (HCA) target raised by UBS Group from $164 to $204 at Buy. Stock currently around $174\n* Eli Lilly (LLY) target raised by Morgan Stanley from $190 to $217 at Overweight. Stock currently around $197\n* After a positive earnings report, Paypal (PYPL) with a host of target raises. Consensus price target of $285 at Outperform. Stock currently around $251\n* Qorvo (QRVO) with a host of target raises. Consensus price target around $200 at Outperform. Stock currently around $175\n* SolarEdge (SEDG) target raised by Roth Capital from $280 to $340 at Buy. Stock currently around $307\n\n“The future depends on what we do in the present” - Mahatma Gandhi",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, February 4, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/lcqp7v/here_is_a_market_recap_for_today_thursday/",
        "created": 1612502970.0
    },
    {
        "author": "JaytotheEnny",
        "created_utc": 1613762830,
        "id": "lno8kc",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I heard about all of the hedge funds working really, really hard on building these trackers that crawl through all of our posts looking for the next big hit. I feel so bad for those little-widdle hedgie funds and wanted to put together a great list for them. \n\n MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JAP, JAP, JAP JAP, JAP JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TATE, TATE, TATE, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Here are some stocks that I like- for all those trackers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lno8kc/here_are_some_stocks_that_i_like_for_all_those/",
        "created": 1613791630.0
    },
    {
        "author": "Agitated-Cover9855",
        "created_utc": 1612402235,
        "id": "lc420l",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "March 31st commercialization of Truforma. ZOMmedica is going to be huge. In bed with QRVO. Sky's the limit on this one.",
        "url": "https://i.redd.it/a8y70as56df61.jpg",
        "created": 1612431035.0
    },
    {
        "author": "bayareabiotech",
        "created_utc": 1613074251,
        "id": "lhthdt",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "WDC and QRVO, long term and why",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lhthdt/wdc_and_qrvo_long_term_and_why/",
        "created": 1613103051.0
    },
    {
        "author": "Stock4me",
        "created_utc": 1612375975,
        "id": "lbtzvj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "QRVO",
        "url": "https://www.reddit.com/r/StockMarket/comments/lbtzvj/qrvo/",
        "created": 1612404775.0
    },
    {
        "author": "No_Comment_Neeeded",
        "created_utc": 1612272706,
        "id": "lavi6b",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Check out their website first - erosstx dotcom.\n\nEros STX Global Corporation, (“ErosSTX” or “The Company”) (NYSE: ESGC) beginning of Dirty Dishes - looking to further discussion. This is what I found. A lot of it is quotes from websites, can not confirm everything through filings. I have maintained a small position since mid january. I see a small around of risk for a potentially large reward. Not much information is available, this is what I have uncovered:\n\nShort: Streaming Service available on Amazon, Apple TV, Etc. They own rights to 90,000 films right for streaming. Release award winning content. Customers in over fourty countries. Over 37 million paid subs as of November 2020.\n\nYou’ve seen their product. Movies include 21 Bridges, Adrift, Bad Momos, Free state of jones, Hustlers, I Feel Pretty, Mile 22, Hustlers, Molly’s Game, Playmobil, Second Act, The Gift, The Space Between Us, and 90,000 more.\n\nThey are in production for products for Amazon, Netflix, USA, FX, etc.\n\nLargest streaming library in Indian languages. - twice the size of Disney.\n\nWorking with A listers on theatrical level blockbuster films - Kristen Stewart in Diana, Jason Statham in Guy Ritchie thriller.\n\nSongbird moved to Top 3 in Amazon Top Vod. Greenland at #5. Greenland is at #1 in Vudu and Fandango Now. No 8 in Apple Itunes,no 10 at Google Play. Both are doing extraordinary businesses. Give us some updated numbers damn!!!!!!\n\nGreenland is in number 1 position in Vudu's top Paid Video On Demand after 6 weeks also. Total ratings in Vudu crossed 41K.\n\nHigh February call volume indicating a probable move north of $2.50 in the next couple of weeks.\n\nNetflix worth 1000.00 per sub and we are currently at 30.00. EROS charges a fraction of what Neftlix does.\n\nA Major holder completed selling 4.3 million shares per an agreement between Creative Artist Agency and Writers Guild of America - that downward pressure has been removed. … Schedule 13D On January 19, 2021, the TPG Funds sold an aggregate of 750,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0582 in multiple transactions at prices ranging from $2.02 to $2.125, inclusive. On January 20, 2021, the TPG Funds sold an aggregate of 750,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.027 in multiple transactions at prices ranging from $2.01 to $2.095, inclusive. On January 21, 2021, the TPG Funds sold an aggregate of 850,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0559 in multiple transactions at prices ranging from $2.02 to $2.09, inclusive. On January 22, 2021, the TPG Funds sold an aggregate of 515,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0258 in multiple transactions at prices ranging from $2.00 to $2.08, inclusive. On January 25, 2021, the TPG Funds sold an aggregate of 750,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0605 in multiple transactions at prices ranging from $2.04 to $2.12, inclusive. On January 26, 2021, the TPG Funds sold an aggregate of 700,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0573 in multiple transactions at prices ranging from $2.02 to $2.14, inclusive. The Reporting Persons undertake to provide to the Issuer, any security holder of the Issuer, or the staff of the Commission, upon request, full information regarding the number of shares sold at each separate price within the range of each of the sales above that involved multiple transactions.” They now own 70,020,295 shares.\n\n**MOI Global Fund Manager Naveen Jeereddi at Best Ideas 2021 presentation recently Leaked -** Hedge fund manager presentation on opportunity for ErosSTX to go 3-5x higher. Low risk, high reward at current price. Highly manipulated to ride through and add on dips. About leaker (Bax28 Post), 1. Jareeddi has 7M shares with 2/3 of those pre STX merger - we all knew this 2. His listed SP is 2.68 avg 3. Presentation was to potential/current investors in his firm 4. He has an obligation to explain the firms high position in ESGC given it is currently a losing position despite a record bull market 5. He has had Hollywood connections for years - married to B list actress. In leaked video at 30:34 in video Jeereddi estimates $4-6 per share in 12-18 months, $6-8 in 2 years, and $10-15 in 3+ yrs. (Sid1988 post) summary from the Jerradi leak: 1. Management is probably in restricted period to buy more shares as per Bob to Naveen. 2. Still 40mn options as per incentive is going to add or in process to various board members as the part of merger and hence intentional price suppression. 3. 40mn subscribers (probably) by now and targeting 50mn paid subscribers by 2022 end 4. Possible 50-100mn content deal between Apple and Eros (just a hint, speculative) 5. Net debt will be 325mn usd by end of 2021 March. Indian debt will be transferred to US credit facility. 6. STX will release 8 films a year. Total 5 scripted and 6 non scripted series are in production with collaboration with Amazon, Netflix, HBO. At 42:25 Naveen was smiling to say Apple has lot of incentive if they want to acquire Eros and enter to the Indian market... this guy has almost 6% stake on our company and knows everything.\n\nAs previously announced, the Company intends to issue, pending Board approval, an additional 40 million A ordinary shares in management plan equity awards. - Slight increase in outstanding shares expected.\n\nSID1988 Post - Greenland total revenue breakdown: 100mn USD. Worldwide box office: $50-51mn PVOD box office: $13-15mn HBO deal: $25mn Amazon deal: $6-9mn Total: 100mn Budget: $35mn Profit: Over $30mn Blockbuster.\n\nSid1988 post - 40mn shares will be added in form of options packages to the board as incentives. Probably already started. And that will probably be done in money that means they will immediately sell to market. Which is what probably we are seeing the large DP shorting and those block trades. So basically it is in semi-dilution phase (already know infor on the 40mn option package). After that is cleared they will start pumping it out with all the news and investor day.\n\nInvestor day will be sometime in Q1 of 2021\n\nLast Wed, Thur and Fri was the biggest volume days we've seen since merger.\n\nCompany over $250 million revenue, targeting over 1 billion by 2023.\n\nAround 20 percent of this stock is shorted right now.\n\nProfile: Eros STX Global Corporation, (“ErosSTX” or “The Company”) (NYSE: ESGC) is a global entertainment company that acquires, co-produces and distributes films, digital content &amp; music across multiple formats such as theatrical, television and OTT digital media streaming to consumers around the world. Eros International Plc changed its name to Eros STX Global Corporation pursuant to the July 2020 merger with STX Entertainment, merging two international media and entertainment groups. The combination of one of the largest Indian OTT players and premier studio with one of Hollywood’s fastest-growing independent media companies has created an entertainment powerhouse with a presence in over 150 countries. ErosSTX delivers star-driven premium feature film and episodic content across a multitude of platforms at the intersection of the world’s most dynamic and fastest-growing global markets, including US, India, Middle East, Asia and China. The Company also owns the rapidly growing OTT platform Eros Now which has rights to over 12,000 films across Hindi and regional languages and had 211.5 million registered users and 36.2 million paying subscribers as of September 30th, 2020.\n\nYahoo News since last filing: \n\n1. December 11th, Eros Now Announces its Biggest Content Slate\n2. 20 Days Ago, Hosted Abu Dhabi T10 tournament, now official team sponsor of Team Abu Dhabi\n3. Eros Now Select available through Apple TV in 11 new Countries\n4. Horizon Line premiering on EPIX\n5. Reached 36.2 Million Subs (2 months ago)\n\nPotential Catalysts: Subscription growth and revenue per sub. PVOD results. New film releases. PR and ER from management.\n\nWhat do you guys think? Is this Rocket Worthy? The first post I saw on reddit was bashed heavily, mention toxic financing (which I cannot find) from merger of two companies a year ago. Seems there are a few bitter people who lost money or are bagholders. \n\nCrossposting to a few sites I belong to. Will update on any major findings...",
        "subreddit": "Wallstreetbetsnew",
        "title": "esgc dd",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lavi6b/esgc_dd/",
        "created": 1612301506.0
    },
    {
        "author": "No_Comment_Neeeded",
        "created_utc": 1612272445,
        "id": "lavfbl",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Eros STX Global Corporation (NYSE: ESGC) Dirty Dished",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lavfbl/eros_stx_global_corporation_nyse_esgc_dirty_dished/",
        "created": 1612301245.0
    },
    {
        "author": "No_Comment_Neeeded",
        "created_utc": 1612272516,
        "id": "lavg2i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "Eros STX Global Corporation - ESGC Dirty Dishes",
        "url": "https://www.reddit.com/r/pennystocks/comments/lavg2i/eros_stx_global_corporation_esgc_dirty_dishes/",
        "created": 1612301316.0
    },
    {
        "author": "No_Comment_Neeeded",
        "created_utc": 1612272598,
        "id": "lavgwo",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Eros STX Global Corporation - ESGC Dirty Dishes",
        "url": "https://www.reddit.com/r/stocks/comments/lavgwo/eros_stx_global_corporation_esgc_dirty_dishes/",
        "created": 1612301398.0
    },
    {
        "author": "griffin863",
        "created_utc": 1612295784,
        "id": "lb4s0y",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "ESGC - Eros STX DD",
        "url": "https://www.reddit.com/r/pennystocks/comments/lb4s0y/esgc_eros_stx_dd/",
        "created": 1612324584.0
    },
    {
        "author": "No_Comment_Neeeded",
        "created_utc": 1612272706,
        "id": "lavi6b",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Check out their website first - erosstx dotcom.\n\nEros STX Global Corporation, (“ErosSTX” or “The Company”) (NYSE: ESGC) beginning of Dirty Dishes - looking to further discussion. This is what I found. A lot of it is quotes from websites, can not confirm everything through filings. I have maintained a small position since mid january. I see a small around of risk for a potentially large reward. Not much information is available, this is what I have uncovered:\n\nShort: Streaming Service available on Amazon, Apple TV, Etc. They own rights to 90,000 films right for streaming. Release award winning content. Customers in over fourty countries. Over 37 million paid subs as of November 2020.\n\nYou’ve seen their product. Movies include 21 Bridges, Adrift, Bad Momos, Free state of jones, Hustlers, I Feel Pretty, Mile 22, Hustlers, Molly’s Game, Playmobil, Second Act, The Gift, The Space Between Us, and 90,000 more.\n\nThey are in production for products for Amazon, Netflix, USA, FX, etc.\n\nLargest streaming library in Indian languages. - twice the size of Disney.\n\nWorking with A listers on theatrical level blockbuster films - Kristen Stewart in Diana, Jason Statham in Guy Ritchie thriller.\n\nSongbird moved to Top 3 in Amazon Top Vod. Greenland at #5. Greenland is at #1 in Vudu and Fandango Now. No 8 in Apple Itunes,no 10 at Google Play. Both are doing extraordinary businesses. Give us some updated numbers damn!!!!!!\n\nGreenland is in number 1 position in Vudu's top Paid Video On Demand after 6 weeks also. Total ratings in Vudu crossed 41K.\n\nHigh February call volume indicating a probable move north of $2.50 in the next couple of weeks.\n\nNetflix worth 1000.00 per sub and we are currently at 30.00. EROS charges a fraction of what Neftlix does.\n\nA Major holder completed selling 4.3 million shares per an agreement between Creative Artist Agency and Writers Guild of America - that downward pressure has been removed. … Schedule 13D On January 19, 2021, the TPG Funds sold an aggregate of 750,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0582 in multiple transactions at prices ranging from $2.02 to $2.125, inclusive. On January 20, 2021, the TPG Funds sold an aggregate of 750,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.027 in multiple transactions at prices ranging from $2.01 to $2.095, inclusive. On January 21, 2021, the TPG Funds sold an aggregate of 850,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0559 in multiple transactions at prices ranging from $2.02 to $2.09, inclusive. On January 22, 2021, the TPG Funds sold an aggregate of 515,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0258 in multiple transactions at prices ranging from $2.00 to $2.08, inclusive. On January 25, 2021, the TPG Funds sold an aggregate of 750,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0605 in multiple transactions at prices ranging from $2.04 to $2.12, inclusive. On January 26, 2021, the TPG Funds sold an aggregate of 700,000 A Ordinary Shares in open market sales at a weighted average price per share of $2.0573 in multiple transactions at prices ranging from $2.02 to $2.14, inclusive. The Reporting Persons undertake to provide to the Issuer, any security holder of the Issuer, or the staff of the Commission, upon request, full information regarding the number of shares sold at each separate price within the range of each of the sales above that involved multiple transactions.” They now own 70,020,295 shares.\n\n**MOI Global Fund Manager Naveen Jeereddi at Best Ideas 2021 presentation recently Leaked -** Hedge fund manager presentation on opportunity for ErosSTX to go 3-5x higher. Low risk, high reward at current price. Highly manipulated to ride through and add on dips. About leaker (Bax28 Post), 1. Jareeddi has 7M shares with 2/3 of those pre STX merger - we all knew this 2. His listed SP is 2.68 avg 3. Presentation was to potential/current investors in his firm 4. He has an obligation to explain the firms high position in ESGC given it is currently a losing position despite a record bull market 5. He has had Hollywood connections for years - married to B list actress. In leaked video at 30:34 in video Jeereddi estimates $4-6 per share in 12-18 months, $6-8 in 2 years, and $10-15 in 3+ yrs. (Sid1988 post) summary from the Jerradi leak: 1. Management is probably in restricted period to buy more shares as per Bob to Naveen. 2. Still 40mn options as per incentive is going to add or in process to various board members as the part of merger and hence intentional price suppression. 3. 40mn subscribers (probably) by now and targeting 50mn paid subscribers by 2022 end 4. Possible 50-100mn content deal between Apple and Eros (just a hint, speculative) 5. Net debt will be 325mn usd by end of 2021 March. Indian debt will be transferred to US credit facility. 6. STX will release 8 films a year. Total 5 scripted and 6 non scripted series are in production with collaboration with Amazon, Netflix, HBO. At 42:25 Naveen was smiling to say Apple has lot of incentive if they want to acquire Eros and enter to the Indian market... this guy has almost 6% stake on our company and knows everything.\n\nAs previously announced, the Company intends to issue, pending Board approval, an additional 40 million A ordinary shares in management plan equity awards. - Slight increase in outstanding shares expected.\n\nSID1988 Post - Greenland total revenue breakdown: 100mn USD. Worldwide box office: $50-51mn PVOD box office: $13-15mn HBO deal: $25mn Amazon deal: $6-9mn Total: 100mn Budget: $35mn Profit: Over $30mn Blockbuster.\n\nSid1988 post - 40mn shares will be added in form of options packages to the board as incentives. Probably already started. And that will probably be done in money that means they will immediately sell to market. Which is what probably we are seeing the large DP shorting and those block trades. So basically it is in semi-dilution phase (already know infor on the 40mn option package). After that is cleared they will start pumping it out with all the news and investor day.\n\nInvestor day will be sometime in Q1 of 2021\n\nLast Wed, Thur and Fri was the biggest volume days we've seen since merger.\n\nCompany over $250 million revenue, targeting over 1 billion by 2023.\n\nAround 20 percent of this stock is shorted right now.\n\nProfile: Eros STX Global Corporation, (“ErosSTX” or “The Company”) (NYSE: ESGC) is a global entertainment company that acquires, co-produces and distributes films, digital content &amp; music across multiple formats such as theatrical, television and OTT digital media streaming to consumers around the world. Eros International Plc changed its name to Eros STX Global Corporation pursuant to the July 2020 merger with STX Entertainment, merging two international media and entertainment groups. The combination of one of the largest Indian OTT players and premier studio with one of Hollywood’s fastest-growing independent media companies has created an entertainment powerhouse with a presence in over 150 countries. ErosSTX delivers star-driven premium feature film and episodic content across a multitude of platforms at the intersection of the world’s most dynamic and fastest-growing global markets, including US, India, Middle East, Asia and China. The Company also owns the rapidly growing OTT platform Eros Now which has rights to over 12,000 films across Hindi and regional languages and had 211.5 million registered users and 36.2 million paying subscribers as of September 30th, 2020.\n\nYahoo News since last filing: \n\n1. December 11th, Eros Now Announces its Biggest Content Slate\n2. 20 Days Ago, Hosted Abu Dhabi T10 tournament, now official team sponsor of Team Abu Dhabi\n3. Eros Now Select available through Apple TV in 11 new Countries\n4. Horizon Line premiering on EPIX\n5. Reached 36.2 Million Subs (2 months ago)\n\nPotential Catalysts: Subscription growth and revenue per sub. PVOD results. New film releases. PR and ER from management.\n\nWhat do you guys think? Is this Rocket Worthy? The first post I saw on reddit was bashed heavily, mention toxic financing (which I cannot find) from merger of two companies a year ago. Seems there are a few bitter people who lost money or are bagholders. \n\nCrossposting to a few sites I belong to. Will update on any major findings...",
        "subreddit": "Wallstreetbetsnew",
        "title": "esgc dd",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lavi6b/esgc_dd/",
        "created": 1612301506.0
    },
    {
        "author": "No_Comment_Neeeded",
        "created_utc": 1612272445,
        "id": "lavfbl",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Eros STX Global Corporation (NYSE: ESGC) Dirty Dished",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lavfbl/eros_stx_global_corporation_nyse_esgc_dirty_dished/",
        "created": 1612301245.0
    },
    {
        "author": "No_Comment_Neeeded",
        "created_utc": 1612272516,
        "id": "lavg2i",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "pennystocks",
        "title": "Eros STX Global Corporation - ESGC Dirty Dishes",
        "url": "https://www.reddit.com/r/pennystocks/comments/lavg2i/eros_stx_global_corporation_esgc_dirty_dishes/",
        "created": 1612301316.0
    },
    {
        "author": "No_Comment_Neeeded",
        "created_utc": 1612272598,
        "id": "lavgwo",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Eros STX Global Corporation - ESGC Dirty Dishes",
        "url": "https://www.reddit.com/r/stocks/comments/lavgwo/eros_stx_global_corporation_esgc_dirty_dishes/",
        "created": 1612301398.0
    },
    {
        "author": "junglehuck",
        "created_utc": 1613749766,
        "id": "lnj00p",
        "num_comments": 723,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part.  I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth.  So, feel free to add to this list but here are stocks I like - both long and short.\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "stocks I like - for the hedge funds buying tech to track this",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnj00p/stocks_i_like_for_the_hedge_funds_buying_tech_to/",
        "created": 1613778566.0
    },
    {
        "author": "Govanator12",
        "created_utc": 1613142453,
        "id": "licv27",
        "num_comments": 257,
        "num_crossposts": 0,
        "selftext": "I'm already bought in in small amounts to $AMD $LRCX $TSM $NVDA and $SWKS.\n\nAssuming Biden goes forward with semiconductor benefits for American companies (which is looking more and more likely) what are the plays here?\n\nI assume AMD, Lam, NVIDIA, and Skyworks will shoot up as they're all American and $TSM will take a little dive but stay strong long term. What other bets can I make on this? Ford? GE? GM?",
        "subreddit": "wallstreetbets",
        "title": "Semiconductor Plays",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/licv27/semiconductor_plays/",
        "created": 1613171253.0
    },
    {
        "author": "ASoftEngStudent",
        "created_utc": 1612256395,
        "id": "larhlw",
        "num_comments": 129,
        "num_crossposts": 0,
        "selftext": "This will be a quick DDDD (Data-Driven DD) because it's late and pretty much every WSB post today has been about it. To catch up, [read this post that inspired by investigation](https://www.reddit.com/r/wallstreetbets/comments/lak773/why_were_still_winning_and_why_were_still_going/) and this post that I this does a very good job explaining [the theory](https://www.reddit.com/user/bcRIPster/comments/labq6u/follow_the_crumbs_gme_exposed_the_meta/). Basically, a lot of people here believe that institutions have been naked short selling GME, effectively creating fake or \"counterfeit\" GME stock, and it's there's some systematic fraud going on.\n\nMuch of the discussion has been centered around the [Failure to Deliver data released](https://www.sec.gov/data/foiadocsfailsdatahtm) by the SEC for the first half of Jan. A Failure to Deliver is reported when a broker is unable to deliver a share that they have sold to the clearing house by the settlement date (2 days after the transaction); [see my DDDD discussing what how this all works if you're curious](https://www.reddit.com/r/wallstreetbets/comments/l9sh9e/dddd_why_gme_might_next_week_and_how_it_could/). This can happen for many reason, and in the [examples given by the SEC](https://www.sec.gov/investor/pubs/regsho.htm) includes delays if people are physically delivering share certificates for some reason, and market makers (eg. Citadel) legally selling shares to a buyer without an actual seller (i.e. naked short sale) to provide liquidity; they just need to make sure they're able to later source that share quickly after it. Looks like the theory floating around r/wallstreetbets today is that non-market makers are illegally naked short selling GME, which is the topic of investigation for today.\n\nOne thing I've noticed that's been missing from many of these discussions is a proper analysis of the SEC-provided data on the Failure to Deliver numbers, so I decided to add this to help y'all make some informed decisions.\n\n*Disclaimer - This is not financial advice, and a lot of the content below is my personal opinion and for ENTERTAINMENT PURPOSES ONLY. In fact, the numbers, facts, or explanations presented below could be wrong and be made up and with some satire thrown in. Don't buy random options because some person on the internet says so. Do your own research and come to your own conclusions on what you should do with your own money, and how levered you want to be based on your personal risk tolerance.*\n\n**Methodology**\n\nI'm going to analyze this data using a script to look at a rough transactional value and approximate percentage of volume that the failure-to-deliver shares represent. Now, **these are all rough and kind of inaccurate especially for low-volume tickers** because the SEC data is based on the total number of outstanding failure-to-deliver shares for a particular settlement date. This means that\n\n1. Since you can have the same share being failed to deliver multiple days in a row, shares in these situations will be counted multiple times in all the data shown below.\n2. The earliest possible date shares in a trade can be counted as failed to be delivered is 3 trading days after the transaction occurred, so **literally none of the failure-to-deliver shares represents that day's volume**. However, I'm going to make an assumption that a day's volume will be in the same ball park as the volume from 3 days ago, so it should give a rough estimate. There are quite a few cases, especially with small-caps, where this is clearly not the case, and you will see many cases with a 100+% failure to deliver / volume results for this reason.\n3. The dollar value itself is wrong because it's using the price at settlement date, not the transaction date\n\nHowever, with these caveats, the purpose is to compare GME with other stocks to see if anything stands out using these metrics, using things like dollar value and volume rather than the raw number of shares to normalize the data.\n\n**The Code**\n\n    from collections import defaultdict\n    import time\n    import requests\n    POLYGON_API_KEY = '&lt;ADD YOUR API KEY HERE&gt;'\n    VOLUME_DATA_API_URL = 'https://api.polygon.io/v1/open-close/{}/2021-01-{}?unadjusted=true&amp;apiKey=' + POLYGON_API_KEY\n    \n    data\n    dates_to_stocks = defaultdict(lambda: defaultdict(float))\n    f = open('fail_to_delivers.txt', 'r') # https://www.sec.gov/data/foiadocsfailsdatahtm\n    for line in f:\n        parts = line.split('|');\n        date = parts[0]\n        ticker = parts[2]\n        try:\n            fails = int(parts[3])\n            price = float(parts[5])\n            value_of_fails = price * fails\n            dates_to_stocks[date][ticker] = (value_of_fails, fails)\n        except ValueError:\n            # fails or price was not a number; probably not traded (eg.'.')\n            pass\n    \n    for date, stocks in dates_to_stocks.items():\n        day = int(date[-2:])\n        print('Data for Jan {}'.format(day))\n        sorted_stocks = sorted(stocks.items(), key = lambda stock: stock[1][0])\n        sorted_stocks = filter(lambda stock: stock[1][0] &gt; 10000000, sorted_stocks)\n        for ticker, data in sorted_stocks:\n            val_of_fails = data[0]\n            num_fails = data[1]\n            req = requests.get(url=VOLUME_DATA_API_URL.format(ticker, str(day).zfill(2)))\n            res = req.json()\n            if res['status'] == 'NOT_FOUND':\n                print('No volume data for {}'.format(ticker))\n                continue\n            else:\n                try:\n                    volume = res['volume']\n                except KeyError:\n                    print(res)\n            val_of_fails_in_mill = int(val_of_fails / 1000000)\n            pct_vol = num_fails / volume * 100\n            print('{: &lt;6} ${: &lt;5} {: &lt;9} / {: &lt; 12} {:.2f}% of vol'.format(ticker, str(val_of_fails_in_mill) + 'M', num_fails, volume, pct_vol))\n\nHere's some code I hacked together myself. If anyone sees a bug please let me know and I'll re-calculate all this data, but otherwise you can try this yourself at home to crunch the data yourself after getting a Polygon API key, although you might need additional code to slow down the API requests since the free plan has a rate limit.\n\nIf everything above sounded gibberish to you, this code basically does all the calculations I mentioned above by reading the SEC data where the dollar value &gt; 10M and pulling volume for the day from a third party source.\n\n**The Results**\n\n    Data for Jan 4\n    RMO    $10M   455173    /  10652863    4.27% of vol\n    MP     $10M   338162    /  6012707     5.62% of vol\n    FTSL   $10M   229967    /  466929      49.25% of vol\n    TLT    $11M   73387     /  13491163    0.54% of vol\n    IFF    $11M   106670    /  5109099     2.09% of vol\n    WISH   $11M   651998    /  5947771     10.96% of vol\n    FXH    $12M   115701    /  145029      79.78% of vol\n    BIL    $13M   143387    /  1622120     8.84% of vol\n    BAR    $13M   704752    /  781989      90.12% of vol\n    SCHV   $17M   289146    /  569321      50.79% of vol\n    SFIX   $17M   301939    /  3246553     9.30% of vol\n    HEI    $18M   136300    /  431605      31.58% of vol\n    GP     $18M   632561    /  1922269     32.91% of vol\n    No volume data for IDEXY\n    SPY    $34M   92018     /  110471187   0.08% of vol\n    BABA   $34M   149800    /  25442439    0.59% of vol\n    BLNK   $54M   1271703   /  12417199    10.24% of vol\n    ZM     $55M   164629    /  8708714     1.89% of vol\n    LMND   $79M   650602    /  3774902     17.23% of vol\n    QS     $88M   1043660   /  85437068    1.22% of vol\n    FUBO   $179M  6405264   /  62558258    10.24% of vol\n    Data for Jan 5\n    SFIX   $10M   179535    /  3944760     4.55% of vol\n    ICLN   $10M   373174    /  10835646    3.44% of vol\n    SDC    $10M   934087    /  3951354     23.64% of vol\n    EEM    $10M   210387    /  53418852    0.39% of vol\n    BTAQ   $11M   1109124   /  859406      129.06% of vol\n    AAPL   $12M   95768     /  99232528    0.10% of vol\n    VV     $12M   73006     /  235701      30.97% of vol\n    IGV    $13M   40170     /  760975      5.28% of vol\n    XOP    $14M   240140    /  16129522    1.49% of vol\n    SMH    $14M   64946     /  2349313     2.76% of vol\n    PLTR   $15M   673714    /  29467572    2.29% of vol\n    FUBO   $15M   655567    /  76536531    0.86% of vol\n    IFF    $16M   160881    /  5671482     2.84% of vol\n    BAR    $17M   899469    /  715769      125.66% of vol\n    SNAP   $17M   352312    /  8937007     3.94% of vol\n    LAZR   $18M   575224    /  6835344     8.42% of vol\n    VXF    $18M   112351    /  441366      25.46% of vol\n    HYG    $18M   212911    /  33750660    0.63% of vol\n    SPY    $19M   52889     /  66529182    0.08% of vol\n    BYND   $22M   180249    /  2403615     7.50% of vol\n    ARKK   $22M   181939    /  5517279     3.30% of vol\n    BLNK   $22M   606253    /  8782149     6.90% of vol\n    No volume data for IDEXY\n    Z      $30M   235000    /  2779229     8.46% of vol\n    BILI   $31M   336874    /  9865956     3.41% of vol\n    BBIN   $42M   773948    /  35024       2209.76% of vol\n    SCHZ   $52M   934935    /  862549      108.39% of vol\n    TSLA   $56M   77616     /  32777673    0.24% of vol\n    QS     $140M  2805374   /  56417324    4.97% of vol\n    Data for Jan 6\n    GP     $10M   338197    /  1378176     24.54% of vol\n    Z      $10M   76860     /  2922684     2.63% of vol\n    JDST   $10M   1268335   /  6758651     18.77% of vol\n    SPIB   $10M   291358    /  2240443     13.00% of vol\n    ARKQ   $10M   138595    /  1477357     9.38% of vol\n    TFJL   $10M   448635    /  5522        8124.50% of vol\n    BNGO   $11M   2278342   /  172777252   1.32% of vol\n    QQQM   $11M   88033     /  471996      18.65% of vol\n    ESGV   $11M   166952    /  624422      26.74% of vol\n    GOLD   $12M   505715    /  30821265    1.64% of vol\n    SUSA   $12M   156306    /  132390      118.06% of vol\n    TAN    $13M   123734    /  7412302     1.67% of vol\n    SCZ    $13M   190487    /  2809791     6.78% of vol\n    GME    $13M   772112    /  6112481     12.63% of vol\n    MSTB   $13M   505730    /  36969       1367.98% of vol\n    TAL    $13M   197705    /  3872569     5.11% of vol\n    DFAE   $13M   495805    /  61403       807.46% of vol\n    PHYS   $14M   922154    /  3068779     30.05% of vol\n    IWB    $15M   71351     /  1149399     6.21% of vol\n    KRE    $15M   303042    /  17777218    1.70% of vol\n    IFF    $15M   147942    /  5645878     2.62% of vol\n    SIL    $17M   349238    /  960831      36.35% of vol\n    PFF    $17M   461767    /  10192667    4.53% of vol\n    UNH    $20M   58203     /  6637558     0.88% of vol\n    LMND   $20M   167974    /  2289234     7.34% of vol\n    XSD    $21M   125829    /  236857      53.12% of vol\n    LIT    $23M   324752    /  4054249     8.01% of vol\n    SHOP   $25M   22567     /  1292830     1.75% of vol\n    VXF    $26M   158266    /  1016028     15.58% of vol\n    No volume data for IDEXY\n    QQQ    $30M   97537     /  54595372    0.18% of vol\n    ANET   $31M   110454    /  745824      14.81% of vol\n    TWLO   $32M   96364     /  1878942     5.13% of vol\n    IWO    $35M   124303    /  758017      16.40% of vol\n    ARKG   $38M   411583    /  6510878     6.32% of vol\n    DIS    $39M   222604    /  7660902     2.91% of vol\n    FUBO   $45M   1655636   /  37542985    4.41% of vol\n    JPM    $54M   435864    /  25246578    1.73% of vol\n    AAL    $57M   3738894   /  65261546    5.73% of vol\n    MDY    $61M   146659    /  2313346     6.34% of vol\n    VOO    $69M   204517    /  4875363     4.19% of vol\n    CZA    $71M   949307    /  10055       9441.14% of vol\n    IGV    $87M   250001    /  1560021     16.03% of vol\n    XBI    $120M  860356    /  6578153     13.08% of vol\n    QS     $139M  2336878   /  69830456    3.35% of vol\n    IVV    $160M  431722    /  4380359     9.86% of vol\n    Data for Jan 7\n    FPXI   $10M   144300    /  277414      52.02% of vol\n    ABCL   $10M   257989    /  998242      25.84% of vol\n    Z      $10M   76860     /  3208891     2.40% of vol\n    TWLO   $10M   32612     /  2080639     1.57% of vol\n    ZNGA   $10M   1134696   /  12840024    8.84% of vol\n    CHEK   $11M   7154179   /  23512387    30.43% of vol\n    CEO    $11M   124581    /  544921      22.86% of vol\n    ARKG   $11M   122197    /  6784236     1.80% of vol\n    SFIX   $11M   199138    /  2078188     9.58% of vol\n    MOO    $13M   161780    /  438052      36.93% of vol\n    JPM    $14M   109199    /  22360722    0.49% of vol\n    GME    $14M   799328    /  6195565     12.90% of vol\n    ESGV   $15M   214750    /  323435      66.40% of vol\n    SUSA   $16M   194155    /  547800      35.44% of vol\n    WMT    $16M   111153    /  6984597     1.59% of vol\n    PFF    $16M   443734    /  8849961     5.01% of vol\n    FEM    $18M   687869    /  145383      473.14% of vol\n    VTV    $18M   153510    /  3890983     3.95% of vol\n    EMQQ   $18M   294485    /  351449      83.79% of vol\n    VIG    $18M   133579    /  1444204     9.25% of vol\n    UNH    $19M   54570     /  3413867     1.60% of vol\n    ABEV   $19M   6460712   /  29035247    22.25% of vol\n    JNK    $21M   200732    /  7589803     2.64% of vol\n    ZM     $22M   65852     /  5702045     1.15% of vol\n    No volume data for IDEXY\n    IWM    $25M   125200    /  24438036    0.51% of vol\n    TDOC   $27M   132485    /  5957242     2.22% of vol\n    XLV    $31M   273094    /  12449811    2.19% of vol\n    AMAT   $31M   347709    /  8900351     3.91% of vol\n    ANET   $32M   113141    /  897675      12.60% of vol\n    AAPL   $34M   272530    /  111251301   0.24% of vol\n    IBB    $35M   232435    /  2757909     8.43% of vol\n    SCZ    $35M   506453    /  2423106     20.90% of vol\n    TAL    $39M   588989    /  4953466     11.89% of vol\n    LIT    $39M   568200    /  2699742     21.05% of vol\n    SLYV   $42M   600000    /  784366      76.49% of vol\n    MDYG   $43M   600000    /  361719      165.87% of vol\n    MSFT   $44M   208844    /  27957876    0.75% of vol\n    XBI    $49M   341925    /  4368284     7.83% of vol\n    QS     $53M   855908    /  39043118    2.19% of vol\n    IGV    $65M   192848    /  1111927     17.34% of vol\n    IWO    $75M   256293    /  542558      47.24% of vol\n    SPY    $82M   221390    /  69043996    0.32% of vol\n    FUBO   $85M   3144764   /  26265288    11.97% of vol\n    MDY    $92M   210989    /  1059600     19.91% of vol\n    LMND   $131M  1100360   /  6843096     16.08% of vol\n    No volume data for CRUU\n    QQQ    $262M  853202    /  30946247    2.76% of vol\n    Data for Jan 8\n    GME    $10M   555658    /  6529206     8.51% of vol\n    SAM    $10M   10122     /  64727       15.64% of vol\n    HSBC   $10M   362391    /  2122407     17.07% of vol\n    TWLO   $10M   28519     /  2165649     1.32% of vol\n    ZNGA   $10M   1058523   /  18612307    5.69% of vol\n    XSOE   $10M   257305    /  1284354     20.03% of vol\n    Z      $10M   76094     /  2436382     3.12% of vol\n    FNF    $11M   284083    /  1685307     16.86% of vol\n    FXI    $11M   246994    /  25366481    0.97% of vol\n    DXCM   $11M   30698     /  1290952     2.38% of vol\n    IWO    $12M   40025     /  379305      10.55% of vol\n    BILL   $12M   90614     /  1670688     5.42% of vol\n    BNGO   $12M   2489241   /  140354760   1.77% of vol\n    IAI    $12M   148122    /  28095       527.22% of vol\n    MEDP   $12M   91875     /  189656      48.44% of vol\n    EDOC   $12M   642212    /  257984      248.93% of vol\n    DRIV   $13M   517797    /  2177619     23.78% of vol\n    MXIM   $14M   152763    /  3687022     4.14% of vol\n    ANGL   $14M   449592    /  1178388     38.15% of vol\n    FEMB   $14M   398368    /  177232      224.77% of vol\n    AAP    $15M   90683     /  867553      10.45% of vol\n    ORA    $17M   153279    /  1270618     12.06% of vol\n    SFIX   $17M   303687    /  3136663     9.68% of vol\n    ABEV   $17M   5994417   /  27822035    21.55% of vol\n    MJ     $18M   1079848   /  3922150     27.53% of vol\n    TBT    $19M   1082527   /  3509092     30.85% of vol\n    AKICU  $19M   1869585   /  159822      1169.79% of vol\n    BYND   $21M   181587    /  4508501     4.03% of vol\n    SUB    $21M   203087    /  221214      91.81% of vol\n    LQD    $22M   166506    /  13375076    1.24% of vol\n    No volume data for IDEXY\n    AMC    $23M   11547981  /  39954025    28.90% of vol\n    SNOW   $27M   90756     /  9197063     0.99% of vol\n    ANET   $29M   98754     /  1112848     8.87% of vol\n    XLB    $30M   395911    /  8495838     4.66% of vol\n    TAL    $30M   475832    /  4625189     10.29% of vol\n    VPL    $31M   383850    /  769567      49.88% of vol\n    CLOV   $33M   2063128   /  15605154    13.22% of vol\n    SCHE   $34M   1094305   /  6271011     17.45% of vol\n    IBB    $36M   233035    /  4464357     5.22% of vol\n    BHP    $38M   527450    /  2798855     18.85% of vol\n    QQQ    $42M   133818    /  34700266    0.39% of vol\n    HHC    $43M   541031    /  501246      107.94% of vol\n    AZN    $44M   881208    /  11243137    7.84% of vol\n    VTI    $45M   229492    /  7663316     2.99% of vol\n    QS     $51M   835859    /  26235605    3.19% of vol\n    FUBO   $52M   1852827   /  20886121    8.87% of vol\n    AMAT   $53M   560863    /  9177334     6.11% of vol\n    VXF    $66M   388894    /  363270      107.05% of vol\n    JNK    $126M  1164476   /  7798093     14.93% of vol\n    IGV    $126M  363012    /  590515      61.47% of vol\n    ACWI   $129M  1398754   /  3736768     37.43% of vol\n    GNR    $167M  3432554   /  191541      1792.07% of vol\n    TAN    $177M  1458720   /  3981915     36.63% of vol\n    LMND   $181M  1192325   /  7598825     15.69% of vol\n    MDY    $260M  592088    /  992982      59.63% of vol\n    DVN    $342M  18426493  /  14024601    131.39% of vol\n    Data for Jan 11\n    VXX    $10M   615868    /  41311500    1.49% of vol\n    LIT    $10M   146194    /  1960712     7.46% of vol\n    BNGO   $10M   2223632   /  145967474   1.52% of vol\n    ZNGA   $10M   1056500   /  27875624    3.79% of vol\n    VSS    $10M   84361     /  235578      35.81% of vol\n    Z      $11M   76527     /  1669983     4.58% of vol\n    CRSP   $11M   58363     /  2742944     2.13% of vol\n    SOXX   $11M   28921     /  546088      5.30% of vol\n    TM     $11M   75693     /  341885      22.14% of vol\n    EDIT   $11M   129779    /  5099744     2.54% of vol\n    XBI    $11M   79255     /  3296760     2.40% of vol\n    EDOC   $12M   597446    /  1407725     42.44% of vol\n    SCHP   $12M   200279    /  1427144     14.03% of vol\n    GME    $12M   703110    /  15188257    4.63% of vol\n    EZU    $13M   283987    /  7103235     4.00% of vol\n    TLT    $13M   87524     /  8517178     1.03% of vol\n    AZN    $13M   260777    /  11826267    2.21% of vol\n    XSOE   $13M   319355    /  1291316     24.73% of vol\n    MSTR   $13M   25707     /  1496929     1.72% of vol\n    IAI    $13M   159892    /  59452       268.94% of vol\n    BHP    $14M   193457    /  2427915     7.97% of vol\n    NVDA   $14M   26951     /  13129807    0.21% of vol\n    IGV    $14M   41420     /  575795      7.19% of vol\n    ABB    $14M   489684    /  2267141     21.60% of vol\n    VV     $15M   86043     /  239841      35.88% of vol\n    HYS    $15M   157848    /  218379      72.28% of vol\n    SJNK   $15M   575836    /  2432751     23.67% of vol\n    RPRX   $16M   312400    /  3483830     8.97% of vol\n    SPIP   $16M   519650    /  840202      61.85% of vol\n    MARA   $16M   611878    /  94267180    0.65% of vol\n    FTFT   $16M   2137024   /  28583008    7.48% of vol\n    PLUG   $16M   305936    /  46587009    0.66% of vol\n    PLTR   $17M   684687    /  33011079    2.07% of vol\n    TAN    $18M   152211    /  3487804     4.36% of vol\n    No volume data for SPXSZZZZ\n    FNX    $19M   225556    /  25522       883.77% of vol\n    SLAB   $19M   146585    /  453094      32.35% of vol\n    ARKG   $20M   195329    /  5248643     3.72% of vol\n    ICLN   $21M   657002    /  13666311    4.81% of vol\n    MJ     $22M   1333420   /  3852411     34.61% of vol\n    No volume data for IDEXY\n    FUBO   $24M   906355    /  13276816    6.83% of vol\n    ROKU   $25M   62953     /  5887016     1.07% of vol\n    DNL    $25M   324139    /  24767       1308.75% of vol\n    TAL    $25M   380482    /  1975338     19.26% of vol\n    VXUS   $27M   443558    /  3730976     11.89% of vol\n    SUB    $28M   265462    /  188896      140.53% of vol\n    ABEV   $29M   9769323   /  18941617    51.58% of vol\n    ANET   $30M   100395    /  529749      18.95% of vol\n    TMO    $31M   60583     /  1694125     3.58% of vol\n    DD     $31M   380089    /  15582944    2.44% of vol\n    XLK    $40M   307169    /  8969809     3.42% of vol\n    JNK    $43M   401204    /  9011848     4.45% of vol\n    SPIB   $44M   1199313   /  1777332     67.48% of vol\n    QS     $47M   836176    /  19469271    4.29% of vol\n    M      $55M   4505779   /  14361407    31.37% of vol\n    EEM    $56M   1035795   /  40965351    2.53% of vol\n    TSLA   $89M   102030    /  60262217    0.17% of vol\n    SPY    $99M   260673    /  51385646    0.51% of vol\n    DVN    $115M  6396708   /  11074952    57.76% of vol\n    TME    $159M  7597588   /  23335979    32.56% of vol\n    QQQ    $195M  611648    /  33526327    1.82% of vol\n    SNOW   $451M  1503729   /  4580562     32.83% of vol\n    Data for Jan 12\n    JHMM   $10M   216426    /  238965      90.57% of vol\n    SIVB   $10M   24577     /  546261      4.50% of vol\n    EEMA   $10M   118409    /  113040      104.75% of vol\n    TIP    $10M   86938     /  3522835     2.47% of vol\n    BYND   $11M   94389     /  3294350     2.87% of vol\n    ACIA   $11M   135144    /  4810813     2.81% of vol\n    CDC    $11M   203290    /  60438       336.36% of vol\n    RGNX   $11M   234259    /  442580      52.93% of vol\n    QS     $11M   213000    /  51908268    0.41% of vol\n    XLU    $11M   192507    /  12329318    1.56% of vol\n    ENB    $12M   368137    /  6759556     5.45% of vol\n    FTFT   $12M   2311209   /  15419147    14.99% of vol\n    GOVT   $12M   470217    /  9110172     5.16% of vol\n    SOCL   $13M   207702    /  39866       521.00% of vol\n    XSOE   $13M   321206    /  774516      41.47% of vol\n    No volume data for KBCSY\n    SFIX   $13M   239777    /  5489995     4.37% of vol\n    PXD    $13M   103193    /  27013469    0.38% of vol\n    DRIV   $13M   529616    /  1199349     44.16% of vol\n    PLUG   $14M   260722    /  110733629   0.24% of vol\n    No volume data for CHL\n    No volume data for AMADY\n    SWKS   $14M   89872     /  1821632     4.93% of vol\n    JNK    $14M   134848    /  8531417     1.58% of vol\n    FUBO   $14M   539301    /  157218493   0.34% of vol\n    HYG    $14M   170507    /  41774036    0.41% of vol\n    USMV   $14M   218346    /  4136809     5.28% of vol\n    DIA    $15M   49808     /  2300371     2.17% of vol\n    SUB    $15M   146245    /  293345      49.85% of vol\n    SJNK   $15M   588370    /  4179598     14.08% of vol\n    PLTR   $17M   659322    /  54968620    1.20% of vol\n    NFRA   $17M   317321    /  123815      256.29% of vol\n    TSLA   $18M   22211     /  46768359    0.05% of vol\n    VTEB   $18M   328242    /  1326346     24.75% of vol\n    EZU    $18M   409157    /  9724870     4.21% of vol\n    LSI    $19M   163476    /  942907      17.34% of vol\n    AJAX   $19M   1647672   /  2626688     62.73% of vol\n    EDC    $20M   193869    /  163829      118.34% of vol\n    BLI    $20M   232710    /  519080      44.83% of vol\n    DASH   $21M   129338    /  14198812    0.91% of vol\n    IEF    $22M   187689    /  6569902     2.86% of vol\n    ASHR   $22M   536685    /  3394356     15.81% of vol\n    SMH    $24M   103959    /  3226970     3.22% of vol\n    TAL    $24M   367792    /  5291590     6.95% of vol\n    DNL    $25M   325232    /  25152       1293.07% of vol\n    ACCD   $26M   569052    /  668698      85.10% of vol\n    MXIM   $26M   280268    /  1990545     14.08% of vol\n    CRM    $26M   122621    /  21713794    0.56% of vol\n    KRE    $27M   478683    /  9601888     4.99% of vol\n    ANET   $28M   92939     /  1870397     4.97% of vol\n    VNQ    $33M   405838    /  7925021     5.12% of vol\n    MRVL   $35M   711824    /  6457737     11.02% of vol\n    MBB    $36M   333534    /  10549726    3.16% of vol\n    XLP    $39M   591884    /  11062255    5.35% of vol\n    SPMB   $42M   1607008   /  541977      296.51% of vol\n    IPOE   $50M   2656436   /  14469222    18.36% of vol\n    TMKRU  $87M   8457409   /  770303      1097.93% of vol\n    TWLO   $103M  287038    /  2545738     11.28% of vol\n    VEA    $289M  5978670   /  8073208     74.06% of vol\n    SNOW   $357M  1220616   /  6575982     18.56% of vol\n    Data for Jan 13\n    JHMM   $10M   212907    /  102491      207.73% of vol\n    ALNY   $10M   61864     /  2453711     2.52% of vol\n    SCHE   $10M   319745    /  1476711     21.65% of vol\n    LSI    $10M   92053     /  2524023     3.65% of vol\n    ACTC   $10M   426995    /  10590305    4.03% of vol\n    PFF    $10M   287062    /  7555964     3.80% of vol\n    GOOGL  $10M   6275      /  1182889     0.53% of vol\n    PXD    $11M   85102     /  6736818     1.26% of vol\n    No volume data for AMADY\n    LYV    $11M   158908    /  4368171     3.64% of vol\n    QS     $11M   206723    /  24774402    0.83% of vol\n    XLU    $11M   192500    /  13354398    1.44% of vol\n    VSGX   $12M   201319    /  226385      88.93% of vol\n    CDC    $12M   222430    /  40763       545.67% of vol\n    HYG    $12M   148273    /  47749801    0.31% of vol\n    GME    $13M   662524    /  288667273   0.23% of vol\n    AAXJ   $13M   143098    /  645277      22.18% of vol\n    MIC    $13M   465475    /  3217373     14.47% of vol\n    AI     $13M   103081    /  6413417     1.61% of vol\n    EEMA   $14M   157698    /  124024      127.15% of vol\n    VCR    $14M   51164     /  123801      41.33% of vol\n    FNGU   $14M   53279     /  292296      18.23% of vol\n    VPL    $14M   181814    /  387790      46.88% of vol\n    CREE   $15M   124749    /  1224481     10.19% of vol\n    ICLN   $15M   463906    /  9817667     4.73% of vol\n    BPY    $16M   960472    /  3544070     27.10% of vol\n    EWH    $16M   634086    /  4209409     15.06% of vol\n    No volume data for HOKCY\n    Z      $16M   115078    /  1848380     6.23% of vol\n    GS     $16M   56023     /  4904304     1.14% of vol\n    VXF    $17M   99541     /  952044      10.46% of vol\n    EWU    $17M   579075    /  2283375     25.36% of vol\n    BBBY   $19M   899486    /  19195438    4.69% of vol\n    CNQ    $20M   758170    /  6620696     11.45% of vol\n    TSLA   $21M   25242     /  33637855    0.08% of vol\n    RETL   $22M   178031    /  54044       329.42% of vol\n    PLTR   $22M   852932    /  103565952   0.82% of vol\n    BNTX   $24M   229376    /  1823779     12.58% of vol\n    FMS    $25M   594469    /  996987      59.63% of vol\n    SPG    $25M   293022    /  8669323     3.38% of vol\n    DNL    $25M   329444    /  17950       1835.34% of vol\n    TER    $27M   197090    /  1461976     13.48% of vol\n    MDY    $27M   62265     /  885141      7.03% of vol\n    SPY    $29M   78981     /  45604510    0.17% of vol\n    TMKRU  $29M   2895006   /  602858      480.21% of vol\n    LMND   $44M   257874    /  9253096     2.79% of vol\n    NIO    $46M   751947    /  233834179   0.32% of vol\n    ASHR   $58M   1345934   /  1977253     68.07% of vol\n    CCIV   $72M   5142902   /  185613695   2.77% of vol\n    SCHF   $84M   2261962   /  2374397     95.26% of vol\n    QQQ    $100M  319499    /  23459898    1.36% of vol\n    IEMG   $106M  1636832   /  24605232    6.65% of vol\n    TWLO   $155M  414331    /  2983315     13.89% of vol\n    SNOW   $292M  997932    /  5770968     17.29% of vol\n    Data for Jan 14\n    FUTU   $10M   147467    /  8267876     1.78% of vol\n    GLD    $10M   58911     /  13580504    0.43% of vol\n    RKT    $10M   529482    /  6065737     8.73% of vol\n    GOOG   $10M   6178      /  1190697     0.52% of vol\n    JKS    $11M   174686    /  3299317     5.29% of vol\n    NIO    $11M   179015    /  100212842   0.18% of vol\n    BBY    $11M   98786     /  2010214     4.91% of vol\n    ACWI   $11M   123023    /  4486363     2.74% of vol\n    IWM    $11M   54832     /  34126749    0.16% of vol\n    NARI   $11M   120313    /  727912      16.53% of vol\n    VIS    $11M   66167     /  156674      42.23% of vol\n    No volume data for CCIVU\n    BNDX   $12M   207005    /  2944006     7.03% of vol\n    ACTCW  $12M   1746528   /  1251451     139.56% of vol\n    ESGU   $12M   138711    /  18958336    0.73% of vol\n    TFI    $12M   234004    /  281979      82.99% of vol\n    ACI    $12M   718057    /  2853713     25.16% of vol\n    ESGV   $12M   178184    /  305336      58.36% of vol\n    VONV   $12M   104521    /  210425      49.67% of vol\n    QS     $13M   230667    /  13774941    1.67% of vol\n    BUG    $13M   477973    /  443386      107.80% of vol\n    TSJA   $13M   529310    /  10438       5070.99% of vol\n    EWU    $13M   446834    /  3298766     13.55% of vol\n    AAXJ   $13M   146519    /  1052459     13.92% of vol\n    ALLK   $14M   114451    /  239036      47.88% of vol\n    PLTR   $14M   549219    /  33345821    1.65% of vol\n    XBI    $14M   96793     /  6175075     1.57% of vol\n    IBM    $14M   118000    /  7620404     1.55% of vol\n    SPCE   $15M   566065    /  58849108    0.96% of vol\n    BNTX   $15M   152319    /  1928180     7.90% of vol\n    EWQ    $15M   460861    /  930296      49.54% of vol\n    INTC   $15M   275319    /  76137919    0.36% of vol\n    MUB    $15M   136460    /  1872076     7.29% of vol\n    IDYA   $16M   1070477   /  192964      554.75% of vol\n    SPDW   $17M   492928    /  1052552     46.83% of vol\n    MCK    $18M   98869     /  699468      14.13% of vol\n    BIL    $18M   202092    /  2021703     10.00% of vol\n    NOC    $18M   63242     /  1396814     4.53% of vol\n    GME    $19M   621483    /  94480858    0.66% of vol\n    FMS    $19M   469951    /  543332      86.49% of vol\n    AI     $20M   145990    /  3673395     3.97% of vol\n    TSLA   $22M   25886     /  31591648    0.08% of vol\n    RETL   $22M   179448    /  100796      178.03% of vol\n    ZM     $22M   62445     /  9410703     0.66% of vol\n    VGT    $23M   65705     /  443651      14.81% of vol\n    LMND   $24M   135997    /  15428353    0.88% of vol\n    LQD    $25M   185355    /  22077842    0.84% of vol\n    XLC    $25M   388611    /  2548053     15.25% of vol\n    SPY    $26M   68916     /  50152199    0.14% of vol\n    AZN    $28M   552409    /  11706274    4.72% of vol\n    FUBO   $28M   792423    /  33088152    2.39% of vol\n    TMKRU  $29M   2884289   /  64652       4461.25% of vol\n    JWN    $31M   851212    /  12049764    7.06% of vol\n    NCNO   $36M   532284    /  1354842     39.29% of vol\n    TTD    $38M   48618     /  644636      7.54% of vol\n    VIPS   $39M   1386042   /  6556018     21.14% of vol\n    MSOS   $43M   967278    /  1317363     73.43% of vol\n    AZRE   $49M   998097    /  220310      453.04% of vol\n    SMH    $55M   237195    /  3371846     7.03% of vol\n    RLAY   $64M   1535964   /  2605340     58.95% of vol\n    ASHR   $67M   1557492   /  2570496     60.59% of vol\n    ACTC   $80M   3508271   /  8994587     39.00% of vol\n    CCIV   $141M  8464902   /  142448106   5.94% of vol\n    IEMG   $515M  7881052   /  12504033    63.03% of vol\n\nI'll let y'all discuss what this means in the comments. Have Fun.\n\nEDIT - Someone pointed out a mistake in my script. Fixed, and added a bit more data\n\nEDIT 2 - For those without enough brain wrinkles / attention span to interpret this - There may have been shady shit in the first few days of Jan, but doesn't look like anything went on in the second week. Will need to wait till Feb 15 to see data in the last few weeks of Jan. I'll probably do some more analysis when that time comes",
        "subreddit": "wallstreetbets",
        "title": "DDDD - Is GME being Illegally Naked Short Sold?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/larhlw/dddd_is_gme_being_illegally_naked_short_sold/",
        "created": 1612285195.0
    },
    {
        "author": "Govanator12",
        "created_utc": 1613142505,
        "id": "licvpp",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "I'm already bought in in small amounts to $AMD $LRCX $TSM $NVDA and $SWKS.\n\nAssuming Biden goes forward with semiconductor benefits for American companies (which is looking more and more likely) what are the plays here?\n\nI assume AMD, Lam, NVIDIA, and Skyworks will shoot up as they're all American and $TSM will take a little dive but stay strong long term. What other bets can I make on this? Ford? GE? GM?",
        "subreddit": "stocks",
        "title": "Semiconductor Plays",
        "url": "https://www.reddit.com/r/stocks/comments/licvpp/semiconductor_plays/",
        "created": 1613171305.0
    },
    {
        "author": "ufos8mycat",
        "created_utc": 1613229342,
        "id": "lj2bdi",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Hey all, I'm very new to trading, had always  wanted to dive in but never really have the disposable income to do so.  \n\n\nI know it can be a risky move, especially for those who don't really have money to play with. But with apps like Robinhood making it a bit simpler to get into the game and buy/sell etc. I figured I'd finally try my luck.  \n\n\nNow I know there's some out there that can drop a few thousand into the market like it's nothing and move from there. However I'm not in that boat and so taking risky chances with what I do have to throw in on a chance that something will jump up is a harder decision for someone like me. At my current rate I figure I can throw in about $50 a week or so, and sometimes more depending on the money I have coming in.  \n\n\nI was wondering what some might think of the decisions I made, based on me assuming the companies I bought into being more 'safe bets' compared to some other options. The stocks I had bought, along with how much I put in (It will be added to and adjusted more evenly over time) are as follows:  \n\n\n**Skyworks (SWKS) - $5**  \n**Intel (INTC) - $5**  \n**Nvidia (NVDA) - $5**  \n**Microsoft (MSFT) - $5**  \n**Taiwan Semiconductor Manufacturing (TSM) - $30**  \n\n\nNvidia is the one I was most unsure on after buying it, but with what seems like everyone buying GPUs these days, along with a mining surge again, I figured it'd be an okay pick. Not necessarily looking for advice or any of that in the sense of making a bad investment based off of something someone may suggest. Just the thoughts on my choices and possibly adding more to these in the future.  \n\n\nOther options I had considered were Amazon, Apple, and Google. But was unsure on how they would react as the pandemic begins to disappear eventually.",
        "subreddit": "wallstreetbets",
        "title": "New to Trading",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lj2bdi/new_to_trading/",
        "created": 1613258142.0
    },
    {
        "author": "Kac985",
        "created_utc": 1613751320,
        "id": "lnjmb1",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "Fuck all the hedge funds keeping track of stocks mentioned on here",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnjmb1/fuck_all_the_hedge_funds_keeping_track_of_stocks/",
        "created": 1613780120.0
    },
    {
        "author": "hakimbomadadda",
        "created_utc": 1612389177,
        "id": "lbzdno",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "What are your guys’ picks for good growth stocks that will achieve good returns for the next five years?\n\nHere are mine so far:\n\nApple\n\nMSOS(etf, but it’s still a good buy)\n\nYOLO(also an ETF)\n\nSkyworks/QCOM\n\nUnity(I would wait till after earnings tomorrow before buying if you want to invest in this IMO, or DCA in)\n\nOnes I want to look into more:\n\nDraftKings- this is the top prospect for the next stock to add to my portfolio. \n\nShopify\n\nSquare\n\nI would love to hear what you guys have on your list!",
        "subreddit": "stocks",
        "title": "Top 5 Growth picks for the next five years",
        "url": "https://www.reddit.com/r/stocks/comments/lbzdno/top_5_growth_picks_for_the_next_five_years/",
        "created": 1612417977.0
    },
    {
        "author": "stee4vendetta",
        "created_utc": 1613546616,
        "id": "llor9h",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "With president Biden expected to sign the executive order to give the semiconductor industry a boost, there are several companies set to benefit from the cash injection:\n\nAMD, Analog Devices, Cree, GlobalFoundries, Intel, Lattice Semiconductor, Marvell Semiconductor, Maxim, Micron Technology, ON Semiconductor, Qorvo, Qualcomm, Silicon Labs, Skyworks, Texas Instruments, Western Digital, Xilinx and the SIA.\n\nA lot of these companies have very affordable stock and steady growth. Do with this information as you will.",
        "subreddit": "wallstreetbets",
        "title": "POTENTIAL EARNING ALERT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/llor9h/potential_earning_alert/",
        "created": 1613575416.0
    },
    {
        "author": "theagileagent",
        "created_utc": 1612231269,
        "id": "lakol2",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "Long time trader, first time poster, lol. Went on a bit of an options spree today. Would love to get your feedback:\n\n* **$FVRR** bought Feb 19 '21 210c at $20.86 - this is my strongest conviction trade and largest option position right now. Had previously sold Feb and Mar 200p and 210p. *Finally* started turning around today.\n* **$AMTX** bought Feb 19 '21 10c for $0.94 - closed at $1.05\n* **$EHTH** bought Mar 19 '21 85c for $1.30 - closed down at 0.90 and Feb 19 '21 65c for 1.10 also closed down at 0.90 but this should rebound in short order.\n* **$AMC** closed out most of my remaining Feb and Mar 15c and 3.5c respectively for around 1,000% on a small position.\n* **$BCRX** rolled a prior position into Mar 19 '21 10c for 2.53 (closed at 3.30), June '21 12c for 2.88 (closed at 3.45), and Sep '21 16c for 2.55 (closed at 3.00).\n* **$IRTC** added more to a position I began last week when the stock unexpectedly dropped 40% on medicare reimbursement rates that the company states strongly is merely an administrative error. So far it seems analysts are in general agreement, though some are holding their breath. Today I bought Mar '21 220c for 25.06 (closed at 30.60)\n* **$RIOT** believing that $BTC has about bottomed and will be comin' round the mountain soon, I bought some shares and Feb 05 '21 17c for 3.07 (closed at 3.55). Later in the day I added Feb 05 '21 16c for 4.20 (closed at 4.35) and 20.5c for 1.46 (closed at 1.35)\n* **$UNIT** discovering it as a high conviction trade from Michael Burry of \"The Big Short\" fame--and he was pretty right about $GME in a big way, was he not?--I bought a spread of Aug '21 15c for 1.00 (closed at 0.85) and Jan '22 15c at 1.55 (closed at 1.35) and Jan '22 20c for 0.65 (closed at 0.45).\n* **$NNOX** bought May '21 70c at 17.00 (closed at 17.50) and Aug '21 90c at 17.56 (closed at 30.50 - nice!)\n* **$FUBO** bought Apr '21 50c at 16.05 (closed at 17.30). This was an add to a prior stock and option position.\n* **$RDFN** added to my position here as well. Bought May '21 80c at 9.26 (closed at 9.70) and Aug '21 90c at 9.46 (closed at 10.00).\n* **$PCG** based on some unusual call option activity I noticed, I sold some Mar '21 11p and bought several different calls: Mar '21 12c, 14c; and Jun '21 13c, 15, and 17c. Probably spent too much on commissions here. Whatev. I'm learning the best strategies not just through learning and reviewing theory but also by experimenting with actual trades.\n* **$GME** \\- and this was my revenge trade. I lost a lot of money on this last week, buying shares on the way up then getting stopped out when IBKR halted my ability to do anything but close out. And close out I did at nearly 50% losses. Plus my whole portfolio suffered as brokers, funds and everyone else was liquidating to cover their shorts. In any case, I did a safe trade and a risky trade:\n\n1. Safe: sold Jan '22 25p for 10.00 and 10p for 2.55. Being so far out they haven't moved.. yet.\n2. Risky: bought Feb 05 '21 220p for 53.61 (closed at 52.00) and 190p for 38.59 (closed at 36.20).\n\nOther holdings (some stock, some options, some both):\n\n$TSLA $FVRR $FLGT $ARKK $ARKQ $ARKG $ARKW $SNDL $SOXL $SWKS $EXPI $VXRT $AMZN $PRNT $REGI $ETHE $IPO $LABU $AXON $NERD $TAN $SI $TTGT $SPCX $IPOF $QCLN $NOW $MGNI $SAVA $PENN $WKHS $PBW $SCYX $EDC $WPRT $BUG $ALT\n\nOpen to feedback, questions, your thoughts and insights. Trying to give back for all I've learned here and elsewhere. Cheers!",
        "subreddit": "options",
        "title": "My first post! Options trades initiated TODAY 2/1/21",
        "url": "https://www.reddit.com/r/options/comments/lakol2/my_first_post_options_trades_initiated_today_2121/",
        "created": 1612260069.0
    },
    {
        "author": "Filthy_Joey",
        "created_utc": 1612437923,
        "id": "lcdoee",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hey guys! I am quite new to stock market and trading so I’d like to ask you a question I tried to dig into but failed to find any reasoning. \n\nIs anyone here into Skyworks right now? Just recently I bought some SWKS stock and within days it experienced quite good growth as a result (as i understand) of some good reports. \n\nJust recently it fell quite hard, like 10%. And I do not understand why. I searched a lot of news and the only major thing that came up just at that time was some news about Stimulus in the US. But I failed to relate this news to this stock.. so my question is: what was the reason for such a drop? Is it that the stock was overpriced in the first place and it has something with fundamentals? \n\nI am sorry for such silly questions, I just want to understand what info am I missing and try to do better DD in the future.",
        "subreddit": "stocks",
        "title": "Novice’s question about SWKS",
        "url": "https://www.reddit.com/r/stocks/comments/lcdoee/novices_question_about_swks/",
        "created": 1612466723.0
    },
    {
        "author": "Starbuckwhatdoyahear",
        "created_utc": 1612236380,
        "id": "lam9ml",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Thoughts on Skyworks?\n\nAnyone have any thoughts on them? Supplier to Apple. They had a PT boost recently and a small jump today. But they seem poised to break above their resistance line at the moment. Trying to make myself feel better about recent losses.",
        "subreddit": "stocks",
        "title": "Thoughts on Skyworks?",
        "url": "https://www.reddit.com/r/stocks/comments/lam9ml/thoughts_on_skyworks/",
        "created": 1612265180.0
    },
    {
        "author": "balloonglue556",
        "created_utc": 1613754500,
        "id": "lnkxxm",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Just a lurker here but want to do my part. I read that some hedge funds are buying a service to track what stocks get mentioned here the most - I think as an apology for how this sub has been treating them, we owe it to them to get their money's worth. So, feel free to add to this list but here are \nstocks I like - both long and short. $COCK and $ASS are definitely the Vlad's favorite \n\nThanks u/junglehuck for the list of stocks I like a lot \n\n\nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "subreddit": "wallstreetbets",
        "title": "I like these stocks so much (SEC &amp; HEDGies plz do not look at this post)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lnkxxm/i_like_these_stocks_so_much_sec_hedgies_plz_do/",
        "created": 1613783300.0
    },
    {
        "author": "Starbuckwhatdoyahear",
        "created_utc": 1612236180,
        "id": "lam7fy",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Thoughts on Skyworks?",
        "url": "https://www.reddit.com/r/stocks/comments/lam7fy/thoughts_on_skyworks/",
        "created": 1612264980.0
    },
    {
        "author": "MA_Bloke",
        "created_utc": 1612457695,
        "id": "lck3s5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Ford needs semiconductors, skyworks solutions is a potential supplier. Keep an eye on this.",
        "url": "https://www.cnbc.com/2021/02/04/ford-forced-to-cut-pickup-production-due-to-semiconductor-shortage-.html",
        "created": 1612486495.0
    },
    {
        "author": "Special-Muscle-9357",
        "created_utc": 1612985427,
        "id": "lh1lg0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Skyworks Solutions, Inc. (SWKS) to present earnings tomorrow with Goldman Sachs at 2:30",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lh1lg0/skyworks_solutions_inc_swks_to_present_earnings/",
        "created": 1613014227.0
    },
    {
        "author": "Breezy__17",
        "created_utc": 1612454773,
        "id": "lcixsm",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "$SWKS has an amazing EPS and I think could double in the next year... fundamentals are making a comeback! I’m not a financial adviser just an ape opinion!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lcixsm/swks_has_an_amazing_eps_and_i_think_could_double/",
        "created": 1612483573.0
    },
    {
        "author": "Estri_Grobbulus",
        "created_utc": 1612197578,
        "id": "la7g07",
        "num_comments": 372,
        "num_crossposts": 0,
        "selftext": "Edit 1: More ARKQ buying today (~50k shares). Thank you everyone for the positive feedback and discussion! \n\nBottom Line Up Front (BLUF) or TL;DR for the non-military types:\n\nLMT is a good target if you want to literally go to the moon, and my PT is $690.26 in two years (more than 2x from current levels). Justification and some possible trade ideas are listed below, just CTRL-F “Trade Ideas”. I hope you guys enjoy this work and would appreciate any discussion or feedback. I hope to catch you in the comments.\n\nTeam,\n\nWe interrupt today’s regularly scheduled short squeeze coverage to discuss a traditionally boring stock, LMT (Lockheed Martin), with significant upside potential. To be clear, this is NOT a short squeeze target like many reddit posts are keying on. I hope that this piece sparks discussion, but if you are just looking for short squeeze content, all I have to say is BUY, HOLD, and GODSPEED.\n\nThe source of inspiration for me writing this piece is threefold; first, retail investors are winning, and I believe that we will continue to win if we continue to identify opportunities in the market. In my view, the stock market has always been a place for the public to shine a light on areas of innovation that real Americans are excited about and proud to be a part of. Online communities have stolen the loudspeaker from hedge fund managers and returned it to decentralized online democracies that quickly and proudly shift their weight behind ideas they believe in. In GME’s case, it was a blatant smear campaign to destroy a struggling business. I think that we should continue this campaign by identifying opportunities in the market and running with them. It may sound overly idealistic, but if reddit can take on the hedge funds, I non-ironically believe that we can quite literally take good companies researching space technology to the moon. I think LMT may be one of several stocks to help get us there.\n\nSecond, a video where the Secretary of State of Massachusetts argues that internet boards are full of a bunch of unsophisticated, thoughtless traders really ticked me off. This piece is designed to show that ‘the little guy’ is ready to get into the weeds, understand business plans, and outpace analysts that think companies like Tesla are overvalued by comparing them to Toyota. That is a big reason that I settled on an old, large, slow growth company to do a deep-dive on, and try my best to show some of the abysmal predictive analysis major ‘research firms’ do on even some of the most heavily covered stocks. LMT is making moves, and the suits on wall street are 10 steps behind. At the time of writing this piece, Analyst Estimates range from 330-460 (what an insane range).\n\nThird, and most importantly, I am in the US military, and I think that it is fun to go deep into the financials of the defense sector. I think that it helps me understand the long-term growth plans of the DoD, and I think that I attack these deep-dives with a perspective that a lot of these finance-from-day-one cats do not understand. Even if no one ever looks at this work, I think that taking the time to write pieces like this makes me a better Soldier, and I will continue to do it in my spare time when I am feeling inspired. I wrote a piece on Raytheon Technologies (Ticker: RTX) 6 months ago, and I think it was well-received. I was most convicted about RTX in the defense sector, but I have since shifted to believing LMT is the leader in the defense space. I am long both, though. If this inspires anyone else to do similar research on other companies, or sparks discussion in the community, that is just a bonus. Special shout-out to the folks that read more than just the TL;DR, but if you do just read the TL;DR, I love you too!\n\nNow let us get into it:\n\n**Leadership**\n\nI generally like to invest in companies that are led by people that seem to have integrity. Jim Taiclet took the reins at LMT in June of last year. While on active duty, he served as a C-141B Starlifter pilot (a retired LMT Aircraft). After getting out he went to work for the American Tower Corporation (Ticker: AMT). His first day at American Tower was September 10, 2001. The following day, AMT lost 13 employees in the World Trade Center attack. He stayed with the company, despite it being decimated by market uncertainty in the wake of 9/11. He was appointed CEO of the very same company in 2004. Over a 16 year tenure as CEO of AMT the company market cap 20x’d. He left his position as CEO of AMT in March of last year, and the stock stagnated since his departure, currently trading at roughly the same market cap as to when he left.\n\nJim Taiclet was also appointed to be the chairman of the board this week, replacing the previous CEO. Why is it relevant that the CEO came from a massive telecommunications company?\n\nRightfully, Taiclet’s focus for LMT is bringing military technology into the modern era. He wants LMT to be a first mover in the military 5G space, military application of AI space, the… space space, and the hypersonic glide vehicle (HGV) space. These areas are revolutionary for the boomer defense sector. We will discuss this in more detail later when we cover the company’s P/E multiple and why it is absolute nonsense.\n\nIt is not a surprise to me that they brought Taiclet on during the pandemic. He led AMT through adversity before, and LMT’s positioning during the pandemic is tremendous relative to the rest of the sector, thanks in large part to some strong strategic moves and good investments by current and past leadership. I think that Taiclet is the right CEO for the job.\n\nIn addition to the new CEO, the new Secretary of Defense, Secretary Lloyd Austin, has strong ties to the defense sector. He was formerly a board member for RTX. He is absolutely above reproach, and a true leader of character, but I bring this up not to suggest that he will inappropriately serve in the best interest of defense contractors, but to suggest that he speaks the language of these companies effectively. I do not anticipate that the current administration poses as significant of a risk to the defense sector as many analysts seem to believe. This will be expanded in the headwinds section below.\n\n**SPACE**\n\nCathie Wood and the ARK Invest team brought a lot of attention to the space sector when the ARKX, The ARK Space Exploration ETF, Form N-1A was officially filed through the SEC. More recently, ARK Invest published their Big Ideas 2021 Annual Report and dedicated an entire 7-page chapter to Orbital Aerospace, a new disruptive innovation platform that the ARK Team is investigating. This may have helped energize wall street to re-look their portfolios and their investments in space technology, but it was certainly not the first catalyst that pushed the defense industry in the direction of winning the *new* space race.\n\nIn June 2018, then President Trump announced at the annual National Space Council that “it is not enough to merely have an American presence in space, we must have American dominance in space. So important. Therefore, I am hereby directing the Department of Defense (DoD) and Pentagon to immediately begin the process necessary to establish a Space Force as the sixth branch of the Armed Forces\". Historically, Department of Defense space assets were under the control of the Air Force. By creating a separate branch of service for the United States Space Force (USSF), the DoD would allocate a Chairman of Space Operations on the Joint Chiefs of Staff and clearly define the budget for space operations dedicated directly to the USSF. At present, this budget is funneled from the USAF’s budget. The process was formalized in December of 2019, and the DoD has appropriated \\~$15B to the USSF in their first full year of existence according to the FY21 budget.\n\nAmong the 77 spacecraft that are controlled by the USSF, 29 of them are Lockheed Martin GPS satellites, 6 of them are Lockheed Martin Space-Based Infrared Systems (SBIRS), and LMT had a hand in creating and/or manufacturing for several of the other USSF efforts. The Next Generation Overhead Persistent Infrared Missile Warning Satellites (also known as Next-Gen OPIR) were contracted out to both Northrup Grumman (Ticker: NOC) and LMT. LMT’s contract is currently set at $4.9B, NOC’s contract is set at $2.37B.\n\nTangentially related to the discussion of space is the discussion of hypersonic glide vehicles (HGVs). HGVs have exoatmospheric and atmospheric implications, but I think that their technology is extremely important to driving margins down for both space exploration and terrestrial point-to-point travel. LMT is leading the charge for military HGV research. They hold contracts with the Navy, Air Force, and Army to develop HGVs and hypersonic precision fires. The priority for HGV technology accelerated significantly when Russia launched their Avangard HGV in December of 2019. Improving the technology for HGVs is a critical next-step in maintaining US hegemony, but also maintaining leadership in both terrestrial and exoatmospheric travel.\n\n**LARGE SCALE COMBAT OPERATIONS (LSCO)**\n\nThe DoD transitioning to Large-Scale Combat Operations (LSCO) as the military’s strategic focus. This is a move away from an emphasis on Counter-Insurgency operations. LSCO requires effective multi-domain operations (MDO), which means effective and integrated strategies regarding land, sea, air, space, and cyberspace. To have effective MDO, the DoD is seeking systems that both expand capabilities against peer threats and increase the ability to track enemy units and communicate internally. This requires a modernizing military strategy that relies heavily on air, missile, and sensor modernization. Put simply, the DoD has decided to start preparing for peer or near-peer adversaries (China, Russia, Iran, North Korea) rather than insurgencies. For this reason, I believe that increased Chinese and Russian tensions are, unfortunate as it may be, a boon to the defense industry. This is particularly true in the missiles/fires and space industry, as peer-to-peer conflicts are won by leveraging technological advantages.\n\nThere are too many projects to cover in detail, but some important military technologies that LMT is focusing on to support LSCO include directed energy weapons (lasers) to address enemy drone technology, machine learning / artificial intelligence (most applications fall under LMT’s classified budget, but it is easy to imagine the applications of AI in a military context), and 5G to increase battlefield connectivity. These projects are all nested within the DoD’s LSCO strategy, and position LMT as the leader in emergent military tech. NOC is the other major contractor making a heavy push in the modernization direction, but winners win, and I think a better CEO, balance sheet, and larger market cap make LMT the clear winner for aiding the DoD in a transition toward LSCO.\n\n**SECTOR COMPARISON (BACKLOG)**\n\nThe discussion of LSCO transitions well into the discussion of defense contractor backlogs. Massive defense contracts are not filled overnight, so examining order backlogs is a relatively reliable way to gauge the interest of the DoD in a defense contractor’s existing or emerging products. For my sector comparison, I am using the top 6 holdings of the iShares U.S. Aerospace &amp; Defense ETF (Ticker: ITA). I hate this ETF, and ETFs like it (DFEN) because of their massively outsized exposure to aerospace, and undersized allocation to companies like LMT. LMT is only 18% smaller than Boeing (Ticker: BA) but is only 30.4% of the exposure of BA (18.46% of the fund is BA, only 5.62% of the fund is LMT). Funds of this category are just BA / RTX hacks. I suggest building your own pie on a site like M1 Finance (although they are implicated in the trade restriction BS… please be advised of that… hoping other brokerages that are above board will offer similar UIs like the pie design… just wanted to be clear there) if you are interested in the defense sector.\n\nThe top 6 holdings of ITA are:\n\nBoeing Company (Ticker: BA, MKT CAP $110B) at 18.46%\n\nRaytheon Technologies (Ticker: RTX, MKT CAP $101B) at 17.84%\n\nLockheed Martin (Ticker: LMT, MKT CAP $90B) at 5.62%\n\nGeneral Dynamics Corporation (Ticker: GD, MKT CAP $42B) 4.78%\n\nTeledyne Technologies Incorporated (Ticker: TDY, MKT CAP $13B) at 4.74%\n\nNorthrop Grumman Corporation (Ticker: NOC, MKT CAP $48B) at 4.64%\n\nAs a brief aside, please look at the breakdowns of ETFs before buying them. The fact that ITA has more exposure to TDY than NOC and L3Harris is wild. Make sector ETFs balanced how you want them to be balanced and it will be more engaging, and you will likely outperform. I digress.\n\nBacklogs for defense companies can easily be pulled from their quarterly reports. Here are the current backlogs in the same order as before, followed by a percentage of their backlog to their current market cap. All numbers are pulled from January earning reports unless otherwise noted with an \\* because they are still pending.\n\n**Boeing Company** backlog (Commercial: $282B, Defense: $61B, Foreign Military Sales (FMS, categorized by BA as ‘Global’): 21B, Total Backlog 364B): BA’s backlog to market cap is a ratio of 3.32, which is strong, but most of that backlog comes from the commercial, not the defense side. Airlines have been getting decimated, I am personally not interested in having much of my backlog exposed to commercial pressures when trying to invest in a defense play. Without commercial exposure, their defense only backlog ratio is .748. This is extremely low. I understand that this does not do BA justice, but I am keying in on defense exposure, and I am left thoroughly unsatisfied by that ratio. Also, we have seen several canceled contracts already on the commercial side.\n\n**Raytheon Technologies** backlog (Defense backlog for all 4 subdivisions: 67.3B): Raytheon only published a defense backlog in this quarter’s report. That is further evidence to me that the commercial aerospace side of the house is getting hammered. They have a relatively week backlog to market cap as well, putting them at a ratio of .664, worse off than the BA defense backlog.\n\n**Lockheed Martin** backlog (Total Backlog: $147B): This backlog blows our first two defense backlogs out of the water with a current market cap to backlog ratio of 1.63.\n\n**General Dynamics Corporation** backlog (Total Backlog: $89.5B, $11.6B is primarily business jets, but it is difficult to determine how much of their aerospace business is commercial): Solid 2.13 ratio, still great 1.85 if you do not consider their aerospace business. The curveball here for me is that GD published a consolidated operating profit of $4.1B including commercial aerospace, whereas LMT published a consolidated operating profit of $9.1B. This makes the LMT ratio of profit/market cap slightly in favor of LMT without accounting for the GD commercial aerospace exposure. This research surprised me; I may like GD more than I originally assumed I would. Still prefer LMT.\n\n**Teledyne Technologies Incorporated** backlog (Found in the earnings transcript, $1.7B): This stock is not quite in the same league as the other major contractors. This is an odd curveball that a lot of the defense ETFs seem to have too much exposure to. They have a weak backlog, but they are a smaller growing company. I am not interested in this at all. It has a backlog ratio of .129.\n\n**Northrop Grumman Corporation** backlog ($81B): Strong numbers here. I see NOC and LMT as the two front-runners in the defense sector. I like LMT more because I like their exposure to AI, 5G, and HGVs more than NOC, but I think this is a great alternative to LMT if you like the defense sector. Has a ratio of 1.69, slightly edging out LMT on this metric. LMT edges out NOC on margins by \\~.9%, though, which has significant implications when considering the depth of the LMT backlog.\n\nThe winners here are LMT, GD, and NOC. BA is attractive if you think anyone will have enough money to buy new planes. BA and RTX are both getting hammered by commercial aerospace exposure right now and are much more positioned as recovery plays. That said, LMT and NOC both make money now, and will regardless of the impact of the pandemic. LMT is growing at a slightly faster rate than NOC. Both are profit machines, but I like LMT’s product portfolio and leadership a lot more.\n\n**FREE CASH FLOW**\n\nDespite the pandemic, LMT had the free cash flow to be able to pay a $2.60 per share dividend. This maintains their \\~3% yearly dividend rate. They had a free cash flow of $6.4B. They spent $3.9 of that in share repurchases and dividend payouts. That leaves 40% of that cash to continue to strengthen one of the most stalwart balance sheets outside of big tech on the street. Having this free cash flow allowed them to purchase Aerojet Rocketdyne for $4.4B in December. They seem flexible and willing to expand and take advantage of their relative position during the pandemic. This is a stock that has little downside risk and significant upside potential. It is always reassuring to me to know that at the end of the day, a company is using its profit to continue to grow.\n\n**HEADWINDS**\n\n**New Administration** – This is more of an unknown than a headwind. The Obama Administration was not light on military spending, and the newly appointed SecDef is unlikely to shy away from modernizing the force. Military defense budgets may get lost in the political shuffle, but nothing right now suggests that defense budgets are on the chopping block.\n\n**Macroeconomic pressure** – The markets are tumultuous in the wake of GME. Hedgies are shaking in their boots, and scared money weighed on markets the past week. If scared money continues to exert pressure on the broader equity markets, all boomer stocks are likely weighed down by slumping markets.\n\n**Non-meme Status** – The stocks that are impervious to macroeconomic pressures in the above paragraph are the stonks that we, the people, have decided to support. From GME to IPOE, there is a slew of stonks that are watching and laughing from the green zone as the broader markets slip deeper into the red zone. Unless sentiment about LMT changes, I see no evidence that LMT will remain unaffected by a broader economic downturn (despite showing growth YoY during a pandemic).\n\n**TAILWINDS**\n\n**Aerojet Rocketdyne to the Moon** – Cathie Wood opened up a $39mil position in LMT a few weeks ago, and this was near the announcement of ARKX. The big ideas 2021 article focuses heavily on satellite technology, deep learning, and HGVs. I think that the AR acquisition suggests that vertical integration is a priority for LMT. They even fielded a question in their earnings call about whether they were concerned about being perceived as a monopoly. Their answer was spot on—the USFG and DoD have a vested interest in the success of defense companies. Why would they discourage a defense contractor from vertical integration to optimize margins?\n\n**International Tensions** – SolarWinds has escalated US-Russia tensions. President Biden wants to look tough on China. LSCO is a DoD-wide priority.\n\n**5G.Mil** – We still do not have a lot of fidelity on what this looks like, but the military would benefit in a lot of ways if we had world-wide access to the rapid transfer of encrypted data. Many units still rely on Vietnam-era technology signal technology with abysmal data rates. There are a lot of implications if the code can be cracked to win a DoD 5G contract.\n\n**TRADE IDEAS**\n\n**Price Target:** LMT is currently at a P/E of \\~14. Verizon has roughly the same. LMT’s 5-year P/E ratio average is \\~17. NOC is currently at a P/E of \\~20. TSLA has a P/E Ratio of 1339 (disappointingly not 1337). P/E is a useless metric because no one seems to care about it. My point is that LMT makes a lot of money, and other companies that are valued at much higher multiples do not make any money at all. LMT’s P/E ratio is that of a boomer stock that has no growth potential. LMT’s P/E is exactly in line with the Aerospace and Defense Industry P/E ratio standard. LMT’s new CEO is pushing the industry in a new direction. I will arbitrarily choose a P/E ratio of 30, because it is half of the software industry average, and it is a nice round number. Plus, stock values are speculative and nonsense anyway.\n\nShare price today: $321.82\n\nShare price based on LMT average 5-year P/E: $384.08 (I see this as a short term PT, reversion to the mean)\n\nShare price with a P/E of 30: $690.26\n\n**Buy and Hold:** Simple. Doesn’t take much thought. Come back in a year or two and be happy with your tendies (and a few dividends to boot).\n\n**LEAPS Call Debit Spread (Based on last trade prices):** Buy $375 C 20 JAN 23 for $26.5, Sell $450 C 20 JAN 23 for $12. Total Cost $14.5 for a spread width of $75. Max gain 517% per spread. Higher risk strategy.\n\n**LEAPS**: Buy $500 C 20 JAN 23 for $7.20. Very high-risk strat. If the price target is hit within two years, these would be in the money $183 per contract for a gain of 2500%. This is the casino strat.\n\n**SOURCES**\n\n[https://www.lockheedmartin.com/en-us/news/features/2020/james-taiclet-from-military-pilot-to-successful-ceo.html](https://www.lockheedmartin.com/en-us/news/features/2020/james-taiclet-from-military-pilot-to-successful-ceo.html)\n\n[https://www.warren.senate.gov/newsroom/press-releases/in-response-to-senator-warrens-questions-secretary-of-defense-nominee-general-lloyd-austin-commits-to-recusing-himself-from-raytheon-decisions-for-four-years](https://www.warren.senate.gov/newsroom/press-releases/in-response-to-senator-warrens-questions-secretary-of-defense-nominee-general-lloyd-austin-commits-to-recusing-himself-from-raytheon-decisions-for-four-years)\n\n[https://news.lockheedmartin.com/2019-08-30-Lockheed-Martins-Expertise-in-Hypersonic-Flight-Wins-New-Army-Work](https://news.lockheedmartin.com/2019-08-30-Lockheed-Martins-Expertise-in-Hypersonic-Flight-Wins-New-Army-Work)\n\n[https://www.lockheedmartin.com/en-us/capabilities/hypersonics.html](https://www.lockheedmartin.com/en-us/capabilities/hypersonics.html)\n\n[https://research.ark-invest.com/hubfs/1\\_Download\\_Files\\_ARK-Invest/White\\_Papers/ARK%E2%80%93Invest\\_BigIdeas\\_2021.pdf?hsCtaTracking=4e1a031b-7ed7-4fb2-929c-072267eda5fc%7Cee55057a-bc7b-441e-8b96-452ec1efe34c](https://research.ark-invest.com/hubfs/1_Download_Files_ARK-Invest/White_Papers/ARK%E2%80%93Invest_BigIdeas_2021.pdf?hsCtaTracking=4e1a031b-7ed7-4fb2-929c-072267eda5fc%7Cee55057a-bc7b-441e-8b96-452ec1efe34c)\n\n[https://www.deseret.com/2018/6/19/20647309/twitter-reacts-to-trump-s-call-for-a-space-force](https://www.deseret.com/2018/6/19/20647309/twitter-reacts-to-trump-s-call-for-a-space-force)\n\n[https://comptroller.defense.gov/Portals/45/Documents/defbudget/fy2021/fy2021\\_Budget\\_Request\\_Overview\\_Book.pdf](https://comptroller.defense.gov/Portals/45/Documents/defbudget/fy2021/fy2021_Budget_Request_Overview_Book.pdf)\n\n[https://www.airforcemag.com/lockheed-receives-up-to-4-9-billion-for-next-gen-opir-satellites/](https://www.airforcemag.com/lockheed-receives-up-to-4-9-billion-for-next-gen-opir-satellites/)\n\n[https://spacenews.com/northrop-grumman-gets-2-3-billion-space-force-contract-to-develop-missile-warning-satellites/](https://spacenews.com/northrop-grumman-gets-2-3-billion-space-force-contract-to-develop-missile-warning-satellites/)\n\n[https://www.lockheedmartin.com/en-us/capabilities/directed-energy/laser-weapon-systems.html](https://www.lockheedmartin.com/en-us/capabilities/directed-energy/laser-weapon-systems.html)\n\n[https://emerj.com/ai-sector-overviews/lockheed-martins-ai-applications-for-the-military/](https://emerj.com/ai-sector-overviews/lockheed-martins-ai-applications-for-the-military/)\n\n[https://www.defenseone.com/business/2020/07/new-ceo-wants-lockheed-become-5g-player/167072/](https://www.defenseone.com/business/2020/07/new-ceo-wants-lockheed-become-5g-player/167072/)\n\n[https://www.wsj.com/articles/defense-firms-expect-higher-spending-11548783988](https://www.wsj.com/articles/defense-firms-expect-higher-spending-11548783988)\n\n[https://www.etf.com/ITA#efficiency](https://www.etf.com/ITA#efficiency)\n\n[https://s2.q4cdn.com/661678649/files/doc\\_financials/2020/q4/4Q20-Presentation.pdf](https://s2.q4cdn.com/661678649/files/doc_financials/2020/q4/4Q20-Presentation.pdf)\n\n[https://investors.rtx.com/static-files/dfd94ff7-4cca-4540-bc4b-4e3ba92fc646](https://investors.rtx.com/static-files/dfd94ff7-4cca-4540-bc4b-4e3ba92fc646)\n\n[https://investors.lockheedmartin.com/static-files/64e5aa03-9023-423a-8908-2aae8c7015ac](https://investors.lockheedmartin.com/static-files/64e5aa03-9023-423a-8908-2aae8c7015ac)\n\n[https://s22.q4cdn.com/891946778/files/doc\\_financials/2020/q4/GD\\_4Q20\\_Earnings\\_Highlights-Outlook-Final.pdf](https://s22.q4cdn.com/891946778/files/doc_financials/2020/q4/GD_4Q20_Earnings_Highlights-Outlook-Final.pdf)\n\n[https://www.fool.com/earnings/call-transcripts/2021/01/27/teledyne-technologies-inc-tdy-q4-2020-earnings-cal/](https://www.fool.com/earnings/call-transcripts/2021/01/27/teledyne-technologies-inc-tdy-q4-2020-earnings-cal/)\n\n[https://investor.northropgrumman.com/static-files/6e6e117f-f656-4c68-ba7f-3dc53c2dd13a](https://investor.northropgrumman.com/static-files/6e6e117f-f656-4c68-ba7f-3dc53c2dd13a)",
        "subreddit": "investing",
        "title": "LMT: A Deep Dive",
        "url": "https://www.reddit.com/r/investing/comments/la7g07/lmt_a_deep_dive/",
        "created": 1612226378.0
    },
    {
        "author": "JobBrooks2013",
        "created_utc": 1612276453,
        "id": "lawtd5",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "DID ANYONE ELSE SEE THAT BLIP WHEN IT HIT 0630?! IT WENT FROM $139 to $225 AND BACK DOWN IN THE BLINK OF AN EYE. What does that tel you?!?!",
        "subreddit": "wallstreetbets",
        "title": "BLIP AT 0630!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lawtd5/blip_at_0630/",
        "created": 1612305253.0
    },
    {
        "author": "Weasel-McGibblypants",
        "created_utc": 1612221839,
        "id": "lahex6",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Can anyone tel me if this Biocryst hype is real?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lahex6/can_anyone_tel_me_if_this_biocryst_hype_is_real/",
        "created": 1612250639.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1612274164,
        "id": "lavz0j",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "Can someone tel me why its dont exploding up with the stock?🚀",
        "url": "https://i.redd.it/qxsolq7cl2f61.jpg",
        "created": 1612302964.0
    }
]