[
    {
        "author": "Money-Maker111",
        "created_utc": 1637914500,
        "id": "r2iejk",
        "num_comments": 646,
        "num_crossposts": 0,
        "selftext": "The virus mutation also has 10 other genetic mutations.  WHO convening emergency meeting.  Airlines shutting down travel.  Markets tumbling.  As of this writing, DOW futures are down 750 points, and russel 2000 index futures are down 4%.\n\nSome talks with my friends going on about how this alone could serve as a GME, AMC 'MOASS' catalyst, since collateral and margin maintenance requirements.  With markets crashing like this, the NSCC algos do indeed raise capital requirements.  What are your thoughts on the following:\n\n1. GME, AMC, and other meme stocks have a negative beta and therefore serve as a hedge against falling markets\n2. These stocks remain heavily shorted, and therefore, funds that are stuck in egregious short positions have to buy to cover to get out, and potentially very quickly\n3. B.1.1.529 'horrific' killer virus strain could induce this market catalyst (as unfortunate as that is to say that it came to this in order to have free and fair markets).  Thoughts?",
        "subreddit": "wallstreetbets",
        "title": "Do you agree that the B.1.1.529 'horrific' killer virus strain (50 spike protein mutations) is now going to be a margin-call catalyst for anyone shorting meme stocks?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r2iejk/do_you_agree_that_the_b11529_horrific_killer/",
        "created": 1637943300.0
    },
    {
        "author": "cluelessbets",
        "created_utc": 1637473669,
        "id": "qyobhq",
        "num_comments": 541,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "With the current market condition, do i sell my beloved AMC to fund other stocks?! Or do I just diamond hand this like the ape that I am and just buy stocks later?",
        "url": "https://i.redd.it/znzeslle0w081.jpg",
        "created": 1637502469.0
    },
    {
        "author": "Aramedlig",
        "created_utc": 1636681081,
        "id": "qs0c9l",
        "num_comments": 354,
        "num_crossposts": 0,
        "selftext": "Weed is on the rise fellow apes.  I’ve been slowly accumulating many of them.  And I have diamond hands! I learned from GME and AMC (which I made some good money on).  But, weed is risky, lots of players, “Why would you do such a thing?“ you might ask? Well, I expected with the political divisions in this country and the need for all incumbents to bring back a win in 2020, that there would be strong movement on legislative action this year. And it’s come true. Weed stocks are not only showing improving balance sheets, but real progress is being made toward legalizing weed in the US.  Now is the time. I’ve bought into many unnamed weed stonks. And even thought the last few weeks have been great, and I could show some gain porn, I’m waiting for the big payoff.  I’ve initially bought mostly Canadian weed, but now I’m buying more and more US.  As of now, I’m 12k in, but I plan to increase that to 50k by the EOM.  Don’t miss out on this great green rocket to untold highs! BUY NOW!",
        "subreddit": "wallstreetbets",
        "title": "It’s HIGH Time to YOLO into WEED Stonks!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qs0c9l/its_high_time_to_yolo_into_weed_stonks/",
        "created": 1636709881.0
    },
    {
        "author": "Hour_Amphibian1844",
        "created_utc": 1635954171,
        "id": "qlx7tx",
        "num_comments": 231,
        "num_crossposts": 0,
        "selftext": " Now that Fastly is skyrocketing following Akamai's earnings, it seemed like a good time for me to enter with a bearish play. Be careful: this is not a full DD, expectations for Fastly are quite low and it has been beaten down a lot already, so going bearish can be very risky. Doubly so if you simply buy puts, which have very high IV for Fastly. I'm only using house money on this play. Enter at your own risk and limit your exposure.\n\n**Reasons for play**\n\n1. Trends in their employee base I [posted about here](https://www.reddit.com/r/wallstreetbets/comments/qjw4pq/fastly_fsly_seems_to_be_losing_lots_of_employees/)\n2. Almost all of their large customers seem to be losing significant traffic in Q3 compared to last quarter: Kickstarter, Guardian, Yelp, Github, WikiHow, Wayfair, Lonely Planet, Imgur. Amazon and Shopify also reported tepid earnings. However, some like Ticketmaster or Foursquare are doing well. As Fastly works with a usage-based business model, this could immediately affect their numbers\n3. Following on point 2, all covid stock have been getting clobbered this week in earnings, while plays on \"real life\" like Lyft, Marriott, AMC are doing quite well.\n\nGood luck to anyone playing\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zr7to8t0iex71.png?width=463&amp;format=png&amp;auto=webp&amp;s=d32115fb4b618bc93382be307bec1211e752ace4",
        "subreddit": "wallstreetbets",
        "title": "80k Fastly ($FSLY) earnings bet (bear spread)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qlx7tx/80k_fastly_fsly_earnings_bet_bear_spread/",
        "created": 1635982971.0
    },
    {
        "author": "Windsor_Boi",
        "created_utc": 1636829136,
        "id": "qt7fve",
        "num_comments": 223,
        "num_crossposts": 0,
        "selftext": "Man, I have to get this shit off my chest. \n\nI was a retarded ape once, then I got out of my confirmation bias spell when I looked into Adam Aron's shady history. Dude is as nasty as they come, yet apes continually speak of him as a silverback (LOL). From dilutions to selling shares directly to 'hedgies' to now dumping over 53million dollars worth of shares on the apes asses. But 100k is the floor right? \n\nAny price decrease in AMC shares and you guys start flinging poop at Gary Gensler and Kenny, screeching and screaming about dark pools and short ladder attacks. Going to your sub was enough to make me lose IQ points... How about you stop blaming a 'corrupt' system and introspect a little bit? Why is the share price going down? Perhaps it's because AMC is a failing business and insiders and institutions continually sell. You know, a little bit of thinking outside your box can explain things...   \n\nLook, apes, I'm not here to trash all over your retarded asses. Just here to say it like it is. If you made money, good for you. Continue doing that, but anyone that thinks AMC is a good investment is plain bamboozled. Start looking for better gambles if you're going to throw your money away. I just hope the rug pull doesn't happen and catches you off guard. \n\nGodspeed tards",
        "subreddit": "wallstreetbets",
        "title": "AMC discussion",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qt7fve/amc_discussion/",
        "created": 1636857936.0
    },
    {
        "author": "Thump4",
        "created_utc": 1635786572,
        "id": "qkim2u",
        "num_comments": 220,
        "num_crossposts": 0,
        "selftext": "***State of Affairs:***\n\nInvestors are saying things like \"GameStop is going to be the stock of 2022 and beyond. Facts: GameStop's Non-Fungible Digital Asset, Collectibles Marketplace, Web3.0 Gaming Metaverse, E-Commerce and Brick-and-Mortar Gaming monopoly, and a marketing analysis that shows that GameStop earned $1.5Trillion worth of free marketing in 2021.\" I have not seen this free-marketing analysis, so if anyone has access to that, let me know.\n\nInvestors also seem to be viewing the laying off of Jenna Owens as a bullish sign, likely revealing a strong culture requirement of success with the executive C-suite.\n\nFor AMC, CEO Adom Aron is pushing to allow meme digital assets for use in their theaters.  With the coronavirus pandemic showing signs of slowing, and theater revenue growing 542% (versus the previous quarter last year), data is showing that audiences are flocking back to see new movies.  Notable releases were James Bond (No Time to Die), Dune, Marvel's Eternals (this weekend), and the new Thor and additional Marvel Cinematic Universe releases on the list.  Personally, I would like to see the new Top Gun: Maverick in theaters, because my TV setup at home does not do its justice, and especially since I have to keep the volume down at home.\n\n***Technicals:***\n\nGameStop just jumped above $200 for the first time in weeks. Let's look at some of the other information.\n\n***GME overtakes 50SMA***\n\n[GameStop overtakes 50 Day Simple Moving Average](https://preview.redd.it/szox1j4in0x71.png?width=873&amp;format=png&amp;auto=webp&amp;s=2c5065364f78dda1926dfd1c399754fec489c5f3)\n\n***Schaff Trend Cycle revealing Positive Flip***\n\n[GME's Schaff Trend Cycle flipped to Positive](https://preview.redd.it/hjo7hculn0x71.png?width=1043&amp;format=png&amp;auto=webp&amp;s=2debdbd65b2549245242014927b16c9e908dc4f1)\n\n***AMC DIX Cylce Breakout***\n\n[AMC DIX Cylce Breakout](https://preview.redd.it/rrj7n1xnn0x71.jpg?width=1623&amp;format=pjpg&amp;auto=webp&amp;s=5f74f82e176d4fc09ff17ebe0dc8d2291efa6f51)\n\nAlso, basic applied predictive models are showing that GameStop and AMC Theaters are going to have a strong week. Thoughts?",
        "subreddit": "wallstreetbets",
        "title": "State of Affairs: Deep DD Dive into $GME and $AMC (with technicals)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qkim2u/state_of_affairs_deep_dd_dive_into_gme_and_amc/",
        "created": 1635815372.0
    },
    {
        "author": "Winter-Divide-8049",
        "created_utc": 1636814751,
        "id": "qt2pjc",
        "num_comments": 201,
        "num_crossposts": 0,
        "selftext": "[AMC chart](https://www.tradingview.com/x/RSutslFQ/)   \nThis is super simple, AMC has been consolidation for months! That means its loading up for a move, this could be up or down but with the news they have been releasing and that other meme stocks are performing well and still covered in the news I'd anticipate this to be a move up and to the right.\n\nThis is one of the simplest and easiest patterns to identify so it likely has a LOT of eyes watching it, which can be a very good thing.\n\nI've included some targets for the weak on the chart so if the price sees a little slowing in those areas you know it's because the poor need to take profits to cover their rent.   \nFor those that like the stock, the actual measured move is also shown. If the price starts to move north you will see AMC flood the media and WSB posts, which will easily make it ape into the moon targets.\n\nNot financial advice, but it is advice I'd give for those attempting to do financially oriented things in a manner such that you enlist some dollars to recruit additional dollars for your wallet.",
        "subreddit": "wallstreetbets",
        "title": "Prepare yourself for AMC movement : TA so simple you could read it in Braille",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qt2pjc/prepare_yourself_for_amc_movement_ta_so_simple/",
        "created": 1636843551.0
    },
    {
        "author": "gorays21",
        "created_utc": 1638236034,
        "id": "r5ba4y",
        "num_comments": 179,
        "num_crossposts": 0,
        "selftext": "&gt;When the clock stuck midnight on Nov. 29, tickets for “Spider-Man: No Way Home” went on sale. Within minutes domestic movie ticket sites began to crash as moviegoers rushed to snag seats for one of the most anticipated films of the year.  \n&gt;  \n&gt;It is something that the box office has not experienced since the pandemic began and a sign that with the right releases, the movie theater industry has a “bright future,” experts say.  \n&gt;  \n&gt;The pandemic battered cinemas, crushing demand and nearly bankrupting some of the industry’s largest exhibitors. The box office has been slow to rebound, but sustained momentum over the last six months has provided confidence in an eventual recovery.  \n&gt;  \n&gt;Overnight, the latest installment of the Marvel Cinematic Universe, a co-production between [Disney](https://www.cnbc.com/quotes/DIS) and [Sony](https://www.cnbc.com/quotes/6758.T-JP), has sparked even more optimism. Ticketing sites like Atom Tickets, [Fandango](https://www.cnbc.com/quotes/CMCSA) and MovieTickets.com alongside movie theater sites like [AMC](https://www.cnbc.com/quotes/AMC), [Cinemark](https://www.cnbc.com/quotes/CNK) and Regal saw a surge of demand for tickets leading many to crash or place visitors in hour-long online queues.  \n&gt;  \n&gt;“There are different tiers of intense fan demand when it comes to box office pre-sales, and this film is clearly showing it belongs near the top with a select few others,” said Shawn Robbins, chief analyst at BoxOffice.com. “For anyone who doubted the communal draw of the theatrical experience over the past two years, look to this enthusiasm for ‘Spider-Man’ as a major inflection point during the box office recovery period and the sign of a bright future ahead.”  \n&gt;  \n&gt;This kind of fervor has not been seen at the box office since 2019 when advanced tickets for titles like “Avengers: Endgame” and “Star Wars: The Rise of Skywalker” went on sale.\n\n ['Spider-Man: No Way Home' ticket demand crashed box office sites (cnbc.com)](https://www.cnbc.com/2021/11/29/spider-man-no-way-home-ticket-demand-crashed-box-office-sites.html)",
        "subreddit": "stocks",
        "title": "Sony's Spiderman:No Way Home crashes movie ticket sites",
        "url": "https://www.reddit.com/r/stocks/comments/r5ba4y/sonys_spidermanno_way_home_crashes_movie_ticket/",
        "created": 1638264834.0
    },
    {
        "author": "bullbearnyc1",
        "created_utc": 1637076210,
        "id": "qva6dn",
        "num_comments": 173,
        "num_crossposts": 0,
        "selftext": "**1. Worth $27 based on earnings. Worth $37 based on FFO.** Some investors consider Geo Group to be a REIT, others do not. Either way, the stock is very inexpensive. If considering Geo Group as a regular company, one should value it on an earnings basis. On an earnings basis, Geo Group trades at 6.5x 2021E earnings of $1.40 per share. However, the average company in the Russell 2000 trades at 19.5x earnings, indicating a fair value of $27 for Geo Group shares. (19.5 x $1.40 = $27.30). And if considering Geo Group as a REIT, one should value it on a P/FFO basis. Geo Group trades at 4.8x 2021E funds from operations (FFO) of $1.90 per share. However, the average ‘other/ diversified’ REIT in the United States trades at 19.8x FFO, indicating a fair value of $37 for Geo Group shares. (19.8 x $1.90 = $37.62). (See Figure 1 below).\n\n**2. Worth $42 based on replacement cost.** As an alternative way to determine the fair value of Geo Group shares, we can look at the replacement cost of Geo Group's assets minus liabilities. To calculate the replacement cost of Geo Group's assets, I researched the construction cost of 25 recently built prisons in the United States. However, because prisons are different sizes, I looked at their construction cost on a per bed basis. The cost was $220,061 per bed. Given Geo Group owns prisons with 55,951 beds, that implies a $12.3 billion total replacement cost. Now that we know the replacement cost of GEO’s facilities, we can calculate the replacement cost of the rest of the company. To do that, we take the value of the company’s facilities, plus the value of the company’s cash and receivables of $1.1 billion, less all liabilities of $3.4 billion. $12.3 + $1.1 - $3.4 = $10.0 billion. Divide $10.0 billion by 122.4 million of shares outstanding = $81.57 per share. But aren’t new facilities worth more than older ones? Yes. GEO’s Secure Services facilities were built, on average, in 1998. Rule of thumb is that industrial building values decline at 2.5% per year. That means $81.57 per share for buildings built in 2020 = $38.64 per share for buildings built in 1998. But also importantly, all of the facilities have been renovated. The renovations would add back at least 10% to the value of the facilities. And $38.64 x 1.10 leaves us with a replacement cost of $42.50 per Geo Group share. (See Figure 1 below).\n\nhttps://preview.redd.it/bz39kops5zz71.jpg?width=995&amp;format=pjpg&amp;auto=webp&amp;s=9c83f89dba2a748a6112fe35ddaff486a2007c3d\n\n**3. Reddit users often read the above paragraphs, then they state the following: “Okay I agree with you, GEO is undervalued. But why is it undervalued? And when will it move back to fair value?”** Well, for the past 1.5 years, news headlines constantly stated Geo Group’s earnings are at risk of decline due to the U.S. federal government’s new negative stance towards private prisons. As a result, shares fell 50%. However, news reporters (and in turn some investors) are overlooking the fact that federal facilities only hold 7% of prisoners in the United States. The other 93% of prisoners are held at the state or local levels. So the federal government's stance on private prisons is largely irrelevant, because it only applies to 7% of prisoners. Furthermore, as seen in the picture below, due to: (a) soaring crime rates; (b) soaring police retirements (up 45% yoy for the 12 months ended April 2021); and (c) prison overcrowding, the current federal government’s political aspiration, in addition to being largely irrelevant, is completely unrealistic. This reality - that the federal government’s stance on private prisons is irrelevant - is already positively impacting Geo Group's bottom line. On August 4, 2021, the company reported a significant beat on its Q2 earnings results and raised its full-year earnings guidance from $1.20 to $1.40 per share. And subsequent to the reporting of Q2 results, the company announced it would be re-opening a previously closed facility called Moshannon Correctional. The stock is already up 22% from August 4 to today. \\*\\*Update: The federal government, despite its bold statements advocating against private prisons for the past year, has quietly admitted it will allow Geo Group to bid on the renewal of the very contracts which the government previously said would no longer be given to the private sector\\*\\*. It's just a matter of time before the entire market realizes Geo Group's earnings will not decline, but are in fact sustainable. (More likely earnings will increase, at least at the rate of inflation). And companies with sustainable earnings trade at 15-20x earnings, not 6x earnings. This re-rating from 6x P/E to 15-20x P/E supports a 200%-300% increase in Geo Group’s share price from $9.20 per share to between $21 and $28 per share.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/23rjuk1v5zz71.jpg?width=1203&amp;format=pjpg&amp;auto=webp&amp;s=ceaed94615b7513237c217abf834ec8eec789d6e\n\n**4. Don’t wait because momentum is building**. First, we have legendary investment guru, Dr. Michael Burry, buying $20 million of shares of Geo Group between April and June 2021. He also tweeted about the stock in June: [https://twitter.com/BurryArchive/status/1405661364689965056/photo/1](https://twitter.com/BurryArchive/status/1405661364689965056/photo/1). Second, we have large scale insider buying from CEO Zoley who purchased $1.1 million worth of shares at $6.75 per share in June. Third, a whale investor just bought $1 million worth of Geo Group options with a strike price of $12 and March 2022 expiry date. This $1 million investment goes to $0 if GEO shares don’t rise to $12 by March. Typically, whale investors don’t make those big bets unless they are almost certain of something. And fourth, Geo Group has its own Reddit group of 1,300 members, up from 200 in June. One posted a billboard in New York, promoting the stock. (see it below and here: [https://twitter.com/Nasimul1978/status/1413618508609560583?s=20](https://twitter.com/Nasimul1978/status/1413618508609560583?s=20)). However, Geo hasn't even been mentioned in the most important Reddit group (Wall Street Bets) yet, because its market cap of $1.20 billion falls just below the forum's $1.25 billion requirement. What happens when the only meme stock with strong fundamentals makes its way onto this aggressive short squeeze subreddit?\n\nhttps://preview.redd.it/ywja0cow5zz71.jpg?width=806&amp;format=pjpg&amp;auto=webp&amp;s=db133a32d8c6cb4e809b1b8a93248588494a3d4d\n\n**5. If the above isn’t reason enough to buy, consider this question: Is Geo Group the single best short squeeze candidate out of all meme stocks?** As seen in the scatter plot below, because of Geo Group's relatively small market capitalization ($1.0 billion) and high short interest (22%), it is as likely as any other meme stock to get squeezed. However, there is an additional factor that needs to be considered, not displayed by the chart. That factor is Geo Group's deep undervaluation. I believe this undervaluation has two important implications:\n\n\\--- **a) Geo Group could triple based on fundamentals alone, trapping shorts**. In other words, a massive squeeze could happen, independent of Reddit/Wall Street Bets.\n\n\\--- **b) Reddit users can risk far more capital on Geo Group vs other meme stocks.** Only 3 of the 25 most talked about meme stocks/short squeeze candidates have earnings. Because Geo Group trades far ***below*** its fair value (while every other meme stock trades far ***above*** their fair values), Reddit users can risk far more capital investing in Geo Group. Looking at the chart below, which meme stock are you more comfortable owning? I know I’d be as comfortable investing $15,000 into a stock that trades at 6.5x earnings as I would be investing $5,000 in a stock with no earnings. Bottom line: APES have triple the ammo.\n\nhttps://preview.redd.it/y85l6gc06zz71.jpg?width=1105&amp;format=pjpg&amp;auto=webp&amp;s=1f4e812d149f6a1c671f1e06006d4c214dd25a75\n\n**6. How high could shares go on a short squeeze? + Conclusion.** GameStop’s market capitalization reached a high of $35 billion when the stock peaked at $483 per share. AMC reached a similar level. That level translates into a $292 share price for Geo Group (see Moonshot Potential column in Figure #1 above). Under normal market conditions, the probability of a short squeeze is low. However, in the past six months of the ongoing speculative mania, short squeezes have been common (ie. GME, AMC, CARV, CLOV). As discussed in paragraph #5 above, Geo Group’s potential to squeeze may be the highest among all meme stocks. And importantly, as proven by the deep due diligence valuation work completed in this post, instead of losing 50-70% of your capital while waiting for the squeeze (like with AMC, GME etc), you could very well be making a 100%-200% return while waiting.\n\n\\*This post does not constitute investment advice.",
        "subreddit": "StockMarket",
        "title": "Geo Group (NYSE-GEO) – Stock trades at $9.50, but is worth $27, $37 and $42 based on various valuation metrics. And the reasons why this deep undervaluation won’t last.",
        "url": "https://www.reddit.com/r/StockMarket/comments/qva6dn/geo_group_nysegeo_stock_trades_at_950_but_is/",
        "created": 1637105010.0
    },
    {
        "author": "asdfoiqw",
        "created_utc": 1637173976,
        "id": "qw5q85",
        "num_comments": 162,
        "num_crossposts": 0,
        "selftext": "This is really more of a rant/lament, so if you don't want to hear it, feel free to keep scrolling.\n\nAnyhow, I put $500 into AMC back in 2020 hoping for a 6-7x return in 1 - 2 yrs. As luck would have it, this became one of the meme stocks and it shot up to $70. Excited to be part of the movement, I hung on, joined the AMC stock forum and stayed in as it dipped back down and down. But it's just gotten to a point where it doesn't make responsible sense for me to keep it anymore in hopes of another price surge up to $60 and beyond, when the last few months' price surges only go up \\~$40 and I'm sitting on \\~14x and have real life bills to pay, including a major medical bill. So, I bit today's price surge past $40 and sold, I know it was the responsible thing to do - but damn this hurts. Really wanted to be a part of the next a-p-e nation win.",
        "subreddit": "stocks",
        "title": "sold AMC today - this hurts.",
        "url": "https://www.reddit.com/r/stocks/comments/qw5q85/sold_amc_today_this_hurts/",
        "created": 1637202776.0
    },
    {
        "author": "nobjos",
        "created_utc": 1635938713,
        "id": "qlscp1",
        "num_comments": 153,
        "num_crossposts": 0,
        "selftext": "&gt;Like 4chan found a Bloomberg terminal \n\nA community that defines itself like this is not a confidence-inspiring place to get stock picks to YOLO your next paycheck into. I think, being the only place where losses are celebrated as much as the wins should make you seriously question the incentive of folks who are making the recommendations!  \n\nWhether it’s for the insane YOLOs posted every day, or breaking Robinghood with infinite leverage plays, or the legendary short-squeeze involving GME, here is where the action goes down!\n\nBut what I am interested in is to see if **we can beat the** **market** **by using the stock picks made on wallstreetbets!** After all,\n\n![img](r0cedr2igbx71)\n\n![img](1qtf5iajgbx71 \" \")\n\n**Data**\n\nReddit’s PRAW API and Pushshift API were used to obtain the data for this analysis. There were more than 20 million comments and posts made on WSB in 2021. I have had a VM running for collecting the live data from all the financial subreddits since Dec’20.\n\nThe summary sheet containing the analysis will be shared at the end in a Google sheet but if you want access to the full historical data, you can get it from [Pushshift API](https://github.com/pushshift/api).\n\n![img](gpp85mcjgbx71 \" \")\n\n**Analysis**\n\nAhh, this is where it gets tricky. There are multiple ways to consider what constitutes a recommendation from WSB. Since there are millions of comments, it’s not realistic to invest in each and every recommendation made on the subreddit.\n\nSo what I have done to simplify this is to calculate the most popular tickers for each day \\[2\\]. Why I settled on this logic is because a stock from this list is what a person is most likely to see when he/she would randomly browse through the subreddit and the higher the number of mentions, the more the chances of investing in the said stock.\n\nConsidering the practical limitations, I kept the cut-off at the top 10 stocks. Once we have found the top 10 discussed stocks of that day, we invest in them at the market close. Then we calculate the returns generated by the stocks over the next\n\na. One Week\n\nb. One Month\n\nc. Till Date ( From the date of investment to Today)\n\nThe benchmark for comparison is SPY\\[3\\]. We will compare the returns against SPY to see if the most popular recommendations generated by the platform can beat returns by SPY during the same time period.\n\n![img](pu8irxajgbx71 \" \")\n\n**Results**\n\nBefore we jump into the returns, here is a visualization of **how the most popular stocks have changed over the last year in WSB.**\n\n![video](t2ii3hjlgbx71)\n\n *In case the visualization is not loading,* [*check it out here.*](https://public.flourish.studio/visualisation/7685282/) \n\n![img](abx4tcqmgbx71 \" \")\n\nWe would have made a grand total of 2,613 investments \\[4\\] in 2021 following this strategy. We would have lost money on more than 51% over the next week and more than 60% over the next month. But if you consider till date, we are slightly above 50%. If you compare this to SPY, its an extremely poor performance, as during the same period SPY would have given a positive return of 66% over one week, 76% over one month, and 100% Till Date (as SPY is trading at an all-time high now)\n\nBut, the stock market rewards predictions disproportionately \\[5\\]. Out of the 100 stocks you pick, even if you get 99 wrong but get one extremely unlikely event right your overall returns will still be extremely high (which is what WSB is aiming for - it’s definitely not for safe plays).\n\nSo, how has the average performance of WSB picks fared?\n\n![img](d4hwo3kngbx71 \" \")\n\nWould you look at that! **WSB recommendations have hands down beaten SPY across all time periods.** It gave a 2% overperformance over the period of one week and 2.2% over one month and a whopping 6% if you had held on to your stocks.\n\nBut keep in mind that your performance is skewed towards a few stocks which got featured repeatedly in the top 10 list.\n\n![img](9k19tq9ogbx71 \" \")\n\nGME has been in the top10 discussed stocks in 100% of the days and on average you would have gained 73% if you invested in it every day. Both AMC and TSLA are close followers with both of them giving substantial returns. Among the other ones who have made the list repeatedly, only BB, CLOV, and WISH on average have lost money \\[6\\].\n\nNow that our main question is out of the way, we can really do a deep dive into the data and see some interesting patterns.\n\n![img](h1zt22jpgbx71)\n\nUnsurprisingly, Gamestop and AMC are at the top of the pile with GME returning an insane 788% in one week. Even if you remove GME and AMC (due to the unlikely scenario of a short-squeeze), the other 3 stocks would have doubled your investment in one week. \n\n![img](szf7uirqgbx71 \" \")\n\nFor every winner, there are bound to be losers. If you bought into GME at the top of the rally, you would have lost 73% of your investment in the next week. All the other companies on the list had a brief jump in popularity but folks who invested in that ended up holding the bag.\n\nBut what if you did not want to invest in 10 stocks every day. What if you only wanted to invest in the **top stock of the day** (ie, the one creating the most discussion)? Would you have beaten the market?\n\n![img](b1qn01irgbx71)\n\nUnsurprisingly, you would have beaten the market by a wide margin. This is mainly due to the insane returns generated by GME, AMC, TSLA, etc. which came to the top of the list. You are just being rewarded for the high amount of risks you are taking by putting all your investment into a few stocks \\[7\\].  \n\n![img](n2mtnnbjgbx71 \" \")\n\n**Limitations**\n\nThere are some limitations to this analysis which you should be aware of\n\n* As explained in footnote-1 there are 8-12 days of missing data - though this is not going to affect the results in any significant way as it’s lesser than 5% of the total days in the analysis.\n* This analysis does not consider Options which is a big part of what WSB is made of. The returns from options can be wildly different from what we are observing in the case of buying stocks\n* We have just considered the last year of data where it was predominantly a bull market and meme stocks have made insane rallies. The results might be different if we expand our time horizon.\n* Finally, the above analysis only considers the chatter and not the sentiment about the stock. I would invest no matter if people are saying positive or negative things about the company. My hypothesis is that we would be able to generate more alpha if we can distinguish the sentiment in comments. A part-2 of this analysis incorporating sentiment is in the works — stay tuned!\n\n![img](6kh47fcjgbx71 \" \")\n\n**Conclusion**\n\nBefore starting the analysis, I fully expected to end it with\n\n&gt;The real returns were the friends we made and the fun we had along the way!\n\nI was expecting that the chatter in WSB would be a lagging follower of the stock price rally and the people who invest in them would end up holding the bag.\n\nBut I was pleasantly surprised to see that on average the stock that made it to the trending list beat SPY in returns, that too ***across different time periods.***\n\nEither it’s due to the self-fulfilling prophecy of stock price rallies leading to more chatter that will lead to more investments that will cause the stock to rally even more. Or it might just be that WSB is the place where we can successfully leverage the [Wisdom of crowds](https://www.investopedia.com/terms/w/wisdom-crowds.asp).\n\nWhatever the case may be, you truly would need nerves of steel to keep holding on to a stock that rallies 700% in one week only to drop 70% in value next week and then finish net positive by the end of the year. For that, you are rewarded with market-beating returns!\n\n![img](zieahxcjgbx71 \" \")\n\n**Footnotes**\n\n\\[1\\] During the GME rally in January, the traffic was so high that the VM failed. I have used Pushshift to fill in the details wherever possible, but keep in mind that there are 7-8 days of missing data from 28th Jan to 8th Feb and 4 days of missing data in April 2nd week.\n\n\\[2\\] To find the most popular tickers I used a base of around 9,000 stock tickers that I got from IEX cloud. The program would flag if any of these tickers were present in a comment or post. This is by far the most data-intensive exercise I have done. if you hypothetically consider the loop as a cross join, we processed more than 200 Billion rows to find the most popular tickers.\n\n\\[3\\] If SPY was in the top 10 tickers, we would invest in that as well. I feel that this would slightly reduce our risk profile.\n\n\\[4\\] It’s lesser than the expected 2,900 investments as there are some days in between where we had data loss (footnote 1) and also some stocks got delisted or underwent mergers (eg. Aphira) due to which we could not get the financial data from Yahoo Finance.\n\n\\[5\\] Take the classic example of Keith Gill (aka DFV). He at one point had a $50MM return using a 50K call option. Even if he had another 99 50K call options in other stocks which expired worthless, just this one right pick would have made him a net profit of $45MM. This phenomenon is known as [black swan farming](http://www.paulgraham.com/swan.html).\n\n\\[6\\] This is very surprising given the amount of risk we are taking investing in meme stocks. Also, in my mind, you cannot complain about the skew towards a few stocks as it’s bound to happen. Even in the case of S&amp;P500, a vast majority of returns are [driven by a few tech stocks](https://www.ajg.com/us/news-and-insights/2020/dec/s-p-500-index-top-heavy-tech-heavy/).\n\n\\[7\\] The Beta of this portfolio would be through the roof and you beating the market is more probable as we are in a rally. Remember, [what Beta giveth, Beta can take it away](https://www.investopedia.com/terms/b/beta.asp) just as easily.\n\n*Disclaimer: I am not a financial advisor*",
        "subreddit": "wallstreetbets",
        "title": "Can Wallstreetbets beat the market? - I analyzed 20MM+ comments made on WSB in 2021 to see if you should pay attention to their stock picks. Here are the results.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qlscp1/can_wallstreetbets_beat_the_market_i_analyzed/",
        "created": 1635967513.0
    },
    {
        "author": "nobjos",
        "created_utc": 1635938561,
        "id": "qlsbb9",
        "num_comments": 144,
        "num_crossposts": 0,
        "selftext": "&gt;Like 4chan found a Bloomberg terminal\n\nThis is how wallstreetbets define their community. For those who don’t know, [r/wallstreetbets](https://email.mg2.substack.com/c/eJwtUMtuxCAM_JrlGGHIJuyBQy_9DcTDydImEIHTNH9fslvJsqXxYzzjLeGcy6kJK7EtVzJ0bqgTHnVBIixsr1hMDJoF3QdQd8ViNVNBXG1cNJUd2ba7JXpLMadrUo7AB2BPzfsH-GFSSsLgAiKHyXnugPuHF_w-vgntHiImjxp_sJw5IVv0k2irN_lxE58tjuPoCoYQqfN5bUC5QLssldof5JBqA1jUggsALgFkrwTvRKewhwEnMapJKCuxm3Yn5G_GW8_XWXR1d5Ws_77usqJTdl-5tt58iXuBTZtpdd1TpNNgsm7B8JZNb9deRpgZE5bmZjCWNAzyPigFnCv1r7L50ksJfJQP1lhDbltJr7Z8t-8xUVxb-gNKZ4d5) is one of the biggest stock market communities in the world having more than 11MM+ members. It’s where millions are made and lost every day on outrageous bets and the only place where losses are celebrated as much as the wins.\n\nWhether it’s for the insane YOLOs posted every day, or breaking Robinghood with infinite leverage plays, or the legendary short-squeeze involving GME, wallstreetbets is where the action goes down! [This video](https://email.mg2.substack.com/c/eJwlkMtuwyAQRb_GLC1exmTBolJVddF_sACPHRIbIhjq-u9LEmk0I81Dd-7xFmFN-TQIBckjFZzwfICJcJQNECGTWiBPYTZkNnJmetAklGnJALsNm8FcgTyq24K3GFJ8boqRUcXI1VCpOOWLVxe5MCqkH9UgF7dQf9FiGPxb0NY5QPRg4BfymSKQzVwRH6UTHx3_anEcR3-mitVB79P-7Fj01058_Xbi87bq4Zur4_y5d1xZN_mrjRG2NnJhdakUEkz7g7UXGBNSc9rzXoNkChY-6oVrK6BfquPiL0En6b7yvlRX0Pr7U5BkE5O7pdJm69P2q9lcT63uNQY8J4jWbTC_geCb5wvRtEKE3DjPk0XDlBiU1oxSrce3_0ZMCsHoKC6kqc6pXUWz23wHLBAx7C39A5NMj1I) sums up the absolute chaos that r/wallstreetbets is.\n\nBut what we are interested in is to see if **we can beat the** **market** **by using the stock picks made on wallstreetbets!** After all,\n\n![img](ibv9sp3idbx71)\n\n![img](rq2rmpzidbx71 \" \")\n\n**Data**\n\nReddit’s PRAW API and Pushshift API were used to obtain the data for this analysis. There were more than 20 million comments and posts made on WSB in 2021. I have had a VM running for collecting the live data from all the financial subreddits since Dec’20.\n\nThe summary sheet containing the analysis will be shared at the end in a Google sheet but if you want access to the full historical data, you can get it from [Pushshift API](https://github.com/pushshift/api).\n\n![img](olsk3rzidbx71 \" \")\n\n**Analysis**\n\nAhh, this is where it gets tricky. There are multiple ways to consider what constitutes a recommendation from WSB. Since there are millions of comments, it’s not realistic to invest in each and every recommendation made on the subreddit.\n\nSo what I have done to simplify this is to calculate the most popular tickers for each day \\[2\\]. Why I settled on this logic is because a stock from this list is what a person is most likely to see when he/she would randomly browse through the subreddit and the higher the number of mentions, the more the chances of investing in the said stock.\n\nConsidering the practical limitations, I kept the cut-off at the top 10 stocks. Once we have found the top 10 discussed stocks of that day, we invest in them at the market close. Then we calculate the returns generated by the stocks over the next\n\na. One Week\n\nb. One Month\n\nc. Till Date ( From the date of investment to Today)\n\nThe benchmark for comparison is SPY\\[3\\]. We will compare the returns against SPY to see if the most popular recommendations generated by the platform can beat returns by SPY during the same time period. \n\n![img](9cp7di0jdbx71 \" \")\n\n**Results**\n\nBefore we jump into the returns, here is a visualization of **how the most popular stocks have changed over the last year in WSB.**\n\n![video](n6jlnnvldbx71)\n\n *In case the visualization is not loading,* [*check it out here.*](https://public.flourish.studio/visualisation/7685282/) \n\n![img](w1jcf78ndbx71 \" \")\n\nWe would have made a grand total of 2,613 investments \\[4\\] in 2021 following this strategy. We would have lost money on more than 51% over the next week and more than 60% over the next month. But if you consider till date, we are slightly above 50%. If you compare this to SPY, its an extremely poor performance, as during the same period SPY would have given a positive return of 66% over one week, 76% over one month, and 100% Till Date (as SPY is trading at an all-time high now)\n\nBut, the stock market rewards predictions disproportionately \\[5\\]. Out of the 100 stocks you pick, even if you get 99 wrong but get one extremely unlikely event right your overall returns will still be extremely high (which is what WSB is aiming for - it’s definitely not for safe plays).\n\nSo, how has the average performance of WSB picks fared?\n\n![img](bfkgenaodbx71 \" \")\n\nWould you look at that! **WSB recommendations have hands down beaten SPY across all time periods.** It gave a 2% overperformance over the period of one week and 2.2% over one month and a whopping 6% if you had held on to your stocks.\n\nBut keep in mind that your performance is skewed towards a few stocks which got featured repeatedly in the top 10 list.\n\n![img](ye4hbj8pdbx71 \" \")\n\nGME has been in the top10 discussed stocks in 100% of the days and on average you would have gained 73% if you invested in it every day. Both AMC and TSLA are close followers with both of them giving substantial returns. Among the other ones who have made the list repeatedly, only BB, CLOV, and WISH on average have lost money \\[6\\].\n\nNow that our main question is out of the way, we can really do a deep dive into the data and see some interesting patterns.\n\n![img](faw73z8qdbx71)\n\nUnsurprisingly, Gamestop and AMC are at the top of the pile with GME returning an insane 788% in one week. Even if you remove GME and AMC (due to the unlikely scenario of a short-squeeze), the other 3 stocks would have doubled your investment in one week. \n\n![img](3tu6gfqrdbx71 \" \")\n\nFor every winner, there are bound to be losers. If you bought into GME at the top of the rally, you would have lost 73% of your investment in the next week. All the other companies on the list had a brief jump in popularity but folks who invested in that ended up holding the bag.\n\nBut what if you did not want to invest in 10 stocks every day. What if you only wanted to invest in the **top stock of the day** (ie, the one creating the most discussion)? Would you have beaten the market?\n\n![img](n95yi6lsdbx71)\n\nUnsurprisingly, you would have beaten the market by a wide margin. This is mainly due to the insane returns generated by GME, AMC, TSLA, etc. which came to the top of the list. You are just being rewarded for the high amount of risks you are taking by putting all your investment into a few stocks \\[7\\]. \n\n![img](03em191jdbx71 \" \")\n\n**Limitations**\n\nThere are some limitations to this analysis which you should be aware of\n\n* As explained in footnote-1 there are 8-12 days of missing data - though this is not going to affect the results in any significant way as it’s lesser than 5% of the total days in the analysis.\n* This analysis does not consider Options which is a big part of what WSB is made of. The returns from options can be wildly different from what we are observing in the case of buying stocks\n* We have just considered the last year of data where it was predominantly a bull market and meme stocks have made insane rallies. The results might be different if we expand our time horizon.\n* Finally, the above analysis only considers the chatter and not the sentiment about the stock. I would invest no matter if people are saying positive or negative things about the company. My hypothesis is that we would be able to generate more alpha if we can distinguish the sentiment in comments. A part-2 of this analysis incorporating sentiment is in the works — stay tuned! \n\n![img](pufwh52jdbx71 \" \")\n\n**Conclusion**\n\nBefore starting the analysis, I fully expected to end it with\n\n&gt;The real returns were the friends we made and the fun we had along the way!\n\nI was expecting that the chatter in WSB would be a lagging follower of the stock price rally and the people who invest in them would end up holding the bag.\n\nBut I was pleasantly surprised to see that on average the stock that made it to the trending list beat SPY in returns, that too ***across different time periods.***\n\nEither it’s due to the self-fulfilling prophecy of stock price rallies leading to more chatter that will lead to more investments that will cause the stock to rally even more. Or it might just be that WSB is the place where we can successfully leverage the [Wisdom of crowds](https://www.investopedia.com/terms/w/wisdom-crowds.asp).\n\nWhatever the case may be, you truly would need nerves of steel to keep holding on to a stock that rallies 700% in one week only to drop 70% in value next week and then finish net positive by the end of the year. For that, you are rewarded with market-beating returns!\n\nIf you liked reading this one, you will love\n\n* How to [consistently make returns](https://marketsentiment.substack.com/p/crypto-dca) from the Crypto market!\n* [Should you follow insider transactions](https://marketsentiment.substack.com/p/insider-purchase) while investing?\n\nUntil next week…\n\n![img](rkizc03jdbx71 \" \")\n\n**Footnotes**\n\n\\[1\\] During the GME rally in January, the traffic was so high that the VM failed. I have used Pushshift to fill in the details wherever possible, but keep in mind that there are 7-8 days of missing data from 28th Jan to 8th Feb and 4 days of missing data in April 2nd week.\n\n\\[2\\] To find the most popular tickers I used a base of around 9,000 stock tickers that I got from IEX cloud. The program would flag if any of these tickers were present in a comment or post. This is by far the most data-intensive exercise I have done. if you hypothetically consider the loop as a cross join, we processed more than 200 Billion rows to find the most popular tickers.\n\n\\[3\\] If SPY was in the top 10 tickers, we would invest in that as well. I feel that this would slightly reduce our risk profile.\n\n\\[4\\] It’s lesser than the expected 2,900 investments as there are some days in between where we had data loss (footnote 1) and also some stocks got delisted or underwent mergers (eg. Aphira) due to which we could not get the financial data from Yahoo Finance.\n\n\\[5\\] Take the classic example of Keith Gill (aka DFV). He at one point had a $50MM return using a 50K call option. Even if he had another 99 50K call options in other stocks which expired worthless, just this one right pick would have made him a net profit of $45MM. This phenomenon is known as [black swan farming](http://www.paulgraham.com/swan.html).\n\n\\[6\\] This is very surprising given the amount of risk we are taking investing in meme stocks. Also, in my mind, you cannot complain about the skew towards a few stocks as it’s bound to happen. Even in the case of S&amp;P500, a vast majority of returns is [driven by a few tech stocks](https://www.ajg.com/us/news-and-insights/2020/dec/s-p-500-index-top-heavy-tech-heavy/).\n\n\\[7\\] The Beta of this portfolio would be through the roof and you beating the market is more probable as we are in a rally. Remember, [what Beta giveth, Beta can take it away](https://www.investopedia.com/terms/b/beta.asp) just as easily.\n\n*Disclaimer: I am not a financial advisor*",
        "subreddit": "options",
        "title": "Can Wallstreetbets beat the market? - I analyzed 20MM+ comments made on WSB in 2021 to see if you should pay attention to their stock picks. Here are the results.",
        "url": "https://www.reddit.com/r/options/comments/qlsbb9/can_wallstreetbets_beat_the_market_i_analyzed/",
        "created": 1635967361.0
    },
    {
        "author": "Mysterious_Cricket84",
        "created_utc": 1636420093,
        "id": "qps5a4",
        "num_comments": 130,
        "num_crossposts": 0,
        "selftext": "I should preface that I don't have a position in either company, nor any other \"meme stock.\" However, I genuinely did not think the prices for GME and AMC would remain this high almost 10 months on. I'm confused as to how much of this is due to retail investors buying in, and how much is due to a genuine protracted short squeeze. I just got a very good job at a media company and I'm a little bummed at the thought that a new recession could take it from me. If it goes \"to the moon,\" great, I'm happy for the people who will profit, but I really don't want financial calamity as a result. Any thoughts?",
        "subreddit": "stocks",
        "title": "Could \"meme stocks\" like GME and AMC cause a market crash?",
        "url": "https://www.reddit.com/r/stocks/comments/qps5a4/could_meme_stocks_like_gme_and_amc_cause_a_market/",
        "created": 1636448893.0
    },
    {
        "author": "carrot_up_my_ass69",
        "created_utc": 1636768475,
        "id": "qsqkgh",
        "num_comments": 122,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$AMC…. Price attempting to emerge outside the symmetrical triangle 📈",
        "url": "https://i.redd.it/fkh6dh4ir9z71.jpg",
        "created": 1636797275.0
    },
    {
        "author": "Pale_While7400",
        "created_utc": 1637702675,
        "id": "r0nolj",
        "num_comments": 120,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Amc will explode next days is so easy to see this i say 6x maybe more",
        "url": "https://i.redd.it/0bqh1lucxe181.jpg",
        "created": 1637731475.0
    },
    {
        "author": "SavageSecrets",
        "created_utc": 1636987373,
        "id": "quhyvn",
        "num_comments": 115,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC…This week is THE week…",
        "url": "https://i.redd.it/tnb3qyaeurz71.jpg",
        "created": 1637016173.0
    },
    {
        "author": "giov1234",
        "created_utc": 1635968637,
        "id": "qm2hmw",
        "num_comments": 111,
        "num_crossposts": 0,
        "selftext": "TLDR: 🍁=🚀🦍  but read anyways. \n\nMy monkey brain has been thinking to a list of reasons why $SNDL could be the next rocket ready to take off  to tendie town, better than AMC. \n\nWhat you are going to read it's not about a close contest whatsoever based on year-to-date performance. Sundial Growers (NASDAQ: SNDL) has certainly been a big winner so far this year with its shares nearly doubling in value after soaring more than 500% at one point. But AMC Entertainment (NYSE: AMC) easily beats Sundial with a jaw-dropping gain of more than 2,400%.  \n\n\nHowever, the past is the past. What really matters for investors is how a stock might perform going forward. Here are three reasons why Sundial Growers could be a bigger winner than AMC over the next months \n\nhttps://preview.redd.it/4q34t6r4cfx71.png?width=1920&amp;format=png&amp;auto=webp&amp;s=f38d3e169b41905ebce7b8594107f880521c8b7d\n\n#  1. The trend is its friend\n\nI don't doubt that AMC's financial fortunes will improve in 2021 and 2022 as moviegoers return to theaters;  but what happens to the company and its stock once demand reaches pre-pandemic levels? The number of tickets sold each year was declining before COVID-19 hit. There isn't a compelling reason to think the trend will reverse course in the future.  \n\n\nMeanwhile, the trend is a friend to Sundial Growers. Even with the shutdowns in 2020,  in Canada the total adult-use cannnabis sales more than doubled year over year. Cannabis market researcher Brightfield Group projects that adult-use cannabis sales will jump another 60% by the end of this year. \n\n To be sure, Sundial's revenue didn't increase in 2020. Several of the company's problems were self-inflicted, furthermore pricing pressures in the Canadian cannabis market also presented a challenge. Sundial has made changes to improve its cultivation and focuses on more attractive market segments.\n\nIt's a lot easier to succeed when the overall trend works to your advantage. That's the case for Sundial but isn't for AMC.\n\n# 2. A less lofty valuation\n\nSundial isn't a cheap stock by any stretch of the imagination. Its shares currently trade at 11 times sales. We can't use earnings-based valuation metrics, because the company isn't profitable yet.  \n\n\nWhile Sundial's price-to-sales (P/S) multiple is steep, it's still lower than several other Canadian marijuana stocks. For example, Canopy Growth's shares trade at nearly 20 times sales. Cronos Group's P/S ratio is more than 58.\n\nMore importantly, Sundial's valuation is much cheaper than AMC's. Shares of the theater chain operator currently trade at more than 22 times sales.  \n\n\nWill AMC's P/S ratio improve? I think that's a near certainty to happen as the company's sales rebound. However, I expect that Sundial's sales will also increase. SInce the cannabis operator's valuation isn't as lofty as AMC's is, its stock could perform better as its sales rise.\n\n# 3. The possibility of a game changer\n\nI think that there's a real possibility that a game changer could be on the way -- one that could directly benefit Sundial Growers. The U.S. could implement federal cannabis reform that paves the way for Canadian companies to enter the U.S. cannabis market.  \n\n\nIn my view, we will see a flurry of mergers and acquisitions if this happens. I expect that Sundial will be among the Canadian cannabis companies that quickly move to expand south of the border.\n\nThere's no guarantee that Sundial would be successful in the U.S. market, if the federal cannabis reform would be enacted. However, the opening up of such a huge new opportunity for the company would likely send its shares through the roof   \n\n\n**Is there a similar potential game changer for AMC? I don't think so.**  \n\n\nPutting the hype aside  \n\n\nSundial could very well be a bigger winner than AMC over the next five years for the three reasons mentioned above. \n\nThe company still faces significant challenges to turn its cannabis business around. It also will likely have to further dilute its stock to raise additional capital for investing in other cannabis businesses. My take is that there are better stocks to buy right now that will be bigger winners than both Sundial and AMC over the next few years.\n\n  \nHere's The Marijuana Stock You've Been Waiting For  \nA little-known Canadian company just unlocked what some experts think could be the key to profiting off the coming marijuana boom.  \n\n\n**And make no mistake – it is coming**. Maybe you should think about asking your wife's boyfriend to lend you some money to put on SNDL  \n\n\nCannabis legalization is sweeping over North America – 15 states plus Washington, D.C., have all legalized recreational marijuana over the last few years, and full legalization came to Canada in October 2018.  \n\n\nAnd one under-the-radar Canadian company is poised to explode from this coming marijuana revolution.  \n\n\nA **game-changing deal** just went down between the Ontario government and this powerhouse company...and you need to hear this story today if you have even considered investing in pot stocks.\n\nI'm not a financial advisor, I just love eating crayons",
        "subreddit": "wallstreetbets",
        "title": "3 Reasons Sundial Growers ($SNDL) Could Be a Bigger Winner Than AMC Over the Next Months",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qm2hmw/3_reasons_sundial_growers_sndl_could_be_a_bigger/",
        "created": 1635997437.0
    },
    {
        "author": "StockTipsTips",
        "created_utc": 1636839115,
        "id": "qtan98",
        "num_comments": 100,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n[Mitigating Anxiety is Mitigating the Unknown, and Mitigating the Unknown is Mitigating Downside Risk](https://preview.redd.it/p7iethoi3fz71.jpg?width=3907&amp;format=pjpg&amp;auto=webp&amp;s=0576d1b2c223bce6cb25dbb3e47bcdc661b5fe4a)\n\n**Overview:** For those of you who consider yourself seasoned traders, ignore this... although I promise you that you will learn something. For those of you who have anxiety issues I think this will prove to be an invaluable resource. I'm going to put a lot of time into writing this and it is directed at those who have high amounts of anxiety while trading in the markets. \n\n# Reddit is an Enabler of Trading Anxiety: \n\nBack in the day I used to post a metric ton of highly detailed DD on Reddit. I posted my research on Reddit for a simple reason ... I wanted feedback ... I wanted to crowdsource my DD. One of the predominant issues I continued to run into was few, if any, added any substantive value in the comment section. I would post DD and 2-4 weeks later I would get a flood of comments of folks who never commented on the thread before, but nevertheless tanked me for all the money they made as a result of reading and taking action on a ticker I wrote about. It was then I noticed that people on Reddit are frequently looking for justification to throw money at anything that may bring them a decent return. As it turned out the information I posted provided that justification. But this was not the reason I posted the research. Once again, I wanted to crowd source DD.\n\nI stopped posting DD on Reddit altogether. It was a lot of work for too little feedback. I can do a complete deep dive &amp; workup on a company in my head with a pad and pencil within an hour. Putting it all together and posting it takes considerably more time. I realized that there is a large segment of people wanted to be told what to invest in with a detailed summary as to why. They generally want to know  the risks, they want to know the possible rewards, and they wanted to know when to buy in, average down, and sell. I therefore opted instead to publish a daily newsletter instead of positing on Reddit. \n\nPeople on Reddit are buying what they don't understand from people they ought not to trust. A great deal of DD on Reddit only comes about when some poor fella is bag holding deep and suddenly realizes that he/she wants to share the amazing value with the world under a misguided understanding that they may be able to generate undue interest in the stock. DD on Reddit is bag holders paradise. Remember more recently when SNAP, WISH, or PTON dumped on very poor earnings? Did you happen to notice all the DD that was posted days to weeks after? Those were bag holders folks. In part, their anxiety from their losses led them to the desperation of taking to Reddit to pitch trash. \n\nReddit is a trash heap of poorly written \"DD\" and bad advice. For every solid bit of analysis found on reddit there are thousands of poorly written items that are neither \"due\" nor \"diligent.\" How much \"DD\" have you seen posted, for example, with absolutely no consideration for the risk factors? If they're missing a risk section can we honestly say they're being \"diligent\" ... or are they just trying to pump a stock? And there are plenty of new retail traders who have absolutely no clue what they're doing for these fellas to prey on. \n\nThere is a reasons so many new retail traders are taking to Reddit for answers. Reddit has received a lot of attention in the media as a result of the GME/AMC fiasco. So new retail traders see Reddit as a place to look for guidance, but instead of guidance, they end up looking for profit in a sea of bad advice. Many are new to the market, they do not know how to read the financials, they do not know how to assess economic conditions, and they do not know how to read/assess (or even find) 10-K's, 10-Q's, 8-K's, earnings calls, etc... They do not know how to value a company, how to identify entry &amp; exit points, how to assess debt,  how to conduct competitive analysis and some even think technical analysis is all you need. They do not know how to assess trailing PE, forward PE, PB, BVPS, PEG, current ratios, PS, Enterprise Value, GAAP EPS, NON GAAP EPS, operating margin, and the list goes on &amp; on &amp; on. And even if they could somewhat do all of this, they don't have the time. So what's the result? ... Massive amounts of confusion, massive amounts of ignorance, and massive amounts of the fear of the unknown.\n\n# Fear of the Unknown is the Number One Reason for Trader Anxiety: \n\nThe reason that most of you  suffer from trading anxiety is a lack of confidence in your picks which leads to a great deal of fear of the unknown. And there is only one way to eliminate the fear of the unknown. ELEMINATE TO THE GREATEST EXTENT POSSIBLE THE UNKNOWN. And if you're are trying to eliminate the unknown through scrolling through insufficient DD posts on reddit, then your anxiety will likely be amplified when you suddenly find out that most of your trades will fail. \n\n# Eliminating the Unknown will Eliminate Anxiety: \n\nBefore I retired, I spent 8 years in the Marines as an Infantryman and 13 years in the Army as an intelligence analyst. I've been on the receiving end of information and the production end of information. I've seen the horrible results of bad information, and the absolutely amazing successes in good information. In my experience analysis should overwhelmingly be risk based. Assessing and mitigating risk in my former line of work meant an increased likelihood of mission success, friendly lives saved, and civilian lives saved. The less risk you assess the higher the threat, and therefore, the higher the anxiety. I approach trading in the same fashion. And I know from experience the largest risks come from the unknowns. Learning to identify and spot those unknowns comes largely from experience but you need to begin somewhere. There are 3 types of unknowns. \n\n* **Known Unknows:** These are the items you know you do not know. The overwhelming amount of your effort when assessing an equity is dedicated to filling in the gaps of those items you know you do not know, but would like to know. And much of it is easy to find, but what if you can't? There are many cases in which you would like to know something but the information is not available. In those cases you look for indicators of the information requirements you need to make your case.\n* **Unknown Knowns:** These are things you know, but either forgot you knew, or failed to apply it to your analysis. To remedy this you simply need to critically think about what you know and how it applies to your analysis.\n* **Unknown Unknowns:** This is perhaps the most dangerous, as it is ALMOST completely derived from ignorance. The more ignorant we are on a certain subject matter the more we run into unknown unknowns. Once you've started on your known knowns, identified your known unknowns (and their indicators), assessed your unknown knowns, you draw your attention to the unknown unknowns. Essentially this is asking \"what the hell am I missing and where can I go to find it,\" or \"where can I look to find the things I do not know I'm missing?\"\n\n# Eliminating the Unknown and Mitigating Anxiety: \n\nInvesting first and researching later is no way to go about business and it can greatly increase your anxiety! The more you know about your company and the current and future economic conditions, the less anxiety you will have. \n\n* **Assessing the Know Knowns:** When you begin your analysis you will always start with assessing what you know. You know, that no matter what company you're looking at, you will generally want the following:\n   * A forward PE (Price to Earnings) that is lower than the trailing PE, unless you think the market forward PE consensus is wrong. \n   * A PE that is relatively lower than sector/industry peers unless you are expecting massive growth.\n   * A BV (Book Value) and BVPS (Book Value Per Share) that is closer to the market cap/share price as possible as compared to industry peers.\n   * A PS (Price to Sales) ratio of one or less (ideally less than industry/sector peers) of unless, once again, you're expecting massive future growth. \n   * A PEG (Price to Earnings Growth) ratio of one or less unless you are pricing in massive growth (Few if any tech companies have a PEG ratio less than one).\n   * An enterprise value that is near, or higher than, market cap. Unless, once again, you are expecting massive growth. Companies that have a enterprise value significantly lower than market cap can be possible buyout opportunities. \n   * Manageable debt relatively lower than industry peers. (A current ratio above 1 but lower than 5)\n   * The company can pay their dividend (see payout ratio) \n   * A solid amount of cash on hand.\n   * Moderate to high amounts of institutional investment.\n   * A solid and growing operating cash flow and operating margin.\n   * Increasing YoY Quarterly Revenue Growth and YoY Quarterly EPS Growth.\n   * Trading at a value on a pullback of no negative consequence.\n   * Solid forward guidance\n   * A history of insider confidence through insider buying\n   * Solid buy rating analyst coverage and upgrades (Take it with a grain of salt, there are more shitty analysts out there than stars in the sky). \n   * Share buybacks are always nice\n* **Eliminating Unknowns About the Company:** You can never eliminate all the unknowns about the company. But you can ask yourself the following:\n   * Is the company at risk for an offering?\n   * Can future revenues cover additional debt and reinvestment?\n   * What are the chances the company does not preform as expected? \n   * How critical will it be for my investment if the company misses EPS projections? Its an important question to ask. Companies underperform EPS all the time amid earnings. More often than not it means the company is still growing, just not at the rate analysts expected. For most profitable companies, missing EPS projections does NOT mean the company isn't profitable. Companies with a positive EPS should typically be better off this quarter on the books than the previous quarter. \n   * Is the company's goals realistic and obtainable?\n   * Is the company under or over shooting projected guidance?\n   * Are analysts under or over shooting guidance?\n   * Is the space the company competes in overcrowded?\n   * Is the company losing or gaining market share as compared to competitors?\n   * Does the company have a competitive advantage or disadvantage?\n* **Eliminating Unknowns About the Current and Future Economic Conditions:** This can be tough but at minimum you should study current and [upcoming economic datasets](https://tradingeconomics.com/) and ask how a positive or negative change in the various categories affects your company. You will also want to come up with your own short, medium, and long term projection of economic conditions and how they will affect your company. Always pay attention to the [economic calendar](https://www.reddit.com/r/StockMarket/comments/qsubyk/next_weeks_economic_calendar_1115202111222021/)!\n   * Inflation Rate (Low is good for preventing dramatic shifts in personal spending, high id good for paying off long term debt)\n   * Semiconductor Shortage\n   * Worker Shortage (Can they meet demand with the workers they got? If not can they beat previous quarters EPS with the workers they got?)\n   * Supply Chain Bottlenecks (Check their domestic inventories as a solid indicator of how affected they are by this)\n   * Rising fuel and Energy Costs\n   * Rising Shipping Costs\n   * Government &amp; Regulatory Environment\n   * Federal Reserve Policy\n   * Reliance on China and Chinese Economic/Regulatory Environment\n   * Unemployment Rate and Labor Force Participation Rate (Too high less people are buying, too low and the cost of labor goes up)\n   * Always Pay Close Attention to the [ECONOMIC CALANDER](https://www.reddit.com/r/StockMarket/comments/qsubyk/next_weeks_economic_calendar_1115202111222021/) and the results reported!\n\n# Perspective and Expectation Management Also Mitigates Anxiety:\n\nIt's gonna go to the moooooon!!!! No it isn't! Read my part on Big money below to find out why. It's important that you have reasonable expectations. It's important that you have a decent and realistic perspective on the outcome of your trade. Doing this will go leaps and bounds toward mitigating your anxiety. \n\n* **There is NO Such thing as a Perfect Stock:**  If your anxiety is so through the roof that you're forgoing great trades on good companies, cut that shit out! There is no such thing as a perfect stock and you will always need to accept a certain degree of risk! \n* **Do not Sweat Minor Misses in EPS:** You're company barely missed analysts EPS or Revenue Expectations? So what!!?? Are they profitable? Are they growing? If they had positive revenue or EPS, chances are they're still growing on the books. Sure their rate of growth may have changed but they're adding money to the balance sheet! It would be one thing if they lowered guidance, but short of that a small EPS miss isn't nothing to frown upon and might put you in the position to buy some more stock for a cheaper price on a really good company! If holding a little longer gives you anxiety then its because you're attempting to get money quick by swinging trades, which is fine, but can add an additional layer of anxiety. \n* **Expect the Unexpected and Have a Plan:** Black Swans happen. Major unexpected economic shifts happen. Your dry bulk carrier will catch fire or lose their cargo in the ocean. Oil companies will have spills. Companies get sued all the time. Adjusted economic numbers come out every day of the week. Your stock WILL NOT trade as everyone expects it to. Get used to this and you will mitigate your anxiety. Buy in slowly and have a plan, and you will mitigate it even more. \n* **Analysts are Always Wrong:** Firstly it is important to understand that analyst price targets are where the analyst expects the stock to be in a year or so. Not right now. I see a lot of retail traders complaining about the company share price not being at the analyst price target. Its ridiculous expectation management!\n* **Understand how Big Money Operates and Expect their Antics!:**  When large institutions dealing in millions to billions of dollars decide to buy or sell a stock, they are well aware that they will inevitably move the share price. The volume they create can be massive. To mitigate this they will either sell calls or buy puts when they sell a considerable lot of shares, or buy calls or sell puts when they buy a considerable lot of shares. Therefore it is important to understand that institutions can often make money no matter which way the stock trades. Unlike most retail traders they even have the option to go both long &amp; short on the same security at the same time. They can, &amp; do, often go short to take advantage of the bearish sentiment they inevitably create while selling large blocks of shares while locking in their profit using a combination of options strategies. Always remember that retail does not own the market … big money does. This reality forces us to come to grips with the necessity not to fight them, but to ride their backs. This includes having the discipline &amp; courage of our convictions to hold through the bearish sentiment institutions inevitably create, on perfectly good companies, when some big firm takes profit. Consider retail traders like ourselves the small Remora Fish attached to a large Great White Shark (The Institutions), waiting to ride their backs out of but a temporary rut of no true consequence. \n* **Trading Psychology:** Psychology plays a large part of why stocks can continue to trade below street value. Once a stock sells off due to large institutional profit taking, the street wonders why. Does someone know something we don’t? Was there some economic data that cast bearish sentiment on this particular industry or sector? Does the street expect the company to act in a way that will lower its valuation? Such questions, &amp; many more, aren’t just asked by us. They’re asked by everyone who holds a position in the company we do. Even analysts may downgrade a stock for no other reason than to tailor their expectations a year out from now. Indeed they hate to be wrong, &amp; they always are. So do not be surprised not only when a security we thought was already undervalued sells off further than expected, but also stays down as it may take time for traders to feel comfortable entering again. Corrections back to street value can often take a few weeks to a few months. Sometimes until next earnings to relive fears of both retail &amp; large institutions. \n\n# Processes Mitigate Anxiety:\n\nProcesses mitigate anxiety. The more efficient the process the less time you spend searching for places to put that money that's burning a hole in your pocket. Some traders feel as though they are in a rush to hurry up and strike while the iron is hot and put their money somewhere only to find out that  they rushed their trades and realized a loss. Below is my process and a few additional pointers for researching equities and it mitigates A LOT of my personal trader anxiety. \n\n1. **Assess the Economic Conditions First!:** Assessing the economic conditions first grants you the opportunity to single out those sectors that stand to benefit the most from current and future economic conditions. If you do not know how to do this please see an earlier post I made on this very topic [HERE](https://www.reddit.com/r/investing/comments/qrtkox/understanding_and_profiting_from_our_current/). Also investing in companies that stand to benefit the most from economic conditions gives you an extra layer of confidence to fight anxiety. \n2. **Make a Price Based Assessment Watchlist and Set your Alerts:** A Price Based Assessment Watchlist is simply adding companies that you've 1. Assessed the Current or Future Economic Conditions as Favorable. 2. Done a Quick Review of the [Company Financials](https://stocktipstips.substack.com/p/stocktips-investment-research-series). 3. Set your alert at your desired reassessment price. ONLY when that alert hits is when you do the rest of your research and DD. That way you ONLY use your valuable time on the most promising of circumstances. That way you aren't frantically searching and scrolling for plays, but letting the plays come to you, which helps with anxiety!\n3. **Buy on a Pullback of Little to No Negative Consequence:** I love a good dump. Perhaps it comes from a bad market day, perhaps it comes from the sector in general doing poorly that day, and perhaps it comes from a whale taking profit. I don't care. If the financials are great, I expect them to grow, and the economic conditions are favorable, such a pullback will trigger my buy alerts letting me know its time for a starter position. But first I do a quick assessment to see if there is any recent negative news that is driving down the share price. If there is negative news, I ask myself to what degree is the news of legitimate financial substance to the growth prospects of the company. If very little, I'll be happy to buy that dip. Some would argue that they want to jump in on solid relative strength. Yeah ... they're chasing and I don't chase. I like it when its cold, not when its hot. Later, when my thesis becomes true, then it gets hot and I watch everyone else chase. But buying on a pullback of little to no consequence will give you that extra layer of value and security you may have been looking for. You wont be worried if the security is over pumped and about to fall, but rather patiently waiting for it to pump again. I think the latter of the two holds less anxiety. More profitable too!\n4. **Keep Track of the News:** If you want to monitor your investments stop looking at the chart and read all the news that comes out on your company. Two good places to do this are seeking alpha (Put the ticker in and click the news tab) and, believe it or not, StockTwits! The bots and the news scroller on StockTwits are money! Ignore the people there, read the news scroller! Also set prices you want to review 5% above or below your starter position price and program your broker app to alert you when they hit those points. Its a lot more easy to go about your day that way, and waaay less anxiety when you can be rest assured that at minimum you have lost too much. \n\n# Anxiety Mitigating Rules to Live by:\n\nSome added anxiety killing tips!\n\n* **If you aren't willing to hold the stock long term, stay away from it!:** So you think you're going to swing it real quick and get out so you don't need to put too much effort into the trade? Think again. The technical analysis guru on YouTube may have a pretty set up, but he's going to throw your anxiety through the roof. And only IF you're lucky, you MAY make a profit. \n* **Quit Checking your Phone, Set Alerts Instead:** Set share price points where you want to be alerted and quit checking your phone. I promise you that your anxiety is really going to increase when you're fired from work because you spend too much time checking your investments and too little time getting anything done. \n* **Stay Away from Risky Options Strategies:** So you wanted to get rich quick so you bough a bunch of naked calls or puts? All or nothing baby!! Well there goes your anxiety. The more professional you are with options the less anxiety you'll have.\n* **Be a Net Options Seller:** Covered calls while you're waiting for your position to turn over long periods of time is a great idea. Its like getting a free dividend and it lowers your cost basis. I've been selling POWW calls for the last three months and in addition to profiting from the increase in share price, I've cashed in $0.56 in premium per share, an 9% gain on the overall position on options premium alone. At this point I don't care how the stock trades. Talk about low anxiety huh? I'll sell calls till the cows come home and if the shareprice on the last day before expiry is slightly over the strike on the calls I sold, pending I want to hold on to the shares I'll just roll the options to another month for additional premium. Furthermore when I can't get a stock for the price I want I often just sell an in the money cash secured put if the options premium is worth it. Lets say a stock is trading for $6.00 but the $7.50 strike put is trading for $2.70. That means the real price to me if assigned is $4.80 per share. Talk about a steal! I'll sell that contract all day every day! And with practically no anxiety. \n* **Don't buy in all at once, do NOT chase!:** Don't just throw in a full allocation all at once on a stock. Rather establish a starter position and buy in slowly in the red. This will greatly lower your cost average and increase your profitability. For example, if you established a starter position but now you find yourself down 5%, you can just buy an equally sized position and now you only need the stock to increase 2.5% to recover from your loss. Does this help with your anxiety? You bet it does! Finally, if the stock skyrockets don't chase it. Enjoy the profit and move on. Chasing has been the windowmaker of plenty of traders ... particularly in the penny stock world. \n* **Stay away from unprofitable companies and Penny Stocks:** This speaks for itself. I have analyzed a the risk on a bunch of penstocks. And unprofitable companies can often disappoint. Indeed the volatility is there, and there is profit to be made amid volatility. However trust me when I tell you that if you are reading this, it means you likely need help in your trading habits, and you should just stay away from penny stocks and unprofitable companies. \n* **BUY RELIABLY RPOFITABLE COMPANIES PRIMED FOR GROWTH, TRADING AT A SECTOR RELATIVE VALUE, ON A PULLBACK OF NO NEGATIVE CONSEQUENCE, WITH A DECENT AMOUNT OF INSTITUTIONAL INVESTMENT, UNDER FAVORABLE ECONOMIC CONDITIONS!:** Swing for grand slams and you'll strike out, or ground out nearly every time. Swing for base hits and you'll hit base hits, home runs, and grand slams on a very regular basis!\n\n# You will NEVER Get Rid of All of your Anxiety:\n\nIts got to be said! You will never get rid of all of your anxiety. You just put a significant amount of cash you worked hard for into shares of a company subject to both positive and negative market forces. There will always be unknowns. Therefore, there will always be anxiety. \n\n**TL;DR:** First, I HIGHLY suggest you read this if you fee that you are the target audience. The thesis above speaks to the fact that anxiety in trading largely comes from the unknown, &amp; the more you mitigate the unknown the less anxiety you will experience. Above there are plenty of steps you can do to mitigate the unknown, thereby developing your confidence, and become a more profitable trader. I also argue that you can mitigate a large portion of your anxiety simply by understanding what you're buying in an equity, understand the markets, understanding trading techniques, developing a sense of perspective, and buying \"*reliably profitable companies, primed for growth, trading a sector relative value, on pullback of little to no negative consequence, with a decent amount of institutional investment, under favorable economic conditions.*\" This post is for people serious about mitigating their anxiety and learnings how to trade in a manner that will benefit both their mental health and their wallets. In summary, if traders respect their own money and do what they're supposed to do, it will go a long way to mitigating anxiety. \n\nNote: I'm going to publish this now. I will correct some additional typos and update as necessary.",
        "subreddit": "StockMarket",
        "title": "Understanding and Attacking Trader Anxiety: (A Long Read For Serious Traders who Have Issues with Trader Anxiety)",
        "url": "https://www.reddit.com/r/StockMarket/comments/qtan98/understanding_and_attacking_trader_anxiety_a_long/",
        "created": 1636867915.0
    },
    {
        "author": "Sad_Umbreon",
        "created_utc": 1638225343,
        "id": "r57m25",
        "num_comments": 96,
        "num_crossposts": 0,
        "selftext": "So, first things first let me get my investing background out of the way. I am 21, and relatively new. I started around April of this year, but I've been eyeing the stock market for a while, since I was 17, but since I didn't have a stable income stream, I couldn't invest until recently. I heard about meme stocks but as I knew I wanted to be an index investor. First I bought VOO then moved to VTI. I was a boglehead at heart and still am, more or less.  Also, when I say things such as \"This cannot happen\", it really means \"In my opinion, this cannot happen.\" I figured it'd be obvious from now on that this is mostly just my opinion. I'm not saying I'm 100% right, but I figured since it'd be annoying to constantly repeat, \"this is my opinion\", I'd mention this nonetheless. ***Since this is a Long post, if you'd like, just see if you find your argument in bold, as I tried to go over the main counter-arguments for them.***\n\nI, like many others, have discovered LETFs, but people scare people away from truly investing in them while spouting the same repeated things, ad nauseum. I also have seen a lot of TQQQ posts recently, which.... lowkey brings up alarm bells. If history truly does repeat itself, people used the hell out of leverage and LETFs during the dot-com bubble and the 2008 crash.. With all the talk of the market being in a bubble (And for the record, when i mention \"the market\", I strictly mean the S&amp;P 500, or VOO/SPY), then then yikes..? But nonetheless I haven't quite seen anything thoroughly in depth, which is what I strive to do with this post. So, if I succeeded, let me know at the end. I'm not going to cut corners, as I've mentioned in the title. This will be long, so get some snacks if you'd like.\n\nAnyway, speaking of crashes, people often say stuff like:***\"What about Dot-Com crash and 2008? You'd still be at a loss today from the dot-com crash if TQQQ existed back then!\"***  \n[True](https://i.imgur.com/1fmpmxW.png)... But, let's go over why one is not like the other: The dot-com bubble is not what TQQQ is currently. Some parts of the market, such as electric vehicle companies such as RIVN, TESLA, NKLA, meme stocks such as GME, AMC, or some penny stocks may be in a bubble, but the market as a whole is not in a bubble. It may head for a correction, but the whole reason why the Dot-Com Bubble popped was because the market was euphoric, with P/E ratios completely bonkers for the companies that are essentially garbage. Take this [chart](https://images.thinkadvisor.com/contrib/content/uploads/sites/415/2020/12/cape.jpg) showcasing how absurdly high the Shiller P/E ratio around 2001 was. It's \\*still way higher\\* than even now, with companies that are much more profitable, mature, and robust than ever before. Instead of random companies that have never sold anything before (Ouch, I know RIVN exists y'all.. I already said it's a bubble stock. But the market as a whole...? Not at all), you have companies like Apple, Amazon, FB/Meta, Microsoft, etc. I mean, I could go on and on about the amazing companies that are currently in the S&amp;P 500. While yes, people thought the same about things like Blockbuster, Nokia, Enron, these companies are at completely different stages in terms of profitability, maturity, and/or diversity in assets entirely.\n\nWhile, sure, anything can happen to, say, Apple -or even multiple companies- if you take ***index investing seriously, and buy/hold, you will statistically always come out on top in the long run.***   \nThis is simply due to the fact that index investing in the broad market is diversified, and has great companies. It's so simple, yet so effective. On top of that, the risk that the majority of companies in the S&amp;P 500 go bankrupt like in 2001 is just so insanely small, that if that were to be the case, something \\*terribly, terribly wrong\\* is happening to America, if not the entire world due to how globalized the companies in the index are. Trust me, if your boomer stocks such as KO, JNJ, and even stuff like Microsoft and Amazon go under, it doesn't matter what you invested in. Everything is on fire. This is essentially the idea of investing in the index in the first place. If you are able to worry about if the market is down, you don't have it bad enough, and it's going to be alright in the long term. This, combined with everything else I said, more or less ensures that investing into something like VOO/UPRO won't have such a gigantic crash such as before. As cliche as it may sound, \\*This time truly is different\\*... For this anyway. Besides, due to how LETF's are, I would argue it's actually better to \\*DCA\\* instead of Lump sum, or at least continue to DCA after a huge draw-down so the draw-up roars louder and harder. There's a difference between DCA into an LETF just like you would with VTI and just putting all 100k of your retirement at once into a market environment with a lot of companies that never have made any profitability at all when you're 2 years away from retirement\n\n***\"So, Okay, what about 2008 then?\"***  \n[Well...](https://i.imgur.com/hXj9RnA.png) It's not pretty. But that's entirely the point of LETF's. They amplify, and compound gains and losses. But you'd still have recovered through a 90% drawdown in just... in 4-5 years. If you are able to stomach it, which you \\*should mentally expect and prepare for\\* during such a thing, and continue to DCA (which this only tests a lump sum), you essentially are loading up your weapons for the next bull market. And when the bull market comes, it roars loud and clear with LETF's. The thing people might think with LETF's is that they're \"beginner traps\", or that \"they seem too good to be true\". Really, they're \"risky\" extremely volatile. With a lot of things in investing, risk/reward is a big thing. For example, bonds are low-risk, low-reward typically. VTI is considered low-medium risk, low-medium reward. TQQQ/UPRO is high-risk/High-reward, and managing your risk is how you can mitigate the downs, should anything like it happen again. If you're able to handle 90%+ drawdowns, sure, you can have 90%+ rallies. In fact, though, 2008 is one of the big reasons why QE is such a huge influence in the market. It seems like \"The Fed\" will do whatever it can to save the market. So, while 2008 probably won't happen again, an event similar to it (such as 2020) may happen again. But it probably won't be as bad, last for as long, and may recover quicker.\n\n***\"But what about Volatility Decay? If the price of $100 goes up 10%, then down $10, you lost money! It's simple math!\"***  \nYeah? That is just simple math. I've seen this repeated so many times as an argument against LETF's. It's not really an argument as the same goes for unleveraged ETF's such as VTI as well. Sure, while Index XYZ would be at 99, the 3x XYZ would be at 91. But, what exactly does that look like? [Well](https://assets.website-files.com/617960145ff34f911afe7243/617960145ff34f0fcdfe79eb_5ed6befa9e2f6d4f2c1095c7_pic-3.png), it certainly looks very odd to say the least. I've never had anybody bring up any real examples of decay eating away LETF's long term. Sure, \\*theoretically\\* if the market just goes up and down the exact same amount every single day forever then sure, but \\*theoretically\\* I can easily Mike Tyson in a fight if I just perfectly dodge every attack and never get hit. Realistically though, that will never happen. It's technically \\*possible\\*, but hypotheticals and theoreticals oftentimes have no place in reality. Sideways trading does happen quite a bit on a day-to-day scale, but there's quite a few days/months that on average in the stock market where they account for a good chunk of gains. This is why the saying, \"Time in the market beats timing the market\", because if you do somehow get in at the perfect time, you could have missed out some really, really, REALLY great days that would have still made you go up regardless.\n\n***\"What about if the market drops 34% in a day?! You lose everything\"***  \nYes/No. Yes, theoretically/hypothetically, the math tells you you would. But realistically there are circuit breakers on basically everything. From futures, to the market, to whatever else you can think of, there are circuit breakers that stop trading so that at any point, a drawdown of such a magnitude is next to impossible at all. As far as I know, historically, such a thing has never happened. There have been some pretty nasty drawdowns, but nothing of that magnitude. Furthermore, you need to ask yourself a simple question: If we've had such a crazy bull market, why haven't inverse LETF's just went tits up? Surely the math would point to them fizzling out right? I mean, take SQQQ, a 3x inverse of QQQ. But in the real world scenarios, with real world people, these LETF's are actively managed, which means they'll do whatever they can to keep it afloat. For example, SQQQ does reverse splits keep it alive. While SQQQ has basically killed all your money if you bought it and held, that's the same for most inverse ETF's. It doesn't have anything to do with leverage.\n\n***\"So, what about a prolonged bear market such as the Great Depression??\"***  \nSo, I don't mean to pull the \"ThIs TiMe Is DiFFeReNT\" shlick, but truthfully, comparing 1920s america to 2020's america is like comparing modern cars to 1920's cars. Sure they both drive but they're entirely different beasts. Oftentimes, it's better to bring up averages, rather than extremes, as extremes are usually outliers. Even if they are possible, they're rarely ever going to happen. Again, This is why something such as 2008 is a better argument against LETF's than say, the dot-com bubble, but even then, 2008 eventually recovered. Combine those things, plus the willingness of The Fed to just woosh in and save the market, it's very unlikely such an event will happen again. One important fact to remember is that, on average:\n\n***The average length of a Bull/Bear market is 2.7 years and 9.6 months respectively***  \nThis is the whole crux as to why holding something such as VTI/VOO wins long term. You simply have more up days than down days, on average. If you truly are a believer in the sentiment that bull markets will last longer and that the market will continue to be profitable, while bear markets will be significantly shorter, it's a no-brainer to invest in VTI/VOO, just like it is to invest in TQQQ, once you learn the risks and differences of leveraged ETF's compared to regular ETF's. This also brings me back to my next point:\n\n***If you followed Benjamin Graham's book on the Intelligent Investor, \"Mr. Market\" is described as irrational and too optimistic or pessimistic.***  \nAlong with creating the fundamental investing advice, and being labelled as \"probably the most important and influential value investing book ever written\" by Warren Buffet himself, Graham describes Mr Market as an analogy for market sentiment. Use this to your advantage. On any bad news about something, the market, instead of being perfectly \"efficient\", will be incredibly \"bipolar\", swinging from one pendulum of extreme, either being optimistic or pessimistic. This means when the market dips, it will dip \\*hard\\*, and when it rallies, it will rally \\*high\\*. You can clearly see this currently with the current bull market. People complain that it's too high, or a bubble. Really, that's just the market sentiment. No wonder it's extreme. It's purely the collective emotion of greed compared to fear. Not \"pure raw logic and wits and math and calculations\". The saying goes, \"be fearful when others are greedy and greedy when others are fearful\", not \"be robotic and logical\". Another great saying is \"The market can remain irrational longer than you can remain solvent\". Truth is, the market is irrational. Extremely so.\n\nWith all this being said, these were most of the argument's I've heard against LETF's. LETF's are all about risk-management. For example, when I brought up someone who is buying 100k worth of TQQQ in 2001 two years before retirement, that's for a reason. Due to me being 21, and somewhat little to somewhat moderate cash invested into TQQQ, *due to it being leveraged, even a small amount can turn into a large sum.* For example, *if you invested 5k in 2010, reinvesting your little dividends you earn from TQQQ, you'd have over 400k today.* This is the power of leverage in great companies. with as little as 5k you can \"gamble\", if you really think it's a gamble. Personally, I think a gamble is 5k in GME right now. Investing into the top companies in the nasdaq, leveraged or not, is way less of a gamble, if at all. Having a long time horizon especially helps, which for high/risk high/reward plays, is definitely an advantage. This is why I would not recommend someone who is two years from retirement to put money they need into leveraged funds. They are inherently, amplified in volatility. Entering at the wrong time, and not having enough time to DCA back in can be devastating.\n\n***If, however, you need a hedge due to your risk tolerance, or having a large sum into TQQQ, you can use 55% TQQQ/UPRO / 45% TMF***  \nThis is also another thing I rarely see mentioned. It's more mentioned from people using TQQQ/UPRO or other LETF's, but people act like you just go 100% into TQQQ without a hedge and call it a day. Realistically, you can do so much with portfolios. For simplicity sake, TMF, a 3x bonds index, hedges great with TQQQ/UPRO, due to being \\*uncorrelated\\* in most timeframes. For example, when people get scared of something such as say.. I don't know.....? A new Covid Variant called the Omicron, they flock to save bets such as bonds. This means that as TQQQ goes down, TMF will go up. You can actually see it clear as day during last Friday, and especially other days as well. While TQQQ took a beating, TQQQ/TMF was actually up. While, sure, pure 100% TQQQ beats TQQQ/TMF, but if you can't handle the drawdowns or need a hedge, it's well, well worth it. This strategy is called ***HedgeFundies Excellent Adventure,*** *or* ***HFEA*** for short. I won't go over it much due to it being exhaustively gone over, but on the bogleheads site, there's a thread for it already, which you can take a look at them here, [Part I](https://www.bogleheads.org/forum/viewtopic.php?t=288192) and [Part II](https://www.bogleheads.org/forum/viewtopic.php?t=288192) here.\n\nAnyways, In short, why I'm 100% investing in TQQQ and soon to hedge with TMF once I reach a sizable sum is simply for multiple reasons. I disagree with plenty of the arguments I've heard about LETF's, I'm 21, have a long time horizon, and I'm willing to take risks such as leverage in ETF's to turn a small sum such as 5k, 10k, or 15k into something hopefully huge later down the line. Then once I finally hit a good amount, if I ever do, I'll then invest back into VTI/VOO and let the dividends compound more than I ever could DCA into. Truth be told, even I'm terrified of holding 500k worth of TQQQ, \\*maybe\\* even with a hedge. That's the short of it.\n\nThere's also nothing stopping someone from just going 10% TQQQ as well. Even though the prospectus of every LETF says not to buy/hold as they're only for daily leveraged returns, nobody is stopping you from holding it and seeing what happens. Some people just want to take it farther than others, myself included.",
        "subreddit": "stocks",
        "title": "[Long post DD] Why I'm buy/holding 100% TQQQ for long term",
        "url": "https://www.reddit.com/r/stocks/comments/r57m25/long_post_dd_why_im_buyholding_100_tqqq_for_long/",
        "created": 1638254143.0
    },
    {
        "author": "vegancash",
        "created_utc": 1636600966,
        "id": "qrbnf5",
        "num_comments": 92,
        "num_crossposts": 0,
        "selftext": " \n\nhttps://preview.redd.it/fs7gzbu5xvy71.jpg?width=419&amp;format=pjpg&amp;auto=webp&amp;s=d3afdaaa3c81f33fe409e66212b230eae8fcc7ff\n\nOk, listen apes, let’s just put $TSLA aside for the sake of this argument as it is an outliner and I’m not saying $F nor $GM should be given a valuation similar to $TSLA. It’s obvious they can’t as they don’t have king Elon.\n\nToday, Rivian just went public (Nov 11th) and jump from $78 to over $100 per share valuing the company over $85B. It is worth more than $F ($77B) and as much as $GM($86B).  Even $LCID ($65B) is almost as valuable as $F. Yet, Rivian (and $LCID)  is operating at a loss, sold way less EVs than these two legacy auto companies, yet wallstreets are giving them a way higher and richer valuation than these two.\n\nSo what’s gives?  It appear wallstreets are not interested in their boring and old internal combustion engine (ICE) products, no matter how profitable they are.  As long as ICE are lumped into EVs, $F and $GM can never be seen as a tech and/or growth company as ICE is old technology. Since ICE currently generates the bulk of its revenue and profit, this makes it really hard (and confusing) for wallstreet to see them as a tech company to give it a higher valuation.  Therefore, to exponentially unlock hundreds of billions of dollars from these two, they need to be spun off, or split from their parent company. As you probably know by now, $GE is beginning to realize that and is planning to split in 3 after a couple decades of being a one-size fit all giant.  United Technologies split up a while back to become Otis, Carrier and Raytheon (through merger) and the sum of these 3 surely worth more than they are combined. \n\n**So How?**\n\nTake $GM as an example.  Morgan Stanley’s Adam Jonas once describe what he call “SPACtopus” (see image below) and how he believed if GM spin off any of these divisions, they’ll have discrete value and perhaps worth more separately.  ([https://finance.yahoo.com/news/morgan-stanley-sees-gm-spa-ctopus-taking-on-ev-market-185152539.html](https://finance.yahoo.com/news/morgan-stanley-sees-gm-spa-ctopus-taking-on-ev-market-185152539.html))\n\n&amp;#x200B;\n\nhttps://preview.redd.it/t2uwsav9xvy71.jpg?width=705&amp;format=pjpg&amp;auto=webp&amp;s=47a1a737f5129f7f8a814e04a86ebd930bdd2b89\n\nObviously, the Cruise and EV/Ultium divisions at least would be given a higher valuation as they would be considered a growth tech.  As long as legacy businesses are lump in with the tech it is too hard for wallstreet to value the company as a whole.\n\nThe stand-alone EV division of $GM and  $F  SHOULD be worth more than Rivian. Now since even if $GM or$F spin off their EV division, this separate division will likely operate as a loss. So it would be hard to compare and value them with Rivian (also operating as a loss) on EPS. How about if we value them based on their sales or backlog of orders to show growth? After all, growth is what companies get reward for on wallstreets.\n\nNow for comparison sake, let's consider $F EV division only (excluding ICE, financial, etc) and Rivian.  Rivian  delivered so far.. 50? 60? trucks and have backlog order of 55,000 trucks + 100,000 Amazon vans.  $F have already delivered over 47,000 Mustang Mach E  EV to date and last month sold over 2,800+ Mache E.  Then there are 160,000+ pre-order/backlog for the F-150 Lightning and an unknown sold out number of electric Transit Connect.\n\nBased on the numbers of EV deliveries and backlog orders alone (forget about profit/revenue for now as both are likely to be unprofitable for the time being), without question $F EV as a stand alone company will be worth more than Rivian.  And on top of that all the other divisions of $F are just icing on the cake. As ridiculous as it may sound, $F EV division as a stand alone is worth even more than all the $F combined. Think about that for a second. Because as a combined company wallstreets find it really hard to evaluate $F growth. As a stand alone, wallstreets can see clearly how $F EV is growing compare to sat Rivian.\n\n**The Plan to Unlock Value in $F and $GM: Pull an ‘Eugine No. 1’**\n\nIf you don’t know what Eugine No. 1 is, they are an unheard of activist firm that took a tiny stake in Exxon Mobil $XOM and force it to fight climate change and reduce carbon emission. Really? Yes, and I’m not kidding:\n\n[https://www.cnbc.com/2021/09/03/engine-no-1-takes-climate-fight-to-other-big-oil-companies-after-underdog-win-at-exxon.html](https://www.cnbc.com/2021/09/03/engine-no-1-takes-climate-fight-to-other-big-oil-companies-after-underdog-win-at-exxon.html)\n\nThey do this by winning the proxy vote and elect directors/board seats who will advocate for the changes they want.  Now that Eugine No 1 has won out, $XOM has no choice but to come up with some plan to fight climate change.  Had Eugine No 1 not done this, $XOM would have not tried hard like other oil companies such as Shell or BP, going more green or investing in cleaner energies which both companies have.\n\nSo what we really need to do is pull an ‘Eugine No 1’. Somehow we need to put up a proxy vote. We could, but not necessarily nominate a board member, but can put up a resolution (i.e. spin off or separate EV business) which can also be impactful.  As shareholders we are owners of the company and publicly traded companies have to report to their shareholders. If a majority of shareholders agrees, it will force the company’s hand.  \n\nI can’t speak for everyone, but if those of you apes who agree with me that both $F and $GM is a value trap, we can help to unlock shareholder values by forcing the company to do so.  $GM may be easier to force to change as $F has a voting structure in which the family owns a huge chuck of votes.  However, even if we lose the proxy vote, any news/rumors of spinning off the EV division (even if it is not going to happen) will definitely push shares higher. So it is a win-win even if we win or lose.\n\nNow you apes have been known to do the impossible, like sending stocks that hedge funds and analysis say are worthless or a piece of shit ( $GME and $AMC ), to the moon.  We can do this, if enough apes buy shares in $F and $GM and someone proposes a spin-off on a proxy vote resolution.  If enough apes on /WSB agrees, we can make the changes and finally unlock hidden values in $F and $GM. I’m more than sure that there are a lot of other shareholders who agree, but we need an ape to pull an Engine No 1 to get the ball rolling.\n\nDisclaimer: Blah blah and blah, I’m not a financial advisor. I’m an ape with a laptop and an internet connection. No part of what I wrote should be construed as advice, and you should not take anything that is said here as investment or financial advice. \n\nDisclosure: I own $F, $GM and Rivian.",
        "subreddit": "wallstreetbets",
        "title": "Unlocking Hundreds of Billions (if not Trillions) in Value of $F and $GM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qrbnf5/unlocking_hundreds_of_billions_if_not_trillions/",
        "created": 1636629766.0
    },
    {
        "author": "lazywizard99",
        "created_utc": 1636381390,
        "id": "qpeo2q",
        "num_comments": 88,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Eternals gross $77m as AMC is all set to report its Q3 results on Monday",
        "url": "https://risingcandle.com/business/eternals-gross-77-as-amc-is-all-set-to-report-its-q3-results-on-monday/",
        "created": 1636410190.0
    },
    {
        "author": "EducationalOlive0",
        "created_utc": 1637683962,
        "id": "r0gnzj",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "**Arizona Metals -AMC-CN / AZMCF US**\n\n**Mkt Cap: $495M CAD/ $392M USD**\n\n**Last price: $4.88 CAD/ $3.89 USD**\n\n**Shares Outstanding: 99.7M**\n\n**Target Price: $44 CAD / $35.60 USD**\n\n**Overview:**\n\nArizona Metals (AMC) is a little known copper-gold mining and exploration company trading at extremely discounted levels. The metal content is predominantly copper but the byproduct of gold, zinc and silver position AMC to be among the lowest cost producers. Based in Arizona, ranked #2 by Fraser Institute for investment attractiveness, AMC owns 100% (royalty free) of the prospective Kay Mine asset, Sugarloaf Peak and two very promising West and Central target properties. AMC’s Flagship asset, the Kay Mine, is a past producer from a high-grade VMS deposit. Located in a top mining jurisdiction, near existing infrastructure, highway and water rights, and within short trucking distance to 4 operating copper smelters owned by Majors that are actively looking for high grade feed (eg Freeport, Grupo Mexico). AMC is on track to be a 10 bagger as they are a well-funded company, trading at a deep discount, a REAL M&amp;A candidate ideal for any major/midtier producer, expected to shoot up on all upcoming monthly drill results as they expand and identify new resources.  \n\n\nhttps://preview.redd.it/k4j5zlnbdd181.png?width=366&amp;format=png&amp;auto=webp&amp;s=dd53e08e2fcefee7c9874050edadd2df1553cda7\n\nThe stock has the potential for **1000% future upside**. For anyone willing to understand the story and dig into the results, it is clear that this stock should at the **very least be trading at $16+ USD (267% upside)**. This valuation is backstopped by the historic asset that was recently expanded via drill results. At current prices, the true upside comes from the optionality from any potential resource hits at the West/Central targets. In sum, you are buying an historic resource at Kay Mine at a deep discount, plus a FREE option on Sugarloaf, West and Central- if there are any positive resource hits at these locations the stock will go parabolic. The risk/reward profile indicates far more upside.\n\n**Side note of confidence:** Dr. Mark Hannington, the worlds foremost expert on VMS deposits, was brought on as a consultant to AMC (strictly for academic purposed, NO PAY) recently mentioned that the Western target is the real prize. He anticipates the West to dwarf the Kay Deposit. Having reviewed every piece of available information from the company, Dr. Hannington believes that all things equal, assuming no original drill work, that the **West would have appeared to be 5 times more likely to hit than the Kay deposit.** Anticipating high probability of a large discovery at West and Central as well.\n\nHypothetically, if they hit a resource at the Central and West targets (together with existing Kay Mine) this could be one of the worlds most coveted VMS deposits- a jewel in the portfolio of every Major miner and investor. AMC likely gets acquired by a major well before the stock approaches higher price scenarios.\n\n**Macro:**\n\nStagnating copper mine supply (due to less projects, already fatigued and depressed cutoff grades), colliding with strong demand (for EV and new electrical infrastructure), will push copper prices far higher than anyone expects.\n\nRobert Friedland says \"You will need a telescope to see the price of copper\". Earlier this year, Goldman Sachs said that \"copper could reach $15,000 by 2025 as the world transitions to clean energy\". Professional resource investors, Goehring &amp; Rozencwajg, claim that copper prices could \"potentially peak near $15 per pound\" this decade. The bull market in copper is only just beginning and there is plenty of room for prices to run higher in the underlying commodity. The progressive and environmental movement continues to gain traction, governments and corporations globally are continuing a push to reduce carbon emissions. This will require a tremendous amount of investment in developing new electrical infrastructure across the globe and also a continued shift among consumers towards more Electric Vehicles (EV)/alternatives. Qualitatively speaking, this will require a massive amount of copper for which we simply do not have enough supply coming online to satisfy.\n\nThe most important consideration in the copper market relates to the lack of meaningful copper projects expected to come to market and the magnitude of depletion at current, existing mines- a subject that many investors fail to pay attention to, let alone understand. Please read 2021.Q1 commentary from Goehring &amp; Rozencwajg for their in depth study around copper supply depletion and lack of large scale projects coming online. Copper supply mine growth is expected to grind to a halt this decade. The number of new world-class discoveries coming online will decline substantially and depletion problems at mines will accelerate. Also, geological constraints surrounding copper deposits will also contribute to major problems. Until the mid-2000s, a 0.4% copper cut-off grade was typical when determining what was mineable ore versus waste rock at large mines. By 2014, the average cutoff starts to get reduced from 0.4% to 0.25%. Lowering the grade cutoff, adds hypothetical tonnage but pulling more material out of the ground requires much more capital thus it become smuch costlier to produce the same amount of copper. Keep in mind as you read this thesis that Arizona Metals currently uses an unusually high 2.5% copper grade cutoff (more detail below).\n\nAnother factor to consider is that much of the worlds current copper supply comes from South America. Recent social unrest in Latin American nations has been creating a wave of anti-mining protests and fear of government nationalisation. Peru is starting to see this first hand as mine workers continue violent protests. The Chilean Escondida mine recently experienced a 44 day strike causing $740 million in losses- with the fear of new strikes always present and around the corner. History has shown that political unrest tends to spill over into neighbouring countries. As the price of commodities increases, governments will be more likely to try and take control of their domestic resources. Making the investment landscape unfavorable and thus risking the supply of future copper as miners seek more business-friendly jurisdictions such as Arizona. Political risk exists everywhere, Arizona Metals mgmt has been actively engaging local politicians, communities and indigenous populations for initial social license and approvals.\n\nPolitical and economic tension between the US and China are pushing these nations in a race to secure steady resource supplies. High profile examples include Zijin Mining (among others) have already started scooping copper assets such as Nevsun and initiated partnerships with Ivanhoe Mines in Congo. A Chinese consortium recently acquired Las Bambas from Glencore. And the 2016 acquisition of the Tenke Fungurume mine from Freeport by China Moly. We will likely see more pressure to secure good assets going forward.\n\n**Historical Asset:**\n\nWithin 200km of Arizona Metals' land, there are multiple mines that go over 2km in depth and that have yielded billions of pounds of copper over the years- many of which have been producing assets for years, requiring eventual replacement of new nearby ore. The flagship Kay Mine VMS project was previously owned by Exxon in the 1980s who reported an historic resource of 5.8Mt at 2.8g/t Au, 2.2% Cu, 3.03% Zn, 55 g/t Ag. The grade cut-off currently being used is 2.5% eqCu (determined back when copper was only 60 cents!). As we have seen above, most industry grade cutoff's being used are significantly LOWER. Moving the cutoff to 1% (as management has indicated during recent interviews) would still be conservative relative to peers but would add significant tonnage to any professional valuation model. The Sugarloaf Peak project is also 100% owned, no future payments, with a historic estimate of 100MMt containing 1.5M oz Au @ 0.5 g/t is a heap-leach, open-pit target that starts at surface.\n\nHistoric results known from prior Exxon ownership are shown below. We see two clear legs of mineralization. Back when Exxon owned this asset, Zinc was not valuable and so the company did not explore these zones further. Fast forward 40 years and Zinc has appreciated greatly. Following the recent June 30th drill results, from their ongoing 75,000 m drill program,\n\nthe market was surprised to see wider, and continuous, high-grade gold/zinc hits filling the area between the two original legs (an area that was thought to have minimal or non-existent mineralization) adding significant tonnage.\n\n*Before (Historic Exxon resource): After (Recent Drill Results):*\n\n&amp;#x200B;\n\n[Before](https://preview.redd.it/mtxc51vddd181.png?width=172&amp;format=png&amp;auto=webp&amp;s=44805aeaaf261dd6929d717440fc56c59f00e0a8)\n\n&amp;#x200B;\n\n[After](https://preview.redd.it/0swh04ufdd181.png?width=159&amp;format=png&amp;auto=webp&amp;s=25876e52b21e33549cdf5a7eeae1ae32c7046079)\n\nAMC currently has 4 drill rigs on site as of Q4. The company is aiming to continue their 75,000m drilling program, in which they originally expected to target a 15-18Mt resource by year end but following recent results Mgmt feels they are already at around 15-20Mt, now targeting closer to 40Mt by year end. The market can expect to be provided with monthly press releases\n\noutlining about 4-6 hole results. With 4 rigs, the company is well-funded for at least 2 years, no risk of financing in short term.\n\n**Meaningful Growth Catalysts:**\n\nThe real torque upside lies in further discovery at Central and West. VMS deposits occur in clusters, there are now close to 60 other historic VMS mines in this general area, together with the initial surveying, mgmt and existing investors are confident of resource expansion. Both of these targets are expected to be tested this fall.\n\nThough continued drilling and expansion of the Kay Mine is low hanging fruit that will contribute to an already deeply discounted valuation, the size of Kay is only a fraction of the story. VMS deposits typically occur in clusters, with AMC having nearly 20 VTEM/Geophysical survey anomalies to test- that have yet to ever be tried. The Central and West targets are two significant upside options being offered for free to current stock investors.\n\nTo emphasize the potential of the Central and West targets, ive included two screenshots from AMCs website (below). The first image shows the current 320m Kay mine footprint on the right, in red. The latest depth was 750m, complete depth is uncertain at this time as we expect further deeper drill results. Keep in mind that this region is known for multiple copper rich deposits. The 600m Central target is the purple VTEM area in the middle and the 1km Western target can be seen by the purple VTEM area on the left.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/nwa3uqfidd181.png?width=378&amp;format=png&amp;auto=webp&amp;s=e1d6d67499b8b33b0e9d83fcef8ed3c33fbab0aa\n\nThe second image is to show rock and soil anomalies. As copper (polymetallic metals) sit in the ground for hundreds of millions of years, they oxidize, and those gases rise to the surface. They alter the composition of what is sitting on surface and these “gossans” can be tested, and are a strong indicator there is mineralization below. As you can see, it was true at the Kay Deposit. Significant upside can be unlocked if it holds true at the untested Central and West targets. Permits to build roads and drill pads for the Central and West are expected to be acquired within weeks.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ii2mj7ajdd181.png?width=366&amp;format=png&amp;auto=webp&amp;s=faf0989aa6f9e017c567e3e8e79d106147d20568\n\nThe stock is already deeply undervalued; at current prices you get to own Kay Mine at a discount and a free option on Sugarloaf, Central and West targets. The recent raise of capital\n\nwill no doubt be used to accelerate testing of these targets. Upcoming drill results from this area will completely shock the rest of the market. Only the few investors following will be rewarded.\n\n**Funding/shareholder base:**\n\nThe company is well funded, with about $60M CAD on hand now with another $10 Million coming from warrant exercises over the next year. There is no risk of a dilutive equity raise in the next two years at least. However, if BHP/FCX/JOGMEC/etc wanted 10-20% of the company this type of dilution would receive a warm welcome. Having most recently raised $32M CAD in an upsized bought-deal financing on October 22 (NO warrant Component), $21M CAD on 04/06/2021 (@ $2.10 + ½ warrant) and an earlier raise of $10M on 01/04/2021 (@ $0.95)). The recent raise appears to have been driven by eager strategic investors looking to get meaningful positions via deal before the company starts drilling West and Central. Keep an eye on upcoming holder filings, we could see some new names appear. Proceeds are going to be used to expand current assets and start drilling of West and Central- something the market has zero knowledge/expectation of at the moment.\n\nThe shareholder base is still light but existing holders are sophisticated investors known for their ability to spot the best opportunities in the space. Their intent is to hold homeruns for long-term multi-bag upside potential, not quick trades. Recent filings indicate the following holders:\n\n1)Michael Gentile- 5 million shares- 5.5% (ran one of the most successful mkt neutral funds in Canada. Focuses on mining and resource investments)  \n2)Chairman Paul Reid top holder 3%\n\n3) President/CEO- Marc Pais- 3%\n\n4))ASA Gold and Precious Metals Fund- 2.64% (but only 1.7% of their fund, small relative to other positions)\n\n5)Invesco Gold &amp; Special Minerals Fund- 2.5% (but only 0.33% of their net assets, very small position size relative to average sizing in fund- room for growth)\n\n6)1832 Asset Mgmt -1.64% (another dedicated resource investor adding a new position to portfolio but a tiny weight. For now...)\n\n7)RBC AM Global Precious Metals Fund- 0.9% (HUGE fund, new position, room to grow)  \n8) US Global Investors- 0.7% (savvy, well respected investors, new position)\n\nThe stock has drifted lower due to recent profit taking and lack of marginal buying in the short term. The few investors that have been involved in this name (plus a few hedge funds) have not had much marginal demand bidding the stock higher. Also, there is an overhang of warrants that expire in a few months. Since the last deal, 5M warrants were issued at an exercise price of $3 with April 2022 expiration. With the recent uptick in volumes, I’m confident that some investors from the recent deals have already started exercising warrants funded by selling deal stock, given they are in the money. Meanwhile, most investors are likely using cash to exercise the warrants and hold long term. The recent trading volumes and block action indicate that the warrant overhang, if any, may have been cleaned up. Easy supply will be difficult to come by.\n\nInstitutions and retail investors will need to accumulate stock in the open market. Early volumes were light, it didn't take much trading to get this stock up above $3.50 USD. The fundamentals of the story are unchanged and continue to point to a growing resource, with current pricing offering free upside option on any discovery at the nearby targets.\n\nNow that the story is proving itself and attracting credible investors, attention and awareness of this story will only attract more investment. The only negative comments I hear from investors as to why they don't want to buy the stock now is because of the one year price rally from $0.80 to $3.50 USD (on low volume). Countless investors have been left in the dust, hoping a stock would dip lower before entering. Check out the copper stock charts below that kept going UP,\\] to become billion+ dollar market cap companies. Just because the stock has already run up a bit doesn't mean it shouldn't be a core holding if there is still significant upside. The earliest and riskiest stage is behind us, consider this an opportunity for up to 1000% upside now that the story is de-risked. Below are the valuation scenarios that will show the clear upside of this stock.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/8zpm6nykdd181.png?width=432&amp;format=png&amp;auto=webp&amp;s=bee43571fafd47c761d4dfffdc013591b746aef3\n\n**VALUE IS BACKSTOPPED BY FUNDAMENTALS**\n\nTo emphasize the deep value, the following valuation scenarios assume the same grades as the historic resource, with the following recoveries and commodity prices (chart below). Management has openly indicated that they are confident in a current 15-20Mt resource and are now targeting 40Mt by year end, with a consistent amount of drill results expected to be released monthly (expect 6-7 holes released monthly). For scale- If the anticipated drill holes in the next press release are as wide and similar grade as the recent release, it’s not unreasonable to see millions of tonnes added.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/oibpve5mdd181.png?width=255&amp;format=png&amp;auto=webp&amp;s=e66e20acbee4d0f0298e5dab552bd491d16b83d3\n\nThe Worst case scenario uses SOLELY the historic resource identified by Exxon in the 1980s to show the clear valuation backstop. The Base Case focuses only on the current Kay Mine asset, using the same cutoff grades and recoveries- which havent been changed since copper was 60 cents. Consider how quickly the valuation will change as the model adds new resource tonnage\n\neither by discovery or by simply lowering the cutoff grade to something more inline with the rest of the market peers. These are low hanging fruit that are not being modelled by the street analysts. To show how conservative the 2.5% CuEq grade is at AMC consider this: Eagle Mountain Mining, a nearby copper exploration play in Arizona is using 1.5% cutoff relative to AMC at 2.5%...A conservative lowering of the cutoff is an easy way to almost double the resource. Also, keep in mind my model below uses two discount rates to determine the NPV: 5 and 10% to be completely conservative.\n\n(USD Figures:)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1eun3s6ndd181.png?width=431&amp;format=png&amp;auto=webp&amp;s=c4a1e7a6bcd85344a6b8a9c806e8b376ceb085f4\n\n(CAD Figures:)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ikvp7r6odd181.png?width=407&amp;format=png&amp;auto=webp&amp;s=94704b434d73e599f91dfe4fe944083eee82c366\n\n**Other Sources:**\n\nI've relied on conversations in my network, my own personal due diligence and the studies of sophisticated investors/researchers to compile this report. I recommend interested parties read the following for a better understanding of the thesis:\n\n[https://www.arizonametalscorp.com/](https://www.arizonametalscorp.com/)\n\n[http://gorozen.com/research/commentaries/1Q2021\\_Introduction](http://gorozen.com/research/commentaries/1Q2021_Introduction)\n\n[https://www.streetwisereports.com/article/2021/07/08/four-potential-takeover-targets-on](https://www.streetwisereports.com/article/2021/07/08/four-potential-takeover-targets-on) this-precious-metals-fund-managers-list.html\n\n[https://www.mining.com/charts-chinese-investment-in-overseas-copper-projects-just](https://www.mining.com/charts-chinese-investment-in-overseas-copper-projects-just) beginning/",
        "subreddit": "pennystocks",
        "title": "$AMC.v ($AZMCF us)- Arizona Metals will make me a Millionaire....Under followed, undervalued, early and misunderstood copper/gold story in a safe jurisdiction",
        "url": "https://www.reddit.com/r/pennystocks/comments/r0gnzj/amcv_azmcf_us_arizona_metals_will_make_me_a/",
        "created": 1637712762.0
    },
    {
        "author": "FinalTrailer",
        "created_utc": 1636698956,
        "id": "qs5bsk",
        "num_comments": 79,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC announces cryptocurrency payments including 3 currencies, with plans for 1 more",
        "url": "https://www.benzinga.com/markets/cryptocurrency/21/11/24053437/amc-begins-accepting-bitcoin-ethereum-and-2-other-cryptos-ceo-says-dogecoin-next",
        "created": 1636727756.0
    },
    {
        "author": "theparthagrawal",
        "created_utc": 1635949250,
        "id": "qlviu5",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME &amp; AMC",
        "url": "https://i.redd.it/efju33ti3ex71.gif",
        "created": 1635978050.0
    },
    {
        "author": "Money-Maker111",
        "created_utc": 1637388984,
        "id": "qxzgb9",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "🦃 $GME Thanksgiving Dinner Gon' Be Good This Year $AMC 🦃",
        "url": "https://i.redd.it/he2okdkf0p081.png",
        "created": 1637417784.0
    },
    {
        "author": "Bored-_-zzz",
        "created_utc": 1636923656,
        "id": "qtzcma",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Bank buys AMC, GME, PLTR, and Snow",
        "url": "https://www.barrons.com/articles/amc-stock-gamestop-palantir-snowflake-51636655386",
        "created": 1636952456.0
    },
    {
        "author": "Mostly_Clerical",
        "created_utc": 1637528862,
        "id": "qz4gxj",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": " \n\n*Processing video e9er8y5hk0181...*\n\nSame thing happened last Friday 12/12 with AMC. Same thing 11/19 with GME after hours. I assume this somehow has to be options-expiration related. Thoughts?\n\nFor some reason when I try to post to /AMC or /GME most post gets deleted.\n\nIf you want to verify, anyone with a Bloomberg can type AMC &lt;Equity&gt; QR &lt;go&gt; and then set the date to 11/19/21 and time to 17:06 area to see the trades.",
        "subreddit": "wallstreetbets",
        "title": "Can anybody tell what is going on here with AMC after-hours on 11/19? Thousands of 1-share or small lots trading in teens and single digits.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qz4gxj/can_anybody_tell_what_is_going_on_here_with_amc/",
        "created": 1637557662.0
    },
    {
        "author": "Emmibolt",
        "created_utc": 1637710311,
        "id": "r0qfha",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Here's to you, AMC",
        "url": "https://v.redd.it/zbfdyq22kf181",
        "created": 1637739111.0
    },
    {
        "author": "morelsupporter",
        "created_utc": 1636928450,
        "id": "qu123w",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "here is the dialogue, pretty much verbatim:\n\nhim: “I belong to this trading group on Twitter. We call ourselves Apes. We only buy two things: GME and AMC. and we just hold it. We never sell. If someone sells they are called a paper handed bitch and everyone who holds it is called Diamond Hands. When the stock goes down, we just buy more”. And then people will ask “why are you buying more now, why didn’t you buy it before?” \n\nme: “Yeah. Buy the dip!”\n\nhim: “Oh you know us?”\n\nme: “yeah! that’s Wall Street Bets”\n\nhim: “No no, this is different. We bet AGAINST Wall Street”",
        "subreddit": "wallstreetbets",
        "title": "Had dinner with a 65 year old Ape last night",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qu123w/had_dinner_with_a_65_year_old_ape_last_night/",
        "created": 1636957250.0
    },
    {
        "author": "Rionic",
        "created_utc": 1636058771,
        "id": "qmu63o",
        "num_comments": 71,
        "num_crossposts": 0,
        "selftext": "Looking for a safe long term investment that actually fucking moves? Enough with this get rich quick GME AMC meme bullshittery, retards. This is where the real bread is made. Let me explain.\n\nTQQQ is a 3x leveraged version of the tech-heavy index, QQQ, containing 100 beauitful stocks. I know what you're thinking. bUt WhAt aBOuT LevErAgE DeCAy?!/1!? Leverage decay affects the slow-moving, boomer indexes like the leveraged DOW index, UDOW. Techs go up fast, and go up often. When a leveraged index goes up and down a lot, then it gets fucked by leverage decay. This is not the case for TQQQ. Just take a look at this 5-year chart. Does it look like TQQQ gives a fuck about leverage decay? \n\nhttps://preview.redd.it/jaxri19d3nx71.png?width=771&amp;format=png&amp;auto=webp&amp;s=91d0f9bd5890da7c0875f0dc7929da17601982a5\n\nNow take a look at QQQ's 5-year chart. PATHETIC. DISGUSTING. NOT ENOUGH RETURN.\n\nhttps://preview.redd.it/bbcl8puh3nx71.png?width=751&amp;format=png&amp;auto=webp&amp;s=9394c04d3de92b5ecafdb256eecfa2a785c27db9\n\nSo not only does this index fucking move, but its actually a VERY safe long term hold. Yes, it crashes HARD when the market is doing bad, but guess what? It comes back HARDER. Like Mike Tyson did a line of crack before the 12th round, it punches past its previous high with ease. It's an index. It won't ever crash and stay down. For that to happen, 100 of the most revolutionary companies would have to shit the bed and go bankrupt. That won't happen. On top of this, the index is updated every now and then to get rid of the old boomer stocks slowing it down, and is replaced with new and upcoming market movers.\n\nHumans are greedy by heart. I'm a greedy motherfucker and so are you reading this. I've cashed out a 500% return in the last year and a half on this bad boy. This index will allow you to get rich quick, SAFELY. Just in the last 1 month, it's gone up 40%. That's more than what the NASDAQ will do in a year. Get out of the boomer indexes, get out of the meme shit, and retards, join me and make the best decision of your life and buy this shit up. It's already passed the moon. It's on its way going to another fucking galaxy.",
        "subreddit": "wallstreetbets",
        "title": "TQQQ - The Index of Gods",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qmu63o/tqqq_the_index_of_gods/",
        "created": 1636087571.0
    },
    {
        "author": "PM_ME_ETHICAL_STOCKS",
        "created_utc": 1636981030,
        "id": "qufu60",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "Timeline:\n\n**August 12**: CANO crushes and beats Q2 earnings &amp; rev, raises FY21 &amp; FY22 guidance - stock dumps by \\~15%\n\n**August 13**: Short interest sits at 7.5%\n\n**August 18th**: CEO of $CANO, Marlow \"Max Bid\" Hernandez calls bullshit on the stock price and begins to aggressively buy up **at-the-market** shares and warrants for the following 2 week period, ended up totaling to: $26.9M worth of shares/$1.5m worth of warrants (Figure displayed below later in the post)\n\n**September 21st**: Citi initiates $CANO with a 'Buy', price target of $20 - I highlight this because Citi underwrote the CEO's margin loan. Citi scaled in by buying 17M CANO shares in Q3.\n\n**September 27th**: Marlow files a [13D](https://www.sec.gov/Archives/edgar/data/0001800682/000119312521284160/d232831dsc13d.htm) disclosing his holdings, we learn that Marlow margined his 22M share position to fund the August purchases of 1.65M shares and 428k warrants\n\n**October 15:** Short interest doubles to 14.1%\n\n**October 19:** Piper Sandler initiates coverage on $CANO with a 'neutral' rating, price target of $11 - Piper Sandler is however bullish on $CANO's 1:1 competitor $OSH, with a price target of $69\n\n[$CANO analyst coverage. Piper Sandler = only non-bullish analyst on $CANO. ](https://preview.redd.it/5a03oxq0bqz71.png?width=1732&amp;format=png&amp;auto=webp&amp;s=cfa49ab54b5ffdda3eca9cefe518c37b348ce70d)\n\n[$OSH coverage. Every single analyst is bullish on $OSH and its sector. Note: Some of these initiations are a few quarters old and have been upgraded since. Piper Sandler has since upgraded their PT to $69](https://preview.redd.it/9zmu720abqz71.png?width=1720&amp;format=png&amp;auto=webp&amp;s=9a6766766567af9e5e1d1d2e8dfd25174ade9525)\n\nNote: CANO also happens to be asleep at the wheel due to lack of analyst coverage as can be seen above (1/4th the coverage its peers has). This is a prime example of what Peter Lynch meant when he stated that he firmly believed that individual investors had an inherent advantage over large institutions: large institutions either wouldn't or couldn't invest in smaller-cap companies that have yet to receive big attention from analysts or mutual funds. On that note, let's compare CANO to its peers:\n\nCANO valuation comparison vs OSH and AGL:\n\n[$CANO trades at a 40&amp;#37; discount to their peers at a 2.4x rev multiple. Note: CANO has since raised their FY22 guidance to $2.65B rev, up from the $2.55B that the chart above displays \\(raised last week upon reporting Q3 earnings\\) - Highlighted in green is what CANO should be trading at if it is to trade at rev multiples in line with their peers.](https://preview.redd.it/ogryqubtcqz71.png?width=1186&amp;format=png&amp;auto=webp&amp;s=5888a661d6261d567be34edbe46e3b4f1dd55097)\n\n[CANO holds several advantages over OSH. Most notable perhaps is CANO being EBITDA positive as opposed to OSH. ](https://preview.redd.it/ntxcb260eqz71.png?width=1764&amp;format=png&amp;auto=webp&amp;s=7faa037fcb5dd3e084619fce4487d259295167f4)\n\nSide by side MLR comparison:\n\n[OSH highlighted in orange. CANO straight up beats OSH even before you adjust them for Medicaid headwind. ](https://preview.redd.it/xnder0nwlqz71.png?width=849&amp;format=png&amp;auto=webp&amp;s=9251135b352f6f420c263081b582e20dd1ecd452)\n\nLet's compare insider trading:\n\n[$CANO. As previously mentioned, CEO Marlow &amp; CCO began scooping up ATM shares beginning August 18, with share prices ranging around $9.82 to $11.99.  The stock still trades at $11.72 as of the date of this post.](https://preview.redd.it/85joz8y2fqz71.png?width=2000&amp;format=png&amp;auto=webp&amp;s=09804d6aecfd9c807da97e00f116d47f04b9665e)\n\n[$OSH. Relentless selling from the CEO, COO, CFO, CLO, CMO. The page goes further and doubles in size, I couldn't fit them all in 1 screenshot.](https://preview.redd.it/p48txbeqfqz71.png?width=2000&amp;format=png&amp;auto=webp&amp;s=701d36e91d2305e2c72558fc27631ff4476d6101)\n\nSo, why is Piper Sandler, being the odd one out, bullish on OSH but not CANO? \n\nJudd Arnold, CIO of Lake Cornelia Research Management, who holds over 10M+ shares of CANO believes this was driven and funded by pod shop shorts ([source](https://twitter.com/CorneliaLake/status/1450797528371367941)). Note that Judd has previously worked at several pod shops, notably Citadel, etc.\n\nPiper Sandler flat out lies about CANO missing on their guidance call of 15-20 de novos for FY21 by claiming that CANO has opened no more than 6 de novos. Piper note (CANO coverage initiation):\n\nhttps://preview.redd.it/qrmyswe2kqz71.png?width=1382&amp;format=png&amp;auto=webp&amp;s=671306aa2223960cfb41d43591be6b95b1e384a5\n\nThis is what CANO's CFO had to say about Piper's 6 de novo claim in a call with Lake Cornelia ([source](https://twitter.com/CorneliaLake/status/1450471193967013889)):\n\nhttps://preview.redd.it/59qhsh6ckqz71.png?width=924&amp;format=png&amp;auto=webp&amp;s=f5c80c69f3b6fa91bbffaf5a0e61fe6cab30cc9f\n\nAs for why the short interest is so high, former finance bro Anpanman (@spacanpanman on Twitter), who holds $1.6m+ worth of CANO shares and warrants, believes these pod shops have to run factor neutral: they are long a VBC name ($OSH), so they need to short the others. CANO appears to have been a popular shorting target due to it being a SPAC. \n\nBack to the timeline:\n\n**November 9**: CANO reports a wonderful quarter (Q3), misses earnings but beats rev with an increase of 100% YOY, with adjusted EBITDA at $35.2 million increasing 53% YOY. Membership stands at 210,663 including 120,086 Medicare capitated members, a YOY increase of 105% and 65% respectively. Buoyed by the performance, guidance is yet again raised for FY2021 and FY2022.\n\n$CANO sees a +12% day post-earnings\n\nOSH misses earnings but beats rev. They too have a strong quarter and raise FY21 and 22 guidance, but they disclose that they received a DOJ CID. All the relentless OSH insider selling suddenly begins to make sense (granted, they could have sold for a number of different reasons, I'm making assumptions here) - CANO on the other hand has stated on their Q3 call that they have *not* received a DOJ CID and that they never use third party marketers to bring in members. They specifically said that is a bright line they will never cross.  \n$OSH sees a -21% day post-earnings.\n\nPiper Sandler defends OSH post-Q3 earnings, but lowers their Price Target from $69 to $55 (still sees +69% upside). Piper believes that OSH should be trading at 5.5x rev multiple. If a 5.5x rev multiple were to be applied to CANO, it'd put CANO at \\~$26 a share. [Here](https://twitter.com/spacanpanman/status/1458399877449359360) is a twitter thread that further breaks down Piper Sandlers fuckery.\n\nhttps://preview.redd.it/mwcrn9a23rz71.png?width=954&amp;format=png&amp;auto=webp&amp;s=c8ea1984ebd8af0f9a68f619a13dbfc1dacad29e\n\n**November 12:** Short interest sits at 19.48%. This is an abnormally high amount for a flourishing company like CANO. It's currently the 30th most shorted NYSE-listed company. Right up there with companies like AMC, SPCE, and HYLN lol.\n\n[Most shorted NYSE listed stocks. CANO sits at #30.](https://preview.redd.it/b32lzw68pqz71.png?width=1862&amp;format=png&amp;auto=webp&amp;s=9a71a43171ec344b0397f399a1e8d0bddf7dbc3b)\n\nRemember folks:  \n\n\"Insiders might sell their shares for any number of reasons, but they buy them for only one: they think the price will rise.\" - Peter Lynch  \n\nBut when they're buying them on *margin*? You best believe they think they're going to the moon 🚀  \nP.S. Marlow becomes a billionaire at $40 a share, which will inevitably happen within the next year two, provided they keep executing as good as they have been - and you know they will if they CEO puts his money where his mouth is with margined ATM shares!\n\n**TL;DR**: CANO is a criminally undervalued stock that trades at a 40% discount to its peers. Despite CANO successfully executing and raising guidance for several consecutive quarters, it is victim to a high short interest. CANO is also asleep at the wheel due to lack of analyst coverage. CEO Marlow Hernandez realizes all of this and has put his money where his mouth is by buying at-the-market shares on margin, while shorts have stubbornly doubled down on their position for seemingly no good reason.",
        "subreddit": "SPACs",
        "title": "$CANO's Clash: Hedge Funds shorting vs CEO buying ATM shares on margin",
        "url": "https://www.reddit.com/r/SPACs/comments/qufu60/canos_clash_hedge_funds_shorting_vs_ceo_buying/",
        "created": 1637009830.0
    },
    {
        "author": "keithm2",
        "created_utc": 1636647623,
        "id": "qrosu5",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "**1. Worth $27 based on earnings. Worth $37 based on FFO.** Some investors consider Geo Group to be a REIT, others do not. Either way, the stock is very inexpensive. If considering Geo Group as a regular company, one should value it on an earnings basis. On an earnings basis, Geo Group trades at 6.5x 2021E earnings of $1.40 per share. However, the average company in the Russell 2000 trades at 19.5x earnings, indicating a fair value of $27 for Geo Group shares. (19.5 x $1.40 = $27.30). And if considering Geo Group as a REIT, one should value it on a P/FFO basis. Geo Group trades at 4.8x 2021E funds from operations (FFO) of $1.90 per share. However, the average ‘other/ diversified’ REIT in the United States trades at 19.8x FFO, indicating a fair value of $37 for Geo Group shares. (19.8 x $1.90 = $37.62). (See Figure 1 below).\n\n**2. Worth $42 based on replacement cost.** As an alternative way to determine the fair value of Geo Group shares, we can look at the replacement cost of Geo Group's assets minus liabilities. To calculate the replacement cost of Geo Group's assets, I researched the construction cost of 25 recently built prisons in the United States. However, because prisons are different sizes, I looked at their construction cost on a per bed basis. The cost was $220,061 per bed. Given Geo Group owns prisons with 55,951 beds, that implies a $12.3 billion total replacement cost. Now that we know the replacement cost of GEO’s facilities, we can calculate the replacement cost of the rest of the company. To do that, we take the value of the company’s facilities, plus the value of the company’s cash and receivables of $1.1 billion, less all liabilities of $3.4 billion. $12.3 + $1.1 - $3.4 = $10.0 billion. Divide $10.0 billion by 122.4 million of shares outstanding = $81.57 per share. But aren’t new facilities worth more than older ones? Yes. GEO’s Secure Services facilities were built, on average, in 1998. Rule of thumb is that industrial building values decline at 2.5% per year. That means $81.57 per share for buildings built in 2020 = $38.64 per share for buildings built in 1998. But also importantly, all of the facilities have been renovated. The renovations would add back at least 10% to the value of the facilities. And $38.64 x 1.10 leaves us with a replacement cost of $42.50 per Geo Group share. (See Figure 1 below).\n\nhttps://preview.redd.it/9l48yuwepzy71.jpg?width=995&amp;format=pjpg&amp;auto=webp&amp;s=65357555c644788189a2eb7c5fc8eefa9ba752b7\n\n**3. Reddit users often read the above paragraphs, then they state the following: “Okay I agree with you, GEO is undervalued. But why is it undervalued? And when will it move back to fair value?”** Well, for the past 1.5 years, news headlines constantly stated Geo Group’s earnings are at risk of decline due to the U.S. federal government’s new negative stance towards private prisons. As a result, shares fell 50%. However, news reporters (and in turn some investors) are overlooking the fact that federal facilities only hold 7% of prisoners in the United States. The other 93% of prisoners are held at the state or local levels. So the federal government's stance on private prisons is largely irrelevant, because it only applies to 7% of prisoners. Furthermore, as seen in the picture below, due to: (a) soaring crime rates; (b) soaring police retirements (up 45% yoy for the 12 months ended April 2021); and (c) prison overcrowding, the current federal government’s political aspiration, in addition to being largely irrelevant, is completely unrealistic. This reality - that the federal government’s stance on private prisons is irrelevant - is already positively impacting Geo Group's bottom line. On August 4, 2021, the company reported a significant beat on its Q2 earnings results and raised its full-year earnings guidance from $1.20 to $1.40 per share. And subsequent to the reporting of Q2 results, the company announced it would be re-opening a previously closed facility called Moshannon Correctional. The stock is already up 22% from August 4 to today. \\*\\*Update: The federal government, despite its bold statements advocating against private prisons for the past year, has quietly admitted it will allow Geo Group to bid on the renewal of the very contracts which the government previously said would no longer be given to the private sector\\*\\*. It's just a matter of time before the entire market realizes Geo Group's earnings will not decline, but are in fact sustainable. (More likely earnings will increase, at least at the rate of inflation). And companies with sustainable earnings trade at 15-20x earnings, not 6x earnings. This re-rating from 6x P/E to 20x P/E supports a 300% increase in Geo Group’s share price from $9.20 per share to $28 per share. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/q8ns3j7ipzy71.jpg?width=1203&amp;format=pjpg&amp;auto=webp&amp;s=8832b62c7cb408fe55380481e0449df43a698189\n\n**4. Don’t wait because momentum is building**. First, we have legendary investment guru, Dr. Michael Burry, buying $20 million of shares of Geo Group between April and June 2021. He also tweeted about the stock in June: [https://twitter.com/BurryArchive/status/1405661364689965056/photo/1](https://twitter.com/BurryArchive/status/1405661364689965056/photo/1). Second, we have large scale insider buying from CEO Zoley who purchased $1.1 million worth of shares at $6.75 per share in June. Third, a whale investor just bought $1 million worth of Geo Group options with a strike price of $12 and March 2022 expiry date. This $1 million investment goes to $0 if GEO shares don’t rise to $12 by March. Typically, whale investors don’t make those big bets unless they are almost certain of something. And fourth, Geo Group has its own Reddit group of 1,200 members, up from 200 in June. One posted a billboard in New York, promoting the stock. (see it below and here: [https://twitter.com/Nasimul1978/status/1413618508609560583?s=20](https://twitter.com/Nasimul1978/status/1413618508609560583?s=20)). However, Geo hasn't even been mentioned in the most important Reddit group (Wall Street Bets) yet, because its market cap of $1.05 billion falls just below the forum's $1.25 billion requirement. What happens when the only meme stock with strong fundamentals makes its way onto this aggressive short squeeze subreddit? \n\n&amp;#x200B;\n\nhttps://preview.redd.it/q8pqhb0npzy71.jpg?width=806&amp;format=pjpg&amp;auto=webp&amp;s=c9f26baaa3e2d390f4d6ec835df07f65346e4f17\n\n**5. If the above isn’t reason enough to buy, consider this question: Is Geo Group the single best short squeeze candidate out of all meme stocks?** As seen in the scatter plot below, because of Geo Group's relatively small market capitalization ($1.0 billion) and high short interest (22%), it is as likely as any other meme stock to get squeezed. However, there is an additional factor that needs to be considered, not displayed by the chart. That factor is Geo Group's deep undervaluation. I believe this undervaluation has two important implications:\n\n\\--- **a) Geo Group could triple based on fundamentals alone, trapping shorts**. In other words, a massive squeeze could happen, independent of Reddit/Wall Street Bets.\n\n\\--- **b) Reddit users can risk far more capital on Geo Group vs other meme stocks.** Only 3 of the 25 most talked about meme stocks/short squeeze candidates have earnings. Because Geo Group trades far ***below*** its fair value (while every other meme stock trades far ***above*** their fair values), Reddit users can risk far more capital investing in Geo Group. Looking at the chart below, which meme stock are you more comfortable owning? I know I’d be as comfortable investing $15,000 into a stock that trades at 6.5x earnings as I would be investing $5,000 in a stock with no earnings. Bottom line: APES have triple the ammo.\n\nhttps://preview.redd.it/7f0irilppzy71.jpg?width=1105&amp;format=pjpg&amp;auto=webp&amp;s=26dc20361ed9aa3872abc5a57b7b4c89d804babb\n\n**6. How high could shares go on a short squeeze? + Conclusion.** GameStop’s market capitalization reached a high of $35 billion when the stock peaked at $483 per share. AMC reached a similar level. That level translates into a $292 share price for Geo Group (see Moonshot Potential column in Figure #1 above). Under normal market conditions, the probability of a short squeeze is low. However, in the past six months of the ongoing speculative mania, short squeezes have been common (ie. GME, AMC, CARV, CLOV). As discussed in paragraph #5 above, Geo Group’s potential to squeeze may be the highest among all meme stocks. And importantly, as proven by the deep due diligence valuation work completed in this post, instead of losing 50-70% of your capital while waiting for the squeeze (like with AMC, GME etc), you could very well be making a 100%-200% return while waiting.\n\n\\*This post does not constitute investment advice.",
        "subreddit": "smallstreetbets",
        "title": "Geo Group (NYSE-GEO) – Stock trades at $9.20, but is worth $27, $37 and $42 based on various valuation metrics. And the reasons why this deep undervaluation won’t last.",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/qrosu5/geo_group_nysegeo_stock_trades_at_920_but_is/",
        "created": 1636676423.0
    },
    {
        "author": "nobjos",
        "created_utc": 1635857374,
        "id": "ql3gg7",
        "num_comments": 61,
        "num_crossposts": 0,
        "selftext": " \n\n&gt;Like 4chan found a Bloomberg terminal\n\nThis is how they define themselves. [Wallstreetbets](https://www.reddit.com/r/wallstreetbets/) is a community that has gained a following of 11MM+ members over the years. As much as it’s fun to follow their ups and downs and the laugh-out-loud memes that they post, the question in the back of everyone’s mind is: **Is there really more to WSB than just the memes and jokes?** Do they have real insights?\n\nIn this analysis, I try to use historical data about the conversations on WSB to see if there’s a method to the [madness and chaos](https://www.youtube.com/watch?v=jg85H26wyLk) and [GME hype](https://en.wikipedia.org/wiki/GameStop_short_squeeze): to see if **we can beat the market by using the stock picks made on WSB.** After all,\n\n*Processing img tkrcc2xsh6x71...*\n\n*Processing img exloyxuuh6x71...*\n\n**Data**\n\nReddit’s PRAW API and Pushshift API were used to obtain the data for this analysis. There were more than 20 million comments and posts made on WSB in 2021. I have had a VM running for collecting the live data from all the financial subreddits since Dec’20.\n\nThe summary sheet containing the analysis will be shared at the end in a Google sheet but if you want access to the full historical data, you can get it from [Pushshift API](https://github.com/pushshift/api).\n\n*Processing img trqixawuh6x71...*\n\n**Analysis**\n\nAhh, this is where it gets tricky. There are multiple ways to consider what constitutes a recommendation from WSB. Since there are millions of comments, it’s not realistic to invest in each and every recommendation made on the subreddit.\n\nSo what I have done to simplify this is to calculate the most popular tickers for each day \\[2\\]. Why I settled on this logic is because a stock from this list is what a person is most likely to see when he/she would randomly browse through the subreddit and the higher the number of mentions, the more the chances of investing in the said stock.\n\nConsidering the practical limitations, I kept the cut-off at the top 10 stocks. Once we have found the top 10 discussed stocks of that day, we invest in them at the market close. Then we calculate the returns generated by the stocks over the next\n\na. One Week\n\nb. One Month\n\nc. Till Date ( From the date of investment to Today)\n\nThe benchmark for comparison is SPY\\[3\\]. We will compare the returns against SPY to see if the most popular recommendations generated by the platform can beat returns by SPY during the same time period.\n\n*Processing img jqpax2xuh6x71...*\n\n**Results**\n\nBefore we jump into the returns, here is a visualization of **how the most popular stocks have changed over the last year in WSB.**\n\n*Processing video fgmsogzyh6x71...*\n\n *In case the visualization is not loading,* [*check it out here.*](https://public.flourish.studio/visualisation/7685282/) \n\n*Processing img 90xrkbf2i6x71...*\n\nWe would have made a grand total of 2,613 investments \\[4\\] in 2021 following this strategy. We would have lost money on more than 51% over the next week and more than 60% over the next month. But if you consider till date, we are slightly above 50%. If you compare this to SPY, its an extremely poor performance, as during the same period SPY would have given a positive return of 66% over one week, 76% over one month, and 100% Till Date (as SPY is trading at an all-time high now)\n\nBut, the stock market rewards predictions disproportionately \\[5\\]. Out of the 100 stocks you pick, even if you get 99 wrong but get one extremely unlikely event right your overall returns will still be extremely high (which is what WSB is aiming for - it’s definitely not for safe plays).\n\nSo, how has the average performance of WSB picks fared?\n\n*Processing img cjwlugp3i6x71...*\n\nWould you look at that! **WSB recommendations have hands down beaten SPY across all time periods.** It gave a 2% overperformance over the period of one week and 2.2% over one month and a whopping 6% if you had held on to your stocks.\n\nBut keep in mind that your performance is skewed towards a few stocks which got featured repeatedly in the top 10 list.\n\n*Processing img m6dlg6e4i6x71...*\n\nGME has been in the top10 discussed stocks in 100% of the days and on average you would have gained 73% if you invested in it every day. Both AMC and TSLA are close followers with both of them giving substantial returns. Among the other ones who have made the list repeatedly, only BB, CLOV, and WISH on average have lost money \\[6\\].\n\nNow that our main question is out of the way, we can really do a deep dive into the data and see some interesting patterns.\n\n*Processing img lxryhi65i6x71...*\n\nUnsurprisingly, Gamestop and AMC are at the top of the pile with GME returning an insane 788% in one week. Even if you remove GME and AMC (due to the unlikely scenario of a short-squeeze), the other 3 stocks would have doubled your investment in one week. \n\n*Processing img d7nn1gj6i6x71...*\n\nFor every winner, there are bound to be losers. If you bought into GME at the top of the rally, you would have lost 73% of your investment in the next week. All the other companies on the list had a brief jump in popularity but folks who invested in that ended up holding the bag.\n\nBut what if you did not want to invest in 10 stocks every day. What if you only wanted to invest in the **top stock of the day** (ie, the one creating the most discussion)? Would you have beaten the market?\n\n*Processing img ylhpu4e7i6x71...*\n\nUnsurprisingly, you would have beaten the market by a wide margin. This is mainly due to the insane returns generated by GME, AMC, TSLA, etc. which came to the top of the list. You are just being rewarded for the high amount of risks you are taking by putting all your investment into a few stocks \\[7\\]. \n\n*Processing img ej6f9rxuh6x71...*\n\n**Limitations**\n\nThere are some limitations to this analysis which you should be aware of\n\n* As explained in footnote-1 there are 8-12 days of missing data - though this is not going to affect the results in any significant way as it’s lesser than 5% of the total days in the analysis.\n* This analysis does not consider Options which is a big part of what WSB is made of. The returns from options can be wildly different from what we are observing in the case of buying stocks\n* We have just considered the last year of data where it was predominantly a bull market and meme stocks have made insane rallies. The results might be different if we expand our time horizon.\n* Finally, the above analysis only considers the chatter and not the sentiment about the stock. I would invest no matter if people are saying positive or negative things about the company. My hypothesis is that we would be able to generate more alpha if we can distinguish the sentiment in comments. A part-2 of this analysis incorporating sentiment is in the works — stay tuned!\n\n*Processing img hkyn8wzuh6x71...*\n\n**Conclusion**\n\nBefore starting the analysis, I fully expected to end it with\n\n&gt;The real returns were the friends we made and the fun we had along the way!\n\nI was expecting that the chatter in WSB would be a lagging follower of the stock price rally and the people who invest in them would end up holding the bag.\n\nBut I was pleasantly surprised to see that on average the stock that made it to the trending list beat SPY in returns, that too ***across different time periods.***\n\nEither it’s due to the self-fulfilling prophecy of stock price rallies leading to more chatter that will lead to more investments that will cause the stock to rally even more. Or it might just be that WSB is the place where we can successfully leverage the [Wisdom of crowds](https://www.investopedia.com/terms/w/wisdom-crowds.asp).\n\nWhatever the case may be, you truly would need nerves of steel to keep holding on to a stock that rallies 700% in one week only to drop 70% in value next week and then finish net positive by the end of the year. For that, you are rewarded with market-beating returns!\n\nIf you liked reading this issue, you will love\n\n* How to [consistently make returns](https://marketsentiment.substack.com/p/crypto-dca) from the Crypto market!\n* [Should you follow insider transactions](https://marketsentiment.substack.com/p/insider-purchase) while investing?\n\nUntil next week…\n\n*Processing img wuxkeczuh6x71...*\n\n**Footnotes**\n\n\\[1\\] During the GME rally in January, the traffic was so high that the VM failed. I have used Pushshift to fill in the details wherever possible, but keep in mind that there are 7-8 days of missing data from 28th Jan to 8th Feb and 4 days of missing data in April 2nd week.\n\n\\[2\\] To find the most popular tickers I used a base of around 9,000 stock tickers that I got from IEX cloud. The program would flag if any of these tickers were present in a comment or post. This is by far the most data-intensive exercise I have done. if you hypothetically consider the loop as a cross join, we processed more than 200 Billion rows to find the most popular tickers.\n\n\\[3\\] If SPY was in the top 10 tickers, we would invest in that as well. I feel that this would slightly reduce our risk profile.\n\n\\[4\\] It’s lesser than the expected 2,900 investments as there are some days in between where we had data loss (footnote 1) and also some stocks got delisted or underwent mergers (eg. Aphira) due to which we could not get the financial data from Yahoo Finance.\n\n\\[5\\] Take the classic example of Keith Gill (aka DFV). He at one point had a $50MM return using a 50K call option. Even if he had another 99 50K call options in other stocks which expired worthless, just this one right pick would have made him a net profit of $45MM. This phenomenon is known as [black swan farming](http://www.paulgraham.com/swan.html).\n\n\\[6\\] This is very surprising given the amount of risk we are taking investing in meme stocks. Also, in my mind, you cannot complain about the skew towards a few stocks as it’s bound to happen. Even in the case of S&amp;P500, a vast majority of returns is [driven by a few tech stocks](https://www.ajg.com/us/news-and-insights/2020/dec/s-p-500-index-top-heavy-tech-heavy/).\n\n\\[7\\] The Beta of this portfolio would be through the roof and you beating the market is more probable as we are in a rally. Remember, [what Beta giveth, Beta can take it away](https://www.investopedia.com/terms/b/beta.asp) just as easily.",
        "subreddit": "StockMarket",
        "title": "Can Wallstreetbets beat the market? - I analyzed 20MM+ comments in 2021 to see if you should pay attention to the stock picks made in wsb. Here are the results.",
        "url": "https://www.reddit.com/r/StockMarket/comments/ql3gg7/can_wallstreetbets_beat_the_market_i_analyzed/",
        "created": 1635886174.0
    },
    {
        "author": "Spare-Athlete9503",
        "created_utc": 1636349722,
        "id": "qp6znd",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "What is the best call you made, yet you didn't follow up yourself  \nI called Peleton, at 120$ i said short that stuff.   \nI really wanted to, but my broker in Europe won't let me short US stocks so I missed on a massive gain.. \n\nhttps://preview.redd.it/qczj2ggy5by71.png?width=1152&amp;format=png&amp;auto=webp&amp;s=4c160df02edcbd84a5ba342ac0f04c9f7857c7d2\n\nI still can't short American stocks and i pay allot of fee's you can imagen the anger :c  \nAMC and BB should pay off soon..",
        "subreddit": "wallstreetbets",
        "title": "What is the best call you missed out on, that you made?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qp6znd/what_is_the_best_call_you_missed_out_on_that_you/",
        "created": 1636378522.0
    },
    {
        "author": "Thump4",
        "created_utc": 1635947985,
        "id": "qlv30h",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "💎 $AMC ✋ Breaking Out of Year-Long Wedge, Starting New Bull Cycle",
        "url": "https://i.redd.it/tmxnt7lqzdx71.png",
        "created": 1635976785.0
    },
    {
        "author": "MajorKeyBro",
        "created_utc": 1635797933,
        "id": "qkms1o",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$GME $AMC $UVXY Yolo Day 1",
        "url": "https://www.reddit.com/gallery/qkms1o",
        "created": 1635826733.0
    },
    {
        "author": "drdarkpiccolo",
        "created_utc": 1635892777,
        "id": "qlg87u",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Before all the AMC gain porn that’s about to come through how about some loss porn. 28k loss because retarded.",
        "url": "https://i.redd.it/q5yn5xrlf9x71.jpg",
        "created": 1635921577.0
    },
    {
        "author": "Traditional_Base_584",
        "created_utc": 1637757278,
        "id": "r14846",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "The only reason I bought this pos. Because I thought is gonna be amc number 2",
        "url": "https://i.redd.it/1kfhnfwpfj181.jpg",
        "created": 1637786078.0
    },
    {
        "author": "wagglefree",
        "created_utc": 1636720826,
        "id": "qsac44",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC - Tesla - DD Technical Comparison. Not financial advice.",
        "url": "https://i.redd.it/6ympk9ftt5z71.jpg",
        "created": 1636749626.0
    },
    {
        "author": "Njkoskin",
        "created_utc": 1637525064,
        "id": "qz35at",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "With likely a major correction incoming looking at a company’s Beta value plays an important role. \n\nA beta of 1 means the stock moves with the overall market. A beta greater than 1 the stock moves with the market but more aggressively. A beta less than 1 the stock moves less than the market. A beta less than 0 (which is rare) moves opposite of the market.\n\nThere are 3 wallstreetbets stocks that have 1 year  Beta’s less than 0 (significantly less). GME, AMC and 1 other that apparently is banned from WSB because of market cap..KO_ _)\n\nThis guarantees nothing but in the hypothesis of a market crash it would signify that these stocks would go up not down with the market.\n\nFeel free to add any more stocks that also show negative beta’s. \n\nThis is solely for findings and is not financial advise",
        "subreddit": "wallstreetbets",
        "title": "GME/AMC negative BETA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qz35at/gmeamc_negative_beta/",
        "created": 1637553864.0
    },
    {
        "author": "tmime1",
        "created_utc": 1635868656,
        "id": "ql7c45",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Yesterday I bought 200 shares of $GME. Today I bought 1,000 shares of $AMC. Holding for MOASS. Thank you! 💎🙌🚀",
        "url": "https://i.redd.it/uoz7i0mvf7x71.jpg",
        "created": 1635897456.0
    },
    {
        "author": "TastelessApe",
        "created_utc": 1637479800,
        "id": "qyptym",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "Looking to start off small $50-100 into options\n\nWhat is a good open interest and implied volatility area to work with? I been playing spy, riot, lucid and amc last week. Mostly losing all money i put in almost.\n\nI do have a put for MU on monday. People said it was a dumb move but the faily has a gap to the downside that needs filled and its a toss up with how the market will be on open. So we'll see i guess.\n\nBeen trying to dig around and find youtubers that do small account challenges and show the reason why they are picking certain stocks for options but theyre hard to find.",
        "subreddit": "options",
        "title": "Implied volatility &amp; open interest?",
        "url": "https://www.reddit.com/r/options/comments/qyptym/implied_volatility_open_interest/",
        "created": 1637508600.0
    },
    {
        "author": "cclagator",
        "created_utc": 1636316886,
        "id": "qox1xa",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "### The Broader Markets\n\n**Last Week –** **SPY** was higher by about 1.7% (or $7) last week, more than the 1% move options were pricing.\n\n**This Week – SPY** options are again pricing about a 1% move (or just less than $5 in either direction) for the upcoming week. With the SPY about **$468**, that corresponds to just above **$473** on the upside and around **$463** on the downside.\n\n**Implied Volatility** – The VIX ended Friday around 16.50, up slightly from the week before and up a bit to end the week from lows it saw under 15 mid week. The VIX remains below its historical average entering this week.\n\n**Expected Moves for This Week** (via Options AI)\n\nOptions are pricing similar market moves this week than they priced last week. Here are the expected moves for the week in the major ETFs:\n\n* SPY **1%**\n* QQQ **1.5%**\n* IWM **2.0%**\n* DIA **1.1%**\n\nAs an example of how the 1% expected move translates into strike selections, here’s an Iron Condor with short strikes set at the expected move (based on the close Friday). It would need the ETF to finish between $463 and $472 to see Max Gain:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gfun2vgje8y71.png?width=573&amp;format=png&amp;auto=webp&amp;s=cc34590345aba5a79ba116143186fd10f5534c94\n\n### In the News\n\nElon Musk posted a Twitter poll over the weekend asking whether he should sell 10% of his Tesla stock. He followed with a tweet saying he would abide by the poll. “Yes” won. It’s unclear what would happen next, as Twitter polls are generally not considered legally binding. Tesla options are pricing about a 6% move for the upcoming week and about 12% for the remainder of November:\n\n### Expected Moves for Companies Reporting Earnings\n\nThe *expected moves* below are for this Friday and link to the Options AI Calendar. *Recent moves* on prior earnings start with the most recent quarter.\n\nMonday\n\n**Paypal** PYPL / [Expected Move: **6.1%**](https://tools.optionsai.com/earnings/Z) / Recent moves: -6%, +2%, +7%\n\n**AMC** AMC / [Expected Move: **13.3%**](https://tools.optionsai.com/earnings/AMC) / Recent moves: -6%, +6%, +4%\n\nTuseday\n\n**Palantir** PLTR / [Expected Move: **8.4%**](https://tools.optionsai.com/earnings/ATVI) / Recent moves: +11%, +9%, -13%\n\n**NIO** NIO / [Expected Move: **7.1%**](https://tools.optionsai.com/earnings/ATVI) / Recent moves: -3%, +2%, -13%\n\n**Wynn** **Resorts** WYNN / [Expected Move: **5.3%**](https://tools.optionsai.com/earnings/ROKU) / Recent moves: +8%, -1%, +8%\n\nWednesday\n\n**Disney** DIS / [Expected Move: **4.2%**](https://tools.optionsai.com/earnings/QCOM) / Recent moves: +1%, -3%, -2%\n\n**SoFi** SOFI / [Expected Move: **10.4%**](https://tools.optionsai.com/earnings/FSLY) / Recent moves: -14%\n\n**Beyond Meat** BYND / [Expected Move: **8.3%**](https://tools.optionsai.com/earnings/ETSY) / Recent moves: +2%, -7%, +1%",
        "subreddit": "options",
        "title": "Expected Moves this Week, TSLA, DIS, AMC, COIN, NIO, PLTR and more.",
        "url": "https://www.reddit.com/r/options/comments/qox1xa/expected_moves_this_week_tsla_dis_amc_coin_nio/",
        "created": 1636345686.0
    },
    {
        "author": "Rockyturki",
        "created_utc": 1638132737,
        "id": "r4e26v",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "It’s getting ridiculous now #stopnakedshorting $GME $AMC $ATER $TLRY",
        "url": "https://v.redd.it/me83ghl3ge281",
        "created": 1638161537.0
    },
    {
        "author": "gorays21",
        "created_utc": 1638236121,
        "id": "r5bb8v",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "This is going to benefit both AMC and Sony. \n\n&gt;When the clock stuck midnight on Nov. 29, tickets for “Spider-Man: No Way Home” went on sale. Within minutes domestic movie ticket sites began to crash as moviegoers rushed to snag seats for one of the most anticipated films of the year.  \n&gt;  \n&gt;It is something that the box office has not experienced since the pandemic began and a sign that with the right releases, the movie theater industry has a “bright future,” experts say.  \n&gt;  \n&gt;The pandemic battered cinemas, crushing demand and nearly bankrupting some of the industry’s largest exhibitors. The box office has been slow to rebound, but sustained momentum over the last six months has provided confidence in an eventual recovery.  \n&gt;  \n&gt;Overnight, the latest installment of the Marvel Cinematic Universe, a co-production between [Disney](https://www.cnbc.com/quotes/DIS) and [Sony](https://www.cnbc.com/quotes/6758.T-JP), has sparked even more optimism. Ticketing sites like Atom Tickets, [Fandango](https://www.cnbc.com/quotes/CMCSA) and MovieTickets.com alongside movie theater sites like [AMC](https://www.cnbc.com/quotes/AMC), [Cinemark](https://www.cnbc.com/quotes/CNK) and Regal saw a surge of demand for tickets leading many to crash or place visitors in hour-long online queues.  \n&gt;  \n&gt;“There are different tiers of intense fan demand when it comes to box office pre-sales, and this film is clearly showing it belongs near the top with a select few others,” said Shawn Robbins, chief analyst at BoxOffice.com. “For anyone who doubted the communal draw of the theatrical experience over the past two years, look to this enthusiasm for ‘Spider-Man’ as a major inflection point during the box office recovery period and the sign of a bright future ahead.”  \n&gt;  \n&gt;This kind of fervor has not been seen at the box office since 2019 when advanced tickets for titles like “Avengers: Endgame” and “Star Wars: The Rise of Skywalker” went on sale.\n\n ['Spider-Man: No Way Home' ticket demand crashed box office sites (cnbc.com)](https://www.cnbc.com/2021/11/29/spider-man-no-way-home-ticket-demand-crashed-box-office-sites.html)",
        "subreddit": "wallstreetbets",
        "title": "Sony's Spiderman:No Way Home crashes movie ticket sites",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r5bb8v/sonys_spidermanno_way_home_crashes_movie_ticket/",
        "created": 1638264921.0
    },
    {
        "author": "Professional_Can_706",
        "created_utc": 1636491424,
        "id": "qqd3ht",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC YOLO",
        "url": "https://i.redd.it/yj96kvpovmy71.jpg",
        "created": 1636520224.0
    },
    {
        "author": "MythrowawayAcc5678",
        "created_utc": 1637130245,
        "id": "qvsx1p",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "we were driving and he was one of those Uber drivers who is chill with talking.. he asked what my interests were and i said video games, reading, and learning about stocks. he mentioned he too was into stocks and coincidentally $UBER is actually such a great stock to own that's about to blow up. \n\nhe told me he expects Uber to compete with tesla and rivian, due to him believing self driving cars are the future and that Uber will most definitely be the forefront for being the \"self driving taxi\" of the future. he showed me his portfolio which consisted of UBER, TSLA, RIVN, GME, SOFI, FORD, AMC, etc.  \n\nhe said \"started since GME exploded and has seen massive profits on his positions\" and that he \"believes car companies are the future of transport\" , and his portfolio wasn't lying about showing insane growth. should I take his advice into account? Uber looks to be trading sideways currently but if I buy now and it explodes, I'll be missing out and I'm fearful of that.",
        "subreddit": "StockMarket",
        "title": "$UBER recommended to me by my Uber, apparently its a great stock to own?",
        "url": "https://www.reddit.com/r/StockMarket/comments/qvsx1p/uber_recommended_to_me_by_my_uber_apparently_its/",
        "created": 1637159045.0
    },
    {
        "author": "MechENoob",
        "created_utc": 1637179634,
        "id": "qw7qu2",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "I watch option price / stock price as a metric to tell when a big move is about to happen in a stock. Over the past few days BYSI caught my eye because a call option a month out is over 30% of the price of the stock outright. I usually only see this with stocks that are absolutely about to explode - for instance I saw this with AMC and the first short squeeze last winter, and I just saw it with KZR on Monday. Basically when there is such a wild premium on a stock no one is really talking about, someone knows something and something big is going to happen. Check out the option prices on your own. \n\nLet’s chat short squeeze because every idiot loves that shit. 70% of the float is held by insiders, 20% held by institutions. Without counting retails shares (which is non zero) this leaves just over 2 million shares available for trading. There are currently 4.6 million shares shorted. \n\nYes, as of November 230% of the available float is shorted. \n\nNow the juicy bits. BYSI has a globally recognized treatment for chemotherapy induced neutropenia and non small cell lung cancer. This could treat millions of patients, with billions of dollars in revenue if approved. The PDUFA date is Nov 30th, and will act as a binary event potentially tripling this stock price in conjunction with a short squeeze. Price estimates are 50-85 by funds. \n\nI have no idea what this stock will do, I have a large (for me) position that I have opened over the past few days and will be hoping that it skyrockets. Not financial advice blah blah blah. Good luck to all who buy! \n\n(All headass comments below will be ignored.)",
        "subreddit": "smallstreetbets",
        "title": "$BYSI DD",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/qw7qu2/bysi_dd/",
        "created": 1637208434.0
    },
    {
        "author": "FrankieFastHands19",
        "created_utc": 1636240129,
        "id": "qobn0j",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "2300 AMC shares on EARNINGS Monday",
        "url": "https://i.redd.it/xjbglyeg42y71.jpg",
        "created": 1636268929.0
    },
    {
        "author": "shakenbake705",
        "created_utc": 1636686687,
        "id": "qs206e",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": " \n\nLet's start at the beginning, GRAB is a multibillion-dollar food delivery/courier/shipping/grocery delivery service that has total control of the southeast Asian market. It has been flexible and adaptive to COVID and the ever-changing markets that ensue. It has driven out competitors like uber to reign supreme and it's well on its way to the US. They posted strong Q3 results today that held up to extremely strict lockdown measures to post record merchandise revenue results. ([https://finance.yahoo.com/news/grab-reports-third-quarter-2021-110000140.html](https://finance.yahoo.com/news/grab-reports-third-quarter-2021-110000140.html))\n\nThey have a strong outlook and are looking to expand into China and move to the US as well. Meanwhile, they have financial backers such as Blackrock, Barclays, Fidelity, and Morgan Stanely and are currently valued at around 40 Billion. They are on track to do a reverse merger with AGC which will have the potential for a short-term play. However, GRAB expects the market to expand from 52 Billion in 2020 to 180 Billion by 2025. When these guys merge it will be the largest SPAC merger EVER. They have already started the process of filling and gaining approval from the SEC. Some people believed today would be the official announcement but there is still time for them to announce it before the end of the year as they have promised. (The merger is confirmed but not announced officially yet.)\n\nThis brings us to AGC, Altimeter Growth Corp is about to be thrust into the spotlight. When AGC and GRAB merge there will be an institutional lockout for THREE years, where institutions own 69.82% of total shares with 50 million outstanding; The short interest is also 38.81%. There is a potential for a short-term play but also strong fundamentals to have this in your long-term portfolio. While talk about this is relatively small AGC just hit a 1 billion market cap today and has been mostly under the radar.\n\nFrom similar plays that I have been exposed to this year like CLOV, GME, and AMC I expect this to run easily to the 25-35 dollar range. I bought 13-14 dollar calls last week and have 350 shares at 15.05. Calls are still relatively cheap for something with this much exposure. Look for a strong run-up to the announcement then a potential short-term play. Happy Hunting Apes.\n\n[https://www.nasdaq.com/market-activity/stocks/agc/institutional-holdings](https://www.nasdaq.com/market-activity/stocks/agc/institutional-holdings)\n\n[https://fintel.io/ss/us/agc](https://fintel.io/ss/us/agc)",
        "subreddit": "wallstreetbets",
        "title": "AGC The Best Stock You Haven't Heard of... Yet",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qs206e/agc_the_best_stock_you_havent_heard_of_yet/",
        "created": 1636715487.0
    },
    {
        "author": "jjd1226",
        "created_utc": 1636302780,
        "id": "qos33r",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "# AMC - Upside Breakout Imminent? (Dec. 16th) - Bullish Bias\n\n* Support - 28.47 - 32.22\n* Resistance - 52.08\n* Target - 58.04 - 62.35\n* 🔑 gamma and delta strike - 40\n\nhttps://preview.redd.it/z23j9gb3a7y71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=3131bb68fdd5c07a24cc0c9e6cb1b393a5bd1d25\n\n## Options Data\n\n* Call total: 1,283,673\n* Put total: 932,956\n* Call volume: 210,604\n* Put volume: 84,860\n* 🔑 gamma strike: 40\n* 🔑 delta strike: 40\n\nhttps://preview.redd.it/vvz019h5a7y71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=294f6cf56a2f073fba30b34f6e5b59890f22dedb\n\n# AMC 5-Day History\n\nhttps://preview.redd.it/j5ea5sg7a7y71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=66a1d2cce224bd4f532a8981589e7dcff46311b0\n\n## Recent News\n\n* AMC to sell its own branded popcorn at mall kiosks, supermarkets in 2022\n* Wedbush Downgrades AMC Stock Due to Retail 'Cash Out' Expectations\n\n# TSLA - Breakout to the downside? (Nov. 12th)\n\n* Support - 1210..40\n* Resistance - 1243.57\n* Bullish Target - 1269.83 - 1343.10\n* Bearish Target - 1171.00 - 1135.06\n\nhttps://preview.redd.it/ppv3ohcba7y71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=f2328d29f506b88471f89a40feb7f1ce3bce471c\n\n## Options Data\n\n* Call total: 2,665,319\n* Put total: 3,385,035\n* Call volume: 350,313\n* Put volume: 412,324\n* 🔑 gamma strike: 1200\n* 🔑 delta strike: 1000\n\nhttps://preview.redd.it/1vus6oxea7y71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=04c7e461e12386cca4694176718f062c15ba8d74\n\n# TSLA 5-Day History\n\nhttps://preview.redd.it/9v3f4djga7y71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=3b8cf3e6e2e3b6e185417d5132fb43ae944a272e\n\n## Recent News\n\n* Tesla CEO Elon Musk Proposes Selling 10% Of His Company Stock, He's Asking Twitter Followers To Decide\n* Apple Hires Tesla's Former Autopilot Software Director\n* Tesla Once Again Raises Prices As Model Y Sells Out, Adds New Free Paint Color\n* Lucid CEO Sees Tesla 4680 Batteries Being A 'Huge Breakthrough' As Just A 'Fantasy'\n\nPositions\n\nhttps://preview.redd.it/04fpdxspa7y71.png?width=1356&amp;format=png&amp;auto=webp&amp;s=582665d232564885f5381d978f6da18aec9522ea\n\nThanks for reading,\n\n🌝NightMan",
        "subreddit": "wallstreetbets",
        "title": "AMC &amp; TSLA Breakouts?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qos33r/amc_tsla_breakouts/",
        "created": 1636331580.0
    },
    {
        "author": "NonstopNipples",
        "created_utc": 1637339535,
        "id": "qxjw8t",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Hello fellow retards, autists, and 🧼 gang. Here’s a half-assed DD for you to either pick apart or provide me with the confirmation bias that helps me sleep at night on my sweet mattress from Bed Bath and Beyond. BBBY has been doing some crazy stuff lately (especially AH) and here’s what my smooth brain can comprehend on the matter:\n\n1. Aggressive Buybacks\n\nhttps://www.prnewswire.com/news-releases/bed-bath--beyond-inc-advances-1-billion-three-year-share-repurchase-program-within-fiscal-2021-301414529.html\n\nBye bye half the float, hello tendies\n\n2. Insider Believers\n\nhttps://simplywall.st/stocks/us/retail/nasdaq-bbby/bed-bath-beyond/news/the-independent-director-of-bed-bath-beyond-inc-nasdaqbbby-j/amp\n\nJohn Fleming smart man, will make business go boom 💥\n\n3. Holiday Business\n\nhttps://finance.yahoo.com/news/bed-bath-beyond-one-stop-120000277.html\n\nOne-stop shop to get gifts for all those family members you’ve disappointed over the years\n\n4. Short Interest\n\nhttps://fintel.io/ss/us/bbby\n\nYeah yeah, I know, next GME/AMC is the biggest cliché here, but I can’t think of a ticker that has as much notoriety, meme-ability, or a better setup right now than BBBY. 30% of the float with over 5 days to cover is no joke, and if there’s one thing us WSB bulls love, it’s 🔥🩳\n\n5. Whitney Tilson $100 Price Target\n\nhttps://www.benzinga.com/news/21/11/24159395/watching-bed-bath-body-shares-hearing-hedge-fund-manager-whitney-tilson-sets-100-price-target\n\nThis guy gets it 🛏🛁🚀\n\nMy position 12/17 C 35",
        "subreddit": "wallstreetbets",
        "title": "BBBY DD - I wanted to add gifs but ate too much soap to figure it out",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qxjw8t/bbby_dd_i_wanted_to_add_gifs_but_ate_too_much/",
        "created": 1637368335.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1636195880,
        "id": "qnxu7t",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Hey guys, upcoming earnings! It's a massive one (AMC, Palantir, Wendys, Disney, Fiverr, Energizer and mooore).\n\nWhich ones are you waiting for most? Where do you place your bets?\n\nhttps://preview.redd.it/xrkys7iugyx71.png?width=1772&amp;format=png&amp;auto=webp&amp;s=d756cb14b2a481c3b71963b3691cf7314767306f\n\nMON  \n     Before MO: $TTD $COTY $NSSC $VTRS $TSEM $PSEC $USFD $EHTH $KOS $GTES $NERV $RDNT $MTNB  $LINC  $EDIT $CECE   \n     After MO: $AMC $PYPL $RBLX $CLOV $SPCE $DDD $SDC $LMND $TME $ZNGA $NVTA $MTRX $UEPS $REAL $TRIP $LOTZ $JKHY $RCEL\n\nTUE  \n     Before MO: $PLTR $WKHS $BNTX $UWMC $DHI $HUYA $PRPL $MSGE $SYY $OCGN $VFF $BHVN  \n     After MO: $NIO $FUBO $COIN $UPST $ACB $DASH $U $WYNN $ELY $FLGT $INO $VRM\n\nWED  \n     Before MO: $AFMD $WEN $FVRR $MCFT $BIOX $PFGC $ENR $EYE $KRNT $MNDY $APPH $WISA  \n     After MO: $DIS $WISH $SOFI $AFRM $BYND $OPEN $TTCF $GEVO $ROOT $LX $RRGB $MBII\n\nTHU  \n     Before MO: $GRWG $PSFE $MT $WIX $YETI $TPR $MYTE $SANW $WB $TXMD $BAM $LIQT $UTZ  \n     After MO: $SNDL $BLNK $RIDE $CPNG $KRUS $ARRY $LTRX $XAIR $GAN $SFT $WATT\n\nFRI     Before MO: $AZN $TH $SPB $SOHO $VERO $SDPI $VIVO $CASI $NYC $MOTS $EFOI",
        "subreddit": "options",
        "title": "Most Anticipated Earnings Releases for the week beginning November 8th, 2021 - it's a big one again!",
        "url": "https://www.reddit.com/r/options/comments/qnxu7t/most_anticipated_earnings_releases_for_the_week/",
        "created": 1636224680.0
    },
    {
        "author": "Take-from-the-poor",
        "created_utc": 1637312707,
        "id": "qxcb01",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "DWAC is currently showing the same pattern as GME &amp; AMC did in February, after coming back from their first big move higher. \nHaving come back significantly from the high of 175, it’s now stagnant for a couple of weeks at ~60. Will we get a second phase of moves higher as we did with GME &amp; AMC? I think the rewards outweigh the risks at that point - so I bought some Trump casino tickets yesterday 🎰🎰\n\nDon’t know about the fundamentals, they’ll depend a lot on the merger details - the business case is definitely there. But as for the meme potential the sky is the limit 🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "Another melt-up for DWAC?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qxcb01/another_meltup_for_dwac/",
        "created": 1637341507.0
    },
    {
        "author": "TheNomadicAspie",
        "created_utc": 1636753974,
        "id": "qslu34",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "I bought about $500 in AMC weekly calls through TD Ameritrade on January 26th, as well as about $4,000 in NOK stock, and about $300 in NOK calls. As everyone knows, most of the major brokerages went out simultaneously, and then stopped allowing buy orders which crashed the market.\n\nI was on my computer at the time excited that my $4,000 of stocks and calls were now worth $15,000 and briefly over $20,000 when AMC and NOK skyrocketed. I tried to place a sell order, but TD Ameritrade's website wouldn't process it because it was presumably overwhelmed with traffic.\n\nI tried calling but the phone lines were busy, and by the time I got my order through, my $15,000-$20,000 position was back down to $6,000, about the amount I started with.\n\nAll of the class action lawsuits seemed to focus on RobinHood specifically, and I'm unsure if I have any ability to sue since I can't prove I tried to place the sell order, since the website wasn't working.\n\nWondering if it's worth pursuing or if I'm out of luck?",
        "subreddit": "StockMarket",
        "title": "Can/should I sue my brokerage for missed profits of 15k during the GME/NOK/AMC/BB fiasco of January?",
        "url": "https://www.reddit.com/r/StockMarket/comments/qslu34/canshould_i_sue_my_brokerage_for_missed_profits/",
        "created": 1636782774.0
    },
    {
        "author": "Rockyturki",
        "created_utc": 1636319665,
        "id": "qoy048",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "We do not care what price we buy (GME❤️AMC) at, we care the stock goes (GME❤️AMC) higher. 🦍",
        "url": "https://v.redd.it/4cczxn3yo8y71",
        "created": 1636348465.0
    },
    {
        "author": "Accurate_Win9346",
        "created_utc": 1636858316,
        "id": "qtge87",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Ive come to the conclusion that 99.99% of the people on WSB have the market intelligence of an empty Kleenex box…Without question, the unanimous consensus of you nincompoops is your complete retards couldn’t tell their ass from a stock exploding in front of their face even as their moms are wiping their asses in her basement. \n\nIf this wasn’t true, wouldn’t you be trading other stocks that’re presenting dynamite opps to make massive gains on the regular? Sadly, none of you have the brain power or intelligence to know how to do this, so you buy a share of AMC with your moms donkey show ticket revenue and make memes about it all day in her basement like you’re gonna be able to get that giant donkey d*ck outta her ass one day. Nothings changing for you idiots, may as well join the donkey shit for brains.",
        "subreddit": "wallstreetbets",
        "title": "Any you retards ever trade anything other than futures on your moms donkey shows and AMC/GME?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qtge87/any_you_retards_ever_trade_anything_other_than/",
        "created": 1636887116.0
    },
    {
        "author": "jjd1226",
        "created_utc": 1635807408,
        "id": "qkq5hs",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "# US Market Wrap - Financial Juice\n\n01 Nov 2021 14:15\n\n* Stocks reached a new high as strong corporate earnings overshadowed disappointing manufacturing data.\n* Treasuries dropped.\n* The S&amp;P 500 recovered from earlier losses, with gains led by energy and consumer discretionary companies. For the first time, the Dow Jones Industrial Average crossed the 36,000 mark. A small-cap index rose 2.7%. A group of retail-trader favorites, including Gamestop and AMC Entertainment holdings had their best day since August.\n* More than 80% of S&amp;P 500 companies reporting third-quarter results outperformed Wall Street expectations. Since the start of the earnings season, this has laid the groundwork for a stock market rally.\n* Meanwhile, data showed that manufacturers faced persistent supply-chain challenges in October. Fed officials will meet this week as investors worry that the economy is facing the most widespread supply crunch since the 1973 oil crisis.\n* According to Morgan Stanley strategist Michael Wilson, the bullish trend in equities may continue into the Thanksgiving holiday later this month, but \"not for much longer,\" as the Fed is expected to begin tapering and earnings growth will slow further into next year.\n\n# [Chart and PT from 🕵️‍♂️ I SPY - Monday Nov. 1, 2021 Post](https://www.reddit.com/r/wallstreetbets/comments/qjaxvv/i_spy_monday_nov_1_2021/)\n\nhttps://preview.redd.it/3qvxlpotz1x71.png?width=1248&amp;format=png&amp;auto=webp&amp;s=b71778488bb60543c045bbb81d8129617bf7ff7c\n\n# Today's Price Action\n\nO: 460.30\n\n**H: 460.70  (0.14 from 1st 🐂  )**\n\nL: 458.21\n\n**C: 460.04 (0.52 from 1st 🐂 🎯)**\n\n[2 hr. ](https://preview.redd.it/orwhzcxq02x71.png?width=2686&amp;format=png&amp;auto=webp&amp;s=fe658e8b507bd7f0ca2e4e3a7cf4ed3e616c3ea2)\n\n[15 min. ](https://preview.redd.it/x8s9nn9e12x71.png?width=2686&amp;format=png&amp;auto=webp&amp;s=0cae13b1e7da71ba1a5666c2e081611abad5ed01)\n\n# Tuesday's 💩 👖 Shart Chart - 65m Timeframe\n\n* 🐂  in charge above 20 SMMA\n* 🔎 support @ 459.9\n* 🔎 resistance @ 461.38\n* Support - 358.39 - 357.42\n* 🐂 🎯  - 461.74 - 462.68 - 464.24 - 468.91\n* 🐻 🎯  - 455.86 - 454.8 - 453.52\n* ⏬ (gap fill) - 453.53 - 452.51\n\n[65m](https://preview.redd.it/r66g59nu62x71.png?width=2686&amp;format=png&amp;auto=webp&amp;s=c2ea0de2d19784d09682f2aa408ea4ce4ce29bb3)\n\n# Momentum - 65min.\n\n* 🐻  Divergence\n   * When an indicator disagrees with the price, this lack of synchronicity indicates a likely change with the chart.\n* 🐂  like to see it break trend and hit about 80.53 - 82.65\n* \\&gt;50 = 🐂 lean\n\nhttps://preview.redd.it/9ba5s4zub2x71.png?width=2686&amp;format=png&amp;auto=webp&amp;s=ce118f38ac5d54109dc09e3d181f7eb9c014e53c\n\n# SPY v. VIX\n\n* Convergence\n\nhttps://preview.redd.it/qhqk668bf2x71.png?width=2686&amp;format=png&amp;auto=webp&amp;s=570d69d1b9af89c00febcc6920ece0196595af81\n\n# Need to know market risk - Financial Juice\n\n* Stablecoin risk spurs US agencies to seek power for crackdown - Treasury Report.\n* US Treasury expects to issue $1.015 trln in net marketable debt in October to December 2021 period, up from the August estimate of $703 bln.\n* OPEC October oil output rises 190,000 bpd month-on-month to 27.50 mln bpd - Survey.\n* US Treasury Secretary Yellen: I do anticipate some revival over time on labor force participation. COVID will leave a lasting scar on the US workforce.\n* UK PM Johnson's Spokesman: It's the French's decision if they choose to follow the threats they have mad. The UK stands ready to respond in an appropriate manor.\n* France has set Monday midnight as the deadline for resolving the France-UK dispute.",
        "subreddit": "wallstreetbets",
        "title": "🕵️‍♂️ I SPY - Tuesday Nov. 2, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qkq5hs/i_spy_tuesday_nov_2_2021/",
        "created": 1635836208.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1636274101,
        "id": "qokfu7",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n|Ticker|Company|# Mentions (24H)|\n|:-|:-|:-|\n|SPY|SPDR S&amp;P 500 ETF Trust|[46](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=options)\n|OCC|Optical Cable Corporation|[9](https://www.memebergterminal.com/stock/Optical%20Cable%20Corporation/OCC?utm_source=rsmb&amp;utm_medium=options)\n|TSLA|Tesla Inc|[8](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=options)\n|MSFT|Microsoft Corporation|[7](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb&amp;utm_medium=options)\n|AMC|AMC Entertainment Holdings Inc|[7](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=options)\n|PLTR|Palantir Technologies Inc|[7](https://www.memebergterminal.com/stock/Palantir%20Technologies%20Inc/PLTR?utm_source=rsmb&amp;utm_medium=options)\n|NVDA|NVIDIA Corporation|[6](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb&amp;utm_medium=options)\n|IBKR|Interactive Brokers Group Inc|[5](https://www.memebergterminal.com/stock/Interactive%20Brokers%20Group%20Inc/IBKR?utm_source=rsmb&amp;utm_medium=options)\n|QQQ|Invesco QQQ Trust Series 1|[5](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb&amp;utm_medium=options)\n|GME|GameStop Corp|[5](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=options)\n|ES|Eversource Energy|[4](https://www.memebergterminal.com/stock/Eversource%20Energy/ES?utm_source=rsmb&amp;utm_medium=options)\n|PROG|Progenity Inc|[4](https://www.memebergterminal.com/stock/Progenity%20Inc/PROG?utm_source=rsmb&amp;utm_medium=options)\n|VALE|Vale S.A.|[4](https://www.memebergterminal.com/stock/Vale%20S.A./VALE?utm_source=rsmb&amp;utm_medium=options)\n|OI|O-I Glass Inc|[4](https://www.memebergterminal.com/stock/O-I%20Glass%20Inc/OI?utm_source=rsmb&amp;utm_medium=options)\n|SOFI|SoFi Technologies Inc. Common Stock|[4](https://www.memebergterminal.com/stock/SoFi%20Technologies%20Inc.%20Common%20Stock/SOFI?utm_source=rsmb&amp;utm_medium=options)\n|PTON|Peloton Interactive Inc|[3](https://www.memebergterminal.com/stock/Peloton%20Interactive%20Inc/PTON?utm_source=rsmb&amp;utm_medium=options)\n|FB|Facebook Inc|[3](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb&amp;utm_medium=options)\n|MRNA|Moderna Inc|[3](https://www.memebergterminal.com/stock/Moderna%20Inc/MRNA?utm_source=rsmb&amp;utm_medium=options)\n|INTC|Intel Corporation|[2](https://www.memebergterminal.com/stock/Intel%20Corporation/INTC?utm_source=rsmb&amp;utm_medium=options)\n|NIO|NIO Inc|[2](https://www.memebergterminal.com/stock/NIO%20Inc/NIO?utm_source=rsmb&amp;utm_medium=options)\n|WKHS|Workhorse Group Inc|[2](https://www.memebergterminal.com/stock/Workhorse%20Group%20Inc/WKHS?utm_source=rsmb&amp;utm_medium=options)",
        "subreddit": "options",
        "title": "I scraped r/options for the top ticker mentions in the last 24H. Here are the results (Sunday November 07, 2021)",
        "url": "https://www.reddit.com/r/options/comments/qokfu7/i_scraped_roptions_for_the_top_ticker_mentions_in/",
        "created": 1636302901.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1636194738,
        "id": "qnxlq5",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hey guys, upcoming earnings! It's a massive one (AMC, Palantir, Wendys, Disney, Fiverr, Energizer and mooore).\n\nWhich ones are you waiting for most? Where do you place your bets? \n\nhttps://preview.redd.it/v5tmo8yddyx71.png?width=1772&amp;format=png&amp;auto=webp&amp;s=edf22ab4250017813734c9fc7f9a4164605fbfca\n\nMON  \n     Before MO: $TTD $COTY $NSSC $VTRS $TSEM $PSEC $USFD $EHTH $KOS $GTES $NERV $RDNT $MTNB  $LINC  $EDIT $CECE   \n     After MO: $AMC $PYPL $RBLX $CLOV $SPCE $DDD $SDC $LMND $TME $ZNGA $NVTA $MTRX $UEPS $REAL $TRIP $LOTZ $JKHY $RCEL\n\nTUE  \n     Before MO: $PLTR $WKHS $BNTX $UWMC $DHI $HUYA $PRPL $MSGE $SYY $OCGN $VFF $BHVN  \n     After MO: $NIO $FUBO $COIN $UPST $ACB $DASH $U $WYNN $ELY $FLGT $INO $VRM\n\nWED  \n     Before MO: $AFMD $WEN $FVRR $MCFT $BIOX $PFGC $ENR $EYE $KRNT $MNDY $APPH $WISA  \n     After MO: $DIS $WISH $SOFI $AFRM $BYND $OPEN $TTCF $GEVO $ROOT $LX $RRGB $MBII\n\nTHU  \n     Before MO: $GRWG $PSFE $MT $WIX $YETI $TPR $MYTE $SANW $WB $TXMD $BAM $LIQT $UTZ  \n     After MO: $SNDL $BLNK $RIDE $CPNG $KRUS $ARRY $LTRX $XAIR $GAN $SFT $WATT\n\nFRI     Before MO: $AZN $TH $SPB $SOHO $VERO $SDPI $VIVO $CASI $NYC $MOTS $EFOI",
        "subreddit": "StockMarket",
        "title": "Most Anticipated Earnings Releases for the week beginning November 8th, 2021 - it's a big one again!",
        "url": "https://www.reddit.com/r/StockMarket/comments/qnxlq5/most_anticipated_earnings_releases_for_the_week/",
        "created": 1636223538.0
    },
    {
        "author": "AnalProlapseLLC",
        "created_utc": 1637787806,
        "id": "r1f5of",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Every once in a while my brain generates a billion dollar idea. I think this is my best one by far. What if we all got together and started our very own crowd-sourced ETF? We could fill it with some of our favorite meme stocks and moonshots 🚀🚀. It'd be actively managed by the finest wallstreetbets degens and we could vote on what to add and add the most updooted DDs. We could easily beat SPYs yearly returns and accelerate returns just by allocating a large portion of the funds into SPY FDs as well. Literally beating the S&amp;P by riding on its tail coats, it's genius. We'll be even bigger than SPY! According to Investopedia all we need to come up with 100k, which shouldn't be problem considering all the gain porn we've seen in the sub this year. Imagine the possibilities. How many thousands of percentages would the fund be up this year if we had invested in GME, AMC, RKT, DWAC, HOOD and others.\nSo what you think? What would you put into the ETF?",
        "subreddit": "wallstreetbets",
        "title": "Wallstreetbets ETF 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r1f5of/wallstreetbets_etf/",
        "created": 1637816606.0
    },
    {
        "author": "Jazzlike_Ad9434",
        "created_utc": 1636215334,
        "id": "qo3jpa",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Is $Macy's $M about to become a Meme stock? It was mentioned by Matt Levine, Bloomberg ([https://www.bloomberg.com/opinion/articles/2021-11-04/macy-s-targeted-by-meme-activists?sref=pPe6wEud](https://www.bloomberg.com/opinion/articles/2021-11-04/macy-s-targeted-by-meme-activists?sref=pPe6wEud)).  \n\nAn activist investor, NuOrion Advisors, is pushing $macys $M to showcase Tesla, Lucid and Rivian models in their stores and properties and to take payment with digital coins ([https://nuorionadvisorsbusiness.files.wordpress.com/2021/11/letter-to-m-chairman-3.pdf](https://nuorionadvisorsbusiness.files.wordpress.com/2021/11/letter-to-m-chairman-3.pdf)). \n\nCan $M become a Tesla / EV / digital coin payment play? I'm thinking about how Hertz has done after announcing the purchase of Teslas for their fleet. \n\n$M has tremendous momentum, up steadily since spring 2020, but still cheap and less than its pre-Covid highs of $72 in 2015 compared to $31.34 yesterday. It is already a reopening play. Macy's earnings has a tail wind since, with the supply chain shortage, they can get by with less discounting this holiday season. Retail stocks usually go up the last two months of the year. \n\nLook at AMC, which had pre-covid highs of $38 and is now at $41 from lows around $2 and change. If $M acts like AMC, it could double from here.",
        "subreddit": "stocks",
        "title": "Will Macy's $M become a meme stock?",
        "url": "https://www.reddit.com/r/stocks/comments/qo3jpa/will_macys_m_become_a_meme_stock/",
        "created": 1636244134.0
    },
    {
        "author": "Drredbumps",
        "created_utc": 1637628803,
        "id": "r00sao",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "BBBY 72K YOLO: GME --&gt; AMC ---&gt; BBBY? (Please)",
        "url": "https://i.redd.it/jf024m1jt8181.png",
        "created": 1637657603.0
    },
    {
        "author": "xirulouko",
        "created_utc": 1635789610,
        "id": "qkjpw9",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC Stock: These Movies Could Reignite Revenues in Q4",
        "url": "https://www.thestreet.com/memestocks/amc/amc-stock-these-movies-could-reignite-revenues-in-q4",
        "created": 1635818410.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1636196050,
        "id": "qnxvhu",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hey guys, upcoming earnings! It's a massive one (AMC, Palantir, Wendys, Disney, Fiverr, Energizer and mooore).\n\nWhich ones are you waiting for most? Where do you place your bets?\n\nhttps://preview.redd.it/9obz0qzchyx71.png?width=1772&amp;format=png&amp;auto=webp&amp;s=944781a4bc1568a002cf65f1b737a270c1d74a6c\n\nMON  \n     Before MO: $TTD $COTY $NSSC $VTRS $TSEM $PSEC $USFD $EHTH $KOS $GTES $NERV $RDNT $MTNB  $LINC  $EDIT $CECE   \n     After MO: $AMC $PYPL $RBLX $CLOV $SPCE $DDD $SDC $LMND $TME $ZNGA $NVTA $MTRX $UEPS $REAL $TRIP $LOTZ $JKHY $RCEL\n\nTUE  \n     Before MO: $PLTR $WKHS $BNTX $UWMC $DHI $HUYA $PRPL $MSGE $SYY $OCGN $VFF $BHVN  \n     After MO: $NIO $FUBO $COIN $UPST $ACB $DASH $U $WYNN $ELY $FLGT $INO $VRM\n\nWED  \n     Before MO: $AFMD $WEN $FVRR $MCFT $BIOX $PFGC $ENR $EYE $KRNT $MNDY $APPH $WISA  \n     After MO: $DIS $WISH $SOFI $AFRM $BYND $OPEN $TTCF $GEVO $ROOT $LX $RRGB $MBII\n\nTHU  \n     Before MO: $GRWG $PSFE $MT $WIX $YETI $TPR $MYTE $SANW $WB $TXMD $BAM $LIQT $UTZ  \n     After MO: $SNDL $BLNK $RIDE $CPNG $KRUS $ARRY $LTRX $XAIR $GAN $SFT $WATT\n\nFRI     Before MO: $AZN $TH $SPB $SOHO $VERO $SDPI $VIVO $CASI $NYC $MOTS $EFOI",
        "subreddit": "CanadianInvestor",
        "title": "Most Anticipated Earnings Releases for the week beginning November 8th, 2021 - it's a big one again!",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/qnxvhu/most_anticipated_earnings_releases_for_the_week/",
        "created": 1636224850.0
    },
    {
        "author": "austinajs",
        "created_utc": 1636257490,
        "id": "qogn3g",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Times have certainly changed. In hindsight we underestimated a number of critical factors impacting the financial markets. A perfect storm of global economic shocks has led to a precipitous drop in the worldwide equity markets.\n\nSignals had been growing that a collapse was possible. As inflation began to ravage American purchasing power, people sought to buy more tangible goods as supplies dwindled. Digital assets, especially if thought of as currencies, were known to be poor allocations during rising inflation. People cashed out of cryptocurrencies in favor of actual goods, which began dropping its value dramatically at the end of the year. Meme stocks were next, as retail investors quickly realized that the companies had turned a good deal of their strategy toward digital assets tied to cryptocurrencies. Or that they were stuck hopelessly in the past like the AMC facing the growth of convenience of in-home-streaming. Many finally figured that these companies may not be the best positioned for the future after all. In fact, both GME and AMC were delisted after crushing exodus from their stock. No private suitors emerged as the companies as sophisticated investors were not enthralled in what made out to be venture capital plays at best. These strategies had potentially exciting returns, but were most likely to fall dead before something interesting would come to pass.\n\nThe first market wide indication of trouble came as the Fed began its tapering programs. When announced the market was unmoved. However in early December, a small correction was triggered as the 10 year treasury began to rise slightly faster than expected. It was later learned that this caused a large portion of the market trading on automated risk-return algorithms to quickly exchange assets into the fixed income market, causing the first equity leg down.\n\nProblems then compounded around Christmas and the New Year. The holiday season was plagued by ever increasing supply issues. Surging retail demand coupled with an already heavily disrupted supply chain created a number of shortages. Now feeling more of the direct impacts of the supply chain, the American public began to pay closer attention to their leaders. Many Republicans cite hardline policies on vaccine mandates as the final domino in the supply chain disruptions. In truth it had little bearing on the situation, as panic buying had already built a huge bullwhip (Forrester) effect long before the holiday selling season. A strained supply chain began to completely logjam as persistent over purchasing had built so much excess in the system. A tired workforce was unable to keep up with crushing backlogs. Many quit their jobs under the immense pressure to fulfill holiday demand. Even record overtime pay wasn’t enough to keep people working in the growing pressure kettle of the large online retailers grueling supply chain. President Biden’s approval rating dropped to the lowest in recorded history.\n\nThe more significant impact to the market came late January as waves of companies that were unable to fulfill their typical holiday volumes missed earnings estimates substantially. Juxtaposed to record volumes in earlier quarters, firms depleted inventories couldn’t keep up with the demand. Most illustrated by Apple Corporation who could only get 85% of its normal holiday volumes to market. Rising supplier costs continued to hollow out bottom lines to add other concerns to the sustainability of record profits seen throughout the pandemic. This added momentum to the market decline, heavily spooking investors who began to pay closer attention to price/earnings ratios.\n\nMore bad news followed from inflation readings. As retailer shelves had emptied early from heavy promotion of ‘pre black friday’ deals. Many had scrambled online in fear of missing out on the most popular holiday items, causing price setting algorithms to rapidly increase prices. As the inflation readings skyrocketed throughout the end of the year and into the new year, the entire Federal Reserve Board had been called in front of congress. The Board was lambasted for the instability in the financial system. Many calls were made to accelerate the tapering process, even as those came at the expense of Washington insiders' massive financial portfolios. Many elected officials had become too scared to sell and be caught in another stock market scandal. Powell was reluctant to heed the calls, but eventually relented. Alarmingly when accelerated, the tapering exposed that other countries had their own growing debt burdens and the American public's diminishing confidence in their government had left demand for US bonds severely overestimated. Additional tapering exposed a severe lack of demand for the notes, driving the 10 year treasury several percentage points higher.\n\nConcern started to rise about corporations' ability to fund debt in a higher interest rate environment. Inflation was seen as the only option as the rate could rise no higher without wrecking havoc on the global financial system. Many companies, over-leveraged by the decade of cheap money, now risked default as a large portion of debt funding was tied to floating rate instruments.\n\nMeanwhile overseas, a cascading impact was starting to be felt when Evergrande and a growing number of other Chinese property developers were unable to repay billion dollar notes due in early 2022. This signaled that most of the bonds of Chinese real estate developers were completely worthless. Evergrande’s CEO fled the country in an attempt to avoid the heavy pressure from the Chinese government to use his own diminished wealth to repay the bonds. Additional press reports of the true magnitude of the debt crisis emerged as the defaults uncovered how much debt was hidden off balance sheet for Chinese developers. While believed to be mitigated by China’s central bank, the magnitude of the problem was underestimated and China faces a significant financial crisis akin to the 2008 financial crisis in the US. Most impacted are those that held debt outside of China, as all focus of the CCP has been to mitigate domestic damage.\n\nTensions within US-China relationship had grown considerably during this period as China faced its number of nationalistic crises. The Chinese public surprisingly outwardly grew more concerned with Xi leadership as they faced significant losses from property values and homes never completed. In desperation to distract from the problems, signs indicate that he was getting closer to using military conflict to reunify Taiwan, accelerating worries of a new and more complicated full blown cold war. This cold war that would have been far more dangerous with China’s economic power entwined with the US, unlike previous superpower conflicts of the past. However, an angry Chinese population had overthrown the government before any more dangerous conflict could arise. The US hopes a Democratic government may be formed in its wake, focused on basic human rights and freedoms.\n\nBack in the US, a group of angry Reddit investors confronted Elon Musk after Telsa dropped 95% of its value as states started to step in to regulate Self Driving car technology as a series of high profile mishaps finally forced the regulatory agencies to step in to control the rollouts of these technologies. Those bodies indicated it could be several years before they would have the framework in place to allow for a regulated self driving market. Elon tweeted after the incident: ‘You win some, you lose some… Cybertruck still looks really cool’\n\nLabor relations problems in the US continued to escalate as employees wanted more control of the companies they work for, ensuring these problems don’t happen again. Wage inflation pressures continue despite the market correction, as more workers demand a fairer distribution of compensation from their executives.\n\nJanet Yellen resigned as secretary of the treasury, citing family issues, joining a long list of economic leaders in the administration who resigned over the financial meltdown. Concerns of the stress of the mounting cash flow requirements of the treasury department are speculated as the true reason for her departure.\n\nBanks currently face the difficult decision of how to approach floating rates agreements at current levels as most businesses were over-leveraged and could not support the rapid increases in interest rates. The Libor rate has risen considerably while the Fed has kept the fed fund rate at 0. Congress hastily passed a law limiting interest rates banks can charge on any loans for a two year period to curb a rash of potential defaults as the Fed struggles to reverse policy and regain stabilization by restarting pandemic level bond purchasing programs. However, with the true problem exposed, many wonder if this program will have the same effect it did previously.\n\nThere are reports that the drastic price movements in individual shares across the market had been exaggerated by pay for order flow algorithms. It is speculated that the algorithms behind the scheme had prioritized and accelerated volatility which drove more dramatic price movements to drive additional profit for the market makers. As the pay for order flow consolidated due to high retail activity in online brokerages stoked by the pandemic, the competition that would have minimized these effects had been drowned out, allowing only a few algorithms to dedicate stock prices. The SEC has opened a wide ranging investigation into this phenomenon. The largest market makers currently have not responded publicly to the allegations.\n\nAll the news is not completely bad for the stock market and the economy. Reasonably priced securities with tangible business models were least impacted by the drawdown, losing only half the value compared with their higher valued peers particularly in the technology space. Companies that also did not rely on an import dominated offshore supply chain escaped the brunt of the pain. Supply chains have begun to ease as record demand has cooled and the shipping industry's new investments began to come online to augment the system.\n\nAll in all, if you were highly invested in high-valued growth equities, your portfolios suffered the most. The ‘Great Reset’ as it is now called has reminded people that the financial markets are driven by real companies with real performance trading on a historically reasonable price to earnings ratios. At current the bond yields now offer a reasonable alternative to equity investing, returning a non-volatile asset class into the financial picture for managing risk. Business leaders are already engaging the community to bring home overextended offshore supply chains that while more costly are far more resilient and friendlier to the environment.\n\nSincerely\n\nFrom The Future Asset Management LLC",
        "subreddit": "wallstreetbets",
        "title": "Investor Note - 2022 Summary",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qogn3g/investor_note_2022_summary/",
        "created": 1636286290.0
    },
    {
        "author": "Muttmanic",
        "created_utc": 1636954248,
        "id": "qu931n",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Obligatory long time reading, second time posting; I was advised to post this story here, so I shall. So for a long time, I've always seen driving through multiple greens on the way home to be a sign of good luck. I haven't seen many multi-greens in my life, but when I have I always see them on the way home, on all lights on the last road that has them, preceding the return home.\n\nIt's happened thrice before my winning a Salesmanship competition at a cattle show in 2012. It happened three times before I made it into All State Choir in 2015. It happened four times before I won a small (but important to me) HS class award in 2016. Now, it's happening again.\n\nI have invested into AMC and GME and have been waiting for MOAS to happen so I can get rid of my old junker car and finally obtain a Tesla, and last week have begun seeing more multi-greens again. There were two on approaches last week and another a few days ago. Today, as I was coming back home again there was another, and as I was going to pick up my room-mate from dropping of his Model 3 for a tire appointment, one Multi-Green leaving, and another coming home.\n\nI take this to be a sign, and declare that the ape nation shall reign supreme soon.",
        "subreddit": "wallstreetbets",
        "title": "Traffic Light DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qu931n/traffic_light_dd/",
        "created": 1636983048.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1636619702,
        "id": "qrgs4a",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n        \n|Ticker|Company|# Mentions (24H)|Mentions and Charts|\n|:-|:-|:-|:-|\n|TSLA|Tesla Inc|[19](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=stockmarket)\n|PLTR|Palantir Technologies Inc|[6](https://www.memebergterminal.com/stock/Palantir%20Technologies%20Inc/PLTR?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Palantir%20Technologies%20Inc/PLTR?utm_source=rsmb&amp;utm_medium=stockmarket)\n|CPI|IQ Real Return ETF|[6](https://www.memebergterminal.com/stock/IQ%20Real%20Return%20ETF/CPI?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/IQ%20Real%20Return%20ETF/CPI?utm_source=rsmb&amp;utm_medium=stockmarket)\n|GME|GameStop Corp|[4](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=stockmarket)\n|PYPL|PayPal Holdings Inc|[3](https://www.memebergterminal.com/stock/PayPal%20Holdings%20Inc/PYPL?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/PayPal%20Holdings%20Inc/PYPL?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TG|Tredegar Corporation|[1](https://www.memebergterminal.com/stock/Tredegar%20Corporation/TG?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tredegar%20Corporation/TG?utm_source=rsmb&amp;utm_medium=stockmarket)\n|SAVE|Spirit Airlines Inc|[1](https://www.memebergterminal.com/stock/Spirit%20Airlines%20Inc/SAVE?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Spirit%20Airlines%20Inc/SAVE?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TBT|ProShares UltraShort 20+ Year Treasury|[1](https://www.memebergterminal.com/stock/ProShares%20UltraShort%2020%2B%20Year%20Treasury/TBT?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/ProShares%20UltraShort%2020%2B%20Year%20Treasury/TBT?utm_source=rsmb&amp;utm_medium=stockmarket)\n|ARVL|Arrival|[1](https://www.memebergterminal.com/stock/Arrival/ARVL?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Arrival/ARVL?utm_source=rsmb&amp;utm_medium=stockmarket)\n|MSN|Emerson Radio Corp|[1](https://www.memebergterminal.com/stock/Emerson%20Radio%20Corp/MSN?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Emerson%20Radio%20Corp/MSN?utm_source=rsmb&amp;utm_medium=stockmarket)\n|USB|U.S. Bancorp|[1](https://www.memebergterminal.com/stock/U.S.%20Bancorp/USB?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/U.S.%20Bancorp/USB?utm_source=rsmb&amp;utm_medium=stockmarket)\n|HR|Healthcare Realty Trust Incorporated|[1](https://www.memebergterminal.com/stock/Healthcare%20Realty%20Trust%20Incorporated/HR?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Healthcare%20Realty%20Trust%20Incorporated/HR?utm_source=rsmb&amp;utm_medium=stockmarket)\n|GS|The Goldman Sachs Group Inc|[1](https://www.memebergterminal.com/stock/The%20Goldman%20Sachs%20Group%20Inc/GS?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/The%20Goldman%20Sachs%20Group%20Inc/GS?utm_source=rsmb&amp;utm_medium=stockmarket)\n|SPY|SPDR S&amp;P 500 ETF Trust|[1](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TIPS|Tianrong Internet Products and Services Inc|[1](https://www.memebergterminal.com/stock/Tianrong%20Internet%20Products%20and%20Services%20Inc/TIPS?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tianrong%20Internet%20Products%20and%20Services%20Inc/TIPS?utm_source=rsmb&amp;utm_medium=stockmarket)\n|CPG|Crescent Point Energy Corp|[1](https://www.memebergterminal.com/stock/Crescent%20Point%20Energy%20Corp/CPG?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Crescent%20Point%20Energy%20Corp/CPG?utm_source=rsmb&amp;utm_medium=stockmarket)\n|MJ|ETFMG Alternative Harvest ETF|[1](https://www.memebergterminal.com/stock/ETFMG%20Alternative%20Harvest%20ETF/MJ?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/ETFMG%20Alternative%20Harvest%20ETF/MJ?utm_source=rsmb&amp;utm_medium=stockmarket)\n|IVOL|Krane Shares Trust - Quadratic Interest Rate Volatility and Inflation Hedge ETF|[1](https://www.memebergterminal.com/stock/Krane%20Shares%20Trust%20-%20Quadratic%20Interest%20Rate%20Volatility%20and%20Inflation%20Hedge%20ETF/IVOL?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Krane%20Shares%20Trust%20-%20Quadratic%20Interest%20Rate%20Volatility%20and%20Inflation%20Hedge%20ETF/IVOL?utm_source=rsmb&amp;utm_medium=stockmarket)\n|MMT|MFS Multimarket Income Trust|[1](https://www.memebergterminal.com/stock/MFS%20Multimarket%20Income%20Trust/MMT?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/MFS%20Multimarket%20Income%20Trust/MMT?utm_source=rsmb&amp;utm_medium=stockmarket)\n|GFI|Gold Fields Limited|[1](https://www.memebergterminal.com/stock/Gold%20Fields%20Limited/GFI?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Gold%20Fields%20Limited/GFI?utm_source=rsmb&amp;utm_medium=stockmarket)\n|AMC|AMC Entertainment Holdings Inc|[1](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=stockmarket)",
        "subreddit": "StockMarket",
        "title": "I scraped r/stockmarket for the top ticker mentions in the last 24H. Here are the results (Thursday November 11, 2021)",
        "url": "https://www.reddit.com/r/StockMarket/comments/qrgs4a/i_scraped_rstockmarket_for_the_top_ticker/",
        "created": 1636648502.0
    },
    {
        "author": "tickerwizards",
        "created_utc": 1635788527,
        "id": "qkjbmp",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": " \n\n**TL;DR -** RTY/IWM/RUT tracks most meme stocks\n\nIt's breaking out recently from a massive pattern which is probably a big reason everything is running now - and one of the reasons I've been analyzing all these stocks\n\nAn index breaking out is a great signal of a **rotation into the stocks within it**\n\nWe need a **weekly close above 2323** to confirm a breakout\n\nRTY will target **2500+** as long as it holds onto the **teal trendline** in the picture and **small caps will see one of the largest rotations in quite some time**\n\nWatch RTY/IWM/RUT closely to know when it's time to exit trending names\n\n\\---\n\nWe all know about the indexes right? Well - because of indexation - everything is linked nowadays. Stocks move together for the most part depending on their categories.\n\nSPX is the S&amp;P 500 (growth/tech heavy but a bit less so than NDX), NDX is the Nasdaq 100 (growth/tech heavy), DJIA is the Dow Jones Industrial Average (lots of boomer stuff, value)\n\nWell - there just so happens to be an index that **most meme stocks belong to -**\n\n**RUT - the Russell 2000 Index**\n\nI mean just look at the moves today:\n\n[$IWM Correlation Intraday](https://preview.redd.it/n8c9wjjit0x71.png?width=750&amp;format=png&amp;auto=webp&amp;s=4b9198a5b110844730b57e79eb783f0d625f7adc)\n\nThere's a few different Russell indexes - but this is the one I track the most closely - because I trade a lot of futures and **RTY** is the contract.\n\nBasically - it's a **small-cap** stock market index. What's a small cap?\n\n* \"A small cap is generally a company with a market capitalization of between $300 million and $2 billion.\"\n\n\\- from Investopedia\n\nYeah that market capitalization is quite a bit smaller than most memes - but **before they 1000xed** on hype, they were somewhere around there.\n\nCan you guess what stocks were top holdings in in it? GME, AMC to name a couple - as well as most of the stocks being shilled around here. **It might as well be the meme stock index.**\n\nNow here's where it gets interesting - take a look at the chart. I track the indexes 24/7 from a technical standpoint - and I've been able to catch nearly every rotation for a while now by identifying which are breaking out, and which are consolidating. If an index is breaking out - we usually see money flow in there. The bigger the pattern - the bigger the rotation:\n\n[$RTY 1Y 1D](https://preview.redd.it/ir5d7f0kt0x71.png?width=2326&amp;format=png&amp;auto=webp&amp;s=356503c2794868dbe8451674166e3988b421e126)\n\nThe gist is - **if IWM is breaking out, meme plays are going to have a much higher probability of success**. Keep a close eye on this chart when playing these names.\n\nWe need a weekly close above **2323** to seal the deal. This means Friday @ 5:00 P.M. needs to be over **2323.**\n\nFrom there, RTY should be in the rotation for 3+ months, targeting **2500** mainly and possibly even **2600**.\n\nDuring this time, small caps/meme stocks should stay in the rotation, and WSB might stop losing money. I have my doubts that they can all sustain an up move for that long though, so don't get too attached to any one name. Money will likely flow from stock to stock within the index. You could also play IWM directly.\n\n**One last thing - J Pow Presser is on Wednesday. Depending what he says, a wrench could be thrown in this breakout. Remember we need the weekly close at least for something of this magnitude.**\n\n\\---\n\n*Not Financial Advice*",
        "subreddit": "wallstreetbets",
        "title": "$IWM Is Doing Something Big - WHY YOU SHOULD CARE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qkjbmp/iwm_is_doing_something_big_why_you_should_care/",
        "created": 1635817327.0
    },
    {
        "author": "daddyforce69",
        "created_utc": 1637633788,
        "id": "r02d9a",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": " Hello all,\n\nI'm  a 24 year old newbie just started to invest for about 3 months. I do not have a good income rn (\\~25k a year but starting in next spring I will have a raise and bump it to 50-70k.) but i just want to dip my toes in the water and start learning about investing. Was doing okay  (initial deposit was 3.5k) and was up about 5% until I find out WSB.  Made some retard plays (listened to those \"DD\" about CLOV, IRNT, CRSR)  and lost about 15% of my portfolio. After that I started to do a lot  more DD and here are my current position:\n\nTD account\n\n3 shares of AAPL @ 150\n\n3 shares of AMC @ 40\n\n1 share of AMD @ 105\n\n1 share of DIS @ 160\n\n15 shares of SOFI @ 19 and 2 option plays April 2022 strike 25 and 30 (bought that 6 weeks ago first and only option play)\n\n1 share of tsm @ 110\n\n1 share of unity @ 120\n\n1 share of V @ 210\n\n1 share of VOO @ 410\n\nWEBULL account\n\n1.5 share of AFRM @ 130\n\n0.12 share of GOOG @ 2680\n\n1 share of MSFT @ 283\n\n0.5 share of TSLA (Bought @ 700 and sold half @ 1150 \\~10 days ago, totally lucky play)\n\n0.1 share of AMZN @ 3250\n\n1.3 share of FB @ 330\n\n2.5 share of PYPL @ 235 (RIP)\n\n1 share of NVDA @ 200\n\nAs  you can see I have tons of different stocks all over the places, I'm up  about 8% overall even after those retard plays (been adding more  deposits overtime so total principle now is 5.5k) until recently SOFI  start tanking and today a lot of tech stocks tank because of the  treasury yields FUD.\n\nI'm glad that  I started to invest in a relatively young age, and I've been reading a  lot of articles and books to understand the market, but the more i know  the more I don't know. And my biggest problem is I keep looking at my  phone every 5 mins and it has been heavily influence my work life and  life in general negatively.\n\nNow here's my question;\n\nShould  i just put like 75% of my portfolio and a few ETFs so I can actually  enjoy life and not to worry about stock every 5 sec? I would be lying to  say I don't want to make big money quick but I've learn my lesson  knowing I'm not smart or experienced enough to swing trade (or have time  to do so.) I've been looking at putting 50% of my port in QQQ and VOO,  and 20% to SMH and then 20% with specific stocks that i like and 10%  cash. Any recommendation of what kinds of ETFs should I get base on the  stocks that I own rn? I'm still young so I'm fine with higher risk ETFs  plus I only have like 6k in my account so it's not that big of a deal.  But keep tracking on the market has drained my life and i need to get  out of it this swamp.\n\nAny help would be appreciated!\n\nP.S. I will keep putting 2-300 bucks a month in and 500 after I get a raise",
        "subreddit": "StockMarket",
        "title": "A struggling newbie need some help",
        "url": "https://www.reddit.com/r/StockMarket/comments/r02d9a/a_struggling_newbie_need_some_help/",
        "created": 1637662588.0
    },
    {
        "author": "zyndurai",
        "created_utc": 1636752589,
        "id": "qslcz9",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "What if I sold AMC 40c strike today and it’s right at 40? Will my shares be called away? I didn’t so I would know the outcome but I wonder what would happen? Likewise if I sold a cash secured out at 40 for today strike, what would happen? Thanks in advance for your replies",
        "subreddit": "options",
        "title": "Covered calls and covered puts strike right on the money?",
        "url": "https://www.reddit.com/r/options/comments/qslcz9/covered_calls_and_covered_puts_strike_right_on/",
        "created": 1636781389.0
    },
    {
        "author": "Tigs1185",
        "created_utc": 1636846925,
        "id": "qtd270",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "\n\n\n\n\nI first found Sundial back when it was 30 cents summer of last year. Just threw $100 into it so I could have some weed stock in my pocket. I barely checked it what ever happened, happened. Then as we all know GameStop did it’s thing and I figured that there was going to be some copy cat explosive stocks. I started diving into the stocks I had AMC, TSLA, SNDL, SLGG, CTRM. But SNDL caught my eye (probably because it was the cheapest and I was a beginner at trading). At this time it had rose to about 80 cents and I thought why don’t just put $1000 into it.(a $1,000 I couldn’t afford to lose) the next week it rose to the $1.20 range and I thought I was a master at picking stocks. My head was HUGE so what did I do? I doubled down told my self when market opened I was going to sell all my other stocks and go all in. Well during pre market it went from $1.20 to the $2 range. I stuck to my plan and jumped all in. Confident that this was never going to drop ever again. Then boom after hours that day SNDL hit in after market $4. Now my head was the size of the Statue of Liberty. And I took my last $2,000 and bought in again at $3.60. Making my average $3.12. 5,000 shares. I was ready to become a millionaire at age 20. Little did I know that it was never to see $3 again. And slowly and painfully I watched my beloeved million dollar purchase turn into pocket change. During this bleeding I thought to myself time after time I should sell and move on. But hope was still alive, they were debt free, they had a billion dollars on hand, they bought into spirit leaf. Every month was a new investment. I started to become in love with their game plan. Being the big bad bud bank, playing loan shark with companies that weren’t even in the cannabis industry. So even through all the red and months of bleeding. I averaged down and saved and saved, reinvested all my money back into SNDL and lowered my price to 10,000 shares at $1 average. Beginning of the week was the last purchase I made $2,000 at 65 cents. I’m ready for years to come with this stock. People will get scared and sell that is inevitable but I believe this struggle and rainy times will prove to be the best decision I could have made.",
        "subreddit": "weedstocks",
        "title": "Sundial Growers SNDL my last 8 months owning",
        "url": "https://www.reddit.com/r/weedstocks/comments/qtd270/sundial_growers_sndl_my_last_8_months_owning/",
        "created": 1636875725.0
    },
    {
        "author": "fiscalscrub",
        "created_utc": 1636467705,
        "id": "qq4pot",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Basically title\n\nI’m considering selling LEAPS with a delta of .8-.9 against shares I own of BB\n\nI bought into a lot of BB back when things got crazy with GME and AMC and all that. My average cost is 11.9/share, and I would sell CC against the shares anywhere from 1 week to 1 month out\n\nI kept a log book of all the credits, and as of ~6 months ago my avg cost after accounting for the CC premium is 5.76/share. I’ve stopped logging the credits since then\n\nLooking at deep itm LEAPS, the credit for these contracts is greater than my average share cost\n\nSo my thought process was, if I sell these calls, I’ll have all my original cash back and then some, and after hopefully being assigned at the expiration, I’ll have another wad of cash \n\nAnd I figure, considering the time value of money, it’s better to have the money up front and put it back to work doing something else. Like maybe an ETF\n\nSo I beseech thee, hive-mind, pros/cons? Something else I’m not thinking about?\n\nThanks in advance",
        "subreddit": "options",
        "title": "Selling deep itm LEAPS",
        "url": "https://www.reddit.com/r/options/comments/qq4pot/selling_deep_itm_leaps/",
        "created": 1636496505.0
    },
    {
        "author": "NdSeIr",
        "created_utc": 1636305176,
        "id": "qosyfh",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "TLDR: solid financials, consistent growth, dedicated user base, low share float, high short interest, massive insider buying, massive institution buying, low expectations for earnings=high upside potential.\n\n&amp;#x200B;\n\nCricut designs and markets a creativity platform that enables users to create professional looking handmade goods. They have three main revenue streams: connected machines, subscriptions, and accessories/materials. The company provides connected machines, design apps, and accessories and materials for users to create personalized birthday cards, mugs, T-shirts, and large-scale interior decorations under the Cricut brand. The subscriptions(Wall Street fucking loves subscriptions) allow users to access a library of images, fonts, and other features.\n\n&amp;#x200B;\n\n[Solid growth](https://preview.redd.it/tmf2qkydh7y71.png?width=603&amp;format=png&amp;auto=webp&amp;s=446a1da27bc6bc4d1796a24576b677cc0a2f3736)\n\n&amp;#x200B;\n\n[Massive increase in free cash flow](https://preview.redd.it/qe7obblfh7y71.png?width=686&amp;format=png&amp;auto=webp&amp;s=dde48463d83967a1f6f4f1b1956bf591014714fc)\n\nThey also recently created partnerships with three major retailers worldwide. They've begun selling their machines in Virgin Megastores in the United Arab Emirates, 750 Best Buy locations in the US, and 500 Staples locations in the US. They have a massive online following of Becky's, with over 1.4 million followers on Instagram, and a huge presence on Facebook, Etsy, and Pinterest. This is anecdotal, but I've spoken to a few friends who sell on Etsy, and they swear by Cricut. One of the biggest draws of Critcut is the fact that you can build very successful businesses on their platform, and their ecosystem contains all the pieces needed to make money. Very attractive to the essential oil selling, Amway believing demographic. So we have a well-run business with a passionate user base that has seen very solid growth over the past couple years. All good reasons to invest, but here is the interesting part.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/sb56yo7hh7y71.png?width=465&amp;format=png&amp;auto=webp&amp;s=a9fcd5f5fc186f9645fdfe8077b8b476c77b6c3e\n\nIt has 208 million shares outstanding, but the public float is ONLY 20.8 million. For comparison, UPST has a public float of 54 million. I chose UPST for comparison because of the 150%+ runs it went on after its earnings. I'm not saying CRCT will do something similar, but I think it is possible, and here's why.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ui5hvf2ih7y71.png?width=383&amp;format=png&amp;auto=webp&amp;s=83a64f3f0bce701f0f9c749a16e8b247ddecc751\n\nOrtex has the short interest at 22.41%, with 4.65 million shares of the 20 million share float loaned out. Not astronomical, but pretty high. A significant spike in buying as a result of stellar earnings could catch those shorts with their dicks in their hands, and send CRCT skyrocketing as they try to scramble for shares to stop the bleeding. And remember, there aren't many shares to be had, because the vast majority of the shares outstanding are locked up with institutions.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/49wufzujh7y71.png?width=1374&amp;format=png&amp;auto=webp&amp;s=42b04b445cb4ff54488a0fb94f5aa59d0aaeac5f\n\nHere are the major holders. Some big names for sure, but its the top one that I want to point out. Abdiel capital is a hedge fund run by Colin Moran and Geoff Gentile. They are both Ivy League educated, and worked for Goldman and Barclays respectively before starting Abdiel. Much smarter than me, and their fund manages over 5 billion in assets. Over the past couple months, they have been buying CRCT at a super aggressive pace.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/rl04z29kh7y71.png?width=603&amp;format=png&amp;auto=webp&amp;s=fd0c7ee6ee585cf8bcb710db42ef52dd22a0dbfe\n\nEvery B on that graph is a large buy order from Abdiel. They now own 600 million dollars worth of stock. I'm also assuming that they have bought more since mid-September, and it hasn't been reported yet.\n\n&amp;#x200B;\n\n[Big insider buys](https://preview.redd.it/7m28bf8lh7y71.png?width=197&amp;format=png&amp;auto=webp&amp;s=0174aa4cb429e5c3a31703175e415e9215391fef)\n\n&amp;#x200B;\n\n[Board member bought 50K shares Thursday](https://preview.redd.it/yw1tbpkmh7y71.png?width=990&amp;format=png&amp;auto=webp&amp;s=c1d9d4d9fd66b0b10d0b73a77a560d0735981607)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/vdnkyf7ph7y71.png?width=1086&amp;format=png&amp;auto=webp&amp;s=860632e9323a94ff775d144473320ab0d7c5e4ae\n\nThe stock tanked after its earnings on August 12, even after beating big on both EPS and revenue. The CFO cautioned that Q3 would not be as good and did not offer guidance, citing that people are staying home less from the economy reopening. Wall Street fucking hates when companies don't offer guidance because it means uncertainty, so it sold off. The EPS estimate for Q3 is 0.16, which is well below its reported number of 0.22 on August 12. Additionally, revenue is expected to be at 256 million, well below the 334 million reported for Q2. The bar is set low....\n\n&amp;#x200B;\n\nhttps://preview.redd.it/nqligneqh7y71.png?width=592&amp;format=png&amp;auto=webp&amp;s=698386c7906b213ed1c8c3c0daaa9ca196d90df4\n\nOne thing I want to point out is on August 13, the day of the 25% sell off, Abdiel made their largest purchase to date of 1.5 million shares. Over the course of the next week, they bought about an additional 1 million+ shares, clearly indicating their conviction in their play.\n\nI don't have a position in CRCT yet as I've been researching this for the past couple days. I'm currently in DIS and AMC calls. I'll decide what to do tomorrow based on how everything is looking, but I'll definitely begin scaling in. The spreads are a bit wide on way OTM options, but tighten up the closer you get to the money. I'm probably going to do 40% shares, 40% close to the money Dec calls, and 20% lotto $50 Dec calls. If you're a gambler, I think Nov $35 calls are the way to go. Best of luck.",
        "subreddit": "wallstreetbets",
        "title": "CRCT DD. Potential Squeeze Play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qosyfh/crct_dd_potential_squeeze_play/",
        "created": 1636333976.0
    },
    {
        "author": "Naughty_Funkle_1992",
        "created_utc": 1635938121,
        "id": "qls7ab",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Ban on shorting GME &amp; AMC? Margin rate increase 30%-100% on GME, CLOV… is something coming 🔥🤷‍♂️",
        "url": "https://i.redd.it/122ck5af6dx71.jpg",
        "created": 1635966921.0
    },
    {
        "author": "Over-Cicada-446",
        "created_utc": 1636441787,
        "id": "qpy8e0",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "$ROOT has been heavily shorted over the last year. I suspect big insurance industries with racist/classiest policies are trying their best to keep $ROOT down so that they can keep the monopoly they have in the industry and charge insane amounts of money on insurance from the less wealthy. $ROOT analyzes your driving habits and how good of a drive you are (Which really should be the only factor) to quote your premium. Classic insurance has long been using credit scores and your location to determine insurance rates and they want to keep doing it to justify high premium rates. As of writing this,  41.77% of $ROOT is shorted and has been like this since it's IPO. We need to do some $GME / $AMC magic on this baby too and show the big insurance companies that their classiest/racist ways of quoting insurance are long gone and insurance quotes should be based on how well someone drives not their credit score or where they live.",
        "subreddit": "wallstreetbets",
        "title": "Here's a bright idea for us retail investors to burn short sellers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qpy8e0/heres_a_bright_idea_for_us_retail_investors_to/",
        "created": 1636470587.0
    },
    {
        "author": "SilbergleitJunior",
        "created_utc": 1636391057,
        "id": "qphy0s",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I noticed that WSB went from hyping WISH to $69 before infamous Q2 earnings to ridiculing it below $5 whenever someone mentions it. This does not surprise me since most of you buy high and sell low. You made fun of DFV when he first started doing DD on GME, you thought AMC was going bankrupt, you bought PTON above $100 because \"every girl is talking about it\", you bought ZM above $500 because \"everyone is using it\" and so on. Anyway, I'm not here to waste my time on your losses, I'm here to talk business.\n\n**I'm going to make a few arguments and I'm challenging each one of you, if you disagree me, to explain why and post your short position. Talk is cheap my friends. Positions or ban.**\n\n# WISH sells garbage\n\nYes, and? What's the problem exactly? MCD is selling garbage and you are eating it. WMT sells garbage and you go there every week. AMZN sells garbage (more on this later). Dollar stores sell garbage. NFLX films garbage. People are dumb. They love garbage. Cheap garbage? Even better. WISH sells garbage. We get it. They sell lots of garbage. $2.8 billion worth of garbage!\n\n# Did you ever buy anything on WISH?\n\nYes I did. I bought a garbage bin and had no issues with it. The product was shipped from Chyna, it was just as described and arrived in 2 weeks, as predicted. Proof: https://twitter.com/SilbergleitJr/status/1450962281865515009\n\n# WISH is under-priced compared to other e-commerce stocks\n\nWISH:  \n\\- $2.8 billion revenue (*trailing 12 months)*  \n\\- $3.1 billion market cap  \n\\- P/S: 1.11\n\nETSY:  \n\\- $2.2 billion revenue (*trailing 12 months)*  \n\\- $33 billion market cap  \n\\- P/S: 15\n\nEBAY:  \n\\- $11.6 billion revenue (*trailing 12 months)*  \n\\- $47.3 billion market cap  \n\\- P/S: 4.08\n\nJMIA:  \n\\- $174 million revenue (*trailing 12 months*)  \n\\- $1.72 billion market cap  \n\\- P/S: 9.88\n\nSHOP:  \n\\- $4.2 billion in revenue (*trailing 12 months)*  \n\\- $192 billion market cap  \n\\- P/S: 45.71\n\n# Beating a dead horse\n\nYou see, when you deal with single digit stocks like AMC at $2 in January 2021, GME at $5 in August 2020,  there is a point at which there is just no meat left. There is only a bone. You can't short stock into an oblivion. There is nothing left to short! You are running a risk. At some point, the rewards from going long way outweigh the risk of going short on a beaten down stock. Melvin did not understand this concept and that's why they lost billions. Simple as that.\n\n# WISH is way down since its IPO\n\nYes exactly. All your favorite growth stocks that you are now buying at all time highs got destroyed during their first year on the market. Don't believe me? [Take a look at FB, SNAP, ETSY.](https://twitter.com/SilbergleitJr/status/1446256776110878723)\n\n[You didn't buy the dip, did you?](https://preview.redd.it/rvyst90jyby71.png?width=1280&amp;format=png&amp;auto=webp&amp;s=d901758f86ff1d2fae371f54a9c1e1330e87376a)\n\n# AMZN and WISH sell same stuff\n\nWhat most of you idiots don't realize is that you can buy the exact same items on WISH instead of AMZN for much less. Bezos is selling you the exact same overpriced Chinese garbage while you complain how WISH is selling garbage. If you don't realize how stupid you are at this point, I'm not sure how to help you.  \n\n\n[$15 on Amazon.](https://preview.redd.it/ugnklesxtby71.png?width=584&amp;format=png&amp;auto=webp&amp;s=62045a98befe9debe30df113b1aae524be8103dd)\n\n&amp;#x200B;\n\n[That same product on WISH for 50&amp;#37; off.](https://preview.redd.it/pqlvtel0uby71.png?width=432&amp;format=png&amp;auto=webp&amp;s=e378cfebe148c0cb36d0ee4233a2c98ba5f28b1c)\n\n# WISH local sellers\n\nWISH local pickup model has the potential to become an indexed and searchable city flea market.  Imagine being able to search all those small Chinatown stores in your city! Want a flower pot? Go here. Want a cheap garden hose extension? Go there. This model cuts down significantly on shipping times because WISH just directs you to the nearby store.\n\n# 1Sansome\n\nFor those very few of you that have girlfriends, you may have heard of Shein. Shein is a Chinese fast fashion retail that sells - you guessed it - garbage! They are basically a drop shipping business (same as WISH) as they do not produce their own clothing. They ship exclusively from China. Shipping times are longer than Amazon Prime. That did not prevent them to become the largest online-only fashion company in the world! Why am I telling you all this? Because WISH recently launched 1Sansome shopping app that is basically a clone of Shein. Heck, even models are the exact same! Go to both of their websites and you will realize what I'm telling you. They are giving free garbage to Instagram and TikTok hotties to fuel this thing until they become a recognizable name among girls who propelled Shein to the clouds.\n\n[Focus on the sign.](https://preview.redd.it/a15vcch2xby71.png?width=988&amp;format=png&amp;auto=webp&amp;s=fbf5c84f0c782ab6ac6694874dd08c0b4266cf31)\n\n# Conclusion\n\nI said what I need to say. I put my money where my mouth is. Positions or ban. I'm not afraid to show my red WISH positions because I know \"scared money makes no money\". Before bashing, calling me a pumper, bagholder, share your WISH short positions or GTFO.\n\n[My WISH positions.](https://preview.redd.it/tbmh070ixby71.png?width=1678&amp;format=png&amp;auto=webp&amp;s=009e60328c0692d6ccef23f93de512a44d821283)",
        "subreddit": "wallstreetbets",
        "title": "Why you are wrong about WISH",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qphy0s/why_you_are_wrong_about_wish/",
        "created": 1636419857.0
    },
    {
        "author": "RoomTemplQ",
        "created_utc": 1635904074,
        "id": "qljwq2",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/tommilpscax71.png?width=1333&amp;format=png&amp;auto=webp&amp;s=6fb2d0e5d5e42f0dab6241dd48ed77b91e5f2d77\n\nHello Wallstreetbets,\n\nHave any of you looked into 'the end game' for companies that are serial repurchasers of their own stock? I remember seeing [this news piece](https://www.nasdaq.com/articles/dillards-to-repurchase-up-to-%24500-mln-of-class-a-common-stock-2021-05-15) about Dillard's ($DDS) board approval for $500 million earlier and not thinking too much about it. I thought their YTD performance was primarily driven by a high short interest squeeze, similar to the moves in $GME and $AMC.\n\nHowever, some really smart people in the industry have been paying attention, and prominent names like David Einhorn [mentioned owning Dillard's](https://youtu.be/D8R6fFq0siI?t=2266) during the turn of events this past year. While some algo-related short interest has helped propel the stock higher, it's incredible that a $5 billion enterprise value business has only 20 million shares outstanding. \n\nSo, the question is, are other companies near this 'end game' like a snake that eats its own tail? Tickers like $KLAC, $IT, $BBWI, $CHTR, $CDNS, and $AZO are in high buyback ETFs, and have respectable-enough business models that the S&amp;P approves of.\n\nAlso, when I actually try to model out $DDS's current repurchase plan, I'm no Dexter, but I think it would take 170 years for the company to buy itself completely back (assuming constant $500 million in annual repurchases, same valuation as of today's closing price, 'flat' stock price per year, and eventually, fractional share repurchases). It would have to be modeled by day to actually see how the daily stock price fluctuates based on incremental repurchases, but the end game is the same. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/gc1gs6kycax71.png?width=1444&amp;format=png&amp;auto=webp&amp;s=5afa9067d64dcdc4089afd916a920b563ce52a10\n\nAccording to those same calculations, this repurchase plan would give 13.9% ARR (annual rate of return) for the first 10 years. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/hha00t90dax71.png?width=907&amp;format=png&amp;auto=webp&amp;s=78d98df698fde0285810f5d5a48901f368585b3c\n\nDo the flat-line assumptions make this too good to be true? Along with c-suite incentives to boost EPS and increase % control of the company, should boomer-esq companies just use FCF to repurchase instead of paying out dividends? \n\n**TLDR:** \n\n\\- Dillard's ($DDS) has bought back a lot of stock. What are the end game implications for this?\n\n\\- What other companies are nearing this buyback 'end game'?\n\n\\- Is it possible to model repurchase plans multiple years out in advance?\n\n&amp;#x200B;\n\nAppreciate any responses in advance. Thanks.",
        "subreddit": "wallstreetbets",
        "title": "Will Dillard's ($DDS) Buy Itself Entirely Back? Questions About The End Game For Serial Repurchasers",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qljwq2/will_dillards_dds_buy_itself_entirely_back/",
        "created": 1635932874.0
    },
    {
        "author": "Constant-Surprise-39",
        "created_utc": 1637124165,
        "id": "qvr79m",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "(TLDR @ BOTTOM)\n\nOkay, I quit engaging in what I would consider “traditional” investing at the beginning of July. Started off with some stupid meme bullshit, and not the good ones either. I bought some $WISH, $TLRY, $CLOV... you get the picture. Bought high and sold for losses by mid-august. I decided I would use Robinhood as my fuck around account for trading options and moved a majority of my funds to TDAmeritrade where I went all in on $SOFI (which I’m very thankful for obviously lol). So I started trading options and started off by losing a bunch on $SAVE calls around their earnings. I bought $AMD after its first run and just didn’t know what I was doing, lost more. I hit on one of the $AMC runs but didn’t cash out early enough, reinvested too quickly, and was right back down. I proceeded to have a few more ups and downs until I told myself I needed to reevaluate. I was down just under $5,000 at the beginning of October. Well I had a killer two months, but I think it was more luck (and a lot of $SOFI). My best trade was an $80 weekly $RBLK call that I made over 500% on. Then, shit hit the fan again. Lost 60% on a $ROKU weekly and I thought $PLTR would rebound a bit quicker. I blew almost $5,000 in a week span, and after making nearly every cent back, I am down again. All time I’m only down a couple hundred because of my TD account, but I love the freedom of options money. I currently have one open position: 18 $22 $SOFI calls for 11/19. I think it rebounds tomorrow, but if it continues this bearish trend I’m going to bail on my calls.\n\nI spent a shit ton of time over the past couple weeks reviewing candlestick patterns and other metrics. I feel like the most useful tools, at least for determining momentum, is MACD and RSI. I’ve noticed when a stock opens below the MACD level and RSI is gradually declining, stocks are prone to jumps. Take $TSLA today for example: dipped under 20 day MA, showed early bullish signs, and nearly hit 20 day again. I know it had an early bearish pull back, but it never went under yesterday’s high. I would say a recent day or weeks worth of candlesticks is a nice play to set a stop loss target. I now always have MACD (12,26,9), RSI (14), Bollinger Bands (20), and MA (50) indicators on every chart. Are there any other big metrics you guys have found success in utilizing for swing or even day trades? I have tried to limit myself down to 10-15 strong stocks that I keep tabs on, but I’m leaning more towards 5-8 great ones instead. I obviously know earnings reports and media b.s. must always be taken into consideration, but that’s all to be taken with a grain of salt. Greeks are basic. Delta is speed your calls move relative to stock price and Theta is time decay. I know this is a lot, but I’m just trying to share experience and see what others think/do themselves. \n\nTLDR: I am an ape, I lost a nice chunk of money, made almost all of it back, and have now lost it again. I now actually try to use TA for my plays. I’ll have gain porn soon. Let’s discuss my stupidity or suggestions to improve.",
        "subreddit": "wallstreetbets",
        "title": "My Autistic Experience",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qvr79m/my_autistic_experience/",
        "created": 1637152965.0
    },
    {
        "author": "MythrowawayAcc5678",
        "created_utc": 1637129495,
        "id": "qvspwy",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "we were driving and he was one of those Uber drivers who is chill with talking.. he asked what my interests were and i said video games, reading, and learning about stocks. he mentioned he too was into stocks and coincidentally $UBER is actually such a great stock to own that's about to blow up. \n\nhe told me he expects Uber to compete with tesla and rivian, due to him believing self driving cars are the future and that Uber will most definitely be the forefront for being the \"self driving taxi\" of the future. he showed me his portfolio which consisted of UBER, TSLA, RIVN, GME, SOFI, FORD, AMC, etc.  \n\nhe said \"started since GME exploded and has seen massive profits on his positions\" and that he \"believes car companies are the future of transport\" , and his portfolio wasn't lying. should I take his advice into account? Uber looks to be trading sideways currently but if I buy now and it explodes, I'll be missing out and I'm fearful of that.",
        "subreddit": "stocks",
        "title": "$UBER recommended to me by my Uber, apparently it's a great stock to own?",
        "url": "https://www.reddit.com/r/stocks/comments/qvspwy/uber_recommended_to_me_by_my_uber_apparently_its/",
        "created": 1637158295.0
    },
    {
        "author": "Latter-day_weeb",
        "created_utc": 1637552250,
        "id": "qzc28l",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "So I am planning on depositing another $100 into my fidelity account, which they will let me use right away as good faith money, they also should be giving me $100 for opening the account (just opened it a few weeks ago), so with AMC trading just under $41, I would only be able to buy 4 shares, so would it be worth it to buy so few shares?",
        "subreddit": "smallstreetbets",
        "title": "Is AMC worth buying a few shares?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/qzc28l/is_amc_worth_buying_a_few_shares/",
        "created": 1637581050.0
    },
    {
        "author": "NdSeIr",
        "created_utc": 1636304242,
        "id": "qoslsy",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "TLDR:   solid financials, consistent growth, dedicated user base, low share float, high short interest, massive insider buying, massive institution buying, low expectations for earnings=high upside potential. \n\n&amp;#x200B;\n\nCricut designs and markets a creativity platform that enables users to create professional looking handmade goods.  They have three main revenue streams: connected machines, subscriptions, and accessories/materials.  The company provides connected machines, design apps, and accessories and materials for users to create personalized birthday cards, mugs, T-shirts, and large-scale interior decorations under the Cricut brand.  The subscriptions(Wall Street fucking loves subscriptions) allow users to access a library of images, fonts, and other features.  \n\n&amp;#x200B;\n\n[Solid growth](https://preview.redd.it/4x6zor7je7y71.png?width=603&amp;format=png&amp;auto=webp&amp;s=3ce6c18db5aa0a214ec4c81bbbfef0561632c79e)\n\n&amp;#x200B;\n\n[Massive increase in free cash flow](https://preview.redd.it/w9pjrqike7y71.png?width=686&amp;format=png&amp;auto=webp&amp;s=99d5f517f1d9d8842f1faa8e0c87b6e2b3c7cd20)\n\n&amp;#x200B;\n\nThey also recently created partnerships with three major retailers worldwide.  They've begun selling their machines in Virgin Megastores in the UAE, 750 Best Buy locations in the US, and 500 Staples locations in the US.  They have a massive online following of Becky's, with over 1.4 million followers on Instagram, and a huge presence on Facebook, Etsy, and Pinterest.  This is anecdotal, but I've spoken to a few friends who sell on Etsy, and they swear by Cricut.  One of the biggest draws of Critcut is the fact that you can build very successful businesses on their platform, and their ecosystem contains all the pieces needed to make money.  Very attractive to the essential oil selling, Amway believing demographic.  So we have a well-run business with a passionate user base that has seen very solid growth over the past couple years.  All good reasons to invest, but here is the interesting part.  \n\n&amp;#x200B;\n\nhttps://preview.redd.it/xwd7vf7me7y71.png?width=465&amp;format=png&amp;auto=webp&amp;s=28ce5c207e61d506aed4cd66db7f4762f42b3806\n\nIt has 208 million shares outstanding, but the public float is ONLY 20.8 million.  For comparison, UPST has a public float of 54 million.  I chose UPST for comparison because of the 150%+ runs it went on after its earnings.  I'm not saying CRCT will do something similar, but I think it is possible, and here's why.  \n\n&amp;#x200B;\n\nhttps://preview.redd.it/8y4kdn7ne7y71.png?width=383&amp;format=png&amp;auto=webp&amp;s=675f68a6a22c1f452a4155b5abf9578ef268a6ba\n\nOrtex has the short interest at 22.41%, with 4.65 million shares of the 20 million share float loaned out.  Not astronomical, but pretty high.    A significant spike in buying as a result of stellar earnings could catch those shorts with their dicks in their hands, and send CRCT skyrocketing as they try to scramble for shares to stop the bleeding.  And remember, there aren't many shares to be had, because 99.5% of the shares outstanding are locked up with institutions.  \n\n&amp;#x200B;\n\nhttps://preview.redd.it/majbplgoe7y71.png?width=1374&amp;format=png&amp;auto=webp&amp;s=17a54185e50ba724835546432cc500692a77a582\n\nHere are the major holders.  Some big names for sure, but its the top one that I want to point out.  Abdiel capital is a hedge fund run by Colin Moran and Geoff Gentile.  They are both Ivy League educated, and worked for Goldman and Barclays respectively before starting Abdiel.  Much smarter than me, and their fund manages over 5 billion in assets.  Over the past couple months, they have been buying CRCT at a super aggressive pace.  \n\n&amp;#x200B;\n\nhttps://preview.redd.it/vhpugogpe7y71.png?width=603&amp;format=png&amp;auto=webp&amp;s=395be67028c261268e600b702ed44660b00d9163\n\nEvery B on that graph is a large buy order from Abdiel.  They now own 600 million dollars worth of stock.  I'm also assuming that they have bought more since mid-September, and it hasn't been reported yet.  \n\n&amp;#x200B;\n\n[Big insider buys](https://preview.redd.it/a1nu38use7y71.png?width=197&amp;format=png&amp;auto=webp&amp;s=686cd5eb81c23311473a95f7080e39170767cf4c)\n\n&amp;#x200B;\n\n[Board member bought 50k shares on Thursday. ](https://preview.redd.it/0cdjhcnte7y71.png?width=990&amp;format=png&amp;auto=webp&amp;s=3a3790187d7b090d735b610faa82c3e1fe35f6c6)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/r9jheydqe7y71.png?width=1086&amp;format=png&amp;auto=webp&amp;s=750469170c4e1d71a4de9049c0c781037e2e8cf4\n\n \n\nThe stock tanked after its earnings on August 12, even after beating big on both EPS and revenue. The CFO cautioned that Q3 would not be as good and did not offer guidance, citing that people are staying home less from the economy reopening.  Wall Street fucking hates when companies don't offer guidance because it means uncertainty, so it sold off.  The EPS estimate for Q3 is 0.16, which is well below its reported number of 0.22 on August 12.  Additionally, revenue is expected to be at 256 million, well below the 334 million reported for Q2.  The bar is set low....\n\n&amp;#x200B;\n\nhttps://preview.redd.it/w65khgnre7y71.png?width=592&amp;format=png&amp;auto=webp&amp;s=ab769f3ff12f649c443dd183ab1dda5524e558cf\n\nOne thing I want to point out is on August 13, the day of the 25% sell off, Abdiel made their largest purchase to date of 1.5 million shares.  Over the course of the next week, they bought about an additional 1 million+ shares, clearly indicating their conviction in their play.  \n\n&amp;#x200B;\n\nI don't have a position in CRCT yet as I've been researching this for the past couple days.  I'm currently in DIS and AMC calls.  I'll decide what to do tomorrow based on how everything is looking, but I'll definitely begin scaling in.  The spreads are a bit wide on way OTM options, but tighten up the closer you get to the money.  I'm probably going to do 40-50% shares, 30% close to the money Dec calls, and 20% lotto $50 Dec calls.  If you're a gambler, I think Nov $35 calls are the way to go.  Best of luck.",
        "subreddit": "options",
        "title": "CRCT DD",
        "url": "https://www.reddit.com/r/options/comments/qoslsy/crct_dd/",
        "created": 1636333042.0
    },
    {
        "author": "lazywizard99",
        "created_utc": 1635977806,
        "id": "qm5szm",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "AMC to release the much anticipated Q3 results on Monday. What to Expect?",
        "url": "https://risingcandle.com/earnings/amc-to-release-q3-results-what-to-expect/",
        "created": 1636006606.0
    },
    {
        "author": "tempiexD",
        "created_utc": 1638226227,
        "id": "r57x65",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC SELL LOW BUY HIGH opportunity?!",
        "url": "https://i.redd.it/h92slvj16m281.png",
        "created": 1638255027.0
    },
    {
        "author": "PennyStockWorth",
        "created_utc": 1636127789,
        "id": "qne5b8",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "Let me make you money so that you can finally buy your wife’s boyfriend a car.\n\nLots of Apes are investing in electrification. Tesla, Lucid, Electric planes, electric trucks, etc… \nAdditionally our world leaders are investing in green solution, electrification of transportation and renewable energy sources to support the E-vehicles. \n\n\nHere’s the issue with renewable energy; it’s not on demand. To account for that we need to make 30-40% more energy at all times and ground the excess energy if we can’t use it. Also sometimes there’s no wind or sun… then what? \n\nDrums roll: “drdrdrdrdrdrdrdr” \n\nEnergy storage! Will solve this.\nThe next big market while everyone is focused on electric vehicles, will be energy to power these vehicles. \n\nWhat’s the best way to store energy efficiently right now? \n\n-Lithium-\nProblem, lithium is now being used to support our electrified transportation and other devices. We can’t use tonnes of it to store energy for cities as It’ll increase the competition for lithium worldwide and governments don’t want for the price of lithium metals to keep rising. Also we’d need cooling systems, staff on site 24/7, fire proofing the whole building, etc. It’ll be too expensive for the 10-15 life it’ll have, at that point might as well make more wind turbines and solar panels.\n\nSo now what? Should our governments just keep funding renewable energy and always make 30-40% more then what we need? This would cost trillions extra. \n\nIf only there was a way to store energy efficient enough and cheap enough…\n\nBigger Drums roll: “DRRMMDRMMMBBMMMPMMMBOWWW”\n\n\nComes in Energy Vault: (intro video)\nhttps://youtu.be/J2bkZbKeUmQ\n\nIt has already been tested to small scales and soon it’ll be tested fully: (being built now)\n\nhttps://youtu.be/k3fy1u7Gj1w\n\nBest part about this, is that the energy doesn’t dissipate over time.\n\nThere’s many solutions nowadays for energy storage, like storing energy using pressurized air, water reserves with height, etc… As en engineer let me tell you not only is this the cheapest method, it’s also the most efficient. It’s literally using the rotors wind turbines use to create energy or use energy to rotate. Also this doesn’t need a body of water or a hill. It’ll work anywhere. \n\n\nSo now what. Here’s tips for you to collect money to buy these stonks and finally buy your wife’s boyfriend a car. \n\n1. Steal your wife’s boyfriends bike and sell it on market place.\n2. Come home early and while your wife’s boyfriend is over sneak into his pants pockets and steal his wallet.\n3. Walk into hipster neighbourhoods and enter sketchy buildings. Look for holes in walls and place your mouth over one.\n4. Sperm bank \n5. Open a banana stand at your local AMC theatre or GME store. \n\nNow that you’ve collected money, buy the stonks and thank me in 6-12 months when you’re raising your wife’s boyfriend’s kid. \n\nCheers!\n\n« Energy Vault is teaming up with Novus Capital Corporation II »",
        "subreddit": "wallstreetbets",
        "title": "Let me make you money so that you can finally buy your wife’s boyfriend a car.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qne5b8/let_me_make_you_money_so_that_you_can_finally_buy/",
        "created": 1636156589.0
    },
    {
        "author": "Joshvir262",
        "created_utc": 1636579394,
        "id": "qr4kem",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Why I invested in gme instead of amc can't trust these snakes",
        "url": "https://www.cnbc.com/2021/11/10/amc-ceo-adam-aron-files-to-sell-1point25-million-shares-after-warning-meme-investors-he-would-do-so.html?__source=iosappshare%7Cnet.whatsapp.WhatsApp.ShareExtension",
        "created": 1636608194.0
    },
    {
        "author": "Grocerymilk",
        "created_utc": 1637406461,
        "id": "qy3fy2",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "All stars aligned\n+Share price dropped 92% from 52-week peak \n+Total cash $52m NO DEBT\n+Acne drug franchise about to be sold with two FDA newly approved drugs plus one phase 3 in pipeline, once asset sale is finalized, share price to the moon\n+Phase 2 AD drug result due in early q1, news will push price higher\n\nDo your DD this weekend.  This price will not last long!\n\nThis is SO GOOD THAT BOT SAYS V.Y.N.E is a banned ticker!\n\nMissed AMC at $2 GME at $5 PROG at $.66?  This is a risk free opportunity",
        "subreddit": "wallstreetbets",
        "title": "V Y N E is “PROG @ $.66”",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qy3fy2/v_y_n_e_is_prog_66/",
        "created": 1637435261.0
    },
    {
        "author": "Necrocarnal",
        "created_utc": 1635920888,
        "id": "qlogqj",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "TD Ameritrade said it is limiting certain options strategies and blocking short-selling of 4 stocks GME, AVIS, DWAC, and AMC",
        "url": "https://m.benzinga.com/article/23846768?utm_campaign=partner_feed&amp;utm_source=robinhood.com&amp;utm_medium=partner_feed&amp;utm_content=ticker_page",
        "created": 1635949688.0
    },
    {
        "author": "PinapplePizzaAMC",
        "created_utc": 1636810428,
        "id": "qt1d34",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Did I do this right? AMC Gain",
        "url": "https://i.redd.it/bqaap8z88dz71.jpg",
        "created": 1636839228.0
    },
    {
        "author": "jjd1226",
        "created_utc": 1636303043,
        "id": "qos6ey",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "# AMC - Upside Breakout Imminent? (Dec. 16th) - Bullish Bias\n\n* Support - 28.47 - 32.22\n* Resistance - 52.08\n* Target - 58.04 - 62.35\n* 🔑 gamma and delta strike - 40\n\nhttps://preview.redd.it/oqnkimx3b7y71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=fba155e4f0c0def82d8e6f673a231063abdca862\n\n# Options Data\n\n* Call total: 1,283,673\n* Put total: 932,956\n* Call volume: 210,604\n* Put volume: 84,860\n* 🔑 gamma strike: 40\n* 🔑 delta strike: 40\n\nhttps://preview.redd.it/a36mkp37b7y71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=1443311c418808d8c7389447f4912f65e170e9d6\n\n# AMC 5-Day History\n\nhttps://preview.redd.it/wwbdx9f8b7y71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=f26e63096c8f09590d810cd3d23cccc23424c40f\n\n# Recent News\n\n* AMC to sell its own branded popcorn at mall kiosks, supermarkets in 2022\n* Wedbush Downgrades AMC Stock Due to Retail 'Cash Out' Expectations\n\n# TSLA - Breakout to the downside? (Nov. 12th)\n\n* Support - 1210..40\n* Resistance - 1243.57\n* Bullish Target - 1269.83 - 1343.10\n* Bearish Target - 1171.00 - 1135.06\n\nhttps://preview.redd.it/3nqwslscb7y71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=d47e72fc71da9d43df4752be85fc1af84309642c\n\n# Options Data\n\n* Call total: 2,665,319\n* Put total: 3,385,035\n* Call volume: 350,313\n* Put volume: 412,324\n* 🔑 gamma strike: 1200\n* 🔑 delta strike: 1000\n\nhttps://preview.redd.it/ibwk6qdeb7y71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=56f0d10686bf21a2fc362708885ddec52cb7b3c7\n\n# TSLA 5-Day History\n\nhttps://preview.redd.it/sdqwqe3hb7y71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=af9413470d03ee38537caa75714bd4e285ef09ae\n\n# Recent News\n\n* Tesla CEO Elon Musk Proposes Selling 10% Of His Company Stock, He's Asking Twitter Followers To Decide\n* Apple Hires Tesla's Former Autopilot Software Director\n* Tesla Once Again Raises Prices As Model Y Sells Out, Adds New Free Paint Color\n* Lucid CEO Sees Tesla 4680 Batteries Being A 'Huge Breakthrough' As Just A 'Fantasy'\n\nThanks for reading,\n\n🌝NightMan",
        "subreddit": "options",
        "title": "AMC &amp; TSLA Breakouts?",
        "url": "https://www.reddit.com/r/options/comments/qos6ey/amc_tsla_breakouts/",
        "created": 1636331843.0
    },
    {
        "author": "Constant-Surprise-39",
        "created_utc": 1638312479,
        "id": "r5znwq",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Running of the (AMC) Bulls? RSI and MA support looking juicy",
        "url": "https://i.redd.it/wlkpdjndat281.png",
        "created": 1638341279.0
    },
    {
        "author": "bandmanpanda",
        "created_utc": 1637385258,
        "id": "qxyhpa",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hello fellow degenerates NIO just had a at the market offering so the new support is set in and short interest is at 49% on darknet pools if we Keep buying up we can make a AMC all over again im yoloing 84% of my acct in on calls. We apply the same logic to NIO SHOOT UP TO at least 60$ common now boys lets do this🔼🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nhttps://preview.redd.it/lepaipyfpo081.png?width=1170&amp;format=png&amp;auto=webp&amp;s=e2dab5284714c2b96cd995f0105eb8fc403ba4a6",
        "subreddit": "wallstreetbets",
        "title": "Rise of NIO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qxyhpa/rise_of_nio/",
        "created": 1637414058.0
    },
    {
        "author": "Zealousideal-Lie2709",
        "created_utc": 1636485591,
        "id": "qqb2it",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "**TLDR:** LMND = 🚀🚀🚀🌙\n\n**Float Size**\n\n37,910,000 shares\n\n**Current Short Volume**\n\n13,540,000 shares\n\n**Short Percent of Float**\n\n35.72% &lt;- This is prime for the squeezing\n\nhttps://www.marketbeat.com/stocks/NYSE/LMND/short-interest/\n\nLemonade is an industry changer for insurance. They use AI and ML to make it faster for you to get insurance payments. They make it so you don’t spend 5 hours on hold waiting for an insurance agent by getting rid of the agent, getting you money faster and charging you less for the insurance plan.\n\nLemonade has already been growing rapidly in housing insurance (my house is insured with Lemonade) and they just launched car insurance last week and jumped into the industry with an acquisition this week (https://www.marketwatch.com/story/metromile-stock-rallies-13-after-lemonade-announces-acquisition-11636408552). This company is seeing rapid growth and has already demonstrated huge potential, spiking to $180 stock price already within the last year before settling back down to \\~$63 where it is at the time of this writing (on sale after the acquisition).\n\nLMND is already a good stock, but on top of that Wall Street built a rocket for us and pre-loaded it with nitro. WallStreet over-extended again (just like GME and AMC) and it is time to catch them with their shorts down (literally and metaphorically).\n\nCurrently LMND is shorted for \\~36% of its shares (13,540,000 shares). The average daily volume for LMND is 2.2M shares, which makes days to cover 10.5 days. [https://www.marketbeat.com/stocks/NYSE/LMND/short-interest/](https://www.marketbeat.com/stocks/NYSE/LMND/short-interest/)\n\nNot only that, but Motley Fool agrees that this is prime territory for a squeeze: [https://www.fool.com/investing/2021/11/08/lemonade-is-ripe-for-short-squeezing/](https://www.fool.com/investing/2021/11/08/lemonade-is-ripe-for-short-squeezing/) \n\nWallStreetBets currently has 11.1M members. So what do we have to do to take these shorts hostage? If every ape here only bought 3 shares for \\~$200 total, we would own all of LMND and Wall Street would be forced to pay whatever ransom price we ask in order for them to get out. They will start getting margin-called as the stock price rockets up and they could take us to the moon!",
        "subreddit": "wallstreetbets",
        "title": "Short Squeezing Lemons into Sweet Lemonade (LMND)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qqb2it/short_squeezing_lemons_into_sweet_lemonade_lmnd/",
        "created": 1636514391.0
    },
    {
        "author": "UnhappyDish8786",
        "created_utc": 1636990782,
        "id": "quj671",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "MKM Reiterates Sell and $1 Price Target on AMC (AMC) Shares, Analyst Sees Improving Fundamentals and a Significant Valuation Disconnect",
        "url": "https://www.briefing.com/search?Ticker=AMC&amp;Range=6&amp;ArticleId=IN20211115095905AMC",
        "created": 1637019582.0
    },
    {
        "author": "Missionunstopable",
        "created_utc": 1637612382,
        "id": "qzuql8",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": " \n\nThis is the cycle i believe it. The only thing missing is volume. I dont believe big moves will happened to amc this week without volume. Volume is the only thing missing for the sqeeze to happened. that is why the blue to green phase price action looks different. We are close apes. Remember the lingo buy and hold. link to the video is down below.\n\nThere is a big difference of volume on the 2nd blue to green phase and third 4.6 billion compared to 600million we need 100 millions and up days and remember amc isn’t just going to the moon within one day. Volume will start rising and soon the price will change from $5 to $10 $20 and up. Ape strong together. I need feedback ands that includes everyone aganist this idea and i need to know why.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h81rrmdog7181.png?width=1834&amp;format=png&amp;auto=webp&amp;s=d8c4311678b7154b25ccb13e4e53ae2c83b70b67\n\n&amp;#x200B;\n\n[ ](https://preview.redd.it/nq5kj2hpg7181.png?width=1834&amp;format=png&amp;auto=webp&amp;s=41cce86b554382384993ad7a706c2b2ee04cf865)\n\nI couldnt do it without everyone in this community we all influneces each other. Shoutout to Astro he's the reason i started this chart last month\n\nRemember this Apes\n\n“**Coming together is a beginning; keeping together is progress; working together is success**. -Henry Ford .",
        "subreddit": "wallstreetbets",
        "title": "Amc Cycle Theory Unraveled",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qzuql8/amc_cycle_theory_unraveled/",
        "created": 1637641182.0
    },
    {
        "author": "SpaceXKart",
        "created_utc": 1636170459,
        "id": "qns3kl",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "1) Still 35 million stocks sold short!\n\nShorts, Darkpool, Options hedging &amp; Autists yolo’ng OTM calls helped shorts stay afloat and up in profits. Still over 35m shorts so one idea - Buy stonks!!\n\n\n2) Business/Product \n\nAligners itself is approved in many European countries and are successfully sold. But we still have fake dentists fear mongering. Operates in the U.S., Canada, Australia, New Zealand, United Kingdom, Ireland, Germany, Austria, Hong Kong, Singapore, Spain and Mexico.\n\nIt's important to note that the long-term story for SDC is intact and looks very promising, as they turn their business around to avoid these short-term one-off issues. SDC has a vertically-integrated platform and a very unique way of operating that prevents any other competitors from stealing their business. This is crucial to their business and is what will eventually allow them to grow profitably. Also keep in mind the extras they are selling including various dental products.\n\n3) Recent byte acquisition for 1b gives cue:\n\nThey could clearly receive a buy-out from Any healthcare company. At this valuation, I think major health care companies, manufacturing companies are seriously doing due diligence on SDC. I would clearly see P&amp;G or another conglomerate getting interested in SDC at these prices.\n\n4) MEME stonk \n\nOnly a few traditional “meme” stocks have been as relevant as SDC has been lately. Aside from GameStop and AMC, many other tickers have failed to achieve such exposure. SDC, on the other hand, managed to reach “top of the chart” status on the list of trending stocks on Reddit a couple of times in the last weeks, with more than 10,000 upvotes.",
        "subreddit": "wallstreetbets",
        "title": "Considering what has gone on with dogs and shibb, why can’t $SDC rocket to 100? trading at 2b cap. Why fundamentals doesn’t matter",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qns3kl/considering_what_has_gone_on_with_dogs_and_shibb/",
        "created": 1636199259.0
    },
    {
        "author": "xirulouko",
        "created_utc": 1636544070,
        "id": "qqsfej",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMC Stock: Now We Know What Tickles Investors",
        "url": "https://www.thestreet.com/memestocks/amc/amc-stock-now-we-know-what-tickles-investors",
        "created": 1636572870.0
    },
    {
        "author": "ChickyBang",
        "created_utc": 1637768127,
        "id": "r17vxs",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "I just started trading Options a couple of weeks ago. I have been selling AMC Weekly’s, and I have noticed a lot of OI at first then within a day or Two there’s not much left , is that because of people closing early ?or-rolling them Out  for more Premiums ? I notice a lot of 35 &amp; 40 strikes . \nThank you",
        "subreddit": "options",
        "title": "I have a couple of questions…",
        "url": "https://www.reddit.com/r/options/comments/r17vxs/i_have_a_couple_of_questions/",
        "created": 1637796927.0
    },
    {
        "author": "drekval",
        "created_utc": 1638094757,
        "id": "r41a9i",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Hello all.\nThis collective group probably has the purchasing power of a large bank or institution. \nWe used to have teamwork involved in manipulation of the markets, GAMESTOP, AMC, The Dog Coin.\nWe made that happen, and we made history.\nEvery comment on every post is about a different stock. Why aren’t we teaming up and taking on Wall Street? \nDavid vs Goliath, that’s what we were.\n\nI hope this post gains some traction: and I leave you with this.\n\nConsider a project of ours: I think Apple stock is severely undervalued. It’s the lowest price of any of the large tech companies.\n\nLong term: it’s not going anywhere and I believe a fair price in this current market is $1,000+.\nA project perhaps? Let’s talk about it. Please give me your thoughts.",
        "subreddit": "wallstreetbets",
        "title": "What happened to wall street bets? How did we come this far, as a collective group, and fail to make our millions? Let’s talk about it.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r41a9i/what_happened_to_wall_street_bets_how_did_we_come/",
        "created": 1638123557.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1635755702,
        "id": "qk9m1y",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n        \n|Ticker|Company|# Mentions (24H)|Mentions and Charts|\n|:-|:-|:-|:-|\n|AMC|AMC Entertainment Holdings Inc|[10](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|MSFT|Microsoft Corporation|[6](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Microsoft%20Corporation/MSFT?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|SPY|SPDR S&amp;P 500 ETF Trust|[5](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|GME|GameStop Corp|[5](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|FB|Facebook Inc|[5](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Facebook%20Inc/FB?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|AR|Antero Resources Corporation|[4](https://www.memebergterminal.com/stock/Antero%20Resources%20Corporation/AR?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Antero%20Resources%20Corporation/AR?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|AI|C3.ai Inc|[4](https://www.memebergterminal.com/stock/C3.ai%20Inc/AI?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/C3.ai%20Inc/AI?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|VOO|Vanguard S&amp;P 500 ETF|[4](https://www.memebergterminal.com/stock/Vanguard%20S%26P%20500%20ETF/VOO?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Vanguard%20S%26P%20500%20ETF/VOO?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|AMZN|Amazon.com Inc|[3](https://www.memebergterminal.com/stock/Amazon.com%20Inc/AMZN?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Amazon.com%20Inc/AMZN?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|QQQ|Invesco QQQ Trust Series 1|[3](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Invesco%20QQQ%20Trust%20Series%201/QQQ?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|TSLA|Tesla Inc|[3](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|GM|General Motors Company|[3](https://www.memebergterminal.com/stock/General%20Motors%20Company/GM?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/General%20Motors%20Company/GM?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|WW|WW International Inc|[2](https://www.memebergterminal.com/stock/WW%20International%20Inc/WW?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/WW%20International%20Inc/WW?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|NVDA|NVIDIA Corporation|[2](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/NVIDIA%20Corporation/NVDA?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|CLF|Cleveland-Cliffs Inc|[2](https://www.memebergterminal.com/stock/Cleveland-Cliffs%20Inc/CLF?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Cleveland-Cliffs%20Inc/CLF?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|IQ|iQIYI Inc|[2](https://www.memebergterminal.com/stock/iQIYI%20Inc/IQ?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/iQIYI%20Inc/IQ?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|ETH|Ethan Allen Interiors Inc|[2](https://www.memebergterminal.com/stock/Ethan%20Allen%20Interiors%20Inc/ETH?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Ethan%20Allen%20Interiors%20Inc/ETH?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|POWW|AMMO Inc|[2](https://www.memebergterminal.com/stock/AMMO%20Inc/POWW?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/AMMO%20Inc/POWW?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|AAPL|Apple Inc|[2](https://www.memebergterminal.com/stock/Apple%20Inc/AAPL?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Apple%20Inc/AAPL?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|SQ|Square Inc|[2](https://www.memebergterminal.com/stock/Square%20Inc/SQ?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Square%20Inc/SQ?utm_source=rsmb-stockmarket&amp;utm_medium=chart)\n|GDP|Goodrich Petroleum Corporation|[2](https://www.memebergterminal.com/stock/Goodrich%20Petroleum%20Corporation/GDP?utm_source=rsmb-stockmarket&amp;utm_medium=chart)|[See Specific Mentions](https://www.memebergterminal.com/stock/Goodrich%20Petroleum%20Corporation/GDP?utm_source=rsmb-stockmarket&amp;utm_medium=chart)",
        "subreddit": "StockMarket",
        "title": "I scraped r/stockmarket for the top ticker mentions in the last 24H. Here are the results (Monday November 01, 2021)",
        "url": "https://www.reddit.com/r/StockMarket/comments/qk9m1y/i_scraped_rstockmarket_for_the_top_ticker/",
        "created": 1635784502.0
    }
]