[
    {
        "author": "RugerRyan",
        "created_utc": 1622695969,
        "id": "nr589g",
        "num_comments": 80,
        "num_crossposts": 0,
        "selftext": "Hello HUMBL family!! Hope everyone is doing well on this beautiful Wednesday! This Friday CEO Brian Foote will be speaking on FOX with Charles Payne between 2-3pm.  HUMBL is in the works to be “THE AMAZON OF DIGITAL ASSETS”.  They did a soft  launch last week on a few NFT’s (Clint Eastwood, Morgan Freeman, and a few others. Today they announced a collaboration with (Athletes First) to help create “the digital legacy of some of the worlds greatest athletes and coaches in the NFL and NCAA”. Think digital baseball cards!!! This will be huge.   Next step in the business plan is to set up P2P payments like PayPal but it’ll be worldwide.  They recently hired new team members from Amazon, Walmart, Ticketmaster, Cisco, Discover Financial, Twitter, Goldman Sachs, Motorola and a few other players.  Last month they bought Monster Creative and the ticketing co Tickeri.  This is a sleeping giant that will take place of a few apps most used daily on their smartphones. This sleeping giant is something to make you generational wealth!     If I missed anything HUMBL family fill in the blanks.   Hope this post will bring light to some and you join in for the ride!!!   Looking forward to Friday!",
        "subreddit": "pennystocks",
        "title": "HUMBL CEO speaking on FOX with Charles Payne Friday 2-3pm",
        "url": "https://www.reddit.com/r/pennystocks/comments/nr589g/humbl_ceo_speaking_on_fox_with_charles_payne/",
        "created": 1622724769.0
    },
    {
        "author": "Theeliteshitposter",
        "created_utc": 1622872200,
        "id": "nsoves",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Why I think BB is legit\n\nHonest View on BB\n\nApe Research Analyst Report on BB: To the Moon\n\nWhat's up apes, I know the last couple weeks have been life-changing for some of us. As a grad student who grew up on the lower end of the middle class, I recognize how pumped some fo you must feel and commend everyone's brass balls- it's never easy to make money in a casino as heavily manipulated as the free market that is the USA. But turning to BB: it was never meant to be just some squeeze (although its end result could technically be called that if you really wanted too)- it's a retooling company embedded in a crucial sector to the modern global economy.\n\nAnd so while some of us have become capable of retirement in recent weeks, I want to talk about a name that is on the cusp of a resurrection.\n\n# For BB Holders, it's been tough lately.\n\nMany people have harsh memories of Blackberry: it was on the cusp of bankruptcy as recently as 2015. Revenue growth sunk from $20B at its peak in 2011 (82% hardware sales) to under a $1B in the 2010s; $BB stock sunk from a peak of $146 in 2008 to single digits, thanks to negative cash flows and rapidly declining top line growth.\n\n[Not surprising BB ate shit for so long- this useless Etch-a-Sketch was 82&amp;#37; of their revenue in 2011!](https://preview.redd.it/w7dt7c4bwd371.png?width=1196&amp;format=png&amp;auto=webp&amp;s=80e0a1b70f7bad3078d8bb3d3982d69b1d12f1bb)\n\n[It's been a long, tough run for Blackberry shareholders since they ended hardware production\\/sales. The stock has been largely irrelevant for years, falling from a peak of $146 in May 2008 to single digits \\&lt; $5B market cap. But its transition into a cybersecurity company is only beginning to pay fruit, which I believe the market will catch on to very soon. Times are a-changing!](https://preview.redd.it/f5zqz58dwd371.png?width=1202&amp;format=png&amp;auto=webp&amp;s=763644f3ae3cc922a25d1e06d7d0a295ae5d5ed9)\n\n# A Rebranded Business for the Digital Economy\n\nLike we've seen with the Chads in Gamestoink, successful companies are the ones willing to renounce their fading legacy businesses and embrace initiatives and industries that sit on the cusp of the digital age. Enter Blackberry. Now we all remember Blackberry's legacy business- the handheld pagers that looked like shit, but only quirky people embraced (POTUS and CEOs used Blackberry pagers over iPhones for the longest of times, until Blackberry discontinued its hardware line).\n\nHowever, the primary focus for Blackberry has never changed. Blackberry was always security-centric, and with the installation of CEO John S. Chen in 2013, Blackberry pivoted towards software- a trend that was always going to happen given Apple's prowess in manufacturing superior smartphones.\n\n&amp;#x200B;\n\n[John S. Chen's my homie. If you're scared about holding BB bags, just reassure yourself that that chin can hold both yours and his. But seriously, he's an innovator, having been credited with \\\\\"Saving Blackberry\\\\\"- pay attention, his vision doesn't end with subsistence.](https://preview.redd.it/l39tl9rfwd371.png?width=716&amp;format=png&amp;auto=webp&amp;s=91ee66024cfba9e04ea1566f5690aeb57ecd2497)\n\nBut like Ryan Cohen with Gamestop/Chewy, Blackberry recognized it needed to adapt to survive, and that's exactly what it has done under Chen's stewardship. A glimpse at Blackberry today is far different than the pioneer that once controlled 20%+ of the mobile hardware market.\n\n[Revenues have intuitively followed a similar trajectory as Blackberry's market cap. But the transformation under Chen's leadership so far is tangible: after hardware sales alone accounted for 82&amp;#37; of revenue in 2011, the company made a wide U-turn. After establishing \\(and meeting\\) a goal for fiscal 2020 revenue to top $1B again, hardware has fallen to just \\~3&amp;#37; of sales. Enterprise software \\(44&amp;#37;\\), Licensing &amp; IP \\(31&amp;#37;\\), and Technology Solutions \\(22&amp;#37;\\) now dominate BB's topline as of 2020, cementing its push and admittance to the cybersecurity market.](https://preview.redd.it/u9mg373iwd371.png?width=1194&amp;format=png&amp;auto=webp&amp;s=5c8790440834c2d2f933eb88018fa6971d95ce0e)\n\n# So what does Blackberry actually do now?\n\nTo be clear, the only people walking around with Blackberry \"phones\" nowadays are old junkies trying to revive some 2000s nostalgia. Blackberry doesn't make that archaic crap anymore. All you need to remember are three phrases when thinking about the new Blackberry: **enterprise software, licensing IP,** and **technology solutions**.\n\n* **Enterprise software** is one of the fastest growing components of BB's cybersecurity offering. It includes products like the Blackberry Enterprise Mobility Suite, which provides endpoint management and BlackBerry AtHoc, a secure communications platform.\n* **Licensing IP** is the segment responsible for the monetization of the Company’s global patent portfolio as well as the mobility licensing operations, which license the BlackBerry brand and device software to handset vendors.\n* **Technology Solutions** is the business that includes BlackBerry QNX embedded software as well as several emerging businesses such as the BlackBerry Radar fleet management solutions.\n\nExciting Partnerships, Soaring Ambitions\n\n*\\*\\*You should really take a look at some of Blackberry's partnerships in the last 2 years- this is not a company that makes shitty pagers anymore, it's the company that embodies \"digital transformation.\"*\n\nTake a look at some of the companies Blackberry is sleeping with and tell me your smooth gorilla brain doesn't swell:\n\n* **Baidu** has an extensive partnership with BB in its autonomous vehicle unit, dating back to 2018. In January 2018, the two companies announced they would [partner](https://www.blackberry.com/us/en/company/newsroom/press-releases/2018/blackberry-and-baidu-partnering-to-accelerate-connected-and-autonomous-vehicle-technology) to utilize Blackberry QNX's OS as the backbone of Baidu's autonomous system. Blackberry also agreed to help Baidu integrate smartphone integration software for Chinese connected cars (CarLife), conversational AI (DuerOS), and HD maps. In January 2021, these two [expanded](https://www.blackberry.com/us/en/company/newsroom/press-releases/2021/blackberry-expands-partnership-with-baidu-to-power-next-generation-autonomous-driving-technology) their relationship: Blackberry's QNX Neutrino Real-Time OS is being utilized for all future EV models produced with the EV branch of GAC (Guangzhou Automotive Group, yes the C isn't a typo). Pretty exciting stuff to say the least..\n* **Motional**, which is a Hyundai backed AV startup, [announced](https://www.blackberry.com/us/en/company/newsroom/press-releases/2021/blackberrys-qnx-black-channel-communications-to-be-used-in-motionals-driverless-platform) in February 2021 its intentions to use BB's Black Channel communications technology for all of Motional's future AVs. A very integral input for Motional and impressive win for Blackberry, being able to ensure safe data communication exchanges within vehicle safety systems is essential for AVs' successful integration in society... otherwise where is the trust in accepting that ride? Not to mention that Apple (*the Tim Apple*) was chirping around with Hyundai and Kia, talking about making a \"smart car,\" *earlier this year!* I guess all the ape memes about Blackberry being a legitimate competitor to Apple shouldn't be sneezed at by Wall St equity research analysts and BB 🌈🐻s...\n* **AWS**, yes Amazon Web Services (!), is another credible player lining up with Blackberry. Although not quite as exciting as building actual AVs, the work they do is still essential to ensure this dream can actually be realized. In December 2020, the two Chads [announced](https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/aws-blackberry-join-forces-to-accelerate-innovation-with-new-intelligent-vehicle-data-platform) a multi-year partnership to develop BB's IVY platform (Intelligent Vehicle Data, yes the \"Y\" is weird, but makes sense for ape leadership), allowing automakers to read sensor data, normalize it, and create actionable insights from the data both in the vehicle and in the cloud.\n\nTake it from Amazon's new CEO, Andy Jassy himself: *“AWS and BlackBerry are making it possible for any automaker to continuously reinvent the customer experience and transform vehicles from fixed pieces of technology into systems that can grow and adapt with a user’s needs and preferences. Through this joint effort with BlackBerry, we will provide automakers with the insights, capabilities, agility, and speed they need to thrive in an increasingly connected world. As automakers seek to race ahead in their digital transformations, BlackBerry IVY empowers them to build their brands and set the standard for connected vehicle services across the automotive industry.”*\n\n[These geniuses love Blackberry, starting with their most intelligent, scalable business: AWS! Shouldn't you apes like BB as well?](https://preview.redd.it/ktha1d7nwd371.png?width=1218&amp;format=png&amp;auto=webp&amp;s=892b2415869531f1cf47f9c54b6d6e668c252877)\n\nBut why should I stop there? I'm tired of seeing fear-mongering Wall Street hedge funds, investment bankers, and research analysts attempting to push their positions (BB's primary competitors are IBM, Microsoft, VMware, and Mobile Iron, the former 3 of which are all significantly owned by \"institutions\" - &gt;75%) and allege Blackberry is a dying business that makes crappy hardware.\n\n* **Microsoft** (Yes its rival!) even realizes its budding competitor is crafting innovative solutions, announcing a partnership in [October 2020](https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/blackberry-athoc-integrates-with-microsoft-teams-for-critical-event-management) for Microsoft Teams! Microsoft plans to integrate Blackberry AtHoc, which will allow organizations on Teams to contact, alert, and account for all members of their group directly through Teams should some calamity transpire. Especially as we witness more cyber attacks (the digital economy's biggest threat will stem from this), it will be an all hands-on-deck effort to safeguard the integrity of our software. BB's partnership with Microsoft (and [ServiceNow](https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/blackberry-athoc-and-servicenow-partner-to-deliver-secure-and-re) for incident response management) not only grounds its strong advance to cybersecurity industry disruption, but its diverse agility to penetrate various sectors, ranging from AV/EV, CRM software, IoT, 5G, and so much more.\n* If the corporate pedigree isn't enough for you, I'll end with the **U.S. Air Force**. No, unlike what bulge bracket banks may lead you to believe, BB's revenue stream is well-diversified, as the USAF [announced](https://www.blackberry.com/us/en/company/newsroom/press-releases/2020/the-united-states-air-force-chooses-blackberry-spark-for-secure-productivity) a partnership in September 2020. Blackberry Spark, utilized for UEM and UES, will help the Air Force with their secure productivity needs, enabling virtual work environments whilst ensuring premium security. As we face more threats in the cyber space and continue pivoting towards a \"work-from-home environment\" regardless of the permanent trends form Covid, BB's wide-ranging partnerships, from Fortune 500 tech companies to the U.S. military prove it is an essential cog in the 21st century digital economy. Not to mention consistent ARR is exactly what investors (the suits) should be looking for, so what gives with the nasty financial press?\n\n# Blackberry's Financial Trajectory (Revs, Bottom Line, CF)\n\nWe have to take a look at Blackberry's financials, after all that is what this casino allegedly runs on. Luckily, if we ignore what the \"experts\" in Battery Park are shilling, we'll notice Blackberry is not the capsizing Titanic all the research analysts make it out to be. I'll take you into a deeper dive into the top &amp; bottom line with just the facts and my brilliant takes, and y'all can make your own decision on whether BB stock is seriously a pile of rat shit or an emerging growth stud.\n\n[As you might expect, Blackberry's overall top line consistently declined until roughly 2020+ \\(when every single one of these dope partnerships was announced\\). As BB wound down its legacy hardware, handset, and related service products, sales declined nearly $400M over the course of final two years, a marked decline from the near $20B struck in 2011. This trend seems to be on the reverse though: the new partnerships in 2020\\/21 have certainly underscored BB's transition into a software company, a trend even Wall St has had to acknowledge by lifting growth targets for fiscal year 2021. IMO, the $1.2B projected top line figure for '21 is conservative, and I think these figures could start to double, triple, and 🚀🚀🚀 in 2024+. Let me explain why with more charts:](https://preview.redd.it/3pq5gyspwd371.png?width=874&amp;format=png&amp;auto=webp&amp;s=e1a643492be05c1ec2f4830bd0b66b180276b6b3)\n\n[All those dope corporate and military partnerships I highlighted earlier? They mainly fit into BB's Enterprise software\\/services revenue stream, which is now 44&amp;#37; of overall revenue. This is the first component that I believe is going to drive revenue growth, profitability, cash flow, and tendies for us and BB in the years to come. We'll first notice that growth in this space really picked up in 2020 for BB, similarly to when their overall topline reversed trend- because this is the soul of 2021 Blackberry! And no, this doesn't even really include the innovative AV\\/EV partnerships, these are just institutional clients like Microsoft, ServiceNow, or Salesforce who want to buy one of Blackberry's SaaS established offerings. Think of the potential addressable market in the years to come: work from home, AI, 5G, IoT, we can keep going- all of these things need to be protected, without security, there is no system- every software, hardware, and appliance company under the sun is going to be lining up because they have no choice. You are adapt or go extinct. I expect BB to continue driving this aspect of its growth in a gargantuan way: think 25-50&amp;#37; growth YoY.](https://preview.redd.it/m106ixxswd371.png?width=846&amp;format=png&amp;auto=webp&amp;s=59e12724037bc3b9f099ab2859bea4b6608f00ee)\n\n[If Enterprise Software is to be Blackberry's Patrick Mahomes, Technology Solutions will be Blackberry's Tom Brady. Since 2017, this aspect has doubled as a portion of overall BB revenue, from roughly 10&amp;#37; in '17 to over 22&amp;#37; projected in '21, reflecting BB's successful ongoing foray into innovative technologies. In this segment we see BB's partnerships with Motion\\/Baidu reflected, cutting-edge technology projects that will enable unfathomable innovations in the future. We could say autonomous vehicles, or drones or anything that will be automated- they will all need to be securitized, whether with each other or on the cloud. BB's deep partnerships with global leaders like Baidu indicate John Chen has been playing 4D Chess since 2013: intensive capital expenditures to transform a company's creative intelligence don't just happen with the snap of your fingers. Put simply, you don't just go from making pagers to making AVs overnight- it's a lengthy process that will affect your growth\\/profitability, as evidenced by Blackberry's fall from grace. But if my instincts are right, Enterprise Software and Technology Solutions will drive BB's revenue growth\\/profitability, propelling it back to $100B market cap in the not-so-distant future.](https://preview.redd.it/1h96psxuwd371.png?width=878&amp;format=png&amp;auto=webp&amp;s=595d7f66d80d079394875a718984ee589b593bcc)\n\n[BB earns a decent amount of revenue from Licensing\\/IP, which is quite frankly a pleasant surprise to me. Essentially this component comprises BB's monetization of its global patent portfolio and licensing operations, which do things like license the Blackberry brand\\/device software to various vendors \\(a lot of handset\\). It is somewhat impressive that it's currently 31&amp;#37; of BB's top line, but then again not too surprising. Considering the Enterprise Software\\/Technology Solutions streams are at really nascent stages of growth, it makes sense that this more \\\\\"legacy\\\\\" revenue stream is so prominent. But then again, this component jumped over 20&amp;#37; in 2020 \\(what seems to be BB's turning point\\), so it's not like I'm going to argue with more revenue either. I'd say this the Matt Stafford component of BB: a reliable and solid contributor, but not something I would be betting the bank on either. But if it produces \\(which is certainly not out of the question\\), I won't complain either \\(unless I'm from Detroit\\).](https://preview.redd.it/fx1ebhmxwd371.png?width=858&amp;format=png&amp;auto=webp&amp;s=06730b56ca47298cd1347a8c090542c1e90eae96)\n\n[I think we've established hardware\\/handsets are a legacy business for Blackberry. Why do I talk about it? B\\/c Wall Street does, and WSB often falls prey to their fear-mongering. DON'T PAY ATTENTION. It's like Mitch Trubisky- yeah that ish was dope in 2015-2016, but we all know it's washed now and the only reason we keep talking about is because shillers want to use it to keep diverting from the real gold.](https://preview.redd.it/j0fszgu0xd371.png?width=896&amp;format=png&amp;auto=webp&amp;s=e4b2250478ab2cb6ad49956d4b2f4f89560fc56c)\n\n[I'm not going to hammer earnings to crazy... to actually say with strong conviction that you can accurately forecast that out YoY is bullshit, and anyone from Wall St telling you they can is likely doing the same thing. Never the less, we see a clear trend: great profitability growth when Blackberry pagers led the mobile handset market, awful declines from 2012-2018 as BB closed hardware operations and invested in software\\/cybersecurity ambitions, culminating in the mixed bag we've been seeing in 2018 and beyond. Wouldn't be surprised to see this earnings churn to continue until \\~2023-2025, after all, you have to invest\\/incur losses if you want long-term profitability. I'm going to stay watching the 3 primary components of BB's revenue growth for now.](https://preview.redd.it/voaefw43xd371.png?width=1204&amp;format=png&amp;auto=webp&amp;s=71f9cc1c63d585f57e3b88e20803c7f0f3ab4d79)\n\n[I care about Cash Flow far more than net income. Yeah, it's nice to look profitable, but how much money is actually coming in to your company? We see... a slow pick-up after 2020 \\(\\*pinch me\\*\\), when BB's resurrection appears to have started. Even in its legacy days, Blackberry was seeing hella cash leave the company, which just underscores software is a more profitable business than hardware. 2021 projections indicate Cash Flow could increase at the largest YoY rate in Blackberry's history \\(albeit from it's near-zero base\\). Nevertheless, if revenue growth booms like I think it will, FCF metrics are gunna look pretty green in 2022+.](https://preview.redd.it/ja112d95xd371.png?width=1234&amp;format=png&amp;auto=webp&amp;s=d56e1feaa214463cd5b3b518e9b1c6171368f65b)\n\n# My Strongest Convictions on BB\n\nWell apes, thanks for enduring my BB nut. Now time for you to swallow:\n\n* I don't believe BB is \"just a meme.\" To the tards that made fuckloads of money on BBBY, KOSS, SNDL, and even AMC (not GME, PM me if you want to debate what I would call GME) to an extent in these \"not-exactly-the-future\" businesses with high amounts of short interest- kudos to you, here's your 👑, King. But the tough truth is I'm skeptical that \"squeezing\" is always going to work. For starters, you think the hedgies are really that fucking stupid? I mean, come on, Chancellor/Emperor Ken Griffin had to extend Melvin $5B in credit, lather up Vlad, and testify in front of Congress. Don't exactly think continuous losses and Congressional subpoenas are exactly what the hedgies want either... I'm sure their risk management committee have been popping Addies daily since January to make sure they aren't overfuckingextended in one bet. \\*Cough\\* \\*Bill Hwang\\* Cough\\*\n* No, I truly believe Blackberry Ltd is the 2016 version of AMD in the 2021 cybersecurity market. Back then, AMD's legacy business was flailing, and the entire chip market was dominated by Intel. They went into the changing room, made themselves up, and reorganized. Capturing 1%, then 2%, then 3% of the market share seems so little nominally, but means so much for the top line, bottom line, and the share price when you go from 0 to 1. 1 to 10 may seem like a big jump, but it's launching from the ground (a baseline of 0) that is most lucrative- and that is *exactly where Blackberry (BB) sits right now*. Capturing 2% of the global cybersecurity market would send BB flying, and we'd be soaring back to $140. If BB is actually as innovative as I think, who knows?\n* Unfortunately, if you think this is a short squeeze, I'm sorry, get out. I actually kinda like seeing closes like today (plummeting down 15%), because we shake out the weak hands and I can buy more cheap shares. No one's forcing you to buy this stock, I just like it. Facts &amp; numbers don't lie either. Short interest is 9% on roughly 500M shares outstanding, so we would likely need Jay Powell, Cathie Wood, Elon, and Chamath to hop in if there was actually to be a \"squeeze\" overnight.\n* But to contradict myself somewhat, I also think June 2021 (right now) could be one of the most preferential entry points into BB ever. Data indicates 40% of the shares are owned by institutions (similar numbers to GME), indicating 60% is retail, many of them apes. The suits may scream \"overvalued reeeee,\" and they have a point, BB stock isn't exactly cheap. As it trades at roughly 8X forward sales, BB is valued as a fast growing company, but not beyond the likes of PLTR &amp; SNOW (yes different industries, but valuations that are multiple times higher) or competitors like Palo Alto Networks or Cisco. As a graduate student attempting to be not completely rarted with my limited capital, I love the risk-reward for BB, especially considering they report earnings on June 22. I suspect these numbers will come in far stronger than the St is saying, and at least they will start to lift future guidance in a significant way (both catalysts for a 50-100% move in BB IMHO). I guess we'll see how the financials reward BB's transition, but I am truly convinced this is the AMD of cybersecurity.\n* This last part is a mixed-bag (but suspicious if we dive deeper), and I'm sure a lot of apes will downvote me and possibly completely avoid BB with this knowledge, but I want to share facts since they are evidently so hard to find. We got the usual mutual funds (Vanguard, Fidelity, TD, etc) who own BB (roughly 25%) and two woke funds who invest in \"innovative trends\" own the other 15%. But data does indicate nasty little Ken (Citadel) reported buying 1.3M shares of BB in Q1. BB was heavily shorted pre-GME (like 30%+), and Citadel/gey bears almost definitely bought shares to cover. The question I'm wondering was did Citadel actually buy BB b/c they were so worried about a squeeze since it is a legitimate growth stock or b/c he shares my sentiments about its turnaround? Regardless, both seem like positive catalysts for the stock, and hopefully Ken answers my question.... oh wait...\n\n[Self-explanatory.](https://preview.redd.it/w33d8rdaxd371.png?width=1886&amp;format=png&amp;auto=webp&amp;s=ab406b459250bc6669c79e67c65c145f9b879709)\n\nObligatiory: BB to the moon.",
        "subreddit": "Wallstreetbetsnew",
        "title": "Why BB is gunna moon",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/nsoves/why_bb_is_gunna_moon/",
        "created": 1622901000.0
    },
    {
        "author": "audion00ba",
        "created_utc": 1622825083,
        "id": "ns9jpa",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "According to max pain theory, CSCO should move towards $52.5.  \n\nToday's price development was weird. First there was some whale pushing the price and I think now there are the market makers pushing it down. \n\nI am kind of curious whether it's going to happen. \n\nObviously, if you think max pain theory is real, you could speculate on it, but you can also do that with a million other stocks.",
        "subreddit": "options",
        "title": "Max pain theory in practice",
        "url": "https://www.reddit.com/r/options/comments/ns9jpa/max_pain_theory_in_practice/",
        "created": 1622853883.0
    },
    {
        "author": "Ronnieisred",
        "created_utc": 1622649735,
        "id": "nqp7ud",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I knew this company had legs but didn't expect a show of confidence from the firm responsible for Facebook, Amazon, Cisco, and most recently the Coinbase IPO.\n\nMotley fool had a great piece come out this morning [https://www.fool.ca/2021/06/02/well-health-hints-at-nasdaq-ipo/](https://www.fool.ca/2021/06/02/well-health-hints-at-nasdaq-ipo/) (They were also a top 3 pick for June yesterday) \n\nWhat I love here is that the story keeps getting better and better by the day and so do the technicals...\n\nLiterally today the company announced another acquisition \n\n[https://thedeepdive.ca/well-health-closes-on-51-acquisition-of-doctors-services-group/](https://thedeepdive.ca/well-health-closes-on-51-acquisition-of-doctors-services-group/) \n\nShort volume is also decreasing significantly... and I assume the available shares to short are decreasing a lot meaning the cost to borrow is increasing  (maybe someone could confirm that?)... \n\nShort Volume summary: \n\nhttps://preview.redd.it/9hfrbr46fv271.png?width=1562&amp;format=png&amp;auto=webp&amp;s=911c6961424e6b296b45cd8513b6032f528c9c97\n\nTechnicals are also looking very strong. We are seeing the same 3-4 month consolidation period that we saw before the prior ATHs -\n\nhttps://preview.redd.it/eg583pk1hv271.png?width=1410&amp;format=png&amp;auto=webp&amp;s=b0e209380ed5ac37f40ec455e473fe7e23e31491\n\n Apr - August 2020 before the stock went from $3-$8.6 // Nov 2020 - Feb 2021 before it went from $6-$10 // and now we are in another consolidation period... With the fundamentals getting better and better by the day and the chart holding it's ground I still think it's lining up for the next major move. \n\nSince the market has re stabilized in the last 2 weeks the chart has gotten even more interesting. Take a look at this massive bull flag forming on the 10day 30min. Pay attention to the RSI as well... Back above 50 now. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/5tfxrbjyiv271.png?width=806&amp;format=png&amp;auto=webp&amp;s=b3263effc3e8cbb5006ae442c806dd468eb92b6b\n\nNow without the lines to keep it clean. Look at that 200day SMA  support. It's now found support on the 20day SMA and is breaking through its 50 day... Very important it broke these levels. Bulls are winning. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/hwiaw5pdjv271.png?width=803&amp;format=png&amp;auto=webp&amp;s=6632aadf1457ef4dbf43ff1cbb0da0c641842f72\n\n&amp;#x200B;\n\nShort term price action is super bullish. Broke through all major moving averages and is now trying to break out of this range. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/oeve79kojv271.png?width=374&amp;format=png&amp;auto=webp&amp;s=e9c4919de996c76385389cb5366e1d8200ac3634\n\nIf the historic timeline is accurate (which it seems to be lining up with) then I'm super excited to hopefully watch this come out of its consolidation period over the next few months. \n\nIf you really zoom out (Weekly) you can see we found our support over the last 3 weeks. Take a look at the hammer we are forming this week. Literally one of the most basic bullish reversal signals. Not to mention the stochastic &amp; RSI are extremely oversold but showing some bullish divergence. \n\nhttps://preview.redd.it/dq6cfoc0lv271.png?width=799&amp;format=png&amp;auto=webp&amp;s=21e0741c1b31e4f2046cbe75bac7c401090198af\n\nThis is just getting started!",
        "subreddit": "wallstreetbets",
        "title": "$WELL $WLYYF WELL Health Engaged Fenwick &amp; West for US IPO!!!!!!!!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nqp7ud/well_wlyyf_well_health_engaged_fenwick_west_for/",
        "created": 1622678535.0
    },
    {
        "author": "Ronnieisred",
        "created_utc": 1622733389,
        "id": "nrfwwf",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I knew this company had legs but didn't expect a show of confidence from the firm responsible for Facebook, Amazon, Cisco, and most recently the Coinbase IPO.\n\nMotley fool had a great piece come out this morning [https://www.fool.ca/2021/06/02/well-health-hints-at-nasdaq-ipo/](https://www.fool.ca/2021/06/02/well-health-hints-at-nasdaq-ipo/) (They were also a top 3 pick for June yesterday)\n\nWhat I love here is that the story keeps getting better and better by the day and so do the technicals...\n\nLiterally today the company announced another acquisition\n\n[https://thedeepdive.ca/well-health-closes-on-51-acquisition-of-doctors-services-group/](https://thedeepdive.ca/well-health-closes-on-51-acquisition-of-doctors-services-group/)\n\nShort volume is also decreasing significantly... and I assume the available shares to short are decreasing a lot meaning the cost to borrow is increasing (maybe someone could confirm that?)...\n\nShort Volume summary:\n\n&amp;#x200B;\n\n*Processing img 7lgtdnq6h2371...*\n\nTechnicals are also looking very strong. We are seeing the same 3-4 month consolidation period that we saw before the prior ATHs -\n\n&amp;#x200B;\n\nhttps://preview.redd.it/0ymgech8h2371.png?width=1075&amp;format=png&amp;auto=webp&amp;s=74be47cecd6bcd3229234a5efbae6f4ab472ead2\n\nApr - August 2020 before the stock went from $3-$8.6 // Nov 2020 - Feb 2021 before it went from $6-$10 // and now we are in another consolidation period... With the fundamentals getting better and better by the day and the chart holding it's ground I still think it's lining up for the next major move.\n\nSince the market has re stabilized in the last 2 weeks the chart has gotten even more interesting. Take a look at this massive bull flag forming on the 10day 30min. Pay attention to the RSI as well... Back above 50 now.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/aijxqllah2371.png?width=1074&amp;format=png&amp;auto=webp&amp;s=119ff44dc8226fcdd1908097e50219eb2fb654da\n\nNow without the lines to keep it clean. Look at that 200day SMA support. It's now found support on the 20day SMA and is breaking through its 50 day... Very important it broke these levels. Bulls are winning.\n\n&amp;#x200B;\n\n*Processing img tmu8gsoch2371...*\n\nShort term price action is super bullish. Broke through all major moving averages and is now trying to break out of this range.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/vixlfn1fh2371.png?width=671&amp;format=png&amp;auto=webp&amp;s=32891bda47fefdf7e07598775cd7d728e5457639\n\nIf the historic timeline is accurate (which it seems to be lining up with) then I'm super excited to hopefully watch this come out of its consolidation period over the next few months.\n\nIf you really zoom out (Weekly) you can see we found our support over the last 3 weeks. Take a look at the hammer we are forming this week. Literally one of the most basic bullish reversal signals. Not to mention the stochastic &amp; RSI are extremely oversold but showing some bullish divergence.\n\n&amp;#x200B;\n\n*Processing img wjsog4hvh2371...*\n\nThis is just getting started!",
        "subreddit": "StockMarket",
        "title": "$WELL $WLYYF | WELL Health Engaged Fenwick &amp; West for US IPO!",
        "url": "https://www.reddit.com/r/StockMarket/comments/nrfwwf/well_wlyyf_well_health_engaged_fenwick_west_for/",
        "created": 1622762189.0
    },
    {
        "author": "Ronnieisred",
        "created_utc": 1622728668,
        "id": "nre54w",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I knew this company had legs but didn't expect a show of confidence from the firm responsible for Facebook, Amazon, Cisco, and most recently the Coinbase IPO.\n\nMotley fool had a great piece come out this morning [https://www.fool.ca/2021/06/02/well-health-hints-at-nasdaq-ipo/](https://www.fool.ca/2021/06/02/well-health-hints-at-nasdaq-ipo/) (They were also a top 3 pick for June yesterday)\n\nWhat I love here is that the story keeps getting better and better by the day and so do the technicals...\n\nLiterally today the company announced another acquisition\n\n[https://thedeepdive.ca/well-health-closes-on-51-acquisition-of-doctors-services-group/](https://thedeepdive.ca/well-health-closes-on-51-acquisition-of-doctors-services-group/)\n\nShort volume is also decreasing significantly... and I assume the available shares to short are decreasing a lot meaning the cost to borrow is increasing (maybe someone could confirm that?)...\n\nShort Volume summary:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hkuco9u232371.png?width=1362&amp;format=png&amp;auto=webp&amp;s=37fc3300984f71be50cfdb4e6b1714430f4e71f3\n\nTechnicals are also looking very strong. We are seeing the same 3-4 month consolidation period that we saw before the prior ATHs -\n\n&amp;#x200B;\n\nhttps://preview.redd.it/q912k26i32371.png?width=1342&amp;format=png&amp;auto=webp&amp;s=7e7f1cda44856259a7dd4d06a08d84b19ce39796\n\nApr - August 2020 before the stock went from $3-$8.6 // Nov 2020 - Feb 2021 before it went from $6-$10 // and now we are in another consolidation period... With the fundamentals getting better and better by the day and the chart holding it's ground I still think it's lining up for the next major move.\n\nSince the market has re stabilized in the last 2 weeks the chart has gotten even more interesting. Take a look at this massive bull flag forming on the 10day 30min. Pay attention to the RSI as well... Back above 50 now.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/shbufyhk32371.png?width=1346&amp;format=png&amp;auto=webp&amp;s=91ad73009f13ff978a2495d4f2af88ec2ab3b281\n\nNow without the lines to keep it clean. Look at that 200day SMA support. It's now found support on the 20day SMA and is breaking through its 50 day... Very important it broke these levels. Bulls are winning.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6k6x23im32371.png?width=1344&amp;format=png&amp;auto=webp&amp;s=4e56ebd40497e55ad19ba3e3032d0dda5a2ca5b8\n\nShort term price action is super bullish. Broke through all major moving averages and is now trying to break out of this range.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/p1p42l9o32371.png?width=738&amp;format=png&amp;auto=webp&amp;s=a8d982fc57ff4a3c2749be7fdbcbccc0a688e71b\n\nIf the historic timeline is accurate (which it seems to be lining up with) then I'm super excited to hopefully watch this come out of its consolidation period over the next few months.\n\nIf you really zoom out (Weekly) you can see we found our support over the last 3 weeks. Take a look at the hammer we are forming this week. Literally one of the most basic bullish reversal signals. Not to mention the stochastic &amp; RSI are extremely oversold but showing some bullish divergence.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/e0pi2dpq32371.png?width=1346&amp;format=png&amp;auto=webp&amp;s=a13c55f4bcdd28930e5a73594691dd99de1d1411\n\nThis is just getting started!",
        "subreddit": "wallstreetbets",
        "title": "WELL Health Engaged Fenwick &amp; West for US IPO!!!!!!!!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nre54w/well_health_engaged_fenwick_west_for_us_ipo/",
        "created": 1622757468.0
    },
    {
        "author": "NoAttitude2591",
        "created_utc": 1622576201,
        "id": "nq2itk",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Cisco exploring Nutanix Bid",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nq2itk/cisco_exploring_nutanix_bid/",
        "created": 1622605001.0
    },
    {
        "author": "NoAttitude2591",
        "created_utc": 1622577513,
        "id": "nq3187",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Cisco exploring all cash Nutanix bid",
        "subreddit": "wallstreetbets",
        "title": "Cisco exploring Nutanix bid",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nq3187/cisco_exploring_nutanix_bid/",
        "created": 1622606313.0
    }
]