[
    {
        "author": "BFLO-Retail",
        "created_utc": 1631842588,
        "id": "ppqny8",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "**TECHNICAL ANALYSIS 1)**\n\nBeachbody crossed a major milestone today as the short term and long term moving averages converged.  \n\n**PLAIN ENGLISH 2)**\n\nThis is a good thing.  Momentum is swinging upwards and stock is very likely to rise in the upcoming days.  \n\n&amp;#x200B;\n\n[$BODY crossed MACD indicated strong upward momentum](https://preview.redd.it/jvirouuppyn71.png?width=748&amp;format=png&amp;auto=webp&amp;s=353527021246509889fb9a874064649db941c48b)\n\n&amp;#x200B;\n\n**Sentiment 3)**\n\nBeachbody is benefiting from the home workout trend.  Delta cases are up.  Gym membership is down.  \n\n&amp;#x200B;\n\n[This woman would date you if only you had a Lambo](https://preview.redd.it/wd4pp52ntyn71.png?width=729&amp;format=png&amp;auto=webp&amp;s=fef9f2ce7e27f2d4b086f23d6edb674462612d1f)\n\n&amp;#x200B;\n\n**FUNDAMENTALS 4)**\n\nRevenue is up 33% year over year.  Cash on hand is sitting at a cool $347 million.  That's a lot of shakeology.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/u9pnv4tguyn71.png?width=791&amp;format=png&amp;auto=webp&amp;s=8aa69ffbb1318e664a12af9fa11b78eafb93cdbf\n\nhttps://preview.redd.it/l50u8aufuyn71.png?width=794&amp;format=png&amp;auto=webp&amp;s=9e9e8a0289a523acebbf2cd0cef74705fd417b20\n\n&amp;#x200B;\n\n**Disclaimer 5)**\n\nI am not a financial analyst.  This is not financial advice.  I am an overweight middle aged father of two who is slightly drunk.\n\n&amp;#x200B;\n\n**WILDLY OPTIMISTIC CONCLUSION 6)**\n\nWe are on the verge of EXPLOSIVE GAINS.  I want you to reach down and touch your toes, then reach up and grab the keys to your P.O.S. 2006 Toyota Corolla.  Throw those keys in the garbage.  It is LAMBO TIME!!!!\n\n&amp;#x200B;\n\nSigning Out,\n\nu/BFLO-Retail\n\nAKA The SledgeFeather",
        "subreddit": "wallstreetbets",
        "title": "$BODY crosses MACD (Moving Average Convergence Divergence)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ppqny8/body_crosses_macd_moving_average_convergence/",
        "created": 1631871388.0
    },
    {
        "author": "jayjayy123",
        "created_utc": 1631063460,
        "id": "pk0d5n",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": " \n\nTL,DR; Roman DBDR SPAC and CompoSecure inked a deal in April 2021 that seems to be overlooked: low valuation of approx. $900 million and currently profitable with over $100 million in EBITDA, historical growth, future forecasted growth has a potential to be exponential if their innovations into the crypto security space go according to plan.\n\n**First off, the SPAC team**:\n\n&amp;#x200B;\n\n1. Dr. Don Basile, PhD: Chairman &amp; Co-CEO of Roman DBDR SPAC  \n \\-he has over 20 years of experience in the tech industry, and has led many silicon valley tech companies through multiple funding rounds, meaning he has a lot of knowledge when it comes to valuing tech companies.\n2. Dixon Doll, Jr.: Co-CEO of Roman DBDR SPAC  \n \\-was CEO and COO in computer data memory and software management companies Violin Memory and DBM Cloud Systems, meaning he could be a valuable asset to CompoSecure.\n3. John Small: CFO of Roman DBDR SPAC  \n \\-used to be the CFO of Viggle, and has over 20 years in investment banking experience, including at Morgan Stanley.\n\n**The CompoSecure team:**\n\n&amp;#x200B;\n\n1. Jon Wilk: CEO of CompoSecure  \n \\-was Head of Product and Chief Marketing Officer at JPMorgan Chase Consumer Bank, as well as the President of Paychoice a leading SaaS-based payroll company which was sold to Sage in 2014. \n2. Timothy Fitzsimmons: CFO of CompoSecure  \n \\-CEO of his own consulting firm called Your CFO &amp; Controller, he has been working in finance for over 30 years.\n3. Adam Lowe: Chief Innovation Officer of CompoSecure  \n \\-with a PhD and MBA from Cornell, Adam Lowe now has over 10 years in experience in the security and tech industry. He is a former group leader of the Innovation Development Team at SRC Inc. He will be leading the Arculus product launch which I will discuss further on.\n\n**What is CompoSecure &amp; What do they do?**\n\nCompoSecure is a payment technology company that is trusted by multiple blue chip customers for whom they have produced almost 100 million metal payment cards. Credit cards, debit cards, prepaid cards, IDs, customer loyalty cards, you name it they make it. They have 30 patents issued and 44 pending. Thus far, clients relationships have an average tenure of 12 years, meaning this company isn’t just a start up. Their customers include JPMorgan Chase, American Express, Capital One, RBC, HSBC, UBS, Amazon, Verizon, and the list goes on. The company has grown tremendously, as they now have over 675 employees and are expecting to produce 22 million metal cards this year.\n\n**A Major Catalyst on September 9th**\n\nCompoSecure is launching their Arculus card on Thursday, September 9th, marking the launch of the first metal NFC-enabled cold storage device. Arculus will allow clients to store private keys and sign transactions with an offline device, all while protecting their wallets from network-based vulnerabilities, alleviating burdens of existing solutions. Essentially, this is a hot &amp; cold crypto storage device that is tangible to its users. It uses advanced three-factor authentication security across biometric, PIN and Key card and truly air-gapped. Arculus card will be a no charging required, crypto key storage solution with encrypted NFC (“tap-to-transact”). Additionally, it allows clients to easily send, receive, and trade crypto assets through the mobile app. Price is approx. $100 for a card.\n\nWatch the Creator Story here https://www.youtube.com/watch?v=3yKjEFjvNNw\n\n**What do they plan on doing in the future?**\n\nIn 2022, CompoSecure plans on adding a payment feature to their Arculus card, allowing users to tap the card to their phone to verify identity and open the Arculus Wallet app or enable transactions. By 2023, CompoSecure expects Arculus to enable eGames to accept growing list of currencies and protect accounts from hacking and loss in the quickly expanding gaming market. Another big add-on to Arculus they are expecting to launch in 2023 is a Warranty &amp; Insurance option for clients, which enables regulatory protection from loss of crypto and other digital assets &amp; facilitates processes such as IP address check, screening, &amp; Know Your Transaction (KYT) for the crypto space.\n\n**Company Financials**\n\n1) Historical Results\n\n2018A: $155 mm in sales $69 mm in EBITDA\n\n2019A: $243 mm in sales $107 mm in EBITDA\n\n2020A: $261 mm in sales $116 mm in EBITDA\n\nHistorical revenue CAGR of 29%\n\n2) Projected Results\n\n2021E: $276 mm in sales (+ $10 mm Arculus sales) $102 mm in EBITDA\n\n2022E: $316 mm in sales (+ $40 mm Arculus sales)  $105 mm in EBITDA\n\n2023E: $363 mm in sales (+ $127 mm Arculus sales) $160 mm in EBITDA\n\n2024E: $418 mm in sales (+ $429 mm Arculus sales) $274 mm in EBITDA\n\n2025E: $480 mm in sales (+ $1.09 b Arculus sales)  $586 mm in EBITDA\n\n**Okay this is fun and all but what is the deal valuing the company at? 5 billion dollars?**\n\nThe deal values the company only at $903 mm. Total common equity value of $826 mm. When adding the $380 mm in debt to the company value you get a Total Enterprise Value of $1.2 billion. The deal leave the company with $361 mm in cash on their balance sheet to funds their Arculus program, $175 mm of which is PIPE led by BlackRock &amp; Highbridge Capital Management. Further breaking down the PIPE, however, it must be noted that $130 mm of it is convertible notes, and the other $45 mm is common shares.\n\n**Risks**\n\n1) Metal Card Sales risk: with new payment features coming out all the time, it is possible that in a decade from now people no longer use cards, that all payment mechanisms are directly tied to phone, albeit not very likely given that cards are still the generally accepted means of transacting.\n\n2) Arculus Product Failure risk: CompoSecure is investing lots of money and time into this Product, and it is their main way of growing the business. That being said, if the market does not respond well to Arculus product, the company could fail to meet its projected financial results down the road.\n\n3) Dilution risk: the PIPE part of the deal is mostly convertible debt, meaning shareholder dilution is very likely upon PIPE unlock and share price appreciation.\n\nIf I am missing any risks, please let me know. Pleasure to discuss.\n\n**Conclusion**\n\nCompoSecure is what I call The Perfect Growth &amp; Value Play. If you only look at the business from a perspective of their current operations and forget all of the Arculus products aiming at the crypto space, the deal already then seems to be quite fair. The market cap is just under a billion, yet they are making over $100 million in EBITDA and is still expected to grow without Arculus. Now, when adding the Arculus card and its additional features to this, you are now in a value play, but exposed to pential multi bagger type of growth. Nobody knows if it will turn out actually making $1.09 billion in revenue for them by 2025, but at least there is value in the business regardless. Cheers!\n\nDisclosure: 500 shares only, I like to spread my money very thinly in high conviction plays.\n\nTHIS IS NOT FINANCIAL ADVICE, DO YOUR OWN DUE DILIGENCE PLEASE THANK YOU",
        "subreddit": "SPACs",
        "title": "$DBDR / CompoSecure DD — A Value &amp; Growth Story",
        "url": "https://www.reddit.com/r/SPACs/comments/pk0d5n/dbdr_composecure_dd_a_value_growth_story/",
        "created": 1631092260.0
    },
    {
        "author": "beardumm",
        "created_utc": 1632109248,
        "id": "prmx55",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Hello all, so I was on Reddit one day and found a post about a free geocache style/pokemon go style game which gives you free crypt0 currency no strings attached.\n\nSo I started playing it and I'm hooked. I've played a couple months and have received approximately $500-$600 US dollars (depending on the fluxuaction of the crypt0 market) and after I while I noticed I didn't even care about the crypt0 and started playing for the fun if it and gained so much knowledge along the way as you answer trivia questions and when you get it right you get free crypt0currency.\n\nSo basically you you walk around with your character on a mapped out version of the city (your city or where ever you might go) and there are keys you collect which open vaults which are everywhere..when you use a key to open the corresponding (colour) vault it opens a trivia question you answer and if answered correctly you win and get free crypt0 and resources for the game (irrelevant to the crypt0). Anyways I'm hooked and referrals do give out extra keys for me and yourself. The game just came out of beta (2 weeks ago or so) and is live for Andriod devices and there is a wait list for iOS devices as it needs to be approved by iTunes.( Which will happen very shortly).\nMy referral link is below which will bring you to the Google store where you can download game. Once you have played a little and build your Head quarters ot will give me a green key for referring you and yourself a green key for being a referee (1 green key is 10 blue keys). \nAnyways the game is amazing and I've walked and biked around more than I have in a long time. (Can also drive around) I'm hooked and I'm sure you will be too after a couple days of playing.\n\nReferral link:\n\nFree crypt0 pokemon go style game. Get Fit, Earn crypt0 gain knowledge Join me on Coin Hunt, it's awesome! https://coinhunt.gsc.im/DhDe9tEOrN\n\nThank you for your time and reading that short story. But trust me it will be worth it!",
        "subreddit": "wallstreetbets",
        "title": "Free crypt0 currency game!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/prmx55/free_crypt0_currency_game/",
        "created": 1632138048.0
    },
    {
        "author": "beardumm",
        "created_utc": 1632108054,
        "id": "prmm14",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Hello all, so I was on Reddit one day and found a post about a free geocache style/pokemon go style game which gives you free crypto currency no strings attached.\n\nSo I started playing it and I'm hooked. I've played a couple months and have received approximately $500-$600 US dollars (depending on the fluxuaction of the crypto market) and after I while I noticed I didn't even care about the crypto and started playing for the fun if it and gained so much knowledge along the way as you answer trivia questions and when you get it right you get free cryptocurrency.\n\nSo basically you you walk around with your character on a mapped out version of the city (your city or where ever you might go) and there are keys you collect which open vaults which are everywhere..when you use a key to open the corresponding (colour) vault it opens a trivia question you answer and if answered correctly you win and get free crypto and resources for the game (irrelevant to the crypto). Anyways I'm hooked and referrals do give out extra keys for me and yourself. The game just came out of beta (2 weeks ago or so) and is live for Andriod devices and there is a wait list for iOS devices as it needs to be approved by iTunes.( Which will happen very shortly).\nMy referral link is below which will bring you to the Google store where you can download game. Once you have played a little and build your Head quarters ot will give me a green key for referring you and yourself a green key for being a referee (1 green key is 10 blue keys). \nAnyways the game is amazing and I've walked and biked around more than I have in a long time. (Can also drive around) I'm hooked and I'm sure you will be too after a couple days of playing.\n\nReferral link:\n\nFree crypto pokemon go style game. Get Fit, Earn crypto gain knowledge Join me on Coin Hunt, it's awesome! https://coinhunt.gsc.im/DhDe9tEOrN\n\nThank you for your time and reading that short story. But trust me it will be worth it!",
        "subreddit": "StockMarket",
        "title": "Free crypto currency game!",
        "url": "https://www.reddit.com/r/StockMarket/comments/prmm14/free_crypto_currency_game/",
        "created": 1632136854.0
    },
    {
        "author": "silver_sean",
        "created_utc": 1630716814,
        "id": "phho8t",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Check out the newest play-to-earn game on the market - [Coin Hunt World](https://coinhunt.gsc.im/LsAMW1Ncdk)\n\nCoin Hunt World is a Pokemon GO like game where you earn crypto for finding keys and opening vaults. It also incorporates trivia questions which keeps it exciting. The game is very addicting - and you earn crypto (Bitcoin and ETH) in the process. Easily convert your crypto to USD if you prefer - Very easy process.\n\nHonestly - This game is worth your time. I make roughly $5 a day for 30 minutes of my time. If you spend more time, you'll make even more. You get payed out every Tuesday, so no concerns over whether you'll get your earnings or not.\n\nSign up today and start earning - [https://coinhunt.gsc.im/LsAMW1Ncdk](https://coinhunt.gsc.im/LsAMW1Ncdk)\n\nThe game is very new - Soon all items in-game will be NFT's and you'll be able to make even more revenue. This is your chance to get in early and get some of the rarer items that could be worth quite a bit later on - A new \"special\" event starts on September 6th.\n\nFeel free to ask me any questions on Reddit - I'm happy to help answer any questions you may have.",
        "subreddit": "investing",
        "title": "Want to earn some extra income on the side? Check out this new game and start earning some extra funds on the side!",
        "url": "https://www.reddit.com/r/investing/comments/phho8t/want_to_earn_some_extra_income_on_the_side_check/",
        "created": 1630745614.0
    },
    {
        "author": "No-Poet1958",
        "created_utc": 1631206697,
        "id": "pl1s37",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Hey guys I started trading options in June and am here to share the secret I’ve discovered to remaining profitable over the long term. First a little about me. My first play was buying puts on AMC at its peak and selling them after it was announced that AMC would be issuing more shares to raise money. Unfortunately I was only able to double my money because IV was so high. Next I bought CRSR calls and 10x my money to 60k. After losing a lot back I pulled off another 10 bagger on CRSR and now I’m riding a banned ticker to the moon. But there’s 2 keys to being successful. Firstly, don’t lose money. Use stop losses. Never hold an option beyond a 30% loss. Secondly, buy stocks that will go up, not down. Just look at the graph and predict the direction and read post’s to see if it’s gaining retail hype. Thanks for reading",
        "subreddit": "wallstreetbets",
        "title": "How to be profitable over the long term",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pl1s37/how_to_be_profitable_over_the_long_term/",
        "created": 1631235497.0
    },
    {
        "author": "SAMICHSCHAUB",
        "created_utc": 1631102756,
        "id": "pk95sn",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " [The Lithium Wars! U.S. vs. China​ | Investing Trends](https://investingtrends.com/AWLIF/the-lithium-wars-us-vs-china/?utm_campaign=AWLIF_SPG&amp;utm_source=19004&amp;utm_medium=native&amp;utm_content=supercycle) \n\n **One little-known American lithium exploration company may be one of the keys to the U.S. winning the lithium wars. Get to know Ameriwest Lithium (**[**AWLIF**](https://investingtrends.com/AWLIF/awlif-stock/)**) now — before it becomes a new Goliath in today’s high-stakes energy race.\\***",
        "subreddit": "wallstreetbets",
        "title": "AWLIF",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pk95sn/awlif/",
        "created": 1631131556.0
    },
    {
        "author": "International-Ad1423",
        "created_utc": 1631624292,
        "id": "po29bn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "(TSXV: SCAN) (OTCQB: LDDFF) (FRANKFURT: LD2)\n\nI have noticed Liberty Defense gaining a lot of attention recently from their flagship product, HEXWAVE, so I looked into it a bit to see if this stock is worth the hype. After looking into them, it does seem very likely that their HEXWAVE threat detection device will be a massive hit in in airports, stadiums, schools and any public venues across America.\n\n**About HEXWAVE:**\n\n* Contactless screening and threat detection system for all weapon types – metallic or non-metallic\n* Data rich and able to transmit 400,000 data points to create a 3D image that AI is able to interpret and provide clearance or no clearance\n* Throughput time is over 1000 an hour, which is unrivalled by any competitor\n* 7 years of product development and over $20M has been invested for research and testing\n\nThe product is currently in the Beta testing phase and the company has signed for beta testing agreements with Allianz Arena (2nd largest stadium in Germany), University of Wisconsin Police Department, Metro Toronto Convention Centre, and 7 other large partners. The long term goal for this product is for it to replace conventional security gates that are used at venues, schools, stadiums, places of work, government facilities and any other at-risk locations.\n\n**The Market:**\n\nThe market for security systems is an estimated $5 billion and is expected to grow at 7.2% annually. The contactless design of the HEXWAVE eliminates privacy concerns as no divestment of keys, wallets, or cell phones is required. The most recent news from Liberty Defense is a technical and marketing collaboration agreement on August 10th with Micro-X, to explore a combined technology offering with Liberty's HEXWAVE walk-through screening portal for enhanced people and passenger screening in aviation or commercial security settings. Liberty also has plans to advance airport passenger screening by solving the shoe removal problem. Liberty has exclusive licenses for two innovative solutions developed by PNNL and funded by Department of Homeland Security; high definition millimeter-wave body scanner for upgrades or new deployments and footwear screener based on proven millimeter-wave technology.\n\nI’m really looking forward to the HEXWAVE product launch, set to take place in mid-2022. This product has the potential to change venue security forever and when it takes off so will SCAN!\n\nThis is not investment advice! If you are interested please look into them.",
        "subreddit": "investing_discussion",
        "title": "What do you guys think of Liberty Defense? (TSXV: SCAN)",
        "url": "https://www.reddit.com/r/investing_discussion/comments/po29bn/what_do_you_guys_think_of_liberty_defense_tsxv/",
        "created": 1631653092.0
    }
]