[
    {
        "author": "third_legatron",
        "created_utc": 1619498660,
        "id": "mzgodf",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "I am actually quite bullish on tech right now and it's the highest percentage of my portfolio that it's ever been, more than 7%! I have positions in lam research, amd, Snap, and I want back into intel (sold before earnings because it was getting a bit crazy and easy to see the drop coming.)\n\nAMD I scooped up on a dip and have been happy, I bought some more today and averaged up a tiny bit. I am actually not the biggest fan of their pc parts, but it's because I'm old school and just prefer intel CPUs and nvidia gpus. But many enthusiasts are actually using AMD these days, and their numbers have been well. They have a PEG of ~1.5 which doesn't exactly make it great value right now, but I think the stock is undervalued compared to peers. I will hold this and average down if when I get the opportunity.\n\nLam research has a PEG of 1.2 and I expected it to be higher honestly. I bought the stock with the intent to hold for long and average down over time but I haven't even had that opportunity yet. Wish I bought a bit more to trim, but I think I will stick to my guns and hold it long. \n\nSnaps just a long hold, definitely way overvalued, but I expect to average down at some point. I'm honestly in snapchat because my portfolio has been very boring lately, and I've owned the stock before at much lower prices. Their earnings report wasn't terrible, wasn't great, but I think as the years go on the company will be able to do well. I'm not really too attached to this play, it's a small percentage and it's a bit speculative and not really my style, but for now I'm a happy holder especially since they did breakeven on this earnings.\n\nIntel is a powerhouse and many call it a value trap, I think the markets just waiting for them to stop making mistakes and I think Pat will be able to SLOWLY turn them around. Long hold and I will buy some soon, haven't gotten back in it yet.\n\nI'm also extremely bullish on oil and energy. Brent has been doing very well and holding for now, and I think that the debt the oil companies has accumulated was actually beneficial because it's so cheap. Exxon and chevron I love, as well as the pipelines. (I sold all my enbridge early, and may sell some puts to try and get back in at a small discount)\n\nCarbon capture is a tried and true method of reducing emissions, albeit not the best way of going green, but it will be profitable IF Biden can put a price on co2. BP, shell, and exxon all already do this as well as many other companies. Don't know too much about it but I did some light reading for a couple hours and it's old stuff been around since the 70s, but it does work and is a realistic next step in reducing emissions. Definitely not a permanent solution but I see it as a necessary stepping stone and there may be money to be made.\n\nOil is also not going anywhere for at least a decade, probably longer, so I believe these companies are all extremely undervalued even after their run ups. Going forward 2 years I think even when oil prices normalize,  I think the giants will be in a better position overall. \n\nI like GE for their wind turbines as well, although it's much smaller scale and doesn't really bring much to stock price. I believe Siemens does this as well, but I do not own siemens. With Biden in office and oil prices getting high, it's the perfect storm for greener energies.\n\nI went into this earnings season a bit bearish and I still expect it to be rocky, so properly hedging should be on everybodies list as well. But I believe the bull market will be fine over the next year, albeit not completely smooth. Healthcare is a solid industry to invest in during times like these as the big names are quite undervalued. I'm not bullish on healthcare, but it's a savings account and it's not volatile when everything else is, so its a defensive play when IV is very low.",
        "subreddit": "stocks",
        "title": "What are y'all bullish on these days?",
        "url": "https://www.reddit.com/r/stocks/comments/mzgodf/what_are_yall_bullish_on_these_days/",
        "created": 1619527460.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619124579,
        "id": "mwegir",
        "num_comments": 158,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, April 22, 2021**\n\nStocks fell on Thursday, erasing yesterday’s gains as market volatility continues. Stocks fell after Bloomberg reported that President Biden would propose increasing the capital gains tax rate on wealthy individuals. The S&amp;P 500 (SPY) closed 0.91% down, the Dow Jones (DIA) closed 0.94% and the tech-heavy Nasdaq (QQQ) fell 1.21%.\n\nAccording to a report by [Bloomberg](https://www.bloomberg.com/news/articles/2021-04-22/biden-to-propose-capital-gains-tax-as-high-as-43-4-for-wealthy), President Biden will propose almost doubling the capital gains tax rate for wealthy individuals earning $1 million or more per year to 39.6% to help pay for a slew of social programs and the proposed infrastructure bill. The new marginal 39.6% rate would be an increase from the current base rate of 20%, the people said on the condition of anonymity because the plan is not yet public. The proposal could reverse a long-standing provision of the tax code that taxes returns on investment lower than on labor/salary. \n\nCorporate earnings have so far exceeded Wall Street’s even lofty expectations, as companies benefited from both a surge in consumer spending as the economy opens back up and cost-cutting measures implemented during the height of the pandemic.  However, despite the largely positive earnings, many stocks have failed to react positively to the news. It seems as more positive economic data is released in terms of consumer spending and unemployment, it takes more and more impressive results to convince investors to pile into the stock. This suggests there is froth in the markets given the sky-high valuation of some companies, in our opinion.\n\nJim Caron, investment management fixed income portfolio manager at Morgan Stanley (MS) said, “What we have is the absence of a catalyst. Everything that we’ve done over the last twelve months has been to build up to this point, to get this recovery, to get a very, very strong second-quarter GDP, which we think could be upwards of 10%. But after that, things start to slow down. It doesn’t mean that the data gets bad, it just means on a relative basis that the third quarter will be weaker than the second quarter and the fourth quarter may be weaker than the third quarter.”\n\n**Highlights**\n\n* Two U.S. senators have expressed concern about what they said may be an emerging pattern of safety concerns involving Tesla Inc. vehicles in the wake of a fatal crash in Texas.\n* Square (SQ) announced that it plans to make new inventory-management features available to its sellers.The company is rolling out tools that help sellers automate their inventory-management processes by using barcode scanners to take stock of inventory and receiving alerts driven by machine learning to see when an item is due to run out.\n* The White House announced more than 200 million doses of the coronavirus vaccine have been distributed in the US, greatly surpassing original estimates of 100 million doses delivered in the first 100 days of Biden’s presidency. On the back of this robust distribution, all states are beginning to open back up.\n* Mortgage applications jumped 8.6% in the week ended April 16, marking the biggest jump since late January as mortgage rates pulled back following a surge, according to the Mortgage Bankers Association (MBA). \n* Ford Motor (F) is planning more downtime at five North American factories due to a global semiconductor shortage. \n* **\\*\\*Please note that current stock price was written in the morning and does not reflect current stock price\\*\\***\n* Twitter (TWTR) target raised by Argus from $72 to $82 at Buy. Stock currently around $65\n* Las Vegas Sands (LVS) target raised by Credit Suisse from $58 to $69 at Outperform. Stock currently around $58\n* Lam Research (LRCX) with a host of target raises. Consensus price target around $775 at Overweight. Stock currently around $615\n* Equifax (EFX) target raised by Needham &amp; Co from $215 to $260 at Buy. Stock currently around $221\n* Discover Financial Services (DFS) target raised by Morgan Stanley (MS) from $108 to $114 at Equal-Weight. Stock currently around $99\n* NXP Semiconductors (NXPI) target raised by Oppernheimer from $210 to $235 at Outpeform. Stock currently around $196\n* Facebook (FB) target raised by Jefferies Financial Group from $350 to $360 at Buy. Stock currently around $296\n* Chipotle (CMG) with a host of target raises after a strong earnings report. Consensus price target around $1700 at Outperform. Stock currently around $1479\n\n“All our dreams can come true, if we have the courage to pursue them.” - Walt Disney",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, April 22, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mwegir/here_is_a_market_recap_for_today_thursday_april/",
        "created": 1619153379.0
    },
    {
        "author": "Ironleg01",
        "created_utc": 1617615806,
        "id": "mkgvvq",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "This is great article from Seeking Alpha but since it's against the rules to link SA articles here I'll just copy/paste.\n\n**Vertical Software.** Analyst Jason Celino thinks the plan would \"accelerate digitization opportunities across the architecture and construction industry.\"\n\n1. **Bentley Systems** (NASDAQ:BSY) gets 60% of total revenue from infrastructure, so the plan could lead to \"meaningful multiyear tailwinds.\"\n2. **Autodesk** (NASDAQ:ADSK) exposure to infrastructure of 15-20% of revenue and the \"completion of its Innoyze acquisition, providing solutions for water infrastructure assets, gives us incremental confidence.\"\n3. **Trimble** (NASDAQ:TRMB) has 25-30% of revenue from infrastructure \"geospatial, construction, and civil engineering offerings are well positioned.\"\n\n**Communication Services.** Analyst Brandon Nispel says the bill \"is positive for infrastructure providers (tower operators) and neutral to negative for network providers (wireless carriers and cable operators).\"\n\n1. **American Tower** (NYSE:AMT), **Crown Castle** (NYSE:CCI), **SBA Communications** (NASDAQ:SBAC) are picks in towers, which will be helped by improving investment in wireless networks.\n2. **Altice USA** (NYSE:ATUS), **Cable One** (NYSE:CABO), **Charter Communications** (NASDAQ:CHTR), **Comcast** (NASDAQ:CMCSA), **WildOpenWest** (NYSE:WOW) may see a hit to discretionary cash flow due to a higher corporate tax rate.\n3. **AT&amp;T*\" (NYSE:T), **T-Mobile U.S.** (NASDAQ:TMUS) and **Verizon** (NYSE:VZ) are the most at risk of a corporate tax rate hike, with T and VZ seeing incremental taxes of $1.5B to $2B.\n\n**Entertainment and Video Games.** Analyst Tyler Parker says the plan for bringing high-speed broadband to every American will help domestic online vide games\n\n1. **Activision** (NASDAQ:ATVI), **Electronic Arts** (NASDAQ:EA), **Take-Two Interactive** (NASDAQ:TTWO) and **Ubisoft** (UBISFY) could see tailwinds.\n\n**Semiconductors.** Analysts John Vinh and Wes Twigg say \"expansion incentives would likely be a tailwind for semiconductor equipment demand while easing the capex burden on manufacturers.\"\n\n1. **Applied Materials** (NASDAQ:AMAT), **ASML** (NASDAQ:ASML), **Advanced Energy Industries** (NASDAQ:AEIS), KLA (NASDAQ:KLAC), **Lam Research** (NASDAQ:LRCX) and **Teradyne** (NASDAQ:TER) would benefit in equipment names.\n2. **Analog Devices** (NASDAQ:ADI), **Intel** (NASDAQ:INTC), **Micron** (NASDAQ:MU), **ON Semiconductor** (NASDAQ:ON) and **Texas Instruments** (NASDAQ:TXN) are picks among those with domestic manufacturing footprints.\n\n**Utilities.** Analyst Sophie Karp notes the majority of the impact on the sector would not come from direct spending, but from fiscal incentives.\n\n1. **American Electric Power** (NASDAQ:AEP), **Southern** (NYSE:SO), **Duke Energy** (NYSE:DUK), **Dominion Energy** (NYSE:D), **Entergy** (NYSE:ETR) and **Edison International** (NYSE:EIX) can benefit from incremental grid investment initiatives and electrifications trends from an EV tide that will \"lift all boats.\"\n2. **Eversource Energy** (NYSE:ES), **Avangrid** (NYSE:AGR), **Public Service Enterprise Group** (NYSE:PEG), **NextEra Energy** (NYSE:NEE), **Xcel Energy** (NASDAQ:XEL), **AEP**, **Sunrun** (NASDAQ:RUN), **Sunova Energy** (NYSE:NOVA) will be helped by the extension of the investment tax credit and the production tax credit further boosting commercial solar and wind.\n3. **Public Service Enterprise Group*\" (PEG), **Excelon** (NASDAQ:EXC) and **Energy Harbor** (OTCPK:ENGH) would benefit from any concrete federal program to support nuclear energy.\n4. **First Solar** (NASDAQ:FSLR) may get a boost if solar installers can bypass Chinese tariffs.\n\n**Oil and Gas Exploration and Production.** Analyst Leo Mariani says the plan \"is likely to have a bit of a long-term negative for traditional U.S. oil E&amp;Ps if it accelerates the transition away from fossil fuels for transportation purposes, but we generally think that other variables that normally impact the price of oil over the next few years are much more likely to affect energy stocks as opposed to the impacts of this bill, which will take a healthy part of this decade and into the next to make a material impact.\"\n\n**Life Science Tools.** Analyst Paul Knight says \"a specific call-out of 'biotechnology' as a key technology investment is positive.\"",
        "subreddit": "stocks",
        "title": "Best stocks for Biden's infrastructure plan",
        "url": "https://www.reddit.com/r/stocks/comments/mkgvvq/best_stocks_for_bidens_infrastructure_plan/",
        "created": 1617644606.0
    },
    {
        "author": "fossilbebe",
        "created_utc": 1617583008,
        "id": "mk8qcl",
        "num_comments": 73,
        "num_crossposts": 0,
        "selftext": "I’m a first time ish investor and it seems like stocks related to semiconductors have skyrocketed in the past year.  It seems like these are the way to go but the huge growth ha me spooked that this might come back down. Thoughts? Stocks: ASML, AMAT, LRCX, TOELY, and the ETFs SOXL and SOXX",
        "subreddit": "stocks",
        "title": "Semiconductor related stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/mk8qcl/semiconductor_related_stocks/",
        "created": 1617611808.0
    },
    {
        "author": "lohith15",
        "created_utc": 1617306689,
        "id": "mi3gog",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "After a long time . 10X and 8X on the same day . Thank you AMD and LRCX",
        "url": "https://i.redd.it/ax1vy29m9mq61.jpg",
        "created": 1617335489.0
    },
    {
        "author": "AronwithoneA",
        "created_utc": 1618848950,
        "id": "mu454g",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "I recently bought shares in tsmc, asml, applied materials and lam research. In march they had significant growth due to the semiconductor shortage and therefore high demand of their bussiness.\n\n I was a little late to the party but was thinking then that given the high demand, there was no reason not for people to still bullish on them but I am wondering if I am too late cause it seems to me that most of it seems to be priced in already and there isnt more room for growth until manufacturing capacity increases. Looking at tsmc, although they have said they will invest billions to increase production capacity, that wont be for years and their quarterly report they predicted stagnant growth for the year.\n\nSeems to me like most is priced in. Thoughts/advice?",
        "subreddit": "investing",
        "title": "Future outlook for semiconductor manufacturing related stocks",
        "url": "https://www.reddit.com/r/investing/comments/mu454g/future_outlook_for_semiconductor_manufacturing/",
        "created": 1618877750.0
    },
    {
        "author": "ScarletHark",
        "created_utc": 1617325574,
        "id": "mi9kxb",
        "num_comments": 42,
        "num_crossposts": 0,
        "selftext": "I wanted to repost a reply I had made in another posting here, because I think it has general applicability for anyone thinking about how to play the current semiconductor shortage.\n\nIMO the way to play the corporate and government money flowing into addressing the shortage and \"reshoring\" of semiconductor manufacturing capacity is to follow the steps involved in resolving these issues.\n\nTSMC, Samsung and Intel have near-term headwinds in terms of earnings based on semiconductor demand simply because it takes so long to expand capacity. The front-end winners in current semi production efforts are going to be those who supply the tools, products and services that go into these fabs that are planned for construction: AMAT, ASML, TER, LRCX, to name a few (disclosure: I've been in and out of bullish positions on AMAT the past couple of months). Secondary effects on earnings from this expansion will come 1-2-3 years down the line for the semi manufacturers themselves, depending on whether or not they are expanding/upgrading an existing facility, or building one from the ground up.\n\nThe end-users of these semiconductor products (GM, F, NVDA, AMD, etc.) will be the last ones to benefit from expanded chipmaking capacity, as easing the demand crunch allows them to resume normal sales levels. Note that for auto mfrs, this has a ripple effect on rental car companies, who sold all of their fleets in fire sales last year and now can't replace them because the auto mfrs can't make cars.\n\nAdditionally, TSMC is booked up for the foreseeable future; these bookings have prices agreed well in advance, and are almost certainly not subject to TSMC's recent statements that they plan to increase prices; that will happen with new bookings down the line.",
        "subreddit": "options",
        "title": "Playing the semiconductor shortage",
        "url": "https://www.reddit.com/r/options/comments/mi9kxb/playing_the_semiconductor_shortage/",
        "created": 1617354374.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619037870,
        "id": "mvozqy",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, April 21, 2021**\n\nStocks reversed on Monday, rising on Wednesday for the first day in three sessions, with small-caps leading the way after a terrible run of performance in April. Despite Netflix (NFLX) sharply missing earnings expectations in terms of new paid subscribers, the tech-heavy Nasdaq (QQQ), while the Dow Jones (DIA) and S&amp;P 500 (SPY) remain near record levels. \n\nAfter a recent spike this week, the CBOE Volatility Index sank back to near 52-week lows, a sign that investor risk appetite is increasing. The VIX is known as the \"investor fear gauge,\" because it reflects investors' best predictions of near-term market volatility or risk. In general, the VIX rises during times of financial stress and falls during good economic times. David Kostin, chief US equity strategist at Goldman Sachs said, “The S&amp;P 500 has reached new highs while volatility has sharply declined. Low volatility has outweighed low correlations among stocks, driving return dispersion back below the long-term average. As the U.S. moves beyond key macro events such as the 2020 election, the $1.9 trillion fiscal stimulus package, and peak economic activity, we expect three defining themes for markets will be tax reform, infrastructure, and pricing power.”\n\nWhile Netflix (NFLX) sharply missed estimates, this earnings season has largely blown consensus estimates out of the water, with more than 81% of companies that have reported so far beating earnings expectations, according to a study by FactSet. However, despite the largely positive earnings, many stocks (apart from today) have failed to react positively to the news. It seems as more positive economic data is released in terms of consumer spending and unemployment, it takes more and more impressive results to convince investors to pile into the stock. This suggests there is froth in the markets given the sky-high valuation of some companies. \n\nWhite House chief medical advisor Dr. Anthony Fauci said he believes the U.S. will likely resume use of the Johnson &amp; Johnson Covid-19 vaccine as soon as Friday with a warning or restriction attached. The doctor said, “My estimate is that we will continue to use it in some form. I doubt very seriously if they just cancel it. I don’t think that’s going to happen. I do think that there will likely be some sort of warning or restriction or risk assessment. I don’t think it’s just going to go back and say, ‘Okay, everything’s fine. Go right back.’ I think it’ll likely say, ‘Okay, we’re going to use it, but be careful under these certain circumstances.”\n\n**Highlights**\n\n* The White House announced more than 200 million doses of the coronavirus vaccine have been distributed in the US, greatly surpassing original estimates of 100 million doses delivered in the first 100 days of Biden’s presidency. On the back of this robust distribution, all states are beginning to open back up.\n* Mortgage applications jumped 8.6% in the week ended April 16, marking the biggest jump since late January as mortgage rates pulled back following a surge, according to the Mortgage Bankers Association (MBA). \n* Ford Motor (F) is planning more downtime at five North American factories due to a global semiconductor shortage. \n* During yesterday’s virtual event, Apple (AAPL) announced a new slate of products set to include the companies own chip. The offering includes a new iMac, a new iPad, and a new tracking-device called Airtags.\n* Gisele Bündchen, supermodel and Tom Brady’s wife was announced as a special advisor for the CEO and board of directors in DraftKings. This is just the latest in a series of high-profile moves by DraftKings to establish itself as the premier sport-betting company. \n* After gapping up after earnings, Intuitive Surgical (ISRG) joined the ranks of healthcare companies worth $100 billion or more\n* After a series of high profile accidents including small children, the US Consumer Product Safety Commission advised consumer to not buy the treadmill if there are small kids or pets at home.This could affect the company's product-safety profile, a material category for the household and personal-goods sector. In response, Peloton (PTON) called the statements “inaccurate and misleading” and refused calls to recall their treadmill. The stock has been in freefall this week. \n* \\*\\***Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Abbott Labs (ABT) target raised by Morgan Stanley (MS) from $136 to $140 at Overweight. Stock currently around $120\n* Allegiant Travel (ALGT) target raised by Barclaays from $237 to $300 at Overweight. Stock currently around $231\n* Burlington Stores (BURL) target raised by Loop Capital from $325 to $365 at Buy. Stock currently around $319\n* Dell Technologies (DELL) with a host of target raises. Consensus price target $115 at Overweight. Stock currently around $101\n* Equinix (EQIX) target raised by Mizuho from $750 to $800 at Buy. Stock currently around $726\n* Facebook (FB) target raised by Cowen from $350 to $360 at Outperform. Stock currently around $303\n* Forward Air (FWRD) target raised by Raymond James from $95 to $100 at Outperform. Stock currently around $87 \n* Alphabet (GOOG,GOOGL) target raised by Cowen from $2400 to $2600 at Outperform. Stock currently around $2293\n* Goldman Sachs (GS) with a host of target raises. Consensus price target $410 at Outperform. Stock currently around $332\n* Jazz Pharma (JAZZ) target raised by Cantor Fitzgerald from $185 to $198 at Overweight. Stock currently around $168\n* JP Morgan (JPM) with three target raises. Stock currently around $150 \n   * DA Davidson from $179 to $182 at Buy\n   * Royal Bank of Canada from $150 to $160 \n   * Piper Sandler from $170 to $180\n* Lam Research (LRCX) target raised by Argus from $625 to $725 at Buy. Stock currently around $613\n* NXP Semiconductors (NXPI) target raised by Wells Fargo (WFC) from $193 to $235 at Overweight. Stock currently around $194\n* Penn National Gaming (PENN) target raised by Goldman Sachs (GS) from $153 to $158 at Buy. Stock currently around $89\n* Royal Caribbean (RCL) target raised by Goldman Sachs (GS) from $76 to $95 at Neutral\n* Snap (SNAP) target raised by Cowen from $86 to $88 at Outperform. Stock currently around $58\n* UPS with two target raises. Stock currently around $180\n   * Citigroup (C) from $190 to $200 at Neutral\n   * Raymond James from $195 to $200 at Strong-Buy\n\n“In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock prices, not risk, but it is an opportunity.” - Li Lu",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, April 21, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mvozqy/here_is_a_market_recap_for_today_wednesday_april/",
        "created": 1619066670.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1618952485,
        "id": "mv0b3x",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, April 20, 2021**\n\nStocks fell Tuesday, with all three major indexes dipping for the second straight session. Cyclical, travel and leisure stocks pulled back sharply while mega-cap tech stocks slid even as the 10-year Treasury yield edged lower.  \n\nDespite recent dips, the indexes remain near all-time highs, with the S&amp;P 500 (SPY) up roughly 10% year-to-date, so it’s not necessarily surprising the market beginning to pull back.  Ryan Detrick, chief market strategist for LPL Financial wrote in a note today, \"Many of our favorite sentiment gauges are becoming extremely bullish, which could be a near-term contrarian warning. The American Association of Individual Investors Sentiment Survey recently showed bulls outnumber bears by the most since January 2018.\"\n\nIn recent weeks, better-than-expected economic data in consumer spending and unemployment and strong performances by mega-cap stocks like Apple (AAPL), Microsoft (MSFT), and Google (GOOG, GOOGL) have driven the market higher. On the other hand, growth stocks and more speculative plays have pulled back sharply, extending a terrible run of performance in 2021. After hitting all-time highs near the middle of February, many growth stocks are down 30-50% from those levels. While it’s hard to pinpoint the exact factors why, we think (1) elevated Treasury yields compared to 12 months ago, (2) inflationary fears, (3) profit-taking after an incredible run in 2020, and (4) investor rotation to safer assets are all impacting growth stocks to the downside. \n\nLooking ahead, market participants will continue to monitor earnings season to gauge if corporate profits are growing in tandem with the recovering economy. Roughly 9% of companies in the SPY have reported, with 81% beating expectation. At the time of writing, Netflix (NFLX) just reported a sharp miss in new paying subscribers added (+3.98 million vs. +6.29 million expected), causing the stock to plummet 10% in after-hours. This is likely to have negative implications for market performance tomorrow.\n\nWhite House chief medical advisor Dr. Anthony Fauci said he believes the U.S. will likely resume use of the Johnson &amp; Johnson Covid-19 vaccine as soon as Friday with a warning or restriction attached. The doctor said, “My estimate is that we will continue to use it in some form. I doubt very seriously if they just cancel it. I don’t think that’s going to happen. I do think that there will likely be some sort of warning or restriction or risk assessment. I don’t think it’s just going to go back and say, ‘Okay, everything’s fine. Go right back.’ I think it’ll likely say, ‘Okay, we’re going to use it, but be careful under these certain circumstances.”\n\n**Highlights**\n\n* Chat startup Discord Inc. has halted talks to sell itself to potential suitors including Microsoft (MSFT), according to people familiar with the matter, as it resumes interest in a potential initial public offering down the line.\n* Senior executives with Alphabet's Google and Apple will testify on Wednesday about antitrust concerns related to their app stores along with executives of three companies which rely on those online stores, the leaders of the Senate Judiciary Committee's antitrust panel said on Monday.\n* The U.S. Consumer Product Safety Commission issued a warning Saturday advising consumers to stop using Peloton (PTON) Interactive's treadmill if there are small children or pets at home. The warning comes after a small child died in March during a treadmill accident. This could affect the company's product-safety profile, a material category for the household and personal-goods sector, according to the Sustainability Accounting Standards Board. The stock pulled back sharply\n* The U.K. government said it would probe Nvidia Corp.'s $40 billion deal to buy British chip-designer Arm from SoftBank Group Corp., over possible national security issues, adding new regulatory scrutiny to the proposed deal.\n* **\\*\\*Please note current stock price was written premarket and does not reflect intraday movement\\*\\***\n* Allegiant Travel (ALGT) from $250 to $285 at Buy. Stock currently around $231\n* Coupa Software (COUP target raised by Piper Sandler from $300 to $315 at Overweight. Stock currently around \n* IBM with a host of target raises. Consensus price target around $150 at Buy. Stock currently around $138\n* UnitedHealth Group target raised by Truist Securities from $420 to $450 at Buy. Stock currently around $397\n* Square (SQ) target raised by Barclays from $330 to $340 at Overweight. Stock currently around $243\n* Raytheon Technologies (RTX) target raised by Credit Suisse from $81 to $90 at Outperform. Stock currently around $77\n* Paypal (PYPL) target raised by Rosenblatt Securities from $320 to $350 at Buy. \n* Morgan Stanley (MS) target raised by Piper Sandler from $82 to $87 at Neutral. Stock currently around $77\n* Lam Research (LRCX) target raised by Cowen from $585 to $700 at Outperform. Stock currently around $612\n\nThe four most dangerous words in investing are: this time is different.” - John Templeton",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Tuesday, April 20, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mv0b3x/here_is_a_market_recap_for_today_tuesday_april_20/",
        "created": 1618981285.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619642247,
        "id": "n0o7ex",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "The stock market fell on Wednesday, with all three major indexes closing modestly red as market participants continue to digest the corporate earnings season and new commentary from the Federal Open Markets Committee. \n\nThe FOMC said the effective distribution of the vaccine in the US has improved economic conditions but reiterated interest rates will remain near-zero and the asset purchasing program in place. The Fed said, “Amid progress and strong policy support, indicators of economic activity and employment have risen.” The committee remains optimistic about the rebound in economic activity, describing the most affected sectors as “having shown improvement”, but shows no signs of slowing quantitative easing or raising interest rates. With more than 8 million people still out of jobs compared to pre-pandemic levels, FOMC reiterated its commitment to supporting the economy.\n\nThe Fed also said inflation has “risen” but attributed the higher readings to “transitory factors”, meaning they expect any rise in inflationary pressures to be short-lived. Central bank officials warn that higher inflation reading could be coming as a result of measuring year-over-year changes from a highly unusual 2020. In other words, The Fed looks at changes in prices in a year-over-year format. Data for March and April of this year could therefore reflect large price “increases” because they are being compared against March and April in 2020 that saw massive price drops. \n\nEconomic data published since the Fed’s last meeting in March 17 have largely supported their brighter outlook. Consumer spending surged 9.8% in March and initial jobless claims dropped to pandemic-era lows as more states continue reopening measures. In other news, according to a report by the Conference Board, consumer confidence has surged to a 14-month high in April as effective distribution of the vaccine and easing of social distancing guidelines in the US allows for the economy to gradually reopen. The Conference Board's monthly consumer confidence index jumped to a reading of 121.7 in April, or well above the 113.0 expected. Lynn Franco, senior director of economic indicators at the Conference Board, said in a statement, “Consumers’ assessment of current conditions improved significantly in April, suggesting the economic recovery strengthened further in early Q2. Consumers’ optimism about the short-term outlook held steady this month. Consumers were more upbeat about their income prospects, perhaps due to the improving job market and the recent round of stimulus checks.”\n\n**Highlights**\n\n* The US trade deficit rose to a new record high in March, according to data from the Department of Commerce. The deficit increased by 4% to $90.6 billion, higher than the $88 expected by economists\n* Mortgage applications fell 2.5% week-on-week, according to the Mortgage Bankers Association. This follows a jump of 8.6% last week, which had marked the first rise in seven weeks. \n* A deep-sea mining robot on a test mission to bring up rocks rich in cobalt and nickel from the floor of the Pacific Ocean has malfunctioned and is lost.\n* According to multiple reports, Nio began development on more affordable SUV to cater for the mid to low price markets and is also working on an upgraded 70-kilowatt-hour battery pack using lithium-iron-phosphate batteries, which are cheaper than the ones the company uses now\n* Nio said in a tweet from its official handle that its global vision is gaining steam and the company is making plans to expand to Norway as part of its plan to expand into Europe. Press Conference on May 6th at 1 am PDT \n* The European Union fined Credit Suisse Group AG, Bank of America Corp. and Credit Agricole SA a small amount for illegally colluding on trades in government bond markets at the expense of their clients.\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Advanced Auto Parts (AAP) target raised by Wedbush from $210 to $230 at Outperform. Stock currently around $197\n* AMD with two target raises. Stock currently around $85\n   * \\- Raymond James from $100 to $110 at Outperform\n   * Susquehanna from $115 to $125 at Positive\n* Boyd Gaming (BYD) with two target raises. Stock currently around $69\n   * Deutsche Bank from $71 to $77 Buy\n   * Morgan Stanley (MS) from $66 to $78 at Overweight\n* Capital One (COF) with a host of target raises. Consensus price target $165 at Outperform. Stock currently around $139\n* Crocs (CROX) target raised by Robert W Baird from $100 to $135 at Outperform. Stock currently around $98\n* EA target raised by KeyCorp from $165 to $170 at Overweight. Stock currently around $143\n* F5 Networks (FFIV) target raised by Needham &amp; Co from $245 to $255 at Buy. Stock currently around $205\n* Alphabet (GOOG, $GOOGL) with a host of target raises. Consensus price target $2850 at Buy. Stock currently around $2290\n* Lam Research (LRCX) with a host of target raises. Consensus price target $730 at Buy. Stock currently around $645\n* Microsoft (MSFT) with a host of target raises. Consensus price target $300 at Outperform. Stock currently around $262\n* Signature Bank (SBNY) with two target raises. Stock currently around $252\n   * Wedbush from $280 to $305 at Outperform\n   * Raymond James from $290 to $300 at Strong-Buy\n* Tesla (TSLA) target raised by Morgan Stanley to $900 at Overweight. Stock currently around $704\n* Visa (V) with a host of target raises. Consensus price target $265 at Outperform. Stock currently around $230\n* NXP Semiconductors (NXPI) with a host of target raises. Consensus price target $230 at Outperform. Stock currently around $203\n\n“To bear trials with a calm mind robs misfortune of its strength and burden.\" - Seneca",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Wednesday, April 28, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/n0o7ex/here_is_a_market_recap_for_today_wednesday_april/",
        "created": 1619671047.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619472098,
        "id": "mz8dh1",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, April 26, 2021**\n\nThe stock traded mixed on Monday, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) continuing strong momentum from last week while the Dow Jones (DIA) modestly fell. Looking ahead, market participants are preparing for a slew of corporate earnings, new economic data, and the Federal Open Market Committee’s April meeting.\n\nThis week, a slew of huge companies are set to report corporate earnings for the first quarter of 2021. Altogether, the market caps of the companies reporting this week comprise nearly half the total market cap of the S&amp;P 500, according to FactSet. So far, the vast majority of companies have vastly exceeded analyst estimates, with effective vaccine distribution in the US helping stoke demand as the economy gradually reopens. \n\nEighty-four percent of the S&amp;P 500 companies that have reported first-quarter results to date posted a positive earnings per share surprise, according to data from FactSet. This would mark the highest percentage of companies reporting upside surprises since FactSet began tracking this metric in 2008, assuming this beat rate holds through the end of earnings season. \n\nLast week on Thursday, stocks sold off sharply following reports President Biden will propose almost doubling the capital gains tax rate for wealthy individuals earning $1 million or more per year to 39.6% to help pay for a slew of social programs and the proposed infrastructure bill. The new 39.6% rate would almost double the tax rate from the current base rate of 20%. However, the sharp bounce back we have seen suggests the initial sell-off was overdone. Kathy Jones, chief fixed income strategist at Charles Schwab said, “I think the immediate reaction was probably a bit overdone. These proposals come out and you never know, especially with tax proposals, where we'll end up. So it looks like an opening bid. I'm sure there will be intense lobbying from the investment community to adjust those numbers. But I think at the moment, when you have very high valuations in the market, anything that is bad news can spark a bit of a sell-off.\"\n\nThe Federal Open Market Committee (FOMC) will meet for its April meeting on Tuesday and Wednesday, with a monetary policy decision and press conference from Federal Reserve Chair Jerome Powell slated for Wednesday afternoon. With the Fed having already signaled that benchmark interest rates would remain on hold through at least 2023, market participants are expecting virtually no major changes to policy to be announced.\n\n**Highlights**\n\n* Tesla (TSLA) beat analyst expectations in their earnings report. The stock is modestly down at the time of writing\n   * Revenue of $10.39 billion vs $10.29 billion expected (up from $6 billion a year earlier)\n   * EPS of $0.93 vs $0.79 expected\n* The vaccinations effort continues with over 200 million Americans receiving at least one shot and 90 million adults fully vaccinated, according to data compiled by the CDC.\n* The Biden administration wants to spend $174 billion to boost electric vehicles and charging stations but its 2030 climate emissions reduction pledge released on Thursday does not include a firm date to phase out gasoline-powered vehicles. \"These autos are coming. We know it. It is the future,\" White House climate adviser Gina McCarthy said of EVs at an event in Washington promoting administration efforts to boost EV charging.\n* In the wake of the fatal crash of a Tesla car in Texas on Saturday, two U.S. senators have expressed concern about what they said may be an emerging pattern of safety concerns involving Tesla vehicles. \n* **\\*\\*Please note that current stock price was written in the morning and does not reflect intraday changes\\*\\***\n* Apple (AAPL) target raised by Morgan Stanley from $157 to $158 at Overweight. Stock currently around $134\n* Allstate (ALL) target raised by Raymond James from $135 to $140 at Strong-Buy\n* Ally Financial (ALLY) target raised by Morgan Stanley (MS) from $56 to $59 at Overweight. Stock currently around $49\n* Ametek (AME) target raised by Wells Fargo from $140 to $160 at Overweight. Stock currently around $135\n* Activision Blizzard (ATVI) target raised by Benchmark from $118 to $120 at Buy. Stock currently around $93\n* American Express (AXP) target raised by Oppenheimer from $128 to $165 at Outperform. Stock currently around $144\n* Burlington Stores (BURL) target raised by JP Morgan (JPM) from $315 to $380 at Overweight. Stock currently around $328\n* Chipotle (CMG) target raised by Stifel Nicolaus from $1550 to $1750 at Buy. Stock currently around $1468\n* Walt Disney (DIS) target raised by Wells Fargo (WFC) from $201 to $219 at Overweight. Stock currently around $183\n* Expedia (EXPE) target raised by Truist Securities from $170 to $237 at Buy. Stock currently around $177\n* Facebook (FB) target raised by Credit Suisse from $330 to $371 at Outperform. Stock currently around $301\n* FirstEnergy (FE) target raised by Morgan Stanley (MS) from $40 to $44 at Overweight. Stock currently around $37\n* Fortinet (FTNT) target raised by BTIG Research from $205 to $240 at Buy. Stock currently around $201\n* Alphabet (GOOG, $GOOGL) with three target raises. Stock currently around $2300\n   * Cannaccord Genuity from $2400 to $2600 at Buy\n   * KeyCorp from $2353 to $2625 at Overweight\n   * Mizuho from $2350 to $2600 at Buy\n* IQVIA (IQV) target raised by Barclays from $235 to $260 at Overweight. Stock currently around $232\n* The Lovesac (LOVE) target raised by Oppenheimer from $60 to $85 at Outperform. Stock currently around $70\n* Lam Research (LRCX) target raised by Citigroup from $660 to $750 at Buy. Stock currently around $627\n* Mastercard (MA) target raised by Morgan Stanley (MS) from $412 to $418 at Overweight. Stock currently around $387\n* Morgan Stanley (MS) target raised by Piper Sanlder from $82 to $87 at Neutral. Stock currently around $81\n* Quanta Services (PWR) target raised by KeyCorp from $90 to $115 at Overweight. Stock currently around $98\n* Paypal (PYPL) target raised by Rosenblatt Securities froim $320 to $350 at Buy. Stock currently around $266\n* Starbucks (SBUX) target raised by Oppenheimer from $122 to $135 at Outperform. Stock currently around $118\n* Square (SQ) target raised by Barclays from $330 to $340 at Overweight. Stock currently around $246\n* Tesla (TSLA) target raised by Mizuho from $775 to $820 at Buy. Stock currently around $730\n* Twitter (TWTR) target raised by Oppenheimer from $70 to $85 at Outperform. Stock currently around\n\n“Someone's sitting in the shade today because someone planted a tree a long time ago.”- Warren Buffet",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, April 26, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mz8dh1/here_is_a_market_recap_for_today_monday_april_26/",
        "created": 1619500898.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1617654045,
        "id": "mktwol",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, April 5, 2021**\n\nStocks jumped on Monday, continuing their strong performance from last Friday, with the S&amp;P 500 (SPY) and Dow Jones (DIA) recording fresh highs. The tech-heavy Nasdaq (QQQ) outperformed, closing the day 2% up. Market participants remain encouraged by President Biden’s recent infrastructure proposal, a better-than-expect monthly job report, and are looking ahead to a week of commentary from Federal Open Market Committee (FOMC) members. \n\nThe March Jobs Report blew past consensus estimates to record the fastest pace of job growth since last summer. Nonfarm payrolls increased by 916,000 for the month while the unemployment rate fell to 6% (unemployment rate was 14.6% in April 2020). Economists surveyed by Dow Jones had been looking for an increase of 675,000 and an unemployment rate of 6%. Quincy Krosby, chief market strategist at Prudential Financial said, “It \\[the jobs report\\] shows that the economy is healing, that those who lost their jobs are coming back into the workforce as the recovery continues and restrictions are lifted.”\n\nPresident Biden’s plan, called the American Jobs Plan, proposes to spend $2.25 trillion over 8 years to rehabilitate and build out the nation’s transportation infrastructure, expand domestic manufacturing and workforce development, modernize the electrical grid, and fund the research, development, and implementation of clean energy technologies. See a full list of items from the bill [here](https://finance.yahoo.com/news/biden-infrastructure-plan-details-113700242.html). \n\nLooking ahead, this week will be chock full of commentary from Federal Open Market Committee (FOMC) members, who will offer their assessment of the latest batch of economic data and how they will proceed. . Chicago Fed President Charles Evans, Richmond Fed President Thomas Barkin and St. Louis Fed President Jim Bullard are each slated to deliver public remarks later this week, and Fed Chair Jerome Powell will speak at an International Monetary Fund (IMF) panel regarding the global economy Thursday afternoon. In a note to client, Wells Fargo economist Sam Bullard said, “ \"While the consensus of the FOMC continues to suggest that the committee will wait for their forecasts to be realized before taking policy action, it will be interesting to see if there is any intense discussion about the implications of the stronger outlook, particularly around inflation. Most Fed officials expect any pick-up in inflation to be “transitory,” yet we suspect there are a few officials that are pushing back on that narrative.\" \n\n**Highlights**\n\n* Shares of Gamestop (GME) sank after the company announced it may sell up to $1 billion worth of additional shares. \n* Shares of Tesla gapped up more than 4% after the company reported better than expected March delivery numbers. Other EV companies also posted better-than-expected deliveries but didn’t rise nearly as much.\n* Treasury Secretary Janet Yellen said during public remarks Monday that the U.S. Treasury Department was working with other major nations to agree on a global minimum corporate tax rate, which would disincentivize companies from seeking to locate to places with lower tax rates.\"We’re working with G20 nations to agree to a global minimum corporate tax rate that can stop the race to the bottom,\" Yellen said during virtual remarks with the Chicago Council on Global Affairs.\n* South Korea's LG Electronics Inc said on Monday it will end production and sales of its loss-making smartphone division.\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Applied Materials (AMAT) with two target raises. Stock currently around $142\n* American Express (AXP) target raised by Wells Fargo from $150 to $165 at Overweight. Stock currently around $145\n* Brooks Automation (BRKS) target raised by B. Riley from $105 to $125 at Buy. Stock currently around $90\n* Ichor (ICHR) target raised by B. Riley from $63 to $75 at Buy. Stock currently around $59\n* \\- CarMax (KMX) target raised by Stephens from $130 to $154 at Overweight. Stock currently around $123fel Nicolaus from $140 to $160 at Buy\n* \\- B. Riley fLam Research (LRCX) target raised by B. Riley from $670 to $800 at Buy. Stock currently around $640rom $150 to $195 at Buy\n* Dave &amp; Busters (PLAY) with two target raises. Stock currently around $45\n   * Deutsche Bank from $41 to $57 at Buy\n   * Loop Capital from $35 to $50 at Hold\n* Constellation Brands (STZ) target raised by Jefferies Financial Group from $276 to $300 at Buy. Stock currently around $230 \n\n“Perseverance is not a long race; it is many short races one after the other.” - Walter Elliot",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Monday, April 5, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mktwol/here_is_a_market_recap_for_today_monday_april_5/",
        "created": 1617682845.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1617654022,
        "id": "mktwex",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, April 5, 2021**\n\nStocks jumped on Monday, continuing their strong performance from last Friday, with the S&amp;P 500 (SPY) and Dow Jones (DIA) recording fresh highs. The tech-heavy Nasdaq (QQQ) outperformed, closing the day 2% up. Market participants remain encouraged by President Biden’s recent infrastructure proposal, a better-than-expect monthly job report, and are looking ahead to a week of commentary from Federal Open Market Committee (FOMC) members. \n\nThe March Jobs Report blew past consensus estimates to record the fastest pace of job growth since last summer. Nonfarm payrolls increased by 916,000 for the month while the unemployment rate fell to 6% (unemployment rate was 14.6% in April 2020). Economists surveyed by Dow Jones had been looking for an increase of 675,000 and an unemployment rate of 6%. Quincy Krosby, chief market strategist at Prudential Financial said, “It \\[the jobs report\\] shows that the economy is healing, that those who lost their jobs are coming back into the workforce as the recovery continues and restrictions are lifted.”\n\nPresident Biden’s plan, called the American Jobs Plan, proposes to spend $2.25 trillion over 8 years to rehabilitate and build out the nation’s transportation infrastructure, expand domestic manufacturing and workforce development, modernize the electrical grid, and fund the research, development, and implementation of clean energy technologies. See a full list of items from the bill [here](https://finance.yahoo.com/news/biden-infrastructure-plan-details-113700242.html). \n\nLooking ahead, this week will be chock full of commentary from Federal Open Market Committee (FOMC) members, who will offer their assessment of the latest batch of economic data and how they will proceed. . Chicago Fed President Charles Evans, Richmond Fed President Thomas Barkin and St. Louis Fed President Jim Bullard are each slated to deliver public remarks later this week, and Fed Chair Jerome Powell will speak at an International Monetary Fund (IMF) panel regarding the global economy Thursday afternoon. In a note to client, Wells Fargo economist Sam Bullard said, “ \"While the consensus of the FOMC continues to suggest that the committee will wait for their forecasts to be realized before taking policy action, it will be interesting to see if there is any intense discussion about the implications of the stronger outlook, particularly around inflation. Most Fed officials expect any pick-up in inflation to be “transitory,” yet we suspect there are a few officials that are pushing back on that narrative.\" \n\n**Highlights**\n\n* Shares of Gamestop (GME) sank after the company announced it may sell up to $1 billion worth of additional shares. \n* Shares of Tesla gapped up more than 4% after the company reported better than expected March delivery numbers. Other EV companies also posted better-than-expected deliveries but didn’t rise nearly as much.\n* Treasury Secretary Janet Yellen said during public remarks Monday that the U.S. Treasury Department was working with other major nations to agree on a global minimum corporate tax rate, which would disincentivize companies from seeking to locate to places with lower tax rates.\"We’re working with G20 nations to agree to a global minimum corporate tax rate that can stop the race to the bottom,\" Yellen said during virtual remarks with the Chicago Council on Global Affairs.\n* South Korea's LG Electronics Inc said on Monday it will end production and sales of its loss-making smartphone division.\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Applied Materials (AMAT) with two target raises. Stock currently around $142\n* American Express (AXP) target raised by Wells Fargo from $150 to $165 at Overweight. Stock currently around $145\n* Brooks Automation (BRKS) target raised by B. Riley from $105 to $125 at Buy. Stock currently around $90\n* Ichor (ICHR) target raised by B. Riley from $63 to $75 at Buy. Stock currently around $59\n* \\- CarMax (KMX) target raised by Stephens from $130 to $154 at Overweight. Stock currently around $123fel Nicolaus from $140 to $160 at Buy\n* \\- B. Riley fLam Research (LRCX) target raised by B. Riley from $670 to $800 at Buy. Stock currently around $640rom $150 to $195 at Buy\n* Dave &amp; Busters (PLAY) with two target raises. Stock currently around $45\n   * Deutsche Bank from $41 to $57 at Buy\n   * Loop Capital from $35 to $50 at Hold\n* Constellation Brands (STZ) target raised by Jefferies Financial Group from $276 to $300 at Buy. Stock currently around $230 \n\n“Perseverance is not a long race; it is many short races one after the other.” - Walter Elliot",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Monday, April 5, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mktwex/here_is_a_market_recap_for_today_monday_april_5/",
        "created": 1617682822.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619642291,
        "id": "n0o82a",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, April 28, 2021**\n\nThe stock market fell on Wednesday, with all three major indexes closing modestly red as market participants continue to digest the corporate earnings season and new commentary from the Federal Open Markets Committee. \n\nThe FOMC said the effective distribution of the vaccine in the US has improved economic conditions but reiterated interest rates will remain near-zero and the asset purchasing program in place. The Fed said, “Amid progress and strong policy support, indicators of economic activity and employment have risen.” The committee remains optimistic about the rebound in economic activity, describing the most affected sectors as “having shown improvement”, but shows no signs of slowing quantitative easing or raising interest rates. With more than 8 million people still out of jobs compared to pre-pandemic levels, FOMC reiterated its commitment to supporting the economy.\n\nThe Fed also said inflation has “risen” but attributed the higher readings to “transitory factors”, meaning they expect any rise in inflationary pressures to be short-lived. Central bank officials warn that higher inflation reading could be coming as a result of measuring year-over-year changes from a highly unusual 2020. In other words, The Fed looks at changes in prices in a year-over-year format. Data for March and April of this year could therefore reflect large price “increases” because they are being compared against March and April in 2020 that saw massive price drops. \n\nEconomic data published since the Fed’s last meeting in March 17 have largely supported their brighter outlook. Consumer spending surged 9.8% in March and initial jobless claims dropped to pandemic-era lows as more states continue reopening measures. In other news, according to a report by the Conference Board, consumer confidence has surged to a 14-month high in April as effective distribution of the vaccine and easing of social distancing guidelines in the US allows for the economy to gradually reopen. The Conference Board's monthly consumer confidence index jumped to a reading of 121.7 in April, or well above the 113.0 expected. Lynn Franco, senior director of economic indicators at the Conference Board, said in a statement, “Consumers’ assessment of current conditions improved significantly in April, suggesting the economic recovery strengthened further in early Q2. Consumers’ optimism about the short-term outlook held steady this month. Consumers were more upbeat about their income prospects, perhaps due to the improving job market and the recent round of stimulus checks.”\n\n**Highlights**\n\n* The US trade deficit rose to a new record high in March, according to data from the Department of Commerce. The deficit increased by 4% to $90.6 billion, higher than the $88 expected by economists\n* Mortgage applications fell 2.5% week-on-week, according to the Mortgage Bankers Association. This follows a jump of 8.6% last week, which had marked the first rise in seven weeks. \n* A deep-sea mining robot on test mission to bring up rocks rich in cobalt and nickel from the floor of the Pacific Ocean has malfunctioned and is lost.\n* According to multiple reports, Nio began development on more affordable SUV to cater for the mid to low price markets and is also working on an upgraded 70 kilowatt-hour battery pack using lithium-iron phosphate batteries, which are cheaper than the ones the company uses now\n* Nio said in a tweet from its official handle that its global vision is gaining steam and the company is making plans to expand to Norway as part of its plan to expand into Europe. Press Conference on May 6th at 1 am PDT \n* The European Union fined Credit Suisse Group AG, Bank of America Corp. and Credit Agricole SA a small amount for illegally colluding on trades in government bond markets at the expense of their clients.\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Advanced Auto Parts (AAP) target raised by Wedbush from $210 to $230 at Outperform. Stock currently around $197\n* AMD with two target raises. Stock currently around $85\n   * \\- Raymond James from $100 to $110 at Outperform\n   * Susquehanna from $115 to $125 at Positive\n* Boyd Gaming (BYD) with two target raises. Stock currently around $69\n   * Deutsche Bank from $71 to $77 Buy\n   * Morgan Stanley (MS) from $66 to $78 at Overweight\n* Capital One (COF) with a host of target raises. Consensus price target $165 at Outperform. Stock currently around $139\n* Crocs (CROX) target raised by Robert W Baird from $100 to $135 at Outperform. Stock currently around $98\n* EA target raised by KeyCorp from $165 to $170 at Overweight. Stock currently around $143\n* F5 Networks (FFIV) target raised by Needham &amp; Co from $245 to $255 at Buy. Stock currently around $205\n* Alphabet (GOOG, $GOOGL) with a host of target raises. Consensus price target $2850 at Buy. Stock currently around $2290\n* Lam Research (LRCX) with a host of target raises. Consensus price target $730 at Buy. Stock currently around $645\n* Microsoft (MSFT) with a host of target raises. Consensus price target $300 at Outperform. Stock currently around $262\n* Signature Bank (SBNY) with two target raises. Stock currently around $252\n   * Wedbush from $280 to $305 at Outperform\n   * Raymond James from $290 to $300 at Strong-Buy\n* Tesla (TSLA) target raised by Morgan Stanley to $900 at Overweight. Stock currently around $704\n* Visa (V) with a host of target raises. Consensus price target $265 at Outperform. Stock currently around $230\n* NXP Semiconductors (NXPI) with a host of target raises. Consensus price target $230 at Outperform. Stock currently around $203\n\n“To bear trials with a calm mind robs misfortune of its strength and burden.\" - Seneca",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Wednesday, April 28, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/n0o82a/here_is_a_market_recap_for_today_wednesday_april/",
        "created": 1619671091.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619124606,
        "id": "mwegvb",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, April 22, 2021**\n\nStocks fell on Thursday, erasing yesterday’s gains as market volatility continues. Stocks fell after Bloomberg reported that President Biden would propose increasing the capital gains tax rate on wealthy individuals. The S&amp;P 500 (SPY) closed 0.91% down, the Dow Jones (DIA) closed 0.94% and the tech-heavy Nasdaq (QQQ) fell 1.21%.\n\nAccording to a report by [Bloomberg](https://www.bloomberg.com/news/articles/2021-04-22/biden-to-propose-capital-gains-tax-as-high-as-43-4-for-wealthy), President Biden will propose almost doubling the capital gains tax rate for wealthy individuals earning $1 million or more per year to 39.6% to help pay for a slew of social programs and the proposed infrastructure bill. The new marginal 39.6% rate would be an increase from the current base rate of 20%, the people said on the condition of anonymity because the plan is not yet public. The proposal could reverse a long-standing provision of the tax code that taxes returns on investment lower than on labor/salary. \n\nCorporate earnings have so far exceeded Wall Street’s even lofty expectations, as companies benefited from both a surge in consumer spending as the economy opens back up and cost-cutting measures implemented during the height of the pandemic.  However, despite the largely positive earnings, many stocks have failed to react positively to the news. It seems as more positive economic data is released in terms of consumer spending and unemployment, it takes more and more impressive results to convince investors to pile into the stock. This suggests there is froth in the markets given the sky-high valuation of some companies, in our opinion.\n\nJim Caron, investment management fixed income portfolio manager at Morgan Stanley (MS) said, “What we have is the absence of a catalyst. Everything that we’ve done over the last twelve months has been to build up to this point, to get this recovery, to get a very, very strong second-quarter GDP, which we think could be upwards of 10%. But after that, things start to slow down. It doesn’t mean that the data gets bad, it just means on a relative basis that the third quarter will be weaker than the second quarter and the fourth quarter may be weaker than the third quarter.”\n\n**Highlights**\n\n* Two U.S. senators have expressed concern about what they said may be an emerging pattern of safety concerns involving Tesla Inc. vehicles in the wake of a fatal crash in Texas.\n* Square (SQ) announced that it plans to make new inventory-management features available to its sellers.The company is rolling out tools that help sellers automate their inventory-management processes by using barcode scanners to take stock of inventory and receiving alerts driven by machine learning to see when an item is due to run out.\n* Amazon-backed home technology solutions provider SmartRent.com Inc said on Thursday it had agreed to go public through a merger with a blank-check firm, valuing the equity of the combined company at around $2.2 billion.\n* The White House announced more than 200 million doses of the coronavirus vaccine have been distributed in the US, greatly surpassing original estimates of 100 million doses delivered in the first 100 days of Biden’s presidency. On the back of this robust distribution, all states are beginning to open back up.\n* Mortgage applications jumped 8.6% in the week ended April 16, marking the biggest jump since late January as mortgage rates pulled back following a surge, according to the Mortgage Bankers Association (MBA). \n* Ford Motor (F) is planning more downtime at five North American factories due to a global semiconductor shortage. \n* **\\*\\*Please note that current stock price was written in the morning and does not reflect current stock price\\*\\***\n* Twitter (TWTR) target raised by Argus from $72 to $82 at Buy. Stock currently around $65\n* Las Vegas Sands (LVS) target raised by Credit Suisse from $58 to $69 at Outperform. Stock currently around $58\n* Lam Research (LRCX) with a host of target raises. Consensus price target around $775 at Overweight. Stock currently around $615\n* Equifax (EFX) target raised by Needham &amp; Co from $215 to $260 at Buy. Stock currently around $221\n* Discover Financial Services (DFS) target raised by Morgan Stanley (MS) from $108 to $114 at Equal-Weight. Stock currently around $99\n* NXP Semiconductors (NXPI) target raised by Oppernheimer from $210 to $235 at Outpeform. Stock currently around $196\n* Facebook (FB) target raised by Jefferies Financial Group from $350 to $360 at Buy. Stock currently around $296\n* Chipotle (CMG) with a host of target raises after a strong earnings report. Consensus price target around $1700 at Outperform. Stock currently around $1479\n\n“All our dreams can come true, if we have the courage to pursue them.” - Walt Disney",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, April 22, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mwegvb/here_is_a_market_recap_for_today_thursday_april/",
        "created": 1619153406.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1618665394,
        "id": "msqjpj",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning April 19th, 2021.\n\n# **Concerns over inflationary pressure on earnings will test stocks in the week ahead - [(Source)](https://www.cnbc.com/2021/04/16/investors-look-for-hints-of-inflation-in-earnings-in-the-week-ahead.html)**\n*****\n&gt; Earnings will be the major focus for investors in the week ahead, as they home in on whether rising costs are squeezing margins and signaling a build in inflationary pressures.\n*****\n&gt; From Coca-Cola and IBM to Johnson &amp; Johnson and Netflix, investors will hear from a broad swath of corporate America.\n*****\n&gt; So far, with one week in, companies are beating earnings estimates by a wide margin of more than 84%, according to Refinitiv.\n*****\n&gt; This three-month period is the first to be compared to year earlier profits that were affected by the pandemic. Profit growth for the S&amp;P 500 is a stunning 30.2% for the quarter so far, based on actual reports and estimates.\n*****\n&gt; That makes it the best three-month period since the third quarter of 2010, according to FactSet.\n*****\n&gt; # Signs of margin pressures?\n&gt; Major banks, like JPMorgan Chase, Goldman Sachs and Bank of America reported better than expected profits in the past week.\n*****\n&gt; The S&amp;P 500 ended the week at a record high of 4,185, a gain of 1.4%. The Dow, higher for a fourth week, gained 1.2 to end the week at a record 34,200. Nasdaq gained 1.1% for the week, finishing at 14,052.\n*****\n&gt; Utilities was the best performing major S&amp;P sector, gaining 3.7%, followed by materials, up 3.2% and health care, up 2.9%. Technology was up 1%. Financials were up 0.7%, while industrials were up 0.6%.\n*****\n&gt; Lori Calvasina, head of U.S. equity strategy at RBC, said she is watching the coming week’s earnings for signs of margin pressures from higher commodity prices, supply chain issues and other cost factors.\n*****\n&gt; “Those big forces that are threatening margins right now don’t really apply to financials. They apply more to industrial companies, the material companies and consumer companies,” she said.\n*****\n&gt; “I think [sectors] like the industrials will give you color on margins,” Calvasina added. “Margins really are the big question mark going forward. I’m definitely watching and listening to see what companies are going to say about taxes.”\n*****\n&gt; President Joe Biden has proposed raising corporate taxes to 28% from 21% to help pay for his infrastructure plan.\n*****\n&gt; While the fate of the tax hike is still not clear, the increase in other costs is apparent. Fuel costs have risen sharply with a 30% rise in oil prices since the beginning of the year. Lumber prices in the futures market are at an all-time high and copper futures are up about 17% year-to-date.\n*****\n&gt; Calvasina said companies face a headwind and a tailwind.\n*****\n&gt; “Companies are saying we found new ways to cut costs. When revenues come back, margins are going to explode to the upside,” she said. “Some of the Covid-related costs will come down. Those are some of the positives.”\n*****\n&gt; But not every company will see those benefits. “We could start to see wage pressures come back. Rising commodity costs — increases in PPI and increases in CPI — those are negatives for margins,” Calvasina said, referring to the producer price and consumer price indexes.\n*****\n&gt; # Searching for hints of inflation\n&gt; Peter Boockvar, chief investment officer at Bleakley Advisory Group, said he is also watching the margin comments carefully for impact on individual stocks, but also for what they broadly say about inflation seeping into the economy.\n*****\n&gt; “What’s going to be the most interesting thing about earnings are profit margins. Some companies are going to get squeezed because they’re going to see price increases and others aren’t because they can pass it on,” said Boockvar.\n*****\n&gt; He said he will pay close attention to whether the semiconductor shortage is showing up in tech companies’ earnings. Automakers have already taken a hit and have scaled back production due to the lack of chips.\n*****\n&gt; The CPI for March showed a pick-up in headline inflation to 2.6% year-over-year. A 9.1% jump in gasoline prices contributed to the gain.\n*****\n&gt; Some of the gains in inflation this spring are expected to be temporary because of the comparison to very low levels last year when the economy was shutdown.\n*****\n&gt; Other than earnings, the week should be fairly quiet. Federal Reserve speakers have taken a hiatus and are in a blackout period ahead of the late April meeting.\n*****\n&gt; “It’s really going to be attention shifting to earnings and the inflation story,” said Boockvar.\n*****\n&gt; # Economic rebound\n&gt; In the past week, economic reports underscored how strong the economic momentum could be in the second quarter. Retail sales for March were up nearly 10%, and jobless claims were the lowest of the recovery.\n*****\n&gt; There is little data in the week ahead, aside from PMI manufacturing and services data Friday. But the markets will keep a close eye on unemployment figures after Thursday’s report of 576,000 new claims — the lowest level since the early days of the pandemic.\n*****\n&gt; “The large claims decline suggests that job separation rates may finally be normalizing, a good sign for April payrolls,” note Barclays economists. A surprise 916,000 jobs were added in March, and economists have said they now expect a string of reports showing payrolls are up by 1 million or more.\n*****\n&gt; However, Stephen Stanley, chief economist at Amherst Pierpont, says it may be too early to read too much into the claims data, and the coming week’s report will be important.\n*****\n&gt; He said the drop in claims was driven by sharp drops in a number of states, including more than half in California and even larger percentage declines in Kentucky and Virginia.\n*****\n&gt; “Unfortunately, I have no confidence that these moves won’t be at least partially reversed next week,” he wrote. “Continuing claims in the special pandemic programs continue to seesaw up and down every week, with the latest reading, for the period ended March 27, being a down week.”\n*****\n&gt; # Watching bonds\n&gt; Stock investors will also be watching the bond market, where yields declined in the past week and then reversed. The 10-year Treasury was at 1.59% Friday, after tumbling sharply on Thursday.\n*****\n&gt; Yields move opposite price, and the 10-year is the most widely watched bond security, as it impacts mortgage rates and other loans.\n*****\n&gt; “The 10-year will now trade in the 1.50% to 1.75% trading range,” said Boockvar.\n*****\n&gt; “It’ll break below that if inflation is transitory and it will break above if it’s proven to be otherwise,” he added. “I think we priced in the last inflation stats and then we’ll take into account what the real world is saying, from companies.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/c7J5krZ.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/lhy7AaR.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/UW7ZbbU.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/uom4C2h.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/l0cX2LH.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/jpa2DZe.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PgmZlAV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/3Rugxjf.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/gmHwRAL.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/po0gflq.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/j0oHK6M.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/jJcd0lq.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/qX9lwYh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/Jvf27dw.png))**\n\n*****\n\n&gt; # Four Reasons The Future Looks Bright For The Bulls\n\n&gt; “I look to the future because that’s where I’m going to spend the rest of my life.” George Burns\n\n&gt; The bull market continues, with the S&amp;P 500 Index now up more than 10% in 2021. With stocks up more than 80% from the March 2020 lows, the reality is a well-deserved break or consolidation could happen at any time. Looking to the future, as George Burns said above, we would be a buyer of any material weakness, as we believe this bull market is alive and well as we’ll discuss more in this blog.\n\n&gt; Here are four bullish stats we’ve found recently that indeed suggest this bull market could still have plenty of life left.\n\n&gt; First, the S&amp;P 500 Index was up just under 6% in the first quarter, an area we’d call the sweet spot. Looking back since 1950, when the S&amp;P 500 was up between 5-10% in the first quarter, the rest of the year (so the final three quarters) gained another 12.4% on average and was higher 86.7% of the time. Compare this to when the S&amp;P 500 was up &gt;10% in the first quarter and the returns drop to 6.5% the rest of the year. Lastly, if the first quarter was negative, then the rest of the year was up only 3%. Sweet spot indeed.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.14.21-Blog-Chart-2.png?ssl=1))**\n\n&gt; Second, the December Low Indicator has bulls smiling. This was created by Lucien Hooper, a Forbes columnist in the 1970s, and it simply says that if the S&amp;P 500 closes beneath the December low during the first quarter then future weakness could be in the cards. But if this critical level holds, then higher prices could be around the corner.\n\n&gt; As the LPL Chart of the Day shows, stocks held above the December lows in 2021 and this could mean continued higher prices, as the S&amp;P 500 was up more than 18% on average previous years when this level held and incredibly was higher 33 out of 35 years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.14.21-Blog-CHart-3.png?ssl=1))**\n\n&gt; Third, the S&amp;P 500 was up nearly 54% in the 12 months ending March 2021, one of the largest yearly gains ever. Looking at previous times that had significant 12-month returns shows the potential for weak returns 1, 3, and 6 months later. This makes sense, as stocks could need some time to catch their breath. The good news? One year later the S&amp;P 500 was higher more than 90% of the time, with only the year after the 1987 crash in the red. “It might seem counterintuitive to most investors, but big rallies like we’ve seen tend to mark the start of bull markets, not the end, so we wouldn’t bet on this bull market ending anytime soon,” explained LPL Financial Chief Market Strategist Ryan Detrick.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.14.21-Blog-CHart-4.png?ssl=1))**\n\n&gt; Lastly, overall market breadth is extremely strong. Again, this could suggest near-term there could be an exhaustion point, but this isn’t what you see at the end of bull markets, in fact, it tends to usually happen at the start of new bull markets. Currently, more than 95% of the components in the S&amp;P 500 are above their 200-day moving average, a level only seen two other times, in December 2003 and September 2009. Looking back at 2004 and 2010, 2004 saw consolidation a good part of the year, while 2010 had a well-deserved 16% correction after the huge gains off the March 2009 lows. But the key point is after extreme market breadth like we are seeing now, overall higher prices and the bull market lasted for many more years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.14.21-Blog-Chart-5.png?ssl=1))**\n\n&gt; Looking to the future, as George Burns said, we believe it could be a bright one for equity investors, particularly when we consider the return potential for stocks compared to cash and high-quality bonds.\n\n*****\n\n&gt; # B.I.G. Tips - Boom Goes the Retail Sales\n\n&gt; After a lousy report for the month of February when freak weather across the south temporarily shut down several areas of the south, Retail Sales bounced back with a vengeance in March as vaccine rollouts accelerated and stimulus checks were spent.\n\n&gt; The moves higher in Retail Sales over the last few months have been incredible. As shown below, while it took 40 months to make a new high following their pre-Financial Crisis peak, COVID only caused a five-month drought without a new high. From the low in April 2020, Retail Sales have bounced 50%!\n\n&gt; Even more impressive, though, is not only are total Retail Sales above their pre-COVID peak, but they are more than 17% above that peak just 14 months ago. The second chart shows the 14-month rate of change in Retail Sales since 1992. While the post-COVID decline was the steepest on record, the 14-month gain is the highest on record. Ironically, had it not been for COVID and the stimulus it resulted in, there is no way Retail Sales levels would be where they are now.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/Retail-Sales-14-months.png))**\n\n*****\n\n&gt; # Growth a Market Cap Story\n\n&gt; Last week, we repeatedly noted how there has been rotation back into growth-oriented sectors like Technology and Consumer Discretionary. For example, mega-cap names like Tesla (TSLA), Apple (AAPL), and Amazon (AMZN) have been some of the top performers in the second quarter whereas they were some of the worst performers in Q1. As a result of the strong performance of these names which all have heavy weights in the S&amp;P 500 Growth ETF (IVW), the ETF has undergone some notable price action over the past couple of weeks. At the start of April, IVW finally broke back above its 50-DMA after repeatedly failing to do so throughout March. Last week, that rally continued as the ETF also broke out above its February highs.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/041221-IVW.png)**\n\n&gt; That sort of strong technical picture is not true for all growth stocks though. Instead, it is more of a market cap story. The Russell 2,000 Growth ETF (IWO) has been stuck in a downtrend over the past few months with another failed attempt to change that last week. Whereas IVW is extremely overbought (at least two standard deviations above its 50-DMA) as of Friday's close, IWO is trading below its 50-DMA.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/041221-IWO.png)**\n\n&gt; In the chart below we show small-cap growth relative to large-cap growth through the ratio of IWO to IVW. Throughout the fall and winter, small-cap growth had been outpacing its large-cap peers as the ratio shot higher. But in mid-February, the ratio peaked and in the past month, it has more sharply pulled back as a rotation into large-cap growth has taken place. In fact, the ratio has fallen over 10% in the past month! As shown in the second chart below, there have not been many times since the two ETFs began trading in 2000 in which the ratio has fallen as sharply in such a span of time. The most recent instance was one year ago during and in the immediate aftermath of the bear market. Before that, it was almost a decade since the next most recent occurrence.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/041221-IWO-IVW.png)**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/041221-IWO-IVW-1M-Chg.png)**\n\n&gt; With just five prior occurrences, there is not a particularly large sample size for these types of moves, but returns have tended to be strong following past times that the ratio of IWO to IVW has fallen by at least 10 percentage points in a single month. For both ETFs, returns have been stronger than their relative norms over the following weeks and months. Small-cap growth has perhaps performed slightly better on average although that is due to smaller declines following the late 2000 instance. In other words, big outperformance of large-cap growth in the past has been generally good for growth stocks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/041221-IWO-IVW-Perf.png)**\n\n*****\n\n&gt; # Sell in May??? Post-Election-Year “Worst Months” Mixed\n\n&gt; Our Seasonal Switching Strategy, which is based upon the “Best Six Months” in conjunction with our MACD Technical Buy and Sell Signal signals, has a solid long-term track record of outperformance with potentially less risk compared to a buy and hold approach. Since 1950, DJIA’s average annual gain has been 8.5%. Over the same time period, DJIA has lost an average 0.7% during the “Worst Six Months,” May through October, and gained an average 8.8% during the “Best Six Months,” November through April.\n\n&gt; In post-election years, the historically worst performing year of the four-year cycle (page 130, STA 2021), the “Worst Months” have not been all that bad with more positive periods than negative, but average gains over the six or four month (NASDAQ’s Worst Months are July-October) period are still paltry. It is also worth noting that the one election year with a double-digit “Worst Months” S&amp;P 500 gain, 1980, was followed by a tough “Worst Months” in 1981 (shaded in light grey in table).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://www.stocktradersalmanac.com/UploadedImage/AIN_0521_20210415_Worst_Months_by_Election_Cycle_table.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending April 16th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=eyiCIE3-r7A))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 4.18.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NFLX** \n&gt; * **$KO** \n&gt; * **$JNJ** \n&gt; * **$CLF** \n&gt; * **$T** \n&gt; * **$PG** \n&gt; * **$SNAP** \n&gt; * **$ABT** \n&gt; * **$LMT** \n&gt; * **$IBM** \n&gt; * **$VZ** \n&gt; * **$INTC** \n&gt; * **$AAL** \n&gt; * **$UAL** \n&gt; * **$FCX** \n&gt; * **$LRCX** \n&gt; * **$PLD** \n&gt; * **$ASML** \n&gt; * **$ERIC** \n&gt; * **$HOG** \n&gt; * **$DHI** \n&gt; * **$NEE** \n&gt; * **$PM** \n&gt; * **$BMRC** \n&gt; * **$MTB** \n&gt; * **$HAL** \n&gt; * **$ANTM** \n&gt; * **$SLB** \n&gt; * **$CMG** \n&gt; * **$NUE** \n&gt; * **$STLD** \n&gt; * **$LUV** \n&gt; * **$ONB** \n&gt; * **$NDAQ** \n&gt; * **$EDU** \n&gt; * **$TRV** \n&gt; * **$ISRG** \n&gt; * **$CMA** \n&gt; * **$FHN** \n&gt; * **$KEY** \n&gt; * **$CCI** \n&gt; * **$AXP** \n&gt; * **$AN** \n&gt; * **$GNTY** \n&gt; * **$CCK**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/po0gflq.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/S1pKqwL.png))**\n###### **([CLICK HERE FOR THIS MONTH'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/IAo7GlZ.jpg))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/SnFSpnl.png))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 4.19.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/j8avW5c.png))\n\n&gt; # ***Monday 4.19.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/LL4z8Pi.png))\n\n*****\n\n&gt; # ***Tuesday  4.20.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7FM5dh1.png))\n\n&gt; # ***Tuesday 4.20.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/qMSF98e.png))\n\n*****\n\n&gt; # ***Wednesday 4.21.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jzM0cgh.png))\n\n&gt; # ***Wednesday 4.21.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FztoCal.png))\n\n*****\n\n&gt; # ***Thursday 4.22.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3jn4RTu.png))\n\n&gt; # ***Thursday 4.22.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/bivztrJ.png))\n\n*****\n\n&gt; # ***Friday 4.23.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/nh8sgYV.png))\n\n*****\n\n&gt; # ***Friday 4.23.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Netflix, Inc. $546.54\n**Netflix, Inc. (NFLX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $2.98 per share on revenue of $7.13 billion and the Earnings Whisper ® number is $3.04 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat The company's guidance was for earnings of approximately $2.97 per share. Consensus estimates are for year-over-year earnings growth of 89.81% with revenue increasing by 23.62%. The stock has drifted lower by 3.3% from its open following the earnings release to be 7.0% above its 200 day moving average of $510.91. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, April 7, 2021 there was some notable buying of 5,037 contracts of the $540.00 call and 5,032 contracts of the $540.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 7.3% move on earnings and the stock has averaged a 6.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NFLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Coca-Cola Company $53.68\n**Coca-Cola Company (KO)** is confirmed to report earnings at approximately 6:55 AM ET on Monday, April 19, 2021. The consensus earnings estimate is $0.50 per share on revenue of $8.57 billion and the Earnings Whisper ® number is $0.52 per share. Investor sentiment going into the company's earnings release has 48% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 1.96% with revenue decreasing by 0.36%. Short interest has increased by 38.6% since the company's last earnings release while the stock has drifted higher by 6.5% from its open following the earnings release to be 7.0% above its 200 day moving average of $50.17. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, April 15, 2021 there was some notable buying of 10,841 contracts of the $57.50 call expiring on Friday, September 17, 2021. Option traders are pricing in a 2.9% move on earnings and the stock has averaged a 1.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Johnson &amp; Johnson $162.24\n**Johnson &amp; Johnson (JNJ)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $2.31 per share on revenue of $21.99 billion and the Earnings Whisper ® number is $2.41 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 0.43% with revenue increasing by 6.28%. Short interest has increased by 21.1% since the company's last earnings release while the stock has drifted lower by 4.4% from its open following the earnings release to be 6.7% above its 200 day moving average of $152.11. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, April 13, 2021 there was some notable buying of 2,687 contracts of the $160.00 call expiring on Friday, May 21, 2021. Option traders are pricing in a 2.5% move on earnings and the stock has averaged a 2.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JNJ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cleveland-Cliffs Inc $17.99\n**Cleveland-Cliffs Inc (CLF)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, April 22, 2021. The consensus earnings estimate is $0.51 per share on revenue of $4.16 billion and the Earnings Whisper ® number is $0.36 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1,175.00% with revenue increasing by 1,058.45%. Short interest has decreased by 22.5% since the company's last earnings release while the stock has drifted higher by 10.0% from its open following the earnings release to be 62.0% above its 200 day moving average of $11.10. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 16, 2021 there was some notable buying of 5,991 contracts of the $22.00 call expiring on Friday, May 21, 2021. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CLF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # AT&amp;T Corp. $29.95\n**AT&amp;T Corp. (T)** is confirmed to report earnings at approximately 6:35 AM ET on Thursday, April 22, 2021. The consensus earnings estimate is $0.77 per share on revenue of $42.70 billion and the Earnings Whisper ® number is $0.78 per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 8.33% with revenue decreasing by 0.18%. The stock has drifted higher by 2.9% from its open following the earnings release to be 3.1% above its 200 day moving average of $29.05. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, April 7, 2021 there was some notable buying of 160,188 contracts of the $25.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 3.3% move on earnings and the stock has averaged a 3.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Procter &amp; Gamble Co. $137.25\n**Procter &amp; Gamble Co. (PG)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $1.19 per share on revenue of $17.96 billion and the Earnings Whisper ® number is $1.30 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1.71% with revenue increasing by 4.33%. Short interest has increased by 8.8% since the company's last earnings release while the stock has drifted higher by 3.6% from its open following the earnings release to be 2.5% above its 200 day moving average of $133.93. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, April 12, 2021 there was some notable buying of 10,373 contracts of the $145.00 call expiring on Friday, June 18, 2021. Option traders are pricing in a 3.2% move on earnings and the stock has averaged a 1.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Abbott $124.35\n**Abbott (ABT)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $1.33 per share on revenue of $10.73 billion and the Earnings Whisper ® number is $1.37 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 104.62% with revenue increasing by 38.88%. Short interest has increased by 37.2% since the company's last earnings release while the stock has drifted higher by 7.9% from its open following the earnings release to be 13.6% above its 200 day moving average of $109.50. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, April 15, 2021 there was some notable buying of 3,027 contracts of the $126.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 3.2% move on earnings and the stock has averaged a 1.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ABT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Snap Inc. $61.25\n**Snap Inc. (SNAP)** is confirmed to report earnings at approximately 4:10 PM ET on Thursday, April 22, 2021. The consensus estimate is for a loss of $0.05 per share on revenue of $742.04 million and the Earnings Whisper ® number is ($0.02) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat The company's guidance was for revenue of $720.00 million to $740.00 million. Consensus estimates are for year-over-year earnings growth of 37.50% with revenue increasing by 60.45%. The stock has drifted higher by 8.6% from its open following the earnings release to be 45.0% above its 200 day moving average of $42.23. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, April 15, 2021 there was some notable buying of 19,755 contracts of the $58.00 call expiring on Friday, May 7, 2021. Option traders are pricing in a 14.9% move on earnings and the stock has averaged a 16.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lockheed Martin Corp. $391.81\n**Lockheed Martin Corp. (LMT)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $6.32 per share on revenue of $16.41 billion and the Earnings Whisper ® number is $6.48 per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 3.95% with revenue increasing by 4.85%. Short interest has increased by 41.2% since the company's last earnings release while the stock has drifted higher by 15.6% from its open following the earnings release to be 7.7% above its 200 day moving average of $363.71. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 2.9% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # International Business Machines Corp. $133.59\n**International Business Machines Corp. (IBM)** is confirmed to report earnings at approximately 4:15 PM ET on Monday, April 19, 2021. The consensus earnings estimate is $1.67 per share on revenue of $17.38 billion and the Earnings Whisper ® number is $1.73 per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 9.24% with revenue decreasing by 1.09%. Short interest has increased by 9.8% since the company's last earnings release while the stock has drifted higher by 10.7% from its open following the earnings release to be 8.3% above its 200 day moving average of $123.31. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 6, 2021 there was some notable buying of 11,216 contracts of the $145.00 call expiring on Friday, June 18, 2021. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=IBM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great week ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning April 19th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/msqjpj/wall_street_week_ahead_for_the_trading_week/",
        "created": 1618694194.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619472124,
        "id": "mz8dsc",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Monday, April 26, 2021**\n\nThe stock traded mixed on Monday, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) continuing strong momentum from last week while the Dow Jones (DIA) modestly fell. Looking ahead, market participants are preparing for a slew of corporate earnings, new economic data, and the Federal Open Market Committee’s April meeting.\n\nThis week, a slew of huge companies are set to report corporate earnings for the first quarter of 2021. Altogether, the market caps of the companies reporting this week comprise nearly half the total market cap of the S&amp;P 500, according to FactSet. So far, the vast majority of companies have vastly exceeded analyst estimates, with effective vaccine distribution in the US helping stoke demand as the economy gradually reopens. \n\nEighty-four percent of the S&amp;P 500 companies that have reported first-quarter results to date posted a positive earnings per share surprise, according to data from FactSet. This would mark the highest percentage of companies reporting upside surprises since FactSet began tracking this metric in 2008, assuming this beat rate holds through the end of earnings season. \n\nLast week on Thursday, stocks sold off sharply following reports President Biden will propose almost doubling the capital gains tax rate for wealthy individuals earning $1 million or more per year to 39.6% to help pay for a slew of social programs and the proposed infrastructure bill. The new 39.6% rate would almost double the tax rate from the current base rate of 20%. However, the sharp bounce back we have seen suggests the initial sell-off was overdone. Kathy Jones, chief fixed income strategist at Charles Schwab said, “I think the immediate reaction was probably a bit overdone. These proposals come out and you never know, especially with tax proposals, where we'll end up. So it looks like an opening bid. I'm sure there will be intense lobbying from the investment community to adjust those numbers. But I think at the moment, when you have very high valuations in the market, anything that is bad news can spark a bit of a sell-off.\"\n\nThe Federal Open Market Committee (FOMC) will meet for its April meeting on Tuesday and Wednesday, with a monetary policy decision and press conference from Federal Reserve Chair Jerome Powell slated for Wednesday afternoon. With the Fed having already signaled that benchmark interest rates would remain on hold through at least 2023, market participants are expecting virtually no major changes to policy to be announced.\n\n**Highlights**\n\n* Tesla (TSLA) beat analyst expectations in their earnings report. The stock is modestly down at the time of writing\n   * Revenue of $10.39 billion vs $10.29 billion expected (up from $6 billion a year earlier)\n   * EPS of $0.93 vs $0.79 expected\n* MicroVision (MVIS) stock is up roughly 150% in the last week alone. The stock seems to have picked up a lot of momentum from the WallStreetBets crowd\n* The vaccinations effort continues with over 200 million Americans receiving at least one shot and 90 million adults fully vaccinated, according to data compiled by the CDC.\n* The Biden administration wants to spend $174 billion to boost electric vehicles and charging stations but its 2030 climate emissions reduction pledge released on Thursday does not include a firm date to phase out gasoline-powered vehicles. \"These autos are coming. We know it. It is the future,\" White House climate adviser Gina McCarthy said of EVs at an event in Washington promoting administration efforts to boost EV charging.\n* In the wake of the fatal crash of a Tesla car in Texas on Saturday, two U.S. senators have expressed concern about what they said may be an emerging pattern of safety concerns involving Tesla vehicles. \n* **\\*\\*Please note that current stock price was written in the morning and does not reflect intraday changes\\*\\***\n* Apple (AAPL) target raised by Morgan Stanley from $157 to $158 at Overweight. Stock currently around $134\n* AECOM (ACM) target raised by KeyCorp from $60 to $78 at Overweight. Stock currently around $67\n* Allstate (ALL) target raised by Raymond James from $135 to $140 at Strong-Buy\n* Ally Financial (ALLY) target raised by Morgan Stanley (MS) from $56 to $59 at Overweight. Stock currently around $49\n* Ametek (AME) target raised by Wells Fargo from $140 to $160 at Overweight. Stock currently around $135\n* Activision Blizzard (ATVI) target raised by Benchmark from $118 to $120 at Buy. Stock currently around $93\n* American Express (AXP) target raised by Oppenheimer from $128 to $165 at Outperform. Stock currently around $144\n* Burlington Stores (BURL) target raised by JP Morgan (JPM) from $315 to $380 at Overweight. Stock currently around $328\n* Chipotle (CMG) target raised by Stifel Nicolaus from $1550 to $1750 at Buy. Stock currently around $1468\n* Walt Disney (DIS) target raised by Wells Fargo (WFC) from $201 to $219 at Overweight. Stock currently around $183\n* Expedia (EXPE) target raised by Truist Securities from $170 to $237 at Buy. Stock currently around $177\n* Facebook (FB) target raised by Credit Suisse from $330 to $371 at Outperform. Stock currently around $301\n* FirstEnergy (FE) target raised by Morgan Stanley (MS) from $40 to $44 at Overweight. Stock currently around $37\n* Fortinet (FTNT) target raised by BTIG Research from $205 to $240 at Buy. Stock currently around $201\n* Alphabet (GOOG, $GOOGL) with three target raises. Stock currently around $2300\n   * Cannaccord Genuity from $2400 to $2600 at Buy\n   * KeyCorp from $2353 to $2625 at Overweight\n   * Mizuho from $2350 to $2600 at Buy\n* IQVIA (IQV) target raised by Barclays from $235 to $260 at Overweight. Stock currently around $232\n* The Lovesac (LOVE) target raised by Oppenheimer from $60 to $85 at Outperform. Stock currently around $70\n* Lam Research (LRCX) target raised by Citigroup from $660 to $750 at Buy. Stock currently around $627\n* Mastercard (MA) target raised by Morgan Stanley (MS) from $412 to $418 at Overweight. Stock currently around $387\n* Morgan Stanley (MS) target raised by Piper Sanlder from $82 to $87 at Neutral. Stock currently around $81\n* Quanta Services (PWR) target raised by KeyCorp from $90 to $115 at Overweight. Stock currently around $98\n* Paypal (PYPL) target raised by Rosenblatt Securities froim $320 to $350 at Buy. Stock currently around $266\n* Starbucks (SBUX) target raised by Oppenheimer from $122 to $135 at Outperform. Stock currently around $118\n* Square (SQ) target raised by Barclays from $330 to $340 at Overweight. Stock currently around $246\n* Tesla (TSLA) target raised by Mizuho from $775 to $820 at Buy. Stock currently around $730\n* Twitter (TWTR) target raised by Oppenheimer from $70 to $85 at Outperform. Stock currently around\n\n“Someone's sitting in the shade today because someone planted a tree a long time ago.”- Warren Buffet",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Monday, April 26, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mz8dsc/here_is_a_market_recap_for_today_monday_april_26/",
        "created": 1619500924.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1618604922,
        "id": "msbrms",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, April 16, 2021**\n\nStocks traded higher on Friday, continuing momentum from yesterday’s record-setting close, with a batch of better-than-expected economic and corporate earnings results fueling the recent rally. The S&amp;P 500 (SPY) and Dow Jones (DIA) set fresh intraday records while the tech-heavy Nasdaq (QQQ) traded mostly flat. \n\nAccording to a report by the US Department of Commerce, retail sales boomed 9.8% higher in the month of March as the economy continues to gradually reopen as more vaccines are distributed. Moreover, the Weekly Unemployment report showed first-time unemployment claims plunged far below analyst estimates. The Labor Department reported 576,000 new jobless claims for the week ending April 10. This represents the lowest total first-time unemployment claims filed since August 2020 and a sharp decline from both the previous week’s total of 769,000 and analyst expectations of 710,000. \n\nThis is great news on two fronts. First, consumer spending represents 70% of US GDP ([more info here](https://www.thebalance.com/components-of-gdp-explanation-formula-and-chart-3306015#:~:text=Consumer%20spending%20comprises%2070%25%20of,components%20of%20the%20U.S.%20economy.)) and is a key driver of economic growth. GDP is now expected to increase 6.5% in 2021 according to the Federal Open Market Committee, the central bank's monetary policy-making group. That is sharply higher than the 4.2% forecast made in December of 2020. Second, Jerome Powell and other FOMC members have reiterated that recovery in the labor market “remains uneven and far from complete”. To see a report blow so far past analyst expectation is a great sign the labor market is recovering in tandem with the surge in consumer spending. \n\nMichael Pearce, senior US economist for Capital Economics said of the consumer report, “What caught our eye was the 13.4% surge in spending on food and drink services, while clothing store sales were up by 18.1%. Relative to pre-pandemic levels, food and drink services sales are down just 5.1%, while clothing store sales are now higher than they were in February 2020. That suggests a combination of loosening restrictions and easing of virus fears linked to the vaccine rollout are driving a rapid return to normalcy.” \n\nDistribution of the Johnson and Johnson (JNJ) coronavirus vaccine remains paused in the US following reports of rare blood clots in people who received the vaccine. The agencies are reviewing data over six reported U.S. cases of a severe blood clot in individuals after receiving the vaccine, and have recommended the pause \"out of an abundance of caution,\" the FDA said in a Twitter post. To date, roughly 6.8 million doses of the single-dose JNJ vaccine have been administered. \n\n**Highlights**\n\n* General Motors (GM) and joint-venture partner LG Chem Ltd. plan to invest $2.3 billion to construct a second battery-cell plant as the automaker continues investing in electric vehicles.\n* Morgan Stanley (MS) posted better-than-expected earnings but revealed the company lost $911 million when Archegos Capital Management, Bill Hwang’s family office, imploded last month.\n* NIO is likely to make an official announcement concerning its European expansion plan on May 7 or 8 according to multiple reports. \n* Daimler AG unveiled a new high-tech and luxury all-electric Mercedes called the EQS\n* \\*\\***Please note that current stock price was written in the morning and does not reflect intraday changes\\*\\***\n* Applied Materials (AMAT) target raised by Deutsche Bank from $150 to $160 at Buy. Stock currently around $135\n* Amazon (AMZN) target raised by Credit Suisse from $3940 to $3950 at Outperform. Stock currently around $3379\n* ASML target raised by Wells Fargo from $610 to $750 at Overweight. Stock currently around $642\n* Bank of America (BAC) with two target raises. Stock currently around $39\n   * Robert W. Baird from $38 to $42 at Outperform\n   * Royal Bank of Canada from $37 to $44 at Outperform\n* Blackrock (BLK) target raised by Deutsche Bank from $847 to $912 at Buy. Stock currently around $818\n* Boyd Gaming (BYD) target raised by Deutsche Bank from $67 to $71 at Buy. Stock currently around $65\n* Chipotle (CMG) target raised by KeyCorp from $1625 to $1725 at Overweight. Stock currently around $1542\n* Cisco (CSCO) target raised by Morgan Stanley (MS) from $54 to $57 at Overweight. Stock currently around $51.60\n* Goldman Sachs (GS) target raised by BMO Capital Markets from $409 to $432 at Outperform. Stock currently around $338\n* Lam Research (LRCX) with two target raises. Stock currently around $650\n   * Deutsche Bank from $575 to $680 at Hold\n   * Credit Suisse from $650 to $750 at Outperform\n* Red Rock Resorts (RRR) target raised by Deutsche Bank from $34 to $41 at Buy. Stock currently around $34\n* Twitter (TWTR) target raised by Arhus from $72 to $82 at Buy. Stock currently around $72\n* UnitedHealth Group (UNH) with a host of target raises after handily beating earnings estimates. Consensus price target $420 at Outperform. Stock currently around $390\n\n*\"The future belongs to those who believe in the beauty of their dreams.\"* \\-Eleanor Roosevelt",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, April 16, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/msbrms/here_is_a_market_recap_for_today_friday_april_16/",
        "created": 1618633722.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1618952524,
        "id": "mv0bm9",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, April 20, 2021**\n\nStocks fell Tuesday, with all three major indexes dipping for the second straight session. Cyclical, travel and leisure stocks pulled back sharply while mega-cap tech stocks slid even as the 10-year Treasury yield edged lower.  \n\nDespite recent dips, the indexes remain near all-time highs, with the S&amp;P 500 (SPY) up roughly 10% year-to-date, so it’s not necessarily surprising the market beginning to pull back.  Ryan Detrick, chief market strategist for LPL Financial wrote in a note today, \"Many of our favorite sentiment gauges are becoming extremely bullish, which could be a near-term contrarian warning. The American Association of Individual Investors Sentiment Survey recently showed bulls outnumber bears by the most since January 2018.\"\n\nIn recent weeks, better-than-expected economic data in consumer spending and unemployment and strong performances by mega-cap stocks like Apple (AAPL), Microsoft (MSFT), and Google (GOOG, GOOGL) have driven the market higher. On the other hand, growth stocks and more speculative plays have pulled back sharply, extending a terrible run of performance in 2021. After hitting all-time highs near the middle of February, many growth stocks are down 30-50% from those levels. While it’s hard to pinpoint the exact factors why, we think (1) elevated Treasury yields compared to 12 months ago, (2) inflationary fears, (3) profit-taking after an incredible run in 2020, and (4) investor rotation to safer assets are all impacting growth stocks to the downside. \n\nLooking ahead, market participants will continue to monitor earnings season to gauge if corporate profits are growing in tandem with the recovering economy. Roughly 9% of companies in the SPY have reported, with 81% beating expectation. At the time of writing, Netflix (NFLX) just reported a sharp miss in new paying subscribers added (+3.98 million vs. +6.29 million expected), causing the stock to plummet 10% in after-hours. This is likely to have negative implications for market performance tomorrow.\n\nWhite House chief medical advisor Dr. Anthony Fauci said he believes the U.S. will likely resume use of the Johnson &amp; Johnson Covid-19 vaccine as soon as Friday with a warning or restriction attached. The doctor said, “My estimate is that we will continue to use it in some form. I doubt very seriously if they just cancel it. I don’t think that’s going to happen. I do think that there will likely be some sort of warning or restriction or risk assessment. I don’t think it’s just going to go back and say, ‘Okay, everything’s fine. Go right back.’ I think it’ll likely say, ‘Okay, we’re going to use it, but be careful under these certain circumstances.”\n\n**Highlights**\n\n* Chat startup Discord Inc. has halted talks to sell itself to potential suitors including Microsoft (MSFT), according to people familiar with the matter, as it resumes interest in a potential initial public offering down the line.\n* Senior executives with Alphabet's Google and Apple will testify on Wednesday about antitrust concerns related to their app stores along with executives of three companies which rely on those online stores, the leaders of the Senate Judiciary Committee's antitrust panel said on Monday.\n* The U.S. Consumer Product Safety Commission issued a warning Saturday advising consumers to stop using Peloton (PTON) Interactive's treadmill if there are small children or pets at home. The warning comes after a small child died in March during a treadmill accident. This could affect the company's product-safety profile, a material category for the household and personal-goods sector, according to the Sustainability Accounting Standards Board. The stock pulled back sharply\n* The U.K. government said it would probe Nvidia Corp.'s $40 billion deal to buy British chip-designer Arm from SoftBank Group Corp., over possible national security issues, adding new regulatory scrutiny to the proposed deal.\n* **\\*\\*Please note current stock price was written premarket and does not reflect intraday movement\\*\\***\n* Allegiant Travel (ALGT) from $250 to $285 at Buy. Stock currently around $231\n* Coupa Software (COUP target raised by Piper Sandler from $300 to $315 at Overweight. Stock currently around \n* IBM with a host of target raises. Consensus price target around $150 at Buy. Stock currently around $138\n* UnitedHealth Group target raised by Truist Securities from $420 to $450 at Buy. Stock currently around $397\n* Square (SQ) target raised by Barclays from $330 to $340 at Overweight. Stock currently around $243\n* Raytheon Technologies (RTX) target raised by Credit Suisse from $81 to $90 at Outperform. Stock currently around $77\n* Paypal (PYPL) target raised by Rosenblatt Securities from $320 to $350 at Buy. \n* Morgan Stanley (MS) target raised by Piper Sandler from $82 to $87 at Neutral. Stock currently around $77\n* Lam Research (LRCX) target raised by Cowen from $585 to $700 at Outperform. Stock currently around $612\n\nThe four most dangerous words in investing are: this time is different.” - John Templeton",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Tuesday, April 20, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mv0bm9/here_is_a_market_recap_for_today_tuesday_april_20/",
        "created": 1618981324.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1618604953,
        "id": "msbrz1",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, April 16, 2021**\n\nStocks traded higher on Friday, continuing momentum from yesterday’s record-setting close, with a batch of better-than-expected economic and corporate earnings results fueling the recent rally. The S&amp;P 500 (SPY) and Dow Jones (DIA) set fresh intraday records while the tech-heavy Nasdaq (QQQ) traded mostly flat. \n\nAccording to a report by the US Department of Commerce, retail sales boomed 9.8% higher in the month of March as the economy continues to gradually reopen as more vaccines are distributed. Moreover, the Weekly Unemployment report showed first-time unemployment claims plunged far below analyst estimates. The Labor Department reported 576,000 new jobless claims for the week ending April 10. This represents the lowest total first-time unemployment claims filed since August 2020 and a sharp decline from both the previous week’s total of 769,000 and analyst expectations of 710,000. \n\nThis is great news on two fronts. First, consumer spending represents 70% of US GDP ([more info here](https://www.thebalance.com/components-of-gdp-explanation-formula-and-chart-3306015#:~:text=Consumer%20spending%20comprises%2070%25%20of,components%20of%20the%20U.S.%20economy.)) and is a key driver of economic growth. GDP is now expected to increase 6.5% in 2021 according to the Federal Open Market Committee, the central bank's monetary policy-making group. That is sharply higher than the 4.2% forecast made in December of 2020. Second, Jerome Powell and other FOMC members have reiterated that recovery in the labor market “remains uneven and far from complete”. To see a report blow so far past analyst expectation is a great sign the labor market is recovering in tandem with the surge in consumer spending. \n\nMichael Pearce, senior US economist for Capital Economics said of the consumer report, “What caught our eye was the 13.4% surge in spending on food and drink services, while clothing store sales were up by 18.1%. Relative to pre-pandemic levels, food and drink services sales are down just 5.1%, while clothing store sales are now higher than they were in February 2020. That suggests a combination of loosening restrictions and easing of virus fears linked to the vaccine rollout are driving a rapid return to normalcy.” \n\nDistribution of the Johnson and Johnson (JNJ) coronavirus vaccine remains paused in the US following reports of rare blood clots in people who received the vaccine. The agencies are reviewing data over six reported U.S. cases of a severe blood clot in individuals after receiving the vaccine, and have recommended the pause \"out of an abundance of caution,\" the FDA said in a Twitter post. To date, roughly 6.8 million doses of the single-dose JNJ vaccine have been administered. \n\n**Highlights**\n\n* General Motors (GM) and joint-venture partner LG Chem Ltd. plan to invest $2.3 billion to construct a second battery-cell plant as the automaker continues investing in electric vehicles.\n* Morgan Stanley (MS) posted better-than-expected earnings but revealed the company lost $911 million when Archegos Capital Management, Bill Hwang’s family office, imploded last month.\n* NIO is likely to make an official announcement concerning its European expansion plan on May 7 or 8 according to multiple reports. \n* Daimler AG unveiled a new high-tech and luxury all-electric Mercedes called the EQS\n* \\*\\***Please note that current stock price was written in the morning and does not reflect intraday changes\\*\\***\n* Applied Materials (AMAT) target raised by Deutsche Bank from $150 to $160 at Buy. Stock currently around $135\n* Amazon (AMZN) target raised by Credit Suisse from $3940 to $3950 at Outperform. Stock currently around $3379\n* ASML target raised by Wells Fargo from $610 to $750 at Overweight. Stock currently around $642\n* Bank of America (BAC) with two target raises. Stock currently around $39\n   * Robert W. Baird from $38 to $42 at Outperform\n   * Royal Bank of Canada from $37 to $44 at Outperform\n* Blackrock (BLK) target raised by Deutsche Bank from $847 to $912 at Buy. Stock currently around $818\n* Boyd Gaming (BYD) target raised by Deutsche Bank from $67 to $71 at Buy. Stock currently around $65\n* Chipotle (CMG) target raised by KeyCorp from $1625 to $1725 at Overweight. Stock currently around $1542\n* Cisco (CSCO) target raised by Morgan Stanley (MS) from $54 to $57 at Overweight. Stock currently around $51.60\n* Goldman Sachs (GS) target raised by BMO Capital Markets from $409 to $432 at Outperform. Stock currently around $338\n* Lam Research (LRCX) with two target raises. Stock currently around $650\n   * Deutsche Bank from $575 to $680 at Hold\n   * Credit Suisse from $650 to $750 at Outperform\n* Red Rock Resorts (RRR) target raised by Deutsche Bank from $34 to $41 at Buy. Stock currently around $34\n* Twitter (TWTR) target raised by Arhus from $72 to $82 at Buy. Stock currently around $72\n* UnitedHealth Group (UNH) with a host of target raises after handily beating earnings estimates. Consensus price target $420 at Outperform. Stock currently around $390\n\n*\"The future belongs to those who believe in the beauty of their dreams.\"* \\-Eleanor Roosevelt",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, April 16, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/msbrz1/here_is_a_market_recap_for_today_friday_april_16/",
        "created": 1618633753.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1618665184,
        "id": "msqhr7",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning April 19th, 2021.\n\n# **Concerns over inflationary pressure on earnings will test stocks in the week ahead - [(Source)](https://www.cnbc.com/2021/04/16/investors-look-for-hints-of-inflation-in-earnings-in-the-week-ahead.html)**\n*****\n&gt; Earnings will be the major focus for investors in the week ahead, as they home in on whether rising costs are squeezing margins and signaling a build in inflationary pressures.\n*****\n&gt; From Coca-Cola and IBM to Johnson &amp; Johnson and Netflix, investors will hear from a broad swath of corporate America.\n*****\n&gt; So far, with one week in, companies are beating earnings estimates by a wide margin of more than 84%, according to Refinitiv.\n*****\n&gt; This three-month period is the first to be compared to year earlier profits that were affected by the pandemic. Profit growth for the S&amp;P 500 is a stunning 30.2% for the quarter so far, based on actual reports and estimates.\n*****\n&gt; That makes it the best three-month period since the third quarter of 2010, according to FactSet.\n*****\n&gt; # Signs of margin pressures?\n&gt; Major banks, like JPMorgan Chase, Goldman Sachs and Bank of America reported better than expected profits in the past week.\n*****\n&gt; The S&amp;P 500 ended the week at a record high of 4,185, a gain of 1.4%. The Dow, higher for a fourth week, gained 1.2 to end the week at a record 34,200. Nasdaq gained 1.1% for the week, finishing at 14,052.\n*****\n&gt; Utilities was the best performing major S&amp;P sector, gaining 3.7%, followed by materials, up 3.2% and health care, up 2.9%. Technology was up 1%. Financials were up 0.7%, while industrials were up 0.6%.\n*****\n&gt; Lori Calvasina, head of U.S. equity strategy at RBC, said she is watching the coming week’s earnings for signs of margin pressures from higher commodity prices, supply chain issues and other cost factors.\n*****\n&gt; “Those big forces that are threatening margins right now don’t really apply to financials. They apply more to industrial companies, the material companies and consumer companies,” she said.\n*****\n&gt; “I think [sectors] like the industrials will give you color on margins,” Calvasina added. “Margins really are the big question mark going forward. I’m definitely watching and listening to see what companies are going to say about taxes.”\n*****\n&gt; President Joe Biden has proposed raising corporate taxes to 28% from 21% to help pay for his infrastructure plan.\n*****\n&gt; While the fate of the tax hike is still not clear, the increase in other costs is apparent. Fuel costs have risen sharply with a 30% rise in oil prices since the beginning of the year. Lumber prices in the futures market are at an all-time high and copper futures are up about 17% year-to-date.\n*****\n&gt; Calvasina said companies face a headwind and a tailwind.\n*****\n&gt; “Companies are saying we found new ways to cut costs. When revenues come back, margins are going to explode to the upside,” she said. “Some of the Covid-related costs will come down. Those are some of the positives.”\n*****\n&gt; But not every company will see those benefits. “We could start to see wage pressures come back. Rising commodity costs — increases in PPI and increases in CPI — those are negatives for margins,” Calvasina said, referring to the producer price and consumer price indexes.\n*****\n&gt; # Searching for hints of inflation\n&gt; Peter Boockvar, chief investment officer at Bleakley Advisory Group, said he is also watching the margin comments carefully for impact on individual stocks, but also for what they broadly say about inflation seeping into the economy.\n*****\n&gt; “What’s going to be the most interesting thing about earnings are profit margins. Some companies are going to get squeezed because they’re going to see price increases and others aren’t because they can pass it on,” said Boockvar.\n*****\n&gt; He said he will pay close attention to whether the semiconductor shortage is showing up in tech companies’ earnings. Automakers have already taken a hit and have scaled back production due to the lack of chips.\n*****\n&gt; The CPI for March showed a pick-up in headline inflation to 2.6% year-over-year. A 9.1% jump in gasoline prices contributed to the gain.\n*****\n&gt; Some of the gains in inflation this spring are expected to be temporary because of the comparison to very low levels last year when the economy was shutdown.\n*****\n&gt; Other than earnings, the week should be fairly quiet. Federal Reserve speakers have taken a hiatus and are in a blackout period ahead of the late April meeting.\n*****\n&gt; “It’s really going to be attention shifting to earnings and the inflation story,” said Boockvar.\n*****\n&gt; # Economic rebound\n&gt; In the past week, economic reports underscored how strong the economic momentum could be in the second quarter. Retail sales for March were up nearly 10%, and jobless claims were the lowest of the recovery.\n*****\n&gt; There is little data in the week ahead, aside from PMI manufacturing and services data Friday. But the markets will keep a close eye on unemployment figures after Thursday’s report of 576,000 new claims — the lowest level since the early days of the pandemic.\n*****\n&gt; “The large claims decline suggests that job separation rates may finally be normalizing, a good sign for April payrolls,” note Barclays economists. A surprise 916,000 jobs were added in March, and economists have said they now expect a string of reports showing payrolls are up by 1 million or more.\n*****\n&gt; However, Stephen Stanley, chief economist at Amherst Pierpont, says it may be too early to read too much into the claims data, and the coming week’s report will be important.\n*****\n&gt; He said the drop in claims was driven by sharp drops in a number of states, including more than half in California and even larger percentage declines in Kentucky and Virginia.\n*****\n&gt; “Unfortunately, I have no confidence that these moves won’t be at least partially reversed next week,” he wrote. “Continuing claims in the special pandemic programs continue to seesaw up and down every week, with the latest reading, for the period ended March 27, being a down week.”\n*****\n&gt; # Watching bonds\n&gt; Stock investors will also be watching the bond market, where yields declined in the past week and then reversed. The 10-year Treasury was at 1.59% Friday, after tumbling sharply on Thursday.\n*****\n&gt; Yields move opposite price, and the 10-year is the most widely watched bond security, as it impacts mortgage rates and other loans.\n*****\n&gt; “The 10-year will now trade in the 1.50% to 1.75% trading range,” said Boockvar.\n*****\n&gt; “It’ll break below that if inflation is transitory and it will break above if it’s proven to be otherwise,” he added. “I think we priced in the last inflation stats and then we’ll take into account what the real world is saying, from companies.”\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/c7J5krZ.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/lhy7AaR.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/UW7ZbbU.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/uom4C2h.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/l0cX2LH.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/jpa2DZe.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PgmZlAV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/3Rugxjf.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/gmHwRAL.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/po0gflq.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/j0oHK6M.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/jJcd0lq.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/qX9lwYh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/Jvf27dw.png))**\n\n*****\n\n&gt; # Four Reasons The Future Looks Bright For The Bulls\n\n&gt; “I look to the future because that’s where I’m going to spend the rest of my life.” George Burns\n\n&gt; The bull market continues, with the S&amp;P 500 Index now up more than 10% in 2021. With stocks up more than 80% from the March 2020 lows, the reality is a well-deserved break or consolidation could happen at any time. Looking to the future, as George Burns said above, we would be a buyer of any material weakness, as we believe this bull market is alive and well as we’ll discuss more in this blog.\n\n&gt; Here are four bullish stats we’ve found recently that indeed suggest this bull market could still have plenty of life left.\n\n&gt; First, the S&amp;P 500 Index was up just under 6% in the first quarter, an area we’d call the sweet spot. Looking back since 1950, when the S&amp;P 500 was up between 5-10% in the first quarter, the rest of the year (so the final three quarters) gained another 12.4% on average and was higher 86.7% of the time. Compare this to when the S&amp;P 500 was up &gt;10% in the first quarter and the returns drop to 6.5% the rest of the year. Lastly, if the first quarter was negative, then the rest of the year was up only 3%. Sweet spot indeed.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.14.21-Blog-Chart-2.png?ssl=1))**\n\n&gt; Second, the December Low Indicator has bulls smiling. This was created by Lucien Hooper, a Forbes columnist in the 1970s, and it simply says that if the S&amp;P 500 closes beneath the December low during the first quarter then future weakness could be in the cards. But if this critical level holds, then higher prices could be around the corner.\n\n&gt; As the LPL Chart of the Day shows, stocks held above the December lows in 2021 and this could mean continued higher prices, as the S&amp;P 500 was up more than 18% on average previous years when this level held and incredibly was higher 33 out of 35 years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.14.21-Blog-CHart-3.png?ssl=1))**\n\n&gt; Third, the S&amp;P 500 was up nearly 54% in the 12 months ending March 2021, one of the largest yearly gains ever. Looking at previous times that had significant 12-month returns shows the potential for weak returns 1, 3, and 6 months later. This makes sense, as stocks could need some time to catch their breath. The good news? One year later the S&amp;P 500 was higher more than 90% of the time, with only the year after the 1987 crash in the red. “It might seem counterintuitive to most investors, but big rallies like we’ve seen tend to mark the start of bull markets, not the end, so we wouldn’t bet on this bull market ending anytime soon,” explained LPL Financial Chief Market Strategist Ryan Detrick.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.14.21-Blog-CHart-4.png?ssl=1))**\n\n&gt; Lastly, overall market breadth is extremely strong. Again, this could suggest near-term there could be an exhaustion point, but this isn’t what you see at the end of bull markets, in fact, it tends to usually happen at the start of new bull markets. Currently, more than 95% of the components in the S&amp;P 500 are above their 200-day moving average, a level only seen two other times, in December 2003 and September 2009. Looking back at 2004 and 2010, 2004 saw consolidation a good part of the year, while 2010 had a well-deserved 16% correction after the huge gains off the March 2009 lows. But the key point is after extreme market breadth like we are seeing now, overall higher prices and the bull market lasted for many more years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.14.21-Blog-Chart-5.png?ssl=1))**\n\n&gt; Looking to the future, as George Burns said, we believe it could be a bright one for equity investors, particularly when we consider the return potential for stocks compared to cash and high-quality bonds.\n\n*****\n\n&gt; # B.I.G. Tips - Boom Goes the Retail Sales\n\n&gt; After a lousy report for the month of February when freak weather across the south temporarily shut down several areas of the south, Retail Sales bounced back with a vengeance in March as vaccine rollouts accelerated and stimulus checks were spent.\n\n&gt; The moves higher in Retail Sales over the last few months have been incredible. As shown below, while it took 40 months to make a new high following their pre-Financial Crisis peak, COVID only caused a five-month drought without a new high. From the low in April 2020, Retail Sales have bounced 50%!\n\n&gt; Even more impressive, though, is not only are total Retail Sales above their pre-COVID peak, but they are more than 17% above that peak just 14 months ago. The second chart shows the 14-month rate of change in Retail Sales since 1992. While the post-COVID decline was the steepest on record, the 14-month gain is the highest on record. Ironically, had it not been for COVID and the stimulus it resulted in, there is no way Retail Sales levels would be where they are now.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/Retail-Sales-14-months.png))**\n\n*****\n\n&gt; # Growth a Market Cap Story\n\n&gt; Last week, we repeatedly noted how there has been rotation back into growth-oriented sectors like Technology and Consumer Discretionary. For example, mega-cap names like Tesla (TSLA), Apple (AAPL), and Amazon (AMZN) have been some of the top performers in the second quarter whereas they were some of the worst performers in Q1. As a result of the strong performance of these names which all have heavy weights in the S&amp;P 500 Growth ETF (IVW), the ETF has undergone some notable price action over the past couple of weeks. At the start of April, IVW finally broke back above its 50-DMA after repeatedly failing to do so throughout March. Last week, that rally continued as the ETF also broke out above its February highs.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/041221-IVW.png)**\n\n&gt; That sort of strong technical picture is not true for all growth stocks though. Instead, it is more of a market cap story. The Russell 2,000 Growth ETF (IWO) has been stuck in a downtrend over the past few months with another failed attempt to change that last week. Whereas IVW is extremely overbought (at least two standard deviations above its 50-DMA) as of Friday's close, IWO is trading below its 50-DMA.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/041221-IWO.png)**\n\n&gt; In the chart below we show small-cap growth relative to large-cap growth through the ratio of IWO to IVW. Throughout the fall and winter, small-cap growth had been outpacing its large-cap peers as the ratio shot higher. But in mid-February, the ratio peaked and in the past month, it has more sharply pulled back as a rotation into large-cap growth has taken place. In fact, the ratio has fallen over 10% in the past month! As shown in the second chart below, there have not been many times since the two ETFs began trading in 2000 in which the ratio has fallen as sharply in such a span of time. The most recent instance was one year ago during and in the immediate aftermath of the bear market. Before that, it was almost a decade since the next most recent occurrence.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/041221-IWO-IVW.png)**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/041221-IWO-IVW-1M-Chg.png)**\n\n&gt; With just five prior occurrences, there is not a particularly large sample size for these types of moves, but returns have tended to be strong following past times that the ratio of IWO to IVW has fallen by at least 10 percentage points in a single month. For both ETFs, returns have been stronger than their relative norms over the following weeks and months. Small-cap growth has perhaps performed slightly better on average although that is due to smaller declines following the late 2000 instance. In other words, big outperformance of large-cap growth in the past has been generally good for growth stocks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/04/041221-IWO-IVW-Perf.png)**\n\n*****\n\n&gt; # Sell in May??? Post-Election-Year “Worst Months” Mixed\n\n&gt; Our Seasonal Switching Strategy, which is based upon the “Best Six Months” in conjunction with our MACD Technical Buy and Sell Signal signals, has a solid long-term track record of outperformance with potentially less risk compared to a buy and hold approach. Since 1950, DJIA’s average annual gain has been 8.5%. Over the same time period, DJIA has lost an average 0.7% during the “Worst Six Months,” May through October, and gained an average 8.8% during the “Best Six Months,” November through April.\n\n&gt; In post-election years, the historically worst performing year of the four-year cycle (page 130, STA 2021), the “Worst Months” have not been all that bad with more positive periods than negative, but average gains over the six or four month (NASDAQ’s Worst Months are July-October) period are still paltry. It is also worth noting that the one election year with a double-digit “Worst Months” S&amp;P 500 gain, 1980, was followed by a tough “Worst Months” in 1981 (shaded in light grey in table).\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://www.stocktradersalmanac.com/UploadedImage/AIN_0521_20210415_Worst_Months_by_Election_Cycle_table.jpg))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending April 16th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=eyiCIE3-r7A))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 4.18.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$NFLX** \n&gt; * **$KO** \n&gt; * **$JNJ** \n&gt; * **$CLF** \n&gt; * **$T** \n&gt; * **$PG** \n&gt; * **$SNAP** \n&gt; * **$ABT** \n&gt; * **$LMT** \n&gt; * **$IBM** \n&gt; * **$VZ** \n&gt; * **$INTC** \n&gt; * **$AAL** \n&gt; * **$UAL** \n&gt; * **$FCX** \n&gt; * **$LRCX** \n&gt; * **$PLD** \n&gt; * **$ASML** \n&gt; * **$ERIC** \n&gt; * **$HOG** \n&gt; * **$DHI** \n&gt; * **$NEE** \n&gt; * **$PM** \n&gt; * **$BMRC** \n&gt; * **$MTB** \n&gt; * **$HAL** \n&gt; * **$ANTM** \n&gt; * **$SLB** \n&gt; * **$CMG** \n&gt; * **$NUE** \n&gt; * **$STLD** \n&gt; * **$LUV** \n&gt; * **$ONB** \n&gt; * **$NDAQ** \n&gt; * **$EDU** \n&gt; * **$TRV** \n&gt; * **$ISRG** \n&gt; * **$CMA** \n&gt; * **$FHN** \n&gt; * **$KEY** \n&gt; * **$CCI** \n&gt; * **$AXP** \n&gt; * **$AN** \n&gt; * **$GNTY** \n&gt; * **$CCK**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/po0gflq.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/S1pKqwL.png))**\n###### **([CLICK HERE FOR THIS MONTH'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/IAo7GlZ.jpg))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/SnFSpnl.png))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 4.19.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/j8avW5c.png))\n\n&gt; # ***Monday 4.19.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/LL4z8Pi.png))\n\n*****\n\n&gt; # ***Tuesday  4.20.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7FM5dh1.png))\n\n&gt; # ***Tuesday 4.20.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/qMSF98e.png))\n\n*****\n\n&gt; # ***Wednesday 4.21.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jzM0cgh.png))\n\n&gt; # ***Wednesday 4.21.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/FztoCal.png))\n\n*****\n\n&gt; # ***Thursday 4.22.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/3jn4RTu.png))\n\n&gt; # ***Thursday 4.22.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/bivztrJ.png))\n\n*****\n\n&gt; # ***Friday 4.23.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/nh8sgYV.png))\n\n*****\n\n&gt; # ***Friday 4.23.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Netflix, Inc. $546.54\n**Netflix, Inc. (NFLX)** is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $2.98 per share on revenue of $7.13 billion and the Earnings Whisper ® number is $3.04 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat The company's guidance was for earnings of approximately $2.97 per share. Consensus estimates are for year-over-year earnings growth of 89.81% with revenue increasing by 23.62%. The stock has drifted lower by 3.3% from its open following the earnings release to be 7.0% above its 200 day moving average of $510.91. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, April 7, 2021 there was some notable buying of 5,037 contracts of the $540.00 call and 5,032 contracts of the $540.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 7.3% move on earnings and the stock has averaged a 6.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=NFLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Coca-Cola Company $53.68\n**Coca-Cola Company (KO)** is confirmed to report earnings at approximately 6:55 AM ET on Monday, April 19, 2021. The consensus earnings estimate is $0.50 per share on revenue of $8.57 billion and the Earnings Whisper ® number is $0.52 per share. Investor sentiment going into the company's earnings release has 48% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 1.96% with revenue decreasing by 0.36%. Short interest has increased by 38.6% since the company's last earnings release while the stock has drifted higher by 6.5% from its open following the earnings release to be 7.0% above its 200 day moving average of $50.17. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, April 15, 2021 there was some notable buying of 10,841 contracts of the $57.50 call expiring on Friday, September 17, 2021. Option traders are pricing in a 2.9% move on earnings and the stock has averaged a 1.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=KO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Johnson &amp; Johnson $162.24\n**Johnson &amp; Johnson (JNJ)** is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $2.31 per share on revenue of $21.99 billion and the Earnings Whisper ® number is $2.41 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 0.43% with revenue increasing by 6.28%. Short interest has increased by 21.1% since the company's last earnings release while the stock has drifted lower by 4.4% from its open following the earnings release to be 6.7% above its 200 day moving average of $152.11. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, April 13, 2021 there was some notable buying of 2,687 contracts of the $160.00 call expiring on Friday, May 21, 2021. Option traders are pricing in a 2.5% move on earnings and the stock has averaged a 2.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JNJ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Cleveland-Cliffs Inc $17.99\n**Cleveland-Cliffs Inc (CLF)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, April 22, 2021. The consensus earnings estimate is $0.51 per share on revenue of $4.16 billion and the Earnings Whisper ® number is $0.36 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1,175.00% with revenue increasing by 1,058.45%. Short interest has decreased by 22.5% since the company's last earnings release while the stock has drifted higher by 10.0% from its open following the earnings release to be 62.0% above its 200 day moving average of $11.10. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, April 16, 2021 there was some notable buying of 5,991 contracts of the $22.00 call expiring on Friday, May 21, 2021. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 5.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CLF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # AT&amp;T Corp. $29.95\n**AT&amp;T Corp. (T)** is confirmed to report earnings at approximately 6:35 AM ET on Thursday, April 22, 2021. The consensus earnings estimate is $0.77 per share on revenue of $42.70 billion and the Earnings Whisper ® number is $0.78 per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 8.33% with revenue decreasing by 0.18%. The stock has drifted higher by 2.9% from its open following the earnings release to be 3.1% above its 200 day moving average of $29.05. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, April 7, 2021 there was some notable buying of 160,188 contracts of the $25.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 3.3% move on earnings and the stock has averaged a 3.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Procter &amp; Gamble Co. $137.25\n**Procter &amp; Gamble Co. (PG)** is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $1.19 per share on revenue of $17.96 billion and the Earnings Whisper ® number is $1.30 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1.71% with revenue increasing by 4.33%. Short interest has increased by 8.8% since the company's last earnings release while the stock has drifted higher by 3.6% from its open following the earnings release to be 2.5% above its 200 day moving average of $133.93. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, April 12, 2021 there was some notable buying of 10,373 contracts of the $145.00 call expiring on Friday, June 18, 2021. Option traders are pricing in a 3.2% move on earnings and the stock has averaged a 1.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=PG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Abbott $124.35\n**Abbott (ABT)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $1.33 per share on revenue of $10.73 billion and the Earnings Whisper ® number is $1.37 per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 104.62% with revenue increasing by 38.88%. Short interest has increased by 37.2% since the company's last earnings release while the stock has drifted higher by 7.9% from its open following the earnings release to be 13.6% above its 200 day moving average of $109.50. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, April 15, 2021 there was some notable buying of 3,027 contracts of the $126.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 3.2% move on earnings and the stock has averaged a 1.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ABT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Snap Inc. $61.25\n**Snap Inc. (SNAP)** is confirmed to report earnings at approximately 4:10 PM ET on Thursday, April 22, 2021. The consensus estimate is for a loss of $0.05 per share on revenue of $742.04 million and the Earnings Whisper ® number is ($0.02) per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat The company's guidance was for revenue of $720.00 million to $740.00 million. Consensus estimates are for year-over-year earnings growth of 37.50% with revenue increasing by 60.45%. The stock has drifted higher by 8.6% from its open following the earnings release to be 45.0% above its 200 day moving average of $42.23. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, April 15, 2021 there was some notable buying of 19,755 contracts of the $58.00 call expiring on Friday, May 7, 2021. Option traders are pricing in a 14.9% move on earnings and the stock has averaged a 16.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SNAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Lockheed Martin Corp. $391.81\n**Lockheed Martin Corp. (LMT)** is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $6.32 per share on revenue of $16.41 billion and the Earnings Whisper ® number is $6.48 per share. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 3.95% with revenue increasing by 4.85%. Short interest has increased by 41.2% since the company's last earnings release while the stock has drifted higher by 15.6% from its open following the earnings release to be 7.7% above its 200 day moving average of $363.71. Overall earnings estimates have been revised lower since the company's last earnings release. Option traders are pricing in a 2.9% move on earnings and the stock has averaged a 2.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # International Business Machines Corp. $133.59\n**International Business Machines Corp. (IBM)** is confirmed to report earnings at approximately 4:15 PM ET on Monday, April 19, 2021. The consensus earnings estimate is $1.67 per share on revenue of $17.38 billion and the Earnings Whisper ® number is $1.73 per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 9.24% with revenue decreasing by 1.09%. Short interest has increased by 9.8% since the company's last earnings release while the stock has drifted higher by 10.7% from its open following the earnings release to be 8.3% above its 200 day moving average of $123.31. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, April 6, 2021 there was some notable buying of 11,216 contracts of the $145.00 call expiring on Friday, June 18, 2021. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 4.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=IBM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great week ahead r/StockMarket.",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning April 19th, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/msqhr7/wall_street_week_ahead_for_the_trading_week/",
        "created": 1618693984.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619037959,
        "id": "mvp0uf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Wednesday, April 21, 2021**\n\nStocks reversed on Monday, rising on Wednesday for the first day in three sessions, with small-caps leading the way after a terrible run of performance in April. Despite Netflix (NFLX) sharply missing earnings expectations in terms of new paid subscribers, the tech-heavy Nasdaq (QQQ), while the Dow Jones (DIA) and S&amp;P 500 (SPY) remain near record levels. \n\nAfter a recent spike this week, the CBOE Volatility Index sank back to near 52-week lows, a sign that investor risk appetite is increasing. The VIX is known as the \"investor fear gauge,\" because it reflects investors' best predictions of near-term market volatility or risk. In general, the VIX rises during times of financial stress and falls during good economic times. David Kostin, chief US equity strategist at Goldman Sachs said, “The S&amp;P 500 has reached new highs while volatility has sharply declined. Low volatility has outweighed low correlations among stocks, driving return dispersion back below the long-term average. As the U.S. moves beyond key macro events such as the 2020 election, the $1.9 trillion fiscal stimulus package, and peak economic activity, we expect three defining themes for markets will be tax reform, infrastructure, and pricing power.”\n\nWhile Netflix (NFLX) sharply missed estimates, this earnings season has largely blown consensus estimates out of the water, with more than 81% of companies that have reported so far beating earnings expectations, according to a study by FactSet. However, despite the largely positive earnings, many stocks (apart from today) have failed to react positively to the news. It seems as more positive economic data is released in terms of consumer spending and unemployment, it takes more and more impressive results to convince investors to pile into the stock. This suggests there is froth in the markets given the sky-high valuation of some companies. \n\nWhite House chief medical advisor Dr. Anthony Fauci said he believes the U.S. will likely resume use of the Johnson &amp; Johnson Covid-19 vaccine as soon as Friday with a warning or restriction attached. The doctor said, “My estimate is that we will continue to use it in some form. I doubt very seriously if they just cancel it. I don’t think that’s going to happen. I do think that there will likely be some sort of warning or restriction or risk assessment. I don’t think it’s just going to go back and say, ‘Okay, everything’s fine. Go right back.’ I think it’ll likely say, ‘Okay, we’re going to use it, but be careful under these certain circumstances.”\n\n**Highlights**\n\n* The White House announced more than 200 million doses of the coronavirus vaccine have been distributed in the US, greatly surpassing original estimates of 100 million doses delivered in the first 100 days of Biden’s presidency. On the back of this robust distribution, all states are beginning to open back up.\n* Mortgage applications jumped 8.6% in the week ended April 16, marking the biggest jump since late January as mortgage rates pulled back following a surge, according to the Mortgage Bankers Association (MBA). \n* Ford Motor (F) is planning more downtime at five North American factories due to a global semiconductor shortage. \n* During yesterday’s virtual event, Apple (AAPL) announced a new slate of products set to include the companies own chip. The offering includes a new iMac, a new iPad, and a new tracking-device called Airtags.\n* Gisele Bündchen, supermodel and Tom Brady’s wife was announced as a special advisor for the CEO and board of directors in DraftKings. This is just the latest in a series of high-profile moves by DraftKings to establish itself as the premier sport-betting company. \n* After gapping up after earnings, Intuitive Surgical (ISRG) joined the ranks of healthcare companies worth $100 billion or more\n* After a series of high profile accidents including small children, the US Consumer Product Safety Commission advised consumer to not buy the treadmill if there are small kids or pets at home.This could affect the company's product-safety profile, a material category for the household and personal-goods sector. In response, Peloton (PTON) called the statements “inaccurate and misleading” and refused calls to recall their treadmill. The stock has been in freefall this week. \n* \\*\\***Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Abbott Labs (ABT) target raised by Morgan Stanley (MS) from $136 to $140 at Overweight. Stock currently around $120\n* Allegiant Travel (ALGT) target raised by Barclaays from $237 to $300 at Overweight. Stock currently around $231\n* Burlington Stores (BURL) target raised by Loop Capital from $325 to $365 at Buy. Stock currently around $319\n* Dell Technologies (DELL) with a host of target raises. Consensus price target $115 at Overweight. Stock currently around $101\n* Equinix (EQIX) target raised by Mizuho from $750 to $800 at Buy. Stock currently around $726\n* Facebook (FB) target raised by Cowen from $350 to $360 at Outperform. Stock currently around $303\n* Forward Air (FWRD) target raised by Raymond James from $95 to $100 at Outperform. Stock currently around $87 \n* Alphabet (GOOG,GOOGL) target raised by Cowen from $2400 to $2600 at Outperform. Stock currently around $2293\n* Goldman Sachs (GS) with a host of target raises. Consensus price target $410 at Outperform. Stock currently around $332\n* Jazz Pharma (JAZZ) target raised by Cantor Fitzgerald from $185 to $198 at Overweight. Stock currently around $168\n* JP Morgan (JPM) with three target raises. Stock currently around $150 \n   * DA Davidson from $179 to $182 at Buy\n   * Royal Bank of Canada from $150 to $160 \n   * Piper Sandler from $170 to $180\n* Lam Research (LRCX) target raised by Argus from $625 to $725 at Buy. Stock currently around $613\n* NXP Semiconductors (NXPI) target raised by Wells Fargo (WFC) from $193 to $235 at Overweight. Stock currently around $194\n* Penn National Gaming (PENN) target raised by Goldman Sachs (GS) from $153 to $158 at Buy. Stock currently around $89\n* Royal Caribbean (RCL) target raised by Goldman Sachs (GS) from $76 to $95 at Neutral\n* Snap (SNAP) target raised by Cowen from $86 to $88 at Outperform. Stock currently around $58\n* UPS with two target raises. Stock currently around $180\n   * Citigroup (C) from $190 to $200 at Neutral\n   * Raymond James from $195 to $200 at Strong-Buy\n\n“In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock prices, not risk, but it is an opportunity.” - Li Lu",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Wednesday, April 21, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mvp0uf/here_is_a_market_recap_for_today_wednesday_april/",
        "created": 1619066759.0
    },
    {
        "author": "wsb_shitposting",
        "created_utc": 1617285307,
        "id": "mhvteb",
        "num_comments": 483,
        "num_crossposts": 0,
        "selftext": "Every single day this month, I tried to do the one thing that everybody says you shouldn't try to do. I tried predict the exact daily movements of the stock market -- specifically, the daily direction, high, and low of the NASDAQ -- and posted my best guess in the daily discussion forum.\n\nI had to pay incredibly close attention to the stock market every day to do it. Every single morning, I did technical and market analysis to try to keep from publicly embarrassing myself. I learned more about the stock market this month than I have in my entire time trading.\n\nTo celebrate one month of predictions, I wanted to take a look back at the month of March and share some of the things I've learned.\n\nHere's the first one:\n\n**I can't predict the stock market.**\n\n*Damn it.* I really thought I'd be able to do it.\n\nYou can see my [full scorecard here](https://datastudio.google.com/reporting/944799e4-93a3-4aa3-9a1a-68059d06c4a2/page/MkMAC), but it isn't really anything to brag about. Here's how I did:\n\n* **Direction:** 65% correct\n* **Daily high:** Median error of 0.26%\n* **Daily low:** Median error of 0.36%\n\nI was always more interested in the highs and lows than the direction, but *damn* is 65% ever a bad score. I've looked into it -- if I'd just predicted whatever the premarket said, I would've been right 74% of the time.\n\nPart of the problem was this:\n\n**When J. Powell talks, there's a 66% chance the market will tank.**\n\nWhen J. Powell talked, my prediction was wrong more often than it was right -- and usually by a lot. On average, my prediction for the daily low was off by 1.37% whenever he spoke.\n\nI wanted to look into that, so I tested out some of the big narratives we heard this month\n\n[Click here to see that research visualized.](https://datastudio.google.com/reporting/944799e4-93a3-4aa3-9a1a-68059d06c4a2/page/HORAC)\n\nJ. Powell used to be able to pump the market -- but since 2020, I learned, the market has turned red on 66% of the days that he has either made a speech or a public testimony, with the market closing, on average, down 1.24%.\n\n**The NASDAQ is often a better predictor of a stock's price than the company itself.**\n\nI've seen a lot of posts here lately saying: \"Why is everybody talking about indexes? Isn't this supposed to be a stock forum?\"\n\nOne thing this month affirmed for me is that, if you want to know what AAPL or MSFT are going to do today, you have to look at the market itself first.\n\nAAPL, MSFT, GOOG, and AMZN were all extremely correlated with the NASDAQ this month, to the point that, statistically speaking, it can be said that 81% of the variations in Apple's price this month can be explained by changes in the NASDAQ.\n\nI saw a lot of people in the daily discussion asking: \"Why is AAPL tanking? What new is there?\" But -- unless there actually is company news -- that's often the wrong question to ask. \n\n**The market isn't always affected by what CNBC says...**\n\nOne of the biggest stories we heard this month was about the \"bond yield\". The 10-year bond yield went up today, CNBC would report, and so the NASDAQ was sure to tank.\n\nIt never really made sense to a lot of investors -- so I looked into whether that story held up.\n\nI'll let you draw your own conclusions, but here's what I can say for sure:\n\n* There was no statistically significant correlation between the 10-year bond yield and the NASDAQ's price in March\n* If there were one, it would be a positive correlation. When the bond yield went up, it was more likely that the NASDAQ would go up with it than down.\n* There was more of a correlation on days when the bond yield reached a new 12-month high -- but only if the new yield was heavily reported. If it went unmentioned, the NASDAQ went up.\n* The days when the bond yield did significantly go up and the NASDAQ did significantly go down were all days when J. Powell gave a speech\n\n**... but sometimes it is.**\n\nThat doesn't mean everything CNBC said was a lie this year.\n\nAnother huge story this month was the rotation out of tech into value stocks -- and then, at the end of the month, the rotation back.\n\nThis story *totally* holds up. If you plot a tech stock like AAPL's price against JP Morgan's (which I've done for you [here](https://datastudio.google.com/reporting/944799e4-93a3-4aa3-9a1a-68059d06c4a2/page/HORAC)), you'll see that, 61% of the time, these stocks went in the exact opposite direction.\n\nPeople really were rotating out of tech and into value -- and they really are starting to come back.\n\n**I still think the stock market can be predicted**\n\nWhen I started doing this, I got a lot of hate from people who said that only an idiot would try to predict the market. But after a while, those hate messages stopped -- and, instead, people started sending me hate messages saying that they could predict the market better than I can.\n\nThey probably can. I didn't do as well as I'd like this month, but, when I was right, I knew *why* I was right. And when I was wrong, I knew *why* I was wrong -- and had a pretty good idea of how to do better next time.\n\nEverything is *not* priced-in, I've learned this month. Take Biden's speech last night. The market didn't even budge while he was talking. Sure, we were in afterhours, but even Robinhood users were allowed to invest -- and his plan had been laid out weeks in advance. But the Wall Street traders were off work, so the market didn't budge until the morning -- when it absolutely mooned.\n\nIf you pay close enough attention, you *can* get ahead of Wall Street. I'm increasingly convinced of that, and I believe that my predictions will get better as time goes on.\n\n[You can see today's prediction here.](https://datastudio.google.com/reporting/944799e4-93a3-4aa3-9a1a-68059d06c4a2/page/kHRAC)",
        "subreddit": "stocks",
        "title": "I tried to predict the stock market every day in March. Here's how it went - and what I learned.",
        "url": "https://www.reddit.com/r/stocks/comments/mhvteb/i_tried_to_predict_the_stock_market_every_day_in/",
        "created": 1617314107.0
    },
    {
        "author": "barjay8",
        "created_utc": 1617293013,
        "id": "mhyhj4",
        "num_comments": 103,
        "num_crossposts": 0,
        "selftext": "I am not a financial advisor. I just like the stock.\n\nPositions: 200 Shares / 100 4/16 $30 Calls\n\n**What is CharePoint (CHPT)?**\n\nChargePoint Holdings is an electric vehicle infrastructure company based in Campbell, California. ChargePoint operates the largest online network of independently owned EV charging stations operating in 14 countries and makes the technology used in it\n\n**Financial Analysis:**\n\nString Buy: 40% | Buy: 40% |Hold: 20% \n\nLow: $28.00 | Median: $39.20 | $46.00\n\nFree Float: 7.68B | Free Float: 151.22M | 52 Week High: $49.48\n\n&amp;#x200B;\n\n**Why I Like the Stock**  \n 1. CHPT is the largest provider of EV charging stations in the World with more than 100,000 charging ports . Biden's infrastructure plan calls for 500,000 charging station national wide with a $174B B in the EV market.\n\n[https://www.cnet.com/roadshow/news/biden-infrastructure-plan-ev-rebates-charging-stations/](https://www.cnet.com/roadshow/news/biden-infrastructure-plan-ev-rebates-charging-stations/)\n\n[https://seekingalpha.com/news/3678584-chargepoint-quantumscape-lead-big-gains-in-ev-sector-on-green-tidal-wave-hopes](https://seekingalpha.com/news/3678584-chargepoint-quantumscape-lead-big-gains-in-ev-sector-on-green-tidal-wave-hopes)\n\n2. CHPT owns nearly 75% of the EV Charging market share  \n\n3. CHPT has Strategic Partnerships with MOST major Car Manufacturers  \n\n4. CHPT has hundreds of customers including: \n\n\\- Disney \n\n \\- Google \n\n \\- Facebook \n\n \\- Apple \n\n\\- Microsoft  \n\n\\- Netflix  \n\n\\- Target \n\n\\- Whole Foods (Amazon)  \n\n\\- Johnson &amp; Johnson  \n\n\\- Lyft  \n\n\\- FedEx  \n\n\\- eBay  \n\n\\- GM  \n\n\\- MasterCard \n\n\\- Salesforce  \n\n\\- Uber  \n\n\\- McDonald’s \n\n\\- Chevron\n\n\\- Hundreds More  \n\n5. CHPT is partnered with over 4,000 businesses and organizations  \n\n6. Highly Rated Mobile App  \n\n7. Has over 133,000 public charging points across North America and Europe  \n\n8. Has positive Cash flow of $615 Million  \n\n9. Can charge ANY type of electric vehicle  \n\n10. The Chargepoint app is integrated into Apple CarPlay &amp; Android Auto. It’s also integrated into the navigation systems of BMW, Mercedes, Fiat, Nissan, SiriusXM, &amp; TomTom\n\nTL;DR - Biden's infrastructure calls for 500,000 charging station nation wide with174B dedicated to the EV market.  CHPT is the leading industry and has many major partners. I like the stock. I don't know what I am talking about. I just purchased a lottery ticket.",
        "subreddit": "investing",
        "title": "ChargePoint (CHPT) Due Diligence",
        "url": "https://www.reddit.com/r/investing/comments/mhyhj4/chargepoint_chpt_due_diligence/",
        "created": 1617321813.0
    },
    {
        "author": "uw00wu",
        "created_utc": 1617265219,
        "id": "mhqr0m",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$MSFT $500k YOLO",
        "url": "https://www.reddit.com/gallery/mhqr0m",
        "created": 1617294019.0
    },
    {
        "author": "joe691013",
        "created_utc": 1617279549,
        "id": "mhu2e7",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "**Wikisoft Corp (OTC Markets: WSFT)**\n\n**Date: March 31, 2021; current share price: $3.50Mid Term Price Target: $12-$15**\n\n**Company Overview**\n\n*In order to capitalize on current globalization trends, Wikisoft developed a credible online platform for companies and employees in order to serve the growing demand for credible information online. Wikiporfile.com aims to assist businesses and business professionals in order to find valid information in an easy and timely manner, helping them make informed career and hiring decisions. The company’s vision is to become the go to platform for connecting users to business opportunities on a global scale.*\n\n*Share structure: ( according to OTC Markets, via* [*https://www.otcmarkets.com/stock/WSFT/security*](https://www.otcmarkets.com/stock/WSFT/security)*)*\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4nmhhi610kq61.png?width=949&amp;format=png&amp;auto=webp&amp;s=599835133764766749ceb6f074aa80e3c468848d\n\n*Wikisoft was incorporated in Nevada on May 4, 1998, under the name Sensor Technologies, Inc. The company changed its names multiple times, and in March 2018, Bluestar Technologies ultimately became Wikisoft Corp.*\n\n**Management**\n\nMr. Paul Quintal joined the company on August 1, 2020 as Chief Commercial Officer with the main objective to get funding, as he shortly resigned after, in December 2020. He then tool the role as Chairman and Directors, being responsible for corporate governance and investor relations. Mr. Quintal is highly qualified and has extensive experience in search engine technology, as he has worked for companies such as Pentius, Inc., Softbank, Internet.com and Lycos. He was a key member for 2 IPOs, 2 exits via sale and 12 acquisitions &amp; integrations. Specifically, his role at Pentius included leading negotiations for large strategic contracts, managerial guidance, and high-value deal-making.\n\nMr. Carsten Kjems Falk has recently joined Wikisoft Corp, serving as Chief Executive Officer since September 1, 2020, making him responsible for strategy, operations, business development, and all commercial activities. Prior to Wikisoft Corp, Mr. Flak was Chief Executive Officer at Domino’s Pizza DK. Mr. Falk holds a Master’s degree in Mathematics and curriculum studies, and has a proven track record of successfully winning 2 Gazelle Prizes from the leading financial newspaper in Denmark. Also highly relevant, Carsten Falk’s experience could be leveraged at Wikisoft, developing the company into a competitive player in its industry. Mr. Falk has also been awarded twice for the best global online sales by Domino’s International.\n\n**Business Model**\n\nWikisoft’s vision is to become an important player in the business information industry, with Wikiprogile.com. Wikiprofile.com is a portal that provides articles and profiles on companies, business people and corporate influencers. Currently, the website portal is operational in its launched form, however, the company is focused on relaunching the updated format of the website (planned to take place in the Spring 2021). Wikisoft has externalized some of its functions, with developers based in India and IT operations based in Denmark.\n\nWikiprofile.com is built on a modern microservice software stack and is developed in multiple Postgres databases, which represent a main pillar for the platform. The architecture is designed to make the web faster, more secure, easier to scale, and in addition, by using proprietary crawler technology, the databases automatically collect information on newly found entities, seeking to have a complete database. Once relaunched, wikiprofile.com will help users to stay connected and informed, allowing professionals to advance their careers while also allowing business to hire the best professionals and work smarter.\n\nWikisoft is just about to enter into the “growth phase”. After going through the restructuring stage (2017-2019 ), the company went on to build a solid foundation and gear for growth by changing the management team, leveraging their business model, implementing growth strategies. The next period could represent the growth stage, and could be characterized by accelerated growth, becoming a global brand, and capitalizing on the growth opportunities.\n\nIn the long run, Wikisoft plans to disturb the industry when it comes to validation of professional profiles and create new standards, changing the wat people trust digital information. The platform aims to provide trusted information about companies and people, allowing both of them to make the right decision. Wikisoft would engage in a global market worth 479 billion USD, with the United States being the leading country, at 152 billion USD, according to Statista. ( Revenue of global staffing industry 2008-2019 ).\n\nWikisoft believes that they could be a major disruption for the industry, as the company looks to leverage their strengths:\n\n\\- Large global business database that can be used for Marketing &amp; Sales\n\n\\- Highly scalable setup geared towards the future growth journey\n\n\\- Limited operational cost geared for growth\n\n\\- Data crawled, verified &amp; updated daily providing a job market directory for businesses and job seekers\n\n\\- Disruptive business model with low entrance barrier to gain market share\n\nAs Wikisoft is working to relaunch the website portal in its updated format, the company aims to create additional value for their users through four different planned product lines:\n\na) Wiki Business People Profile\n\n\\- Free basic profile, visible to recruiters looking for new employee’s\n\n\\- Additional features such as data insights on profile visitors , financial company information and receiving job proposals are all planned to be available at a cost\n\nb) Wiki Business Profile\n\n\\- Free basic profile, allowing companies to highlight their culture, increase their brand awareness, and\n\n\\- Additional features such as review management and data insights available at a cost\n\nc) Wiki Recruit\n\n\\- Planned to include a free basic profile where recruiters can post jobs\n\n\\- Additional features such as premium ranking, ability to send job proposals directly to job candidates; ( planned to be $19.99 per month for the premium ranking, $29.99 per month for the premium ranking and ability to send direct job proposals )\n\nd) Wiki Company Research\n\n\\- Offer solidity, liquidity and credit reports to make research and ensure right decision making when choosing a new job or supplier\n\nWikisoft plans to generate revenues from premium profiles and recruiting on the website platform, but also by charging users for access to certain information and features on the platform.\n\nOperations plan – timeline, projections:\n\nQ1 2021:\n\n\\- Updated website platform to be launched, including new features and extended profiles of businesses and business professionals;\n\n\\- Mobile version planned to be launched as well, along new investor site on Wikisoft.com\n\n\\- Estimated costs: $40,000\n\nQ2 2021:\n\n\\- commence marketing activities, with the goal of generating users and sign ups; ( main drivers: email, SEM, SEO )\n\n\\- further development if website platform with new features such as reviews, in-mails\n\n\\- having the company’s common stock on the OTC markets OTCQB tier\n\n\\- Estimated costs: $40,000\n\nQ3 2021:\n\n\\- Hiring of marketing managers that will be responsible for optimizing and ensuring KPI driven email, SEM &amp; SEO, and for executing Wikisoft’s marketing strategy\n\n\\- IT development for crawling and fronted development of business logic and products\n\n\\- Estimated costs: $50,000\n\nQ4 2021:\n\n\\- Continue hiring additional developers, hire additional customer care and marketing managers\n\n\\- Develop platform with new features like Jobs and Job Postings\n\n\\- Hire CFO to streamline financial reporting, compliance, investor relations and improve corporate governance\n\n\\- Estimated costs: $70,000\n\nThe industry is evolving with rapid pace, and other companies with significantly bigger financial resources, such as LikedIn, Glassdoor, Facebook, Google, Microsoft, and Twitter could or are developing solutions that compete with Wikisoft. Larger companies could focus on professional networking and directly compete with Wikisoft.\n\nWikisoft is a potential buyout target, ultimately following the footsteps of other similar companies in the industry. LinkedIn was acquired by Microsoft for $26.2 billion; Hired raised $132 million since founding in 2012 +10,000 top companies using Hired employers can reduce time to hire by about 33%; Glassdoor was acquired by Recruit Holdings for $1.2 billion in May 2018. Recruit provides recruiting solutions to 7k+ employers, including about 40% of the Fortune 500.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/earz1h620kq61.png?width=1707&amp;format=png&amp;auto=webp&amp;s=ecbddb859bc3afa1430711612ee19d7540383168\n\nSource: Wikisoft, Management Information, via Information Memorandum\n\nWikisoft will also not have ads on website in order to build brand trust. The company could potentially capture market share through their strong brand recognition and amount of proprietary data. Wikiprofile is rated among the highest in terms of trusted and credible content, while also having a modern IT infrastructure, being e=well organized and integrated for business and consumer applications.\n\n**Risks Factors**\n\n“The Company has generated very little revenue, which was all from a related party, and has incurred losses of $2,888,765 for the year ended December 31, 2019 and $1,954,297 for the year ended December 31, 2020. The Company has incurred an accumulated deficit of $7,583,538 since inception and does not have a sufficient amount of cash required to pay all the costs associated with its operations. Additionally, as of December 31, 2020, the Company had working capital deficit of approximately $23,041. These factors raise substantial doubt about the Company’s ability to continue as a going concern” ( Wikisoft, Annual Report, 03/29/2021, SEC database)\n\n“The Company seeks to overcome the circumstances that impact its ability to remain a going concern through a combination of the growth of revenues, with interim cash flow deficiencies being addressed through additional equity and debt financing. The Company anticipates raising additional funds through public or private financing, strategic relationships or other arrangements in the near future to support its business operations.” ( Wikisoft, Annual Report, 03/29/2021, SEC database)\n\nWikisoft Corp has little to no history of revenue generation and currently operates at a loss, thus the company is still dependent on financings for the continuation of operations. Also, evaluating and forecasting Wikisoft’s financial performance cannot be done with great accuracy.\n\nMr. Rasmus Refer is the largest shareholder and has substantial control over the company and its policies. As of 03/29/2021, he owns 87.83% of Wikisoft’s common stock. He is also able to exercise significant influence over all matters requiring approval by stockholders.\n\nThe company is extremely likely to conduct offerings of equity in the future, meaning that stockholders would be diluted, as their proportional interest would decrease.\n\nUltimately, the success of the company strictly depends on its ability to develop and commercialize their platform.\n\n**Financials**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5iw9gsb30kq61.png?width=699&amp;format=png&amp;auto=webp&amp;s=60031b8d95e5bd77e95da6f4a87455fd8fe839f9\n\n&amp;#x200B;\n\nhttps://preview.redd.it/iwcbz0i40kq61.png?width=791&amp;format=png&amp;auto=webp&amp;s=e0fd15c9d2f143e58167e70f1263d49887b8f637\n\n&amp;#x200B;\n\nhttps://preview.redd.it/wh1yqm850kq61.png?width=794&amp;format=png&amp;auto=webp&amp;s=3efc2c86bf7e92f4d38ea367fb117315c6dde264\n\nSource: ( Wikisoft, Annual Report, 03/29/2021, SEC database)\n\nEven though there is little to no financial data that could be analyzed, Wikisoft represents a huge opportunity for investors, as the company is poised for growth in the near future. Although it is too early to make accurate price target estimates and projections, if the Wikisoft’s management team is successful in leveraging their growth strategies, Wikisoft could become a billion dollar capped company sometime In the next 3-6 years, possibly resulting in a 600% return on investment. As soon as the updated version of the online portal is launched and additional features are added, the company will initiate their marketing strategies, and around that time (expected to be in the fourth quarter of 2021), investors should start seeing revenues and cash flows from operations increasing. By that time, Wikisoft ( if nr. of shares outstanding remains the same), should be trading around $12-$15 per share. Overall, I am optimistic about Wikisoft’s long term prospects, and assign the company a BUY rating.\n\nDisclaimer: I assume no responsibility or liability for any errors or omissions in the content of the report. Any person or entity will be solely responsible for the consequences of the data, analysis, and findings of the report are used for decision making.",
        "subreddit": "pennystocks",
        "title": "WSFT Due Diligence",
        "url": "https://www.reddit.com/r/pennystocks/comments/mhu2e7/wsft_due_diligence/",
        "created": 1617308349.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1617268735,
        "id": "mhrha8",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Paysafe has finally just gone public with a new Board of Directors, much less debt, lots more cash, new M&amp;A plans and a new ticker: PSFE During yesterday's ticker change, there were several reports of people having no access to their accounts and/or suddenly being faced with an abrupt change in margin requirements from 25% to 100%. Many suggest this was intentional manipulation to give institutions cheaper shares. Regardless, this may have created a good buying opportunity for us too. For those interested, here's some comprehensive DD.\n\nPaysafe is a unique combination of fintech, iGaming, sports betting and banking all rolled into one stock. Whether you like him or not, this is essentially why NBC’s Jim Cramer recently said, “There is something about Paysafe that may be the ultimate stock for this moment.” (video link below) Market analyst Steve Grasso says, “It’s the most excited I’ve been about a stock in a long time.” Grasso, by the way, has repeated called for it to triple ($45-50). So why is that?\n\nPaysafe offers a scalable electronic payment platform used by Draftkings, Roblox, Spotify, eToro, Fortnight, Coinbase, Amazon, Twitch, EA, 888, ApplePay, Youtube, Visa, Microsoft, Xbox, Amelco, William Hill, Ceasar's, Betfair, Pokerstars, PayLease, ESL Gaming, Luckbox, bet365, Lotto among many others.\n\nPaysafe is ranked No. 2 globally in the digital wallet space with presence in 120 countries and No. 4 globally in integrated merchant processing.\n\nImportantly, Paysafe is the No. 1 global leader in iGaming eCash network (currently 36% of revenue) with 10-15X growth projected. US iGaming continues to be legalized state by state, growing revenue by 234% in just the last year. “At Paysafe, the iGaming market volume was estimated to be $3.4 billion in 2019, and is now projected to reach $47 billion in 2025.”\n\nPaysafe is enabled for digital currency (a type that shall not be mentioned in these parts) without having to go through fiat. It recently partnered with Coinbase to expand options in US and it just launched PaysafeCash in US. (Now in 40 currencies and 30 global markets enabling easier cross border payments.)\n\nPerhaps most central to this recent merger is Bill Foley, Fidelity’s Chairman of the Board and now the Chairman of Paysafe, who has a proven track record for generating exponential synergistic inorganic growth. For example, in just the last five years, he grew Ceridian 3.3X ($4.2B to $14B), Dun &amp; Bradstreet 5.6X ($2B to $11.3B), and Black Knight 8.7X ($1.6B to $14B). He also grew FIS from $2.5 billion to over $91 billion (36.4X) and he says, “Those characteristics of FIS are right in line with what we plan on doing with Paysafe.”\n\nOf their expansion plans Foley says, “We’ve got a wide landscape we can attack. It’s pretty exciting.” “It’s going to be a land grab. We want to be out there about 10 miles ahead of everybody else.” “I have a vision that we should be THE digital wallet and have tie-ins with every major casino company that’s headquartered or located in Las Vegas. There will be money to be made for everybody. That’s why I got so excited about Paysafe Group Holdings Limited as its position in iGaming is really second to none.” “Whether it’s a lottery or slot machines or sportsbetting opening in a state, it’s our job to be there first and to make sure we dominate. We’re focusing on gaming, particularly sportsbetting, in the United States as it becomes legal and we’ve got a wide landscape we can attack. It’s pretty exciting.”\n\nAlong with Bill Foley, Paysafe's newly announced Board of Directors includes a former Morgan Stanley CEO, a former Chairman of the American Gaming Association and CEO of MGM Resorts International, a legal and regulatory expert in the multi-jurisdictional online and retail gambling industries, the CEO of Dun &amp; Bradstreet and CEO of Black Knight, two senior Managing Directors from Blackstone and two senior Managing Directors from CVC,\n\nBetween the new Board of Directors, Bill Foley’s proven expertise in rapid M&amp;A growth and Paysafe’s massive market share and diverse assets, including the world’s second largest digital wallet, $362 million in free cash flow, 30-35% margins (21% CAGR), a projected $100-110 billion in transactional volume and $1.5 billion revenue, it is inevitable that institutional investors will, by necessity, include PSFE in their portfolios.\n\nPaysafe’s industry leading risk management and international regulatory expertise gives them an edge in spaces where competitors have hesitated like iGaming, sportsbetting, alternative currency trading as well as offering essential banking and ecommerce services to the \"unbanked\" (1.7 billion globally). Paysafe has a global platform with integrated cloud technology (Snowflake) allowing for easier migration of eCash, integration of payment methods and expansion into global banking as a service. Paysafe is so diversified that they've identified a $58 trillion TAM.\n\nFurther, major investment funds know that fintechs are the future. Fund manager Cathie Wood says, “Fintechs are going to, we believe, gut banks.” Similarly, Jackie Reses, board member of the SF Federal Reserve and fmr Head of Square Capital, calls for fintech “taking over and revolutionizing banking” representing “a wholesale transition” of a $16 trillion market cap.\n\nAnalyst Michael Del Grosso recently initiated coverage saying, \"We believe PSFE represents a relatively scarce asset within the payments industry given its unique business strategy, geographical footprint, and focus on the iGaming industry. Our forecasts imply revenue growth at the high-end of management's guidance and we believe there is upside to our forecasts in the event of state-level legalization of iGaming. PSFE operates in high-growth verticals, has a unique advantage in its consumer and merchant facing solutions, and offers exposure to a secular growth opportunity in the potential legalization of iGaming in the United States.\"\n\nInvestors should be aware that there is are post-merger lockup periods before insiders can sell their shares: PIPE: = 176 days. Private Equity = 86 days (roughly 6 and 3 months respectively accounting for trading days and weekends). Something to be aware of but there are several signals that these parties aren't in any rush to sell. Eli Nagler, a Senior Managing Director at Blackstone, recently said: “Today is a significant milestone for Paysafe and a testament to the excellent work of their world-class management team over several years. We believe Paysafe has a long runway for further growth and look forward to remaining part of the team and seeing their continued success as a public company.” Regarding Blackstone and CVC, who now have four senior managing directors on Paysafe’s Board, Foley said, “They rolled a significant amount of their investment which is a confidence builder. They didn’t take all their money off the table… All of these things put together really created the confidence among the investor base to invest in the PIPE and then support the stock.” Also, the PIPE investors are primarily insurance companies known for long term hold strategies and they are closely associated with Bill Foley. As Foley recently said, “Having a large PIPE basically validates the transaction.… The companies that I’m affiliated with actually invested roughly a billion dollars in the PIPE and forward purchase agreements so Paysafe was always a really protected asset, besides the fact that it’s a great asset.”\n\nBill Foley says Paysafe may be his “best investment ever.” He says, “It’s a fortress. It’s got a moat.” “We have a proven strategy of winning as new global markets open. And most importantly, we have unrivaled regulatory risk and technical expertise.”\n\nAs an aside, even though, “Roughly 75% of online gambling operators use Paysafe for processing payments” many in the US haven’t yet heard of it yet. Partially because much of its presence is in back-end processing. Through its several new partnerships (Coinbase, Microsoft Rentmoola), Paysafe is just now rolling out its offerings in the U.S. In Europe, where it is more commonly used, Trustpilot rates Paysafe as “Excellent” (4.7/5 stars) with over 20,000 reviews, and Skrill (owned by Paysafe) 4/5 stars “great” with over 16,000 reviews, while competitor PayPal is rated \"poor\" only 1/5 stars with over 16,000 reviews. Further, Paysafe was winner of the American Gambling Awards’ “Payment Processor of the Year,” and owns Openbucks, Neteller and Skrill, 2019 winner “Best Digital Wallet” for best consumer take up and most innovative technology with “greatest potential to disrupt current ecosystems.” Also, Paysafe won “Best Omni-Channel Payment Solution” 2021 MPE Award and the gaming industry SAGSE award for “Best Payment Method.”\n\nTo give a sense of their pace and progress, these are some of Paysafe’s recent announcements that were made before going public and have not been factored into the current valuation:\n\nDec. 15 — Paysafe launches Paysafecash in the US\n\nDec. 21 — Paysafe partners with Amelco to plug US sports books into unified payments platform\n\nDec. 23 — Paysafe enables online cash payments for Microsoft\n\nJan 11 — Paysafe partners with Colorado’s BetWildwood\n\nFeb 1 — Paysafe expands Virginia Lottery partnership\n\nFeb 17 — Paysafe partners with Luckbox to roll out Skrill and Neteller payment services\n\nFeb 18 — Paysafe expands partnership with ESL Gaming, the world’s largest esports company\n\nFeb 23 — Paysafe’s Skrill launches new fiat-to-digital currency\n\nFeb 25 — Paysafe partners with Austria’s A1 esports League\n\nMar 1 — Paysafe partners with RentMoola to enable US renters to pay rent with Paysafecash eCash\n\nMar 12 — Leeds United announces partnership with Skrill\n\nMar 15 — Paysafe expands U.S. partnership with PointsBet\n\nMar 16 — Paysafe partners with Provema to enable online cash payments\n\nMar 25 -- Paysafe’s Skrill expands digital currency offering to US with Coinbase\n\n&amp;#x200B;\n\nFortunately for shareholders, even before Foley’s value creation play book is put into action, Paysafe is currently undervalued compared to sector peers.\n\nSince market analyst Steve Grasso continues to his repeat his calls for a triple ($45-50), I've looked more closely at EV / EBITDA, EV / Revenue and EV / Free cash flow multiples of sector peers, including PayPal, Nuvei, Repay, Shift 4, Adyen, Square, Affirm, Stripe, Chime and a few others, using cross-referenced data from Nasdaq, WSJ, Morningstar, Macrotrends, Yahoo Finance. The conservative average of those three multiples puts Paysafe’s post-merger pro forma share value at around $46.52:\n\n&amp;#x200B;\n\nPaysafe’s share price using the average multiples from the full list of sector peers:\n\nEV/EBITDA ratio : $122.09\n\nEV/Rev ratio : $83.91\n\nEV/FCF ratio : $87.86\n\nAverage: $97.95\n\n&amp;#x200B;\n\nMore realistic share prices, after eliminating all outliers with very high multiples:\n\nEV/EBITDA ratio :$50.75\n\nEV/Rev ratio : $44.64\n\nEV/FCF ratio : $44.18\n\nAverage :$46.52\n\n&amp;#x200B;\n\nNote: Unlike Paysafe, nearly half of these publicly traded fintechs still do not report positive cash flow. Also, these multiples reflect a collective 27% pull back from recent highs so interest rate risks have been somewhat factored in.\n\nAlso, Paysafe's CFO noted that their conservative 11% growth projection is tied to the general fintech market at large. They have deliberately excluded both M&amp;A plans that are apparently already underway and US iGaming growth that may potentially grow 10x or more over the next 5 years. Further, the above comps include fintechs with slower or similar growth while still commanding much higher multiples. For example, Shift4 reported only 4% y-o-y growth and GPN's growth projection is on par with Paysafe's.",
        "subreddit": "wallstreetbets",
        "title": "Paysafe goes public with new ticker: PSFE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhrha8/paysafe_goes_public_with_new_ticker_psfe/",
        "created": 1617297535.0
    },
    {
        "author": "The-Techie",
        "created_utc": 1617274623,
        "id": "mhss5q",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "InvestmentClub",
        "title": "Microsoft Wins $22B Deal To Supply US Army With HoloLens AR Glasses",
        "url": "https://www.thetechee.com/2021/04/microsoft-wins-22b-deal-to-supply-us.html",
        "created": 1617303423.0
    },
    {
        "author": "CanadianInvestor98",
        "created_utc": 1617285443,
        "id": "mhvuwt",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "GlobeX Data Ltd. the leader in Swiss hosted secure communications and secure data management, is pleased to report that it has completed all internal testing of its SekurMessenger Swiss hosted messaging security and privacy solution, in preparation for its commercial launch in Latin America in April 2021.\n\nAs previously announced in a separate press release dated January 12 2021, GlobeX is launching SekurMessenger, its Swiss hosted encrypted instant messaging, secure voice recording transfer and secure file transfer application, with América Móvi's Telcel mobile operator in Mexico. The secure messaging service has been fully integrated with Telcel's billing and provisioning platform and the commercial launch is expected to start the week of April 12 2021. The launch will start in Mexico and expand to other countries where America Movil operates through its Claro brand, such as Colombia and other Latin American countries as the business grows over the coming years.\n\nGlobeX Data and América Móvil are looking at offering a secure and private alternative to other non-secure and non-private messaging applications. The market is geared primarily for business and government users, and privacy conscious consumers. According information published on América Móvi's website, Telcel is the largest mobile operator in Mexico, with over 75 million mobile subscribers. América Móvil (NYSE:AMX) is the 7th largest telecom operator in the world with over 277 million mobile subscribers in over 20 countries throughout Latin America and Europe.\n\nRecent data breaches in messaging applications and in particular in the WhatsApp application have created a certain urgency for businesses and data privacy advocates to protect their communications form cyber-attacks and identity theft via mobile and desktop devices.\n\nSekurMessenger eliminates many of the privacy and security risks by not only not requiring a phone number, which would divulge a user's phone device ID, but also by not social engineering a user's phone or computer contact list and infecting the contacts by default as well, eliminating a huge loophole in security and privacy. SekurMessenger issue each user a username and a SM number. The SM number is the contact ID a user would disclose in order for other SM users to be added. As the Introduction Video demonstrates, the service comes with a self-destruct timer and other features as well, including GlobeX's proprietary VirtualVaults and HeliX technologies with all data stored in Swiss hosted encrypted servers.\n\nAdditionally, SekurMessenger now comes with a proprietary feature and technology called Chat by Invites. This feature allows a SekurMessenger user (\"SM user\") invite a non-SM user, or a group of non-SM users, to chat in a fully private and secure way, without the recipient ever having to register to SekurMessenger or download the app. At the end of the chat, the initiator of the conversation can remotely terminate the conversation and all traces of the conversation are deleted from all users, including the recipient. This unique feature is now fully deployed and functional on all iOS and Android devices and web platforms. The target sectors are numerous, including but not limited to real estate, legal, financial, government, energy, mining, manufacturing, trade and medical sectors.\n\nAlain Ghiai, CEO of GlobeX Data said: \"We are very happy to have completed the testing phase of the launch with Telcel and are looking forward to the launch in the next couple of weeks. We have completed our Spanish language platform for SekurMessenger, and this means that we now can deploy other languages in the coming months as the ground work for localization coding has been done. We have received notice from Tecel, and other partners, that there is a growing demand to replace WhatsApp as a business messaging solution. SekurMessenger is here to satisfy that demand, and as we are not connected, and never have been connected, to AWS, Microsoft Azure or Google Cloud platforms, commonly referred to as \"Big Tech\", we can offer a truly independent, private and secure means of communications through secure messaging, secure voice record transfer and secure email through our proprietary technology and our secure servers based in Switzerland. We plan to expand to several countries in Central and Latin America in the coming years, as we plan to launch with other partners in the region as well. According to statista.com and other information sites, there are over 580 million people speaking Spanish in Latin America alone, and with security and privacy becoming a global concern, and the new WhatsApp rules to share all users' data with Facebook, we have seen a surge in demand and inquiries for our secure and private communications solutions.\"\n\nGlobeX's Data privacy solutions are all hosted in Switzerland, protecting users' data from any outside data intrusion requests. In Switzerland, the right to privacy is guaranteed in article 13 of the Swiss Federal Constitution. The Federal Act on Data Protection (\"FADP\") of 19 June 1992 (in force since 1993) has set up a strict protection of privacy by prohibiting virtually any processing of personal data which is not expressly authorized by the data subjects. The protection is subject to the authority of the Federal Data Protection and Information Commissioner.\n\nUnder Swiss federal law, it is a crime to publish information based on leaked \"secret official discussions.\" In 2010 the Federal Supreme Court of Switzerland found that IP addresses are personal information and that under Swiss privacy laws they may not be used to track Internet usage without the knowledge of the individuals involved.\n\nDisclaimer: this is not investment advice, please do your own research.",
        "subreddit": "pennystocks",
        "title": "GlobeX Data ($SWIS - $SWISF - $GDT) Launching SekurMessenger with America Movil's Telcel - Aims to Replace WhatsApp for Business Users Throughout Latin America",
        "url": "https://www.reddit.com/r/pennystocks/comments/mhvuwt/globex_data_swis_swisf_gdt_launching/",
        "created": 1617314243.0
    },
    {
        "author": "sir_voldemort",
        "created_utc": 1617276312,
        "id": "mht7xe",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Discord take on Rumors MSFT buying Discord",
        "url": "https://www.youtube.com/watch?v=dHUKVIH8rnk",
        "created": 1617305112.0
    },
    {
        "author": "joe691013",
        "created_utc": 1617278565,
        "id": "mhtskp",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Wikisoft Corp (OTC Markets: WSFT)**\n\n**Date: March 31, 2021; current share price: $3.50Mid Term Price Target: $12-$15**\n\n**Company Overview**\n\n*In order to capitalize on current globalization trends, Wikisoft developed a credible online platform for companies and employees in order to serve the growing demand for credible information online. Wikiporfile.com aims to assist businesses and business professionals in order to find valid information in an easy and timely manner, helping them make informed career and hiring decisions. The company’s vision is to become the go to platform for connecting users to business opportunities on a global scale.*\n\n*Share structure: ( according to OTC Markets, via* [*https://www.otcmarkets.com/stock/WSFT/security*](https://www.otcmarkets.com/stock/WSFT/security)*)*\n\nhttps://preview.redd.it/b326bktrxjq61.png?width=949&amp;format=png&amp;auto=webp&amp;s=734827cf4d0aacc834d043a3c8253796c4e07b0c\n\n*Wikisoft was incorporated in Nevada on May 4, 1998, under the name Sensor Technologies, Inc. The company changed its names multiple times, and in March 2018, Bluestar Technologies ultimately became Wikisoft Corp.*\n\n**Management**\n\nMr. Paul Quintal joined the company on August 1, 2020 as Chief Commercial Officer with the main objective to get funding, as he shortly resigned after, in December 2020. He then tool the role as Chairman and Directors, being responsible for corporate governance and investor relations. Mr. Quintal is highly qualified and has extensive experience in search engine technology, as he has worked for companies such as Pentius, Inc., Softbank, Internet.com and Lycos. He was a key member for 2 IPOs, 2 exits via sale and 12 acquisitions &amp; integrations. Specifically, his role at Pentius included leading negotiations for large strategic contracts, managerial guidance, and high-value deal-making.\n\nMr. Carsten Kjems Falk has recently joined Wikisoft Corp, serving as Chief Executive Officer since September 1, 2020, making him responsible for strategy, operations, business development, and all commercial activities. Prior to Wikisoft Corp, Mr. Flak was Chief Executive Officer at Domino’s Pizza DK. Mr. Falk holds a Master’s degree in Mathematics and curriculum studies, and has a proven track record of successfully winning 2 Gazelle Prizes from the leading financial newspaper in Denmark. Also highly relevant, Carsten Falk’s experience could be leveraged at Wikisoft, developing the company into a competitive player in its industry. Mr. Falk has also been awarded twice for the best global online sales by Domino’s International.\n\n**Business Model**\n\nWikisoft’s vision is to become an important player in the business information industry, with Wikiprogile.com. Wikiprofile.com is a portal that provides articles and profiles on companies, business people and corporate influencers. Currently, the website portal is operational in its launched form, however, the company is focused on relaunching the updated format of the website (planned to take place in the Spring 2021). Wikisoft has externalized some of its functions, with developers based in India and IT operations based in Denmark.\n\nWikiprofile.com is built on a modern microservice software stack and is developed in multiple Postgres databases, which represent a main pillar for the platform. The architecture is designed to make the web faster, more secure, easier to scale, and in addition, by using proprietary crawler technology, the databases automatically collect information on newly found entities, seeking to have a complete database. Once relaunched, wikiprofile.com will help users to stay connected and informed, allowing professionals to advance their careers while also allowing business to hire the best professionals and work smarter.\n\nWikisoft is just about to enter into the “growth phase”. After going through the restructuring stage (2017-2019 ), the company went on to build a solid foundation and gear for growth by changing the management team, leveraging their business model, implementing growth strategies. The next period could represent the growth stage, and could be characterized by accelerated growth, becoming a global brand, and capitalizing on the growth opportunities.\n\nIn the long run, Wikisoft plans to disturb the industry when it comes to validation of professional profiles and create new standards, changing the wat people trust digital information. The platform aims to provide trusted information about companies and people, allowing both of them to make the right decision. Wikisoft would engage in a global market worth 479 billion USD, with the United States being the leading country, at 152 billion USD, according to Statista. ( Revenue of global staffing industry 2008-2019 ).\n\nWikisoft believes that they could be a major disruption for the industry, as the company looks to leverage their strengths:\n\n\\- Large global business database that can be used for Marketing &amp; Sales\n\n\\- Highly scalable setup geared towards the future growth journey\n\n\\- Limited operational cost geared for growth\n\n\\- Data crawled, verified &amp; updated daily providing a job market directory for businesses and job seekers\n\n\\- Disruptive business model with low entrance barrier to gain market share\n\nAs Wikisoft is working to relaunch the website portal in its updated format, the company aims to create additional value for their users through four different planned product lines:\n\na) Wiki Business People Profile\n\n\\- Free basic profile, visible to recruiters looking for new employee’s\n\n\\- Additional features such as data insights on profile visitors , financial company information and receiving job proposals are all planned to be available at a cost\n\nb) Wiki Business Profile\n\n\\- Free basic profile, allowing companies to highlight their culture, increase their brand awareness, and\n\n\\- Additional features such as review management and data insights available at a cost\n\nc) Wiki Recruit\n\n\\- Planned to include a free basic profile where recruiters can post jobs\n\n\\- Additional features such as premium ranking, ability to send job proposals directly to job candidates; ( planned to be $19.99 per month for the premium ranking, $29.99 per month for the premium ranking and ability to send direct job proposals )\n\nd) Wiki Company Research\n\n\\- Offer solidity, liquidity and credit reports to make research and ensure right decision making when choosing a new job or supplier\n\nWikisoft plans to generate revenues from premium profiles and recruiting on the website platform, but also by charging users for access to certain information and features on the platform.\n\nOperations plan – timeline, projections:\n\nQ1 2021:\n\n\\- Updated website platform to be launched, including new features and extended profiles of businesses and business professionals;\n\n\\- Mobile version planned to be launched as well, along new investor site on Wikisoft.com\n\n\\- Estimated costs: $40,000\n\nQ2 2021:\n\n\\- commence marketing activities, with the goal of generating users and sign ups; ( main drivers: email, SEM, SEO )\n\n\\- further development if website platform with new features such as reviews, in-mails\n\n\\- having the company’s common stock on the OTC markets OTCQB tier\n\n\\- Estimated costs: $40,000\n\nQ3 2021:\n\n\\- Hiring of marketing managers that will be responsible for optimizing and ensuring KPI driven email, SEM &amp; SEO, and for executing Wikisoft’s marketing strategy\n\n\\- IT development for crawling and fronted development of business logic and products\n\n\\- Estimated costs: $50,000\n\nQ4 2021:\n\n\\- Continue hiring additional developers, hire additional customer care and marketing managers\n\n\\- Develop platform with new features like Jobs and Job Postings\n\n\\- Hire CFO to streamline financial reporting, compliance, investor relations and improve corporate governance\n\n\\- Estimated costs: $70,000\n\nThe industry is evolving with rapid pace, and other companies with significantly bigger financial resources, such as LikedIn, Glassdoor, Facebook, Google, Microsoft, and Twitter could or are developing solutions that compete with Wikisoft. Larger companies could focus on professional networking and directly compete with Wikisoft.\n\nWikisoft is a potential buyout target, ultimately following the footsteps of other similar companies in the industry. LinkedIn was acquired by Microsoft for $26.2 billion; Hired raised $132 million since founding in 2012 +10,000 top companies using Hired employers can reduce time to hire by about 33%; Glassdoor was acquired by Recruit Holdings for $1.2 billion in May 2018. Recruit provides recruiting solutions to 7k+ employers, including about 40% of the Fortune 500.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5cef80auxjq61.png?width=1707&amp;format=png&amp;auto=webp&amp;s=7a6861513c0f456dbbe6cb0de1b4da50f66ca717\n\nSource: Wikisoft, Management Information, via Information Memorandum\n\nWikisoft will also not have ads on website in order to build brand trust. The company could potentially capture market share through their strong brand recognition and amount of proprietary data. Wikiprofile is rated among the highest in terms of trusted and credible content, while also having a modern IT infrastructure, being e=well organized and integrated for business and consumer applications.\n\n**Risks Factors**\n\n“The Company has generated very little revenue, which was all from a related party, and has incurred losses of $2,888,765 for the year ended December 31, 2019 and $1,954,297 for the year ended December 31, 2020. The Company has incurred an accumulated deficit of $7,583,538 since inception and does not have a sufficient amount of cash required to pay all the costs associated with its operations. Additionally, as of December 31, 2020, the Company had working capital deficit of approximately $23,041. These factors raise substantial doubt about the Company’s ability to continue as a going concern” ( Wikisoft, Annual Report, 03/29/2021, SEC database)\n\n“The Company seeks to overcome the circumstances that impact its ability to remain a going concern through a combination of the growth of revenues, with interim cash flow deficiencies being addressed through additional equity and debt financing. The Company anticipates raising additional funds through public or private financing, strategic relationships or other arrangements in the near future to support its business operations.” ( Wikisoft, Annual Report, 03/29/2021, SEC database)\n\nWikisoft Corp has little to no history of revenue generation and currently operates at a loss, thus the company is still dependent on financings for the continuation of operations. Also, evaluating and forecasting Wikisoft’s financial performance cannot be done with great accuracy.\n\nMr. Rasmus Refer is the largest shareholder and has substantial control over the company and its policies. As of 03/29/2021, he owns 87.83% of Wikisoft’s common stock. He is also able to exercise significant influence over all matters requiring approval by stockholders.\n\nThe company is extremely likely to conduct offerings of equity in the future, meaning that stockholders would be diluted, as their proportional interest would decrease.\n\nUltimately, the success of the company strictly depends on its ability to develop and commercialize their platform.\n\n**Financials**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h2ez2juvxjq61.png?width=699&amp;format=png&amp;auto=webp&amp;s=3bfcbb534e16fb633c5268cdd5d3bef2d2e20c00\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7byzewlwxjq61.png?width=791&amp;format=png&amp;auto=webp&amp;s=11dbcd21db8c2e9053b4cb27f04076b44e4b2310\n\n&amp;#x200B;\n\nhttps://preview.redd.it/pyikcfgxxjq61.png?width=794&amp;format=png&amp;auto=webp&amp;s=01792e5b157a981bbc80529f9dc6ffaa4dd04c7b\n\nSource: ( Wikisoft, Annual Report, 03/29/2021, SEC database)\n\nEven though there is little to no financial data that could be analyzed, Wikisoft represents a huge opportunity for investors, as the company is poised for growth in the near future. Although it is too early to make accurate price target estimates and projections, if the Wikisoft’s management team is successful in leveraging their growth strategies, Wikisoft could become a billion dollar capped company sometime In the next 3-6 years, possibly resulting in a 600% return on investment. As soon as the updated version of the online portal is launched and additional features are added, the company will initiate their marketing strategies, and around that time (expected to be in the fourth quarter of 2021), investors should start seeing revenues and cash flows from operations increasing. By that time, Wikisoft ( if nr. of shares outstanding remains the same), should be trading around $12-$15 per share. Overall, I am optimistic about Wikisoft’s long term prospects, and assign the company a BUY rating.\n\nDisclaimer: I assume no responsibility or liability for any errors or omissions in the content of the report. Any person or entity will be solely responsible for the consequences of the data, analysis, and findings of the report are used for decision making.",
        "subreddit": "Wallstreetbetsnew",
        "title": "WSFT Due Diligence",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/mhtskp/wsft_due_diligence/",
        "created": 1617307365.0
    },
    {
        "author": "Professional-Ride-62",
        "created_utc": 1617297169,
        "id": "mi00dt",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "What do you guys think? I Think Bullish",
        "subreddit": "wallstreetbets",
        "title": "MICROSOFT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mi00dt/microsoft/",
        "created": 1617325969.0
    },
    {
        "author": "Accomplished-Art5884",
        "created_utc": 1617289787,
        "id": "mhxch2",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "Square or Microsoft?",
        "url": "https://www.reddit.com/r/stocks/comments/mhxch2/square_or_microsoft/",
        "created": 1617318587.0
    },
    {
        "author": "Interesting-Sir-4534",
        "created_utc": 1617276258,
        "id": "mht7dq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "So...there were a couple of very good news catalysts for MVIS yesterday (new patent for laserscanning and the Microsoft deal with US ARMY worth of close to 22B$). MVIS parts seems to be a very big part off the hardware they are selling to the military.\n\nMicrovision only seems to have good news coming out all around for a long time so I thought I\\`d go and see how the short sellers are replying to these news. And FFS what did I see when I looked up at fintel short interst for MVIS.\n\n[https://fintel.io/ss/us/mvis](https://fintel.io/ss/us/mvis)\n\nWell the short volume for yesterday was 34% of trading volume (over 19 million shares in a day)!! Why are they so heavily shorting stocks that clearly has only upside for the future? Do they have no risk management? WTF is going on??\n\nNot a financial advice! Just a dumb ape asking questions.",
        "subreddit": "wallstreetbets",
        "title": "MVIS is now on the same track as GME was in january?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mht7dq/mvis_is_now_on_the_same_track_as_gme_was_in/",
        "created": 1617305058.0
    },
    {
        "author": "KansasCityJM",
        "created_utc": 1617299185,
        "id": "mi0rf5",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Isn’t this a big thing for unity software? Microsoft strikes a deal with the U.S. Army for augmented reality headsets",
        "url": "https://www.cnbc.com/video/2021/04/01/microsoft-strikes-deal-with-us-army-for-augmented-reality-headsets.html",
        "created": 1617327985.0
    },
    {
        "author": "TheTraderSoldier",
        "created_utc": 1617284659,
        "id": "mhvlv8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Microsoft - Free Money? I paid $8. Was this a good buy?",
        "url": "https://i.redd.it/y7qzu204gkq61.jpg",
        "created": 1617313459.0
    },
    {
        "author": "Yememachine",
        "created_utc": 1617285407,
        "id": "mhvuj0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I know you guys like stupid ass stocks and I just want to scare the hell out of my teacher. I could easily just invest in tesla, google, and microsoft and be done with it but I know that going to be a variation of that for everyone and I want to let this man know he isn't dealing with some kid doing the class because he needs a math credit before he graduates.",
        "subreddit": "wallstreetbets",
        "title": "Personal Finance class gave me an assignment to make a fake portfolio with 3k what is the most cursed fake portfolio I can make with 3k and 3 companies.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhvuj0/personal_finance_class_gave_me_an_assignment_to/",
        "created": 1617314207.0
    },
    {
        "author": "sir_voldemort",
        "created_utc": 1617276397,
        "id": "mht8o7",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Discord take on Rumors MSFT buying Discord",
        "url": "https://www.youtube.com/watch?v=dHUKVIH8rnk",
        "created": 1617305197.0
    }
]