[
    {
        "author": "co1simba",
        "created_utc": 1615679503,
        "id": "m4isv0",
        "num_comments": 766,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I also got my Autism Awareness letter from Fidelity today",
        "url": "https://i.redd.it/jzqkuea0vvm61.jpg",
        "created": 1615708303.0
    },
    {
        "author": "datle19",
        "created_utc": 1614882493,
        "id": "lxrk04",
        "num_comments": 564,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Paper handed GME last month at a loss (290 avg, sold @93). Fidelity wants me to revise my strategy 💎 🙌",
        "url": "https://i.redd.it/3as8pqq812l61.jpg",
        "created": 1614911293.0
    },
    {
        "author": "n_ohanlon",
        "created_utc": 1614799041,
        "id": "lx1xrm",
        "num_comments": 538,
        "num_crossposts": 1,
        "selftext": "Robinhood is lending your shares to shorters. Don't believe me? \n\nHow's about this, from Reuters, yesterday: https://www.reuters.com/article/us-retail-trading-robinhood-securitiesle-idUSKCN2AU2EP\n\nBut you have margin turned off! But you have a sell limit set for $69,420.69! IT DOESN'T MATTER. \n\nINSTANT SETTLEMENTS is what needs to be TURNED OFF. They even hide it away, under profile&gt;menu&gt;investing&gt;DAY TRADE SETTINGS. \n\nOn top of that, THEY DO NOT LET YOU TURN IT OFF IF YOU HAVE ANY PENDING DEPOSITS OR HAVE TRADED IN THE LAST 3 DAYS. \n\nThat's the cost of instant settlements. Sure, you get to trade quicker, but you also allow them to trade AGAINST you, and WITH YOUR OWN SHARES.\n\nCan't turn off instant settlements, don't want to be stuck in limbo for a full brokerage transfer, and determined to escape? What can be done?\n\nWell, my fellow smooth-brained ape, I'll tell you what I'm doing:\n\nThe following steps assume you are invested primarily in shares of a company, not options. EACH OF THESE STEPS WILL TAKE TIME TO PROCESS, SO PLAN ACCORDINGLY.\n\nFirst, open an account at a different brokerage. Make sure it's a cash-account (for some brokerages, like WeBull, etc., YOU MUST OPT-OUT OF SHARE LENDING). With a cash-account, you'll have to sit patiently for settlement of funds from selling shares before you can withdraw those funds or reinvest (but, let's be honest, you wouldn't be reading this if you weren't already patient). I use Fidelity, which is a cash-account by default with several opt-in programs to take advantage of down the line. \n\nSecond, IF YOU CAN AFFORD IT, transfer/deposit money into your new brokerage from your bank (or wherever else you usually get your money to trade with). If GME is your sole play, and you can afford it, try to deposit around the same amount your GME shares in Robinhood are currently worth. \n\nOnce your deposit is completed (no longer \"pending\"), wait for a small dip in the price and buy in with your new broker. \n\nWhen the purchase is complete, you can go into Robinhood and sell your shares (ideally, at the same or slightly higher price than you just bought them for at your new brokerage).\n\nWait out the next few trading days of your Robinhood account and DO NOT TRADE VIA ROBINHOOD. If you trade, you risk resetting the clock on your Withdrawable Cash. You do your trading with your new brokerage from now on. Withdraw your cash from Robinhood ASAP and put it back in your bank account, pay back your wife's boyfriend, or whatever.\n\nNow, if Robinhood wants to keep any short deals they had on your shares, THEY have to hold onto the shares, themselves. Every 1 share you were holding away from shorters (ineffectively), has now become 2 shares (1 effectively, 1 ineffectively). That, or Robinhood actually does sell the shares, which increases the length of the short chain and the costs associated with holding that position.. Thus, shorting attempts are made more expensive and less sustainable. \n\nMeanwhile, you'll be back to holding your shares without your broker selling them behind your back. \n\nTLDR: Don't let your diamond hands be sold by the pawn shop that's storing them. Getting out of Robinhood not only helps you, but also hinders the shorts. Two birds with one stone. Power to the players.\n\nObligatory, not financial advice, not an adviser or professional, do your own research, yadayada. \n\nIf I'm wrong about anything in the above, do not be surprised, but please let me know what it might be. If my foundation is rotted, please kick my case over before anyone even considers moving in. Thanks.",
        "subreddit": "wallstreetbets",
        "title": "TURN OFF INSTANT SETTLEMENTS and LEAVE ROBINHOOD!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx1xrm/turn_off_instant_settlements_and_leave_robinhood/",
        "created": 1614827841.0
    },
    {
        "author": "Bluebirdx-",
        "created_utc": 1615936652,
        "id": "m6m8m2",
        "num_comments": 389,
        "num_crossposts": 0,
        "selftext": "Please for the love of god so help me if I see one more post with a 100,000$ account going long on GME in Robin Hood I’m going to strap a propane tank to myself and become a grill for two seconds before I fucking explode next time momma wants some grilled dogs\n\nPlease for the ever loving fuck if you use robinhood sign up on Fidelity! It took me literally 15 minutes today. 15 minutes and I get to sleep soundly knowing none of my shit gets shorted to oblivion. \n\nI will do you one better! When you move to fidelity you can literally fund it directly from Robinhood! Just click on manage account and find transfer brokerage. Then plugin your robinhood account number and BAAM. Now robinhood literally can’t fucking short your game stock shares! They have to send those motherfuckers directly to fidelity and are now out of extra powder.  \n\nSomebody with more wrinkles has probably done a better job of explaining this maybe somebody could go the extra 8th mile and create a massive post with it all and have the mods pin it?\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀GME 800c Apr 4th",
        "subreddit": "wallstreetbets",
        "title": "I really don’t feel like saying this but please use a better brokerage.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m6m8m2/i_really_dont_feel_like_saying_this_but_please/",
        "created": 1615965452.0
    },
    {
        "author": "YahyaJ",
        "created_utc": 1614876102,
        "id": "lxoxsq",
        "num_comments": 261,
        "num_crossposts": 3,
        "selftext": "&gt;It's not my intention to manipulate the market, I believe in the long term value of this stock. I like the stock.  \n&gt;  \n&gt;Disclaimer: I do not provide personal investment advice and I am not a qualified licensed investment advisor (i’m an ape). I am an amateur investor who loves eating crayons. I will not and cannot be held liable for any actions you take as a result of anything you read here.  \n&gt;  \n&gt;Conduct your own due diligence, or consult a licensed financial advisor or broker before making any and all investment decisions.  \n&gt;  \n&gt;Got it? Now to the post.\n\n[Academy Sports + Outdoors](https://preview.redd.it/lb8zwwrxf1l61.jpg?width=1400&amp;format=pjpg&amp;auto=webp&amp;s=056b60e26cb70c0e52908b82f214f63c962a047b)\n\n# Quick Overview\n\nAcademy Sports + Outdoors is an American sporting goods discount store chain. It has corporate offices in the Katy Distribution Center in unincorporated western Harris County, Texas, United States, near Katy and west of Houston. For 74 years it was a privately held company owned by the Gochman family, until its May 2011 acquisition by Kohlberg Kravis Roberts &amp; Co investment firm. ASO went public on October 2, 2020. It raised $250 millions after issuing 15,600,000 shares at a price of $15.00-$17.00 per share.\n\n&amp;#x200B;\n\n# In Depth Overview (Yahoo Finance)\n\nAcademy Sports and Outdoors, Inc., through its subsidiaries, operates as a sporting goods and outdoor recreational products retailer in the United States. The company sells a range of sporting and outdoor recreation products, including sporting equipment, apparel, footwear, camping gear, patio furniture, outdoor cooking equipment, and hunting and fishing gears primarily under the Academy Sports + Outdoors, Magellan Outdoors, BCG, O'rageous, and Outdoor Gourmet brand names. As of August 1, 2020, it operated 259 Academy Sports + Outdoors retail locations in 16 states and three distribution centers located in Katy, Texas, Twiggs County, Georgia, and Cookeville, Tennessee. The company also sells merchandise to customers via academy.com website. Academy Sports and Outdoors, Inc. was founded in 1938 and is based in Katy, Texas.\n\n&amp;#x200B;\n\n# Investors\n\nMajor holders that have opened new positions in ASO / Academy Sports and Outdoors, Inc. include Kohlberg Kravis Roberts &amp; Co. L.P., Samlyn Capital, Llc, Tiger Global Management Llc, Scopus Asset Management, L.p., Vanguard Group Inc, Federated Hermes, Inc., BlackRock Inc., FKASX - Federated Kaufmann Small Cap Fund Class A Shares, Millennium Management Llc, Carlson Capital L P, FCPGX - Fidelity Small Cap Growth Fund, LOMMX - CGM Mutual Fund, Capital Growth Management Lp, Marshall Wace North America L.P., Fmr Llc, Six Columns Capital, Lp, VTSMX - Vanguard Total Stock Market Index Fund Investor Shares, NAESX - Vanguard Small-Cap Index Fund Investor Shares, Stormborn Capital Management, Llc, and IWM - iShares Russell 2000 ETF.\n\nhttps://preview.redd.it/c77g67wjg1l61.png?width=1325&amp;format=png&amp;auto=webp&amp;s=258b85510f3c64eca7f16b73903c5d335d32117a\n\n# Short Interest\n\nhttps://preview.redd.it/r7cqf7qmg1l61.png?width=406&amp;format=png&amp;auto=webp&amp;s=21d2927a5e61205a18a514c9a5ce030fb92d4196\n\nhttps://preview.redd.it/d21xj86ng1l61.png?width=961&amp;format=png&amp;auto=webp&amp;s=1ece96d5f6eb73d8d247fc4d1b6c9313288f728d\n\n# Price Target\n\nThe latest price target for Academy Sports (NASDAQ: ASO) was reported by Loop Capital on 2021-01-28. The analyst firm set a price target for 30.00 expecting ASO to rise to within 12 months (a possible 17.65% upside). 9 analyst firms have reported ratings in the last year.\n\nASO currently has potential to double it’s price by 2023.\n\nhttps://preview.redd.it/qv0g777rh1l61.png?width=1627&amp;format=png&amp;auto=webp&amp;s=8b0d191d519c7a74850c31b7db300c357491577e\n\n&amp;#x200B;\n\n# The Texas Factor\n\nhttps://preview.redd.it/a1fr9qyrg1l61.jpg?width=1500&amp;format=pjpg&amp;auto=webp&amp;s=f5b9c78956de8e73c2a4bc09f8fbd6a0217c0e7a\n\nThis week texas removed all restrictions, in other DDs some texan users reported that ASO stores were full of people, especially since this stores are sellers of AMMO.\n\n&amp;#x200B;\n\n# My plan\n\nRight now i don’t have a position yet, my plan is to see how the stock will react to the market tomorrow. If i see a spike of volume and a price change of at least 7% in the following days i may jump in ready for the squeeze.\n\n&amp;#x200B;\n\n# TL;DR\n\nQuoting u/Aries4011\n\n&gt;**It’s an outdoors retail stock with top 5 short interest. They sell guns too. 🚀**\n\n&amp;#x200B;\n\n# Other DDs\n\n[ASO - DD - First timer - Spreading some knowledge](https://www.reddit.com/r/wallstreetbets/comments/lxd1lb/aso_dd_first_timer_spreading_some_knowledge/)\n\n[DD: ASO 🚀🚀🚀GME fuel](https://www.reddit.com/r/wallstreetbets/comments/lx5epa/dd_aso_gme_fuel/)\n\n[$ASO DD Criminally Undervalued](https://www.reddit.com/r/wallstreetbets/comments/lwybmb/aso_dd_criminally_undervalued/)\n\n[(ASO) Academy Sports and Outdoors Next RKT similar fundamentals](https://www.reddit.com/r/wallstreetbets/comments/lwiacq/aso_academy_sports_and_outdoors_next_rkt_similar/)\n\n[Ammo shortage and making tendies, an academy sports love story](https://www.reddit.com/r/wallstreetbets/comments/llm1mq/ammo_shortage_and_making_tendies_an_academy/)\n\nEDIT:\n\nREAD the plan part, don't jump on this stock or any other stock on a red week.",
        "subreddit": "wallstreetbets",
        "title": "The ONLY DD You Need on ACADEMY SPORTS + OUTDOORS $ASO - The 4th Most Shorted Stock With 91% institutional Ownership 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxoxsq/the_only_dd_you_need_on_academy_sports_outdoors/",
        "created": 1614904902.0
    },
    {
        "author": "Chuckles77459",
        "created_utc": 1615749764,
        "id": "m520iq",
        "num_comments": 258,
        "num_crossposts": 0,
        "selftext": "Let's start this out by saying everything here is mostly estimates. Info is from various sources, but a lot of it is \"roughly\". Nothing is from \"I saw someone say that..\" the info is from various sources on google. Please do your own searches on any info you doubt. The points remain the same even with a few percent differential. This is strictly to get a realistic view of retail power. There is lots of data out there, some of it contradicts or is different from one another, I'm just trying to give you some data. I'm sick of the \"retail is nothing\" push, and I'm here to prove it wrong.\n\nUSER NUMBERS FOR BROKERAGES\n\n* Robinhood 13m users, - **7.5m owned GME** during a period in Jan. We know around 50% of users held GME on robinhood in Jan.\n   * Average account size - [$3500](https://www.businessofapps.com/data/robinhood-statistics/) (Other estimates are $1000-$5000 from J M (&lt;- for automod) Pee, and $4800 from Alphacution) Total would then be $45.5B. Used this line of data for anything I did later.. but..\n      * \" J M Pee Securities analyst Devin Ryan estimates Robinhood’s total accounts are now closer to 23 million\" [Here](https://www.cnbc.com/2021/02/25/robinhood-is-still-on-track-for-a-hot-ipo-despite-the-gamestop-controversy-.html#:~:text=Robinhood's%20Tenev%20told%20Congress%20last,about%20%245%2C000%2C%20the%20company%20said)\n      * \"Its average account size is about $5,000, the company \\[Robinhood\\] said\" \\^ same link as above\n* E-trade- 5.2m users\n   * Assets under management (retail) $346 billion\n   * $66,538 average acc size for retail\n* TD ameritrade- 11m users\n   * Average account size [118k](https://www.fool.com/the-ascent/research/online-brokerage-statistics/)\n   * $1.3 TRILLION total\n* Interactive brokers 1.25m users\n   * Average account size 264k [(this is a PDF by the way)](https://investors.interactivebrokers.com/ir/main.php?file=latestMetricPR)\n   * $330B total\n* Allyinvest - 350k users\n   * Average account size [22k](https://www.fool.com/the-ascent/research/online-brokerage-statistics/)\n   * $7.7B total\n* WeBull (at least) 2m users\n   * Rough estimate average account size [$3k](https://www.brokerage-review.com/investing-firm/assets-under-management/webull-aum.aspx#:)\n   * Rough estimate total $30B\n* Schwab (as of June 2020) 14.1m\n   * Average acc size [327k](https://www.fool.com/the-ascent/research/online-brokerage-statistics/)\n   * $4T total\n* Fidelity 30m users, harder to find exact numbers on Fidelity\n   * \"Approximately [$3.6 trillion](https://www.brokerage-review.com/investing-firm/assets-under-management/fidelity-aum.aspx) of broker’s client assets are in non-managed accounts and funds.\"\n      * 120k average non-managed (based on above figures)\n   * \"About $1.3 trillion are managed by Fidelity investment advisors\" \\^same article\n      * 43.3k average managed (based on above figures)\n* Tradestation 1m users &lt;--- this one may be very very inaccurate, struggling to find good info\n* Merrill Edge (as of sept 2018) 2.5m &lt;----- Also been hard to find great info on them, not thrilled with my source\n   * (As of June 2020) \"responsible for more than [$962 billion](https://www.magnifymoney.com/blog/investing/merrill-lynch-wealth-management-review-ria/#MerrillLynchWealthManagementshighlights) assets under management\"\n   * That would mean average user $24.8k\n* Vanguard 30m+ users\n   * Read [this PDF](https://personal.vanguard.com/pdf/how-america-invests-2020.pdf), a LOTS of good info in here. Read below first, 2nd bullet is important to understand.\n      * \"Recognizing that the household is the primary economic unit, the focus of this analysis is at the household level. The universe for our analysis consists of 5.1 million Vanguard retail investor households. The median household size is one person. Collectively, **households in this report are investing close to $2 trillion** in their accounts at Vanguard, with a median account balance of **$60,900.**\"\n      * \"**for this report, only those enrolled in Vanguard Personal Advisor Services® (PAS) are known to be advised**\" - I assume this is why they have 30m users, but only 5.1m in this report. Not everyone uses PAS, that's for getting access to advisors (and paying a fee).\n      * Vangaurd reports [30m investors](https://about.vanguard.com/who-we-are/fast-facts/) and total of $6T AUM\n* Firstrade 1m+ users\n   * These are estimates, but [7k average account size](https://www.brokerage-review.com/investing-firm/assets-under-management/firstrade-aum.aspx) for a total of $70B AUM\n\n97.9m\\~ users WITHOUT including Robinhood. Just shy of $18 TRILLION rough numbers. Then remember, *there's international markets*. [This article](https://edition.cnn.com/2021/01/29/investing/china-gamestop-investors-intl-hnk/index.html) doesn't have sources, but it points out how global GME went. There's many more articles like it, for plenty of countries. Europe, India, Asia are several places I saw people trying to get in on the action. \"China’s approximately 200 million retail investors trade more often than any other investors on Earth—81 percent said they trade at least once a month\" [From this article](https://www.cnbc.com/2015/07/09/three-charts-explaining-chinas-strange-stock-market.html)\n\n*Let me remind you that a stock like GME as of today has estimated between 27m-40m shares in the float, and a market cap of 18.4B at today's price.* **Retail has no control my ass**. Lets take a look at this:\n\nA graph of apple users versus apple price from robinhood's API in 2020, going up to 8/6/2020. They stopped offering this information via API at this date.  We can ignore apple price here, we're looking just at ownership.\n\n&amp;#x200B;\n\n[Source: Robintrack.net](https://preview.redd.it/1xji566rn1n61.png?width=1633&amp;format=png&amp;auto=webp&amp;s=202fbbb95234ba5a1a6ae13453c992879805b25e)\n\nThe above shows on 8/6, 730k RH users owned Apple. That's 5.6% of users at the time using their 13m users number, which the total user number I would speculate is a bit lower at that time, as they grew from 10 to 13m users in 2020. RH stopped their API showing this info, so 8/6 is the most recent you can get on any company.\n\n&amp;#x200B;\n\nGME was the most popular stock on RH, so I find it reasonable to believe at least 5% owned it, most likely WAY WAY more considering the global exposure this got. Once again, RH average account size is $5k. Please do the math here of how Jan may have looked. **This is ONLY on Robinhood**. Of course this is speculation here, but I feel that it's pretty reasonable. It's speculation based on prior data. &amp; if users really are 23m, that's even crazier. Here's math below about what GME could have looked like. This is based on 13m users. Then, **add all of the other brokers**. This chart is only robinhood. You get the idea. Realistically, *other* brokers ownership percentage probably isn't *as* high, but it's still going to be way up there, especially during the GME phenomenon.\n\n&amp;#x200B;\n\n|If average # of shares per person is|% of RH users that owned the most popular stock|Total shares owned on RH|\n|:-|:-|:-|\n|1|5|730k shares|\n|1|10|1.46m shares|\n|5|5|3.65m shares|\n|5|10|7.3m shares|\n|10|5|7.3m shares|\n|10|10|14.6m shares|\n\n&amp;#x200B;\n\nAnyways, moving back to the more broad discussion and no longer focusing on GME.\n\n\"The **total market capitalization** of the **U.S. stock market** is $50,808,508.7 million(over complicated way of saying $50.8T (12/31/2020)\"\n\n&amp;#x200B;\n\n[Source: https:\\/\\/www.nasdaq.com\\/articles\\/who-counts-as-a-retail-investor-2020-12-17](https://preview.redd.it/ludljsdtn1n61.png?width=1003&amp;format=png&amp;auto=webp&amp;s=1cd3e4113641f443d002de2dde95913532440a47)\n\nIt appears our estimates line up pretty closely with other data. *Notice how mutual funds are SEPERATE here.*\n\nSo why does retail \"not control the market\" ?\n\nPersonally, I disagree with this statement. Retail does control the market. **Then why is there a narrative that retail doesn't control the market?** Two main reasons in my opinion. Yes, this is speculation based on data. Form your own conclusions. Here's insight into mine.\n\n1. Retail isn't coordinated. Even though we collectively own over 1/3 of the market, we can't coordinate things like the elite can. We can't dump 1 million shares all at the exact same time to tank a stock price. We can't control the media narrative because we don't own/aren't in bed with the media, so we lose some influence here. Retail doesn't control the day to day action on a stock, but retail controls it from a broader sense. *One raindrop cannot cause a flood, but continuous raindrops over an extended period of time do*.\n2. Information **IS** becoming a commodity, there's just so much shit and misinformation to sift through right now, it's difficult for most people. Retail gains more and more control every day through decentralization and increased freedom of information on the internet. *They ARE terrified of retail*. The potential for \"power\" to shift back to the people out of the elites hands is higher than ever with the advancements of tech. I could write a whole paper on this concept. I believe decentralization is the future for everything. Information, politics, money, stocks, etc. It is imperative for the elite to keep this knowledge away from the people. Knowledge is power. Poverty and education are linked significantly. Keeping people in the dark and unaware of their capabilities is an extremely powerful tool that has been used to suppress people since civilization began.\n\nI know above points might sound a little bit over the top, but these are my opinions based on data. I'd be happy to engage in talks around any of these points. There may be data that is just plain wrong, or that I misinterpreted. Please poke holes in anything.",
        "subreddit": "wallstreetbets",
        "title": "Regarding \"retail has no power\" - Numbers, data, a reality check, &amp; why you're wrong.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m520iq/regarding_retail_has_no_power_numbers_data_a/",
        "created": 1615778564.0
    },
    {
        "author": "MalcontentRonin",
        "created_utc": 1615823191,
        "id": "m5nkzb",
        "num_comments": 196,
        "num_crossposts": 0,
        "selftext": "The last year was tough. I've got a kid to feed, you know. So I've been here looking to make some money alongside the rest of you apes, and I was willing to take the risk. When GME dropped to less than 50 only a week after record highs, I knew things were not over. So I bought in and have been happily watching the gains these past few weeks.\n\nThing is, I wanted more. With the price so high, I was looking at Options. I was looking at GME a week ago. It was trading at 138. I went to buy a Call Option at 40 with a strike price of 140. Let's say I sold it at a price of 280. That option would have been 10k in the money! Unfortunately I have to say \"would have been\" because I did not buy that option. Not because I didn't want to, but because I wasn't ALLOWED to do so. What gives? The little guy can't get access to real trading strategies? Wall Street has to screw us over like that?\n\nI mean hey, I understand having to ask for approval first. Accept the risks and all that. So fine, I did that. Robinhood gave me a big FU. Fidelity, which has been my brokerage app, said I needed to wait a few days. On Friday I was told I got approved. Awesome. All good now, right? OF COURSE NOT! I'm a little guy, so the only position I am entitled to is being screwed.\n\nThis week I decided to start small, grab a Call on AMC with a strike price of 12. The price just hit 14, so that option was about 2k in the money. Nice start. Needless to say, I went to buy the option and was denied. Oh sure, I had been approved for options trading. Buy only at Level 1, which paradoxically doesn't allow you to actually buy options. Does that make sense to anyone? Don't ask me for experience, assholes. You're creating a Catch-22. How can I ever get experience if you won't let me try?\n\nIs it fair to say Wall Street has been quite literally taking food out of my kid's mouth? Because I think that's fair to say. Maybe you agree that it should be difficult to get approved for options trading. That opinion is incompatible with a YOLO play, so get out of here. If anyone knows a place with enough integrity to give the little guy a chance, I would love to know. I deserve a chance to learn.",
        "subreddit": "wallstreetbets",
        "title": "How Is The System Still So Rigged Against Us?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m5nkzb/how_is_the_system_still_so_rigged_against_us/",
        "created": 1615851991.0
    },
    {
        "author": "phsv",
        "created_utc": 1615329486,
        "id": "m1id6u",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "With RBLX going public tomorrow? How would I go about buying the stock through Fidelity? Would I wait for it to be listed? First time buying direct listing, not sure if it's different. Would you all recommend using a different broker like Robinhood? Or would it be the same experience\n Thank you in advance.",
        "subreddit": "stocks",
        "title": "Roblox (RBLX) through Fidelity?",
        "url": "https://www.reddit.com/r/stocks/comments/m1id6u/roblox_rblx_through_fidelity/",
        "created": 1615358286.0
    },
    {
        "author": "redrocketinn",
        "created_utc": 1615756759,
        "id": "m54j4u",
        "num_comments": 155,
        "num_crossposts": 0,
        "selftext": "# Voting for the merger has been announced. Votes must be received by April 12, 2021.\n\n# Additionally, the merger date has been announced to be completed on or about April 20, 2021.\n\nYes, that's hilarious. No, it's [not a joke.](https://newsfilter.io/a/d5252aab52e2037811259db9e4a870d0)\n\n&gt;**Q: When will the Arrangement become effective?**  \n&gt;  \n&gt;A: Subject to obtaining the approvals described above, as well as the satisfaction or waiver of all other conditions precedent set out in the Arrangement Agreement, it is anticipated that the Arrangement will be completed on or about April 20, 2021.\n\n# Below is information on how to vote for two of the major brokerage firms:\n\nFidelity:\n\n[https://scs.fidelity.com/accounts/services/content/Proxy\\_voting.shtml#proxyhow](https://scs.fidelity.com/accounts/services/content/Proxy_voting.shtml#proxyhow)\n\nSchwab:\n\n[https://client.schwab.com/app/service/proxyevents/](https://client.schwab.com/app/service/proxyevents/)\n\nI couldn't find any information on any of the other firms. If you are using other brokerages and know where that information is and how to vote, please comment it below for others to read and I will also update it in the post.\n\n# 4/20 BABY",
        "subreddit": "wallstreetbets",
        "title": "IMPORTANT MERGER INFORMATION FOR SHAREHOLDERS OF APHA AND TLRY",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m54j4u/important_merger_information_for_shareholders_of/",
        "created": 1615785559.0
    },
    {
        "author": "irishdud1",
        "created_utc": 1615453324,
        "id": "m2m0v4",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": "Automod did not care for certain Bill Ackman Spac on my screen shot of positions. I moved my 3/19 $800s to 4/16 and averaged up because I don't know what the hell I'm doing.\n\nSitting on lots of shares in my Fidelity but the dynamite lives in my Schwab account. It's going to be an interesting few weeks. \n\nhttps://preview.redd.it/dopyicm96dm61.png?width=750&amp;format=png&amp;auto=webp&amp;s=ac83c9eab6578f004a1d05f96be6c2430bf649f9",
        "subreddit": "wallstreetbets",
        "title": "Is this how one YOLOs? Part deux. $1.1M+ in 4/16 $800 call options 2nd attempt",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m2m0v4/is_this_how_one_yolos_part_deux_11m_in_416_800/",
        "created": 1615482124.0
    },
    {
        "author": "SquirrelyInvestor",
        "created_utc": 1617103887,
        "id": "mgduqu",
        "num_comments": 141,
        "num_crossposts": 0,
        "selftext": " **Understanding the SPAC Market**\n\nIn the long run, markets are efficient. In the short run, there are massive dislocations in markets caused by structural changes, behavioral effects, and positioning that cause short term inefficiencies. The SPAC market has shown a considerable amount of inefficiency for the past 12 months which has allowed investors to generate tremendous profits on a nearly “risk free” basis (or more accurately, an abnormally high level of profits with exceptionally low levels of risk).\n\nSpecifically, investors could buy pre-merger SPACs at, near, or below their $10 NAV levels, and then generate 50%+ profits when those companies announced a pending deal (definitive agreement). The holding periods of these investments would range from weeks to months, leading to annual returns in excess of 100%.\n\nThis short run inefficiency no longer exists and will not return in any substantial way. To understand why, you need to understand and examine the circumstances leading up to the past twelve months that created the inefficiency, and the market reaction that has occurred in order to correct this inefficiency.\n\n**The “old” SPAC market**\n\nPrior to 2020, the SPAC market was a tiny part of the overall equity issuance world. The first reason for this is signaling- SPACs were viewed as a “shady” way of going public. Institutional investors would typically see a company going public via SPAC as damaged goods “If the company was any good, it would do a traditional IPO”- at least that’s the message all of Goldman, Credit Suisse and Morgan Stanley bankers kept parroting. This resulted in SPAC companies being ignored by institutional investors, which makes it hard for a company to attract capital, build an investor and liquidity base, etc. To add insult to injury, bankers write sell-side research (Goldman Sachs initiatives coverage on XYZ Company with $45 price target) as a quid-pro-quo for investment banking business (read: IPO and other issuance fees). If you go public via SPAC, most of the big banks won’t publish research about you, institutional investors will shun you, and you’re going to have a hard time. As a self-fulfilling prophecy, good companies were steered away from SPAC deals, so only a handful of “less good” companies went public via SPAC, and those companies inevitably didn’t perform well on public markets, cementing the past 10 years of data showing “SPAC companies generate poor returns on public markets.”\n\n**The “old” SPAC trade**\n\nDespite this, there was a bit of a funny “glitch” in the SPAC market. The idea that investors could redeem their shares for the original NAV value, plus accrued interest (held in risk free treasury bills), and also get a free warrant (or partial warrant).\n\nTo astute institutional investors, they could buy SPAC IPO units at $10, get a warrant (which they could turn around and sell), and then redeem their $10 share for \\~10.40 after two years (assuming 2% interest rates). For these same investors, who regularly hold billions of dollars of treasuries, re-allocating some of their treasury-allocation to SPACs provides a basically strictly-dominant return (with a liquidity trade-off, you can’t sell blocks of pre-DA SPACs very easily).\n\nLarge pension funds and other institutional investors had incredibly simple strategies. Blindly buy SPACs at $10, sell the warrant for whatever price you can, redeem the stock for $10 and you’re ahead. What’s interesting is that the “alpha” in this trade came from the liquidity in the warrant and desperately trying to sell it. Consider that for the last decade, many SPAC deals never traded above $11. Not before the DA, not after the DESPAC, literally never. Trying to sell 2 Million warrants at 80 cents each into a market that trades 5000 warrants a day, is a non-trivial problem (especially when there’s four other funds also trying to sell 2M warrants). “What do we do if the stock goes up to $15 or $20 pre-DA” wasn’t a question, because it essentially never happened. That’s also why pre 2020, the average amount of redemptions was around 50% of all capital invested.\n\n[Here’s a graph from spacresearch.com](https://i.imgur.com/KDEEld5.png) that shows deals from 2015-2018 and you can see that only 1 deal was trading above $15.\n\nOkay, to summarize the most important point of this section, it’s the fact that SPAC IPO investors (the ones buying units at $10.00), are interested in selling the warrants whenever they can, at any price, and their primary plan is to hold the stock to the deal and redeem it. Selling the stock before the DA isn’t a major concern of theirs. I stress that this is all pre-2020 (many readers are unaware of the SPAC market before 2020, so this all sounds very unintuitive to them).\n\n**DraftKings changed everything**\n\nThe exact reason why Draftkings went public via SPAC isn’t officially stated (most speculate it’s because they operate in a fuzzy legal area with respect to sports betting and fantasy sports), but ultimately they announced/leaked the deal on Dec 23, 2019. On that date, original SPAC investors laughed all the way to the bank, and they sold as many shares as they could, for a whopping $10.80 representing an 8% return over NAV. This was “a big DA pop” back in those days. On that same first day of trading, 10M shares traded- which at the time was also a ton of shares to trade for a SPAC announcement (in 2021, we regularly see 50M shares trade on the DA day).\n\nWhat happened in the ensuing weeks, has basically never happened in the history of SPACs. A torrent of retail interest came to buy shares of DKNG pushing the stock price to $18 in the next 5 weeks. The reason for this is that Draftkings was an extremely well-known retail “household” name and offered a pure-play in the fantasy sports/betting business (also note this was pre-covid). Now to be clear, this “torrent of retail interest”, on a relative basis was still tiny compared to what we see in the 2021 SPAC market. But ultimately, there wasn’t a large supply of shares in the market. While some SPAC institutional investors sold aggressively for prices they’d never dreamed of, many simply held out (I posit that holding was less of a strategy, and more of a residual of not caring and not having a plan in place to do anything other than redeem or sell on the deSPAC date).\n\n**Draftkings had some luck, but also did everything right…**\n\nThe COVID tailwind in February/March ultimately helped propel interest in DKNG and the stock climbed. This created a strange situation where institutional investors were suddenly caught significantly under-allocated in a business that they wanted/needed to have as part of their portfolio. A large institution like Fidelity/DE Shaw/Blackrock etc. will typically get “first look” at all companies in the IPO process and sign up for blocks of 2, 5, 10 million shares when the company IPOs. Virtually overnight, a $10 Billion dollar business that was highly sensitive to the COVID/Sports market was public and they needed huge amounts of shares. Buying large blocks of the stock wasn’t feasible on the open market because the float of the stock was still tiny (The SPAC shares were floating, but most insider and early investor, PIPE shares were still locked up). DKNG made the smart move to hire the same investment bankers that they originally circumvented in the IPO process, to do multiple secondary offerings into the market. This allowed the bankers to collect 5% fees on hundreds of millions of dollars of shares (issued by the company and also sold by insiders), and crucially, got DKNG a ton of coverage from sell-side banks initiating price targets. While the company started as a SPAC, they quickly caught up with the “typical institutional flow” of a traditional public company.\n\n**The follow-up...**\n\nDraftkings was crucial for a few reasons. Most importantly, it added legitimacy to the SPAC process, which paved the way for other high-quality companies to feel comfortable with going public via SPAC. In a very close second, DKNG whet the retail appetite for SPACs. Many retail investors started going on the hunt for “the next Draft Kings”, and we saw record amounts of retail interest in SPACs in 2020. To be fair, there was record amounts of retail interest in stock markets overall in 2020 during COVID, but the relative amount of interest (pre and post covid) was dramatically higher in SPACs. If investors are looking for “the next Draft Kings SPAC”, and also looking for “the next Tesla”, the obvious intersection of that ends up being NKLA, HYLN, QS, etc.\n\nMore or less any SPAC that announced a deal in 2020 showed massive gains due to a lack of institutional sellers (the passive strategy from pre 2020 days) and immense retail interest concentrated on a very low number of deals.\n\n**Where we are today…**\n\nIn 2021, a dozen new deals are being announced every single week. There simply isn’t enough “retail money” to plow into these deals with significant interest/liquidity to push these stocks up from $10 to $15, $20, $25 like what was happening in late 2020. To make matters more difficult, the nature of the institutional investors has changed as well.\n\nThe sleepy, quiet, traditional, SPAC investors of the past decade have been replaced by hedge funds. These hedge funds have seen the “DA Pop” effects and realize they can generate immense returns at nearly risk-free levels, and aggressively buy the SPAC IPO shares with the intention on selling every DA POP indiscriminately.\n\nThere’s a reason for this, if a hedge fund can by a $10 unit (which is virtually risk free), and sell the stock+warrant for $12+ on the DA announcement, they’re generating a 20%+ risk free return. This, with leverage, is far better than generating a 50%, or 75%, or even 100% return that has significantly higher risk (holding the company and hoping enough retail interest comes to push the stock higher).\n\nThis is the logical consequence of markets being competitive and efficient. Clever retail investors ([r/spacs](https://www.reddit.com/r/spacs)!) generated abnormal, excess returns for the past 9 months and smart (large) hedge fund money has copied the strategy and crowded out the retail money.\n\n**Putting it all together…**\n\nJust to recap with simplified numbers, in 2020 there were about 20 SPAC deals, and only about 25-50% of institutional investors aggressively sold their shares on a DA pop. With say, a Billion dollars of retail money (demand) plowing into these deals, we saw the stocks pop to $20+ on a regularly basis (or $100+ in the case of QS).\n\nIn 2021, there are nearly 100 SPAC deals (over 3 months), and 75% of institutional investors are hedge funds that are aggressively selling their shares on the DA pop. With these hand-waivey numbers, unless there is 10x the amount of retail demand pouring into the market, we can’t/won’t see the same market pops.\n\nMore importantly, (and critically), we shouldn’t be seeing these DA pops and all of this is consistent with what we expect to see from a market becoming smarter and more efficient over time.\n\n**But I pick good Management Teams…..**\n\nIt generally doesn’t matter, because there are so many SPACs chasing a limited number of targets, and the SPAC deal makers don’t bring much to the table other than cash (which is the same regardless of who you deal with). The only reason a SPAC should have a “DA Pop” is because the deal has been mispriced (the company agreed to do the deal at too low of a price). If a CEO wants to do a SPAC deal, they can just run a competitive process (bidding war) and find whoever is willing to give them the highest valuation (which is great for the company, bad for the SPAC shareholders hoping to make a quick buck). This significantly reduces the chance that the deal will be mispriced, which reduces the chance of the DA pop. If a CEO wants to underprice to get a DA pop, they can run a traditional IPO.\n\nTo summarize the effects again:\n\n1. Retail capital chasing DA’s is diluted across many more deals, giving each one less of a DA pop due to fewer people buying DA’s.\n2. Institutional capital is aggressively selling DA’s since it’s an arbitrage trade for them, adding to the supply of shares being sold on the DA.\n3. Deals are priced more competitively since there’s many SPAC sponsors chasing the same deals.\n\nIt’s incredibly important to understand that these 3 factors weren’t in play in 2020, and that’s why the trades worked. If you made a ton in 2020, congrats for being smart and early. If you think you can repeat the performance in 2021, I have very bad news for you.\n\n**So… what’s next, how do I make money?**\n\nI noted above that SPAC deals are competitive and typically will close at the highest valuation. I’ll follow up by saying that I am very confident that the highest valuation is not the correct valuation. In most cases, it will be too high (meaning the stocks will, on average, perform poorly in the future), and in other cases it will be too low (meaning the stocks will do well in the future). Due to the aforementioned liquidity mechanics that I highlighted above, even if it’s a “good deal, at a great valuation.”, the DA pops are being sold indiscriminately by hedge funds creating opportunities for investors to be investing in great companies at great prices. The very mechanics that have closed one market inefficiency (trading the DA pop), has created a new one (investing in great companies that deserve higher prices). That being said, the latter is an investing strategy that is extremely difficult to get right because it literally just resembles standard investing (buy good companies at good valuations). This is very different than “I buy SPACs at NAV and make 50%+ annual returns, this will obviously work forever, and I am a genius.”\n\n**More thoughts to follow...**\n\nSorry this has the wrong flair, I can't use the discussion one as a lowly spacling :(",
        "subreddit": "SPACs",
        "title": "Understanding the past and current SPAC Market",
        "url": "https://www.reddit.com/r/SPACs/comments/mgduqu/understanding_the_past_and_current_spac_market/",
        "created": 1617132687.0
    },
    {
        "author": "CockVersion10",
        "created_utc": 1617218420,
        "id": "mhdj47",
        "num_comments": 125,
        "num_crossposts": 0,
        "selftext": "Hey guys and gals, so fundamentally my question is very simple, but the details are a little more complicated, so please bear with me!\n\nSo initially, I gave the advice of just \"keep 10 years of expenses in the bank, buy VOO and wait around\"; however, there are a few questions I have considering the large sum and she'd like to be very careful with her life savings. \n\nSo, IF she were to just buy VOO and wait on it, are there any advantages or disadvantages in choosing any of the main brokerages over each other: Charles Schwab, Fidelity, Vanguard? If so, what are they? To my understanding, VOO has no commission on any of those platforms, and Charles Schwab is considered the best banking brokerage. I'm strongly considering this for her, since she won't be trading much at all in this scenario. Please let me know any further details you might know.\n\nSecondly, we are considering using a private fund manager. I understand over these longer periods, most funds don't beat the SP500, and they're probably realizing your gains and not taking advantage of the reduced tax on long term capital gains. So what are the advantages for her in this situation? I'd imagine they can beat the SP500 when things aren't as bullish as they have been--is that true? If so, that might sway our decision toward them. I know you can't predict a crash, but the market is certainly due for a correction, and maybe reallocating out of the SP500 would hedge some losses there.\n\nAny input would be greatly appreciated!",
        "subreddit": "stocks",
        "title": "HELP: My mom has 2.5m USD sitting in a .7% interest account",
        "url": "https://www.reddit.com/r/stocks/comments/mhdj47/help_my_mom_has_25m_usd_sitting_in_a_7_interest/",
        "created": 1617247220.0
    },
    {
        "author": "Repulsive_Impact_651",
        "created_utc": 1614725574,
        "id": "lwet6f",
        "num_comments": 122,
        "num_crossposts": 0,
        "selftext": " This was seen on Charles Schwab StreetSmartEdge Block Trade indicator Tool JUST as market closed. 3 4.8 million share buys. These values match up with the expired options from Friday. These queued buy orders have NOT gone through yet. Allegedly, one hit the books but did not activate at the strike price while the other two will hit and activate tomorrow morning at the strike price. Cross checked on Fidelity and saw the one order that did go through.\n\nRecap-- These all came at the bell. We think only one went through with a strike price that WASN'T HIT and the other two came in AH and wont activate until tomorrow morning. We don't believe any of them have activated and believe all 3 will activate tomorrow morning.\n\nTomorrow morning may be a super green open via the gamma squeeze. This can lead to options expiring in the money on Friday and make next week super interesting. Hold this. PLEASE hold this.\n\n&amp;#x200B;\n\n*Processing img d0d8re4j2pk61...*\n\nhttps://preview.redd.it/vc17c95l2pk61.png?width=711&amp;format=png&amp;auto=webp&amp;s=39402a237aedf2c9a9179d15b66439764a32612e",
        "subreddit": "Wallstreetbetsnew",
        "title": "Potential AMC Gamma squeeze tomorrow! Over 14 million shares to be bought!",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lwet6f/potential_amc_gamma_squeeze_tomorrow_over_14/",
        "created": 1614754374.0
    },
    {
        "author": "TripleBrain",
        "created_utc": 1615362363,
        "id": "m1scfk",
        "num_comments": 118,
        "num_crossposts": 0,
        "selftext": "I'm quite sure if I posted this on any WSB-related thread I'd get blasted with death threats and insults about my rationale.\n\nELI5:  The last two days of GME/AMC movement seems to be driven by something other than a hedge squeeze. Volume is 1/5th of previous squeeze, order flows for GME per Fidelity is NET NEGATIVE (meaning more selling than buying) and for GME, near break even. Maybe, if we're lucky, we continue to see green for another day or two, but I have a bad feeling about a rug incoming, and it's going to be quick and sudden. \n\nThe same goes for the energy sector with TSLA, NIO, XPENG among others. They've been beaten down and I don't see any reasonable shift towards such heavy green across the board. SPCE, Cannabis, etc. were all beaten down and have all resurfaced green. China stocks have also turned green after the blood week. I don't see this as a buy the dip as volume is simply too low. The LVL2 data all day for multiple tickers have been odd in that there were a pattern of similar numbers ( like 32 for GME) that kept showing up on the buy and ask side for hours.  \n\nTrade safe guys!",
        "subreddit": "stocks",
        "title": "Be Careful Trading This Week",
        "url": "https://www.reddit.com/r/stocks/comments/m1scfk/be_careful_trading_this_week/",
        "created": 1615391163.0
    },
    {
        "author": "pleadinginsanity2",
        "created_utc": 1617197715,
        "id": "mh68y3",
        "num_comments": 97,
        "num_crossposts": 0,
        "selftext": "I know this has been discussed a lot already, but I would like to hear from people on Just these two brokers. I am using Robinhood and I really like it, but with all the hate directed at them for the way they do business. I can't decide between TD Ameritrade and Fidelity and have opened accounts at both, now I am trying to decide which one to fund or if I should use Fidelity for my long positions and TD for my active trading. I read that TD uses PFOF, which seems to be a negative, but it looks simpler to use. Fidelity seems solid as a rock, but even Active Trader Pro is confusing to me. I really like the simplicity of Robinhood, but the concerns with it have convinced me to switch.",
        "subreddit": "stocks",
        "title": "TD Ameritrade or Fidelity?",
        "url": "https://www.reddit.com/r/stocks/comments/mh68y3/td_ameritrade_or_fidelity/",
        "created": 1617226515.0
    },
    {
        "author": "electricforrest",
        "created_utc": 1615465775,
        "id": "m2p13o",
        "num_comments": 91,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Fidelity predicts GME squozes to $18,000, AMC to $875. HOW MUCH DO YOU LIKE THE STONK?💎🙌🚀🚀🚀",
        "url": "https://www.reddit.com/gallery/m2p13o",
        "created": 1615494575.0
    },
    {
        "author": "TheSyrupCompany",
        "created_utc": 1615423015,
        "id": "m2dkuc",
        "num_comments": 86,
        "num_crossposts": 0,
        "selftext": "**$ILUS 11 Page In-Depth DD Document:** [https://drive.google.com/file/d/1jbCYKYR4e1S1ze28mvSVtVwm9IFcdfKc/view?usp=sharing](https://drive.google.com/file/d/1jbCYKYR4e1S1ze28mvSVtVwm9IFcdfKc/view?usp=sharing)\n\n[Share Structure](https://www.otcmarkets.com/stock/ILUS/security)\n\n**Company Websites:**\n\n[ILUS International Website](http://ilus-group.com/)\n\n[FireBug Group Website](http://firebuggroup.com/)\n\n[E-Raptor Website](http://raptor-utv.com/)\n\n[The Vehicle Converters (TVC) Website](https://thevehicleconverters.com/)\n\n&amp;#x200B;\n\n**What's New?**\n\nToday (March 10th, 2021), ILUS officially uploading current filings to the official OTC Markets page. The company Tweeted an Attorney Letter will follow suit soon, which allows this company to **uplist to Pink Current status**. Pink Current status enables them to trade without restrictions and attracts a large number of new shareholders. This uplist will also enable the company to officially press release a new acquisition in the Public Safety Technology sector. \n\n&amp;#x200B;\n\n**What is ILUS International?**\n\nILUS International is a roll-up company with acquisition targets in the Public Safety Technology sector. The former ILUS ticker was a shell and this company is in no way representative of the old company, a name change from Illustrato Pictures to ILUS International is expected soon. Their first acquisition was  [FireBug Group in January of this year.](https://www.issuewire.com/otcilus-acquires-fb-technologies-a-global-technology-company-in-the-fire-rescue-market-appoints-new-ceo-board-1689936822558881) They also swiftly acquired E-Raptor and TVC as well. \n\n**FireBug Group** specializes in mist nozzle technology, vehicle conversion, autonomous fire safety drones, and water conservation. FireBug products are already being used in the UK, India, UAE, and various emerging markets internationally. The company plans to expand to the US this year. \n\n**E-Raptor** makes 6-wheel fully electrical utility vehicles built for rugged terrain. It can be ordered fully customizable and can be equipped with FireBug technology. \n\n**TVC** also known as The Vehicle Converters list customers including US military, Amazon, KFC, Apple, Jumeirah Hotels and Resorts, and many more. (Customer list can be viewed on website linked above) This company is based in Dubai and is also a **major provider of ambulances in the UAE.**\n\n**CEO Nick Link** is the CEO of FireBug Group and became CEO of ILUS International as well following the acquisition. **Nick owns 360 million common shares of ILUS.** Nick originally founded Jewel Saffire Products Ltd. in 2003 which was a fire safety equipment company. With this company, Nick began creating mist technology based products. Nick left the company in 2011 and founded FireBug Group in 2013. With FireBug, Nick wanted to focus more on fire safety innovations and technology, rather than the crowded space of standard equipment.\n\n&amp;#x200B;\n\n**Upcoming Catalysts**\n\n* Pink Current uplist\n* New acquisition(s) announced (company has one more confirmed, 8 being DD'd currently)\n* OTCQB Uplist (Fins are getting audited, price has held over a cent)\n* Share buyback discussed by CEO\n* Nasdaq uplist (Company has stated this is their goal)\n\n&amp;#x200B;\n\n**Detego Digital Forensics - Possible Next Acquisition**\n\n* [Website](https://www.mcmsolutions.co.uk/)\n* End-to-end digital forensics platform used by international militaries, intelligence agencies, and police.\n* Director John Paul Backwell is also the Director for ILUS International\n* Endorsed by UK Chief of Police as the best digital forensics platform.\n* Backwell has stated the company's intend to work together closely in the near future. Screenshot of the statement can be found in the DD document on page 11.\n\nILUS International has a clear mission to be at the center of innovation in the public safety sector. With a good share structure, experienced management, real products and revenue, and Nasdaq goals, I expect this company to see serious price action beginning soon as it becomes Pink Current and a positive trend for many weeks/months to come.\n\n&amp;#x200B;\n\n**Brokers that restrict stop sign trading such as Fidelity will not allow you to trade this stock until it is officially Pink Current, which should be in a week or two. Common brokers that do allow trading of stop sign stops include TD Ameritrade, Etrade, and Schwab.**",
        "subreddit": "pennystocks",
        "title": "$ILUS Fire Safety and EV Technology - Filings Uploaded, Pink Current Soon",
        "url": "https://www.reddit.com/r/pennystocks/comments/m2dkuc/ilus_fire_safety_and_ev_technology_filings/",
        "created": 1615451815.0
    },
    {
        "author": "Neighbor_",
        "created_utc": 1615564869,
        "id": "m3kl1n",
        "num_comments": 84,
        "num_crossposts": 0,
        "selftext": "A while ago /u/cyphonismus made an excellent DD on one of the most clearly overvalued stocks on the market: [Seaworld Overvalued - SEAS](https://www.reddit.com/r/wallstreetbets/comments/lry7dt/seaworld_overvalued_seas/)\n\n(due to all the GME hype, it didn't get much attention)\n\n&amp;nbsp;\n\n*How did it get this way?*\n\nThe small float at 50 million shares and incredibly high institutional ownership with low volume translates to it being easily manipulated. Institutions got lazy and let this thing slipway past where it should have gotten. No retail investor is long on fucking SEAS.\n\nIn other words, if take your 💩 and make it look like a [chocolate bar](https://upload.wikimedia.org/wikipedia/commons/5/5e/Cadbury-Dairy-Milk-Caramel-Bar.jpg), no one will be any the wiser as long as they don't get close enough to sniff.\n\nSeriously, there is no bull argument at all for this being about $20, and this stock is starting to *stink*. \n\nCheck out this article: [SeaWorld attendance dives 53% in the final quarter of 2020, but stock soars](https://www.orlandosentinel.com/business/tourism/os-bz-seaworld-earnings-covid-rebound-20210225-fs7wmwm3zrh7jlzwm5qdsbdz7y-story.html)\n\nA small dip in the fake momentum and this thing comes **tumbling down**.\n\n&amp;nbsp;\n\n*But what about the cute killer whales? I'm not evil!*\n\nWatch Blackfish. It would be doing them a favor if SeaWorld was bankrupt.\n\nEven without that knowledge, the company itself is run by some really scummy individuals. \n\nThe starting wage at SeaWorld Orlando is current $11 an hour. Instead of raising the minimum wage, the CEO plans to \"increase automation efforts overtime\" to solve their cost problems. Not only are your Orca's being kept in a cage, but they also won't even pay the people to take care of them.\n\n&amp;nbsp;\n\n*But we only know how to get tendies with *undervalued* stocks!*\n\nIndeed young one, but everyone can learn. The bold get the tendies. \n\nYou usually need to apply to get shorting approved on your margin account. Fidelity has a pretty quick turnaround time, so if SEAS is still above $40 by the time you get approved it can be a great play to make.\n\nThere is a lot of benefit to having at least one 🌈🐻 position in your portfolio. Probably even more than one (explained [here](https://www.reddit.com/r/wallstreetbets/comments/lxf7y0/whats_happening_with_the_bond_market_or_how_i/))\n\nLong puts work too, but I recommend shorting since it is less a question of *if* and more of a question of *when* the stock tanks. Even bankruptcy is not out of the question as /u/cyphonismus explained in his DD.\n\nThere is a reason hedgies love it.\n\n**TL:DR** - short SEAS, use premium to buy more GME 🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "The most overvalued stock of 2021 - SEAS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m3kl1n/the_most_overvalued_stock_of_2021_seas/",
        "created": 1615593669.0
    },
    {
        "author": "Duke_Shambles",
        "created_utc": 1614906265,
        "id": "ly0abw",
        "num_comments": 83,
        "num_crossposts": 0,
        "selftext": "Ok retards, listen up.\n\nFirst of all, I'm new to this, and I'm retarded.\n\nSecond of all, this is about RKT. Don't like it? Don't care. GME is cool. I like GME, but I don't like eating just purple crayons. I like the blues and the yellow ones too. \n\nI was looking at the RKT options chain when I noticed this:\n\nhttps://imgur.com/a/7CeFjbW\n\nNow to my eye, as of the current price, that looks like quite a few options that are ITM RIGHT now.\n\nWith all the news about the special dividend, the billion dollar buyback, the CEO's pure hatred of shorts, and UWMC's war on RKT, I think that RKT just may, just could, pop up again.\n\nRKT is currently STILL undervalued even with the revised (and suspect) price target of $30 and the attention is now fully on it after the recent spike into the $40's.\n\nThis looks RIPE for a gamma squeeze again.\n\npositions:\nhttps://imgur.com/a/0cCq92z\n\n69 shares...waiting on Fidelity to approve level 2 options.",
        "subreddit": "wallstreetbets",
        "title": "RKT 3/19 Options chain looks spicy.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ly0abw/rkt_319_options_chain_looks_spicy/",
        "created": 1614935065.0
    },
    {
        "author": "CompulsionOSU",
        "created_utc": 1615409977,
        "id": "m28ci3",
        "num_comments": 83,
        "num_crossposts": 0,
        "selftext": "Fidelity just approved me a few days ago.  I have levels 1 &amp; 2; can buy puts and calls as well as sell cash/stock secured options.  If you're interested I would call your 401k bank and see if you can apply.\n\n\n**Details to apply with Fidelity:**\n\nI am an active emoloyee, still contributing, no rollover or anything.\n\nIt is my Fidelity managed brokerage link.\nThe web interface wouldn't let me apply with a 401k directly, I could apply for my HSA online.  Originally Fidelity told me you couldn't apply.  Later a more experienced Fidelity rep confirmed it is possible, you just have to fill out the paperwork manually and send them a secure message.  Fidelity can tell you how to get the form and send the secure message.  I just called their 401k customer service number.\nI believe the options application was under all forms, page 8.  Your max options level is company/plan dependent.\n\nIt tools 4-5 weeks to process since they're backed up.  I also originally digitally signed it and a newer rep said that was no good, which is apparently inaccurate.  I then physically signed and secure emailed (as well as faxed) it to them 2 weeks ago to keep it moving quickly.  Approval came in Friday night.\n\nIf you apply I would recommend physically signing whatever you upload and sending it via secure message.  You can mail it, but that would take even longer.\n\n\n**My thoughts:**\n\nSome people think using options at all in a 401k is a bad idea, I disagree since I plan to be careful and open mostly low risk trades.  Having more choices is always better IMO.  I'll \"buy\" stock by selling puts and sell covered calls on stocks I own.  I'll also sell CSP with the intent they expire worthless / wheel them.  I really wish I could do PMCCs, but my employer doesn't allow that.  \nI'm going to make rules for portfolio breakdown of LEAPS calls, normal written puts, and more aggressive written puts.\n\nThis is only a portion of my 401k.  I still have a large chunk of S&amp;amp;P, a couple indexes, and some boomer managed fund.",
        "subreddit": "options",
        "title": "My Fidelity 401k allows options trading. Your 401k might allow it too!",
        "url": "https://www.reddit.com/r/options/comments/m28ci3/my_fidelity_401k_allows_options_trading_your_401k/",
        "created": 1615438777.0
    },
    {
        "author": "iridescentpheasant",
        "created_utc": 1615335985,
        "id": "m1knli",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "Hello fellow Ape,\n\nI've been seeing a bunch of DD saying that the launchpad is prepped for GME, and rocket is t-minus 1-6 days to Uranus.\n\njust reminding you that Robinhood WILL limit buying more GME just like they did last time. Remember to use a broker with a larger balance sheet, just like fellow monke Mark Cuban said. \n\nSchwab, Fidelity, E\\*Trade, etc.\n\nRemember, rocket launches are always bumpy at first, only diamond hands will let you hold on.",
        "subreddit": "wallstreetbets",
        "title": "PSA: Remember to not use Robinhood",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m1knli/psa_remember_to_not_use_robinhood/",
        "created": 1615364785.0
    },
    {
        "author": "IAmTheLostBoy",
        "created_utc": 1615645044,
        "id": "m4750x",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "\nHere are the basic financials from August 2020. Basically copy and pasted. Formatting may be an issue.\n\nAtari delivers another financial year of profitable growth\n\nRevenue:                                     +16.5% to €24.0m\nOperating Income:                     +15.2% to €2.9m\nNet Income (Group share):       €2.3m\n\n2012-13\t2013-14\t2014-15\t2015-16\t2016-17\t2017-18\t2018-19\t2019-20\n \t \t \t \t \t \t \t \t \t \nRevenue\t1.2\t3.3\t7.6\t11.9\t15.4\t18.0\t20.6\t24.0\t \nCurrent Operating Income\t0.6\t0.9\t0.2\t1.4\t1.9\t2.3\t3.1\t2.9\t \nOperating Income\t-2.0\t1.3\t1.5\t0.0\t8.5\t2.5\t2.5\t2.9\t \nNet Income Group Share\t-35.8\t-2.5\t1.2\t-0.1\t7.7\t2.3\t2.7\t2.3\t \nShareholders’ Equity Group Share\t-34.9\t-31.3\t-13.1\t-10.6\t7.4\t13.8\t22.3\t28.5\t \nNet Cash (Net Debt) (1)\t-31.4\t-24.8\t-11.0\t-13.3\t-0.9\t2.5\t7.8\n\nAtari VCS is set to come out this summer and pre-order has initiated. \n\nhttps://atarivcs.com/\n\nThis is a legit product. If something like minecraft and roblox can have longevity 8-16 bit marketplace, well Atari is the original. \n\nI LIKE THE BRAND, and branding is EVERYTHING. Atari is a household name to ANYONE over 35. It's not Coca Cola... But it's retro cool. \n\nCurrently trading on the OTC markets at ~$.60, with a $50 commission fee if you buy on Fidelity, up about $.20 from a week ago. \n\nI do own ~200 shares, but will be buying more on the open.",
        "subreddit": "pennystocks",
        "title": "Atari - A future winner?",
        "url": "https://www.reddit.com/r/pennystocks/comments/m4750x/atari_a_future_winner/",
        "created": 1615673844.0
    },
    {
        "author": "heyzeuzz",
        "created_utc": 1614835469,
        "id": "lxdh0o",
        "num_comments": 77,
        "num_crossposts": 0,
        "selftext": "Disclaimer: I posted a [$17k yolo on ZNGA](https://www.reddit.com/r/wallstreetbets/comments/lw3ts3/17k_yolo_znga/) and bumped it up to $27k total yesterday.\n\nWhile everyone was crying about the market taking a shit and RKT crashing ([I was crying too](https://www.reddit.com/r/wallstreetbets/comments/lx7mlz/rkt_12k_114k_17k/)) it was announced ZNGA acquired a game studio, [Echtra Games](https://venturebeat.com/2021/03/03/zynga-acquires-diablo-co-creators-echtra-games-in-expansion-to-pc-and-consoles/), whose creator and his team played a pivital role in Diablo/Diablo II. They were acquired with the goal to help Zynga move into PC/cross-platform game play. I think this is a promising acquisition with lots of future potential and is just [one of many planned for this year](https://techcrunch.com/2021/02/10/zynga-q4-earnings/).\n\nThe CEO of Zynga also spoke at a conference with Morgan Stanley today. Below are some excerpts he said during the call that I found interesting .\n\n&amp;#x200B;\n\n**Well known established global IP + data driven iteration + proven game mechanics =** 🚀\n\n&gt;We like to learn from what we've done before. And in the case of Harry Potter that was a big element of it. One of the things that we learned was we needed an intellectual property in a world that was appealing to a much larger audience and a much more global audience, so that a lot of the cool game play features that we had could reach a bigger audience. So we combined a new IP with some proven mechanics that we'd been messing around with. And then we tested it for a very long period of time and test markets. That's really the structural difference between mobile and console.  \n&gt;  \n&gt;In mobile, you can really test market something to remove a lot of the introduction risk. And so with Harry Potter that was something that we did as we went into whether it was Australia or Canada, we were testing very specific elements of what makes for a successful game. Does it retain? Does it engage? What's the conversion rates? Does the UA scale against what the cost of acquisition is? And so, we thoroughly put Harry Potter through its test marketing phases. And what we're really excited about was first and foremost the reception from fans was phenomenal.  \n&gt;  \n&gt;We saw - the ratings were very strong. The Harry Potter fans were raving about it. It went really viral. We did some fun stuff with Zayn Malik. And it really had really a lot of nice momentum out of the launch. But then when it started to hit weeks 14, 30 and beyond, all the testing that we had done about what were the retention rates engagements, we were exceeding them. So it was actually really positive to see that the test marketing worked and that was a critical part of the success here.\n\nThe Harry Potter IP is a money machine. If you can integrate the game mechanics that get people to continually make micro transactions, or spend hours playing, combined with a raving fan base of an established global IP, imo this is going to print money for them.\n\nThe Harry Potter game was [launched on Sep/23](https://investor.zynga.com/news-releases/news-release-details/zynga-launches-harry-potter-puzzles-spells-worldwide). I think we could see a lift in revenue in the coming quarters from this game.\n\n&amp;#x200B;\n\n**2 Upcoming Game Releases in the First Half**\n\nThey're targeting 2 new game releases in the first half \"Puzzle Combat\" and \"FarmVille 3\".\n\n**On Puzzle Combat**\n\n&gt;So as we think about releasing Puzzle Combat in the first half, I wouldn't necessarily set the expectations that this is a theatrical movie model where it's - a Marvel movie that comes out at summer and it's got this huge spike. That's not at all the model here, right. We're in this for the long-term. This is a marathon, not a sprint. And so, we're going to be releasing the game, see how it settles in and then very methodically start acquiring based on what we're seeing in the dynamics and the metrics.\n\n**On FarmVille**\n\n&gt;And, there are a lot of fans that have tens of millions, if not hundreds of millions of people had played FarmVille over the years. And when we think about all of those fans and what their expectations are and how to bring them into a new experience, we’ve doing a lot of testing. We’re also running a bunch of FarmVille games right now, whether it’s Country Escape or Tropic Escape, which has a very big fan base and they love the game.  \n&gt;  \n&gt;And so it’s a little bit more complicated to navigate some of the pre-set expectations, but what we’ve done is really build out a terrific new experience and experience that is unlike LA. It has things that are familiar to people that have played FarmVille in the past, but it’s got a lot of unique new elements to it, and a new look and feel that feels very modern and very cutting edge for what we believe mobile games really are these days.\n\nPuzzle Combat is more of a long play, and I like these types of strategies mixed in with shorter term plays. Zynga seems to have a healthy balance of this, which I really like.\n\nWhat I think Zynga does well is tailoring their games to the fan base. I think FV3 is going to be a fresh reboot of the beloved game by its fans with new elements to keep users engaged.\n\n&amp;#x200B;\n\n**Expansion into cross-platform gaming**\n\nAs mentioned, they acquired Echtra to boost their expansion into cross-platform gaming. Unrelated to the acquisition, one of the first cross-platform titles later this year will be Star Wars Hunters.\n\n&amp;#x200B;\n\n&gt;Yeah. I think if you take a step back and look at the industry overall, some of the largest franchises in the world right now are cross-platform, and they’re free to play in many cases with seasons passes and things like Fortnite, Pub G, Engine Impact, a lot of people have been talking about how the console developers getting into mobiles the thing. Well, I think that door swings both ways. I think mobile developers can actually step into the cross-platform mega franchise part of the market, because of a few reasons.\n\n&amp;#x200B;\n\nRegarding the team they acquired:\n\n&amp;#x200B;\n\n&gt;I think the last point I’d make on cross-platform is that. We’re just getting started in this. So the acquisition of Echtra is really a key one for us, because ultimately game quality is a function of game team talent and leadership. And when you look at these guys, they’ve worked on RPGs for up their whole careers. They’ve worked on Diablo, they helped to create Torchlight, which is a fantastic IP and the action RPG category. They’ve actually published games cross-platform. It’s a team less than 50 in San Francisco right near our shop.\n\nI think if the launch of Star Wars Hunters goes well in the second half of the year then I think it's possible we see a nice upward movement on the price.\n\n&amp;#x200B;\n\n**Becoming a first party ads platform cutting out third party platforms like Google/Apple**\n\n&amp;#x200B;\n\n&gt;...mid-point the last year, we started looking at the fact that we were one of the premier advertisers in gaming. All of our games are enabled for IAP and IAA. But between the time that they saw an ad and they ended up in our game, we had it was kind of opaque, right. We worked with other parties – other third particles or use other third-parties like, Iron Source or Unity app and Google, Facebook, and the third-parties were handling a lot of the information and a lot of the acquisition. And then we looked at our first party data asset, which is the data that we were generating around what a player was doing inside of our games.  \n&gt;  \n&gt;And that was tremendously valuable, but we were missing that piece of it. And so when we looked at it, we said, wait a second. If we do a couple of things here, we can capture the 15% to 30% we’re paying partners right now, just to manage the exchanges. We would get more information about what’s hot, and what’s not at the top of the funnel in terms of what’s appealing? What’s not appealing? What companies or products are doing better and why? We would be able to creatively optimize our products better. We ended in a post IDFA world that would all become first party data. The big issue with privacy is what is one party exchanging to another party about an individual, right? But if you enter one network and you have a good exchange of what your permissions are, you carry through that whole process in a high fidelity way from a data standpoint.  \n&gt;  \n&gt;And so when we looked at it from multiple directions, we're like, wow, we can margin expand, we can pick up more efficiency in our UA dollars and in our advertising business. We could grow our advertising business faster and we could generate potentially a competitive advantage and information superiority, just knowing more about the players coming into our walled garden or into our platform than the next guy.  \n&gt;  \n&gt;We felt like this was something that we could go after. We went through a very diligent process of breaking down what these look like. And we found that some of these components we could build, some of these components we need to partner on and in addition to that in ad tech, there's a lot of - there's really a lot of vibrant companies and opportunities out there to potentially partner as you've seen from recent development.  \n&gt;  \n&gt;So when we think about where we were as a company, we were a mobile pure play developer and publisher and we felt that that is a really valuable company, but we thought that we could become an even more valuable company by building out our platform by starting to grow our total addressable market by getting into consoles and PCs, and then leveraging this unique asset and hyper casual to really supercharge the platform as well as get us into a place where we're seeing more information coming into the top of the funnel and then converting them into players and ultimately payers.\"\n\nThis really sticks out to me. Zynga was 1 step ahead from the new pivot by Apple/Google on stronger ad tracking privacy. They're becoming the ads exchange where companies pay for displaying ads in games. This also gives them an advantage on learning what's working for others and apply that to their business model.\n\n[Here's a bite sized](https://www.reddit.com/r/wallstreetbets/comments/ljywic/znga/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) DD u/jojofroyo did.\n\nDisclaimer: This is not financial advice. I am not a financial advisor. Do your own research.\n\nPositions: $27k with various calls throughout the year. I think they could have a great ER to justify a new target price from analysts, so went with a higher strike price after their next ER.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ou0ssust3yk61.png?width=770&amp;format=png&amp;auto=webp&amp;s=6428b78f70093d7da7337952a6fe46bf0200a9a1",
        "subreddit": "wallstreetbets",
        "title": "$ZNGA Acquires Creators of Diablo DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxdh0o/znga_acquires_creators_of_diablo_dd/",
        "created": 1614864269.0
    },
    {
        "author": "GhostOfSamurai",
        "created_utc": 1614788915,
        "id": "lwxx88",
        "num_comments": 70,
        "num_crossposts": 0,
        "selftext": "This just burned me even though I thought I understood the pattern day trade rule and I can't trade on margin in my account for 95 days, so I wanted to share this with other ~~new investors~~ retards so they don't get burned by the pattern day trade rule like me.\n\n**This is not investment advice**, this is clarifying SEC-mandated regulations on what counts as a \"day trade\". Also, this is probably obvious to you seasoned artists (it is to me after Fidelity explained this all to me on the phone), but smooth-brained apes like myself might not understand this, or even panic at waking up to any margin call for $25000 (note - if you don't meet this you're not on the hook for it - you just get restrictions placed on your account for some time). Or maybe you read the many topics on day trading available on the internet and came to the same (wrong) conclusion as me.\n\nPattern day traders have different margin requirements than interday or non-pattern day traders. A pattern day trader is classified as someone who \"day trades 4 or more times in a 5 day period\", and a day trade is classified as \"the opening and closing of securities on the same day\". What sites don't explain better is that this is based on the *number of open positions, not the number of times you sell*.\n\nFor example, Fidelity explains [day trading on margin](https://www.fidelity.com/learning-center/trading-investing/trading/day-trading-margin), and their following example of a day trade:\n\n- A purchase of 250 shares of ABC stock at 10 a.m., followed by a purchase of another 250 ABC shares at 11 a.m., followed by a sale of 500 ABC shares at 3 p.m.\n\nwhen read in the context of the page I linked to seems to imply that this would count as a single day trade. This is not the case. Over the course of yesterday I bought 92 shares of RKT over 6 orders, and I sold 70 of them near market close. This morning I woke up to a text saying I am subject to a day trade minimum equity call, and I now need to maintain equity of $25,000 or more to trade on margin.\n\nI'm not going to meet this (I have no interest in tying up $25,000 for pattern day trading), so in 5 days my account will be restricted to cash buying only for 90 days (though I can't trade on margin for the next 5 days anyways so it's basically 95 days), and I need to avoid day trading at all in that account or else the counter may reset. After 60 days of no day trades in the account, you revert to non-pattern day trade status, but for missing the minimum equity call you still can't trade on margin for 30 days after that.\n\nI have a cash account I usually day trade out of, but I impulse closed all of my other positions (besides GME) and YOLO'd into RKT. I profited nicely of of yesterday but this was the result of my greed. I at least have a decent amount of cash to invest after yesterday (and I did buy 5 more GME shares today, still holding 27 RKT positions), but I would not have bought 92 shares over several orders had I understood this would result in 5 day trades for the separate positions I had opened, not just one trade for the single sell order.\n\nLast thing I want to mention: don't trade on margin unless you know the risks. And if you are unsure of anything, you can always call your broker. And if you can't, stop trading on CashApp or RobinHood and get a real broker you absolute mong.\n\nAs for me... well I just bought 5 more shares of GME this morning with cash so maybe y'all can help me meet that minimum equity call :D (just kidding, this is not investment advice). Good luck, and godspeed, fellow artists.",
        "subreddit": "wallstreetbets",
        "title": "Warning to new retards when day trading on margin",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lwxx88/warning_to_new_retards_when_day_trading_on_margin/",
        "created": 1614817715.0
    },
    {
        "author": "Lykenbane",
        "created_utc": 1615375469,
        "id": "m1venl",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": "Hello all, \n\nLike a lot of you in here, I'm also new to investing. I've been learning a lot from this community. There are so many helpful, and well-versed people in this sub. They helped direct me towards being confident in going with Fidelity. I've been making a few short hold trades, just to build up my financial strength and buying power. One thing I realized when reading a lot of the comments is individuals selling shares, and using those proceeds to immediately invest in another stock.\n\n&amp;#x200B;\n\nI just wanted to point out, and while I myself am still learning so correct me if I am wrong please, once we sell a stock for proceeds, we have to wait about two business dates from the date of selling to allow those proceeds to become settled cash before we invest that money back into another stock. \n\n&amp;#x200B;\n\nI believe with Fidelity, you are allowed 3 Good Faith Violations before your account is restricted for three months. I just wanted to point this out as a heads up for newer investors, like myself, who up until a week ago didn't even realize this was a rule!\n\n&amp;#x200B;\n\nBe smart, do your research, have fun investing, and be safe! Also, if there are any more tips, please let me know! I'd love to learn all I can!",
        "subreddit": "wallstreetbets",
        "title": "Hey guys, just be careful with Good Faith Violations!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m1venl/hey_guys_just_be_careful_with_good_faith/",
        "created": 1615404269.0
    },
    {
        "author": "maesterofwargs",
        "created_utc": 1615949150,
        "id": "m6qak0",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "Used to be able to long press and sort stocks by price, percentage, total earned, etc. As of today I can't anymore. \n\nIf this is not just a bug, I will finally leave RH this weekend for Fidelity. Good riddance.",
        "subreddit": "stocks",
        "title": "Did Robinhood just update its app to remove the ability to sort stocks by anything but stock price?",
        "url": "https://www.reddit.com/r/stocks/comments/m6qak0/did_robinhood_just_update_its_app_to_remove_the/",
        "created": 1615977950.0
    },
    {
        "author": "Brokendresser123",
        "created_utc": 1615242614,
        "id": "m0rzn5",
        "num_comments": 61,
        "num_crossposts": 0,
        "selftext": " \n\n**Ok, so here’s what happened with the Treasury Auctions this morning, these auctions sell off US debt including past debt and recent COVID spending:**\n\n13 Week Notes: $164B for sale, $53B sold\n\n26 Week Notes: $180B for sale, $50B sold\n\n(Source: [https://www.treasurydirect.gov/instit/annceresult/press/press\\_auctionresults.htm](https://www.treasurydirect.gov/instit/annceresult/press/press_auctionresults.htm))\n\nSo basically a lot of unsold notes. Institutions who buy these expect set returns since they’re mostly used for fixed income products (Bonds, companies like PIMCO, Vanguard, Fidelity and other countries are the buyers). When the returns aren’t going to beat inflation which is projected to be high this year, they won’t raise their hands to buy these.\n\nTreasury must then increase rates to make them more sell-able. This spikes the Treasury yield rates and makes borrowing money more expensive. When borrowing gets expensive companies that survive off loans (tech, growth) quickly become squeezed in valuation. Since last year’s run up of tech, the squeeze is getting stronger and stronger for companies that are running off borrowed money.\n\nThe more “idea” driven a company, stock, or ETF is, the deeper it goes red. The more fundamental a company is, like what’s in the Dow, they are not affected as much. They actually did great today with the stimulus being passed.\n\nThere are THREE MORE DAYS OF AUCTIONS this week. These are the bigger notes, 3, 10, 30 yr notes totaling about $150B. If these don’t sell well (and they’re not expected to, they are actually re-offerings from previous unsold auctions), prepare for more down days in the NASDAQ and any stock that doesn’t have firm foundations financially as yields go UP (where to see Treasury yield: [https://www.marketwatch.com/investing/bond/tmubmusd10y?countrycode=bx](https://www.marketwatch.com/investing/bond/tmubmusd10y?countrycode=bx))\n\nGood luck and evaluate what you own, why, and if the time is right.",
        "subreddit": "stocks",
        "title": "Quick Explanation of what's going on in Tech/Growth/NASDAQ Part 2",
        "url": "https://www.reddit.com/r/stocks/comments/m0rzn5/quick_explanation_of_whats_going_on_in/",
        "created": 1615271414.0
    },
    {
        "author": "sugma22",
        "created_utc": 1615591030,
        "id": "m3tt96",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I finally got approved for options trading at Fidelity. They even gave me a 184 page booklet on Options Trading. Little did they know I don’t know how to read words. Only emojis and downward red lines 🚀 🚀 📈📈📈",
        "url": "https://i.redd.it/0ifxjp23kom61.jpg",
        "created": 1615619830.0
    },
    {
        "author": "kingape",
        "created_utc": 1615587855,
        "id": "m3sryv",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "SPACs",
        "title": "Stop Paper Fidelity SPAC prospectus?!",
        "url": "https://www.reddit.com/r/SPACs/comments/m3sryv/stop_paper_fidelity_spac_prospectus/",
        "created": 1615616655.0
    },
    {
        "author": "MrCarey",
        "created_utc": 1615959365,
        "id": "m6t8ip",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "Tomorrow could be a big buy day because of dips, and I don’t want people to give in and not look at their fees. It’s a $50 foreign exchange fee, and it doesn’t matter what you spend. I didn’t even look a couple days ago, and threw in $8 bucks as a placeholder to get more later. That turned out to be a $58 play. \n\nI’m not certain, but I’d imagine you pay $50 to sell it as well. You can correct me if I’m wrong, but I think that’s how it works.\n\nAnyway, if you’re not making huge buys, don’t bother.",
        "subreddit": "pennystocks",
        "title": "PSA: $EEENF buyer beware: $50 charge on Fidelity and Schwab.",
        "url": "https://www.reddit.com/r/pennystocks/comments/m6t8ip/psa_eeenf_buyer_beware_50_charge_on_fidelity_and/",
        "created": 1615988165.0
    },
    {
        "author": "Dr_PennyStock",
        "created_utc": 1617209806,
        "id": "mhagfv",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "As you can see in the chart below, ASTI formed a powerful Bullish Pennant pattern. \n\nThe height of the Pole is used to predict the Price Target.\n\nThe breakout is imminent, so if you want to take position, now is the time. \n\nThe Q3 for 2020 will be filled at any day now, and ASTI will get Current status on OTC markets, so this may be the catalyst to break the pattern. Also some brokers like Fidelity do not allow buying ASTI now, but, with the STOP signal removed, they will allow it, so more people can buy and boost the run.\n\n   \n\nhttps://preview.redd.it/qrh50p1b9eq61.png?width=839&amp;format=png&amp;auto=webp&amp;s=ab136f6cd5803a287c638edf68022f9fad9ba24e",
        "subreddit": "pennystocks",
        "title": "$ASTI Weekly Annotated Chart. Powerful Bullish Pennant pattern formed.",
        "url": "https://www.reddit.com/r/pennystocks/comments/mhagfv/asti_weekly_annotated_chart_powerful_bullish/",
        "created": 1617238606.0
    },
    {
        "author": "philoponeria",
        "created_utc": 1614880556,
        "id": "lxqsr6",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "Hey everyone. I just talked to a Fidelity rep because my transfer got hung up. Here is what I learned. \n\n1. Robinhood did not allow transfers into a joint account but that has changed as of yesterday. If you are transferring into a joint account so that your wife and her bull have better access to your junk stocks, that can now be processed and proceed. I wish them well in their voyage to pound-town. \n2. Fidelity cannot hold any C-WORD. \n3. If you have any options positions that will complicate and delay your transfer. \n4. If you have any Margin in play that will ALSO complicate and delay your transfer. \n\nThe rep was polite but clear that there have been a LOT of transfers lately. Be patient with the humans you talk to. They legit want to help.",
        "subreddit": "wallstreetbets",
        "title": "Robinhood --&gt; Fidelity update from the trenches",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxqsr6/robinhood_fidelity_update_from_the_trenches/",
        "created": 1614909356.0
    },
    {
        "author": "clammytoast",
        "created_utc": 1617047106,
        "id": "mfxryn",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "Finally getting off robinhood and have been looking at webull and fidelity. Anyone have any strong opinions one way or another? \n\nMy investing style is mostly long term ETFs, if that makes a difference.",
        "subreddit": "stocks",
        "title": "Webull vs fidelity?",
        "url": "https://www.reddit.com/r/stocks/comments/mfxryn/webull_vs_fidelity/",
        "created": 1617075906.0
    },
    {
        "author": "Warrior_Asbel",
        "created_utc": 1615307820,
        "id": "m1aard",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "I only bought in for a few reasons. The first was that fidelity had marked this stock as a caveat for some time, and it just so happened to switch back to pink current. So in my eyes, I was buying the bottom since fidelity doesn’t let you buy caveats. The second was that it had dropped really low and I felt safe in addition to the pink flip lol. The final and big reason however is that I saw there had been word of a merger going through with SleepX, and that it is rumored to be finished on Monday, March 15th. \n\nNow, I wasn’t gonna call this a DD because I don’t have that much to share with you guys. I had reasons that were good enough for me to at least do a yolo on it and see where that takes me. Anyone else got anything? And if you’re looking at this for the first time, there’s not much volume today so you should be fine if you want to buy in. This is not financial advice",
        "subreddit": "pennystocks",
        "title": "$APYP Who is on this stock?",
        "url": "https://www.reddit.com/r/pennystocks/comments/m1aard/apyp_who_is_on_this_stock/",
        "created": 1615336620.0
    },
    {
        "author": "johnnyleespamacc",
        "created_utc": 1615892248,
        "id": "m66eza",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "I was wondering if there were other brokerage that allows up to 25k instant transfer like fidelity does.\nFidelity is nice and all, but it feels like their “quality of life” seems a bit out dated.\nWebull has the live order books, $ or % buying/selling, and more indicators. But they take awhile to have funds available to trade\n\nIs there any Brokerage like fidelity that is a little more up to date? Thanks",
        "subreddit": "stocks",
        "title": "Other brokerage like Fidelity with instant cash to trade?",
        "url": "https://www.reddit.com/r/stocks/comments/m66eza/other_brokerage_like_fidelity_with_instant_cash/",
        "created": 1615921048.0
    },
    {
        "author": "chayse1984",
        "created_utc": 1615952304,
        "id": "m6raab",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Bought more GME today on the dip in two separate Fidelity accounts....my buddies bought more today, too...Thanks, Ken!!!",
        "url": "https://i.redd.it/yryyjr08ein61.png",
        "created": 1615981104.0
    },
    {
        "author": "ED_Medicine",
        "created_utc": 1617034049,
        "id": "mfsvyk",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "Hi.\n\nI am fairly new to investing - only 18 months or so.  Currently very little money as a medical student, but starting residency in July and will be an attending in 2024.  Right now I mostly invest in dividend stocks and my portfolio is small (~$6,000).  That said, I’m going to start getting paid soon ($64,000 annually) and will eventually be making a decent living as a doctor.  I want to find an index fund to invest in in the long term.\n\n\nAt present, I bank with fidelity and like some of their options (FSSNX and FZROX).  They both have low expense ratios and are cheap to get into/ maintain since I have an account with fidelity.  They also have decent diversity, with FSSNX being a bit less technology-heavy than FZROX.  I’m leaning more towards FSSNX over FZROX because it’s been around for longer, has higher diversity, and in my opinion less overall risk.\n\n\nThat said, I am a total noob and would love input on my thought process.  Am I going about this right?  Any suggestions from someone who isn’t an idiot like me?",
        "subreddit": "stocks",
        "title": "How do I choose an index fund?",
        "url": "https://www.reddit.com/r/stocks/comments/mfsvyk/how_do_i_choose_an_index_fund/",
        "created": 1617062849.0
    },
    {
        "author": "Trumpgirl29",
        "created_utc": 1614883268,
        "id": "lxrulw",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "I can purchase only a few OTCs so far with Fidelity? Any suggestions for a different platform with 0 fees? What do you all have success using to buy OTCs?",
        "subreddit": "pennystocks",
        "title": "What is the best trading platform to buy OTCs I thought Fidelity but it won’t let me purchase anything I want- webull nothing at all.",
        "url": "https://www.reddit.com/r/pennystocks/comments/lxrulw/what_is_the_best_trading_platform_to_buy_otcs_i/",
        "created": 1614912068.0
    },
    {
        "author": "spittingllama87",
        "created_utc": 1615472340,
        "id": "m2r2iy",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "Hi all \n\nI have a March 2023 Tesla $600c I bought on the dip Monday. Thankfully I am now positive on this position. \n\nI am wanting to sell a covered call for the same date (March 2023) at the strike of $1700. The premium is about 12.5k and would cover a about half of the premium I paid for my 600c thus giving me a lot of downside protection and de-risking my leap. I understand it will cap my gain at 110k plus whatever premium I accept. \n\nI have no idea how to do this on the Fidelity App or website. Their phone hold is hours. Can anyone help me with this?",
        "subreddit": "options",
        "title": "TESLA Leap",
        "url": "https://www.reddit.com/r/options/comments/m2r2iy/tesla_leap/",
        "created": 1615501140.0
    },
    {
        "author": "bahetrick1",
        "created_utc": 1615984413,
        "id": "m6zdn1",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "Trying to move off RH,  opened a Fidelity account over the weekend.  They will not allow me to buy options,  only sell CC's and CSPs.  Obviously that's not going to work,  so I have to find ANOTHER new brokerage.  What are some recommendations for US- based brokerages that will allow options trading?",
        "subreddit": "options",
        "title": "Fidelity will not allow option trading. Looking for new brokerage recommendations",
        "url": "https://www.reddit.com/r/options/comments/m6zdn1/fidelity_will_not_allow_option_trading_looking/",
        "created": 1616013213.0
    },
    {
        "author": "Frequent-Carpenter-6",
        "created_utc": 1614786092,
        "id": "lwwshy",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "Moving from Robinhood to Fidelity",
        "url": "https://i.redd.it/h2knzhbl2uk61.jpg",
        "created": 1614814892.0
    },
    {
        "author": "Seek_Adventur",
        "created_utc": 1615312758,
        "id": "m1c629",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "I want to buy 1 $800 call for Gamestop on Fidelity that will expire on March 12, 2021 with an ask price of $1.36. But, I'm not sure what it means when the Change says -0.85. If anyone would like to elaborate what this means, I would very much appreciate it.\n\nThanks in advance",
        "subreddit": "options",
        "title": "Question About GME and Options",
        "url": "https://www.reddit.com/r/options/comments/m1c629/question_about_gme_and_options/",
        "created": 1615341558.0
    },
    {
        "author": "pabsgu46",
        "created_utc": 1614830661,
        "id": "lxc6v3",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "Watchlist 3-3-21 👀\n\nPresident Joe Biden has agreed to a faster phase-out of the $1,400 stimulus checks in the next relief package, according to two Democratic sources. Some moderate Democrats in the Senate have been urging Biden and Democratic leaders to further target the direct payments. According to the sources, individuals making over $80,000 a year will no longer qualify for the payments — the cap in the House bill was $100,000. The limit for heads of households will be $120,000 a year, compared to $150,000 in the House bill. The ceiling for couples will now be $160,000 a year, versus $200,000. The new proposal begins phasing out the checks the same income levels as the House bill — $75,000 for individuals, $112,500 for heads of households and $150,000 for joint filers.\n\nHOT SECTORS:\n\nOil and Gas CPE CDEV AXAS SM PVAC GBR\n\nPassenger Transportation MESA ZNH HA JBLU AAL UAL\n\nConstruction Materials CX SUM USCR IIIN\n\nConsumer Goods Conglomerates GE\n\nSchool/College/Universities VTRU LXEH\n\nBanking Services BCOW SOS FNCB BSBK FCBP PFHD MBCN FMNB\n\nAH RUNNERS TURN POTENTIAL PM GAPPERS: $SLGG $SVBI $AESE $AAMC $SBBP $CLSD $EAT $EARS\n\nGAMING/GAMBLING SECTOR: $FUBO – FuboTV Secures Market Access Agreements for Forthcoming fubo Sportsbook in Indiana, New Jersey Through Caesars Entertainment Inc. HUGE news. This means they are planning on putting FuboTv inside CASINOS. This will make it a multi billion dollar company.\n\n$HZON - A sports data company is reportedly in talks to go public via a SPAC deal that could value the company at more than $10 billion. Sportradar is in talks to go public via a SPAC merger with Horizon Acquisition Corp II. Sportradar provides data from sports contests to sports betting providers. The company had deals in place with the big four U.S. sports last year with MLB, NBA, NFL and NHL. Sportradar also has a deal with the International Tennis Federation. Investors in Sportradar include the Canada Pension Plan Investment, Michael Jordan, Mark Cuban and Revolution Growth. Sportradar could be valued at between $10 billion and $12 billion, according to SportsHandle. Sympathy/Related: #AESE #SLGG #DKNG #WBAI #GAN #RSI #ELYS #SGMS #GMBL #GNOG #ACEL #EVRI #IGT #AGS #CPHC #GAN #RSI #SCR\n\nCRYPTO/BLOCKCHAIN PLAYS: (ARK INVEST'S CATHIE WOODS SAYS 'WE ARE VERY OPTIMISTIC ABOUT #BITCOIN ', EXPECTS MORE COMPANIES TO ADD BITCOIN TO CORPORATE BALANCE SHEET) $SOS –Should be back in double digits very soon! SOS recently spent $28 Million and acquired 15,600 Bitcoin mining machines/rigs. SOS has been raising more than $200 Million in cash in the past two months, that means that SOS can potentially buy 10X the machines and boost its bitcoin production capacity to the top of the in the world, ahead MARA, RIOT and BTBT which are currently trading at 60X 50X 20X of SOS market valuation. Sympathy/Related: #MOGO #NXTD #MGI #EQOS #BRQS #AIKI4 #IZEA #AEHL #DPW #PBTS #MARA #PHUN #RIOT #EBON #HIVE #BRQS #IPDN SPACS: $ACND - Beacon Street Group wants to be a giant in that field. It announced a deal to go public via a merger with ACND, yesterday on Tuesday. Investors shrugged off the deal, with little to no reaction, HOWEVER there was over 10x the average daily volume traded on this SPAC today. This is a THREE BILLION dollar merger agreement with a company looking to take fintech to the next level. Beacon Street says it has over 160 different products under its dozen brands, which include research and software tools focused on macro investing, growth stocks, trading strategies, cryptocurrencies, and more. The company says it had more than 10 million subscribers at the end of 2020, of which about 860,000 were paying customers. It has grown quickly through a mix of organic growth and acquisitions in the past few years. Revenue has climbed from $238 million in 2018 to $377 million last year, with management projecting $651 million in sales in 2022. Adjusted earnings before interest, taxes, depreciation, and amortization, or Ebitda, went from $79 million in 2018 to $127 million in 2020. Management has forecast Ebitda of $284 million for 2022. HUGE!!! This is not going to be ignored forever, in fact, today’s volume is testament to that.\n\n$CAP - Doma, formerly known as States Title, is architecting the future of residential real estate transactions by overhauling the current system and building a better one based on what today’s consumers expect: a simple, digital, and frictionless experience. The transaction values Doma at an enterprise value of approximately $3.0 billion and is expected to provide up to $645 million in cash proceeds, including a fully committed PIPE of $300 million and up to $345 million of cash held in the trust account of Capitol Investment Corp. V. Top-tier investors anchoring the PIPE overall include funds and accounts managed by BlackRock, Fidelity Management &amp; Research Company LLC, The Gores Group, Hedosophia, SB Management, a subsidiary of SoftBank Group Corp., and Wells Capital. Existing Doma shareholder, Lennar, has also committed to the PIPE and Spencer Rascoff, co-founder and former CEO of Zillow Group, has committed a personal investment to the PIPE. Up to approximately $510 million of cash proceeds are expected to be retained by Doma, and existing Doma shareholders will own no less than approximately 80 percent of the equity of the new combined company, subject to redemptions by the public stockholders of Capitol and payment of transaction expenses. Another company with 10x the average daily volume today with little to no movement in price.\n\n$ALTU - NetJets has obtained purchase rights for 20 AS2® supersonic jets, extending Aerion’s global order backlog to USD $10 BILLION. NetJets &amp; Aerion to explore exclusive partnership for the global mobility platform. Sympathy/Related: #CCIV #HZON #BFT #IPOF #ACIC #IPOE #QELL #RTP #STPK #GSAH #PDAC #ACND\n\nTECHNICALS: $BUZZ – Barstool ETF push by El Presidente available on MARCH 4.\n\n$AMC - Changed to ER 3/12m everyone curious about the reason being this decision.\n\n$OLB - March 2 news OLB Group Simplifies Social Media App Payment Acceptance for Merchants. This company has a Low float 2M share, and Insiders own 65%. Based on the 4hr chart, support is $4.95 and showing signs for a jump to $9.31 to 61.8% fibo chart.\n\n$TLRY $SNDL $CGC $APHA $KERN – All are outstanding stocks to find a bottom and start loading for good earning in Q1 or Q2.\n\n$UVXY – In a scary market, buy the fear index. VIX plays always help to hedge your bullish plays. Buy this on a bullish day when the price is low, and hold for down days to even you out or make you profitable. Great swing too or call options with exp. dates into next year.\n\n$OCGN - Shares of Ocugen Inc. OCGN soared 31.0% in premarket trading, after the biopharmaceutical company said its co-development partner Bharat Biotech released an interim analysis of its Phase 3 trial of its COVID-19 vaccine candidate, COVAXIN, which demonstrated efficacy of 81%.\n\nBack Burners: GME GTT EDUT FTXN GFN NTP OVID RELI SNSS UWMC SNDL RKT SQQQ",
        "subreddit": "smallstreetbets",
        "title": "Watchlist 3-3-21 👀",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/lxc6v3/watchlist_3321/",
        "created": 1614859461.0
    },
    {
        "author": "Myllokunmingia",
        "created_utc": 1615933004,
        "id": "m6kyye",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Want to get off RH? Afraid of missing the squeeze?\n\nIf you're still on that piece of trash platform you're essentially choosing to stay in an abusive relationship. RH showed in January that they either can't or won't support you during large market events. The reasons why don't even matter, they can't. \n\nHarken back to the Cuban AMA. Remember that? One of his foremost pieces of advice was to get a real broker with a trillion dollar balance sheet. Fidelity or Vanguard, pick one. Doesn't matter which they're both boomer hellscapes to interact with but they at least have your back.\n\nNow do a partial account transfer. This is \\*faster\\* than a full account transfer and just transfers specific shares of your choosing. I did this and transferred my volatile shares to Fidelity and they were only in limbo for a day or two. Then I did my full account transfer separately, and that took about two weeks of which 4 days or so the shares were truly locked up.\n\nIf this seems too hard then maybe you should know that there is a non-zero chance RH may disable *selling* during the squeeze. Did you see that recent offering to give you cash for deposits? They're desperate for money and on their last legs. If anyone asks them for a big chunk of collateral they are instantly GOING TO FOLD AGAIN. It might sound harsh but if this happens and your shit is locked up and you can't sell, that's your own damn fault. It's been a month and a half that people have been screaming to get a real broker.\n\nDon't leave your tickets to the moon inside some ramshackle shed with a rusted lock. Put them in a stone fortress with 1000ft walls.",
        "subreddit": "wallstreetbets",
        "title": "PSA: Partial account transfers are faster than full account transfers.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m6kyye/psa_partial_account_transfers_are_faster_than/",
        "created": 1615961804.0
    },
    {
        "author": "Skuggasveinn",
        "created_utc": 1615841795,
        "id": "m5uo2x",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "So apparently you have to give your life story or the bots delete your post.\nSo, I was born in Iceland 1981. It was a hot summers day (Icelandicly speaking). Started investing in 2017 after I broke up with my girlfriend and sold the apartment and put everything in the market.\nThis summer I got stranded on a mountain and picked up by a helicopter.\n\nNow back to my original post.\n\n\nI have fidelity select banking fund (FSRBX) and I was wondering if I should up my stake in it.\nWhat do you think?\n\nMan I hope this is enough effort.",
        "subreddit": "stocks",
        "title": "Do banks do well with rising interest rates/inflation?",
        "url": "https://www.reddit.com/r/stocks/comments/m5uo2x/do_banks_do_well_with_rising_interest/",
        "created": 1615870595.0
    },
    {
        "author": "periformis",
        "created_utc": 1615932637,
        "id": "m6kube",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "I switched from robinhood to schwab but it would always show  my deposits as percent gain, giving me an inaccurate idea of my performance. Which brokers exclude deposits from total gain % just like robinhood?\n\nCurrently looking at Fidelity or TD ameritrade.\n\n&amp;#x200B;\n\nThanks",
        "subreddit": "stocks",
        "title": "Which broker does not show deposits as percent gain?",
        "url": "https://www.reddit.com/r/stocks/comments/m6kube/which_broker_does_not_show_deposits_as_percent/",
        "created": 1615961437.0
    },
    {
        "author": "n8rman13",
        "created_utc": 1615945505,
        "id": "m6p4bl",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "Been trading options for a few years on fidelity active trader pro and robing-hood. I like ATP but there doesn’t seem to be a good way to view option chains on fidelities mobile app :/ \n\nDoes anyone have recommendations for platforms that are better?",
        "subreddit": "options",
        "title": "Preferred platform for options trading?",
        "url": "https://www.reddit.com/r/options/comments/m6p4bl/preferred_platform_for_options_trading/",
        "created": 1615974305.0
    },
    {
        "author": "DeerLegal",
        "created_utc": 1616967301,
        "id": "mfajjf",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "Did anybody see this allready? WTF 50% Shares held by Fidelity and Black Rock ALONE updates from 2/28/21??!! 🚀🚀🚀🚀🚀",
        "url": "https://i.redd.it/9ih16nrf8up61.jpg",
        "created": 1616996101.0
    },
    {
        "author": "VolkspanzerIsME",
        "created_utc": 1616884490,
        "id": "meoeh0",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "I was just on Fidelity and they have $0 premium $52 strike April 16 calls.....\n\nI'm super new to options and have never seen a $0 premium before. Is this really the free money it looks like?",
        "subreddit": "options",
        "title": "Viacom call options.",
        "url": "https://www.reddit.com/r/options/comments/meoeh0/viacom_call_options/",
        "created": 1616913290.0
    },
    {
        "author": "MoDanMitsDI",
        "created_utc": 1615257909,
        "id": "m0wwno",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Got a little late coz of Fidelity fund settlement. Am I late?",
        "url": "https://i.redd.it/i3omq9nj1xl61.jpg",
        "created": 1615286709.0
    },
    {
        "author": "AOD_Lucifer",
        "created_utc": 1614838418,
        "id": "lxe717",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Started off with robinhood, their UI sure is addicting and i guess that’s their point to get you into making quick trades with market orders to make profit.\n\n&amp;#x200B;\n\nBut there was lots to like about the robinhood UI and I got extremely used to it.  I thence moved over to Fidelity to invest with OTC stocks and hopefully soon Forex, but wow fidelity is extremely old school.  Not to mention their whole trading violations is really annoying.  I like making quick trades and swing trading and entering new positions after exiting another.  But their constant warnings of “you may possibly be committing trading violations due to less settled cash” or whatever.  Maybe I got babied by Robinhood?  This isn’t a robinhood post, simply looking for another brokerage that isn’t as restrictive as fidelity.   \n\n&amp;#x200B;\n\nWhat do you use?",
        "subreddit": "stocks",
        "title": "Advice on brokerages and which is best for me?",
        "url": "https://www.reddit.com/r/stocks/comments/lxe717/advice_on_brokerages_and_which_is_best_for_me/",
        "created": 1614867218.0
    },
    {
        "author": "HughieCanary",
        "created_utc": 1614895613,
        "id": "lxwqp8",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "My top choices are Fidelity, Sofi and Webull\n\nSoFi and WeBull said they'd pay the $75 fee which is huge but I'm wondering what you guys think are good choices. I'd like a brokerage that gives advice as well and Fidelity and SoFi do this I believe. What do you guys think I should switch too?",
        "subreddit": "stocks",
        "title": "Trying to figure out where to transfer my stocks out of Robinhood too",
        "url": "https://www.reddit.com/r/stocks/comments/lxwqp8/trying_to_figure_out_where_to_transfer_my_stocks/",
        "created": 1614924413.0
    },
    {
        "author": "btm610",
        "created_utc": 1615511554,
        "id": "m35vy2",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Need advice from retarded 🦍 Has any one seen this before, is fidelity now Robin Hood they won’t allow trades on securities. Why are they holding it down.",
        "url": "https://i.redd.it/9m2m89hrzhm61.jpg",
        "created": 1615540354.0
    },
    {
        "author": "Eatsomeplants",
        "created_utc": 1617204480,
        "id": "mh8knw",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "I have an RPP (Canadian) through fidelity, with 15 years of contributions in a moderate risk portfolio. These guys only allow you to pick low, moderate or high risk. Basically it’s all bonds and mutual funds, blackrock makes up a ton of mu portfolio. Not by choice as they manage it.\n\nIf a crash is coming, is my only choice to move this to a low risk?\n\nWhat other things should someone know to be prepared for a crash?",
        "subreddit": "stocks",
        "title": "What would you do now if you knew a crash was coming very soon?",
        "url": "https://www.reddit.com/r/stocks/comments/mh8knw/what_would_you_do_now_if_you_knew_a_crash_was/",
        "created": 1617233280.0
    },
    {
        "author": "OneMouseGaming",
        "created_utc": 1615873505,
        "id": "m623yc",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "  \n\n[Straight from My Fidelity account](https://preview.redd.it/lpijzzs6tbn61.jpg?width=2123&amp;format=pjpg&amp;auto=webp&amp;s=59477f8ce153bcde46fe8e1c0d726a2f4ada5a6d)\n\n\"I hope this is considered worthwhile to not ban me; please be kind WSB mods. I think this is a good talking point. \"  \n\n\n  \nBuying the dip to average down when affordable is definitely the way, but there are circumstances where some movement in the opposite direction in regards to average price is not overly detrimental\n\nSomeone was talking about having learned the way of averaging down today in the discussion thread. I'm actually doing the opposite unfortunately with my GME. I bought in on the back side of the 2nd \"crash\" at a few times for an average **$75.55 a share** for 9 shares.  \n\n\n\\-------------------------\n\nI've been buying fractionally when sensible and I'm sitting on 9.39 Shares now. in the process though my average has gone to $**85.8546 a share** ( a $6.01 change over 0.4 shares of fractional pickups. (These pickups have been the daily dips)\n\n&amp;#x200B;\n\nAveraging down when you are strongly out of the money is in my opinion one of the most important aspects in the WSB \"strategy\" of buying dips , holding long, and locking in the lowest average possible.\n\nGME and this short situation makes this one of those situations w*here every share and every bit of a fractional share are going to skyrocket,* so in this case quantity at a reasonable risk and entry point **is my priority.**  \n\n\nI'm adding a snip from my fidelity - there's AMC and AAL below that &amp; 1 share of GME on Robinhood back when it was 80 bucks. ( i know i know) Robinhood is bad, no doubt, BUT The wife is handling robin hood. Its  smaller stakes but she is doing a good job &amp; to me rationalizes still using the platform until i can get her to fidelity  \n\n\nThat's why the fidelity account became our trading platform for main investments, Robinhood for light (math based - non-centralized) ( to avoid the C word) investment and more long term holdings.  Also we have 500ish working in stash just as a long term holding.\n\nThank you to everyone in the WSB community for your information, analysis and conversation.  \n\n\nAs a matter of disclosure {ill honestly sell 2 shares when the second fractal tops out around 1200 to recoup my investment (actually covers across all my trading platforms)} &amp; THE REST IS FUEL FOR THE ROCKET TO MARS. \n\n&amp;#x200B;\n\nI am diamond hand to the moon, but I want the wife to have a confident feeling out of investing with proper Due Diligence, and seeing real returns. I hope to have fractional bought 2.0 more full shares in the mean time so I don't have to touch my main shares.  \n\n\nTLDR: So to summarize while it is usually optimal to try to get your average cost per share down, sometimes a rise in that number is inevitable if you got in early enough. Don't be afraid of a reasonable change in your price per share if quantity is your main asperation  \n\n\nAvg per share was 75.55 for 9 ( buying fractionally it has increased to 81.56 for the gain of .39 shares) \n\n[omg - average cost discussion - Fidelity as proof](https://imgur.com/gallery/TTKV4sZ) \\-imgur link with a bit more exposition.   \n\n\nThank you all  \n\n\n&amp;#x200B;\n\n[Same as the top image- straight from my Fidelity Account](https://preview.redd.it/eydglmvuvbn61.jpg?width=2123&amp;format=pjpg&amp;auto=webp&amp;s=0636575620e12874d3c4ed9fffa6063f0e3f846e)",
        "subreddit": "wallstreetbets",
        "title": "Cost basis per share does not always reflect your earning potential - how buying even if it raises your average can be a benefit during a squeeze, like that we are seeing now.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m623yc/cost_basis_per_share_does_not_always_reflect_your/",
        "created": 1615902305.0
    },
    {
        "author": "rrami002",
        "created_utc": 1614833398,
        "id": "lxcxmj",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "I am changing to Fidelity. I had two accounts, one with TDA and one with Robinhood. I got tired of having two accounts and tired of the customer service. Regarding Fidelity, I heard from many their Customer Service is great despite having an old trading platform. Any tips regarding their platform? I'm going to set up my layout tomorrow. Any tips on set up for options will be great.",
        "subreddit": "options",
        "title": "Changing to Fidelity",
        "url": "https://www.reddit.com/r/options/comments/lxcxmj/changing_to_fidelity/",
        "created": 1614862198.0
    },
    {
        "author": "Thorbeans",
        "created_utc": 1615418509,
        "id": "m2c00s",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/m3eb9d3u8am61.png?width=1448&amp;format=png&amp;auto=webp&amp;s=f335561c09b345ad2a8a3949d71271bc0335ebd0",
        "subreddit": "wallstreetbets",
        "title": "My my gains since quitting my job last month. Fidelity on the left I started with 25k. Thank you WSB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m2c00s/my_my_gains_since_quitting_my_job_last_month/",
        "created": 1615447309.0
    },
    {
        "author": "whereismynut",
        "created_utc": 1614715571,
        "id": "lwb7id",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": " You may be seeing that this company is down today but I believe that because the hype from the recent boom is blowing over. I have some updated comments from users below so give them credit.  \n\n**PLEASE BE AWARE OF FEES FROM FIDELITY AND OTHER BROKERAGES.** ETrade currently has a 5 dollar fee. (fair imo) (just trying to be transparent from what I read up on recently.)\n\n&amp;#x200B;\n\nbasically, copy and paste of  recently published end of Quarter Highlights and my previous post from last week.\n\n&gt;• \t $1.6m Mooring Tensioner project led by Carnegie awarded funding by  Blue  Economy Cooperative Research Centre and formally commences with  project  partner  \n•\tHewlett Packard  Enterprise Company  (HPE) and Carnegie sign Collaboration Agreement to  develop reinforcement  learning-based controller for CETO and commence  work  \n•\tMicrosoft awards Carnegie  with an AI for Earth grant providing  computational resources and  support for a project to enhance Carnegie’s  Wave Predictor   \n• \tOceantera, a southeast Asian  project developer, and Carnegie sign  Collaboration Agreement to explore  potential projects in SE Asia and  share knowledge and expertise  \n•\t Hydrogen opportunities explored and further knowledge developed  through  ongoing internal investigations and via industry relationships  \n• \tGarden Island Microgrid resumes operation following temporary   disconnection required for Department of Defence’s own electrical   upgrades  \n•\tEuropean Commission  releases new EU  Strategy on Offshore Renewable Energy supporting a  vision of at least  1000 MW of ocean energy by 2030 and 60 GW by 2050\n\nI encourage you guys to read their quarterly report.\n\n[https://www.carnegiece.com/portfolio/quarterly-activities-report-4/](https://www.carnegiece.com/portfolio/quarterly-activities-report-4/)\n\nthey're  investing to integrate their technology, reduce costs on their own  tech, and on creating energy. (that's my own understanding.) for  example,\n\n&gt;Hydrogen  opportunities were investigated during the quarter and continue with a  growing interest in the space from industry and government. The  synergies between wave energy and hydrogen production strengthen  productionstrengthen the case and Carnegie has been particularly focused  on opportunities that encompass existing target markets such as  islands,  remote areas, and marine energy consumers including fish  farming. In parallel, enabling technologies are being developed by a  variety of companies that are complementary to Carnegie’s activities.   For example, electrolyzers,  the  devices  that  produce  hydrogen  from   water and  electricity,  are being developed can now use seawater as  their hydrogen source rather than freshwater  \nHydrogen   is most likely to play a  role as long/medium-term storage or as a   fuel source for vessels and generators. Carnegie’s role in the Blue  Economy CRCis providing good insight into the topic of hydrogen in the  marine space and opportunities will continue to be identified.\n\nthis  is basically a long-term play and they will specify it in there as  well. Imo I see the demand for renewable energy. I feel like there will  be heavy reform on how Companies and consumers use energy in the  following 50 years. they specify that in the report.\n\n&gt;Carnegie  continues to seegrowing vision and support for offshore renewables  around the world as demonstrated by actions such as the European  Commission publishing a dedicated EU strategy on offshore renewable  energyin November 2020(An EU Strategy to harness thepotential  of   offshore  renewable  energy  for  a  climate  neutral  future). The EU’s  strategysupports an objective of achievingat least1 GW of ocean energy  by 2030 and 60 GW of oceanenergy  by  2050.  It  alsoproposes  a   strategyto  make  offshore  renewable  energy  a  corecomponent of  Europe’s energy system by 2050.In  the  US,the  new  President  has   significantly  elevated  the  issue  of  climate  change  withrenewed   commitment  to  the  Paris  Agreement.  Carnegie  sees  this  as  highly   positive  andexpects support measures for marine renewables to  increaseas a result\n\nThey  basically go on about all the collab theyre making with the companies  listed above and the fundings they're getting and how the tech works.  Check it out. This isn't financial advice.\n\ntdlr long play at a good price. long term potential.\n\nEdits: add info and fix errors. Price updates\n\n2/26/21-  0.0069+0.0023 (+50.00%)\n\n3/1/21- 0.0072 0.0002 (+2.86%)\n\nuser feed back.\n\n u/[Art-of-Intuition](https://www.reddit.com/user/Art-of-Intuition/) \\-   \n\nFocusing on the technical resource  within the U.S. exclusive economic zone that can be harnessed for  large-scale (megawatt- to gigawatt-scale) energy generation, the report  found that the total marine energy resource in the 50 states amounts to  2,300 TWh/yr – equivalent to approximately 57% of U.S. generation in  2019.\n\n[https://www.offshore-energy.biz/nrel-publishes-marine-energy-resource-report-for-united-states/](https://www.offshore-energy.biz/nrel-publishes-marine-energy-resource-report-for-united-states/)\n\nWave  energy potential is massive! With all the millions of EVs coming online  in the next several years the world will need to quickly generate more  energy and marine energy will have to be a big part of that plan.\n\nCarnegie  has hundreds of patents the reason HPE, Microsoft, and Enel Energy are  partnering with them is for the intellectual property. Carnegie’s long  term plan is to license their wave technology to a larger company ( i.e.  Siemens, GE etc.) this is a long play 2-3 years from now. Buy and hold!\n\n u/[GoingRamboMCAT](https://www.reddit.com/user/GoingRamboMCAT/) \\-  In 100k shares here, incredible partnerships w/ Hewlett-Packard and  Microsoft. Defense contracts, government support, and licensure deals in  play. Ton of potential here! In for the long-haul. \n\n u/[leavemealone559](https://www.reddit.com/user/leavemealone559/) \\-  Bought 3k shares for 10 dollars yesterday thru Fidelity and after I  bought I check my positions and I’m like wtf how am I negative $50  already !? Foreign stock transfer fees :( now It has to hit .02 before I  can break even lmao \n\n u/[Fourfourfourfour44](https://www.reddit.com/user/Fourfourfourfour44/) \\-  12 billion shares outstanding :(",
        "subreddit": "pennystocks",
        "title": "CARNEGIE CLEAN ENERGY LTD SHS 0.0055 -0.0006 (-10.06%) - Why now you should buy and hold for a long-term investment.",
        "url": "https://www.reddit.com/r/pennystocks/comments/lwb7id/carnegie_clean_energy_ltd_shs_00055_00006_1006/",
        "created": 1614744371.0
    },
    {
        "author": "Geoffs_Review_Corner",
        "created_utc": 1615723008,
        "id": "m4tyqt",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "I've seen [IBorrowDesk](https://iborrowdesk.com/) used a lot lately in posts discussing short interest. To clarify, this site tracks stock loan availability from *one* particular broker: Interactive Brokers. IBorrowDesk does not include stock loan availability from [the 5 largest brokerage houses in the nation by the number of customers and assets: TD Ameritrade, Etrade, Fidelity Investments, Vanguard, and Charles Schwab.](https://www.brokerage-review.com/online-brokers/largest-brokerage-firms.aspx#:~:text=Biggest%20Brokerage%20Firms&amp;text=%22The%20big%20five%20brokerages%22%20is,%2C%20Vanguard%2C%20and%20Charles%20Schwab.) So you're only getting a very small window into the entire picture.\n\nI felt this needed to be said because it seems like a lot of theses are based around IBorrowDesk data. I'm not saying it shouldn't be used at all, just that it's data should be taken with a grain of salt. It should be used to supplemental existing information and not as the basis for what positions one should take.",
        "subreddit": "wallstreetbets",
        "title": "STOP Thinking IBorrowDesk is the End All Be All",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m4tyqt/stop_thinking_iborrowdesk_is_the_end_all_be_all/",
        "created": 1615751808.0
    },
    {
        "author": "grave_miscalculation",
        "created_utc": 1616990410,
        "id": "mfh88h",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "I guess what I don't understand with this whole Goldman Sachs sell off is how this isn't a major buying opportunity for everyone else?\n\nRight now, ViacomCBS (VIAC) shares are $48.23 with a P/E ratio is **12.93**!\n\nFor reference, shares were $100.34 at market close on Monday March 22nd. The last time VIAC shares were $48 was on January 29, 2021.\n\nI use Fidelity for investing and they allow me to make pre-market purchases as early as 4:00am Monday morning. \n\nI guess what I'm asking this subreddit is **\"What are the potential risks with setting a limit order for ViacomCBS that would go through at 4:00am EST tomorrow morning?\"**\n\nI'd set my limit order at like $70 or something like that, where I'd still get a great deal on the stock regardless of how much I manage to get it for (which would be $70 or less depending on when the trade can go through).",
        "subreddit": "stocks",
        "title": "So, is this a once in a lifetime opportunity to buy shares of ViacomCBS ($VIAC)?",
        "url": "https://www.reddit.com/r/stocks/comments/mfh88h/so_is_this_a_once_in_a_lifetime_opportunity_to/",
        "created": 1617019210.0
    },
    {
        "author": "Lagformance",
        "created_utc": 1615315522,
        "id": "m1d5kk",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Bought on RH for $320. $2100 worth.. sold at $60.. only to repurchase 1 at $75 and 2.5 more at $220 this time on Fidelity.. I'll be honest I was scared RH was going down and transferring was a scare too. Idiot... I think I'll sell again when I hit $30 this time. Someone sho",
        "url": "https://www.reddit.com/gallery/m1d5kk",
        "created": 1615344322.0
    },
    {
        "author": "BoostMobileGuy",
        "created_utc": 1615222808,
        "id": "m0k6yo",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "RKT is the “Bull of The Day” on Fidelity app! To The Moon!!!",
        "url": "https://i.redd.it/udw20qa65ul61.jpg",
        "created": 1615251608.0
    },
    {
        "author": "TheIndulgery",
        "created_utc": 1615992143,
        "id": "m71xi8",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "As we've all seen, everyone and their brother has a stock mention scraper these days so I thought I'd start tracking them. I was looking for the ones that would give the clearest idea of a strategy that could be carried into actual trading. So it had to have consistent updates, be reliable information, provide a useful set of measurable metrics, and be easy to copy/paste or import into Google Sheets.\n\n&amp;#x200B;\n\n**In the end the two I landed on were:**\n\n[Unbias Stock](https://unbiastock.com/reddit.php): It provides hard number scores for ticker mentions across multiple platforms\n\n[Finviz](https://finviz.com/?a=304482240): The screener section allows you to filter a lot of ways, I was interested in the ATH data\n\n&amp;#x200B;\n\nTL;DR: [I tracked a couple thousand tickers over the course of a couple months and here's a Google Sheet with the data](https://docs.google.com/spreadsheets/d/1NnDo-NPqagm5oriKAxgtF46Duvbf1I45fIeQ2SwrxrU/edit?usp=sharing)\n\n&amp;#x200B;\n\nMethodologies:\n\n* Every day at market close I get all the ATH data for that day and paste it into the sheet\n* Every morning just before market open I enter all the social media ticker information gets entered each morning so I can collect all the info from the full day and night before\n* The sheet uses GoogleFinance functions to pull ticker \"high\" for the day each day. Google is sometimes spotty about updating so you'll see gaps in the data. I go through regularly and paste the values into the spots to lock in the data\n* It calculates a lot of things, but the big things are\n   * What score grouping has the highest rate of profitability? (i.e. Which grouping should I look for when deciding on a stock)\n   * Which social media is the most profitable?\n   * What is the max price and % change after the date it was entered into the sheet? (i.e. What kind of limit sell should you set)\n   * How many days did it take to get to the max price? (i.e. How long should you hold)\n\n&amp;#x200B;\n\n**Analysis (Keep in mind that the data is constantly changing and updating):**\n\n1. The most successful platform is Reddit. Wisdom of the Masses is a real thing\n2. Set limits and take profits when they hit, holding too long every platform loses money\n3. Stocks with a Reddit score of under 500 become profitable FAR, FAR more often than any other category\n4. They hit their max profit on average between 4 - 8 days. After than they all start losing money\n5. Average % increase (limit sell) is 15% - 17%\n\n&amp;#x200B;\n\n**Other interesting finds:**\n\nStocks that have hit an ATH the previous day are profitable the next day 34% of the time and profitable within the next 5 days 56% of the time. If you look at the full table it's a strong, strong strategy for incremental gains. 5% - 23% gains are really consistently feasible\n\nStockTwits LOOKS very successful when you see their hit rate, but if you look at the score categories you see that they are only successful in stocks with a score greater than 5000. That means that they are just coat tail riding on stocks that everyone else called successful long before. So they're not good at picking stocks, but they ARE good at jumping on the bandwagon as it comes screaming towards them. And it's not a terrible strategy, the average % of profit of that category is 23%  \n\n\n**Conclusions:**\n\nObviously I'm not qualified to give you guys advice, but what I've been using the data to do is:\n\n1. I find stocks that have a score of under 500 in Unbias Stock and do a little digging. If they haven't popped yet I buy up the ones with the most Reddit mentions. I set a limit sell of 15% on them  \nThis strategy has been working really well for me. I'm hitting the 15% about 75% of the time, and the ones that I don't I sell after 5 days usually somewhere between 1% and 10%. I've only taken a loss twice\n2. I have recently started buying stocks at ATH and selling them within the next day or two if they hit 5%. This has been hit or miss so far\n3. I started this a month ago in my RH account (it's where my play money is) and compared it to my \"responsible\" investments in my Fidelity account. They both started at the same amount and as of today my RH account is up 25% and my Fidelity is down 36% (fucking tech man)\n\n&amp;#x200B;\n\nGood luck! If anyone has any ideas of how to better parse the data let me know, I'm more than happy to make this better.",
        "subreddit": "stocks",
        "title": "A month of tracking stock scrapers for success/failure rates",
        "url": "https://www.reddit.com/r/stocks/comments/m71xi8/a_month_of_tracking_stock_scrapers_for/",
        "created": 1616020943.0
    },
    {
        "author": "MealMoist",
        "created_utc": 1614868475,
        "id": "lxluea",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "pennystocks",
        "title": "Are my positions solid? It's hard to see them plummet like this. Should I HODL for a year and just delete Fidelity for now?",
        "url": "https://i.redd.it/ceer2gxcv0l61.png",
        "created": 1614897275.0
    },
    {
        "author": "Alwaysfavoriteasian",
        "created_utc": 1614735008,
        "id": "lwhvue",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": " So, yes I’m another person asking for advice. Hear me out though. \n\nI’ve watched and read what I’ve been able to do far. I have placed $4000 into the market. I did my best to diversify and to invest in things that are safe. Full disclosure, I have money in two penny stocks that I really believe in. Otherwise I bought into Tesla my only blue chip, among a bunch of others like KO, JNJ, COST, PM and an ETF. \n\nMy real issue is that after a month I haven’t seen any kind of fluctuation. I blame this on the fact that my $4k didn’t go very far and I’m purchasing only 1 or 2 shares in each company. I figured any returns I make I would put back into the companies but I see this as taking a fair amount of time before I have enough stake in each stock to have a good chance of any worthwhile return. \n\nWhat can I do to get myself started in order to grow my portfolio? Or is it really a long waiting game where I have to continually put my paychecks in until I have maybe $20k invested at which point I can sit and ignore the market until I open up my fidelity app and see there’s some sort of return where I can reinvest? \n\nAdditional advices appreciated including tough love and critical feedback. \n\n*on Mobile sorry for grammar.",
        "subreddit": "stocks",
        "title": "What is a good way to go about growing your portfolio while trying to diversify?",
        "url": "https://www.reddit.com/r/stocks/comments/lwhvue/what_is_a_good_way_to_go_about_growing_your/",
        "created": 1614763808.0
    },
    {
        "author": "Tomimi",
        "created_utc": 1615413008,
        "id": "m29sp2",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "I created a Vanguard account a few weeks ago put some money on it and bought stocks today. I wanted to buy more so I put more money on it but it seems like they have a 7 day waiting period before I can even use it.\n\nShould I open an fidelity account or would it be the same thing?",
        "subreddit": "stocks",
        "title": "Vanguard takes 7 days before I can use my money to trade, should I create a Fidelity/Merrill Lynch account?",
        "url": "https://www.reddit.com/r/stocks/comments/m29sp2/vanguard_takes_7_days_before_i_can_use_my_money/",
        "created": 1615441808.0
    },
    {
        "author": "Ricky_Spanish341",
        "created_utc": 1614859416,
        "id": "lxiz68",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Quick question here; I started a transfer yesterday of asserts from Robinhood to Fidelity. This morning my Robinhood account was restricted. \n\nIs this normal for those of you that made the same switch?  \n\nThanks.",
        "subreddit": "Wallstreetbetsnew",
        "title": "ROBINHOOD ACCOUNT RESTRICTION",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lxiz68/robinhood_account_restriction/",
        "created": 1614888216.0
    },
    {
        "author": "TheRealGordonRamsey_",
        "created_utc": 1614817519,
        "id": "lx8e3d",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "I have a fidelity go account and I set it to allow their people to invest my money for me. honestly ive only invested $40 right now but its bouncing between $39.19- 39.50. so basically its only lost a couple cents but yeah. its gonna go back up right? 😅",
        "subreddit": "stocks",
        "title": "question about the fidelity go account I have.",
        "url": "https://www.reddit.com/r/stocks/comments/lx8e3d/question_about_the_fidelity_go_account_i_have/",
        "created": 1614846319.0
    },
    {
        "author": "Army-Jazzlike",
        "created_utc": 1615770046,
        "id": "m58zr8",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": " I want to buy some AMC calls tomorrow. I'm thinkin march 26th $13 probably 2 or 3 contracts. I'm optimistic it will hit beyond 13 next 2 weeks.\n I am a newbie when it comes to options, this would be me getting my feet wet. I'm not seeking financial advice but just a friendly \"your a moron\" or \"sounds reasonable\" \n I also have a question. If and when these calls go itm what do I do? Just sell them? I'm assuming it'll be obvious on fidelity but I just don't want any surprises when I don't need them. \nThanks in advance, I know these questions make me seem retarded but I literally know zero people into stocks in my real life and I've watched videos and understand what's happening here but just a but timid.",
        "subreddit": "StockMarket",
        "title": "AMC calls",
        "url": "https://www.reddit.com/r/StockMarket/comments/m58zr8/amc_calls/",
        "created": 1615798846.0
    },
    {
        "author": "aarontm1211994",
        "created_utc": 1614922242,
        "id": "ly4zir",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Fidelity closed out my shares of GME as a \"risk liquidation over an ACH issue that I called and corrected with them already. WTF!!! Guess I'm down to 12 now 😭",
        "url": "https://i.redd.it/xwnmmxlfb5l61.jpg",
        "created": 1614951042.0
    },
    {
        "author": "TomNewYork52",
        "created_utc": 1615516590,
        "id": "m37jwz",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "I have ameritrade and OTC stocks cost $6.95.  Fidelity and Schwabb, as example, advertise $0.  So did ameritrade but there’s always the * to note exceptions.\n\nWould appreciate hearing some suggestions for low or no fees.\n\nYeah.  This is like the third question I asked in two days.  Thanks for being patient.",
        "subreddit": "pennystocks",
        "title": "Know of No fee OTC trades?",
        "url": "https://www.reddit.com/r/pennystocks/comments/m37jwz/know_of_no_fee_otc_trades/",
        "created": 1615545390.0
    },
    {
        "author": "thewoodworkingchef",
        "created_utc": 1617213252,
        "id": "mhborw",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Fidelity will only approve me at the lowest level of options trading.....I can’t even buy uncovered call options. After sitting on hold forever, they can’t/won’t even tell me why. I have (beyond) excellent credit and a good chunk of cash in my acct.....I’m pissed enough to switch brokers. Suggestions on a new platform?",
        "subreddit": "stocks",
        "title": "Fidelity won’t approve me for options....New broker?",
        "url": "https://www.reddit.com/r/stocks/comments/mhborw/fidelity_wont_approve_me_for_optionsnew_broker/",
        "created": 1617242052.0
    },
    {
        "author": "Leroy_31",
        "created_utc": 1616969350,
        "id": "mfb8cw",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "I have $50 cleared on Fidelity and was looking for some advice on what pennystock to put it in to. I was originally planning on getting my average down on ETFM or just buying more OZSC.",
        "subreddit": "pennystocks",
        "title": "What's the best pennystock to put $50 into?",
        "url": "https://www.reddit.com/r/pennystocks/comments/mfb8cw/whats_the_best_pennystock_to_put_50_into/",
        "created": 1616998150.0
    },
    {
        "author": "Urwifesluver",
        "created_utc": 1614903632,
        "id": "lxzgqg",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Thanks",
        "subreddit": "options",
        "title": "Whats the best app to use for trading options I use fidelity now but they will only give me level 1 so I’m looking for another company that’ll let me buy call options with out having to wait months for approval",
        "url": "https://www.reddit.com/r/options/comments/lxzgqg/whats_the_best_app_to_use_for_trading_options_i/",
        "created": 1614932432.0
    },
    {
        "author": "HalfInsaneOutDoorGuy",
        "created_utc": 1615399680,
        "id": "m2464t",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "I'm probably the biggest retard here, having bought at 40, sold at 140, then bought again at 200, sold at 120, then bought at 340 then sold at 198, and bought again at 225 where I sit now like a completely polished smooth brain paper hand ape retard. \n\n&amp;#x200B;\n\nI'm still learning the ways. I've made a decent chunk of change with Tesla, gopro and xone and a few others. but GME baffles me. It dives SO fucking hard, gets frozen, gains fast, dives again...its like a rollercoaster of \"WTF\" \n\n&amp;#x200B;\n\nThanks for your smarts. BTW I'm on RH....i know. I'm in the process right now of opening a thinkorSwim account with TD. I would have gone with fidelity but my fucking company has an account there and I can't use it for stocks...just have to look depressingly at my 2-4% yearly gains on a damn 401k....",
        "subreddit": "Wallstreetbetsnew",
        "title": "Can someone EL5 why stocks in general, but specifically GME dives, and gains like it does?",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/m2464t/can_someone_el5_why_stocks_in_general_but/",
        "created": 1615428480.0
    },
    {
        "author": "Gbr2577",
        "created_utc": 1615593754,
        "id": "m3uo7x",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Currently I’m still on Robinhood because I’ve liked the user friendly interface and felt it was a good way to dip my toes into investing. Currently considering switching to either TD Ameritrade or Fidelity just because I’ve been hurt a few times recently just by not having access to the full extended hours trading windows. \n\nWondering what people’s experiences have been with other brokerages for someone who still considers themselves a beginner at investing. Good user interface and mobile platform is a big plus for me.",
        "subreddit": "wallstreetbets",
        "title": "Considering switching brokerages",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m3uo7x/considering_switching_brokerages/",
        "created": 1615622554.0
    },
    {
        "author": "b10m1m1cry",
        "created_utc": 1614898226,
        "id": "lxxnlr",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "So lately with all this talk of the yield of the 10 year treasury bond shooting up and now above 1.5%.  How does one actually buy one(1) bond of the 10 year treasury yield?\n\n--\n\nI currently do my trading on Fidelity.  So does fidelity allow an individual investor to buy bond?\n\n--\n\nThanks.\n\n---\n\nEdit:  Just to clarify.  I am not going to buy bond!  I'm just curious as to how one can buy bond that's all.  Thank you for all the responses though.",
        "subreddit": "stocks",
        "title": "How to buy US treasury bond?",
        "url": "https://www.reddit.com/r/stocks/comments/lxxnlr/how_to_buy_us_treasury_bond/",
        "created": 1614927026.0
    },
    {
        "author": "joeroganthumbhead",
        "created_utc": 1615694633,
        "id": "m4ng3d",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "I think this is pretty self explanatory but when I sell a stock for profit, will those profits “disappear” and not be shown in the total gains column in brokerage account? I am trying to figure out my total profits in fidelity which includes the positions that I exited for a profit.",
        "subreddit": "stocks",
        "title": "When I sell stock for a profit, are profits no longer reflected?",
        "url": "https://www.reddit.com/r/stocks/comments/m4ng3d/when_i_sell_stock_for_a_profit_are_profits_no/",
        "created": 1615723433.0
    },
    {
        "author": "kaydiva",
        "created_utc": 1615237424,
        "id": "m0q16c",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "I’m fairly new to investing, so thanks for your patience. :) I use Fidelity, and I tried to buy PONGF but it’s currently under $1 a share and apparently Fidelity doesn’t allow this, so I had to change it from a market to a limit order. But then they were going to charge me a $50 commission fee. What is that about? Is there another platform where I won’t have this issue?",
        "subreddit": "stocks",
        "title": "Does anyone know where I can buy stocks under $1? Fidelity doesn’t allow it.",
        "url": "https://www.reddit.com/r/stocks/comments/m0q16c/does_anyone_know_where_i_can_buy_stocks_under_1/",
        "created": 1615266224.0
    },
    {
        "author": "3dprintsAnomus",
        "created_utc": 1615937846,
        "id": "m6mmz4",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "If someone gets to the first 2-3 pages with DD explain X or Y is going to MOON on X date can they be banned when it goes tits up on them or a flair like a dunce hat or weekly mass sticky thread calling out the most upvoted posts on their bullshit?\n\nHere are a few of people going off that X is going to go up because it broke some lines they put up or think it will moon by X date on some items they don't understand?\n\nGME people.\n\nhttps://old.reddit.com/r/wallstreetbets/comments/m6e4s0/the_downward_trend_has_broken_on_gme/\n\nhttps://old.reddit.com/r/wallstreetbets/comments/m6fkiz/very_bullish_market_dip_indicator_trend_reversal/\n\nhttps://old.reddit.com/r/wallstreetbets/comments/m6i933/tomorrow_the_tendie_man_comes/\n\nUWMC person.\n\nhttps://old.reddit.com/r/wallstreetbets/comments/m6id0b/how_uwmc_can_make_us_all_rich_friday_do_not_waste/\n\nUWMC is below all annalist's market price by 41% and already went above $12 before the market tossed it aside like spoiled milk.\n\nhttps://finance.yahoo.com/quote/UWMC/analysis?p=UWMC\n\nBut going by Yahoo's and fidelity performance out look is a sea of fucking red long term for the company.\n\nThis type of behavior isn't good for the community and is the same thing that drifters and conspiracy people use to keep people interested. \n\nUWMC 100 shares\nAMD 78 Call 4/9\nGM 59 PUT 4/30 100 shares $58.72\nSPY 395 Call 3/24\nVIX 12.5 call 4/30\nBB $12 call\nXOM 32.5 call 7/16 \nXOM 62.5 call 7/16\nKMI $18 call 1/21/22\nKMI $20 call 1/21/22 100 shares\nKMI $16 PUT 3/26\nFNF 100 shares\nRKT 100 shares\nGME 1 share $125.62",
        "subreddit": "wallstreetbets",
        "title": "GME Conspiracy DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m6mmz4/gme_conspiracy_dd/",
        "created": 1615966646.0
    },
    {
        "author": "Losttale",
        "created_utc": 1615274790,
        "id": "m11emd",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "A) Background:\n\n10 year interest rates going up, currently hovering around 1.5% with expectations to increase to 1.9%\n\n[U.S. 10-yr Treasury yield to hit 1.9% by year end -Goldman Sachs | Reuters](https://www.reuters.com/article/usa-bonds-goldmansachs-idUSL2N2L239O)\n\nwhat this does to valuation is that it depresses future earnings from a valuation perspective, thereby driving down growth stocks and stocks with long term horizons baked into their valuation\n\n[Why this rate-driven sell-off is hitting tech stocks hardest (cnbc.com)](https://www.cnbc.com/2021/03/05/why-this-rate-driven-sell-off-is-hitting-tech-stocks-the-hardest.html)\n\n[BlackRock's chief bond strategist breaks down the 3 reasons rising bond yields are whacking stocks | Markets Insider (businessinsider.com)](https://markets.businessinsider.com/news/stocks/bond-yields-rising-stock-market-falling-explainer-blackrock-2021-3-1030157203)\n\nB) ARK funds:\n\nARKK is all about growth stocks and have been hit relatively hard from highs \\~20%.\n\n[Cathie Wood’s ARKK Struggles in Early Trading After 20% Retreat (yahoo.com)](https://finance.yahoo.com/news/cathie-wood-arkk-sinks-20-203935202.html)\n\nBut if you believe in A) above, that could mean that the stocks in the portfolio should continue its downward momentum... (at least in the near term, 2021?). Every comment I've seen about the companies that ARKK owns is that they are great companies in 5 years.....Which I can agree.... But, how about today right now in this current environment? (Feel too much future value have been baked into these companies in this moment in time)\n\nC) Thesis:\n\nI believe \"Smart money\" have been raiding the ARK.\n\n[Why Cathie Wood's once hot Ark Innovation ETF has lost all its 2021 gains (yahoo.com)](https://sg.news.yahoo.com/why-cathy-woods-once-hot-ark-innovation-etf-has-lost-all-its-2021-gains-185620392.html)\n\nThe mechanism - ETF Arbitrage/low liquidity\n\n[Record redemption in Ark ETF sparks liquidity worries (yahoo.com)](https://finance.yahoo.com/news/record-redemption-ark-etf-sparks-070000147.html)\n\n\" The pressure on the fund this week has lured in short-sellers, with 100% of Ark Innovation shares available for shorting out on loan as of Monday, data provider FIS Astec Analytics estimated.\"\n\n\" Selling pressure can cause the ETF to trade below net asset value (NAV), which leads to \"redemptions\" as ETF arbitrageurs exchange the fund for the underlying holdings and then sell the underlying holdings, exacerbating the selling pressure on these ETFs. \"\n\n[ARK Innovation ETF: Flood of Inflows Creates Liquidity Drought (yahoo.com)](https://finance.yahoo.com/news/ark-innovation-etf-flood-inflows-230737809.html)\n\nSummary - Short the fund -&gt; Short the underlying -&gt; As price is driven lower on fund -&gt; more redemptions -&gt; Liquidity dries up -&gt; Negative feedback loop -&gt; Further downward pressure on fund and underlying\n\nD) Mechanism:\n\nObviously \"smart money\" have been doing this for 2 weeks now which explains the substantial price drops. At the time of this writing; I have puts on ARKK, Tesla, Roku, TDOC instead of shorting the stock outright.",
        "subreddit": "options",
        "title": "Options Play on ARKK",
        "url": "https://www.reddit.com/r/options/comments/m11emd/options_play_on_arkk/",
        "created": 1615303590.0
    },
    {
        "author": "NovaBorn1105",
        "created_utc": 1615891969,
        "id": "m66cfn",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "Full disclosure I'm a lurker and not used to structuring posts so forgive me if this comes across as anything other than a genuine (potentially retarded) question.\n\nFirstly, I know T212 sucks and I should get a real broker like Fidelity blah blah blah I joined last year before this saga educated my smooth-ish brain cut me some slack.\n\nMy question is what is the actual likelihood that T212 will prevent selling when the MOASS arrives? I know they tried some fuckery with restricting buying in January. I actually contacted them about this and they basically said \"soz our intermediary makes decisions we just push buttons\" which is fair enough.\n\nBut in the reverse situation, do they have any real reasons to prevent me from choosing when to close my positions? I read on a post earlier that eToro have in their terms and conditions a short sentence about being able to close your open transactions at a price that they deem proportionate (section 29.3).  Surely T212 will be similar in their behavior during this event?\n\nMy theory is that they hopefully will not restrict the selling due to the clear case for lawsuits + it doesn't financially hinder them in any way. But at the same time if they are at the mercy of their intermediary who are themselves linked to those that are about to be liquidated then perhaps that will start a vicious chain down to me.\n\nTL;DR Just need a more experienced ape to assess the situation clearly - should I worry or nah?",
        "subreddit": "wallstreetbets",
        "title": "Genuine T212 query for any UK apes out there - Are we safe from their shenanigans during MOASS?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m66cfn/genuine_t212_query_for_any_uk_apes_out_there_are/",
        "created": 1615920769.0
    },
    {
        "author": "icecube373",
        "created_utc": 1617054045,
        "id": "mg0bia",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Like the title states I’ve initiated a transfer request from TDA to Fidelity and I wanted to know if anyone here has done one recently (or in the past) and can answer my question on how long it usually takes to complete the full transfer, and where can I check my transfer status on either the Fidelity or TDA app? Any and all help would be appreciated :)",
        "subreddit": "stocks",
        "title": "Questions on transferring from TD Ameritrade to Fidelity",
        "url": "https://www.reddit.com/r/stocks/comments/mg0bia/questions_on_transferring_from_td_ameritrade_to/",
        "created": 1617082845.0
    },
    {
        "author": "Seemekid",
        "created_utc": 1617210505,
        "id": "mhapni",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "The brokers I’ve been using for awhile are fidelity and robinhood. However, I’m just getting into penny stocks, but it seems most brokers I’ve seen only allow you to buy stocks that are more than 1$. So what are the best ones you all use and have great faith in?",
        "subreddit": "pennystocks",
        "title": "What broker is best for penny stocks?",
        "url": "https://www.reddit.com/r/pennystocks/comments/mhapni/what_broker_is_best_for_penny_stocks/",
        "created": 1617239305.0
    },
    {
        "author": "throwaway_413_",
        "created_utc": 1614901144,
        "id": "lxyngw",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "1. A large portion of RBH users hold GME shares.\n2. RBH collects that sweet interest lending out our GME shares to shitadel and friends.\n\nBased on the aforementioned points, if the hedge funds that went short go bankrupt during the squeeze and the bag gets passed up upstream, brokerages such as RBH who lent out GME shares are next in line.\n\nIf GME ends up being the MOASS, people are quick to point out that there will be plenty of trendies to pass around cause the DTCC has tens of trillions on top of insurance. What no one seems to be asking is if your brokerage will remain solvent during the squeeze. Vanguard and Fidelity manage trillions and can weather the storm but what about small time brokers like robinhood and webull? If a broker goes bankrupt there’s SIPC insurance which insures securities up to 500k which is chump change if we get the MOASS.\n\nAre my concerns of RBH going bankrupt during the MOASS valid? If not, are there other protection measures a broker has to prevent calamity that I am not aware of? Thanks",
        "subreddit": "Wallstreetbetsnew",
        "title": "Could Robinhood go bankrupt if GME squeezes?",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/lxyngw/could_robinhood_go_bankrupt_if_gme_squeezes/",
        "created": 1614929944.0
    },
    {
        "author": "rwm3188",
        "created_utc": 1615650160,
        "id": "m48qt4",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "This should be a shitpost because I almost shit my pants. Recently had an etf split 10:1 and it took Fidelity a second to catch up. The real loss was only a couple hundred bucks, but anyone else with Fidelity don’t be surprised if you see this one day:",
        "url": "https://i.redd.it/ljopespwftm61.jpg",
        "created": 1615678960.0
    },
    {
        "author": "Zeuszoos",
        "created_utc": 1615426386,
        "id": "m2epc1",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nForgive me if this is a stupid question, but I just don't understand it.\n\nI'm using Fidelity, which has no commissions.\n\nFYI, I do understand about Bid/Ask and how there might be a difference in price between the time that I look at the stock and placing the order a couple of minutes later.  But I am not talking about small differences here.\n\nAlso, I did check my orders and what I put in my stock tracking app matches my \"Completed Orders\" with Fidelity.\n\nExample:\n\nI bought a stock for, let's say $23.87 per share.  Fidelity showed a notification with the number of shares I purchased, plus the exact price per share, which matches ($23.87).\n\nI then put the stock into my stock tracking app with the number of shares and price per share.\n\nBut let's say a week later I check on the stock.\n\nMy tracking app shows the correct info and shows that the stock has gone up to $24.75 and I'm at a profit.\n\nHowever, when I go into the Fidelity app and look at that stock, while it also shows the stock's current price as $24.75, it shows my \"Cost Basis Per Share\" as $28.19 and shows my \"Total Gain/Loss\" to be a loss of hundreds of dollars!\n\nI know that the original purchase price that I get the stock for is a little higher than Fidelity gets it for, so they can make money.  That's fine.  But.....\n\n* This is a big difference!\n* What does \"Cost Basis Per Share\" even mean?\n* I thought that whatever price they gave me in the \"Order Completed\" notification should accurately reflect what I paid for the stock, no?\n\nCan anyone help me understand this please?  I'm not brand new to stocks.  I'm just new to this broker and I've never had this happen before, nor seen this many columns in the Portfolio (Positions) screen. :-)\n\nThank You!",
        "subreddit": "stocks",
        "title": "Why the Difference (Broker/Me)?",
        "url": "https://www.reddit.com/r/stocks/comments/m2epc1/why_the_difference_brokerme/",
        "created": 1615455186.0
    },
    {
        "author": "Storm-Kerr",
        "created_utc": 1615323084,
        "id": "m1fz7y",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I’m a disabled vet, not the Trumplican kind, the “I’ve seen more than my fair share of suffering and I want to do something good for my family” type. \n\nI’ve been watching this play out in real time and it has been a joy to see the dicks of the world get fucked for once. Thanks for that. \n\nI’m on Fidelity with less than $100 worth of trades, I’m just in WAY over my head after being chronically poor for most of my life. Fear of loss is the biggest hinderance to me making any meaningful progress. I feel like I suffer from “poverty brain syndrome” and I need help learning how to think and grow rich. My dad was the poor dad. \n\nWhen school opens again, I am taking a finance class. Until then, where can I go to learn about analytics? How do I due the due, I want to be diligent. \n\nStrangers from the internet, can you point at me and laugh? I’m mean, can you point me in the right direction?",
        "subreddit": "wallstreetbets",
        "title": "Smooth Brain Tries To Grow Wrinkles...",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m1fz7y/smooth_brain_tries_to_grow_wrinkles/",
        "created": 1615351884.0
    },
    {
        "author": "SmalltraderFlorida",
        "created_utc": 1615248696,
        "id": "m0u1ir",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Hello everyone!\n\nI currently use Fidelity but have been eyeing TDAmeritrade. Has anyone used them both? What did you like more about either platform? \n\nI am learning to do options and looking for an easy to understand platform for options. Someone suggested using Robinhood but not sure what way to go.\n\nI like using the fractional shares in Fidelity but from what I have herd that TDAmeritrade might be getting fractional shares since they were acquired by Charles Shwab.",
        "subreddit": "stocks",
        "title": "TDAmeritrade v. Fidelity",
        "url": "https://www.reddit.com/r/stocks/comments/m0u1ir/tdameritrade_v_fidelity/",
        "created": 1615277496.0
    },
    {
        "author": "ghost_in_a_jar_c137",
        "created_utc": 1615771351,
        "id": "m59egq",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "I see lots of Fidelity customers selling gme and amc this past Friday.",
        "url": "https://i.redd.it/p5qhugu9g3n61.jpg",
        "created": 1615800151.0
    },
    {
        "author": "lucy_kat",
        "created_utc": 1615416367,
        "id": "m2b631",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "When you guys first started getting into stocks and trading, what was some of the first ones you invested in? \n\nCurrently what would be the ones to put money down on with a semi risk aspect? \n\nI do know the rule of not trading what you can't afford to lose.",
        "subreddit": "stocks",
        "title": "Just opened a fidelity account to do some trading.",
        "url": "https://www.reddit.com/r/stocks/comments/m2b631/just_opened_a_fidelity_account_to_do_some_trading/",
        "created": 1615445167.0
    },
    {
        "author": "Hopeful_Big5045",
        "created_utc": 1615504369,
        "id": "m33gl4",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I am new to trading stocks and I just recently opened up a fidelity account and bought a bunch of GME stocks thanks to you apes. My question is once I buy a stock how do I close the trade and take profit?? Sorry like I said I'm a retarded and I'm new to trading.",
        "subreddit": "wallstreetbets",
        "title": "HELP!!!❗❗❗",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m33gl4/help/",
        "created": 1615533169.0
    },
    {
        "author": "Krejar",
        "created_utc": 1615329481,
        "id": "m1id4e",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I just got off a chat with Fidelity asking about when RBLX will be available to retail investors. The official word is tomorrow, 3/10, at 8am EST, Fidelity will have RBLX listed and ready for open game!\n\nAside: I got muted for 3 days and banned for 1 in WSB for posting this. I guess no one cares.",
        "subreddit": "Wallstreetbetsnew",
        "title": "Fidelity - RBLX will be available 8am EST for open retail trading",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/m1id4e/fidelity_rblx_will_be_available_8am_est_for_open/",
        "created": 1615358281.0
    },
    {
        "author": "AnItchyAnus",
        "created_utc": 1615399322,
        "id": "m2400c",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Everybody on here told me \"Fuck Robinhood, use Fidelity.\" Fidelity on PC doesn't update the price. They are consistently about 15min behind and their prices are all wrong. How is this legal?",
        "subreddit": "wallstreetbets",
        "title": "FIDELITY FRAUD: The website is selling GME for 30% higher than the price.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m2400c/fidelity_fraud_the_website_is_selling_gme_for_30/",
        "created": 1615428122.0
    },
    {
        "author": "tired_trotter",
        "created_utc": 1615857970,
        "id": "m5xo46",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I noticed there's a difference between orders execution between these two. The same order is filling consistently with better price on Fidelity platform. I wonder, why is it?",
        "subreddit": "options",
        "title": "Fidelity vs TD Ameritrade order fill",
        "url": "https://www.reddit.com/r/options/comments/m5xo46/fidelity_vs_td_ameritrade_order_fill/",
        "created": 1615886770.0
    },
    {
        "author": "pleadinginsanity2",
        "created_utc": 1615931269,
        "id": "m6kcbc",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I have been using Robinhood. Despite the people who are mad about the Gamestop issue, it has worked well for me. The only downside I see is no ability to sell short, which I do not plan do do very often, so it is not a deal breaker. I love the instant deposits and simple interface. I wish they provided ckecks as well as a debit card, but again, not a deal breaker.\n\nI opened a Fidelity account, which I have yet to fund because I want to deposit cash and move gradually to using it (if I do at all) rather than tying up my investments while transferring them. I do not have any experience with Fidelity and really just opened the account based on comments I have read here on reddit.\n\nI would appreciate input and suggestions from more experienced traders. I am sure this comparison is not as simple as I think it is.\n\nI am also considering using my brokerage account for my day to day banking. I realize I would have to be careful to avoid getting into margin unless it was for something very important, but I also see margin as a way to access low interest cash instead of using credit cards. Dumb or smart?\n\nThank you.",
        "subreddit": "stocks",
        "title": "Seeking Brokerage advice.",
        "url": "https://www.reddit.com/r/stocks/comments/m6kcbc/seeking_brokerage_advice/",
        "created": 1615960069.0
    },
    {
        "author": "gyroboros",
        "created_utc": 1617227349,
        "id": "mhgmmg",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Pro forma FDSO of 380M, implying a $2.4B market cap at a $6.20 share price. Management guiding to $500M+ of revenue in 2021 and $100M+ adj. EBITDA WITHOUT underwriting recreational sales from New York and Virginia, where they are poised to be the #1 operator in the former and the $2 operator in the latter. 2020 revenues were up 234% YoY and the margins are steadily improving. Consider their two NYC locations: 14th &amp; 3rd and Brooklyn. Curaleaf, the largest MSO trading many turns of revenue higher, is located in Queens and Long Island. There is no other MSO better exposed to NYC.\n\n&amp;#x200B;\n\nI am expecting $1B+ in sales in 2022 and $300M+ in adj. EBITDA. That means the biz. is trading at 2.4x 2022 revenues. If you put TLRY's multiple on this business (\\~18x 2022 revenues), it should be trading at $40/share. \n\n&amp;#x200B;\n\nYou can find the investor presentation here: [https://d1io3yog0oux5.cloudfront.net/\\_fe270c2c6e3bf48c50a3a306a395bf60/colcare/db/354/2637/pdf/CCHW+Presentation+Q4+2020+\\_+vFINAL%282%29.pdf](https://d1io3yog0oux5.cloudfront.net/_fe270c2c6e3bf48c50a3a306a395bf60/colcare/db/354/2637/pdf/CCHW+Presentation+Q4+2020+_+vFINAL%282%29.pdf)\n\n&amp;#x200B;\n\nDisclosure: I am long 20k shares and know this business better than most on the Street. It trades OTC like other MSOs but I expect SAFE banking to pass the Senate and uplisting to occur within the next 18 months. Can discuss this further in the comments.\n\n&amp;#x200B;\n\nEdit: It's not a foreign stock. It's listed on the Toronto NEO under CCHW, but the company is incorporated in the U.S. (founded in New York, actually) and trades on the OTC as CCHWF. Management is American with ex-Goldman and private equity backgrounds. Fidelity doesn't charge me anything to buy shares.",
        "subreddit": "wallstreetbets",
        "title": "Columbia Care ($CCHWF) is the weed MSO with the greatest exposure to newly legalized New York and Virginia",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mhgmmg/columbia_care_cchwf_is_the_weed_mso_with_the/",
        "created": 1617256149.0
    },
    {
        "author": "Childhood_Pristine",
        "created_utc": 1615397967,
        "id": "m23bub",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I tried selling in Fidelity and it’s not letting me WTF 🤬 anyone else having this issue?!",
        "subreddit": "wallstreetbets",
        "title": "WTF",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/m23bub/wtf/",
        "created": 1615426767.0
    },
    {
        "author": "NeverForget2016",
        "created_utc": 1614865883,
        "id": "lxky0j",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": " Fidelity user here. I've been getting into spreads a bit, but an issue I'm running into is how to stop loss my positions. When I buy a vertical spread, the two options are bundled as one and operate as a net debit or net credit trade, which is great and fast and super slick. I can't seem to find a way to enter a stop loss order on *both* positions simultaneously, though. I want to be able to trade the entire spread as a bundled entity so to speak, not as individual options. If I close one leg of the spread, I want the other to be automatically bundled with, because buying one leg back costs a huge amount of money, and then I have to sell the other one at the same time, which would seem to require a conditional order. I'm hoping it's not this complicated. Is there any way to trade a vertical spread as *one* bundled position once it's in your portfolio? Let me know if what I'm asking makes sense!",
        "subreddit": "options",
        "title": "Stop Lossing Vertical Spreads on Fidelity",
        "url": "https://www.reddit.com/r/options/comments/lxky0j/stop_lossing_vertical_spreads_on_fidelity/",
        "created": 1614894683.0
    },
    {
        "author": "SnooHesitations7100",
        "created_utc": 1617121738,
        "id": "mgjxpv",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Went over margin and had to sell my stock to cover negative balance. How did this even happen?",
        "subreddit": "pennystocks",
        "title": "Margin call? On Fidelity",
        "url": "https://www.reddit.com/r/pennystocks/comments/mgjxpv/margin_call_on_fidelity/",
        "created": 1617150538.0
    },
    {
        "author": "Polytroposphere",
        "created_utc": 1614892316,
        "id": "lxvjxv",
        "num_comments": 117,
        "num_crossposts": 0,
        "selftext": "You've probably heard the news by now that 6 Dr Seuss books will no longer be published for imagery that has been deemed racist. Regardless of your political beliefs, we're all here to make MONEY. Basic supply and demand indicates that discontinued books will skyrocket in value if demand increases. Sure enough, within two days, these banned Dr Seuss books are now worth their weight in [fucking gold](https://www.cbr.com/dr-seuss-banned-books-sell-high-pries-seconday-market/).\n\nHere's a breakdown by numbers. I'm using data from Barnes and Noble online to establish the normal hardcover price, and then the lowest price on Amazon to establish approximate selling price after it was announced that they will no longer be published:\n\n* The Cat's Quizzer\n   * $9.99 ---&gt; $499.99 **(4,905% increase)**\n* If I Ran the Zoo\n   * $17.99 ---&gt; $594.00 **(3,202% increase)**\n* On Beyond Zebra\n   * $16.99 ---&gt; $425.25 **(2,403% increase)**\n* Scrambled Eggs Super\n   * $14.75 ---&gt; $325.00 **(2,103% increase)**\n* McElligot's Pool\n   * $19.99 ---&gt; $325.00 **(1,526% increase)**\n* And to Think That I Saw it on Mulberry Street\n   * $16.99 ---&gt; $224.25 **(1,220% increase)**\n\nEvery single one of these is a literal ten-bagger. What's even more crazy is that this [Insider article](https://www.insider.com/classic-childrens-books-that-havent-aged-well-2019-5#if-i-ran-the-zoo-by-theodor-seuss-geisel-aka-dr-seuss-has-been-criticized-for-containing-numerous-offensive-images-1) sort of called it almost two years ago—the first book on their list is If I Ran the Zoo. In addition to the above mentioned Insider article, I looked through several lists of books that are being challenged for racial content. My analysis leads me to believe that *The Indian in the Cupboard* by Lynne Reid Banks, currently being published by Harper Collins, is a prime candidate for a discontinued book squeeze. Here's why:\n\n1. **Low Search Volume**. Here's a Google trends graph of how often the recalled Dr Seuss books were searched for on Amazon. \n\nhttps://preview.redd.it/d178buhtl2l61.png?width=2322&amp;format=png&amp;auto=webp&amp;s=4ad443bc373d439abe34e87d8fbd8c8d04ffd32a\n\nNotice how there's nobody trying to buy these books? This makes sense. No publisher in their right mind would discontinue a popular children's book. This is why books like *The Cat in the Hat* or *Peter Pan*, which have also been criticized, will never go out of print. It would be a financial nightmare.\n\nIn contrast, look at how Indian in the Cupboard stacks up against some other contenders:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/1xe9dbpun2l61.png?width=2306&amp;format=png&amp;auto=webp&amp;s=01e3995810de807ae599684cd690ba7efc2149b7\n\nIf you follow the red trendline, you will see that searches for \"Indian in the Cupboard Amazon\" are effectively 0 with some slight upticks every now and then. This contrasts with Amazon searches for titles like Little House on the Prairie, which sees consistent search frequency. Discontinuing further printings of The Indian in the Cupboard will probably have little impact on HarperCollins' margins.\n\n2. **Broad readership base, particularly among middle-aged readers.** In addition to being discontinued, a book will need to have excess demand before the price will surge. This will happen only if the book has a broad readership base. In Dr Seuss's case, so many adults have probably read at least one of the 6 discontinued books growing up (hell I loved Mulberry Street when I was little), which is why they're actually buying up these books now that they've become limited edition items. It probably helps that Dr Seuss wrote his books to help children read and literally every elementary school still uses his writing to teach literacy skills.\n\nSimilarly, *The Indian in the Cupboard* was actually well-received in the 80s and was incorporated into school curriculums nationwide. You can still find entire teaching guides built around *The Indian in the Cupboard*, and I distinctly remember reading this book and filling out worksheets back in third grade 2009. Yeah, this book isn't as popular as it once was, but I'm willing to bet that in the 40 years that it's been out, it's been able to build a solid fanbase of readers who will buy a copy out of nostalgia once this book gets banned. This also gives *The Indian in the Cupboard* an advantage over books like *Pippi Longstocking,* which—despite being a children's book with low search volume—is beloved in Sweden but has a much smaller audience in America.\n\n3. **History of contentious debate.** The controversy over Dr Seuss's books didn't just happen overnight (although it certainly felt that way). His books have been banned in libraries for years and there are [arguments](https://www.nbcnews.com/news/nbcblk/reckoning-dr-seuss-racist-imagery-has-been-years-making-n1259330) going all the way back to the 90s about whether his books are racist. This is the same situation that *The Indian in the Cupboard* finds itself in. It's been removed from numerous public libraries and the American Library Association leadership advised educators to avoid the book as far back as 1991. This is important because the decision to remove books is typically time-sensitive. Given almost 30 years to consider whether or not to discontinue publishing, Harper Collins likely has enough financial data and a good picture of consumer preferences, especially under the current political climate, to decide that they will stop further publications of *The Indian in The Cupboard*. \n\nIt's important to keep in mind that there is significantly less liquidity with trading books than stocks. However, books are still less volatile and, like art pieces, tend to appreciate in value over time. I think that *The Indian in the Cupboard* is a long-term hold which has the potential to increase ten fold when it inevitably gets pulled from circulation.",
        "subreddit": "wallstreetbets",
        "title": "Banned/Discontinued Book Investing",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lxvjxv/banneddiscontinued_book_investing/",
        "created": 1614921116.0
    },
    {
        "author": "Liftasaurusrex",
        "created_utc": 1614813723,
        "id": "lx75uz",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Okay so here are my thoughts. Behind Nestle, PepsiCo is the biggest company in it's sector by revenue. It also follows Coke stock fairly closely. But what made the difference this last year was how these two comparable soda giants fared during covid 19.\n\nKO or Coke performed extremely poorly and made less money yoy. It's payout ratio for its dividend was touching 94%. Meaning they only had 6% left over after paying out their shareholders. That's not a lot of money to do much of anything with. ESPECIALLY in an industry that needs to move towards new products with the decline in popularity of Soda.\n\nTo compare with PepsiCo, which even during the pandemic found a way to make more revenue in 2020 than in 2019.\n\nTo give you specific numbers, in 2018 was an increase in total revenue by 1.79% compared to 2017. In 2019 it increased 3.87% compared to 2018, and in 2020 increased a 4.78% which might I remind you that this increase happened during the pandemic. Now why did PepsiCo do well against their main rival coke?\n\nTo answer this in simple terms their portfolio was more diversified than coke's and they focused on releasing new and more popular products as well as packaged food which saw a huge boost in sales from \"Toilet Paper Bandits\" or panic shoppers stocking up on bags of fritos, lays, cheetos, and on the healthier side of things Quaker Oats and other products. Until recently most people thought coke stock was king between the two companies but I believe 2020 may have put pepsi on the podium as our clear winner of the Cola Wars.\n\nPepsi has a dividend yield of 3.12% and a payout ratio of 79.88%\n\nCoke has a dividend yield of 3.35% and a payout ratio of 93.85%\n\nWith the payout ratios so high I am a little concerned for dividend increases for both but I would be shocked if coke raised it any more than they had to to keep their dividend status.\n\nShare price:\n\nI see PepsiCo valued at $154.36 a share\nTrevis Evaluation puts then at $150.16 which I believe is low but close to a 20 dollar per share increase or more either way.\n\nThis is an upside of 18.46% not including dividends.\n\nAnd I calculated Coke to be valued at $52.72 a share.\nTrevis Evaluation puts it at $55.48 which is more than I calculated.\n\nTaking the higher of the two numbers this leave a share price upside of around 11.00%\n\nThere are many other reasons I believe Pepsi is going to be the better long term pick like how they released the new cocktail mixers neon Zebra (which I would love to try) to take some of the cocktail mixer marketshare. Which the mixer market tops 858 MM$ and an industry that grew 35% just last year. Cocktail culture is coming to North America and in the United States and Canada we are heavily accepting these delicious mixers that are premade and easy to make.\n\nWhat are your thoughts on these two companies or their sectors in general? Do you think PepsiCo is undervalued? Or do you think Coke is still a better buy? Let me know in the comments.\n\nDisclaimer: I am Long PepsiCo and hold positions in the stock mentioned above.",
        "subreddit": "wallstreetbets",
        "title": "PepsiCo (PEP): Is the Market undervaluing this Dividend Staple?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lx75uz/pepsico_pep_is_the_market_undervaluing_this/",
        "created": 1614842523.0
    },
    {
        "author": "emoneynati",
        "created_utc": 1614775120,
        "id": "lwsxde",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Has This Sub Seen the RH Parody Ad by Zebra Corner??? Don't let their support stay at such relatively low views!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/lwsxde/has_this_sub_seen_the_rh_parody_ad_by_zebra/",
        "created": 1614803920.0
    }
]