[
    {
        "author": "PM_Me_Things_Yo_Like",
        "created_utc": 1621604216,
        "id": "nhspuq",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "Investment Thesis for Daily Journal (DJCO)\n\nIntroduction:  The Daily Journal is viewed by the general public as a dying newspaper business.  It is a dying newspaper business, but the Daily Journal has pivoted itself to a SaaS business, but is trading at a valuation far below most other publicly traded Saas businesses.  We will investigate why the Daily Journal is a worthwhile investment at its current valuation.\n\nManagement:  Normally, we’d begin by looking at the business, but management within the Daily Journal is incredibly strong, so this will be our beginning.  The Chairman of the Board in Charlie Munger, Vice-Chairman of Berkshire Hathaway.  He bought the Daily Journal in 1977 for $2 million dollars and has been the Chairman ever since.  The lesser known name leading the Daily Journal is Gerald Salzman.  He joined the Daily Journal in 1986 as their President, CEO, CFO, Treasurer.  As such, there is likely no one else who knows the Daily Journal as well as Gerald Salzman.  As an added bonus to the quality of the two men leading the Daily Journal, their executive compensation is almost unheard of.  The Board of Directors receive a payment of either $5000 or $0.  Gerald Salzman, the CEO, receives a salary of $250,000.  These are acceptable salaries due to the large amount of insider ownership within the Daily Journal.\n\nThe Business:  The Daily Journal has three business segments, 1) The Daily Journal Newspaper, 2) Equity Investments, and 3) Journal Technologies.\n\n---\n\nThe Daily Journal Newspaper is a series of mostly California based legal newspapers.  Their revenue comes from advertising from display advertising (i.e. traditional advertising found in most newspapers), classified advertising, trustee notice sale advertising, legal notice advertising, and circulation advertising.  The sad but unfortunate truth for investors is that this portion of their business is worth very little.  The good news, however, is that most investors outside of the Daily Journal are not interested in investing in a dying newspaper and thus has led to the undervaluation of the Daily Journal.\n\nI won’t spend any more time on this segment except to say that the newspaper’s most successful year isemi-modern history was during 2008 due to an extreme uptick in the need for legal advertising relating to the foreclosure of many homes.  It is possible that if another recession strikes, the newspaper business of the Daily Journal could provide some financial cushion to keep the Daily Journal in strong health.\n\n---\n\nEquities have been a growing proportion of the Daily Journal’s intrinsic value.  Charlie Munger’s investing prowess that has benefited Berkshire is also at work within the Daily Journal.  We have insight into the Daily Journal’s American investments thanks to their most recent 13F filing, which was released within the last week.  At this time, the Daily Journal holds $197 million worth of American equities, mostly concentrated in financial services similarly to the holdings of Berkshire Hathaway.  Another notable holding is a new and growing position in Alibaba.  \n\nWhile it is not explicitly confirmed, there is a VERY strong evidence that the Daily Journal also holds a sizable position in BYD, a Hong Kong traded electric car manufacturer.  This would not appear in its 13F filings, so its size cannot be confirmed, however we can make an educated guess.  The exact value of his BYD investment is unknown, however it is assumed to be be roughly $140 million.  In the most recent filing, the Daily Journal notes that it sold $20 million of one of its positions to reinvest into another security.  The suspicion is that this was a shift from BYD to BABA.  As such, we will value the BYD position at $120, though in truth, it may be slightly higher as BYD traded at a fewer dollars higher of a valuation prior to the most recent filing.  Nonetheless, we will assume its value is $120 million.  This brings the Daily Journal’s equity portfolio to a value of $317 million.\n\nThe Daily Journal also has $27 million in cash according to their latest annual report and they hold some office buildings in Los Angeles and in Utah which THEY value at $16.5 million.  I emphasized that they value the building because, as I’ll discuss below, the company has some questionable accounting practices.  In the instance of the office buildings in Los Angeles as an example, they valued the buildings at $16.5 million roughly 20 years ago and that figure has never been adjusted.  The result is that they are likely undervaluing the true value of their real estate holdings.  If we increase the value of these holding to $30 million, which seems like a fair appraisal for their buildings based on current market rate, this results in a total equity and asset value of $374 million.\n\nTheir liabilities consist of ~$60 million in deferred capital gains (0% interest), a $29.5 million margin loan (3% interest), and a $1.5 million mortgage (4% interest).  The deferred capital gains will not be paid anytime soon as Charlie Munger likes to hold stocks and when he sells, typically he will move into another qualified investment.  The margin loan was used to acquire businesses to build the Saas business and is serviced by the dividends from the bank stocks in the equity portfolio.  The mortgage is self explanatory.  Total liabilities amount to $91 million\n\nBefore jumping into the last portion of the Daily Journal’s business segment, I want to note that the Daily Journal has a market cap of $414 million.  As such, to reach its market cap valuation, assuming no value is assigned to the legal newspaper business (it has a value, it’s just not a high value and in all honesty, I don’t know what a fair value is for that business), the Journal Technologies business only needs to be worth $131 million to come a fair market value at its current market cap valuation.\n\n---\n\nJournal Technologies is the hidden gem of the Daily Journal.  It is a legal Saas business being sold to municipalities via the RFP process.  It is a case management system built off of a central e-Suites product that is then configured to meet the client’s needs.\n\nIt has a unique business model that results in, once again, an undervaluation of the company.  After being awarded an RFP, the company will then define the scope of the product, establish servers on site, and install its product, and then configure it to the clients needs.  All of this work takes 4 to 8 years to complete and during this time, the municipality is not billed.  On a relevant note to the questionable accounting practices above, the Daily Journal does not report the forthcoming revenue on its financial statements, thus these contracts have not necessarily been taken into account to determine the Daily Journal’s current market valuation.\n\nWhen its e-Suites product goes live, the Daily Journal will charge an implementation fee and subsequently bill a licensing fee for the next 10 years (with built in price adjustments to account for inflation).  Currently, Daily Journal has over $100 million in forthcoming revenue which, due to their billing practices, is a very high-margin revenue once billing starts.  These contracts are found in the USA, Australia, Canada, and Tasmania currently, though more may have been signed and not discovered.  Credit to Matthew Peterson for taking the time to search across the web looking for tenders awarded to the Daily Journal, as there is not a central repository to identify these contracts.\n\nMoving forward, the assumption is that the Daily Journal will continue onboarding new jurisdictions, there will be an increase in licenses purchased for existing contracts after e-Suites launches, consulting fees for upgrades and modifications will increase, and other e-solutions will be integrated with e-Suites to increase revenue (such as e-payment for fines and tickets).\n\nWhile the Journal Technologies already has $30-some million in revenue, this figure will increase with time.  Additionally, these municipalities will likely continue using the e-Suite services once they go live after the time and cost of configuration, meaning revenue that is on the books today is revenue that will be on the books likely after the 10 years of licensing has expired.  Presently, Journal Technologies is a $200-$300 million business based on the figures and assumptions above.  Under this assumption, the Daily Journal is valued somewhere between $483 million and $583 million, meaning it is currently undervalued by 17% to 41%.\n\n---\n\nThere are a few risks that need to be mentioned.  One is liquidity.  The Daily Journal has a $400 million dollar market cap and is too small for many large financial institutions to monitor.  It also has a $300 share price which, while irrelevant to value, will scare away many newer retail investors who invest $20 to $50 at a time.  Beyond these two issues, the Daily Journal has quite a bit of insider ownership or is owned by firms with long-term visions, thus they are not willing to sell shares on a daily basis.  The result is that only about 5,000 shares are traded on a daily basis.  This means that if you need to liquidate your position in a pinch, you may have to sell below the market rate.\n\nThe other glaring issue is age.  Charlie Munger is 97 years old and Gerald Salzman is 80 years old.  Beyond not being at the forefront of technological innovation on a personal level (some may view this as an issue when running a Saas business, personally I am not concerned as there job is to manage the people driving the Saas business), their old age means that in the coming years, their leadership may cease to exist.  No clear succession plan has been identified (this was raised during their last annual meeting by a concerned shareholder).  As management is a key strength within this business, this could be reason for pause for prospective shareholders.\n\nLastly, there is the $16 billion elephant in the room.  Tyler Technologies is their key competitor.  There are other smaller competitors who offer more limited solutions, but Tyler Technologies is the real competition in this space.  While their products are more modern and (likely) have better and flashier features, this is not necessarily what wins in RFP processes.  Instead, the Daily Journal’s practice of not charging the client until launch is a much more appealing catch for prospective clients.  While I’m sure Tyler Technologies will be a fine company in the long-term, its hard to argue that their fundamentals are nearly as attractive as the fundamentals of the Daily Journal.  The Daily Journal is valued at 8x sales, has a P/B of under 2, and has a P/E of 3.5.  By comparison, Tyler Technologies has a P/B of 8, is valued at 14x sales, and has a P/E of 91.  Tyler Technologies would need to continue growing at a very rapid pace to be a strong value investment (note that Tyler Technologies is still rapidly growing, though this rapid growth is slowing).  By comparison, the Daily Journal, if it continues at its current growth, is already a great investment.  As most clients are onboarded, growth is increasing and it is my belief that this will be a phenomenal investment.\n\n---\n\nDisclaimer: I hold shares of DJCO.  I am posting this because after my research, I think others could benefit from investing in this company (if they agree with my above analysis) AND because I want community feedback on thoughts about DJCO.  My intention is to hold DJCO for a minimum of 4 years, though more realistically I will hold this for a very long time since, as I noted above, the revenue for this company is incredibly sticky and I believe they have many avenues to increase their sales.",
        "subreddit": "investing",
        "title": "(DJCO) My mini-essay investment thesis for The Daily Journal - Why you should buy a dying newspaper business",
        "url": "https://www.reddit.com/r/investing/comments/nhspuq/djco_my_miniessay_investment_thesis_for_the_daily/",
        "created": 1621633016.0
    },
    {
        "author": "PM_Me_Things_Yo_Like",
        "created_utc": 1621561779,
        "id": "nhh78w",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Investment Thesis for Daily Journal (DJCO)\n\nIntroduction:  The Daily Journal is viewed by the general public as a dying newspaper business.  It is a dying newspaper business, but the Daily Journal has pivoted itself to a SaaS business, but is trading at a valuation far below most other publicly traded Saas businesses.  We will investigate why the Daily Journal is a worthwhile investment at its current valuation.\n\nManagement:  Normally, we’d begin by looking at the business, but management within the Daily Journal is incredibly strong, so this will be our beginning.  The Chairman of the Board in Charlie Munger, Vice-Chairman of Berkshire Hathaway.  He bought the Daily Journal in 1977 for $2 million dollars and has been the Chairman ever since.  The lesser known name leading the Daily Journal is Gerald Salzman.  He joined the Daily Journal in 1986 as their President, CEO, CFO, Treasurer.  As such, there is likely no one else who knows the Daily Journal as well as Gerald Salzman.  As an added bonus to the quality of the two men leading the Daily Journal, their executive compensation is almost unheard of.  The Board of Directors receive a payment of either $5000 or $0.  Gerald Salzman, the CEO, receives a salary of $250,000.  These are acceptable salaries due to the large amount of insider ownership within the Daily Journal.\n\nThe Business:  The Daily Journal has three business segments, 1) The Daily Journal Newspaper, 2) Equity Investments, and 3) Journal Technologies.\n\n---\n\nThe Daily Journal Newspaper is a series of mostly California based legal newspapers.  Their revenue comes from advertising from display advertising (i.e. traditional advertising found in most newspapers), classified advertising, trustee notice sale advertising, legal notice advertising, and circulation advertising.  The sad but unfortunate truth for investors is that this portion of their business is worth very little.  The good news, however, is that most investors outside of the Daily Journal are not interested in investing in a dying newspaper and thus has led to the undervaluation of the Daily Journal.\n\nI won’t spend any more time on this segment except to say that the newspaper’s most successful year isemi-modern history was during 2008 due to an extreme uptick in the need for legal advertising relating to the foreclosure of many homes.  It is possible that if another recession strikes, the newspaper business of the Daily Journal could provide some financial cushion to keep the Daily Journal in strong health.\n\n---\n\nEquities have been a growing proportion of the Daily Journal’s intrinsic value.  Charlie Munger’s investing prowess that has benefited Berkshire is also at work within the Daily Journal.  We have insight into the Daily Journal’s American investments thanks to their most recent 13F filing, which was released within the last week.  At this time, the Daily Journal holds $197 million worth of American equities, mostly concentrated in financial services similarly to the holdings of Berkshire Hathaway.  Another notable holding is a new and growing position in Alibaba.  \n\nWhile it is not explicitly confirmed, there is a VERY strong evidence that the Daily Journal also holds a sizable position in BYD, a Hong Kong traded electric car manufacturer.  This would not appear in its 13F filings, so its size cannot be confirmed, however we can make an educated guess.  The exact value of his BYD investment is unknown, however it is assumed to be be roughly $140 million.  In the most recent filing, the Daily Journal notes that it sold $20 million of one of its positions to reinvest into another security.  The suspicion is that this was a shift from BYD to BABA.  As such, we will value the BYD position at $120, though in truth, it may be slightly higher as BYD traded at a fewer dollars higher of a valuation prior to the most recent filing.  Nonetheless, we will assume its value is $120 million.  This brings the Daily Journal’s equity portfolio to a value of $317 million.\n\nThe Daily Journal also has $27 million in cash according to their latest annual report and they hold some office buildings in Los Angeles and in Utah which THEY value at $16.5 million.  I emphasized that they value the building because, as I’ll discuss below, the company has some questionable accounting practices.  In the instance of the office buildings in Los Angeles as an example, they valued the buildings at $16.5 million roughly 20 years ago and that figure has never been adjusted.  The result is that they are likely undervaluing the true value of their real estate holdings.  If we increase the value of these holding to $30 million, which seems like a fair appraisal for their buildings based on current market rate, this results in a total equity and asset value of $374 million.\n\nTheir liabilities consist of ~$60 million in deferred capital gains (0% interest), a $29.5 million margin loan (3% interest), and a $1.5 million mortgage (4% interest).  The deferred capital gains will not be paid anytime soon as Charlie Munger likes to hold stocks and when he sells, typically he will move into another qualified investment.  The margin loan was used to acquire businesses to build the Saas business and is serviced by the dividends from the bank stocks in the equity portfolio.  The mortgage is self explanatory.  Total liabilities amount to $91 million\n\nBefore jumping into the last portion of the Daily Journal’s business segment, I want to note that the Daily Journal has a market cap of $414 million.  As such, to reach its market cap valuation, assuming no value is assigned to the legal newspaper business (it has a value, it’s just not a high value and in all honesty, I don’t know what a fair value is for that business), the Journal Technologies business only needs to be worth $131 million to come a fair market value at its current market cap valuation.\n\n---\n\nJournal Technologies is the hidden gem of the Daily Journal.  It is a legal Saas business being sold to municipalities via the RFP process.  It is a case management system built off of a central e-Suites product that is then configured to meet the client’s needs.\n\nIt has a unique business model that results in, once again, an undervaluation of the company.  After being awarded an RFP, the company will then define the scope of the product, establish servers on site, and install its product, and then configure it to the clients needs.  All of this work takes 4 to 8 years to complete and during this time, the municipality is not billed.  On a relevant note to the questionable accounting practices above, the Daily Journal does not report the forthcoming revenue on its financial statements, thus these contracts have not necessarily been taken into account to determine the Daily Journal’s current market valuation.\n\nWhen its e-Suites product goes live, the Daily Journal will charge an implementation fee and subsequently bill a licensing fee for the next 10 years (with built in price adjustments to account for inflation).  Currently, Daily Journal has over $100 million in forthcoming revenue which, due to their billing practices, is a very high-margin revenue once billing starts.  These contracts are found in the USA, Australia, Canada, and Tasmania currently, though more may have been signed and not discovered.  Credit to Matthew Peterson for taking the time to search across the web looking for tenders awarded to the Daily Journal, as there is not a central repository to identify these contracts.\n\nMoving forward, the assumption is that the Daily Journal will continue onboarding new jurisdictions, there will be an increase in licenses purchased for existing contracts after e-Suites launches, consulting fees for upgrades and modifications will increase, and other e-solutions will be integrated with e-Suites to increase revenue (such as e-payment for fines and tickets).\n\nWhile the Journal Technologies already has $30-some million in revenue, this figure will increase with time.  Additionally, these municipalities will likely continue using the e-Suite services once they go live after the time and cost of configuration, meaning revenue that is on the books today is revenue that will be on the books likely after the 10 years of licensing has expired.  Presently, Journal Technologies is a $200-$300 million business based on the figures and assumptions above.  Under this assumption, the Daily Journal is valued somewhere between $483 million and $583 million, meaning it is currently undervalued by 17% to 41%.\n\n---\n\nThere are a few risks that need to be mentioned.  One is liquidity.  The Daily Journal has a $400 million dollar market cap and is too small for many large financial institutions to monitor.  It also has a $300 share price which, while irrelevant to value, will scare away many newer retail investors who invest $20 to $50 at a time.  Beyond these two issues, the Daily Journal has quite a bit of insider ownership or is owned by firms with long-term visions, thus they are not willing to sell shares on a daily basis.  The result is that only about 5,000 shares are traded on a daily basis.  This means that if you need to liquidate your position in a pinch, you may have to sell below the market rate.\n\nThe other glaring issue is age.  Charlie Munger is 97 years old and Gerald Salzman is 80 years old.  Beyond not being at the forefront of technological innovation on a personal level (some may view this as an issue when running a Saas business, personally I am not concerned as there job is to manage the people driving the Saas business), their old age means that in the coming years, their leadership may cease to exist.  No clear succession plan has been identified (this was raised during their last annual meeting by a concerned shareholder).  As management is a key strength within this business, this could be reason for pause for prospective shareholders.\n\nLastly, there is the $16 billion elephant in the room.  Tyler Technologies is their key competitor.  There are other smaller competitors who offer more limited solutions, but Tyler Technologies is the real competition in this space.  While their products are more modern and (likely) have better and flashier features, this is not necessarily what wins in RFP processes.  Instead, the Daily Journal’s practice of not charging the client until launch is a much more appealing catch for prospective clients.  While I’m sure Tyler Technologies will be a fine company in the long-term, its hard to argue that their fundamentals are nearly as attractive as the fundamentals of the Daily Journal.  The Daily Journal is valued at 8x sales, has a P/B of under 2, and has a P/E of 3.5.  By comparison, Tyler Technologies has a P/B of 8, is valued at 14x sales, and has a P/E of 91.  Tyler Technologies would need to continue growing at a very rapid pace to be a strong value investment (note that Tyler Technologies is still rapidly growing, though this rapid growth is slowing).  By comparison, the Daily Journal, if it continues at its current growth, is already a great investment.  As most clients are onboarded, growth is increasing and it is my belief that this will be a phenomenal investment.\n\n---\n\nDisclaimer: I hold shares of DJCO.  I am posting this because after my research, I think others would benefit from investing in this company AND because I want community feedback on thoughts about DJCO.  My intention is to hold DJCO for a minimum of 4 years, though more realistically I will hold this for a very long time since, as I noted above, the revenue for this company is incredibly sticky and I believe they have many avenues to increase their sales.",
        "subreddit": "stocks",
        "title": "(DJCO) My mini-essay investment thesis for The Daily Journal - Why you should buy a dying newspaper business",
        "url": "https://www.reddit.com/r/stocks/comments/nhh78w/djco_my_miniessay_investment_thesis_for_the_daily/",
        "created": 1621590579.0
    }
]