[
    {
        "author": "Karnes",
        "created_utc": 1621738644,
        "id": "niyift",
        "num_comments": 349,
        "num_crossposts": 0,
        "selftext": "Total cash, cash equivalents and marketable securities of the company as per the latest quarter (in billions of dollars).\n\n15. Cigna (NYSE:CI) - 10.1 B\n\n14. Cisco (NASDAQ:CSCO) - 11.8 B\n\n13. Costco (NASDAQ:COST) - 13.6 B\n\n12. IBM (NYSE:IBM) - 14.3 B\n\n11. JPMorgan Chase (NYSE:JPM) - 24.9 B\n\n10. GM (NYSE:GM) - 29 B\n\n9. Oracle (NYSE:ORCL) - 43 B\n\n8. Berkshire Hathaway (NYSE:BRK.A) - 48 B\n\n7. Ford Motors (NYSE:F) - 50 B\n\n6. Facebook (NYSE:FB) - 62 B \n\n5. Alibaba (NYSE:BABA) - 70 B\n\n4. Amazon (NASDAQ:AMZN) - 84.4 B\n\n3. Microsoft (NASDAQ:MSFT) - 132 B\n\n2. Alphabet (NASDAQ:GOOG) - 136.7 B\n\n1. Apple (NASDAQ:AAPL) - 195.6 B\n\nSource:  https://finance.yahoo.com/news/15-companies-most-cash-reserves-182708211.html",
        "subreddit": "stocks",
        "title": "15 Companies With The Most Cash Reserves (Traded in the US)",
        "url": "https://www.reddit.com/r/stocks/comments/niyift/15_companies_with_the_most_cash_reserves_traded/",
        "created": 1621767444.0
    },
    {
        "author": "Erland_Brynjar",
        "created_utc": 1619966921,
        "id": "n37uyq",
        "num_comments": 144,
        "num_crossposts": 0,
        "selftext": "Buffett warned newbie investors that picking great companies is more complicated than just selecting a promising industry.\n\n\"There's a lot more to picking stocks than figuring out what's going to be a wonderful industry in the future,\" said Buffett.\n\nBuffett put up a slide of all the auto companies from years go that started with the letter \"M;\" however, the list was so long it didn't fit on one slide. The \"Oracle of Omaha\" had to narrow the list to automobile manufactures that started with \"Ma\" to fit the names on one page.\n\nBuffett said there were about 2,000 companies that entered the auto business in the 1900's because investors and entrepreneurs expected the industry to have an amazing future. In 2009, there were three automakers left and two went bankrupt, said Buffett.\n\nWhether it’s technology, EVs, renewables, marijuana or cyber security, many will enter these budding industries, and most will not make it. It isn’t good enough to pick the sector or industry that’ll grow most, you either need to time your exits perfectly, or hope you have the few that survive to cover your losses on the many that don’t.",
        "subreddit": "CanadianInvestor",
        "title": "Buffett: There's a lot more to investing than picking a budding industry",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/n37uyq/buffett_theres_a_lot_more_to_investing_than/",
        "created": 1619995721.0
    },
    {
        "author": "lolmaster1337420",
        "created_utc": 1620976800,
        "id": "nc2q3t",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Hello, so I currently have 5k lying around and figured I'd want to invest it. I've been thinking about investing for a long while and have been really nervous about it until recently. I've been investing 500 ish in robinhood (Since I downloaded that before everything happened), and only recently been investing my money. So far I have 1.04 shares of ORCL, 2.51 shares of RIOT, 0.152 shares of AMC, and I just placed an order for VOO ETF. Am I on the right track?   \n\n\nI picked ORCL since at the time it was cheap enough for me to buy and that company had a good track record. RIOT seemingly has been giving me great returns already and I plan to sell it once I get a dollar or two in profit, and I have been wanting to mitigate my risks for the long term and have heard that ETF's are very good for that, so I got VOO. So now with nearly 520 invested, I plan on investing another roughly 500 to get 1k invested and just leave it at that as I'm a newbie. Thanks for the help and advice. I've watched a few videos already but so far all I've heard is \"Buy companies like visa, etfs, and just wait\"?",
        "subreddit": "StockMarket",
        "title": "Best way to invest $1000 as a newbie in the stock market?",
        "url": "https://www.reddit.com/r/StockMarket/comments/nc2q3t/best_way_to_invest_1000_as_a_newbie_in_the_stock/",
        "created": 1621005600.0
    },
    {
        "author": "Northshore_Surv",
        "created_utc": 1620924818,
        "id": "nbl9ye",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I call this The Oracle, I burn incense with it every morning. If the smoke hits every peddle, I buy a share of GME.",
        "url": "https://v.redd.it/d2o82fu54xy61",
        "created": 1620953618.0
    },
    {
        "author": "Puzzleheaded-Ad8266",
        "created_utc": 1621550472,
        "id": "nhdmoo",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "I thought I'd share some of my DD as it may precipitate some decent discussion, help others to adjust their strategy or give new ideas.\n\nGIX is the only optionable post-DA SPAC with warrants trading under $1 (currently at $0.78). I'm taking 2 things from this. \n\n1) Optionable pre-DA SPACs with warrants trading below $1 are probably pretty safe bets unless we have a significant market-wide downturn which push SPACs even further in to the abyss. There are also very few non-optionable post-DA SPACs  trading below GIX, so buying any warrants under $0.8, rather than 'premium' team warrants well above $1 is probably safer in the current environment. The main risk is them not finding a deal.\n\nTo find optionable pre-DA SPACs with options under $1 visit spactrack.net, select optionable and searching parameters, then sort by warrant price. Do your research first, don't just pick blindly.\n\n2a) GIX will dump hard on de-SPAC. There is no confidence that the warrants will meet the conditions to become exercisable.\n\nOR\n\n2b) There is little faith the merger vote will pass.\n\n\nI am leaning towards 2a, and that there is no confidence in Skillsoft (20+ year old distressed company, went public just before dot.com bubble burst, bought out and went private in 2014, went bankrupt last year to write off $1.5b in debt, still a few hundred mill of debt left, not all of which is getting paid off - primary shareholders getting bought out). The extension passed with enough votes, so I think the merger vote will too.\n\nMy play is to buy puts on GIX (disclosure: I have some Jul and Aug $7.5p with a cost basis of $0.25-0.30, will be buying more when/if merger vote is confirmed). It is important to note that SPAC options for SPACs which are approaching merger vote dates are not acting rationally (Theta and IV acting very strangely). $10 NTM premiums are pretty high now. $7.5 OTM puts are riskier, however there is some price disparity opening up (i.e. Jul and Aug 7.5p with same bid/ask, possibility to scalp some Oct 7.5p too). Liquidity is also poor on these (most of the open interest on the July and Aug 7.5p were single orders, someone with more of a risk appetite than me). \n\nThe main risks for buying puts on GIX are: \n\nA) the deal falls through, which will make all ATM/OTM puts expire worthless.\n\nB) If the merger vote passes, the premiums will jump due to IV (so buying gets more expensive if you're waiting for the vote to pass). If there is a slow bleed rather than a dump post merger, then IV and theta may decay faster than than the effect of Delta. I.e. the high premium you paid for the option based on the IV and time to expiry decreases faster than the effect of the decrease of the underlying (i.e. the commons price). This is particularly exacerbated if you buy OTM (i.e. 7.5 strike puts). \n\nC) The obvious one. The stock may go up, not down. Disclaimer: I am a stranger on the internet, not an oracle, or a financial advisor. I would not be posting on Reddit if I knew what was going to happen. I would be on a yacht in the Mediterranean, creating 20 of my own SPACs and finding bankrupt companies to take public for $1.4b whilst giving myself millions of shares for free as a reward. Do your own DD.\n\nFeel free to come back at me, correct me or discuss.",
        "subreddit": "SPACs",
        "title": "GIX and Optionable warrants DD",
        "url": "https://www.reddit.com/r/SPACs/comments/nhdmoo/gix_and_optionable_warrants_dd/",
        "created": 1621579272.0
    },
    {
        "author": "OptionsOracle",
        "created_utc": 1621463607,
        "id": "ngj9u9",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Dang, the Oracle has been so wrong that Robinhood brought out phone support. Don’t yolo on Chamath SPACS kids 🍀",
        "url": "https://i.redd.it/x7fspuu9m5071.jpg",
        "created": 1621492407.0
    },
    {
        "author": "Northshore_Surv",
        "created_utc": 1620930030,
        "id": "nbnf28",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I call this The Oracle, I use it every morning and if the smoke touches every leaf I buy a share of GME. I’m nearly broke now.",
        "url": "https://v.redd.it/49yijrpmjxy61",
        "created": 1620958830.0
    },
    {
        "author": "93george",
        "created_utc": 1622051282,
        "id": "nlmzdx",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Hello fellow WSB degens,\n\nI will be outlining for you today why RIOT and MARA even after today's run up will continue on a meteoric rise.\n\nFirstly the price is currently in the mid 20's for each stonk. This makes sense because back in Jan 2021 the prices of both stonks were in the mid 20's because a certain underlying asset these stonks are based on was trading at 40k and is currently trading once again at 40k. I will refer to this asset during this post as CUA for the rest of this post (certain underlying asset) disclaimer for mods this whole post does not really involve CUA going up or down it is based off of several factors that lead me to believe these specific stonks are undervalued at their current prices even if CUA goes down further. I am forced to mention CUA to explain this reasoning.\n\nNow the fact these stonks are both in the mid $20's like they were back in Jan 2021 no longer makes sense when you factor in that RIOT has tripled their mining hash rate via the purchase of more mining equipment and MARA has doubled their mining hash rate via the purchase of more mining equipment. This is akin to a gold mine discovering there just so happened to be double or triple the amount of gold they previously thought was in their mine, or Amazon AWS buying 2-3 times more servers to rent out if AWS could somehow guarantee clients for all those servers 24 hours a day 7 days a week 365 days a year. More mining equipment = more revenue. You can tell this is starting to get realized because even though CUA is down today (26-5-21) both of these stonks are up double digits.\n\nAs if the above was not reason enough to think these stonks could reasonably 2x or 3x even without an increase in the price of CUA please continue reading.\n\nNow on to China banning CUA mining in China. China controls 65% of the total hash rate of CUA. If China were to stop mining CUA this would bring down the total hash rate of CUA significantly. This would be very good for any and all remaining CUA miners as the CUA difficulty would also drop by 65%. \n\nTo help you autists understand I will compare this to pizza. (Sorry I couldnt think of how to make this analogy with tendies)\n\nIf you have 1 pizza and 10 people and you wish to split the pizza equally you would slice the pizza into 10 slices and give everyone 1 slice. This is how CUA mining works. Now imagine that China currently takes 6.5 pieces of pizza but Chinese government is going to tell Chinese citizens they can no longer legally eat pizza in China. Now the rest of the world gets to split those 6.5 pieces of pizza amongst themselves equally. \n\nPersonally I am too retarded to actually do the math to see how this would change MARA and RIOT revenue but it might be as simple as increasing all of their profit by 65%? Not sure. Maybe you divide 65 by 35 and then add that number (1.8) to all the other miners.\n\nThe above was all concrete reasoning on why these stonks are both undervalued, but theres a literally shitton of undervalued stonks and there are plenty of retarded overpriced stonks too who is to say that any of the above reasoning matters and the people will care? Theres a lot of stonks bottom line. What is my catalyst for believing these stonks will continue to see momentum and provide tendies?\n\nThe below is my retarded opinion and autist forecast into what will occur and provide said tendies to anyone who wishes to participate in the upside of these stocks.\n\nThe large majority if not all of this past correction in CUA price can be chalked up to China and Elon. Elon recently tweeted that he no longer liked CUA due to the process of mining being \"dirty\" this is because China controls 65% of the entire hash rate of CUA and China uses the most coal for energy of any country in the world. Elon has now tweeted that he will be meeting with miners in North America to discuss this fact and allow the miners to refute. What Elon will discover is that it is highly unprofitable to mine CUA on electricity deriving from non renewable energy sources as renewable energy sources are the cheapest. The vast majority of large mining operations in North America utilize hydropower RIOT and MARA both use hydropower too. The next thing that Elon will discover is that while China uses more coal for energy than any other country they also use more hydro for energy than any other country. China leads the world in hydroelectricity by any and all metrics including number of dams, sizes of dams, total output of individual dams, total output of all dams, etc. Mining on coal energy is stupid because it is the most expensive energy to produce of any energy. Seeing as how CUA miners only have to pay for internet and electricity bills and internet doesnt really matter cheap electricity makes or breaks their business. Literally RIOT and MARA have 8 employees and 3 employees according to Robinhood. The only bill/cost they care about is electric cost and they want that to be as cheap as possible which will always be renewable energy sources.\n\nPersonally I am of the belief that this is all part of Great Daddy Elon's master plan. He pretended to side with the environmentally friendly activists who advocate against CUA mining. This brought global attention to the issue and now he will unveil that he was wrong and this is not the case because mining is all green renewable energy. Great Daddy Elon is never wrong remember that. Elon has even stated things to the contrary of his recent tweet against CUA before when he talked about oil and coal energy subsidies in the US. Just remember that the gooberment says they want more green energy yet they heavily subsidize oil, gas, and coal energy. Until 2023 if you start an oil, gas, or coal energy project the government will subsidize for you to do so to the tune of financing 80-100 percent of the project. Yes that is right. That green stuff is a lie because the peak subsidy for solar projects was 33% and its now like 26%. Great Daddy Elon knows this because Great Daddy Elon knows all as he is the one who told us this.\n\nDisclaimer: This is not financial advice and I am not a financial advisor. This will be the only post about this and any other posts or comments created claiming to be me are fake. Any other posts or comments created by this user are fake as this will be the only time I will use this account. \n\nAfter what happened with DeepFuckingValue I am very afraid of the SEC for this post so I will reiterate any and all posts or comments claiming to be me from this account or any others are fake. \n\nFull disclosure: I YOLO'ed all my money into this trade so I am biased but I have skin in the game too. All I know is that Great Daddy Elon's stonks have always provided tendies. All hail The Oracle. #Elongate",
        "subreddit": "wallstreetbets",
        "title": "$RIOT and $MARA DD from The Oracle that is Great Daddy Elon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nlmzdx/riot_and_mara_dd_from_the_oracle_that_is_great/",
        "created": 1622080082.0
    },
    {
        "author": "lolmaster1337420",
        "created_utc": 1621026536,
        "id": "ncj2rv",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I have 1.04 shares of ORCL, 2.51 shares of RIOT, 0.152 shares of AMC (Basically a junk stock to me, i own like two dollars of it), 1 share of VOO, 1 share of V, and .83 shares of SPY. What I'm most worried about is RIOT, and ORCL.. I probably won't have AMC for too too long plus it's only about two dollars worth. \n\n&amp;#x200B;\n\nMy reasons for buying them are so: ORCL has a decent track record and I heard they'd be a decent enough investment. RIOT, I saw they were extremely low and figured I would pick them up while they had the lowest dip it looked like. AMC, well, honestly I just heard that from people, but wasn't too too sure so I only put in about two dollars. I'm probably going to just sell it once I get anything from it. VOO and SPY were seemingly a unanimous good investment, especially for ETFs, and V being visa, figured I'd get in a Blue-chip company in there. Thoughts? It's about 1.1k invested",
        "subreddit": "StockMarket",
        "title": "So I made $15 dollars in a day from my investing 1k, is it worth it to wait or hold?",
        "url": "https://www.reddit.com/r/StockMarket/comments/ncj2rv/so_i_made_15_dollars_in_a_day_from_my_investing/",
        "created": 1621055336.0
    },
    {
        "author": "themainvillian",
        "created_utc": 1622205360,
        "id": "nmwwbg",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "\n **Mods do not delete, this is important to me, please read**\n\n&amp;#x200B;\n\nI was in my early teens during the '08 crisis. I vividly remember the enormous repercussions that the reckless actions by those on Wall Street had in my personal life, and the lives of those close to me. I was fortunate - my parents were prudent and a little paranoid, and they had some food storage saved up. When that crisis hit our family, we were able to keep our little house, but we lived off of pancake mix, and powdered milk, and beans and rice for a year. Ever since then, my parents have kept a food storage, and they keep it updated and fresh.\n\nThose close to me, my friends and extended family, were not nearly as fortunate. My aunt moved in with us and paid what little rent she could to my family while she tried to find any sort of work. Do you know what tomato soup made out of school cafeteria ketchup packets taste like? My friends got to find out. Almost a year after the crisis' low, my dad had stabilized our income stream and to help out others, he was hiring my friends' dads for odd house work. One of them built a new closet in our guest room. Another one did some landscaping in our backyard. I will forever be so proud of my parents, because in a time of need, even when I have no doubt money was still tight, they had the mindfulness and compassion to help out those who absolutely needed it.\n\nTo Melvin Capital: you stand for everything that I hated during that time. You're a firm who makes money off of exploiting a company and manipulating markets and media to your advantage. Your continued existence is a sharp reminder that the ones in charge of so much hardship during the '08 crisis were not punished. And your blatant disregard for the law, made obvious months ago through your (for the Melvin lawyers out there: alleged) illegal naked short selling and more recently your obscene market manipulation after hours shows that you haven't learned a single thing since '08. And why would you? Your ilk were bailed out and rewarded for terrible and illegal financial decisions that negatively changed the lives of millions. I bought shares a few days ago. I dumped my savings into GME, paid my rent for this month with my credit card, and dumped my rent money into more GME (which for the people here at WSB, I would not recommend). And I'm holding. This is personal for me, and millions of others. You can drop the price of GME after hours $120, I'm not going anywhere. You can pay for thousands of reddit bots, I'm holding. You can get every mainstream media outlet to demonize us, I don't care. I'm making this as painful as I can for you.\n\nTo CNBC: you must realize your short term gains through promoting institutions' agenda is just that - short term. Your staple audience will soon become too old to care, and the millions of us, not just at WSB but every person affected by the '08 crash that's now paying attention to GME, are going to remember how you stuck up for the firms that ruined so many of us, and tried to tear down the little guys. I know for sure I'll remember this. In response, here is a [list of CNBC sponsors and partners](https://www.cnbcevents.com/sponsors/). They include, but are not limited to, **IBM**, **Cisco**, **TMobile**, **JPMorgan**, **Oracle**, and **ZipRecruiter**. Their parent company is [NBCUniversal](https://en.wikipedia.org/wiki/NBCUniversal), owned by **Comcast** and **GE**.\n\nTo the boomers, and/or people close to that age, just now paying attention to these \"millennial blog posts\": you realize that, even if you weren't adversely effected by the '08 crash, your children and perhaps grandchildren most likely were? *We're not enemies, we're on the same side*. Stop listening to the media that's making us out to be market destroyers, and start rooting for us, because we have a once in a lifetime opportunity to punish the sort of people who caused so much pain and stress a decade ago, and we're taking that opportunity. Your children, your grandchildren, might have suffered as I described because of the institutions that we're fighting against. You really want to choose them, over your own family and friends? We're not asking you to risk your 401k or retirement fund on a single GME bet. We're just asking you to be understanding, supportive, and to not support the people that caused so much suffering a decade ago.\n\nTo WSB: you all are amazing. I imagine that I'm not the only one that this is personal for. I've read myself so many posts on what you guys went through during the '08 crash. Whether you're here for the gains, to stick it to the man as I am, or just to be part of a potentially market changing movement - thank you. Each and every one of you are the reason that we have this chance. I've never felt this optimistic about the future before. This is life changing amounts of money for so many of you, and to be part of a rare instance of a wealth distribution from the rich to the poor is just incredible. I love you all.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nNote: I can't seem to get a hold of mods and they keep fucking removing the post. I have no idea how to get this to stick and its important to me that the people I'm addressing read it.",
        "subreddit": "wallstreetbets",
        "title": "An Open Letter to Melvin Capital, CNBC, Boomers, and WSB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nmwwbg/an_open_letter_to_melvin_capital_cnbc_boomers_and/",
        "created": 1622234160.0
    },
    {
        "author": "uscaninc",
        "created_utc": 1621175935,
        "id": "ndppbb",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "New Coin Just launched on **presale  DxSale** \\- **#AiChain**  **\\*\\*\\*\\* NOT PUMP &amp; DUMP**\n\nDxsale presale link: [https://dxsale.app/app/pages/defipresale?saleID=1215&amp;chain=BSC](https://dxsale.app/app/pages/defipresale?saleID=1215&amp;chain=BSC)\n\n**Check out the ROADMP, TEAM, WHITE PAPER**\n\n**Token information**\n\n1- based on **Ai and BlockChain technology.** ( AiChain is an Ai &amp; BlockChain based marketplace, where our communities meet to carry out operations involving digital goods, services, and assets with cryptocurrency transactions.)\n\n2- AiChain project will be the **next Global generation Centralized platform** that will benefit our communities. Its on-demand services Global platform is the opportunity for the community to get everything they need any time, anywhere, and most conveniently without fees services using AiChain token with a single tap on their phone.\n\nThe project in a transparent way (**open source**) and this would kill a lot of the current apps around like Taskrabbit, Airbnb, doordash, Uber, etc and all Services- on Demands apps which has **no services fees** with Smooth Payment: It’s one more step to a Crypto world as a primary payment to drive the community service forward fast.\n\n**Liquidity will be Locked automatically through DXSale for 3 years**\n\n**The token will be locked so the community drive it**\n\nOwnership will be renounced min into launch.\n\nEasy 10x potential short-term and 100x potential midterm.\n\nTokenomics :\n\n5% fee = redistributed to all existing holders. and\n\n5% fee is split 50/50 half of which is sold by the contract into BNB, while the other half of the Aichain tokens are paired automatically\n\nMax Supply: 1,000,000,000,000,000\n\n**Why Aichain ! From their website :** [**www.aichain.pro**](https://www.aichain.pro/)\n\nThe AiChain Token team consists of unpaid volunteers from various backgrounds, mainly within the ICT, Technologies, Financial industry. The team has Top Experts in Artificial Intelligence, Machine Learning, Blockchain technology, Architecture, Project Management, Software Development, Finance, and economics with extensive experience from renowned companies such as **Microsoft, Google, Ericsson, Oracle, JPMorgan.**\n\nThe team will evolve under the project phase, skills needed and workload to perform the needed tasks. We will team up with leaders of the industry systems from everywhere in the USA, Canada, Europe, Korea, China, and around the world to achieve our goals.\n\nI believe this project has huge potential to move up and catch up with big coins this will be the next ( VeChain and Cardano etc), it rewards to HOLDERS.\n\nThe devs are very open and seem quite transparent. I loaded some to hold and I hope it starts it runs like crazy. If you want to join me in my adventure, let’s do it together! Buy now at the cheaper price.\n\nWebsite:\n\n**How to buy here the links:**\n\n**PreSale DxSale link:** [**https://dxsale.app/app/pages/defipresale?saleID=1215&amp;chain=BSC**](https://dxsale.app/app/pages/defipresale?saleID=1215&amp;chain=BSC)\n\n[https://aichain.pro/#how-to-buy](https://aichain.pro/#how-to-buy)\n\n**White Paper:**\n\n[https://aichain.pro/#about](https://aichain.pro/#about)\n\nRoadmap:\n\n[https://aichain.pro/#Roadmap](https://aichain.pro/#Roadmap)\n\n**Follow them on Twitter:**\n\n[https://twitter.com/TheAiChain](https://twitter.com/TheAiChain)\n\n**Join Telegram:**\n\n[https://t.me/Ai\\_Chain](https://t.me/Ai_Chain)",
        "subreddit": "Wallstreetbetsnew",
        "title": "#AiChain is new Coin Just launched on Presale DxSale..... it's the Next Cardano",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/ndppbb/aichain_is_new_coin_just_launched_on_presale/",
        "created": 1621204735.0
    },
    {
        "author": "Jaxon-Jaxon-Jaxo",
        "created_utc": 1621695117,
        "id": "nikabx",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I bought this with GME profits, I call it The Oracle. Every time I use it and the smoke doesn’t touch the table, I buy more GME! 💪🏻 🦍",
        "url": "https://v.redd.it/n3srhennqo071",
        "created": 1621723917.0
    },
    {
        "author": "Northshore_Surv",
        "created_utc": 1620924355,
        "id": "nbl3kq",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I call this The Oracle, I burn incense with it every morning. If the smoke hits every peddle, I buy a share of GME.",
        "url": "https://v.redd.it/lj9cbgas2xy61",
        "created": 1620953155.0
    },
    {
        "author": "SuckonmyGME",
        "created_utc": 1622100947,
        "id": "nm2512",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I call this The Oracle, every time I use it and it hits every leaf I buy more GME!!!",
        "url": "https://v.redd.it/1se3dcdb9m171",
        "created": 1622129747.0
    },
    {
        "author": "GlidsSJ",
        "created_utc": 1621348095,
        "id": "nfc46d",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Xigem Technologies issued a huge report that sums up the global state of remote work.  It's not just about $XIGM - it's a look on the whole gigantic global industry (which I can relate to, working from the couch for over a year now).\n\n# Here are the key takeaways:\n\n&gt;**89%** of respondents worldwide now prefer to work from home at least occasionally. The preference was strongest among digital and knowledge-based workers, among whom 70% have worked remotely.\n\nSource: [BCG study](https://www.prnewswire.com/news-releases/89-of-people-expect-their-jobs-to-be-partly-remote-after-pandemic-ends-global-workforce-study-shows-301259126.html) of 209,000 people in 190 countries\n\n&gt;**68%** of U.S. workers believe a hybrid workplace model allowing at least one day of remote work per week is ideal\n\nSource: [https://news.prudential.com/increasingly-workers-expect-pandemic-workplace-adaptations-to-stick.htm](https://news.prudential.com/increasingly-workers-expect-pandemic-workplace-adaptations-to-stick.htm)\n\nAnother one from the same research:\n\n&gt;**42%** say they will look for a new job if their current company does not continue to offer remote work options\n\nThe number in this study doesn't correlate with my previous research, tbh. A different study by EY shows that **over 50% of workers would look for a new job if they can't work from home at least sometimes.** [https://www.ey.com/en\\_gl/news/2021/05/more-than-half-of-employees-globally-would-quit-their-jobs-if-not-provided-post-pandemic-flexibility-ey-survey-finds](https://www.ey.com/en_gl/news/2021/05/more-than-half-of-employees-globally-would-quit-their-jobs-if-not-provided-post-pandemic-flexibility-ey-survey-finds)\n\n**In addition:**\n\n&gt;**60%** of companies will offer a hybrid work model allowing people to split their work between the office and home.\\[4\\]\n\nSource: Forrester analyst for CNN [https://www.cnn.com/2021/03/09/success/remote-work-covid-pandemic-one-year-later/index.html](https://www.cnn.com/2021/03/09/success/remote-work-covid-pandemic-one-year-later/index.html)\n\nLarge companies seem to adapt to the situation as well. These guys now offer flexible hybrid work options, according to the report:\n\n* Ford;\n* Facebook;\n* Microsoft;\n* Oracle;\n* Shopify.\n\nNow where's Xigem in this? Why did they even bother to make a report? Of course, here they are:\n\n&gt;**The shift towards working from home will lift productivity in the U.S. economy by 5%, mostly due to savings in commuting time, and also driven by the rapid adoption of new technology.**\n\nSource: [National Bureau of Economic Research poll](https://www.bloomberg.com/news/articles/2021-04-22/yes-working-from-home-makes-you-more-productive-study-finds)\n\n\"There is no question that the way in which people work has experienced a fundamental shift, and that **businesses and organizations have adapted to the new realities by employing technology to support their growth**,\" said Brian Kalish, co-founder and CEO of Xigem Technologies. \"iAgent software coupled with our stated objective of aggregating technologies for the remote economy ideally positions Xigem to help organizations manage their teams, customers and clients across geographies and market sectors. We are actively pursuing customer opportunities, and expect that the remote management of human assets will prove to be among the key pillars of our strategy.\"\n\n# Conclusion:\n\nXigem Technologies (CSE: $XIGM) (FSE: $2C1) issued a big report on the remote work economy. The majority of workers feel better at home and are ready to leave their jobs if they'll be forced to get back to office. Xigem wants to dominate the emerging remote economy and works on it, their report definitely represents their interests, but hey - it's still a lot of numbers that sum up the whole industry, not just one company's future.",
        "subreddit": "pennystocks",
        "title": "Remote work - global industry report by $XIGM and lots of numbers",
        "url": "https://www.reddit.com/r/pennystocks/comments/nfc46d/remote_work_global_industry_report_by_xigm_and/",
        "created": 1621376895.0
    },
    {
        "author": "comhsbsjshw7",
        "created_utc": 1621962917,
        "id": "nkuwg5",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I call this the oracle, every time it touches all of the leaves I buy more GME!",
        "url": "https://v.redd.it/5yanek8wua171",
        "created": 1621991717.0
    },
    {
        "author": "ConsequenceGecko",
        "created_utc": 1620227726,
        "id": "n5iach",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": " Hi, I have no idea how to set up these finviz scanners and I wanted to come here and ask you guys if some of you could help me set one up?\n\nI need one where a stock has recently dipped from an ATH and one where there's just been a dip.  \nHere I have ORCL for example, It hit an ATH and it dipped, any possible way to get a scanner to find stocks with dips like that? If not, then I would love it if you guys could give some recommendations on scanners that include dipped stocks or have been going neutral after dipping?\n\n..................................................\n\nhttps://preview.redd.it/xm16dn92jbx61.png?width=345&amp;format=png&amp;auto=webp&amp;s=869579e0bd0af6d860767be5b938a963b59e4c7a",
        "subreddit": "StockMarket",
        "title": "Scanners to find dipped stocks?",
        "url": "https://www.reddit.com/r/StockMarket/comments/n5iach/scanners_to_find_dipped_stocks/",
        "created": 1620256526.0
    },
    {
        "author": "123random7",
        "created_utc": 1621985830,
        "id": "nl34es",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "# [Oracle just launched Arm-based cloud computing service , rivals Microsoft Corp (MSFT.O) and Alphabet Inc's (GOOGL.O) Google do not yet offer Arm-based cloud services to the public](https://finance.yahoo.com/news/oracle-unlocks-power-arm-based-150000604.html)Highlights : \n\n\\- Stock has surged \\~30% in last 3M -  I wonder who is buying &amp; why? company buybacks, [insider purchases](https://finance.yahoo.com/news/comfort-insider-transactions-oracle-corporation-094432518.html) or an institution ? There's was no obvious catalysts other than 'cloud' growth story.    \n\n\n\\- Market cap   227.89B  \n\\- 50-Day Moving Average  \\~ $77.26  \n\\- Est. Dividend Yield : 1.61%   \n\\- Earnings on 06/14, expected to post $1.31 EPS. Historically, Oracle has mostly beat the bottom-line estimates in last 4Q - [https://finance.yahoo.com/quote/ORCL/analysis?p=ORCL](https://finance.yahoo.com/quote/ORCL/analysis?p=ORCL) and has posted \\~5% surprise.   \n\n\n**Anyone holding $ORCL , how are you playing this earnings - HOLD / Sell around earnings?**",
        "subreddit": "stocks",
        "title": "Thoughts on $ORCL ? Earnings on 06/14",
        "url": "https://www.reddit.com/r/stocks/comments/nl34es/thoughts_on_orcl_earnings_on_0614/",
        "created": 1622014630.0
    },
    {
        "author": "TheSavingsGuy",
        "created_utc": 1620346739,
        "id": "n6lu6u",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Canada’s market for initial public offerings has shaken off recent investor fears and is set to roar back, with at least 15 issuers preparing to go public in the next few months on the Toronto Stock Exchange.\n\nThe potential offerings span a wide spectrum of industries, including technology, mining, health care and consumer products, say 10 sources familiar with impending deals. Software names dominate following a strong year for new issues from innovative Canadian companies. The Globe is not disclosing the identities of the sources as they are not authorized to speak publicly on the impending issues.\n\nSeveral companies have hired investment bankers and started gauging interest from institutional investors – a process known as “testing the waters” – or are set to do so with hopes of going public by summer. The list includes Toronto-based software providers Q4 Inc., Softchoice Corp., VerticalScope Inc. and LifeSpeak Inc.; Quebec City-based Coveo Solutions Inc.; and Calgary’s Circle Cardiovascular Imaging Inc.\n\nThey join others previously identified by The Globe as near-term IPO candidates, including Loblaw Cos. Ltd.-backed telemedicine provider Maple Corp. and Waterloo-based Auvik Networks Inc., which makes software that manages and monitors internet-network traffic. Other technology companies that have engaged bankers but likely won’t go public until later are online furniture seller Cymax Group Inc. and D2L Corp.\n\nNon-technology names looking to go public include Neighbourly Pharmacy Inc., Canada’s third-largest drugstore chain operator, which filed this week to raise $150-million in an IPO on the TSX. Meanwhile, Brookfield Asset Management Inc. is set to spin out its U.S.-based car battery maker Clarios, which it acquired from Johnson Controls International PLC two years ago.\n\n“The IPO market is reopening with a vengeance,” said Chris Dale, head of equity capital markets at National Bank Financial.\n\nThe expected flurry of new issues represents a rapid acceleration of a trend that took hold last fall. As equity markets rebounded from sharp losses early in the COVID-19 pandemic, investors started clamouring for Canadian IPOs – particularly from technology companies, whose fortunes accelerated as widespread sheltering at home increased use of online tools. The resulting fervour for Canadian and U.S. tech companies created a pace of deals unseen since the dot-com boom.\n\nThe trend extended into early 2021, as Winnipeg’s Farmers Edge Inc., Telus Corp. spinout Telus International (Cda) Inc. and Montreal telemedicine firm Dialogue Health Technologies Inc. completed well-received offerings. But parts of Canada’s booming IPO market started to wobble in late February, largely driven by fears of rising interest rates. With the end of the pandemic in sight in Canada and the U.S., thanks to effective vaccines, many investors expected central banks to consider raising rates, and that worry triggered a sell-off in many growth stocks.\n\nSeveral Canadian IPOs subsequently struggled. MDA Ltd., Boat Rocker Media Inc. and ABC Technologies Holdings all had to cut their offering sizes and prices to complete their IPOs. Saskatoon’s Vendasta Technologies Inc. still hasn’t updated the market on its plans after struggling to raise money in its proposed offering, which it started marketing seven weeks ago.\n\nOn top of the prospects for rising rates, investors have also realized that new issues have delivered mixed returns. Over the first four months of 2021, the Renaissance IPO Index, which tracks U.S. IPOs, returned -3.2 per cent as of Monday, while the S&amp;P 500 index posted an 11.3-per-cent gain. An analysis by The Globe and Mail also shows that the average return among the 14 Canadian IPOs worth $50-million or more over the past six months has been -4.3 per cent since each started trading, while average TSX returns over the same time frames have been 7.3 per cent.\n\nThe data does not include the strong debuts of Waterloo cybersecurity software company Magnet Forensics Inc. and Thinkific Labs Inc., a Vancouver-based online course platform provider, which went public last week, nor the strong market performance of AbCellera Biologics Inc. after it went public in the U.S.\n\nHowever, the success of the two recent Canadian deals has shown there is still plenty of institutional interest in new issues that can push the right buttons with investors. Thinkific and Magnet both saw heavy investor demand and are both trading above their IPO prices.\n\n“Favourable liquidity conditions in the market – easy monetary policy and a strong fiscal backdrop – continue to favour a strong IPO market,” said Lesley Marks, chief investment officer at Mackenzie Investments.\n\nAt the same time, Canada’s publicly traded information technology sector is small relative to other industries, and to technology’s weighting in the S&amp;P 500 in the U.S. Canadian fund managers accustomed to a heavy focus on traditional sectors such as financial services and resources are eager to increase their exposure to a fast-growing sector.\n\nThere has also been a shift in many investors’ mindsets, said Jeff Mo, a portfolio manager at Mawer Investment Management in Calgary. “Canadian investors historically have been very reticent to buy companies that don’t show GAAP profitability,” he said. The stock market performance of software giant Shopify Inc. – which is currently Canada’s most valuable company but was mostly unprofitable before the pandemic - has made people rethink how they construct their portfolios, he said.\n\nIf institutional fund managers remain uncomfortable with unprofitable tech companies, there is a higher chance they will underperform their benchmark indexes by missing out on high-flying but unprofitable names. Among those that went public over the past two years are Lightspeed POS Inc., Dye &amp; Durham Corp. and Nuvei Corp.\n\nWhile investor demand has roared back, bankers stress that investors aren’t as quick to jump at just any IPO as they were six months ago, when pretty much anything would sell. Higher interest rates could also quickly hurt the IPO market. “Investors are more selective,” said Peter Miller, head of equity capital markets at BMO Nesbitt Burns, adding that quality deals will still get sold. “If anything, I think it’s a healthier market.”\n\n### Here’s a look at some of the Canadian companies lining up potential IPOs in the next few months:\n\n**Q4** sells online software to investor relations departments of public companies used to support functions such as hosting webcasts of quarterly earnings calls and annual meetings. It has 2,300 clients, including about half of the S&amp;P 500 companies, and generates about US$50-million in annualized revenues. Its top line increased by 80 per cent last year, with half the gains driven by acquisitions. CIBC Capital Markets, National Bank and Credit Suisse have been hired as underwriters. Q4 CEO Darrell Heaps declined to comment.\n\n**Coveo** sells artificial-intelligence-powered search tools known as “insight engines” to corporate giants such as American Express, Dell and Geico. It is led by veteran software entrepreneur Louis Têtu, whose last company, Taleo Corp., went public in 2005 on Nasdaq and was bought by Oracle Corp. in 2012 for US$1.9-billion. OMERS’ growth-equity arm led a $227-million equity financing for Coveo in fall 2019. Coveo has hired BMO, Bank of America, RBC Capital Markets and UBS as underwriters. Mr. Têtu declined to comment.\n\n**Softchoice** sells technology made by giants such as Microsoft, Google and Cisco to corporate customers and manages it for clients. Owner Birch Hill Equity Partners took the previously public Softchoice private in 2013. TD Securities and Goldman Sachs are leading an expected $350-million offering; other banks are joining the syndicate this week. Softchoice did not reply to a request for comment.\n\n**Lifespeak** provides digital health and wellness content for companies to distribute to their employees. It raised $42-million from Round 13 Growth Fund, Kensington Capital Partners and Roynat Capital last year, and is profitable and growing by more than 50 per cent a year, with annual revenues of about $25-million. It comes to market following recent offerings by digital health companies MindBeacon Holdings Inc. and Dialogue, and as Maple gears up to do the same. RBC, Scotia Capital and Canaccord Genuity are leading the offering. Lifespeak chairman Nolan Bederman declined comment.\n\n**VerticalScope**, a Toronto online media company that is 56-per-cent owned by Torstar Corp., specializes in websites for communities of enthusiasts of topics ranging from beekeeping to fancy watches. The company has more than 1,200 websites, with 1.7 billion content posts and 100-million-plus active users per month. Although organic growth before this year was low, the company has been highly acquisitive. It has about $60-million in annual revenue, largely from advertising, and a roughly 50-per-cent operating profit margin. RBC, Canaccord Genuity and National Bank Financial are leading the deal. Spokespeople for VerticalScope and Torstar declined comment.\n\nSource: [https://www.theglobeandmail.com/business/article-ipo-market-reopens-with-a-vengeance-as-15-plus-canadian-companies-look/](https://www.theglobeandmail.com/business/article-ipo-market-reopens-with-a-vengeance-as-15-plus-canadian-companies-look/)",
        "subreddit": "CanadianInvestor",
        "title": "IPO market reopens ‘with a vengeance’ as 15-plus Canadian companies look to go public",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/n6lu6u/ipo_market_reopens_with_a_vengeance_as_15plus/",
        "created": 1620375539.0
    },
    {
        "author": "uscaninc",
        "created_utc": 1620444874,
        "id": "n7gd7z",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "New Coin Just launched on the BSC - #AiChain (Ai).    **\\*\\*\\*\\* NOT  PUMP &amp; DUMP**\n\n**Check out the ROADMP, TEAM, WHITE PAPER** \n\n**Token information**\n\n1- based on **Ai and BlockChain technology.** ( AiChain is an Ai &amp; BlockChain based marketplace, where our communities meet to carry out operations involving digital goods, services, and assets with cryptocurrency transactions.)\n\n2- AiChain project will be the **next Global generation Centralized platform** that will benefit our communities. Its on-demand services Global platform is the opportunity for the community to get everything they need any time, anywhere, and most conveniently without fees services using AiChain token with a single tap on their phone.\n\nThe project in a transparent way (**open source**) and this would kill a lot of the current apps around like Taskrabbit, Airbnb, doordash, Uber, etc and all Services- on Demands apps which has **no services fees** with Smooth Payment: It’s one more step to a Crypto world as a primary payment to drive the community service forward fast.\n\n**Liquidity will be Locked automatically through DXSale for 3 years**\n\n**The token will be locked so the community drive it**\n\nOwnership will be renounced min into launch.\n\nEasy 10x potential short-term and 100x potential midterm.\n\nTokenomics :\n\n5% fee = redistributed to all existing holders. and\n\n5% fee is split 50/50 half of which is sold by the contract into BNB, while the other half of the Aichain tokens are paired automatically\n\nMax Supply: 1,000,000,000,000,000\n\n**Why Aichain ! From their website :** [**www.aichain.pro**](https://www.aichain.pro/)\n\nThe AiChain Token team consists of unpaid volunteers from various backgrounds, mainly within the ICT, Technologies, Financial industry. The team has Top Experts in Artificial Intelligence, Machine Learning, Blockchain technology, Architecture, Project Management, Software Development, Finance, and economics with extensive experience from renowned companies such as **Microsoft, Google, Ericsson, Oracle, JPMorgan.**\n\nThe team will evolve under the project phase, skills needed and workload to perform the needed tasks. We will team up with leaders of the industry systems from everywhere in the USA, Canada, Europe, Korea, China, and around the world to achieve our goals.\n\nI believe this project has huge potential to move up and catch up with big coins this will be the next ( VeChain and Cardano etc), it rewards to HODLERS.\n\nThe devs are very open and seem quite transparent. I loaded some to hold and I hope it starts it runs like crazy. If you want to join me in my adventure, let’s do it together! Buy now at the cheaper price.\n\nWebsite:\n\n**How to buy here the links:**\n\n[https://aichain.pro/#how-to-buy](https://aichain.pro/#how-to-buy)\n\n**White Paper:**\n\n[https://aichain.pro/#about](https://aichain.pro/#about)\n\nRoadmap:\n\n[https://aichain.pro/#Roadmap](https://aichain.pro/#Roadmap)\n\n**Follow them on Twitter:**\n\n[https://twitter.com/TheAiChain](https://twitter.com/TheAiChain)\n\n**Join Telegram:**\n\n[https://t.me/TheAichain](https://t.me/TheAichain)\n\nLets Help the AiChain to Meet $VeChain and $Cardano !",
        "subreddit": "Wallstreetbetsnew",
        "title": "New Coin Just launched on the BSC - #AiChain (Ai) is the NEXT $ADA &amp; $VET",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/n7gd7z/new_coin_just_launched_on_the_bsc_aichain_ai_is/",
        "created": 1620473674.0
    },
    {
        "author": "Fingerinmybutt21",
        "created_utc": 1620594194,
        "id": "n8nj18",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME gave me enough money to buy one of these bad boys. I call it the oracle, every time it fills up without spilling... I BUY MORE GME!",
        "url": "https://v.redd.it/t4mbqrw0t5y61",
        "created": 1620622994.0
    },
    {
        "author": "cashMoney5150",
        "created_utc": 1620345568,
        "id": "n6lg1w",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Glorious Oracle of Ohama achieves pareto efficiency with the universe at $420,420 then it kills the nasdaq at $421,420? This a coincidence or reptilian renaissance?",
        "url": "https://i.redd.it/mspkkklr9lx61.png",
        "created": 1620374368.0
    },
    {
        "author": "comhsbsjshw7",
        "created_utc": 1621962377,
        "id": "nkup1l",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I call this the oracle, every time I use it and it touches all the leaves I buy more GME.",
        "url": "https://v.redd.it/cpg8hjfata171",
        "created": 1621991177.0
    },
    {
        "author": "SnuBAChub",
        "created_utc": 1622333368,
        "id": "nnzh9z",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "XY Oracle, going up? What is it?",
        "url": "https://www.reddit.com/r/investing/comments/nnzh9z/xy_oracle_going_up_what_is_it/",
        "created": 1622362168.0
    },
    {
        "author": "nektarios_kalogridis",
        "created_utc": 1619874260,
        "id": "n2hy2y",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "One such service is [DeepTrading.ai](https://www.deeptrading.ai/). They use advanced time-series Deep Neural Networks to predict stock prices from a list of 250 stocks. Their goal is to democratize the usage of these sophisticated predictive models, which elite hedge funds use.\n\nThey will show you **daily, weekly, monthly, three-month, and yearly** price predictions. These predictions get refreshed daily, and what is best, they allow you to see their historical daily predictions versus the close price in a chart so you can judge for yourself the performance of the AI model.\n\nThey have **basic** and **advanced** plans. Basic gives you access to daily and weekly predictions, and advanced gives you access to daily, weekly, monthly, three-month, and yearly price predictions.\n\nYou can pay as low as $34, which will give you access to the basic plan for one week for the entire list of 250 stocks. And if you pay $49, it will provide you with access to the advanced plan for a week, again, for the whole list of 250 stocks.\n\nBelow I include screenshots from their Stocks dashboard and selected Oracle to show the bigger predictions chart and stock price prediction info.\n\n#  Stock Dashboard \n\n[Stock DashBoard](https://preview.redd.it/6pfenqwnbiw61.png?width=1350&amp;format=png&amp;auto=webp&amp;s=abb9caf04a53d7916b0be1d144498d2532011498)\n\n#  Sample One Stock Prediction\n\nhttps://preview.redd.it/i94aieo7ciw61.png?width=1467&amp;format=png&amp;auto=webp&amp;s=f153de3549db08891b7fd6c936cafccaeaf429e5",
        "subreddit": "wallstreetbets",
        "title": "Is there a service that provides you with artificial intelligence stock price predictions?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n2hy2y/is_there_a_service_that_provides_you_with/",
        "created": 1619903060.0
    },
    {
        "author": "Fingerinmybutt21",
        "created_utc": 1620598940,
        "id": "n8p5vz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Bought this bad boy with GME profits, I call it the oracle! Every time it fills without spilling on the table I buy a share of GME!",
        "url": "https://v.redd.it/qizu107p66y61",
        "created": 1620627740.0
    },
    {
        "author": "Karnes",
        "created_utc": 1621389765,
        "id": "nfsy3g",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Boston, MA, based Investment company Whale Rock Capital Management LLC (Current Portfolio) buys Alphabet Inc, Wayfair Inc, Facebook Inc, Applied Materials Inc, Workday Inc, sells Square Inc, Tesla Inc, NXP Semiconductors NV, Match Group Inc, Zoom Video Communications Inc during the 3-months ended 2021Q1, according to the most recent filings of the investment company, Whale Rock Capital Management LLC. As of 2021Q1, Whale Rock Capital Management LLC owns 49 stocks with a total value of $12.2 billion. \n\nThese are the details of the buys and sells.\nNew Purchases: GOOGL, W, AMAT, WDAY, ORCL, TWTR, ASML, MSFT, NCNO, CPNG, XM, AFRM, ACVA, TBA, OLO, DLB,\nAdded Positions: FB, BEKE, AMZN, ZEN, TWLO, BILL, SMAR, TRIP, BILI\n\nReduced Positions: TSLA, CRWD, TSM, PENN, SE, CREE, DIS, PINS, FIVN, PTON, MELI, CVNA, MDB, COUP, SHOP, PDD, AI, DASH, ABNB\n\nSold Out: SQ, NXPI, MTCH, ZM, UBER, ZS, CRUS, EXPE, FTCH, NVDA, JD, EGHT, OKTA, SNAP, MPWR, NET, ROOT, OZON, YSG,\n\nThese are the top 5 holdings of Whale Rock Capital Management LLC\nAmazon.com Inc (AMZN) - 213,351 shares, 5.43% of the total portfolio. Shares added by 33.66%\n\nAlphabet Inc (GOOGL) - 288,966 shares, 4.90% of the total portfolio. New Position\n\nTesla Inc (TSLA) - 873,195 shares, 4.80% of the total portfolio. Shares reduced by 46.96%\n\nBill.com Holdings Inc (BILL) - 3,905,451 shares, 4.67% of the total portfolio. Shares added by 11.17%\n\nWayfair Inc (W) - 1,608,311 shares, 4.16% of the total portfolio. New Position\n\nSource:  https://www.gurufocus.com/news/1432419/whale-rock-capital-management-llc-buys-alphabet-inc-wayfair-inc-facebook-inc-sells-square-inc-tesla-inc-nxp-semiconductors-nv",
        "subreddit": "stocks",
        "title": "Whale Rock Capital adds Alphabet to its holdings - 288,966 shares (4.9% of the total portfolio), making it the second largest holding.",
        "url": "https://www.reddit.com/r/stocks/comments/nfsy3g/whale_rock_capital_adds_alphabet_to_its_holdings/",
        "created": 1621418565.0
    },
    {
        "author": "sonysachdeva",
        "created_utc": 1620227510,
        "id": "n5i79r",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "EX Oracle CFO - Jeff Epstein SPAC - Apex Technology Acquisition Corp(APXT). Why is'nt no one talking about this? Only SPAC with Share Buybacks.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n5i79r/ex_oracle_cfo_jeff_epstein_spac_apex_technology/",
        "created": 1620256310.0
    },
    {
        "author": "Fuzzy_Monk3613",
        "created_utc": 1621283189,
        "id": "neqw04",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hey guys,\n\nI was wondering if I could run a little experiment, that may completely fail, but if it doesn’t- it would be quite cool. The basic idea is - you give me a prediction in the comments, and based on your answers, I’ll try to apply a mathematical formula and ‘predict the future’. \n\nThe way the game works is as follows:\n\n1. You go on wherever you normally check the price of B I T C O I N and look at what it is at the time you’re reading this\n2. Think about what the price might be On Wednesday at 13:00 UK time (maybe check what that corresponds to in whichever part of the world you are)\n3. Comment on this post with your prediction for Wednesday at 13:00 UK time \n\nIf enough people comment and give their prediction, I’ll give my price based on my black magic voodoo powers (and a bit of maths) and... it may be astonishingly accurate, or it may not work at all",
        "subreddit": "wallstreetbets",
        "title": "Oracle",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/neqw04/oracle/",
        "created": 1621311989.0
    },
    {
        "author": "Fred_thedot_miner",
        "created_utc": 1621612359,
        "id": "nhvstm",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Guys , these periods often are just opportunities but you have to consider the risk . That's why when I see a prominent falling (that could be a 10% or more) I prefer to sell most of my capital and then reinvest at a cheaper price . why? simple answer = I prefer using the same initial cap or just a little more in order to avoid losing all my money . The point is that : take the initial risk , don't continue to take risk . Use only the quantity of money you can permit to lose .\n\nThat's why I resold part of my position today as I think this week bt will go down to 32/34k and already placed orders . Then next weekend (end of may) It will probably rise up (I don't know how much) . Surely I'm not an oracle , maybe I'm right , maybe not . Usually when bt has to go up , it makes a fake rise then go down for the second time and then go up seriously . Hoping I'm right so I will accumulate more tokens this weekend 🙏",
        "subreddit": "wallstreetbets",
        "title": "RISING CRYPT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nhvstm/rising_crypt/",
        "created": 1621641159.0
    },
    {
        "author": "4nonmau5",
        "created_utc": 1620282864,
        "id": "n60zj1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "$TRB Trello is the most underrated Oracle platform and is going live on Coinbase today 🚀🌕😎",
        "subreddit": "wallstreetbets",
        "title": "$TRB Moonshot 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n60zj1/trb_moonshot/",
        "created": 1620311664.0
    },
    {
        "author": "Feature-Tiny",
        "created_utc": 1620317212,
        "id": "n6arvv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Rumors on Oracle in talks to buy Fastly. Insider information. Fastly is 25% cheap today. Get in asap.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n6arvv/rumors_on_oracle_in_talks_to_buy_fastly_insider/",
        "created": 1620346012.0
    },
    {
        "author": "Geometric_world",
        "created_utc": 1620605176,
        "id": "n8r4ag",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "I bought this bad boy using GME profits, every time it fills without spilling on the table I buy more GME. I call it the Oracle.",
        "url": "https://v.redd.it/jjlh8ypfp6y61",
        "created": 1620633976.0
    },
    {
        "author": "Elegant-Let8280",
        "created_utc": 1621635784,
        "id": "ni4hqg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Might be a tad off-topic, but is anyone here using iTrade FlightDesk and on a Mac computer?\n\nIf so, can you share your process to do it? I can make it work, but it's a PITA (Java webstart that looks for Sun/Oracle java, \"unverified\" developer that clashes with default OSX security settings, etc).\n\nThanks!",
        "subreddit": "CanadianInvestor",
        "title": "FlightDesk on Mac",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/ni4hqg/flightdesk_on_mac/",
        "created": 1621664584.0
    },
    {
        "author": "Fingerinmybutt21",
        "created_utc": 1620603884,
        "id": "n8qqci",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I bought this using GME profits, every time it fills without spilling over the table I buy more GME. I call it the oracle.",
        "url": "https://v.redd.it/cfaj88sll6y61",
        "created": 1620632684.0
    },
    {
        "author": "KillerBomb24",
        "created_utc": 1620659546,
        "id": "n977ip",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Dear SPCE Oracle, today is the day we have all been waiting for. Its earnings call day. Tell the SPCE 🧻🙌 and the 🏳️‍🌈🐻 to convert to 💎🙌. Make Unity great again. For the love of god if we get another delay I will get kicked out of my wife’s boyfriends house again. But most of all, PLEAS FLY AGAIN. Ps mods if you take this down you’re gae.",
        "subreddit": "wallstreetbets",
        "title": "A Message to The SPCE Oracle🔮🙏",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n977ip/a_message_to_the_spce_oracle/",
        "created": 1620688346.0
    },
    {
        "author": "Erland_Brynjar",
        "created_utc": 1619966921,
        "id": "n37uyq",
        "num_comments": 144,
        "num_crossposts": 0,
        "selftext": "Buffett warned newbie investors that picking great companies is more complicated than just selecting a promising industry.\n\n\"There's a lot more to picking stocks than figuring out what's going to be a wonderful industry in the future,\" said Buffett.\n\nBuffett put up a slide of all the auto companies from years go that started with the letter \"M;\" however, the list was so long it didn't fit on one slide. The \"Oracle of Omaha\" had to narrow the list to automobile manufactures that started with \"Ma\" to fit the names on one page.\n\nBuffett said there were about 2,000 companies that entered the auto business in the 1900's because investors and entrepreneurs expected the industry to have an amazing future. In 2009, there were three automakers left and two went bankrupt, said Buffett.\n\nWhether it’s technology, EVs, renewables, marijuana or cyber security, many will enter these budding industries, and most will not make it. It isn’t good enough to pick the sector or industry that’ll grow most, you either need to time your exits perfectly, or hope you have the few that survive to cover your losses on the many that don’t.",
        "subreddit": "CanadianInvestor",
        "title": "Buffett: There's a lot more to investing than picking a budding industry",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/n37uyq/buffett_theres_a_lot_more_to_investing_than/",
        "created": 1619995721.0
    },
    {
        "author": "ConsequenceGecko",
        "created_utc": 1620227726,
        "id": "n5iach",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": " Hi, I have no idea how to set up these finviz scanners and I wanted to come here and ask you guys if some of you could help me set one up?\n\nI need one where a stock has recently dipped from an ATH and one where there's just been a dip.  \nHere I have ORCL for example, It hit an ATH and it dipped, any possible way to get a scanner to find stocks with dips like that? If not, then I would love it if you guys could give some recommendations on scanners that include dipped stocks or have been going neutral after dipping?\n\n..................................................\n\nhttps://preview.redd.it/xm16dn92jbx61.png?width=345&amp;format=png&amp;auto=webp&amp;s=869579e0bd0af6d860767be5b938a963b59e4c7a",
        "subreddit": "StockMarket",
        "title": "Scanners to find dipped stocks?",
        "url": "https://www.reddit.com/r/StockMarket/comments/n5iach/scanners_to_find_dipped_stocks/",
        "created": 1620256526.0
    },
    {
        "author": "TheSavingsGuy",
        "created_utc": 1620346739,
        "id": "n6lu6u",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Canada’s market for initial public offerings has shaken off recent investor fears and is set to roar back, with at least 15 issuers preparing to go public in the next few months on the Toronto Stock Exchange.\n\nThe potential offerings span a wide spectrum of industries, including technology, mining, health care and consumer products, say 10 sources familiar with impending deals. Software names dominate following a strong year for new issues from innovative Canadian companies. The Globe is not disclosing the identities of the sources as they are not authorized to speak publicly on the impending issues.\n\nSeveral companies have hired investment bankers and started gauging interest from institutional investors – a process known as “testing the waters” – or are set to do so with hopes of going public by summer. The list includes Toronto-based software providers Q4 Inc., Softchoice Corp., VerticalScope Inc. and LifeSpeak Inc.; Quebec City-based Coveo Solutions Inc.; and Calgary’s Circle Cardiovascular Imaging Inc.\n\nThey join others previously identified by The Globe as near-term IPO candidates, including Loblaw Cos. Ltd.-backed telemedicine provider Maple Corp. and Waterloo-based Auvik Networks Inc., which makes software that manages and monitors internet-network traffic. Other technology companies that have engaged bankers but likely won’t go public until later are online furniture seller Cymax Group Inc. and D2L Corp.\n\nNon-technology names looking to go public include Neighbourly Pharmacy Inc., Canada’s third-largest drugstore chain operator, which filed this week to raise $150-million in an IPO on the TSX. Meanwhile, Brookfield Asset Management Inc. is set to spin out its U.S.-based car battery maker Clarios, which it acquired from Johnson Controls International PLC two years ago.\n\n“The IPO market is reopening with a vengeance,” said Chris Dale, head of equity capital markets at National Bank Financial.\n\nThe expected flurry of new issues represents a rapid acceleration of a trend that took hold last fall. As equity markets rebounded from sharp losses early in the COVID-19 pandemic, investors started clamouring for Canadian IPOs – particularly from technology companies, whose fortunes accelerated as widespread sheltering at home increased use of online tools. The resulting fervour for Canadian and U.S. tech companies created a pace of deals unseen since the dot-com boom.\n\nThe trend extended into early 2021, as Winnipeg’s Farmers Edge Inc., Telus Corp. spinout Telus International (Cda) Inc. and Montreal telemedicine firm Dialogue Health Technologies Inc. completed well-received offerings. But parts of Canada’s booming IPO market started to wobble in late February, largely driven by fears of rising interest rates. With the end of the pandemic in sight in Canada and the U.S., thanks to effective vaccines, many investors expected central banks to consider raising rates, and that worry triggered a sell-off in many growth stocks.\n\nSeveral Canadian IPOs subsequently struggled. MDA Ltd., Boat Rocker Media Inc. and ABC Technologies Holdings all had to cut their offering sizes and prices to complete their IPOs. Saskatoon’s Vendasta Technologies Inc. still hasn’t updated the market on its plans after struggling to raise money in its proposed offering, which it started marketing seven weeks ago.\n\nOn top of the prospects for rising rates, investors have also realized that new issues have delivered mixed returns. Over the first four months of 2021, the Renaissance IPO Index, which tracks U.S. IPOs, returned -3.2 per cent as of Monday, while the S&amp;P 500 index posted an 11.3-per-cent gain. An analysis by The Globe and Mail also shows that the average return among the 14 Canadian IPOs worth $50-million or more over the past six months has been -4.3 per cent since each started trading, while average TSX returns over the same time frames have been 7.3 per cent.\n\nThe data does not include the strong debuts of Waterloo cybersecurity software company Magnet Forensics Inc. and Thinkific Labs Inc., a Vancouver-based online course platform provider, which went public last week, nor the strong market performance of AbCellera Biologics Inc. after it went public in the U.S.\n\nHowever, the success of the two recent Canadian deals has shown there is still plenty of institutional interest in new issues that can push the right buttons with investors. Thinkific and Magnet both saw heavy investor demand and are both trading above their IPO prices.\n\n“Favourable liquidity conditions in the market – easy monetary policy and a strong fiscal backdrop – continue to favour a strong IPO market,” said Lesley Marks, chief investment officer at Mackenzie Investments.\n\nAt the same time, Canada’s publicly traded information technology sector is small relative to other industries, and to technology’s weighting in the S&amp;P 500 in the U.S. Canadian fund managers accustomed to a heavy focus on traditional sectors such as financial services and resources are eager to increase their exposure to a fast-growing sector.\n\nThere has also been a shift in many investors’ mindsets, said Jeff Mo, a portfolio manager at Mawer Investment Management in Calgary. “Canadian investors historically have been very reticent to buy companies that don’t show GAAP profitability,” he said. The stock market performance of software giant Shopify Inc. – which is currently Canada’s most valuable company but was mostly unprofitable before the pandemic - has made people rethink how they construct their portfolios, he said.\n\nIf institutional fund managers remain uncomfortable with unprofitable tech companies, there is a higher chance they will underperform their benchmark indexes by missing out on high-flying but unprofitable names. Among those that went public over the past two years are Lightspeed POS Inc., Dye &amp; Durham Corp. and Nuvei Corp.\n\nWhile investor demand has roared back, bankers stress that investors aren’t as quick to jump at just any IPO as they were six months ago, when pretty much anything would sell. Higher interest rates could also quickly hurt the IPO market. “Investors are more selective,” said Peter Miller, head of equity capital markets at BMO Nesbitt Burns, adding that quality deals will still get sold. “If anything, I think it’s a healthier market.”\n\n### Here’s a look at some of the Canadian companies lining up potential IPOs in the next few months:\n\n**Q4** sells online software to investor relations departments of public companies used to support functions such as hosting webcasts of quarterly earnings calls and annual meetings. It has 2,300 clients, including about half of the S&amp;P 500 companies, and generates about US$50-million in annualized revenues. Its top line increased by 80 per cent last year, with half the gains driven by acquisitions. CIBC Capital Markets, National Bank and Credit Suisse have been hired as underwriters. Q4 CEO Darrell Heaps declined to comment.\n\n**Coveo** sells artificial-intelligence-powered search tools known as “insight engines” to corporate giants such as American Express, Dell and Geico. It is led by veteran software entrepreneur Louis Têtu, whose last company, Taleo Corp., went public in 2005 on Nasdaq and was bought by Oracle Corp. in 2012 for US$1.9-billion. OMERS’ growth-equity arm led a $227-million equity financing for Coveo in fall 2019. Coveo has hired BMO, Bank of America, RBC Capital Markets and UBS as underwriters. Mr. Têtu declined to comment.\n\n**Softchoice** sells technology made by giants such as Microsoft, Google and Cisco to corporate customers and manages it for clients. Owner Birch Hill Equity Partners took the previously public Softchoice private in 2013. TD Securities and Goldman Sachs are leading an expected $350-million offering; other banks are joining the syndicate this week. Softchoice did not reply to a request for comment.\n\n**Lifespeak** provides digital health and wellness content for companies to distribute to their employees. It raised $42-million from Round 13 Growth Fund, Kensington Capital Partners and Roynat Capital last year, and is profitable and growing by more than 50 per cent a year, with annual revenues of about $25-million. It comes to market following recent offerings by digital health companies MindBeacon Holdings Inc. and Dialogue, and as Maple gears up to do the same. RBC, Scotia Capital and Canaccord Genuity are leading the offering. Lifespeak chairman Nolan Bederman declined comment.\n\n**VerticalScope**, a Toronto online media company that is 56-per-cent owned by Torstar Corp., specializes in websites for communities of enthusiasts of topics ranging from beekeeping to fancy watches. The company has more than 1,200 websites, with 1.7 billion content posts and 100-million-plus active users per month. Although organic growth before this year was low, the company has been highly acquisitive. It has about $60-million in annual revenue, largely from advertising, and a roughly 50-per-cent operating profit margin. RBC, Canaccord Genuity and National Bank Financial are leading the deal. Spokespeople for VerticalScope and Torstar declined comment.\n\nSource: [https://www.theglobeandmail.com/business/article-ipo-market-reopens-with-a-vengeance-as-15-plus-canadian-companies-look/](https://www.theglobeandmail.com/business/article-ipo-market-reopens-with-a-vengeance-as-15-plus-canadian-companies-look/)",
        "subreddit": "CanadianInvestor",
        "title": "IPO market reopens ‘with a vengeance’ as 15-plus Canadian companies look to go public",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/n6lu6u/ipo_market_reopens_with_a_vengeance_as_15plus/",
        "created": 1620375539.0
    },
    {
        "author": "uscaninc",
        "created_utc": 1620444874,
        "id": "n7gd7z",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "New Coin Just launched on the BSC - #AiChain (Ai).    **\\*\\*\\*\\* NOT  PUMP &amp; DUMP**\n\n**Check out the ROADMP, TEAM, WHITE PAPER** \n\n**Token information**\n\n1- based on **Ai and BlockChain technology.** ( AiChain is an Ai &amp; BlockChain based marketplace, where our communities meet to carry out operations involving digital goods, services, and assets with cryptocurrency transactions.)\n\n2- AiChain project will be the **next Global generation Centralized platform** that will benefit our communities. Its on-demand services Global platform is the opportunity for the community to get everything they need any time, anywhere, and most conveniently without fees services using AiChain token with a single tap on their phone.\n\nThe project in a transparent way (**open source**) and this would kill a lot of the current apps around like Taskrabbit, Airbnb, doordash, Uber, etc and all Services- on Demands apps which has **no services fees** with Smooth Payment: It’s one more step to a Crypto world as a primary payment to drive the community service forward fast.\n\n**Liquidity will be Locked automatically through DXSale for 3 years**\n\n**The token will be locked so the community drive it**\n\nOwnership will be renounced min into launch.\n\nEasy 10x potential short-term and 100x potential midterm.\n\nTokenomics :\n\n5% fee = redistributed to all existing holders. and\n\n5% fee is split 50/50 half of which is sold by the contract into BNB, while the other half of the Aichain tokens are paired automatically\n\nMax Supply: 1,000,000,000,000,000\n\n**Why Aichain ! From their website :** [**www.aichain.pro**](https://www.aichain.pro/)\n\nThe AiChain Token team consists of unpaid volunteers from various backgrounds, mainly within the ICT, Technologies, Financial industry. The team has Top Experts in Artificial Intelligence, Machine Learning, Blockchain technology, Architecture, Project Management, Software Development, Finance, and economics with extensive experience from renowned companies such as **Microsoft, Google, Ericsson, Oracle, JPMorgan.**\n\nThe team will evolve under the project phase, skills needed and workload to perform the needed tasks. We will team up with leaders of the industry systems from everywhere in the USA, Canada, Europe, Korea, China, and around the world to achieve our goals.\n\nI believe this project has huge potential to move up and catch up with big coins this will be the next ( VeChain and Cardano etc), it rewards to HODLERS.\n\nThe devs are very open and seem quite transparent. I loaded some to hold and I hope it starts it runs like crazy. If you want to join me in my adventure, let’s do it together! Buy now at the cheaper price.\n\nWebsite:\n\n**How to buy here the links:**\n\n[https://aichain.pro/#how-to-buy](https://aichain.pro/#how-to-buy)\n\n**White Paper:**\n\n[https://aichain.pro/#about](https://aichain.pro/#about)\n\nRoadmap:\n\n[https://aichain.pro/#Roadmap](https://aichain.pro/#Roadmap)\n\n**Follow them on Twitter:**\n\n[https://twitter.com/TheAiChain](https://twitter.com/TheAiChain)\n\n**Join Telegram:**\n\n[https://t.me/TheAichain](https://t.me/TheAichain)\n\nLets Help the AiChain to Meet $VeChain and $Cardano !",
        "subreddit": "Wallstreetbetsnew",
        "title": "New Coin Just launched on the BSC - #AiChain (Ai) is the NEXT $ADA &amp; $VET",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/n7gd7z/new_coin_just_launched_on_the_bsc_aichain_ai_is/",
        "created": 1620473674.0
    },
    {
        "author": "Fingerinmybutt21",
        "created_utc": 1620594194,
        "id": "n8nj18",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "GME gave me enough money to buy one of these bad boys. I call it the oracle, every time it fills up without spilling... I BUY MORE GME!",
        "url": "https://v.redd.it/t4mbqrw0t5y61",
        "created": 1620622994.0
    },
    {
        "author": "cashMoney5150",
        "created_utc": 1620345568,
        "id": "n6lg1w",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Glorious Oracle of Ohama achieves pareto efficiency with the universe at $420,420 then it kills the nasdaq at $421,420? This a coincidence or reptilian renaissance?",
        "url": "https://i.redd.it/mspkkklr9lx61.png",
        "created": 1620374368.0
    },
    {
        "author": "nektarios_kalogridis",
        "created_utc": 1619874260,
        "id": "n2hy2y",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "One such service is [DeepTrading.ai](https://www.deeptrading.ai/). They use advanced time-series Deep Neural Networks to predict stock prices from a list of 250 stocks. Their goal is to democratize the usage of these sophisticated predictive models, which elite hedge funds use.\n\nThey will show you **daily, weekly, monthly, three-month, and yearly** price predictions. These predictions get refreshed daily, and what is best, they allow you to see their historical daily predictions versus the close price in a chart so you can judge for yourself the performance of the AI model.\n\nThey have **basic** and **advanced** plans. Basic gives you access to daily and weekly predictions, and advanced gives you access to daily, weekly, monthly, three-month, and yearly price predictions.\n\nYou can pay as low as $34, which will give you access to the basic plan for one week for the entire list of 250 stocks. And if you pay $49, it will provide you with access to the advanced plan for a week, again, for the whole list of 250 stocks.\n\nBelow I include screenshots from their Stocks dashboard and selected Oracle to show the bigger predictions chart and stock price prediction info.\n\n#  Stock Dashboard \n\n[Stock DashBoard](https://preview.redd.it/6pfenqwnbiw61.png?width=1350&amp;format=png&amp;auto=webp&amp;s=abb9caf04a53d7916b0be1d144498d2532011498)\n\n#  Sample One Stock Prediction\n\nhttps://preview.redd.it/i94aieo7ciw61.png?width=1467&amp;format=png&amp;auto=webp&amp;s=f153de3549db08891b7fd6c936cafccaeaf429e5",
        "subreddit": "wallstreetbets",
        "title": "Is there a service that provides you with artificial intelligence stock price predictions?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n2hy2y/is_there_a_service_that_provides_you_with/",
        "created": 1619903060.0
    },
    {
        "author": "Fingerinmybutt21",
        "created_utc": 1620598940,
        "id": "n8p5vz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Bought this bad boy with GME profits, I call it the oracle! Every time it fills without spilling on the table I buy a share of GME!",
        "url": "https://v.redd.it/qizu107p66y61",
        "created": 1620627740.0
    },
    {
        "author": "sonysachdeva",
        "created_utc": 1620227510,
        "id": "n5i79r",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "EX Oracle CFO - Jeff Epstein SPAC - Apex Technology Acquisition Corp(APXT). Why is'nt no one talking about this? Only SPAC with Share Buybacks.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n5i79r/ex_oracle_cfo_jeff_epstein_spac_apex_technology/",
        "created": 1620256310.0
    },
    {
        "author": "4nonmau5",
        "created_utc": 1620282864,
        "id": "n60zj1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "$TRB Trello is the most underrated Oracle platform and is going live on Coinbase today 🚀🌕😎",
        "subreddit": "wallstreetbets",
        "title": "$TRB Moonshot 🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n60zj1/trb_moonshot/",
        "created": 1620311664.0
    },
    {
        "author": "Feature-Tiny",
        "created_utc": 1620317212,
        "id": "n6arvv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Rumors on Oracle in talks to buy Fastly. Insider information. Fastly is 25% cheap today. Get in asap.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n6arvv/rumors_on_oracle_in_talks_to_buy_fastly_insider/",
        "created": 1620346012.0
    },
    {
        "author": "Geometric_world",
        "created_utc": 1620605176,
        "id": "n8r4ag",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "Wallstreetbetsnew",
        "title": "I bought this bad boy using GME profits, every time it fills without spilling on the table I buy more GME. I call it the Oracle.",
        "url": "https://v.redd.it/jjlh8ypfp6y61",
        "created": 1620633976.0
    },
    {
        "author": "Fingerinmybutt21",
        "created_utc": 1620603884,
        "id": "n8qqci",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I bought this using GME profits, every time it fills without spilling over the table I buy more GME. I call it the oracle.",
        "url": "https://v.redd.it/cfaj88sll6y61",
        "created": 1620632684.0
    },
    {
        "author": "gio9619",
        "created_utc": 1620127313,
        "id": "n4lvs9",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hi everyone, I would like to suggest 3 website to earn some free crypto by watching shortlinks or ptc ads, they both allow to withdraw to [expresscrypto](https://expresscrypto.io/signup?referral=248634), [faucetpay](https://faucetpay.io/?r=1219077) coinbase or directly to wallet.\n\n1: the first is [faucetcrypto](https://faucetcrypto.com/ref/781142) it allows to earn some coin through shortlinks, ptc ads , surveys or offerwall, the minimum amount to withdraw is very low and can be reached daily plus it has a level program that gives you more coins by leveling up\n\n2: the second is [dutchy corps](https://autofaucet.dutchycorp.space/?r=france999) that is an autofaucet, it allows to earn by watching shortlinks, ptc ads , surfing ads and offerwalls. It also has a level program that increase the claming amount plus i recommend to run the autofaucet with balance mode to earn an additional 10% and on weekends to earn an additional 20% claim bonus\n\n3: the third is [autoclaim](https://autoclaim.in/r/france999) that allows to earn coin by doing shortlinks or offerwalls very easily, it also has a bonus program and there is no minimum amount to withdraw\n\nI think is a good way to start earn some crypto without spend money, if someone did register and want some tip I use to do the shortlinks and ptc ads quickly feel free to message me.",
        "subreddit": "StockMarket",
        "title": "three websites to earn some free crypto",
        "url": "https://www.reddit.com/r/StockMarket/comments/n4lvs9/three_websites_to_earn_some_free_crypto/",
        "created": 1620156113.0
    },
    {
        "author": "Kuentai",
        "created_utc": 1619979678,
        "id": "n3cfag",
        "num_comments": 454,
        "num_crossposts": 0,
        "selftext": "tldr; we can make burgers like we make beer, buy ANIC for $$$ and no ouch for cow\n\n&amp;#x200B;\n\nThe issues with the livestock and fishing industries have been blowing up lately, we are running out of fish and livestock is one of the leading causes of climate change. The question remains, how do we solve the problem. Some say 'do less, eat less' but I'd argue that this is anathema to humanity and obviously isn't going to work fast enough. We can solve this problem, like everything, with technology. Make something better and cheaper and the majority will follow. \n\n&amp;#x200B;\n\nThis technology exists (lab grown/clean meat) and has been hitting the front page of reddit and international press almost daily at this point. Particularly because of the recent Netflix fishing documentary and Bill Gates letter. There is currently only one way to get in on the ride as a dirty retail investor. If this interests you, get ready for a deep dive.\n\n&amp;#x200B;\n\nI've been keeping an eye on and researching the lab grown meat industry for the last few years waiting for them to solve a technical and moral problem that was holding it back (FBS). Luckily this problem has largely been solved by each lab grown meat company individually, who have each finished developing their own solutions. Making Lab Grown Meat officially (and rebranded as) 'Clean Meat' and 'Cruelty Free.'\n\n&amp;#x200B;\n\nMany of these companies are building factories and aiming for product release **by the end of the year**. Basically a metric ton of [funding](https://agronomics.im/) was handed out in 2020 once these companies solved the FBS problem, massively accelerating their progress to the market.\n\n&amp;#x200B;\n\n\n**Important Points:**\n\n[Global meat, poultry and seafood market is growing to $7.3 trillion.](https://www.grandviewresearch.com/press-release/global-meat-poultry-seafood-market)\n\n**That's a lot of money.**\n\n&amp;#x200B;\n\n[Up to 99% of meat farming in America is factory farming.](https://www.sentienceinstitute.org/us-factory-farming-estimates)\n\n**Vast majority of consumers do not care about quality, just price.**\n\n&amp;#x200B;\n\n[According to American Human's survey nearly 95% of participants are \"very concerned\" about the welfare of farm animals.](https://awionline.org/sites/default/files/uploads/documents/fa-consumer_perceptionsoffarmwelfare_-112511.pdf)\n\n**People feel guilty about it.**\n\n&amp;#x200B;\n\n[84% of vegetarians return to eating meat.](https://www.thehealthy.com/food/vegetarians-vegans-go-back-meat/)\n\n**Buuuut people want/need meat.**\n\n&amp;#x200B;\n\n[\"If 1955 beef production practices were used today, we’d need 165 million more acres of land to produce the same output.\"](https://washingtoncitypaper.com/article/200456/could-we-survive-without-factory-farming-the-low-price-of/)\n\n**Producing meat at todays consumption level ethically is impossible.**\n\n&amp;#x200B;\n\n[Animal Husbandry is the second largest contributer to human made greenhouse gas emissions and the leading cause of deforestation, water and air pollution.](https://climatenexus.org/climate-issues/food/animal-agricultures-impact-on-climate-change/)\n\n**Legislation incoming.**\n\n&amp;#x200B;\n\n[Future Meat Technologies](https://www.future-meat.com/) says [its cultured products will take up 99% less land, 96% less freshwater and emit 80% less greenhouse gases than traditional meat production](https://www.cnbc.com/2019/10/19/lab-grown-meat-could-exacerbate-climate-change-scientists-say.html)\n\n**Self reported but reasonable when taking into account future economies of scale.**\n\n&amp;#x200B;\n\nSo, what to do.\n\nPeople don't like doing less, people don't like feeling bad, solve the problem as ever with technology.\n\nWe simply skip the cow and grow the burger.\n\n&amp;#x200B;\n\n**Is there competition from Big Meat?**\n\nAs of yet, no, in fact, the opposite. Everyone knows the story of how the auto industry has been trying to crush or minimise electric cars for the last hundred years and are only recently and extremely reluctantly developing their own.\n\nNot so with the meat industry, big players have instead invested directly into the growing new industry, could there be a greater approval than multi million investment, green lit by analysts and board, from the industry you intend to displace?\n\n[https://euromeatnews.com/Article-Tyson-Foods-announces-investment-in-clean-meat/697](https://euromeatnews.com/Article-Tyson-Foods-announces-investment-in-clean-meat/697)\n\nBig Players supporting the tech\n\nBill Gates, Richard Branson, Founder of Google, Richard Reed (innocent drinks)\n\n&amp;#x200B;\n\n**Optimistic speculation**\n\nCurrently the tech is in infancy and producing simple produce, however there is little perceivable upper limit for the technology, want a perfect Wagyu steak for half the price of a real cheap offcut? Achievable. Exotic blends of Quail and Puffin? Why not. A Woodpecker steak the size of a small child? Let me get the extra large vat ready. As with most technologies the upper ceiling is a considerable distance away, but with the number of competitors and roughly 250 million of funding in 2020 alone, the rate of progress is blistering. It's just a matter of time.\n\n&amp;#x200B;\n\n**Problems**\n\nIck factor.\n\nSolution = Used to be 'Lab Grown Meat.' Now it's being labelled as 'Clean Meat.' Currently 99.99% of budget is spent on R&amp;D and funding as it should be. As they begin to come to market more will be spent on marketing, outreach etc...\n\nPersonally everyone I've talked to starts with the ick reaction, then shortly after admits they'd try it, then after debating the 'important points' believes in it's inevitability.\n\nCriticism of carbon footprint = solved by intentionally linking up with renewable energy sources. Vast majority of companies are in it to solve the environmental problem and will make these moves.\n\n&amp;#x200B;\n\n**The Stock**\n\n**Agronomics - ANIC**\n\nhttps://agronomics.im/\n\nAs of this post bouncing to around 28,50GBX on the London Stock Exchange.\nThis is the only method a retail investor can get into the scene, will provide shareholders with exposure to a concentrated portfolio of companies in this area. In laymans it is like a lab grown meat etf. \n\n&amp;#x200B;\n\n**Current Weighting**\n\nLinks to each company here:\nhttps://agronomics.im/portfolio/\n\n**22.67% BlueNalu**, Inc, '**Cellular Aquaculture**' Fish stocks are dwindling and riddled with mercury and various extra toxins, not to mention the huge press and documentary situation lately on overfishing etc...  Solves all of these problems. BlueNalu is currently one of the most promising of the bunch, aiming to release cultured fish to the market by the end of the year.\n\n11.55% Meatable BV, focusing on cultivated beef and pork\n\n10.53% Other alternative protein investments \n\nShiok Meats, developing cultured seafood with a focus on shrimp.\n\nOritain, data science to prevent fraud in food supply chains.\n\nLegenDairy Foods, creating real, non cruelty dairy using fermentation techniques\n\nGALY, producing cotton grown in a lab\n\nBond Pet Foods, Plant based and Cultured pet food\n\n9.71% Solar Foods Oy, growing protein using a similar method to yeast to create protein powder, ultra low cost\n\n8.70% Cash balances\t\n \n7.92% Foods United, rebranded as LiveKindly, focusing on plant-based chicken\n\n7.92% Tropic Biosciences UK Limited, Using CRISPR and other techniques to produce high performing varieties of tropical crops \n\n6.60% Vitrolabs Inc, Lab grown leather.\n\n5.67% Mosa Meats B.V., working on cultured beef burgers\n\n5.28% Supermeat the Essence of Meat, cultured chicken, available in a restauraunt in Tel Aviv\n\n3.45% Legacy portfolio\t \n\n&amp;#x200B;\n\n**Big Players in Agronomics**\n\nRichard Reed - Chairman = Might know him as the founder of Innocent Drinks, Europes largest and most environmentally sustainable juice company, sold for $600m, now focuses on VC, finding and helping early stage consumer goods companies. Working on Graze, Deliveroo and Tails.\n\t- Taking consumer goods companies and turning them into global successes is like breathing to this guy.\n\nJim Mellon - Non Executive Director = Oxford grad billionaire investor, a true believer.\n\t- Truly believes in the tech and direction, huge resources to push these companies forwards and make it a reality. Has been consistently right for decades. One of the first to see the potential of SIlicon Valley.\n \"You can play with the samples in the lab, it will be a very short amount of time till we see these products dispersed.\"\n\n&amp;#x200B;\n\n**End Notes**\n\nIf that wasn't enough, here's a quote from Winston 'fucking' Churchill\n\n“\\[w\\]e shall escape the absurdity of growing a whole chicken in order to eat the breast or wing, by growing these parts separately under a suitable medium”.\n\n[https://www.nationalchurchillmuseum.org/fifty-years-hence.html](https://www.nationalchurchillmuseum.org/fifty-years-hence.html)\n\n&amp;#x200B;\n\nWhat does it taste like?\nThe chicken tastes like Chicken apparently. The beef tastes like beef. I'm done with links, google it you lazy apes.\n\n&amp;#x200B;\n\nFinal note: This is a long term speculative tech play that if you agree with the above is the equivalent to being able to buy a piece of almost all silicon valley companies back in 2001\n\n&amp;#x200B;\n\ntldr; we can make burgers like we make beer, buy ANIC for $$$ and no ouch for cow",
        "subreddit": "wallstreetbets",
        "title": "Clean Meat is at the brink of revolutionising the livestock and fishing industries, expected to hit the market this year. How to get in as a dirty retailer.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n3cfag/clean_meat_is_at_the_brink_of_revolutionising_the/",
        "created": 1620008478.0
    },
    {
        "author": "akapana11",
        "created_utc": 1619928205,
        "id": "n2yo1s",
        "num_comments": 98,
        "num_crossposts": 0,
        "selftext": "Does any have advice regarding stocks like Lenovo, [JD.com](https://JD.com), Baidu, Alibaba, etc? It's not that I think that China is a bad country; however, I am a little worried about the current geopolitical atmosphere in the country. I made a quick video explaining my opinion, just wondering if anyone else feels the same.\n\nPlease not hate speech. I just want people's honest opinion of the stock market in China :)\n\n[https://www.youtube.com/watch?v=uWy2TFGeBJ8&amp;t=635s](https://www.youtube.com/watch?v=uWy2TFGeBJ8&amp;t=635s)",
        "subreddit": "investing",
        "title": "Should I have sold my Chinese stocks?",
        "url": "https://www.reddit.com/r/investing/comments/n2yo1s/should_i_have_sold_my_chinese_stocks/",
        "created": 1619957005.0
    },
    {
        "author": "jab116",
        "created_utc": 1619871730,
        "id": "n2hatk",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Ticker: ABML\n\nJon Najarian is both an investor in and advisor to ABML (though he is not on the board).\n\n[Watch the interview with COO Menka Sethi here](https://m.youtube.com/watch?v=CcMQsD_yA3w)\n\n[Watch the interview with CTO Ryan Melsert here](https://m.youtube.com/watch?v=MWwQ1ea7sKk)\n\n\n—————————————————————\n\nBest Price To Get In: Under $2\n\nUpcoming Catalysts;\n\n- Uplisting to NASDAQ submitted/ approval pending\n\n- ABML will be attending Wall Street Conference with Jon this week (invitation only venture capital conference)\n\n- Building permit approval on 5/12",
        "subreddit": "pennystocks",
        "title": "Jon Najarian of CNBC interview with ABML COO Menka Sethi and CTO Ryan Melsert",
        "url": "https://www.reddit.com/r/pennystocks/comments/n2hatk/jon_najarian_of_cnbc_interview_with_abml_coo/",
        "created": 1619900530.0
    },
    {
        "author": "str8nobull",
        "created_utc": 1619907635,
        "id": "n2szs7",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": " \n\n(Ask 0.13, Market Cap $11.08M)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nTicker: MLCL on CSE (canadian securities exchange)\n\nSome acronyms I'm going to use:\n\nSKU - Stock keeping Unit, in layman's terms a barcode in a store's system\n\nOCS - Ontario Cannabis store\n\nSQDC - Société québécoise du cannabis (Quebec’s equivalent of the OCS)\n\nAGM - Annual General Meeting\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nReferences \n\n1) Molecule’s website\n\n[https://www.molecule.ca/](https://www.molecule.ca/) \n\n2) Molecule’s Q1 report 2021\n\n[https://siteassets.pagecloud.com/molecule-8291/Molecule\\_Presentation\\_-\\_Q1\\_2021\\_v13.1-k4cd4.pdf](https://siteassets.pagecloud.com/molecule-8291/Molecule_Presentation_-_Q1_2021_v13.1-k4cd4.pdf) \n\n3) Pictures of the drinks contained in the first shipment (April 28, 2021)\n\n[https://www.newsfilecorp.com/release/82059](https://www.newsfilecorp.com/release/82059)\n\n4) Agoracom video (Jan 28, 2021): interview with CEO Phil Waddington\n\nsee google doc for link\n\n5) Agoracom video (March 11th, 2021): interview with Director and Strategic Advisor David Reingold\n\nsee google doc for link\n\n6) Canadian Cannabis sales 2020 report\n\n[https://mjbizdaily.com/canadian-cannabis-edibles-sales-top-ca100-million-in-first-year/amp/](https://mjbizdaily.com/canadian-cannabis-edibles-sales-top-ca100-million-in-first-year/amp/) \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nGreetings,  MLCL's annual general meeting was yesterday; here's my summary of what I know about the company, its production facility, its leaders, their products, business model, etc.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nFirst: What they do.\n\nThey're a startup that finished construction of their production facility in 2019, and are just beginning to supply products. They make Craft Cannabis beverages (think craft beer but with THC/CBD or some mix thereof in place of alcohol).\n\nThey've just supplied their first shipment to OCS of 21,000 cans (5 flavors) which equates to 8 cans per store per flavor as of yesterday (April 30th, 2021), which is going to be followed up by a 80,000 can shipment later this week. We can expect to see OCS display these SKU’s on their website sometime early May. \n\nPictures of the drinks/news release (See Reference 3)\n\n2 of those brands are Molecule’s own: Sofa (previously 52 Saturdays), and KLON. The other flavors are from their clients whom they have 3 year contracts with, to can the beverages. (See Reference 2, Slide 20).\n\nMolecule has 11 SKU’s accepted by the OCS, and 2 SKU’s accepted by SQDC. They anticipate supplying 20,000 units per beverage per month, and they anticipate that number to scale with the growing number of Cannabis stores. (See Reference 5, 5:45 - 6:52)\n\nNotes from AGM: They are in negotiations with a Quebec partner to help them with a license to supply drinks to SQDC.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nSecond: The Facility\n\nLocation: 591 Reynold's Road Lansdowne, ON K0E 1L0, right beside the 401 being equidistant from Canada’s 3 largest consumer bases Toronto, Montreal, &amp; Ottawa (See Reference 2, Slide 13)\n\nSize: 14,000 Square feet, within the 200,000 Square foot licenced lot (See Reference 4, 20:15 - 21:00)\n\nProduction Capacity: Currently 1 production line running at half capacity, Yearly capacity at this rate is 6 Million Cans per year. The facility has space for another production line that can be put in at very little financial expense. Meaning Molecule can provide up to 24 Million Cans per year (20 Million Cans if anticipated inefficiencies of running at max capacity are taken into account) at very little extra cost. It is anticipated OCS will require the current run rate of 6 Million Cans per year (See Reference 4, 11:47 - 13:00). This facility is anticipated to be able to supply eastern Ontario and Quebec, supplying out west will first be tested with shipping and then potentially expanding making another facility to supply the west with the drinks (See Reference 4, 14:20 - 15:11).\n\nSupply chain: Molecule anticipates no bottleneck of their ability to produce beverages from the aluminum shortage, as they anticipate having 1.3 Million total cans by the end of May delivered to them in separate shipments (Source: Personal notes from AGM).\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nThird: The Business Model\n\nMolecule employs food scientists to help their clients (small beverage producers) develop their own unique craft flavor and then supply those flavors to the market, as of today they have just over 100 flavors available to them, and have the privilege of choosing which companies they want to work with. \n\nCompanies that are interested in creating a flavor will employ their beverage team to help them create a flavor (See Reference 5, 4:30 - 6:52) most notably Rebecca Griffen and Dr. Amy Proulx (See leaders below).\n\nProjected profits: (See Reference 2, Slide 18) if Molecule operates at 1/4th of its total capacity is it is project to go from $402,000 in Profit $3,483,000 in Revenue in Q1 to $5,150,000 in Profit, $23,220,000 in Revenue by the end of 2021.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nFourth: Leaders (See Reference 2, Slides 22 &amp; 23)\n\nCEO: Phillip Waddington (See Reference 4, 21:05 - 22:25)\n\nEducation: \n\nNaturopathic Doctor (ND), MBA\n\nResume: \n\nWorked as a ND, and worked with Health Canada Director General of the Natural Health Products Directorate (2000-2008) writing the regulations for natural health products\n\nWas on the board of directors of Aphria Inc. 2014 - 2018 (TSX: APHA, Ask 18.88) another Cannabis company.\n\nCurrently also the director of the Canadian Homeopathic Pharmaceutical Association.\n\nCo-Founder, Chairman of the board: André Audet\n\nResume:\n\nwas the Founder of Tetra-Biopharma (TSX-V: TBP, Ask 0.41) and the Co-Founder of North Bud Farms (CSE: NBUD, Ask 0.05)\n\nRebecca Griffin, Chief Food Scientist\n\nResume:\n\nCreated the world’s most awarded alcohol-free beer\n\nTwo time Gold Medalist, one time Silver Medalist, two time Bronze Medalist at the non-alcoholic beer US open\n\nExperience at 30 companies, guiding products from an Idea to production\n\nDr. Amy Proulx, Co-Founder\n\nResume:\n\nSupported over 100 industry partners on innovation and technology readiness through the national Canadian Food and Wine Institute Innovation Centre.\n\nPreviously a Professor and academic program coordinator for Culinary Innovation and food Technology at Niagara College\n\nDavid Reingold, Director and strategic Advisor\n\nResume:\n\n25 years of brand building experience, first building the Natural Life brand under the DMR food corporation umbrella along with My Organic Baby, Canada’s first full line of organic baby food\n\nCurrently, David is a Principal with Roar Beverages Canada\n\nLindsay Weatherdon, Director\n\nResume:\n\nCurrently President of Concord National Ontario &amp; Quebec Divisions; one of Canada’s leading Consumer Packaged Goods sales &amp; marketing agencies, as well as President of Braille Energy Systems (TSX-V: BES, Ask 0.54)\n\nDiverse background in global sales, holding executive positions in the hard goods and manufacturing sector and developing retail strategies across large box and warehouse club formats\n\nBrad Stewart, Co-Founder, Chief Marketing Officer\n\nResume:\n\nFormerly the Cannabis Marketing columnist for Mediapost in New York City\n\nPreviously, he was a strategist for political campaigns, digital platforms and public affairs\n\nExperience marketing across different industries, including wine and spirit making, software and social media\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nOther Research\n\nQuote from quarterly earnings report from the OCS (See Reference 6)\n\n‘Thomas suggested that the beverage category, currently languishing with a tiny share of the market, is being held back by a lack of selection.\n\nBeverages “don’t have much variety and availability yet, and I do think it is variety that will push the category. We’re still early on,” she said.’\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nTLDR: \n\nThey make Craft Cannabis beverages (think craft beer but with THC/CBD or some mix thereof in place of alcohol), including both their own two brands (Sofa, and KLON), and the brands of small companies that employ their services.\n\nThey Have excellent management.\n\nIf Molecule operates at 1/4th of its total capacity is it is project to go from $402,000 in Profit $3,483,000 in Revenue in Q1 to $5,150,000 in Profit, $23,220,000 in Revenue by the end of 2021, and 1/4th of its capacity is going to be accounted for with only their sales to OCS.\n\nMolecule is going to be providing the much needed selection, to the beverage sector of the cannabis industry.\n\nWith this DD I provide no guarantee of profits, nor is this financial advice.\n\n📷",
        "subreddit": "pennystocks",
        "title": "Molecule Holdings DD (Cannabis Craft Beverages)",
        "url": "https://www.reddit.com/r/pennystocks/comments/n2szs7/molecule_holdings_dd_cannabis_craft_beverages/",
        "created": 1619936435.0
    },
    {
        "author": "benkyo_benkyo",
        "created_utc": 1619945666,
        "id": "n32gkz",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Fellow Apes\n\nI present to you the stock that'll fulfill all your desires. The stock that your wife's bf is gonna be talking about in a few months.\n\nWhat do apes love. Answer - Multi bagger tendies/Bunch of Bananas.\n\nWhat do apes hate. Answer - Gay Bears and Short sellers.\n\nWant something that hits both - No fear, RIDE is here!\n\nHere are the updates and buildup from the previous DDs, found [here](https://www.reddit.com/r/wallstreetbets/comments/mkt7qi/the_bullcase_for_lordstown_motors_corporation/), [here](https://www.reddit.com/r/wallstreetbets/comments/m9d6ls/a_firstclass_ticket_to_the_moon_with_lordstown/) and [here](https://www.reddit.com/r/wallstreetbets/comments/mma558/hitch_a_ride_to_the_moon_technical_analysis_of/).\n\n**Betas on Track -** Lordstown have been producing betas and [showing](https://twitter.com/EastlakeOf/status/1386867929904566272) them off to city managers and partner companies. [Here](https://lordstownmotors.com/pages/betas-on-track) are 6 wrapped which look so cool. We know of 3 more betas appeared in public. Here's [one](https://www.reddit.com/r/lordstownmotors/comments/mhow87/beta_number_3_looks_like_our_boy_joe_burrow_is/) for Joe Burrow, [one](https://twitter.com/LordstownMotors/status/1388201097467158536) for ESPN Cleveland football event and [one](https://www.reddit.com/r/lordstownmotors/comments/mqr19a/san_felipe/) was used in San Felipe 250. Several others are reported to be in transit for crash and safety testing and readying for road approval.\n\n**Hub Motors -** Several concerns were raised about the structural integrity of hub motors. Their [operation](https://twitter.com/LordstownMotors/status/1384124047286423558) in San Felipe 250, one of the toughest terrain in the world, proves their ecological usability. During the race, the truck was cruising between 25-40 mph and shortly afterwards on the highway at 65-80 mph. Btw here [one](https://www.youtube.com/watch?v=al_NZHnuu0g) video showing how cool the hub motors are!\n\n**Valuation -** The stock is massively undervalued at \\~$1.75B. Its factory is worth more than \\~$3B alone with &gt;$600M in cash. Like seriously, even Nikola's valuation is right now higher than RIDE @ $4.75B. RIDE's valuation at full production capacity would be upwards of atleast $10B easy. Oh and yes they have partnership with Camping world with potential Electric RV coming in the summer. Camping World's CEO [tweets](https://twitter.com/marcuslemonis/status/1379433681995984905?s=20) this teaser.\n\n**Short Interest and Squeeze Potential -** Short interest on 4/15 was 26.6M shares. The public float is 99.48M. So almost 27% shorted by 4/15. But wait. The shares borrow rate fees went up from 3% to 26% from 4/15 to 4/23 and is 13.6% as of 4/30. Also shares available for shorting were reported to extremely low between 4/15 and 4/22 meaning even more shares were shorted after 4/15, so potentially even high short interest as of now. The volume has declined in the past few days to 1-2M from average of 7-8M. See where I am going with this. A sudden jolt would send this soaring high. Available short shares data [here](https://iborrowdesk.com/report/RIDE).\n\n**Refute to Short Report -** Maybe the short report had credibility, maybe not. Who knows. But looking at the timeline, Lordstown has delivered what they said about betas/San Felipe and still maintain Sept production date which I think they might achieve looking at the progress. Soon they are gonna be announcing actual binding fleet orders and it will send the stock soaring before we'll even realize since that's the thing that matters. Nate Anderson of Hindenburg has been [tweeting](https://twitter.com/ClarityToast/status/1388160831762964488) everything RIDE does in a negative way and with factual errors. It now looks like to me as they are just trying too hard to maintain the narrative and justify what they did to make sure this fails. It just seems too fishy. Like if you know what you did was correct why the need to justify and repress unnecessarily.\n\n**Conclusion -** In monke language -\n\nOrders announced, bunch of bananas. Production starts, even more bananas. After two years, your own banana farm on which you can live with the wife and her bf and still have enough bananas without gay bears around.\n\n**Disclosure -** Just some opinions based on current knowledge. Data taken from NASDAQ and Iborrowdesk. Have long position bought after the short report and buying more with catalysts. Please excuse for grammatical errors.",
        "subreddit": "Wallstreetbetsnew",
        "title": "RIDE - The stock of your and your wife's bf dreams.",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/n32gkz/ride_the_stock_of_your_and_your_wifes_bf_dreams/",
        "created": 1619974466.0
    },
    {
        "author": "EnduredMarkets",
        "created_utc": 1619935276,
        "id": "n30b1e",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "InvestmentClub",
        "title": "Visa Inc. (V) Valuation Report",
        "url": "/r/Valuation/comments/n3078k/visa_inc_v_valuation_report/",
        "created": 1619964076.0
    },
    {
        "author": "bgates275",
        "created_utc": 1619911555,
        "id": "n2u6r2",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "So, I was trying to judge which one suited me the best, and started filling out the applications. I had selected a card, and all of the details. It showed it at the top. \n\nBut then the next screen, it's showing Aventura Visa Infinite Privilge as the selection. \n\nReading some of the fine print, the were like 'If you arn't eligible for this one, we will offer you this one, and if not this one, then this one, etc.' \n\nSo I guess the question I have, is whether I even have a choice, or whether it's going to choose one for me.",
        "subreddit": "CanadianInvestor",
        "title": "Question about CIBC credit cards",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/n2u6r2/question_about_cibc_credit_cards/",
        "created": 1619940355.0
    },
    {
        "author": "SerialMasticator",
        "created_utc": 1619908177,
        "id": "n2t5nq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Here are some of the Fundamentals of ETH for those who maybe new and see comments saying “it’s easy to hodl when you understand the fundamentals of ETH”. \n\n• Ethereum is the blockchain that has the most developers using it’s smart contracts and blockchain. \n\n• High fees demonstrates the huge demand and therefore scarcity of Ethereum block space. \n\n• EIP1559 will introduce more predictable fees and will allow users to not have to “outbid” each other for block space. Thus limiting the amount of wasted ETH on gas. \n\n• EIP1559 brings in fee burning which may reduce the amount of ETH in circulation. \n\n• Proof of Work &amp;gt; Proof of Stake merge will make Ethereum much more environmentally friendly and reduce the amount of electricity required to validate transactions. It will also require less hardware cost to become a validator. Making Staking much more accessible to the wider community. \n\n• Proof of Stake will make Ethereum the most decentralised blockchain as more people will opt into become a validator. There is currently 4 million ETH locked into the beacon chain. \n\n• Sharding as part of the ETH 2.0 upgrade will increase transactions per second by a factor of 64. There will be 64 Ethereum chains running in parallel with each other. \n\n• ETH may come deflationary. One of the biggest “flaws” that people currently slander Ethereum for is the fact that inflation is about 4% per year and that there is an infinite supply of ETH. With ETH 2.0 and EIP1559, there may be a deflationary supply. \n\n• ETH deflationary? Well, validators of the blockchain will be staking 32 ETH each. There is likely to be ~25% apy after the merge for validators. They are earning ~8% apy now. This is before they get fee bomuses which are currently being paid to miners. This will attract many more validators. There are already 4 million ETH locked up, not freely available to the market. Add on top of this the fee burning from EIP1559 and all the ETH locked in DeFi then you are left with a hugely reduced supply of ETH on the free market. This will make it a very scarce asset. Scarcity leads to demand which leads to a higher premium on the under lying asset. \n\n• Worlds first Triple Point Asset. ETH could easily become a store of value in the long term. ETH as a bond. Stakers of ETH will be paid dividends in ETH for validating transactions on the network. ETH is a commodity. A small (at the moment quite large) amount of ETH is required to make a transaction on the main chain. \n\n• Layer 2 scaling solutions. We now have Polygon leading the way for scaling Ethereum. Allowing the same benefits of the Ethereum blockchain but in a way that highly reduces gas fees. There are many more to come over the next few months including; ZKrollups, Optimistic roll ups and other side chains. \n\n• The huge number of transactions being settled on ETH.\n\n• Mainstream adoption of the network (eg. Visa settlement and European Investment Bank bond issue).\n\n• Total value locked in ETH I’m DeFi/smart contracts and NFTs. The existing value is unlikely to move and network effect attracts more value/transactions.",
        "subreddit": "StockMarket",
        "title": "TLDR - The Fundamentals of ETH in 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/n2t5nq/tldr_the_fundamentals_of_eth_in_2021/",
        "created": 1619936977.0
    },
    {
        "author": "jab116",
        "created_utc": 1619871730,
        "id": "n2hatk",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "Ticker: ABML\n\nJon Najarian is both an investor in and advisor to ABML (though he is not on the board).\n\n[Watch the interview with COO Menka Sethi here](https://m.youtube.com/watch?v=CcMQsD_yA3w)\n\n[Watch the interview with CTO Ryan Melsert here](https://m.youtube.com/watch?v=MWwQ1ea7sKk)\n\n\n—————————————————————\n\nBest Price To Get In: Under $2\n\nUpcoming Catalysts;\n\n- Uplisting to NASDAQ submitted/ approval pending\n\n- ABML will be attending Wall Street Conference with Jon this week (invitation only venture capital conference)\n\n- Building permit approval on 5/12",
        "subreddit": "pennystocks",
        "title": "Jon Najarian of CNBC interview with ABML COO Menka Sethi and CTO Ryan Melsert",
        "url": "https://www.reddit.com/r/pennystocks/comments/n2hatk/jon_najarian_of_cnbc_interview_with_abml_coo/",
        "created": 1619900530.0
    }
]