[
    {
        "author": "NrdRage",
        "created_utc": 1619813006,
        "id": "n225dj",
        "num_comments": 313,
        "num_crossposts": 0,
        "selftext": "As I've talked about rotating my fun portfolio in honor of \"Sell in May and go away\" month and how I typically transition my holdings from a fuck ton of longs and only a couple of shorts to 15 longs and 35 companies I look to short until liquidity returns back to the market, a lot of people have been asking me what those are - particularly the 15.  So, one time only, I'll go ahead and reveal my watch list for the month and, if I feel it's relevant/not already covered by a DD, any positions I might already have.  Stop asking.\n\n&amp;#x200B;\n\n# My long list (both established positions and sentiment/momentum trades I'll make):\n\n&amp;#x200B;\n\n1. $CLNE (Positions established; look at DD)\n2. $MA\n3. $BABA (Positions established; look at DD)\n4. $BE (Positions established; look at DD)\n5. $CAT (Positions re-established today in fact - July 230c's that I timed perfectly)\n6. $EXPE\n7. $AAPL\n8. $ALGN\n9. $PSFE (Positions established earlier)\n10. $CVX\n11. $ENPH (Positions established today)\n12. $TSCO (Positions established)\n13. $CAR (Positions established)\n14. $KMI\n15. $BB\n\n&amp;#x200B;\n\n# The Short watch list:\n\n&amp;#x200B;\n\nNote that, when it comes to shorting, I do a lot more scalping and very short term swing trading.  May is typically a month of low volume, so you have to be agile.  Puts are generally 2 steps out of the money at open.  Do your own DD.  This is also not a complete list, just a daily watch list of companies that I feel are going to fare roughly or whom have typically underperformed this time of year.  This is also not a short and hold list.  If you don't know what I'm saying, you should stay away from these.\n\n&amp;#x200B;\n\n1. $TSLA (Established today @ an average cost basis of $712.11)\n2. $UPST\n3. $TWTR (Established April 28th @ $66.08)\n4. CLOV (always good for an intraday scalp when the capuchins go full retard)\n5. $SPCE\n6. $PTON\n7. $TSM\n8. $BLNK\n9. $GS (Established yesterday)\n10. $PINS\n11. $BMBL\n12. $EGHT\n13. $MDB\n14. $PCG\n15. $DASH (Established Wednesday at 162.22)\n16. $GRUB (Established Wednesday at 70)\n17. $WORK\n18. $CAN\n19. $BYND\n20. $AFRM (Established Wednesday at $77.20)\n21. $COUR\n22. $HEP\n23. $CSCO\n24. $PLNT\n25. $QS\n26. $WMT\n27. $ADT\n28. $TW\n29. $RTX\n30. $COF\n31. $NOC\n32. $ADM\n33. $AAL\n34. $WHR\n35. $LUMN",
        "subreddit": "wallstreetbets",
        "title": "Because people keep asking: The NrdRage ETF, May Edition: From 🐂 to 🌈🐻because May is just the pre-funk to Pride Month",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n225dj/because_people_keep_asking_the_nrdrage_etf_may/",
        "created": 1619841806.0
    },
    {
        "author": "MiesKoira",
        "created_utc": 1619679309,
        "id": "n0yqv1",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "You guys were right - Nokia is the share to look out for on its way to the skies!\n\nI spent 10 years with the company, now off and not under any NDA or limit to trading, so I’m now happy to throw some money at the share.\n\nNokia results this morning show good growth and strong pick up in profitability! Beating the estimates with a comfortable margin. With the house cleaned from bad leadership and product transformation well on its way, I think there are a few benchmarks that support price doubling.\n\nBase business alone supports 50% up: Look at Ericsson: Although Nokia’s business is broader (I come to this why the real gem is there), at the heart is a business similar to Ericsson: 5G Networks. Ericsson trades at double the valuation. This should not be as customers, Operators, want to keep their vendors balanced to avoid paying massively more for their equipment and SW. This valuation gap will close as the roadmap gap has now been closed. Nokia is well ahead on future technologies such as Open RAN and Cloud RAN. \n\nIn addition to Ericsson, Nokia has a better licensing and patenting business being a stronger brand and getting all the patents from Alcatel-Lucent as well. Also in terms of 5G patents, the long term money maker, Nokia is well ahead. This business is basically revenue=profit, thus its key to keep in mind.\n\nThen there is the gem of the business: IP and Optical Networks. This is the crown jewel here, this part is always forgotten by analysts and investors. These guys are brilliant, top engineers and researchers sitting in Mountain View and Belgium, and as shown by the Q1 results, in a growth area. They make incredible products. Go and have a look at the valuation of Cisco (200B company), Juniper. Back? Good, these guys absolutely smoke both companies when it comes to technology alone. Have a look at Arista. Now Network Infrastructure division also provides similar dc networking equipment to the webscale companies like Apple and Microsoft. Arista alone is worth as much as whole Nokia, so there is massive upside here. The worst case is that this part is sold to a Private Equity investor, I know some are after it. This means maybe 10-15B valuation for it. Great, but I think this has potential for so much more. \n\nWhy it has underperformed: Bad management and badly managed merger with Alcatel lucent. Nokia was held back for years by really incompetent management - that management has now been cleaned out. How incompetent? Think hiring senior people based on private life matters…Think throwing half of your R&amp;D budget on a single customers request… New CEO, new Business Group presidents, transformation well under way (since 2,5 years in 5G), and potential in the share to double when executed right. And way beyond that thanks to that nice IP and Optical business. Think Cisco scale. \n\n\nExcited to see how the market takes to this today. The fundamentals are solid, and engineering competence is there, the results are coming in!!",
        "subreddit": "wallstreetbets",
        "title": "Reddit called it right - Nokia hype is real - Q1 results",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n0yqv1/reddit_called_it_right_nokia_hype_is_real_q1/",
        "created": 1619708109.0
    },
    {
        "author": "Economicz",
        "created_utc": 1617549382,
        "id": "mjy4tn",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "This is a research report written on the company **StrikeForce Technologies, Inc. (SFOR)**. This is my case for StrikeForce’s stock price reaching $4.10 by March 31, 2022. \n\n**StrikeForce's Patented Products:**\n\n**SafeVChat** is the industry's most secure video conferencing platform. With technologies such as patented out-of-band authentication and keystroke encryption. No other competitor in the industry can match SafeVchat's signature 5-Level security control approach. \n\n**PrivacyLok** is a proactive cyber security solution which locks down access to your personal and corporate data. PrivacyLok protects the following key areas that hackers exploit: camera, microphone, speakers, keyboard, clipboard, and screen.\n\n**ProtectID** is designed to deliver flexible &amp; affordable redundant authentication for banks, corporations, universities, government agencies, and social networking websites. ProtectID® can be managed on-premise or via our hosted cloud service.\n\n**GuardedID** protects you by encrypting your keystrokes when you bank, shop and email online. GuardedID’s Premium version will also protect your desktop applications such as MS Office, VPN clients &amp; IM programs.\n\n**MobileTrust** is the most advanced security suite for Apple &amp; Android mobile devices. MobileTrust® protects users’ internet browsing activity, login credentials, online transactions, access to corporate networks, and more. The MobileTrust® bundle includes six of the most powerful must-have security features in the industry.\n\n**Market:**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/n3kzbvxya6r61.jpg?width=624&amp;format=pjpg&amp;auto=webp&amp;s=fe783a34990de9ab35190a8895ca3c982230acf0\n\nThe market for video conferencing is growing exponentially and is here to stay. Even as the pandemic begins to slow down, people will continue to work from home. Companies are increasingly adopting work from home practices. Companies see the increase in employee morale, strong productivity, and decrease in overhead, among other benefits.\n\nAccording to Upwork, 41.8% of the American workforce continues to work remotely. Although an estimated 26.7% will still be working from home through 2021, 36.2 million Americans (22% of the workforce) will be working remotely by 2025. This is a **staggering 87% increase from the number of remote workers prior to the pandemic**! [https://www.flexjobs.com/blog/post/remote-work-statistics/#:\\~:text=Although%20an%20estimated%2026.7%25%20will,workers%20prior%20to%20the%20pandemic](https://www.flexjobs.com/blog/post/remote-work-statistics/#:~:text=Although%20an%20estimated%2026.7%25%20will,workers%20prior%20to%20the%20pandemic)!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/sfnki9m2b6r61.jpg?width=624&amp;format=pjpg&amp;auto=webp&amp;s=104fa766d2a2fc6de340968891145756fb9e783c\n\n\"A recent study by Deloitte and the Financial Services Information Sharing and Analysis Center found that financial services on average spend **10%** of their IT budgets on cybersecurity. That’s approximately **0.2% to 0.9%** of company revenue or **$1,300 to $3,000** spent per full time employee. For a bigger picture benchmark, consider that Microsoft CEO Satya Nadella recently revealed in a statement that the tech behemoth “will invest more than **$1 billion each year** in cybersecurity for the foreseeable future”. Finally, it’s worth noting that the 2019 U.S. President’s budget allocated **$15 billion** in spending on cybersecurity, about **0.3%** of the entire fiscal budget ($4.746 trillion).\" [https://cybersecurity.att.com/blogs/security-essentials/how-to-justify-your-cybersecurity-budget](https://cybersecurity.att.com/blogs/security-essentials/how-to-justify-your-cybersecurity-budget)\n\n\" **55% of enterprise executives plan to increase their cybersecurity budgets in 2021 and 51% are adding full-time cyber staff in 2021.** PwC found that most executives are planning to ramp up their cybersecurity spending in 2021 despite the majority of them, 64%, expecting business revenues to decline. PwC found that cybersecurity is more business-critical than ever before.\" [https://www.forbes.com/sites/louiscolumbus/2020/12/15/the-best-cybersecurity-predictions-for-2021-roundup/?sh=387b329d5e8c](https://www.forbes.com/sites/louiscolumbus/2020/12/15/the-best-cybersecurity-predictions-for-2021-roundup/?sh=387b329d5e8c)\n\n**\"Next-generation Identity and Access Management, messaging security and network security are the three hot spots of enterprise cybersecurity spending in 2021.** McKinsey sees three hot spots leading enterprise cybersecurity spending in 2021. These include Identity and Access Management, messaging and network security. McKinsey predicts perimeter and **endpoint security**, secured automation and security for trusted third parties. The following graphic compares cybersecurity spending by technology and organization.\" McKinsey and Company, COVID-19 crisis shifts cybersecurity priorities and budget, July 21, 2020\n\n**Competitors:**\n\nZoom Video Communications, Microsoft Teams, Webex by Cisco, GoToMeeting by LogMeIn, BlueJeans by Verizon. \n\nAlthough StrikeForce has many competitors, there is a major difference between these products. The other video conferencing solutions were not built from the ground up with cybersecurity in mind. Cyber security is critical in today's interconnected world. You have all heard about the latest Zoom breaches in which hackers exploited video conferences and stole nonpublic confidential information from corporations. They are also hacking video conferences and displaying pornographic images and other illegal activity. This is happening all across these companies because their video conferencing platforms are not fully locked down with the proper cyber security products. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/5scqbai3b6r61.jpg?width=1273&amp;format=pjpg&amp;auto=webp&amp;s=6452bbe07730e2c8443670cb8373819c25badf2e\n\n**Catalysts for StrikeForce Technologies, Inc. (SFOR):**\n\n\\- In the process of securing $5-10MM of debt, not toxic convertible debt that will dilute shareholders. This will be strictly debt, no equity. \n\n\\- Very close to upgrading SafeVChat to include contact import, room breakouts, and screen recording. There are very large clients talking closely with StrikeForce and waiting to sign up when these features are added. \n\n\\- Already signed up hundreds of companies. This revenue will be reflected on the Q2 financials and beyond. StrikeForce started requiring payment in March as the major testing phase completed. \n\n\\- Eliminated $900M of variable convertible debt. **ALL toxic convertible debt has been eliminated**. \n\n\\- Is the only video conferencing product designed with 5-Level security. Available on both Android and IOS.\n\n\\- Reduced Authorized Shares from 14 billion to 4 billion.\n\n\\- “StrikeForce is now in the process of also **applying for the OTCQB, and hopefully sometime this year uplifting to the NASDAQ**. This is something that we have been planning for quite a while now, and giving our new game-changing products we have very high expectations for this year,” says Kay.\"\n\n\\- Zoom breaches will thrust the importance of cyber security integrated with video conferencing into the spotlight. Companies will increasingly search for a more secure solution.\n\n\\- **Kevin O'Leary (Mr. Wonderful from Shark Tank)** recently mentioned StrikeForce on CNBC when talking about video conferencing companies. \n\n\\- “With countless reports of ‘Zoom bombings’ and other video conferencing-related cyber-attacks, the launch of this new service comes at a crucial juncture where we’ve grown more dependent than we could have imagined on these unsecure platforms,” said **Steve Cooper, former CIO, U.S. Department of Commerce, the Federal Aviation Administration, the U.S. Department of Homeland Security, and Advisory Board Chairman for StrikeForce**. “Video conferencing is here to stay, and SafeVchat offers a secure option that will become an essential tool for any organization looking to confidently keep both their own, and their customer data safe while maintaining complete compliance.”\n\n**Financial Projections &amp; Stock Price Analysis:**\n\nAs of closing on 04/01/2021 - OTCMarkets Website\n\nStock Price: $.1049\n\nOutstanding Shares: 807,277,505\n\nMarket Cap: $84,683,410\n\n&amp;#x200B;\n\nhttps://preview.redd.it/7jymn3f4b6r61.jpg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=2a839c8477a35f84c19b135b4ab18ebf23159e02\n\n[https://www.youtube.com/watch?v=JXA13M0Fnl8&amp;t=892s](https://www.youtube.com/watch?v=JXA13M0Fnl8&amp;t=892s)\n\nTo establish the following price target I took the grand total projected revenue of $12,475,000 and divided by the trailing 12 month revenue of $319,190. That gave me a multiplier which I used for the closing price as of 04/01/2021 which was $0.1049.\n\n**2021 Price Target: ($12,475,000 / $319,190) x $0.1049 =**  **$4.10.** \n\n**Disclaimer:**\n\nI am long SFOR and this research report is not a recommendation to buy or sell StrikeForce Technologies, Inc. This is my research and conclusion on the future of this stock. I wanted to share with everyone. I will continue to keep everyone updated on this stock. If you would like me to continue posting research reports for other stocks, please let me know. I wish you all well in your investing and trading!\n\n**Website Links:**\n\n[**https://www.strikeforcetech.com/**](https://www.strikeforcetech.com/)\n\n[**https://www.safevchat.com/**](https://www.safevchat.com/)\n\n[**https://www.privacylok.com/**](https://www.privacylok.com/)",
        "subreddit": "pennystocks",
        "title": "The Case for StrikeForce Technologies (SFOR) - $4.10 by end of March 31, 2022",
        "url": "https://www.reddit.com/r/pennystocks/comments/mjy4tn/the_case_for_strikeforce_technologies_sfor_410_by/",
        "created": 1617578182.0
    },
    {
        "author": "Playing_One_Handed",
        "created_utc": 1618859098,
        "id": "mu7wog",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "The sector Palantir &amp; Alteryx find themselves in is expected to have huge growth regardless. While Palantir is the sexy, controversial, stock we all know. You want to know about this... nice... stock. \n\nA leader in analytic process automation (APA™) that automates analytics, data science and processes to accelerate business outcomes. \n\nBig clients who swear by it: Hyundai, Chick-fil-a, Barnes &amp; Noble, Cisco, Carnival cruise, Chevron, and Coca Cola - to name a few. \n\n[first quarter 2021 financial results after the U.S. financial markets close on Tuesday, May 4, 2021.](https://finance.yahoo.com/news/alteryx-announces-date-first-quarter-200500424.html)  \n\n\n|Market Cap|5.76B|\n|:-|:-|\n|2019 Total Revenue|417.91M|\n|2019 Gross Profit|378.76M|\n|2019 Operating Income|37.98M|\n|2019 Net Income|27.14M|\n|2019 Total Assets|1.34B|\n|2019 Total Liabilities|917.43M|\n|2019 Total Equity|424.91M|\n|% of Float Shorted|8.37%|\n\nThis is actually a profitable company unlike Palantir. To compare, Palantir is a 40B Mcap. \n\nIt's expected to smash it's very low estimates. It has the last 3 times. \n\nhttps://preview.redd.it/kcqfnknc96u61.png?width=312&amp;format=png&amp;auto=webp&amp;s=57d3c07178743863a0e67ae3c1111f5c80ec7e26\n\nAnalysists have given the stock high estimates. \n\nhttps://preview.redd.it/9djhjmpw66u61.png?width=637&amp;format=png&amp;auto=webp&amp;s=e72c78d1f8d2185e7c0222e305e41b3377d94d73\n\nThe stock is down like some lesser known SaaS stocks. However, it's lagging behind recovery. \n\nTo compares analysis estimates: Palantir +14.36%, \n\nhttps://preview.redd.it/fjsshc1gb6u61.png?width=728&amp;format=png&amp;auto=webp&amp;s=cecd62c86b292f4e45c67dbf4cb30829d40f580b\n\nThe stock saw an insane increase of activity from insider trading, hedge funds, and general volume in the last quarter. \n\nWhile we don't like hedge funds, it's odd to see this volume of buy without much selling - especially as it's dipping. \n\n  \nQ: **Why is this a post lockdown player?**\n\nA: The tool was sold to lodes of companies trying to better themselves. Carnival cruise bought it when there weren't any cruises. Ceazers bought it when no one was gambling. Chevron USA when oil hit all time low. These companies are now imbedded to the service. \n\nQ: **Why don't companies do these things in house?**\n\nA: The training, and learning, is free. In-house teams can learn this and join the community for free. In-house teams want this instead of trying to build there own.\n\nQ: Why is May special?\n\nA:  Annual conference, Inspire, will take place May 18-21 “**This year, we will announce major innovations across analytics automation, data science, machine learning and AI and the Alteryx Community platform**.” \n\n&amp;#x200B;\n\nPosition: 30 stocks average at 80 ($2,400)",
        "subreddit": "wallstreetbets",
        "title": "Quick DD - Alteryx (AYX) - The less sexy Palantir for Business. Events in May.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mu7wog/quick_dd_alteryx_ayx_the_less_sexy_palantir_for/",
        "created": 1618887898.0
    },
    {
        "author": "Go48memes",
        "created_utc": 1617804909,
        "id": "mm31f1",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "I have not seen a single post on DMYI merging with IONQ the first pure quantum company on the market, which makes this a great opportunity\n\nSome of you may have heard about quantum computing before, for those of you who have not, here's the short story.\n\n&amp;#x200B;\n\nQuantum computing is a truly insane technology. They can be used to do computations like a regular computer can but instead of using bits that are 0 and 1 they use qubits that can be 0 and 1 at the SAME time.\n\n# What effects does this have:\n\nLet's say you have a problem  8 possible solutions, this can be represented with 3 bits (2\\^3  = 8 -&gt; 8 different combinations)\n\n001\n\n010\n\n100\n\n...\n\nThose are all possible solutions to the problem, with a regular computer you would have to check each solution and perform the necessary calculations, so it would take 8 calculations.\n\nWith a quantum computer this problem can be represented with 3 QUBITS, and since qubits can be both 0 and 1 at  the same time you only need 1 calculation !!!! Every possible combination can be made with just one calculation!!!!!!\n\nNow what if a problem is represented with 32 bits? 2\\^32 =\\~ 4 billion, It would take 4 billion calculations to find a solution to this problem, now with a quantum computer you would need a computer with 32 qubits and it needs to make just ONE calculation! It can blow any regular computer out of the water.\n\nQubits give exponential growth where bits give linear growth in calculations.\n\nAll machine learning, path finding, ... will move to quantum computers because it is vastly better. Medical companies can do protein folding efficiently which takes years on todays hardware and make new medicine, the options are infinite\n\n&amp;#x200B;\n\nA picture for normies:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9l3q47szerr61.png?width=2400&amp;format=png&amp;auto=webp&amp;s=737ac89950707391f91da087e7fa0895e39dd514\n\n# --------------------------------------------------------\n\n# History\n\nQuantum computing started in the 80s and has taken a long way to develop, but recently it has started to pick up.\n\ngoogle and IBM have done alot of research in the space, cloud hosting companies are starting to host quantum computers in their clouds and last year google achieved quantum supremacy (which means it has done a calculation in just a few days that would take a regular computer a millenia)\n\nBecause of the reasons I have just laid out I believe we will see a quantum bubble in a few short years, the background is similar to \\[BLUCK\\] \\[CHAIN\\] and the internet -&gt; a complex technology with unlimited potential.\n\n&amp;#x200B;\n\n# How to profit: IONQ merging with  DMYI -&gt; Buy DMYI\n\nUp until shortly there was no pure quantum computing stock you could invest in but that is now changing.\n\n* They are merging with DMYI which is still listed at only 10$\n\nIONQ is a pure quantum computing company, they produce quantum computers and are industry leaders.\n\n* The VP of software is the leader of the quantum team at google that achieved quantum supremacy.\n* In 2020 they announced a 32-qubit quantum computer which is the currently the most powerful quantum computer.\n* Amazon and Microsoft cloud hosting business both have partnered with IONQ to deploy their quantum computers\n* Amazon, Google, Samsung, Lockheed Martin, Airbus ... are all investors\n* IONQ computers use a special error correction mechanism that makes them perform 1000x better than competitors -&gt; In quantum computers error correction is the most important problem to solve because this limits the amount of qubits.\n* Currently valued at only 2 billion dollars\n\nhttps://preview.redd.it/79d5bmy0frr61.png?width=1223&amp;format=png&amp;auto=webp&amp;s=af6b0a0880ad35c08818325c5db6304fe984bf05\n\nBuying IONQ is like buying CISCO in 1993, it will be a 100 Billion dollar company in just 5 years.\n\n&amp;#x200B;\n\nRight now shares at still at the 10$ merger price (10.85$ at time of writing) so the risk is virtually 0 because all capital will be returned if the merger does not go through.  I predict a short term bubble effect, just like with Nikola (although IONQ DOES have products and is not a scam!! (see slide below)) which could give it a 3X return in just a few months when the merger goes through. but the real outlook is for long term 5 years when this company becomes a juggernaut.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/jxkwohb1frr61.png?width=1173&amp;format=png&amp;auto=webp&amp;s=16a554f3dac413d307c20b5a15a5400cfd3bb16f\n\n# TLDR:\n\n# buy DMYI\n\nwhich is merging with the industry leader in quantum computing. Quantum computing will become the next big bubble.\n\nQuantum computer is like internet in the 90s -&gt; revolutionary.\n\n&amp;#x200B;\n\nFor more watch their investor presentation:\n\n\\[WSB blocks youtube\\] search for \"IONQ Investor Presentation 2021\"\n\n&amp;#x200B;\n\nPositions:\n\n680 shares @ 10.88$\n\n20 x 15 oct options\n\n20 x 21 may options\n\nLeaps are not available right now, 15 oct is the longest you can do",
        "subreddit": "wallstreetbets",
        "title": "Possible 100 bagger flying under the radar: Quantum Computing, the next BUBBLE DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mm31f1/possible_100_bagger_flying_under_the_radar/",
        "created": 1617833709.0
    },
    {
        "author": "Lido_",
        "created_utc": 1619689917,
        "id": "n10zg4",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Guys, $NOK IS BACK !! They had exceptional earnings. I think this stock has every reason to go to the moon 🚀🚀🚀\n\n1- with Ericsson, that’s the only other big 5G player in Europe. With huawei out, you got no choice! \n2- price is sooo cheap, could be a takeover target for an American company ! Cisco could be an acquirer ! \n3- they are winning tons of contracts !! \n4- going through a successful restructuring ! \n\nI’m so excited about this stock, got every reason to think it’s CHEAP and will go to the moooooon !!",
        "subreddit": "wallstreetbets",
        "title": "$NOK IS BACK!!! 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n10zg4/nok_is_back/",
        "created": 1619718717.0
    },
    {
        "author": "gintdm",
        "created_utc": 1619450615,
        "id": "mz05wl",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Hello Traders and Investors! An exciting week ahead of us, here is my weekly newsletter which I share every Monday to help prepare you for the week! Feel free to DM me and happy trades!\n\n**Week of 4/26/21**\n\nThe S&amp;P500 opened Monday 4/26/21 at 4185.03, above the previous close of 4180.05 on Friday 4/23/21.\n\nChip manufacturers have been inundated with demand following 2020’s COVID shutdowns and the, undoubtedly correlated, increase in demand for consumer electronics. Cisco, one of the world’s largest chip manufacturers, is struggling to keep up with demand.\n\nCisco revealed several steps it is taking to alleviate the imbalance in supply and demand including a $4.5 billion acquisition of Acacia Communications and a $20 billion plan to build two new manufacturing plants in Arizona. Cisco CEO Chuck Robbins commented extensively on the situation, and estimates it could “...\\[take\\] another six months…” for the company to resume normal operation. Around 85% of all internet traffic passes through Cisco hardware.\n\nThe effects of the shortage can be seen across industries. Among companies affected by the shortage are car manufacturers. Wayne Griffiths, head of VW’s Spanish brand, spoke on the issue, stating that the company will, “...need to face considerable challenges in the second quarter…” So far the shortage has prevented the company from building over 100,000 vehicles.\n\nThe United States Government has also expressed concern regarding the chip shortage. United States President Joe Biden held a conference with business leaders earlier this month to address the issue. During the conference the President expressed a desire to move more chip manufacturing into American plants, citing 75% of global manufacturing as being based in East Asia.  \nMeanwhile Taiwan-based chip manufacturing giant TSMC has announced a plan worth $100 billion USD to expand their companies manufacturing capacity. The announcement comes in tandem with company founder Morris Chang’s plea to the Taiwanese government for increased support, citing a fear that if the Taiwan-based manufacturer fails to meet demand US or Chinese manufacturers will fill the gap.\n\nThe increase in demand for electronics caused by the pandemic has boded well for Apple, who reports earnings on Wednesday. Analysts are looking for the technology giant to post earnings of $0.98 on revenue of $77 billion after a strong Q2 for sales. The earnings call comes on the heels of Apple’s first product showcase of the year last Wednesday, and the company’s announcement that it will be taking steps to increase its footing in the instant messaging market. Apple stated it plans to increase the amount of features provided by it’s iMessage app, with the objective being to bring it more in line with popular messengers offered by Facebook, WhatsApp, and Snapchat.\n\nMicrosoft will report earnings Tuesday. Analyst estimates place earnings around $1.78 per share over $43 billion in revenue. Microsoft, who also saw an increase in demand for its technology as a result of the pandemic, has greatly benefitted from an increased demand for cloud-services. Microsoft’s cloud-based service hub, Azure, posted 2020 growth of 43%. The company expects to post great earnings despite the current chip-shortage, having generated much of its growth from the pandemic in the software-as-a-service sector.\n\nExecutives from Facebook, Twitter, and Youtube will testify before a U.S. Senate Judiciary hearing committee on Tuesday. The executives have been called to testify on the use of algorithms to dictate what consumers watch and read on the popular platforms. The hearing comes amid concerns that manipulative practices have led to massive distribution of misinformation, with repercussions that reverberate throughout society. The practice of purposefully serving consumers misinformation has been dubbed “algorithmic amplification,” and the results of the hearings could have a significant impact on the social media industry. All three companies will report earnings this week.\n\nOPEC will hold its opening session Wednesday. The conference will take place over the course of the day, and will include remarks from prominent Russian and Saudi chairman. The conference is meant to be informative and expected to feature little remark on policy. However speculation that additional information on a potential NOPEC bill could have an impact on U.S. trading. The conference comes one day before North American oil giants Exxon and Shell report earnings.\n\nFederal Reserve Chairman Jerome Powell will hold a press conference at 2:30PM Wednesday. Powell’s recent statements at press conferences have highlighted an economy which although largely recovered, still faces a degree of risk in the face of the pandemic. Powell stated in an April 11th CBS interview, “The principal risk to our economy right now really is that the disease would spread again more quickly.” Powell’s comments come a day before advanced release of the Q1 U.S. GDP, which Bank of America analysts predict will show a real growth rate of 6.5%.\n\n**Some of the Companies with Earnings this Week**\n\n**Monday, April 26th:**  \nAmong others, Tesla (TSLA) will hold earnings calls today. Tesla looks to top analyst estimates of $0.75 EPS on $10.5 billion in revenue after a successful quarter for delivery numbers in the face of the ongoing chip shortage.\n\n**Tuesday, April 27th:**  \nMicrosoft  \nGoogle  \nStarbucks  \nGeneral Electric  \nVisa  \nAMD  \nCapital One  \nUBS  \nHasbro  \n**Wednesday, April 28th:**  \nApple  \nSony  \nFacebook  \nShopify  \nEbay  \nFord  \nQualcomm  \nBoeing  \nGeneral Dynamics  \nRockwell Automation  \nRaymond James Financial Inc\n\n**Thursday, April 29th:**  \nAmazon  \nSamsung  \nMastercard  \nComcast  \nMcDonald's  \nShell  \nCaterpillar  \nNorthrop Grumman Corp  \nTwitter  \nNewmont Mining Corp  \nDr. Pepper Snapple Group  \nThe Hershey Co  \nWestern Digital  \nLogitech\n\n**Friday, April 30th:**  \nAlibaba  \nExxon  \nChevron  \nCharter Communications",
        "subreddit": "stocks",
        "title": "What's Happening in the Markets: Week of 4/26/2021",
        "url": "https://www.reddit.com/r/stocks/comments/mz05wl/whats_happening_in_the_markets_week_of_4262021/",
        "created": 1619479415.0
    },
    {
        "author": "gintdm",
        "created_utc": 1619526463,
        "id": "mznbvw",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": " Chip manufacturers have been inundated with demand following 2020’s COVID shutdowns and the, undoubtedly correlated, increase in demand for consumer electronics. Cisco, one of the world’s largest chip manufacturers, is struggling to keep up with demand. \n\nCisco revealed several steps it is taking to alleviate the imbalance in supply and demand including a $4.5 billion acquisition of Acacia Communications and a $20 billion plan to build two new manufacturing plants in Arizona. Cisco CEO Chuck Robbins commented extensively on the situation, and estimates it could “...\\[take\\] another six months…” for the company to resume normal operation. Around 85% of all internet traffic passes through Cisco hardware. \n\nThe effects of the shortage can be seen across industries. Among companies affected by the shortage are car manufacturers. Wayne Griffiths, head of VW’s Spanish brand, spoke on the issue, stating that the company will, “...need to face considerable challenges in the second quarter…” So far the shortage has prevented the company from building over 100,000 vehicles.\n\nThe United States Government has also expressed concern regarding the chip shortage. United States President Joe Biden held a conference with business leaders earlier this month to address the issue. During the conference the President expressed a desire to move more chip manufacturing into American plants, citing 75% of global manufacturing as being based in East Asia.   \nMeanwhile Taiwan-based chip manufacturing giant TSMC has announced a plan worth $100 billion USD to expand their companies manufacturing capacity. The announcement comes in tandem with company founder Morris Chang’s plea to the Taiwanese government for increased support, citing a fear that if the Taiwan-based manufacturer fails to meet demand US or Chinese manufacturers will fill the gap. \n\nThe increase in demand for electronics caused by the pandemic has boded well for Apple, who reports earnings on Wednesday. Analysts are looking for the technology giant to post earnings of $0.98 on revenue of $77 billion after a strong Q2 for sales. The earnings call comes on the heels of Apple’s first product showcase of the year last Wednesday, and the company’s announcement that it will be taking steps to increase its footing in the instant messaging market. Apple stated it plans to increase the amount of features provided by it’s iMessage app, with the objective being to bring it more in line with popular messengers offered by Facebook, WhatsApp, and Snapchat. \n\nMicrosoft will report earnings Tuesday. Analyst estimates place earnings around $1.78 per share over $43 billion in revenue. Microsoft, who also saw an increase in demand for its technology as a result of the pandemic, has greatly benefitted from an increased demand for cloud-services. Microsoft’s cloud-based service hub, Azure, posted 2020 growth of 43%. The company expects to post great earnings despite the current chip-shortage, having generated much of its growth from the pandemic in the software-as-a-service sector.",
        "subreddit": "wallstreetbets",
        "title": "COVID's Massive Effect on the Semi-Conductor Market: What This Means for Electronics Manufacturers on Earnings Week",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mznbvw/covids_massive_effect_on_the_semiconductor_market/",
        "created": 1619555263.0
    },
    {
        "author": "MyNameCannotBeSpoken",
        "created_utc": 1618651334,
        "id": "msnlhi",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "It's commonly said to her exercise an option, but I'm thinking that's not always the case.\n\nSo I have two sets of options that expired yesterday:\n\n CSCO 39 CALL long / CSCO 51.5 CALL short \n\nUTZ 12.5 CALL long /UTZ 25 CALL short\n\n(UTZ seems to be at exactly $25, no idea if it will be assigned or not)\n\nMy main question is given the spread is about $3 on both the long positions, it seems as if I'll lose money if the brokerage were to liquidate them but if I'm assigned both from the short positions and they exercise the long positions, I'll actually make money.\n\n\nI often have a similar problem when I buy LEAPS. The spreads are so large, I'm often down 30% of a long call option where the underlying can be increasing in value. If I want to exit an ITM losing position, rather than selling, am better to sell a weekly call that I know will be assigned then exercise my LEAP? It seems I can turn an otherwise losing position into a gain (via premium and not losing on the spread)",
        "subreddit": "options",
        "title": "A proper time to exercise?",
        "url": "https://www.reddit.com/r/options/comments/msnlhi/a_proper_time_to_exercise/",
        "created": 1618680134.0
    },
    {
        "author": "nokia3310user",
        "created_utc": 1617529827,
        "id": "mjt9o5",
        "num_comments": 13,
        "num_crossposts": 0,
        "selftext": "The Biden Administration recently released a Fact Sheet of the American Jobs Plan.\n\nHere’s a summary of a few of the key expenditure areas and what this means for particular stocks and sectors:\n\n### Fix Highways, rebuild bridges, upgrade airports and transit systems:\n\nGood demand for steel, concrete, building materials.\n\nStocks to follow (tickers given)  \n$X - US Steel  \n$MT - ArcelorMittal  \n$FRD - Friedman Industries Inc  \n$ATI - Allegheny Technologies Inc\n\n### Deliver clean drinking water, renewed electric grid, high-speed broadband\n\n$NOK, $VZ, $CSCO - potential 5G play, amid US-China tensions  \n$DUK, $NEE, $XEL - the best electric utility stocks going by fundamentals. An equal allocation to these should be good.\n\n### Train Americans for the jobs of the future:\n\n$AI, $PLTR, $IBM, $INTC - I really like these stocks, and I think their combination fits well within this theme - a mix of hardware knowledge and software &amp; implementation expertise.\n\n### Create Good Jobs Electrifying Vehicles\n\n$UBER, $MSFT, $TSLA, $GOOG\n\nIf you thought the EV boom is over, think again - there’s no limit to the amount of money the fed can print and we all know who runs the fed. This government is capable to printing trillions to ‘revive’ US Industrial production, a good chunk of which will go to those at the top of the pyramid - hence these picks.\n\n### Replace 100% of the nation’s lead pipielines - Water Infrastructure\n\nGood to see some money going towards water infrastructure. The Biden Administration shall allot $45 billion to the Drinking Water State Revolving Fund and in Water Infrastructure Improvements for the Nation Act (WIIN) grants.\n\nKey stocks that I think would benefit:  \n$XYL - Xylem Inc  \n$AWK - American Water Works  \n$AWR - American States Water Company\n\n[More stocks that could benefit from the Water Infrastructure Investment](https://tribe.getbaraka.com/t/investing-in-water/214)\n\nAny stocks that I missed out on? Let me know in the comments!\n\nNot investment advice. Do your own due diligence before investing. Your capital is at risk when you invest.",
        "subreddit": "wallstreetbets",
        "title": "Which stocks could the American Jobs Plan benefit?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mjt9o5/which_stocks_could_the_american_jobs_plan_benefit/",
        "created": 1617558627.0
    },
    {
        "author": "steampunk321",
        "created_utc": 1618513142,
        "id": "mrlht7",
        "num_comments": 7,
        "num_crossposts": 0,
        "selftext": "Does anyone write collars on just 100 shares to gain free protection from the downside.  Example, my CSCO shares are up 41% - I own 144.  The current share price is $51.76.   I want to have some downside protection, so I could do a collar by writing an out of the money call of 60 strike JAN2023 to cover the cost of a 50 strike put out to Oct2021.  \n\nDoes anyone else do this?  Is it worth it for protection?  How and when do you manage a collar as the stock price increases or decreases? I imagine if the price goes down, you can either exercise or sell the put and move down your collar.  But what if the underlying goes up?  Are you just screwed because the calls are expensive and the profit is capped?  And, what do you do with calls &gt; year out once your put expires?",
        "subreddit": "options",
        "title": "Collars",
        "url": "https://www.reddit.com/r/options/comments/mrlht7/collars/",
        "created": 1618541942.0
    },
    {
        "author": "bigdigdoug",
        "created_utc": 1617840022,
        "id": "mmfdw0",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": " I posted this on Monday in a couple other subs but unfortunately I didnt get in - was asked to post it here but it will probably get removed and/or downvoted. \n\nI'm currently watching from the sidelines as it has pulled back pretty good today. I'm keeping an eye for it to either drop back below the 200MA and possibly fizzle out or get back above the 50MA and hold. Its OTC which has been getting hammered as of late so definitely proceed with caution. \n\n \n\n[$RKFL](https://finance.yahoo.com/quote/RKFL?p=RKFL&amp;.tsrc=fin-srch)\n\nSource: [Here](https://www.goldmanresearch.com/202104011316/Opportunity-Research/blockchain-crypto-payments-pioneer-to-transform-ecommerce.html)\n\n**COMPANY SNAPSHOT**\n\nRocketFuel Blockchain, Inc. is global payments processing company offering highly efficient 1-click check-out solutions to eCommerce merchants and their customers. RocketFuel’s solution focuses on enhanced customer privacy protection eliminating the risk of data breach while improving speed, security and ease of use. RocketFuel users are able to enjoy seamless check-out using their favorite cryptocurrencies or direct bank transfers and forget the clunky cart and card paradigm of the past. RocketFuel merchants are able to implement new impulse buying schemes and generate new sales channels unavailable in current eCommerce solutions.\n\n**INVESTMENT HIGHLIGHTS**\n\n**RKFL is an early mover as a global provider of one-click online payment options using Bitcoin and 40+ other cryptocurrencies.** Moreover, RKFL is the first cryptocurrency payment service to provide a seamless one-click checkout experience.\n\n**The market is huge and growing at an enviable rate.** According to Markets and Markets, the blockchain technology market is expected to reach the $39.7B mark in 2025, up from $3B in 2020.\n\n**Current eCommerce methods are outdated, problematic, and costly, while the Company’s platform is designed to improve the merchant and customer experience.** Implementation should lead to lower merchant costs, potential recurring business and may foster customer loyalty. \n\n**Management has a proven track record of developing new technologies, bringing them to market, and generating value for the investors.** The CEO has exited 5 other companies. Thus, we envision RKFL emerging as a takeover candidate.\n\n**Our forecasts suggest sales will jump from $1.8M to $40M in 3 years, with meaningful EPS.** Stocks tend to generate their greatest gains when the transition from early adoption to mass market appeal begins, which could begin in late 2021.\n\n**Our 6-12-month target of $6.15 reflects a reasonable 4x our FY24 sales estimate of $40M and roughly 28x our $0.22 EPS forecast.** This target could prove to be conservative if adoption accelerates.\n\n* Price as of 3/31/21$1.32\n* 52 Wk High - Low$3.25 - $0.50\n* Est. Shares Outstanding24.2M\n* Market Capitalization$31.9M\n* Average Volume17,008\n* Exchange:OTCQB\n\n**COMPANY INFORMATION**\n\n**RocketFuel** **Blockchain, Inc.**  \n**201 Spear Street, Suite 1100**  \n**San Francisco CA 94105**\n\nWeb:     [www.RocketFuelBlockchain.com](http://www.rocketfuelblockchain.com/)\n\nEmail:   [info@rocketfuelblockchain.com](mailto:info@rocketfuelblockchain.com%0d)  \nPhone : 424.256.8560\n\n***The View from 30,000 Feet***\n\nBlockchain payments innovator **RocketFuel** **Blockchain, Inc. (OTCQB – RKFL)** is poised to transform the global eCommerce industry, in our view. The Company is an early mover as a global provider of one-click online payment options using Bitcoin and dozens of other cryptocurrencies. Moreover, RocketFuel is the first cryptocurrency payment service to provide a seamless and elegant one-click checkout experience that today's digital and mobile-centric consumers have come to expect from eCommerce marketplaces, such as **Amazon (NASDAQ – AMZN)**. \n\nThe RocketFuel platform, based on patent-pending technology, enables merchants and consumers to easily complete payment for goods and services using 43 different cryptocurrencies or direct bank transfer in a completely secure environment. A significant benefit of the Company’s approach is that the entire shopping cart checkout process can be executed via a distributed ledger or blockchain. Thus, merchant websites will no longer required to operate complex, and costly payment and check-out infrastructures. With the one-click checkout used on RocketFuel-partnered sites, consumers will enjoy unrivalled convenience .\n\nAs is typically the case with new technologies and applications with a broad scope, we expect early adopters to dominate usage during 2021 as online merchants shopping cart and payment solutions providers implement the crypto acceptance functionality, with mass market utilization occurring in 2022. With estimates suggesting that the number of (non-Facebook) crypto wallet holders will grow to 250M+ in the next 2-3 years, up from 68M today, substantial adoption lies ahead.   \n\n***The Problem***\n\neCommerce has enjoyed wide, mainstream adoption and in many cases has emerged as the shopping method of choice for consumers during the COVID-19 pandemic. Unfortunately, for merchants and consumers alike, many of the payment system setups and associated technologies in place today have underlying issues, which in turn have a deleterious effect on merchant/consumer transaction execution.\n\nFor consumers, payment systems and shopping cart utilization can be awkward and clunky, require multiple steps and redirects to 3rd parties, and may not be secure, resulting in a less than stellar customer experience. For merchants, the current eCommerce payment infrastructure is even more problematic. In most cases, merchants are required to use an intermediary, costing billions in excess expenses annually. Roughly 1 in 5 carts leave without completing a transaction because consumers do not trust the merchant’s system. Plus, in most cases, fees are high, payments are delayed, and exorbitant fees due to fraud, fraud prevention, and chargebacks related to the inefficient back-end operations can be excessive, reducing profits.\n\n***The Solution*** \n\nIn contrast, by leveraging modern blockchain technology and its proprietary platform, RocketFuel offers consumers a single-click pay solution, pay with crypto or direct bank transfer option with no redirects or filling out forms as the information is stored at once. The process is seamless-simple, efficient, secure, and convenient. Merchants generate higher shopping cart conversion, pay lower fees, have greater security, transparency, less fraud, and improved cash flow. With a better experience for both sides of the transaction, and improved order and shipping fulfillment, merchants can foster loyalty and generate recurring business. \n\n***Today and Tomorrow***\n\nThe Company launched its first product in a live environment in March 2021 and with two travel merchant customers and a tax auditing firm in hand, management intends to continue to develop the check-out technology with several larger U.S. eCommerce merchants, social media and blogsites. With connections to several larger eCommerce merchants, near term sales and marketing efforts will focus on a few “big fish” rather than many smaller merchants and will scale up initiatives as funding permits. We believe that the Company will also target specific verticals that may be a source of early adopters and crypto wallet holders in verticals such as online gambling, gaming, and with merchants selling high ticket items. In conjunction with this targeted approach, RocketFuel may utilize social media to generate awareness and attract consumer influencers. Given that the phase from early adoption to mass market adoption can take 12-18 months, we believe that the Company could enjoy exponential merchant sign-ups going forward, along with consumer utilization, from 2021-2022, with the greatest recurring platform utilization by consumers beginning in 2023. \n\n***Financial Forecasts and Valuation***\n\nIt is difficult to accurately project the deployment and adoption success of a new technology and application such as the unique RocketFuel blockchain and crypto payment service.  However, given the underlying growth rates in blockchain ledger utilization for financial and payment transactions, as well as the proliferation of crypto wallet adoption, it is clear that major upside exists. Widespread adoption and growth are further affirmed by the Company’s underlying offering which solves major unmet needs in eCommerce for merchants and consumers alike. As with many young companies, it comes down to efficient execution. The management has a strong, proven track record of developing new technologies, bringing them to market, and generating value for the investors. The CEO has exited 5 other companies.\n\nWe should note that our forecasts largely reflect the typical growth inherent in new technology firms from early mover/early adopter stage to mass market appeal. Plus, the speed with which adoption in the online world occurs tends to be faster than most historical segments, further bolstering our investment thesis and projected growth rates. The variables in our forecasts tend to be the average fee percentage charged to merchants as well as revenue derived via license. It is too early in the maturation cycle to firmly estimate such revenue breakdowns or figures.\n\nTo simplify and streamline our initial forecasts, we have estimated $100M in business transacted at an average fee of 1.8% for Year 1 (Apr 2021-Mar 2022), reduced to 1.5% on $800M in transactions in FY23E and $2.5B in transactions for FY24E. While we believe additional revenue streams could be booked in FY23E, we view such contribution as a bonus at this time. However, we do project $2.5M in licensing revenue and other fees in FY24E. Based on this model, we project revenue of $1.8M in FY22E with a loss of $2.45M, or ($0.09) and revenue of $12M in FY23E with net profit of $650K, or $0.02. We preliminarily project $40M in revenue ($37.5M in transaction fees and $2.5M in licensing fees) for FY24E with net of $7.3M, or $0.22, and a net margin of 18.3%.\n\nGiven the game-changing technology and its resultant impact on the use of cryptocurrencies along with ecommerce efficiency and volume, we believe that RKFL could be afforded premium valuations as adoption occurs. Going forward, we recommend investors value the Company based on milestone events such as merchant signup as we view 2021 as a key infrastructure, proof-of-concept year, with major revenue growth in the cards in 2022 (fiscal 2023). Our 6-12-month target of $6.15 reflects a reasonable 4x our FY24 (CY23) sales estimate of $40M and roughly 28x our $0.22 EPS forecast. This target could prove to be conservative if adoption accelerates later this year or in early 2022.\n\nFinally, we believe that as a critical mass adoption among merchant occurs, the Company could emerge as a takeover candidate by a leading payment services or provider entity. RocketFuel’s leadership has an enviable history of building and selling technology start-ups at key inflection points. While this event may not occur, it may have an occasional impact on valuation and should provide further confidence in management’s capabilities.\n\n**INDUSTRY PRIMER: BLOCKCHAIN**\n\n📷\n\nAccording to a recent report by Markets and Markets, the blockchain technology market is expected to reach the $39.7B mark in 2025, up from $3B in 2020.\n\nA blockchain, also known as a “distributed ledger technology,” is a sequential, ever-growing, time-stamped set of records used to secure transactions across multiple devices that are grouped in blocks and maintained by disparate participants. Each block is interdependent, making alterations of records economically difficult if not outright impossible.\n\nTransactions in money, equities, bonds, titles, deeds, contracts, and virtually all other kinds of assets can be implemented and stored securely, privately, and from peer to peer, because trust is established by network consensus, cryptography, collaboration, and sophisticated code---without intermediaries. Given the opportunities associated with such a disruptive technology, many firms in varied industries are actively operating in the space to transact business, agreements and financial transactions more efficiently.\n\nCommercial and central banks across the world are now using blockchain technology for payment processing and issuing of their digital currencies. The technology enables cross-border payments that are less expensive and faster as compared to traditional systems. The remittance cost within the blockchain is 2% to 3% of the total amount as compared to other third parties as blockchain does not require third-party authentication. Even governments are introducing CBDCs (Central Bank Digital Currency) to replace cash and traditional fiat-currencies. Plus, they are putting social media behemoths such as Facebook and Google under scrutiny for their lack of privacy protection and data security.\n\nOne of the most popular applications of blockchain is cryptocurrency. Trading in cryptocurrency is relatively easy compared to other assets. You can begin trading just by signing up for various wallets on the market. Furthermore, there are different types of wallet apps, each with its own advantages, such as levels of security, accessibility, and more. The most popular and well-known wallet is Coinbase with 639,885 daily active users (DAUs). If Facebook’s Libra initiative to its 2B users is successful, this figure will be dwarfed in short order.\n\nThe payments segment dominated the market in 2020 and accounted for more than 44.0% share of the global revenue. Blockchain technology improves payment system efficiency, minimizes operating costs, and offers transparency. These benefits provided by blockchain technology are increasing its use in payment solutions, thus, driving the segment growth. At the same time, blockchain reduces the need for middlemen in payment processing, which is also a major factor driving the segment growth.\n\nBitcoin (the largest cryptocurrency) is the most popular application of blockchain, but increasingly this innovative technology can be used in various business and commercial purposes. The elimination of the middleman in various transactions and processes promises a much more efficient workflow using blockchain. Additionally, increasing concerns about privacy and security make blockchain an ideal technological pipeline for modern processes.\n\nEnter the eCommerce application.\n\n**ROCKETFUEL: THE GAME-CHANGER**\n\nWhen validating a new market or technology, it is instructive to review history as it tends to repeat itself. Most major technology breakthroughs and disruptions had a few things in common:\n\n* A large, inefficient market, usually based on old technologies and processes, generating problems and unnecessary cost for all stakeholders.\n* A new technology allowing new companies to invent new solutions that address these problems.\n\nSome examples include improved internet technology which enabled Amazon to evolve our commerce habits from brick and mortar to digital and mobile technology innovations and evolutions that have led to Uber and Lyft transforming transportation.  The payments industry is no different. Its architecture and operations are still based on a 40-year-old physical card with a chip and limited fraud prevention capabilities. In contrast, digital technologies such as blockchain and cryptocurrencies are prompting the replacement of the old architecture with a new efficient, lower cost approach. y changes the way payments are made.\n\nThere is a huge inefficient market (the payment market) causing problems for all stakeholders. There is a technology that has the potential to fix it. Enter RocketFuel Blockchain.\n\nRocketFuel is a new frictionless blockchain based payment solution for eCommerce merchants to accept payments in crypto or cash via bank transfer and receive payment and shipping information in one one-click transaction without the need for payment intermediaries. In anticipation of a major proliferation in crypto utilization for payments and business, large eCommerce and retail merchants now accept crypto as a payment method. In fact, over one-third of all small and medium-sized U.S. companies already accept Bitcoin as a B2B payment source.\n\nThe eCommerce space is estimated to be $3.5T, yet it represents less than 15% of total commerce. PayPal, a significant player in the online payments arena with over 350M users, allowed users to buy and sell crypto and just announced its “Checkout for Crypto” feature. This function, allows users to instantly convert their Bitcoin, Ethereum, Litecoin, or Bitcoin Cash to US dollars (with no additional transaction fees) that PayPal then uses to complete the transaction. In our view, this is a validation of the RocketFuel approach and will likely capture its share of this function. Still, since it lacks the 1-click convenience and appears to still be clunky and expensive relative to our forecast of the RocketFuel pricing, RocketFuel remains in the driver’s seat.\n\nAs mentioned above, existing solutions are costly, impact conversion, not secure, leads to fraud, and will eventually go the way of the milkman. Merchants and consumers alike crave security, convenience, transparency, low cost and trust.  \n\n***The*** ***RocketFuel*** ***Approach***\n\nThe Company provides check-out and payment systems directly on the check-out page that securely automate and simplify the way online payment and shipping information is received by merchants from their customers. The check-out systems are designed to enhance customers’ data protection, enabling consumers to pay for goods and services using cryptocurrencies or by direct transfers from their bank accounts without exposing spending credentials such as credit card data. At the same time, the check-out systems are designed to increase the speed, security and ease of use for both customers and merchants and include a merchant portal that provides detailed transactions and metrics about payments received by the merchant.\n\nThey also include a customer portal where shoppers are able to track their payments, configure payment defaults and connect with various cryptocurrency exchanges and banks to facilitate payment to merchants. Merchants are able to integrate a unique pop-up user interface that allows customers to pay directly from their ecommerce checkout page with no need to redirect to another website or web page.\n\nData is key and the merchant portal is updated instantly when a payment transaction is made on the merchant website. The merchant is notified of the transaction and can see the transaction details, including the customer that made the transaction, the transaction amount and the transaction items. This information is added to the merchant dashboard where various metrics are tracked and displayed to the merchant, including information about the various cryptocurrencies that are used for payments to that merchant and the funds received by the merchant from the different currencies.\n\nCustomers of merchants that use the RocketFuel payment solution are able to track their payments in their online portal. They are also able to track payments they made to all the merchants that are integrated with the RocketFuel payment technology within one consolidated user portal. They are able to connect to multiple exchanges including Coinbase, Binance, Kraken, Gemini and others to pay directly from them. They can also pay from any cryptocurrency wallet. Customers are able to connect with multiple bank accounts to pay from as well.\n\n📷The “single-click” RocketFuel check-out solution is based on a streamlined check-out process for eCommerce purchases. The payment user interface is displayed as a stand-alone popup that allows the creation of new accounts as well as payment directly from crypto exchanges, crypto wallets, and bank accounts, with no redirects to browser tabs or pages. This can be integrated as a plugin on the merchant checkout page or as a browser extension. The plugin comes integrated with popular ecommerce platforms including WooCommerce, Shopify, Prestashop and others. The payment interface is designed for both web and mobile checkout experiences. Merchants are able to integrate the RocketFuel payment interface to their checkout page with software development kits (SDKs) that are available via the merchant portal. Application programming interfaces (APIs) are also available to the merchant for deeper integration into backend systems, ERP platforms, and other third-party platforms.\n\nCryptocurrencies are stored in different types of cryptocurrency wallets. These wallets can include mobile wallets, web wallets, desktop wallets, hardware wallets, and exchange wallets. Currently, it can be a difficult, confusing and multi-step process to use these wallets to make cryptocurrency payments. With RocketFuel’s blockchain solution, cryptocurrency holders can use any of the above digital wallets to make payment for products or services to any RocketFuel merchant with 1, 2, or 3 steps.\n\nUsing the “single-click” RocketFuel check-out technology and check-out button, consumers will no longer be re-directed to a third-party  With the RocketFuel solution, eCommerce merchants will need no contact or other information exchange with the consumer in order to receive their payment or shipping details. Instead, they will have immediate visibility of payments from customers via the RocketFuel payment system, which may be integrated into merchants’ fulfillment centers.\n\nLooking ahead, the technology will also be used for different scenarios, including paying for services, paying invoices, and other payment strategies. In addition, under a future version of the payment system, advertisements in which the entire check-out process is embedded will be able to be placed on third party websites and sales may be completely finalized there. Thus, the platform will enable eCommerce strategies that can include advertisements with a fully integrated check-out process. This prospective feature is unlike any other currently in use today and could eventually be a significant driver of revenue, once completed. Such advertisements will provide significant new sales channels to retailers that are simply not possible with legacy check-out solutions.\n\nIn addition to potential competition from PayPal, the primary competitor remains Bitpay, which is already well established as the leading crypto payment technology in the market, having been founded in 2011. Given that RocketFuel offers a better user experience for crypto payments, allows payment from dozens of other cryptocurrencies, and other wallets, and exchanges, RocketFuel’s diversity is a major strength.  RocketFuel also offers services that Bitpay currently does not, such as providing merchants immediate visibility of payment transactions, real time metrics of transactions and customers, easy integration to ecommerce checkout as well as deep integration to backend platforms. Furthermore, with an average of 72,000 transactions per month, it will not take significant merchant penetration for RocketFuel to surpass Bitpay, in our view.\n\n***Target Markets*** \n\nThe Company’s initial target market is the travel industry and RockeFuel already has signed up two sizable customers: Sky Tours and Military Fares. It should be noted that worldwide sales of flight tickets sold online in 2019 was $540B and the 2 largest reservations systems generate more than $10B in yearly revenue, making this vertical a hot commodity. Management plans to target travel merchant and web platforms. Given the complexity of the intermediaries and reservation systems, high costs and notoriously delayed payments, the RocketFuel solution can simplify the payment process and customers no longer have to provide sensitive information. We believe other verticals such as online gambling, the procurement of gift cards, and high-ticket items could prove to be lucrative for the Company. As a result, we expect sales and marketing headcount to rise over the next 12-18 months, in conjunction with rapid deployment and implementation of existing and future solutions.\n\n**ROCKETFUEL BLOCKCHAIN LEADERSHIP TEAM**\n\n**Gert Funk, Chairman, Founder, Chief Product Officer**\n\nGert Funk has over 15 years as a payment service provider for international eCommerce merchants. A serial entrepreneur since 1990, he is the founder of RocketFuel Blockchain, Inc. Gert has been an expert in blockchain technology and applications for eCommerce since 2015.\n\n**Peter Jensen, Chief Executive Officer**\n\nPeter Jensen is an experienced executive with extensive global experience within enterprise software. After holding sales and marketing positions within Oracle, Symantec, and VMware in Europe and the US, Peter has been focusing on building and growing start-ups in Silicon Valley as CEO and VP of Sales. Examples include Thinstall (acquired  by VMware), StopTheHacker (acquired by Cloudflare), ParStream (acquired by CISCO), SPanugo (acquired by IBM), and others. He is currently the CEO of RocketFuel Blockchain, a fintech software company providing a payment solution that allows eCommerce merchants to receive Crypto payments.\n\n**Bennett** **Yankowitz, Chief Financial Officer**\n\nBennett Yankowitz is an expert in ICO law with more than 30 years of experience as a corporate attorney with leading law firms. Ben specializes in securities, financial and merger and acquisition transactions. He holds law degrees from the University of Southern California and the University of Cambridge.\n\n**Rohan Hall, Chief Technology Officer**\n\nRohan Hall has over 30 years of experience in the technology sector, Rohan is a noted and published author and Fintech company founder. A serial entrepreneur and Blockchain expert, Rohan has had successful blockchain exits.\n\n**FINANCIAL FORECASTS**\n\n*(Analyst’s Note: These forecasts are our own and we did not receive guidance or projections from RKFL management.)*\n\nOur forecasts largely reflect the typical growth inherent in new technology firms from early mover/early adopter stage to mass market appeal. Plus, the speed with which adoption in the online world occurs tends to be faster than most historical segments, further bolstering our investment thesis and projected growth rates. The variables in our forecasts tend to be in the average fee percentage charged to merchants as well as revenue derived via license. It is too early in the maturation cycle to estimate such revenue breakdowns or figures.\n\nTo simplify and streamline our initial forecasts, we have estimated $100M in business transacted at an average fee of 1.8% for FY22E or Year 1 (Apr 2021-Mar 2022), reduced to 1.5% on $800M in transactions in FY23E and $2.5B in transactions for FY24E. While we believe additional revenue streams could be booked in FY23E, we view such contribution as a bonus at this time. However, we do project $2.5M in licensing revenue and other fees in FY24E. Based on this model, we project revenue of $1.8M in FY22E with a loss of $2.45M, or ($0.09) as management begins meaningful sales and marketing expenses to build awareness and execute merchant signups in key verticals such as the travel industry and online gambling. \n\nIn FY23E, we forecast significant revenue growth with top line reaching the $12M mark. Total operating expenses are estimated to reach $8.25M with expanded sales and marketing expenses, along with R&amp;D, reflecting upgrades to the core functionality. Based on this model, net profit is slated to reach $650K, or $0.02, with a slight rise in shares outstanding to reflect a modest fundraise in conjunction with a prospective up-list to NASDAQ. We preliminarily project $40M in revenue ($37.5M in transaction fees and $2.5M in licensing fees) for FY24E with net of $7.3M, or $0.22, and a net margin of 18.3%.\n\nIt should be noted that while there are not material direct COGS, we have allocated some indirect expenses to arrive at a gross margin of around 72-73% for all years. We believe that this is conservative and may have to be adjusted higher, thereby raising profitability and our price target.\n\n**RISK FACTORS**\n\nIn our view, the Company’s biggest risks are straightforward: the timing and magnitude of broad adoption of its core technology and applications by both merchants and consumers. Secondary risks include changes in the regulatory environment affecting utilization along with marketing effectiveness. Competitive risks include lower pricing, more effective sales/marketing, greater functionality and features. The aforementioned risks could come from larger competitors, existing firms, or new entrants. Still, these future concerns are consistent with firms of RocketFuel’s size and early mover standing. Moreover, we believe that the Company’s seasoned management team is prepared to overcome these hurdles and generate significant top-line growth, deployment and  implementations.\n\nVolatility and liquidity are typical concerns for microcap stocks that trade on the over the counter (OTC) stock market. In addition to a recent funding access announcement regarding Triton Funds, management may seek to raise additional capital next year in conjunction with an up-list to NASDAQ, to fund corporate expansion and potential M&amp;A. An overriding financial benefit as a public company is the favorable access to and the availability of capital to fund product launches, consistent marketing campaigns and other initiatives. Since the proceeds of any future funding would be used in large part to advance major business development and sales, we believe that any dilutive effect from such a funding could be offset by related increases in market value.\n\n**VALUATION AND CONCLUSION**\n\nRKFL is an early mover as a global provider of one-click online payment options using Bitcoin and 40+ other cryptocurrencies. Moreover, RKFL is the first cryptocurrency payment service to provide a seamless one-click checkout experience. The market is huge and growing at an enviable rate. According to Markets and Markets, the blockchain technology market is expected to reach the $39.7B mark in 2025, up from $3B in 2020.\n\nCurrent eCommerce methods are outdated, problematic, and costly, while the Company’s platform is designed to improve the merchant and customer experience. Implementation should lead to lower merchant costs, potential recurring business and may foster customer loyalty. \n\nManagement has a proven track record of developing new technologies, bringing them to market, and generating value for the investors. The CEO has exited 5 other companies. Thus, we envision RKFL emerging as a takeover candidate. At present, our forecasts suggest sales will jump from $1.8M to $40M in 3 years, with meaningful EPS. Stocks tend to generate their greatest gains when the transition from early adoption to mass market appeal begins, which could begin in late 2021.\n\nGiven the game-changing technology and its resultant impact on the use of cryptocurrencies along with ecommerce efficiency and volume, we believe that RKFL could be afforded premium valuations as adoption occurs. Going forward, we recommend investors value the Company based on milestone events such as merchant signup as we view 2021 as a key infrastructure, proof-of-concept year, with major revenue growth in the cards in 2022 (fiscal 2023). Our 6-12-month target of $6.15 reflects a reasonable 4x our FY24 (CY23) sales estimate of $40M and roughly 28x our $0.22 EPS forecast. This target could prove to be conservative if adoption accelerates later this year or in early 2022.\n\nFinally, we believe that as a critical mass adoption among merchant occurs, the Company could emerge as a takeover candidate by a leading payment services or provider entity. RocketFuel’s leadership has an enviable history of building and selling technology start-ups at key inflection points. While this event may not occur, it may have an occasional impact on valuation and should provide further confidence in management’s capabilities.",
        "subreddit": "pennystocks",
        "title": "Blockchain, Crypto Payments Pioneer to Transform eCommerce",
        "url": "https://www.reddit.com/r/pennystocks/comments/mmfdw0/blockchain_crypto_payments_pioneer_to_transform/",
        "created": 1617868822.0
    },
    {
        "author": "Itsboomhomie",
        "created_utc": 1618511148,
        "id": "mrksdt",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hey gang its **Boom** here, with a continuation of a series of DD posts for companies where I currently hold no position. No position = objective outlook. \n\n PHUN “gives companies the tools they need to engage, manage, and monetize their mobile presence with solutions that touch all phases of the mobile application lifecycle,” [per their website](https://www.phunware.com/company/). They also are part of blockchain gang with Phun Token, which rewards users through value of engagement, and PhunCoin, a security token that rewards users for the value of their data. Their partners include WWE, Cisco and LiveNation. [With plans to release their own app](https://finance.yahoo.com/news/phunware-board-authorizes-bitcoin-purchases-120000322.html), PhunWallet, later this month, I wanted to take a look at the speculative blockchain play that actually has products in the field. \n\nInstitutional ownership has slightly ticked up from the last quarter, currently sitting at 4.4%, [per WhaleWisdom](https://whalewisdom.com/stock/stlr). No great shakes in the grand scheme of things, but it is nice to see Citadel completely exit their position in the company. Short float sits at 9.62%, [per finviz](https://finviz.com/quote.ashx?t=PHUN). PHUN saw a couple of directors selling off some stock in 2020, [per OpenInsider](http://openinsider.com/search?q=PHUN), but there were more purchases than sales in 2019. [Adjust the settings to show more robust results](http://openinsider.com/screener?s=PHUN&amp;o=&amp;pl=&amp;ph=&amp;ll=&amp;lh=&amp;fd=730&amp;fdr=&amp;td=0&amp;tdr=&amp;fdlyl=&amp;fdlyh=&amp;daysago=&amp;xp=1&amp;xs=1&amp;xa=1&amp;xd=1&amp;xg=1&amp;excludeDerivRelated=1&amp;vl=&amp;vh=&amp;ocl=&amp;och=&amp;sic1=-1&amp;sicl=100&amp;sich=9999&amp;grp=0&amp;nfl=&amp;nfh=&amp;nil=&amp;nih=&amp;nol=&amp;noh=&amp;v2l=&amp;v2h=&amp;oc2l=&amp;oc2h=&amp;sortcol=0&amp;cnt=100&amp;page=1) and we see that PHUN has been granting insiders stock up until February of this year. I don’t know enough about what these grants mean (if you do, please enlighten me). Could be bonuses or yearly compensation. It would be nice to see insiders *buying* instead of being given shares, but at least they’re not *selling*.\n\nPHUN’s had its time in the sun in [RHPS about 8 months ago.](https://www.reddit.com/r/RobinHoodPennyStocks/search?q=PHUN&amp;restrict_sr=1) The real madness for this company was in 2019, when they went through a reverse merger and announced joining blockchain gang, with shares [jumping nearly 2000% ](https://www.fool.com/investing/2019/02/11/how-phunware-shares-gained-nearly-2000-in-january.aspx)before falling back to penny territory. They pulled the uno reverse card on the covid crash, [partnering with Hewlitt Packerd Enterprise on a mobile healthcare solution](https://finance.yahoo.com/news/phunware-partners-hewlett-packard-enterprise-123000792.html). Phunware won “[Best Mobile-Driven Enterprise Cloud Platform](https://finance.yahoo.com/news/phunware-recognized-best-mobile-driven-123000635.html)” for 2020. With seemingly a bunch of success, huge partners, increasing partnerships and quality products, why was this trading so low? Dun-dun-dunnnnnn [short selling](https://www.businesswire.com/news/home/20200504005378/en/Phunware-Retains-BUYINS.NET-to-Surveil-Short-Sellers-and-Market-Makers). As of 3/31/2020 SEC filings,[ institutions owned 11.9%](https://fintel.io/so/us/PHUN?d=2020-03-31). By next quarter filing on 6/30/2020, after the BusinessWire report, institution ownership dropped by almost half, [down to 6.38%](https://fintel.io/so/us/PHUN?d=2020-06-30). \n\nPHUN is no saint, however, after a lawsuit by Uber illustrated [Phunware’s fraud against them](https://www.adexchanger.com/mobile/inside-ubers-fraud-suit-against-phunware/), which led to [further legal inquiries](https://finance.yahoo.com/news/investigation-alert-fields-kupka-shukurov-214000633.html) that have yet to be realized. The Uber suit cost them $4.5M. Then they received a PPP loan and built former President Trump’s [reelection campaign app](https://www.startribune.com/financially-troubled-startup-helped-power-trump-campaign/573102101/). After bottoming out around $0.64 in November, the company’s share price has seen some spikes and valleys, but has overall rallied, currently sitting around the $1.5 range. PHUN [raised capital with an offering](https://finance.yahoo.com/news/phunware-closes-public-offering-common-133000500.html) and missed both [EPS and revenue estimates](https://finance.yahoo.com/news/phunware-phun-reports-q4-loss-221510570.html). They [bought some bitcoin](https://finance.yahoo.com/news/phunware-board-authorizes-bitcoin-purchases-120000322.html) in anticipation of PhunWallet’s launch, and will provide cryptocurrency payroll options for employees. \n\nThis company seems to have some shaky morals (Uber lawsuit), but they have something a lot of penny stocks would kill for - products in the wild. It doesn’t seem like they do a ton of share dilution, but without having enough cash to cover their short debt, I think the offering was inevitable. I’m wary of stocks that end up tied to BTC - BTC stumbles and tanks a whole sector around it. The run up and hype simply could be too juicy to ignore. For myself, I’d like to see improved revenues and a cleaner balance sheet. \n\nLove ya\n\n\\- Boom",
        "subreddit": "RobinHoodPennyStocks",
        "title": "*no position DD* PHUN - are we having phun yet",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/mrksdt/no_position_dd_phun_are_we_having_phun_yet/",
        "created": 1618539948.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1618604922,
        "id": "msbrms",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, April 16, 2021**\n\nStocks traded higher on Friday, continuing momentum from yesterday’s record-setting close, with a batch of better-than-expected economic and corporate earnings results fueling the recent rally. The S&amp;P 500 (SPY) and Dow Jones (DIA) set fresh intraday records while the tech-heavy Nasdaq (QQQ) traded mostly flat. \n\nAccording to a report by the US Department of Commerce, retail sales boomed 9.8% higher in the month of March as the economy continues to gradually reopen as more vaccines are distributed. Moreover, the Weekly Unemployment report showed first-time unemployment claims plunged far below analyst estimates. The Labor Department reported 576,000 new jobless claims for the week ending April 10. This represents the lowest total first-time unemployment claims filed since August 2020 and a sharp decline from both the previous week’s total of 769,000 and analyst expectations of 710,000. \n\nThis is great news on two fronts. First, consumer spending represents 70% of US GDP ([more info here](https://www.thebalance.com/components-of-gdp-explanation-formula-and-chart-3306015#:~:text=Consumer%20spending%20comprises%2070%25%20of,components%20of%20the%20U.S.%20economy.)) and is a key driver of economic growth. GDP is now expected to increase 6.5% in 2021 according to the Federal Open Market Committee, the central bank's monetary policy-making group. That is sharply higher than the 4.2% forecast made in December of 2020. Second, Jerome Powell and other FOMC members have reiterated that recovery in the labor market “remains uneven and far from complete”. To see a report blow so far past analyst expectation is a great sign the labor market is recovering in tandem with the surge in consumer spending. \n\nMichael Pearce, senior US economist for Capital Economics said of the consumer report, “What caught our eye was the 13.4% surge in spending on food and drink services, while clothing store sales were up by 18.1%. Relative to pre-pandemic levels, food and drink services sales are down just 5.1%, while clothing store sales are now higher than they were in February 2020. That suggests a combination of loosening restrictions and easing of virus fears linked to the vaccine rollout are driving a rapid return to normalcy.” \n\nDistribution of the Johnson and Johnson (JNJ) coronavirus vaccine remains paused in the US following reports of rare blood clots in people who received the vaccine. The agencies are reviewing data over six reported U.S. cases of a severe blood clot in individuals after receiving the vaccine, and have recommended the pause \"out of an abundance of caution,\" the FDA said in a Twitter post. To date, roughly 6.8 million doses of the single-dose JNJ vaccine have been administered. \n\n**Highlights**\n\n* General Motors (GM) and joint-venture partner LG Chem Ltd. plan to invest $2.3 billion to construct a second battery-cell plant as the automaker continues investing in electric vehicles.\n* Morgan Stanley (MS) posted better-than-expected earnings but revealed the company lost $911 million when Archegos Capital Management, Bill Hwang’s family office, imploded last month.\n* NIO is likely to make an official announcement concerning its European expansion plan on May 7 or 8 according to multiple reports. \n* Daimler AG unveiled a new high-tech and luxury all-electric Mercedes called the EQS\n* \\*\\***Please note that current stock price was written in the morning and does not reflect intraday changes\\*\\***\n* Applied Materials (AMAT) target raised by Deutsche Bank from $150 to $160 at Buy. Stock currently around $135\n* Amazon (AMZN) target raised by Credit Suisse from $3940 to $3950 at Outperform. Stock currently around $3379\n* ASML target raised by Wells Fargo from $610 to $750 at Overweight. Stock currently around $642\n* Bank of America (BAC) with two target raises. Stock currently around $39\n   * Robert W. Baird from $38 to $42 at Outperform\n   * Royal Bank of Canada from $37 to $44 at Outperform\n* Blackrock (BLK) target raised by Deutsche Bank from $847 to $912 at Buy. Stock currently around $818\n* Boyd Gaming (BYD) target raised by Deutsche Bank from $67 to $71 at Buy. Stock currently around $65\n* Chipotle (CMG) target raised by KeyCorp from $1625 to $1725 at Overweight. Stock currently around $1542\n* Cisco (CSCO) target raised by Morgan Stanley (MS) from $54 to $57 at Overweight. Stock currently around $51.60\n* Goldman Sachs (GS) target raised by BMO Capital Markets from $409 to $432 at Outperform. Stock currently around $338\n* Lam Research (LRCX) with two target raises. Stock currently around $650\n   * Deutsche Bank from $575 to $680 at Hold\n   * Credit Suisse from $650 to $750 at Outperform\n* Red Rock Resorts (RRR) target raised by Deutsche Bank from $34 to $41 at Buy. Stock currently around $34\n* Twitter (TWTR) target raised by Arhus from $72 to $82 at Buy. Stock currently around $72\n* UnitedHealth Group (UNH) with a host of target raises after handily beating earnings estimates. Consensus price target $420 at Outperform. Stock currently around $390\n\n*\"The future belongs to those who believe in the beauty of their dreams.\"* \\-Eleanor Roosevelt",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, April 16, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/msbrms/here_is_a_market_recap_for_today_friday_april_16/",
        "created": 1618633722.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1618604953,
        "id": "msbrz1",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, April 16, 2021**\n\nStocks traded higher on Friday, continuing momentum from yesterday’s record-setting close, with a batch of better-than-expected economic and corporate earnings results fueling the recent rally. The S&amp;P 500 (SPY) and Dow Jones (DIA) set fresh intraday records while the tech-heavy Nasdaq (QQQ) traded mostly flat. \n\nAccording to a report by the US Department of Commerce, retail sales boomed 9.8% higher in the month of March as the economy continues to gradually reopen as more vaccines are distributed. Moreover, the Weekly Unemployment report showed first-time unemployment claims plunged far below analyst estimates. The Labor Department reported 576,000 new jobless claims for the week ending April 10. This represents the lowest total first-time unemployment claims filed since August 2020 and a sharp decline from both the previous week’s total of 769,000 and analyst expectations of 710,000. \n\nThis is great news on two fronts. First, consumer spending represents 70% of US GDP ([more info here](https://www.thebalance.com/components-of-gdp-explanation-formula-and-chart-3306015#:~:text=Consumer%20spending%20comprises%2070%25%20of,components%20of%20the%20U.S.%20economy.)) and is a key driver of economic growth. GDP is now expected to increase 6.5% in 2021 according to the Federal Open Market Committee, the central bank's monetary policy-making group. That is sharply higher than the 4.2% forecast made in December of 2020. Second, Jerome Powell and other FOMC members have reiterated that recovery in the labor market “remains uneven and far from complete”. To see a report blow so far past analyst expectation is a great sign the labor market is recovering in tandem with the surge in consumer spending. \n\nMichael Pearce, senior US economist for Capital Economics said of the consumer report, “What caught our eye was the 13.4% surge in spending on food and drink services, while clothing store sales were up by 18.1%. Relative to pre-pandemic levels, food and drink services sales are down just 5.1%, while clothing store sales are now higher than they were in February 2020. That suggests a combination of loosening restrictions and easing of virus fears linked to the vaccine rollout are driving a rapid return to normalcy.” \n\nDistribution of the Johnson and Johnson (JNJ) coronavirus vaccine remains paused in the US following reports of rare blood clots in people who received the vaccine. The agencies are reviewing data over six reported U.S. cases of a severe blood clot in individuals after receiving the vaccine, and have recommended the pause \"out of an abundance of caution,\" the FDA said in a Twitter post. To date, roughly 6.8 million doses of the single-dose JNJ vaccine have been administered. \n\n**Highlights**\n\n* General Motors (GM) and joint-venture partner LG Chem Ltd. plan to invest $2.3 billion to construct a second battery-cell plant as the automaker continues investing in electric vehicles.\n* Morgan Stanley (MS) posted better-than-expected earnings but revealed the company lost $911 million when Archegos Capital Management, Bill Hwang’s family office, imploded last month.\n* NIO is likely to make an official announcement concerning its European expansion plan on May 7 or 8 according to multiple reports. \n* Daimler AG unveiled a new high-tech and luxury all-electric Mercedes called the EQS\n* \\*\\***Please note that current stock price was written in the morning and does not reflect intraday changes\\*\\***\n* Applied Materials (AMAT) target raised by Deutsche Bank from $150 to $160 at Buy. Stock currently around $135\n* Amazon (AMZN) target raised by Credit Suisse from $3940 to $3950 at Outperform. Stock currently around $3379\n* ASML target raised by Wells Fargo from $610 to $750 at Overweight. Stock currently around $642\n* Bank of America (BAC) with two target raises. Stock currently around $39\n   * Robert W. Baird from $38 to $42 at Outperform\n   * Royal Bank of Canada from $37 to $44 at Outperform\n* Blackrock (BLK) target raised by Deutsche Bank from $847 to $912 at Buy. Stock currently around $818\n* Boyd Gaming (BYD) target raised by Deutsche Bank from $67 to $71 at Buy. Stock currently around $65\n* Chipotle (CMG) target raised by KeyCorp from $1625 to $1725 at Overweight. Stock currently around $1542\n* Cisco (CSCO) target raised by Morgan Stanley (MS) from $54 to $57 at Overweight. Stock currently around $51.60\n* Goldman Sachs (GS) target raised by BMO Capital Markets from $409 to $432 at Outperform. Stock currently around $338\n* Lam Research (LRCX) with two target raises. Stock currently around $650\n   * Deutsche Bank from $575 to $680 at Hold\n   * Credit Suisse from $650 to $750 at Outperform\n* Red Rock Resorts (RRR) target raised by Deutsche Bank from $34 to $41 at Buy. Stock currently around $34\n* Twitter (TWTR) target raised by Arhus from $72 to $82 at Buy. Stock currently around $72\n* UnitedHealth Group (UNH) with a host of target raises after handily beating earnings estimates. Consensus price target $420 at Outperform. Stock currently around $390\n\n*\"The future belongs to those who believe in the beauty of their dreams.\"* \\-Eleanor Roosevelt",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, April 16, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/msbrz1/here_is_a_market_recap_for_today_friday_april_16/",
        "created": 1618633753.0
    },
    {
        "author": "Economicz",
        "created_utc": 1617549095,
        "id": "mjy1l5",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "This is a research report written on the company **StrikeForce Technologies, Inc. (SFOR)**. This is my case for StrikeForce’s stock price reaching $4.10 by March 31, 2022. \n\n**StrikeForce's Patented Products:**\n\n**SafeVChat** is the industry's most secure video conferencing platform. With technologies such as patented out-of-band authentication and keystroke encryption. No other competitor in the industry can match SafeVchat's signature 5-Level security control approach. \n\n**PrivacyLok** is a proactive cyber security solution which locks down access to your personal and corporate data. PrivacyLok protects the following key areas that hackers exploit: camera, microphone, speakers, keyboard, clipboard, and screen.\n\n**ProtectID** is designed to deliver flexible &amp; affordable redundant authentication for banks, corporations, universities, government agencies, and social networking websites. ProtectID® can be managed on-premise or via our hosted cloud service.\n\n**GuardedID** protects you by encrypting your keystrokes when you bank, shop and email online. GuardedID’s Premium version will also protect your desktop applications such as MS Office, VPN clients &amp; IM programs.\n\n**MobileTrust** is the most advanced security suite for Apple &amp; Android mobile devices. MobileTrust® protects users’ internet browsing activity, login credentials, online transactions, access to corporate networks, and more. The MobileTrust® bundle includes six of the most powerful must-have security features in the industry.\n\n**Market:**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/l3cn0iiz96r61.jpg?width=624&amp;format=pjpg&amp;auto=webp&amp;s=87d3082899b4d41859bbfbfece7c38910a3878ef\n\nThe market for video conferencing is growing exponentially and is here to stay. Even as the pandemic begins to slow down, people will continue to work from home. Companies are increasingly adopting work from home practices. Companies see the increase in employee morale, strong productivity, and decrease in overhead, among other benefits.\n\nAccording to Upwork, 41.8% of the American workforce continues to work remotely. Although an estimated 26.7% will still be working from home through 2021, 36.2 million Americans (22% of the workforce) will be working remotely by 2025. This is a **staggering 87% increase from the number of remote workers prior to the pandemic**! [https://www.flexjobs.com/blog/post/remote-work-statistics/#:\\~:text=Although%20an%20estimated%2026.7%25%20will,workers%20prior%20to%20the%20pandemic](https://www.flexjobs.com/blog/post/remote-work-statistics/#:~:text=Although%20an%20estimated%2026.7%25%20will,workers%20prior%20to%20the%20pandemic)!\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bd65p6s0a6r61.jpg?width=624&amp;format=pjpg&amp;auto=webp&amp;s=1f5c1393018288dfb2b98b61da86fad95bf48b71\n\n\"A recent study by Deloitte and the Financial Services Information Sharing and Analysis Center found that financial services on average spend **10%** of their IT budgets on cybersecurity. That’s approximately **0.2% to 0.9%** of company revenue or **$1,300 to $3,000** spent per full time employee. For a bigger picture benchmark, consider that Microsoft CEO Satya Nadella recently revealed in a statement that the tech behemoth “will invest more than **$1 billion each year** in cybersecurity for the foreseeable future”. Finally, it’s worth noting that the 2019 U.S. President’s budget allocated **$15 billion** in spending on cybersecurity, about **0.3%** of the entire fiscal budget ($4.746 trillion).\" [https://cybersecurity.att.com/blogs/security-essentials/how-to-justify-your-cybersecurity-budget](https://cybersecurity.att.com/blogs/security-essentials/how-to-justify-your-cybersecurity-budget)\n\n\" **55% of enterprise executives plan to increase their cybersecurity budgets in 2021 and 51% are adding full-time cyber staff in 2021.** PwC found that most executives are planning to ramp up their cybersecurity spending in 2021 despite the majority of them, 64%, expecting business revenues to decline. PwC found that cybersecurity is more business-critical than ever before.\" [https://www.forbes.com/sites/louiscolumbus/2020/12/15/the-best-cybersecurity-predictions-for-2021-roundup/?sh=387b329d5e8c](https://www.forbes.com/sites/louiscolumbus/2020/12/15/the-best-cybersecurity-predictions-for-2021-roundup/?sh=387b329d5e8c)\n\n**\"Next-generation Identity and Access Management, messaging security and network security are the three hot spots of enterprise cybersecurity spending in 2021.** McKinsey sees three hot spots leading enterprise cybersecurity spending in 2021. These include Identity and Access Management, messaging and network security. McKinsey predicts perimeter and **endpoint security**, secured automation and security for trusted third parties. The following graphic compares cybersecurity spending by technology and organization.\" [McKinsey and Company, COVID-19 crisis shifts cybersecurity priorities and budget, July 21, 2020](https://www.mckinsey.com/business-functions/risk/our-insights/covid-19-crisis-shifts-cybersecurity-priorities-and-budgets)\n\n**Competitors:**\n\nZoom Video Communications, Microsoft Teams, Webex by Cisco, GoToMeeting by LogMeIn, BlueJeans by Verizon. \n\nAlthough StrikeForce has many competitors, there is a major difference between these products. The other video conferencing solutions were not built from the ground up with cybersecurity in mind. Cyber security is critical in today's interconnected world. You have all heard about the latest Zoom breaches in which hackers exploited video conferences and stole nonpublic confidential information from corporations. They are also hacking video conferences and displaying pornographic images and other illegal activity. This is happening all across these companies because their video conferencing platforms are not fully locked down with the proper cyber security products. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/7947nk82a6r61.jpg?width=1273&amp;format=pjpg&amp;auto=webp&amp;s=8fc144aea98d478b09b6f392eb5164cc9a20d26a\n\n**Catalysts for StrikeForce Technologies, Inc. (SFOR):**\n\n\\- In the process of securing $5-10MM of debt, not toxic convertible debt that will dilute shareholders. This will be strictly debt, no equity. \n\n\\- Very close to upgrading SafeVChat to include contact import, room breakouts, and screen recording. There are very large clients talking closely with StrikeForce and waiting to sign up when these features are added. \n\n\\- Already signed up hundreds of companies. This revenue will be reflected on the Q2 financials and beyond. StrikeForce started requiring payment in March as the major testing phase completed. \n\n\\- Eliminated $900M of variable convertible debt. **ALL toxic convertible debt has been eliminated**. \n\n\\- Is the only video conferencing product designed with 5-Level security. Available on both Android and IOS.\n\n\\- Reduced Authorized Shares from 14 billion to 4 billion.\n\n\\- “StrikeForce is now in the process of also **applying for the OTCQB, and hopefully sometime this year uplifting to the NASDAQ**. This is something that we have been planning for quite a while now, and giving our new game-changing products we have very high expectations for this year,” says Kay.\"\n\n\\- Zoom breaches will thrust the importance of cyber security integrated with video conferencing into the spotlight. Companies will increasingly search for a more secure solution.\n\n\\- **Kevin O'Leary (Mr. Wonderful from Shark Tank)** recently mentioned StrikeForce on CNBC when talking about video conferencing companies. \n\n[https://twitter.com/showmeyourputs/status/1347605007215034376](https://twitter.com/showmeyourputs/status/1347605007215034376)\n\n\\- “With countless reports of ‘Zoom bombings’ and other video conferencing-related cyber-attacks, the launch of this new service comes at a crucial juncture where we’ve grown more dependent than we could have imagined on these unsecure platforms,” said **Steve Cooper, former CIO, U.S. Department of Commerce, the Federal Aviation Administration, the U.S. Department of Homeland Security, and Advisory Board Chairman for StrikeForce**. “Video conferencing is here to stay, and SafeVchat offers a secure option that will become an essential tool for any organization looking to confidently keep both their own, and their customer data safe while maintaining complete compliance.”\n\n**Financial Projections &amp; Stock Price Analysis:**\n\nAs of closing on 04/01/2021 - OTCMarkets Website\n\nStock Price: $.1049\n\nOutstanding Shares: 807,277,505\n\nMarket Cap: $84,683,410\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gqtq8ed3a6r61.jpg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=c3267059feaa4261e14c41a0de6732e7a851d35a\n\n[https://www.youtube.com/watch?v=JXA13M0Fnl8&amp;t=892s](https://www.youtube.com/watch?v=JXA13M0Fnl8&amp;t=892s)\n\nTo establish the following price target I took the grand total projected revenue of $12,475,000 and divided by the trailing 12 month revenue of $319,190. That gave me a multiplier which I used for the closing price as of 04/01/2021 which was $0.1049.\n\n**2021 Price Target: ($12,475,000 / $319,190) x $0.1049 =**  **$4.10.** \n\n**Disclaimer:**\n\nI am long SFOR and this research report is not a recommendation to buy or sell StrikeForce Technologies, Inc. This is my research and conclusion on the future of this stock. I wanted to share with everyone. I will continue to keep everyone updated on this stock. If you would like me to continue posting research reports for other stocks, please let me know. I wish you all well in your investing and trading!\n\n**Website Links:**\n\n[**https://www.strikeforcetech.com/**](https://www.strikeforcetech.com/)\n\n[**https://www.safevchat.com/**](https://www.safevchat.com/)\n\n[**https://www.privacylok.com/**](https://www.privacylok.com/)",
        "subreddit": "pennystocks",
        "title": "The Case for StrikeForce Technologies (SFOR) - $4.10 by March 31, 2022",
        "url": "https://www.reddit.com/r/pennystocks/comments/mjy1l5/the_case_for_strikeforce_technologies_sfor_410_by/",
        "created": 1617577895.0
    },
    {
        "author": "DISDD",
        "created_utc": 1617456574,
        "id": "mj8itm",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "options",
        "title": "+$65MM Deep ITM Calls purchased for CSCO on Thursday. Someone likes the stock...",
        "url": "https://www.reddit.com/gallery/mj8itm",
        "created": 1617485374.0
    },
    {
        "author": "gintdm",
        "created_utc": 1619456361,
        "id": "mz2c4g",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hello Traders and Investors! An exciting week ahead of us, here is my weekly newsletter which I share every Monday to help prepare you for the week! Feel free to DM me and happy trades!\n\n**Week of 4/26/21**\n\nThe S&amp;P500 opened Monday 4/26/21 at 4185.03, above the previous close of 4180.05 on Friday 4/23/21.\n\nChip manufacturers have been inundated with demand following 2020’s COVID shutdowns and the, undoubtedly correlated, increase in demand for consumer electronics. Cisco, one of the world’s largest chip manufacturers, is struggling to keep up with demand.\n\nCisco revealed several steps it is taking to alleviate the imbalance in supply and demand including a $4.5 billion acquisition of Acacia Communications and a $20 billion plan to build two new manufacturing plants in Arizona. Cisco CEO Chuck Robbins commented extensively on the situation, and estimates it could “...\\[take\\] another six months…” for the company to resume normal operation. Around 85% of all internet traffic passes through Cisco hardware.\n\nThe effects of the shortage can be seen across industries. Among companies affected by the shortage are car manufacturers. Wayne Griffiths, head of VW’s Spanish brand, spoke on the issue, stating that the company will, “...need to face considerable challenges in the second quarter…” So far the shortage has prevented the company from building over 100,000 vehicles.\n\nThe United States Government has also expressed concern regarding the chip shortage. United States President Joe Biden held a conference with business leaders earlier this month to address the issue. During the conference the President expressed a desire to move more chip manufacturing into American plants, citing 75% of global manufacturing as being based in East Asia.  \nMeanwhile Taiwan-based chip manufacturing giant TSMC has announced a plan worth $100 billion USD to expand their companies manufacturing capacity. The announcement comes in tandem with company founder Morris Chang’s plea to the Taiwanese government for increased support, citing a fear that if the Taiwan-based manufacturer fails to meet demand US or Chinese manufacturers will fill the gap.\n\nThe increase in demand for electronics caused by the pandemic has boded well for Apple, who reports earnings on Wednesday. Analysts are looking for the technology giant to post earnings of $0.98 on revenue of $77 billion after a strong Q2 for sales. The earnings call comes on the heels of Apple’s first product showcase of the year last Wednesday, and the company’s announcement that it will be taking steps to increase its footing in the instant messaging market. Apple stated it plans to increase the amount of features provided by it’s iMessage app, with the objective being to bring it more in line with popular messengers offered by Facebook, WhatsApp, and Snapchat.\n\nMicrosoft will report earnings Tuesday. Analyst estimates place earnings around $1.78 per share over $43 billion in revenue. Microsoft, who also saw an increase in demand for its technology as a result of the pandemic, has greatly benefitted from an increased demand for cloud-services. Microsoft’s cloud-based service hub, Azure, posted 2020 growth of 43%. The company expects to post great earnings despite the current chip-shortage, having generated much of its growth from the pandemic in the software-as-a-service sector.\n\nExecutives from Facebook, Twitter, and Youtube will testify before a U.S. Senate Judiciary hearing committee on Tuesday. The executives have been called to testify on the use of algorithms to dictate what consumers watch and read on the popular platforms. The hearing comes amid concerns that manipulative practices have led to massive distribution of misinformation, with repercussions that reverberate throughout society. The practice of purposefully serving consumers misinformation has been dubbed “algorithmic amplification,” and the results of the hearings could have a significant impact on the social media industry. All three companies will report earnings this week.\n\nOPEC will hold its opening session Wednesday. The conference will take place over the course of the day, and will include remarks from prominent Russian and Saudi chairman. The conference is meant to be informative and expected to feature little remark on policy. However speculation that additional information on a potential NOPEC bill could have an impact on U.S. trading. The conference comes one day before North American oil giants Exxon and Shell report earnings.\n\nFederal Reserve Chairman Jerome Powell will hold a press conference at 2:30PM Wednesday. Powell’s recent statements at press conferences have highlighted an economy which although largely recovered, still faces a degree of risk in the face of the pandemic. Powell stated in an April 11th CBS interview, “The principal risk to our economy right now really is that the disease would spread again more quickly.” Powell’s comments come a day before advanced release of the Q1 U.S. GDP, which Bank of America analysts predict will show a real growth rate of 6.5%.\n\n**Some of the Companies with Earnings this Week**\n\n**Monday, April 26th:**  \nAmong others, Tesla (TSLA) will hold earnings calls today. Tesla looks to top analyst estimates of $0.75 EPS on $10.5 billion in revenue after a successful quarter for delivery numbers in the face of the ongoing chip shortage.\n\n**Tuesday, April 27th:**  \nMicrosoft  \nGoogle  \nStarbucks  \nGeneral Electric  \nVisa  \nAMD  \nCapital One  \nUBS  \nHasbro  \n**Wednesday, April 28th:**  \nApple  \nSony  \nFacebook  \nShopify  \nEbay  \nFord  \nQualcomm  \nBoeing  \nGeneral Dynamics  \nRockwell Automation  \nRaymond James Financial Inc\n\n**Thursday, April 29th:**  \nAmazon  \nSamsung  \nMastercard  \nComcast  \nMcDonald's  \nShell  \nCaterpillar  \nNorthrop Grumman Corp  \nTwitter  \nNewmont Mining Corp  \nDr. Pepper Snapple Group  \nThe Hershey Co  \nWestern Digital  \nLogitech\n\n**Friday, April 30th:**  \nAlibaba  \nExxon  \nChevron  \nCharter Communications",
        "subreddit": "StockMarket",
        "title": "What's Happening in the Markets: Week of 4/26/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mz2c4g/whats_happening_in_the_markets_week_of_4262021/",
        "created": 1619485161.0
    }
]