[
    {
        "author": "JohnLouis24",
        "created_utc": 1620498767,
        "id": "n7vfd5",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "The following is an excerpt taken from StockTwits user “DTGoody”\n\n*The Problem*\n\nIoT devices are a powerful new technology, however, they also create new opportunity for hackers as billions of new entry points that can result in devastating losses for the businesses using them. An enormous and growing unmet need for effective cybersecurity for IoT is demonstrated very clearly by the soaring number of breaches that continue to result in millions of dollars per incident and billions of dollars in losses every year. \n\nAs Niraj Kadakia of IBM Business Development and Embedded Analytics stated above, we clearly have vulnerabilities and a big unmet need for improved secure IoT solutions. \n\n*The Solution*\n\nLife On Earth, Inc. (LFER: OTC) recently announced their Binding Letter of Intent to purchase 100% of SmartAxiom, Inc., a provider of patented technologies based cyber security with unbreakable block chain based IoT solutions for multiple industries that include machine to machine (M2M) communications. \n\nThere are competing cybersecurity solutions for IoT, however, none yet seems to work well enough to prevent hackers from stealing valuable data. \n\nSmartAxiom has built a patented solution based on the decentralized ledger of Blockchain that is getting the attention of big users such as, CSCO, INTC, IBM, MRVL, TOY, HPE, Volvo, Mazda, Xerox, MSFT, Amazon Web Services, Renesas, NXP, NuLeds, boa, Globe Teleservices. \n\nThe next excerpt (below) is from StockTwits user “Chris T” - He does a good job on explaining the significance of the recent $1.6M investment made on LFER by Joseph A:\n\nFor those who don't know who Joseph Abrams is.....see below: \n\nSource:https://www.cicerotransact.com/team \n\nJoe Abrams is co-founder of The Software Toolworks, a publicly held developer, publisher, and distributor of educational and entertainment software, which was sold to Pearson, Plc. for $462 million. Mr. Abrams also co-founded Intermix, the predecessor company to MySpace, which was sold to News Corp. in 2005 for $580 million. He has also served on the Board of Advisors for Akeena Solar and and was an adviser to ZAAG, assisting in public offerings, acquisitions and capital raisings. \n\nMr. Abrams specializes in emerging growth companies in several areas including: technology, drug discovery technology services, consumer products,big data and online job placement. Mr. Abrams also sits on University of Rochester Simon School of Business Executive Advisory Committee.",
        "subreddit": "pennystocks",
        "title": "$LFER - Plans to acquire SmartAxiom Inc. (HUGE NEWS)",
        "url": "https://www.reddit.com/r/pennystocks/comments/n7vfd5/lfer_plans_to_acquire_smartaxiom_inc_huge_news/",
        "created": 1620527567.0
    },
    {
        "author": "JeanettaFairbat4",
        "created_utc": 1621587448,
        "id": "nhnxnl",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "$PHUN Stock Analysis📈, should we buy Phunware? PHUN partnered with Hewlett Packard Enterprise (HPE)",
        "url": "https://www.youtube.com/watch?v=FFDhZw0-98k",
        "created": 1621616248.0
    }
]