[
    {
        "author": "Beginning_Cause_8487",
        "created_utc": 1634826764,
        "id": "qct5od",
        "num_comments": 140,
        "num_crossposts": 0,
        "selftext": "Global datastream is exploding (clouds, sensors, internet,...) and these systems/devices can't hold this anymore. The world is looking for solutions. Because of the **numerous advantages of \"photons\" (light) in comparison with \"electrons\"**, photonic circuits (to \"use\" this photons) will be implemented in almost every electronic device (**datacom, 5G, LiDAR , medical devices, sensors, quantum computing, neurotrophic computing,...**) and thereby replacing the old, expensive and limiting electronic structures, in the near future (couple years from today).\n\n**Just like the internet, hydrogen, electric vehicles, green stocks,...the photonic circuit market is forecasted to take off.** Timing: we are now at the inflection point. The global market for Photonic Integrated Circuits (PICs) is projected to reach US$3.7 billion by the year 2027, trailing a post COVID-19 **CAGR of 22.7%** over the analysis 2020 through 2027.\n\nAfter years of development by a topclass highly experienced team, **POET Technologies (POETF)** now has the technology (the \"POET interposer platform\") to use photons in devices with outstanding performance, well covered by &gt;70 patents. POETs solution eliminates costly discrete component testing and packaging processes because it is produced with all the customer's custom componentry at wafer scale (nothing needs to be soldered, connected, positioned and so forth later on, after the chips have been sliced and diced out of their wafer). Each interposer is tested and verified while it is still within the wafer with its hundreds of siblings. Imagine the time a cost savings of being able to do that. Potential customers: facebook, broadcom, arista, nokia, alibaba, accelink, jabil, delta, hisense, huawei,... They also have **4 committed customers** (POET said they will announce more info soon), lots of requested **samples**, two **design wins** and a joint venture with **SANAN IC** for mass production soon. **Nasdaq** (in q4/q1) ticker \"POET\" is reserved. Their first market of interest is **datacom**. Price target: **9,56usd**, 12-18 months (Investment bank IBK Capital Corp). **DD/POET: reddit page.**\n\n**Other companies diving into photonics: Lightwave Logic, Intel, NeoPhotonics -**\\&gt; check them out as well. They have very good/brilliant tech, but, they all still have fundamental flaws that POET's optical interposer platform improves upon. Photonic devices depend on a high coupling of light. POET's waveguides are low (light) loss. Intel and Cisco's solutions are high loss in comparison. POET's solution can work with a wide variety of light, from visible to near infrared. Intel and Cisco's solutions can't. Intel and Cisco's solution have no micro-optics integration capability where as POET's platform does. Perhaps most importantly, Intel and Cisco's solution can't scale, where as POET's can. A **partnership** with for example LWLG (skyrocketed in june) is absolutely possible.\n\nA product (the POET interposer platform) that completely outperforms (e.g. most versatile, lowest noice, lowest costs, highest speed) the current industry standard in a huge new market in front of us, I personally think that's **very interesting, so I want to share this with everyone here** (I read here: \"don't hesitate to tell us about a ticker we should know about\"). Also, most people still don't know this is happening. I hope everyone can at least think about it. I hope we can have a **nice conversation** about this and share our thoughts. Questions can be asked. For people downvoting or nonbelievers, I want to hear **your opinion**. Thanks to everyone in advance. Not financial advice.",
        "subreddit": "pennystocks",
        "title": "\"Photonic Integrated Circuits\" is projected to become a billion dollar industry. Get ready.",
        "url": "https://www.reddit.com/r/pennystocks/comments/qct5od/photonic_integrated_circuits_is_projected_to/",
        "created": 1634855564.0
    },
    {
        "author": "MFiech",
        "created_utc": 1635579669,
        "id": "qiwk0p",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "Hey guys, upcoming earnings! Which ones are you waiting for most?\n\nWhat is ahead of us:\n\nhttps://preview.redd.it/htoevuudkjw71.png?width=1772&amp;format=png&amp;auto=webp&amp;s=9c21c1fde2ad573d1a09a3fca5211bca4123f4ac\n\n**MON**\n\nBMO: $ON $CNA $ALX $PCG $JELD $TKR $TRVG $AMG $ENBL $LDI $BEN\n\nAMC: $CHGG $NXPI $CLX $FANG $SPG $RIG $MOS $ANET $CLR $CAR $WMB $ZI $O $NTR\n\n**TUE**\n\nBMO: $CRSR $RACE $UAA $CTLT $BP $EL $GPN $GNRC $LPX $RL $ARCB $EPO\n\nAMC: $AMC $APPS $ATV $ZG $TMUS $LYFT $VRTX $AYX $PGR $SEDG $DVN $XPO\n\n**WED**\n\nBMO: $CVS $BCRX $WING $NCLH $MAR $DISCA $EXPI $CWH $EAT $LL $SMG $CPRI\n\nAMC: $ROKU $ETSY $QCOM $FSLY $SKLZ $TTWO $ET $MRO $SPWR $SAND $MGNI $EA $CAKE\n\n**TH**\n\nBMO: $MRNA $PENN $VIAC $GOLD $NKLA $W $ERJ $CYBR $HIMX $DDOG $MBUU $VSTO $REGN\n\nAMC: $PINS $ABNB $PTON $SQ $RKT $UBER $SWKS $BNGO $NVAX $NET $MELI $OXY $DBX\n\n**FRI**\n\nBMO: $COIN $DKGN $CGC $GT $MGA $ENB $TEN $AMXC $CNK $D $ELAN $FLR",
        "subreddit": "wallstreetbets",
        "title": "Most Anticipated Earning Releases for the week beginning November 1st, 2021 - it's a big one!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qiwk0p/most_anticipated_earning_releases_for_the_week/",
        "created": 1635608469.0
    },
    {
        "author": "MFiech",
        "created_utc": 1635580077,
        "id": "qiwn3i",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Hey guys, upcoming earnings! Which ones are you waiting for most? Where do you listen to them in real-time?\n\nWhat is ahead of us:\n\nhttps://preview.redd.it/yidwnbbqljw71.png?width=1772&amp;format=png&amp;auto=webp&amp;s=0dd2a0e240f65b3a2232a9c90dcfa4c0b09f51a7\n\n**MON**\n\nBMO: $ON $CNA $ALX $PCG $JELD $TKR $TRVG $AMG $ENBL $LDI $BEN\n\nAMC: $CHGG $NXPI $CLX $FANG $SPG $RIG $MOS $ANET $CLR $CAR $WMB $ZI $O $NTR\n\n**TUE**\n\nBMO: $CRSR $RACE $UAA $CTLT $BP $EL $GPN $GNRC $LPX $RL $ARCB $EPO\n\nAMC: $AMC $APPS $ATV $ZG $TMUS $LYFT $VRTX $AYX $PGR $SEDG $DVN $XPO\n\n**WED**\n\nBMO: $CVS $BCRX $WING $NCLH $MAR $DISCA $EXPI $CWH $EAT $LL $SMG $CPRI\n\nAMC: $ROKU $ETSY $QCOM $FSLY $SKLZ $TTWO $ET $MRO $SPWR $SAND $MGNI $EA $CAKE\n\n**TH**\n\nBMO: $MRNA $PENN $VIAC $GOLD $NKLA $W $ERJ $CYBR $HIMX $DDOG $MBUU $VSTO $REGN\n\nAMC: $PINS $ABNB $PTON $SQ $RKT $UBER $SWKS $BNGO $NVAX $NET $MELI $OXY $DBX\n\n**FRI**\n\nBMO: $COIN $DKGN $CGC $GT $MGA $ENB $TEN $AMXC $CNK $D $ELAN $FLR",
        "subreddit": "smallstreetbets",
        "title": "Most Anticipated Earnings Releases for the week beginning November 1st, 2021 - it's a big one!",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/qiwn3i/most_anticipated_earnings_releases_for_the_week/",
        "created": 1635608877.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1635567600,
        "id": "qitthn",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 1st, 2021.\n\n# **Markets could be challenged in the week ahead as the Fed prepares to reverse easy policy - [(Source)](https://www.cnbc.com/2021/10/29/markets-could-be-challenged-in-the-week-ahead-as-the-fed-prepares-to-reverse-easy-policy.html)**\n*****\n&gt; The Federal Reserve is expected to take its first major step away from the easy policy it put in place to fight the pandemic, a milestone on the road back toward normal.\n*****\n&gt; The Fed’s two-day meeting Tuesday and Wednesday is the big event for markets in the week ahead. The central bank is widely expected to announce that it will begin to unwind its $120 billion in monthly bond purchases and end the program entirely by the middle of next year.\n*****\n&gt; Economic data will also be important, with the October jobs report on Friday. There are dozens of earnings expected, including pharmaceuticals like Pfizer and Moderna, as well as a host of travel, energy, insurance, and tech companies.\n*****\n&gt; The Bank of England also meets Thursday, and it is expected to raise interest rates. The move comes after rate hikes by South Korea, Norway and others.\n*****\n&gt; “The Fed is part of a global move to remove accommodation, and the market drives right past that,” Bleakley Advisory Group CIO Peter Boockvar said. “In a way, the stock market is playing a game of chicken, with this inflation move and interest rates and the response from central banks.”\n*****\n&gt; Inflation has been running at a 30-year high. Core PCE inflation — which is the Fed’s preferred gauge —jumped 3.6% in September on a year-over-year basis, the same as in August.\n*****\n&gt; Stocks were higher on the week, with the S&amp;P 500 up about 1.1% as of Friday afternoon and up roughly 6.7% for the month of October. Both the Dow and S&amp;P 500 notched new highs in the past week. The widely watched 10-year Treasury yield was at 1.53% Friday afternoon.\n*****\n&gt; “There is an incredible level of complacency out there in this environment,” Boockvar said.\n*****\n&gt; Other events the markets are monitoring include the gathering of world leaders at the G-20 in Italy and the United Nations climate summit COP26, beginning Sunday in Scotland.\n*****\n&gt; # ‘Wild week’\n“You’re going to have a wild week,” Wells Fargo’s Michael Schumacher said. He noted that the Fed’s action will dominate the week, and the jobs report will be secondary.\n*****\n&gt; Wells Fargo economists expect 390,000 jobs were added in October and average hourly earnings grew by 0.4%, he noted. Payrolls were up just 194,000 in September. Schumacher said inflation is the biggest concern in the markets, so the wage data will be most closely watched.\n*****\n&gt; Schumacher said the market is widely expecting the Fed to announce it will reduce its bond purchases by $15 billion a month, starting either in November or December. The central bank implemented its $120 billion monthly bond-buying program in early 2020, as it slashed rates and introduced programs to buy a range of assets to help keep the markets liquid.\n*****\n&gt; Now, as the program is being wound down, it is what Fed Chairman Jerome Powell says about inflation that matters most because that will drive interest rate expectations.\n*****\n&gt; Yet, Powell is expected to stress that the Fed is not automatically going to raise interest rates once the bond purchases end in the middle of next year. Traders are pricing in as many as three interest rate hikes next year, but in the latest Fed forecast, only half of central bank officials agreed there should be even one.\n*****\n&gt; “The inflation commentary is a lot more important,” Schumacher said. “Powell has sounded concerned about expectations getting baked in.” He noted that the 2-year yield, which most reflects the Fed, has risen more than 30 basis points since the last Fed meeting five weeks ago.\n*****\n&gt; Schumacher said market expectations for rate hikes may be overdone, and that he does not expect a move until the beginning of 2023. “The direction is right, but the speed is wrong,” he said.\n*****\n&gt; Powell’s comments will be closely watched for any adjustment in his thinking on inflation. The Fed had described the surge in rates as “transitory” or temporary. The consumer price index has been running above 5%, and core CPI was at 4% in September.\n*****\n&gt; “The general feeling among central bankers and the major central banks is this inflation rate will come back down,” TIAA Bank president of world markets Chris Gaffney said. “Nobody is using ‘transitory’ anymore, but they don’t feel like we’re going to have prolonged high inflation.”\n*****\n&gt; Gaffney said the weaker-than-expected 2% growth in third-quarter gross domestic product could help the Fed convince the markets that it intends to keep rates lower for longer.\n*****\n&gt; “As long as they stay accommodative, I think the recovery continues,” he said. “I’m fairly bullish for the markets going forward. We’ll certainly see a lot more choppiness, but I still think the global economy, the U.S. economy particularly, is right now a great environment for corporations. We’re seeing fairly positive earnings reports, and more importantly expectations for future earnings.”\n*****\n&gt; There have been some high-profile misses, including both Apple and Amazon this past week. Both their stocks fell, weighing on the Nasdaq down Friday.\n*****\n&gt; “Earnings overall have been good, but there’s still a lot of profit margin challenges out there,” Boockvar said. “There’s no better example than Apple and Amazon.”\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/kID8drk.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/kpeo12w.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/mgqDnIk.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/feNGOpc.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/uaTjkhx.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GDzFNzM.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/r8J2LuB.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qWy1mUR.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/kGexB3t.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/K4NfO23.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/TglfDZd.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/2HOk4x5.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/vcv5Pne.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/GgX6FOh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/PmzM56I.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/d5RZesR.png))**\n\n*****\n\n&gt; # November’s First Trading Day: DJIA Up Over 1% Three Years in a Row\n\n&gt; Based upon data in the 2022 Stock Trader’s Almanac on page 90, the first trading day of November is the fourth best of all monthly first trading days since September 1997 based upon total DJIA point gained. DJIA, S&amp;P 500 and NASDAQ have all advanced 13 times over the last 21 years. Average performance on the day ranges from a low of 0.17% by S&amp;P 500 to 0.28% by NASDAQ over the 21-year time period.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/0362ad93159683f932d60b790bfa9ac8/e57961a120ac1354-3a/s500x750/517dc1575ee1212443153f2b842289d3b9eda639.jpg))**\n\n*****\n\n&gt; # Here Comes One of the Best Days of the Year (and the Best Week and Month)\n\n&gt; The calendar is about to do a lot of favors for the bulls, as late October and early November historically are quite strong.\n\n&gt; October 28 was the best day of the year, until it fell more than 3% last year, but this day is still one of the strongest days historically for stocks. Not to be outdone though, October 29 and November 2 and 3 are also some of the better days of the year. “I’d like to think it has something to do with my birthday being on October 28, but the truth is bulls should be aware that the coming days are historically some of the best of the year,” explained LPL Financial Chief Market Strategist Ryan Detrick.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/10/10.27.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; As shown in the LPL Chart of the Day, the single best day to buy at the close and hold for the next five trading days is today, October 27. Yes, these 5 days were lower last year by 0.6%, but you have to go back to the late 1960s to see the last time they were down two years in a row.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/10/10.27.21-Blog-Chart-2.png?ssl=1))**\n\n&gt; Lastly, November has been quite strong historically. In fact, since 1950, and the past 10 years, it is the best month of the year, while it ranks second over the past 20 years and during a post-election year. “November is the best month of the year, but it doesn’t seem to get nearly as much love as you’d think,” added Ryan Detrick. “We all assume December is the best month, but November is actually better and gets very little fanfare. Maybe it should be a month for the bulls, not for turkeys.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/10/10.27.21-Blog-Chart-3.png?ssl=1))**\n\n*****\n\n&gt; # Year’s Best 3-Month Span About To Start\n\n&gt; November, December and January constitute the year’s seasonally strongest 3-month period for the S&amp;P 500, Dow Jones Industrials and the NASDAQ Composite. This seasonal strength is created by a combination of the annual, semiannual and quarterly operations of institutions and the habitual behavior of retail investors and consumers.\n\n&gt; The November-January 3-month span has produced a gain of 4.3% for the S&amp;P 500 &amp; DJIA since 1949. October-December runs a close second at 4.1% for S&amp;P and 3.9% for DJIA. Since 1971 NASDAQ has gained a whopping 6.3% November-January with December-February in second at 5.0% and October-December in third at4.4%.\n\n&gt; These charts also highlight the Best and Worst Months of the year with the Best running from October/November to April/May/June and the Worst from May/June/July to September/October. Stocks have been firming up since we issued our Seasonal MACD Buy Signal to subscribers on October 8 and look poised for a solid yearend rally that continues into early 2022.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/e010745ce0513ef26c01ad558f3324d0/5de97b698922b56d-fc/s500x750/77e7204b6cd2e2850a23200d70c176145dea1f34.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/bd388d961bd47113bc428f68d2326639/5de97b698922b56d-6f/s500x750/f04c4e20d4d9d98fd0b02b7f8472b21dfd8fa543.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/a218e808de4cf5062ba7fe2829c50222/5de97b698922b56d-58/s500x750/0adaf5599c04919e8fb8fca7e5a5129f414f0ccb.jpg))**\n\n*****\n\n&gt; # Short Term Breadth Takes Off\n\n&gt; One of the points noted about the recent moves for the S&amp;P 500 over the past few days have been on the outsized impacts of big gains or losses in names like Tesla (TSLA) or Facebook (FB). In spite of the impacts of those single names, the S&amp;P 500's return to record highs has happened on very strong breadth across sectors. Below, we show 10-day advance-decline line charts from our Sector Snapshot.\n\n&gt; The 10-day advance/decline line measures the average daily number of advancers minus decliners in an index or sector over the last ten trading days. It's a short-term breadth measure that traders use to measure how extended the market is at the moment. Very high readings suggest that the market might be overbought in the near term, and downside mean reversion can be expected. Very low readings suggest the opposite -- that the market might be oversold in the near term, and upside mean reversion can be expected.\n\n&gt; For the broad S&amp;P 500, the 10-day AD line has hit the highest level since February 12th. Going back to 1990, the current reading stands in the 97th percentile. Looking at each sector, most lines are also in the upper decile of readings since 1990 and only two are not currently overbought: Communication Services and Consumer Staples. Meanwhile, some like Technology and Real Estate are a full two standard deviations above the historical norm. In fact, the Tech sector's line is the most elevated relative to its respective history of any sector with the current reading in the 98th percentile of all periods. The last time that the line was as elevated as now was in November of last year. No other sector has as long of a gap in time in which it has seen levels similar to the current reading. Most other sectors have seen higher readings as recently as August or September, though current levels are nonetheless elevated. The market has had quite the run over the last two weeks, and we'd expect some sort of cool-off period soon.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/102621-AD-Lines.png))**\n\n*****\n\n&gt; # High Number of Record Highs\n\n&gt; Major US equity indices have returned to all-time highs in the second half of October with the S&amp;P 500 and Dow both hitting record levels today. Meanwhile, the NASDAQ Composite is roughly a quarter of one percent away and the closest to a new all-time high since the last one on September 7th. The Russell 2,000, on the other hand, is at the high end of the past several months' range, but it is still over 2% below its high from March 15th.\n\n&gt; With the S&amp;P 500 having been at new highs over the past few days, it has made 57 new all-time highs year to date. As shown in the top-left chart below, there have only been three other years in the past that have seen more record highs during the full course of the year: 2017 (62), 1964 (67), and 1995 (78). For the other major indices, the pace of record highs is less impressive but still strong. The Dow has made 38 new highs in 2021 which is more than triple the historical average. This year is on pace to see the highest number of record highs for the index since 2017 when it tied 1991 for the record of 71 closes at an all-time high. The NASDAQ Composite has also seen a solid number of highs at 36 which is well above the historical average of 19 per year historically. Given the index has been rangebound essentially all year, the Russell 2,000, conversely, has only seen 13 closing record highs. That is the same number as last year and it is actually below the average of 20 per year historically.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/102621-Highs.png))**\n\n*****\n\n&gt; # Sentiment Steps Back\n\n&gt; The weekly sentiment survey from AAII saw a surge in optimism in recent weeks, but it took a step back this week even with the S&amp;P 500 at new highs. Bullish sentiment fell from a recent high of 46.9% down to 39.8% this week. Outside of last week, that is still the highest level since the first week of September.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/102821-AAII-Bulls.png))**\n\n&gt; While bullish sentiment saw a significant 7.1 percentage point drop, a relatively small share of those losses turned to the bearish camp. Bearish sentiment only rose 1.6 percentage points to 29.4%. That is still below levels from two weeks ago and is in line with the average from throughout the summer.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/102821-AAII-Bears.png))**\n\n&gt; The corresponding moves in bullish and bearish sentiment resulted in the bull-bear spread to fall but bulls continue to outweigh bears by 10.4 percentage points.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/102821-AAII-Spread.png))**\n\n&gt; As previously mentioned, the largest share of losses to bulls did not go to bears, but instead were picked up by those reporting neutral sentiment. That reading moved back above 30% this week gaining 5.3 percentage points. Again, that does not mark any sort of new high or low but instead brings sentiment back to similar levels seen only a month or two ago.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/102821-AAII-Neutral.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending October 29th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=7J1pI0oKgfc))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 10.31.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=ULZcEQ_jrGQ))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$ROKU $ETSY $QCOM $SKLZ $CVS $PINS $ABNB $PTON $SQ $NET $MELI $COIN $UBER $DKNG $CGC $ANET $Z $O $CRSR $UAA $BP $MRNA $PENN $NKLA $DDOG $AMC $APPS $ATV $ZG $LYFT $AYX $SEDG**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/K4NfO23.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/yNvjYdz.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES FOR THE MONTH OF OCTOBER 2021!](https://i.imgur.com/xrMCop9.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.1.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1HjIZmQ.png))\n\n&gt; # ***Monday 11.1.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/RRqg74t.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/avWgBsY.png))\n\n*****\n\n&gt; # ***Tuesday  11.2.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/AVmJrqk.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/ZL4zIEJ.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/pu0rSTI.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/1QvRj3E.png))\n\n&gt; # ***Tuesday 11.2.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/pKBLcCr.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/vs8JYzt.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/KSZfOxu.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/22llulj.png))\n\n*****\n\n&gt; # ***Wednesday 11.3.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/5xvlEsx.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/dUKTga5.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/WIQE41Q.png))\n\n&gt; # ***Wednesday 11.3.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/qbszriq.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/gTvadI5.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/UQ7xxIj.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/4sdRUU3.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #5!](https://i.imgur.com/HhKzTns.png))\n\n*****\n\n&gt; # ***Thursday 11.4.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/1RpKYW9.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/HUdV9c3.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/MpQcalu.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/rfIsdDF.png))\n\n&gt; # ***Thursday 11.4.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/erVoSwI.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/ld7QKJC.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/JE43M9C.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/HFaILZk.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #5!](https://i.imgur.com/ZzQa2SJ.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #6!](https://i.imgur.com/xZChhTM.png))\n\n*****\n\n&gt; # ***Friday 11.5.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/qZ8WshK.png))\n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/R0yobEv.png))\n\n*****\n\n&gt; # ***Friday 11.5.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tmcJekX.png))\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n&gt; **(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket. :)",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning November 1st, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/qitthn/wall_street_week_ahead_for_the_trading_week/",
        "created": 1635596400.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1635599582,
        "id": "qj18a5",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Good Friday evening to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 1st, 2021.\n\n# **Markets could be challenged in the week ahead as the Fed prepares to reverse easy policy - [(Source)](https://www.cnbc.com/2021/10/29/markets-could-be-challenged-in-the-week-ahead-as-the-fed-prepares-to-reverse-easy-policy.html)**\n*****\n&gt; The Federal Reserve is expected to take its first major step away from the easy policy it put in place to fight the pandemic, a milestone on the road back toward normal.\n*****\n&gt; The Fed’s two-day meeting Tuesday and Wednesday is the big event for markets in the week ahead. The central bank is widely expected to announce that it will begin to unwind its $120 billion in monthly bond purchases and end the program entirely by the middle of next year.\n*****\n&gt; Economic data will also be important, with the October jobs report on Friday. There are dozens of earnings expected, including pharmaceuticals like Pfizer and Moderna, as well as a host of travel, energy, insurance, and tech companies.\n*****\n&gt; The Bank of England also meets Thursday, and it is expected to raise interest rates. The move comes after rate hikes by South Korea, Norway and others.\n*****\n&gt; “The Fed is part of a global move to remove accommodation, and the market drives right past that,” Bleakley Advisory Group CIO Peter Boockvar said. “In a way, the stock market is playing a game of chicken, with this inflation move and interest rates and the response from central banks.”\n*****\n&gt; Inflation has been running at a 30-year high. Core PCE inflation — which is the Fed’s preferred gauge —jumped 3.6% in September on a year-over-year basis, the same as in August.\n*****\n&gt; Stocks were higher on the week, with the S&amp;P 500 up about 1.1% as of Friday afternoon and up roughly 6.7% for the month of October. Both the Dow and S&amp;P 500 notched new highs in the past week. The widely watched 10-year Treasury yield was at 1.53% Friday afternoon.\n*****\n&gt; “There is an incredible level of complacency out there in this environment,” Boockvar said.\n*****\n&gt; Other events the markets are monitoring include the gathering of world leaders at the G-20 in Italy and the United Nations climate summit COP26, beginning Sunday in Scotland.\n*****\n&gt; # ‘Wild week’\n“You’re going to have a wild week,” Wells Fargo’s Michael Schumacher said. He noted that the Fed’s action will dominate the week, and the jobs report will be secondary.\n*****\n&gt; Wells Fargo economists expect 390,000 jobs were added in October and average hourly earnings grew by 0.4%, he noted. Payrolls were up just 194,000 in September. Schumacher said inflation is the biggest concern in the markets, so the wage data will be most closely watched.\n*****\n&gt; Schumacher said the market is widely expecting the Fed to announce it will reduce its bond purchases by $15 billion a month, starting either in November or December. The central bank implemented its $120 billion monthly bond-buying program in early 2020, as it slashed rates and introduced programs to buy a range of assets to help keep the markets liquid.\n*****\n&gt; Now, as the program is being wound down, it is what Fed Chairman Jerome Powell says about inflation that matters most because that will drive interest rate expectations.\n*****\n&gt; Yet, Powell is expected to stress that the Fed is not automatically going to raise interest rates once the bond purchases end in the middle of next year. Traders are pricing in as many as three interest rate hikes next year, but in the latest Fed forecast, only half of central bank officials agreed there should be even one.\n*****\n&gt; “The inflation commentary is a lot more important,” Schumacher said. “Powell has sounded concerned about expectations getting baked in.” He noted that the 2-year yield, which most reflects the Fed, has risen more than 30 basis points since the last Fed meeting five weeks ago.\n*****\n&gt; Schumacher said market expectations for rate hikes may be overdone, and that he does not expect a move until the beginning of 2023. “The direction is right, but the speed is wrong,” he said.\n*****\n&gt; Powell’s comments will be closely watched for any adjustment in his thinking on inflation. The Fed had described the surge in rates as “transitory” or temporary. The consumer price index has been running above 5%, and core CPI was at 4% in September.\n*****\n&gt; “The general feeling among central bankers and the major central banks is this inflation rate will come back down,” TIAA Bank president of world markets Chris Gaffney said. “Nobody is using ‘transitory’ anymore, but they don’t feel like we’re going to have prolonged high inflation.”\n*****\n&gt; Gaffney said the weaker-than-expected 2% growth in third-quarter gross domestic product could help the Fed convince the markets that it intends to keep rates lower for longer.\n*****\n&gt; “As long as they stay accommodative, I think the recovery continues,” he said. “I’m fairly bullish for the markets going forward. We’ll certainly see a lot more choppiness, but I still think the global economy, the U.S. economy particularly, is right now a great environment for corporations. We’re seeing fairly positive earnings reports, and more importantly expectations for future earnings.”\n*****\n&gt; There have been some high-profile misses, including both Apple and Amazon this past week. Both their stocks fell, weighing on the Nasdaq down Friday.\n*****\n&gt; “Earnings overall have been good, but there’s still a lot of profit margin challenges out there,” Boockvar said. “There’s no better example than Apple and Amazon.”\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/kID8drk.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/kpeo12w.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/mgqDnIk.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/feNGOpc.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/uaTjkhx.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GDzFNzM.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/r8J2LuB.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/qWy1mUR.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/kGexB3t.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/tBwoR2a.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/TglfDZd.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/2HOk4x5.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/vcv5Pne.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/GgX6FOh.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/PmzM56I.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/d5RZesR.png))**\n\n*****\n\n&gt; # November’s First Trading Day: DJIA Up Over 1% Three Years in a Row\n\n&gt; Based upon data in the 2022 Stock Trader’s Almanac on page 90, the first trading day of November is the fourth best of all monthly first trading days since September 1997 based upon total DJIA point gained. DJIA, S&amp;P 500 and NASDAQ have all advanced 13 times over the last 21 years. Average performance on the day ranges from a low of 0.17% by S&amp;P 500 to 0.28% by NASDAQ over the 21-year time period.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/0362ad93159683f932d60b790bfa9ac8/e57961a120ac1354-3a/s500x750/517dc1575ee1212443153f2b842289d3b9eda639.jpg))**\n\n*****\n\n&gt; # Here Comes One of the Best Days of the Year (and the Best Week and Month)\n\n&gt; The calendar is about to do a lot of favors for the bulls, as late October and early November historically are quite strong.\n\n&gt; October 28 was the best day of the year, until it fell more than 3% last year, but this day is still one of the strongest days historically for stocks. Not to be outdone though, October 29 and November 2 and 3 are also some of the better days of the year. “I’d like to think it has something to do with my birthday being on October 28, but the truth is bulls should be aware that the coming days are historically some of the best of the year,” explained LPL Financial Chief Market Strategist Ryan Detrick.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/10/10.27.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; As shown in the LPL Chart of the Day, the single best day to buy at the close and hold for the next five trading days is today, October 27. Yes, these 5 days were lower last year by 0.6%, but you have to go back to the late 1960s to see the last time they were down two years in a row.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/10/10.27.21-Blog-Chart-2.png?ssl=1))**\n\n&gt; Lastly, November has been quite strong historically. In fact, since 1950, and the past 10 years, it is the best month of the year, while it ranks second over the past 20 years and during a post-election year. “November is the best month of the year, but it doesn’t seem to get nearly as much love as you’d think,” added Ryan Detrick. “We all assume December is the best month, but November is actually better and gets very little fanfare. Maybe it should be a month for the bulls, not for turkeys.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/10/10.27.21-Blog-Chart-3.png?ssl=1))**\n\n*****\n\n&gt; # Year’s Best 3-Month Span About To Start\n\n&gt; November, December and January constitute the year’s seasonally strongest 3-month period for the S&amp;P 500, Dow Jones Industrials and the NASDAQ Composite. This seasonal strength is created by a combination of the annual, semiannual and quarterly operations of institutions and the habitual behavior of retail investors and consumers.\n\n&gt; The November-January 3-month span has produced a gain of 4.3% for the S&amp;P 500 &amp; DJIA since 1949. October-December runs a close second at 4.1% for S&amp;P and 3.9% for DJIA. Since 1971 NASDAQ has gained a whopping 6.3% November-January with December-February in second at 5.0% and October-December in third at4.4%.\n\n&gt; These charts also highlight the Best and Worst Months of the year with the Best running from October/November to April/May/June and the Worst from May/June/July to September/October. Stocks have been firming up since we issued our Seasonal MACD Buy Signal to subscribers on October 8 and look poised for a solid yearend rally that continues into early 2022.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/e010745ce0513ef26c01ad558f3324d0/5de97b698922b56d-fc/s500x750/77e7204b6cd2e2850a23200d70c176145dea1f34.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/bd388d961bd47113bc428f68d2326639/5de97b698922b56d-6f/s500x750/f04c4e20d4d9d98fd0b02b7f8472b21dfd8fa543.jpg))**\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/a218e808de4cf5062ba7fe2829c50222/5de97b698922b56d-58/s500x750/0adaf5599c04919e8fb8fca7e5a5129f414f0ccb.jpg))**\n\n*****\n\n&gt; # Short Term Breadth Takes Off\n\n&gt; One of the points noted about the recent moves for the S&amp;P 500 over the past few days have been on the outsized impacts of big gains or losses in names like Tesla (TSLA) or Facebook (FB). In spite of the impacts of those single names, the S&amp;P 500's return to record highs has happened on very strong breadth across sectors. Below, we show 10-day advance-decline line charts from our Sector Snapshot.\n\n&gt; The 10-day advance/decline line measures the average daily number of advancers minus decliners in an index or sector over the last ten trading days. It's a short-term breadth measure that traders use to measure how extended the market is at the moment. Very high readings suggest that the market might be overbought in the near term, and downside mean reversion can be expected. Very low readings suggest the opposite -- that the market might be oversold in the near term, and upside mean reversion can be expected.\n\n&gt; For the broad S&amp;P 500, the 10-day AD line has hit the highest level since February 12th. Going back to 1990, the current reading stands in the 97th percentile. Looking at each sector, most lines are also in the upper decile of readings since 1990 and only two are not currently overbought: Communication Services and Consumer Staples. Meanwhile, some like Technology and Real Estate are a full two standard deviations above the historical norm. In fact, the Tech sector's line is the most elevated relative to its respective history of any sector with the current reading in the 98th percentile of all periods. The last time that the line was as elevated as now was in November of last year. No other sector has as long of a gap in time in which it has seen levels similar to the current reading. Most other sectors have seen higher readings as recently as August or September, though current levels are nonetheless elevated. The market has had quite the run over the last two weeks, and we'd expect some sort of cool-off period soon.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/102621-AD-Lines.png))**\n\n*****\n\n&gt; # High Number of Record Highs\n\n&gt; Major US equity indices have returned to all-time highs in the second half of October with the S&amp;P 500 and Dow both hitting record levels today. Meanwhile, the NASDAQ Composite is roughly a quarter of one percent away and the closest to a new all-time high since the last one on September 7th. The Russell 2,000, on the other hand, is at the high end of the past several months' range, but it is still over 2% below its high from March 15th.\n\n&gt; With the S&amp;P 500 having been at new highs over the past few days, it has made 57 new all-time highs year to date. As shown in the top-left chart below, there have only been three other years in the past that have seen more record highs during the full course of the year: 2017 (62), 1964 (67), and 1995 (78). For the other major indices, the pace of record highs is less impressive but still strong. The Dow has made 38 new highs in 2021 which is more than triple the historical average. This year is on pace to see the highest number of record highs for the index since 2017 when it tied 1991 for the record of 71 closes at an all-time high. The NASDAQ Composite has also seen a solid number of highs at 36 which is well above the historical average of 19 per year historically. Given the index has been rangebound essentially all year, the Russell 2,000, conversely, has only seen 13 closing record highs. That is the same number as last year and it is actually below the average of 20 per year historically.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/102621-Highs.png))**\n\n*****\n\n&gt; # Sentiment Steps Back\n\n&gt; The weekly sentiment survey from AAII saw a surge in optimism in recent weeks, but it took a step back this week even with the S&amp;P 500 at new highs. Bullish sentiment fell from a recent high of 46.9% down to 39.8% this week. Outside of last week, that is still the highest level since the first week of September.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/102821-AAII-Bulls.png))**\n\n&gt; While bullish sentiment saw a significant 7.1 percentage point drop, a relatively small share of those losses turned to the bearish camp. Bearish sentiment only rose 1.6 percentage points to 29.4%. That is still below levels from two weeks ago and is in line with the average from throughout the summer.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/102821-AAII-Bears.png))**\n\n&gt; The corresponding moves in bullish and bearish sentiment resulted in the bull-bear spread to fall but bulls continue to outweigh bears by 10.4 percentage points.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/102821-AAII-Spread.png))**\n\n&gt; As previously mentioned, the largest share of losses to bulls did not go to bears, but instead were picked up by those reporting neutral sentiment. That reading moved back above 30% this week gaining 5.3 percentage points. Again, that does not mark any sort of new high or low but instead brings sentiment back to similar levels seen only a month or two ago.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/10/102821-AAII-Neutral.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending October 29th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=7J1pI0oKgfc))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 10.31.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=ULZcEQ_jrGQ))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$ROKU $ETSY $QCOM $SKLZ $CVS $PINS $ABNB $PTON $SQ $NET $MELI $COIN $UBER $DKNG $CGC $ANET $Z $O $CRSR $UAA $BP $MRNA $PENN $NKLA $DDOG $AMC $APPS $ATV $ZG $LYFT $AYX $SEDG**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/tBwoR2a.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/Yp5H8bf.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES FOR THE MONTH OF OCTOBER 2021!](https://i.imgur.com/xrMCop9.jpg))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.1.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/1HjIZmQ.png))\n\n&gt; # ***Monday 11.1.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/RRqg74t.png))\n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/avWgBsY.png))\n\n*****\n\n&gt; # ***Tuesday  11.2.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/AVmJrqk.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/ZL4zIEJ.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/pu0rSTI.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/1QvRj3E.png))\n\n&gt; # ***Tuesday 11.2.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/pKBLcCr.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/vs8JYzt.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/KSZfOxu.png))\n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/22llulj.png))\n\n*****\n\n&gt; # ***Wednesday 11.3.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/5xvlEsx.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/dUKTga5.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/WIQE41Q.png))\n\n&gt; # ***Wednesday 11.3.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/qbszriq.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/gTvadI5.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/UQ7xxIj.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/4sdRUU3.png))\n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #5!](https://i.imgur.com/HhKzTns.png))\n\n*****\n\n&gt; # ***Thursday 11.4.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/1RpKYW9.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/HUdV9c3.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/MpQcalu.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/rfIsdDF.png))\n\n&gt; # ***Thursday 11.4.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/erVoSwI.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/ld7QKJC.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!](https://i.imgur.com/JE43M9C.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!](https://i.imgur.com/HFaILZk.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #5!](https://i.imgur.com/ZzQa2SJ.png))\n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #6!](https://i.imgur.com/xZChhTM.png))\n\n*****\n\n&gt; # ***Friday 11.5.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!](https://i.imgur.com/qZ8WshK.png))\n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!](https://i.imgur.com/R0yobEv.png))\n\n*****\n\n&gt; # ***Friday 11.5.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/tmcJekX.png))\n\n*****\n\n&gt; # Square, Inc. $254.50\n&gt; **Square, Inc. (SQ)** is confirmed to report earnings at approximately 5:40 PM ET on Thursday, November 4, 2021. The consensus earnings estimate is $0.34 per share on revenue of $4.61 billion and the Earnings Whisper ® number is $0.51 per share. Investor sentiment going into the company's earnings release has 83% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 3.03% with revenue increasing by 51.95%. Short interest has increased by 22.3% since the company's last earnings release while the stock has drifted higher by 2.6% from its open following the earnings release to be 5.5% above its 200 day moving average of $241.27. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, October 13, 2021 there was some notable buying of 5,171 contracts of the $240.00 call and 5,065 contracts of the $240.00 put expiring on Friday, December 17, 2021. Option traders are pricing in a 6.9% move on earnings and the stock has averaged a 8.6% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SQ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Pfizer, Inc. $43.74\n&gt; **Pfizer, Inc. (PFE)** is confirmed to report earnings at approximately 6:45 AM ET on Tuesday, November 2, 2021. The consensus earnings estimate is $1.08 per share on revenue of $22.38 billion and the Earnings Whisper ® number is $1.19 per share. Investor sentiment going into the company's earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 50.00% with revenue increasing by 84.49%. Short interest has decreased by 11.0% since the company's last earnings release while the stock has drifted higher by 3.3% from its open following the earnings release to be 9.2% above its 200 day moving average of $40.07. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, October 27, 2021 there was some notable buying of 24,016 contracts of the $43.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 2.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=PFE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Roku Inc $304.90\n&gt; **Roku Inc (ROKU)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, November 3, 2021. The consensus earnings estimate is $0.06 per share on revenue of $679.27 million and the Earnings Whisper ® number is $0.15 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat The company's guidance was for revenue of $675.00 million to $685.00 million. Consensus estimates are for earnings to decline year-over-year by 33.33% with revenue increasing by 50.39%. Short interest has increased by 27.6% since the company's last earnings release while the stock has drifted lower by 20.2% from its open following the earnings release to be 17.1% below its 200 day moving average of $367.92. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, October 28, 2021 there was some notable buying of 1,059 contracts of the $375.00 call expiring on Friday, November 19, 2021. Option traders are pricing in a 9.5% move on earnings and the stock has averaged a 7.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=ROKU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Moderna, Inc., $345.21\n&gt; **Moderna, Inc., (MRNA)** is confirmed to report earnings at approximately 6:30 AM ET on Thursday, November 4, 2021. The consensus earnings estimate is $9.01 per share on revenue of $6.45 billion and the Earnings Whisper ® number is $9.91 per share. Investor sentiment going into the company's earnings release has 71% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1,627.12% with revenue increasing by 3,984.61%. Short interest has increased by 8.4% since the company's last earnings release while the stock has drifted lower by 15.7% from its open following the earnings release to be 40.0% above its 200 day moving average of $246.51. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, October 19, 2021 there was some notable buying of 4,278 contracts of the $340.00 call and 4,062 contracts of the $340.00 put expiring on Friday, November 19, 2021. Option traders are pricing in a 8.2% move on earnings and the stock has averaged a 4.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=MRNA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Pinterest, Inc. $44.64\n&gt; **Pinterest, Inc. (PINS)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, November 4, 2021. The consensus earnings estimate is $0.23 per share on revenue of $631.55 million and the Earnings Whisper ® number is $0.28 per share. Investor sentiment going into the company's earnings release has 66% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 76.92% with revenue increasing by 42.69%. Short interest has decreased by 17.1% since the company's last earnings release while the stock has drifted lower by 24.6% from its open following the earnings release to be 32.7% below its 200 day moving average of $66.37. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, October 20, 2021 there was some notable buying of 22,003 contracts of the $70.00 call expiring on Friday, November 19, 2021. Option traders are pricing in a 10.9% move on earnings and the stock has averaged a 19.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=PINS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # ON Semiconductor Corporation $48.07\n&gt; **ON Semiconductor Corporation (ON)** is confirmed to report earnings at approximately 8:00 AM ET on Monday, November 1, 2021. The consensus earnings estimate is $0.74 per share on revenue of $1.71 billion and the Earnings Whisper ® number is $0.80 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat The company's guidance was for earnings of $0.68 to $0.80 per share. Consensus estimates are for year-over-year earnings growth of 174.07% with revenue increasing by 29.81%. Short interest has increased by 21.3% since the company's last earnings release while the stock has drifted higher by 12.0% from its open following the earnings release to be 17.9% above its 200 day moving average of $40.78. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, October 19, 2021 there was some notable buying of 7,501 contracts of the $45.00 call expiring on Friday, January 19, 2024. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 6.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=ON&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # DraftKings Inc. $46.59\n&gt; **DraftKings Inc. (DKNG)** is confirmed to report earnings at approximately 7:00 AM ET on Friday, November 5, 2021. The consensus estimate is for a loss of $1.10 per share on revenue of $232.46 million and the Earnings Whisper ® number is ($1.20) per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 12.24% with revenue increasing by 75.00%. Short interest has increased by 14.7% since the company's last earnings release while the stock has drifted lower by 11.7% from its open following the earnings release to be 14.6% below its 200 day moving average of $54.53. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, October 15, 2021 there was some notable buying of 37,367 contracts of the $60.00 call and 36,163 contracts of the $40.00 put expiring on Friday, January 21, 2022. Option traders are pricing in a 7.7% move on earnings and the stock has averaged a 6.8% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=DKNG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Uber Technologies, Inc. $43.82\n&gt; **Uber Technologies, Inc. (UBER)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, November 4, 2021. The consensus estimate is for a loss of $0.33 per share on revenue of $4.42 billion and the Earnings Whisper ® number is ($0.09) per share. Investor sentiment going into the company's earnings release has 75% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 46.77% with revenue increasing by 41.26%. Short interest has increased by 24.6% since the company's last earnings release while the stock has drifted higher by 8.2% from its open following the earnings release to be 11.8% below its 200 day moving average of $49.68. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, October 11, 2021 there was some notable buying of 28,016 contracts of the $37.50 put expiring on Friday, June 17, 2022. Option traders are pricing in a 8.3% move on earnings and the stock has averaged a 5.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=UBER&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Coinbase Global, Inc. $319.42\n&gt; **Coinbase Global, Inc. (COIN)** is confirmed to report earnings at approximately 7:00 AM ET on Friday, November 5, 2021. The consensus earnings estimate is $1.79 per share on revenue of $1.45 billion and the Earnings Whisper ® number is $2.10 per share. Investor sentiment going into the company's earnings release has 67% expecting an earnings beat. The stock has drifted higher by 13.1% from its open following the earnings release. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, October 25, 2021 there was some notable buying of 2,661 contracts of the $460.00 call expiring on Friday, February 18, 2022. Option traders are pricing in a 6.7% move on earnings and the stock has averaged a 2.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=COIN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Digital Turbine, Inc. $86.06\n&gt; **Digital Turbine, Inc. (APPS)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, November 2, 2021. The consensus earnings estimate is $0.39 per share on revenue of $306.53 million and the Earnings Whisper ® number is $0.43 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat The company's guidance was for earnings of approximately $0.38 per share on revenue of $300.00 million to $306.00 million. Consensus estimates are for year-over-year earnings growth of 178.57% with revenue increasing by 332.38%. Short interest has increased by 23.6% since the company's last earnings release while the stock has drifted higher by 29.7% from its open following the earnings release to be 21.0% above its 200 day moving average of $71.10. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, October 27, 2021 there was some notable buying of 1,045 contracts of the $65.00 put expiring on Friday, November 12, 2021. Option traders are pricing in a 12.5% move on earnings and the stock has averaged a 17.2% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=COIN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets. :)",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning November 1st, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/qj18a5/wall_street_week_ahead_for_the_trading_week/",
        "created": 1635628382.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1633648293,
        "id": "q3l35y",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " Three ETF's per winner (when available)  \n\n\n**ETF Ticker | % invested in Winner | ETF Full Name**  \n\n\n**Industrials**: ETFs investing in Robert Half International Inc.  \nKONG-- 3.59%  Formidable Fortress ETF  \nLSAT-- 3.35%  Leadershares Alphafactor Tactical Focused ETF  \nOUSM-- 1.97%  OShares U.S. Small-Cap Quality Dividend ETF  \n\n\n**Health Care**: ETFs investing in Humana Inc  \nIHF-- 4.46%  iShares U.S. Healthcare Providers ETF  \nGBLO-- 2.69%  Global Beta Low Beta ETF  \nSPVU-- 1.57%  Invesco S&amp;P 500® Enhanced Value ETF  \n\n\n**Information Technology**: ETFs investing in Arista Networks Inc  \nIGN-- 8.60%  iShares North American Tech-Multimedia Networking ETF  \nBUL-- 4.15%  Pacer US Cash Cows Growth ETF  \nSKYY-- 3.42%  First Trust Cloud Computing ETF  \n\n\n**Communication Services**: ETFs investing in Twitter Inc  \nFNGS-- 12.89%  MicroSectors FANG+ ETN  \nSOCL-- 6.30%  Global X Social Media ETF  \nVPOP-- 5.70%  Simplify Volt Pop Culture Disruption ETF  \n\n\n**Consumer Discretionary**: ETFs investing in Ford Motor Company  \nFTXR-- 6.47%  First Trust Nasdaq Transportation ETF  \nCARZ-- 4.47%  First Trust NASDAQ Global Auto Index Fund  \nLOUP-- 3.46%  Innovator Loup Frontier Tech ETF  \n\n\n**Utilities**: ETFs investing in AES Corp  \nRYU-- 3.64%  Invesco S&amp;P 500® Equal Weight Utilities ETF  \nVCLN-- 3.24%  Virtus Duff &amp; Phelps Clean Energy ETF  \nPUI-- 2.44%  Invesco DWA Utilities Momentum ETF  \n\n\n**Financials**: ETFs investing in Intercontinental Exchange Inc  \nIAI-- 4.45%  iShares U.S. Broker-Dealers &amp; Securities Exchanges ETF  \nCRPT-- 4.10%  First Trust SkyBridge Crypto Industry and Digital Economy ETF  \nCWS-- 3.92%  AdvisorShares Focused Equity ETF  \n\n\n**Materials**: ETFs investing in Freeport-McMoRan Inc  \nIYM-- 7.40%  iShares U.S. Basic Materials ETF  \nXLB-- 5.24%  Materials Select Sector SPDR Fund  \nPICK-- 4.59%  iShares MSCI Global Metals &amp; Mining Producers ETF  \n\n\n**Real Estate**: ETFs investing in CBRE Group Inc  \nXLRE-- 3.54%  Real Estate Select Sector SPDR Fund  \nEWRE-- 3.50%  Invesco S&amp;P 500® Equal Weight Real Estate ETF  \nFPRO-- 2.77%  Fidelity Real Estate Investment ETF  \n\n\n**Consumer Staples**: ETFs investing in Constellation Brands, Inc. Class A  \nTOKE-- 6.20%  Cambria Cannabis ETF  \nPBJ-- 4.83%  Invesco Dynamic Food &amp; Beverage ETF  \nRHS-- 3.13%  Invesco S&amp;P 500® Equal Weight Consumer Staples ETF  \n\n\n**Energy**: ETFs investing in Schlumberger NV  \nIEZ-- 22.56%   iShares U.S. Oil Equipment &amp; Services ETF  \nOIH-- 19.80%   VanEck Oil Services ETF  \nPXJ-- 7.91%   Invesco Dynamic Oil &amp; Gas Services ETF  \n\n\nHappy investing!",
        "subreddit": "StockMarket",
        "title": "ETFs with Investments in SP500 Winners of 10/7/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/q3l35y/etfs_with_investments_in_sp500_winners_of_1072021/",
        "created": 1633677093.0
    },
    {
        "author": "Syberbob2021",
        "created_utc": 1634511744,
        "id": "qa9w18",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\n*Processing img gzyftpy3a3u71...*\n\n**Close April 13, 2020**   **Close Oct 15, 2021**\n\nWMT     125.30                           140.55                         +12.1%  \nAKAM      95.19                           106.32                         +10.4%  \nANET     202.08                           389.78                         +92%  \nCabot      18.98                             20.34                          +7.1%  \nDG         171.57                           212.80                         +24%  \nSteris     149.51                           225.09                         +50.5%  \nODFL      129.89                           302.51                        +132%  \nNDAQ     103.29                           203.02                        +96.5%  \nNEW         59.77                              57.03                          -4.5%  \nVRTX       252.28                            181.77                        -27.9%  \nCitrix     139.99                             97.58                           -30.2%  \nGILD         75.28                            67.63                          -10.1%",
        "subreddit": "wallstreetbets",
        "title": "Barrons Stocks to Own April 13, 2020 update",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qa9w18/barrons_stocks_to_own_april_13_2020_update/",
        "created": 1634540544.0
    },
    {
        "author": "MFiech",
        "created_utc": 1635579931,
        "id": "qiwm22",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hey guys, upcoming earnings! Which ones are you waiting for most? Where do you listen to them?\n\nWhat is ahead of us:\n\nhttps://preview.redd.it/8gt0ewi9ljw71.png?width=1772&amp;format=png&amp;auto=webp&amp;s=cd2e74dd8020c47628c5b5f80d1a21527c302115\n\n**MON**\n\nBMO: $ON $CNA $ALX $PCG $JELD $TKR $TRVG $AMG $ENBL $LDI $BEN\n\nAMC: $CHGG $NXPI $CLX $FANG $SPG $RIG $MOS $ANET $CLR $CAR $WMB $ZI $O $NTR\n\n**TUE**\n\nBMO: $CRSR $RACE $UAA $CTLT $BP $EL $GPN $GNRC $LPX $RL $ARCB $EPO\n\nAMC: $AMC $APPS $ATV $ZG $TMUS $LYFT $VRTX $AYX $PGR $SEDG $DVN $XPO\n\n**WED**\n\nBMO: $CVS $BCRX $WING $NCLH $MAR $DISCA $EXPI $CWH $EAT $LL $SMG $CPRI\n\nAMC: $ROKU $ETSY $QCOM $FSLY $SKLZ $TTWO $ET $MRO $SPWR $SAND $MGNI $EA $CAKE\n\n**TH**\n\nBMO: $MRNA $PENN $VIAC $GOLD $NKLA $W $ERJ $CYBR $HIMX $DDOG $MBUU $VSTO $REGN\n\nAMC: $PINS $ABNB $PTON $SQ $RKT $UBER $SWKS $BNGO $NVAX $NET $MELI $OXY $DBX\n\n**FRI**\n\nBMO: $COIN $DKGN $CGC $GT $MGA $ENB $TEN $AMXC $CNK $D $ELAN $FLR",
        "subreddit": "StockMarket",
        "title": "Most Anticipated Earnings Releases for the week beginning November 1st, 2021 - it's a big one!",
        "url": "https://www.reddit.com/r/StockMarket/comments/qiwm22/most_anticipated_earnings_releases_for_the_week/",
        "created": 1635608731.0
    },
    {
        "author": "Engineer_Economist",
        "created_utc": 1633648261,
        "id": "q3l2t1",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " **Winners**  \n\n\nWinner of the day by sector | **SP500**:  \n\n\n**Sector |** Company **| Ticker |** % Price Change  \n\n\n1. **Industrials** | Robert Half International Inc. | **RHI** | 3.30%  \n2. **Health Care** | Humana Inc | **HUM** | 2.89%  \n3. **Information Technology** | Arista Networks Inc | **ANET** | 3.00%  \n4. **Communication Services** | Twitter Inc | **TWTR** | 4.37%  \n5. **Consumer Discretionary** | Ford Motor Company | **F** | 5.45%  \n6. **Utilities** | AES Corp | **AES** | 2.86%  \n7. **Financials** | Intercontinental Exchange Inc | **ICE** | 3.08%  \n8. **Materials** | Freeport-McMoRan Inc | **FCX** | 8.25%  \n9.  **Real Estate** | CBRE Group Inc | **CBRE** | 1.60%  \n10. **Consumer Staples** | Constellation Brands, Inc. Class A | **STZ** | 2.31%  \n11. **Energy** | Schlumberger NV | **SLB** | 3.61%  \n\n\n**Losers**  \n\n\nLoser of the day by sector | **SP500**:  \n\n\n**Sector | Company | Ticker | % Price Change**  \n\n\n1. Industrials | **American Airlines Group Inc** | AAL | **-1.80%**  \n2. Health Care | **Becton Dickinson and Co** |  BDX | **-1.43%**  \n3. Information Technology | **Citrix Systems, Inc.** | CTXS | **-1.65%**  \n4.  Communication Services | **Live Nation Entertainment, Inc.** | LYV | **-2.04%**  \n5. Consumer Discretionary | **Norwegian Cruise Line Holdings Ltd** | NCLH | **-2.21%**  \n6. Utilities | **Pinnacle West Capital Corporation** | PNW | **-8.02%**  \n7. Financials | **Progressive Corp** | PGR | **-1.22%**  \n8. Materials | **Ball Corporation** | BLL | **-0.58%**  \n9. Real Estate | **Digital Realty Trust, Inc.** | DLR | **-0.97%**  \n10. Consumer Staples | **Lamb Weston Holdings Inc** | LW | **-6.64%**  \n11. Energy | **EOG Resources Inc** | EOG | **-0.90%**",
        "subreddit": "StockMarket",
        "title": "SP500 Winners and Losers | 10/7/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/q3l2t1/sp500_winners_and_losers_1072021/",
        "created": 1633677061.0
    },
    {
        "author": "MFiech",
        "created_utc": 1635579502,
        "id": "qiwish",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hey guys, upcoming earnings! Which ones are you waiting for most? \n\nWhat is ahead of us:\n\nhttps://preview.redd.it/efrjxgasjjw71.png?width=1772&amp;format=png&amp;auto=webp&amp;s=e414172e5c72449b19f7d489afaa894d623c50b3\n\n**MON** \n\nBMO:  $ON $CRNT $CNA $ALX $PCG $JELD $TKR $TRVG $AMG $SXC $SBT $ENBL $LDI $BEN \n\nAMC: $CHGG $NXPI $CLX $FANG $SPG $RIG $MOS $ANET $CLR $CAR $WMB $ZI $O $NTR\n\n**TUE**\n\nBMO: $CRSR $RACE $UAA $CTLT $BP $EL $GPN $GNRC $LPX $RL $ARCB $EPO \n\nAMC: $AMC $APPS $ATV $ZG $TMUS $LYFT $VRTX $AYX $PGR $SEDG $DVN $XPO\n\n**WED**\n\nBMO: $CVS $BCRX $WING $NCLH $MAR $DISCA $EXPI $CWH $EAT $LL $SMG $CPRI $RADA \n\nAMC: $ROKU $ETSY $QCOM $FSLY $SKLZ $TTWO $ET $MRO $SPWR $SAND $MGNI $EA $CAKE \n\n**TH** \n\nBMO: $MRNA $PENN $VIAC $GOLD $NKLA $W $ERJ $CYBR $HIMX $DDOG $MBUU $VSTO $REGN \n\nAMC: $PINS $ABNB $PTON $SQ $RKT $UBER $SWKS $BNGO $NVAX $NET $MELI $OXY $DBX \n\n**FRI**\n\nBMO: $COIN $DKGN $CGC $GT $MGA $ENB $TEN $AMXC $CNK $D $ELAN $AXL $FLR",
        "subreddit": "wallstreetbets",
        "title": "Most Anticipated Earning Releases for the week beginning November 1st, 2021 - it's a big one!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qiwish/most_anticipated_earning_releases_for_the_week/",
        "created": 1635608302.0
    },
    {
        "author": "The-Qu3st",
        "created_utc": 1633661695,
        "id": "q3ounw",
        "num_comments": 203,
        "num_crossposts": 0,
        "selftext": "This is very small percentage.  (Fun money) account. I tried to not include Tech mostly. \n\nMy top 10 companies are:\nBank of America(BAC) -  10%\nCisco System, Inc (CSCO) - 10%\nCoca-Cola (KO) - 10%\nDocuSign Inc (DOCU) - 10%\nHome Depot (HD) - 10% \nMcDonald’s Corp (MCD) - 10%\nNike Inc (NKE) - 10%\nTaiwan Semiconductor (TSM) - 10% \nWalgreens (WBA) - 10% \nWalmart (WMT) - 10% \n\nWhat would your be?",
        "subreddit": "stocks",
        "title": "If you had to pick only 10 stocks to invest in what would they be?",
        "url": "https://www.reddit.com/r/stocks/comments/q3ounw/if_you_had_to_pick_only_10_stocks_to_invest_in/",
        "created": 1633690495.0
    },
    {
        "author": "Ok-Constant8181",
        "created_utc": 1634270380,
        "id": "q8g67p",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "**Background:** I plan on dedicating around $5,000 of my savings to investments/securities and begin allotting $150-200/month as often as possible to expand my portfolio. I lurk the sub a lot but tbh I’m not sure if this allocated budget would be enough for my plan. I’m 27M and work programming in IT, if that helps. \n\n**The Plan:** I want to build a decent portfolio. I’ve always read that tech is almost always a good choice, especially to industries with direct ties to FAANG stocks. \n\nGiven my professional background, I feel like IoT might be the best practical choice for my initial investments (“invest in what you know” right?). I [read from an article](https://frontierresearch.com/internet-of-things/?r=1) that ROK, PI, and SMTC are worth considering as well since they build solutions for the IoT’s device and network layers. I [also read](https://www.fool.com/investing/stock-market/market-sectors/information-technology/iot-stocks/) that CSCO, DXCM, and ALRM are also some top choices in the field.\n\nHowever, I'm still curious whether I should stick to larger cap securities like the FAANG stocks or if I should trust my gut with the aforementioned companies? Any insights would be appreciated. Thanks!",
        "subreddit": "stocks",
        "title": "If I plan to invest in IoT, should I still add FAANG stocks?",
        "url": "https://www.reddit.com/r/stocks/comments/q8g67p/if_i_plan_to_invest_in_iot_should_i_still_add/",
        "created": 1634299180.0
    },
    {
        "author": "techmagenta",
        "created_utc": 1634965351,
        "id": "qdy9hm",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "Hey everyone,\n\nI work in tech at a cloud computing company and have been researching investment opportunities. I recently came across Nutanix which is a company I've heard of but didn't realize was public. Nutanix is the industry leader in hyperconvered infrastructure (HCI) which essentially makes them a competitor to vmware, dell, cisco, etc. in the on-prem virtualization space. I was doing some reading and it seems like their products are highly regarded in the industry. I also noticed they are growing hybrid cloud  subscription services that can help customers abstract their cloud computing workloads away (AWS, GCP, Azure, on-prem can all be run from a single pane). I don't know exactly where the stand in this industry but evidently we are at peak cloud and large companies are starting to move workloads back out of the cloud to save money.\n\nThis company used to sell hardware but has recently undergone a transition into a subscription services company. This transition was painful and led to nearly no stock growth over 4 years. However with new leadership it looks like the company is pulling off the transition and starting to grow again.\n\nThey currently operate at a loss but according to the new leadership will be cash-flow positive sometime in 2022. currently the company has \n\n&amp;#x200B;\n\n1.64 Billion annual revenue\n\nAs of this quarter 19% YoY revenue growth\n\n83% annual recurring revenue\n\n7.7 billion market cap\n\na price/sales ratio of 5.5\n\n&amp;#x200B;\n\na Price to sales ratio of 5.5 for a subscription software company with 19% YoY revenue growth seems undervalued to me. I don't think wallstreet has priced in the companies transition to subscription hardware. \n\nAnybody have any insights or comments on this company?",
        "subreddit": "stocks",
        "title": "Nutanix (NASDAQ:NTNX) potentially undervalued tech company",
        "url": "https://www.reddit.com/r/stocks/comments/qdy9hm/nutanix_nasdaqntnx_potentially_undervalued_tech/",
        "created": 1634994151.0
    },
    {
        "author": "ThorDansLaCroix",
        "created_utc": 1633556277,
        "id": "q2u5ck",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "Would Emerging Markets have more potencial for Value return than in Developed Markets?\n\nI am asking not only for individual company investment but especially for ETFs.\n\nI was comparing the to holding of Emerging Markets Value ETFs and the composition are companies like TWN Semicont, Vale, Alibaba, Tencent, Kia Motors, and many banks and their markets seem to have more potencial for growth than developed markets.\n\nDeveloped markets Value ETFs have among their top holding companies like Intel, AT&amp;T, Toyota, Cisco, Pfzer and Britsh American Tabaco. I know they are great Value companies but I feel companies in emerging Markets have much more potencial for growth.\n\nBut I know next to nothing about investment and markets or these companies. So I am looking for more opinions to help making my mind on where to focus.",
        "subreddit": "ValueInvesting",
        "title": "Developed Markets VS Emerging Markets",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/q2u5ck/developed_markets_vs_emerging_markets/",
        "created": 1633585077.0
    },
    {
        "author": "Mean_Leading5688",
        "created_utc": 1634094576,
        "id": "q728xj",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": " **Background:** I plan on dedicating around $5,000 of my savings to investments/securities and begin allotting $150-200/month as often as possible to expand my portfolio. I lurk the sub a lot but tbh I’m not sure if this allocated budget would be enough for my plan. I’m 27M and work programming in IT, if that helps. \n\n**The Plan:** I want to build a decent portfolio. I’ve always read that tech is almost always a good choice, especially to industries with direct ties to FAANG stocks. \n\nGiven my professional background, I feel like IoT might be the best practical choice for my initial investments (“invest in what you know” right?). I already read about CSCO, DXCM, and ALRM being some top choices, and I read [from an investment think-tank](https://frontierresearch.com/internet-of-things/?r=1) that ROK, PI, and SMTC are worth considering as well since they build solutions for the IoT’s device and network layers. Is this a reliable assessment?\n\nHowever, I'm still curious whether I should stick to larger cap securities like the FAANG stocks or if I should trust my gut with the aforementioned companies? Any insights would be appreciated. Thanks!",
        "subreddit": "wallstreetbets",
        "title": "If I plan to invest in IoT, should I still add FAANG stocks?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q728xj/if_i_plan_to_invest_in_iot_should_i_still_add/",
        "created": 1634123376.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1635280845,
        "id": "qgfp7g",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Tuesday, October 26, 2021**\n\nStocks extended gains, with the S&amp;P 500 (SPY) and Dow Jones (DIA) each reaching a fresh, intraday record high, as market participants continue to digest the stronger than anticipated corporate earnings season. The Nasdaq (QQQ) is within 1% of its record-high, driven primarily by extreme strength in Tesla (TSLA), which became the sixth company to break $1 trillion market cap, and NVIDIA (NVDA), my personal favorite company which beasted to new all-time highs today. \n\nFollowing September’s volatility, market participants have demonstrated their resilience and hunger to buy dips up despite ongoing supply-side disruptions and labor market imbalances, with new economic data showing consumer confidence increasing in October for the first time in four months. Investors continue to digest a massive week in regards to earnings, with mega-caps like AMD, Microsoft (MSFT), Visa (V), Alphabet (GOOG), Apple (AAPL), and Amazon (AMZN), among many others, reporting later this week.\n\nThe Conference Board, a non-profit business research organization, released their October monthly consumer confidence index, which showed confidence rising as coronavirus cases in the US continued to retreat from the latest spike. Cases in the US retreated from a high in the previous spike of 285,058 to 105,561 in between September 13 and October 25. The Conference Board's consumer confidence index rose to 113.8 in October from 109.8 in September. This came in higher than the 108.0 consensus economists were looking for, according to Bloomberg data. It also marked the first monthly increase in confidence since June.  \n\nLynn Franco, Senior Director of Economic Indicators at the Conference Board, said “Consumer confidence improved in October, reversing a three-month downward trend as concerns about the spread of the Delta variant eased. The proportion of consumers planning to purchase homes, automobiles, and major appliances all increased in October—a sign that consumer spending will continue to support economic growth through the final months of 2021.\" As a reminder, consumer spending accounts for roughly 70% of US GDP. \n\n[https://www.conference-board.org/data/consumerconfidence.cfm](https://www.conference-board.org/data/consumerconfidence.cfm)\n\nSupporting this view, in the time from August to September, new home sales posted a far greater jump than expected by economists, according to a report released by The Department of Commerce. Sales were up 14.0% in September compared to August, far exceeding consensus expectations for a 2.2% rise, according to Bloomberg data. This brought new home sales to a seasonally adjusted annualized rate of 800,000, or the highest since March.\n\nNew home sales in the Northeast posted by far the biggest rise during the month, with these rising by 32.3%. This was followed by a 17.5% jump in new home sales in the South, and an 8.2% advance in the West. The Midwest region of the U.S. saw sales drop by 1.5% during the month. \n\n[https://www.census.gov/construction/nrs/pdf/newressales.pdf](https://www.census.gov/construction/nrs/pdf/newressales.pdf)\n\n**Highlights**\n\n* Microsoft (MSFT) reported earnings, here are the numbers.\n   * **Revenue:** $45.3 billion versus $43.93 billion expected\n   * **Earnings per share:** $2.71 versus $2.07 expected\n   * **Intelligent Cloud:** $16.98 versus $16.58 billion expected\n   * **Productivity &amp; Business processes:** $15.04 versus $14.70 billion expected\n   * **More personal computing:** $13.31 versus $12.68 billion expected\n* **Alphabet (GOOG, GOOGL) reported earnings, here are the numbers.**\n   * **Earnings per share (EPS):** $27.99 per share vs $23.48 per share, according to Refinitiv estimates.\n   * **Revenue:** $65.12 billion vs. $63.34 billion, according to Refinitiv estimates.\n   * **YouTube ad revenue:** $7.20 billion vs. $7.4 billion expected.\n   * **Google Cloud revenue:** $4.99 billion vs. $5.07 billion expected.\n   * **Traffic acquisition costs (TAC):** $11.50 vs. $11.16 billion expected.\n* A Senate panel broadened its inquiry into social media’s impact on young people, questioning representatives of TikTok, Snapchat and YouTube as lawmakers build a case for new legislation to protect children online.\n* Incredibly, Tesla (TSLA) is worth more than the combined value of five of its biggest rivals, Toyota Motor Corp, Volkswagen AG, Daimler AG, Ford Motor Co and General Motors.\\\\\n* Cisco Systems (CSCO) has created a team dedicated to developing its Webex collaboration software for Apple(AAPL) products, the two companies said Tuesday as Cisco rolled out a new version of Webex for iPads.\n* General Motors (GM) to boost its EV presence by building out 40,000 charging stations in the US and Canada\n* Despite semiconductor stocks like NVDA and AMD being red-hot, Intel (INTC) has vastly underperformed, falling more than -2% on the day after BMO Capital Markets slashed their price target from $60 to $52, citing technological missteps that gave away market share to AMD and losing Apple as a customer. \n\n“It is during our darkest moments that we must focus to see the light.” *-Aristotle*",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Tuesday, October 26, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/StockMarket/comments/qgfp7g/here_is_a_market_recap_for_today_tuesday_october/",
        "created": 1635309645.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1635280819,
        "id": "qgfove",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Tuesday, October 26, 2021**\n\nStocks extended gains, with the S&amp;P 500 (SPY) and Dow Jones (DIA) each reaching a fresh, intraday record high, as market participants continue to digest the stronger than anticipated corporate earnings season. The Nasdaq (QQQ) is within 1% of its record-high, driven primarily by extreme strength in Tesla (TSLA), which became the sixth company to break $1 trillion market cap, and NVIDIA (NVDA), my personal favorite company which beasted to new all-time highs today. \n\nFollowing September’s volatility, market participants have demonstrated their resilience and hunger to buy dips up despite ongoing supply-side disruptions and labor market imbalances, with new economic data showing consumer confidence increasing in October for the first time in four months. Investors continue to digest a massive week in regards to earnings, with mega-caps like AMD, Microsoft (MSFT), Visa (V), Alphabet (GOOG), Apple (AAPL), and Amazon (AMZN), among many others, reporting later this week.\n\nThe Conference Board, a non-profit business research organization, released their October monthly consumer confidence index, which showed confidence rising as coronavirus cases in the US continued to retreat from the latest spike. Cases in the US retreated from a high in the previous spike of 285,058 to 105,561 in between September 13 and October 25. The Conference Board's consumer confidence index rose to 113.8 in October from 109.8 in September. This came in higher than the 108.0 consensus economists were looking for, according to Bloomberg data. It also marked the first monthly increase in confidence since June.  \n\nLynn Franco, Senior Director of Economic Indicators at the Conference Board, said “Consumer confidence improved in October, reversing a three-month downward trend as concerns about the spread of the Delta variant eased. The proportion of consumers planning to purchase homes, automobiles, and major appliances all increased in October—a sign that consumer spending will continue to support economic growth through the final months of 2021.\" As a reminder, consumer spending accounts for roughly 70% of US GDP. \n\n[https://www.conference-board.org/data/consumerconfidence.cfm](https://www.conference-board.org/data/consumerconfidence.cfm)\n\nSupporting this view, in the time from August to September, new home sales posted a far greater jump than expected by economists, according to a report released by The Department of Commerce. Sales were up 14.0% in September compared to August, far exceeding consensus expectations for a 2.2% rise, according to Bloomberg data. This brought new home sales to a seasonally adjusted annualized rate of 800,000, or the highest since March.\n\nNew home sales in the Northeast posted by far the biggest rise during the month, with these rising by 32.3%. This was followed by a 17.5% jump in new home sales in the South, and an 8.2% advance in the West. The Midwest region of the U.S. saw sales drop by 1.5% during the month. \n\n[https://www.census.gov/construction/nrs/pdf/newressales.pdf](https://www.census.gov/construction/nrs/pdf/newressales.pdf)\n\n**Highlights**\n\n* Microsoft (MSFT) reported earnings, here are the numbers.\n   * **Revenue:** $45.3 billion versus $43.93 billion expected\n   * **Earnings per share:** $2.71 versus $2.07 expected\n   * **Intelligent Cloud:** $16.98 versus $16.58 billion expected\n   * **Productivity &amp; Business processes:** $15.04 versus $14.70 billion expected\n   * **More personal computing:** $13.31 versus $12.68 billion expected\n* **Alphabet (GOOG, GOOGL) reported earnings, here are the numbers.**\n   * **Earnings per share (EPS):** $27.99 per share vs $23.48 per share, according to Refinitiv estimates.\n   * **Revenue:** $65.12 billion vs. $63.34 billion, according to Refinitiv estimates.\n   * **YouTube ad revenue:** $7.20 billion vs. $7.4 billion expected.\n   * **Google Cloud revenue:** $4.99 billion vs. $5.07 billion expected.\n   * **Traffic acquisition costs (TAC):** $11.50 vs. $11.16 billion expected.\n* A Senate panel broadened its inquiry into social media’s impact on young people, questioning representatives of TikTok, Snapchat and YouTube as lawmakers build a case for new legislation to protect children online.\n* Incredibly, Tesla (TSLA) is worth more than the combined value of five of its biggest rivals, Toyota Motor Corp, Volkswagen AG, Daimler AG, Ford Motor Co and General Motors.\\\\\n* Cisco Systems (CSCO) has created a team dedicated to developing its Webex collaboration software for Apple(AAPL) products, the two companies said Tuesday as Cisco rolled out a new version of Webex for iPads.\n* General Motors (GM) to boost its EV presence by building out 40,000 charging stations in the US and Canada\n* Despite semiconductor stocks like NVDA and AMD being red-hot, Intel (INTC) has vastly underperformed, falling more than -2% on the day after BMO Capital Markets slashed their price target from $60 to $52, citing technological missteps that gave away market share to AMD and losing Apple as a customer. \n\n“It is during our darkest moments that we must focus to see the light.” *-Aristotle*",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Tuesday, October 26, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/qgfove/here_is_a_market_recap_for_today_tuesday_october/",
        "created": 1635309619.0
    },
    {
        "author": "briefds",
        "created_utc": 1633341589,
        "id": "q12d9w",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**TL;DR**: stimulus, telecommunications/semiconductor, biopharma\n\nAs of 2021-10-03, for 15 day ahead prediction, the most important predictive factors are\n\n1. Philip Morris International PM\n2. Cisco Systems CSCO\n3. Mastercard Inc. MA\n4. [Consumer Price Index of All Items in Japan](https://fred.stlouisfed.org/series/JPNCPIALLMINMEI)\n5. BioMarin Pharmaceutical Inc. BMRN\n6. Synopsys, Inc. SNPS\n7. [M3 (money supply) for the Euro Area](https://fred.stlouisfed.org/series/MABMM301EZM189N)\n8. [Harmonized Index of Consumer Prices: All Items for Euro area (19 countries)](https://fred.stlouisfed.org/series/CP0000EZ19M086NEST)\n9. Liberty Global plc LBTYK\n10. [M2 (money supply) for the United States](https://fred.stlouisfed.org/series/WM2NS)\n\nMoney Supply: [https://en.m.wikipedia.org/wiki/Money\\_supply](https://en.m.wikipedia.org/wiki/Money_supply)\n\nConsumer Price Index: [https://en.m.wikipedia.org/wiki/Consumer\\_price\\_index](https://en.m.wikipedia.org/wiki/Consumer_price_index)\n\nHarmonized Index of Consumer Price: [https://en.m.wikipedia.org/wiki/Harmonised\\_Index\\_of\\_Consumer\\_Prices](https://en.m.wikipedia.org/wiki/Harmonised_Index_of_Consumer_Prices)\n\nCollectively, the top 5 of them are most predictive of\n\n1. [Total Industry Production Excluding Construction for Switzerland](https://fred.stlouisfed.org/series/PRINTO01CHQ661N)\n2. [Long-Term Government Bond Yields: 10-year: Main (Including Benchmark) for Switzerland](https://fred.stlouisfed.org/series/IRLTLT01CHM156N)\n3. Johnson &amp; Johnson [JNJ](https://tsterm.com/fin/JNJ.US)\n4. Danaher Corporation DHR\n5. Oracle Corporation ORCL\n6. USDHKD\n7. Lockheed Martin LMT\n8. iShares Russell 2000 ETF IWM\n9. Cognizant Technology Solutions Corporation CTSH\n10. MercadoLibre, Inc. MELI\n\n(Controversies aside,) GameStop Corp. GME appears to be [predictive](https://tsterm.com/fin/CSUSHPINSA) of [S&amp;P/Case-Shiller U.S. National Home Price Index](https://fred.stlouisfed.org/series/CSUSHPINSA), [likewise](https://tsterm.com/fin/SPCS20RNSA) of [S&amp;P/Case-Shiller 20-City Composite Home Price Index](https://fred.stlouisfed.org/series/SPCS20RNSA).",
        "subreddit": "StockMarket",
        "title": "As of 2021-10-03",
        "url": "https://www.reddit.com/r/StockMarket/comments/q12d9w/as_of_20211003/",
        "created": 1633370389.0
    },
    {
        "author": "CapableScholar16",
        "created_utc": 1633476412,
        "id": "q28a90",
        "num_comments": 657,
        "num_crossposts": 0,
        "selftext": "Donald Trump tweets, Elon Musk Papa Elon TSLA, Stonks go up, No GME/AMC, Real Wall Street professionals dropping insider tips, PYPL, SHOP, SQ, JPow printers go brrrr, and more.\n\nI am willing to give up 50% of my portfolio for me to experience 2020 again. Including March. Even without the ability to trade, I just want my news feed to replicate March 2020 until December 2020. Of course this should exclude people dying from Covid. I am talking about the chaosity of it. Anyone else like me?",
        "subreddit": "wallstreetbets",
        "title": "Does anyone else miss 2020 or is it just me?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q28a90/does_anyone_else_miss_2020_or_is_it_just_me/",
        "created": 1633505212.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1633524299,
        "id": "q2jolj",
        "num_comments": 396,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "In case you aren’t aware, starting next year. If you transact $600 or more, your payment processor (Bank, PayPal, Venmo, Exchange) will be required to report it to the IRS. This is gonna hurt $EBAY and $ETSY because they are mostly small businesses. Heads up and prepare if you need to.",
        "url": "https://www.reddit.com/gallery/q2jolj",
        "created": 1633553099.0
    },
    {
        "author": "Curious-Interest-734",
        "created_utc": 1633466608,
        "id": "q255e0",
        "num_comments": 327,
        "num_crossposts": 0,
        "selftext": "So many ppl lost money in all the tickers, cause we retails are divided by the hedgies, look what happen with GME and AMC.  We won because we are focus. I have cashed out all my earnings to all in on PSFE because the exact same scenario is happening. I all in in GME at 30 and it rose to 300. I've put my capital in AMC at 3 and it rose to 70. PSFE is the next GME, igaming revenue up 70%, transactional volume up 41%, no pipe is selling but stocks tank to 7 from 19.\n\nRecently I bought in affirm at 60, when it got shorted down from 100, good news happened and it rose 100%. We all want the next AMC and I am quite certain PSFE is the next. It monopolize Canada's igaming market by having a 100% share and 75% share in the US. All of the big betting players are a client of PSFE.\n\nNone of the pipe has sold here, bill foley with 30m shares, dan loeb with 41m shares. Blackrock just bought in at 8.3m shares at $12. This will explode soon. Shorts are trapped with &gt;10% float just like AMC was when it was at $8.\n\nPaysafe’s share price with average of sector peer multiples:\n\nEV/EBITDA ratio : $122.09EV/Rev ratio : $83.91EV/FCF ratio : $87.86Average: $97.95\n\nMore realistic price after removing all outliers in each category which put PSFE share price over $100\n\nEV/EBITDA ratio : $50.75EV/Rev ratio : $44.64EV/FCF ratio : $44.18Average : $46.52\n\n\\- Paysafe Powers Online Payments for Montana Lottery’s Sportsbook\n\n\\- Paysafe Streamlines Payments for Interactive Wagering With Fubo Gaming in US\n\n\\- bunq Partners With Paysafe to Enable Cash Deposits for Digital Banking\n\n\\- Paysafe Expands Betfred USA Sports Partnership Through Income Access Deal\n\n\\- Paysafe Completes Acquisition of PagoEfectivo\n\n\\- Paysafe to Acquire viafintech\n\n\\- Paysafe to Acquire SafetyPay\n\nPaysafe acquire these companies in cash unlike Square and Paypal with stocks. These means the shareholders and board think its undervalued. Many of the buyers are stucked in at $12. I am in at $9 with 35k shares. Affirm has 2x since. I bought AMC at $12 sit to $5 and rose to $60.\n\nThis is not financial advice, do your own DD. But this just might be the next netflix. :)",
        "subreddit": "wallstreetbets",
        "title": "Paysafe 10x from here.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q255e0/paysafe_10x_from_here/",
        "created": 1633495408.0
    },
    {
        "author": "apooroldinvestor",
        "created_utc": 1633214683,
        "id": "q056if",
        "num_comments": 182,
        "num_crossposts": 0,
        "selftext": "I realize there will be a lot of pressure on faang and tech coming up but I'm long term.  However I'm wondering if being long those (faang) I shouldn't make some short term moves to lighten my tech exposure.\n\nThe shares would be long that I'm exiting so taxes aren't much for me, although I'll feel like I'm cheating on my tech names lol.\n\nI do have things like VTI, HD, UNH, medical devices mutual fund (FSMEX), COST, ODFL, TMO, but am about 50% tech names like MSFT GOOGL NVDA AAPL ASML PYPL CRWD SQ etc.\n\nI also am 20% or a little more cash right now.  I was planning on deploying the cash into faangs if we get a significant pull back in those names which I don't feel we have had yet.\n\nI'm mainly wondering if that's a good strategy (buying significant dips in tech mega cap) or if some cash should be deployed into \"reopening\" (although I'm kind of tired of hearing about that! Lol) stocks,\n\nOr deployed into industrials or whatever. \n\nI realize being 50% tech I'm gonna get hit, but I always think of tech rebounding eventually so it doesn't worry me.  I know that long term MSFT AAPL GOOGL NVDA will go up imo.\n\nMy portfolio is already down about 4% for September, but I'm not panicking yet!",
        "subreddit": "stocks",
        "title": "Tech heavy, 20% cash. What to do.",
        "url": "https://www.reddit.com/r/stocks/comments/q056if/tech_heavy_20_cash_what_to_do/",
        "created": 1633243483.0
    },
    {
        "author": "Zrocker04",
        "created_utc": 1633968944,
        "id": "q5ze2f",
        "num_comments": 127,
        "num_crossposts": 0,
        "selftext": "**Think your portfolio can outperform a 1.5 and 7 year old? Then stay tuned lol.**\n\nSo I posted a few weeks ago about letting our children pick their own stocks. Details on how we do it below the portfolios. \n\n**7 Year old portfolio: Moderna, Dcoin (can't spell it out here), SPYG, SPY, Square, Netflix**\n\n**1.5 Year old portfolio: Moderna, SPY, SPYG, Ether (same as above), PayPal, Russell 1000 ETF**\n\nSo far I'm actually impressed with the picks. The SPY/SPYG picks were because we forgot pick and they needed ETFs.\n\nMy girlfriend has a 7 year old boy and we have a 1.5YO daughter. I put together a list of stocks to pick from (like 200-300 to pick from, ETFs and 10+ of each major market sector). We let them pick or play games to pick. The 1.5YO rolls dice most the time lol. We put in $10 every week to whatever they pick. 25% must be in ETFs for some stability. \n\nThey'll have access to the money once they're 18, accounts are still in our names just in case, and we don't expect to cash out enough to increase the capital gains taxes. We'll still likely be the gatekeepers for the money so they don't just blow it on hookers; more for a car, college, travel, etc.",
        "subreddit": "wallstreetbets",
        "title": "Letting children pick stocks: Week 6 update",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q5ze2f/letting_children_pick_stocks_week_6_update/",
        "created": 1633997744.0
    },
    {
        "author": "Zrocker04",
        "created_utc": 1633968574,
        "id": "q5z969",
        "num_comments": 113,
        "num_crossposts": 0,
        "selftext": "**Think your portfolio can outperform a 1.5 and 7 year old? Then stay tuned lol.**\n\nSo I posted a few weeks ago about letting our children pick their own stocks. Details on how we do it below the portfolios. \n\n**7 Year old portfolio: Moderna, Dogecoin, SPYG, SPY, Square, Netflix**\n\n**1.5 Year old portfolio: Moderna, SPY, SPYG, Ethereum, PayPal, Russell 1000 ETF**\n\nSo far I'm actually impressed with the picks. The 1.5YO SPY/SPYG picks were because we forgot to let her roll the dice lol.\n\nMy girlfriend has a 7 year old boy and we have a 1.5YO daughter. I put together a list of stocks to pick from (like 200-300 to pick from, ETFs and 10+ of each major market sector). We let them pick or play games to pick. The 1.5YO rolls dice most the time lol. We put in $10 every week to whatever they pick. 25% must be in ETFs for some stability. \n\nThey'll have access to the money once they're 18, accounts are still in our names just in case, and we don't expect to cash out enough to increase the capital gains taxes. We'll still likely be the gatekeepers for the money so they don't just blow it on hookers; more for a car, college, travel, etc.",
        "subreddit": "stocks",
        "title": "Letting children pick their own stocks: Week 6",
        "url": "https://www.reddit.com/r/stocks/comments/q5z969/letting_children_pick_their_own_stocks_week_6/",
        "created": 1633997374.0
    },
    {
        "author": "Phx-Jay",
        "created_utc": 1633531029,
        "id": "q2lrum",
        "num_comments": 65,
        "num_crossposts": 0,
        "selftext": "Paysafe (PSFE)\n\nHave you Apes been missing the news lately on a stock that is one of us?  Why? Paysafe is a leading supporter of online gaming and the deals recently announced are not priced into the stock.  If anyone should be supporting gambling it is us?\n\nIt’s has a high potential of being bought…\n\n“The Bottom Line\n\nSomeone is going to buy this company.\n\nProcessors are looking for growth and innovation. They’re all focused on Square (NASDAQ:SQ), which has only grown more popular as it has gone into various banking and investment niches.\n\nGambling doesn’t scare the payments industry. Casino contracts are highly prized. Processors don’t hand gamblers money they don’t have. When the gambler is out of money, they reject the transaction. Many casinos have special rules for gambler transactions aimed at keeping them, and the gamblers, out of trouble.\n\nThis means the downside risk of PaySafe stock is limited. There remain potential suitors for the company. The most likely is Fidelity National, which has a market cap of nearly $75 billion. But if Foley sees a better bid, he will certainly take it.\n\nThe debt means PaySafe’s enterprise value is fair, not low. But you can buy it here.”\n\nIt now has deals with Fubo, Montana Lottery Sportsbook, and many more on the way…\n6 days ago:\n\n“FuboTV Inc (NYSE: FUBO) is trading higher Thursday after the company's subsidiary, Fubo Gaming, announced a partnership with Paysafe (NYSE: PSFE).\nFubo Sportsbook will plug into Paysafe for credit and debit card payments. It is expected to launch in the fourth quarter.”\n\n2 Days Ago:\n\n“HOUSTON, October 04, 2021--(BUSINESS WIRE)--Paysafe (NYSE: PSFE), a leading specialized payments platform, today announced a new partnership with INTRALOT, a leading global gaming solutions supplier. INTRALOT’s sports-betting platform has integrated with Paysafe to enable the Montana government-operated lottery to provide its online sportsbook patrons with a comprehensive suite of traditional and alternative payment methods via a single API.”\n\nThe third and fourth quarter earnings are going to beat.  There are no supply chain issues with this company and gambling is through the roof.  I don’t YOLO but I’m considering it with this stock.  At only $7 and $5 Billion Market Cap this is one of the best deals.  \n\nMore institutional ownership then ever:\n\n\n“The number of bullish hedge fund positions improved by 9 lately. Paysafe Limited (NYSE:PSFE) was in 50 hedge funds' portfolios at the end of June. The all time high for this statistic was previously 41. This means the bullish number of hedge fund positions in this stock currently sits at its all time high. Our calculations also showed that PSFE isn't among the 30 most popular stocks among hedge funds (click for Q2 rankings).”\n\nGet on the rocket at this price…its not going to zero so very limited risk at this level.  Revenue increasing every quarter….just look at the charts.  I wouldn’t be surprised if they announce getting into BNPL as well since that is the hot industry.\n\nPositions:\n\n3000 Shares\n11/19/21 8C",
        "subreddit": "wallstreetbets",
        "title": "PSFE….the next SQ / PayPal to the moon",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q2lrum/psfethe_next_sq_paypal_to_the_moon/",
        "created": 1633559829.0
    },
    {
        "author": "Jerome_BRRR_Powell",
        "created_utc": 1633663461,
        "id": "q3pc8x",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Gentlemen, I hope you have been making the most of the opportunity my dear friend, Moscow Mitch has provided you. ie I **HOPE YOU BOUGHT THE DIP F%\\*%\\*#\\*@**\n\nWhile I still have your attention, I would like to introduce you to a company that me and some fellows have been bag holding (in the red) for a while.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/3jmjge40a5s71.png?width=1379&amp;format=png&amp;auto=webp&amp;s=cc941bbcf643c78cefe803ee9ce4174b8f8e5889\n\n**Payoneer, the Paypal for** **~~Shithole~~** **Developing Countries**\n\n**Payoneer** is Paypal for B2B global commerce, particularly outside North American and Europe. The company provides B2B services for millions of SMB and enterprises around the world\n\n&amp;#x200B;\n\nhttps://preview.redd.it/qn847nz0a5s71.png?width=1759&amp;format=png&amp;auto=webp&amp;s=d05be8973c4bfefe00396c250fb92fe123c5f0ae\n\nThe ideal customer is a small but growing SMB doing business all over the world which needs currency, compliance and business services. Payoneer is an obvious candidate to handles these needs given its global network.\n\n· Payoneer offers vendors the ability to move money with a U.S. bank account and pay suppliers, without having to deal with too many banking hurdles or red tape.\n\n· A lot of freelancers on Upwork.com use Payoneer because many of them live in countries that Upwork.com can't wire money to.\n\n· Once vendors receive funds into their Payoneer account they can either withdraw the cash using their Payoneer provided Master Card or do a direct bank transfer from Payoneer to their local bank. Usually funds arrive within 1-2 business days.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/cjzym5w1a5s71.png?width=1764&amp;format=png&amp;auto=webp&amp;s=e77f88b654fe44aca54902b8a4f1d18bb7c519b9\n\nSo, it is basically a bank that includes an accountant to help meet a business’ needs. The one product or feature that is missing is digital coins.\n\nSay a consumer wants to rent an airbnb. They use a credit card (or other payment method) to pay airbnb, a payment gateway facilitates payment acceptance. The payment is then processed and Airbnb ends up with the money from the transaction. Airbnb has now gathered cash through its acquirers (e.g., Adyen, ACI). Airbnb now needs to distribute funds to its SMB sellers. Airbnb uses payoneer to disburse funds to sellers. From this example, you can see Payoneer isn't competing with companies like Adyen or other acquirers/ processors, even though they are processing payments.\n\nPayoneer signs up individual sellers, which allows the sellers to use payoneer across platforms (e.g., facebook marketplace and amazon). Hyperwallet (owned by PayPal) is one of their competitors, but Hyperwallet operates completely differently, they sign up users via the platform, but this means you can't use hyperwallet for your business on both amazon and fb marketplace without going through the onboarding process again. Given the trend towards SMB sellers operating across multiple marketplaces, this is a huge benefit for payoneer, and makes PayPal's offering a lot less competitive. It also means Payoneer owns the seller relationship in a way that PayPal doesn't do as effectively, and makes it easier for them to package other offerings (e.g., working capital). These other offerings provide a two-fold benefit - their customer relationships become stronger, so revenue is seen as more recurring and investors will pay a higher multiple; and they'll make more money per customer.\n\nMy view is that Payoneer should see an S-type growth curve, where they'll hit a critical mass of users and see exponential growth, like cashapp, or venmo. Their investor presentation projects 25% revenue growth over the next couple years, I think this is super conservative, especially considering that 25% growth rate doesn't account for the two travel related marketplaces that got screwed by covid. Once they hit that critical mass of users, they'll pop off, sales &amp; marketing expenses will drop, and they'll become profitable.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/5xuonwi2a5s71.png?width=1556&amp;format=png&amp;auto=webp&amp;s=b57e5a829bbcb5d58f51cbdc2e426ceca0ccd2a3\n\nThe company’s focus on investing for future services is actually what gets me most excited as it may ward off near-term investor interest and improves its competitive position. It’s also a sign of a mature management team. The opportunity to provide additional services such as working capital, compliance and tax services seems like an obvious strategic move to drive growth. Specifically, working capital is far and away the most important service and something SMBs are desperate for.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zi2sl613a5s71.png?width=1664&amp;format=png&amp;auto=webp&amp;s=e959a0115d4cbb201b531f77ae5276a31026a7d1\n\nWho are their customers and where are they know? 5 million businesses in 190 countries. Customers include Amazon, Wish, Lazada (owned by Alibaba) Shopee, and Ebay. Weird right, they work with Ebay given Paypal does too. This is because they work with countries and specific clients that Paypal not accept into their platform. Investors need to understand that sometimes people have to use other platforms because they the Paypal’s or banks are NOT willing to take the risk. Sure the risk is probably higher but the amount of people that need access to capital or payment process is high when many banks in many countries do not approve people for such type of access.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/r1kinxk3a5s71.png?width=1631&amp;format=png&amp;auto=webp&amp;s=74cd5a7bdb3d3934ce730e1dd9aa9204ff72b259\n\n# Payoneer vs PayPal\n\nThe growth of Payoneer’s global network included a move into India in April 2016, following a partnership with Pune-based IndusInd Bank and expressions of interest in its services from more than 10,000 freelancers and small businesses across the country. \n\n2018 PayPal study suggest that India’s freelancers represent around one quarter of the world’s gig workforce.\n\n**In August 2019, Payoneer announced a year-on-year increase of 400% in its customer base and a threefold increase in payment volumes processed in India.**\n\n*“PayPal says to shut domestic payments business in India” \\~ Reuters*\n\nNEW DELHI (Reuters) - PayPal Holdings Inc will wind down its domestic payments business in India from April 1,2021 the company said in a statement on Friday.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gcipi9b4a5s71.png?width=1743&amp;format=png&amp;auto=webp&amp;s=c3b20d766db9f0b8302c16582755758489bc479e\n\nB2B global marketplace. The attractiveness of FinTech can be summarized in a few words, namely, “scale” and “network effects”. From the metrics Payoneer shared, it looks like they’re benefitting from these dynamics. Analysts estimate the global B2B market at tens of trillions $ and cross-border payments at $300bn. Obviously the pandemic only accelerated these trends. (From the presentation, it looks like company B2B AR/AP volume more than doubled at 140% in 2020 although the CFO later cited a 53% increase in volumes so not sure exactly how to interpret that.)\n\nVolume and customer growth drives revenues. Volumes grew over 53% in 2020 (67% adjusted for the pandemic) and are expected to grow at 44% and 33% in 2021 and 2022, respectively, which translates into 25% annual revenue growth per year for the next two years.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ghmjbjt4a5s71.png?width=1721&amp;format=png&amp;auto=webp&amp;s=4c9dcfa310f5e6a4bc90b66fbf9fc8b018377aa7\n\nThe benefits of network effects cannot be overstated as Paypal has proven. As a company acquires more customers, the value of its network increases. Payoneer’s business model leverages this same dynamic. Moreover, its network would be very difficult to replicate. The company’s global platform includes over 80 banks and clearing partners in over 100 countries. The company also provides customers data about its transactions, which I believe will be increasingly useful and sticky.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/z9x3x8b5a5s71.png?width=1797&amp;format=png&amp;auto=webp&amp;s=caa49b84156468b94a9f50b9a23ffb208340eba3\n\nWhat do I think the future holds for Payoneer? I actually think there are several exits for this company.\n\n**Growth:**\n\nNote that Payoneer currently doesn’t do B2C, hence it may be quite common for retail to never even have heard of it, unless they are a business or in the gig economy. That is one of the problems for the stock, no one has heard of it (yet) because it works quietly behind the scenes. Given enough funding, who knows, Payoneer may well expand to B2C. Alibaba initially started as B2B as well but has since expanded to B2C (Taobao).\n\nWe just need Payoneer to be 5% of PayPal (ie. $15B market cap) in order for stock price to be in the $30-$40 range. ($6B market cap corresponds to around $13-$15 stock price.) \n\n&amp;#x200B;\n\nhttps://preview.redd.it/95silwp5a5s71.png?width=1748&amp;format=png&amp;auto=webp&amp;s=f10a138995c52367baa00ed4a10e9287c5da04ee\n\n**Acquisition:**  \n Large international payments processer buys them. Could be Paypal, Square, Stripe, First Data, etc. consolidation WILL happen in this space and I think short-term Payoneer will acquire some companies and then be sold to a bigger company. Think of this as how banks in the USA were allowed to merge in 1995 given the law that passed. Before you had 100,000 banks then it was 50,000 banks, then 10,000 banks and now like 5,000 banks but the top 10 banks make up a large % of the business/volume.\n\nWildcard: CRM business buys them. What many people do not realize is that CRM’s have been changing the game. First it was to help you sell with marketing tools, then it is to improve communication within the team, then it will be storage, and legal transactions then it will be financial transaction. They are literally going to control the beginning to the end of the customer relationship and all of that data they possess is very valuable to help their customers grow.\n\n&amp;#x200B;\n\nThis is not financial advice, i am not a financial advisor. I have a long position with the warrants that i purchased in February and are therefore in the red.",
        "subreddit": "wallstreetbets",
        "title": "$PAYO Baby Momma, so she can feed the kids",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q3pc8x/payo_baby_momma_so_she_can_feed_the_kids/",
        "created": 1633692261.0
    },
    {
        "author": "DDistrict",
        "created_utc": 1633464342,
        "id": "q24dvm",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hi All, \n\nCIBC Added 5 new CDR's today (PayPal, Facebook, Disney, Microsoft, Visa). \n\nDoes anyone know how the following situations would impact a CDR? \n\nIf you are holding Facebook CDRs for example and the company gets broken up, how would that affect the CDR price? Would a CDR holder reap any of the benefits (eg. X amount of shares of Instagram)? \n\nWhat about stock splits? Would the CDR split at the same rate as the under laying security? \n\nTIA",
        "subreddit": "CanadianInvestor",
        "title": "CIBC CDR's 5 Newly Added US Stocks + Questions",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/q24dvm/cibc_cdrs_5_newly_added_us_stocks_questions/",
        "created": 1633493142.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1633515750,
        "id": "q2hk93",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "PayPal leads teens in pay now buy later (BNPL) among teens in widely regarded survey",
        "url": "https://finance.yahoo.com/news/paypal-buy-now-pay-later-us-teens-191218772.html",
        "created": 1633544550.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1633964172,
        "id": "q5xn5h",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\nhttps://preview.redd.it/87ovkqet4us71.png?width=1122&amp;format=png&amp;auto=webp&amp;s=bf75d024b262c9d963cb26eb0de46b08916e3ca6\n\n**5-Year Recap**\n\n* Market Cap has increased by 710%\n* Total Revenue has increased by 620%\n* Gross Margin hs decreased by 39%\n* EPS Dilution has increased by 800%\n* P/S Ratio has increased by 30%\n* P/E Ratio N/A\n* P/B Ratio has increased by 133%\n* Total Liabilities have increased by 691%\n* Dividend Yield: 0%\n\n&amp;#x200B;\n\n**Behind the Company**\n\nSquare is an e-commerce platform for small and large businesses. Square makes it easier for customers to pay for products and services. Square’s biggest product currently is a card reader that enables businesses to offer credit card payments instead of solely using cash. Square owns the popular Cash App which allows users to send payments, receive payments, invest, hold, and buy/sell bitcoin.\n\n**Industry Overview**\n\nThe buy-now-pay-later (BNPL) industry has seen some major growth this past year. There are advantages to using BNPL over credit cards. With BNPL technology, consumers don’t have to worry about their credit scores. This can be seen as both an advantage and disadvantage. If you have a low credit score, you can use Square to avoid taking more hits on your credit. However, you can’t build up your credit score using Square. \n\n**News Timeline**\n\nJuly 20, 2021\\[Source\\]([https://squareup.com/us/en/press/introducing-square-banking](https://squareup.com/us/en/press/introducing-square-banking))\n\nAugust 1, 2021\\[Source\\](https://squareup.com/us/en/press/square-announces-plans-to-acquire-afterpay)\n\n* Square announces plan to acquire Afterpay\n   * Aimed towards a younger generation\n\nSeptember 20, 2021\\[Source\\]([https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france](https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france))\n\n* Square plans to enter France market\n\nSeptemeber 28, 2021\\[Source\\]([https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html](https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html))\n\n* Square partners with TikTok\n\n\\[Source\\]([https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187](https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187))\n\n* Mastercard announces plan to enter BNPL market\n\n**Competitors**\n\n* PayPal\n* Fiserv\n* Global Payments\n* Affirm Holdings\n* Shopify \n* Clover\n\n**Technical Analysis**\n\n[https://www.tradingview.com/chart/SQ/SdTObmDK-Square-SQ-Descending-Channel/](https://www.tradingview.com/chart/SQ/SdTObmDK-Square-SQ-Descending-Channel/)\n\n**Bullish Case**\n\n* BNPL industry has global potential to grow \n* Small business lending is increasing\n* Invested heavily in Bitcoin \n\n**Bearish Case**\n\n* Strong competition in the BNPL industry\n* Speculation of future revenue reliant on Bitcoin\n* Invested heavily in Bitcoin\n\n**Management** \n\nSquare CEO Jack Dorsey is somewhat a prodigy. Having co-founded Twitter back in 06’, Jack now. Dorsey is one of the most successful self-taught coders in the world. Not many CEOs can say they’ve helped build their companies' platforms and helped manage them. \n\n**Conclusion**\n\nI am concerned about Mastercard’s announcement to enter the BNPL market. I believe that other credit cards and banks will follow suit. Up until now, banks have been slow to respond and are sustaining huge losses because of it. The BNPL market is pretty saturated as it is. The BNPL market as a whole is very expensive (coming from a small investor's POV). Square’s P/B ratio is currently at 40, which indicates that the company might be overvalued. On top of that, Squares Total liabilities, D/E ratio, and Long Term Debt have all seen a sharp increase. Square is aggressively trying to expand by financing its debt. This alone makes me hesitant to invest. I am concerned with Square’s ties to bitcoin. I labeled this as both a bullish and bearish case. Square invested a good chunk of money in bitcoin. That means their reliant on bitcoins performance. If bitcoin goes up, they go up. If bitcoin goes down, they do down. There is a lot of news and government intervention surrounding bitcoin which can either be positive or negative. I do believe the BNPL industry is a growing market, but with more competition entering the market, it will be hard for Square to capture market share. \n\n*\\*\\*This is not investment advice. I am not an expert. Do your own research\\*\\**",
        "subreddit": "smallstreetbets",
        "title": "Square inc (SQ) Due Diligence",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/q5xn5h/square_inc_sq_due_diligence/",
        "created": 1633992972.0
    },
    {
        "author": "anythinggoesherename",
        "created_utc": 1633155054,
        "id": "pzpntz",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Thoughts on HMBL? They launched HUMBL Tickets™ which is a platform to provide consumers with direct access to lower-cost, premium seating options across verticals such as pro sports, college sports, concerts, theater, festivals, and more\nThey also allow the sale listing and purchase of NFTs\nThey’re doing a lot more and still getting shorted like crazy. I believe they have the potential to rival PayPal but it’s just not getting steam. What say y’all?",
        "subreddit": "wallstreetbets",
        "title": "Humbl Inc",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pzpntz/humbl_inc/",
        "created": 1633183854.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1634045695,
        "id": "q6mbk4",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\n[5-Year Recap](https://preview.redd.it/gd6lq7iru0t71.png?width=1122&amp;format=png&amp;auto=webp&amp;s=029563f3871fd847d8c7822cec3ae29094e10ec2)\n\n* Market Cap has increased by 710%\n* Total Revenue has increased by 620%\n* Gross Margin hs decreased by 39%\n* EPS Dilution has increased by 800%\n* P/S Ratio has increased by 30%\n* P/E Ratio N/A\n* P/B Ratio has increased by 133%\n* Total Liabilities have increased by 691%\n* Dividend Yield: 0%\n\n**Behind the Company**\n\nSquare is an e-commerce platform for small and large businesses. Square makes it easier for customers to pay for products and services. Square’s biggest product currently is a card reader that enables businesses to offer credit card payments instead of solely using cash. Square owns the popular Cash App which allows users to send payments, receive payments, invest, and hold.\n\n**Industry Overview**\n\nThe buy-now-pay-later (BNPL) industry has seen some major growth this past year. There are advantages to using BNPL over credit cards. With BNPL technology, consumers don’t have to worry about their credit scores. This can be seen as both an advantage and disadvantage. If you have a low credit score, you can use Square to avoid taking more hits on your credit. However, you can’t build up your credit score using Square. \n\n**News Timeline**\n\nJuly 20, 2021\n\n\\[Source\\]([https://squareup.com/us/en/press/introducing-square-banking](https://squareup.com/us/en/press/introducing-square-banking))\n\nAugust 1, 2021\n\n\\[Source\\](https://squareup.com/us/en/press/square-announces-plans-to-acquire-afterpay)\n\n* Square announces plan to acquire Afterpay\n   * Aimed towards a younger generation\n\nSeptember 20, 2021\n\n\\[Source\\]([https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france](https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france))\n\n* Square plans to enter France market\n\nSeptemeber 28, 2021\n\n\\[Source\\]([https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html](https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html))\n\n* Square partners with TikTok\n\n\\[Source\\]([https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187](https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187))\n\n* Mastercard announces plan to enter BNPL market\n\n**Competitors**\n\n* PayPal\n* Fiserv\n* Global Payments\n* Affirm Holdings\n* Shopify \n* Clover\n\n**Technical Analysis**\n\n**Bullish Case**\n\n* BNPL industry has global potential to grow \n* Small business lending is increasing\n* &amp;#x200B;\n\n**Bearish Case**\n\n* Strong competition in the BNPL industry\n* &amp;#x200B;\n\n**Management** \n\nSquare CEO Jack Dorsey is somewhat a prodigy. Having co-founded Twitter back in 06’, Jack now. Dorsey is one of the most successful self-taught coders in the world. Not many CEOs can say they’ve helped build their companies' platforms and helped manage them. \n\n**Conclusion**\n\nI am concerned about Mastercard’s announcement to enter the BNPL market. I believe that other credit cards and banks will follow suit. Up until now, banks have been slow to respond and are sustaining huge losses because of it. The BNPL market is pretty saturated as it is. The BNPL market as a whole is very expensive (coming from a small investor's POV). Square’s P/B ratio is currently at 40, which indicates that the company might be overvalued. On top of that, Squares Total liabilities, D/E ratio, and Long Term Debt have all seen a sharp increase. Square is aggressively trying to expand by financing its debt. This alone makes me hesitant to invest. I do believe the BNPL industry is a growing market, but with more competition entering the market, it will be hard for Square to capture market share. \n\n*\\*\\*This is not investment advice. I am not an expert. Do your own research\\*\\**",
        "subreddit": "wallstreetbets",
        "title": "Square (SQ) Due Diligence",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q6mbk4/square_sq_due_diligence/",
        "created": 1634074495.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1633963869,
        "id": "q5xjd0",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\nhttps://preview.redd.it/2bqq1cuw3us71.png?width=1122&amp;format=png&amp;auto=webp&amp;s=57fd105af6509015a5ab14c577672023e09d440c\n\n**5-Year Recap**\n\n* Market Cap has increased by 710%\n* Total Revenue has increased by 620%\n* Gross Margin hs decreased by 39%\n* EPS Dilution has increased by 800%\n* P/S Ratio has increased by 30%\n* P/E Ratio N/A\n* P/B Ratio has increased by 133%\n* Total Liabilities have increased by 691%\n* Dividend Yield: 0%\n\n&amp;#x200B;\n\n**Behind the Company**\n\nSquare is an e-commerce platform for small and large businesses. Square makes it easier for customers to pay for products and services. Square’s biggest product currently is a card reader that enables businesses to offer credit card payments instead of solely using cash. Square owns the popular Cash App which allows users to send payments, receive payments, invest, hold, and buy/sell bitcoin.\n\n**Industry Overview**\n\nThe buy-now-pay-later (BNPL) industry has seen some major growth this past year. There are advantages to using BNPL over credit cards. With BNPL technology, consumers don’t have to worry about their credit scores. This can be seen as both an advantage and disadvantage. If you have a low credit score, you can use Square to avoid taking more hits on your credit. However, you can’t build up your credit score using Square. \n\n**News Timeline**\n\nJuly 20, 2021\\[Source\\]([https://squareup.com/us/en/press/introducing-square-banking](https://squareup.com/us/en/press/introducing-square-banking))\n\nAugust 1, 2021\\[Source\\](https://squareup.com/us/en/press/square-announces-plans-to-acquire-afterpay)\n\n* Square announces plan to acquire Afterpay\n   * Aimed towards a younger generation\n\nSeptember 20, 2021\\[Source\\]([https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france](https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france))\n\n* Square plans to enter France market\n\nSeptemeber 28, 2021\\[Source\\]([https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html](https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html))\n\n* Square partners with TikTok\n\n\\[Source\\]([https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187](https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187))\n\n* Mastercard announces plan to enter BNPL market\n\n**Competitors**\n\n* PayPal\n* Fiserv\n* Global Payments\n* Affirm Holdings\n* Shopify \n* Clover\n\n**Technical Analysis**\n\n[https://www.tradingview.com/chart/SQ/SdTObmDK-Square-SQ-Descending-Channel/](https://www.tradingview.com/chart/SQ/SdTObmDK-Square-SQ-Descending-Channel/)\n\n**Bullish Case**\n\n* BNPL industry has global potential to grow \n* Small business lending is increasing\n* Invested heavily in Bitcoin \n\n**Bearish Case**\n\n* Strong competition in the BNPL industry\n* Speculation of future revenue reliant on Bitcoin\n* Invested heavily in Bitcoin\n\n**Management** \n\nSquare CEO Jack Dorsey is somewhat a prodigy. Having co-founded Twitter back in 06’, Jack now. Dorsey is one of the most successful self-taught coders in the world. Not many CEOs can say they’ve helped build their companies' platforms and helped manage them. \n\n**Conclusion**\n\nI am concerned about Mastercard’s announcement to enter the BNPL market. I believe that other credit cards and banks will follow suit. Up until now, banks have been slow to respond and are sustaining huge losses because of it. The BNPL market is pretty saturated as it is. The BNPL market as a whole is very expensive (coming from a small investor's POV). Square’s P/B ratio is currently at 40, which indicates that the company might be overvalued. On top of that, Squares Total liabilities, D/E ratio, and Long Term Debt have all seen a sharp increase. Square is aggressively trying to expand by financing its debt. This alone makes me hesitant to invest. I am concerned with Square’s ties to bitcoin. I labeled this as both a bullish and bearish case. Square invested a good chunk of money in bitcoin. That means their reliant on bitcoins performance. If bitcoin goes up, they go up. If bitcoin goes down, they do down. There is a lot of news and government intervention surrounding bitcoin which can either be positive or negative. I do believe the BNPL industry is a growing market, but with more competition entering the market, it will be hard for Square to capture market share. \n\n*\\*\\*This is not investment advice. I am not an expert. Do your own research\\*\\**",
        "subreddit": "StockMarket",
        "title": "Square inc (SQ) Due Diligence",
        "url": "https://www.reddit.com/r/StockMarket/comments/q5xjd0/square_inc_sq_due_diligence/",
        "created": 1633992669.0
    },
    {
        "author": "Zrocker04",
        "created_utc": 1633968782,
        "id": "q5zbwb",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Think your portfolio can outperform a 1.5 and 7 year old? Then stay tuned lol.**\n\nSo I posted a few weeks ago about letting our children pick their own stocks. Details on how we do it below the portfolios. \n\n**7 Year old portfolio: Moderna, DCOIN (can't type it out here), SPYG, SPY, Square, Netflix**\n\n**1.5 Year old portfolio: Moderna, SPY, SPYG, ETHER (same as above) , PayPal, Russell 1000 ETF**\n\nSo far I'm actually impressed with the picks. The 1.5YO SPY/SPYG picks were because we forgot to let her roll the dice lol.\n\nMy girlfriend has a 7 year old boy and we have a 1.5YO daughter. I put together a list of stocks to pick from (like 200-300 to pick from, ETFs and 10+ of each major market sector). We let them pick or play games to pick. The 1.5YO rolls dice most the time lol. We put in $10 every week to whatever they pick. 25% must be in ETFs for some stability. \n\nThey'll have access to the money once they're 18, accounts are still in our names just in case, and we don't expect to cash out enough to increase the capital gains taxes. We'll still likely be the gatekeepers for the money so they don't just blow it on hookers; more for a car, college, travel, etc.",
        "subreddit": "wallstreetbets",
        "title": "Letting children pick stocks: Week 6 Update",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/q5zbwb/letting_children_pick_stocks_week_6_update/",
        "created": 1633997582.0
    },
    {
        "author": "Tomkila",
        "created_utc": 1633364187,
        "id": "q18pbd",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "“Subscription/Recurring Billing Management Market Research Report by Industry, by Deployment, by Payment Mode, by Region - Global Forecast to 2025 - Cumulative Impact of COVID-19”\nTweet this\nThe Global Subscription/Recurring Billing Management Market size was estimated at USD 5,122.88 Million in 2020 and expected to reach USD 5,941.43 Million in 2021, at a Compound Annual Growth Rate (CAGR) 16.02% to reach USD 10,772.14 Million by 2025.\n\nCompetitive Strategic Window:\n\nThe Competitive Strategic Window analyses the competitive landscape in terms of markets, applications, and geographies to help the vendor define an alignment or fit between their capabilities and opportunities for future growth prospects. It describes the optimal or favorable fit for the vendors to adopt successive merger and acquisition strategies, geography expansion, research &amp; development, and new product introduction strategies to execute further business expansion and growth during a forecast period.\n\nFPNV Positioning Matrix:\n\nThe FPNV Positioning Matrix evaluates and categorizes the vendors in the Subscription/Recurring Billing Management Market based on Business Strategy (Business Growth, Industry Coverage, Financial Viability, and Channel Support) and Product Satisfaction (Value for Money, Ease of Use, Product Features, and Customer Support) that aids businesses in better decision making and understanding the competitive landscape.\n\nMarket Share Analysis:\n\nThe Market Share Analysis offers the analysis of vendors considering their contribution to the overall market. It provides the idea of its revenue generation into the overall market compared to other vendors in the space. It provides insights into how vendors are performing in terms of revenue generation and customer base compared to others. Knowing market share offers an idea of the size and competitiveness of the vendors for the base year. It reveals the market characteristics in terms of accumulation, fragmentation, dominance, and amalgamation traits.\n\nThe report provides insights on the following pointers:\n\n1. Market Penetration: Provides comprehensive information on the market offered by the key players\n\n2. Market Development: Provides in-depth information about lucrative emerging markets and analyze penetration across mature segments of the markets\n\n3. Market Diversification: Provides detailed information about new product launches, untapped geographies, recent developments, and investments\n\n4. Competitive Assessment &amp; Intelligence: Provides an exhaustive assessment of market shares, strategies, products, certification, regulatory approvals, patent landscape, and manufacturing capabilities of the leading players\n\n5. Product Development &amp; Innovation: Provides intelligent insights on future technologies, R&amp;D activities, and breakthrough product developments\n\nThe report answers questions such as:\n\n1. What is the market size and forecast of the Global Subscription/Recurring Billing Management Market?\n\n2. What are the inhibiting factors and impact of COVID-19 shaping the Global Subscription/Recurring Billing Management Market during the forecast period?\n\n3. Which are the products/segments/applications/areas to invest in over the forecast period in the Global Subscription/Recurring Billing Management Market?\n\n4. What is the competitive strategic window for opportunities in the Global Subscription/Recurring Billing Management Market?\n\n5. What are the technology trends and regulatory frameworks in the Global Subscription/Recurring Billing Management Market?\n\n6. What is the market share of the leading vendors in the Global Subscription/Recurring Billing Management Market?\n\n7. What modes and strategic moves are considered suitable for entering the Global Subscription/Recurring Billing Management Market?\n\nMarket Dynamics\n\nDrivers\n\nRising Penetration of Electronic Media and Devices Coupled with Advanced Subscription &amp; Billing Software\nGrowing Demand for Integrated Subscription and Billing Platform\nIncreasing Customer Awareness and Subscription Base\nGrowing Adoption of Subscription and Billing Solutions across Various Industries\nRestraints\n\nComplex Customization &amp; ROI Risk for Businesses and Customer Concern Regarding Security\nOpportunities\n\nScalability of SaaS Business Model\nUpgradation of Legacy System and Scalability Associated with SaaS Business Model\nAdoption of Emerging Technologies and the Economic Growth of Countries such as India and China\nThe Need to Systemize Management is Facilitated by Integration of Back-End Systems\nChallenges\n\nLimited Technical Skills and Expertise\nAdvanced Cost Associated with System Transformation\nCompanies Mentioned\n\n2Checkout.com, Inc. by VeriFone Holdings, Inc.\nActivePlatform\nAmazon.com, Inc.\nAria Systems, Inc.\nBluSynergy\nBraintree by PayPal Holdings, Inc.\nCerillion PLC\nCleverbridge AG\nConga\nDXC Technology Company\nFastSpring\nFreshBooks\nLogiSense Corporation\nOracle Corporation\nRecurly, Inc.\nSalesforce.com, Inc.\nSAP SE\nStripe\nTransverse, LLC\nZoho Corporation Pvt. Ltd.\nZuora, Inc.",
        "subreddit": "StockMarket",
        "title": "Insights on the Subscription/Recurring Billing Management Global Market to 2025 - Featuring ActivePlatform, Amazon and FastSpring Among Others - ResearchAndMarkets.com",
        "url": "https://www.reddit.com/r/StockMarket/comments/q18pbd/insights_on_the_subscriptionrecurring_billing/",
        "created": 1633392987.0
    },
    {
        "author": "vanturetrading",
        "created_utc": 1633956254,
        "id": "q5v0qh",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good morning everyone, I hope you had a nice and relaxing weekend.\n\n*This list is geared towards day trading. With the momentum watchlist especially, I am typically in and out very quickly, only occasionally longer than a couple minutes, usually faster scalps.* Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management for your account. Feel free to message me if you have any questions.\n\n**Main Watchlist:**\n\nGapping UP:\n\n* BABA\n* MARA\n* AZPN\n* PDD\n* FANG\n* OXY\n* CPE\n* ACY\n* PTGX\n\nGapping DOWN:\n\n* LUV\n* NVDA\n* AMD\n* PYPL\n* TWTR\n* NET\n\n**Momentum Watchlist:**\n\n* FLXN (+70%)\n* ADMS (+70%)\n* EZFL (+20%)\n* BFI (+12%)\n* NNVC (+4%)\n\n**Market Outlook:**\n\nStocks are looking to open lower this morning, albeit somewhat mixed. With the major indices hovering near relevant SMA's, the next few days will be important for the market. Will we see a bounce off these support levels once again, or will we break down? Things are looking bearish to me from a TA standpoint, but we'll see how things look closer to market open. I'll also be watching the mega caps closely, as if they show weakness, the whole market could follow. Growth slowdown remains a concern, as we saw Goldman Sachs cut their U.S. GDP growth forecast for both 2021 and next year. With growth slowdown concerns and supply chain issues, we could be in for quite a ride this (and next) earnings season. \n\nSPY is trading a bit over 436, and could test the SMA(100) at \\~434.81 as support in today's trading. SMA(9) is also relevant at 433.86. If we easily break down through those levels, we could see more red. Regardless, we should see more volatility today. If SPY sees strength, I'll be watching the resistance level around 438. DIA is trading a bit over 347 and could test the SMA(100) as resistance around that level. I'll also be watching price action around the 346 support level. QQQ is trading a bit under 359 and looking bearish this morning. Currently gapping down below the SMA(100) and the SMA(9), it will likely test that 359 level as resistance. If it can't get back up, we could see red over the next few days. Gold and silver are each slightly down this morning, while crude oil is up over 3% and looks to continue its recent strength. Bitcoin is currently trading around 56,400, and we could see more consolidation up at this resistance level. Crypto-related stocks are up in premarket trading, trading in sympathy with Bitcoin. Airlines and cruise stocks are down a bit in premarket. It will be interesting if they hold up over support levels and maintain the new uptrend, or if we see more selling off. Meme stocks have been quiet recently, but it's always worth keeping an eye on them. \n\nRemember to use proper risk management, by making sure you size appropriately for your account and have a plan for every trade you enter (both for taking profits and cutting losses). Happy trading everyone :)",
        "subreddit": "StockMarket",
        "title": "Morning Update for Monday, 10/11/21",
        "url": "https://www.reddit.com/r/StockMarket/comments/q5v0qh/morning_update_for_monday_101121/",
        "created": 1633985054.0
    },
    {
        "author": "vanturetrading",
        "created_utc": 1633956060,
        "id": "q5uyvz",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good morning everyone, I hope you had a nice and relaxing weekend.\n\n*This list is geared towards day trading. With the momentum watchlist especially, I am typically in and out very quickly, only occasionally longer than a couple minutes, usually faster scalps.* Always have a plan when you enter a trade (for profit taking and for taking a loss), and use proper risk management for your account. Feel free to message me if you have any questions.\n\n**Main Watchlist:**\n\nGapping UP:\n\n* BABA\n* AZPN\n* PDD\n* FANG\n* OXY\n* CPE\n* ACY\n* PTGX\n\nGapping DOWN:\n\n* LUV\n* NVDA\n* AMD\n* PYPL\n* TWTR\n* NET\n\n**Market Outlook:**\n\nStocks are looking to open lower this morning, albeit somewhat mixed. With the major indices hovering near relevant SMA's, the next few days will be important for the market. Will we see a bounce off these support levels once again, or will we break down? Things are looking bearish to me from a TA standpoint, but we'll see how things look closer to market open. I'll also be watching the mega caps closely, as if they show weakness, the whole market could follow. Growth slowdown remains a concern, as we saw Goldman Sachs cut their U.S. GDP growth forecast for both 2021 and next year. With growth slowdown concerns and supply chain issues, we could be in for quite a ride this (and next) earnings season. \n\nSPY is trading a bit over 436, and could test the SMA(100) at \\~434.81 as support in today's trading. SMA(9) is also relevant at 433.86. If we easily break down through those levels, we could see more red. Regardless, we should see more volatility today. If SPY sees strength, I'll be watching the resistance level around 438. DIA is trading a bit over 347 and could test the SMA(100) as resistance around that level. I'll also be watching price action around the 346 support level. QQQ is trading a bit under 359 and looking bearish this morning. Currently gapping down below the SMA(100) and the SMA(9), it will likely test that 359 level as resistance. If it can't get back up, we could see red over the next few days. Gold and silver are each slightly down this morning, while crude oil is up over 3% and looks to continue its recent strength. B\\*\\*coin is currently trading around 56,400, and we could see more consolidation up at this resistance level. Cr\\*\\*to-related stocks are up in premarket trading, trading in sympathy with B\\*\\*coin. Airlines and cruise stocks are down a bit in premarket. It will be interesting if they hold up over support levels and maintain the new uptrend, or if we see more selling off. Meme stocks have been quiet recently, but it's always worth keeping an eye on them. \n\nRemember to use proper risk management, by making sure you size appropriately for your account and have a plan for every trade you enter (both for taking profits and cutting losses). Happy trading everyone :)",
        "subreddit": "stocks",
        "title": "Morning Update for Monday, 10/11/21",
        "url": "https://www.reddit.com/r/stocks/comments/q5uyvz/morning_update_for_monday_101121/",
        "created": 1633984860.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1633963909,
        "id": "q5xjwj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Introduction**\n\nSome of you may know me from my educational and due diligence posts at r/DoctorStock. We've been researching Square for the past 2 weeks, these are our compiled findings. \n\nhttps://preview.redd.it/1sp1phm14us71.png?width=1122&amp;format=png&amp;auto=webp&amp;s=2dd82ffe277b3d03d17f5749f1920cfd1fe0e4bf\n\n**5-Year Recap**\n\n* Market Cap has increased by 710%\n* Total Revenue has increased by 620%\n* Gross Margin hs decreased by 39%\n* EPS Dilution has increased by 800%\n* P/S Ratio has increased by 30%\n* P/E Ratio N/A\n* P/B Ratio has increased by 133%\n* Total Liabilities have increased by 691%\n* Dividend Yield: 0%\n\n&amp;#x200B;\n\n**Behind the Company**\n\nSquare is an e-commerce platform for small and large businesses. Square makes it easier for customers to pay for products and services. Square’s biggest product currently is a card reader that enables businesses to offer credit card payments instead of solely using cash. Square owns the popular Cash App which allows users to send payments, receive payments, invest, hold, and buy/sell bitcoin.\n\n**Industry Overview**\n\nThe buy-now-pay-later (BNPL) industry has seen some major growth this past year. There are advantages to using BNPL over credit cards. With BNPL technology, consumers don’t have to worry about their credit scores. This can be seen as both an advantage and disadvantage. If you have a low credit score, you can use Square to avoid taking more hits on your credit. However, you can’t build up your credit score using Square. \n\n**News Timeline**\n\nJuly 20, 2021\\[Source\\]([https://squareup.com/us/en/press/introducing-square-banking](https://squareup.com/us/en/press/introducing-square-banking))\n\nAugust 1, 2021\\[Source\\](https://squareup.com/us/en/press/square-announces-plans-to-acquire-afterpay)\n\n* Square announces plan to acquire Afterpay\n   * Aimed towards a younger generation\n\nSeptember 20, 2021\\[Source\\]([https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france](https://squareup.com/us/en/press/square-launches-integrated-omnichannel-solutions-for-businesses-in-france))\n\n* Square plans to enter France market\n\nSeptemeber 28, 2021\\[Source\\]([https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html](https://finance.yahoo.com/m/14b72cf0-0153-3985-ae1e-4ccf7d198700/square-partners-with-tiktok.html))\n\n* Square partners with TikTok\n\n\\[Source\\]([https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187](https://www.barrons.com/articles/mastercard-bnpl-payments-affirm-square-51632845187))\n\n* Mastercard announces plan to enter BNPL market\n\n**Competitors**\n\n* PayPal\n* Fiserv\n* Global Payments\n* Affirm Holdings\n* Shopify \n* Clover\n\n**Technical Analysis**\n\n[https://www.tradingview.com/chart/SQ/SdTObmDK-Square-SQ-Descending-Channel/](https://www.tradingview.com/chart/SQ/SdTObmDK-Square-SQ-Descending-Channel/)\n\n**Bullish Case**\n\n* BNPL industry has global potential to grow \n* Small business lending is increasing\n* Invested heavily in Bitcoin \n\n**Bearish Case**\n\n* Strong competition in the BNPL industry\n* Speculation of future revenue reliant on Bitcoin\n* Invested heavily in Bitcoin\n\n**Management** \n\nSquare CEO Jack Dorsey is somewhat a prodigy. Having co-founded Twitter back in 06’, Jack now. Dorsey is one of the most successful self-taught coders in the world. Not many CEOs can say they’ve helped build their companies' platforms and helped manage them. \n\n**Conclusion**\n\nI am concerned about Mastercard’s announcement to enter the BNPL market. I believe that other credit cards and banks will follow suit. Up until now, banks have been slow to respond and are sustaining huge losses because of it. The BNPL market is pretty saturated as it is. The BNPL market as a whole is very expensive (coming from a small investor's POV). Square’s P/B ratio is currently at 40, which indicates that the company might be overvalued. On top of that, Squares Total liabilities, D/E ratio, and Long Term Debt have all seen a sharp increase. Square is aggressively trying to expand by financing its debt. This alone makes me hesitant to invest. I am concerned with Square’s ties to bitcoin. I labeled this as both a bullish and bearish case. Square invested a good chunk of money in bitcoin. That means their reliant on bitcoins performance. If bitcoin goes up, they go up. If bitcoin goes down, they do down. There is a lot of news and government intervention surrounding bitcoin which can either be positive or negative. I do believe the BNPL industry is a growing market, but with more competition entering the market, it will be hard for Square to capture market share. \n\n*\\*\\*This is not investment advice. I am not an expert. Do your own research\\*\\**",
        "subreddit": "investing_discussion",
        "title": "Square in (SQ) Due Diligence",
        "url": "https://www.reddit.com/r/investing_discussion/comments/q5xjwj/square_in_sq_due_diligence/",
        "created": 1633992709.0
    }
]