[
    {
        "author": "VisualMod",
        "created_utc": 1624874459,
        "id": "o9h6c3",
        "num_comments": 2141,
        "num_crossposts": 0,
        "selftext": "\nYour daily hype thread. Please keep the shitposting to a maximum.\n\n^Navigate ^WSB |^We ^recommend ^best ^daily ^DD\n:--|:--                                 \n**DD** | [All](https://reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3ADD) / [**Best Daily**](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3ADD&amp;restrict_sr=on&amp;t=day) / [Best Weekly](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3ADD&amp;restrict_sr=on&amp;t=week)\n**Discussion** | [All](https://reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3ADiscussion) / [**Best Daily**](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3ADiscussion&amp;restrict_sr=on&amp;t=day) / [Best Weekly](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3ADiscussion&amp;restrict_sr=on&amp;t=week)\n**YOLO** | [All](https://reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3AYOLO) / [**Best Daily**](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3AYOLO&amp;restrict_sr=on&amp;t=day) / [Best Weekly](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3AYOLO&amp;restrict_sr=on&amp;t=week)\n**Gain** | [All](https://reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3AGain) / [**Best Daily**](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3AGain&amp;restrict_sr=on&amp;t=day) / [Best Weekly](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3AGain&amp;restrict_sr=on&amp;t=week)\n**Loss** | [All](https://reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3ALoss) / [**Best Daily**](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3ALoss&amp;restrict_sr=on&amp;t=day) / [Best Weekly](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3ALoss&amp;restrict_sr=on&amp;t=week)",
        "subreddit": "wallstreetbets",
        "title": "Daily Popular Tickers Thread for June 28, 2021 - AMD | CLF | BB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o9h6c3/daily_popular_tickers_thread_for_june_28_2021_amd/",
        "created": 1624903259.0
    },
    {
        "author": "Miladyboi",
        "created_utc": 1625002829,
        "id": "oai5jy",
        "num_comments": 931,
        "num_crossposts": 0,
        "selftext": "Ok the title says it all. \n\nJust a quick preface, my portfolio consists of just 5 stocks, AMD, JPM, BA, AAPL, and CRSR. I'm about 9% cash right now after liquidating my ETSY position and I'm looking for a great company with potential in the next 5-10 years but I'm having a little bit of trouble.\n\nAlmost every stock I want to own is trading at too high of a multiple for me so now I'm turning to you.\n\nWhat are your highest conviction plays in the long term and WHY?",
        "subreddit": "stocks",
        "title": "What are your highest conviction plays for the next 10 years???",
        "url": "https://www.reddit.com/r/stocks/comments/oai5jy/what_are_your_highest_conviction_plays_for_the/",
        "created": 1625031629.0
    },
    {
        "author": "GRAPE_FRUIT_EXTRACT",
        "created_utc": 1623422259,
        "id": "nxhh7d",
        "num_comments": 596,
        "num_crossposts": 0,
        "selftext": "Sup apes. Your favourite fruit is back for some sweet DD ($CRSR) that will catapult your shitty portfolio into the stratosphere. \n  \n\n\n  Ever heard of Corsair?\n-\nThey are the boys that fill your neat gaming PC full of dope parts. Not only are they a giant in this industry since their inception in 1994, they also got publicly listed last October for a measly **$15.**\n\n-\n\nNow, why should you care?\n-\n\nCorsair has all the properties that can make it THE stock of the decade for WSB - think AMD before they went from $4 to $80, now this time it's from $30 to $300.\n\n-\n\n**1.DeepF#ckingValue**\n-\n\nTheir current market cap stands at **3.12B** on **1.92B sales** and **148m profit.** That’s insane in itself, their current market cap is minuscule and should be at least 5x their revenue. They are making cash hand over fist every quarter and are already a crazy growth rocket. \n\n\n \n\n-\nAs per recent earnings article: *“Major industry tailwinds seem to be helping Corsair achieve strong growth rates. In the first quarter, its overall revenue grew 72% year over year to $529 million. The company also continues to see improved profitability, as gross margin jumped from 25.5% a year ago to 30.3%.”*\n\n\n-\n**2.Tiny float**\n-\n\nThey IPO’d with only 91.95 million shares outstanding and a float of 88.4 million. This entire sub could outright buy the company out. Jokes aside, this isn't moving a 500m share giant like NOKIA, but rather like your beer filled kiddiepool.\n**3.Cheap Options**\n-\nFlat movement for the last months meaning LOW IV and CHEAP option prices. $40 Calls on November are $2. And long term leaps at $50 barely cost $1.40. Since inception last year, their shares went from $15 to $54 in the span of a couple months. This rally died off when people finally decided to take profits after the IPO. But if options are too rich for you, it's still an excellent time to buy shares and park your cash there while the run up to $50 happens.\n\n**4.Low Risk** \n-\nAlways arguable, but This company just IPOed, is healthy and makes tons of cash. No risk of bankruptcy looming around the corner, or shares being diluted if it his 50$ or 100$. YOU CAN SAFELY PARK YOUR YOLO'd CASH without the company blowing up any second.\n\n**What else?**\n\nAnalysts on SA have a big raging one for CRSR. (link in comments) and there is a very possible breakout about to happen + earnings coming up in August.\n\n\n\nNow what company fits better for millions of Gamestop apes? A Gaming company that will fill every GameStop with little ram sticks and gaming gear. 🚀🚀🚀\n\n\n\n**TL:DR** $CRSR is a good bet that could safely triple your money... Or blow your brains out with 3-6 months calls.\n\nObligatory: I LIKE THE STOCK. In for 5k and adding more this month.\n  \n[More notable DD from last week.](reddit.com/r/wallstreetbets/comments/nsc45n/crsr_huge_volume_breakout_buy_wall_stalemate/)",
        "subreddit": "wallstreetbets",
        "title": "$CRSR DD or why you should park all your cash in this crazy undervalued tech company",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nxhh7d/crsr_dd_or_why_you_should_park_all_your_cash_in/",
        "created": 1623451059.0
    },
    {
        "author": "Document10",
        "created_utc": 1622723076,
        "id": "nrc7tm",
        "num_comments": 492,
        "num_crossposts": 0,
        "selftext": "Good morning!\n\nIn the last year I have spent so much time researching companies and chances are my watchlist looks like many of yours. I've been focused on zoom, tesla, crowdstrike, twlo, and stay at home stocks like fiverr, pton, and etsy. While many of these companies still have decades worth of growth ahead of them (amd), I haven't found any new exciting stocks recently. C3AI and coupang are about the only two. Coupang is the only one i would consider investing in at this moment. Would love to research some of the companies that are flying under the radar if any of you have your eyes on one.",
        "subreddit": "stocks",
        "title": "Companies no one is talking about",
        "url": "https://www.reddit.com/r/stocks/comments/nrc7tm/companies_no_one_is_talking_about/",
        "created": 1622751876.0
    },
    {
        "author": "Fugaazzi",
        "created_utc": 1623932499,
        "id": "o1vxna",
        "num_comments": 490,
        "num_crossposts": 1,
        "selftext": "&amp;#x200B;\n\n\\-Market Cap 2B\n\n\\-Cash on Hand: 1.4B and zero debt. \n\nCustomers: NEURALINK, NVDIA, SAMSUNG\n\n\\-ARKQ holding 7,664,620 shares\n\nhttps://preview.redd.it/1f4j2bodjt571.png?width=2822&amp;format=png&amp;auto=webp&amp;s=1ee643b0bf1ede3c1fdec3998a29cf46b1d852d3\n\n\\-Revolutionizing Electronic Manufacturing\n\n\\-New Patent Awarded this week for: Double-sided and multilayered printed circuit board fabrication using inkjet printing\n\n[https://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&amp;Sect2=HITOFF&amp;p=1&amp;u=%2Fnetahtml%2FPTO%2Fsearch-bool.html&amp;r=1&amp;f=G&amp;l=50&amp;co1=AND&amp;d=PTXT&amp;s1=11039541&amp;OS=11039541&amp;RS=11039541](https://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&amp;Sect2=HITOFF&amp;p=1&amp;u=%2Fnetahtml%2FPTO%2Fsearch-bool.html&amp;r=1&amp;f=G&amp;l=50&amp;co1=AND&amp;d=PTXT&amp;s1=11039541&amp;OS=11039541&amp;RS=11039541)\n\n\\-Recent Investor Presentation\n\n[https://www.nano-di.com/hubfs/2021-06-03-NNDM%20Corporate%20Presentation-final.pdf](https://www.nano-di.com/hubfs/2021-06-03-NNDM%20Corporate%20Presentation-final.pdf)\n\n&amp;#x200B;\n\n\\-Case Study\n\n[https://www.nano-di.com/rf\\_case\\_study\\_uts\\_1](https://www.nano-di.com/rf_case_study_uts_1)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fqcfxh5gjt571.png?width=530&amp;format=png&amp;auto=webp&amp;s=87b5ecaf8389fbb4c714e610a200992d7d76b08f\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ri59j81hjt571.png?width=654&amp;format=png&amp;auto=webp&amp;s=73259585d27128ce92b8646e449f668ecf52a354\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ztyh0xthjt571.png?width=317&amp;format=png&amp;auto=webp&amp;s=47d0c2223598e255674d1dca591ee1501db37718\n\n* DeepCube (which was acquired by NNDM recently) has AMD as their customer\n* NanoFabrica - acquired by NNDM recently\n* Pretty much every single institution has their avg. share prices around $8.50 or more. NNDM is currently trading under $7.50 - Those bag holders are going no where before 5x profits.\n* Currently NNMD is valued pretty much to their actual liquidity value\n* Which means that their potential to revolutionize the entire industry is not factored in\n* Deep Value\n\nNot a Financial Advisor.",
        "subreddit": "wallstreetbets",
        "title": "Time to consider $NNDM",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o1vxna/time_to_consider_nndm/",
        "created": 1623961299.0
    },
    {
        "author": "Thelazyathlete",
        "created_utc": 1625059717,
        "id": "oaxcj2",
        "num_comments": 396,
        "num_crossposts": 0,
        "selftext": "I’ve noticed that recently these two stocks becoming more popular discussion points, with NVDA having a 4 to 1 split in mid July and AMD’s projected growth. I’m curious to know which of the two you guying are liking better and what your points are for your favored stock?",
        "subreddit": "stocks",
        "title": "AMD vs NVDA, which one are you guys favoring right now?",
        "url": "https://www.reddit.com/r/stocks/comments/oaxcj2/amd_vs_nvda_which_one_are_you_guys_favoring_right/",
        "created": 1625088517.0
    },
    {
        "author": "gorays21",
        "created_utc": 1622531449,
        "id": "npo298",
        "num_comments": 365,
        "num_crossposts": 0,
        "selftext": "&gt; AMD processors and graphics chips will be used in the infotainment systems of newly updated Tesla Model S and Model X electric cars, which are expected to go on sale in a few weeks. With AMD's more powerful chips, Tesla owners will be able to play cutting-edge video games in their cars—when they're not driving, of course–and see maps and other items in more detail.   \n&gt;  \n&gt; \"The work (Tesla) is doing is truly pushing the leading edge of what you can put into a car,\" Su told *Fortune* in an exclusive interview before announcing the Tesla deal on Monday at the Computex computer show in Taiwan. She described the effort to make in-car dash systems as powerful as high-end PCs \"part of the broader trend that computing is everywhere.\" \n\n [AMD confirms it’s powering the gaming rig inside Tesla’s Model S and Model X - The Verge](https://www.theverge.com/2021/6/1/22462660/amd-tesla-model-x-s-plaid-ryzen-radeon-rdna-2)",
        "subreddit": "stocks",
        "title": "AMD and Tesla team up!",
        "url": "https://www.reddit.com/r/stocks/comments/npo298/amd_and_tesla_team_up/",
        "created": 1622560249.0
    },
    {
        "author": "Tay_Tay86",
        "created_utc": 1624326891,
        "id": "o5bfvw",
        "num_comments": 312,
        "num_crossposts": 0,
        "selftext": "Hello everyone, \n\nI believe that $AMD is on the verge of experiencing a catalyst that will push the stock to a new ATH. As many of us know $AMD has been trading sideways and down for the past year (with some noise) since last October. I feel fairly certain that that is about to change.\n\nLast October $AMD announced a merger with $XLNX. The two giant companies have been working it out since that time. Recently, both companies share holders overwhelmingly voted in favor of the merger. \n\nTo summarize what this merger means to $AMD we're talking about increased revenue, increased profit margin, better synergy and heading towards better products. The number 1 thing $AMD is going to get out of this? A better shot at taking down $INTC for the cloud market. A company with a market cap of roughly 225 billion compared to $AMD's 100 billion. So this is a David vs Goliath moment.\n\nThere's plenty of articles written out there on how this changes the financials and prospects for $AMD but I know you guys aren't going to read it if I re-write it here. To put it simply: This is a big deal. If you felt bad about missing $NVDA's stocksplit run, this is the potential chance of catching the 'next' big chip manf. movement.\n\nSo why am I writing this now instead of last October? Well, it's because things changed last week. We know who the customer is now: $GOOG.\n\nThat's right. A 1.67T company is taping $AMD over intel to help support their cloud.\n\nProof: [https://www.fool.com/investing/2021/06/17/why-amd-stock-rallied-on-thursday/?source=eptyholnk0000202&amp;utm\\_source=yahoo-host&amp;utm\\_medium=feed&amp;utm\\_campaign=article](https://www.fool.com/investing/2021/06/17/why-amd-stock-rallied-on-thursday/?source=eptyholnk0000202&amp;utm_source=yahoo-host&amp;utm_medium=feed&amp;utm_campaign=article)\n\nSo we know they picked up $XLNX. Now we know they are teeing up for $GOOG. This is freaking huge. Not to mention they also acquired business from $TSLA, another 600B+ company. \n\nProof: [https://fortune.com/2021/05/31/amd-tesla-contract-chips-infotainment-system-lisa-su/](https://fortune.com/2021/05/31/amd-tesla-contract-chips-infotainment-system-lisa-su/)\n\nSo, let's list them out...\n\nCatalysts:\n\n1. $XLNX Merger\n2. $TSLA contract\n3. $GOOG partnership\n\nThis is clearly a big picture strategy on $AMD's part to push $INTC's weakening cloud business straight into the grave and take it's spot. I believe if $AMD is succcessful they will eventually reach a valuation closer to 200-300 billion dollars within the next 1-2 years. That's a 200-300$ share price. \n\nSo what am I suggesting?\n\n&amp;#x200B;\n\n1. I believe that post merger the fair value of $AMD is closer to 120-160 a share\n2. Without the merger $AMD has a value of about 120 a share                                                             \n(due to new contracts and overall market conditions. Just look at $NVDA's recent 50% run. Staying neck to neck as a competitor puts them at 120. But they have new business to justify it instead of black magic stock splits)\n\nIs there TA to support this? You bet there is. I use 2D time frames to wash out noise. I made some small crayon circles to give the picture some scope. You can use a 1W time frame and the analysis is the same. The stock's slow moving averages have begun to move higher and are approaching a cross, moving the stock towards positive. In simple terms: Gaining share value on average, every 2 days. And that rate is growing. The OBV is increasing meaning that **someone** 'aka Wall Street' is secretly scooping up shares and holding onto them. They are doing all of this while keeping the stock suppressed well below it's ATH. I believe they are intentionally gathering as much as they can before the catalysts combine and create a giant bull run. This is a long term run that could make a lot of people rich. The moment when $AMD sprints after $INTC and $NVDA. We all know as gamers and redditors that $AMD has become much much stronger and better in recent years. It's been amazing to watch their progress.\n\n&amp;#x200B;\n\n[$AMD 2D time Frame](https://preview.redd.it/ueoex1s30q671.jpg?width=2448&amp;format=pjpg&amp;auto=webp&amp;s=cae96daec77945f519f2c1a112456ec06399e2b3)\n\n&amp;#x200B;\n\nHere on the 1 week you can see the faintest flicker of bullish life. This is due to the recent contract developments and the quickly approaching date of the merger. As I wrote above, **the catalyst is incoming**.\n\n[1 week time frame](https://preview.redd.it/9f80a7ur0q671.jpg?width=2440&amp;format=pjpg&amp;auto=webp&amp;s=31722579984b09e8fa30bcf913e22b2d41a96c5c)\n\nSo. When is the merger? I am sure you want some dates and some juicy possible plays. Here you go...\n\nWe've got 3 approvals that have to happen. \n\n1. EU - Believed to have no problems and will probably be approved end of June, end of July at the latest.\n2. UK - July 6th Deadline. Also rumored to have 0 problems\n3. CCP - This one there's no rumored date, but CCP supposedly has no issues as well.\n\nWhat is Wall Street doing? They are both shorting the stock while sweeping July calls as well as 2 year leaps. Take a look at July:\n\n&amp;#x200B;\n\nYou've got 19498 calls purchased for July 16th at a 90$ strike. That sure sounds like Wall Street betting on it hitting 90$... after something happens. But we know what that is. It's the merger. \n\n[Unusual Option Chain July 16th](https://preview.redd.it/s3ez29jl2q671.jpg?width=942&amp;format=pjpg&amp;auto=webp&amp;s=ae8892e1f6a9a53eef3d2dc7a56f57c5a60926be)\n\nHow is this unusual? Take a look at the week prior:\n\n&amp;#x200B;\n\n[You could sum this up and it's barely even the volume for the 90$ strike on July 16th](https://preview.redd.it/53uatc9r2q671.jpg?width=944&amp;format=pjpg&amp;auto=webp&amp;s=42bc7cd9650553fe2f3f34107f10c29c8a5e7ad6)\n\nSo how to interpret this? Well, I read this as Wall Street ***knowing*** what's about to happen. I believe they know the status of the merger, and approximately how far it's going to take the stock. I believe we're looking at $AMD pushing above 90$ by Mid July. This is a potential 10 bagger. Especially with them trying to push down $AMD's price today, now is a good opportunity to get in.\n\nSo what's the play? The easiest one is the 7/16/21 90$ strike. Go alongside wall Street and when you're happy with the profit--sell it. The merger could be announced any day so buying to at least that date is wise (IMO -- but I am just a degenerate not a financial expert). \n\nBuying longer could potentially let you capture more of the run if things play out the way I think it will. You could also take advantage of the current low to grab leaps and sit back and watch how this story unfolds over the next 2 years. Either way, there's real potential here in something most people are considering dead in the water.\n\nI am currently holding 119 contracts. A large portion are for the 7/16/21 90$. So yes, my money is on this play and continues to be what I pursue. This is my YOLO.\n\n&amp;#x200B;\n\nMy recommendations: Buy shares, Buy calls for mid july. Buy leaps. If you buy shares wait for the catalyst to occur. When it reaches an apex, start selling $CCs because the IV is going to grow. \n\nAs a disclaimer, I am not a financial expert. I am just a retail stock trader. I love to do TA as a hobby. I truly believe that $AMD is being suppressed as Wall Street 'fattens' their positions. You know what I say? Fuck 'em. They think they are hiding what they are doing but I definitely see it. They are preparing and we can too. And, if we're right, we can make more than them.\n\n&amp;#x200B;\n\nBest of luck out there. I hope you enjoyed my DD. I don't post DD often on WSB, but I hope y'all enjoyed the read. You guys are great and I love you all.",
        "subreddit": "wallstreetbets",
        "title": "$AMD Merger Incoming -- Breakout Catalyst (3-4 weeks away)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o5bfvw/amd_merger_incoming_breakout_catalyst_34_weeks/",
        "created": 1624355691.0
    },
    {
        "author": "Chillznday",
        "created_utc": 1623960424,
        "id": "o26guj",
        "num_comments": 304,
        "num_crossposts": 1,
        "selftext": "Hey guys,\n\nHere is the daily option statistics for the most talked about stocks on WSB.\n\nAcross the board we are having green on the big names. $AMC shot up at 10%, CLNE and BB reclaimed some of their lost ground at +3.93% and +4.89% respectively. Good job to anyone who bought at the right time.\n\n# AMC:\n\n&amp;#x200B;\n\n[+10.06&amp;#37;](https://preview.redd.it/m5iybavzov571.png?width=1501&amp;format=png&amp;auto=webp&amp;s=c21f7ce127c75f98a32db96fda7825e9e383ee3a)\n\n# CLNE:\n\n&amp;#x200B;\n\n[+3.93&amp;#37;](https://preview.redd.it/4c2qc0y0pv571.png?width=1500&amp;format=png&amp;auto=webp&amp;s=50daac24fe49c5806910175845ecefa72d999c1a)\n\n# BB:\n\n&amp;#x200B;\n\n[+4.89&amp;#37;](https://preview.redd.it/85vykaf1pv571.png?width=1500&amp;format=png&amp;auto=webp&amp;s=6a10b806ab7575e617e2fe25a30b95a287cab6fa)\n\n# WISH:\n\n&amp;#x200B;\n\n[+1.26&amp;#37;](https://preview.redd.it/fyuizy02pv571.png?width=1501&amp;format=png&amp;auto=webp&amp;s=f892ed694ff9b857973bc4fdae4736d1118c0bd6)\n\n# GME:\n\n&amp;#x200B;\n\n[0.28&amp;#37;](https://preview.redd.it/wodxvim2pv571.png?width=1501&amp;format=png&amp;auto=webp&amp;s=c416c705446d90906416c984a0d1748bfce61f1c)\n\n# WKHS:\n\n&amp;#x200B;\n\n[-3.02&amp;#37;](https://preview.redd.it/w318nj53pv571.png?width=1500&amp;format=png&amp;auto=webp&amp;s=9800d6ef7eb845efb7702ac1cdc0d9632a779bf9)\n\n# CLOV:\n\n&amp;#x200B;\n\n[-3.01&amp;#37;](https://preview.redd.it/g4fiv2r3pv571.png?width=1501&amp;format=png&amp;auto=webp&amp;s=b55fbaa520e98466454f8da5a4fe7f0c14bf0da5)\n\n# PLTR:\n\n&amp;#x200B;\n\n[+2.26&amp;#37;](https://preview.redd.it/d0tb7h74pv571.png?width=1500&amp;format=png&amp;auto=webp&amp;s=7a8ebda0e0f3cb82afdb2944fa743203a568ae90)\n\n# CLF:\n\n&amp;#x200B;\n\n[-6.49&amp;#37;](https://preview.redd.it/6ix4bwo4pv571.png?width=1500&amp;format=png&amp;auto=webp&amp;s=848b7c27ccd156eab1ba1e0a7fb8a600ec45bf86)\n\n# ITUB:\n\n&amp;#x200B;\n\n[-0.31&amp;#37;](https://preview.redd.it/9eh8rawkpv571.png?width=1500&amp;format=png&amp;auto=webp&amp;s=3094f3136b1afd4f283f1768678e7fa241125c34)\n\n# AMD:\n\n&amp;#x200B;\n\n[+5.55&amp;#37;](https://preview.redd.it/432bzujlpv571.png?width=1501&amp;format=png&amp;auto=webp&amp;s=ce6f91c43f89200e10b560ecb4d26500407cd216)\n\n# DKNG:\n\n&amp;#x200B;\n\n[+0.8&amp;#37;](https://preview.redd.it/k372959mpv571.png?width=1500&amp;format=png&amp;auto=webp&amp;s=17602fe006bbf554628ee4b1cda8fa7145e286ea)\n\n# NVDA:\n\n&amp;#x200B;\n\n[+4.76&amp;#37;](https://preview.redd.it/l81ypzqmpv571.png?width=1502&amp;format=png&amp;auto=webp&amp;s=aef8edf07422364176aaa611a15a00742d17836d)\n\n# UWMC:\n\n&amp;#x200B;\n\n[0.92&amp;#37;](https://preview.redd.it/wu8cjwqp4w571.png?width=1502&amp;format=png&amp;auto=webp&amp;s=4aa3c32c29538909f17d693139546cacf380113d)\n\nAs usual let me know if I missed any. Ill be back in 20 to update.\n\n&amp;#x200B;\n\nBest of luck!",
        "subreddit": "wallstreetbets",
        "title": "Daily option statistics for AMC, CLNE, BB, WISH, GME, WKHS, CLOV, PLTR, CLF, and others.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o26guj/daily_option_statistics_for_amc_clne_bb_wish_gme/",
        "created": 1623989224.0
    },
    {
        "author": "PokemonPrints",
        "created_utc": 1623272928,
        "id": "nw6f2l",
        "num_comments": 256,
        "num_crossposts": 0,
        "selftext": "# Bad stocks if your goal is to Squeeze Citadel\n\n[Citadel Advisors Llc ownership in CLOV](https://fintel.io/so/us/clov/citadel-advisors-llc)\n\n* They own 513,775 shares\n* 922,000 call options valued at $6,970,000 USD\n* 429,000 put options valued at $3,243,000 USD \n\nThey are make money if you buy/own this stock.\n\n[Citadel Advisors Llc ownership in TSLA](https://fintel.io/so/us/tsla/citadel-advisors-llc)\n\n* They own 58,176 shares\n* 24,465,000 call options valued at $16,340,907,000 USD\n* 20,683,900 put options valued at $13,815,397,000 USD \n\n*They are make money if you buy/own this stock.*\n\n# Decent stocks if your goal is to Squeeze Citadel \n\n[Citadel Advisors Llc ownership in AMC](https://fintel.io/so/us/amc/citadel-advisors-llc)\n\n* They own 724,599 shares\n* 4,110,000 call options valued at $41,963,000 USD \n* 5,676,200 put options valued at $57,954,000 USD \n\nThat's a difference of  $15,991,000. Assuming they lose every put, they can cover the losses with the shares they have. \n\n[Citadel Advisors Llc ownership in BB](https://fintel.io/so/us/bb/citadel-advisors-llc)\n\n* They own 2,188,729 shares\n* 1,582,000 call options valued at $13,336,000 USD\n* 3,002,100 put options valued at $25,308,000 USD\n\nThat's a difference of $11,972,000. Assuming they lose every put, they can cover the losses with the shares they have. \n\n# Great Stocks if your goal is to Squeeze Citadel\n\n[Citadel Advisors Llc ownership in GME](https://fintel.io/so/us/gme/citadel-advisors-llc)\n\n* They own 22,405 shares\n* 2,278,000 call options valued at $432,410,000 USD \n* 3,271,400 put options valued at $620,977,000 USD\n\nThat's a difference of $188,567,000. Assuming they lose every put, they can **NOT** cover the losses with the shares they have. \n\n[Citadel Advisors Llc ownership in AMD](https://fintel.io/soh/us/amd/citadel-advisors-llc)\n\n*  They own  4,811,493 shares \n* 18,242,400 call options valued at $1,432,028,000 USD\n* 25,062,700 put options valued at $1,967,422,000 USD \n\nThat's a difference of $535,394,000. Assuming they lose every put, they can **NOT** cover the losses with the shares they have. \n\n[Citadel Advisors Llc ownership in U](https://fintel.io/so/us/u/citadel-advisors-llc)\n\n*  They own 748,900 shares\n*  568,800 call options valued at $57,056,000 USD\n* 1,545,600 put options valued at $155,039,000 USD\n\nThat's a difference of $97,983,000. Assuming they lose every put, they can **NOT** cover the losses with the shares they have. \n\n**If my goal was to** ***Squeeze Citadel*****, I would HODL $U, $AMD, and $GME. Not financial advice. If there is more interest in this post I can continue the research.**",
        "subreddit": "StockMarket",
        "title": "How to Squeeze Citadel (RECAP)",
        "url": "https://www.reddit.com/r/StockMarket/comments/nw6f2l/how_to_squeeze_citadel_recap/",
        "created": 1623301728.0
    },
    {
        "author": "Chillznday",
        "created_utc": 1624046860,
        "id": "o2z1d3",
        "num_comments": 246,
        "num_crossposts": 0,
        "selftext": "Hello everyone,\n\n&amp;#x200B;\n\nHere is the daily option statistics for the most talked about stocks on WSB. The biggest gainers for today was $CLNE with +5.94% and $WKHS with +2.91% while $GME,$BB,$AMC, and $CLOV each slide on latest comments from the fed boi on inflation and overall market strength.\n\nAs usual see below for daily option statistics for the most discussed stocks on WSB.\n\n&amp;#x200B;\n\n# CLNE:\n\n&amp;#x200B;\n\n[+5.94&amp;#37;](https://preview.redd.it/3eb6vw50x2671.png?width=1501&amp;format=png&amp;auto=webp&amp;s=2156789d8a9be836bd8b8f14ff387e2791f481fb)\n\n# AMC:\n\n&amp;#x200B;\n\n[-2.42&amp;#37;](https://preview.redd.it/4g7d1011x2671.png?width=1501&amp;format=png&amp;auto=webp&amp;s=5ed68db934bf9062e9f35fcf993e20636e7a4dc0)\n\n# BB:\n\n&amp;#x200B;\n\n[-4.52&amp;#37;](https://preview.redd.it/eus6d6i1x2671.png?width=1500&amp;format=png&amp;auto=webp&amp;s=23e8f663daf4e7d65a41e08f8f1b67fe6910a85d)\n\n# WISH:\n\n&amp;#x200B;\n\n[+1.51&amp;#37;](https://preview.redd.it/a4g0zv12x2671.png?width=1500&amp;format=png&amp;auto=webp&amp;s=81ad1361b2dcc9f602703287e4b685636629f893)\n\n# GME:\n\n&amp;#x200B;\n\n[-4.37&amp;#37;](https://preview.redd.it/v9gizfi2x2671.png?width=1499&amp;format=png&amp;auto=webp&amp;s=668565f9d6ac4daf7f66f0b520c137722466485e)\n\n# CLOV:\n\n&amp;#x200B;\n\n[-4.14&amp;#37;](https://preview.redd.it/ntu4sd23x2671.png?width=1502&amp;format=png&amp;auto=webp&amp;s=99fa479329b094a21428dd895d8502be1d794203)\n\n# WKHS:\n\n&amp;#x200B;\n\n[+2.91&amp;#37;](https://preview.redd.it/r72zskg3x2671.png?width=1501&amp;format=png&amp;auto=webp&amp;s=1c86c45c57e237c4b362e2f19fd3752182a5f93c)\n\n# PLTR:\n\n&amp;#x200B;\n\n[-0.31&amp;#37;](https://preview.redd.it/hudardx3x2671.png?width=1501&amp;format=png&amp;auto=webp&amp;s=8abb28e4aa6d2398b15e2618a2f791518ca26a47)\n\n# NVDA:\n\n&amp;#x200B;\n\n[-0.21&amp;#37;](https://preview.redd.it/ng21dkg4x2671.png?width=1500&amp;format=png&amp;auto=webp&amp;s=7b16ac997f5820e09dbef63f13f14b0468f3cd34)\n\n# CLF:\n\n&amp;#x200B;\n\n[-4.34&amp;#37;](https://preview.redd.it/1gyjctx4x2671.png?width=1500&amp;format=png&amp;auto=webp&amp;s=abaf607a2f6060c34597e07d9e9ba0cc2c344704)\n\n# AMD:\n\n&amp;#x200B;\n\n[+0.11&amp;#37;](https://preview.redd.it/7mt145f5x2671.png?width=1500&amp;format=png&amp;auto=webp&amp;s=21212a33e9419e526ad990dd740ffcae283950e8)\n\n# TSLA:\n\n&amp;#x200B;\n\n[+1.09&amp;#37;](https://preview.redd.it/huwwj806x2671.png?width=1500&amp;format=png&amp;auto=webp&amp;s=5ab09b9a41bb1f5b0f785a58000ca6678c16ac0d)\n\n# ITUB:\n\n&amp;#x200B;\n\n[-2.61&amp;#37;](https://preview.redd.it/4z1un6q343671.png?width=1500&amp;format=png&amp;auto=webp&amp;s=320b90bba6d1555fc864179e9e44622abb064667)\n\n# UWMC: \n\n&amp;#x200B;\n\n[-3.55&amp;#37;](https://preview.redd.it/hmh174uoa3671.png?width=1501&amp;format=png&amp;auto=webp&amp;s=a780a78e6c58e2c4cdcc75fbffb7633345763c81)\n\n&amp;#x200B;\n\nAs usual let me know if I forgot anything. Ill be back in 20.\n\n&amp;#x200B;\n\nBest of Luck!",
        "subreddit": "wallstreetbets",
        "title": "Daily option statistics for CLNE, AMC, BB, WISH, GME, CLOB, WKHS, PLTR, NVDA, and others.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o2z1d3/daily_option_statistics_for_clne_amc_bb_wish_gme/",
        "created": 1624075660.0
    },
    {
        "author": "MrObviouslyRight",
        "created_utc": 1623561732,
        "id": "nypg5f",
        "num_comments": 245,
        "num_crossposts": 0,
        "selftext": "AMD's latest financial reports blew all estimates out of the water... and their latest guidance for 50% growth (up from 37%) is conservative. Here is why:\n\nFUNDAMENTALS: IT'S ALL ABOUT ENTERTAINMENT\n\nIn a post COVID-19 world, people will continue to flock towards entertainment.\n\nAs  confirmed by both TESLA and AMD recently, the latest Model X and S will  bring AMD silicon (GPU &amp; APU). This is HUGE, because this feature  will eventually trickle down as an optional to the Model 3 and rest of  the Tesla fleet. Why is this important? Just listen to Elon Musk drool  over PS5 performance on road trips with autonomous driving. [https://www.youtube.com/watch?v=Vl\\_-bFNRJaw](https://www.youtube.com/watch?v=Vl_-bFNRJaw)\n\nBut that IS NOT ALL, as Valve will be launching a new portable handheld. [https://www.youtube.com/watch?v=lFn6LzUFTTA](https://www.youtube.com/watch?v=lFn6LzUFTTA)\n\nIn essence PS4, PS5, XBOX X &amp; S and Valve are all going FULL AMD.\n\nWho do you think Ford, GM, Chrysler, Mercedes, BMW, Audi, Volkswagen, Renault/Nissan will go with?\n\nENTERTAINMENT IS KEY and AMD is all over it.\n\nThis  is also HUGE as entertainment software will be tailored to AMD's  processing pipeline. Unreal Engine 5 is the perfect example, which  ALREADY performs better on a 6800XT than it does on a RTX3080 (up to 12%  better, as per Digital Foundry's performance benchmark - see screenshot  and video link below).\n\n[AMD 6800XT on left with 61fps - Nvidia RTX3080 on right with 56fps](https://preview.redd.it/eruzko9mwy471.jpg?width=1289&amp;format=pjpg&amp;auto=webp&amp;s=5fcbb478a1bcc940bd8c564b5d6b6ace551aa401)\n\n(digital foundry's benchmarks) [https://www.youtube.com/watch?v=C99VwDGyLg0](https://www.youtube.com/watch?v=C99VwDGyLg0)\n\nUnreal  Engine 5 (with Lumen) will make Nvidia Ray Tracing a thing of the past.  This software solution is much more efficient at managing illumination,  making it available for non-RTX hardware.\n\nIn  addition, enthusiasts are really pumped with AMD's latest presentation  at Computex, where they presented Fidelity FX SuperResolution. It aims  to provide up to 2x performance while super sampling images up to 4K.  And the kicker is that this solution will be available to ALL.\n\nIntel's  Raja Koduri (Head of Intel GPU, formerly an AMD employee) has already  confirmed they are looking into AMD's Fidelity FX SR (as per his twitter  post days ago): [https://twitter.com/Rajaontheedge/status/1399964541291622407?ref\\_src=twsrc%5Etfw](https://twitter.com/Rajaontheedge/status/1399964541291622407?ref_src=twsrc%5Etfw)\n\nSo yeah, AMD is the future of GAMING.\n\nBut on the stock analysis front, AMD has also begun its climb towards previous highs.\n\nIt has made a huge recovery since my latest post, when it was trading in the low $70's.\n\nJust imagine that AMD is trading at a Price/Earnings multiple of 34, with a market cap of $98.7B\n\nNvidia is trading at a P/E of 84 (over twice as much), with a market cap of $444B (over 4 times more).\n\nBut when you look at the financials, the differences shrink.\n\nOn Revenue, AMD has sales of $9.7B and net profits of $2.5B. Nvidia sold $16.6B for a net $4.3B.\n\nHow does that support Nvidia being over 4 times more expensive than AMD? It just doesn't.\n\nIf AMD were to trade at the same multiples: EPS of 2.38 \\* NVIDIA's P/E of 84.28 = $200 per share.\n\nAt $200 per share, AMD's market cap would be $243B... STLL HALF OF NVIDIA!!!! (WTF?!?!).\n\nThink about it, it is bound to close the distance towards $200 per share in the next 12 months.\n\nThe reasons are simple: Tesla, Valve, Unreal Engine 5, Ryzen 3D stacking and 50% growth for 2021.\n\nThe Xilinx deal WILL CLOSE in the next 6 months. THE BREAKOUT is IMMINENT!!!\n\nTo summarize, the product pipeline is AMAZING, not to mention the leaks on RDNA3 and Ryzen 4.\n\nThe new clientele is incredible: TESLA and Valve, added to Microsoft and Sony.\n\nJust imagine Xilinx FPGA accelerators integrated to AMD's Intellectual Property. Fuel the rockets!!!\n\nREMEMBER: In a matter of months you will be kicking yourself for ignoring this post!\n\nThe MOON is for amateurs.... WE'RE GOING TO MARS BABY!!!... with TESLA AND AMD!!!\n\nMARS - THE RED PLANET... WITH LISA AND ELON. PRIMATES AND APES TO COLONIZE IT IN 2022!!!\n\n..... ALL ABOARD!!!!",
        "subreddit": "wallstreetbets",
        "title": "AMD GOING TO MARS IN 12 MONTHS!!! (THE MOON IS FOR AMATEURS!)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nypg5f/amd_going_to_mars_in_12_months_the_moon_is_for/",
        "created": 1623590532.0
    },
    {
        "author": "VisualMod",
        "created_utc": 1624960849,
        "id": "oa570r",
        "num_comments": 238,
        "num_crossposts": 0,
        "selftext": "\nYour daily hype thread. Please keep the shitposting to a maximum.\n\n^Navigate ^WSB |^We ^recommend ^best ^daily ^DD\n:--|:--                                 \n**DD** | [All](https://reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3ADD) / [**Best Daily**](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3ADD&amp;restrict_sr=on&amp;t=day) / [Best Weekly](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3ADD&amp;restrict_sr=on&amp;t=week)\n**Discussion** | [All](https://reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3ADiscussion) / [**Best Daily**](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3ADiscussion&amp;restrict_sr=on&amp;t=day) / [Best Weekly](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3ADiscussion&amp;restrict_sr=on&amp;t=week)\n**YOLO** | [All](https://reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3AYOLO) / [**Best Daily**](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3AYOLO&amp;restrict_sr=on&amp;t=day) / [Best Weekly](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3AYOLO&amp;restrict_sr=on&amp;t=week)\n**Gain** | [All](https://reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3AGain) / [**Best Daily**](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3AGain&amp;restrict_sr=on&amp;t=day) / [Best Weekly](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3AGain&amp;restrict_sr=on&amp;t=week)\n**Loss** | [All](https://reddit.com/r/wallstreetbets/search?sort=new&amp;restrict_sr=on&amp;q=flair%3ALoss) / [**Best Daily**](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3ALoss&amp;restrict_sr=on&amp;t=day) / [Best Weekly](https://www.reddit.com/r/wallstreetbets/search?sort=top&amp;q=flair%3ALoss&amp;restrict_sr=on&amp;t=week)",
        "subreddit": "wallstreetbets",
        "title": "Daily Popular Tickers Thread for June 29, 2021 - UWMC | NOK | AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oa570r/daily_popular_tickers_thread_for_june_29_2021/",
        "created": 1624989649.0
    },
    {
        "author": "Chillznday",
        "created_utc": 1625008536,
        "id": "oak12f",
        "num_comments": 234,
        "num_crossposts": 0,
        "selftext": "Hey guys, \n\nGood afternoon, I just got back from my work trip. Today $CLOV lead the pack with a meager a +4.38% while $WISH fell close to 7% and $SPCE's rocket fell back to earth with a -15%. If you guys took out puts on those companies congratulations. \n\n&amp;#x200B;\n\nHere are the daily option statistics for the most talked about stocks on WSB. \n\n# CLOV:\n\n[+4.38&amp;#37;](https://preview.redd.it/8o18kekaea871.png?width=1506&amp;format=png&amp;auto=webp&amp;s=4da2cfbcc52b5c155b85f1d1e94a79820ec890ed)\n\n# AMC:\n\n[-2.89&amp;#37;](https://preview.redd.it/0ipe387bea871.png?width=1506&amp;format=png&amp;auto=webp&amp;s=26a329aaa2191505a00035fcdfdb1b4e75468a9a)\n\n# GME:\n\n[-1.11&amp;#37;](https://preview.redd.it/3zkyzutbea871.png?width=1506&amp;format=png&amp;auto=webp&amp;s=656f34b561e553cdc5db65a1be39bc11bf37792d)\n\n# WISH:\n\n[-6.94&amp;#37;](https://preview.redd.it/qaf2f7gcea871.png?width=1507&amp;format=png&amp;auto=webp&amp;s=fb17d1f51aeccec94187632394015812b3521bbf)\n\n# WKHS:\n\n[+1.42&amp;#37;](https://preview.redd.it/jn4gfk0dea871.png?width=1506&amp;format=png&amp;auto=webp&amp;s=a38e7b0cdbb7391d6984c181c596fc8940d9706f)\n\n# BB:\n\n[-4.38&amp;#37;](https://preview.redd.it/9801hokdea871.png?width=1492&amp;format=png&amp;auto=webp&amp;s=a31fbb93708c18b8d531449446c6de1350582dd0)\n\n# AMD:\n\n[+2.80&amp;#37;](https://preview.redd.it/7x2fem4eea871.png?width=1506&amp;format=png&amp;auto=webp&amp;s=e62fb77e929ad0fb111bc171179388ab430fb3f9)\n\n# SPCE:\n\n[-14.26&amp;#37;](https://preview.redd.it/ef9i3vseea871.png?width=1505&amp;format=png&amp;auto=webp&amp;s=aec17b07a96ae949f7ea952c7d2a350cd995ee59)\n\n# CLNE:\n\n[-4.80&amp;#37;](https://preview.redd.it/ax4p0dffea871.png?width=1506&amp;format=png&amp;auto=webp&amp;s=ec04c57eda6e126ea35583f9edba05a573454b47)\n\n# PLTR:\n\n[-2.74&amp;#37;](https://preview.redd.it/gfha3m2gea871.png?width=1506&amp;format=png&amp;auto=webp&amp;s=f5f2bbe4e221a541a7753af4dc05b67956ce7c50)\n\n&amp;#x200B;\n\nAs usual let me know if I forgot anything. \n\n&amp;#x200B;\n\nBest of luck in your trades!",
        "subreddit": "wallstreetbets",
        "title": "Daily option statistics for CLOV, AMC, GME, WISH, WKHS, BB, AMD, SPCE, CLNE, PLTR, and others.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oak12f/daily_option_statistics_for_clov_amc_gme_wish/",
        "created": 1625037336.0
    },
    {
        "author": "OptionsTrader16",
        "created_utc": 1625096972,
        "id": "ob9mjg",
        "num_comments": 228,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Should I sell or hold? Up 50% already on 2023 AMD LEAP calls",
        "url": "https://i.redd.it/i0ylnkhyph871.jpg",
        "created": 1625125772.0
    },
    {
        "author": "Ceezahr",
        "created_utc": 1623692737,
        "id": "nzsghf",
        "num_comments": 185,
        "num_crossposts": 1,
        "selftext": "\n**Basics**\n\nAs long as you haven't been living under a fucking rock for the last decade, you know that AMD is a major player in electronic devices. While it has a minority hold in its markets, it still has a considerable market share AND has a hand in both GPUs and CPUs. It's versatile.\n\nWhile the silicon shortage is still big and doesn't show any signs of slowing, AMD is still most likely making a shitload of profit from the continuous buyouts of graphics cards for mining and the continuous selling of CPUs.\n\n**EPS/Financial history**\n\nAMD has been continuously crushing quarterly earnings targets for at least the past year, and shows no signs of slowing. It has consistently maintained a steady and rising profit.\n\n[Constantly winning](https://preview.redd.it/qz0qs58rh9571.png?width=332&amp;format=png&amp;auto=webp&amp;s=d615f35e833c3563f23d4de50afe3956f490d61b)\n\nOn top of this, the company has a total cash balance of 3.12 billion and a total debt of only 551 million, which is fucking great.\n\n[It's doing great with managing its debt and total cash to say the least](https://preview.redd.it/vh2sh5xai9571.png?width=422&amp;format=png&amp;auto=webp&amp;s=61451edd2ef36120f80b83aefbfbce123fe2813e)\n\nNot made up your mind yet? If not, I have even more great news for you! The company has been constantly underestimated/undervalued despite all these great numbers. The past 6 months have been shit which isn't to say it's been terrible in the long run which it definitely has not, but for a company that holds so much market in two major component categories at both the business and consumer level it's ridiculous for the stock to be consistently falling.\n\n[Constantly going down](https://preview.redd.it/j2pavto0j9571.png?width=434&amp;format=png&amp;auto=webp&amp;s=26816d6c905488484879bc98f527d8ac15accef9)\n\n**Shorts and shares**\n\nThe company is decently shorted with around 7% of the shares being shorted for a company with a solid background, which could be a disaster waiting to happen. Again, it's not heavily shorted by any means but I don't think 7% is something to scoff at.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/zk34ou1sl9571.png?width=427&amp;format=png&amp;auto=webp&amp;s=6215e701d1970588345fb0c063ae217516419a0c\n\n&amp;#x200B;\n\n**Memeablility**\n\nNow that we've gone over all the boring numbers, let's talk about the memability of the company. It's a fucking computer parts company. Computers=gaming, gaming=memes. It's simple logic.\n\n&amp;#x200B;\n\n**More general points**\n\nAMD has a solid community reputation, and while the performance its components put out is not on par with that of nvidia and intel, the products are generally more user/consumer friendly and cheaper, plus not everyone is looking to buy an RTX 6090 with liquid shit cooling built in for the unaffordable price of a kidney. AMD is geared more towards the average consumer which makes up a large portion of the computer market. Not only this but AMD chips are appearing more and more in laptops and pre-built computers. Another small point is that Microsoft is using AMD chips in their new generation of Xbox.\n\nAgain, all of this is speculation and I'm not telling anyone what decision to make, this is just my take on it.",
        "subreddit": "wallstreetbets",
        "title": "AMD - constantly outperforming, constantly undervalued?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nzsghf/amd_constantly_outperforming_constantly/",
        "created": 1623721537.0
    },
    {
        "author": "BooBeef",
        "created_utc": 1624985073,
        "id": "oac3ox",
        "num_comments": 178,
        "num_crossposts": 0,
        "selftext": "I have only posted twice on this subreddit so I’m still learning to make DD posts.\n\nI have been an Intel bull for a while, I have built computers and studied computer tech since I was in middle school so I understand Intel and it’s products.\n\nIntel’s share price has had a bumpy ride over the past couple years, mostly trading sideways, and giving up gains very soon after achieving them. Intel as a business has had very poor management as intel for a long time has essentially been complacent in its innovation because of lack of competition. Intel only 5 years ago was far ahead of where AMD was (AMD being its most well recognized competitor) this has changed now that AMD has been able to outsource its chip manufacturing to TSMC, which is a Taiwan semiconductor company that produces the smallest chip and most dense chip designs that are available. This partnership has allowed AMD to eat away and Intel’s market share over the past 2-3 years, but there are many overlooked reasons for why Intel should still be considered a boof value buy.\n\nIntel is it’s own manufacturer. Intel is not like AMD as intel has its own fab factories meaning they don’t have to outsource there products to other companies. This will be huge for intel as the chip trade war heats up, Intel will likely receive large subsidies from the US government as Intel is the only Us based chip manufacturing company.\n\nIntel is expanding into new markets.\nIntel has as of this year expanded into graphics processing. A market that was completely dominated by Nvidia for decades. This is a very good and logical expansion of intel’s market. Intel is also partnering with other companies to try to create new processing technologies. Intel has also announced all new fab factories that will be completed by 2023.\n\nIntel has had a refocus and has gotten new leadership. Intel has a new ceo (Patrick Gelsinger) Gelsinger has done a fantastic job refocusing the company on innovation, and if AMD is any example of how changing leadership can rejuvenate a company, then this should be great for intel’s projected growth, as AMD’s ceo (Lisa Su) has saved AMD since she has started working as there chief executive.\n\nIntel is in a exponentially growing market. The chip industry is a very high growth sector. This has helped intel as its lack of innovation has been offset by its sale performance the past few years. Investors just need reason to believe intel will grow with its completion in order to feel confident in the company as an investment.\n\nMy last point is that Intel is fundamentally undervalued. The other chip companies in the industry have average P/E ratios around 35~40 intel, however, has a P/E ratio of 12. This ties into my previous point that investors just need reason to believe in intel’s long term growth, and once they have it intel will likely skyrocket. Intel also has the greatest market cap out of its competitors and has the lowest price to book value and not to mention billions in free cash flow. Intel is also a high dividend stock with a dividend of 2.48. while AMD and TSMC offer no dividends.\n\nI will edit this post as I find more information that I didn’t cover.\n\nThank you for reading! And all criticism is welcomed!",
        "subreddit": "investing",
        "title": "Intel Corp. (INTC) is undervalued",
        "url": "https://www.reddit.com/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/",
        "created": 1625013873.0
    },
    {
        "author": "TheTendilorian",
        "created_utc": 1624576449,
        "id": "o7bb1e",
        "num_comments": 175,
        "num_crossposts": 0,
        "selftext": "I am halfway through an 18 hour shift, currently stationed in Turkey, its hot as fuck, idk why I’m here, I’m 2,000mg deep in caffeine, getting drunk as soon as I get off, getting off as soon as I get off, my wife is back home cheating, my daughter calls another man dad, *cracks knuckles* lets do this. \n\nOverview\n\n\tAMD is a global semiconductor company offering x86 microprocessors as standalone or integrated (CPU’s, GPU’s, server systems, Etc…) and intellectual property/ services.\n\nProducts\n\n\tAMD’s primary products consist of CPU’s and GPU’s which are on par or out performing NVIDIA GPU’s and Intel’s CPU’s. While these other two giants have dominated the market for sometime, AMD’s recent move has evolved from a slow creep to a brisk jog. \n\nCompetition \n\n\tAMD’s largest competitors are Intel (CPU’s) and NVIDIA (GPU’s). With the release of AMD’s Ryzen processors in 2017, AMD has been steadily over taking Intel’s dominance over market share. AMD’s current market share (over all CPU’s) currently sits at 44%, levels it has not seen since 2005. AMD took 20% of the market share in past 2 years with a significant jump in 2019. Since the release of Ryzen, AMD is now on par or out performing Intel chips and has gained a significant amount of sentiment over the soy boys at intel. AMD is on track to overtake the majority of CPU market share within the next year based on current projections.\n\n\tNow NVIDIA is a whole other beast who currently has a significant advantage over the dGPU market. Nvidia at the end of Q4 2020, held roughly 82% of the market share which was a increase of 9% from the previous year. AMD’s high end GPU’s do not come close to Nvidia’s high end models, UNTIL AMD’s Radeon 6000 series, which are now on par with Nvidia’s cards, either outperforming or underperforming in various tests. AMD catching up to Nvidia is the same move that AMD made against Intel in 2017, 4 years later they are on the verge of overtaking market share. While Nvidia is a monster of a company, I believe that AMD will begin taking more market share from Nvidia and establish a decent foothold over the next few years. AMD has already taken the game console market, console plebs.\n\n\tAMD has already proved they are able to take back significant market share with there current and future products, Lisa Su is a genius and I believe she’ll lead the company to Valhalla. What does AMD have that Nvidia does not? Aside from many differences, I think the fact that AMD has an ecosystem will play a significant role in catching up. Now that AMD can evenly compete with both of their rivals, AMD plans on leveraging the fact that they produce CPU’s and GPU’s. There are already incentives to using AMD’s CPU with their GPU rather than an AMD CPU with a Nvidia GPU. With AMD taking the CPU market, retail users will be more likely to stick with the ecosystem, and I’m a big fan of companies producing an ecosystem (laughs in apple). \n\n\tA new player enters the battle. Intel has been working on their own dGPU and will surely be releasing in the next few years, but I believe this will be comparable to Sony vs Microsoft with Nintendo enjoying their best life staring at butterfly’s, covered in drool in the corner lol.\n\nThe Merger\n\n\tNvidia set to acquire ARM, AMD set to acquire Xilinx. What are they and how are they expected to impact the company?\n\nARM - Create and dominate the mobile processor market, covering TV’s, phones, tablets, and other similar products as well as some software applications. I will not be covering much more of ARM in this DD.\n\nXilinx - Designs and develops programmable logic products. As far as I can tell this is some big brain shit that I’m sure some booger nosed, mothers basement living, neck beard having, nerd will easily explain in the comments cuz Wikipedia ain’t cutting it.  \n\n\tIf AMD completes the purchase, which is likely and expected to happen by the end of 2021, Xilinx shares will become worth 1.723 shares of AMD. AMD is currently trading at 86.10$, meaning that shares of Xilinx will be worth 148.35$ if the deal were to go through right now. Xilinx is currently worth 133.71$, I’m betting heavily that AMD will continue to pump prior to this deal as well.\n\n\tARM will be huge for Nvidia, but this is running into some major road blocks and is likely some ways off or will fall through.\n\nFinancials and projections (I had pictures but I’m reddit dumb)\n\nNet Revenue\n$9.8B(2020), $6.7B(2019), $6.5B(2018), $5.2B(2017)\nNet Incum \n$2.5B(2020), $341M(2019), $337M(2018), $(33)M(2017)\n\t\n\tI like your growth G\n\n\tAMD decreased their debt to 338 million from 568 million.\n\t\n\t$1.6 billion in cash ($9 billion in total assets, I find cash on hand more important)\n\n\tGPU/CPU sales accounted for $6.5 billion while enterprise accounted for $3.3 billion, GPU/CPU sales saw a 37% increase over 2019 while enterprise saw a 65% increase in 2020. 2021 is set to continue this trend of growth.\n\n\tAMD has a high price target of $169.70, median $107.00, and an average of $103.92. I just read 100’s of pages of 8k’s and 10’ks, plus I’m super attracted to the ole doc Su Bae so I’m betting that it will get a target price upgrade, regardless $103 will make me rich. There is a lot more we could dive into on financials but idk what the fuck I’m doing so nah.\n\nRisks\n\n\tI like to plan for more than 1 risk occurring at a time so keep that in mind. Ive highlighted the risks that I find most impactful/ probable. Also keep in mind of global shortages for damn near every company, especially with chips.\n\n\t- Intel/ Nvidia’s market share dominance (mostly Nvidia)\n\t- Seasonal sales can make for shit earnings in Q1/Q2\n\t- Reliance on third parties for manufacturing/ distributors\n\t- Xilinx deal falls through\n\t- Jim Cramer also likes this stock\n\n\tThat’s enough risks, what am I, a gay bear?\n\nTLDR\n\nAMD will moon, Lisa Su is my mommy and is cooking up some tendies, AMD GPU’s are now in Teslas,  obligatory rockets (insert rocket emojis here), lots of words just buy it.\n\nPOS\n150 shares @ 78.50\nJan22 $100/$105C\nLooking for entry into Xilinx cuz I dumb",
        "subreddit": "wallstreetbets",
        "title": "AMD: The DD that will make you rethink why you bother reading anything on this sub",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o7bb1e/amd_the_dd_that_will_make_you_rethink_why_you/",
        "created": 1624605249.0
    },
    {
        "author": "MrObviouslyRight",
        "created_utc": 1623966248,
        "id": "o28q7u",
        "num_comments": 166,
        "num_crossposts": 0,
        "selftext": "# Dear Crew, this is your Captain speaking.\n\nOn your left, you can see the moon, which we are about to pass.\n\nOur destination is still MARS (thanks to Tesla &amp; Elon adopting AMD's APU's and GPU's).\n\nWe expect an EARLY ETA thanks for the J-Powell tailwinds. Dr. Lisa Su is still thumbs up!\n\nRecent events provide a **HIGH degree of certainty** that AMD’s **MISSION will be successful**.\n\nNamely:\n\n**1- AMD Genoa (Zen 4) to have 128 cores (256 threads) winning the DATACENTER (INTEL admits)**\n\nAMD was already taking market share from Intel in the datacenter, but the latest leak (from the reputable Jim of AdoredTV / **HE's BACK!!!**) has Intel’s own internal presentations **admitting AMD will EXTEND the LEAD** in the Datacenter (screenshot below).\n\n[Leak from the reputable Jim of AdoredTV - The Scottish king is BACK!!!](https://preview.redd.it/aajw3pq5bw571.jpg?width=1299&amp;format=pjpg&amp;auto=webp&amp;s=e3bcd4f06a39c9bdae4c233fe7fb2e2c1ee81d1a)\n\nWatch his latest video analysis here: [https://www.youtube.com/watch?v=cNs432VgxmQ](https://www.youtube.com/watch?v=cNs432VgxmQ)\n\nHis confirmation tweet here: [https://twitter.com/AdoredTV/status/1405161144843739148](https://twitter.com/AdoredTV/status/1405161144843739148)\n\nIn  essence, one should expect that if core count is going up for Zen 4  (from 64 to 128), at the VERY least, consumer chips will go from 16 to  24. Furthermore, Threadripper **Zen 4 will be a BEAST**.\n\n&amp;#x200B;\n\n**2- AMD 6900XTX LC (liquid cooled) spotted.**\n\nAMD already achieved the #1 World RECORD in FireStrike last month, breaking 3300MHz in a 6900XT.\n\n[https://www.techpowerup.com/282216/radeon-rx-6900-xt-overclocked-to-3321mhz-breaks-firestrike-world-record](https://www.techpowerup.com/282216/radeon-rx-6900-xt-overclocked-to-3321mhz-breaks-firestrike-world-record)\n\nHowever,  that is NOT their BEST chip. Thanks to better bins, there’s the 6900  XTX which is liquid cooled, with faster memory, higher clock speeds and higher TDP. **A MONSTER!!!**\n\n[Latest super bin model spotted 6900XTX... a RECORD BREAKER for sure!!!](https://preview.redd.it/74prhnfabw571.jpg?width=1154&amp;format=pjpg&amp;auto=webp&amp;s=02bc05241e25485be5db87fa98c24ed94ce5a290)\n\nThis new model is expected to **BREAK ALL GPU** **WORLD RECORDS** once again.\n\n[https://videocardz.com/newz/amd-radeon-rx-6900-xtx-reappears-in-a-custom-pc-as-rx-6900-xt-lc](https://videocardz.com/newz/amd-radeon-rx-6900-xtx-reappears-in-a-custom-pc-as-rx-6900-xt-lc)\n\n&amp;#x200B;\n\n**3- AMD Fidelity FX Super Resolution to launch with 44 game developers.**\n\nLatest leak from Vegeta (@Broly\\_X1) published by videocardz.com has AMD launching FX SR on 7 games **next Tuesday**,  with 12 games coming SOON and 44 game studios CONFIRMING to support  AMD's FX Super Resolution (Capcom, Electronic Arts, Ubisoft, Warner  Bros., Valve, etc.).\n\nThis is **AMAZING** news.\n\nIn essence, ADOPTION is **already a SUCCESS**. Software developers will push AMD FX SR to GPUs, APUs, Consoles and mobile phones (e.g. Samsung Galaxy S22).\n\n[44 developers already backing AMD FX Super Resolution!!!](https://preview.redd.it/lufh7pwfbw571.png?width=1309&amp;format=png&amp;auto=webp&amp;s=2af3cb2219e4ca6071d681d04fc24db0633db79a)\n\n&amp;#x200B;\n\n**4- Xilinx acquisition update: UK regulator to respond within 3 weeks.**\n\nThe  Competition and Markets Authority (CMA) of the UK is planned to provide  a phase 1 decision on July 6th in connection to AMD’s acquisition of  Xilinx.\n\n[https://www.gov.uk/cma-cases/advanced-micro-devices-inc-slash-xilinx-inc-merger-inquiry](https://www.gov.uk/cma-cases/advanced-micro-devices-inc-slash-xilinx-inc-merger-inquiry)\n\nAs per Jim Cramer’s Mad Money Lighting Round **YESTERDAY** (see video below) he expects the acquisition to trigger the stock to breakout and keep soaring.\n\nWatch video here: [https://youtu.be/QT5YDHmDpGk?t=140](https://youtu.be/QT5YDHmDpGk?t=140)\n\n[YESTERDAY - Jim Cramer confirms expectation AMD to SOAR after Xilinx](https://preview.redd.it/7kj8xnfjbw571.jpg?width=1272&amp;format=pjpg&amp;auto=webp&amp;s=3f87b2c5ebce97700f0b35c488154ac25334821f)\n\n&amp;#x200B;\n\n**5- AMD AM5 platform to launch Mid-2022 (3D cache CPU’s by end of 2021):**\n\nAs reported by RedGamingTech, AM5 is expected in Q2 and AM4 B660 in Q1.\n\n[https://youtu.be/u2UWG-vE9cQ?t=195](https://youtu.be/u2UWG-vE9cQ?t=195)\n\nIn  essence, the AM4 will be the most successful platform in modern desktop  consumer history, with a new chip coming, with up to 15% performance  BOOST vs. AMD's AMAZING Zen 3 (5000 series).\n\nBut THAT'S NOT ALL, as in Mid-2022 Zen 4 is expected. With higher IPC, in the 5nm process, DD5 memory support and MORE CORES!!!\n\n**To recap:**\n\nAMD to continue **LEADING** the DATACENTER: **Check - all systems go!**\n\nAMD to break more records with new GPU launch: **Check - all systems go!**\n\nAMD to successfully deploy FX Super Resolution Software: **Check – all systems go!**\n\nAMD to continue soaring with Xilinx: **Check – all systems go!**\n\nAMD upcoming launch on track: **Check – all systems go!**\n\n# Stock was up today 5.55% as we continue ACCELERATING!\n\n# Guys.... prepare for a BREAKOUT warp jump!!!",
        "subreddit": "wallstreetbets",
        "title": "AMD heading to MARS!!!... ETA SOON!!! - Next Stop: Galaxy limits!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o28q7u/amd_heading_to_mars_eta_soon_next_stop_galaxy/",
        "created": 1623995048.0
    },
    {
        "author": "Mericaaaaa12",
        "created_utc": 1622644802,
        "id": "nqnbee",
        "num_comments": 161,
        "num_crossposts": 0,
        "selftext": "Hey guys - so i have about $5k to add to my existing positions. I am thinking between Apple, AMD, Beyond Meat, Nvidia. Or should i open a new position - my thoughts are tolling towards Netflix or Shopify? Just want to add that my portfolio is a long term investment.\nThis is hard.... agh!",
        "subreddit": "stocks",
        "title": "Where would you invest?",
        "url": "https://www.reddit.com/r/stocks/comments/nqnbee/where_would_you_invest/",
        "created": 1622673602.0
    },
    {
        "author": "oldworlds",
        "created_utc": 1622559547,
        "id": "npvykp",
        "num_comments": 159,
        "num_crossposts": 0,
        "selftext": "# Call Options:\n\n&gt;**This post is intended for beginners that don't know the basics yet. I have simplified things and covered the only basic ideas.**\n\nA **call option (or just “call”)** is a contract that gives you the **opportunity**, **not obligation**, to buy **100 shares** of a stock, bond, commodity or other financial asset at a specific price (**strike price**) by a specific date (**expiration date**). The financial asset in question is the **underlying asset**, you profit when the underlying asset’s price increases.\n\n**Example**:  You buy a $100 call option for AMD that expires on July 10th. With this  call option, you have the right to buy 100 shares of AMD at $100 per  share before end-of-day on July 10th. If the price increases to $120  before your expiration date, you can still buy the contract at your  original $100 per share price.\n\n# Premiums:\n\nThe premium the money you need to pay the seller of the option in **exchange for the contract**, obviously they need to make money too. A premium **increases** your **breakeven** price, as it is an additional cost.\n\n**Example**:  Your $100 AMD call has a $3 premium. This means, that for each of the  100 shares in the contract, you owe $3 to the seller. $3 x 100 = $300.  In exchange for this premium, the seller gives you the call option.  Therefore, in order to breakeven, you now need $103 share price for AMD  because if it were to only go up to $100, you’d still be out of pocket  due to the $300 premium paid. If the stock price goes to $104, you have  made a profit, as it is higher than your $103 cost per share.\n\nIf the AMD share price **dips** lower than your $100 contract (known as **Out of the Money or OTM**), **you do not have to buy the 100 shares**. Call options give you the **right, not obligation**  to purchase the shares, at most you will lose the premium paid, but you  won’t have to buy the 100 shares. On the other hand, if the share price  **increases** (known as **In the Money or ITM**), and you cannot afford to buy the 100 shares you can then **sell your contract to someone else**. **Contracts can be sold prior to your expiration date.**\n\n&gt;This is how you’ll see people write their position: **AMD $100c 7/10**  \nThis translates to an AMD **call** option, with a **strike price of $100** and an e**xpiration date of July 10th.**\n\n# Covered Call Options:\n\nA  covered call is when you own an underlying asset and at the same time  write (sell) a call option. The idea is that you don’t mind holding an  underlying asset long term and that you believe it’s price will remain  stable over time. So, you write (sell) call options hoping they expire  worthless (below strike price) meaning you keep the shares of your  underlying asset while collecting the premium paid by the buyer. The  options writer’s profit on covered calls is the premium paid by the  buyer.",
        "subreddit": "options",
        "title": "Call Options 101",
        "url": "https://www.reddit.com/r/options/comments/npvykp/call_options_101/",
        "created": 1622588347.0
    },
    {
        "author": "igoldring",
        "created_utc": 1624136857,
        "id": "o3pvom",
        "num_comments": 138,
        "num_crossposts": 0,
        "selftext": "To start off I do have a position in NVIDIA but nonetheless the reason for this DD is strictly information not persuasive. I truly believe NVIDIA is *undervalued* currently. ***I believe NVDIA will reach 800 pre-split (200 post 4-1 split) with the current momentum going for the stock along with a shift to tech soon.***\n\n If you didn't know already, NVIDIA designs graphics processing units for the gaming and professional markets, as well as system on a chip units for the mobile computing and automotive market. \n\n*EARNINGS* \n\n**NVIDIA recently had its earnings report in which they reported $3.66 earnings per share for the quarter, beating the consensus estimate of $3.28 by $0.38.** They recorded revenue of $5.66 billion, up 84 percent from a year earlier and up 13 percent from the previous quarter, with record revenue from the company’s Gaming, Data Center and Professional Visualization platforms. Gaming revenue of $2.76 billion, up 106 percent from a year earlier. Record Data Center revenue of $2.05 billion, up 79 percent from a year earlier. \n\n## Quarterly Earnings Surprise Amount\n\n**Fiscal Quarter End| Date Reported | Earnings Per Share\\*| Consensus EPS\\* Forecast | % Surprise**\n\n**Apr 2021.                    05/26/2021                  3.13                                     2.62**                                **19.47%**\n\n**Jan 2021                      02/24/2021                  2.58                                      2.2                                  17.27%**\n\n**Oct 2020                     11/18/2020                   2.41                                     1.92                                25.52%**\n\n**Jul 2020                       08/19/2020                  1.67                                     1.63                                 2.45%**\n\nAs you can see over the past four quarterly earnings NVDIA has beaten each of the projected forecasts easily for the most part. With a gross margin of 64.11% for this quarter, and an average quarterly gross margin of 60.96% over the past 5 years, NVDIA is primed to continue its dominance for the future. Also it is important to note that **NVDIA beats out its main competitors Intel and AMD in gross margins on average over the past 5 years and over the last quarter.** \n\n## NVDIA Gross Profit Margin (Quarterly) Range, Past 5 Years\n\n**Minimum 54.74% Jan 2019**\n\n**Maximum 65.06% Apr 2020**\n\n**Average 60.96%**\n\n## AMD Gross Profit Margin (Quarterly) Range, Past 5 Years\n\n**Minimum 4.51% Sep 2016**\n\n**Maximum 46.07% Mar 2021**\n\n**Average 37.34%**\n\n## Intel Gross Profit Margin (Quarterly) Range, Past 5 Years\n\n**Minimum 53.13% Sep 2020**\n\n**Maximum 64.50% Sep 2018**\n\n**Average 59.65%**\n\nNow onto reasons why I think NVIDIA is a strong buy. \n\n1. **Price targets**\n\nNVDIA is still undervalued with multiple price targets very much higher than the current price of what NVDIA is trading at currently along with multiple buy ratings. One example in specific, **Bank of America recently upgraded NVDIA price target to $900 from $800 and reiterated its Buy rating.** The bank said its takeaway is that \"rising AI adoption, expanding use-cases across cloud, enterprise, edge, telco can help NVDA double its content and triple its data center sales over the next few years.\" Bank of America said it expects NVIDIA's data center business to grow at a 35% compounded rate to become its largest segment by year-end 2025. Other notable price targets include 854- Jefferies, 800- Robert W Baird, 800- Rosenblatt Securities. \n\n1. **Acquisition of ARM**\n\n ARM can’t stay independent for long, even the CEO thinks so. Arm CEO Simon Segars made the case that if it stays independent, Arm wouldn’t be able to keep up with the increasing demands of its customers for more complex chips that can perform a wider variety of functions. The simple solution? Getting acquired by another company. NVIDIA seems to be in the lead to acquire ARM and other rivals are terrified. They have a good reason to be, as NVDIA already a strong leader wants to spend $40 billion to acquire U.K. chip technology provider Arm Holdings. This acquisition will reshape the industry entirely. NVIDIA CEO, Jensen Huang said the acquisition of ARM is an opportunity to create a company that can generate even more new ideas, and bring more innovation to its customers in the form of intellectual property. A quote in specific, “The benefit to the market, and to the Arm customers will be more IP, better IP, more accelerated road maps and hopefully taking Arm to the far reaches of what is becoming …the diversity of computing that is literally going in every single direction,” Huang said. “You’re covering everything from cloud, to edge, to \\[internet of things\\], to high performance computing, to microprocessors, to accelerated computing—everything.”\n\n2. **Internet currency ( Not allowed to say actual word so replaced it with internet)**\n\nGPU’s can be used for internet currency and its mining purposes. It’s possible to blame the graphic card shortage on these miners but nonetheless, the usage of them is highly prevalent today. NVIDIA's releases of processors specifically used for mining poses a huge boost to its revenue and to the internet currency world. **NVIDIA booked $155 million in revenue from CMP cards in its fiscal first quarter.** While internet money is gaining traction around the world, we can expect NVIDIA to continue its dominance and reliability in mining purposes. \n\n3. **Stock split** \n\nOn May 21st, NVIDIA announced a 4-1 stock split which would take place on July 19th. So for every one share you own, you will own four instead as the stock splits its price valuation by four. On the day of the news, NVIDIA’s stock price closed at $599.67. **Since then, the price of NVIDIA’s stock has gone up around 24% to $743.75**. Not even one month has passed and the stock is up 24%! With one full month until the split **I predict NVDIA to hit $800 or/and above by the time of the official split**. Call options and shares in my opinion are the way to go for the next month as this could be a great opportunity to invest in a fast growth company. \n\n4. **Growth** \n\nNVIDIA has been a great growth tech stock to own recently with the numbers backing this statement up. \n\n**NVIDIA RETURNS** \n\nYTD: +223.35 (+42.77%)\n\n1 Year: +376.83 (+102.20%)\n\n6 Months: +214.67 (+40.44%)\n\n1 Month: +184.92 (+32.98%)\n\nNow for the returns on NVIDIA compared to AMD and INTEL. \n\n**NVIDIA RETURNS** \n\nYTD: +223.35 (+42.77%)\n\n1 Year: +376.83 (+102.20%)\n\n6 Months: +214.67 (+40.44%)\n\n1 Month: +184.92 (+32.98%)\n\n**AMD RETURNS**\n\nYTD: -7.06 (-7.70%)\n\n1 Year: +30.61 (+56.64%)\n\n6 Months: -11.27 (-11.75%)\n\n1 Month: +10.21 (+13.72%)\n\n**INTEL RETURNS**\n\nYTD: +5.85  (+11.74%)\n\n1 Year: -4.41 (-7.34%)\n\n6 Months: +8.21 (+17.30%) \n\n1 Month: +0.83 (+1.51%)\n\n**NVIDIA beats Intel and AMD in every single category growth wise showing complete dominance with its stock price.** \n\nConcluding I believe NVIDIA is a must buy presplit and the risk is minimum. The stock shows solid uptrend with extreme growth to come. NVIDIA is a strong buy in my personal opinion and an amazing company to be invested in. ",
        "subreddit": "wallstreetbets",
        "title": "NVDIA DD: Undervalued and why it will continue to run",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o3pvom/nvdia_dd_undervalued_and_why_it_will_continue_to/",
        "created": 1624165657.0
    },
    {
        "author": "BigRed323",
        "created_utc": 1623938546,
        "id": "o1xzmd",
        "num_comments": 126,
        "num_crossposts": 0,
        "selftext": "AMD is up 3% this morning because of this deal. Does this allow the stock to retrace all time highs or are chip shortages and a high multiple still a concern?  I own $90 LEAPS for next year and while they are currently in the red, I'm still bullish on the company.\n\n&gt;June 17 (Reuters) - Advanced Micro Devices Inc (AMD.O) and Alphabet Inc's (GOOGL.O) Google Cloud on Thursday said Google will offer cloud computing services based on AMD's newest data center chip, a move likely to intensify AMD's push to grab market share from rival Intel Corp (INTC.O).\n\n&gt;Cloud computing providers such as Google, Amazon.com Inc (AMZN.O) and Microsoft Corp (MSFT.O) are some of the biggest buyers of data center chips. They build services on top of the chips to rent the computing power out to millions of customers.\n\n&gt;Google said on Thursday it will start offering services based on AMD's \"Milan\" server chip, which AMD released in March. Google said customers such as Snap Inc (SNAP.N) and Twitter Inc (TWTR.N) are testing the new AMD-based services.\n\n&gt;AMD has been gaining market share against Intel, which was long the dominant player in data center chips but whose offerings have inferior performance on some measures because of years of stumbles in Intel's manufacturing operations.\n\n&gt;Intel in April announced its \"Ice Lake\" chip competitor to AMD's \"Milan\" chip and said all major cloud providers would support it, but Intel has not said when Google will start offering services based on its latest chip.\n\nhttps://www.reuters.com/technology/googles-cloud-taps-amd-new-service-chip-wars-heat-up-2021-06-17/",
        "subreddit": "stocks",
        "title": "Google's cloud taps AMD for new service as chip wars heat up",
        "url": "https://www.reddit.com/r/stocks/comments/o1xzmd/googles_cloud_taps_amd_for_new_service_as_chip/",
        "created": 1623967346.0
    },
    {
        "author": "Artarda",
        "created_utc": 1625067236,
        "id": "oazs4f",
        "num_comments": 120,
        "num_crossposts": 0,
        "selftext": "So I’ve been following AMD since it was a $30 little boy share, and I’ve always believed in it long. Looking at its history, you can see the annual returns over the last five years have been great. But here’s why this particular autist really likes this stock. But first, a bit of backstory about AMD.\n\n###Who is AMD and why do we care?\n\n**Advanced Micro Devices** (AMD) is a computer hardware development and manufacturing company at its core. They design and sell Processors, GPUs, APUs, and the like. For anyone who has been into gaming or building PCs, you’d probably recognize AMD as the “budget build”: the company who’s processors you buy when you don’t want to shell out $900 for a top shelf Intel. They have always been seen as an underdog in Intel’s shadow, with Intel having the superior clock speeds, Hyperthreading tech, and better clout when it comes to contracting.\n\n###Next Gen Consoles\n\nCurrently the latest gaming consoles are the PS5 and the Xbox Series X, both being relatively impossible to get your hands on due to the microchip shortage (more on that later). *AMD powers both.*\n\nLet that sink in. AMD has no competition for this generation of video game consoles. Every PS5 and Xbox X that gets built, AMD gets a chunk of that change. This is basically guaranteed profit for the life of the console, historically that’s about 6-7 more years.\n\n###Server Hardware\n\nAMD has been expanding their server hardware lineup, and their biggest competitor Intel has dropped the ball on this one: their new server hardware isn’t rolling out til Q1 2022. Meanwhile, Google is replacing outdated hardware with AMD processors. This is a big step for AMD, because it puts them in the position of no longer being the underdog, and gives them juicy, profitable market share.\n\n###CEO Lisa Su\n\nLisa Su is an awesome woman. She has a diverse background including Texas Instruments and IBM, and since she took the reigns of AMD in 2014, the stock has soared. She helped diversify their product line success, and saw the immense benefit of getting AMD server chips licensed in China.\n\n###The future of work\n\nLots of people see the future of work moving towards a larger working from home model (anecdotal). Working from home requires hardware, and people buying hardware prefer to spend less if they can, and this is the hardware AMD specializes in.\n\n###Semiconductor Shortage\n\nThe massive demand for semiconductors for everything from cars to laptops to servers has been a drag on literally the entire economy. Auto manufactory lines in Midwest America are at a standstill while car lots are barren of new vehicles because of the world’s “just in time” production model collapsing under increased demand.\n\nI personally believe this shortage is artificially holding down the price of AMD, as big money is slower to invest in a company that could potentially suffer from the shortage. Once things pick back up, there is a lot of potential for accelerated movement upwards as things become available to the public for purchase.\n\nAMD is a preferred client of Taiwan Semiconductor Manufacturing (TSM), which has invested billions into additional manufacturing capacity.\n\n###Get on the train before it leaves!\n\nOnce these processors start shipping out, the profits will roll in and sentiment will return. Boarding this rocket begins now! 🦍 🚀 🌝 \n\nI hold 100 shares @84 average and some 12/17/21 $155 calls.\n\nAlso, I’m profoundly autistic, my late wife’s second boyfriend told me so. This is not financial advice, I am retarded.",
        "subreddit": "wallstreetbets",
        "title": "Why I believe in AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oazs4f/why_i_believe_in_amd/",
        "created": 1625096036.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1623685357,
        "id": "nzppgh",
        "num_comments": 114,
        "num_crossposts": 0,
        "selftext": "\\[DD\\] Intel (INTC)\n\n**Estimated due diligence reading time: 8 minutes** \n\n&amp;#x200B;\n\nMarket Cap (MKT Cap) \n\n* 2014- 127B\n* 2016- 141B\n* 2018- 209B\n* 2020- 273B\n* Current- 233B\n\n\\*MKT Cap has increased by 83% since 2014\n\nEPS (Dilution)\n\n* 2016- $2.34\n* 2017- $2.31\n* 2018- $2.31\n* 2019- $4.42\n* 2020- $5.15\n* Current- $4.45\n\n\\*EPS has increased by 90% since 2016\n\nReturn on Equity (ROE)\n\n* 2016- 15.58\n* 2017- 13.91\n* 2018- 28.24\n* 2019- 27.16\n* 2020- 25.79\n\n\\*ROE has increased by 66% since 2016\n\nReturn on Assets (ROA)\n\n* 2016- 9.10\n* 2017- 7.79\n* 2018- 16.45\n* 2019- 15.42\n* 2020- 13.65\n\n\\*ROA has increased by 50% since 2016\n\nReturn on Investment (ROI)\n\n* 2016- 11.87\n* 2017- 10.21\n* 2018- 21.12\n* 2019- 20.47\n* 2020- 18.18\n\n\\*ROI has increased by 53% since 2016\n\n&amp;#x200B;\n\n**Financial Statement Highlights (in thousands)**\n\nTotal Revenue (TR)\n\n* 2016- 56.3B\n* 2017- 60.5B\n* 2018- 64.0B\n* 2019- 70.8B\n* 2020- 75.7B\n* Current- 77.7B\n\n\\*TR has increased by 38% since 2016\n\nEBITDA Margin\n\n* 2016- 35.23\n* 2017- 41.71\n* 2018- 45.73\n* 2019- 45.66\n* 2020- 46.13\n\n\\*EBITDA has increased by 31% since 2016\n\nGross Margin\n\n* 2016- 61.01\n* 2017- 62.30\n* 2018- 61.73\n* 2019- 58.56\n* 2020- 56.01\n\n\\*Gross Margin is down 8% since 2016\n\nPrice to Sales Ratio (PS)\n\n* 2016- 2.45\n* 2017- 2.61\n* 2018- 3.62\n* 2019- 3.35\n* 2020- 3.07\n* Current- 3.13\n\n\\*PS Ratio has increased by 28% since 2016\n\nPrice to Earnings Ratio (PE)\n\n* 2016- 12.05\n* 2017- 14.04\n* 2018- 20.83\n* 2019- 11.50\n* 2020- 10.18\n* Current- 13.00\n\n\\*PE Ratio has increased by 8% since 2016\n\nPrice to Book Ratio (PB)\n\n* 2016- 2.17\n* 2017- 2.28\n* 2018- 3.20\n* 2019- 3.09\n* 2020- 2.91\n* Current- 2.93\n\n\\*PB Ratio has increased by 35% since 2016\n\n&amp;#x200B;\n\n**Balance Sheet Highlights (in thousands)**\n\nTotal Liabilities\n\n* 2016- 44.3B\n* 2017- 48.8B\n* 2018- 58.4B\n* 2019- 55.8B\n* 2020- 71.4B\n* Current- 70.8B\n\n\\*Total Liabilities has increased by 60% since 2016\n\nLong Term Debt\n\n* 2016- 0.24\n* 2017- 0.27\n* 2018- 0.25\n* 2019- 0.25\n* 2020- 0.29\n\n\\*Long Term Debt has been pretty consistent in the past 5 years\n\nDebt to Equity Ratio (DE)\n\n* 2016- 0.38\n* 2017- 0.39\n* 2018- 0.35\n* 2019- 0.37\n* 2020- 0.45\n\n\\*DE Ratio has increased by 22% since 2019\n\n&amp;#x200B;\n\n**Competitors**\n\n* Advanced Micro Devices (AMD)\n* International Business Machines (IBM)\n* NVIDIA\n* Samsung\n\n&amp;#x200B;\n\n**Management**\n\n\tCEO Patrick Gelsinger has been a huge contributor to Intel's success. He was ranked the best CEO of America in 2019. He played a key role in USB, Wi-Fi, Intel Core, and Intel Xeon. Intel Core and Intel Xeon are some of the best modern-day processors on the market. \n\n&amp;#x200B;\n\n**Stock Price History**\n\n2016- $31.76\n\n2017- $36.52\n\n2018- $44.74\n\n2019- $47.22\n\n2020- $60.10\n\nCurrent- $57.85\n\n\\*Stock Price has increased by 82% since 2016\n\n&amp;#x200B;\n\n**Recent News (June 05, 2021)**\n\nIntel has partnered with a Biotech company called Enzolytics, Inc. Read about \"Optimizing Empathetic AI to Cure Deadly Diseases \\[here\\]([https://www.intel.com/content/www/us/en/healthcare-it/resources/enzolytics-whitepaper.html](https://www.intel.com/content/www/us/en/healthcare-it/resources/enzolytics-whitepaper.html))\n\n*TLDR*\n\nIntel is creating the AI for \"P4 Medecine\"\n\n* P4 Medicine aims to be predictive; A.I. is programmed to be prognostic\n* P4 Medicine seeks to preventative measures; A.I. is designed to be anticipatory\n* P4 Medicine embraces personalized care; A.I learns by being adaptive\n* P4 Medicine encourages physician/patient participation; A.I thrives on inclusive and participatory acts\n\nMajor components helped developed by Intel include:\n\n* Cervical Cancer Screening\n* Radiology Improvement\n* Precision Medicine\n* Tumor Detection\n* Genomics Research\n* Skin Cancer Detection\n\n&amp;#x200B;\n\n**Conclusion**\n\n\tIntel is among the stocks that are benefitting from the semiconductor shortage. CEO Pat Gelsinger expects the shortage to take a few years to recover. One problem the semiconductor industry faces is that the majority of chips are produced in Asia. Although recently, there has been a strong demand to increase chip production in the USA. Joe Biden's infrastructure plan includes $50B worth of subsidies for the semiconductor industry to help boost fabrication. However, it will take time to build the infrastructure. \n\n&amp;#x200B;\n\n*\\*\\*This is not investment advice\\*\\**\n\n*\\*\\*Do your own research\\*\\**",
        "subreddit": "investing",
        "title": "Due Diligence on Intel (INTC)",
        "url": "https://www.reddit.com/r/investing/comments/nzppgh/due_diligence_on_intel_intc/",
        "created": 1623714157.0
    },
    {
        "author": "Chillznday",
        "created_utc": 1625083416,
        "id": "ob5c2f",
        "num_comments": 113,
        "num_crossposts": 0,
        "selftext": "Hey everyone, \n\nHere are the daily option statistics for the top 10 most talked about stocks on WSB. Overall a boring day with $NIO(+6%) and $AMD(+5%) leading the pack. \n\n# CLOV: \n\n[-0.30&amp;#37;](https://preview.redd.it/w1p86ku6kg871.png?width=1506&amp;format=png&amp;auto=webp&amp;s=1edf9cdddfff8642fb7d321b7285c7f9e72989f4)\n\n# AMC:\n\n[+0.44&amp;#37;](https://preview.redd.it/i6kqhlc7kg871.png?width=1506&amp;format=png&amp;auto=webp&amp;s=a2fc45294236d8976744791b16a8597fd0794221)\n\n# GME:\n\n[+1.55&amp;#37;](https://preview.redd.it/wkg1r2y7kg871.png?width=1505&amp;format=png&amp;auto=webp&amp;s=3e046fa2d5795d81a782551e0cd31c3f674accfb)\n\n# AMD:\n\n[+4.93&amp;#37;](https://preview.redd.it/s6k8e1m8kg871.png?width=1505&amp;format=png&amp;auto=webp&amp;s=79b8c4fc9c45b33bc01638492723404c7dacfd17)\n\n# WISH:\n\n[-1.72&amp;#37;](https://preview.redd.it/7pejilc9kg871.png?width=1501&amp;format=png&amp;auto=webp&amp;s=8c8270f62434d4922627d1a538e133a06c814002)\n\n# WKHS:\n\n[-3.55&amp;#37;](https://preview.redd.it/xrmb8ax9kg871.png?width=1506&amp;format=png&amp;auto=webp&amp;s=a1f4ed46942e0191f8d9d4bf92e80b7ace976830)\n\n# CLNE:\n\n[-1.55&amp;#37;](https://preview.redd.it/yk6hnyiakg871.png?width=1498&amp;format=png&amp;auto=webp&amp;s=4f697de6f5fed77f3ddd21da01b5ee16e405cf6f)\n\n# NIO:\n\n[+5.68&amp;#37;](https://preview.redd.it/q2zhsabbkg871.png?width=1493&amp;format=png&amp;auto=webp&amp;s=05323f75aa69dfaa1e70a74087e95c1db564ba12)\n\n# MU:\n\n[+2.47&amp;#37;](https://preview.redd.it/lfmgg9vbkg871.png?width=1506&amp;format=png&amp;auto=webp&amp;s=417829349def66a66e42055bb11c475c970aef9f)\n\nAs usual let me know if I forgot anything. I will be back on in 30 minutes to update and change things. \n\n  \nUntil next time, best of luck in your investments!",
        "subreddit": "wallstreetbets",
        "title": "Daily option statistics for CLOV, AMC, GME, AMD, WISH, WKHS, CLNE, NIO, MU and others.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ob5c2f/daily_option_statistics_for_clov_amc_gme_amd_wish/",
        "created": 1625112216.0
    },
    {
        "author": "ChisusCries",
        "created_utc": 1622678188,
        "id": "nqzyjo",
        "num_comments": 112,
        "num_crossposts": 0,
        "selftext": "Next Squeeze $AMC ➡️ $AMD????\n\nA few reasons why $AMD is about to pop off \n1. Short interest at 20% just as $AMC \n\n2. Just announced a partnership with TSLA. Before you know it we’ll all be gaming and mining in our teslas. Imagine how big tesla already is and is going to be, now imagine the relative growth of AMD as its designated gpu provider\n\n3. Absolutely crushed earnings just a month ago by &gt;100% if my ape brain serves me right\n\n4. Other reasons like it has already surpassed Intel in cpu market share, has exciting projects lined up with TSMC, and groundbreaking technologies developed that my brain fails to comprehend \n\n6/11 $100 🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "Next Stop $AMC ➡️ $AMD🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nqzyjo/next_stop_amc_amd/",
        "created": 1622706988.0
    },
    {
        "author": "cablanedo",
        "created_utc": 1623368955,
        "id": "nx238t",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "hey everyone, just want to hear some of your semiconductor plays whoever has any. I was considering buying some AMD shares/TSM and have just started my research. I'd also consider a semiconductor etf as I do like a bunch of them. \n\n&amp;#x200B;\n\njust looking for different ideas",
        "subreddit": "stocks",
        "title": "Looking for a Semi conductor investment",
        "url": "https://www.reddit.com/r/stocks/comments/nx238t/looking_for_a_semi_conductor_investment/",
        "created": 1623397755.0
    },
    {
        "author": "StevenBikes4Life",
        "created_utc": 1624975299,
        "id": "oa8vwq",
        "num_comments": 110,
        "num_crossposts": 0,
        "selftext": "AMD + Xilix = a new Chip Innovation Powerhouse!\n\nThe approval of this acquisition by AMD is transformational for the next stage of chip development.\n\n[https://www.marketwatch.com/story/uk-regulator-clears-acquisition-of-xilinx-by-advanced-micro-devices-271624965300](https://www.marketwatch.com/story/uk-regulator-clears-acquisition-of-xilinx-by-advanced-micro-devices-271624965300)",
        "subreddit": "stocks",
        "title": "The reason AMD is jumping today - HUGE NEWS!",
        "url": "https://www.reddit.com/r/stocks/comments/oa8vwq/the_reason_amd_is_jumping_today_huge_news/",
        "created": 1625004099.0
    },
    {
        "author": "jonmon7891",
        "created_utc": 1623961890,
        "id": "o2725l",
        "num_comments": 102,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$AMD used my lunch money for this! not bad for a thursday, just put in my 2 week notice at work!",
        "url": "https://i.redd.it/vvgfti4yyv571.jpg",
        "created": 1623990690.0
    },
    {
        "author": "rgpace5",
        "created_utc": 1623984482,
        "id": "o2ertd",
        "num_comments": 94,
        "num_crossposts": 0,
        "selftext": "I just picked two Vanguard ETF's but any growth or total stock market ETF would work.\n\nVUG up nearly 40% in the last year. Nearly 160% the past 5.\n\nVTI up nearly 40 in the last year. about 105% in the last 5.\n\n&amp;#x200B;\n\nMSFT came close (426%)\n\nARKK came close (506%)\n\nAMD crushed it (1,861%)\n\nGOOGL outperformed, but not by multiples (233%)\n\nAMZN more than doubled VUG (389%)\n\nTesla crushed it (1,301%)\n\nAAPL came close (435%)\n\nDIS under performed (80%)\n\n&amp;#x200B;\n\nIn order to achieve this a company would need at least 500% growth over 5 years, assuming VUG/VTI continues its current pace. Which companies do you feel are relatively solid picks that have the growth potential to achieve this? Not really looking for wildly speculative growth companies here",
        "subreddit": "stocks",
        "title": "Stocks You're Most Confident Will 5x VUG/VTI in the next 5 years.",
        "url": "https://www.reddit.com/r/stocks/comments/o2ertd/stocks_youre_most_confident_will_5x_vugvti_in_the/",
        "created": 1624013282.0
    },
    {
        "author": "chrisdh79",
        "created_utc": 1624016863,
        "id": "o2n8xt",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "Intel may see its market share fall to a new low next year, in large part thanks to Apple's decision to move away from using Intel processors in its Mac computers and instead use Apple silicon.\n\nAs a result of the four Macs with ‌M1‌ and upcoming releases, Intel this year will lose 50% of its orders from Apple, and eventually, losing all orders from the Cupertino tech giant will lead to Intel's market share falling below 80% in 2023, according to DigiTimes.\n\nHowever, Apple's in-house developed Arm-based processor series is expected to play the key role in taking a major chunk from Intel's share in the upcoming year, the sources said.\n\nIntel is expected to lose nearly 50% of its orders from Apple in 2021 and will eventually obtain no orders from the client. Losing Apple's 10% market share and seeing AMD staying firmly with another 10%, Intel's share in the notebook market is likely to slip below 80% in 2023, the sources noted.\n\nhttps://www.macrumors.com/2021/06/18/intel-market-share-falling-apple-silicon/",
        "subreddit": "stocks",
        "title": "Intel Processor Market Share May Fall to New Low Next Year Due to Apple Silicon",
        "url": "https://www.reddit.com/r/stocks/comments/o2n8xt/intel_processor_market_share_may_fall_to_new_low/",
        "created": 1624045663.0
    },
    {
        "author": "jeffnova",
        "created_utc": 1624304487,
        "id": "o53l0b",
        "num_comments": 84,
        "num_crossposts": 0,
        "selftext": "so i just purchased some shares of AMD at around 82, any thoughts on the future performance? just the other day they were at 87 so i’m hoping for it to at least go back up to that. i’m not too familia with aspects of the investing world, but just wanted to see if i could get some advice! (or if i made a mistake lol!)",
        "subreddit": "stocks",
        "title": "thoughts on AMD?",
        "url": "https://www.reddit.com/r/stocks/comments/o53l0b/thoughts_on_amd/",
        "created": 1624333287.0
    },
    {
        "author": "jonmon7891",
        "created_utc": 1624647796,
        "id": "o7u6xn",
        "num_comments": 82,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$AMD, BOOM! Let’s go ITM, 1000 calls at 86/1.30 strike!",
        "url": "https://i.redd.it/vc1g9z1img771.jpg",
        "created": 1624676596.0
    },
    {
        "author": "anuder1",
        "created_utc": 1622566943,
        "id": "npytvv",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": " \n\n**Why Intel ($INTC) is undervalued**\n\nThis is my first ever stock analysis, any tips will be appreciated. \n\nDISCLOSURE: I do not own any shares of Intel at the time of writing. \n\nIntel is a chipmaker who has been beaten down by the ongoing global chip shortage. Intel is down from it’s high and has a relatively low P/E value. I am currently bullish on Intel. AMD is currently expensive and overvalued at the moment. AMD has had no availability in the consumer market for quite some time. Intel is finally the more affordable option again (in terms of consumer parts) due to AMD having very limited availability. In terms of stock, Intel is currently down from it’s high and has potential to go back up. \n\n**Finances**\n\nFirst things first, let’s get into Intel’s financials. Over the past few years, Intel has had steady revenue growth:\n\n2017: 62.76B\n\n2018: 70.85B\n\n2019: 71.97B\n\n2020: 77.87B\n\nIntel has also been steadily buying back outstanding shares, declining in numbers every year:\n\nIn 2018, Intel had 4.701B outstanding shares, a 2.77% decrease from 2017.\n\nIn 2019, Intel had 4.473B outstanding shares, a 4.85% decrease from 2018.\n\nIn 2020, Intel had 4.232B outstanding shares, a 5.39% decrease from 2019.\n\nIn March 2021, Intel had 4.096B outstanding shares, a 5.01% decrease from 2020.\n\n**Competition/Growth Potential**\n\nIntel has a P/E ratio of 12.80. This is low, compared to the average P/E ratio of 22.69 for the rest of the industry. Intel is also still down from it’s stock price high of \\~$68 in April at \\~$57 right now. The global chip shortage has been the main cause of Intel being down, along with fierce competition from AMD. As chip production begins to pick back up, Intel’s stock should begin to go up as well. AMD has been hurt greatly from this chip shortage as well, giving Intel a chance to possibly undercut AMD and lead to growth. \n\nIntel also plans to build more production plants so that they can keep up with the ever-increasing demand for chips. Intel is still ahead of AMD in market share as well. Intel’s new 11th Gen processors are back on top in terms of speed, especially in laptops. A subsidiary of Intel has also landed a deal with Toyota ($TM) to produce radar technology for Toyota. \n\n**Final Thoughts**\n\nIntel seems to be using the chip shortage as a way to come back from their drought. They seem to have been benefiting from it greatly.\n\nIntel is not out yet. They still have the market share and resources to compete with AMD. Intel is undervalued and has the capability to bounce back strong from the chip shortage and also has a chance to finally come out on top as the primary choice in the chip market. \n\nWhat are everyone else’s thoughts? I personally believe that Intel is due for a breakout in the next months, but what does everyone else think? I was also wondering about Qualcomm ($QCOM), what does everyone think about that?",
        "subreddit": "investing",
        "title": "Why Intel ($INTC) is Undervalued",
        "url": "https://www.reddit.com/r/investing/comments/npytvv/why_intel_intc_is_undervalued/",
        "created": 1622595743.0
    },
    {
        "author": "Maximum-Fudge6438",
        "created_utc": 1623004626,
        "id": "ntscpa",
        "num_comments": 78,
        "num_crossposts": 0,
        "selftext": "What would people’s preferences be?\n\nAMZN has been trading sideways a bit, whilst GOOGL is pushing toward ATH. This stock would be to hold for long and would join the following portfolio;\n\nAAPL\nMSFT\nAMD\nALLY\nPEP\nDIS\nTGT\nF\nV\nVWRP\n\nIt’s also worth asking would anyone sell those already owned to make way for AMZN or GOOGL? For example sell off two holdings for one of those others?",
        "subreddit": "stocks",
        "title": "AMZN or GOOGL buy one share",
        "url": "https://www.reddit.com/r/stocks/comments/ntscpa/amzn_or_googl_buy_one_share/",
        "created": 1623033426.0
    },
    {
        "author": "Elongated-Muskrat99",
        "created_utc": 1624515278,
        "id": "o6v0rr",
        "num_comments": 76,
        "num_crossposts": 0,
        "selftext": "I’m struggling to see how such a solid technology company can be trading at less than 9x Price/Sales. \n\nI mean, even apart from Lisa Su’s objective awesomeness as an Executive, consistently strong Revenue Growth and Earnings beats, this damn company is promising. Quarter after quarter it’s eating away at Intel’s market share, product users are continually impressed, and massive players like Tesla and Google are confident enough to back it. Even AMD wants to buy back it’s own shares at this price.\n\nAnd what? Waiting for the XLNX deal has removed the entire speculative aspect of the stock market? A chip shortage, in part, due to an increase in CONSUMER DEMAND during the pandemic? Am I missing something here?\n\nI know some investors may be able to make a reasonable bear case, given some unlikely circumstances, but do you honestly think this valuation is unwarranted (let alone significantly low in this market environment)?\n\nI’m not a financial advisor lol",
        "subreddit": "stocks",
        "title": "AMD - A Diamond in the Rough",
        "url": "https://www.reddit.com/r/stocks/comments/o6v0rr/amd_a_diamond_in_the_rough/",
        "created": 1624544078.0
    },
    {
        "author": "snkbrdng",
        "created_utc": 1623723759,
        "id": "o03cw0",
        "num_comments": 74,
        "num_crossposts": 0,
        "selftext": "Ok all you AMC/GME/BB/CLNE millionaires listen up. \n\nNVDA is freaking sweet, but has limited room to run at ATH. \n\nIntel is beat down but rightfully so considering they need nearly flawless technical execution over the next 3 years to ensure AMD doesn’t go from 10% mark share to 33% in the $26B data center CPU market.\n\nGuess who’s stock is on 28% discount (analysts target price). None other than Mama Su’s A-M-D. \n\nThe Xilinx merger will close in Q4 according to most semiconductards. \n\nPrior to that the price will run to $100+ and likely overshoot considering the explosive growth AMD is experiencing.\n\nPosition: 66 AMD Leaps between $65 and $90 acquired over the last 6 months.",
        "subreddit": "wallstreetbets",
        "title": "AMD play for June-December 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o03cw0/amd_play_for_junedecember_2021/",
        "created": 1623752559.0
    },
    {
        "author": "Zukhov76",
        "created_utc": 1625004784,
        "id": "oaisr9",
        "num_comments": 72,
        "num_crossposts": 0,
        "selftext": "NVDA is a beast of a stock that has seen a huge run up lately and will be split 4:1 in late July. Many anticipate a spike after the split since it could attract more investors. AMD has also been on a nice run but seems to be the better value of the two with more room to grow. Which of the two would you buy and why?",
        "subreddit": "stocks",
        "title": "NVDA vs AMD. Which is the better buy for the long term?",
        "url": "https://www.reddit.com/r/stocks/comments/oaisr9/nvda_vs_amd_which_is_the_better_buy_for_the_long/",
        "created": 1625033584.0
    },
    {
        "author": "Doctorhomage",
        "created_utc": 1623869784,
        "id": "o1cfhq",
        "num_comments": 71,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Long $AMD shares/options",
        "url": "https://i.redd.it/re042sk2do571.jpg",
        "created": 1623898584.0
    },
    {
        "author": "Just_Kittens",
        "created_utc": 1624419366,
        "id": "o64osl",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "**Corsair (CRSR) Due Diligence as of 6/22/2021**\n\n**Latest Earnings - May 4th, 2021**\n\n* EPS beat estimates -- $.58 (actual) vs. $.25 (expected)\n* Revenue $529.4M (actual) vs. $443.27M (expected) -- 71.6%+ YoY\n* Gamer &amp; creator peripherals net revenue $175.9M --131.9%+ YoY\n* Gamer &amp; creator peripherals gross profit $68.9M -- 211.1%+ YoY\n* Gaming components &amp; systems net revenue $353.5M -- 51.9%+ YoY\n* Gaming components &amp; systems gross profit $91.5M -- 61.9%+ YoY\n* Gross profit $160.3M -- 103.9%+ YoY\n* Gross margin of 30.3% -- 4.8%+ YoY\n* Operating income $67.3M -- 404.5%+ YoY.\n* Adjusted operating income $80.4M -- 221.4% YoY\n* Net income $46.7M or $0.47 per diluted share vs. the same period last year Net income  $1.2M or $0.01 per diluted share\n* Adjusted net income $58.2M or $0.58 per diluted share -- 420.4%+ YoY vs. the same period last year Adjusted net income of  $11.2M or  $0.13  per diluted share.\n* Adjusted EBITDA $80.4M -- 196.6%+ YoY \n* Adjusted EBITDA margin 15.2% -- 6.4%+ YoY\n* As of March 31, 2021, cash and restricted cash $125.6M, $48.1 million capacity under revolving credit facility, and total long-term debt of $294.3M\n* “We were able to convert our strong financial performance in the first quarter into an opportunity to further strengthen our balance sheet. We reduced debt by an additional $28 million with outstanding principal now at $299 million and net debt at $177.3 million. We did this while growing quickly and leaving sufficient resources to help us grow further. We continue to evaluate growth opportunities while still expecting to further reduce our existing debt in 2021,” said  Michael G. Potter CFO\n* Cash flows from operations $27.8M -- $2M+ versus the same period last year.\n\n**Financial Health**\n\n* Short term assets ($711.6M) exceed its short term liabilities ($499.3M) and long term liabilities ($346.5M)\n* Debt/Equity Ratio has been reduced from 95.2% to 60.3%\n* Debt is covered by operating cash flow by 66.2%\n* Interest payments on debt are covered by EBIT 7x\n\n**Guidance**\n\n* Raised net revenue range to $1.9 - $2.1 billion from $1.8 to $1.95 billion\n* Raised adjusted operating income to range of $235-$255 million from $205-$220 million \n* Raising adjusted EBITDA to range of $245-$265 million from $215-$230 million\n\n**Fundamentals**\n\n* EPS $1.59\n* P/E Ratio 19.9 - 20.3\n* P/B 6.2\n* P/S 1.5\n* Market Cap 2.9b\n* Cash Flow Per Share $2.15\n* Free Cash Flow Per Share $1.60\n\n**Ownership**\n\n* Shares outstanding 92.19M\n* Shares owned by Eagle Tree Capital 54,179,559\n* Eagle Tree Capital ownership 58.7%\n* Latest SEC Filings by Eagle Tree https://www.sec.gov/edgar/browse/?CIK=0001743759  \n* https://www.sec.gov/Archives/edgar/data/1743759/000089924321024189/xslF345X03/doc4.xml\n* https://www.sec.gov/Archives/edgar/data/0001743759/000089924321022292/xslF345X03/doc4.xml \n* https://www.sec.gov/Archives/edgar/data/0001743759/000089924321003503/xslF345X03/doc4.xml \n\n**Recent Developments**\n\n* Coming Soon - June 29th, 2021 @ 9am PT - New Product Announcements\nhttps://www.originpc.com/landing/2021/corsair-live/ \n\n* Coming Soon - Date TBD - DDR5 Announcement\nhttp://cwsmgmt.corsair.com/media/dram/CORSAIR_DDR5_PRIMER.pdf?_ga=2.63622255.1327413949.1624406070-1124728771.1624406070\n* June 17th, 2021 - New all-in-one liquid CPU coolers: the H55 RGB, H100 RGB, and H150 RGB. Equipped with CORSAIR SP120 RGB ELITE fans with AirGuide technology, the H55 RGB, H100 RGB, and H150 RGB combine low-noise performance cooling with an abundance of vivid, motherboard-controlled RGB lighting at an attractive price. Compatible with nearly all modern Intel® and AMD CPUs and are backed by a three-year warranty.\n* June 8th, 2021 - Launch of Stream Deck 5.0, a major app update that introduces the  Stream Deck Store, an online distribution platform for plugins, icon packs, tutorial videos, and pro tips, plus thousands of royalty-free music tracks and sound effects. Stream Deck 5.0 is available today as a free update.\n* June 3rd, 2021 - New VENGEANCE i7200 Series PCs. Fully-built gaming PCs are equipped with the latest NVIDIA® GeForce RTX 30-Series GPUs (GeForce RTX 3080 Ti and 3070 Ti), and Intel® Core CPU, and a CORSAIR 4000D AIRFLOW mid-tower case. \n* May 13th, 2021 - New VIRTUOSO RGB Wireless XT Gaming Headset. Connecting via hyper-fast SLIPSTREAM WIRELESS and Bluetooth® for simultaneous dual-wireless connections, in addition to high-fidelity USB and universal 3.5mm wired connection options, the VIRTUOSO RGB Wireless XT combines exquisite sound quality, comfort, and versatility. Now with Dolby Atmos® three-dimensional spatial audio to complement its extensive 20Hz-40,000Hz frequency range\n* April 13, 2021 - Announced the launch of Corsair One a200 gaming PC powered by the new AMD Ryzen™ 5000-series CPU and the Corsair One i200 powered by a new 11th Gen Intel® Core™ CPU. These systems come equipped with NVIDIA® GeForce RTX™ 3080.\n* April 8, 2021 - Elgato brand announced release of Cam Link Pro, a powerful new PCIe capture card and video mixer that boasts four HDMI inputs to stream or record 4K or 1080p60 Full HD video from DSLR cameras, laptops, tablets, and any other devices that output a clean HDMI signal. From live broadcasting and editing to video conferencing and remote teaching, Cam Link Pro  makes multicam production easy for content creators and professionals who engage with audiences online.\n* April 8, 2021 - CHAMPION SERIES New products = K70 RGB TKL Mechanical Gaming Keyboard, with 8,000Hz hyper-polling driven by CORSAIR AXON hyper-processing technology, SABRE RGB PRO and SABRE PRO with AXON hyper-processing technology and 8,000Hz polling.\n* March 31, 2021 - CORSAIR K55 RGB PRO and K55 RGB PRO XT. These latest entries in the K55 family offer dynamic RGB backlighting, and include six dedicated macro keys with Elgato Stream Deck software integration for one-button actions and shortcuts with CORSAIR iCUE software.\n* March 16, 2021 - New 11th-Gen Intel®-powered VENGEANCE i7200 gaming PCs. Available in configurations with up to an Intel Core™ i9 11900K CPU with NVIDIA® GeForce RTX™ 3000-Series graphics, up to a GeForce RTX 3090. NVIDIA DLSS 2.0 AI technology boosts frame rates at maximum detail at 4K settings. \n* March 16, 2021 - New CORSAIR K65 RGB MINI boasts 100% CHERRY MX mechanical keyswitches, dynamic per-key RGB backlighting, CORSAIR AXON Hyper-Processing Technology with 8,000Hz polling, and a detachable USB Type-C cable.\n* March 4, 2021 - Elgato brand launched Elgato Light Strip and Elgato Wave Panels. Elgato Light Strip offers convenient app-controlled ambient lighting with RGBWW LEDs capable of displaying 16 million colors, with a wide brightness and color temperature range to create the perfect look for any setup. Elgato Wave Panels feature two-layer foam construction to reduce room echo and reverberation, easily mounting to the wall in modular hexagonal panels. \n* February 25, 2021 - New KATAR PRO XT with weight of just 73g and equipped with a drag-reducing paracord cable, the KATAR PRO XT is extremely agile and well-suited for fast-paced FPS and MOBA gameplay. The KATAR PRO XT is also the first CORSAIR mouse to implement new CORSAIR QUICKSTRIKE buttons, pre-tensioned to reduce button travel to a minimum, meaning every click from the KATAR PRO XT registers faster than ever.\n* February 16, 2021 - Corsair acquisition of Visuals by Impulse (VBI), a premium design platform for creators, which will join CORSAIR under its existing Elgato brand. Founded in 2015, VBI provides professional design for creators on Twitch, YouTube and Facebook Gaming. Streamers around the world use VBI overlays, alerts, and widgets to customize their broadcasts and grow their fanbases. VBI is a trusted partner for over 200,000 creators.\n\n**Competitors**\n\nhttps://i.postimg.cc/DwmNMDSq/CRSR-Competitors.png\n\n\n**Chart - Past 120 Days**\n\nhttps://i.postimg.cc/4xM0k5cj/CRSR-Chart-120-Days.png\n\n\n**Moving Averages**\n\n* 50 Day = 32.69\n* 120 Day = 35.14\n* 200 Day = N/A\n \n**Price Targets**\n\n* **Yahoo Finance = $37 Low / $55 High**\n* **Marketwatch = $37 Low / $47.50 Median / $55 High**\n* **Finbox = $37 Low / $46.67 Median / $55 High**\n* **Insider - Andrew Paul (CEO)**\n* 186,467 shares @ $39.08 on 6/14/21\n* 222,911 shares @ $40.43 on 6/14/21\n* 2,584,896 shares remaining\n* **Insider - Eagle Tree Capital** \n* Eagle Tree currently owns 58.7% of outstanding shares. Because of this, you may likely see large block sales occur on rallies. Here are the price targets that Eagle Tree has been selling at in their latest SEC filings\n* 68,400 shares @ $39.43 on 6/14/21\n* 433,001 shares @ $38.19 on 6/14/21\n* 372,302 shares @ $37.30 on 6/14/21\n* 1,413,808 shares @ $36.17 on 6/14/21\n* 203,771 shares @ $37.31 on 6/14/21\n* 229, 218 shares @ $35 on 6/14/21\n* 5,000,000 shares @ $31.87 on 6/03/21\n* 8,260,000 shares @ $35 on 1/26/2021\n* 54,179,559 shares remaining\n\n**How to trade CRSR**\n\n* **Beginners**\n\n* Purchase shares and set limit order to sell at a favorable price target. See above for analyst and insider price targets.\n\n* **Advanced**\n\n* Acquire as many round lot shares as you can afford if the stock price is under $35 or average in if you’re more conservative\n* When the stock rallies, sell covered calls at a strike above your cost basis and wait for Eagle Tree to unload shares to take profits. If Eagle Tree does not unload shares and your calls are ITM at expiration, then enjoy your profits and buy back on the next dip. \n* When the stock sells off, sell naked puts or put credit spreads and take profits on rallies\n* Track chart and check moving averages for entries and exits\n* Rinse and repeat until CRSR establishes support in the 40-50 range. Once this occurs, re-evaluate position\n* Don’t be afraid to take profits on half or all your shares if you see a more favorable exit for your portfolio. \n\n**My Current Position**\n\n* 200 shares @ 28.49 average cost basis\n* 5 Put Credit Spreads for 7/16/21 32.5/27.5 for $1.65 average premium",
        "subreddit": "wallstreetbets",
        "title": "$CRSR - The mother of all CRSR DDs. 🚀🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o64osl/crsr_the_mother_of_all_crsr_dds/",
        "created": 1624448166.0
    },
    {
        "author": "rochesterjones",
        "created_utc": 1623206147,
        "id": "nvl79m",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "First of all, this IS relevant because it’s about whether someone is a retard or not and that’s what we’re here for.\n\nI made 10k last year because I’m a smart retard and I had puts on SPY that I bought in February for 100 dollars. Yay me. \n\nSo this year I go to my accountant and I’m like I made this money, capital gains, I gotta pay taxes, just do all that math shit and tell me what I gotta pay.\n\nShe says I don’t have to pay anything, because I didn’t make enough and my trade volume was too low\n\nIs she retarded? \n\nNo I cannot post on personal finance because I got banned from there for telling everyone to buy Yolo calls on AMD when that was a thing",
        "subreddit": "wallstreetbets",
        "title": "Is my accountant retarded",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nvl79m/is_my_accountant_retarded/",
        "created": 1623234947.0
    },
    {
        "author": "FreeAdministration34",
        "created_utc": 1623364006,
        "id": "nx0d6i",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "I am long $AMD and if it gets to $100, will earn $600K. Now I earned $88K but I will not plan to sell until $AMD has its fair share price which is $100+ for now. I am going to share with you how it goes regularly.",
        "url": "https://i.redd.it/j83dydu4li471.jpg",
        "created": 1623392806.0
    },
    {
        "author": "ihpalash",
        "created_utc": 1624380659,
        "id": "o5rmhk",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "So I am going to keep my reasoning short and simple:  \n\n\n1) AMD is making ASIC chips and processors for sapphire which will directly compete for the future mining operation.  Pricing this year didnt reflect on AMD because many people hooked up on the GME and AMC in the stock market. \n\n2) AMD is kicking Intel's butt. INTEL already lost it's the position in the global chip market, with AMD releasing new processors catered to only Gaming it's only a matter of time, AMD will dominate the chip market. \n\n3) \n\nhttps://preview.redd.it/r0f9dxh3ju671.png?width=933&amp;format=png&amp;auto=webp&amp;s=b320fb4b53c255619bde8b4874db04bb36b19d35\n\nTechnical standpoint AMD fall off from the $99 mark to 72 in 6 month's low on inflation. But AMD is one of those companies where it's Equity to dept ratio is high meaning, they have more business than they have debt. \n\n4) AMD is slowly building momentum in the smartphone processor market. Their processors are already 30-50% faster than the market's existing processors. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/pizjxs4nju671.png?width=895&amp;format=png&amp;auto=webp&amp;s=6ecdf4d7a662f51e46f64d0641bf68116bf7b1d8\n\n5) AMD's rival Nvidia is having hard time on the GPU market due to constant innovation and RND. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/dr6vbua1ku671.png?width=1230&amp;format=png&amp;auto=webp&amp;s=397c4b47e2b037ad7efeaab7d44c22306997694f\n\n&amp;#x200B;\n\nI REST MY Case. I am holding my AMD at $27 since.",
        "subreddit": "wallstreetbets",
        "title": "Why AMD will reach $100 at the end of this month",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o5rmhk/why_amd_will_reach_100_at_the_end_of_this_month/",
        "created": 1624409459.0
    },
    {
        "author": "oldworlds",
        "created_utc": 1622802335,
        "id": "ns1uuw",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "# Put Options 101\n\n**Put Options:**\n\nContinuing from my previous [**Call Options 101**](https://www.reddit.com/r/options/comments/npvykp/call_options_101/) post, here are the very **basics** to understanding what put options are and how they work!\n\nA **put option (or just “put”)** is a contract that gives you the **right, not obligation**, to **sell 100 shares** of a stock, bond, commodity or other financial asset at a specific price (strike price) by a specific date (expiration date). The financial asset in question is the underlying asset, you profit when the underlying asset’s price decreases.\n\n* If you think the price of an underlying asset will decrease, you can buy a put option.\n* If you think the price of an underlying asset will increase, you can write (sell) a put option.\n\n# Buying vs Selling:\n\n**Buying a Put Option:**\n\nIf the price of the underlying asset falls below the strike price the put option is **In the Money (ITM).** ITM put options have an intrinsic value because the current price of the underlying asset is lower than the strike price.\n\nIf the price of the underlying asset hits the strike price or goes beyond it, then the put option is **Out of the Money** (OTM), therefore expiring worthless and allowing the writer (seller) to collect their premium.\n\n**Example:** You buy a $100 put option on AMD with a $2 premium that expires on July 10th. Every dollar decrease below the strike price earns you $100 profit, since each contract is made up of 100 shares. Your breakeven point (the point at which your put option becomes profitable) is $98 (strike *minus* premium). If the underlying asset price increases above $100 by your expiration date, your put option expires worthless and your maximum loss is $200 ($2 premium x 100 shares).\n\n# Selling a Put Option:\n\nThe writer (seller) of a put option has the obligation to buy the underlying asset at the strike price. In order to do this, you’d need enough cash in your account or margin capacity to cover the purchase.\n\n* If the price of the underlying asset decreases below the strike price by expiration date, the writer (seller) must purchase the underlying stock at the strike price.\n* If the price of the underlying asset increases above the strike price the writer (seller) profits by collecting the premium paid by the buyer.\n\n**Example:** You write (sell) a $100 put option on AMD with a $2 premium that expires on July 10th. Every dollar decrease below the strike price increases the writer (seller) cost by $100. The breakeven point (the point at which your put option becomes profitable) is $98 (strike *minus* premium). The maximum profit for the put writer (seller) is the $200 premium ($2 premium x 100 shares).\n\nOn the other hand, if the buyer exercises the put option, then the writer (seller) must by the 100 shares at the strike price, which depending on the price of the underlying asset could result in a potential loss larger then the value of the underlying asset.\n\n# Buying a Call vs Selling a Put?\n\n**While they are both bullish positions, they are quite different:**\n\n1. When  you buy a call, you have the right, not the obligation to purchase the  underlying asset at the strike price upon expiry, this gives the call  buyer control. When selling a put, the writer (seller) has the  obligation to buy the underlying asset at the strike price if the buyer  ends up exercising prior to expiry.\n2. When  buying a call, the potential loss is limited to the premium paid while  the profit is theoretically unlimited depending on the price fluctuation  of the underlying asset. It is the opposite when selling puts, your  profit is capped at the premium paid by the buyer, but your potential  loss is theoretically unlimited depending on how the price decrease of  the underlying asset.\n3. Buying  a call does not require you cash or margin capacity. Selling a put  requires you to have enough cash or margin capacity in your account.\n\n# Put Strategies:\n\n**Buying Put Options:**\n\nIf you're bearish on an underlying asset, you can purchase put options, essentially shorting the underlying to profit from the price decrease.\n\n**Selling Put Options:**\n\nIf you're bullish on a underlying asset, you can write (sell) put options with the hopes that they expire worthless and that you profit by collecting your premium.\n\n**Protective Puts:**\n\nA protective put is basically an insurance policy that limits any potential losses from price drops of an underlying asset. \n\n**Example:** You own 100 shares of AMD, the current price per share is $100. You're bullish, expecting the price to increase in the future but you'd like to protect yourself against any unexpected price dips. You do this by purchasing a protective put contract with a strike price of $100 with a $10 premium.\n\n1. **If the share price increases** from $100 to $110, you are profitable on your position and your protective put will expire worthless. Current Price - (Strike Price + Premium) = Profit.\n2. **If the share price is between** $100 and $110, you will either breakeven or experience a loss due to the premium paid for the protective put.\n3. **If the share price dips below** $100 you can exercise your protective put to limit your losses. Once you have exercised your put, you can sell your 100 shares at the $100 strike price, limiting your loss to the premium paid for the put contract.\n\n**Naked Puts:**\n\nA naked put (uncovered or short) involves writing (selling) a put option without having a short position in the underlying asset, therefore making it uncovered. The potential profit is limited to the premium paid by the buyer, the potential loss is theoretically unlimited as if the price of the underlying asset dips to 0 you'll be obligated to purchase the stock at the strike price which could mean a very significant loss.\n\n**Put Spreads:**\n\nA put spread strategy is when multiple contracts are bought/sold at the same time on an underlying asset with different strike prices or expiration dates. This is done to cover multiple price fluctuation scenarios, it limits the potential loss while also limiting the potential profit.",
        "subreddit": "options",
        "title": "Put Options 101",
        "url": "https://www.reddit.com/r/options/comments/ns1uuw/put_options_101/",
        "created": 1622831135.0
    },
    {
        "author": "moneylivelaugh",
        "created_utc": 1623290144,
        "id": "nwc7ml",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "AMDs business is still strong, great cash flow. The market for chips is growing. Why are they declining? The average price target on is $105, currently trading at $80. Seems like a good swing trade opp. Any thoughts?",
        "subreddit": "stocks",
        "title": "Why is AMD Declining",
        "url": "https://www.reddit.com/r/stocks/comments/nwc7ml/why_is_amd_declining/",
        "created": 1623318944.0
    },
    {
        "author": "MrC714",
        "created_utc": 1624395834,
        "id": "o5x90w",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "Ok so we all know the many reasons AMD is going to go absolutely nuts once the $XLNX merger gets through regulatory approval. For those of you who are in the stock or considering a position I want to point out something I haven’t heard discussed.\n\nAfter finally hiring a CEO Pat Gelsinger’s BIG announcement was that Intel would re-enter the fab business. At a glance it may seem like so what? Well the reason Pat is focusing investor and media attention on their fab business is he knows they have lost and will not regain competitive advantage over AMD anytime soon. He has to set the stage for investors to buy Intel for the future potential in Fab because he knows soon they will drop the stock like hot garbage as AMD takes away not some but the majority of the high end computing revenue.\n\nI personally believe between Data Center, GPU, Notebook, Desktop, Consoles, Cell Phone, Automotive and 5G $AMD will be $300-$400 in the next few years. Buy leaps or shares and enjoy the ride.\n\nNot financial advice.",
        "subreddit": "wallstreetbets",
        "title": "$AMD DD. Why isn’t anyone discussing this?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o5x90w/amd_dd_why_isnt_anyone_discussing_this/",
        "created": 1624424634.0
    },
    {
        "author": "KentzBe",
        "created_utc": 1623387075,
        "id": "nx7nps",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Finally making a come back from March madness. $AMD is probably the only stock I'm super bullish on.",
        "url": "https://i.redd.it/e8u9hq7qhk471.jpg",
        "created": 1623415875.0
    },
    {
        "author": "MrObviouslyRight",
        "created_utc": 1624989553,
        "id": "oadlcx",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "# DEAR APES,\n\nA few weeks ago I began posting on AMD. At the time, the stock was trading in the mid-70's.\n\nToday, as expected, we crossed $90 price... but our trip is just getting **STARTED**!\n\nThe deal with TESLA was announced, as well as the next AMAZING technologies in Computex, including the stacked cache for Zen3, Fidelity FX Super Resolution, the 6900 XTX Liquid Cooled, etc.\n\nThere's a very simple reason why AMD will go past the MOON and MARS: **ENTERTAINMENT**\n\nThe world revolves around entertainment and in this new era, this activity is mandatory to deal with Covid-19, the lack of international travel, work from home, etc.\n\nTESLA adopting AMD for its new Model X and S is HUGE. It will take a Navi23 and an APU (two chips) per car, likely becoming an optional for all other vehicles in the future. More automobile brands will follow, as TESLA is leading the way in the industry.\n\n&amp;#x200B;\n\n[TESLA selected AMD chips for its upcoming vehicles](https://preview.redd.it/aekg7gm3u8871.jpg?width=2243&amp;format=pjpg&amp;auto=webp&amp;s=c178f47df42b4159f92d1248ac9618a3f8440643)\n\nWith autonomous driving, gaming in a long trip will be mandatory. But even without it, the rest of the passengers can game, either with their fellow companions or online, from their car.\n\nSo, yes, the current automotive revolution will have AMD as a main supplier.\n\nThen you have consumer processing, which includes CPU's and GPU's, where AMD is dominating (mostly on the former). The Zen3 architecture is a MONSTER. Intel just cannot compete. And with the stacked cache providing up to 15% more gaming performance, that lead will continue on AMD's side.\n\nOn GPU's, AMD's Navi31 is expected to be MCM (multi-chip module), aiming to repeat AMD's success with Intel, but now against NVIDIA. \"Chiplets\" allow for economies of scale to thrive. More silicon, will less defects, better binning, cheaper... it is an AMAZING IDEA. Just add cache and the latency problem can be mitigated.\n\nOn the console gaming, AMD is the undisputed KING. They're in the PS4, PS4 Pro, PS5, Xbox model and series X/S. Also in the Aya Neo and expected in Valve's next handheld, which will be a MONSTER.\n\nOn Datacenter, AMD is groundbreaking. Epyc and the new offerings from **GOOGLE** for virtual machines is an INCREDIBLE deal. **AMAZON, TENCENT, ALIBABA, AZURE** (Microsoft), they are all buying chips from AMD. More CORES means MORE power processing, lower energy, lower licensing costs and certainly better SECURITY (as INTEL has been plagued by Spectre &amp; Meltdown issues). AMD is now expected to go from 64 cores in EPYC to 96... and also 128. That's just ludicrous, 128 CORES and 256 threads. And X86 clients are THRILLED to buy more power in a more efficient chip.\n\n[Google wants AMD Milan Epyc Chips for its Datacenter](https://preview.redd.it/36x8ygt6u8871.jpg?width=2284&amp;format=pjpg&amp;auto=webp&amp;s=1d96e3eab884218203d9fbe906b9ba3474902e13)\n\nDeals with the US Department of Energy (El Capitan), Singapore and Germany, all for public datacenters worth millions of dollars. That's just the tip of the iceberg, as private players are taking note of EPYC.\n\nLast, **but certainly NOT least: MOBILE**\n\nAMD will power Samsung's S22 flagship phone. It's GPU is expected to break records, as engineering samples already have it beating MALI and Apple's options, by **double digits**.\n\n**Samsung** is delighted and **Google** also wants AMD chips for its phones.\n\n&amp;#x200B;\n\n[Samsung wants AMD's chips for its flagship GALAXY S22](https://preview.redd.it/xu07hgobu8871.jpg?width=1919&amp;format=pjpg&amp;auto=webp&amp;s=dfea79ba818835fb83a9cb5f51d5189cf2d034e0)\n\nBut enough on the PRODUCTS. What about the fundamentals?\n\nRevenue growth is expected at 50% by the end of 2021. How many companies are growing by 50%?\n\nAnd that guidance was provided with the Q1 results in April, which were exceeding expectations. The raised the guidance from 37% to 50%... and will certainly BEAT IT.\n\nAMD is NOW a profitable company... and it literally CANNOT keep its products on shelves, as its clients are buying ALL THEIR CHIPS.\n\nAMD's valuation is $110 billion, while NVIDIA (w/slightly more revenue &amp; profit) is $500 billion.\n\nHow is NVIDIA 5 times the value of AMD???... Just because of a stock split?\n\nIt is currently trading at 38 times earnings, which if they grow by 50% in 6 months, will certainly drop.\n\nSo yeah, the stock is currently above $90 and aiming to reach its all-time high of $99 which was reached a few months ago, in January.\n\nAnalyst consensus of the stock is currently $106.54 ([https://www.tipranks.com/stocks/amd/forecast](https://www.tipranks.com/stocks/amd/forecast)) which slightly better than an 18% upside, which would take it to a mere $ 132 billion market cap.\n\nIf you ask me, AMD should be **at least HALF** of NVIDIA's $500 billion market cap.\n\nLastly, the Xilinx acquisition, which will aim to create synergies among functions (e.g. HR, Procurement, Engineering, etc.). It will also increase AMD's share of the silicon purchasing world, as TSMC will have AMD as its #2 client, only second to Apple.\n\nXilinx cancelled its dividends as its shareholders approved the merger with AMD.\n\nAMD may choose to bring dividends back after the merger... yet in the meantime, they announced a $4 Billion share buyback program. They know their stock is trading **CHEAP**.\n\n# On the positions (full disclosure): YES, I hold AMD stock.\n\nI bought $25K back in 2013, when the stock was at $2.46 (on January 18th, 2013), a bit over 10150 stocks. I saw the stock go up to $20 and sold half of it in 2018. Later, I bought back a bit (crazy ape mentality).\n\nToday, I stand with 7500 stocks. Certainly worth a couple of Lambo's, yet I drive a Nissan.\n\nIf you ask me, my next car should be a TESLA... with AMD chips (yet I'm not selling AMD).\n\nWE ALREADY PASSED THE MOON, we will pass **MARS** (Tesla) and also our **Galaxy** (Samsung).\n\n# Join me, together we will conquer the Universe!!!\n\nPack your bananas.... we're in for a journey!",
        "subreddit": "wallstreetbets",
        "title": "AMD passed the MOON and MARS... Galaxy S/22 is next!!! (hop on!)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oadlcx/amd_passed_the_moon_and_mars_galaxy_s22_is_next/",
        "created": 1625018353.0
    },
    {
        "author": "jjd1226",
        "created_utc": 1623370144,
        "id": "nx2hwi",
        "num_comments": 54,
        "num_crossposts": 3,
        "selftext": "# News Headlines:\n\n[AMD EPYC(TM) Processors Enable Next Generation of Hewlett Packard Enterprise Storage](https://www.barchart.com/story/news/1860574/amd-epyctm-processors-enable-next-generation-of-hewlett-packard-enterprise-storage) \n\nGlobeNewswire - Thu Jun 10, 8:00AM CDT\n\n[New AMD Radeon PRO W6000 Series Workstation Graphics with AMD RDNA 2 Architecture and Massive 32GB of Memory to Power Demanding Architectural, Design and Media Workloads](https://www.barchart.com/story/news/1843517/new-amd-radeon-pro-w6000-series-workstation-graphics-with-amd-rdna-2-architecture-and-massive-32gb-of-memory-to-power-demanding-architectural-design-and-media-workloads)\n\nGlobeNewswire - Tue Jun 8, 8:00AM CDT\n\n[IoT Chips Market is Estimated to Reach USD 531.80 Billion by 2026 With Registering Growth of 5.9% CAGR | Market Research Future](https://www.barchart.com/story/news/1841144/iot-chips-market-is-estimated-to-reach-usd-53180-billion-by-2026-with-registering-growth-of-59-cagr-market-research-future)\n\nGlobeNewswire - Tue Jun 8, 2:51AM CDT\n\n# SG:\n\n* Look for support at 80 - key gamma strike\n* Pivot @ 84\n\nhttps://preview.redd.it/ry97212f2j471.png?width=3072&amp;format=png&amp;auto=webp&amp;s=66738d04dba54432724b392c9edd7821840f5288\n\n# Analysts Ratings:\n\nhttps://preview.redd.it/imy8naa6xi471.png?width=1852&amp;format=png&amp;auto=webp&amp;s=074cd64ee62d2d5de0a510b2e3aa0be4682ef566\n\n# Put/Call Ratio:\n\nPut Volume Total: 185,711\n\nCall Volume Total: 318,890\n\nPut/Call Volume Ratio: 0.58\n\nPut Open Interest Total: 1,883,774\n\nCall Open Interest Total: 1,948,670\n\nPut/Call Open Interest Ratio: 0.97\n\nhttps://preview.redd.it/7los3sidxi471.png?width=1846&amp;format=png&amp;auto=webp&amp;s=6f0eea20e545707a2788d1fbeb9db94936786f15\n\n# TA Notes June (26)\n\n* Found support at 20 MA\n* 🐂  🎯 -  - 86.36 🔑  - 88.28 - 89.61 - 91.25 - 94\n* 🐻  🎯  - - 78 - 76.28 - 75.15 - 72.61\n* Range - 83 - 79.10\n\nhttps://preview.redd.it/skk22dzawi471.png?width=2998&amp;format=png&amp;auto=webp&amp;s=11d30a95a8b74cc3518844d00e846ad4ab929ae6\n\n1D MACD\n\n* Lower High (bullish)\n\nhttps://preview.redd.it/rekfg3pgwi471.png?width=2998&amp;format=png&amp;auto=webp&amp;s=732cf92cdbcf00a25f558b318bd49a0a31f6fe1a\n\n1D RSI\n\n* Lower high (bullish)\n\nhttps://preview.redd.it/g23w8c5sxi471.png?width=2998&amp;format=png&amp;auto=webp&amp;s=d324150390b4c462bba50d46334ba78810a816c5\n\n# Whale View\n\nhttps://preview.redd.it/qid55rp2vi471.png?width=1916&amp;format=png&amp;auto=webp&amp;s=9c0afe4622ed169cc06bc87390c870ce1c9f1dd6\n\n# Historical Volume\n\nhttps://preview.redd.it/y6n4kiw6vi471.png?width=1664&amp;format=png&amp;auto=webp&amp;s=0066fb6169981c91068bdd2b7c370a598f28ca00\n\n# Positions\n\nhttps://preview.redd.it/510u6rdy2j471.png?width=1016&amp;format=png&amp;auto=webp&amp;s=e7d04c483054b85c7dc897f0576bcf947cedb136\n\nThanks for reading,\n\n🌝The NightMan Charteth 🖍",
        "subreddit": "wallstreetbets",
        "title": "MAD about AMD - TA DD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nx2hwi/mad_about_amd_ta_dd/",
        "created": 1623398944.0
    },
    {
        "author": "XSoothSingerX",
        "created_utc": 1623705694,
        "id": "nzxdo6",
        "num_comments": 53,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "1mil+ YOLO Update ($ZM, $AMD, $CRSR) - 2021-06-14",
        "url": "https://i.redd.it/z2t7vkc5ta571.jpg",
        "created": 1623734494.0
    },
    {
        "author": "kozzmo1",
        "created_utc": 1622744739,
        "id": "nrk9v6",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "Hey everyone! I’m 26 and all my life my dad has been telling me I should diversify and buy good stocks in different sectors. However looking at my YTD profits I’m sitting at only 2% gain. Looking at switching to index funds because a lot of them throw off an okay dividend as well as gaining a lot more than 2% wanted to know peoples thoughts on my portfolio and what I might be able to differently. I’ve been told owning a stock is like owning a company and if you cannot spend the time to research every company and keep up with it, index funds are the best choice. \n\nHere are my stocks:\nMMM \nAMD \nAMZN \nAAPL \nCVX \nCMCSA \nD \nHD \nHON \nINTC\nJNJ\nKMB\nLMT\nNKE\nPEP\nQCOM\nKO\nV\nDIS\nPLTR\nMP \n\nPlease let me know what you think. I think overall it’s a pretty diversified portfolio, a bit tech heavy, I know. Any suggestions please let me know, thank you!",
        "subreddit": "investing",
        "title": "Thinking about switching to index funds",
        "url": "https://www.reddit.com/r/investing/comments/nrk9v6/thinking_about_switching_to_index_funds/",
        "created": 1622773539.0
    },
    {
        "author": "ThicccMass",
        "created_utc": 1624400473,
        "id": "o5yvem",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "Anyone else mimic the massive buy calls bought yesterday and today for July 16th at 90 strike.\n\nI read a decent DD on wsb and decided to buy 30 calls. Some serious money was dumped into that specific option.\n\nI'm hoping the pros no something the rest of us don't and I'm copying them.",
        "subreddit": "options",
        "title": "AMD calls",
        "url": "https://www.reddit.com/r/options/comments/o5yvem/amd_calls/",
        "created": 1624429273.0
    },
    {
        "author": "GemelosAvitia",
        "created_utc": 1624806616,
        "id": "o8ywz4",
        "num_comments": 51,
        "num_crossposts": 0,
        "selftext": "Despite the gloom and doom the news would have you believe, droves of people are not in fact leaving California and not only did the Golden State weather the storm of Covid better than many expected but [its economy is booming](https://www.bloomberg.com/opinion/articles/2021-06-14/california-defies-doom-with-no-1-u-s-economy?fbclid=IwAR3oNdnYcTqZcmkSt7YWCM-_TrK-dSW1DrspVW_gFtsUkuHHyhiYHAjHlzw). Anchored by three global powerhouses in entertainment, agriculture, and tech (SoCal, Central Valley, Bay Area) here are my top 10 stock picks in no particular order for long-term growth from the best state in the Union:\n\n1. Marrone Bio Innovations (MBII, agriculture)\n2. Arcadia Biosciences (RKDA, agriculture)\n3. KB Home (KBH, construction)\n4. Advanced Micro Devices (AMD, semiconductor)\n5. Bloom Energy (BE, alternative energy)\n6. El Pollo Loco Holdings (LOCO, delicious chicken)\n7. Immersion Corporation (IMMR, technology)\n8. Roblox Corporation (RBLX, online gaming)\n9. Wildan Group (WLDN, civil engineering/consulting)\n10. Synnex Corporation (SNX, information technology)\n\nDisclosure, have positions in all of them and from Los Angeles so might be a bit biased... Also, please note that while my choices are based on DD that draws upon my education background in Materials Science Engineering and current employment as a software engineer in Silicon Beach, this is not financial advice lol",
        "subreddit": "stocks",
        "title": "Investing in California (My Top 10)",
        "url": "https://www.reddit.com/r/stocks/comments/o8ywz4/investing_in_california_my_top_10/",
        "created": 1624835416.0
    },
    {
        "author": "Bouvill",
        "created_utc": 1624344700,
        "id": "o5gnf5",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "Recently I've started to be interested in AMD. First of all, I'm not qualified to give any financial advices, I'm just here to share a few facts, that makes me believe AMD could start to rise before July. It reached this week more than 85$ (after Google announced it was working with AMD for Google's Cloud computing which was huge news), and went back to 82,6$ after a dip that hit both AMD and NVDA. \n\nHere is different articles I found that seem to show that this dip could be an opportunity before a rise : \n\nhttps://www.notebookcheck.net/Exynos-with-AMD-mRDNA-2-to-be-unveiled-in-July-peak-performance-better-than-next-gen-Mali-GPU-while-beating-latest-Mali-even-with-30-throttling-Google-signing-up-for-mRDNA-2-as-well.546822.0.html --&gt; it has been public knowledge for sometime now that Samsung and AMD are working on a mobile GPU, but official announcement should be next month, AND, as mentionned in the article, Google could also use AMD's RDN2 tech for something in short term (Google Pixel?). Concerning Google, this is the third time that I see this rumor. \n\nhttps://www.thestreet.com/investing/amd-no-ec-objection-to-xilinx-merger --&gt; for the moment the acquisition of Xilinx seems to go well \n\nhttps://www.neowin.net/news/amds-next-gen-rdna-3-performance-jump-rumored-to-be-absolutely-insane/ --&gt; some good news about 2022's GPU \n\nI think next earning release is on 07/27/2021 ; we should see good things there. \n\nThere are also the Xbox/PS5 that are a huge success and based on AMD's GPU ; Microsoft and Sony will keep buying tons of AMD's GPU (maybe more than expected originally).\n\nIt's my point of view but, to invest in mid-term, it looks good. \n\nHave fun today!",
        "subreddit": "wallstreetbets",
        "title": "Good feeling about AMD",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o5gnf5/good_feeling_about_amd/",
        "created": 1624373500.0
    },
    {
        "author": "Wojofoo",
        "created_utc": 1623183670,
        "id": "nvdeg7",
        "num_comments": 50,
        "num_crossposts": 0,
        "selftext": "AMD's stock price hasn't moved in over 10 months despite the following events occurring:\n\n1. Massive ER beat \n2. Continued semi shortage \n3. 93% YOY revenue increase last quarter\n4. 4 billion stock buyback \n5. 67% YOY projected growth\n6. Several price upgrades\n7. Perlmutter Supercomputer win\n8. National Supercomputing Centre Singapore win\n9. Tesla partnership (+ news of TSLA replacing Nvdia GPUs with AMD ones)\n10. AMD Radeon RX 6000M Series Mobile Graphics Release\n11. Radeon PRO W6800 workstation release\n12. Introduction of 3d stacked dies\n\nI don't care how much \"arbitrage\" people want to preach, there is absolutely no reason this stock is struggling to barely hold $80 dollars. If this \"arbitrage\" is the sole reason for stock suppression, is AMD going to shoot up 100%+ the day the merger completes? \n\n&amp;#x200B;\n\nMakes no sense.",
        "subreddit": "wallstreetbets",
        "title": "Recent AMD feats vs stock price",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nvdeg7/recent_amd_feats_vs_stock_price/",
        "created": 1623212470.0
    },
    {
        "author": "third_legatron",
        "created_utc": 1623811202,
        "id": "o0ut7u",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Based on the companies PEG ratio it seems that lam research is in a very unique place when it comes to forward earnings regarding the semi space. The stock continues to be undervalued relative to peers. \n\nI am not big into tech at all. I do own shares on nvidia, AMD, and lam research as of now. Amd and lam have relatively low PEG ratios for stocks expecting the growth that they do and I believe it represents a clear buying opportunity. I understand that lam research has done extremely well this year due to the semiconductor shortage, but I still believe being long lam is a smart move. \n\nI bought lam at $500 with the intention of averaging down and have not had the chance. I will not average up on these names as of now, since I do like my cost basis. But I do believe these names have room to run.\n\nNvidia is an exception I will live with because they do just destroy every expectation set and are a leader in many of their industries. I see their PEG of 3.1 as sustainable and wanted to own them pre-split. I also sold bull put spreads because I believe the case for Nvidia is unique. \n\nThe tech industry is flush with buying opportunities, although I wouldn't necessarily go all in on at a given time, I would put 25% on intended capitol to work and leave cash on the side to play the average as the stock moves. With the inflation and interest theme playing out, I feel there will be more buying opportunities, but I also want skin in the game. I stick to big tech and companies that can handle interest rates rising. \n\nI wouldn't go long on a semi ETF at this point, but I would like some money in the game.\n\nEdit: Qualcomm should be on this list, but I do not follow them. They are great.",
        "subreddit": "stocks",
        "title": "Lam research in value growth territory, other tech stocks.",
        "url": "https://www.reddit.com/r/stocks/comments/o0ut7u/lam_research_in_value_growth_territory_other_tech/",
        "created": 1623840002.0
    },
    {
        "author": "InvestorCowboy",
        "created_utc": 1624367182,
        "id": "o5mqai",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "Before we get started I want to point out that this list is ordered by highest-lowest market value. This pie chart only accounts for 35.67% of all JPMorgan &amp; Chase Holdings. Enjoy!\n\n[https://imgur.com/IhZeXw8](https://imgur.com/IhZeXw8)\n\n**1. Spdr s&amp;p 500 ETF trust (SPY)**\n\n* Avg. Price- $190.64\n* Recent Price- $414.92\n* Percent Change- 118%\n* Market Value- $25,763,609,000\n\n**2. Microsoft (MSFT)**\n\n* Avg. Price- $62.15\n* Recent Price- $259.43\n* Percent Change- 317%\n* Market Value- $18,503,462,000\n\n**3. Apple (AAPL)**\n\n* Avg. Price- $31.47\n* Recent Price- $130.46\n* Percent Change- 315%\n* Market Value- $15,564,508,000\n\n**4.** **Amazon (AMZN)**\n\n* Avg. Price- $856.52\n* Recent Price- $3486.90\n* Percent Change- 307%\n* Market Value- $13,490,249,000\n\n**5. Alphabet class c (GOOG)**\n\n* Avg. Price- $967.22\n* Recent Price- $2511.35\n* Percent Change- 160%\n* Market Value- $7,434,896,000\n\n**6. Vanguard total international bond ETF (BNDX)**\n\n* Avg. Price- $56.57\n* Recent Price- $57.08\n* Percent Change- 1%\n* Market Value- $7,305,267,000\n\n**7. JPMorgan Betabuilders Japan ETF (BBJP)**\n\n* Avg. Price- $31.73\n* Recent Price- $56.26\n* Percent Change- 77%\n* Market Value- $6,861,552,000\n\n**8. Alphabet class a (GOOGL)**\n\n* Avg. Price- $780.76\n* Recent Price- $2402.22\n* Percent Change- 208%\n* Market Value- $6,860,923,000\n\n**9. Facebook (FB)**\n\n* Avg. Price- $173.07\n* Recent Price- $329.66\n* Percent Change- 90%\n* Market Value- $6,394,110,000\n\n**10. Mastercard (MA)**\n\n* Avg. Price- $147.62\n* Recent Price- $367.42\n* Percent Change- 149%\n* Market Value- $6,344,492,000\n\n**11. Spdr s&amp;p 500 etf trust (SPY)**\n\n* Avg. Price- N/A\n* Recent Price- $414.92\n* Percent Change- N/A\n* Market Value- $5,653,489,000\n\n**12. Ishares core msci emerging markets ETF (IEMG)**\n\n* Avg. Price- $59.80\n* Recent Price- $65.82\n* Percent Change- 10%\n* Market Value- $5,556,598,000\n\n**13. Unitedhealth group (UNH)**\n\n* Avg. Price- $113.40\n* Recent Price- $389.37\n* Percent Change- 243%\n* Market Value- $5,709,686,000\n\n**14. Analog Devices (ADI)**\n\n* Avg. Price- $95.69\n* Recent Price- $162.19\n* Percent Change- 69%\n* Market Value- $4,917,817,000\n\n**15. Bristol-Myers squibb (BMY)**\n\n* Avg. Price- $55.42\n* Recent Price- $66.47\n* Percent Change- 20%\n* Market Value- $4,800,590,000\n\n**16. Ishares russell 2000 ETF (IWM)**\n\n* Avg. Price- N/A\n* Recent Price- $223.13\n* Percent Change- N/A\n* Market Value- $4,655,178,000\n\n**17. Norfolk Southern corp. (NSC)**\n\n* Avg. Price- $154.01\n* Recent Price- $261.43\n* Percent Change- 70%\n* Market Value- $4,615,737,000\n\n**18. NextEra Energy (NEE)**\n\n* Avg. Price- $37.44\n* Recent Price- $73.28\n* Percent Change- 96%\n* Market Value- $4,507,793,000\n\n**19. JPMorgan Betabuilders Canada ETF (BBCA)**\n\n* Avg. Price- $24.92\n* Recent Price- $64.44\n* Percent Change- 159%\n* Market Value- $4,458,999,000\n\n**20. Texas Instruments (TXN)**\n\n* Avg. Price- $80.79\n* Recent Price- $183.07\n* Percent Change- 127%\n* Market Value- $4,328,393,000\n\n**21. Tesla (TSLA)**\n\n* Avg. Price- $81.72\n* Recent Price- $623.31\n* Percent Change- 663%\n* Market Value- $4,289,987,000\n\n**22. Taiwan Semiconductor Manufacturing (TSM)**\n\n* Avg. Price- $24.90\n* Recent Price- $115.79\n* Percent Change- 365%\n* Market Value- $4,272,595,000\n\n**23. Morgan stanley (MS)**\n\n* Avg. Price- $35.34\n* Recent Price- $84.09\n* Percent Change- 138%\n* Market Value- $4,270,668,000\n\n**24. Johnson &amp; Johnson (JNJ)**\n\n* Avg. Price- $119.06\n* Recent Price- $161.98\n* Percent Change- 36%\n* Market Value- $4,241,674,000\n\n**25. Bank of America Corp (BAC)**\n\n* Avg. Price- $19.18\n* Recent Price- $38.78\n* Percent Change- 102%\n* Market Value- $4,092,796,000\n\n**26. JPMorgan Betabuilders Europe ETF (BBEU)**\n\n* Avg. Price- $30.92\n* Recent Price- $58.84\n* Percent Change- 90%\n* Market Value- $4,023,287,000\n\n**27. Comcast corp. class a (CMCSA)**\n\n* Avg. Price- $26.83\n* Recent Price- $56.71\n* Percent Change- 111%\n* Market Value- $3,843,447,000\n\n**28. Ishares core s&amp;p 500 etf (IVV)**\n\n* Avg. Price- $235.51\n* Recent Price- $416.77\n* Percent Change- 77%\n* Market Value- $3,643,204,000\n\n**29.** **Abbvie inc (AABV)**\n\n* Avg. Price- $86.28\n* Recent Price- $113.12\n* Percent Change- 31%\n* Market Value- $3,643,204,000\n\n**30. Invesco qqq trust series 1 (QQQ)**\n\n* Avg. Price- N/A\n* Recent Price- $342.63\n* Percent Change- N/A\n* Market Value- $3,631,955,000\n\n**31. Coca-Cola (KO)**\n\n* Avg. Price- $46.26\n* Recent Price- $53.77\n* Percent Change- 16%\n* Market Value- $3,592,220,000\n\n**32. Paypal (PYPL)**\n\n* Avg. Price- $71.64\n* Recent Price- $283.38\n* Percent Change- 296%\n* Market Value- $3,589,820,000\n\n**33. Deere (DE)**\n\n* Avg. Price- $247.75\n* Recent Price- $328.97\n* Percent Change- 33%\n* Market Value- $3,558,885,000\n\n**34. Eaton corp (ETN)**\n\n* Avg. Price- $86.19\n* Recent Price- $139.26\n* Percent Change- 62%\n* Market Value- $3,512,302,000\n\n**35. JPMorgan Betabuilders Developed Asia ex- (BBAX)**\n\n* Avg. Price- $40.69\n* Recent Price- $58.75\n* Percent Change- 44%\n* Market Value- $3,509,512,000\n\n**36. Sea ltd adr (SE)**\n\n* Avg. Price- $76.18\n* Recent Price- $282.49\n* Percent Change- 271%\n* Market Value- $3,452,978,000\n\n**37. Home Depot (HD)**\n\n* Avg. Price- $62.05\n* Recent Price- $302.61\n* Percent Change- 388%\n* Market Value- $3,323,997,000\n\n**38. Ishares s&amp;p 500 growth etf (IVW)**\n\n* Avg. Price- $40.07\n* Recent Price- $70.2\n* Percent Change- 75%\n* Market Value- $3,317,658,000\n\n**39. Lilly (eli) &amp; co. (LLY)**\n\n* Avg. Price- $105.04\n* Recent Price- $218.55\n* Percent Change- 108%\n* Market Value- $3,238,117,000\n\n**40. Lam research corp. (LRCX)**\n\n* Avg. Price- $274.99\n* Recent Price- $612.66\n* Percent Change- 123%\n* Market Value- $3,222,065,000\n\n**41. Spdr gold trust (GLD)**\n\n* Avg. Price- N/A\n* Recent Price- $164.93\n* Percent Change- N/A\n* Market Value- $3,173,270,000\n\n**42. Truist financial corp (TFC)**\n\n* Avg. Price- $46.96\n* Recent Price- $52.81\n* Percent Change- 12%\n* Market Value- $3,158,514,000\n\n**43. JPMorgan Betabuilders International Equity ETF (BBIN)**\n\n* Avg. Price- $49.06\n* Recent Price- $60.15\n* Percent Change- 23%\n* Market Value- $3,148,449,000\n\n**44. Prologis inc. (PLD)**\n\n* Avg. Price- $70.57\n* Recent Price- $119.57\n* Percent Change- 69%\n* Market Value- $3,148,128,000\n\n**45. Ishares s&amp;p 500 value etf (IVE)**\n\n* Avg. Price- $97.89\n* Recent Price- $143.60\n* Percent Change- 47%\n* Market Value- $3,015,853,000\n\n**46. Mercadolibre inc (MELI)**\n\n* Avg. Price- $353.59\n* Recent Price- $1468.06\n* Percent Change- 315%\n* Market Value- $2,849,856,000\n\n**47.** **Raytheon Technologies (RTX)**\n\n* Avg. Price- $60.34\n* Recent Price- $85.92\n* Percent Change- 42%\n* Market Value- $2,820,592,000\n\n**48. Mcdonalds (MCD)**\n\n* Avg. Price- $180.00\n* Recent Price- $229.62\n* Percent Change- 28%\n* Market Value- $2,813,426,000\n\n**49. Advanced Micro Devices (AMD)**\n\n* Avg. Price- $36.29\n* Recent Price- $84.65\n* Percent Change- 133%\n* Market Value- $2,811,108,000\n\n**50. Cigna (CI)**\n\n* Avg. Price- $167.31\n* Recent Price- $231.97\n* Percent Change- 39%\n* Market Value- $2,809,706,000\n\n&amp;#x200B;\n\n**Make sure to check in tomorrow for our next Bank of the Day Analysis!!**\n\n**We'll compare all the banks side by side at the end of the week!**\n\n&amp;#x200B;\n\n*Made using Microsoft Excel*\n\n*\\*\\*This is not investment advice\\*\\**\n\n*\\*\\*Do your own research\\*\\**",
        "subreddit": "investing",
        "title": "JPMorgan Chase Top 50 Holdings",
        "url": "https://www.reddit.com/r/investing/comments/o5mqai/jpmorgan_chase_top_50_holdings/",
        "created": 1624395982.0
    },
    {
        "author": "tatuartist",
        "created_utc": 1624611039,
        "id": "o7jt1j",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "I bought AMD stock but also thinking about buying Nvidia. I went with amd because (simplified explanation) the much lower price felt there was more chance at a greater gain. The company CPUs and graphics are highly rated gamers and tech use of them on the rise. With Nvidia I wasn't sure if i'd make a large gain as quickly and the amount of stock in comparison to amd I could comfortably buy. Also very new to stocks been reading and studying them only for 2-3 months so please don't be to harsh trying to setup a decent retirement fund. Being an artist we usually don't have a retirement.",
        "subreddit": "stocks",
        "title": "Amd / Nvidia stocks.",
        "url": "https://www.reddit.com/r/stocks/comments/o7jt1j/amd_nvidia_stocks/",
        "created": 1624639839.0
    },
    {
        "author": "darkfiber-",
        "created_utc": 1623342867,
        "id": "nws042",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "AMD is the best run simi company in the world right now.\n\n[Su Bae](https://i.redd.it/dvg5sf39rg471.gif)\n\nAMD stock is being held down by Arbitrage trading due to the all-stock fixed-ratio Xilinx acquisition. Once that acquisition is approved by world regulators, arbitrage will stop and the stock will soar. Note that the acquisition doesn't have to close, it just needs to be approved for the Arbitrage to stop. Once Arbitrage stops, all of the short selling which is holding AMD stock down will stop, and AMD will rocket towards it's price targets between $106-135\n\n**Arbitrage effect on stocks**  \n In an all-stock fixed ratio merger, the hedge fund playbook is to short sell the acquiring stock, AMD, and buy the stock being acquired, XLNX. For example, they will short 1M AMD stock and buy 580k XLNX stock. They will then hold these positions until the acquisition closes, where the 580k XLNX turns into 1M AMD and then they cover their short position, pocketing the price difference. The short selling pushes the price of AMD down, continually, until the arbitrage stops. \n\nRead more on AMD Merger Arbitrage here: [https://www.reddit.com/r/wallstreetbets/comments/n4r47g/amd\\_an\\_explanation\\_on\\_merger\\_arbitrage\\_and\\_how\\_to/](https://www.reddit.com/r/wallstreetbets/comments/n4r47g/amd_an_explanation_on_merger_arbitrage_and_how_to/)\n\nArbitrage will end when the share ratio between XLNX stock and AMD stock is equal, where there's no difference to be gained. Right now the share ratio difference is \\~1.57 or about 10%. The 10% difference is there for the chance that the acquisition does not go through. Once world regulators approve it though, the chance of acquisition is basically 100% and the share ratio difference will be 0. With no difference, the arbitrage trading and short selling stops and the stock rises. In the case of AMD, the average price target is some 30% over today's prices, so it should rocket.\n\n[https:\\/\\/public.tableau.com\\/app\\/profile\\/upndown\\/viz\\/XilinxAMDSharePriceRatio\\_16114624177710\\/XilinxAMDSharePriceRatio](https://preview.redd.it/gr9sro1mqg471.png?width=1002&amp;format=png&amp;auto=webp&amp;s=2fc21af702904945f5aa76ae8d7d85c1be4c3a84)\n\n**Possibility of Arbitrage ending soon**  \nCEO Dr. Lisa Su has said many times that the acquisition will close by the end of the year. She's also always conservative in her estimates. Remember that she said revenue would increase by 37% in 2021, only to revise it in Q2 to 50% growth. Su, you sly.\n\n&amp;#x200B;\n\nhttps://i.redd.it/ligcuvdksg471.gif\n\nYou can track the regulatory approval status over here: [https://www.reddit.com/r/AMD\\_Stock/comments/n9xnu2/regulatory\\_approval\\_status/](https://www.reddit.com/r/AMD_Stock/comments/n9xnu2/regulatory_approval_status/)\n\nThe US has already approved and Phase 1 of the approval process for the UK and EU will end on July 6th. If there are no objections, the acquisition is approved from them as well. There are not expected to be any objections. If there were any, they would go into Phase 2, which would end at the end of the year (Lisa's conservative timeline).\n\nThe big question is when will China approve? They're the last ones to give the approval. Well no one really knows when this is going to happen. In Oct. of 2020 AMD said they would be drafting a notification to SAMR (China). But that's really the last we heard of it. \n\nThere's a possibility that China will approve around the same time as the UK and EU, which could be as soon as July 6th. In that case,\n\n[butts](https://preview.redd.it/wsr44v9qlg471.png?width=700&amp;format=png&amp;auto=webp&amp;s=92b9ec2b60f88b9b5443895e00486e98edfa63ef)\n\nAMD announced on May 19th that it was initiating a $4B stock buyback. And since then it appears that AMD has been buying back it's own stock in big chunks every day around 9:30-10am:\n\n[perdy](https://preview.redd.it/1cmdiz4fng471.png?width=538&amp;format=png&amp;auto=webp&amp;s=b1e1174f74f52798ea863caab6172b972d0698b6)\n\nThe doctor is smart. She knows the arb is keeping the stock down and aims to profit from it. The timing of the buyback may suggest that she thinks the approval is going to happen sooner than the end of the year. \n\nEither way, the stock will rocket once the approval happens. Could be in less than a month, if not, then it'll be end of year. Either way we're making tendies, it's just a matter of how soon. Place your bets! (not financial advice)\n\nhttps://i.redd.it/e5f3tvr1sg471.gif\n\nPositions: YOLO $50k in AMD stock and call options spread from June 2021 to June 2022",
        "subreddit": "wallstreetbets",
        "title": "AMD will Rocket after the Xilinx acquisition is approved, which could be as soon as July 6th",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nws042/amd_will_rocket_after_the_xilinx_acquisition_is/",
        "created": 1623371667.0
    },
    {
        "author": "Fuck_My_Tit",
        "created_utc": 1623545272,
        "id": "nyl0bv",
        "num_comments": 47,
        "num_crossposts": 0,
        "selftext": "I've seen a few other CRSR DD's here lately and wanted to add my own. Corsair likely needs little introduction these days, as their computer components find their way into a huge and increasing number of PC builds. Fans, radiators, keyboards, etc. Their products are great and the way the company is managed is just as good.\n\nThere is unfortunately not much long term data available on the company, as they only recently went public with an IPO in September 2020, when it [debuted at $15 a share](https://www.cnn.com/2020/09/23/tech/corsair-ipo-ceo-interview/index.html). However I will do my best to analyze all the data about the company since then to prove Corsair has a great valuation as it currently sits at \\~$32 a share.\n\nAs the above link states, Corsair had a revenue of 1.3 Billion ending in June 2020. Even through the first waves of the pandemic, with closures of factories everywhere, Corsair still managed to rake in cash, which they continue to do so. Using TD Ameritrade's platform thinkorswim, we can see revenue has still been growing since then, massively too. \n\n**Financials**\n\n[TDA's Fundamentals on CRSR](https://preview.redd.it/nevpo4l6zw471.png?width=1595&amp;format=png&amp;auto=webp&amp;s=a1b53934b0273547dee788d0e07b7a98c259fa57)\n\nThere's alot to take in right there, but lets analyze their fundamentals.\n\n* Revenue growth was estimated at 65.75%. For a company to see that much revenue growth during a time that production facilities across the world are shutting down is nothing short of amazing. And that's not all for growth during Covid.\n* Earnings Per Share in the last twelve months is at $1.59, pretty good. What's even better is that this is a 108% increase in the EPS of last year.\n* Book Value Per Share rose similarly, with a yearly increase of 50.39%, bringing it up to $4.76 BVPS.\n* Gross and Net Profit Margins saw in increases of 30.76% and 112.62%, respectively.\n* At the same time, the Debt to Capital ratio dropped through the floor, falling 65.03% to strengthen the company's balance sheet.\n* Financial Leverage decreased by 62.71%, showing their effort in paying off loans on assets.\n\nAs for valuation, Corsair's P/E ratio, the most well known valuation ratio, is at 19.606. Relatively high, but most value investors consider a P/E below 20 to be the range for a decent value stock. On the other hand, P/C and P/B are at 21.299 and 6.2857, higher than desired for value stock considerations. While the P/C and P/B can be used as a counterargument to my thesis, I am willing to overlook these numbers because Corsair's massive growth during a global pandemic highlights that this company can be considered undervalued and a growth stock candidate.\n\nAdditionally, Corsair has nearly [doubled expected earnings](https://www.nasdaq.com/market-activity/stocks/crsr/earnings) in 2 of the last three quarters. The numbers are as follows:\n\n* Q3, 2020: Expected earnings of .26, actual was .52\n* Q4, 2020: Expected earnings of .56, actual was .52\n* Q1, 2021: Expected earnings of .34, actual was .56\n\nThis indicates Corsair's consistent results, with analysts underestimating the company's potential.\n\nNow, lets look at a chart of CRSR.\n\n**Previous 12 Months**\n\n[Flat as a pancake](https://preview.redd.it/1sfmzvua9x471.png?width=1609&amp;format=png&amp;auto=webp&amp;s=c243c5ead1888e7339ca7829b2e786764da180ca)\n\nNow, I'm not personally one for technical analysis. I won't go in depth here, but anyone can see that in the last several months, the stock price has barely moved. down from a high of $51.37 per share in November 2020, it has settled at a stable \\~$32 per share, rarely deviating more than a dollar in either direction. Part of this is because of the low volume in recent months. Since March 2021, volume has never gone below 500,000 and never above 4.8 million, with the 4.8 milllion figure being a significant outlier. In the past, Corsair has seen much stronger buy volume and can rise in price quickly, going from its IPO price of $15 in September 2020 to its ATH of $51.37 only two months later.\n\nWhy is this important? A stable stock price means low Implied Volatility. Low Implied Volatility means cheap options. IV is currently at 56.7%, and any increase in stock price above its resistance of $33 will see an increase in the price of all options. ATM weeklies can be as cheap as a $.37 premium per share for calls. LEAPS aren't terribly expensive either, although open interest on long term options is currently low.\n\n**Looking Forward**\n\nAll this already sounds like a great investment, but as I previously mentioned multiple times, these numbers put up by Corsair were all during the Covid pandemic and it's factory shutdowns. As anyone who has tried to build a PC recently will know, semiconductor prices are through the roof currently because of [low supply](https://www2.deloitte.com/us/en/insights/industry/technology/semiconductor-supply-shortage.html). GPU and CPU production is extremely slow right now, but just starting to pick up steam. Over the past year, [scalpers](https://www.pcmag.com/news/scalpers-have-sold-50000-nvidia-rtx-3000-gpus-through-ebay-stockx) have strangled the computer chip market and alot of people are straight up refusing to pay for these inflated prices. Once production is back in full force and consumers are building more PC's, peripheral sales will spike alongside them. This is where Corsair comes in. If they can put up spectacular growth numbers while a large part of the market sits and waits for prices on critical components goes down, think about what will happen when new AMD chips and NVIDIA graphics cards are being pumped out at breakneck paces, which will soon happen as vaccines are now allowing non essential businesses to ramp up production once again. Most analysts place the [price target](https://www.marketbeat.com/stocks/NASDAQ/CRSR/price-target/) around $50, showing its strong upside.\n\n**Conclusion**\n\nCorsair is currently showing signs of both a good value investment and growth stock. They demonstrate a decent P/E ratio and increases in EPS, BVPS, revenue, and profit margin, alongside decreases in Debt to Capital ratio and Financial Leverage. The stock price is currently very steady at \\~$32 a share, resulting in low IV and cheap options. As the semiconductor market warms back up as Covid subsides, Corsair sales will increase even more as more people build PC's with Corsair cases, mouses, power supplies, etc.\n\n*Current Positions: 30 shares at $33.73, 20 Aug 21 35C. I plan on buying more shares and options.*\n\n*This is not financial advice. Do your own research.*",
        "subreddit": "wallstreetbets",
        "title": "CRSR - Mid term value and growth play with great upside and little downside",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nyl0bv/crsr_mid_term_value_and_growth_play_with_great/",
        "created": 1623574072.0
    },
    {
        "author": "monodactyl",
        "created_utc": 1624385893,
        "id": "o5tjx2",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "While current meme stocks have all the limelight. I was hoping for a trip down memory lane to look at the meme stocks of yesteryear and to see how they are today.\n\nI'm particularly trying to recall tickers that didn't pan out, not short term fails like \"guh\" and \"box spreads\"\n\nJNUG is the only one I can recall that really fizzled out. Everything else I can recall did okay, like PRPL, AMD, NVDA, even Hertz if you're comparing at the time the hype to today. But maybe I'm just really remembering the survivors and forgetting those that faded away.\n\nAnyone else recalls big ideas that took over the sub and fizzled out?",
        "subreddit": "wallstreetbets",
        "title": "Do you guys remember the meme stocks of a the past?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o5tjx2/do_you_guys_remember_the_meme_stocks_of_a_the_past/",
        "created": 1624414693.0
    },
    {
        "author": "namantejaswi",
        "created_utc": 1624304070,
        "id": "o53f8r",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "Intel is currently trading in the mid 50's at a pe ratio of 12.5,  intel is a matured company and no one is looking for a multibagger here and recently it has lost ground to Amd in the consumer cpu market. Now semiconductor shortages has hit everyone hard and won't be reasonable to expect quick turnarounds.\n\nBut the thing is there are not many players in the market and there is no technological threat, the infrastructure and research requirements to even make a cpu, set the entry barrier pretty high but this has breed incompetence at intel  imo. \n\nNow Intel processors are still at least competitive unlike the past years when amd was beaten to the ground by intel. Now this could be the beginning of the downward road for intel if it can't compete with next few launches  but as of today it is simply lagging behind a bit.\n\nNow intel has had a shaddy / unethical reputation with regards to going to extreme ways to win market share, such as designing to perform on specific benchmarks, poaching competitive talent and anti competitive policies and perhaps is not the best place to work. Current management may also be dragging the stock's perceived value, when you look at Lisa su she has been a revelation at amd. \n\nTalking about the stock it also pays a decent dividend, but paying such amounts of dividend when the company has such a huge debt is questionable. Like why won't there be much better use of the money being paid? Also the interest will pile on like this makes no sense?\n\nI think a structural change at intel is the one thing which can revive the stock and the company else amd might do what intel once did to amd, kinda what goes around comes around. What's your take?\n\n&amp;#x200B;\n\nNote: Personally I would go no where close to an intel cpu to build a pc/ gaming laptop, perhaps this is the jist which the price reflects.",
        "subreddit": "stocks",
        "title": "What's up with Intel?",
        "url": "https://www.reddit.com/r/stocks/comments/o53f8r/whats_up_with_intel/",
        "created": 1624332870.0
    },
    {
        "author": "BIGYOUBS",
        "created_utc": 1624395288,
        "id": "o5x1ut",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "Hello, fellow apes. This sub has been bringing up one of my favorite stocks right now, **CRSR**, which although undervalued by almost any metric (the street target is sitting at about $47 - right above ATH and 50% upside) yet has been trading flat in the low 30s range. I want to talk about why it stayed so steady, why this makes it the PERFECT opportunity for entry (especially on leaps- low IV on the contracts, but short-term theta is a killer).  \n\n&amp;#x200B;\n\n**Background:** Since CRSR IPO'd in 2020, it has done nothing but surprise investors. Posting its first profitable year, increasing revenues, and paying off debt. Not to mention they threw a few acquisitions in there to further diversify the business. Originally investors were amazed, which caused over a 200% rally in share price. \n\n**Why it's Flat:** Since then, the market has been too worried about the vaccines and reopening efforts hurting their sales. But as we have all probably realized over the past year and a half -  gaming, streaming, and building computers AREN'T GOING ANYWHERE. If anything there are more consumers interested than ever before. CRSR has also taken steps to expand its business and establish itself as one of the biggest sponsors in streaming. Think of Nike or Red Bull - but for Esports. By growing their sponsored gamer teams, they attract the next generation of gamers and consumers who want to have the same products as their favorite gamers - the same way you still buy Jordans.\n\n**Factors for Moon:** The most obvious is the fundamental undervaluation for CRSR. While most stocks keep pushing higher, CRSR has not seen love for months, even after posting great earnings at the beginning of May. While AMD has begun to rally and NVDA hits new ATH, people fail to realize that as they grow so does CRSR. What happens when NVDA or AMD comes out with a new product people buy? They get some CRSR accessories and peripherals to go with their new devices. The market is failing to see the amazing opportunity right in front of it.\n\n**Let us not forget the 22% short interest ratio, which is why the rally last week couldn't hold. The rally also had 20x the average daily volume, if the market begins to realize CRSRs potential soon that type of volume will be normal, and so will a price between $45-$58 (my own targets from DCF model built).** \n\nYet again, what do I know - I'm a  retarded finance student (how did I even get to college) and I eat crayons. Therefore this is not financial advice.\n\n**TLDR;** I believe CRSR is insanely undervalued and it's only a matter of time before it takes off.",
        "subreddit": "wallstreetbets",
        "title": "CRSR Gaming isn't playing games - Real Value in a Meme Stock",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o5x1ut/crsr_gaming_isnt_playing_games_real_value_in_a/",
        "created": 1624424088.0
    },
    {
        "author": "DQBIII",
        "created_utc": 1623721694,
        "id": "o02pba",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "The AMD Eruption is Coming…",
        "url": "https://i.redd.it/jdir9u2q4c571.jpg",
        "created": 1623750494.0
    },
    {
        "author": "JOJOinvestor",
        "created_utc": 1624634040,
        "id": "o7poi8",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "# Corsair Gaming, Elgato and the streaming industry\n\nI think we are all aware that the gaming and streaming industry is booming. Some people are saying that it was just a **“covid play”**. I want to see their face when they will realize **how wrong they were**.\n\n# The next super bullish catalysts coming very soon\n\n\\- June 29 : Next Tuesday Corsair will be revealing their latest products with Origin PC, powered by AMD and ASUS\n\n\\- July 15 : It's subsidiary Elgato is releasing a new product (probably a Camera, if confirmed it will sell like hot cakes) ! I'm personnaly very bullish on this one.\n\nCorsair showed that they are ready for the next **DDR5 cycle**, it’s like the 5G but for RAM. I’m not a technician so you can read what they say in their blog post if you want to know more.\n\n# The $35 wall\n\nIf we reach **$35** the boost will be **phenomenal** due to all the shorties selling calls at this price thinking they are **untouchable**. If you don’t own shares of CRSR already you could just enter at these actual cheap prices ($33 to $36) and still have a better price cost than most of the CRSR holders who strongly believe this company is **dramatically undervalued** (spoiler : they are right).\n\nMy position : 350 shares at $36.40\n\n# Insiders selling drama\n\nEagle Tree is a private equity firm that helped Corsair **grow substantially** since 2017. They sold 2 287 511 shares on Monday 14th and 432 989 shares on Tuesday 15th and they still have 54 179 559 shares which is equivalent to 58.5% of ownership. They helped CRSR make **good acquisitions** (Elgato, SCUF, Origin PC…) and now they are **taking some profit**. I honestly don’t know what their plan is so do your own research.\n\nAndy Paul the CEO is 63yo he has all the right to sell 400k shares if he wants after 28 years of **good and loyal service** (he still has 2 584 896 shares left). He can now offer himself a nice boat worth $16M and **be a pirate** in the Caribbean Sea this summer.\n\n# CRSR and LOGI comparison\n\nLogitech is a good company no doubt about that. Let’s compare the last 4 quarters that ended 31st March 2021 of the two companies.\n\nCRSR\n\n* market cap: $3B\n* Revenue: $1.92B\n* Gross Income: $540M\n* Net Income: $149M\n\nLOGI\n\n* market cap: $21.2B\n* Revenue: $4.85B\n* Gross Income: $2.14B\n* Net Income: $875M\n\nYou apes can calculate the **multiples** with some mental arithmetic and be amazed by the results. Let me simplify for you, **Corsair should be worth $10B or $100 a share** if you round it off.\n\n# Conclusion\n\nFeel free to join the **CRSR Gang** composed of respectful **Corsairians** that are convinced this stock will rise to $80-$100 sooner or later and are not willing to sell before this price is reached.\n\nTL;DR: Buy shares, don’t sell calls, **no need to cover anything** (this is obviously **not a financial advice**)",
        "subreddit": "wallstreetbets",
        "title": "$CRSR : Last spike was a WARM UP 🔥 be ready for the real TAKE OFF ! 🚀🌕 (Shorties are sweaty)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o7poi8/crsr_last_spike_was_a_warm_up_be_ready_for_the/",
        "created": 1624662840.0
    },
    {
        "author": "Pilowpants",
        "created_utc": 1624656295,
        "id": "o7wxlt",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "I don't have a exact user. But man thank this community for the heads up on ATOS!!!!!! It wasn't much but I decided to start playing around with our dividend money and dumped it into ATOS. It's only been a week amd I'm aware things can go tragic ASAP. But damn feels good being off to a good start testing the waters. \n\n\nTHANK THIS COMMUNITY",
        "subreddit": "pennystocks",
        "title": "Thank you guys for getting me going on ATOS!!!!!",
        "url": "https://www.reddit.com/r/pennystocks/comments/o7wxlt/thank_you_guys_for_getting_me_going_on_atos/",
        "created": 1624685095.0
    },
    {
        "author": "miltoneumesmo",
        "created_utc": 1624281932,
        "id": "o4v3dz",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "Hello  everyone! Last week I brought to you the top mentioned stocks that my  program tracked and you guys seemed to like it. Therefore, here are this  week's results.\n\nThis week I  decided to not apply any filter, but it's important to say that, due to  the way my program is set up, it can not pick up some stocks, like  $WISH. I am working toward solving this in the future.\n\nSo, this week's most mentioned stocks:\n\nhttps://preview.redd.it/grz71gjgem671.png?width=1445&amp;format=png&amp;auto=webp&amp;s=0bc8dbdfa40ce803fe72563b02ceb34c0cf9e0b4\n\nThis weeks there was less posts around pretty much all stocks. Few exceptions are CRSR, TSLA, PLTR, AMD, DKNG, NVDA.\n\nI would highlight **DKNG**, with a **growth of over 300%** compared to the week before, and with a **growing positive sentiment** around it.\n\nhttps://preview.redd.it/s4if2c5hem671.png?width=1748&amp;format=png&amp;auto=webp&amp;s=df4aa6d1d7378b31c007ef0cdf32749e627bb5f4\n\n**CRSR**  also had a growth in the total number of posts mentioning it since  compared with the previous period, with the sentiment keeping **very positive**.\n\nhttps://preview.redd.it/tc596fphem671.png?width=1748&amp;format=png&amp;auto=webp&amp;s=fd9d727177332bbe7fcd66b0d8ed49b9b766f739\n\nIf you want to do analysis on any specific stock or just look at the growth for yourself you can try it ou in [http://tickergrowth.com](http://tickergrowth.com/) .\n\nAny feedback is always good, so feel free to do that!\n\n***NOTE:*** *Not financial advise, do your own due diligence and keep in mind that multiple factor impact the stock market.*\n\nBonus Content:\n\nWith  the tool, you can also see what are the top stocks by positive votes in  the post mentioning it. The results for the past week are:\n\nhttps://preview.redd.it/3h7ejohiem671.png?width=1437&amp;format=png&amp;auto=webp&amp;s=78e742415d7026924e7c17cf67c07c8ce45d93ad",
        "subreddit": "wallstreetbets",
        "title": "[Weekly Scanner] - Most mentioned stocks: AMC, GME, CLNE, CRSR, CLOV, WKHS 🚀🚀",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o4v3dz/weekly_scanner_most_mentioned_stocks_amc_gme_clne/",
        "created": 1624310732.0
    },
    {
        "author": "firstorbit",
        "created_utc": 1624422844,
        "id": "o65l9k",
        "num_comments": 40,
        "num_crossposts": 0,
        "selftext": "TL;DR I’m not going to say the ‘S’ word right off the bat, but I think you’ll get where this is headed.  **🚀**  **🚀**  **🚀** \n\nLet’s start with the basics: National Beverage Corporation is the Ft. Lauderdale, FL based parent company of a number of carbonated soft drink brands that you’ve probably heard of and have likely tried in your lifetime, most notably: La Croix, Shasta, and Faygo (for all you former Jugglaos). \n\n&amp;#x200B;\n\n[ Tastes like someone drank fruit juice and burped into my seltzer water. ](https://preview.redd.it/i7frbmqjzx671.jpg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=5d0a79f9e59637a3a43e3855589a7a0bee26f041)\n\nWhat makes them a long term buy: They’re competitive among much bigger firms ($KO and $PEP) (think $AMD vs. $INTC). They’ve been consistently increasing market share and profitability. They’re more vertically integrated than competitors: They own both the production and distribution facilities. \n\nThey’re actually profitable with a good long term track record (unlike a lot of other companies being hawked on here). They pay dividends (but not always regularly), and have decent P/E at 25.47 (which is better than KO and the industry average). While slightly less than average EPS at $1.83 is good, it’s better than KO, and they have had huge EPS growth at 42% in the last 12 months. FIZZ has a 16% profit margin while PEP is only 10%. Last but not least, they have almost no long term debt!\n\nTechnically FIZZ has been a steady gainer as well, with 82.7% 12-month price performance and 20% 6-month price performance. They had a 2:1 split at the end of February this year after paying out an enormous $6 per share! special dividend at the end of January. \n\nEarnings is coming up 29 JUN. It’s expected to go down compared to last quarter, but a surprise beat might give the price a bump. Worth noting here that they’ve beat earnings estimates on the last 5/6 periods.\n\nHere’s a couple news articles recently published on FIZZ: \n\n[https://finance.yahoo.com/news/national-beverage-corp-nasdaq-fizz-081255164.html](https://finance.yahoo.com/news/national-beverage-corp-nasdaq-fizz-081255164.html)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/vxh39w4c0y671.png?width=853&amp;format=png&amp;auto=webp&amp;s=1e13e03baefa2ba6116beb5113de3c9b53e16a6e\n\n [https://finance.yahoo.com/news/shareholders-national-beverage-nasdaq-fizz-062856268.html](https://finance.yahoo.com/news/shareholders-national-beverage-nasdaq-fizz-062856268.html) \n\nNow on to the (carbonated) juicy stuff: Long (1 week) before WSB was invaded by apes u/Pcola77 posted an epic DD back on Jan 20: [https://www.reddit.com/r/wallstreetbets/comments/l1aod7/dd\\_on\\_fizz\\_possibly\\_next\\_big\\_short\\_squeeze/](https://www.reddit.com/r/wallstreetbets/comments/l1aod7/dd_on_fizz_possibly_next_big_short_squeeze/) (Note that the short numbers in his DD were based on pre-split shares.) \n\nA week later, on Jan 27, $FIZZ doubled but then dropped back down by Feb. 2. So, $FIZZ already started to squeeze in January, but it seems like everyone forgot about it since then. Short interest declined a bit since January, but hasn’t budged at all since Feb-March, and $FIZZ has been sideways since then… sound familiar?\n\nIf you read the January DD, you’ll realize that $FIZZ still has the right mixture of: insanely low float of only 18.01 M shares (because most of the company is actually owned by one old guy who hates short sellers), combined with huge short interest of 5.89M shares which creates a 32% short float. But the secret ingredient for this recipe is the crazy low trade volume that makes days to cover (short interest ratio) even higher at nearly 12. This means that it would take more than 2 full weeks of trading to unwind all the short positions, if **EVERY SINGLE TRADE** was a short covering for those full 12 trading days. This days to cover is an order of magnitude higher than GME or CLOV or AMC or BB, which means that it will be that much harder for the shorts to exit their positions. To put a sparkling cherry on top of everything, if $FIZZ announces another dividend, the short sellers have to pay that dividend on shares they sold short.  **🚀**  **🚀**  **🚀**  **🚀** \n\nPositions: Shares, 10/15 $57.5c, 10/15 $65c\n\nThis is not financial advice. I am not a financial professional. I like the stock. Do your own DD.",
        "subreddit": "wallstreetbets",
        "title": "$FIZZ is about ready to pop!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o65l9k/fizz_is_about_ready_to_pop/",
        "created": 1624451644.0
    },
    {
        "author": "tickerwizards",
        "created_utc": 1624464756,
        "id": "o6g0r5",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "I'm a fan of this stock like many others here I'm sure - so I try to keep a close eye on the chart. There has been a very large falling wedge setup building for 10 months now. With Nasdaq going crazy - we might just nail a breakout this week.\n\n[$AMD 1W 2Y](https://preview.redd.it/osqk5jp6h1771.png?width=2229&amp;format=png&amp;auto=webp&amp;s=f15d503aa5d3e4e7a863197cea2920546476ba84)\n\nHere is the setup in question. You can see its a falling wedge that began on the week of **7/27**. We attempted to break last week and closed **just** on the line - with some increased volume. After a back test yesterday - it looks like we are trying to nail the close this time around.\n\nIn order for that to happen - we need **4 PM on Friday to be above** **84.00.**\n\nThis would trigger a breakout targeting **90** resistance first, followed by **100** and **110.**\n\nMaybe we could overshoot to **125** \\- but I'm going to be selling all/most around that last target.\n\nThis breakout is invalid if we don't get the close - but the pattern will still be alive. It has some room for another trip down - so long as we hold **72.50.**\n\nOverall a pretty textbook chart setup - don't overthink it. I'm looking @ **August 90c** for this one, I might roll them back when we get ITM.\n\nPost breakout - I'll be putting a stop loss at **83.00.**\n\nThe move should play out over **2-3** months.",
        "subreddit": "wallstreetbets",
        "title": "$AMD - The Return of Su Bae - 10 Month Old Technical Setup Looking to Breakout",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o6g0r5/amd_the_return_of_su_bae_10_month_old_technical/",
        "created": 1624493556.0
    },
    {
        "author": "don-mateo",
        "created_utc": 1623161105,
        "id": "nv4s74",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "I look at Ford and think of AMD 10 years ago. Solid products/name, but not many people seeing its intrinsic value, forward approach, and significantly improved management. Ford has been making all the right decisions lately and I believe it's at last a $30-$40 stock, yet it sits below $16. I can't imagine it being anywhere near $15-16 same time next year. In fact, Ford @ $44 seems very possible. Thoughts?",
        "subreddit": "stocks",
        "title": "Ford (F) continues to look shockingly undervalued. Why haven't others caught on yet?",
        "url": "https://www.reddit.com/r/stocks/comments/nv4s74/ford_f_continues_to_look_shockingly_undervalued/",
        "created": 1623189905.0
    },
    {
        "author": "MrObviouslyRight",
        "created_utc": 1624301941,
        "id": "o52lqs",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "# Dear Apes,\n\n# I've got more news... and frankly, it is beyond my wildest dreams.\n\nWe  had TESLA loving AMD, adopting their APUs &amp; GPUs in the MODELS X  and S, and an optional for other vehicles. This pushes AMD to MARS... as  autonomous driving is a perfect for gaming.\n\nWe  had Google signing a contract to adopt Milan Epyc Datacenter CPUs for virtual machine offerings... SMOKING intel. HUGE DATACENTER WIN, as the TCO is dropped dramatically.\n\nWe had the 6900XTX Liquid Cooled breaking World Records (previously held by the 6900XT).\n\nWe have Valve releasing a new handheld with AMD by the holiday season 2021.\n\nWe have Fidelity FX Super Resolution with AMAZING FPS boosts in Ultra Quality and Quality modes (launching tomorrow).\n\nWe  have the AMD Advantage Program for LAPTOPS allowing for a 5900HX (TOP  mobile CPU) to be paired with a RX 6800M, an VALUE HIGH-END mobile GPU.  Giving Mobile 3080 like performance at $1650, with high refresh monitor  (300Hz on 1080p to 140Hz on 1440p).\n\nBut now... it is Samsung's latest info.\n\nWe knew AMD was coming in the Galaxy S22.... but it gets BETTER!!!\n\nThe  performance of RDNA2 in mobile is beating expectations... and SAMSUNG  is signing a future deal with AMD... as they are SUPER PLEASED with  AMD's performance. Samsung will effectively ABANDON their GPU plans and  work with AMD going forward.\n\nBut that IS NOT ALL.... GOOGLE also wants AMD in their Mobiles.\n\nGoogle, the Android software developer... wants AMD. This is NUTS.\n\n[https://videocardz.com/newz/samsung-reportedly-already-negotiating-contract-with-amd-for-mrdna-successor](https://videocardz.com/newz/samsung-reportedly-already-negotiating-contract-with-amd-for-mrdna-successor)\n\nTo summarize,\n\n**AUTONOMOUS DRIVING:**\n\nHuge Partnership with TELSA for GPU's and APU's. More manufacturers to join soon!\n\n**GAMING (Consoles &amp; PC):**\n\nConsoles: PS5, Xbox X/S, Valve handheld, Aya Neo.\n\nPC (CPU): Zen3 with stacked cache coming late this year (15% IPC expected). Zen4 in Q2 2022.\n\nPC (GPU): 6900XTX, 6800M available. Fidelity FX SR tomorrow!!! RDNA3 MCM coming next year.\n\n**DATACENTER:**\n\nGoggle wants Milan Epyc for Virtual Machine service offerings. Tencent and Alibaba coming next!\n\nDatacenter chips with 128 Cores (256 threads) coming next year!!!\n\n**MOBILE (phones):**\n\nAMD making a HUGE entrance into the Samsung Galaxy with RDNA2. Google wants AMD too!!!\n\nAMD is now officially EVERYWHERE. From \"El Capitan\" Dept. of Energy to **EVERY popular gaming hardware &amp; software solution**.... including mobile phones.\n\nThis was the last catalyst... the stock will now retest the $81.70... and surge towards $130.\n\nXilinx has been given a Green Light by all major regulators.\n\nMILKY WAY HERE WE COME!!!",
        "subreddit": "wallstreetbets",
        "title": "AMD already beyond the GALAXY... and Google is coming with a 1-2 punch!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o52lqs/amd_already_beyond_the_galaxy_and_google_is/",
        "created": 1624330741.0
    },
    {
        "author": "SirSkankAlot",
        "created_utc": 1622859604,
        "id": "nslgly",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "But my AMD made 50 bux!!",
        "url": "https://i.redd.it/rrwdvzeaxc371.jpg",
        "created": 1622888404.0
    },
    {
        "author": "rony715",
        "created_utc": 1625063431,
        "id": "oayi2z",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Thanks to WSB for putting me on to AMD!! Of course still 💎 🙌 AMC",
        "url": "https://i.redd.it/v20lsfceye871.jpg",
        "created": 1625092231.0
    },
    {
        "author": "VMP85",
        "created_utc": 1623815398,
        "id": "o0w0dz",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "I am looking to gain additional exposure to semiconductors (beyond what I already have with FSKAX, VTIAX and VXUS) and am looking to get feedback or suggestions on the best way to go about doing this. This is in a taxable account. My first thought was to buy SMH as TSM and NVDA are the two largest holdings. However, it lacks any AAPL and MSFT. Would the best choice be to buy SMH and also both AAPL and MSFT? Or, would it be best to buy AMD, NVDA, TSM, AMAT, TXN, AAPL and MSFT individually?",
        "subreddit": "stocks",
        "title": "Exposure to semiconductors suggestions",
        "url": "https://www.reddit.com/r/stocks/comments/o0w0dz/exposure_to_semiconductors_suggestions/",
        "created": 1623844198.0
    },
    {
        "author": "Mjrbks",
        "created_utc": 1624642026,
        "id": "o7sblf",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": "Long story short as of yesterday I was the highest over my initial investment amount I’ve ever been LTD (only slightly under that currently), and this is despite having bought into BB at $15. \n\nFor the most part I am trying to keep a decent long term portfolio with a “second savings account with better interest potential” kind of mindset, AMD and DIS leading the way for me. Still learning but feel like I’m getting more confident each day. \n\nThe only reason I got into BB is because I was reluctant to jump on board the GME and AMC ships and after seeing how those eventually turned out I let a sense of FOMO take over and figured BB was next on the list to see the same treatment. It may have already on a smaller scale, but for when I chose to buy in it doesn’t seem too hopeful. I purposely didn’t go too crazy so I didn’t stand to lose much, but seeing as how it spent pretty much all of June falling gradually from my initial buy in, is it safe to say I should abandon this journey now and reinvest that money into something else?\n\nAny advice appreciated, sorry if this is low level stuff. As I said, still learning.",
        "subreddit": "stocks",
        "title": "Is it safe to say my first foray into “meme” stocks has failed yet?",
        "url": "https://www.reddit.com/r/stocks/comments/o7sblf/is_it_safe_to_say_my_first_foray_into_meme_stocks/",
        "created": 1624670826.0
    },
    {
        "author": "snkbrdng",
        "created_utc": 1625061597,
        "id": "oaxwox",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "Ok you just blew up your account again. O DTEs lotto tickets purchased based on DD written in emoji by a bot on the Reddit.\n\nI did some deeeeeeep investigation. Reaching out to a complex network of mouth breathing nerds including AMDs partners, customers competitors and fanboyz and I have reached three conclusions\n\nAMD ticker is going on a ride to $120 and $240 in dec 2021 Q1 2022\n\nIntel is in shambles and Pat G will rest and vest while he hires and fires another two or three waves of underling…errr..executives.\n\nNVDA is healthy and Jensen continues to out market everyone in technology. AI mindshare is 100% NVDA. It will take a little time for the green machine to grow into its current valuation and P/E ratio of 100. NVDA will be the first semi company to $1T valuation in late 2022 early 2023.",
        "subreddit": "wallstreetbets",
        "title": "INTEL AMD and NVDA",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oaxwox/intel_amd_and_nvda/",
        "created": 1625090397.0
    },
    {
        "author": "ajaxhacker",
        "created_utc": 1624688277,
        "id": "o85951",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "I did some DD on intel.  Compared to the other +100b semiconductor companies, intel is like a nice juicy milf with double D”s in a room of Amateur AMD A cups and Flat chested Nvidia anal addicts.  I was going to buy today but my wife put me on timeout before market close.  I like intel.                                                I think that the compatibility with windows 11 will help intel a lot and it reinforces intel as a provider for PC hardware.  Even if amd and tsmc comes up with smaller transistors, intel can still manage to develop more efficient architecture in both transistors per mm^2 and speed.                                                       \n\nTSMC=Taiwan suck my cock.       AMD=Arranged Marriage Disparity.                                     \n\n\nIntels massive tits, cash reserves and revenue allow it to increase its capex, hopefully soon above 20b.",
        "subreddit": "wallstreetbets",
        "title": "Intel “23 Itm calls",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o85951/intel_23_itm_calls/",
        "created": 1624717077.0
    },
    {
        "author": "theepicone111",
        "created_utc": 1624652036,
        "id": "o7vkep",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "Ideally looking for a gain but if flat, no problem. I have 3k sitting around which was initially saved for a product that’s coming out at the end of this year, but I feel like there are some moves to be made before that with certain stocks - e.g AMZN, AAPL, AMD. \n\nI was strongly considering putting this money into Amazon. If it goes down, fine. I got no problem holding for years. If it goes up, I anticipate a jump which can make a decent couple hundred profit. From a valuation standpoint, looks historically fair or undervalued. Would also be nice to flex my one share of Amazon :). Does this seem like a decent place to park some cash?",
        "subreddit": "stocks",
        "title": "Got 3k to put into a ‘safe’ stock for a couple months.",
        "url": "https://www.reddit.com/r/stocks/comments/o7vkep/got_3k_to_put_into_a_safe_stock_for_a_couple/",
        "created": 1624680836.0
    },
    {
        "author": "Wojofoo",
        "created_utc": 1623679275,
        "id": "nzngf7",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Proof that AMD is being manipulated",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nzngf7/proof_that_amd_is_being_manipulated/",
        "created": 1623708075.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1623957451,
        "id": "o25a73",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "AMD is early on it’s run to $120 and beyond",
        "url": "https://i.redd.it/zwux9w1rlv571.jpg",
        "created": 1623986251.0
    },
    {
        "author": "Cloudkingxz",
        "created_utc": 1623830571,
        "id": "o0zph4",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "28yo here - working fulltime and living at home with parents\n\nI put 100% of my savings into stocks/funds for longterm\n\nThis is my split, do you think this is safe or risky?\n\n10% AMD,\n10% NVidia\n\n20% JPM China funds,\n20% JPM US tech funds\n\n20% nordic small/middlesize corp funds,\n20% new technology nordic funds\n\n\nMarket overview:\n40% into us tech companies,\n20% china funds,\n40% nordic funds\n\nI have no time for minmaxing/daytrading. The plan is just to put my savings into here and wait +2-20 years for the profits\n\nAll these funds I picked are also very popular funds in either Worldwide or Sweden where im from and have had very good ROI the last 1/3/5 years, topping the fund lists.",
        "subreddit": "stocks",
        "title": "Is my portfolio safe or risky?",
        "url": "https://www.reddit.com/r/stocks/comments/o0zph4/is_my_portfolio_safe_or_risky/",
        "created": 1623859371.0
    },
    {
        "author": "Fun_Mathematician276",
        "created_utc": 1624235238,
        "id": "o4iw3d",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Need help I got some options expiring this week calls $PTRL $NIO $ LI $PLUG amd $AMD ???",
        "subreddit": "options",
        "title": "Call options",
        "url": "https://www.reddit.com/r/options/comments/o4iw3d/call_options/",
        "created": 1624264038.0
    },
    {
        "author": "KentzBe",
        "created_utc": 1623168507,
        "id": "nv7oag",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Hi everyone, I'm currently contacting my broker, however, their support sucks a.. , I often check my realized profit statements and after looking at them again I realized that I didn't get realized premium for my -2 puts. 700$ altogether, they expired last Friday I got assigned the shares as well. Did anyone experience a similar situation?",
        "subreddit": "options",
        "title": "Didnt get the premium for my AMD sold put which expired on Friday and i got assigned shares.",
        "url": "https://www.reddit.com/r/options/comments/nv7oag/didnt_get_the_premium_for_my_amd_sold_put_which/",
        "created": 1623197307.0
    },
    {
        "author": "ihpalash",
        "created_utc": 1624641940,
        "id": "o7sajc",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "I have been preaching about amd for couple of weeks. I got in at $72 and holding since then. I am 100% sure it's going for $90 at the end of this month to it's previous high. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/3c8ffaoc4g771.png?width=1297&amp;format=png&amp;auto=webp&amp;s=b0f8946dd4c02c6d8c13692ee7a41a402c43b5a5\n\nThe best thing is today it formed the previous points where it dips a little back and then shoots off 5%, and that equates to 100% option gain for next week. \n\nLook at today's chart  \n\n\nhttps://preview.redd.it/4udfc0gq4g771.png?width=1243&amp;format=png&amp;auto=webp&amp;s=059a45a12790bb4245c3430a6b6f767223debf79\n\nI bought a contact at the low shy above $85 and am already up 20% for next week!   \n\n\nDespite having a chip shortage AMD is performing better for a long hold.",
        "subreddit": "wallstreetbets",
        "title": "Amd is on sale. grab one before we jump to the moon.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o7sajc/amd_is_on_sale_grab_one_before_we_jump_to_the_moon/",
        "created": 1624670740.0
    },
    {
        "author": "makaros622",
        "created_utc": 1624366536,
        "id": "o5miba",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "I am trying to narrow down 2-3 companies from the following list:\n\n* AMD,\n* AMAT, \n* TSM, \n* MU, \n* XLNX\n\nI want to invest in 3 of these for the long term (20y). After doing some research all appear to be healthy with nice profit margins and valuations.\n\n**Which** 2-3 would you choose and **why**?",
        "subreddit": "stocks",
        "title": "Top 2-3 Semiconductor companies among AMD, AMAT, TSM, MU, XLNX?",
        "url": "https://www.reddit.com/r/stocks/comments/o5miba/top_23_semiconductor_companies_among_amd_amat_tsm/",
        "created": 1624395336.0
    },
    {
        "author": "AdTall3883",
        "created_utc": 1623806324,
        "id": "o0teky",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMD YOLO update",
        "url": "https://i.redd.it/vhn2l86b4j571.png",
        "created": 1623835124.0
    },
    {
        "author": "Bouvill",
        "created_utc": 1624565616,
        "id": "o790mh",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "https://www.notebookcheck.net/AMD-RDNA3-GPUs-rumored-to-steal-the-performance-crown-from-Nvidia-Hopper-in-mid-2022-due-to-massive-Infinity-Cache-improvements.547345.0.html \n\nI already invested a lot in AMD, but I'm wondering if I should not double it. Only good news for short AND long term... Mobile GPU for different smartphones brands, the merger with Xilinx soon, tons of PS5 and Xbox sells, shares buyback program, Google recently choosing AMD for its servers.. \n\nI wouldn't be surprise to see AMD @95$ in July and 110$ end of year. Could be $140 by mid-2022.\n\nIt's no financial advice (I lost 1700$ this week, I'm an ape).\n\nTake care !",
        "subreddit": "wallstreetbets",
        "title": "Insiders at AMD confident about their 2022 GPUs against next NVDA gen",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o790mh/insiders_at_amd_confident_about_their_2022_gpus/",
        "created": 1624594416.0
    },
    {
        "author": "MontaukMonster2",
        "created_utc": 1622694409,
        "id": "nr4svn",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "$AMC $BB $SNDl\nTriple Squeeze!\n\nSo here's my question/pondering:\nWhat happens next?\n\nMy thinking is that buttcoin drops like an anvil on my toe. Reason being that as the whales get squeezed out of their short positions, they will have to liquidate other assets, and the easiest one to liquidate ia çryptô. \nThen, as buttcoin drops, the Tether scam falls apart, taking the whole çryptô market down amd instigating a mini-crash. \n\nI've sold off all my çryptô stocks ($RIOT $MARA $SOS) in anticipation of this, and plan to buy that dip after the triple rockets approach re-entry\n\nAny thoughts?",
        "subreddit": "wallstreetbets",
        "title": "Triple Squeeze!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nr4svn/triple_squeeze/",
        "created": 1622723209.0
    },
    {
        "author": "[deleted]",
        "created_utc": 1623895118,
        "id": "o1lkwj",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "[deleted]",
        "subreddit": "wallstreetbets",
        "title": "AMD DD update (Ape must read!)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o1lkwj/amd_dd_update_ape_must_read/",
        "created": 1623923918.0
    },
    {
        "author": "MrJumblez",
        "created_utc": 1625091927,
        "id": "ob84s1",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMD My first options purchase ever. Bought it the whole way down.",
        "url": "https://i.redd.it/jlwd4wmhah871.png",
        "created": 1625120727.0
    },
    {
        "author": "ihpalash",
        "created_utc": 1624459298,
        "id": "o6e6bz",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Referencing my yesterday's post [https://www.reddit.com/r/wallstreetbets/comments/o650gl/prediction\\_stocks\\_movement\\_for\\_this\\_week/h2qeug1/](https://www.reddit.com/r/wallstreetbets/comments/o650gl/prediction_stocks_movement_for_this_week/h2qeug1/)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nNIO is up 2.3% at open and options contracts are 50% up. if u bought any contract yesterday by my recommendation u would be up by 50% now. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/je99bh1iw0771.png?width=625&amp;format=png&amp;auto=webp&amp;s=adb6dc4b98327022eba11018bf903c2df55a9c13\n\nJPM trading sideways. \n\nPLTR broke $26. and options are 200% tits up, I am wrong on that. \n\nJMIA is up by 3% , options are 200% I am right on that. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/ub3fe50xw0771.png?width=620&amp;format=png&amp;auto=webp&amp;s=a69c997738ee6c52d16bbd26bda2aa61c7c88a21\n\nRIDE is trading higher. So I am wrong on that. but still bearish  on this. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/dvqo8malx0771.png?width=587&amp;format=png&amp;auto=webp&amp;s=57d9d4e90b898b1c486586e86a50bac1962d19c8\n\nMNMD fall down. So wrong on that. \n\nAMC slightly higher. The options are high at open but lost traction overtime. \n\nZM opened higher with 100% call gains. \n\nhttps://preview.redd.it/5fdwpfhzx0771.png?width=572&amp;format=png&amp;auto=webp&amp;s=fb8ffb8149c4998d4f75fd581f172c6fef3085e6\n\nDASH is falling . right on that. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/7alva04m11771.png?width=807&amp;format=png&amp;auto=webp&amp;s=aba641eb07ed83791f5228d615773420afd25530\n\nThis is my final post on this subject. Seems like Most of my prediction except PLTR is good. I have to do more research on PLTR. I hope my previous post and this post helped you. if you bought yesterday you would make 50% ROI today.",
        "subreddit": "wallstreetbets",
        "title": "My prediction results . AMD, PLTR , NIO who are the winners?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o6e6bz/my_prediction_results_amd_pltr_nio_who_are_the/",
        "created": 1624488098.0
    },
    {
        "author": "Ordinary-Broccoli-41",
        "created_utc": 1623333158,
        "id": "nwo6rh",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "UMC is a Taiwanese Semiconductor company in a microchip shortage. Like some others, it's running at 100% capacity creating new chips\nhttps://www.umc.com/en/IR_Financial/monthly_sales_revenue\n\nUNlike the others, UMC's focus has been on creating cheaper chips, like you find in cars and appliances. The higher margins from inflated prices over this and the next couple years before capacity can be increased will have a greater effect on UMC than other companies like Intel or AMD.\nhttps://www.google.com/amp/s/seekingalpha.com/amp/article/4428612-umc-should-profit-better-than-tsmc-supply-crunch\n\nFinally, once the other chip companies finish ramping capacity in a couple years, they're going to drive down prices and be stuck with more production than they can use, but not UMC, they have contracts for their upcoming production lines, so they will keep their profitibility when everyone else struggles\nhttps://www.datacenterdynamics.com/en/news/umc-to-up-production-of-28-nm-chips-amid-global-shortage/\n\nI love this stock, and I think it's an awesome long term play. I hope y'all also love it and buy enough that my calls print. Thank you.",
        "subreddit": "wallstreetbets",
        "title": "UMC and why I love the stock",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nwo6rh/umc_and_why_i_love_the_stock/",
        "created": 1623361958.0
    },
    {
        "author": "RememberYo",
        "created_utc": 1624909603,
        "id": "o9ruwh",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "I remember the overall market was trending red. This was just a month ago. Week after week it was red and I was buying what I could. \n\nBut lately it's been trending green and stocks that I hold are rising dramatically. Like AMD, FB, PLTR.\n\nI have some cash that I want to deploy but I've been waiting for red days as everything slowly continues to rise (except AAPL unfortunately).\n\nAnyone else feel the same? I just want some bad news.\n\nYTD: Up 15%",
        "subreddit": "wallstreetbets",
        "title": "It's funny because I'm dying for some red days right now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/o9ruwh/its_funny_because_im_dying_for_some_red_days/",
        "created": 1624938403.0
    },
    {
        "author": "Bobthebuilder24",
        "created_utc": 1625060991,
        "id": "oaxq4y",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Watch out for $AMD it's about to glow 🚀 🚀 🚀",
        "url": "https://i.redd.it/55gwnsj1re871.png",
        "created": 1625089791.0
    },
    {
        "author": "jonmon7891",
        "created_utc": 1624891055,
        "id": "o9ljk6",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$AMD Yolo 1000 call options expire July 02, update",
        "url": "https://i.redd.it/etahby1up0871.jpg",
        "created": 1624919855.0
    },
    {
        "author": "notbrokemexican",
        "created_utc": 1623614279,
        "id": "nz4iki",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Over the past year I've really fallen in love with the process and maintenance of investing. It's something I've always wanted to do but never had the opportunity to do due to my income. I followed markets closely anyway and at the end of the day my favorite part about all of this is how much I simply enjoy reading.\n\nI'm currently considering Barron's, WSJ, The Economist, and Bloomberg based on my previous experiences. I would appreciate some guidance from anyone that already has experience with some of these platforms. What you liked, didn't like, or if it's worth combining subscriptions. Stuff like that.\n\nI appreciate general news but enjoy intensive discussions on particular companies. If it is of any importance, these are the companies that I currently invest in:\n\n&amp;#x200B;\n\n**Over 1%**\n\nPinterest, Google,  Autodesk, Kansas City Southern, Square, and eventually Robinhood.\n\n&amp;#x200B;\n\n**Up to 1%**\n\nSPY, Pershing Square, Berkshire, Costco, Salesforce, Visa, Paypal, Rockwell Automation, Mettler-Toledo, Sherwin-Williams, Ecolab, Oatly, Roblox, Tesla, AMD, Fastly, AirBnB, Bitc\\*in (not sure if word is banned)",
        "subreddit": "stocks",
        "title": "I want to subscribe to a news platform. Which do you suggest and why?",
        "url": "https://www.reddit.com/r/stocks/comments/nz4iki/i_want_to_subscribe_to_a_news_platform_which_do/",
        "created": 1623643079.0
    },
    {
        "author": "raebyagthefirst",
        "created_utc": 1623954849,
        "id": "o248kb",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Just FYI: you could make 950% on AMD today. Not me",
        "url": "https://i.redd.it/aispuqf0ev571.jpg",
        "created": 1623983649.0
    },
    {
        "author": "TapNo377",
        "created_utc": 1624904521,
        "id": "o9q5gp",
        "num_comments": 25,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AMD fellow apes 🦍",
        "url": "https://i.redd.it/ocjck9lvt1871.jpg",
        "created": 1624933321.0
    },
    {
        "author": "cakegourmand",
        "created_utc": 1624820579,
        "id": "o93coq",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "I did a lot of research this weekend trying to put together a good list for the best stocks to buy in July. Feedback and ideas are appreciated! Obviously we’re all not gonna have the same opinions but I think this list is a good guide. Let me know what ya think. I’m of the opinion that the market is going to rotate towards beaten down growth stocks but not the ones that are extremely high flyers. For example, some stocks that made the list are those such as AMD, SoFi, and Disney. I think the most controversial part of where I think the market is headed is in regards to Chinese companies. \n\nI am of the opinion that companies like JD.com, Alibaba and even though it didn't make my list, Baidu will see significant recoveries in the coming months. Although, I won't rule out the idea of them being value traps entirely and I could understand investor fears relating to them as their is so much uncertainty.\n\nThanks for hearing me out and for any ideas you may have.\n\n\nhttps://www.fosterfinancialfreedom.com/post/stock-market-power-rankings-july-2021",
        "subreddit": "investing",
        "title": "Stock Market Power Rankings for July 2021",
        "url": "https://www.reddit.com/r/investing/comments/o93coq/stock_market_power_rankings_for_july_2021/",
        "created": 1624849379.0
    }
]