[
    {
        "author": "the_orest",
        "created_utc": 1629302920,
        "id": "p6ua93",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": " \n\nDoes anyone have trading experience with Lenovo ([https://finance.yahoo.com/quote/LNVGF/](https://finance.yahoo.com/quote/LNVGF/))  ?\n\nI  know it is a chinese company, but one of the few that allows foreign ownership (foreign invested enterprise) and of course has factories all  over the world. I was not aware that it is market leader of pc sales,  owns Motorola etc. Seems quite promising, with a very low PER (around  4-5) and a constant dividend of also 4 %.\n\nIs  there some truth to these links ? The most blogs seem to hype it a lot  and with the current price around 1 $ it seems like a bargain, but I am  uncertain....would appreciate more meat to the bone. \n\n&amp;#x200B;\n\n[https://www.investing.com/news/stock-market-news/lenovo-q1-profit-more-than-doubles-beats-expectations-2586373](https://www.investing.com/news/stock-market-news/lenovo-q1-profit-more-than-doubles-beats-expectations-2586373)",
        "subreddit": "wallstreetbets",
        "title": "Investment in Lenovo , LNGFV..Hot ?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p6ua93/investment_in_lenovo_lngfvhot/",
        "created": 1629331720.0
    },
    {
        "author": "Data951",
        "created_utc": 1629307931,
        "id": "p6vyzw",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\nGreed, it's that simple. After the bailout, $GM played pretty clean, except for its financial arm. $GM Financial. $GM Financial used to be AmeriCredit, a 30%APR auto lender, now it's called $GM Financial.\n\nTo collect quickly, you need a good repossession solution. $GM Financial found that in a company called DRNData or the Digital Recognition Network (ALPR) which is now owned fully by Motorola Solutions.\n\nDRN's website has privacy warnings when you load it, it's obviously some sort of front for DEA/ICE/HSI. The cars used by DRN employees all come back to Maryland, yet they have local tags on the states they are operating.\n\nDRN has a salesperson/owner named Jeremiah Wheeler (Google him, he's very active). Jeremiah's wife, Chesney Dawn Wheeler owns a recently registered company in Texas named CW Growth Partners LLC. The company was formed so Jeremiah could be compensated not as an employee of Motorola (his email is a moto email) but, the commissions go to his wife's company.\n\nAfter the vehicles are repossessed by local camera scanner repo companies $KAR Global then re-sells them. $KAR needs the repossession pipeline of vehicles, no vehicles, no revenue for your 100 person call center in Indiana, your 50 people 2nd-floor office in Mesa, and a handful of virtual assistants in India. People in India are servicing American Consumer Auto Loans today in 2021.\n\nWithout repossession consignments, $KAR Global has no inventory to sell except retail dealer Back Lot Cars inventory. Factory consignors sell at Cox Automotive owned Manheim because they get more money from dealers. Retail auto dealers in the United States only buy from ADESA actions if they are desperate because doing business with any company under the KAR umbrella is risky.\n\nI recommend buying Ford stock or vehicles, $GM leadership in Ft Worth has been aware of this since 2017, yet they have done nothing so they can sell and finance more cars. $GM needs to get out of the auto lender business just as Chrysler has already.",
        "subreddit": "wallstreetbets",
        "title": "Why General Motors $GM, $KAR Global, and Motorola Solutions are Morally Wrong Today",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p6vyzw/why_general_motors_gm_kar_global_and_motorola/",
        "created": 1629336731.0
    },
    {
        "author": "Data951",
        "created_utc": 1629084793,
        "id": "p58583",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Greed, it's that simple.  After the bailout, GM played pretty clean, except for its financial arm. GM Financial.  GM Financial used to be AmeriCredit, a 30%APR auto lender, now it's called GM Financial.\n\n&amp;#x200B;\n\nTo collect quickly, you need a good repossession solution.  GM Financial found that in a company called [drndata.com](https://drndata.com) or [digitalrecognitionnetwork.com](https://digitalrecognitionnetwork.com) which is now owned fully by Motorola Solutions.\n\n&amp;#x200B;\n\nDRN's website has privacy warnings when you load it, it's obviously some sort of front for DEA/ICE/HSI.  The cars used by DRN employees all come back to Maryland, yet they have local tags on the states they are operating.\n\n&amp;#x200B;\n\nDRN has a salesperson/owner named Jeremiah Wheeler (Google him, he's very active).  Jeremiah's wife, Chesney Dawn Wheeler owns a recently registered company in Texas named CW Growth Partners LLC.  The company was formed so Jeremiah could be compensated not as an employee of Motorola (his email is [jeremiah.wheeler@motorolasolutions.com](mailto:jeremiah.wheeler@motorolasolutions.com)) but the commissions go to his wife.\n\n&amp;#x200B;\n\nAfter the vehicles are repossessed by local camera scanner repo companies KAR Global then re-sells them. KAR needs the repossession pipeline of vehicles, no vehicles, no revenue for your 100 person call center in Indiana, your 50 people 2nd-floor office in Mesa, and a handful of virtual assistants in India.  People in India are servicing American Consumer Auto Loans today in 2021.  \n\n&amp;#x200B;\n\nWithout repossession consignments, KAR Global has no inventory to sell except retail dealer Back Lot Cars inventory.  Factory consignors sell at Cox Automotive owned Manheim because they get more money from dealers.  Retail auto dealers in the United States only buy from ADESA actions if they are desperate because doing business with any company under the KAR umbrella is risky.\n\n&amp;#x200B;\n\nI recommend buying Ford stock or vehicles, GM leadership in Ft Worth has been aware of this since 2017, yet they have done nothing so they can sell and finance more cars.  GM needs to get out of the auto lender business just as Chrysler has already.",
        "subreddit": "wallstreetbets",
        "title": "Why General Motors, KAR Global, and Motorola Solutions are Morally Wrong Today",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p58583/why_general_motors_kar_global_and_motorola/",
        "created": 1629113593.0
    },
    {
        "author": "the_orest",
        "created_utc": 1629301877,
        "id": "p6tx63",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " \n\nAnyone has trading experience with Lenovo ([https://finance.yahoo.com/quote/LNVGF/](https://finance.yahoo.com/quote/LNVGF/))  ?\n\nI  know it is a chinese company, but one of the few that allows foreign ownership (foreign invested enterprise) and of course has factories all over the world. I was not aware that it is market leader of pc sales worldwide,  owns Motorola etc. Seems quite promising, with a very low PER (around  4-5) and a constant dividend of also 4 %. \n\nIs  there some truth to these links ? The most blogs seem to hype it a lot  and with the current price around 1 $ it seems like a bargain, but I am  uncertain....would appreciate more meat to the bone\n\n[https://simplywall.st/stocks/hk/tech/hkg-992/lenovo-group-shares/news/returns-on-capital-are-a-standout-for-lenovo-group-hkg992](https://simplywall.st/stocks/hk/tech/hkg-992/lenovo-group-shares/news/returns-on-capital-are-a-standout-for-lenovo-group-hkg992)\n\nor\n\n[https://www.investing.com/news/stock-market-news/lenovo-q1-profit-more-than-doubles-beats-expectations-2586373](https://www.investing.com/news/stock-market-news/lenovo-q1-profit-more-than-doubles-beats-expectations-2586373)",
        "subreddit": "wallstreetbets",
        "title": "Really such a hot pick ? Lenovo ? LNVGF",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p6tx63/really_such_a_hot_pick_lenovo_lnvgf/",
        "created": 1629330677.0
    }
]