[
    {
        "author": "znuxersza",
        "created_utc": 1636296040,
        "id": "qopuxi",
        "num_comments": 32,
        "num_crossposts": 0,
        "selftext": "Hey guys I’m a newbie here. Recently I’ve been looking to invest into a couple of stocks, more specifically NTAP and NNN. However, with the whole Twitter commotion and possible dip in TSLA stock, I am wondering how this could affect the market overall. \n\nCould Elon’s decision have an impact on other stocks on the market? Or would it not impact specific stocks? Or just shake TSLA stock as a whole? I couldn’t really find a discussion on that exact topic on this thread.\n\nI would appreciate your opinions on what kind of impact Elon’s decision could have on the overall Stock market, if any, and if we should hold of with investments to see what actually happens Monday morning.",
        "subreddit": "wallstreetbets",
        "title": "What could the TSLA stocks mean for others?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qopuxi/what_could_the_tsla_stocks_mean_for_others/",
        "created": 1636324840.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1638007910,
        "id": "r3an6a",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hey, earnings for the next week:\n\nWe are getting to the end of earnings season. What are your takeouts?\n\n[app.fincredible.ai](https://preview.redd.it/0r8tgawt44281.png?width=851&amp;format=png&amp;auto=webp&amp;s=c24ab498e22f5a6b5ba49c1617d2be36b6870976)\n\nMON:\n\nBefore MO: $LI $AH $FRO $YJ  \nAfter MC: $ARCE $NVGS $SNEX\n\nTUE:\n\nBefore MO: $JKS $MOMO $CHS $CTRN $BNS $BZUN $WDH $UCL $RDHL\n\nAfter MC: $CRM $ZS $AMBA $BOX $NTAP $HPE $EMKR\n\nWED:\n\nBefore MO: $BBW $REX $DOOO $RY $DCI $GIII $PDCO  \nAfter MC: $CRWD $SNOW $AI $OKTA $FICE $SPLK $VEEV $PVH $SNPS $SMTC\n\nTHU:\n\nBefore MO: $DG $EXPR $SIG $VERU $LE $DLTH $GMS $CM $SCWX $MEI  \nAfter MC: $DOCU $MRVL $ULTA $SWBI $SMAR $ASAN $ZUMZ $OLLI $DOMO $TLYS \n\nFRI:\n\nBefore MO: $BMO $BIG $DOLE $GCO $HIBB $RGCO",
        "subreddit": "smallstreetbets",
        "title": "Most Anticipated Earnings Releases for the week beginning November 29th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r3an6a/most_anticipated_earnings_releases_for_the_week/",
        "created": 1638036710.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1638007902,
        "id": "r3an3s",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hey, earnings for the next week:\n\nWe are getting to the end of earnings season. What are your takeouts?\n\n[app.fincredible.ai](https://preview.redd.it/k49v7ugt44281.png?width=851&amp;format=png&amp;auto=webp&amp;s=bdf09331afd114a1f0b46c768a7ef99cf2f3e0e8)\n\nMON:\n\nBefore MO: $LI $AH $FRO $YJ  \nAfter MC: $ARCE $NVGS $SNEX\n\nTUE:\n\nBefore MO: $JKS $MOMO $CHS $CTRN $BNS $BZUN $WDH $UCL $RDHL\n\nAfter MC: $CRM $ZS $AMBA $BOX $NTAP $HPE $EMKR\n\nWED:\n\nBefore MO: $BBW $REX $DOOO $RY $DCI $GIII $PDCO  \nAfter MC: $CRWD $SNOW $AI $OKTA $FICE $SPLK $VEEV $PVH $SNPS $SMTC\n\nTHU:\n\nBefore MO: $DG $EXPR $SIG $VERU $LE $DLTH $GMS $CM $SCWX $MEI  \nAfter MC: $DOCU $MRVL $ULTA $SWBI $SMAR $ASAN $ZUMZ $OLLI $DOMO $TLYS \n\nFRI:\n\nBefore MO: $BMO $BIG $DOLE $GCO $HIBB $RGCO",
        "subreddit": "StockMarket",
        "title": "Most Anticipated Earnings Releases for the week beginning November 29th, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/r3an3s/most_anticipated_earnings_releases_for_the_week/",
        "created": 1638036702.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1638009235,
        "id": "r3ay84",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hey, earnings for the next week:\n\nWe are getting to the end of earnings season. What are your takeouts after these few weeks?\n\n[app.fincredible.ai](https://preview.redd.it/nosgbfdu84281.png?width=851&amp;format=png&amp;auto=webp&amp;s=914986bcd1069b216782f8149138f2f28bcfa71d)\n\nMON:\n\nBefore MO: $LI $AH $FRO $YJ  \nAfter MC: $ARCE $NVGS $SNEX\n\nTUE:\n\nBefore MO: $JKS $MOMO $CHS $CTRN $BNS $BZUN $WDH $UCL $RDHL\n\nAfter MC: $CRM $ZS $AMBA $BOX $NTAP $HPE $EMKR\n\nWED:\n\nBefore MO: $BBW $REX $DOOO $RY $DCI $GIII $PDCO  \nAfter MC: $CRWD $SNOW $AI $OKTA $FICE $SPLK $VEEV $PVH $SNPS $SMTC\n\nTHU:\n\nBefore MO: $DG $EXPR $SIG $VERU $LE $DLTH $GMS $CM $SCWX $MEI  \nAfter MC: $DOCU $MRVL $ULTA $SWBI $SMAR $ASAN $ZUMZ $OLLI $DOMO $TLYS \n\nFRI:\n\nBefore MO: $BMO $BIG $DOLE $GCO $HIBB $RGCO",
        "subreddit": "CanadianInvestor",
        "title": "Most Anticipated Earnings Releases for the week beginning November 29th, 2021",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/r3ay84/most_anticipated_earnings_releases_for_the_week/",
        "created": 1638038035.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1637961097,
        "id": "r2www1",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Good Friday afternoon to all of you here on r/StockMarket. I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 29th, 2021.\n\n# **Covid developments to rule the market once again in the week ahead after Friday’s rout - [(Source)](https://www.cnbc.com/2021/11/26/covid-developments-to-rule-the-market-once-again-in-the-week-ahead-after-fridays-rout.html)**\n*****\n&gt; Uncertainty about a new emerging coronavirus strain could continue to spook markets, just as Friday’s employment report and other data in the week ahead show the economy has been getting stronger.\n*****\n&gt; Stocks and other risk assets were slammed in the post-Thanksgiving session Friday on reports of a new variant in South Africa, and investors sought safety in Treasurys. Initial reports on the variant show it could be more transmissible than the Delta variant, and scientists are studying how effective vaccines are against it.\n*****\n&gt; The Dow was down 905 points, or 2.5% Friday in its worse day since October, 2020. The S&amp;P 500 tumbled 2.3% Friday to 4,594, giving it a 2.2% decline for the week.\n*****\n&gt; “I think that’s going to override what else we’re going to see,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. “It’s a heavy data week with the ISMs and certainly payrolls, but I think this new variant is going to freeze behavior until there’s more clarity.”\n*****\n&gt; According to Dow Jones, economists expect a strong payroll report Friday, with 581,000 jobs added, after October’s 531,000 payrolls. They expect the economy has shaken off the effects of the slowdown linked to the Covid delta variant, and growth in the current quarter could be far stronger than the third quarter.\n*****\n&gt; The Institute of Supply Management manufacturing survey is released Wednesday, and that should also be strong.\n*****\n&gt; Scott Redler, partner with T3Live.com, said many traders were caught off sides in the shortened session Friday, usually a positive one for the market, and there are key levels the market must hold in the week ahead in order to stage a yearend Santa rally.\n*****\n&gt; “Right now, the market lost some momentum, but it’s not broken. It could be just fine and refuel if the 50-day moving average on the S&amp;P 500 holds next week. It’s all very fluid,” he said.\n*****\n&gt; The 50-day, at 4,527, is a widely-watched momentum indicator, and it is basically the average close of the last 50 sessions.\n*****\n&gt; The market had already been losing momentum this past Monday with a bearish reversal, he said.\n*****\n&gt; “On Wednesday, the market absorbed the weakness and gave traders a false sense of security which is normally a nice easy holiday-shortened session Friday,” Redler said.\n*****\n&gt; Sam Stovall, chief investment strategist at CFRA, said the S&amp;P 500 typically gains 7% between its October low and year-end close, but this year it had already gained more than 9%.\n*****\n&gt; “We’re ahead of the game and due for some sort of digestion,” Stovall said on CNBC.\n*****\n&gt; The Dow dipped more than 1,000 points during Friday trading. Riskier assets were down even more, with the Russell 2000 closing off 3.7% Friday. West Texas Intermediate oil futures plunged more than 12%, and bitcoin was down nearly 8%. Some investors began to reverse bets in the futures market that a strong economic rebound and inflationary pressures would pull the Fed off the sidelines sooner-than-expected.\n*****\n&gt; The 10-year Treasury yield, which moves opposite price, fell to 1.48% from Wednesday’s high of 1.69%.\n*****\n&gt; Investors will be looking for guidance from Fed Chairman Jerome Powell, who appears before Congress in the week ahead with Treasury Secretary Janet Yellen to discuss the coronavirus and the CARES Act stimulus package. On Tuesday, there is a hearing before the Senate Banking Committee.\n*****\n&gt; “I think you have to assume the base case is the virus remains endemic, not back to being a pandemic,” said Barry Knapp, founder of Ironsides Macroeconomics. The worry is that the variant spreads and slows activity, hitting supply chains even more. That could boost inflation while slowing growth.\n*****\n&gt; Knapp said there are risks for stocks, and investors need to be cautious buying the market on the decline.\n*****\n&gt; Knapp said the Fed could end up accelerating the taper of its bond purchases, which would move forward the time frame for potential interest rate hikes.\n*****\n&gt; “The problem with trying to buy the market overall and buying tech stocks in particular is if you buy now because it is down a couple of percent, it rallies into the end of the year and then the market sells off,” he said. For that reason, he favors dipping into cheaper sectors like energy and financials, the worst performing sectors Friday.\n*****\n&gt; Oil and energy will be in the spotlight in the coming week, as OPEC+ meets Thursday. The U.S. and other governments agreed to release oil from their strategic petroleum reserves in an attempt to drive prices lower. The U.S. plans to release 50 million barrels.\n*****\n&gt; OPEC+ has said it would continue to increase production by 400,000 barrels monthly, despite calls from the White House to speed up the release.\n*****\n&gt; Helima Croft, head of global commodities strategy at RBC, said on CNBC there is a chance OPEC could decide to pause its own production increase because of the SPR releases.\n*****\n&gt; “I think as we head into the OPEC meeting Thursday, the question is not only do they do a pause but potentially will they actually pull back some barrels because of concerns about this new variant alongside the very large SPR release,” she said.\n*****\n&gt; She said the U.S. is releasing a record amount of oil. “We are going to have a lot of barrels hitting this market, as we have these concerns about new Covid lockdown restrictions,” she said. “Again, too soon to say whether governments will pull the trigger on such measures, but the market will be concerned.”\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/ISOlH6m.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/ICn6AUF.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/ddHELXX.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/2Qq5aaa.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/Jml9Z5I.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pZuwqcf.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ICn6AUF.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/zz3mXj8.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/RIguq8O.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eQQE2zm.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pX1v49l.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/QA0QmDF.png))**\n\n*****\n\n&gt; # When Stocks Are Up Big YTD Before Thanksgiving\n\n&gt; As the S&amp;P 500 is up rather impressively, 24.9% year-to-date this year through today’s close on the Tuesday before Thanksgiving, we ran the numbers on the 33 previous years with double digit year-to-date gains at this juncture since 1950. There are a few blemishes, but in general market gains continued into yearend.\n\n&gt; Most importantly, there are no major selloffs on this list. The big December decline of -9.2% in 2018 came after the S&amp;P 500 was down -1.2% at this point in the year. After double-digit YTD gains the S&amp;P 500 was up 70% of the time from the Tuesday before Thanksgiving to yearend for an average gain of 2.3%.\n\n&gt; Also of note is that the Santa Claus Rally suffered only four losses in these years. But these four down SCRs in 1955, 1968, 1999 and 2014 were followed by flat years in 1956 and 2015 and down years in 1969 and 2000. As Yale’s famous line states (2021 Almanac page 116 and 2022 Almanac page 118): “If Santa Claus Should Fail To Call, Bears May Come to Broad and Wall.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/2bbdc6f36627e690a68da0b174749618/6328b31e9c88f708-62/s500x750/f9d585fa7d441cb8e0ed7dfe493904d6b68a23ae.jpg))**\n\n*****\n\n&gt; # How Have Stocks Done Under Jerome Powell?\n\n&gt; The big news this week was Jerome Powell will remain in charge of the Federal Reserve (Fed) for four more years, so we wanted to do a quick blog that looked at how stocks have done while he has been the Fed Chairman.\n\n&gt; “There are many reasons for Jerome Powell to lead the Fed for another four years,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But one of the best could very well be that stocks have done quite well under his leadership. Do you really think he’d still be in charge if stocks did poorly under him? Probably not is the answer there.”\n\n&gt; As shown in the LPL Chart of the Day, the Dow has gained 40% under his leadership, ranking him 8th (near the middle of the pack) when compared with all 16 Fed Chairpersons. Interestingly, he ranks just beneath both of his predecessors in Ben Bernanke and Janet Yellen. With four more years to go, you’d have to like his chances there, but Alan Greenspan’s record of 312% is likely safe for the time being.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/11/Blog-11.24.21.png?ssl=1))**\n\n&gt; Here are some more Fed Chair fun facts (using the chart below).\n\n&gt; * On an annualized basis, the Dow has gained 9.3% per annum under Powell, the 7th best out of 16.\n&gt; * Interestingly, stocks have dropped under only one Fed Chairperson and that was Eugene Meyer during the Great Depression.\n&gt; * Taking another look at Greenspan’s 312% return and we realize he was in charge of the Fed for 18.5 years. So his annual return of 8.0% puts things in perspective.\n&gt; * The shortest tenure ever was less than a year and a half back in the late 1970s under William Miller. Meanwhile, the longest ever was William Martin at nearly 19 years.\n&gt; * Paul Volker had the best annualized return at 15.2% over his 8 years. Not to mention he handed things over to Greenspan right before the 1987 crash, one of the best handoffs we’ve ever seen in history.\n&gt; * Lastly, the Fed has been led by a woman only once and that was Janet Yellen, now in charge of the Treasury. It is worth noting that her four-year run at the Fed produced a very impressive 12.9% annualized return for stocks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/11/Chart-11.24.21.png?ssl=1))**\n\n*****\n\n&gt; # Finally Some Clarity on Fed Leadership\n\n&gt; President Biden officially nominated Chairman Jerome Powell to a second four-year term as Chairman of the Federal Reserve (Fed) and elevated current Fed Governor Lael Brainard to Vice Chair of the Committee. Before the announcement, there was speculation that Brainard could replace Powell as Fed Chair.\n\n&gt; We view these nominations as very market friendly. Powell has done a commendable job supporting markets during the COVID-19 shutdowns and we aren’t quite through with the pandemic. We believe stability and leadership continuity is important as we continue to make our way toward the finish line of the COVID-19 pandemic. While Brainard is well qualified to run the Fed, elevating her to Vice Chair recognizes her contributions and potentially puts her in a position to take over the Chair role in four years. Both positions require Congressional approval, and we think both should be confirmed when Congressional hearings conclude sometime over the next few months.\n\n&gt; “As we expected, President Biden chose continuity and familiarity with these Fed appointments,” noted LPL Financial Fixed Income Strategist Lawrence Gillum. “Going with Powell over Brainard is what markets were expecting, so we think markets are relieved that Fed leadership uncertainty is now out of the way.”\n\n&gt; The knee-jerk reaction in the bond market was interesting in that markets seemingly continue to shift the prospects for interest rate hikes forward. As seen on the LPL Research Chart of the Day, Treasury securities across all maturities sold off with two-year tenors among the most (negatively) impacted. Now, two-year Treasury yields are at the highest level since the pandemic began. Short maturity securities are the most impacted by changes in monetary policy. Moreover, markets are pricing in nearly three rate hikes next year with the first rate hike expected in June, which is much more aggressive than the Fed has indicated.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/11/11.23.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; President Biden still has three open Fed Board of Governor positions to fill, so we’re a long way from knowing for sure how Fed policy may change over the next few years. However, we would expect Biden to select governors on the dovish side of the spectrum. That said, the 2022 voting rotation with regional Fed Presidents may impart a hawkish lean to the FOMC overall, offsetting some of the dovish bias from Biden’s appointments. The rotation replaces three solidly dovish and one strongly hawkish voting members with two strongly hawkish and two solidly hawkish officials. Monetary policy is managed at the national level, so while the regional presidents will no doubt have influence, we continue to think the Fed will be more accommodative than markets are currently expecting. In addition, with the announcements today, leadership at the top of the Fed should be seen as being supportive to the economy and thus supportive for markets.\n\n*****\n\n&gt; # Pandemic and Multi-Decade Low for Claims\n\n&gt; Out of the massive slug of economic data this morning, one major bright spot was jobless claims. It has now been 88 weeks since the March 13, 2020 release; the last one before claims began to print in the millions. In that time, claims have fallen to not only take out pre-pandemic levels and the low prior to that of 203K set in April 2019 but today saw the first sub-200K reading since November 20, 1969. That compares to estimates of a reading of 260K and last week's 2K upward revised number of 270K. On a side note, in 2019 there were three weeks where the initial release of initial claims came in below 200K (1/24, 4/11, and 4/18), but they have been since revised higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Claims-SA.png))**\n\n&gt; While that is a significant low in claims, the drop appears to a large degree to be thanks to seasonal adjustment. On a non-seasonally adjusted basis, claims rose to 258.6K which was the highest level in six weeks. It is seasonally normal for claims to head higher during the current week of the year with it having happened over 80% of the time historically. Additionally, that is a bit of catch-up considering claims have been bucking seasonal trends in recent weeks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Claims-Seasonal.png))**\n\n&gt; Continuing claims were also lower this week falling from 2.109 million to 2.049 million. As with initial jobless claims, that sets a new low for the pandemic that is 265K above the level from March 13, 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Con-Claims-SA.png))**\n\n&gt; Factoring in all other programs creates an additional week of lag to the data meaning the most recent print is through the first week of November. The final week of October's unusual uptick on account of peculiar growth in claims for expired programs has unwound in the most recent week's data. PUA claims were more than cut in half as PEUC claims also fell by 121K. Combined that resulted in a new low of 2.44 million claims.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Claims-NSA.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending November 26th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 11.28.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$CRM $ASAN $CRWD $SNOW $AI $OKTA $SPLK $DOCU $SNEX $JKS $MOMO $CHS $WDH $UCL $RDHL $ZS $AMBA $BOX $NTAP $HPE $BBW $RY $DCI $VEEV $DG $EXPR $SIG $VERU $LE $MRVL $ULTA $SWBI**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/eQQE2zm.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/EDL3xa4.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/OkxZbaZ.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.29.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/XWYrfnw.png))\n\n&gt; # ***Monday 11.29.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/E6rgE4M.png))\n\n*****\n\n&gt; # ***Tuesday  11.30.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jqz0nFS.png))\n\n&gt; # ***Tuesday 11.30.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oFuzxf4.png))\n\n*****\n\n&gt; # ***Wednesday 12.1.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/EUMKcBz.png))\n\n&gt; # ***Wednesday 12.1.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7VZJksg.png))\n\n*****\n\n&gt; # ***Thursday 12.2.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/N3mMigQ.png))\n\n&gt; # ***Thursday 12.2.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/4ob72Tx.png))\n\n*****\n\n&gt; # ***Friday 12.3.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/5E0Yzkt.png))\n\n*****\n\n&gt; # ***Friday 12.3.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n&gt; **(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/StockMarket. :)",
        "subreddit": "StockMarket",
        "title": "Wall Street Week Ahead for the trading week beginning November 29th, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/r2www1/wall_street_week_ahead_for_the_trading_week/",
        "created": 1637989897.0
    },
    {
        "author": "znuxersza",
        "created_utc": 1636295713,
        "id": "qopr9b",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Newbie here. I’ve been looking to get on some NTAP and NNN stock on Monday but with the whole TSLA thing I’m not sure if it could shake the market. Should I hold off with the investments to see what happens? Could Elon shake the other stocks as well?",
        "subreddit": "wallstreetbets",
        "title": "Should we hold off with investments until Monday?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qopr9b/should_we_hold_off_with_investments_until_monday/",
        "created": 1636324513.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1637961152,
        "id": "r2wxjc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Good Friday afternoon to all of you here on r/smallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and are ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 29th, 2021.\n\n# **Covid developments to rule the market once again in the week ahead after Friday’s rout - [(Source)](https://www.cnbc.com/2021/11/26/covid-developments-to-rule-the-market-once-again-in-the-week-ahead-after-fridays-rout.html)**\n*****\n&gt; Uncertainty about a new emerging coronavirus strain could continue to spook markets, just as Friday’s employment report and other data in the week ahead show the economy has been getting stronger.\n*****\n&gt; Stocks and other risk assets were slammed in the post-Thanksgiving session Friday on reports of a new variant in South Africa, and investors sought safety in Treasurys. Initial reports on the variant show it could be more transmissible than the Delta variant, and scientists are studying how effective vaccines are against it.\n*****\n&gt; The Dow was down 905 points, or 2.5% Friday in its worse day since October, 2020. The S&amp;P 500 tumbled 2.3% Friday to 4,594, giving it a 2.2% decline for the week.\n*****\n&gt; “I think that’s going to override what else we’re going to see,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. “It’s a heavy data week with the ISMs and certainly payrolls, but I think this new variant is going to freeze behavior until there’s more clarity.”\n*****\n&gt; According to Dow Jones, economists expect a strong payroll report Friday, with 581,000 jobs added, after October’s 531,000 payrolls. They expect the economy has shaken off the effects of the slowdown linked to the Covid delta variant, and growth in the current quarter could be far stronger than the third quarter.\n*****\n&gt; The Institute of Supply Management manufacturing survey is released Wednesday, and that should also be strong.\n*****\n&gt; Scott Redler, partner with T3Live.com, said many traders were caught off sides in the shortened session Friday, usually a positive one for the market, and there are key levels the market must hold in the week ahead in order to stage a yearend Santa rally.\n*****\n&gt; “Right now, the market lost some momentum, but it’s not broken. It could be just fine and refuel if the 50-day moving average on the S&amp;P 500 holds next week. It’s all very fluid,” he said.\n*****\n&gt; The 50-day, at 4,527, is a widely-watched momentum indicator, and it is basically the average close of the last 50 sessions.\n*****\n&gt; The market had already been losing momentum this past Monday with a bearish reversal, he said.\n*****\n&gt; “On Wednesday, the market absorbed the weakness and gave traders a false sense of security which is normally a nice easy holiday-shortened session Friday,” Redler said.\n*****\n&gt; Sam Stovall, chief investment strategist at CFRA, said the S&amp;P 500 typically gains 7% between its October low and year-end close, but this year it had already gained more than 9%.\n*****\n&gt; “We’re ahead of the game and due for some sort of digestion,” Stovall said on CNBC.\n*****\n&gt; The Dow dipped more than 1,000 points during Friday trading. Riskier assets were down even more, with the Russell 2000 closing off 3.7% Friday. West Texas Intermediate oil futures plunged more than 12%, and bitcoin was down nearly 8%. Some investors began to reverse bets in the futures market that a strong economic rebound and inflationary pressures would pull the Fed off the sidelines sooner-than-expected.\n*****\n&gt; The 10-year Treasury yield, which moves opposite price, fell to 1.48% from Wednesday’s high of 1.69%.\n*****\n&gt; Investors will be looking for guidance from Fed Chairman Jerome Powell, who appears before Congress in the week ahead with Treasury Secretary Janet Yellen to discuss the coronavirus and the CARES Act stimulus package. On Tuesday, there is a hearing before the Senate Banking Committee.\n*****\n&gt; “I think you have to assume the base case is the virus remains endemic, not back to being a pandemic,” said Barry Knapp, founder of Ironsides Macroeconomics. The worry is that the variant spreads and slows activity, hitting supply chains even more. That could boost inflation while slowing growth.\n*****\n&gt; Knapp said there are risks for stocks, and investors need to be cautious buying the market on the decline.\n*****\n&gt; Knapp said the Fed could end up accelerating the taper of its bond purchases, which would move forward the time frame for potential interest rate hikes.\n*****\n&gt; “The problem with trying to buy the market overall and buying tech stocks in particular is if you buy now because it is down a couple of percent, it rallies into the end of the year and then the market sells off,” he said. For that reason, he favors dipping into cheaper sectors like energy and financials, the worst performing sectors Friday.\n*****\n&gt; Oil and energy will be in the spotlight in the coming week, as OPEC+ meets Thursday. The U.S. and other governments agreed to release oil from their strategic petroleum reserves in an attempt to drive prices lower. The U.S. plans to release 50 million barrels.\n*****\n&gt; OPEC+ has said it would continue to increase production by 400,000 barrels monthly, despite calls from the White House to speed up the release.\n*****\n&gt; Helima Croft, head of global commodities strategy at RBC, said on CNBC there is a chance OPEC could decide to pause its own production increase because of the SPR releases.\n*****\n&gt; “I think as we head into the OPEC meeting Thursday, the question is not only do they do a pause but potentially will they actually pull back some barrels because of concerns about this new variant alongside the very large SPR release,” she said.\n*****\n&gt; She said the U.S. is releasing a record amount of oil. “We are going to have a lot of barrels hitting this market, as we have these concerns about new Covid lockdown restrictions,” she said. “Again, too soon to say whether governments will pull the trigger on such measures, but the market will be concerned.”\n\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/ISOlH6m.png))**\n\n# **S&amp;P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/ICn6AUF.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/ddHELXX.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/2Qq5aaa.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/Jml9Z5I.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pZuwqcf.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ICn6AUF.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/zz3mXj8.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/RIguq8O.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/eQQE2zm.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/pX1v49l.png))**\n\n# **Friday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/QA0QmDF.png))**\n\n*****\n\n&gt; # When Stocks Are Up Big YTD Before Thanksgiving\n\n&gt; As the S&amp;P 500 is up rather impressively, 24.9% year-to-date this year through today’s close on the Tuesday before Thanksgiving, we ran the numbers on the 33 previous years with double digit year-to-date gains at this juncture since 1950. There are a few blemishes, but in general market gains continued into yearend.\n\n&gt; Most importantly, there are no major selloffs on this list. The big December decline of -9.2% in 2018 came after the S&amp;P 500 was down -1.2% at this point in the year. After double-digit YTD gains the S&amp;P 500 was up 70% of the time from the Tuesday before Thanksgiving to yearend for an average gain of 2.3%.\n\n&gt; Also of note is that the Santa Claus Rally suffered only four losses in these years. But these four down SCRs in 1955, 1968, 1999 and 2014 were followed by flat years in 1956 and 2015 and down years in 1969 and 2000. As Yale’s famous line states (2021 Almanac page 116 and 2022 Almanac page 118): “If Santa Claus Should Fail To Call, Bears May Come to Broad and Wall.”\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/2bbdc6f36627e690a68da0b174749618/6328b31e9c88f708-62/s500x750/f9d585fa7d441cb8e0ed7dfe493904d6b68a23ae.jpg))**\n\n*****\n\n&gt; # How Have Stocks Done Under Jerome Powell?\n\n&gt; The big news this week was Jerome Powell will remain in charge of the Federal Reserve (Fed) for four more years, so we wanted to do a quick blog that looked at how stocks have done while he has been the Fed Chairman.\n\n&gt; “There are many reasons for Jerome Powell to lead the Fed for another four years,” explained LPL Financial Chief Market Strategist Ryan Detrick. “But one of the best could very well be that stocks have done quite well under his leadership. Do you really think he’d still be in charge if stocks did poorly under him? Probably not is the answer there.”\n\n&gt; As shown in the LPL Chart of the Day, the Dow has gained 40% under his leadership, ranking him 8th (near the middle of the pack) when compared with all 16 Fed Chairpersons. Interestingly, he ranks just beneath both of his predecessors in Ben Bernanke and Janet Yellen. With four more years to go, you’d have to like his chances there, but Alan Greenspan’s record of 312% is likely safe for the time being.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/11/Blog-11.24.21.png?ssl=1))**\n\n&gt; Here are some more Fed Chair fun facts (using the chart below).\n\n&gt; * On an annualized basis, the Dow has gained 9.3% per annum under Powell, the 7th best out of 16.\n&gt; * Interestingly, stocks have dropped under only one Fed Chairperson and that was Eugene Meyer during the Great Depression.\n&gt; * Taking another look at Greenspan’s 312% return and we realize he was in charge of the Fed for 18.5 years. So his annual return of 8.0% puts things in perspective.\n&gt; * The shortest tenure ever was less than a year and a half back in the late 1970s under William Miller. Meanwhile, the longest ever was William Martin at nearly 19 years.\n&gt; * Paul Volker had the best annualized return at 15.2% over his 8 years. Not to mention he handed things over to Greenspan right before the 1987 crash, one of the best handoffs we’ve ever seen in history.\n&gt; * Lastly, the Fed has been led by a woman only once and that was Janet Yellen, now in charge of the Treasury. It is worth noting that her four-year run at the Fed produced a very impressive 12.9% annualized return for stocks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/11/Chart-11.24.21.png?ssl=1))**\n\n*****\n\n&gt; # Finally Some Clarity on Fed Leadership\n\n&gt; President Biden officially nominated Chairman Jerome Powell to a second four-year term as Chairman of the Federal Reserve (Fed) and elevated current Fed Governor Lael Brainard to Vice Chair of the Committee. Before the announcement, there was speculation that Brainard could replace Powell as Fed Chair.\n\n&gt; We view these nominations as very market friendly. Powell has done a commendable job supporting markets during the COVID-19 shutdowns and we aren’t quite through with the pandemic. We believe stability and leadership continuity is important as we continue to make our way toward the finish line of the COVID-19 pandemic. While Brainard is well qualified to run the Fed, elevating her to Vice Chair recognizes her contributions and potentially puts her in a position to take over the Chair role in four years. Both positions require Congressional approval, and we think both should be confirmed when Congressional hearings conclude sometime over the next few months.\n\n&gt; “As we expected, President Biden chose continuity and familiarity with these Fed appointments,” noted LPL Financial Fixed Income Strategist Lawrence Gillum. “Going with Powell over Brainard is what markets were expecting, so we think markets are relieved that Fed leadership uncertainty is now out of the way.”\n\n&gt; The knee-jerk reaction in the bond market was interesting in that markets seemingly continue to shift the prospects for interest rate hikes forward. As seen on the LPL Research Chart of the Day, Treasury securities across all maturities sold off with two-year tenors among the most (negatively) impacted. Now, two-year Treasury yields are at the highest level since the pandemic began. Short maturity securities are the most impacted by changes in monetary policy. Moreover, markets are pricing in nearly three rate hikes next year with the first rate hike expected in June, which is much more aggressive than the Fed has indicated.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2021/11/11.23.21-Blog-Chart-1.png?ssl=1))**\n\n&gt; President Biden still has three open Fed Board of Governor positions to fill, so we’re a long way from knowing for sure how Fed policy may change over the next few years. However, we would expect Biden to select governors on the dovish side of the spectrum. That said, the 2022 voting rotation with regional Fed Presidents may impart a hawkish lean to the FOMC overall, offsetting some of the dovish bias from Biden’s appointments. The rotation replaces three solidly dovish and one strongly hawkish voting members with two strongly hawkish and two solidly hawkish officials. Monetary policy is managed at the national level, so while the regional presidents will no doubt have influence, we continue to think the Fed will be more accommodative than markets are currently expecting. In addition, with the announcements today, leadership at the top of the Fed should be seen as being supportive to the economy and thus supportive for markets.\n\n*****\n\n&gt; # Pandemic and Multi-Decade Low for Claims\n\n&gt; Out of the massive slug of economic data this morning, one major bright spot was jobless claims. It has now been 88 weeks since the March 13, 2020 release; the last one before claims began to print in the millions. In that time, claims have fallen to not only take out pre-pandemic levels and the low prior to that of 203K set in April 2019 but today saw the first sub-200K reading since November 20, 1969. That compares to estimates of a reading of 260K and last week's 2K upward revised number of 270K. On a side note, in 2019 there were three weeks where the initial release of initial claims came in below 200K (1/24, 4/11, and 4/18), but they have been since revised higher.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Claims-SA.png))**\n\n&gt; While that is a significant low in claims, the drop appears to a large degree to be thanks to seasonal adjustment. On a non-seasonally adjusted basis, claims rose to 258.6K which was the highest level in six weeks. It is seasonally normal for claims to head higher during the current week of the year with it having happened over 80% of the time historically. Additionally, that is a bit of catch-up considering claims have been bucking seasonal trends in recent weeks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Claims-Seasonal.png))**\n\n&gt; Continuing claims were also lower this week falling from 2.109 million to 2.049 million. As with initial jobless claims, that sets a new low for the pandemic that is 265K above the level from March 13, 2020.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Con-Claims-SA.png))**\n\n&gt; Factoring in all other programs creates an additional week of lag to the data meaning the most recent print is through the first week of November. The final week of October's unusual uptick on account of peculiar growth in claims for expired programs has unwound in the most recent week's data. PUA claims were more than cut in half as PEUC claims also fell by 121K. Combined that resulted in a new low of 2.44 million claims.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/11/112421-Claims-NSA.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending November 26th, 2021** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 11.28.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!]())**\n(VIDEO NOT YET POSTED.)\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * (**$CRM $ASAN $CRWD $SNOW $AI $OKTA $SPLK $DOCU $SNEX $JKS $MOMO $CHS $WDH $UCL $RDHL $ZS $AMBA $BOX $NTAP $HPE $BBW $RY $DCI $VEEV $DG $EXPR $SIG $VERU $LE $MRVL $ULTA $SWBI**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/eQQE2zm.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/EDL3xa4.png))**\n###### **([CLICK HERE FOR THE MOST NOTABLE EARNINGS RELEASES BEFORE MONDAY'S OPEN!](https://i.imgur.com/OkxZbaZ.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 11.29.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/XWYrfnw.png))\n\n&gt; # ***Monday 11.29.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/E6rgE4M.png))\n\n*****\n\n&gt; # ***Tuesday  11.30.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/jqz0nFS.png))\n\n&gt; # ***Tuesday 11.30.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/oFuzxf4.png))\n\n*****\n\n&gt; # ***Wednesday 12.1.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/EUMKcBz.png))\n\n&gt; # ***Wednesday 12.1.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7VZJksg.png))\n\n*****\n\n&gt; # ***Thursday 12.2.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/N3mMigQ.png))\n\n&gt; # ***Thursday 12.2.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/4ob72Tx.png))\n\n*****\n\n&gt; # ***Friday 12.3.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK!](https://i.imgur.com/5E0Yzkt.png))\n\n*****\n\n&gt; # ***Friday 12.3.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # (T.B.A. THIS WEEKEND.)\n&gt; **(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n&gt; #([CLICK HERE FOR THE CHART!](https://charts.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/smallstreetbets. :)",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning November 29th, 2021",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r2wxjc/wall_street_week_ahead_for_the_trading_week/",
        "created": 1637989952.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638280535,
        "id": "r5nsh3",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to the final trading day of November! Here are your pre-market stock movers &amp; news on this Tuesday, November 30th, 2021-\n\n*****\n\n# [Dow futures are down more than 350 points as investors try to gauge the economic impact of omicron](https://www.cnbc.com/2021/11/29/stock-market-futures-open-to-close-news.html)\n\n*****\n&gt; Stock futures tumbled in early Tuesday trading, reversing a Monday rebound on Wall Street as investors reassessed risks associated with the new omicron Covid variant.\n*****\n&gt; Futures on the Dow Jones Industrial Average dropped 390 points, or 1.1%. S&amp;P 500 futures tumbled 0.9% and Nasdaq 100 futures shed 0.5%.\n*****\n&gt; The reversal came after Moderna CEO Stephane Bancel told the Financial Times that he expects existing vaccines to be less effective against the new variant. The CEO told the paper there could be a “material drop” in the current vaccines’ effectiveness against this variant. Bancel told CNBC on Monday that it could take months to develop and ship an omicron-specific vaccine.\n*****\n&gt; Separately, Regeneron said its antibody treatment may have reduced effectiveness against omicron. Regeneron shares lost 3% in premarket trading.\n*****\n&gt; The 10-year Treasury yield fell further below 1.45% as investors worried about the economy slowing because of the new variant. The 10-year rate lost 9 basis points to 1.44% (1 basis point equals 0.01%). The yield on the 10-year Treasury was as high as 1.69% last week before Friday’s drop below 1.5%.\n*****\n&gt; The futures move lower follows a volatile last few sessions as investors evaluate the omicron impact. The Dow lost 905 points on Friday, then rebounded by 237 points on Monday.\n*****\n&gt; Travel shares, which led Friday’s drop and then gained on Monday, were taking hits once again in premarket trading Tuesday. Expedia Group fell 2.3%, Norwegian Cruise Line Holdings tumbled 3.8% and American Airlines shares were off 3.3%.\n*****\n&gt; “We have to expect...that the scenarios, all scenarios, include discoveries of people in this country with omicron and talk that the vaccines don’t work or if they did those who have had Covid have no immunity,” wrote CNBC’s Jim Cramer on Twitter Tuesday. “These all cause selling.”\n*****\n&gt; Some leading pharma stocks also took a hit, with Moderna getting the worst of it as the stock decreased 4.2%. Pfizer, however, was one of the few companies to post gains on the S&amp;P 500, rising 1.2%. Stay-at-home stock Netflix also rose, up 0.7% and videoconference leader Zoom saw shares climb 2.3%.\n*****\n&gt; Major averages rose to session highs on Monday after President Joe Biden said economic lockdowns are currently off the table and there will be no new travel restrictions.\n*****\n&gt; The new Covid variant, first detected in South Africa, has now been found in more than a dozen countries, causing many to restrict travel. The World Health Organization labeled the omicron strain a “variant of concern” on Friday when the Dow slid 900 points to suffer its worst day since October 2020.\n*****\n&gt; Covid symptoms linked to the omicron variant have been described as “extremely mild” by the South African doctor who first raised the alarm over the new strain. Still, the WHO said it will take weeks to understand how the variant may affect diagnostics, therapeutics and vaccines.\n*****\n&gt; Federal Reserve Chairman Jerome Powell will tell the Senate Tuesday as part of his quarterly testimony on the pandemic that he believes that the omicron variant poses “downside risks to employment and economic activity.” It also further complicates the inflation outlook, the Fed chief said in his prepared markets released Monday evening.\n*****\n&gt; “Greater concerns about the virus could reduce people’s willingness to work in person, which would slow progress in the labor market and intensify supply-chain disruptions,” Powell will say.\n*****\n&gt; The CBOE volatility index, also known as the VIX or Wall Street’s fear gauge, declined during Monday’s rally but still remained above 22. The gauge spiked 10 points above 28 at one point on Friday. The VIX was higher again on Tuesday.\n*****\n&gt; “This week will be instructive to see if the buy-the-dip approach by investors is still in play, or if markets are vulnerable to a more significant pullback,” said Mark Hackett, chief of investment research at Nationwide.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/Kjg0zwO.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/aaRkgfQ.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/q4uP0Vh.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/Jml9Z5I.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/T3ao2E5.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($LI $CRM $CRWD $DOCU $SNOW $AI $DG $MRVL $ZS $ASAN $OKTA $ULTA $AMBA $NTAP $SIG $EXPR $HPE $BBW $BQ $BNS $JKS $FRO $MOMO $HIBB $SPLK $SWBI $QH $RY $CHS $BZUN $FIVE $BOX $VERU $YJ $KR $CTRN $TD $VEEV $BIG $GMS $DOOO $CM $EMKR $PVH)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/5ocvp67.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($JKS $MOMO $BNS $CHS $BQ $BZUN $CTRN $RDHL $UCL $ARCE $SNEX $NVGS $WDH $GBDC $INFA $BFRI)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/j6KX8En.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/tjqxvE3.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/sugyIG5.png)**)\n\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/wNc4EG0.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/rhobqci.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/hrF7U5G.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/kLlwiak.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!]()**)\n(NONE.)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* PPSI\n* HOOD\n* TGTX\n* TWTR\n* LUNA.X\n* ETH.X\n* REQ.X\n* IMGN\n* TIGR\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/11/30/stocks-making-the-biggest-moves-premarket-regeneron-moderna-dollar-tree-and-more.html)**)\n\n*****\n\n&gt; **Regeneron Pharmaceuticals (REGN)** — Regeneron shares fell more than 1% in the premarket after the company said its Covid-19 antibody cocktail and similar drugs could be less effective against the omicron Covid variant. The drugmaker said mutations in the variant suggest “there may be reduced neutralization activity of both vaccine-induced and monoclonal antibody conveyed immunity.”\n\n&gt; #**STOCK SYMBOL:** REGN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=REGN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/REGN)**)\n\n*****\n\n&gt; **Moderna (MRNA), Pfizer (PFE)** — Shares of vaccine makers were on watch after Moderna CEO Stephane Bancel told the Financial Times he expects existing vaccines to be less effective against the omicron variant. Oxford University said there is no evidence yet that current vaccines will not protect against severe disease from omicron. Researchers are still studying the new variant and its ability to evade prior immunity. Moderna shares fell more than 2% in early morning trading. BioNTech shares fell more than 5%. Pfizer shares gained roughly 1%. Novavax shares added more than 2%.\n\n&gt; #**STOCK SYMBOL:** MRNA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MRNA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRNA)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** PFE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PFE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PFE)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** — Shares of Dollar Tree fell more than 2% in premarket trading after Goldman downgraded the stock to neutral from a buy. The firm said the stock is too expensive at current levels as Dollar Tree’s comeback story is now priced in.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **SolarEdge Technologies (SEDG)** — Shares of SolarEdge pulled back about 3% premarket after Morgan Stanley downgraded the stock to equal-weight from overweight. Morgan Stanley said the stock appears to be fully valued after a recent hot streak.\n\n&gt; #**STOCK SYMBOL:** SEDG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SEDG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SEDG)**)\n\n*****\n\n&gt; **Meta Platforms (FB)** — Shares of Facebook-parent Meta were slightly lower in the premarket after a U.K. regulator told the company it must sell GIF-sharing platform Giphy. The Competition and Markets Authority said Meta’s acquisition of Giphy would reduce competition between social media platforms.\n\n&gt; #**STOCK SYMBOL:** FB\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FB)**)\n\n*****\n\n&gt; **Beyond Meat (BYND), Oatly (OTLY)** — Shares of meat alternative producer Beyond Meat and plant-based dairy company Oatly each retreated more than 1% in early morning trading after HSBC initiated coverage of the stocks at a “reduce” rating. In a report on the alternative proteins market, HSBC said, “Given the prospect of heightened competition, the growth we forecast will be insufficient for many participants to achieve their lofty growth ambitions.”\n\n&gt; #**STOCK SYMBOL:** OTLY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=OTLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/OTLY)**)\n\n*****\n\n&gt; **Twitter (TWTR), Square (SQ)** — Shares of Twitter and Square moved higher in the premarket the day after Jack Dorsey announced he is stepping down as CEO of Twitter. Dorsey was serving as chief executive at both the social media platform and digital payments company Square. Bank of America upgraded Square to neutral from underperform and reiterate a buy rating for Twitter.\n\n&gt; #**STOCK SYMBOL:** TWTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TWTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TWTR)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** SQ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SQ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SQ)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, November 30th, 2021! :)**",
        "subreddit": "smallstreetbets",
        "title": "(11/30) Tuesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r5nsh3/1130_tuesdays_premarket_stock_movers_news/",
        "created": 1638309335.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638192297,
        "id": "r4vs7f",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "# Good Monday morning traders and investors of the r/smallstreetbets sub! Welcome to the new trading week and a fresh start! Here are your pre-market stock movers &amp; news on this Monday, November 29th, 2021-\n\n*****\n\n# [Dow futures rebound by 200 points after Friday’s big sell-off as investors reassess omicron risk](https://www.cnbc.com/2021/11/28/stock-market-futures-open-to-close-news.html)\n*****\n&gt; Stock futures pointed to a rebound following Friday’s big sell-off, as investors monitor the latest developments related to the Covid omicron variant and assess its potential market impact.\n*****\n&gt; Futures on the Dow Jones Industrial Average gained 210 points, or 0.6%. S&amp;P 500 futures added 0.8% and Nasdaq 100 futures rose about 0.9%.\n*****\n&gt; Stocks are coming off a holiday-shortened session Friday in which the Dow posted its worst day since October 2020. The Dow was down 905 points, or 2.5%. The S&amp;P 500 tumbled 2.3% and the Nasdaq Composite slipped 2.2%. The three major indexes were negative for the week.\n*****\n&gt; The World Health Organization on Friday labeled the omicron strain a “variant of concern.” While scientists continue to research the variant, omicron’s large number of mutations has raised alarm. Preliminary evidence suggests the strain has an increased risk of reinfection, according to the WHO. The variant was first reported to the WHO from South Africa and has been found in the U.K., Israel, Belgium, the Netherlands, Germany, Italy, Australia and Hong Kong, but not yet in the U.S. Many countries, including the U.S., moved to restrict travel from southern Africa.\n*****\n&gt; The South African doctor who first raised the alarm over the new variant told the BBC that patients had “extremely mild” symptoms though it was too early to determine how omicron behaves before it is studied closely.\n*****\n&gt; “While it is too early to have definitive data, early reported data suggest that the Omicron virus causes ‘mild to moderate’ symptoms (less severity) and is more transmissible,” Bill Ackman of Pershing Square Capital Management tweeted Sunday evening. “If this turns out to be true, this is bullish not bearish for markets.”\n*****\n&gt; Stocks that were the hardest hit on Friday were rebounding the most on Monday.\n*****\n&gt; Travel related stocks were up across the board. Carnival and Norwegian cruise lines were up more than 4% apiece in premarket trading. American, Delta and United airlines were up more than 2% each. Booking Holdings was up 2%. Boeing was up 1.7%.\n*****\n&gt; “We would be aggressive buyers of this pullback,” wrote Fundstrat’s Tom Lee in a note to clients Sunday night. “As with the case for Beta and Delta variants, the ‘bark’ has proven worse than the bite in each of those precedent instances. The market carnage, in our view, will be short-lived and transitory.”\n*****\n&gt; The 10-year Treasury yield rebounded back above 1.5% after a flight to safety Friday sent investors scrambling into bonds and rates lower (Prices move inversely to yields). Bank of America, American Express and other financials gained on the rebound in yields.\n*****\n&gt; One stock that continued its Friday trend was Moderna. The vaccine maker’s stock was up another 10% in premarket trading after jumping 20% on Friday.\n*****\n&gt; Vaccine makers have announced measures to investigate omicron with testing already underway. While it remains to be seen how omicron responds to current vaccines or whether new formulations are required, Moderna’s Chief Medical Officer Paul Burton said Sunday the vaccine maker could roll out a reformulated vaccine against the omicron variant early next year.\n*****\n&gt; Wall Street’s fear gauge — the CBOE volatility index — was retreating again Monday after a 10-point spike on Friday. UBS looked at the last 17 times since 1990 when the VIX surged 10 points in a single day and found markets tended to snap back in the subsequent trading days. The S&amp;P 500 was higher by 2.5%, on average, the next trading day and 1.6% higher, on average, over the next week, UBS found.\n*****\n&gt; On top of Covid developments, investors are also anticipating key economic data released this week.\n*****\n&gt; The November jobs report on Friday is expected to show solid jobs growth. Economists surveyed by Dow Jones expect 581,000 jobs added in November. The Institute of Supply Management manufacturing survey is released Wednesday and economists also expect strong results.\n*****\n&gt; “The pandemic and COVID variants remain one of the biggest risks to markets, and are likely to continue to inject volatility over the next year(s). It’s hard to say at this point how lasting or impactful this latest variant will be for markets,” Keith Lerner, co-chief investment officer at Truist Advisory Services, said in a note Friday.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#LAST WEEK'S MARKET MAP:\n######(**[CLICK HERE FOR LAST WEEK'S MARKET MAP!](https://i.imgur.com/ISOlH6m.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#LAST WEEK'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR LAST WEEK'S S&amp;P SECTORS CHART!](https://i.imgur.com/ICn6AUF.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/b1c86w4.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/Jml9Z5I.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/T3ao2E5.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($LI $CRM $CRWD $DOCU $SNOW $AI $DG $MRVL $ZS $ASAN $OKTA $ULTA $AMBA $NTAP $SIG $EXPR $HPE $BBW $BQ $BNS $JKS $FRO $MOMO $HIBB $SPLK $SWBI $QH $RY $CHS $BZUN $FIVE $BOX $VERU $YJ $KR $CTRN $TD $VEEV $BIG $GMS $DOOO $CM $EMKR $PVH)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/5ocvp67.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($LI $FRO $YJ $QH)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/OkxZbaZ.png)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/r4x7q0v.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/cx4jqmC.png)**)\n\n*****\n\n#FRIDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR FRIDAY'S ANALYST UPGRADES/DOWNGRADES!](https://i.imgur.com/QA0QmDF.png)**)\n\n\n*****\n\n#FRIDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR FRIDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/pMH4OQW.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!]()**)\n(NONE.)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* NRXP\n* ATNF\n* BFRI\n* APDN\n* KRYS\n* LI\n* VXRT\n* BYSI\n* BIRD\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/11/29/stocks-making-the-biggest-moves-premarket-moderna-carnival-zoom-and-more.html)**)\n\n*****\n\n&gt; **Moderna** — Shares of the vaccine maker continued their rally, jumping more than 11% in early morning trading Monday after gaining 20% on Friday. On Sunday the company’s chief medical officer said Moderna could roll out a reformulated vaccine against the omicron variant of Covid early next year.\n\n&gt; #**STOCK SYMBOL:** MRNA\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=MRNA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRNA)**)\n\n*****\n\n&gt; **Airlines** — Major airlines ticked up as investors bought the dip following new travel suspensions in Asia and Europe, in response to the newly discovered omicron variant of Covid-19. United, Delta and American Airlines each gained about 1%, after losing about 7% Friday. Travel booking site Expedia also rose, about 2%.\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** DAL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=DAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DAL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** AAL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=AAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAL)**)\n\n*****\n\n&gt; **Cruise lines** — Carnival, Royal Caribbean Cruises and Norwegian Cruise Line Holdings each rose more than 3% amid the broader rebound in travel stocks from Friday’s omicron-driven sell-off.\n\n&gt; #**STOCK SYMBOL:** CCL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=CCL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CCL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** RCL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=RCL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RCL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** NCLH\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=NCLH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NCLH)**)\n\n*****\n\n&gt; **Allbirds** — Shares of the shoe manufacturer rose 2.5% after several analysts initiated coverage of the stock. Morgan Stanley and Bank of America both posted a price target of $23, implying 16% upside to Friday’s close.\n\n&gt; #**STOCK SYMBOL:** BIRD\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=BIRD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BIRD)**)\n\n*****\n\n&gt; **Coinbase** — The cryptocurrency exchange’s shares rose more than 2% as the price of bitcoin rebounded, after selling off with the broader equities market on Friday. Other crypto-related equities got a lift too, with Microstrategy rising 3.4%. Tesla and Square added more than 1%.\n\n&gt; #**STOCK SYMBOL:** COIN\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=COIN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/COIN)**)\n\n*****\n\n&gt; **Zoom Video** — Zoom shares fell almost 2%, moving in the opposite direction of travel stocks and following a 5.7% jump on Friday. Other stay-at-home stocks dipped slightly Monday morning too, including Peloton, Netflix and Teladoc.\n\n&gt; #**STOCK SYMBOL:** ZM\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=ZM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ZM)**)\n\n*****\n\n&gt; **Merck** — The pharmaceutical company’s shares fell 1.8% after Citi downgraded its stock to neutral from buy, saying development struggles for the company’s HIV drug islatravir will hurt Merck’s long-term potential.\n\n&gt; #**STOCK SYMBOL:** MRK\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=MRK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRK)**)\n\n*****\n\n&gt; **Wynn Resorts, Las Vegas Sands** — The Macao gaming sector is lower after Alvin Chau, the head of Macau’s biggest casino junket operator, and 10 others were arrested over allegedly illegal gambling platforms targeting mainland Chinese, according to a report by the South China Morning Post. Wynn fell 1.9% and Las Vegas Sands fell 1.2%\n\n&gt; #**STOCK SYMBOL:** WYNN\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=WYNN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WYNN)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, November 29th, 2021! :)**",
        "subreddit": "smallstreetbets",
        "title": "(11/29) Monday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/r4vs7f/1129_mondays_premarket_stock_movers_news/",
        "created": 1638221097.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638280478,
        "id": "r5nruk",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to the final trading day of November! Here are your pre-market stock movers &amp; news on this Tuesday, November 30th, 2021-\n\n*****\n\n# [Dow futures are down more than 350 points as investors try to gauge the economic impact of omicron](https://www.cnbc.com/2021/11/29/stock-market-futures-open-to-close-news.html)\n\n*****\n&gt; Stock futures tumbled in early Tuesday trading, reversing a Monday rebound on Wall Street as investors reassessed risks associated with the new omicron Covid variant.\n*****\n&gt; Futures on the Dow Jones Industrial Average dropped 390 points, or 1.1%. S&amp;P 500 futures tumbled 0.9% and Nasdaq 100 futures shed 0.5%.\n*****\n&gt; The reversal came after Moderna CEO Stephane Bancel told the Financial Times that he expects existing vaccines to be less effective against the new variant. The CEO told the paper there could be a “material drop” in the current vaccines’ effectiveness against this variant. Bancel told CNBC on Monday that it could take months to develop and ship an omicron-specific vaccine.\n*****\n&gt; Separately, Regeneron said its antibody treatment may have reduced effectiveness against omicron. Regeneron shares lost 3% in premarket trading.\n*****\n&gt; The 10-year Treasury yield fell further below 1.45% as investors worried about the economy slowing because of the new variant. The 10-year rate lost 9 basis points to 1.44% (1 basis point equals 0.01%). The yield on the 10-year Treasury was as high as 1.69% last week before Friday’s drop below 1.5%.\n*****\n&gt; The futures move lower follows a volatile last few sessions as investors evaluate the omicron impact. The Dow lost 905 points on Friday, then rebounded by 237 points on Monday.\n*****\n&gt; Travel shares, which led Friday’s drop and then gained on Monday, were taking hits once again in premarket trading Tuesday. Expedia Group fell 2.3%, Norwegian Cruise Line Holdings tumbled 3.8% and American Airlines shares were off 3.3%.\n*****\n&gt; “We have to expect...that the scenarios, all scenarios, include discoveries of people in this country with omicron and talk that the vaccines don’t work or if they did those who have had Covid have no immunity,” wrote CNBC’s Jim Cramer on Twitter Tuesday. “These all cause selling.”\n*****\n&gt; Some leading pharma stocks also took a hit, with Moderna getting the worst of it as the stock decreased 4.2%. Pfizer, however, was one of the few companies to post gains on the S&amp;P 500, rising 1.2%. Stay-at-home stock Netflix also rose, up 0.7% and videoconference leader Zoom saw shares climb 2.3%.\n*****\n&gt; Major averages rose to session highs on Monday after President Joe Biden said economic lockdowns are currently off the table and there will be no new travel restrictions.\n*****\n&gt; The new Covid variant, first detected in South Africa, has now been found in more than a dozen countries, causing many to restrict travel. The World Health Organization labeled the omicron strain a “variant of concern” on Friday when the Dow slid 900 points to suffer its worst day since October 2020.\n*****\n&gt; Covid symptoms linked to the omicron variant have been described as “extremely mild” by the South African doctor who first raised the alarm over the new strain. Still, the WHO said it will take weeks to understand how the variant may affect diagnostics, therapeutics and vaccines.\n*****\n&gt; Federal Reserve Chairman Jerome Powell will tell the Senate Tuesday as part of his quarterly testimony on the pandemic that he believes that the omicron variant poses “downside risks to employment and economic activity.” It also further complicates the inflation outlook, the Fed chief said in his prepared markets released Monday evening.\n*****\n&gt; “Greater concerns about the virus could reduce people’s willingness to work in person, which would slow progress in the labor market and intensify supply-chain disruptions,” Powell will say.\n*****\n&gt; The CBOE volatility index, also known as the VIX or Wall Street’s fear gauge, declined during Monday’s rally but still remained above 22. The gauge spiked 10 points above 28 at one point on Friday. The VIX was higher again on Tuesday.\n*****\n&gt; “This week will be instructive to see if the buy-the-dip approach by investors is still in play, or if markets are vulnerable to a more significant pullback,” said Mark Hackett, chief of investment research at Nationwide.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/Kjg0zwO.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/aaRkgfQ.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/q4uP0Vh.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/Jml9Z5I.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/T3ao2E5.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($LI $CRM $CRWD $DOCU $SNOW $AI $DG $MRVL $ZS $ASAN $OKTA $ULTA $AMBA $NTAP $SIG $EXPR $HPE $BBW $BQ $BNS $JKS $FRO $MOMO $HIBB $SPLK $SWBI $QH $RY $CHS $BZUN $FIVE $BOX $VERU $YJ $KR $CTRN $TD $VEEV $BIG $GMS $DOOO $CM $EMKR $PVH)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/5ocvp67.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($JKS $MOMO $BNS $CHS $BQ $BZUN $CTRN $RDHL $UCL $ARCE $SNEX $NVGS $WDH $GBDC $INFA $BFRI)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/j6KX8En.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/tjqxvE3.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/sugyIG5.png)**)\n\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/wNc4EG0.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/rhobqci.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/hrF7U5G.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS LINK #1!](https://i.imgur.com/kLlwiak.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!]()**)\n(NONE.)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* PPSI\n* HOOD\n* TGTX\n* TWTR\n* LUNA.X\n* ETH.X\n* REQ.X\n* IMGN\n* TIGR\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/11/30/stocks-making-the-biggest-moves-premarket-regeneron-moderna-dollar-tree-and-more.html)**)\n\n*****\n\n&gt; **Regeneron Pharmaceuticals (REGN)** — Regeneron shares fell more than 1% in the premarket after the company said its Covid-19 antibody cocktail and similar drugs could be less effective against the omicron Covid variant. The drugmaker said mutations in the variant suggest “there may be reduced neutralization activity of both vaccine-induced and monoclonal antibody conveyed immunity.”\n\n&gt; #**STOCK SYMBOL:** REGN\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=REGN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/REGN)**)\n\n*****\n\n&gt; **Moderna (MRNA), Pfizer (PFE)** — Shares of vaccine makers were on watch after Moderna CEO Stephane Bancel told the Financial Times he expects existing vaccines to be less effective against the omicron variant. Oxford University said there is no evidence yet that current vaccines will not protect against severe disease from omicron. Researchers are still studying the new variant and its ability to evade prior immunity. Moderna shares fell more than 2% in early morning trading. BioNTech shares fell more than 5%. Pfizer shares gained roughly 1%. Novavax shares added more than 2%.\n\n&gt; #**STOCK SYMBOL:** MRNA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MRNA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRNA)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** PFE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PFE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PFE)**)\n\n*****\n\n&gt; **Dollar Tree (DLTR)** — Shares of Dollar Tree fell more than 2% in premarket trading after Goldman downgraded the stock to neutral from a buy. The firm said the stock is too expensive at current levels as Dollar Tree’s comeback story is now priced in.\n\n&gt; #**STOCK SYMBOL:** DLTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DLTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DLTR)**)\n\n*****\n\n&gt; **SolarEdge Technologies (SEDG)** — Shares of SolarEdge pulled back about 3% premarket after Morgan Stanley downgraded the stock to equal-weight from overweight. Morgan Stanley said the stock appears to be fully valued after a recent hot streak.\n\n&gt; #**STOCK SYMBOL:** SEDG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SEDG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SEDG)**)\n\n*****\n\n&gt; **Meta Platforms (FB)** — Shares of Facebook-parent Meta were slightly lower in the premarket after a U.K. regulator told the company it must sell GIF-sharing platform Giphy. The Competition and Markets Authority said Meta’s acquisition of Giphy would reduce competition between social media platforms.\n\n&gt; #**STOCK SYMBOL:** FB\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=FB&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/FB)**)\n\n*****\n\n&gt; **Beyond Meat (BYND), Oatly (OTLY)** — Shares of meat alternative producer Beyond Meat and plant-based dairy company Oatly each retreated more than 1% in early morning trading after HSBC initiated coverage of the stocks at a “reduce” rating. In a report on the alternative proteins market, HSBC said, “Given the prospect of heightened competition, the growth we forecast will be insufficient for many participants to achieve their lofty growth ambitions.”\n\n&gt; #**STOCK SYMBOL:** OTLY\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=OTLY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/OTLY)**)\n\n*****\n\n&gt; **Twitter (TWTR), Square (SQ)** — Shares of Twitter and Square moved higher in the premarket the day after Jack Dorsey announced he is stepping down as CEO of Twitter. Dorsey was serving as chief executive at both the social media platform and digital payments company Square. Bank of America upgraded Square to neutral from underperform and reiterate a buy rating for Twitter.\n\n&gt; #**STOCK SYMBOL:** TWTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=TWTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/TWTR)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** SQ\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SQ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SQ)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, November 30th, 2021! :)**",
        "subreddit": "StockMarket",
        "title": "(11/30) Tuesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/StockMarket/comments/r5nruk/1130_tuesdays_premarket_stock_movers_news/",
        "created": 1638309278.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1638008306,
        "id": "r3aqfx",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hey, earnings for the next week:\n\nWe are getting to the end of earnings season. What are your takeouts after these few weeks?\n\n[app.fincredible.ai](https://preview.redd.it/yul7ek2464281.png?width=851&amp;format=png&amp;auto=webp&amp;s=0b704a700ae972f8ecc5c0a437dd12a66640c47b)\n\nMON:\n\nBefore MO: $LI $AH $FRO $YJ  \nAfter MC: $ARCE $NVGS $SNEX\n\nTUE:\n\nBefore MO: $JKS $MOMO $CHS $CTRN $BNS $BZUN $WDH $UCL $RDHL\n\nAfter MC: $CRM $ZS $AMBA $BOX $NTAP $HPE $EMKR\n\nWED:\n\nBefore MO: $BBW $REX $DOOO $RY $DCI $GIII $PDCO  \nAfter MC: $CRWD $SNOW $AI $OKTA $FICE $SPLK $VEEV $PVH $SNPS $SMTC\n\nTHU:\n\nBefore MO: $DG $EXPR $SIG $VERU $LE $DLTH $GMS $CM $SCWX $MEI  \nAfter MC: $DOCU $MRVL $ULTA $SWBI $SMAR $ASAN $ZUMZ $OLLI $DOMO $TLYS \n\nFRI:\n\nBefore MO: $BMO $BIG $DOLE $GCO $HIBB $RGCO",
        "subreddit": "investing_discussion",
        "title": "Most Anticipated Earnings Releases for the week beginning November 29th, 2021",
        "url": "https://www.reddit.com/r/investing_discussion/comments/r3aqfx/most_anticipated_earnings_releases_for_the_week/",
        "created": 1638037106.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1638192244,
        "id": "r4vrmf",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "# Good Monday morning traders and investors of the r/StockMarket sub! Welcome to the new trading week and a fresh start! Here are your pre-market stock movers &amp; news on this Monday, November 29th, 2021-\n\n*****\n\n# [Dow futures rebound by 200 points after Friday’s big sell-off as investors reassess omicron risk](https://www.cnbc.com/2021/11/28/stock-market-futures-open-to-close-news.html)\n*****\n&gt; Stock futures pointed to a rebound following Friday’s big sell-off, as investors monitor the latest developments related to the Covid omicron variant and assess its potential market impact.\n*****\n&gt; Futures on the Dow Jones Industrial Average gained 210 points, or 0.6%. S&amp;P 500 futures added 0.8% and Nasdaq 100 futures rose about 0.9%.\n*****\n&gt; Stocks are coming off a holiday-shortened session Friday in which the Dow posted its worst day since October 2020. The Dow was down 905 points, or 2.5%. The S&amp;P 500 tumbled 2.3% and the Nasdaq Composite slipped 2.2%. The three major indexes were negative for the week.\n*****\n&gt; The World Health Organization on Friday labeled the omicron strain a “variant of concern.” While scientists continue to research the variant, omicron’s large number of mutations has raised alarm. Preliminary evidence suggests the strain has an increased risk of reinfection, according to the WHO. The variant was first reported to the WHO from South Africa and has been found in the U.K., Israel, Belgium, the Netherlands, Germany, Italy, Australia and Hong Kong, but not yet in the U.S. Many countries, including the U.S., moved to restrict travel from southern Africa.\n*****\n&gt; The South African doctor who first raised the alarm over the new variant told the BBC that patients had “extremely mild” symptoms though it was too early to determine how omicron behaves before it is studied closely.\n*****\n&gt; “While it is too early to have definitive data, early reported data suggest that the Omicron virus causes ‘mild to moderate’ symptoms (less severity) and is more transmissible,” Bill Ackman of Pershing Square Capital Management tweeted Sunday evening. “If this turns out to be true, this is bullish not bearish for markets.”\n*****\n&gt; Stocks that were the hardest hit on Friday were rebounding the most on Monday.\n*****\n&gt; Travel related stocks were up across the board. Carnival and Norwegian cruise lines were up more than 4% apiece in premarket trading. American, Delta and United airlines were up more than 2% each. Booking Holdings was up 2%. Boeing was up 1.7%.\n*****\n&gt; “We would be aggressive buyers of this pullback,” wrote Fundstrat’s Tom Lee in a note to clients Sunday night. “As with the case for Beta and Delta variants, the ‘bark’ has proven worse than the bite in each of those precedent instances. The market carnage, in our view, will be short-lived and transitory.”\n*****\n&gt; The 10-year Treasury yield rebounded back above 1.5% after a flight to safety Friday sent investors scrambling into bonds and rates lower (Prices move inversely to yields). Bank of America, American Express and other financials gained on the rebound in yields.\n*****\n&gt; One stock that continued its Friday trend was Moderna. The vaccine maker’s stock was up another 10% in premarket trading after jumping 20% on Friday.\n*****\n&gt; Vaccine makers have announced measures to investigate omicron with testing already underway. While it remains to be seen how omicron responds to current vaccines or whether new formulations are required, Moderna’s Chief Medical Officer Paul Burton said Sunday the vaccine maker could roll out a reformulated vaccine against the omicron variant early next year.\n*****\n&gt; Wall Street’s fear gauge — the CBOE volatility index — was retreating again Monday after a 10-point spike on Friday. UBS looked at the last 17 times since 1990 when the VIX surged 10 points in a single day and found markets tended to snap back in the subsequent trading days. The S&amp;P 500 was higher by 2.5%, on average, the next trading day and 1.6% higher, on average, over the next week, UBS found.\n*****\n&gt; On top of Covid developments, investors are also anticipating key economic data released this week.\n*****\n&gt; The November jobs report on Friday is expected to show solid jobs growth. Economists surveyed by Dow Jones expect 581,000 jobs added in November. The Institute of Supply Management manufacturing survey is released Wednesday and economists also expect strong results.\n*****\n&gt; “The pandemic and COVID variants remain one of the biggest risks to markets, and are likely to continue to inject volatility over the next year(s). It’s hard to say at this point how lasting or impactful this latest variant will be for markets,” Keith Lerner, co-chief investment officer at Truist Advisory Services, said in a note Friday.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#LAST WEEK'S MARKET MAP:\n######(**[CLICK HERE FOR LAST WEEK'S MARKET MAP!](https://i.imgur.com/ISOlH6m.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#LAST WEEK'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR LAST WEEK'S S&amp;P SECTORS CHART!](https://i.imgur.com/ICn6AUF.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/b1c86w4.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/Jml9Z5I.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/T3ao2E5.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($LI $CRM $CRWD $DOCU $SNOW $AI $DG $MRVL $ZS $ASAN $OKTA $ULTA $AMBA $NTAP $SIG $EXPR $HPE $BBW $BQ $BNS $JKS $FRO $MOMO $HIBB $SPLK $SWBI $QH $RY $CHS $BZUN $FIVE $BOX $VERU $YJ $KR $CTRN $TD $VEEV $BIG $GMS $DOOO $CM $EMKR $PVH)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/5ocvp67.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($LI $FRO $YJ $QH)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/OkxZbaZ.png)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES!](https://i.imgur.com/r4x7q0v.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES!](https://i.imgur.com/cx4jqmC.png)**)\n\n*****\n\n#FRIDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR FRIDAY'S ANALYST UPGRADES/DOWNGRADES!](https://i.imgur.com/QA0QmDF.png)**)\n\n\n*****\n\n#FRIDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR FRIDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/pMH4OQW.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR!]()**)\n(NONE.)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* NRXP\n* ATNF\n* BFRI\n* APDN\n* KRYS\n* LI\n* VXRT\n* BYSI\n* BIRD\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/11/29/stocks-making-the-biggest-moves-premarket-moderna-carnival-zoom-and-more.html)**)\n\n*****\n\n&gt; **Moderna** — Shares of the vaccine maker continued their rally, jumping more than 11% in early morning trading Monday after gaining 20% on Friday. On Sunday the company’s chief medical officer said Moderna could roll out a reformulated vaccine against the omicron variant of Covid early next year.\n\n&gt; #**STOCK SYMBOL:** MRNA\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=MRNA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRNA)**)\n\n*****\n\n&gt; **Airlines** — Major airlines ticked up as investors bought the dip following new travel suspensions in Asia and Europe, in response to the newly discovered omicron variant of Covid-19. United, Delta and American Airlines each gained about 1%, after losing about 7% Friday. Travel booking site Expedia also rose, about 2%.\n\n&gt; #**STOCK SYMBOL:** UAL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=UAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** DAL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=DAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DAL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** AAL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=AAL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/AAL)**)\n\n*****\n\n&gt; **Cruise lines** — Carnival, Royal Caribbean Cruises and Norwegian Cruise Line Holdings each rose more than 3% amid the broader rebound in travel stocks from Friday’s omicron-driven sell-off.\n\n&gt; #**STOCK SYMBOL:** CCL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=CCL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CCL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** RCL\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=RCL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/RCL)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** NCLH\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=NCLH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NCLH)**)\n\n*****\n\n&gt; **Allbirds** — Shares of the shoe manufacturer rose 2.5% after several analysts initiated coverage of the stock. Morgan Stanley and Bank of America both posted a price target of $23, implying 16% upside to Friday’s close.\n\n&gt; #**STOCK SYMBOL:** BIRD\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=BIRD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/BIRD)**)\n\n*****\n\n&gt; **Coinbase** — The cryptocurrency exchange’s shares rose more than 2% as the price of bitcoin rebounded, after selling off with the broader equities market on Friday. Other crypto-related equities got a lift too, with Microstrategy rising 3.4%. Tesla and Square added more than 1%.\n\n&gt; #**STOCK SYMBOL:** COIN\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=COIN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/COIN)**)\n\n*****\n\n&gt; **Zoom Video** — Zoom shares fell almost 2%, moving in the opposite direction of travel stocks and following a 5.7% jump on Friday. Other stay-at-home stocks dipped slightly Monday morning too, including Peloton, Netflix and Teladoc.\n\n&gt; #**STOCK SYMBOL:** ZM\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=ZM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/ZM)**)\n\n*****\n\n&gt; **Merck** — The pharmaceutical company’s shares fell 1.8% after Citi downgraded its stock to neutral from buy, saying development struggles for the company’s HIV drug islatravir will hurt Merck’s long-term potential.\n\n&gt; #**STOCK SYMBOL:** MRK\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=MRK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MRK)**)\n\n*****\n\n&gt; **Wynn Resorts, Las Vegas Sands** — The Macao gaming sector is lower after Alvin Chau, the head of Macau’s biggest casino junket operator, and 10 others were arrested over allegedly illegal gambling platforms targeting mainland Chinese, according to a report by the South China Morning Post. Wynn fell 1.9% and Las Vegas Sands fell 1.2%\n\n&gt; #**STOCK SYMBOL:** WYNN\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=WYNN&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/WYNN)**)\n\n*****\n\n&gt; #**STOCK SYMBOL:** LVS\n\n&gt; * [CLICK HERE FOR CHART!](http://charts.finviz.com/chart.ashx?t=LVS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/LVS)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Monday, November 29th, 2021! :)**",
        "subreddit": "StockMarket",
        "title": "(11/29) Monday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/StockMarket/comments/r4vrmf/1129_mondays_premarket_stock_movers_news/",
        "created": 1638221044.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1635857619,
        "id": "ql3izg",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/StockMarket sub! Welcome to Tuesday! Here are your pre-market stock movers &amp; news on this Tuesday, November 2nd, 2021-\n\n*****\n\n# [Stock futures are little changed as major averages hover near records; Tesla shares slide](https://www.cnbc.com/2021/11/01/stock-market-futures-open-to-close-news.html)\n\n*****\n&gt; Stock futures were basically flat in early morning trading on Tuesday after the S&amp;P 500 eked out a fresh record close on Monday to kick off November.\n*****\n&gt; Futures tied to the Dow Jones Industrial Average were up by 38 points. S&amp;P 500 futures were flat and Nasdaq 100 futures was lower by 0.15%\n*****\n&gt; All three major U.S. stock indexes hit new intraday highs and closed at records during Monday’s regular session as investors continue to bet on a year-end rally despite supply chain issues, Covid risk and a Federal Reserve that’s about to indicate it’s going to pull back on some stimulus. The Fed’s two-day meeting begins Tuesday.\n*****\n&gt; The S&amp;P 500 has averaged gains of 1.1% in November and 2.3% in December since 1936, notes Bank of America. The final month of the year is in the green 79% of the time, the firm notes. However, Bank of America is cautious.\n*****\n&gt; “We continue to see downside risks ahead,” wrote Savita Subramanian, the bank’s head of U.S. equity and quantitative strategy. “Despite a strong 7% beat, 2021-22 EPS remains largely unchanged, suggesting the upward revision cycle has likely peaked.”\n*****\n&gt; Tesla shares cooled off Tuesday after popping during the end of October. Shares of the electric automaker tumbled 5% premarket, though they are up 55% over just the past month. The drop follows a report that the carmaker is recalling 11,700 of its vehicles due to a communications error, and a tweet from company founder Elon Musk that Tesla has yet to sign a contract with rental giant Hertz.\n*****\n&gt; Pfizer shares were up 1.8% in premarket trading after the drug maker’s third-quarter profit topped expectations. It also raised its 2021 revenue and EPS outlook.\n*****\n&gt; Shares of materials giant DuPont de Nemours fell nearly 4% after the company said it is buying engineering materials technology maker Rogers Corp for $5.2 billion. DuPont also reported a 33% increase in adjusted third-quarter earnings.\n*****\n&gt; Under Armour shares soared nearly 10% after the athletic retailer hiked its annual outlook.\n*****\n&gt; On Monday, the Dow rose 94.3 points. The S&amp;P 500 rose nearly 0.2%. The Nasdaq Composite added 0.6%. The small-cap Russell 2000 gained 2.7%, its best daily performance since August.\n*****\n&gt; The Fed at the conclusion of its two-day meeting on Wednesday is expected to announce it will begin unwinding its $120 billion in monthly bond purchases implemented during the pandemic.\n*****\n&gt; The October jobs report is on Friday.\n*****\n&gt; “The November FOMC meeting, October payrolls ... and a host of earnings updates sets up a catalyst heavy week of trading ahead,” Goldman Sachs’ Chris Hussey said in a note.\n*****\n&gt; Better-than-expected corporate earnings results boosted the U.S. stock averages to finish October at record highs, with the S&amp;P 500 and Nasdaq posting their best months since November 2020.\n*****\n&gt; As of Monday evening according to FactSet, 55.8% of S&amp;P 500 companies have reported quarterly financial results, with 82% beating earnings estimates.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mbQdPjs.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/vaORLAk.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/9Rrbjyg.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/uaTjkhx.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/bKWDopV.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($SQ $PFE $ROKU $MRNA $PINS $ON $DKNG $UBER $APPS $QCOM $CRSR $PENN $SKLZ $PCG $CVS $TRVG $CRNT $ABNB $ATVI $MRO $MELI $DVN $FANG $BP $PTON $CGC $VIAC $AMG $FSLY $UAA $EPD $ET $NET $AKTS $ZG $GNRC $ALX $CNA $TMUS $SKC $RIG)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/HovAdxl.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($PFE $CRSR $BP $UAA $COP $GNRC $EPD $RACE $EL $MPC $LPX $ARCB $GPN $CTLT $RL $BLMN $MPLX $IDXX $NRZ $CMI $BHC $ZBRA $IT $MGY $ESPR $DD $KKR $APO $ETN $AME $MIME $ADCT $ROK $TECH $INCY $LIND $BCC $SAGE $LGIH $IEP $LEA)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/53VLxUW.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #1!](https://i.imgur.com/LP69zIw.png)**)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #2!](https://i.imgur.com/IWaFYUR.png)**)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #3!](https://i.imgur.com/IA1HwBL.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #1!](https://i.imgur.com/n7GayLd.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #2!](https://i.imgur.com/h4f5OtE.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #3!](https://i.imgur.com/ysSbo0i.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #4!](https://i.imgur.com/ycH9aVx.png)**)\n\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/zKN9CD3.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/Mm0cU5s.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/M0Y7bN5.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/poUGTRm.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK!](https://i.imgur.com/gE6O83n.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* TSLA\n* LRC.X\n* PFE\n* FSR\n* FCEL\n* CRSR\n* CHGG\n* DOT.X\n* VUZI\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/11/02/stocks-making-the-biggest-moves-in-the-premarket-pfizer-under-armour-generac-and-more.html)**)\n\n*****\n\n&gt; **Pfizer (PFE)** – Pfizer jumped 4% in the premarket after the drugmaker reported better-than-expected profit and revenue for the third quarter. Pfizer earned $1.34 per share, 25 cents a share above estimates. The company also issued an improved full-year forecast on strong demand for both its Covid-19 vaccine and non-Covid treatments.\n\n&gt; #**STOCK SYMBOL:** PFE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PFE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PFE)**)\n\n*****\n\n&gt; **Under Armour (UAA)** – The athletic apparel maker’s shares surged 9.2% in premarket trading after it more than doubled the 15 cents a share consensus estimate, with quarterly earnings of 31 cents per share. Under Armour also raised its full-year outlook, as consumers maintain a high interest in comfortable daily wear.\n\n&gt; #**STOCK SYMBOL:** UAA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAA)**)\n\n*****\n\n&gt; **Generac (GNRC)** – Generac shares slid 5.5% in the premarket after beating bottom-line estimates but reporting lower-than-expected quarterly sales. Separately, the maker of home and commercial generators announced it is buying Canada-based smart thermostat maker Ecobee in a cash-and-stock deal that could be worth up to $770 million, depending on whether Ecobee reaches certain performance targets.\n\n&gt; #**STOCK SYMBOL:** GNRC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GNRC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GNRC)**)\n\n*****\n\n&gt; **DuPont (DD)** – DuPont fell 1.9% in premarket action after the chemical maker beat estimates but cut its full-year outlook citing decelerating orders from customers due to the worldwide chip shortage. DuPont came in 3 cents a share above estimates, with third-quarter profit of $1.15 per share. Separately, DuPont announced the acquisition of materials technology company Rogers Corp. (ROG) in a $5.2 billion deal, with Rogers soaring 27.3% following news of the deal.\n\n&gt; #**STOCK SYMBOL:** DD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DD)**)\n\n*****\n\n&gt; **Estee Lauder (EL)** – The cosmetics maker’s stock dropped 1.9% in the premarket, as it beat Street forecasts but cut its annual sales outlook due to inflation and supply chain disruptions. Estee Lauder earned $1.86 per share for the quarter, compared to a $1.70 share consensus estimate.\n\n&gt; #**STOCK SYMBOL:** EL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=EL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/EL)**)\n\n*****\n\n&gt; **Avis Budget (CAR)** – Avis Budget reported quarterly earnings of $10.74 per share, well above the $6.52 a share consensus estimate. Revenue also topped Wall Street forecasts. Heavy demand for rental cars and higher rental rates gave a significant boost to Avis Budget’s results. The stock rallied 7% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** CAR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CAR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CAR)**)\n\n*****\n\n&gt; **Simon Property (SPG)** – Simon nearly doubled the $1.09 per share consensus estimate, with quarterly earnings of $2.07 per share. The mall operator’s revenue also came in above analysts’ projections. Simon saw improved occupancy rates for its shopping malls during the quarter as well as an increase in shopper traffic. Simon shares rallied 4.1% in premarket action.\n\n&gt; #**STOCK SYMBOL:** SPG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SPG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SPG)**)\n\n*****\n\n&gt; **Clorox (CLX)** – Clorox beat estimates by 18 cents a share, with quarterly earnings of $1.21 per share. The household products maker posted better-than-expected revenue as well, and Clorox backed its prior full-year forecast. Its stock was up 2.2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** CLX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CLX)**)\n\n*****\n\n&gt; **Chegg (CHGG)** – Chegg shares tanked 31.5% in the premarket after the online education company reported lower-than-expected quarterly sales and merely matched Street estimates, with quarterly earnings of 20 cents per share. Chegg said enrollment did not bounce back as it had expected.\n\n&gt; #**STOCK SYMBOL:** CHGG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CHGG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CHGG)**)\n\n*****\n\n&gt; **Nutrien (NTR)** – Nutrien raised its full-year profit outlook, amid strong global demand and higher prices for the Canadian fertilizer maker’s products.\n\n&gt; #**STOCK SYMBOL:** NTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NTR)**)\n\n*****\n\n&gt; **McKesson (MCK)** – The drug distributor earned $6.15 per share for its latest quarter, easily beating the consensus estimate of $4.66 a share. Revenue topping estimates as well, driven by strong delivery numbers for more expensive specialty drugs as well as its government contract to distribute Covid-19 vaccines. McKesson shares gained 3.4% in the premarket.\n\n&gt; #**STOCK SYMBOL:** MCK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MCK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MCK)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/StockMarket?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, November 2nd, 2021! :)**",
        "subreddit": "StockMarket",
        "title": "(11/2) Tuesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/StockMarket/comments/ql3izg/112_tuesdays_premarket_stock_movers_news/",
        "created": 1635886419.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1635857771,
        "id": "ql3krw",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/wallstreetbets sub! Welcome to Tuesday! Here are your pre-market stock movers &amp; news on this Tuesday, November 2nd, 2021-\n\n*****\n\n# [Stock futures are little changed as major averages hover near records; Tesla shares slide](https://www.cnbc.com/2021/11/01/stock-market-futures-open-to-close-news.html)\n\n*****\n&gt; Stock futures were basically flat in early morning trading on Tuesday after the S&amp;P 500 eked out a fresh record close on Monday to kick off November.\n*****\n&gt; Futures tied to the Dow Jones Industrial Average were up by 38 points. S&amp;P 500 futures were flat and Nasdaq 100 futures was lower by 0.15%\n*****\n&gt; All three major U.S. stock indexes hit new intraday highs and closed at records during Monday’s regular session as investors continue to bet on a year-end rally despite supply chain issues, Covid risk and a Federal Reserve that’s about to indicate it’s going to pull back on some stimulus. The Fed’s two-day meeting begins Tuesday.\n*****\n&gt; The S&amp;P 500 has averaged gains of 1.1% in November and 2.3% in December since 1936, notes Bank of America. The final month of the year is in the green 79% of the time, the firm notes. However, Bank of America is cautious.\n*****\n&gt; “We continue to see downside risks ahead,” wrote Savita Subramanian, the bank’s head of U.S. equity and quantitative strategy. “Despite a strong 7% beat, 2021-22 EPS remains largely unchanged, suggesting the upward revision cycle has likely peaked.”\n*****\n&gt; Tesla shares cooled off Tuesday after popping during the end of October. Shares of the electric automaker tumbled 5% premarket, though they are up 55% over just the past month. The drop follows a report that the carmaker is recalling 11,700 of its vehicles due to a communications error, and a tweet from company founder Elon Musk that Tesla has yet to sign a contract with rental giant Hertz.\n*****\n&gt; Pfizer shares were up 1.8% in premarket trading after the drug maker’s third-quarter profit topped expectations. It also raised its 2021 revenue and EPS outlook.\n*****\n&gt; Shares of materials giant DuPont de Nemours fell nearly 4% after the company said it is buying engineering materials technology maker Rogers Corp for $5.2 billion. DuPont also reported a 33% increase in adjusted third-quarter earnings.\n*****\n&gt; Under Armour shares soared nearly 10% after the athletic retailer hiked its annual outlook.\n*****\n&gt; On Monday, the Dow rose 94.3 points. The S&amp;P 500 rose nearly 0.2%. The Nasdaq Composite added 0.6%. The small-cap Russell 2000 gained 2.7%, its best daily performance since August.\n*****\n&gt; The Fed at the conclusion of its two-day meeting on Wednesday is expected to announce it will begin unwinding its $120 billion in monthly bond purchases implemented during the pandemic.\n*****\n&gt; The October jobs report is on Friday.\n*****\n&gt; “The November FOMC meeting, October payrolls ... and a host of earnings updates sets up a catalyst heavy week of trading ahead,” Goldman Sachs’ Chris Hussey said in a note.\n*****\n&gt; Better-than-expected corporate earnings results boosted the U.S. stock averages to finish October at record highs, with the S&amp;P 500 and Nasdaq posting their best months since November 2020.\n*****\n&gt; As of Monday evening according to FactSet, 55.8% of S&amp;P 500 companies have reported quarterly financial results, with 82% beating earnings estimates.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mbQdPjs.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/vaORLAk.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/9Rrbjyg.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/uaTjkhx.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/bKWDopV.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($SQ $PFE $ROKU $MRNA $PINS $ON $DKNG $UBER $APPS $QCOM $CRSR $PENN $SKLZ $PCG $CVS $TRVG $CRNT $ABNB $ATVI $MRO $MELI $DVN $FANG $BP $PTON $CGC $VIAC $AMG $FSLY $UAA $EPD $ET $NET $AKTS $ZG $GNRC $ALX $CNA $TMUS $SKC $RIG)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/HovAdxl.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($PFE $CRSR $BP $UAA $COP $GNRC $EPD $RACE $EL $MPC $LPX $ARCB $GPN $CTLT $RL $BLMN $MPLX $IDXX $NRZ $CMI $BHC $ZBRA $IT $MGY $ESPR $DD $KKR $APO $ETN $AME $MIME $ADCT $ROK $TECH $INCY $LIND $BCC $SAGE $LGIH $IEP $LEA)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/53VLxUW.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #1!](https://i.imgur.com/LP69zIw.png)**)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #2!](https://i.imgur.com/IWaFYUR.png)**)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #3!](https://i.imgur.com/IA1HwBL.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #1!](https://i.imgur.com/n7GayLd.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #2!](https://i.imgur.com/h4f5OtE.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #3!](https://i.imgur.com/ysSbo0i.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #4!](https://i.imgur.com/ycH9aVx.png)**)\n\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/zKN9CD3.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/Mm0cU5s.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/M0Y7bN5.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/poUGTRm.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK!](https://i.imgur.com/gE6O83n.png)**)\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/11/02/stocks-making-the-biggest-moves-in-the-premarket-pfizer-under-armour-generac-and-more.html)**)\n\n*****\n\n&gt; **Pfizer (PFE)** – Pfizer jumped 4% in the premarket after the drugmaker reported better-than-expected profit and revenue for the third quarter. Pfizer earned $1.34 per share, 25 cents a share above estimates. The company also issued an improved full-year forecast on strong demand for both its Covid-19 vaccine and non-Covid treatments.\n\n&gt; #**STOCK SYMBOL:** PFE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PFE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PFE)**)\n\n*****\n\n&gt; **Under Armour (UAA)** – The athletic apparel maker’s shares surged 9.2% in premarket trading after it more than doubled the 15 cents a share consensus estimate, with quarterly earnings of 31 cents per share. Under Armour also raised its full-year outlook, as consumers maintain a high interest in comfortable daily wear.\n\n&gt; #**STOCK SYMBOL:** UAA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAA)**)\n\n*****\n\n&gt; **Generac (GNRC)** – Generac shares slid 5.5% in the premarket after beating bottom-line estimates but reporting lower-than-expected quarterly sales. Separately, the maker of home and commercial generators announced it is buying Canada-based smart thermostat maker Ecobee in a cash-and-stock deal that could be worth up to $770 million, depending on whether Ecobee reaches certain performance targets.\n\n&gt; #**STOCK SYMBOL:** GNRC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GNRC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GNRC)**)\n\n*****\n\n&gt; **DuPont (DD)** – DuPont fell 1.9% in premarket action after the chemical maker beat estimates but cut its full-year outlook citing decelerating orders from customers due to the worldwide chip shortage. DuPont came in 3 cents a share above estimates, with third-quarter profit of $1.15 per share. Separately, DuPont announced the acquisition of materials technology company Rogers Corp. (ROG) in a $5.2 billion deal, with Rogers soaring 27.3% following news of the deal.\n\n&gt; #**STOCK SYMBOL:** DD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DD)**)\n\n*****\n\n&gt; **Estee Lauder (EL)** – The cosmetics maker’s stock dropped 1.9% in the premarket, as it beat Street forecasts but cut its annual sales outlook due to inflation and supply chain disruptions. Estee Lauder earned $1.86 per share for the quarter, compared to a $1.70 share consensus estimate.\n\n&gt; #**STOCK SYMBOL:** EL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=EL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/EL)**)\n\n*****\n\n&gt; **Avis Budget (CAR)** – Avis Budget reported quarterly earnings of $10.74 per share, well above the $6.52 a share consensus estimate. Revenue also topped Wall Street forecasts. Heavy demand for rental cars and higher rental rates gave a significant boost to Avis Budget’s results. The stock rallied 7% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** CAR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CAR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CAR)**)\n\n*****\n\n&gt; **Simon Property (SPG)** – Simon nearly doubled the $1.09 per share consensus estimate, with quarterly earnings of $2.07 per share. The mall operator’s revenue also came in above analysts’ projections. Simon saw improved occupancy rates for its shopping malls during the quarter as well as an increase in shopper traffic. Simon shares rallied 4.1% in premarket action.\n\n&gt; #**STOCK SYMBOL:** SPG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SPG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SPG)**)\n\n*****\n\n&gt; **Clorox (CLX)** – Clorox beat estimates by 18 cents a share, with quarterly earnings of $1.21 per share. The household products maker posted better-than-expected revenue as well, and Clorox backed its prior full-year forecast. Its stock was up 2.2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** CLX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CLX)**)\n\n*****\n\n&gt; **Chegg (CHGG)** – Chegg shares tanked 31.5% in the premarket after the online education company reported lower-than-expected quarterly sales and merely matched Street estimates, with quarterly earnings of 20 cents per share. Chegg said enrollment did not bounce back as it had expected.\n\n&gt; #**STOCK SYMBOL:** CHGG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CHGG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CHGG)**)\n\n*****\n\n&gt; **Nutrien (NTR)** – Nutrien raised its full-year profit outlook, amid strong global demand and higher prices for the Canadian fertilizer maker’s products.\n\n&gt; #**STOCK SYMBOL:** NTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NTR)**)\n\n*****\n\n&gt; **McKesson (MCK)** – The drug distributor earned $6.15 per share for its latest quarter, easily beating the consensus estimate of $4.66 a share. Revenue topping estimates as well, driven by strong delivery numbers for more expensive specialty drugs as well as its government contract to distribute Covid-19 vaccines. McKesson shares gained 3.4% in the premarket.\n\n&gt; #**STOCK SYMBOL:** MCK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MCK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MCK)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/wallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, November 2nd, 2021! :)**",
        "subreddit": "wallstreetbets",
        "title": "(11/2) Tuesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ql3krw/112_tuesdays_premarket_stock_movers_news/",
        "created": 1635886571.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1635857726,
        "id": "ql3k8l",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/stocks sub! Welcome to Tuesday! Here are your pre-market stock movers &amp; news on this Tuesday, November 2nd, 2021-\n\n*****\n\n# [Stock futures are little changed as major averages hover near records; Tesla shares slide](https://www.cnbc.com/2021/11/01/stock-market-futures-open-to-close-news.html)\n\n*****\n&gt; Stock futures were basically flat in early morning trading on Tuesday after the S&amp;P 500 eked out a fresh record close on Monday to kick off November.\n*****\n&gt; Futures tied to the Dow Jones Industrial Average were up by 38 points. S&amp;P 500 futures were flat and Nasdaq 100 futures was lower by 0.15%\n*****\n&gt; All three major U.S. stock indexes hit new intraday highs and closed at records during Monday’s regular session as investors continue to bet on a year-end rally despite supply chain issues, Covid risk and a Federal Reserve that’s about to indicate it’s going to pull back on some stimulus. The Fed’s two-day meeting begins Tuesday.\n*****\n&gt; The S&amp;P 500 has averaged gains of 1.1% in November and 2.3% in December since 1936, notes Bank of America. The final month of the year is in the green 79% of the time, the firm notes. However, Bank of America is cautious.\n*****\n&gt; “We continue to see downside risks ahead,” wrote Savita Subramanian, the bank’s head of U.S. equity and quantitative strategy. “Despite a strong 7% beat, 2021-22 EPS remains largely unchanged, suggesting the upward revision cycle has likely peaked.”\n*****\n&gt; Tesla shares cooled off Tuesday after popping during the end of October. Shares of the electric automaker tumbled 5% premarket, though they are up 55% over just the past month. The drop follows a report that the carmaker is recalling 11,700 of its vehicles due to a communications error, and a tweet from company founder Elon Musk that Tesla has yet to sign a contract with rental giant Hertz.\n*****\n&gt; Pfizer shares were up 1.8% in premarket trading after the drug maker’s third-quarter profit topped expectations. It also raised its 2021 revenue and EPS outlook.\n*****\n&gt; Shares of materials giant DuPont de Nemours fell nearly 4% after the company said it is buying engineering materials technology maker Rogers Corp for $5.2 billion. DuPont also reported a 33% increase in adjusted third-quarter earnings.\n*****\n&gt; Under Armour shares soared nearly 10% after the athletic retailer hiked its annual outlook.\n*****\n&gt; On Monday, the Dow rose 94.3 points. The S&amp;P 500 rose nearly 0.2%. The Nasdaq Composite added 0.6%. The small-cap Russell 2000 gained 2.7%, its best daily performance since August.\n*****\n&gt; The Fed at the conclusion of its two-day meeting on Wednesday is expected to announce it will begin unwinding its $120 billion in monthly bond purchases implemented during the pandemic.\n*****\n&gt; The October jobs report is on Friday.\n*****\n&gt; “The November FOMC meeting, October payrolls ... and a host of earnings updates sets up a catalyst heavy week of trading ahead,” Goldman Sachs’ Chris Hussey said in a note.\n*****\n&gt; Better-than-expected corporate earnings results boosted the U.S. stock averages to finish October at record highs, with the S&amp;P 500 and Nasdaq posting their best months since November 2020.\n*****\n&gt; As of Monday evening according to FactSet, 55.8% of S&amp;P 500 companies have reported quarterly financial results, with 82% beating earnings estimates.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mbQdPjs.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/vaORLAk.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/9Rrbjyg.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/uaTjkhx.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/bKWDopV.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($SQ $PFE $ROKU $MRNA $PINS $ON $DKNG $UBER $APPS $QCOM $CRSR $PENN $SKLZ $PCG $CVS $TRVG $CRNT $ABNB $ATVI $MRO $MELI $DVN $FANG $BP $PTON $CGC $VIAC $AMG $FSLY $UAA $EPD $ET $NET $AKTS $ZG $GNRC $ALX $CNA $TMUS $SKC $RIG)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/HovAdxl.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($PFE $CRSR $BP $UAA $COP $GNRC $EPD $RACE $EL $MPC $LPX $ARCB $GPN $CTLT $RL $BLMN $MPLX $IDXX $NRZ $CMI $BHC $ZBRA $IT $MGY $ESPR $DD $KKR $APO $ETN $AME $MIME $ADCT $ROK $TECH $INCY $LIND $BCC $SAGE $LGIH $IEP $LEA)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/53VLxUW.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #1!](https://i.imgur.com/LP69zIw.png)**)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #2!](https://i.imgur.com/IWaFYUR.png)**)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #3!](https://i.imgur.com/IA1HwBL.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #1!](https://i.imgur.com/n7GayLd.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #2!](https://i.imgur.com/h4f5OtE.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #3!](https://i.imgur.com/ysSbo0i.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #4!](https://i.imgur.com/ycH9aVx.png)**)\n\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/zKN9CD3.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/Mm0cU5s.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/M0Y7bN5.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/poUGTRm.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK!](https://i.imgur.com/gE6O83n.png)**)\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/11/02/stocks-making-the-biggest-moves-in-the-premarket-pfizer-under-armour-generac-and-more.html)**)\n\n*****\n\n&gt; **Pfizer (PFE)** – Pfizer jumped 4% in the premarket after the drugmaker reported better-than-expected profit and revenue for the third quarter. Pfizer earned $1.34 per share, 25 cents a share above estimates. The company also issued an improved full-year forecast on strong demand for both its Covid-19 vaccine and non-Covid treatments.\n\n&gt; #**STOCK SYMBOL:** PFE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PFE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PFE)**)\n\n*****\n\n&gt; **Under Armour (UAA)** – The athletic apparel maker’s shares surged 9.2% in premarket trading after it more than doubled the 15 cents a share consensus estimate, with quarterly earnings of 31 cents per share. Under Armour also raised its full-year outlook, as consumers maintain a high interest in comfortable daily wear.\n\n&gt; #**STOCK SYMBOL:** UAA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAA)**)\n\n*****\n\n&gt; **Generac (GNRC)** – Generac shares slid 5.5% in the premarket after beating bottom-line estimates but reporting lower-than-expected quarterly sales. Separately, the maker of home and commercial generators announced it is buying Canada-based smart thermostat maker Ecobee in a cash-and-stock deal that could be worth up to $770 million, depending on whether Ecobee reaches certain performance targets.\n\n&gt; #**STOCK SYMBOL:** GNRC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GNRC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GNRC)**)\n\n*****\n\n&gt; **DuPont (DD)** – DuPont fell 1.9% in premarket action after the chemical maker beat estimates but cut its full-year outlook citing decelerating orders from customers due to the worldwide chip shortage. DuPont came in 3 cents a share above estimates, with third-quarter profit of $1.15 per share. Separately, DuPont announced the acquisition of materials technology company Rogers Corp. (ROG) in a $5.2 billion deal, with Rogers soaring 27.3% following news of the deal.\n\n&gt; #**STOCK SYMBOL:** DD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DD)**)\n\n*****\n\n&gt; **Estee Lauder (EL)** – The cosmetics maker’s stock dropped 1.9% in the premarket, as it beat Street forecasts but cut its annual sales outlook due to inflation and supply chain disruptions. Estee Lauder earned $1.86 per share for the quarter, compared to a $1.70 share consensus estimate.\n\n&gt; #**STOCK SYMBOL:** EL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=EL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/EL)**)\n\n*****\n\n&gt; **Avis Budget (CAR)** – Avis Budget reported quarterly earnings of $10.74 per share, well above the $6.52 a share consensus estimate. Revenue also topped Wall Street forecasts. Heavy demand for rental cars and higher rental rates gave a significant boost to Avis Budget’s results. The stock rallied 7% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** CAR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CAR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CAR)**)\n\n*****\n\n&gt; **Simon Property (SPG)** – Simon nearly doubled the $1.09 per share consensus estimate, with quarterly earnings of $2.07 per share. The mall operator’s revenue also came in above analysts’ projections. Simon saw improved occupancy rates for its shopping malls during the quarter as well as an increase in shopper traffic. Simon shares rallied 4.1% in premarket action.\n\n&gt; #**STOCK SYMBOL:** SPG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SPG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SPG)**)\n\n*****\n\n&gt; **Clorox (CLX)** – Clorox beat estimates by 18 cents a share, with quarterly earnings of $1.21 per share. The household products maker posted better-than-expected revenue as well, and Clorox backed its prior full-year forecast. Its stock was up 2.2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** CLX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CLX)**)\n\n*****\n\n&gt; **Chegg (CHGG)** – Chegg shares tanked 31.5% in the premarket after the online education company reported lower-than-expected quarterly sales and merely matched Street estimates, with quarterly earnings of 20 cents per share. Chegg said enrollment did not bounce back as it had expected.\n\n&gt; #**STOCK SYMBOL:** CHGG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CHGG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CHGG)**)\n\n*****\n\n&gt; **Nutrien (NTR)** – Nutrien raised its full-year profit outlook, amid strong global demand and higher prices for the Canadian fertilizer maker’s products.\n\n&gt; #**STOCK SYMBOL:** NTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NTR)**)\n\n*****\n\n&gt; **McKesson (MCK)** – The drug distributor earned $6.15 per share for its latest quarter, easily beating the consensus estimate of $4.66 a share. Revenue topping estimates as well, driven by strong delivery numbers for more expensive specialty drugs as well as its government contract to distribute Covid-19 vaccines. McKesson shares gained 3.4% in the premarket.\n\n&gt; #**STOCK SYMBOL:** MCK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MCK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MCK)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/stocks?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, November 2nd, 2021! :)**",
        "subreddit": "stocks",
        "title": "(11/2) Tuesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/stocks/comments/ql3k8l/112_tuesdays_premarket_stock_movers_news/",
        "created": 1635886526.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1635857667,
        "id": "ql3jje",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "#Good morning traders and investors of the r/smallstreetbets sub! Welcome to Tuesday! Here are your pre-market stock movers &amp; news on this Tuesday, November 2nd, 2021-\n\n*****\n\n# [Stock futures are little changed as major averages hover near records; Tesla shares slide](https://www.cnbc.com/2021/11/01/stock-market-futures-open-to-close-news.html)\n\n*****\n&gt; Stock futures were basically flat in early morning trading on Tuesday after the S&amp;P 500 eked out a fresh record close on Monday to kick off November.\n*****\n&gt; Futures tied to the Dow Jones Industrial Average were up by 38 points. S&amp;P 500 futures were flat and Nasdaq 100 futures was lower by 0.15%\n*****\n&gt; All three major U.S. stock indexes hit new intraday highs and closed at records during Monday’s regular session as investors continue to bet on a year-end rally despite supply chain issues, Covid risk and a Federal Reserve that’s about to indicate it’s going to pull back on some stimulus. The Fed’s two-day meeting begins Tuesday.\n*****\n&gt; The S&amp;P 500 has averaged gains of 1.1% in November and 2.3% in December since 1936, notes Bank of America. The final month of the year is in the green 79% of the time, the firm notes. However, Bank of America is cautious.\n*****\n&gt; “We continue to see downside risks ahead,” wrote Savita Subramanian, the bank’s head of U.S. equity and quantitative strategy. “Despite a strong 7% beat, 2021-22 EPS remains largely unchanged, suggesting the upward revision cycle has likely peaked.”\n*****\n&gt; Tesla shares cooled off Tuesday after popping during the end of October. Shares of the electric automaker tumbled 5% premarket, though they are up 55% over just the past month. The drop follows a report that the carmaker is recalling 11,700 of its vehicles due to a communications error, and a tweet from company founder Elon Musk that Tesla has yet to sign a contract with rental giant Hertz.\n*****\n&gt; Pfizer shares were up 1.8% in premarket trading after the drug maker’s third-quarter profit topped expectations. It also raised its 2021 revenue and EPS outlook.\n*****\n&gt; Shares of materials giant DuPont de Nemours fell nearly 4% after the company said it is buying engineering materials technology maker Rogers Corp for $5.2 billion. DuPont also reported a 33% increase in adjusted third-quarter earnings.\n*****\n&gt; Under Armour shares soared nearly 10% after the athletic retailer hiked its annual outlook.\n*****\n&gt; On Monday, the Dow rose 94.3 points. The S&amp;P 500 rose nearly 0.2%. The Nasdaq Composite added 0.6%. The small-cap Russell 2000 gained 2.7%, its best daily performance since August.\n*****\n&gt; The Fed at the conclusion of its two-day meeting on Wednesday is expected to announce it will begin unwinding its $120 billion in monthly bond purchases implemented during the pandemic.\n*****\n&gt; The October jobs report is on Friday.\n*****\n&gt; “The November FOMC meeting, October payrolls ... and a host of earnings updates sets up a catalyst heavy week of trading ahead,” Goldman Sachs’ Chris Hussey said in a note.\n*****\n&gt; Better-than-expected corporate earnings results boosted the U.S. stock averages to finish October at record highs, with the S&amp;P 500 and Nasdaq posting their best months since November 2020.\n*****\n&gt; As of Monday evening according to FactSet, 55.8% of S&amp;P 500 companies have reported quarterly financial results, with 82% beating earnings estimates.\n\n*****\n\n#STOCK FUTURES CURRENTLY:\n######(**[CLICK HERE FOR STOCK FUTURES CHARTS!](https://finviz.com/futures.ashx)**)\n\n*****\n\n#YESTERDAY'S MARKET MAP:\n######(**[CLICK HERE FOR YESTERDAY'S MARKET MAP!](https://i.imgur.com/mbQdPjs.png)**)\n\n*****\n\n#TODAY'S MARKET MAP:\n######(**[CLICK HERE FOR TODAY'S MARKET MAP!](https://finviz.com/map.ashx)**)\n\n*****\n\n#YESTERDAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR YESTERDAY'S S&amp;P SECTORS CHART!](https://i.imgur.com/vaORLAk.png)**)\n\n*****\n\n#TODAY'S S&amp;P SECTORS:\n######(**[CLICK HERE FOR TODAY'S S&amp;P SECTORS CHART!](https://finviz.com/groups.ashx)**)\n\n*****\n\n#TODAY'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR TODAY'S ECONOMIC CALENDAR!](https://i.imgur.com/9Rrbjyg.png)**)\n\n*****\n\n#THIS WEEK'S ECONOMIC CALENDAR:\n######(**[CLICK HERE FOR THIS WEEK'S ECONOMIC CALENDAR!](https://i.imgur.com/uaTjkhx.png)**)\n\n*****\n\n#THIS WEEK'S UPCOMING IPO'S:\n######(**[CLICK HERE FOR THIS WEEK'S UPCOMING IPO'S!](https://i.imgur.com/bKWDopV.png)**)\n\n*****\n\n#THIS WEEK'S EARNINGS CALENDAR:\n($SQ $PFE $ROKU $MRNA $PINS $ON $DKNG $UBER $APPS $QCOM $CRSR $PENN $SKLZ $PCG $CVS $TRVG $CRNT $ABNB $ATVI $MRO $MELI $DVN $FANG $BP $PTON $CGC $VIAC $AMG $FSLY $UAA $EPD $ET $NET $AKTS $ZG $GNRC $ALX $CNA $TMUS $SKC $RIG)\n######(**[CLICK HERE FOR THIS WEEK'S EARNINGS CALENDAR!](https://i.imgur.com/HovAdxl.png)**)\n\n*****\n\n#THIS MORNING'S PRE-MARKET EARNINGS CALENDAR:\n($PFE $CRSR $BP $UAA $COP $GNRC $EPD $RACE $EL $MPC $LPX $ARCB $GPN $CTLT $RL $BLMN $MPLX $IDXX $NRZ $CMI $BHC $ZBRA $IT $MGY $ESPR $DD $KKR $APO $ETN $AME $MIME $ADCT $ROK $TECH $INCY $LIND $BCC $SAGE $LGIH $IEP $LEA)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS CALENDAR!](https://i.imgur.com/53VLxUW.jpg)**)\n\n*****\n\n#EARNINGS RELEASES BEFORE THE OPEN TODAY:\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #1!](https://i.imgur.com/LP69zIw.png)**)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #2!](https://i.imgur.com/IWaFYUR.png)**)\n######(**[CLICK HERE FOR THIS MORNING'S EARNINGS RELEASES LINK #3!](https://i.imgur.com/IA1HwBL.png)**)\n\n*****\n\n#EARNINGS RELEASES AFTER THE CLOSE TODAY:\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #1!](https://i.imgur.com/n7GayLd.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #2!](https://i.imgur.com/h4f5OtE.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #3!](https://i.imgur.com/ysSbo0i.png)**)\n######(**[CLICK HERE FOR THIS AFTERNOON'S EARNINGS RELEASES LINK #4!](https://i.imgur.com/ycH9aVx.png)**)\n\n\n*****\n\n#YESTERDAY'S ANALYST UPGRADES/DOWNGRADES:\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #1!](https://i.imgur.com/zKN9CD3.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #2!](https://i.imgur.com/Mm0cU5s.png)**)\n######(**[CLICK HERE FOR YESTERDAY'S ANALYST UPGRADES/DOWNGRADES LINK #3!](https://i.imgur.com/M0Y7bN5.png)**)\n\n*****\n\n#YESTERDAY'S INSIDER TRADING FILINGS:\n######(**[CLICK HERE FOR YESTERDAY'S INSIDER TRADING FILINGS!](https://i.imgur.com/poUGTRm.png)**)\n\n*****\n\n#TODAY'S DIVIDEND CALENDAR:\n######(**[CLICK HERE FOR TODAY'S DIVIDEND CALENDAR LINK!](https://i.imgur.com/gE6O83n.png)**)\n\n*****\n\n#THIS MORNING'S MOST ACTIVE TRENDING TICKERS ON STOCKTWITS:\n\n* TSLA\n* LRC.X\n* PFE\n* FSR\n* FCEL\n* CRSR\n* CHGG\n* DOT.X\n* VUZI\n\n*****\n\n#THIS MORNING'S STOCK NEWS MOVERS:\n\n######(**source: [cnbc.com](https://www.cnbc.com/2021/11/02/stocks-making-the-biggest-moves-in-the-premarket-pfizer-under-armour-generac-and-more.html)**)\n\n*****\n\n&gt; **Pfizer (PFE)** – Pfizer jumped 4% in the premarket after the drugmaker reported better-than-expected profit and revenue for the third quarter. Pfizer earned $1.34 per share, 25 cents a share above estimates. The company also issued an improved full-year forecast on strong demand for both its Covid-19 vaccine and non-Covid treatments.\n\n&gt; #**STOCK SYMBOL:** PFE\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=PFE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/PFE)**)\n\n*****\n\n&gt; **Under Armour (UAA)** – The athletic apparel maker’s shares surged 9.2% in premarket trading after it more than doubled the 15 cents a share consensus estimate, with quarterly earnings of 31 cents per share. Under Armour also raised its full-year outlook, as consumers maintain a high interest in comfortable daily wear.\n\n&gt; #**STOCK SYMBOL:** UAA\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=UAA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/UAA)**)\n\n*****\n\n&gt; **Generac (GNRC)** – Generac shares slid 5.5% in the premarket after beating bottom-line estimates but reporting lower-than-expected quarterly sales. Separately, the maker of home and commercial generators announced it is buying Canada-based smart thermostat maker Ecobee in a cash-and-stock deal that could be worth up to $770 million, depending on whether Ecobee reaches certain performance targets.\n\n&gt; #**STOCK SYMBOL:** GNRC\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=GNRC&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/GNRC)**)\n\n*****\n\n&gt; **DuPont (DD)** – DuPont fell 1.9% in premarket action after the chemical maker beat estimates but cut its full-year outlook citing decelerating orders from customers due to the worldwide chip shortage. DuPont came in 3 cents a share above estimates, with third-quarter profit of $1.15 per share. Separately, DuPont announced the acquisition of materials technology company Rogers Corp. (ROG) in a $5.2 billion deal, with Rogers soaring 27.3% following news of the deal.\n\n&gt; #**STOCK SYMBOL:** DD\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=DD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/DD)**)\n\n*****\n\n&gt; **Estee Lauder (EL)** – The cosmetics maker’s stock dropped 1.9% in the premarket, as it beat Street forecasts but cut its annual sales outlook due to inflation and supply chain disruptions. Estee Lauder earned $1.86 per share for the quarter, compared to a $1.70 share consensus estimate.\n\n&gt; #**STOCK SYMBOL:** EL\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=EL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/EL)**)\n\n*****\n\n&gt; **Avis Budget (CAR)** – Avis Budget reported quarterly earnings of $10.74 per share, well above the $6.52 a share consensus estimate. Revenue also topped Wall Street forecasts. Heavy demand for rental cars and higher rental rates gave a significant boost to Avis Budget’s results. The stock rallied 7% in premarket trading.\n\n&gt; #**STOCK SYMBOL:** CAR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CAR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CAR)**)\n\n*****\n\n&gt; **Simon Property (SPG)** – Simon nearly doubled the $1.09 per share consensus estimate, with quarterly earnings of $2.07 per share. The mall operator’s revenue also came in above analysts’ projections. Simon saw improved occupancy rates for its shopping malls during the quarter as well as an increase in shopper traffic. Simon shares rallied 4.1% in premarket action.\n\n&gt; #**STOCK SYMBOL:** SPG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=SPG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/SPG)**)\n\n*****\n\n&gt; **Clorox (CLX)** – Clorox beat estimates by 18 cents a share, with quarterly earnings of $1.21 per share. The household products maker posted better-than-expected revenue as well, and Clorox backed its prior full-year forecast. Its stock was up 2.2% in the premarket.\n\n&gt; #**STOCK SYMBOL:** CLX\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CLX)**)\n\n*****\n\n&gt; **Chegg (CHGG)** – Chegg shares tanked 31.5% in the premarket after the online education company reported lower-than-expected quarterly sales and merely matched Street estimates, with quarterly earnings of 20 cents per share. Chegg said enrollment did not bounce back as it had expected.\n\n&gt; #**STOCK SYMBOL:** CHGG\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=CHGG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/CHGG)**)\n\n*****\n\n&gt; **Nutrien (NTR)** – Nutrien raised its full-year profit outlook, amid strong global demand and higher prices for the Canadian fertilizer maker’s products.\n\n&gt; #**STOCK SYMBOL:** NTR\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=NTR&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/NTR)**)\n\n*****\n\n&gt; **McKesson (MCK)** – The drug distributor earned $6.15 per share for its latest quarter, easily beating the consensus estimate of $4.66 a share. Revenue topping estimates as well, driven by strong delivery numbers for more expensive specialty drugs as well as its government contract to distribute Covid-19 vaccines. McKesson shares gained 3.4% in the premarket.\n\n&gt; #**STOCK SYMBOL:** MCK\n\n&gt; * [CLICK HERE FOR CHART!](http://elite.finviz.com/chart.ashx?t=MCK&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l)\n\n&gt; ######(**[CLICK HERE FOR LIVE STOCK QUOTE!](http://data.cnbc.com/quotes/MCK)**)\n\n*****\n\n#**FULL DISCLOSURE:**\n\n&gt; /u/bigbear0083 has no positions in any stocks mentioned. Reddit, moderators, and the author do not advise making investment decisions based on discussion in these posts. Analysis is not subject to validation and users take action at their own risk.\n\n*****\n\n#**DISCUSS!**\n\nWhat's on everyone's radar for today's trading day ahead here at r/smallstreetbets?\n\n*****\n\n# **I hope you all have an excellent trading day ahead today on this Tuesday, November 2nd, 2021! :)**",
        "subreddit": "smallstreetbets",
        "title": "(11/2) Tuesday's Pre-Market Stock Movers &amp; News",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/ql3jje/112_tuesdays_premarket_stock_movers_news/",
        "created": 1635886467.0
    },
    {
        "author": "Blue_Blueberry5402",
        "created_utc": 1635855505,
        "id": "ql2x1s",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "I panic sold a my ANET and ZBRA in September. Is it worth it buying back at ANETs high price?",
        "url": "https://www.reddit.com/r/stocks/comments/ql2x1s/i_panic_sold_a_my_anet_and_zbra_in_september_is/",
        "created": 1635884305.0
    }
]