[
    {
        "author": "Mario4272",
        "created_utc": 1628696537,
        "id": "p2flww",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "I am a software engineer and have been working in the industry for 20+ years.  IMO I see a major Shift happening in the web industry.  Typically, web sites have been served up via servers or virtual servers maintained in data centers all over the world.  CDNs, Contend Delivery networks have improved the performance of those web sites considerably, by bringing certain resources closer to the user.  The shift I am speaking about, involves a movement to use the CDNs for the entire website experience.  You develop the site via JamStack like NextJS or Fauna  You deliver it to a CDN via tools like Netlify and boom, the site is 90x faster.  Yes data still travels between the user and the web site user interface, however, using things like client side caching alleviates the time and labor on the site down to changes only after the first load.  The CDN of choice lately is CloudShare.  They are coming up fast behind the big players like Akamai.  Again, just my thoughts based on my experience in this industry.  I'd love to hear anyone's feedback and opinions along the same line.  Thanks for reading",
        "subreddit": "wallstreetbets",
        "title": "Major Shift in Web Technology",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/p2flww/major_shift_in_web_technology/",
        "created": 1628725337.0
    },
    {
        "author": "Odd_Middle_9420",
        "created_utc": 1629858467,
        "id": "pb21jz",
        "num_comments": 36,
        "num_crossposts": 0,
        "selftext": " \n\n[FINRA violation pdf](https://www.finra.org/sites/default/files/fda_documents/2014041721501%20J.P.%20Morgan%20Clearing%20Corporation%20nka%20J.P.%20Morgan%20Securities%20LLC%20CRD%2079%20AWC%20va.pdf)\n\ndisclaimer: i solve problems for a living and don't even pay my own bills, so if you take this as financial advice your even more retarded than i am. I am very retarded so don't take it as financial advice (its not financial advice).\n\nhttps://preview.redd.it/c9hgi1lszej71.png?width=591&amp;format=png&amp;auto=webp&amp;s=415e8df8280e1460062376a913889737708350c6\n\nAccording to the above linked FINRA enforcement, JP Morgan, the largest bank in the US, from 2009 until at the very minimum late 2015, violated regulation SHO rule 204 by incorrectly allocating (ie: NOT allocating...) securities that have failed to deliver to the brokers in which they fund.\n\nThe way my smooth brain understands it, JP Morgan is a 'prime broker', meaning basically a broker for brokers. For example, Shitadel would have a margin account with a prime broker. If they were to be margin called, it would be their prime broker doing the calling.\n\nI'll use an example to illustrate my understanding:\n\nBroker A shorts 100 shares of CompanyA, and does not buy to cover.\n\n\\- Broker A owes prime broker 100 shares lent on margin.\n\n... some days pass ...\n\n\\- Prime broker notices that Broker A has not delivered 100 shares of CompanyA to cover, and that by law this must be reported to the SEC per Reg SHO as FTD. The FTD at this point is owned by the Prime broker and it is their responsibility to ensure that the security is actually purchased because theft is a crime and all. They force Broker A per regulatory cadence to purchase the share and deliver it.\n\nIn JP Morgan's case, they were not sufficiently allocating the failed to deliver shares to the brokerages, and were doing so in a way that the brokers could plausibly deny 'knowing that they had the FTDs'...\n\nWhy I think this is a HUGE FUCKING DEAL:\n\nto my understanding, ALL FTDs for ALL securities that failed to deliver \\*\\*and were NOT purchased to cover by their sub brokers\\*\\* over the course of SIX years now rests as JP Morgan's responsibility.\n\nthere is no number given, only 'OVER xx amount per month' and 'OVER 100,000' for the duration. FINRA gives two broker examples, A and B, but JPM obviously didn't know what the fuck they were doing and I don't see how this would have been limited to just A and B...\n\nAll of these failed positions that were never covered and were never put in the penalty box like they should have been. Assuming they are still outstanding, **WOULD NOW BE IN THE PENALTY BOX, UNTIL EVERY LAST FAIL HAS BEEN PURCHASED.**\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n(more)Speculation incoming:\n\naround 1:00 today, nearly every single ticker that has been notoriously high in their FTD rate began to moon.\n\nI wonder if JPM is beginning to close some of these positions after this ruling was posted... I'm sure they will get what they can from whoever owes it to them, but they will be on the hook for the rest, and they cannot lend/sell short any ticker with an outstanding fail to deliver.\n\n**I cannot imagine the number they are looking at if the reality is as bad as it looks - i'm counting on your collective wrinkles to help sort this out.**\n\nTLDR:\n\nThey send excel sheet of fails to broker, broker thinks its notice of 'potential buy in', broker continues to buy/sell the failed security and never questioned about it again.\n\nfor six years.\n\n&amp;#x200B;\n\n*Processing img rsed1j4vzej71...*\n\nThere are alot of implications here, like - is the penalty box full as of, today?  JPM covering all of these?  JPM margin calling their broker-dealers like monday that didn't deliver and were ignorant to having to \\*\\*cover their shorts\\*\\*?",
        "subreddit": "wallstreetbets",
        "title": "FINRA VIOLATION - JP Morgan didn't enforce covering of FTDs from 2009-2015. Complete failure in competence... Now they hold the bag?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pb21jz/finra_violation_jp_morgan_didnt_enforce_covering/",
        "created": 1629887267.0
    },
    {
        "author": "JellyKeyboard",
        "created_utc": 1629370217,
        "id": "p7chh8",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "I’ve got a few shares of KDNC (cadence minerals) honestly I’m probably a bit dumb for seeing a good looking graph and the words “lithium” mining and putting down some money.\n\nI know Hargreaves lansdown and some major banks have invested in it too so it’s probably not a completely crap stock.\n\nHowever recently it just seems to go down and I looked for news about them but didn’t see anything.\n\nWhat’s your opinion on the stock? Hodl or ditch my bags? Bought some at like 31p, badly timed it seems.",
        "subreddit": "pennystocks",
        "title": "£KDNC, what should I do? Hodl or jump ship?",
        "url": "https://www.reddit.com/r/pennystocks/comments/p7chh8/kdnc_what_should_i_do_hodl_or_jump_ship/",
        "created": 1629399017.0
    },
    {
        "author": "tigerbeaverkangaroo",
        "created_utc": 1628265675,
        "id": "oz9lsv",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Neither my rbc visa or my debit visa account will work on coinbase. Both with RBC . Customer service says there's no work around. \n\nAnyone have advice on ways around this? Obv cdns are using Coinbase...",
        "subreddit": "CanadianInvestor",
        "title": "Howww do I fund coinbase?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/oz9lsv/howww_do_i_fund_coinbase/",
        "created": 1628294475.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1628110604,
        "id": "oy25tw",
        "num_comments": 93,
        "num_crossposts": 0,
        "selftext": "**Disclaimer : This article was written to supplement my Options Trading Exit Strategies video. Those looking for more in depth explanations and examples should refer to the video, which can be found on my profile. Happy Trading!**\n\n&amp;nbsp;\n\n\nWhat’s poppin’ bull-gang, Flux here with an options exit strategy “guide”. I wanted to make this writeup because more often than not, I see people making fundamentally sound trades, only to have their gains vanish due to having poor exit strategy. They either get too greedy and hold on for way too long, or they exit way too early and miss out on an insane runup and want to die for a couple of days afterwards. There’s two parts to each trade - an entry and an exit - and if you’re caught skimping on either end, you’re gonna be kneecapping your gains on a regular basis. Although this part of trading isn’t glamourous, it’s absolutely vital to your overall success as a trader, so it’s crucial that you learn and study these concepts sooner rather than later. With all that being said, let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#Types of Exits\n\nThere’s three types of exits that I tend to use when I conduct my trades, each useful in their own right. I’ll give a quick summary of them all, before providing an in depth analysis and examples of each.\n\n&amp;nbsp;\n\n- **Fundamental Exits** pertain to any form of exit strategy regarding the change of a company’s fundamentals. These exits usually take place before the fundamental changes since you’re not going to be able to react to the changes in real time and you’ll end up getting front run by algos. Examples of this include taking an exit during an earnings runup or rundown, taking exits before company related news events, or taking an exit before any market-wide news events.\n\n&amp;nbsp;\n\n- **Technical Exits** pertain to any form of exit strategy regarding a chart or an indicator - often a combination of the two. Once I see a pattern or indicator pass a certain threshold, I know it’s likely time to exit my position. Some examples of technical exits may include exits taken around support and resistance levels, exits taken during gap fills, exits taken based off of technical patterns, and exits taken during the absence of any concrete patterns or indicators.\n\n&amp;nbsp;\n\n- **Psychologic Exits** pertain to any form of exit strategy regarding market psychology. This is the simplest of the three categories, and is often used in tandem with the other strategies to provide yourself with the best exit possible. Some strategies include exiting around whole numbers, screenshot theory, and individual gain theory. More on these later.\n\n&amp;nbsp;\n\nObviously there are going to be a handful of strategies and categories which I’ve missed, but the ones I outlined above are likely going to be the ones which are most common to us retail traders.\n\n&amp;nbsp;\n\n---\n\n#Fundamental Exits\n\n**Fundamental exits revolve around one key idea - Sell the news.** More often than not, the results of a given news event are already baked into a stock's price well before the news event is confirmed or actually takes place. As a result, the price of a stock will almost always DROP even if this news is “confirmed”, because it was already priced in. This can be observed anywhere from earnings runups to product launches to fundamental news events. You may be wondering why this drop even happens in the first place - if the news is baked into a stock's price, shouldn’t it stay flat when the news is confirmed? Hint : Trading Algorithms.\n\n&amp;nbsp;\n\nAlgorithms, or algos for short, are always behind the inevitable tanking of a stock's price post news event. It’s quite easy to see why once you understand how these algorithms work. An algo can read through an entire earnings report / news transcript / whatever and fire off a corresponding trade in a fraction of a nanosecond, meaning that they’re at a huge advantage since they **have the ability to sell the news after the news event hits.** This means that algos don’t have to prematurely exit their position until they confirm that the underlying security was priced properly. If the underlying was priced to perfection, the algo takes its profits once the news confirms it (very common behavior among algos - take profits once there are no longer any catalysts in play), thereby causing the stock to tank. If the instrument wasn’t priced properly, and there is a huge upside beat, the algo just stays in the trade and reaps the rewards, exiting at a later date instead. This concept is pretty difficult to wrap your head around initially, so let's go through an example.\n\n&amp;nbsp;\n\n**In our hypothetical example, let’s say $AAPL has just reported earnings.** \n\n&amp;nbsp;\n\n**Scenario 1 : $AAPL is priced properly.** The ER comes out, an algo skims it, and confirms that $AAPL was indeed priced properly. The algo then takes its profits (as per common algo behavior), and dumps the position as a result of the priced in ER. Many other algos do the same as well, and the stock price “tanks”, resulting in a gap down the following day, and many left holding the bag, even on a seemingly good ER. Welcome to “priced in”.\n\n&amp;nbsp;\n\n**Scenario 2 : $AAPL is NOT priced properly.** The ER comes out, an algo skims it, and concludes that $AAPL was NOT priced properly. There was a huge upside beat. Instead of selling, the algo stays in the position because it knows that the underlying is undervalued based on the new news, and rides the wave up, exiting the position at a later date. $AAPL was not priced properly, and as a result, the news wasn’t priced in.\n\n&amp;nbsp;\n\nIn both cases, the algos win - they either escape with their profits, or ride the wave up for even more gains. **Us humans cannot act as quickly as an algo, and thus we’ll always be at a disadvantage when it comes to fundamental exits. We always have to exit our positions prior to news catalysts to avoid getting front run.** News events are almost ALWAYS priced in. We can’t sell the news AFTER the news drops because we cant digest and react to the news fast enough. We can’t front run the algorithms, so we need to sell BEFORE any fundamental news catalysts, otherwise we run the risk of holding the bag. If there’s one thing I want you all to take away from this article, it's that you should **always sell the news.**\n\n&amp;nbsp;\n\n---\n\n# Exiting Around Earnings\n\nThis is a very simple concept once we understand the mechanisms outlined above. If you’re in a trade, always look to close it out before earnings (unless you wanna get rug pulled, in which case go ahead, I'm not your daddy). If the news is priced in (which it probably is), you’ll get front run by algos and they’ll steal your profits. Do not gamble on the “priced-in“ news being wrong. You’ll lose that bet 9/10 times. Please note that even if earnings is a beat, that “beat” can still be priced in. Please, exit your trades before earnings, or you run the risk of getting blown out due to your own ignorance.\n\n&amp;nbsp;\n\n# Exiting Around Product Launches\n\nThis is similar to the concept we outlined above. In this hypothetical example, let’s say $AAPL announces that they’re going to reveal a new line of products in August. If that’s the case, get ready to exit your position before the event. Every August $AAPL showcases their new iPhones for the year, therefore even though they haven’t explicitly said they’re going to reveal iPhones, the market is gonna price the event as if iPhones are going to be revealed. Once they reveal that their new products are in fact iPhones, the price will tank, because it was priced in, and algos followed the exact behavior outlined earlier. The only instance in which the price wouldn’t tank would be if they announced that they’re releasing a teleportation device or something. Believe it or not, the odds of that happening are astronomically low, so you’re better off just selling before the reveal instead. Unless $AAPL comes out with something totally unexpected, the price will drop.\n\n&amp;nbsp;\n\n# Exiting Around Fundamental News Events\n\nThis pertains to market moving news as a whole, like an FOMC speech or some macroeconomic event. If you know that JPow is gonna speak on Wednesday, it’s probably best to exit your position before that since you’ve honestly got no idea what’s gonna happen as a byproduct of it. The entire market could take a shit or could fly green, nobody knows. Since we’re traders, not gamblers, it’s in our best interest to exit our positions or hedge in order to shield our gains. Fundamental news events are often crapshoots, and are the leading cause of solid gains getting unjustly erased in an instant.\n\n&amp;nbsp;\n\n---\n\n#Technical Exits\n\nTechnical exits pertain to any form of exit strategy regarding a chart or an indicator - often a combination of the two. In order to have the ability to do a technical exit, you must have a basic understanding of technical charts, patterns, and indicators. The entire field of technical analysis is easy to understand, but hard to master, so even if you don’t have much experience in the area, I’ll do my best to explain it all in a way which is friendly towards newer traders.\n\n&amp;nbsp;\n\n---\n\n#Exiting Around Support and Resistance\n\nThis is often one of the easiest exits to perform, as it’s fairly straightforward to identify on a chart. **Whenever you start to approach an area which you’ve deemed as a key level of support or resistance, consider exiting your trade.** If the price has bounced off of that particular level five times in the past, it’ll likely hold true for the 6th time unless something has fundamentally changed about the company or the markets. As a result, you know that you should exit your trade as you approach the level, as it likely won’t keep going in the same direction once we get to that point. \n\n&amp;nbsp;\n\nAn awesome example of this would be the [$CLF chart.](https://s3.tradingview.com/snapshots/9/9ymcqFZF.png) As we can tell, CLF trades in a nice ascending channel. In this case, we can use our trendlines to easily identify when to exit our trades in order to capture the maximum amount of our gains, saving us massive headaches. Once we get near any of the yellow trendlines, we should consider taking an exit since we’re likely going to bounce off of it. Another great example of similar price movement can be found in [$AMD’s chart.](https://s3.tradingview.com/snapshots/l/LzNxfKpr.png) It trades off of supports and resistances very consistently, allowing us to bag consistent gains. However, unlike CLF, AMD often has breakouts to the upside or downside, making it trickier to trade in the event of a breakout.\n\n&amp;nbsp;\n\nYou may be wondering if there’s any way you can capture the EXTRA gains in the event that the support or resistance levels don’t hold. Although I don’t recommend doing it too often, a well placed stop-loss can help protect your gains in the event that we reject off of a support or resistance, while simultaneously KEEPING you in the trade if we break through the support or resistance. Obviously, you’ll need some experience trading to know exactly where to place your stop, and it’s going to vary from ticker to ticker based on IV and the type of security or derivative you’re trading. A well placed stop-loss can help magnify your returns while also preventing you from giving up any gains you’ve already locked in. Be wary, too tight of a stop could take you out of a trade entirely before a run, but too loose of a stop could cause you to give up too much of your unrealized gains. It’s a fine line to play, and that only comes with experience.\n\n&amp;nbsp;\n\nAnother way you could play breakouts is by using a two stepped approach. First, you take your exit once you approach a given level of support or resistance to lock in your gains. You then set an alert within your broker slightly higher than that given level. If your alert gets tripped, you know that there’s been a breakout, and you’re clear to re-enter the trade to then capture any extra gains that may occur once it starts to run. If I run this strategy, I make sure to set my stop under the newly broken support or resistance in order to preserve my capital in the event of a false breakout. In the end, this method is much safer, but it requires you to sit at your computer twiddling your thumbs waiting for a breakout, so I personally don’t prefer it.\n\n&amp;nbsp;\n\n---\n\n# Exiting Around Gaps\n\nBefore we get into how to trade gaps, we need to understand what gaps are, and why they occur. [**Gaps are areas on a chart where the price of a stock moves sharply without any trades being placed.**](https://s3.tradingview.com/snapshots/a/asVEHysx.png) Usually this happens as a result of a positive or negative catalyst affecting a stock outside of regular trading hours, resulting in a respective gap up or down the following day. A “gap” refers to a gap in the stock's price as a result of no trades being conducted within that range. Gaps are created because of low volume (technically no volume), and as a result, are prone to getting “filled” very quickly. Once we are within the price range of a gap, it’s very common that we will get sucked through the area with prices strongly trending towards the opposite side of the gap as a byproduct of the lack of volume.\n\n&amp;nbsp;\n\nWhen trading gaps, we need to recognize two important levels, and understand how price will act around them. **The very last trade that took place before the gap was created will be a very heavy level of resistance, and the very first trade that takes place after a gap will also be a very heavy level of resistance.** As a result, we will be very prone to rejecting off of these levels, so we want to fully exit our trade around these levels, no exceptions. Once we’re past the initial resistance, we can look to re-enter the trade to capture the rest of our profits.\n\n&amp;nbsp;\n\nUnderstanding all of that, gap trades are relatively simple. First, we ride our trade up to our first level of resistance (the beginning of the gap, aka the price that the first trade was conducted at), and then take our exit to lock in our profits. Afterwards, we set an alert slightly above the resistance, so we get notified once we’re past the resistance and are in the gap. Since we know there’s no trading volume within the gap, there’s a good chance we will get sucked through to the other side, meaning we should look to re-enter the trade as quickly as possible and then ride it to the opposite end of the gap (the end of the gap aka the price that the last trade was conducted at before the gap was created). Once we get to the opposite end of the gap, we fully exit the trade, because we know that 99% of the time we will reject off of this next heavy level of resistance. Gaps have a very rigid structure, and trade very similar to a breakout play. Enter a trade, exit at first resistance. Re-enter the trade after we break resistance, exit once we’re at the second resistance.\n\n&amp;nbsp;\n\n**If this concept was unclear or confusing, refer to the [video](https://www.youtube.com/watch?v=SDKNRF_BZqQ) which has in-depth examples complete with visuals.**\n\n&amp;nbsp;\n\n---\n\n#Clear Skies and Falling Knives\n\nA clear skies situation refers to when a stock is on a tear and has recently carved out new all time highs - think [$AMZN’s recent run to $3750,](https://s3.tradingview.com/snapshots/6/6E9FplY9.png) or [$CRSR’s initial run to $50.](https://s3.tradingview.com/snapshots/e/EHxx1rVZ.png) A falling knife is the flipside of that, and refers to when a stock is essentially in freefall - like $NKLA when people found out Trevor Milton is a rat, or $WKHS when they lost the government contracts. In both situations, it can be extremely difficult to know when you should exit your trade since we don’t have any technical levels to go off of, and as a result, we don’t know when to anticipate a bounce. Even if we did have a general idea of where it was going to bounce, the market often over reacts, resulting in us blowing past our initial mark before starting our initial recovery.\n\n&amp;nbsp;\n\n**The simplest way to play these situations is with a trailing stop.** Trailing stops were invented for situations like these, and they’re honestly one of the most effective yet under-utilized tools. Set the stop, and it’ll trail the stock as it moves. When a stock is carving out new highs, or plunging to new lows, a properly set trailing stop will let you get as close to maximum profits as possible while still allowing you to stay in the trade if we experience some turbulence along the way. If your trailing stop is set properly, you shouldn’t get stopped out of the trade from natural market movements, and will only be forced out once we’ve found a new high or low. I’m not going to teach you how to properly set trailing stops as that’s beyond the scope of this article, but it’s something I may write about in the future given that enough people are interested.\n\n&amp;nbsp;\n\n**Alternatively, if you want to abuse basic human psychology, you could also look to exit your position around whole numbers.** Humans are weird creatures, in the sense that we like “whole” things - stock prices are no exception. You better believe there’s going to be buyers or sellers setting up shop at nice, round numbers. Think $20, $50, $100, etc. If a stock is making a miracle run from $10, and is approaching $20, you better believe there’s going to be a large number of people looking to take profits at the $20 mark, and as a result, you should look to exit the position around there. Again, this isn’t a 100% concrete theory, and sometimes these levels won’t hold at all, but it’s still something to keep in mind. More on this later.\n\n&amp;nbsp;\n\n---\n\n#Technical Caveats\n\n**Please note, that these technical exits won’t hold true given that a company's underlying fundamentals have changed. A stock's technical charts and indicators are only to be used as a summary of a company's fundamentals.** Technicals summarize the price action which is driven by the underlying fundamentals. If the fundamentals of a company change, the technical indicators and charts will also change, thereby making our old technical charts void. This is an extremely important concept that most traders and investors do not fully understand. Technicals summarize fundamentals.\n\n&amp;nbsp;\n\nIf $MSFT announces that they’re coming out with a time machine, don’t expect the stock's price to bounce off of the nearest overhead resistance, as that level is now void. $MSFT has fundamentally changed as a company, and as a result, the technicals will also need to change to reflect that. The same is true to the downside. If $MCD announces that they’ve been grinding up humans and putting them into their hamburgers, don’t expect the nearest level of support to hold - it’s void. The stock will plunge into free fall until $MCD is properly priced given it’s new fundamentals. Only then can we look to start re-establishing our technicals.\n\n&amp;nbsp;\n\n**Technicals are only to be used as a summary of a company’s current fundamentals.**\n\n&amp;nbsp;\n\n---\n\n#Psychological Exits\n\nPsychological exits consist of concepts and rules derived from how humans think and react to certain events. They are more conceptual in nature, and will vary from person to person. They aren’t necessarily as concrete as the other types of exits due to their ambiguous nature. Everyone will apply these exits differently, and as a result I can’t give you a consistent set of rules for each one. I can just explain the general concepts and provide different contexts regarding when to apply them. The rest is up to you!\n\n&amp;nbsp;\n\n---\n\n#Screenshot Theory\n\nThis is a very simple concept that I actually adopted from Wall Street Bets of all places - **If it’s good enough to screenshot, it’s good enough to sell.** If you’re taking screenshots of your unrealized profits to flex on your friends, or random internet people, it’s probably time to sell out of that position. The only reason you feel the need to flex your gains is because it’s a life altering amount of money. I don’t care what the fundamentals, or technicals say at that point. Cash out of the casino, and realize those gains. If it’s good enough to screenshot, it’s good enough to sell.\n\n&amp;nbsp;\n\n# Individual Gain Theory\n\nThis concept refers to when you’re trading with money that you cannot afford to lose, and you come in on somewhat of a win. Profit or loss, this money is going to fundamentally alter your life (for better or worse) because you were put in a position where you had to “trade” money which you also needed elsewhere. If you’re ever in a situation where you’re forced to trade to make some extra dough, take those profits asap. A loss is often going to make your life a hell of a lot worse than a win will.\n\n&amp;nbsp;\n\n# Exiting Around Whole Numbers\n\nHumans are weird creatures - we like “whole” or “round” stuff, numbers being no exception. How often do you catch yourself submitting a buy order for 20$, or a sell order for $50. Unless you’re cognizant of it, you’re not going to think to yourself “imma buy $CLF at 21.83”. There’s a good chance you’re gonna round it up to $22, or down to $20, etc. The same goes for literally EVERYONE else. Just keep in mind that depending on the direction you’re trading, there’s often going to be buyers / sellers at whole numbers. $10, $20, $25, $30, etc. No number is safe. Look to time your exits before or after these numbers, as they may prove to be mini points of resistance. You’ll often see sellers step in at whole numbers on the way up, and buyers step in at whole numbers on the way down. Use this to your advantage.\n\n&amp;nbsp;\n\n---\n\n# Emotional Exits\n\nThis concept applies to two key emotions - Euphoria and Hope. **The instant you start feeling euphoric about a trade and it’s potential gains, step away from the trade.** You’re not going to be thinking clearly enough to make an optimal trade or exit. There’s a very high chance you’re going to continue to chase the victory. If the victory starts slipping away from you, you're likely going to stay in the trade hoping that it goes back up to the previous high that you didn’t sell at. In situations like this, by staying in the trade, you’ll almost always hold your position well past the top, and will be prone to “diamond hands-ing” your profits into the ground, ultimately coming up with a loss on a fundamentally sound trade. \n\n&amp;nbsp;\n\nYou need to be conscious of the fact that you’re euphoric, and that this trade went awesome, and exit the position intelligently. Once you start feeling euphoria, and consequently hope, there’s no going back. You’re not trading on fundamentals, and you’re not trading on technicals either. You’re simply not trading rationally. In situations like this, it’s best to take a step back and exit the trade before you make a boneheaded move and end up giving your gains away. Emotions cloud judgement, and as traders, that’s the last thing we want. Sell out of a position once you start feeling intense emotion.\n\n&amp;nbsp;\n\n---\n\n#Conclusion\n\nAll in all, options trading is a difficult game with many moving parts - If you're caught skimping on your exits, you’re gonna be kneecapping your gains on a regular basis. This aspect of trading is less glamorous and often overlooked, but is absolutely vital to your success as a trader. I hope this writeup was informative and useful to you all! **If you want some more in depth explanations of each concept, alongside some detailed examples, refer to my Options Trading Exit Strategies video, which you can find [here!](https://www.youtube.com/watch?v=SDKNRF_BZqQ)** If you have any questions, feel free to drop em below and I'll do my best to help you out! Happy Trading Everyone!",
        "subreddit": "wallstreetbets",
        "title": "Options Trading Exit Strategies - A Guide to Exiting Trades with Maximum Profits",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oy25tw/options_trading_exit_strategies_a_guide_to/",
        "created": 1628139404.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1628112107,
        "id": "oy2of0",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "**Disclaimer : This article was written to supplement my Options Trading Exit Strategies video. Those looking for more in depth explanations and examples should refer to the video, which can be found on my profile. Happy Trading!**\n\n&amp;nbsp;\n\n\nWhat’s poppin’ bull-gang, Flux here with an options exit strategy “guide”. I wanted to make this writeup because more often than not, I see people making fundamentally sound trades, only to have their gains vanish due to having poor exit strategy. They either get too greedy and hold on for way too long, or they exit way too early and miss out on an insane runup and want to die for a couple of days afterwards. There’s two parts to each trade - an entry and an exit - and if you’re caught skimping on either end, you’re gonna be kneecapping your gains on a regular basis. Although this part of trading isn’t glamourous, it’s absolutely vital to your overall success as a trader, so it’s crucial that you learn and study these concepts sooner rather than later. With all that being said, let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#Types of Exits\n\nThere’s three types of exits that I tend to use when I conduct my trades, each useful in their own right. I’ll give a quick summary of them all, before providing an in depth analysis and examples of each.\n\n&amp;nbsp;\n\n- **Fundamental Exits** pertain to any form of exit strategy regarding the change of a company’s fundamentals. These exits usually take place before the fundamental changes since you’re not going to be able to react to the changes in real time and you’ll end up getting front run by algos. Examples of this include taking an exit during an earnings runup or rundown, taking exits before company related news events, or taking an exit before any market-wide news events.\n\n&amp;nbsp;\n\n- **Technical Exits** pertain to any form of exit strategy regarding a chart or an indicator - often a combination of the two. Once I see a pattern or indicator pass a certain threshold, I know it’s likely time to exit my position. Some examples of technical exits may include exits taken around support and resistance levels, exits taken during gap fills, exits taken based off of technical patterns, and exits taken during the absence of any concrete patterns or indicators.\n\n&amp;nbsp;\n\n- **Psychologic Exits** pertain to any form of exit strategy regarding market psychology. This is the simplest of the three categories, and is often used in tandem with the other strategies to provide yourself with the best exit possible. Some strategies include exiting around whole numbers, screenshot theory, and individual gain theory. More on these later.\n\n&amp;nbsp;\n\nObviously there are going to be a handful of strategies and categories which I’ve missed, but the ones I outlined above are likely going to be the ones which are most common to us retail traders.\n\n&amp;nbsp;\n\n---\n\n#Fundamental Exits\n\n**Fundamental exits revolve around one key idea - Sell the news.** More often than not, the results of a given news event are already baked into a stock's price well before the news event is confirmed or actually takes place. As a result, the price of a stock will almost always DROP even if this news is “confirmed”, because it was already priced in. This can be observed anywhere from earnings runups to product launches to fundamental news events. You may be wondering why this drop even happens in the first place - if the news is baked into a stock's price, shouldn’t it stay flat when the news is confirmed? Hint : Trading Algorithms.\n\n&amp;nbsp;\n\nAlgorithms, or algos for short, are always behind the inevitable tanking of a stock's price post news event. It’s quite easy to see why once you understand how these algorithms work. An algo can read through an entire earnings report / news transcript / whatever and fire off a corresponding trade in a fraction of a nanosecond, meaning that they’re at a huge advantage since they **have the ability to sell the news after the news event hits.** This means that algos don’t have to prematurely exit their position until they confirm that the underlying security was priced properly. If the underlying was priced to perfection, the algo takes its profits once the news confirms it (very common behavior among algos - take profits once there are no longer any catalysts in play), thereby causing the stock to tank. If the instrument wasn’t priced properly, and there is a huge upside beat, the algo just stays in the trade and reaps the rewards, exiting at a later date instead. This concept is pretty difficult to wrap your head around initially, so let's go through an example.\n\n&amp;nbsp;\n\n**In our hypothetical example, let’s say $AAPL has just reported earnings.** \n\n&amp;nbsp;\n\n**Scenario 1 : $AAPL is priced properly.** The ER comes out, an algo skims it, and confirms that $AAPL was indeed priced properly. The algo then takes its profits (as per common algo behavior), and dumps the position as a result of the priced in ER. Many other algos do the same as well, and the stock price “tanks”, resulting in a gap down the following day, and many left holding the bag, even on a seemingly good ER. Welcome to “priced in”.\n\n&amp;nbsp;\n\n**Scenario 2 : $AAPL is NOT priced properly.** The ER comes out, an algo skims it, and concludes that $AAPL was NOT priced properly. There was a huge upside beat. Instead of selling, the algo stays in the position because it knows that the underlying is undervalued based on the new news, and rides the wave up, exiting the position at a later date. $AAPL was not priced properly, and as a result, the news wasn’t priced in.\n\n&amp;nbsp;\n\nIn both cases, the algos win - they either escape with their profits, or ride the wave up for even more gains. **Us humans cannot act as quickly as an algo, and thus we’ll always be at a disadvantage when it comes to fundamental exits. We always have to exit our positions prior to news catalysts to avoid getting front run.** News events are almost ALWAYS priced in. We can’t sell the news AFTER the news drops because we cant digest and react to the news fast enough. We can’t front run the algorithms, so we need to sell BEFORE any fundamental news catalysts, otherwise we run the risk of holding the bag. If there’s one thing I want you all to take away from this article, it's that you should **always sell the news.**\n\n&amp;nbsp;\n\n---\n\n# Exiting Around Earnings\n\nThis is a very simple concept once we understand the mechanisms outlined above. If you’re in a trade, always look to close it out before earnings (unless you wanna get rug pulled, in which case go ahead, I'm not your daddy). If the news is priced in (which it probably is), you’ll get front run by algos and they’ll steal your profits. Do not gamble on the “priced-in“ news being wrong. You’ll lose that bet 9/10 times. Please note that even if earnings is a beat, that “beat” can still be priced in. Please, exit your trades before earnings, or you run the risk of getting blown out due to your own ignorance.\n\n&amp;nbsp;\n\n# Exiting Around Product Launches\n\nThis is similar to the concept we outlined above. In this hypothetical example, let’s say $AAPL announces that they’re going to reveal a new line of products in August. If that’s the case, get ready to exit your position before the event. Every August $AAPL showcases their new iPhones for the year, therefore even though they haven’t explicitly said they’re going to reveal iPhones, the market is gonna price the event as if iPhones are going to be revealed. Once they reveal that their new products are in fact iPhones, the price will tank, because it was priced in, and algos followed the exact behavior outlined earlier. The only instance in which the price wouldn’t tank would be if they announced that they’re releasing a teleportation device or something. Believe it or not, the odds of that happening are astronomically low, so you’re better off just selling before the reveal instead. Unless $AAPL comes out with something totally unexpected, the price will drop.\n\n&amp;nbsp;\n\n# Exiting Around Fundamental News Events\n\nThis pertains to market moving news as a whole, like an FOMC speech or some macroeconomic event. If you know that JPow is gonna speak on Wednesday, it’s probably best to exit your position before that since you’ve honestly got no idea what’s gonna happen as a byproduct of it. The entire market could take a shit or could fly green, nobody knows. Since we’re traders, not gamblers, it’s in our best interest to exit our positions or hedge in order to shield our gains. Fundamental news events are often crapshoots, and are the leading cause of solid gains getting unjustly erased in an instant.\n\n&amp;nbsp;\n\n---\n\n#Technical Exits\n\nTechnical exits pertain to any form of exit strategy regarding a chart or an indicator - often a combination of the two. In order to have the ability to do a technical exit, you must have a basic understanding of technical charts, patterns, and indicators. The entire field of technical analysis is easy to understand, but hard to master, so even if you don’t have much experience in the area, I’ll do my best to explain it all in a way which is friendly towards newer traders.\n\n&amp;nbsp;\n\n---\n\n#Exiting Around Support and Resistance\n\nThis is often one of the easiest exits to perform, as it’s fairly straightforward to identify on a chart. **Whenever you start to approach an area which you’ve deemed as a key level of support or resistance, consider exiting your trade.** If the price has bounced off of that particular level five times in the past, it’ll likely hold true for the 6th time unless something has fundamentally changed about the company or the markets. As a result, you know that you should exit your trade as you approach the level, as it likely won’t keep going in the same direction once we get to that point. \n\n&amp;nbsp;\n\nAn awesome example of this would be the [$CLF chart.](https://s3.tradingview.com/snapshots/9/9ymcqFZF.png) As we can tell, CLF trades in a nice ascending channel. In this case, we can use our trendlines to easily identify when to exit our trades in order to capture the maximum amount of our gains, saving us massive headaches. Once we get near any of the yellow trendlines, we should consider taking an exit since we’re likely going to bounce off of it. Another great example of similar price movement can be found in [$AMD’s chart.](https://s3.tradingview.com/snapshots/l/LzNxfKpr.png) It trades off of supports and resistances very consistently, allowing us to bag consistent gains. However, unlike CLF, AMD often has breakouts to the upside or downside, making it trickier to trade in the event of a breakout.\n\n&amp;nbsp;\n\nYou may be wondering if there’s any way you can capture the EXTRA gains in the event that the support or resistance levels don’t hold. Although I don’t recommend doing it too often, a well placed stop-loss can help protect your gains in the event that we reject off of a support or resistance, while simultaneously KEEPING you in the trade if we break through the support or resistance. Obviously, you’ll need some experience trading to know exactly where to place your stop, and it’s going to vary from ticker to ticker based on IV and the type of security or derivative you’re trading. A well placed stop-loss can help magnify your returns while also preventing you from giving up any gains you’ve already locked in. Be wary, too tight of a stop could take you out of a trade entirely before a run, but too loose of a stop could cause you to give up too much of your unrealized gains. It’s a fine line to play, and that only comes with experience.\n\n&amp;nbsp;\n\nAnother way you could play breakouts is by using a two stepped approach. First, you take your exit once you approach a given level of support or resistance to lock in your gains. You then set an alert within your broker slightly higher than that given level. If your alert gets tripped, you know that there’s been a breakout, and you’re clear to re-enter the trade to then capture any extra gains that may occur once it starts to run. If I run this strategy, I make sure to set my stop under the newly broken support or resistance in order to preserve my capital in the event of a false breakout. In the end, this method is much safer, but it requires you to sit at your computer twiddling your thumbs waiting for a breakout, so I personally don’t prefer it.\n\n&amp;nbsp;\n\n---\n\n# Exiting Around Gaps\n\nBefore we get into how to trade gaps, we need to understand what gaps are, and why they occur. [**Gaps are areas on a chart where the price of a stock moves sharply without any trades being placed.**](https://s3.tradingview.com/snapshots/a/asVEHysx.png) Usually this happens as a result of a positive or negative catalyst affecting a stock outside of regular trading hours, resulting in a respective gap up or down the following day. A “gap” refers to a gap in the stock's price as a result of no trades being conducted within that range. Gaps are created because of low volume (technically no volume), and as a result, are prone to getting “filled” very quickly. Once we are within the price range of a gap, it’s very common that we will get sucked through the area with prices strongly trending towards the opposite side of the gap as a byproduct of the lack of volume.\n\n&amp;nbsp;\n\nWhen trading gaps, we need to recognize two important levels, and understand how price will act around them. **The very last trade that took place before the gap was created will be a very heavy level of resistance, and the very first trade that takes place after a gap will also be a very heavy level of resistance.** As a result, we will be very prone to rejecting off of these levels, so we want to fully exit our trade around these levels, no exceptions. Once we’re past the initial resistance, we can look to re-enter the trade to capture the rest of our profits.\n\n&amp;nbsp;\n\nUnderstanding all of that, gap trades are relatively simple. First, we ride our trade up to our first level of resistance (the beginning of the gap, aka the price that the first trade was conducted at), and then take our exit to lock in our profits. Afterwards, we set an alert slightly above the resistance, so we get notified once we’re past the resistance and are in the gap. Since we know there’s no trading volume within the gap, there’s a good chance we will get sucked through to the other side, meaning we should look to re-enter the trade as quickly as possible and then ride it to the opposite end of the gap (the end of the gap aka the price that the last trade was conducted at before the gap was created). Once we get to the opposite end of the gap, we fully exit the trade, because we know that 99% of the time we will reject off of this next heavy level of resistance. Gaps have a very rigid structure, and trade very similar to a breakout play. Enter a trade, exit at first resistance. Re-enter the trade after we break resistance, exit once we’re at the second resistance.\n\n&amp;nbsp;\n\n**If this concept was unclear or confusing, refer to the [video](https://www.youtube.com/watch?v=SDKNRF_BZqQ) which has in-depth examples complete with visuals.**\n\n&amp;nbsp;\n\n---\n\n#Clear Skies and Falling Knives\n\nA clear skies situation refers to when a stock is on a tear and has recently carved out new all time highs - think [$AMZN’s recent run to $3750,](https://s3.tradingview.com/snapshots/6/6E9FplY9.png) or [$CRSR’s initial run to $50.](https://s3.tradingview.com/snapshots/e/EHxx1rVZ.png) A falling knife is the flipside of that, and refers to when a stock is essentially in freefall - like $NKLA when people found out Trevor Milton is a rat, or $WKHS when they lost the government contracts. In both situations, it can be extremely difficult to know when you should exit your trade since we don’t have any technical levels to go off of, and as a result, we don’t know when to anticipate a bounce. Even if we did have a general idea of where it was going to bounce, the market often over reacts, resulting in us blowing past our initial mark before starting our initial recovery.\n\n&amp;nbsp;\n\n**The simplest way to play these situations is with a trailing stop.** Trailing stops were invented for situations like these, and they’re honestly one of the most effective yet under-utilized tools. Set the stop, and it’ll trail the stock as it moves. When a stock is carving out new highs, or plunging to new lows, a properly set trailing stop will let you get as close to maximum profits as possible while still allowing you to stay in the trade if we experience some turbulence along the way. If your trailing stop is set properly, you shouldn’t get stopped out of the trade from natural market movements, and will only be forced out once we’ve found a new high or low. I’m not going to teach you how to properly set trailing stops as that’s beyond the scope of this article, but it’s something I may write about in the future given that enough people are interested.\n\n&amp;nbsp;\n\n**Alternatively, if you want to abuse basic human psychology, you could also look to exit your position around whole numbers.** Humans are weird creatures, in the sense that we like “whole” things - stock prices are no exception. You better believe there’s going to be buyers or sellers setting up shop at nice, round numbers. Think $20, $50, $100, etc. If a stock is making a miracle run from $10, and is approaching $20, you better believe there’s going to be a large number of people looking to take profits at the $20 mark, and as a result, you should look to exit the position around there. Again, this isn’t a 100% concrete theory, and sometimes these levels won’t hold at all, but it’s still something to keep in mind. More on this later.\n\n&amp;nbsp;\n\n---\n\n#Technical Caveats\n\n**Please note, that these technical exits won’t hold true given that a company's underlying fundamentals have changed. A stock's technical charts and indicators are only to be used as a summary of a company's fundamentals.** Technicals summarize the price action which is driven by the underlying fundamentals. If the fundamentals of a company change, the technical indicators and charts will also change, thereby making our old technical charts void. This is an extremely important concept that most traders and investors do not fully understand. Technicals summarize fundamentals.\n\n&amp;nbsp;\n\nIf $MSFT announces that they’re coming out with a time machine, don’t expect the stock's price to bounce off of the nearest overhead resistance, as that level is now void. $MSFT has fundamentally changed as a company, and as a result, the technicals will also need to change to reflect that. The same is true to the downside. If $MCD announces that they’ve been grinding up humans and putting them into their hamburgers, don’t expect the nearest level of support to hold - it’s void. The stock will plunge into free fall until $MCD is properly priced given it’s new fundamentals. Only then can we look to start re-establishing our technicals.\n\n&amp;nbsp;\n\n**Technicals are only to be used as a summary of a company’s current fundamentals.**\n\n&amp;nbsp;\n\n---\n\n#Psychological Exits\n\nPsychological exits consist of concepts and rules derived from how humans think and react to certain events. They are more conceptual in nature, and will vary from person to person. They aren’t necessarily as concrete as the other types of exits due to their ambiguous nature. Everyone will apply these exits differently, and as a result I can’t give you a consistent set of rules for each one. I can just explain the general concepts and provide different contexts regarding when to apply them. The rest is up to you!\n\n&amp;nbsp;\n\n---\n\n#Screenshot Theory\n\nThis is a very simple concept that I actually adopted from Wall Street Bets of all places - **If it’s good enough to screenshot, it’s good enough to sell.** If you’re taking screenshots of your unrealized profits to flex on your friends, or random internet people, it’s probably time to sell out of that position. The only reason you feel the need to flex your gains is because it’s a life altering amount of money. I don’t care what the fundamentals, or technicals say at that point. Cash out of the casino, and realize those gains. If it’s good enough to screenshot, it’s good enough to sell.\n\n&amp;nbsp;\n\n# Individual Gain Theory\n\nThis concept refers to when you’re trading with money that you cannot afford to lose, and you come in on somewhat of a win. Profit or loss, this money is going to fundamentally alter your life (for better or worse) because you were put in a position where you had to “trade” money which you also needed elsewhere. If you’re ever in a situation where you’re forced to trade to make some extra dough, take those profits asap. A loss is often going to make your life a hell of a lot worse than a win will.\n\n&amp;nbsp;\n\n# Exiting Around Whole Numbers\n\nHumans are weird creatures - we like “whole” or “round” stuff, numbers being no exception. How often do you catch yourself submitting a buy order for 20$, or a sell order for $50. Unless you’re cognizant of it, you’re not going to think to yourself “imma buy $CLF at 21.83”. There’s a good chance you’re gonna round it up to $22, or down to $20, etc. The same goes for literally EVERYONE else. Just keep in mind that depending on the direction you’re trading, there’s often going to be buyers / sellers at whole numbers. $10, $20, $25, $30, etc. No number is safe. Look to time your exits before or after these numbers, as they may prove to be mini points of resistance. You’ll often see sellers step in at whole numbers on the way up, and buyers step in at whole numbers on the way down. Use this to your advantage.\n\n&amp;nbsp;\n\n---\n\n# Emotional Exits\n\nThis concept applies to two key emotions - Euphoria and Hope. **The instant you start feeling euphoric about a trade and it’s potential gains, step away from the trade.** You’re not going to be thinking clearly enough to make an optimal trade or exit. There’s a very high chance you’re going to continue to chase the victory. If the victory starts slipping away from you, you're likely going to stay in the trade hoping that it goes back up to the previous high that you didn’t sell at. In situations like this, by staying in the trade, you’ll almost always hold your position well past the top, and will be prone to “diamond hands-ing” your profits into the ground, ultimately coming up with a loss on a fundamentally sound trade. \n\n&amp;nbsp;\n\nYou need to be conscious of the fact that you’re euphoric, and that this trade went awesome, and exit the position intelligently. Once you start feeling euphoria, and consequently hope, there’s no going back. You’re not trading on fundamentals, and you’re not trading on technicals either. You’re simply not trading rationally. In situations like this, it’s best to take a step back and exit the trade before you make a boneheaded move and end up giving your gains away. Emotions cloud judgement, and as traders, that’s the last thing we want. Sell out of a position once you start feeling intense emotion.\n\n&amp;nbsp;\n\n---\n\n#Conclusion\n\nAll in all, options trading is a difficult game with many moving parts - If you're caught skimping on your exits, you’re gonna be kneecapping your gains on a regular basis. This aspect of trading is less glamorous and often overlooked, but is absolutely vital to your success as a trader. I hope this writeup was informative and useful to you all! **If you want some more in depth explanations of each concept, alongside some detailed examples, refer to my Options Trading Exit Strategies video, which you can find [here!](https://www.youtube.com/watch?v=SDKNRF_BZqQ)** If you have any questions, feel free to drop em below and I'll do my best to help you out! Happy Trading Everyone!",
        "subreddit": "options",
        "title": "Options Trading Exit Strategies - A Guide to Exiting Trades with Maximum Profits",
        "url": "https://www.reddit.com/r/options/comments/oy2of0/options_trading_exit_strategies_a_guide_to/",
        "created": 1628140907.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1628110538,
        "id": "oy24y9",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "**Disclaimer : This article was written to supplement my Options Trading Exit Strategies video. Those looking for more in depth explanations and examples should refer to the video, which can be found on my profile. Happy Trading!**\n\n&amp;nbsp;\n\n\nWhat’s poppin’ bull-gang, Flux here with an options exit strategy “guide”. I wanted to make this writeup because more often than not, I see people making fundamentally sound trades, only to have their gains vanish due to having poor exit strategy. They either get too greedy and hold on for way too long, or they exit way too early and miss out on an insane runup and want to die for a couple of days afterwards. There’s two parts to each trade - an entry and an exit - and if you’re caught skimping on either end, you’re gonna be kneecapping your gains on a regular basis. Although this part of trading isn’t glamourous, it’s absolutely vital to your overall success as a trader, so it’s crucial that you learn and study these concepts sooner rather than later. With all that being said, let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#Types of Exits\n\nThere’s three types of exits that I tend to use when I conduct my trades, each useful in their own right. I’ll give a quick summary of them all, before providing an in depth analysis and examples of each.\n\n&amp;nbsp;\n\n- **Fundamental Exits** pertain to any form of exit strategy regarding the change of a company’s fundamentals. These exits usually take place before the fundamental changes since you’re not going to be able to react to the changes in real time and you’ll end up getting front run by algos. Examples of this include taking an exit during an earnings runup or rundown, taking exits before company related news events, or taking an exit before any market-wide news events.\n\n&amp;nbsp;\n\n- **Technical Exits** pertain to any form of exit strategy regarding a chart or an indicator - often a combination of the two. Once I see a pattern or indicator pass a certain threshold, I know it’s likely time to exit my position. Some examples of technical exits may include exits taken around support and resistance levels, exits taken during gap fills, exits taken based off of technical patterns, and exits taken during the absence of any concrete patterns or indicators.\n\n&amp;nbsp;\n\n- **Psychologic Exits** pertain to any form of exit strategy regarding market psychology. This is the simplest of the three categories, and is often used in tandem with the other strategies to provide yourself with the best exit possible. Some strategies include exiting around whole numbers, screenshot theory, and individual gain theory. More on these later.\n\n&amp;nbsp;\n\nObviously there are going to be a handful of strategies and categories which I’ve missed, but the ones I outlined above are likely going to be the ones which are most common to us retail traders.\n\n&amp;nbsp;\n\n---\n\n#Fundamental Exits\n\n**Fundamental exits revolve around one key idea - Sell the news.** More often than not, the results of a given news event are already baked into a stock's price well before the news event is confirmed or actually takes place. As a result, the price of a stock will almost always DROP even if this news is “confirmed”, because it was already priced in. This can be observed anywhere from earnings runups to product launches to fundamental news events. You may be wondering why this drop even happens in the first place - if the news is baked into a stock's price, shouldn’t it stay flat when the news is confirmed? Hint : Trading Algorithms.\n\n&amp;nbsp;\n\nAlgorithms, or algos for short, are always behind the inevitable tanking of a stock's price post news event. It’s quite easy to see why once you understand how these algorithms work. An algo can read through an entire earnings report / news transcript / whatever and fire off a corresponding trade in a fraction of a nanosecond, meaning that they’re at a huge advantage since they **have the ability to sell the news after the news event hits.** This means that algos don’t have to prematurely exit their position until they confirm that the underlying security was priced properly. If the underlying was priced to perfection, the algo takes its profits once the news confirms it (very common behavior among algos - take profits once there are no longer any catalysts in play), thereby causing the stock to tank. If the instrument wasn’t priced properly, and there is a huge upside beat, the algo just stays in the trade and reaps the rewards, exiting at a later date instead. This concept is pretty difficult to wrap your head around initially, so let's go through an example.\n\n&amp;nbsp;\n\n**In our hypothetical example, let’s say $AAPL has just reported earnings.** \n\n&amp;nbsp;\n\n**Scenario 1 : $AAPL is priced properly.** The ER comes out, an algo skims it, and confirms that $AAPL was indeed priced properly. The algo then takes its profits (as per common algo behavior), and dumps the position as a result of the priced in ER. Many other algos do the same as well, and the stock price “tanks”, resulting in a gap down the following day, and many left holding the bag, even on a seemingly good ER. Welcome to “priced in”.\n\n&amp;nbsp;\n\n**Scenario 2 : $AAPL is NOT priced properly.** The ER comes out, an algo skims it, and concludes that $AAPL was NOT priced properly. There was a huge upside beat. Instead of selling, the algo stays in the position because it knows that the underlying is undervalued based on the new news, and rides the wave up, exiting the position at a later date. $AAPL was not priced properly, and as a result, the news wasn’t priced in.\n\n&amp;nbsp;\n\nIn both cases, the algos win - they either escape with their profits, or ride the wave up for even more gains. **Us humans cannot act as quickly as an algo, and thus we’ll always be at a disadvantage when it comes to fundamental exits. We always have to exit our positions prior to news catalysts to avoid getting front run.** News events are almost ALWAYS priced in. We can’t sell the news AFTER the news drops because we cant digest and react to the news fast enough. We can’t front run the algorithms, so we need to sell BEFORE any fundamental news catalysts, otherwise we run the risk of holding the bag. If there’s one thing I want you all to take away from this article, it's that you should **always sell the news.**\n\n&amp;nbsp;\n\n---\n\n# Exiting Around Earnings\n\nThis is a very simple concept once we understand the mechanisms outlined above. If you’re in a trade, always look to close it out before earnings (unless you wanna get rug pulled, in which case go ahead, I'm not your daddy). If the news is priced in (which it probably is), you’ll get front run by algos and they’ll steal your profits. Do not gamble on the “priced-in“ news being wrong. You’ll lose that bet 9/10 times. Please note that even if earnings is a beat, that “beat” can still be priced in. Please, exit your trades before earnings, or you run the risk of getting blown out due to your own ignorance.\n\n&amp;nbsp;\n\n# Exiting Around Product Launches\n\nThis is similar to the concept we outlined above. In this hypothetical example, let’s say $AAPL announces that they’re going to reveal a new line of products in August. If that’s the case, get ready to exit your position before the event. Every August $AAPL showcases their new iPhones for the year, therefore even though they haven’t explicitly said they’re going to reveal iPhones, the market is gonna price the event as if iPhones are going to be revealed. Once they reveal that their new products are in fact iPhones, the price will tank, because it was priced in, and algos followed the exact behavior outlined earlier. The only instance in which the price wouldn’t tank would be if they announced that they’re releasing a teleportation device or something. Believe it or not, the odds of that happening are astronomically low, so you’re better off just selling before the reveal instead. Unless $AAPL comes out with something totally unexpected, the price will drop.\n\n&amp;nbsp;\n\n# Exiting Around Fundamental News Events\n\nThis pertains to market moving news as a whole, like an FOMC speech or some macroeconomic event. If you know that JPow is gonna speak on Wednesday, it’s probably best to exit your position before that since you’ve honestly got no idea what’s gonna happen as a byproduct of it. The entire market could take a shit or could fly green, nobody knows. Since we’re traders, not gamblers, it’s in our best interest to exit our positions or hedge in order to shield our gains. Fundamental news events are often crapshoots, and are the leading cause of solid gains getting unjustly erased in an instant.\n\n&amp;nbsp;\n\n---\n\n#Technical Exits\n\nTechnical exits pertain to any form of exit strategy regarding a chart or an indicator - often a combination of the two. In order to have the ability to do a technical exit, you must have a basic understanding of technical charts, patterns, and indicators. The entire field of technical analysis is easy to understand, but hard to master, so even if you don’t have much experience in the area, I’ll do my best to explain it all in a way which is friendly towards newer traders.\n\n&amp;nbsp;\n\n---\n\n#Exiting Around Support and Resistance\n\nThis is often one of the easiest exits to perform, as it’s fairly straightforward to identify on a chart. **Whenever you start to approach an area which you’ve deemed as a key level of support or resistance, consider exiting your trade.** If the price has bounced off of that particular level five times in the past, it’ll likely hold true for the 6th time unless something has fundamentally changed about the company or the markets. As a result, you know that you should exit your trade as you approach the level, as it likely won’t keep going in the same direction once we get to that point. \n\n&amp;nbsp;\n\nAn awesome example of this would be the [$CLF chart.](https://s3.tradingview.com/snapshots/9/9ymcqFZF.png) As we can tell, CLF trades in a nice ascending channel. In this case, we can use our trendlines to easily identify when to exit our trades in order to capture the maximum amount of our gains, saving us massive headaches. Once we get near any of the yellow trendlines, we should consider taking an exit since we’re likely going to bounce off of it. Another great example of similar price movement can be found in [$AMD’s chart.](https://s3.tradingview.com/snapshots/l/LzNxfKpr.png) It trades off of supports and resistances very consistently, allowing us to bag consistent gains. However, unlike CLF, AMD often has breakouts to the upside or downside, making it trickier to trade in the event of a breakout.\n\n&amp;nbsp;\n\nYou may be wondering if there’s any way you can capture the EXTRA gains in the event that the support or resistance levels don’t hold. Although I don’t recommend doing it too often, a well placed stop-loss can help protect your gains in the event that we reject off of a support or resistance, while simultaneously KEEPING you in the trade if we break through the support or resistance. Obviously, you’ll need some experience trading to know exactly where to place your stop, and it’s going to vary from ticker to ticker based on IV and the type of security or derivative you’re trading. A well placed stop-loss can help magnify your returns while also preventing you from giving up any gains you’ve already locked in. Be wary, too tight of a stop could take you out of a trade entirely before a run, but too loose of a stop could cause you to give up too much of your unrealized gains. It’s a fine line to play, and that only comes with experience.\n\n&amp;nbsp;\n\nAnother way you could play breakouts is by using a two stepped approach. First, you take your exit once you approach a given level of support or resistance to lock in your gains. You then set an alert within your broker slightly higher than that given level. If your alert gets tripped, you know that there’s been a breakout, and you’re clear to re-enter the trade to then capture any extra gains that may occur once it starts to run. If I run this strategy, I make sure to set my stop under the newly broken support or resistance in order to preserve my capital in the event of a false breakout. In the end, this method is much safer, but it requires you to sit at your computer twiddling your thumbs waiting for a breakout, so I personally don’t prefer it.\n\n&amp;nbsp;\n\n---\n\n# Exiting Around Gaps\n\nBefore we get into how to trade gaps, we need to understand what gaps are, and why they occur. [**Gaps are areas on a chart where the price of a stock moves sharply without any trades being placed.**](https://s3.tradingview.com/snapshots/a/asVEHysx.png) Usually this happens as a result of a positive or negative catalyst affecting a stock outside of regular trading hours, resulting in a respective gap up or down the following day. A “gap” refers to a gap in the stock's price as a result of no trades being conducted within that range. Gaps are created because of low volume (technically no volume), and as a result, are prone to getting “filled” very quickly. Once we are within the price range of a gap, it’s very common that we will get sucked through the area with prices strongly trending towards the opposite side of the gap as a byproduct of the lack of volume.\n\n&amp;nbsp;\n\nWhen trading gaps, we need to recognize two important levels, and understand how price will act around them. **The very last trade that took place before the gap was created will be a very heavy level of resistance, and the very first trade that takes place after a gap will also be a very heavy level of resistance.** As a result, we will be very prone to rejecting off of these levels, so we want to fully exit our trade around these levels, no exceptions. Once we’re past the initial resistance, we can look to re-enter the trade to capture the rest of our profits.\n\n&amp;nbsp;\n\nUnderstanding all of that, gap trades are relatively simple. First, we ride our trade up to our first level of resistance (the beginning of the gap, aka the price that the first trade was conducted at), and then take our exit to lock in our profits. Afterwards, we set an alert slightly above the resistance, so we get notified once we’re past the resistance and are in the gap. Since we know there’s no trading volume within the gap, there’s a good chance we will get sucked through to the other side, meaning we should look to re-enter the trade as quickly as possible and then ride it to the opposite end of the gap (the end of the gap aka the price that the last trade was conducted at before the gap was created). Once we get to the opposite end of the gap, we fully exit the trade, because we know that 99% of the time we will reject off of this next heavy level of resistance. Gaps have a very rigid structure, and trade very similar to a breakout play. Enter a trade, exit at first resistance. Re-enter the trade after we break resistance, exit once we’re at the second resistance.\n\n&amp;nbsp;\n\n**If this concept was unclear or confusing, refer to the [video](https://www.youtube.com/watch?v=SDKNRF_BZqQ) which has in-depth examples complete with visuals.**\n\n&amp;nbsp;\n\n---\n\n#Clear Skies and Falling Knives\n\nA clear skies situation refers to when a stock is on a tear and has recently carved out new all time highs - think [$AMZN’s recent run to $3750,](https://s3.tradingview.com/snapshots/6/6E9FplY9.png) or [$CRSR’s initial run to $50.](https://s3.tradingview.com/snapshots/e/EHxx1rVZ.png) A falling knife is the flipside of that, and refers to when a stock is essentially in freefall - like $NKLA when people found out Trevor Milton is a rat, or $WKHS when they lost the government contracts. In both situations, it can be extremely difficult to know when you should exit your trade since we don’t have any technical levels to go off of, and as a result, we don’t know when to anticipate a bounce. Even if we did have a general idea of where it was going to bounce, the market often over reacts, resulting in us blowing past our initial mark before starting our initial recovery.\n\n&amp;nbsp;\n\n**The simplest way to play these situations is with a trailing stop.** Trailing stops were invented for situations like these, and they’re honestly one of the most effective yet under-utilized tools. Set the stop, and it’ll trail the stock as it moves. When a stock is carving out new highs, or plunging to new lows, a properly set trailing stop will let you get as close to maximum profits as possible while still allowing you to stay in the trade if we experience some turbulence along the way. If your trailing stop is set properly, you shouldn’t get stopped out of the trade from natural market movements, and will only be forced out once we’ve found a new high or low. I’m not going to teach you how to properly set trailing stops as that’s beyond the scope of this article, but it’s something I may write about in the future given that enough people are interested.\n\n&amp;nbsp;\n\n**Alternatively, if you want to abuse basic human psychology, you could also look to exit your position around whole numbers.** Humans are weird creatures, in the sense that we like “whole” things - stock prices are no exception. You better believe there’s going to be buyers or sellers setting up shop at nice, round numbers. Think $20, $50, $100, etc. If a stock is making a miracle run from $10, and is approaching $20, you better believe there’s going to be a large number of people looking to take profits at the $20 mark, and as a result, you should look to exit the position around there. Again, this isn’t a 100% concrete theory, and sometimes these levels won’t hold at all, but it’s still something to keep in mind. More on this later.\n\n&amp;nbsp;\n\n---\n\n#Technical Caveats\n\n**Please note, that these technical exits won’t hold true given that a company's underlying fundamentals have changed. A stock's technical charts and indicators are only to be used as a summary of a company's fundamentals.** Technicals summarize the price action which is driven by the underlying fundamentals. If the fundamentals of a company change, the technical indicators and charts will also change, thereby making our old technical charts void. This is an extremely important concept that most traders and investors do not fully understand. Technicals summarize fundamentals.\n\n&amp;nbsp;\n\nIf $MSFT announces that they’re coming out with a time machine, don’t expect the stock's price to bounce off of the nearest overhead resistance, as that level is now void. $MSFT has fundamentally changed as a company, and as a result, the technicals will also need to change to reflect that. The same is true to the downside. If $MCD announces that they’ve been grinding up humans and putting them into their hamburgers, don’t expect the nearest level of support to hold - it’s void. The stock will plunge into free fall until $MCD is properly priced given it’s new fundamentals. Only then can we look to start re-establishing our technicals.\n\n&amp;nbsp;\n\n**Technicals are only to be used as a summary of a company’s current fundamentals.**\n\n&amp;nbsp;\n\n---\n\n#Psychological Exits\n\nPsychological exits consist of concepts and rules derived from how humans think and react to certain events. They are more conceptual in nature, and will vary from person to person. They aren’t necessarily as concrete as the other types of exits due to their ambiguous nature. Everyone will apply these exits differently, and as a result I can’t give you a consistent set of rules for each one. I can just explain the general concepts and provide different contexts regarding when to apply them. The rest is up to you!\n\n&amp;nbsp;\n\n---\n\n#Screenshot Theory\n\nThis is a very simple concept that I actually adopted from Wall Street Bets of all places - **If it’s good enough to screenshot, it’s good enough to sell.** If you’re taking screenshots of your unrealized profits to flex on your friends, or random internet people, it’s probably time to sell out of that position. The only reason you feel the need to flex your gains is because it’s a life altering amount of money. I don’t care what the fundamentals, or technicals say at that point. Cash out of the casino, and realize those gains. If it’s good enough to screenshot, it’s good enough to sell.\n\n&amp;nbsp;\n\n# Individual Gain Theory\n\nThis concept refers to when you’re trading with money that you cannot afford to lose, and you come in on somewhat of a win. Profit or loss, this money is going to fundamentally alter your life (for better or worse) because you were put in a position where you had to “trade” money which you also needed elsewhere. If you’re ever in a situation where you’re forced to trade to make some extra dough, take those profits asap. A loss is often going to make your life a hell of a lot worse than a win will.\n\n&amp;nbsp;\n\n# Exiting Around Whole Numbers\n\nHumans are weird creatures - we like “whole” or “round” stuff, numbers being no exception. How often do you catch yourself submitting a buy order for 20$, or a sell order for $50. Unless you’re cognizant of it, you’re not going to think to yourself “imma buy $CLF at 21.83”. There’s a good chance you’re gonna round it up to $22, or down to $20, etc. The same goes for literally EVERYONE else. Just keep in mind that depending on the direction you’re trading, there’s often going to be buyers / sellers at whole numbers. $10, $20, $25, $30, etc. No number is safe. Look to time your exits before or after these numbers, as they may prove to be mini points of resistance. You’ll often see sellers step in at whole numbers on the way up, and buyers step in at whole numbers on the way down. Use this to your advantage.\n\n&amp;nbsp;\n\n---\n\n# Emotional Exits\n\nThis concept applies to two key emotions - Euphoria and Hope. **The instant you start feeling euphoric about a trade and it’s potential gains, step away from the trade.** You’re not going to be thinking clearly enough to make an optimal trade or exit. There’s a very high chance you’re going to continue to chase the victory. If the victory starts slipping away from you, you're likely going to stay in the trade hoping that it goes back up to the previous high that you didn’t sell at. In situations like this, by staying in the trade, you’ll almost always hold your position well past the top, and will be prone to “diamond hands-ing” your profits into the ground, ultimately coming up with a loss on a fundamentally sound trade. \n\n&amp;nbsp;\n\nYou need to be conscious of the fact that you’re euphoric, and that this trade went awesome, and exit the position intelligently. Once you start feeling euphoria, and consequently hope, there’s no going back. You’re not trading on fundamentals, and you’re not trading on technicals either. You’re simply not trading rationally. In situations like this, it’s best to take a step back and exit the trade before you make a boneheaded move and end up giving your gains away. Emotions cloud judgement, and as traders, that’s the last thing we want. Sell out of a position once you start feeling intense emotion.\n\n&amp;nbsp;\n\n---\n\n#Conclusion\n\nAll in all, options trading is a difficult game with many moving parts - If you're caught skimping on your exits, you’re gonna be kneecapping your gains on a regular basis. This aspect of trading is less glamorous and often overlooked, but is absolutely vital to your success as a trader. I hope this writeup was informative and useful to you all! **If you want some more in depth explanations of each concept, alongside some detailed examples, refer to my Options Trading Exit Strategies video, which you can find [here!](https://www.youtube.com/watch?v=SDKNRF_BZqQ)** If you have any questions, feel free to drop em below and I'll do my best to help you out! Happy Trading Everyone!",
        "subreddit": "smallstreetbets",
        "title": "Options Trading Exit Strategies - A Guide to Exiting Trades with Maximum Profits",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/oy24y9/options_trading_exit_strategies_a_guide_to/",
        "created": 1628139338.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1628110008,
        "id": "oy1yey",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**Disclaimer : This article was written to supplement my Options Trading Exit Strategies video. Those looking for more in depth explanations and examples should refer to the video, which can be found [here.](https://www.youtube.com/watch?v=SDKNRF_BZqQ) Happy Trading!**\n\n&amp;nbsp;\n\n\nWhat’s poppin’ bull-gang, Flux here with an options exit strategy “guide”. I wanted to make this writeup because more often than not, I see people making fundamentally sound trades, only to have their gains vanish due to having poor exit strategy. They either get too greedy and hold on for way too long, or they exit way too early and miss out on an insane runup and want to die for a couple of days afterwards. There’s two parts to each trade - an entry and an exit - and if you’re caught skimping on either end, you’re gonna be kneecapping your gains on a regular basis. Although this part of trading isn’t glamourous, it’s absolutely vital to your overall success as a trader, so it’s crucial that you learn and study these concepts sooner rather than later. With all that being said, let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#Types of Exits\n\nThere’s three types of exits that I tend to use when I conduct my trades, each useful in their own right. I’ll give a quick summary of them all, before providing an in depth analysis and examples of each.\n\n&amp;nbsp;\n\n- **Fundamental Exits** pertain to any form of exit strategy regarding the change of a company’s fundamentals. These exits usually take place before the fundamental changes since you’re not going to be able to react to the changes in real time and you’ll end up getting front run by algos. Examples of this include taking an exit during an earnings runup or rundown, taking exits before company related news events, or taking an exit before any market-wide news events.\n\n&amp;nbsp;\n\n- **Technical Exits** pertain to any form of exit strategy regarding a chart or an indicator - often a combination of the two. Once I see a pattern or indicator pass a certain threshold, I know it’s likely time to exit my position. Some examples of technical exits may include exits taken around support and resistance levels, exits taken during gap fills, exits taken based off of technical patterns, and exits taken during the absence of any concrete patterns or indicators.\n\n&amp;nbsp;\n\n- **Psychologic Exits** pertain to any form of exit strategy regarding market psychology. This is the simplest of the three categories, and is often used in tandem with the other strategies to provide yourself with the best exit possible. Some strategies include exiting around whole numbers, screenshot theory, and individual gain theory. More on these later.\n\n&amp;nbsp;\n\nObviously there are going to be a handful of strategies and categories which I’ve missed, but the ones I outlined above are likely going to be the ones which are most common to us retail traders.\n\n&amp;nbsp;\n\n---\n\n#Fundamental Exits\n\n**Fundamental exits revolve around one key idea - Sell the news.** More often than not, the results of a given news event are already baked into a stock's price well before the news event is confirmed or actually takes place. As a result, the price of a stock will almost always DROP even if this news is “confirmed”, because it was already priced in. This can be observed anywhere from earnings runups to product launches to fundamental news events. You may be wondering why this drop even happens in the first place - if the news is baked into a stock's price, shouldn’t it stay flat when the news is confirmed? Hint : Trading Algorithms.\n\n&amp;nbsp;\n\nAlgorithms, or algos for short, are always behind the inevitable tanking of a stock's price post news event. It’s quite easy to see why once you understand how these algorithms work. An algo can read through an entire earnings report / news transcript / whatever and fire off a corresponding trade in a fraction of a nanosecond, meaning that they’re at a huge advantage since they **have the ability to sell the news after the news event hits.** This means that algos don’t have to prematurely exit their position until they confirm that the underlying security was priced properly. If the underlying was priced to perfection, the algo takes its profits once the news confirms it (very common behavior among algos - take profits once there are no longer any catalysts in play), thereby causing the stock to tank. If the instrument wasn’t priced properly, and there is a huge upside beat, the algo just stays in the trade and reaps the rewards, exiting at a later date instead. This concept is pretty difficult to wrap your head around initially, so let's go through an example.\n\n&amp;nbsp;\n\n**In our hypothetical example, let’s say $AAPL has just reported earnings.** \n\n&amp;nbsp;\n\n**Scenario 1 : $AAPL is priced properly.** The ER comes out, an algo skims it, and confirms that $AAPL was indeed priced properly. The algo then takes its profits (as per common algo behavior), and dumps the position as a result of the priced in ER. Many other algos do the same as well, and the stock price “tanks”, resulting in a gap down the following day, and many left holding the bag, even on a seemingly good ER. Welcome to “priced in”.\n\n&amp;nbsp;\n\n**Scenario 2 : $AAPL is NOT priced properly.** The ER comes out, an algo skims it, and concludes that $AAPL was NOT priced properly. There was a huge upside beat. Instead of selling, the algo stays in the position because it knows that the underlying is undervalued based on the new news, and rides the wave up, exiting the position at a later date. $AAPL was not priced properly, and as a result, the news wasn’t priced in.\n\n&amp;nbsp;\n\nIn both cases, the algos win - they either escape with their profits, or ride the wave up for even more gains. **Us humans cannot act as quickly as an algo, and thus we’ll always be at a disadvantage when it comes to fundamental exits. We always have to exit our positions prior to news catalysts to avoid getting front run.** News events are almost ALWAYS priced in. We can’t sell the news AFTER the news drops because we cant digest and react to the news fast enough. We can’t front run the algorithms, so we need to sell BEFORE any fundamental news catalysts, otherwise we run the risk of holding the bag. If there’s one thing I want you all to take away from this article, it's that you should **always sell the news.**\n\n&amp;nbsp;\n\n---\n\n# Exiting Around Earnings\n\nThis is a very simple concept once we understand the mechanisms outlined above. If you’re in a trade, always look to close it out before earnings (unless you wanna get rug pulled, in which case go ahead, I'm not your daddy). If the news is priced in (which it probably is), you’ll get front run by algos and they’ll steal your profits. Do not gamble on the “priced-in“ news being wrong. You’ll lose that bet 9/10 times. Please note that even if earnings is a beat, that “beat” can still be priced in. Please, exit your trades before earnings, or you run the risk of getting blown out due to your own ignorance.\n\n&amp;nbsp;\n\n# Exiting Around Product Launches\n\nThis is similar to the concept we outlined above. In this hypothetical example, let’s say $AAPL announces that they’re going to reveal a new line of products in August. If that’s the case, get ready to exit your position before the event. Every August $AAPL showcases their new iPhones for the year, therefore even though they haven’t explicitly said they’re going to reveal iPhones, the market is gonna price the event as if iPhones are going to be revealed. Once they reveal that their new products are in fact iPhones, the price will tank, because it was priced in, and algos followed the exact behavior outlined earlier. The only instance in which the price wouldn’t tank would be if they announced that they’re releasing a teleportation device or something. Believe it or not, the odds of that happening are astronomically low, so you’re better off just selling before the reveal instead. Unless $AAPL comes out with something totally unexpected, the price will drop.\n\n&amp;nbsp;\n\n# Exiting Around Fundamental News Events\n\nThis pertains to market moving news as a whole, like an FOMC speech or some macroeconomic event. If you know that JPow is gonna speak on Wednesday, it’s probably best to exit your position before that since you’ve honestly got no idea what’s gonna happen as a byproduct of it. The entire market could take a shit or could fly green, nobody knows. Since we’re traders, not gamblers, it’s in our best interest to exit our positions or hedge in order to shield our gains. Fundamental news events are often crapshoots, and are the leading cause of solid gains getting unjustly erased in an instant.\n\n&amp;nbsp;\n\n---\n\n#Technical Exits\n\nTechnical exits pertain to any form of exit strategy regarding a chart or an indicator - often a combination of the two. In order to have the ability to do a technical exit, you must have a basic understanding of technical charts, patterns, and indicators. The entire field of technical analysis is easy to understand, but hard to master, so even if you don’t have much experience in the area, I’ll do my best to explain it all in a way which is friendly towards newer traders.\n\n&amp;nbsp;\n\n---\n\n#Exiting Around Support and Resistance\n\nThis is often one of the easiest exits to perform, as it’s fairly straightforward to identify on a chart. **Whenever you start to approach an area which you’ve deemed as a key level of support or resistance, consider exiting your trade.** If the price has bounced off of that particular level five times in the past, it’ll likely hold true for the 6th time unless something has fundamentally changed about the company or the markets. As a result, you know that you should exit your trade as you approach the level, as it likely won’t keep going in the same direction once we get to that point. \n\n&amp;nbsp;\n\nAn awesome example of this would be the [$CLF chart.](https://s3.tradingview.com/snapshots/9/9ymcqFZF.png) As we can tell, CLF trades in a nice ascending channel. In this case, we can use our trendlines to easily identify when to exit our trades in order to capture the maximum amount of our gains, saving us massive headaches. Once we get near any of the yellow trendlines, we should consider taking an exit since we’re likely going to bounce off of it. Another great example of similar price movement can be found in [$AMD’s chart.](https://s3.tradingview.com/snapshots/l/LzNxfKpr.png) It trades off of supports and resistances very consistently, allowing us to bag consistent gains. However, unlike CLF, AMD often has breakouts to the upside or downside, making it trickier to trade in the event of a breakout.\n\n&amp;nbsp;\n\nYou may be wondering if there’s any way you can capture the EXTRA gains in the event that the support or resistance levels don’t hold. Although I don’t recommend doing it too often, a well placed stop-loss can help protect your gains in the event that we reject off of a support or resistance, while simultaneously KEEPING you in the trade if we break through the support or resistance. Obviously, you’ll need some experience trading to know exactly where to place your stop, and it’s going to vary from ticker to ticker based on IV and the type of security or derivative you’re trading. A well placed stop-loss can help magnify your returns while also preventing you from giving up any gains you’ve already locked in. Be wary, too tight of a stop could take you out of a trade entirely before a run, but too loose of a stop could cause you to give up too much of your unrealized gains. It’s a fine line to play, and that only comes with experience.\n\n&amp;nbsp;\n\nAnother way you could play breakouts is by using a two stepped approach. First, you take your exit once you approach a given level of support or resistance to lock in your gains. You then set an alert within your broker slightly higher than that given level. If your alert gets tripped, you know that there’s been a breakout, and you’re clear to re-enter the trade to then capture any extra gains that may occur once it starts to run. If I run this strategy, I make sure to set my stop under the newly broken support or resistance in order to preserve my capital in the event of a false breakout. In the end, this method is much safer, but it requires you to sit at your computer twiddling your thumbs waiting for a breakout, so I personally don’t prefer it.\n\n&amp;nbsp;\n\n---\n\n# Exiting Around Gaps\n\nBefore we get into how to trade gaps, we need to understand what gaps are, and why they occur. [**Gaps are areas on a chart where the price of a stock moves sharply without any trades being placed.**](https://s3.tradingview.com/snapshots/a/asVEHysx.png) Usually this happens as a result of a positive or negative catalyst affecting a stock outside of regular trading hours, resulting in a respective gap up or down the following day. A “gap” refers to a gap in the stock's price as a result of no trades being conducted within that range. Gaps are created because of low volume (technically no volume), and as a result, are prone to getting “filled” very quickly. Once we are within the price range of a gap, it’s very common that we will get sucked through the area with prices strongly trending towards the opposite side of the gap as a byproduct of the lack of volume.\n\n&amp;nbsp;\n\nWhen trading gaps, we need to recognize two important levels, and understand how price will act around them. **The very last trade that took place before the gap was created will be a very heavy level of resistance, and the very first trade that takes place after a gap will also be a very heavy level of resistance.** As a result, we will be very prone to rejecting off of these levels, so we want to fully exit our trade around these levels, no exceptions. Once we’re past the initial resistance, we can look to re-enter the trade to capture the rest of our profits.\n\n&amp;nbsp;\n\nUnderstanding all of that, gap trades are relatively simple. First, we ride our trade up to our first level of resistance (the beginning of the gap, aka the price that the first trade was conducted at), and then take our exit to lock in our profits. Afterwards, we set an alert slightly above the resistance, so we get notified once we’re past the resistance and are in the gap. Since we know there’s no trading volume within the gap, there’s a good chance we will get sucked through to the other side, meaning we should look to re-enter the trade as quickly as possible and then ride it to the opposite end of the gap (the end of the gap aka the price that the last trade was conducted at before the gap was created). Once we get to the opposite end of the gap, we fully exit the trade, because we know that 99% of the time we will reject off of this next heavy level of resistance. Gaps have a very rigid structure, and trade very similar to a breakout play. Enter a trade, exit at first resistance. Re-enter the trade after we break resistance, exit once we’re at the second resistance.\n\n&amp;nbsp;\n\n**If this concept was unclear or confusing, refer to the [video](https://www.youtube.com/watch?v=SDKNRF_BZqQ) which has in-depth examples complete with visuals.**\n\n&amp;nbsp;\n\n---\n\n#Clear Skies and Falling Knives\n\nA clear skies situation refers to when a stock is on a tear and has recently carved out new all time highs - think [$AMZN’s recent run to $3750,](https://s3.tradingview.com/snapshots/6/6E9FplY9.png) or [$CRSR’s initial run to $50.](https://s3.tradingview.com/snapshots/e/EHxx1rVZ.png) A falling knife is the flipside of that, and refers to when a stock is essentially in freefall - like $NKLA when people found out Trevor Milton is a rat, or $WKHS when they lost the government contracts. In both situations, it can be extremely difficult to know when you should exit your trade since we don’t have any technical levels to go off of, and as a result, we don’t know when to anticipate a bounce. Even if we did have a general idea of where it was going to bounce, the market often over reacts, resulting in us blowing past our initial mark before starting our initial recovery.\n\n&amp;nbsp;\n\n**The simplest way to play these situations is with a trailing stop.** Trailing stops were invented for situations like these, and they’re honestly one of the most effective yet under-utilized tools. Set the stop, and it’ll trail the stock as it moves. When a stock is carving out new highs, or plunging to new lows, a properly set trailing stop will let you get as close to maximum profits as possible while still allowing you to stay in the trade if we experience some turbulence along the way. If your trailing stop is set properly, you shouldn’t get stopped out of the trade from natural market movements, and will only be forced out once we’ve found a new high or low. I’m not going to teach you how to properly set trailing stops as that’s beyond the scope of this article, but it’s something I may write about in the future given that enough people are interested.\n\n&amp;nbsp;\n\n**Alternatively, if you want to abuse basic human psychology, you could also look to exit your position around whole numbers.** Humans are weird creatures, in the sense that we like “whole” things - stock prices are no exception. You better believe there’s going to be buyers or sellers setting up shop at nice, round numbers. Think $20, $50, $100, etc. If a stock is making a miracle run from $10, and is approaching $20, you better believe there’s going to be a large number of people looking to take profits at the $20 mark, and as a result, you should look to exit the position around there. Again, this isn’t a 100% concrete theory, and sometimes these levels won’t hold at all, but it’s still something to keep in mind. More on this later.\n\n&amp;nbsp;\n\n---\n\n#Technical Caveats\n\n**Please note, that these technical exits won’t hold true given that a company's underlying fundamentals have changed. A stock's technical charts and indicators are only to be used as a summary of a company's fundamentals.** Technicals summarize the price action which is driven by the underlying fundamentals. If the fundamentals of a company change, the technical indicators and charts will also change, thereby making our old technical charts void. This is an extremely important concept that most traders and investors do not fully understand. Technicals summarize fundamentals.\n\n&amp;nbsp;\n\nIf $MSFT announces that they’re coming out with a time machine, don’t expect the stock's price to bounce off of the nearest overhead resistance, as that level is now void. $MSFT has fundamentally changed as a company, and as a result, the technicals will also need to change to reflect that. The same is true to the downside. If $MCD announces that they’ve been grinding up humans and putting them into their hamburgers, don’t expect the nearest level of support to hold - it’s void. The stock will plunge into free fall until $MCD is properly priced given it’s new fundamentals. Only then can we look to start re-establishing our technicals.\n\n&amp;nbsp;\n\n**Technicals are only to be used as a summary of a company’s current fundamentals.**\n\n&amp;nbsp;\n\n---\n\n#Psychological Exits\n\nPsychological exits consist of concepts and rules derived from how humans think and react to certain events. They are more conceptual in nature, and will vary from person to person. They aren’t necessarily as concrete as the other types of exits due to their ambiguous nature. Everyone will apply these exits differently, and as a result I can’t give you a consistent set of rules for each one. I can just explain the general concepts and provide different contexts regarding when to apply them. The rest is up to you!\n\n&amp;nbsp;\n\n---\n\n#Screenshot Theory\n\nThis is a very simple concept that I actually adopted from Wall Street Bets of all places - **If it’s good enough to screenshot, it’s good enough to sell.** If you’re taking screenshots of your unrealized profits to flex on your friends, or random internet people, it’s probably time to sell out of that position. The only reason you feel the need to flex your gains is because it’s a life altering amount of money. I don’t care what the fundamentals, or technicals say at that point. Cash out of the casino, and realize those gains. If it’s good enough to screenshot, it’s good enough to sell.\n\n&amp;nbsp;\n\n# Individual Gain Theory\n\nThis concept refers to when you’re trading with money that you cannot afford to lose, and you come in on somewhat of a win. Profit or loss, this money is going to fundamentally alter your life (for better or worse) because you were put in a position where you had to “trade” money which you also needed elsewhere. If you’re ever in a situation where you’re forced to trade to make some extra dough, take those profits asap. A loss is often going to make your life a hell of a lot worse than a win will.\n\n&amp;nbsp;\n\n# Exiting Around Whole Numbers\n\nHumans are weird creatures - we like “whole” or “round” stuff, numbers being no exception. How often do you catch yourself submitting a buy order for 20$, or a sell order for $50. Unless you’re cognizant of it, you’re not going to think to yourself “imma buy $CLF at 21.83”. There’s a good chance you’re gonna round it up to $22, or down to $20, etc. The same goes for literally EVERYONE else. Just keep in mind that depending on the direction you’re trading, there’s often going to be buyers / sellers at whole numbers. $10, $20, $25, $30, etc. No number is safe. Look to time your exits before or after these numbers, as they may prove to be mini points of resistance. You’ll often see sellers step in at whole numbers on the way up, and buyers step in at whole numbers on the way down. Use this to your advantage.\n\n&amp;nbsp;\n\n---\n\n# Emotional Exits\n\nThis concept applies to two key emotions - Euphoria and Hope. **The instant you start feeling euphoric about a trade and it’s potential gains, step away from the trade.** You’re not going to be thinking clearly enough to make an optimal trade or exit. There’s a very high chance you’re going to continue to chase the victory. If the victory starts slipping away from you, you're likely going to stay in the trade hoping that it goes back up to the previous high that you didn’t sell at. In situations like this, by staying in the trade, you’ll almost always hold your position well past the top, and will be prone to “diamond hands-ing” your profits into the ground, ultimately coming up with a loss on a fundamentally sound trade. \n\n&amp;nbsp;\n\nYou need to be conscious of the fact that you’re euphoric, and that this trade went awesome, and exit the position intelligently. Once you start feeling euphoria, and consequently hope, there’s no going back. You’re not trading on fundamentals, and you’re not trading on technicals either. You’re simply not trading rationally. In situations like this, it’s best to take a step back and exit the trade before you make a boneheaded move and end up giving your gains away. Emotions cloud judgement, and as traders, that’s the last thing we want. Sell out of a position once you start feeling intense emotion.\n\n&amp;nbsp;\n\n---\n\n#Conclusion\n\nAll in all, options trading is a difficult game with many moving parts - If you're caught skimping on your exits, you’re gonna be kneecapping your gains on a regular basis. This aspect of trading is less glamorous and often overlooked, but is absolutely vital to your success as a trader. I hope this writeup was informative and useful to you all! **If you want some more in depth explanations of each concept, alongside some detailed examples, refer to my Options Trading Exit Strategies video, which you can find [here!](https://www.youtube.com/watch?v=SDKNRF_BZqQ)** If you have any questions, feel free to drop em below and I'll do my best to help you out! Happy Trading Everyone!",
        "subreddit": "wallstreetbets",
        "title": "Options Trading Exit Strategies - When To Exit a Trade for Maximum Profits",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/oy1yey/options_trading_exit_strategies_when_to_exit_a/",
        "created": 1628138808.0
    },
    {
        "author": "FluxTradesStocks",
        "created_utc": 1628110406,
        "id": "oy238l",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Disclaimer : This article was written to supplement my Options Trading Exit Strategies video. Those looking for more in depth explanations and examples should refer to the video, which can be found on my profile. Happy Trading!**\n\n&amp;nbsp;\n\n\nWhat’s poppin’ bull-gang, Flux here with an options exit strategy “guide”. I wanted to make this writeup because more often than not, I see people making fundamentally sound trades, only to have their gains vanish due to having poor exit strategy. They either get too greedy and hold on for way too long, or they exit way too early and miss out on an insane runup and want to die for a couple of days afterwards. There’s two parts to each trade - an entry and an exit - and if you’re caught skimping on either end, you’re gonna be kneecapping your gains on a regular basis. Although this part of trading isn’t glamourous, it’s absolutely vital to your overall success as a trader, so it’s crucial that you learn and study these concepts sooner rather than later. With all that being said, let’s get into it.\n\n&amp;nbsp;\n\n---\n\n#Types of Exits\n\nThere’s three types of exits that I tend to use when I conduct my trades, each useful in their own right. I’ll give a quick summary of them all, before providing an in depth analysis and examples of each.\n\n&amp;nbsp;\n\n- **Fundamental Exits** pertain to any form of exit strategy regarding the change of a company’s fundamentals. These exits usually take place before the fundamental changes since you’re not going to be able to react to the changes in real time and you’ll end up getting front run by algos. Examples of this include taking an exit during an earnings runup or rundown, taking exits before company related news events, or taking an exit before any market-wide news events.\n\n&amp;nbsp;\n\n- **Technical Exits** pertain to any form of exit strategy regarding a chart or an indicator - often a combination of the two. Once I see a pattern or indicator pass a certain threshold, I know it’s likely time to exit my position. Some examples of technical exits may include exits taken around support and resistance levels, exits taken during gap fills, exits taken based off of technical patterns, and exits taken during the absence of any concrete patterns or indicators.\n\n&amp;nbsp;\n\n- **Psychologic Exits** pertain to any form of exit strategy regarding market psychology. This is the simplest of the three categories, and is often used in tandem with the other strategies to provide yourself with the best exit possible. Some strategies include exiting around whole numbers, screenshot theory, and individual gain theory. More on these later.\n\n&amp;nbsp;\n\nObviously there are going to be a handful of strategies and categories which I’ve missed, but the ones I outlined above are likely going to be the ones which are most common to us retail traders.\n\n&amp;nbsp;\n\n---\n\n#Fundamental Exits\n\n**Fundamental exits revolve around one key idea - Sell the news.** More often than not, the results of a given news event are already baked into a stock's price well before the news event is confirmed or actually takes place. As a result, the price of a stock will almost always DROP even if this news is “confirmed”, because it was already priced in. This can be observed anywhere from earnings runups to product launches to fundamental news events. You may be wondering why this drop even happens in the first place - if the news is baked into a stock's price, shouldn’t it stay flat when the news is confirmed? Hint : Trading Algorithms.\n\n&amp;nbsp;\n\nAlgorithms, or algos for short, are always behind the inevitable tanking of a stock's price post news event. It’s quite easy to see why once you understand how these algorithms work. An algo can read through an entire earnings report / news transcript / whatever and fire off a corresponding trade in a fraction of a nanosecond, meaning that they’re at a huge advantage since they **have the ability to sell the news after the news event hits.** This means that algos don’t have to prematurely exit their position until they confirm that the underlying security was priced properly. If the underlying was priced to perfection, the algo takes its profits once the news confirms it (very common behavior among algos - take profits once there are no longer any catalysts in play), thereby causing the stock to tank. If the instrument wasn’t priced properly, and there is a huge upside beat, the algo just stays in the trade and reaps the rewards, exiting at a later date instead. This concept is pretty difficult to wrap your head around initially, so let's go through an example.\n\n&amp;nbsp;\n\n**In our hypothetical example, let’s say $AAPL has just reported earnings.** \n\n&amp;nbsp;\n\n**Scenario 1 : $AAPL is priced properly.** The ER comes out, an algo skims it, and confirms that $AAPL was indeed priced properly. The algo then takes its profits (as per common algo behavior), and dumps the position as a result of the priced in ER. Many other algos do the same as well, and the stock price “tanks”, resulting in a gap down the following day, and many left holding the bag, even on a seemingly good ER. Welcome to “priced in”.\n\n&amp;nbsp;\n\n**Scenario 2 : $AAPL is NOT priced properly.** The ER comes out, an algo skims it, and concludes that $AAPL was NOT priced properly. There was a huge upside beat. Instead of selling, the algo stays in the position because it knows that the underlying is undervalued based on the new news, and rides the wave up, exiting the position at a later date. $AAPL was not priced properly, and as a result, the news wasn’t priced in.\n\n&amp;nbsp;\n\nIn both cases, the algos win - they either escape with their profits, or ride the wave up for even more gains. **Us humans cannot act as quickly as an algo, and thus we’ll always be at a disadvantage when it comes to fundamental exits. We always have to exit our positions prior to news catalysts to avoid getting front run.** News events are almost ALWAYS priced in. We can’t sell the news AFTER the news drops because we cant digest and react to the news fast enough. We can’t front run the algorithms, so we need to sell BEFORE any fundamental news catalysts, otherwise we run the risk of holding the bag. If there’s one thing I want you all to take away from this article, it's that you should **always sell the news.**\n\n&amp;nbsp;\n\n---\n\n# Exiting Around Earnings\n\nThis is a very simple concept once we understand the mechanisms outlined above. If you’re in a trade, always look to close it out before earnings (unless you wanna get rug pulled, in which case go ahead, I'm not your daddy). If the news is priced in (which it probably is), you’ll get front run by algos and they’ll steal your profits. Do not gamble on the “priced-in“ news being wrong. You’ll lose that bet 9/10 times. Please note that even if earnings is a beat, that “beat” can still be priced in. Please, exit your trades before earnings, or you run the risk of getting blown out due to your own ignorance.\n\n&amp;nbsp;\n\n# Exiting Around Product Launches\n\nThis is similar to the concept we outlined above. In this hypothetical example, let’s say $AAPL announces that they’re going to reveal a new line of products in August. If that’s the case, get ready to exit your position before the event. Every August $AAPL showcases their new iPhones for the year, therefore even though they haven’t explicitly said they’re going to reveal iPhones, the market is gonna price the event as if iPhones are going to be revealed. Once they reveal that their new products are in fact iPhones, the price will tank, because it was priced in, and algos followed the exact behavior outlined earlier. The only instance in which the price wouldn’t tank would be if they announced that they’re releasing a teleportation device or something. Believe it or not, the odds of that happening are astronomically low, so you’re better off just selling before the reveal instead. Unless $AAPL comes out with something totally unexpected, the price will drop.\n\n&amp;nbsp;\n\n# Exiting Around Fundamental News Events\n\nThis pertains to market moving news as a whole, like an FOMC speech or some macroeconomic event. If you know that JPow is gonna speak on Wednesday, it’s probably best to exit your position before that since you’ve honestly got no idea what’s gonna happen as a byproduct of it. The entire market could take a shit or could fly green, nobody knows. Since we’re traders, not gamblers, it’s in our best interest to exit our positions or hedge in order to shield our gains. Fundamental news events are often crapshoots, and are the leading cause of solid gains getting unjustly erased in an instant.\n\n&amp;nbsp;\n\n---\n\n#Technical Exits\n\nTechnical exits pertain to any form of exit strategy regarding a chart or an indicator - often a combination of the two. In order to have the ability to do a technical exit, you must have a basic understanding of technical charts, patterns, and indicators. The entire field of technical analysis is easy to understand, but hard to master, so even if you don’t have much experience in the area, I’ll do my best to explain it all in a way which is friendly towards newer traders.\n\n&amp;nbsp;\n\n---\n\n#Exiting Around Support and Resistance\n\nThis is often one of the easiest exits to perform, as it’s fairly straightforward to identify on a chart. **Whenever you start to approach an area which you’ve deemed as a key level of support or resistance, consider exiting your trade.** If the price has bounced off of that particular level five times in the past, it’ll likely hold true for the 6th time unless something has fundamentally changed about the company or the markets. As a result, you know that you should exit your trade as you approach the level, as it likely won’t keep going in the same direction once we get to that point. \n\n&amp;nbsp;\n\nAn awesome example of this would be the [$CLF chart.](https://s3.tradingview.com/snapshots/9/9ymcqFZF.png) As we can tell, CLF trades in a nice ascending channel. In this case, we can use our trendlines to easily identify when to exit our trades in order to capture the maximum amount of our gains, saving us massive headaches. Once we get near any of the yellow trendlines, we should consider taking an exit since we’re likely going to bounce off of it. Another great example of similar price movement can be found in [$AMD’s chart.](https://s3.tradingview.com/snapshots/l/LzNxfKpr.png) It trades off of supports and resistances very consistently, allowing us to bag consistent gains. However, unlike CLF, AMD often has breakouts to the upside or downside, making it trickier to trade in the event of a breakout.\n\n&amp;nbsp;\n\nYou may be wondering if there’s any way you can capture the EXTRA gains in the event that the support or resistance levels don’t hold. Although I don’t recommend doing it too often, a well placed stop-loss can help protect your gains in the event that we reject off of a support or resistance, while simultaneously KEEPING you in the trade if we break through the support or resistance. Obviously, you’ll need some experience trading to know exactly where to place your stop, and it’s going to vary from ticker to ticker based on IV and the type of security or derivative you’re trading. A well placed stop-loss can help magnify your returns while also preventing you from giving up any gains you’ve already locked in. Be wary, too tight of a stop could take you out of a trade entirely before a run, but too loose of a stop could cause you to give up too much of your unrealized gains. It’s a fine line to play, and that only comes with experience.\n\n&amp;nbsp;\n\nAnother way you could play breakouts is by using a two stepped approach. First, you take your exit once you approach a given level of support or resistance to lock in your gains. You then set an alert within your broker slightly higher than that given level. If your alert gets tripped, you know that there’s been a breakout, and you’re clear to re-enter the trade to then capture any extra gains that may occur once it starts to run. If I run this strategy, I make sure to set my stop under the newly broken support or resistance in order to preserve my capital in the event of a false breakout. In the end, this method is much safer, but it requires you to sit at your computer twiddling your thumbs waiting for a breakout, so I personally don’t prefer it.\n\n&amp;nbsp;\n\n---\n\n# Exiting Around Gaps\n\nBefore we get into how to trade gaps, we need to understand what gaps are, and why they occur. [**Gaps are areas on a chart where the price of a stock moves sharply without any trades being placed.**](https://s3.tradingview.com/snapshots/a/asVEHysx.png) Usually this happens as a result of a positive or negative catalyst affecting a stock outside of regular trading hours, resulting in a respective gap up or down the following day. A “gap” refers to a gap in the stock's price as a result of no trades being conducted within that range. Gaps are created because of low volume (technically no volume), and as a result, are prone to getting “filled” very quickly. Once we are within the price range of a gap, it’s very common that we will get sucked through the area with prices strongly trending towards the opposite side of the gap as a byproduct of the lack of volume.\n\n&amp;nbsp;\n\nWhen trading gaps, we need to recognize two important levels, and understand how price will act around them. **The very last trade that took place before the gap was created will be a very heavy level of resistance, and the very first trade that takes place after a gap will also be a very heavy level of resistance.** As a result, we will be very prone to rejecting off of these levels, so we want to fully exit our trade around these levels, no exceptions. Once we’re past the initial resistance, we can look to re-enter the trade to capture the rest of our profits.\n\n&amp;nbsp;\n\nUnderstanding all of that, gap trades are relatively simple. First, we ride our trade up to our first level of resistance (the beginning of the gap, aka the price that the first trade was conducted at), and then take our exit to lock in our profits. Afterwards, we set an alert slightly above the resistance, so we get notified once we’re past the resistance and are in the gap. Since we know there’s no trading volume within the gap, there’s a good chance we will get sucked through to the other side, meaning we should look to re-enter the trade as quickly as possible and then ride it to the opposite end of the gap (the end of the gap aka the price that the last trade was conducted at before the gap was created). Once we get to the opposite end of the gap, we fully exit the trade, because we know that 99% of the time we will reject off of this next heavy level of resistance. Gaps have a very rigid structure, and trade very similar to a breakout play. Enter a trade, exit at first resistance. Re-enter the trade after we break resistance, exit once we’re at the second resistance.\n\n&amp;nbsp;\n\n**If this concept was unclear or confusing, refer to the [video](https://www.youtube.com/watch?v=SDKNRF_BZqQ) which has in-depth examples complete with visuals.**\n\n&amp;nbsp;\n\n---\n\n#Clear Skies and Falling Knives\n\nA clear skies situation refers to when a stock is on a tear and has recently carved out new all time highs - think [$AMZN’s recent run to $3750,](https://s3.tradingview.com/snapshots/6/6E9FplY9.png) or [$CRSR’s initial run to $50.](https://s3.tradingview.com/snapshots/e/EHxx1rVZ.png) A falling knife is the flipside of that, and refers to when a stock is essentially in freefall - like $NKLA when people found out Trevor Milton is a rat, or $WKHS when they lost the government contracts. In both situations, it can be extremely difficult to know when you should exit your trade since we don’t have any technical levels to go off of, and as a result, we don’t know when to anticipate a bounce. Even if we did have a general idea of where it was going to bounce, the market often over reacts, resulting in us blowing past our initial mark before starting our initial recovery.\n\n&amp;nbsp;\n\n**The simplest way to play these situations is with a trailing stop.** Trailing stops were invented for situations like these, and they’re honestly one of the most effective yet under-utilized tools. Set the stop, and it’ll trail the stock as it moves. When a stock is carving out new highs, or plunging to new lows, a properly set trailing stop will let you get as close to maximum profits as possible while still allowing you to stay in the trade if we experience some turbulence along the way. If your trailing stop is set properly, you shouldn’t get stopped out of the trade from natural market movements, and will only be forced out once we’ve found a new high or low. I’m not going to teach you how to properly set trailing stops as that’s beyond the scope of this article, but it’s something I may write about in the future given that enough people are interested.\n\n&amp;nbsp;\n\n**Alternatively, if you want to abuse basic human psychology, you could also look to exit your position around whole numbers.** Humans are weird creatures, in the sense that we like “whole” things - stock prices are no exception. You better believe there’s going to be buyers or sellers setting up shop at nice, round numbers. Think $20, $50, $100, etc. If a stock is making a miracle run from $10, and is approaching $20, you better believe there’s going to be a large number of people looking to take profits at the $20 mark, and as a result, you should look to exit the position around there. Again, this isn’t a 100% concrete theory, and sometimes these levels won’t hold at all, but it’s still something to keep in mind. More on this later.\n\n&amp;nbsp;\n\n---\n\n#Technical Caveats\n\n**Please note, that these technical exits won’t hold true given that a company's underlying fundamentals have changed. A stock's technical charts and indicators are only to be used as a summary of a company's fundamentals.** Technicals summarize the price action which is driven by the underlying fundamentals. If the fundamentals of a company change, the technical indicators and charts will also change, thereby making our old technical charts void. This is an extremely important concept that most traders and investors do not fully understand. Technicals summarize fundamentals.\n\n&amp;nbsp;\n\nIf $MSFT announces that they’re coming out with a time machine, don’t expect the stock's price to bounce off of the nearest overhead resistance, as that level is now void. $MSFT has fundamentally changed as a company, and as a result, the technicals will also need to change to reflect that. The same is true to the downside. If $MCD announces that they’ve been grinding up humans and putting them into their hamburgers, don’t expect the nearest level of support to hold - it’s void. The stock will plunge into free fall until $MCD is properly priced given it’s new fundamentals. Only then can we look to start re-establishing our technicals.\n\n&amp;nbsp;\n\n**Technicals are only to be used as a summary of a company’s current fundamentals.**\n\n&amp;nbsp;\n\n---\n\n#Psychological Exits\n\nPsychological exits consist of concepts and rules derived from how humans think and react to certain events. They are more conceptual in nature, and will vary from person to person. They aren’t necessarily as concrete as the other types of exits due to their ambiguous nature. Everyone will apply these exits differently, and as a result I can’t give you a consistent set of rules for each one. I can just explain the general concepts and provide different contexts regarding when to apply them. The rest is up to you!\n\n&amp;nbsp;\n\n---\n\n#Screenshot Theory\n\nThis is a very simple concept that I actually adopted from Wall Street Bets of all places - **If it’s good enough to screenshot, it’s good enough to sell.** If you’re taking screenshots of your unrealized profits to flex on your friends, or random internet people, it’s probably time to sell out of that position. The only reason you feel the need to flex your gains is because it’s a life altering amount of money. I don’t care what the fundamentals, or technicals say at that point. Cash out of the casino, and realize those gains. If it’s good enough to screenshot, it’s good enough to sell.\n\n&amp;nbsp;\n\n# Individual Gain Theory\n\nThis concept refers to when you’re trading with money that you cannot afford to lose, and you come in on somewhat of a win. Profit or loss, this money is going to fundamentally alter your life (for better or worse) because you were put in a position where you had to “trade” money which you also needed elsewhere. If you’re ever in a situation where you’re forced to trade to make some extra dough, take those profits asap. A loss is often going to make your life a hell of a lot worse than a win will.\n\n&amp;nbsp;\n\n# Exiting Around Whole Numbers\n\nHumans are weird creatures - we like “whole” or “round” stuff, numbers being no exception. How often do you catch yourself submitting a buy order for 20$, or a sell order for $50. Unless you’re cognizant of it, you’re not going to think to yourself “imma buy $CLF at 21.83”. There’s a good chance you’re gonna round it up to $22, or down to $20, etc. The same goes for literally EVERYONE else. Just keep in mind that depending on the direction you’re trading, there’s often going to be buyers / sellers at whole numbers. $10, $20, $25, $30, etc. No number is safe. Look to time your exits before or after these numbers, as they may prove to be mini points of resistance. You’ll often see sellers step in at whole numbers on the way up, and buyers step in at whole numbers on the way down. Use this to your advantage.\n\n&amp;nbsp;\n\n---\n\n# Emotional Exits\n\nThis concept applies to two key emotions - Euphoria and Hope. **The instant you start feeling euphoric about a trade and it’s potential gains, step away from the trade.** You’re not going to be thinking clearly enough to make an optimal trade or exit. There’s a very high chance you’re going to continue to chase the victory. If the victory starts slipping away from you, you're likely going to stay in the trade hoping that it goes back up to the previous high that you didn’t sell at. In situations like this, by staying in the trade, you’ll almost always hold your position well past the top, and will be prone to “diamond hands-ing” your profits into the ground, ultimately coming up with a loss on a fundamentally sound trade. \n\n&amp;nbsp;\n\nYou need to be conscious of the fact that you’re euphoric, and that this trade went awesome, and exit the position intelligently. Once you start feeling euphoria, and consequently hope, there’s no going back. You’re not trading on fundamentals, and you’re not trading on technicals either. You’re simply not trading rationally. In situations like this, it’s best to take a step back and exit the trade before you make a boneheaded move and end up giving your gains away. Emotions cloud judgement, and as traders, that’s the last thing we want. Sell out of a position once you start feeling intense emotion.\n\n&amp;nbsp;\n\n---\n\n#Conclusion\n\nAll in all, options trading is a difficult game with many moving parts - If you're caught skimping on your exits, you’re gonna be kneecapping your gains on a regular basis. This aspect of trading is less glamorous and often overlooked, but is absolutely vital to your success as a trader. I hope this writeup was informative and useful to you all! **If you want some more in depth explanations of each concept, alongside some detailed examples, refer to my Options Trading Exit Strategies video, which you can find [here!](https://www.youtube.com/watch?v=SDKNRF_BZqQ)** If you have any questions, feel free to drop em below and I'll do my best to help you out! Happy Trading Everyone!",
        "subreddit": "options",
        "title": "Options Trading Exit Strategies - A Guide to Exiting Trades with Maximum Profits",
        "url": "https://www.reddit.com/r/options/comments/oy238l/options_trading_exit_strategies_a_guide_to/",
        "created": 1628139206.0
    },
    {
        "author": "delsystem32exe",
        "created_utc": 1627937645,
        "id": "ownmn1",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "today i had some long citrix calls, sold a 20 delta call OTM only for it to double in value by market close... it will expire on friday, but it seems like diagnols underperform.",
        "subreddit": "options",
        "title": "do diagnols underperform long calls.",
        "url": "https://www.reddit.com/r/options/comments/ownmn1/do_diagnols_underperform_long_calls/",
        "created": 1627966445.0
    }
]