[
    {
        "author": "mat025",
        "created_utc": 1630856236,
        "id": "pifa8n",
        "num_comments": 180,
        "num_crossposts": 0,
        "selftext": "My top tech stocks watchlist that pays dividends:\n\n|Ticker|AAPL|MSFT|AVGO|CSCO|INTC|NVDA|TXN|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|Yield|0.57%|0.74%|2.89%|2.49%|2.6%|0.07%|2.15%|\n|PE|30.20|37.78|19.92|18.79|11.89|76.98|25.73|\n|Payout|17.22%|28.11%|57.65%|46.54%|30.89%|5.39%|55.28%|\n|Div Growth YR|9|17|10|10|7|0|15|\n|CAGR 5yr|9.3%|9.52%|50%|9.21%|6.12%|7.66%|21.83%|\n|YOY Rev|13.26%|14.68%|8.46%|\\-0.01%|0.57%|36.16%|9.04%|\n|My Buy Alert|Hold|Hold|BUY|Hold|BUY|Hold|Hold|\n\nMy buying criteria is PE less than **20**, Payout less than **80%**, Dividend growth year at least **1 year,** CAGR for **5** years higher than **3%**, YOY revenue growth higher than **0%**. \n\nSource: my own spreadsheet and seekingalpha.com",
        "subreddit": "investing",
        "title": "My top tech stocks to watch that pays dividends",
        "url": "https://www.reddit.com/r/investing/comments/pifa8n/my_top_tech_stocks_to_watch_that_pays_dividends/",
        "created": 1630885036.0
    },
    {
        "author": "mat025",
        "created_utc": 1630856081,
        "id": "pif8jm",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "My top tech stocks watchlist that pays dividends:\n\n|Ticker|AAPL|MSFT|AVGO|CSCO|INTC|NVDA|TXN|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|Yield|0.57%|0.74%|2.89%|2.49%|2.6%|0.07%|2.15%|\n|PE|30.20|37.78|19.92|18.79|11.89|76.98|25.73|\n|Payout|17.22%|28.11%|57.65%|46.54%|30.89%|5.39%|55.28%|\n|Div Growth YR|9|17|10|10|7|0|15|\n|CAGR 5yr|9.3%|9.52%|50%|9.21%|6.12%|7.66%|21.83%|\n|YOY Rev|13.26%|14.68%|8.46%|\\-0.01%|0.57%|36.16%|9.04%|\n|My Buy Alert|Hold|Hold|BUY|Hold|BUY|Hold|Hold|\n\nMy buying criteria is PE less than **20**, Payout less than **80%**, Dividend growth year at least **1 year,** CAGR for **5** years higher than **3%**, YOY revenue growth higher than **0%**. \n\nSource: My own spreadsheet and seekingalpha.com",
        "subreddit": "ValueInvesting",
        "title": "My top tech stocks to watch that pays dividends",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/pif8jm/my_top_tech_stocks_to_watch_that_pays_dividends/",
        "created": 1630884881.0
    },
    {
        "author": "Gravelordservant13x",
        "created_utc": 1630694436,
        "id": "phb5uw",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "Not financial advice personal opinion\n\nGreat earnings report crushing the estimates and opening up about more potential sales with APPLE\n\nBig whale money coming into the calls for September 24th indicating a potential boom. Price target seems to be $540 and $550\n\nI am jumping in and going to be buying 40k worth of calls for 9/24 540c @.70 \n\nI strongly recommend jumping in before the boom it’s at its lowest it’s been all week. Going from .50 all the way to 4.00 strike within minutes. \n\nRight before the earnings there was a giant buy in surging the price up over 110% and I believe there is more to come\n\nApple and Broadcom are going to make great things happen this year take the train and ride to the promise lands with our trendies\n\nLet’s be retards together and make this money",
        "subreddit": "wallstreetbets",
        "title": "AVGO absolutely about to blow up 9/24 $540calls @.70",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phb5uw/avgo_absolutely_about_to_blow_up_924_540calls_70/",
        "created": 1630723236.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1630702953,
        "id": "phdt3m",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, September 3, 2021**\n\nStocks finished the day mixed, with the S&amp;P 500 (SPY) and Dow Jones (DIA) falling while the tech-heavy Nasdaq (QQQ) pushed higher, closing 0.31% higher. The Russell 2000 (IWM), which tracks the performance of small-caps, fell 0.46%. Market participants are digesting the release of the August Jobs Report, which showed a sharp deceleration in employment amid the latest surge by the coronavirus Delta variant. \n\nThe Labor Department released their monthly unemployment report, which showed hiring in August slow down dramatically as the US continues to battle massive spikes in coronavirus Delta cases in certain parts of the country, mainly the South/Southeast (according to the CDC, roughly ⅓ of all COVID-related hospitalizations are in Texas and Florida as both states deal with record coronavirus cases and low hospital capacity). Due to this surge and the reimposition of pandemic-era restrictions in areas with high transmission rates, employment numbers came in shockingly low compared to estimates and the previous month’s numbers. Here are the numbers.\n\n* **Change in non-farm payrolls:** \\+235,000 vs. +733,000 expected and a revised +1.053 million in July\n* **Unemployment rate, August:** 5.2% vs. 5.2% expected and 5.4% in July\n* **Average hourly earnings, month-over-month:** 0.6% vs. 0.3% expected and 0.4% in July \n* **Average hourly earnings, year-over-year:** 4.3% vs. 3.9% expected and 4.0% in July\n\nPresident Biden said of the report, “While I know some wanted to see a larger number today and so did I, what we’ve seen this year in continued growth, month after month, in job creation. This is the kind of growth that makes our economy stronger.”\n\nThis is a little confusing but follow me here. In a weird quirk of the market, the low employment numbers actually benefit equities by staving off the need for tapering, which is why we saw tech stocks in particular popping today. Members of the Fed have consistently signaled they will be looking especially close at labor market data to determine when to start tapering the pandemic-era quantitative easing program. Federal Reserve Governor Christopher Waller said the August Jobs Report could be his signal to hit the “substantial further progress mark” the Fed stipulated in December and begin tapering. He said, “I think that one more good job report if it’s in the 850,000 to 1 million range will be sufficient to claim substantial further progress in employment for tapering.” Regardless, as I have said before, I remain unconcerned by taper talks, I think the real test for equities will come when discussion about potential interest rate hikes begins.\n\nSteve Sosnick, Chief Strategist at Interactive Brokers, said of the report “What we’re seeing is the market really trying to wrestle with the idea of what matters to it more: Is it about the economy, or is it about monetary policy? Now, we’ve been in a monetary-driven market for so long it’s hard to say that monetary factors aren’t at the forefront of the market’s mindset right now. But what I think we may be seeing here … we can’t really figure out whether this delays tapering in a meaningful way. But there’s stuff in here that is not necessarily bad other than the headline number. Wages are good, the unemployment rate is good.”\n\n**Highlights**\n\n* Moderna (MRNA), Workday (WDAY), Nvidia (NVDA) were among the best-performing stocks in the Nasdaq today, driving it higher.\n* US auto safety regulators disclosed they are investigating a July 26 fatal crash involving a Tesla that may or may not have been using the advanced driver assistance system. This is the latest regulatory headache for Tesla and their autonomous driving technology given there is already another investigation currently underway.\n* Dish’s (DISH) Sling TV, which reportedly has 2.7 million subs as of December 2020, has partnered with Penn National Gaming (PENN) to launch a Barstools Sports Channel on its streaming service. \n* Match Group (MTCH), which owns popular dating app Tinder, filed a letter with Dutch competition regulators to public state their decision regarding a complaint filed against Apple for anti-competitive practices for forcing Match to use Apple’s in-app payment system. Ever since Fortnite-maker Epic Games’ original lawsuit against Apple regarding this seems more and more companies are hopping on. A new South Korean law that was recently passed forces Apple and Google to accept third-party payment systems.\n* Amid regulatory crackdown and a falling stock price, Alibaba (BABA) committed to spending the equivalent of roughly $15.5 billion by 2025 towards the Chinese Communist Party’s drive to “common prosperity”. \n* Beyond Meats (BYND) COO Sanjay Shah steps down from his role with no public explanation given. He originally joined the company from Tesla in 2019\n* **\\*\\*Please note that current stock price was written premarket and may not reflect closing prices\\*\\***\n* Adobe (ADBE) target raised by Argus from $650 to $764 at Buy. Stock currently around $665\n* Broadcom (AVGO) with a host of target raises. Average price target $550 at Buy. Stock currently around $498\n* DocuSign (DOCU) with a host of target raises. Average price target $345 at Buy. Stock currently around $310\n* Lululemon (LULU) target raised by Telsey Advisory Group from $440 to $460 at Outperform. Stock currently around $388\n* Quanta Services (PWR) with three target raises. Stock currently around $116\n   * Northland Securities from $103 to $129 at Outperform\n   * Piper Sandler from $120 to $140 at Overweight. Stock currently around $116\n   * KeyCorp from $115 to $129 at Overweight. Stock currently around $116\n* American Eagle (AEO) target raised by Deutsche Bank from $43 to $45 at Buy. Stock currently around $27\n* Kirkland (KIRK) target raised by Craig Hallum from $37 to $40 at Buy. Stock currently around $24\n\n“Our greatest glory is not in never falling, but in rising every time we fall.” - Confucius",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, September 3, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/phdt3m/here_is_a_market_recap_for_today_friday_september/",
        "created": 1630731753.0
    },
    {
        "author": "investing-scientist2",
        "created_utc": 1630599692,
        "id": "pgl6ia",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Here is a couple of stocks that might be worth your attention this week. They were selected using a couple of criteria - most of them heavily rely an the company's fundamentals; the analysts recommendations are only provided as a kind of support for the hand-picked names. This is why I’m calling the approach a **consensus strategy.** \n\nThe stocks I’m going to present you below are generally believed to outperform the stock market in the coming months, they have a consensus recommendation of Buy, their fundamentals are scored considerably better than most stocks and their average target price by stock analysts is above current market valuation.\n\nIn order to consider buying the stock’s shares, the following criteria need to be satisfied:\n\n* **TheStreet score**: A+, A or A-\n* **Zacks Rank**: 1 (Strong Buy), 2 (Buy) or 3 (Hold)\n* **Weiss Ratings recommendation**: A or B\n* **Yahoo Finance recommendation**: at least mixed Buy/Hold\n* **Yahoo Finance target price**: min. 5% higher than current price\n* **Piotroski F-Score**: min. 4\n* **InvestorsObserver Overall Score**: min. 50  \n\n**Note**: Descriptions of those criteria are provided at the end of this post as well as [HERE](https://www.investing-scientist.com/research/top-stocks-to-buy-a-consensus-strategy/). If you decide to buy any of the below stocks, you might want to consider the following selling conditions (at least one of them should be satisfied):\n\n* price is higher or close to target\n* profit is in range 20% – 30%\n* loss is higher than 50%\n* TheStreet recommendation is changed to Sell\n* Weiss Ratings recommendation is changed to Sell\n* Yahoo Finance recommendation is changed to Sell\n\n###### Let’s now take a look at the stocks I’ve identified with this strategy today.\n\n&amp;#x200B;\n\n### APPLE INC (AAPL)\n\n**Sector**: Electronic Technology  \n**Industry**: Telecommunications Equipment  \n**Description**: Apple, Inc engages in the design, manufacture, and sale of smartphones, personal computers, tablets, wearables and accessories, and other variety of related services. Its products and services include iPhone, Mac, iPad, AirPods, Apple TV, Apple Watch, Beats products, Apple Care, iCloud, digital content stores, streaming, and licensing services. The company was founded by Steven Paul Jobs, Ronald Gerald Wayne, and Stephen G. Wozniak in 1977 and is headquartered in Cupertino, CA.  \n**Dividend**: Apple pays an annual dividend of $0.88 per share, with a dividend yield of 0.57%. AAPL's most recent quarterly dividend payment was made to shareholders of record on Thursday, August 12. The company has grown its dividend for the last 8 consecutive years and is increasing its dividend by an average of 9.50% each year. Apple pays out 26.83% of its earnings out as a dividend.  \n**Current valuation**: $153.72\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A**  \nZacks Rank: **Buy**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$166.23**  \nYahoo Finance 1 year change: **8.14%**  \nPiotroski F-Score: **7**  \nInvestorsObserver Overall Score: **58**\n\n&amp;#x200B;\n\n### BROADCOM INC (AVGO)\n\n**Sector**: Electronic Technology  \n**Industry**: Semiconductors  \n**Description**: Broadcom, Inc. is a global technology company, which designs, develops and supplies semiconductor and infrastructure software solutions. It operates through the following segments: Semiconductor Solutions and Infrastructure Software. The Semiconductor Solutions segment manages movement of data in data center, telecom, enterprise and embedded networking applications. The Infrastructure Software segment provides a portfolio of mainframe, enterprise and storage area networking solutions.  \n**Dividend**: Broadcom pays an annual dividend of $14.40 per share, with a dividend yield of 2.93%. AVGO's most recent quarterly dividend payment was made to shareholders of record on Wednesday, June 30. The company has grown its dividend for the last 10 consecutive years and is increasing its dividend by an average of 40.53% each year. Broadcom pays out 78.05% of its earnings out as a dividend.  \n**Current valuation**: $491.48\n\n##### Valuation of entry parameters:\n\nTheStreet score: A  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$530.62**  \nYahoo Finance 1 year change: **7.96%**  \nPiotroski F-Score: **7**  \nInvestorsObserver Overall Score: **76**\n\n&amp;#x200B;\n\n### COMCAST CORP (CMCSA)\n\n**Sector**: Consumer Services  \n**Industry**: Cable/Satellite TV  \n**Description**: Comcast Corporation is a media and technology company. The Company has two primary businesses: Comcast Cable and NBCUniversal. Its Comcast Cable business operates in the Cable Communications segment. Its NBCUniversal business operates in four business segments: Cable Networks, Broadcast Television, Filmed Entertainment and Theme Parks.  \n**Dividend**: Comcast pays an annual dividend of $1.00 per share, with a dividend yield of 1.62%. CMCSA's next quarterly dividend payment will be made to shareholders of record on Wednesday, October 27. The company has grown its dividend for the last 10 consecutive years and is increasing its dividend by an average of 23.96% each year. Comcast pays out 38.31% of its earnings out as a dividend.  \n**Current valuation**: $61.64\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A-**  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$66.74**  \nYahoo Finance 1 year change: **8.27%**  \nPiotroski F-Score: **5**  \nInvestorsObserver Overall Score: **70**\n\n&amp;#x200B;\n\n### CRA INTERNATIONAL INC (CRAI)\n\n**Sector**: Commercial Services  \n**Industry**: Miscellaneous Commercial Services  \n**Description**: CRA International, Inc. is a consulting firm, which engages in provision of economic, financial and management consulting services. It offers consulting services through the litigation, regulatory, financial, and management consulting areas. The company was founded in 1965 and is headquartered in Boston, MA.  \n**Dividend**: CRA International pays an annual dividend of $1.04 per share, with a dividend yield of 1.06%. CRAI's next quarterly dividend payment will be made to shareholders of record on Friday, September 10. The company has grown its dividend for the last 4 consecutive years and is increasing its dividend by an average of 17.21% each year. CRA International pays out 31.04% of its earnings out as a dividend.  \n**Current valuation**: $95.0\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A-**  \nZacks Rank: **Strong Buy**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$110.0**  \nYahoo Finance 1 year change: **15.79%**  \nPiotroski F-Score: **8**  \nInvestorsObserver Overall Score: **85**\n\n&amp;#x200B;\n\n### CVS HEALTH CORP (CVS)\n\n**Sector**: Retail Trade  \n**Industry**: Drugstore Chains  \n**Description**: CVS Health Corp. engages in the provision of health care services. It operates through the following segments: Pharmacy Services, Retail or Long Term Care, Health Care Benefits, and Corporate/Other. The company was founded by Stanley P. Goldstein and Ralph Hoagland in 1963 and is headquartered in Woonsocket, RI.  \n**Dividend**: CVS Health pays an annual dividend of $2.00 per share, with a dividend yield of 2.29%. CVS's most recent quarterly dividend payment was made to shareholders of record on Monday, August 2. CVS Health pays out 26.67% of its earnings out as a dividend.  \n**Current valuation**: $86.89\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A-**  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$96.32**  \nYahoo Finance 1 year change: **10.85%**  \nPiotroski F-Score: **4**  \nInvestorsObserver Overall Score: **74**\n\n&amp;#x200B;\n\n### JOHNSON &amp; JOHNSON (JNJ)\n\n**Sector**: Health Technology  \n**Industry**: Pharmaceuticals: Major  \n**Description**: Johnson \\&amp;amp; Johnson is a holding company, which is engaged in the research and development, manufacture and sale of a range of products in the healthcare field. It operates through three segments: Consumer, Pharmaceutical and Medical Devices. Its primary focus is products related to human health and well-being. Its research facilities are located in the United States, Belgium, Brazil, Canada, China, France, Germany, India, Israel, Japan, the Netherlands, Singapore, Switzerland and the United Kingdom.  \n**Dividend**: Johnson &amp; Johnson pays an annual dividend of $4.24 per share, with a dividend yield of 2.43%. JNJ's next quarterly dividend payment will be made to shareholders of record on Tuesday, September 7. The company has grown its dividend for the last 59 consecutive years and is increasing its dividend by an average of 6.23% each year. Johnson &amp; Johnson pays out 52.80% of its earnings out as a dividend.  \n**Current valuation**: $174.93\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A**  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$189.61**  \nYahoo Finance 1 year change: **8.39%**  \nPiotroski F-Score: **7**  \nInvestorsObserver Overall Score: **64**  \n\n\n \n\n#### Now, a few words on the criteria I’m using and sources of data.\n\n**1. TheStreet score**\n\nThe first filtering step is to get stocks with Buy recommendation at TheStreet stock screener. I’m only keeping stocks with A+, A or A- rating (top ones), although A-, B+, B and B- are Buys as well.\n\nFrom thestreet.com:\n\n***A (Excellent)*** *– The stock has an excellent track record for maximizing performance while minimizing risk, thus delivering the best possible combination of total return on investment and reduced volatility. It has made the most of the recent economic environment to maximize risk-adjusted returns compared to other stocks. While past performance is just an indication — not a guarantee — we believe this fund is among the most likely to deliver superior performance relative to risk in the future as well.*\n\nAnd about the methodology (source: https://www.thestreet.com/r/ratings/reports/detail/T.html):\n\n*TheStreet Ratings’ stock model projects a stock’s total return potential over a 12-month period including both price appreciation and* ***dividends****. Our Buy, Hold or Sell ratings designate how we expect these stocks to perform against a general benchmark of the equities market and interest rates. While our model is quantitative, it utilizes both* ***subjective*** *and* ***objective*** *elements. For instance, subjective elements include expected equities market returns, future interest rates, implied industry outlook and forecasted company earnings. Objective elements include volatility of past operating revenues, financial strength, and company cash flows.*\n\n**2. Zacks Rank**\n\nIt is required that the Zacks Rank is Hold, Buy or Strong Buy (so we’re avoiding stocks with Sell and Strong Sell recommendations). The Zacks Rating utilizes a completely different system, based on company earnings-related data, in particular earnings estimate revisions and earnings surprises, to predict profitability of holding the company’s shares. More from https://www.zacks.com/education/stock-education/zacks-rank-guide-6:\n\n*A portfolio of Zacks Rank #1 (Strong Buy) stocks has beaten the market in 26 of the last 31 years with an average annual return of* ***+24.3%*** *a year; more than double that of the S&amp;P 500’s +10.6% .*\n\n**3. Weiss Ratings recommendation**\n\nWe’re only keeping stocks with Buy (B) or Strong Buy (A) recommendation.\n\nWjat are these scores? This is what I found at their website:\n\n*“A” Rating:* ***Excellent.*** *The company’s stock has an excellent track record for providing strong performance with lower-than-average risk, and it is trading at a price that represents good value relative to the company’s earnings prospects. While past performance is no guarantee of future results, our opinion is that this stock is among the most likely to deliver superior performance relative to risk in the future. Of course, even the best stocks can decline in a down market. But our “A” rating can generally be considered the equivalent of a “****Strong Buy****“.*\n\n*“B” rating:* ***Good.*** *The company’s stock has a good track record for delivering a balance of performance and risk. While the risk-adjusted performance of any stock is subject to change, our opinion is that this stock is a good value, with good prospects for outperforming the market. Although even good investments can decline in a down market, our “B” rating is considered the equivalent of a “****Buy****“.*\n\n**4.  Yahoo Finance  recommendation and target price**\n\nIt is required that the Yahoo Finance stock recommendation is at least mixed Buy/Hold from experts. Additionally, the predicted target price (average, from experts) should be at least 5% higher than the current one.\n\n**5. Piotroski F-Score**\n\nThe Piotroski score is a number between 0-9 that reflects nine criteria used to determine the strength of a company’s financial situation, including profitability, leverage or operating efficiency. Zero is the worst value and nine is the best. As we can read in[ Piotroski’s paper](https://pdfs.semanticscholar.org/9dc9/b030da18ab28d1e1a1bbf7e33fb5911f189e.pdf) from 2000:\n\n*In addition, an investment strategy that buys expected winners and shorts expected losers generates a* ***23% annual return*** *between 1976 and 1996, and the strategy appears to be robust across time and to controls for alternative investment strategies.*\n\nIt is required that the score is 4 or higher. The values were retrieved from https://www.gurufocus.com.\n\n**6. InvestorsObserver Overall Score**\n\nThe rank has a value in between 0 and 100. It takes into account both **technical** analysis and **fundamental** stock data. An Overall Rank of N means that a given company is rated above N% of stocks, therefore the higher the number, the better. My requirement is that the company has InvestorsObserver Overall score of at least 50.\n\n*The Overall Score combines our two technical scores (Short Term and Long Term) with our Fundamental Score into one metric. This makes our overall score a great place to start when evaluating stocks, regardless of your investing style.*\n\n*A low score doesn’t necessarily mean a stock is likely to go down, just that our system doesn’t think there’s much of a bullish case for it.*\n\nPlease note that the company profile data (short description) was taken from  tradingview (sometimes I shortened it) and dividend data was retrieved from MarketBeat.\n\nI hope you enjoyed the reading. What do you think about this stock selection and the strategy? Feel free to leave a comment below.\n\n*Michael*\n\n&amp;#x200B;\n\nDisclosures:\n\n* What you see here is my personal opinion, my own investments and should not be treated as investing advice\n* I’m an amateur investor",
        "subreddit": "investing",
        "title": "Six attractive stocks IMHO (AAPL AVGO CMCSA CRAI CVS JNJ). What do you think?",
        "url": "https://www.reddit.com/r/investing/comments/pgl6ia/six_attractive_stocks_imho_aapl_avgo_cmcsa_crai/",
        "created": 1630628492.0
    },
    {
        "author": "Legal_Grocery",
        "created_utc": 1630608199,
        "id": "pgnzpg",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AVGO EARNINGS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgnzpg/avgo_earnings/",
        "created": 1630636999.0
    },
    {
        "author": "Legal_Grocery",
        "created_utc": 1630608116,
        "id": "pgnypx",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AVGO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgnypx/avgo/",
        "created": 1630636916.0
    },
    {
        "author": "Gravelordservant13x",
        "created_utc": 1630694155,
        "id": "phb2sd",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Great earnings report crushing the estimates and opening up about more potential sales with APPLE\n\nBig whale money coming into the calls for September 24th indicating a potential boom. Price target seems to be $540 and $550\n\nI am jumping in and going to be buying 40k worth of calls for 9/24 540c @.70 \n\nI strongly recommend jumping in before the boom it’s at its lowest it’s been all week. \n\nLet’s be retards together",
        "subreddit": "wallstreetbets",
        "title": "AVGO is getting ready to explode to the upside I highly recommend jumping in. 9/24 540call @ .70",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phb2sd/avgo_is_getting_ready_to_explode_to_the_upside_i/",
        "created": 1630722955.0
    },
    {
        "author": "Gravelordservant13x",
        "created_utc": 1630693796,
        "id": "phaypu",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "AVGO BIG WHALE MONEY COMING IN 9/24 CALLS $540 @.120",
        "url": "https://i.redd.it/2uois84d0cl71.jpg",
        "created": 1630722596.0
    },
    {
        "author": "Gravelordservant13x",
        "created_utc": 1630693558,
        "id": "phaw18",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Good potential for boom on 9/24 calls for AVGO. Big news coming personally 540 and 550 are the targets that they could hit coming up.",
        "subreddit": "wallstreetbets",
        "title": "AVGO big earnings $$$",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phaw18/avgo_big_earnings/",
        "created": 1630722358.0
    },
    {
        "author": "investing-scientist2",
        "created_utc": 1630599692,
        "id": "pgl6ia",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "Here is a couple of stocks that might be worth your attention this week. They were selected using a couple of criteria - most of them heavily rely an the company's fundamentals; the analysts recommendations are only provided as a kind of support for the hand-picked names. This is why I’m calling the approach a **consensus strategy.** \n\nThe stocks I’m going to present you below are generally believed to outperform the stock market in the coming months, they have a consensus recommendation of Buy, their fundamentals are scored considerably better than most stocks and their average target price by stock analysts is above current market valuation.\n\nIn order to consider buying the stock’s shares, the following criteria need to be satisfied:\n\n* **TheStreet score**: A+, A or A-\n* **Zacks Rank**: 1 (Strong Buy), 2 (Buy) or 3 (Hold)\n* **Weiss Ratings recommendation**: A or B\n* **Yahoo Finance recommendation**: at least mixed Buy/Hold\n* **Yahoo Finance target price**: min. 5% higher than current price\n* **Piotroski F-Score**: min. 4\n* **InvestorsObserver Overall Score**: min. 50  \n\n**Note**: Descriptions of those criteria are provided at the end of this post as well as [HERE](https://www.investing-scientist.com/research/top-stocks-to-buy-a-consensus-strategy/). If you decide to buy any of the below stocks, you might want to consider the following selling conditions (at least one of them should be satisfied):\n\n* price is higher or close to target\n* profit is in range 20% – 30%\n* loss is higher than 50%\n* TheStreet recommendation is changed to Sell\n* Weiss Ratings recommendation is changed to Sell\n* Yahoo Finance recommendation is changed to Sell\n\n###### Let’s now take a look at the stocks I’ve identified with this strategy today.\n\n&amp;#x200B;\n\n### APPLE INC (AAPL)\n\n**Sector**: Electronic Technology  \n**Industry**: Telecommunications Equipment  \n**Description**: Apple, Inc engages in the design, manufacture, and sale of smartphones, personal computers, tablets, wearables and accessories, and other variety of related services. Its products and services include iPhone, Mac, iPad, AirPods, Apple TV, Apple Watch, Beats products, Apple Care, iCloud, digital content stores, streaming, and licensing services. The company was founded by Steven Paul Jobs, Ronald Gerald Wayne, and Stephen G. Wozniak in 1977 and is headquartered in Cupertino, CA.  \n**Dividend**: Apple pays an annual dividend of $0.88 per share, with a dividend yield of 0.57%. AAPL's most recent quarterly dividend payment was made to shareholders of record on Thursday, August 12. The company has grown its dividend for the last 8 consecutive years and is increasing its dividend by an average of 9.50% each year. Apple pays out 26.83% of its earnings out as a dividend.  \n**Current valuation**: $153.72\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A**  \nZacks Rank: **Buy**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$166.23**  \nYahoo Finance 1 year change: **8.14%**  \nPiotroski F-Score: **7**  \nInvestorsObserver Overall Score: **58**\n\n&amp;#x200B;\n\n### BROADCOM INC (AVGO)\n\n**Sector**: Electronic Technology  \n**Industry**: Semiconductors  \n**Description**: Broadcom, Inc. is a global technology company, which designs, develops and supplies semiconductor and infrastructure software solutions. It operates through the following segments: Semiconductor Solutions and Infrastructure Software. The Semiconductor Solutions segment manages movement of data in data center, telecom, enterprise and embedded networking applications. The Infrastructure Software segment provides a portfolio of mainframe, enterprise and storage area networking solutions.  \n**Dividend**: Broadcom pays an annual dividend of $14.40 per share, with a dividend yield of 2.93%. AVGO's most recent quarterly dividend payment was made to shareholders of record on Wednesday, June 30. The company has grown its dividend for the last 10 consecutive years and is increasing its dividend by an average of 40.53% each year. Broadcom pays out 78.05% of its earnings out as a dividend.  \n**Current valuation**: $491.48\n\n##### Valuation of entry parameters:\n\nTheStreet score: A  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$530.62**  \nYahoo Finance 1 year change: **7.96%**  \nPiotroski F-Score: **7**  \nInvestorsObserver Overall Score: **76**\n\n&amp;#x200B;\n\n### COMCAST CORP (CMCSA)\n\n**Sector**: Consumer Services  \n**Industry**: Cable/Satellite TV  \n**Description**: Comcast Corporation is a media and technology company. The Company has two primary businesses: Comcast Cable and NBCUniversal. Its Comcast Cable business operates in the Cable Communications segment. Its NBCUniversal business operates in four business segments: Cable Networks, Broadcast Television, Filmed Entertainment and Theme Parks.  \n**Dividend**: Comcast pays an annual dividend of $1.00 per share, with a dividend yield of 1.62%. CMCSA's next quarterly dividend payment will be made to shareholders of record on Wednesday, October 27. The company has grown its dividend for the last 10 consecutive years and is increasing its dividend by an average of 23.96% each year. Comcast pays out 38.31% of its earnings out as a dividend.  \n**Current valuation**: $61.64\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A-**  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$66.74**  \nYahoo Finance 1 year change: **8.27%**  \nPiotroski F-Score: **5**  \nInvestorsObserver Overall Score: **70**\n\n&amp;#x200B;\n\n### CRA INTERNATIONAL INC (CRAI)\n\n**Sector**: Commercial Services  \n**Industry**: Miscellaneous Commercial Services  \n**Description**: CRA International, Inc. is a consulting firm, which engages in provision of economic, financial and management consulting services. It offers consulting services through the litigation, regulatory, financial, and management consulting areas. The company was founded in 1965 and is headquartered in Boston, MA.  \n**Dividend**: CRA International pays an annual dividend of $1.04 per share, with a dividend yield of 1.06%. CRAI's next quarterly dividend payment will be made to shareholders of record on Friday, September 10. The company has grown its dividend for the last 4 consecutive years and is increasing its dividend by an average of 17.21% each year. CRA International pays out 31.04% of its earnings out as a dividend.  \n**Current valuation**: $95.0\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A-**  \nZacks Rank: **Strong Buy**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$110.0**  \nYahoo Finance 1 year change: **15.79%**  \nPiotroski F-Score: **8**  \nInvestorsObserver Overall Score: **85**\n\n&amp;#x200B;\n\n### CVS HEALTH CORP (CVS)\n\n**Sector**: Retail Trade  \n**Industry**: Drugstore Chains  \n**Description**: CVS Health Corp. engages in the provision of health care services. It operates through the following segments: Pharmacy Services, Retail or Long Term Care, Health Care Benefits, and Corporate/Other. The company was founded by Stanley P. Goldstein and Ralph Hoagland in 1963 and is headquartered in Woonsocket, RI.  \n**Dividend**: CVS Health pays an annual dividend of $2.00 per share, with a dividend yield of 2.29%. CVS's most recent quarterly dividend payment was made to shareholders of record on Monday, August 2. CVS Health pays out 26.67% of its earnings out as a dividend.  \n**Current valuation**: $86.89\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A-**  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$96.32**  \nYahoo Finance 1 year change: **10.85%**  \nPiotroski F-Score: **4**  \nInvestorsObserver Overall Score: **74**\n\n&amp;#x200B;\n\n### JOHNSON &amp; JOHNSON (JNJ)\n\n**Sector**: Health Technology  \n**Industry**: Pharmaceuticals: Major  \n**Description**: Johnson \\&amp;amp; Johnson is a holding company, which is engaged in the research and development, manufacture and sale of a range of products in the healthcare field. It operates through three segments: Consumer, Pharmaceutical and Medical Devices. Its primary focus is products related to human health and well-being. Its research facilities are located in the United States, Belgium, Brazil, Canada, China, France, Germany, India, Israel, Japan, the Netherlands, Singapore, Switzerland and the United Kingdom.  \n**Dividend**: Johnson &amp; Johnson pays an annual dividend of $4.24 per share, with a dividend yield of 2.43%. JNJ's next quarterly dividend payment will be made to shareholders of record on Tuesday, September 7. The company has grown its dividend for the last 59 consecutive years and is increasing its dividend by an average of 6.23% each year. Johnson &amp; Johnson pays out 52.80% of its earnings out as a dividend.  \n**Current valuation**: $174.93\n\n##### Valuation of entry parameters:\n\nTheStreet score: **A**  \nZacks Rank: **Hold**  \nWeiss Ratings recommendation: **Buy**  \nYahoo Finance recommendation: **Buy**  \nYahoo Finance target price: **$189.61**  \nYahoo Finance 1 year change: **8.39%**  \nPiotroski F-Score: **7**  \nInvestorsObserver Overall Score: **64**  \n\n\n \n\n#### Now, a few words on the criteria I’m using and sources of data.\n\n**1. TheStreet score**\n\nThe first filtering step is to get stocks with Buy recommendation at TheStreet stock screener. I’m only keeping stocks with A+, A or A- rating (top ones), although A-, B+, B and B- are Buys as well.\n\nFrom thestreet.com:\n\n***A (Excellent)*** *– The stock has an excellent track record for maximizing performance while minimizing risk, thus delivering the best possible combination of total return on investment and reduced volatility. It has made the most of the recent economic environment to maximize risk-adjusted returns compared to other stocks. While past performance is just an indication — not a guarantee — we believe this fund is among the most likely to deliver superior performance relative to risk in the future as well.*\n\nAnd about the methodology (source: https://www.thestreet.com/r/ratings/reports/detail/T.html):\n\n*TheStreet Ratings’ stock model projects a stock’s total return potential over a 12-month period including both price appreciation and* ***dividends****. Our Buy, Hold or Sell ratings designate how we expect these stocks to perform against a general benchmark of the equities market and interest rates. While our model is quantitative, it utilizes both* ***subjective*** *and* ***objective*** *elements. For instance, subjective elements include expected equities market returns, future interest rates, implied industry outlook and forecasted company earnings. Objective elements include volatility of past operating revenues, financial strength, and company cash flows.*\n\n**2. Zacks Rank**\n\nIt is required that the Zacks Rank is Hold, Buy or Strong Buy (so we’re avoiding stocks with Sell and Strong Sell recommendations). The Zacks Rating utilizes a completely different system, based on company earnings-related data, in particular earnings estimate revisions and earnings surprises, to predict profitability of holding the company’s shares. More from https://www.zacks.com/education/stock-education/zacks-rank-guide-6:\n\n*A portfolio of Zacks Rank #1 (Strong Buy) stocks has beaten the market in 26 of the last 31 years with an average annual return of* ***+24.3%*** *a year; more than double that of the S&amp;P 500’s +10.6% .*\n\n**3. Weiss Ratings recommendation**\n\nWe’re only keeping stocks with Buy (B) or Strong Buy (A) recommendation.\n\nWjat are these scores? This is what I found at their website:\n\n*“A” Rating:* ***Excellent.*** *The company’s stock has an excellent track record for providing strong performance with lower-than-average risk, and it is trading at a price that represents good value relative to the company’s earnings prospects. While past performance is no guarantee of future results, our opinion is that this stock is among the most likely to deliver superior performance relative to risk in the future. Of course, even the best stocks can decline in a down market. But our “A” rating can generally be considered the equivalent of a “****Strong Buy****“.*\n\n*“B” rating:* ***Good.*** *The company’s stock has a good track record for delivering a balance of performance and risk. While the risk-adjusted performance of any stock is subject to change, our opinion is that this stock is a good value, with good prospects for outperforming the market. Although even good investments can decline in a down market, our “B” rating is considered the equivalent of a “****Buy****“.*\n\n**4.  Yahoo Finance  recommendation and target price**\n\nIt is required that the Yahoo Finance stock recommendation is at least mixed Buy/Hold from experts. Additionally, the predicted target price (average, from experts) should be at least 5% higher than the current one.\n\n**5. Piotroski F-Score**\n\nThe Piotroski score is a number between 0-9 that reflects nine criteria used to determine the strength of a company’s financial situation, including profitability, leverage or operating efficiency. Zero is the worst value and nine is the best. As we can read in[ Piotroski’s paper](https://pdfs.semanticscholar.org/9dc9/b030da18ab28d1e1a1bbf7e33fb5911f189e.pdf) from 2000:\n\n*In addition, an investment strategy that buys expected winners and shorts expected losers generates a* ***23% annual return*** *between 1976 and 1996, and the strategy appears to be robust across time and to controls for alternative investment strategies.*\n\nIt is required that the score is 4 or higher. The values were retrieved from https://www.gurufocus.com.\n\n**6. InvestorsObserver Overall Score**\n\nThe rank has a value in between 0 and 100. It takes into account both **technical** analysis and **fundamental** stock data. An Overall Rank of N means that a given company is rated above N% of stocks, therefore the higher the number, the better. My requirement is that the company has InvestorsObserver Overall score of at least 50.\n\n*The Overall Score combines our two technical scores (Short Term and Long Term) with our Fundamental Score into one metric. This makes our overall score a great place to start when evaluating stocks, regardless of your investing style.*\n\n*A low score doesn’t necessarily mean a stock is likely to go down, just that our system doesn’t think there’s much of a bullish case for it.*\n\nPlease note that the company profile data (short description) was taken from  tradingview (sometimes I shortened it) and dividend data was retrieved from MarketBeat.\n\nI hope you enjoyed the reading. What do you think about this stock selection and the strategy? Feel free to leave a comment below.\n\n*Michael*\n\n&amp;#x200B;\n\nDisclosures:\n\n* What you see here is my personal opinion, my own investments and should not be treated as investing advice\n* I’m an amateur investor",
        "subreddit": "investing",
        "title": "Six attractive stocks IMHO (AAPL AVGO CMCSA CRAI CVS JNJ). What do you think?",
        "url": "https://www.reddit.com/r/investing/comments/pgl6ia/six_attractive_stocks_imho_aapl_avgo_cmcsa_crai/",
        "created": 1630628492.0
    },
    {
        "author": "Legal_Grocery",
        "created_utc": 1630608199,
        "id": "pgnzpg",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AVGO EARNINGS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgnzpg/avgo_earnings/",
        "created": 1630636999.0
    },
    {
        "author": "Legal_Grocery",
        "created_utc": 1630608116,
        "id": "pgnypx",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "AVGO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgnypx/avgo/",
        "created": 1630636916.0
    },
    {
        "author": "dhpw2",
        "created_utc": 1630494145,
        "id": "pfrkoo",
        "num_comments": 506,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of ESG investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "stocks",
        "title": "Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/stocks/comments/pfrkoo/cathie_woods_ark_files_for_new_transparency_etf/",
        "created": 1630522945.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1630500205,
        "id": "pft42l",
        "num_comments": 167,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of ESG investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "investing",
        "title": "Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/investing/comments/pft42l/cathie_woods_ark_files_for_new_transparency_etf/",
        "created": 1630529005.0
    },
    {
        "author": "dhpw2",
        "created_utc": 1630494457,
        "id": "pfrncw",
        "num_comments": 148,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of Environmental, Social and Governance  investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "wallstreetbets",
        "title": "Another One! Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfrncw/another_one_cathie_woods_ark_files_for_new/",
        "created": 1630523257.0
    },
    {
        "author": "MVST_100_OR_BUST6",
        "created_utc": 1630500749,
        "id": "pft9ja",
        "num_comments": 60,
        "num_crossposts": 0,
        "selftext": "This makes zero sense to me. I was expecting red but a 20% dump is insane given its $70 ATH. The confusion is that for the past several days/weeks people have been warning about this date for a long time. So effectively it should have been priced in with all the weak hands leaving, and for at least the option IV should have increased yet it wasnt, and now puts more than doubled. Also at times when the market is overly sure of event X going in Y direction, the absolute opposite happens. Its pretty fucking wild that we pretty much all called it. Usually that never happens. Anyone who bought puts was granted the easiest play ever. \n\nYou can claim its the PIPE dumping but I dont think the Saudis are stupid enough to dump all their shares in pre-market. There are no short shares available. It seems like retail is all selling NOW despite being warned extensively.",
        "subreddit": "SPACs",
        "title": "Why is LCID Tanking?",
        "url": "https://www.reddit.com/r/SPACs/comments/pft9ja/why_is_lcid_tanking/",
        "created": 1630529549.0
    },
    {
        "author": "WhatsFoodG",
        "created_utc": 1630498326,
        "id": "pfslld",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "Listen up you autistic retards this shit is serious. Coinbase has basically been hoeing hardcore since its direct listing in April. This bitch has been getting reamed for 4 months BUT \\*cue picture\\* let's take a look at the chart and see what's up\n\n&amp;#x200B;\n\n[COIN Daily Chart](https://preview.redd.it/x6qvq5tiuvk71.png?width=2358&amp;format=png&amp;auto=webp&amp;s=e3eec4721d35b1315ec0be5e51129e93926fc00f)\n\nNow i ain't no fucking artist and i may have a learning disability but I know a cup when i see one and if you look at this chart, even in ur peripheries you'll notice a small cup and handle that's formed in between the support lines, you'll also notice the middle support line recently did an r/S flip i.e. went from being a resistance line to support line.\n\n&amp;#x200B;\n\nNow with the small cup in place it may be high time for Coinbase to continue this trend up and fill up the bigger cup by flying back to the 420-450 range. Also the velocity at which alt currencies move if there is a decent rally in the next few weeks, there's potential this sees an even bigger push to go back up where it came from. The MACD looks bullish with potentially indicating this reversal will become a rally. \n\n&amp;#x200B;\n\n However, the fundamentals are also insanely undervalued right now. I'm talking this thing has a mufuckin current PE ratio of 28 only considering the first 2 quarters this year i.e. NOT COUNTING any estimates from q3 and q4 this year. I'm talking they made rev of about a billion dollars in FY2020 with about 350 mill in net income, Q1 2021 they made over 1.6 billion in revenue and more than doubled net income relative to the ENTIRE PREVIOUS YEAR.  Q2 2021 they made revenue of 2.23 billion netting 1.6 fucking billion in a damn quarter. They're literally reaching exponential growth as we speak and lets be honest the industry they're in is primed to grow substantially in the foreseeable future. Now if you look at their guidance for q3 and q4 they are not expecting to beat the net income of q2 but they also expect continued profitability and could potentially beat forecasts IF certain coins that are traded on their platform rally hard. For comparison, Square is trading at a FORWARD PE (2024) of 73, PayPal FORWARD PE 2024 of 32, I could go on and on. So really their current annual PE is considerably less than 28 once earnings come in for q3 and q4.\n\n&amp;#x200B;\n\nThis is a cash cow of a company fundamentals and technicals seem to be aligning nicely. I think you can't go wrong with far out leaps however you must know that I am retarded and you would be an even bigger retard if you listened to me, jk you prolly can't even read so I'm not worried.\n\n&amp;#x200B;\n\nTL:DR COIN to the moon fam!!!\n\nEdit: I’m not currently in a position but considering loading the $300 calls exp dec 21",
        "subreddit": "wallstreetbets",
        "title": "Code Green: COIN Breakout Imminent!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfslld/code_green_coin_breakout_imminent/",
        "created": 1630527126.0
    },
    {
        "author": "OnlyOneBetter",
        "created_utc": 1630498039,
        "id": "pfsiyq",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": " Dear \\*\\*\\*\\*,\n\nIn response to new Financial Industry Regulatory Authority (FINRA) rules related to pattern day trading, we are updating our policy (which will go into effect on or about September 14, 2021). Because your account was noted for pattern day trading in the past year, we wanted to make sure you're aware of the change and how it could impact your account.\n\n**Understanding the new policy.** In line with the new FINRA rules, our new policy allows for only one flag removal within the life of an account. This means that if your account is flagged again in the future, the flag cannot be removed. Previously, our policy allowed the flag to be removed from an account up to three times within a rolling year before the account was flagged permanently.\n\n**What if your account is flagged?** If your account is flagged for pattern day trading, you'll have to maintain a minimum equity balance of $25,000 at the start of each trading day to continue day trading. If you place a day trade in a flagged account with a balance under $25,000 in equity, you'll be restricted to closing transactions until you bring your equity above $25,000.\n\nTo learn more about the pattern day trading rule and how to avoid breaking it, please view our [FAQ](https://www.tdameritrade.com/why-td-ameritrade/contact-us/top-faqs.html) or [*The Ticker Tape*](https://tickertape.tdameritrade.com/trading/avoid-violating-pattern-day-trader-rule-18005).\n\n**Questions? We're here for you.** If you have questions or if we can help you with this process in any way, please don't hesitate to let us know. Just reply to this message.\n\nSincerely,\n\nTD Ameritrade Client Services",
        "subreddit": "wallstreetbets",
        "title": "Our new pattern day trading policy* may affect how you trade. - Just got this yesterday from TD Ameritrade - Thankfully I am now over the PDT",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfsiyq/our_new_pattern_day_trading_policy_may_affect_how/",
        "created": 1630526839.0
    },
    {
        "author": "saunders1987",
        "created_utc": 1630491227,
        "id": "pfqwfg",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Hi all.\n\nIf I close a position in say GME at 100k and that will now be sitting in my broker account. And I decide to withdraw that to my bank account, then the next day I close another position at say 200k, then withdraw that, and so on and so on. \nDo I pay capital gains on every transaction I take out, or is it the total amount I gain in the year? Like if I close all positions for 100m and take it all out in separate amounts, do I pay in 1 big lump, or I  individual withdrawals? \n\nHope this makes sense!",
        "subreddit": "investing",
        "title": "Capital gains tax question form UK",
        "url": "https://www.reddit.com/r/investing/comments/pfqwfg/capital_gains_tax_question_form_uk/",
        "created": 1630520027.0
    },
    {
        "author": "Dwarfy_8395",
        "created_utc": 1630496425,
        "id": "pfs41c",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I've been checking the 212 Trading application ever since they introduced their new T&amp;C and all of my shares are being lent out 100% every time I check.\n\nhttps://ibb.co/5xK7yV1\n\nThis month I receive their statement and it shows that 0% of my shares are being lent out.\n\nhttps://ibb.co/bmKWKg8\n\nI feel this behavior is suspicious and I've contacted their customer care, they've escalated the issue with one of their team and I should receive and email in the coming days.\n\nIs there anything I can do about this? Is this legal? Appreciate anyone that understands more about this stuff. Hopefully this is a correct sub since I fail the requirements for anywhere else",
        "subreddit": "investing",
        "title": "212 Trading lending shares but now showing on statements.",
        "url": "https://www.reddit.com/r/investing/comments/pfs41c/212_trading_lending_shares_but_now_showing_on/",
        "created": 1630525225.0
    },
    {
        "author": "exploding-implosion",
        "created_utc": 1630495769,
        "id": "pfrygj",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "I’ve been here browsing you guys’ posts for some months now. This has led to me becoming very interested in this field. How would you guys recommend getting started for a typical noob with minimal Robinhood experience? Any recommended trading platforms or individuals who make informative blogs?\n\nI realize nobody is immune to taking an L in this line of business, but I’d just like to get aimed in the right direction and hopefully gain some off my investments to put away for the future. Let me know what you guys think, if I’m asking in the wrong place just let me know!",
        "subreddit": "wallstreetbets",
        "title": "Getting started",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfrygj/getting_started/",
        "created": 1630524569.0
    },
    {
        "author": "WallPuzzleheaded8134",
        "created_utc": 1630497474,
        "id": "pfsdee",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Citadel trying to slip away quietly.  Silly rabbit,  trix are for kids\n\nhttps://fxnewsgroup.com/forex-news/retail-forex/citadel-securities-seeks-to-nix-short-squeeze-conspiracy-allegations/\n\nApes need to stand watch and cover the gaps in a really long defense wall.  Part of this long unnecessary post is me filling in because of the mods.  When reading this article this morning, noticing it has not been shared on any threads yet, I realized these slimmy players are in the business of letting little guys like us win battles but lose the war.  Can we make a few bucks sure, do they really care, no,  what they really want to make sure of, is that we do not disrupt the money printing machine scheme, sadly on the backs of unsuspecting victims,  that like before,  and now again,  will ultimately carry the bag. Let's make sure to stand the line and hold these bad actors accountable. \n\nKeep digging,  keep studying,  keep turning those shiny smooth 🧠 surfaces into wrinkles that look like g m e chart. Keep sniffing green crayons",
        "subreddit": "wallstreetbets",
        "title": "Citadel Securities seeks to nix “short squeeze” conspiracy allegations",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfsdee/citadel_securities_seeks_to_nix_short_squeeze/",
        "created": 1630526274.0
    },
    {
        "author": "phoenixODST",
        "created_utc": 1630479907,
        "id": "pfolow",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "Came into some hardship about a month ago and was forced to sell some shares of a company I didn’t wanna sell. Being that I’m down in said company I sold some at a loss. I still have a large position but being that I did sell some and got through my life dip and I bought into myself and made a large profit, I wanna put it back into my stock. It’s been almost 2 months now I know it’s either 30-60 days but It always seems that TD Ameritrade shoves it right up into my little hole and tickles my guts with this. It seems no matter how many YouTube videos I watch I’m still left confused. Can some explain to me like I’m 5 years old and can’t color within the lines how and when I can buy back into this company without my buyin price hitting the atmosphere. plz and spank you.",
        "subreddit": "StockMarket",
        "title": "Wash sale",
        "url": "https://www.reddit.com/r/StockMarket/comments/pfolow/wash_sale/",
        "created": 1630508707.0
    },
    {
        "author": "MrStonks33",
        "created_utc": 1630491018,
        "id": "pfquol",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "The case for a horse... that works.\n\nWKHS may be the best kept non-secret stock on the market right now.\n\nLong story short. EV is big, EV is growing. Why not electric deliver vehicles? A company who ALREADY has EV delivery trucks IN HAND is slowly growing. Their stock however, is falling. Buy Low Sell High. \n\nThe stock is heavily shorted, and the shorts have come very close to burying this old horse into the ground. Not looking good. The shorts gained even more ground when WKHS lost the USPS truck contract. We'll get to that in a minute.\n\nHere's the good news. The stock is 100% utilized. It has a low float, it has a low market cap, and THEY ALREADY HAVE A PRODUCT IN HAND WAITING TO BE PURCHASED. Here's the best part. They made claims of corruption against the U.S. Government, USPS, and Oskosh when they lost the USPS contract. USPS and Oshkosh tried to get the case thrown out, but the judge denied that motion and is now allowing arguments in mid-Sept.\n\nWith shorts out the ass, and the stock 100% utilized. This is the equivilent of a home filling up with natural gas. \n\nAll you need is a spark, aka a judge siding with WKHS in arguments.\n\nThis is not a pump and dump, this stock was trading between 15 and 40 until the USPS contract fiasco.\n\n52 week LOW HIGH 7.07-42.96 (Price as of post stands at 9.90)\n1.19 B market cap\n123.95m shares\n36% shares held by institution.\n38% short interest\n\nYou do you.\nI am just a retard.\nNot financial advice.\n\nCredit Goes To Nick Quattrini for the DD. I’m just sharing.",
        "subreddit": "wallstreetbets",
        "title": "WKHS",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfquol/wkhs/",
        "created": 1630519818.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1630500331,
        "id": "pft5c8",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of sustainable investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "wallstreetbets",
        "title": "Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pft5c8/cathie_woods_ark_files_for_new_transparency_etf/",
        "created": 1630529131.0
    },
    {
        "author": "opticalpuss",
        "created_utc": 1630493767,
        "id": "pfrh5k",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I'm a highly paid salary executive who loves nothing more than chicken sandwiches and large soft drinks. I have noticed more and more frequently that when I pull into my favourite drive through in my Tesla to first complain about mask mandates then order a bourbon bacon cheeseburger with no bourbon because I'm a recovering addict that some locations have closed or have limited staff.\n\nThese staffing shortages came on recently due to so many free handouts that the lazy employees don't feel like working. When real Americans were true and proud, work was good and I got to yell at the workers and they couldn't do shit about it. And now free money has them lazy.\n\nGo ahead and remove my post but I say short these companies now because when I finally did get my sandwich I'm pretty sure it did have bourbon in it so now I went to the liquor store and bought a handle of Jack Daniels and am so enraged I might call corporate on my land line to complain. I might even sue them.\n\nBefore I call I'm going to get good and gacked out so they can feel my rage through the phone. These fucking lazy FUCKS!\n\nMASK MANDATE CAN KISS MY ASS IM NOT GETTING THE VACCINE YOU FUCKING SANDWICH SLINGING BITCH MAKE MY SANDWICH WHAT THE FUCK! MANDATES ARE FOR GAY MEN! MANDATE IS WHAT YOURE GONNA HAVE IN PRISON WHEN MY LAWYER PUTS YOUR ASS IN PRISON FOR FUCKING UP MY ORDER YOU FUCKING SANDWICH FUCK! MAKE MY SANDWICH!  \n\nTake a downer.\n\nAll time highs for Yum brands yet everyone is quitting after being underpaid and over-stressed. Wave 5 or whatever this is has the stressors going back up. People feel the need to express their political frustrations to the counter sandwich maker. GrubHub adds more stress on the counter sandwich maker gang. We've all worked at Wendy's and we feel for them.\n\nEarnings are expected to go up. Everyone on the street has them being successful as far as I can tell from my five minutes of googling and review of yahoo finance.\n\nMy positions: I'm not trading I can't trade I'm not approved for options and I don't have Robinhood. I can't believe you've read this far, honestly. I clicked on DD because I like big titties.\n\nKeywords: Yolo, GME, Tenders, Moon, 🚀🚀🚀\n\nFurther: all the hedge funds are expecting big things from Yum. Let's get those hedgies!",
        "subreddit": "wallstreetbets",
        "title": "The Wendy's Counter Sandwich Guy Keeps Fucking Up My Order",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfrh5k/the_wendys_counter_sandwich_guy_keeps_fucking_up/",
        "created": 1630522567.0
    },
    {
        "author": "bigheb13",
        "created_utc": 1630501305,
        "id": "pftfm8",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "EEMD NOW",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pftfm8/eemd_now/",
        "created": 1630530105.0
    },
    {
        "author": "trevortins",
        "created_utc": 1630484987,
        "id": "pfpmlj",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I currently use wealthsimple trade and have a Canadian dividend portfolio. I’ve wanted to invest in U.S stocks for a while but have stayed away from them due to fees. Now that national bank offers commission free trading and doesn’t charge you to convert to US dollars is it worth it to switch? I currently have a tsfa and would just need to transfer over the account.",
        "subreddit": "CanadianInvestor",
        "title": "Should I switch to National Bank for my broker and leave wealth simple trade?",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/pfpmlj/should_i_switch_to_national_bank_for_my_broker/",
        "created": 1630513787.0
    },
    {
        "author": "OnlyOneBetter",
        "created_utc": 1630497921,
        "id": "pfshuc",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "options",
        "title": "Our new pattern day trading policy* may affect how you trade. - Just got this yesterday from TD Ameritrade - Thankfully I am now over the PDT",
        "url": "https://www.reddit.com/r/options/comments/pfshuc/our_new_pattern_day_trading_policy_may_affect_how/",
        "created": 1630526721.0
    },
    {
        "author": "KingTimKap",
        "created_utc": 1630500094,
        "id": "pft30p",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of ESG investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "wallstreetbets",
        "title": "Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pft30p/cathie_woods_ark_files_for_new_transparency_etf/",
        "created": 1630528894.0
    },
    {
        "author": "dhpw2",
        "created_utc": 1630494189,
        "id": "pfrl31",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "ARK Investment Management is looking to debut a new ETF that will focus on transparency in companies and shun vice and sectors that run afoul of ESG investing like fossil fuels.\n\nIn an SEC filing, Cathie Wood's shop outlines the fund, which looks to be at least 80% invested in stocks in its benchmark Transparency Index, published by Solactive.\n\n\"Companies operating in the following industries, as determined by the Index provider, are excluded from the Index: (i) alcohol, (ii) banking, (iii) chemicals, (iv) confectionary, (v) fossil fuel transportation, (vi) gambling, (vii) metals, (viii) mineral, (ix) natural gas, (x) oil, and (xi) tobacco,\" ARK says in its filing.\n\nIf approved, the ETF would be the second that Ark has launched this year. In March, the company started a fund focused on space-related investments, which has risen about 4% since its debut and now has more than $600 million in assets. Meanwhile, the firm’s flagship ARK Innovation ETF (ARKK) is up to $22.5 billion, although it’s down 2% year-to-date -- compared with a gain of more than 20% for the S&amp;P 500.",
        "subreddit": "wallstreetbets",
        "title": "Another One! Cathie Wood's ARK files for new transparency ETF: no oil, banks, booze, chemicals or candy",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfrl31/another_one_cathie_woods_ark_files_for_new/",
        "created": 1630522989.0
    },
    {
        "author": "AutoModerator",
        "created_utc": 1630494015,
        "id": "pfrjcz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "The meme stock scheduled posts will run Mon to Fri and won't be a sticky; you're probably seeing this because automod sent you here or you woke up early Wall St time; good morning!\n\n------\n\nWelcome traders who just can't help them selves discuss the same exact stock that's been discussed 100s of times a day.  I get it, you want to talk about what's popular, what's hot, and that 1.. single.. stock you like.. well here you go!  Some helpful links just for you:\n\n* [Previous meme stock threads](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3A%28common+OR+meme%29&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)\n* [Previous discussions on overlooked (and possibly undervalued) stocks](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Aoverlooked&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)\n* [General discussions](https://www.reddit.com/r/stocks/search?q=author%3Aautomoderator+title%3Adiscussion&amp;restrict_sr=on&amp;include_over_18=on&amp;sort=new&amp;t=all)\n* [The **original GME megathread**](https://www.reddit.com/r/stocks/comments/layb68/rstocks_gme_megathread/) with a ton of useful information\n* [Use Finviz for aggregated news on your favorite stock](https://finviz.com/quote.ashx?t=gme)\n\nAn important message from our mod u/TCGYT [regarding meme stocks.](https://www.reddit.com/r/stocks/wiki/meme-stocks-warning)\n\nLastly if you need professional help:\n\n* Problem Gambling:  Call/Text: 1-800-522-4700 or [chat online now.](https://WWW.NCPGAMBLING.ORG/CHAT)\n* Crisis Hotline (24/7): 1-800-273-TALK (8255) (Veterans, press 1) or Text “HOME” to 741-741",
        "subreddit": "stocks",
        "title": "r/Stocks Daily Thread on Meme Stocks Wednesday - Sep 01, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/pfrjcz/rstocks_daily_thread_on_meme_stocks_wednesday_sep/",
        "created": 1630522815.0
    },
    {
        "author": "WhatsFoodG",
        "created_utc": 1630497540,
        "id": "pfsdzj",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Listen up you autistic retards this shit is serious. Coinbase has basically been hoeing hardcore since its direct listing in April. This bitch has been getting reamed 4 and a half months and counting but \\*cue picture\\* let's take a look at the chart and see what's up\n\n&amp;#x200B;\n\n[CB Daily Chart](https://preview.redd.it/aqjaxo37nvk71.png?width=2358&amp;format=png&amp;auto=webp&amp;s=478a56b2d64a8f5278121224d85d13646b93ade2)\n\nNow i ain't no fucking artist and i may have a learning disability but I know a cup when i see one and if you look at this chart, even in ur peripheries you'll notice a small cup and handle that's formed in between the support lines, you'll also notice the middle support line recently did an r/S flip i.e. went from being a resistance line to support line.\n\nNow with the small cup in place it may be high time for Coinbase to continue this trend up and fill up the bigger cup by flying back to the 420-450 range. Also the velocity at which alt currencies move if there is a decent rally in the next few weeks, there's potential this sees an even bigger push to go back up where it came from. The MACD looks bullish with potentially indicating this reversal will become a rally. \n\n However, the fundamentals are also insanely undervalued right now. I'm talking this thing has a mufuckin current PE ratio of 28 only considering the first 2 quarters this year i.e. NOT COUNTING any estimates from q3 and q4 this year. I'm talking they made rev of about a billion dollars in FY2020 with about 350 mill in net income, Q1 2021 they made over 1.6 billion in revenue and more than doubled net income relative to the ENTIRE PREVIOUS YEAR.  Q2 2021 they made revenue of 2.23 billion netting 1.6 fucking billion in a damn quarter. They're literally reaching exponential growth as we speak and lets be honest the industry they're in is primed to grow substantially in the foreseeable future. Now if you look at their guidance for q3 and q4 they are not expecting to beat the net income of q2 but they also expect continued profitability and could potentially beat forecasts IF certain coins that are traded on their platform rally hard. For comparison, Square is trading at a FORWARD PE (2024) of 73, PayPal FORWARD PE 2024 of 32, I could go on and on. So really their current annual PE is considerably less than 28 once earnings come in for q3 and q4.\n\nThis is a cash cow of a company fundamentals and technicals seem to be aligning nicely. I think you can't go wrong with far out leaps however you must know that I am retarded and you would be an even bigger retard if you listened to me, jk you prolly can't even read so I'm not worried.\n\nTL:DR COIN to the moon fam!!!",
        "subreddit": "wallstreetbets",
        "title": "Code Green: Coinbase breakout is imminent!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfsdzj/code_green_coinbase_breakout_is_imminent/",
        "created": 1630526340.0
    },
    {
        "author": "valeriedulaxo",
        "created_utc": 1630480578,
        "id": "pfoqsz",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "literally hornyyyy as helll , my pussy is throbbing for some dick lol . I don’t want to be alone right now but if i could have it my way i would be getting dick as of now . i  swear i day dream daily about a big cock being rammed in my ass , but i have never tried anal before 🤔 wouldn’t mind giving it a shot though lol . but yeah , if any of you guys see this right now i need some sexual assistance because my pussy is aching for some dick , the second best thing would be to atleast speak with someone who can get me off as i help them get theirself off as well 🤷🏽‍♀️😍💦",
        "subreddit": "wallstreetbets",
        "title": "21 f . Sextttt meeeee 😩",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pfoqsz/21_f_sextttt_meeeee/",
        "created": 1630509378.0
    },
    {
        "author": "PodejrzaneAmogus",
        "created_utc": 1630485232,
        "id": "pfpo91",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "u/PodejrzaneAmogus is hot, buy now !",
        "url": "https://i.redd.it/1g3l9p83suk71.png",
        "created": 1630514032.0
    },
    {
        "author": "SituationLive4406",
        "created_utc": 1630501223,
        "id": "pftejg",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\n22nd Century (XXII) Announces the Completion of Its Trifecta of Market Sectors with Tobacco, Cannabis, and Now Hops\n\nMassive IP portfolio on the Tobacco and Cannabis Plants. **Now hops also?** I would say they have all major areas covered. (I will dive more into that later) no pun intended.\n\nGood day everyone,\n\nWe are updating coverage on **22nd Century Group, Inc. (NASDAQ: XXII),** a leading plant-based, biotechnology company that is focused on tobacco harm reduction, very-low nicotine content tobacco, and hemp/cannabis research.\n\nCurrent price $3.57/share (at market close Aug. 31, 2021)\n\nOn August 16, 2021, XXII moved to the NASDAQ Exchange from the NYSE-American. The company participated in the closing bell ceremony on the same day. The company believes the move will increase their visibility and exposure to investors.\n\nWhen I look at [the company stock chart](https://stockcharts.com/h-sc/ui?s=XXII), I see how XXII has come off recent dips this year. On April 26th, the shares peaked at $6.07, then dipped to $3.56 on May 13th. On July 1st the shares had climbed back to $4.63 before consolidating to today’s level. XXII shares have now crossed their 200 DMA of $3.34 and are **approaching their 50 DMA of $3.67/share in a bullish manner**.\n\nI often note insider holdings as a value metric because the insiders have a vested interest in the company’s success. Insider ownership isn’t very high (under 3%) at XXII, but the institutional ownership (all data per YF) is at 36.4% of the outstanding shares. **Some of the big guns are holding XXII shares like Blackrock (5.99%) and Vanguard (4.68%). ETF Managers Group is holding 7.38% of the company’s shares.** Hedge funds prefer the companies they invest in to perform sooner rather than later.\n\nWhen we last covered XXII in July, we talked about the company’s trifecta of core products, tobacco, cannabis, and an unknown third leg. I spent some time trying to figure out what that third product was going to be. Since XXII was already in the tobacco and cannabis sectors I thought the new market would be psilocybin. Boy was I wrong. While psilocybin is an exciting and developing market, it is still relatively small and in it’s infancy. XXII doesn’t chase small markets.\n\nIn a [letter to shareholders](https://finance.yahoo.com/news/22nd-century-group-enters-global-132000137.html) published Monday, August 30th, CEO James Mish said “I am proud to announce our third plant-based franchise – the global **specialty hops market**. Like our existing franchises, the hop plant market is ripe for disruption and offers opportunities for 22nd Century to provide unique and significant competitive advantages to commercial partners. The addition of hops, a critical input for the $500 billion global brewing industry as well as a growing source of medically-important molecules, expands our total addressable markets to an estimated $1.3 trillion.”\n\n95% of all hops are used to make beer. The rising demand for microbrew and craft beers is driving the specialty hops market where distinctive flavors, aromas and nutritional uses are important in creating unique and differentiated products. The XXII R&amp;D program objectives include creating new proprietary hop plants and valuable IP using their know-how and technologies, utilizing double haploids, gene-editing, molecular breeding, and other non-GMO technology.\n\nXXII is establishing a new subsidiary in the Netherlands, 22nd Century Group Europe B.V., to open new revenue opportunities in hops, as well as serve their tobacco and hemp/cannabis plant franchises through an expanded global footprint.\n\nXXII is on the move now with a move toward globalization and a new product pipeline that may generate revenues quickly. The demand for proprietary, specialized, non-GMO hops is high and XXII has the tools to provide them.\n\n7/23/2021 Cowen Initiated Coverage Outperform $5.00\n\n**On the tobacco front**, earlier in August, the company announced that they were highly confident their MRTP (modified risk tobacco products) application has completed the FDA’s scientific review process and is now in the documentation process, the final stage before the FDA announces its decision. While the company’s VLN cigarettes were approved for sale in 2019, this important designation will allow 22nd Century to communicate key features of VLN® King and VLN® Menthol King, including the headline claim of “95% less nicotine.” VLN® tastes, smells, and smokes like a conventional cigarette. Both the FDA and the Biden administration have been looking for ways to curb illness, and consequently healthcare expenses, associated with cigarette smoking.\n\n**On the cannabis front**, XXII has been building its network of partnerships to maximize the upstream segment of the cannabinoid value chain since 2019. Components of 22nd Century’s proprietary value chain include: plant profiling tailored to the needs of customers (CannaMetrix), genetics to deliver differentiated traits to maximize yield of a specific cannabinoid or deliver a certain taste or fragrance profile (KeyGene), and commercial-scale plant breeding and cultivation of disruptive plant lines as well as year-round ingredient extraction/purification (Extractas Bioscience, Sawatch Agriculture, Folium Botanical, Aurora Cannabis, Needle Rock Farms, and Panacea).\n\nThe XXII “trifecta” of market sectors it participates in is now complete with tobacco, cannabis, and hops. As CEO Mish pointed out above, these three sectors address an **estimated market of $1.3T**. Sometimes we get lost with those numbers but each **1% of a $1.3T market potential is $13B**.\n\nStay tuned for more coverage on 22nd Century Group coming very soon.\n\n&amp;#x200B;\n\nAbout 22nd Century Group, Inc.  \n22nd Century Group, Inc. (Nasdaq: XXII) is a leading plant biotechnology and intellectual property company focused on improving health and wellness through plant science. 22nd Century uses modern plant breeding technologies, gene-editing, and molecular breeding to deliver value to its customers in the life science and consumer products industries by creating new, proprietary tobacco, hemp/cannabis and hop plants with optimized alkaloid and flavonoid profiles as well as improved yields and valuable agronomic traits. 22nd Century was founded to build intellectual property related to nicotine biosynthesis in the tobacco plant and to commercialize its proprietary reduced nicotine content (RNC) tobacco plants, which have become the cornerstone of FDA’s comprehensive plan to address the enormous amount of death and disease caused by addiction to smoking. **The Company has also begun to leverage its plant science expertise and existing partnerships to create and commercialize new, proprietary hemp/cannabis and hop plants to optimize their genetics and create valuable new intellectual property.**\n\n[Privacy policy and disclaimer](https://mailchi.mp/tradersnewssource/exciting-report-in-a-hot-sector-coming-tomorrow-649728?e=[UNIQID])",
        "subreddit": "weedstocks",
        "title": "Hundreds of patents for gene-editing on the Cannabis Plant (XXII)",
        "url": "https://www.reddit.com/r/weedstocks/comments/pftejg/hundreds_of_patents_for_geneediting_on_the/",
        "created": 1630530023.0
    },
    {
        "author": "htrak10",
        "created_utc": 1631034085,
        "id": "pjr5v7",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "I have about 20% of my portfolio invested in Qualcomm and I’ve been thinking about selling to invest in Nvidia for the past month but I’m wondering if it’s worth it now with Nvidia shares skyrocketing and Qualcomm shares leveling out.",
        "subreddit": "stocks",
        "title": "Qualcomm or Nvidia",
        "url": "https://www.reddit.com/r/stocks/comments/pjr5v7/qualcomm_or_nvidia/",
        "created": 1631062885.0
    },
    {
        "author": "Itsboomhomie",
        "created_utc": 1630621574,
        "id": "pgs5wr",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Hey gang!\n\nMarkets were cruising for a good portion of the day before pulling back a bit. Really kind of a muted day for the markets as a whole, with the exception of the IWM charging nearly a full percent. That's good for our small caps! With markets stagnating and the VIX rising, tomorrow's market movement will depend on the nonfarm payroll numbers, which are released before the market opens. \n\nSome analysts are expecting the ending of expanded federal unemployment benefits to surge job numbers. If this month's payroll numbers disappoint, I expect next months to obliterate expectations as people will go back to work in some capacity and seasonal hiring will start picking up. \n\nObligatory: these are not stock recommendations, **this does not constitute financial advice - if you need that kind of advice contact your broker**, I'm just analyzing unusual option data, (so if you don't see your favorite stonk, don't take it personally) please do you own DD, replaying the best Star Wars game ever made Knights of the Old Republic (someone commented about this yesterday but it got swept away), etc. etc. etc. \n\n&amp;#x200B;\n\n|STOCK|PRICE|VOLUME (AVG)|CALLS% - PUTS%|MOST ACTIVE|\n|:-|:-|:-|:-|:-|\n|BBIG|7.99|458.3K (74K)|89 - 11|Sept 20c (33.7K)|\n|RAAS\\*|5.68|28.4K (681)|86 - 14|Sept 7.5c (11.3K), Sept 5p (2.8K)|\n|KPLT\\*|5.53|96.2K (7.1K)|94 - 6|Sept 7.5c (20K)|\n|NXE\\*|5.44|3.7K (933)|91 - 9|Sept 5c (471)|\n|MMAT\\*|5.76|71.7K (30.1K)|89 - 11|Sept 5c (12.6K)|\n|GSAT|2.08|146.5K (24.1K)|89 - 11|Sept 2.5c (40.4K)|\n|MILE|4.44|43K (3.2K)|96 - 4|Sept 5c (14.6K)|\n|DNN|1.40|37.9K (7.7K)|95 - 5|Oct 2c (8K), Jan 23 2c (6.1K)|\n|INFI|3.82|30.5K (2.8K)|99 - 1|Oct 5c (16.5K)|\n|SWN|4.89|25.2K (7.6K)|89 - 11|Sept 4.5c (9.7K)|\n|PROG|1.05|21.8K (2.5K)|95 - 5|Sept 1c (4.8K), Jan 1.5c (2.9K)|\n|HIPO|4.39|16.1K (2.3K)|57 - 43|Oct 6c (3.1K), Sept 4p (1.9K)|\n|YVR|2.05|12.5K (1.2K)|100 - 0|Sept 2.5c (8.8K)|\n|CRVS|2.72|10.6K (84)|100 - 0|Sept 2.5c (5.3K), Sept 5c (5K)|\n|WTRH|1.28|9.6K (2.5K)|97 - 3|Sept 1.5c (2.2K)|\n|UEC|2.84|8.1K (3.3K)|96 - 4|Sept 2.5c (1.1K)|\n|HMY|3.53|4.9K (1.3K)|88 - 12|Jan 4c (3.7K)|\n|ADTX|1.80|3.8K (1K)|96 - 4|Oct 2.5c (1.5K)|\n|ALZN|3.35|3.7K (1K)|98 - 2|Sept 5c (2.4K)|\n|AMPE|1.73|3.4K (1.5K)|84 - 16|Sept 2c (987)|\n|CBIO|4.75|3.3K (614)|92 - 8|Oct 5c (780)|\n|WWR|3.92|3.1K (1.7K)|95 - 5|Feb 5c (1K)|\n|CRTD|3.37|3K (765)|97 - 3|Sept 5c (1.9K)|\n|JG|2.36|3K (375)|79 - 21|Oct 5c (762)|\n|REPH|2.45|2.9K (569)|99 - 1|Apr 2.5c (1.4K), Apr 7.5c (872), Apr 5c (600)|\n\n\\* denotes the stock started the day below $5/share\n\nNotes:\n\n**BBIG -15%** Experienced the inverse of yesterday, as there wasn't enough gas to keep on the upward pressure. 781.7K calls vs 173.5K puts in the OI heading into the trading session. 407.9K calls, 50.4K puts, and over 105 million shares traded today. BBIG just opened up weekly options, which I'm sure is going to blow up several people's accounts. If you're in the play for the \"proxy\", I wouldn't go with short term options, as theta will eat you alive. OI numbers are starting to shift heavily toward September expiration. \n\n**RAAS +21.8%** Was trading at $5.91 in the mid-day report. No news for the cloud-based communications company from China. Interesting that with a super bullish day, the second most active option are puts. Will they print tomorrow?\n\n**KPLT +15.8%** Was trading at $5.43 in the mid-day report. No news. Very popular stocks across social media right now. \n\n**NXE +10.3%** No news. Apparently uranium demand has been rising for months, according to u/Epraksemet_Nalej**.** Always interesting when a stock has elevated option activity, but one option hardly stands out from the rest. \n\n**MMAT +16%** In the mid-day report, MMAT was trading at $5.18. No news. \n\n**GSAT +11.1%** Was trading at $2.27 in the earlier report.  GSAT filed an 8-K update describing receipt of \"an additional advance payment of $37.5 million from a customer...\". The company will use the funds to repay some debt. Saw some saying \"Is this coming from Apple?\" Most likely no, as Apple isn't a customer of theirs. The Apple news was tied to the iPhone having Qualcomm chips. QCOM is a GSAT customer. \n\n**MILE +6.2%** Traded at $4.41 in the early report. I hate the amount of mail this company sends me. I don't want your pay-per-mile auto insurance, thx.  Big sweeps for ATM calls. \n\n**DNN +8.5%** Was trading at $1.36 in the early report. Again, apparently uranium is entering a super cycle. Multiple large (2,000+) orders for options at the $2 strike in both October and January 2023.\n\n**INFI +6.4%** In the mid-day edition, was trading at $3.80.  Announced they will participate in Wells Fargo's Healthcare Conference and H.C. Wainwright's 23rd Annual Global Investment Conference, both virtually. Notable that the most activity is for October calls. \n\n**SWN +4%** In the mid-day edition, was trading at $4.88. Completed acquisition of Indigo Natural Resources and updated 2021 free cash flow guidance. \n\n**PROG +7.4%** Traded at $1.02 in the early report. No news that I could find. Large sweeps for LEAPS. \n\n**HIPO -14.7%.** Traded at $4.38 in the early report. Has fallen 60% since it's SPAC-based IPO in January. Today marks the day private investment in public equity investors are able to unload their shares as per the merger agreement. Still a lot of call traders. \n\n**YVR +12%** Traded at $2.12 in the early report. Has given back 4.8% AH. Signed an agreement to acquire iNDIEFLIX, an \"edutainment\" company. \n\n**CRVS +16.7%** No news that I could find. Half of the unusual volume came from 5,000 bear call spreads with September options - sell the $2.50 call, buy the $5 call for upside protection. \n\n**WTRH -7.25%** Traded at $1.33 in the early report.  Supposedly one of the most shorted penny stocks, but these rumors are unsubstantiated. Perhaps someone can dig up the ortex numbers. \n\n**UEC +10.94%** Traded at $2.78 in the early report. Uranium stocks getting a lot of love today. Through UEC's finviz page I did find an interesting write up about uranium stocks that cited GLJ Research raised its price target on uranium mining company Cameco. The analyst for GLJ sees massive upside for uranium spot prices. Hmm if all of these uranium stocks hopped one one analysts recommendation, will the gains hold/continue or revert back a little bit? Worthwhile to note that the article I pulled this information from was published by notorious hedge fund The Motley Fool, who very well could be short uranium. \n\n**HMY -4.34%** Traded at $3.47 in the early report.  Released earnings either yesterday or the day before, I can't tell (conflicting sources). Two orders each for 1,750 Jan $4 calls under the \"Stock Contingent\" condition. \n\n**ADTX -1.64%** Back on the list after a brief absence. No news. \n\n**ALZN +5.68%** Traded at $3.32 in the early report. No news that I could find. Single order for 1,061 September $5 calls. \n\n**AMPE +6.13%** No news driving option/price movement that I could find. \n\n**CBIO -1.45%** Finally some different stocks other than the March bear call spreads as the most active. No news.  \n\n**WWR +1.29%** No news, and I don't think I've ever heard of this company before. They hold interests in a graphite project in Alabama. Formerly known as Uranium Resources, Inc, so potential Uranium sympathy play? Most popular options are pretty far out, could be a big short hedging their position. \n\n**CRTD -0.59% (+2% AH).** No news that I could find. \n\n**JG +15.12%** I couldn't find a direct reason for JG's big gain today. First time hearing about this Chinese mobile developer service provider. Always interesting when there's elevated option activity but not a single one stands out. \n\n**REPH -0.81%** Traded at $2.55 in the early report.  Apr ratio spreads continue to be the most active. \n\nIf anyone has any questions about anything, by all means, don't hesitate to reach out either here or by DM. I float the DM option out there because you might think something is too embarrassing to ask about, or you're new or whatever, but please just ask someone. Knowledge is the best weapon. \n\n*To reiterate - I DON'T PICK THESE STOCKS. They qualify by having elevated (at least 1.4x) option activity compared to normal. I'll be more than happy to check a stock's option activity for you, but save the \"wHaT aBoUt mY sToNk iTs gOiNg mOoN!\" type comments.* \n\nShout out to \"random ticker comment with no context\" gang!\n\nboom",
        "subreddit": "RobinHoodPennyStocks",
        "title": "EOD Penny Stock Unusual Option Activity 9/2",
        "url": "https://www.reddit.com/r/RobinHoodPennyStocks/comments/pgs5wr/eod_penny_stock_unusual_option_activity_92/",
        "created": 1630650374.0
    },
    {
        "author": "professorfundamental",
        "created_utc": 1631013309,
        "id": "pjl0rn",
        "num_comments": 8,
        "num_crossposts": 0,
        "selftext": "Another user asked for this information, and I think it can be helpful in seeing one perspective on what the market thinks is going to happen. 10SEPT expirations for calls and for puts. lmk if you see mistakes\n\nwatchlist is from high volume stocks/etfs with high volume options, but a bit dated\n\n&amp;#x200B;\n\n**The calls first, from highest to lowest:** \n\n*Ticker   Price  ATM/u*   \n\n1. GME 202.75 0.076152898   \n2. RIDE 6.25 0.064   \n3. VXRT 8.710000038 0.049368542   \n4. RIOT 34.43000031 0.047632878   \n5. KODK 7.21999979 0.047091414   \n6. EDIT 68.25 0.046886447   \n7. SPCE 24.28000069 0.0461285   \n8. UVXY 21.23999977 0.043785311   \n9. BB 11.06999969 0.03794038   \n10. TLRY 13.59000015 0.035320088   \n11. INO 8.520000458 0.035211266   \n12. NKLA 10.46000004 0.034416826  \n13.  IQ 9.970000267 0.034102306  \n14.  LULU 388.3299866 0.030901554  \n15.  BBBY 27.02000046 0.029607697   \n16. PCG 9.149999619 0.029508198   \n17. PDD 102.2300034 0.029345592   \n18. FSR 14.01000023 0.02926481   \n19. LMND 77.31999969 0.029099845   \n20. NCLH 24.62000084 0.028432168   \n21. MRO 11.63000011 0.028374892   \n22. XPEV 39.75 0.028176101  \n23.  QS 22.45000076 0.02806236   \n24. X 26.21999931 0.027841343   \n25. M 21.71999931 0.02762431   \n26. BLNK 32.97000122 0.02669093   \n27. UNG 16.42000008 0.025578563   \n28. VXX 24.94000053 0.025260625   \n29. OSTK 69.51000214 0.025032369   \n30. PLUG 26.39999962 0.024621212   \n31. SPWR 21.82999992 0.024278516  \n32.  APA 19.67000008 0.023894255  \n33.  HYLN 8.850000381 0.023728813  \n34.  CGC 16.96999931 0.023571009   \n35. FSLY 46.68999863 0.023559649   \n36. GPS 25.11000061 0.023496614   \n37. ACB 7.389999866 0.02300406   \n38. TNA 93.79000092 0.022923552   \n39. ET 9.649999619 0.022797928   \n40. CCL 22.95999908 0.022648085   \n41. PTON 98.55999756 0.022524351   \n42. ROKU 342.269989 0.02249686  \n43.  SNAP 75.08000183 0.021710175   \n44. UAL 46.22000122 0.021635655   \n45. UBER 40.31999969 0.021577381   \n46. DAL 40.25 0.021118012   \n47. NET 130.4400024 0.021005826   \n48. HAL 20.17000008 0.020823004   \n49. FCX 36.13999939 0.020752629  \n50.  DOCU 310.0499878 0.020641833  \n51.  PLTR 26.63999939 0.020270271   \n52. LI 30.28000069 0.02014531  \n53.  BIDU 162.9799957 0.019941098   \n54. RKT 17.09000015 0.019894675 \n55.   DKNG 61.02000046 0.019829564   \n56. OXY 25.92000008 0.019675926   \n57. BABA 170.3000031 0.019671168   \n58. BYND 114.9700012 0.019570322   \n59. NIO 40.36999893 0.019568987   \n60. SPLK 158.4400024 0.019565766   \n61. PBR 10.44999981 0.019138756  \n62.  JD 79.85500336 0.019034499   \n63. CRWD 278.230011 0.018689573   \n64. AAL 19.37000084 0.018585441   \n65. DDOG 138.0599976 0.018325366  \n66.  CHWY 76.75 0.018241042   \n67. OIH 186.7599945 0.018151639  \n68.  SNOW 310 0.017870968   \n69. WYNN 100.3000031 0.01784646   \n70. ZM 298.2900085 0.017767943   \n71. TQQQ 151.4499969 0.017761638  \n72.  ABNB 158 0.017341772  \n73.  XOP 84.51999664 0.016919073   \n74. FEYE 18.54999924 0.016711591   \n75. NVDA 228.4299927 0.016635294   \n76. USO 48.65999985 0.016440608   \n77. MGM 42.54000092 0.016220028   \n78. SQ 269.7399902 0.016200787  \n79.  TWTR 64.66000366 0.016084131 \n80.   AMD 109.9199982 0.01592067  \n81.  SHOP 1554.25 0.01576323   \n82. WFC 44.16999817 0.015621463   \n83. VALE 19.07999992 0.015199161 \n84.   AMRN 5.289999962 0.015122873  \n85.  EWZ 35.84999847 0.014783822  \n86.  BA 218.1699982 0.014667461   \n87. MPC 58.24000168 0.01459478   \n88. PINS 56.59000015 0.014490193   \n89. TEVA 9.479999542 0.013713081   \n90. KRE 65.18000031 0.013654495 \n91.   XBI 134.1900024 0.013264774   \n92. TSLA 733.5700073 0.013086686  \n93.  FXI 41.47000122 0.013021461   \n94. ATVI 81.18000031 0.01293422   \n95. XLE 48.61999893 0.012751954   \n96. NFLX 590.5300293 0.012446446 \n97.   BAC 41.04999924 0.012180268 \n98.   CVS 87.47000122 0.01211844 \n99.   C 71.16999817 0.012083743   \n100. XRT 95.63999939 0.011919699  \n101.  DIS 181 0.011823204   \n102. MU 73.80999756 0.011380572   \n103. SMH 273.2900085 0.010940759  \n104.  F 12.89000034 0.010861132   \n105. XOM 54.86999893 0.010752688   \n106. VZ 55.43000031 0.010463648   \n107. TSM 123.9700012 0.010405743   \n108. XLF 38.06999969 0.010244287   \n109. DBX 32.38999939 0.01018833   \n110. ADBE 666.5900269 0.010051155   \n111. GDX 33.27999878 0.009915866   \n112. GOLD 20.29999924 0.009852217   \n113. SLV 22.87999916 0.009615385  \n114.  PFE 46.84000015 0.009607173   \n115. CRM 267.0799866 0.009472818 \n116.   INTC 53.50999832 0.009157167  \n117.  MSFT 301.1400146 0.009131965   \n118. GILD 71.95999908 0.009032796   \n119. V 225.1100006 0.008973391   \n120. PYPL 289.1300049 0.008750389  \n121.  GS 411.3099976 0.008582335   \n122. AMZN 3478.050049 0.008539268   \n123. EEM 53.11999893 0.008471386   \n124. SBUX 117.1900024 0.008106494   \n125. QCOM 144.6300049 0.008089608   \n126. T 27.55999947 0.007982584   \n127. KO 56.72999954 0.007932311   \n128. IWM 227.9600067 0.00776452  \n129.  JPM 159.4900055 0.007273183   \n130. MO 50.97000122 0.007259172  \n131.  WMT 149.25 0.007236181   \n132. FB 376.2600098 0.007069579 \n133.   GOOG 2895.5 0.006838197  \n134.  COST 462.5499878 0.006701978 \n135.   TGT 244.3099976 0.006549057   \n136. ABBV 111.6200027 0.006540046   \n137. TLT 148.1799927 0.006478607   \n138. EFA 82.06999969 0.00609236   \n139. CSCO 59.41999817 0.006058566  \n140.  XLU 69.48999786 0.005756224  \n141.  JNJ 175.0399933 0.00571298  \n142.  QQQ 381.5700073 0.005031842   \n143. DIA 354.1400146 0.004630937   \n144. SPY 453.0799866 0.003906595   \n145. HYG 88.01000214 0.001363481     \n\n&amp;#x200B;\n\nsome options traders think of the ATM/u number as a percent. If so, then GME at the top of the list has a 7.6% chance of being higher than it is now (or higher than the ATM call strike price to be exact), whereas HYG has a .1% chance of being higher than it is now. Remember, these are just for the calls, so it might be that the market places more value on the ATM put than it does on the ATM calls. \n\n&amp;#x200B;\n\n**Here are the puts:** \n\n  \n\n*Ticker     Price    ATM/u*\n\n1. TLRY 13.59000015 0.148638703\n2. BB 11.06999969 0.134598016\n3. VXRT 8.710000038 0.127439724\n4. ET 9.649999619 0.092227983\n5. MRO 11.63000011 0.073086844\n6. AMRN 5.289999962 0.060491494\n7. RKT 17.09000015 0.059098888\n8. F 12.89000034 0.049650891\n9. RIOT 34.43000031 0.048794655\n10. LI 30.28000069 0.040951122\n11. SQ 269.7399902 0.040668794\n12. GME 202.75 0.035462392\n13. SPCE 24.28000069 0.035420098\n14. UVXY 21.23999977 0.034839925\n15. DKNG 61.02000046 0.031465093\n16. UNG 16.42000008 0.031059683\n17. XPEV 39.75 0.030188679\n18. SLV 22.87999916 0.029720281\n19. PLUG 26.39999962 0.028409091\n20. RIDE 6.25 0.0256\n21. AAL 19.37000084 0.024780587\n22. SNAP 75.08000183 0.024107618\n23. BLNK 32.97000122 0.023051258\n24. EDIT 68.25 0.021978022\n25. CRWD 278.230011 0.021205477\n26. KODK 7.21999979 0.018005541\n27. PTON 98.55999756 0.01755276\n28. UAL 46.22000122 0.017092167\n29. HAL 20.17000008 0.016856718\n30. HYLN 8.850000381 0.015819208\n31. FSR 14.01000023 0.015703069\n32. GDX 33.27999878 0.01532452\n33. PLTR 26.63999939 0.015015015\n34. DDOG 138.0599976 0.014703752\n35. FEYE 18.54999924 0.014555257\n36. VXX 24.94000053 0.014434643\n37. BBBY 27.02000046 0.014433753\n38. TSLA 733.5700073 0.014381722\n39. LMND 77.31999969 0.014226591\n40. CGC 16.96999931 0.012964055\n41. NVDA 228.4299927 0.012870464\n42. PFE 46.84000015 0.012809564\n43. PDD 102.2300034 0.012618605\n44. FSLY 46.68999863 0.011779825\n45. WFC 44.16999817 0.011546299\n46. SHOP 1554.25 0.010892714\n47. CCL 22.95999908 0.010452962\n48. GPS 25.11000061  0.01035444\n49. BAC 41.04999924 0.010231425\n50. ACB 7.389999866 0.00947226\n51. NIO 40.36999893 0.009412931\n52. NET 130.4400024 0.009352959\n53. OSTK 69.51000214 0.008631851\n54. EWZ 35.84999847 0.008368201\n55. INO 8.520000458 0.008215962\n56. IQ 9.970000267 0.008024072\n57. ZM 298.2900085 0.007844715\n58. TSM 123.9700012 0.007501815\n59. PINS 56.59000015 0.007068387\n60. XOP 84.51999664 0.006980597\n61. AMD 109.9199982 0.006641194\n62. NCLH 24.62000084 0.006498781\n63. DBX 32.38999939 0.006483483\n64. DAL 40.25 0.006459627\n65. MU 73.80999756 0.006367701\n66. TWTR 64.66000366 0.006186204\n67. SPLK 158.4400024 0.005995961\n68. SNOW 310 0.005483871\n69. TNA 93.79000092 0.00543768\n70. SPWR 21.82999992 0.005038937\n71. JD 79.85500336 0.005009079\n72. PBR 10.44999981 0.004784689\n73. C 71.16999817 0.004777294\n74. XLE 48.61999893 0.004730564\n75. BYND 114.9700012 0.004609898\n76. MPC 58.24000168 0.004464286\n77. OIH 186.7599945 0.004337117\n78. MGM 42.54000092 0.004231312\n79. VALE 19.07999992 0.004192872\n80. FCX 36.13999939 0.004150526\n81. QS 22.45000076 0.004008909\n82. ATVI 81.18000031 0.003941858\n83. OXY 25.92000008 0.003858025\n84. NKLA 10.46000004 0.003824092\n85. INTC 53.50999832 0.003363857\n86. PCG 9.149999619 0.003278689\n87. XLF 38.06999969 0.003152088\n88. MSFT 301.1400146 0.003088264\n89. XBI 134.1900024 0.003055369\n90. IWM 227.9600067 0.002939112\n91. XRT 95.63999939 0.00250941\n92. TQQQ 151.4499969 0.002509079\n93. ABBV 111.6200027 0.002329332\n94. WYNN 100.3000031 0.002293121\n95. UBER 40.31999969 0.002232143\n96. T 27.55999947 0.002177068\n97. CSCO 59.41999817 0.001851229\n98. HYG 88.01000214 0.001817975\n99. DOCU 310.0499878 0.001741655\n100. APA 19.67000008 0.001525165\n101. USO 48.65999985 0.001438553\n102. EFA 82.06999969 0.001340319\n103. BIDU 162.9799957 0.001288502\n104. FXI 41.47000122 0.001205691\n105. SBUX 117.1900024 0.001194641\n106. MO 50.97000122 0.001177163\n107. GOOG 2895.5 0.001170782\n108. X 26.21999931 0.001144165\n109. WMT 149.25 0.001139028\n110. QQQ 381.5700073 0.001126923\n111. QCOM 144.6300049 0.001106271\n112. XOM 54.86999893 0.001093494\n113. TEVA 9.479999542 0.001054852\n114. V 225.1100006 0.001021723\n115. GILD 71.95999908 0.000972763\n116. NFLX 590.5300293 0.000948301\n117. EEM 53.11999893 0.000941265\n118. FB 376.2600098 0.000930208\n119. M 21.71999931 0.00092081\n120. BA 218.1699982 0.000825045\n121. CVS 87.47000122 0.000800274\n122. COST 462.5499878 0.000799914\n123. AMZN 3478.050049 0.000715918\n124. KO 56.72999954 0.000705094\n125. ABNB 158 0.000696203\n126. ADBE 666.5900269 0.000690079\n127. PYPL 289.1300049 0.000657144\n128. CHWY 76.75 0.000651466\n129. SMH 273.2900085 0.00062205\n130. KRE 65.18000031 0.000613685\n131. JPM 159.4900055 0.000564299\n132. TLT 148.1799927 0.000539884\n133. SPY 453.0799866 0.000507637\n134. GOLD 20.29999924 0.000492611\n135. TGT 244.3099976 0.000491179\n136. LULU 388.3299866 0.000463523\n137. DIA 354.1400146 0.000451799\n138. XLU 69.48999786 0.000431717\n139. CRM 267.0799866 0.000411862\n140. DIS 181 0.00038674\n141. JNJ 175.0399933 0.000228519\n142. VZ 55.43000031 0.000180408\n143. BABA 170.3000031 0.00017616\n144. ROKU 342.269989 0.000146084\n145. GS 411.3099976 0.000121563 \n\n&amp;#x200B;\n\nI included the prices for the stock/etf so you can see which ones might be \"bargins\" for people with small accounts. \n\n&amp;#x200B;\n\nYou can see that the biggest values for puts are *way* bigger than the biggest values for calls. But, to for example, GME (top of the calls list) is given only a 3.5% chance of going lower, whereas the calls give it a 7.6% chance of going higher.",
        "subreddit": "options",
        "title": "Most expensive calls and most expensive puts (ATM premium/underlying price) for 145 tickers.",
        "url": "https://www.reddit.com/r/options/comments/pjl0rn/most_expensive_calls_and_most_expensive_puts_atm/",
        "created": 1631042109.0
    },
    {
        "author": "babbldev",
        "created_utc": 1630988469,
        "id": "pjfrce",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/zrdtirwyb0m71.jpg?width=1222&amp;format=pjpg&amp;auto=webp&amp;s=b601739db792d23e1fb62b93e61a08c92af6c807\n\n My full review of stock market news sentiment, gathered by scraping 4,668 finance articles across 100+ publishers (Yahoo Finance, Motley Fool, Benzinga, SeekingAlpha, etc.) over the past week. The original version can be found [here](https://babbl.substack.com/p/labor-day-weekend-and-more-bullish)\n\n**TLDR:** stock market news sentiment remains significantly bullish for yet another week in a row, driven by optimistic monthly reports released for the month of August and continued upward trends from the SP500 and global cryptocurrency market.\n\n# 1. This Week’s News Sentiment 📰\n\nAs we commence our first week of Autumn 2021, stock market news remains just as bullish as it was to end the summer. News coverage this week was relatively unchanged in terms of sentiment compared to last week. Overall, the average finance article written this week scored a 0.35 in terms of sentiment (meaning that just over 1-in-3 sentences written about the markets this week leaned optimistically) and a 0.63 in terms of time-sense expressed (meaning that almost 2-in-3 sentences published this week were written in future tense). Here’s a look at the major news events driving the continued all-time high bullish sentiment this past week:\n\n📈 Stocks: The major U.S. stock indexes traded in a narrow range all week, but the S&amp;P 500 managed to post a modest gain for the second week in a row.1 The NASDAQ outperformed its peers for the second consecutive week while the Dow fell slightly. Despite sustaining a mid-month decline, the S&amp;P 500 recovered to record its seventh positive month in a row, posting a return of about 3% in August. The index reached 12 record closing highs in the month versus 7 in July.\n\n₿ Cryptos: Much of this week’s news optimism can be attributed to the continued meteoric rise in cryptocurrency prices. Global cryptocurrency market capitalization grew 11.5% this week to $2.4T dollars to cap off the largest month in history in terms of cryptocurrency trading volume. The majority of crypto-related headlines this week came on the back of Ethereum ($ETH) which rose more than 20% to $3,935.17 per coin this week at the time of this writing; other big crypto movers this week include Solana ($SOL) and Bitcoin ($BTC) as it eyes its first “golden cross” since May 2020.\n\n🦅 Economy: While news optimism remains relatively high overall, time-sense fell slightly this week as a slew of monthly economic reports were released for the month of August. A private report showed that the U.S. economy recorded its 15th consecutive monthly gain in manufacturing activity in August. The Institute for Supply Management’s manufacturing index rose 0.4% to 59.9. Any reading above 50 indicates growth in manufacturing activity. We also saw August’s monthly job report this week. The economy generated 235,000 new jobs last month, far short of economists’ expectations and trailing gains of nearly 1.1 million in July and 962,000 in June. The unemployment rate fell to 5.2% from 5.4% in July.\n\n# 2. Most Mentioned Tickers 📊\n\nEach week we analyze the number of headlines written about each stock and cryptocurrency. The most mentioned tickers in this week’s news and the tickers with the biggest volume increase compared to last week are shown here: [most mentioned tickers 8/30-9/3](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F8d976bee-76fb-40f8-b7b7-1a97515e6ff3_1230x753.png)\n\n🍎 Apple ($AAPL): For the second consecutive week, $AAPL was mentioned more in news coverage than any other ticker in finance articles scraped this week. A mainstay of our weekly most-mentioned list, Apple Inc. churns news headlines, whether or not there’s actually significant news to report about the company or its stock. Following the 10-year anniversary of Tim Cook’s tenure as Apple CEO last week — as part of which he received $750M in $AAPL share value under the terms of his contract — headlines this week centered around an open letter written to Cook by Apple employees presenting a litany of grievances including concerns about privacy and diversity within the company. Apple also saw headlines from outside the workplace this week, as regulators from around the world mount pressure on the company’s current App Store policy, accusing Apple of exerting too much control (ex. a 30% commission on in-app purchases) on developers who use it to sell products.\n\n“What is Apple Thinking?” | The New York Times\n\n👨‍🔧 Automatic Data Processing Inc. ($ADP): The ticker with the biggest increase in news headlines this week compared to last week was $ADP. The stock fell a slight -0.86% last week and has now dropped nearly 3% over the past month to $207.38 per share as the company plans to go ex-dividend on September 9th. This means investors who purchase and settle shares of $ADP before this upcoming Thursday will be eligible to receive the company’s $0.93 dividend payment per share, which will be paid out on October 1st. Automatic Data Processing’s previous dividend payment consumed approximately 61% of the company’s free cash flow last year, and while this is in the normal range for most dividend-paying organizations, analysts seem to agree that the decision bodes well for the company’s long-term strategy by freeing up some space on their margins during a relatively lean period in its history as a business. Overall news sentiment for $ADP scored a +41.05% on a scale from -100% to +100%, signaling relatively bullish sentiment to boot over the past week.\n\n“Automatic Data Processing, Inc. Is About To Go Ex-Dividend, And It Pays A 1.8% Yield” | Yahoo Finance\n\n# 3. Sentiment Winners and Losers 👍👎\n\nEach week we summarize the most extreme sentiment scores in the news for each ticker to help you decide where to focus your attention. Here’s a look at which tickers scored the highest (and lowest) in terms of optimism, pessimism, speculation, and reaction expressed in this past week’s news: [most optimistic and pessimistic tickers 8/30-9/3](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F29ce2ff0-9cf0-4d9e-b630-893857f80eee_2181x1305.png)\n\n# Sentiment: Most Optimistic😀 and Pessimistic😒 Tickers\n\n📶 Motorola Solutions Inc. ($MSI): This week’s most optimistic stock in news coverage was Motorola Solutions Inc. (optimism score: 58.9%). $MSI stock rose a mere 0.76% on the week to build on 46.7% growth so far in 2021. Motorola Solutions — which succeeded Motorola, Inc., following the spinoff of the mobile phone division into Motorola Mobility in 2011 — has been spoken of with relatively good cheer compared to industry competitors like Qualcomm ($QCOM) and Verizon ($VZ). Much of the optimism has come as a revelation following the company’s Q2 earnings released nearly a month ago on August 5th, in which the company revealed stratospheric annual earnings per share growth of 41% compound. While some may call it an old-fashioned investment in today’s age of “tech-stock blue sky investing”, it’s hard to argue with bonafide profitability like this if you’re investing for the long-term. This week’s most optimistic $MSI article:\n\n“Here's Why I Think Motorola Solutions Is An Interesting Stock” | Simply Wall St.\n\n🐕 Shiba Inu Coin ($SHIB): This week’s most pessimistic (and reactive) ticker in news coverage was Shiba Inu Coin (pessimism score: 29.3%). Even though we saw relatively low amounts of pessimism in this week’s news coverage across the board, $SHIB saw more pessimism expressed in articles this week than any other ticker, as the fringe cryptocurrency reached its lowest price of the past month on Tuesday (a whopping $0.000006735 per coin — yes, that’s five zeroes after the decimal) as its developers announced that they’d be removing a portion of the existing $SHIB supply from circulation. Though $SHIB price rose considerably heading into the weekend and continues to trend upwards at the time of this writing, it’s still down 11% in value over the past month. Keep in mind that the coin — which was created in April as a blatant meme and borderline Ponzi scheme in response to the meteoric rise in the price of Dogecoin early this year — has grown 45x in value since its inception four months ago. In other words: a $1,000 investment in Shiba Inu Coin back in April is now worth somewhere around $42,000. This week’s most pessimistic $SHIB article:\n\n“How the Shiba Inu Coin Burn is Attempting to Rekindle a Meme’s Magic” | Fast Company\n\n&amp;#x200B;\n\n# Time-Sense: Most Speculative🤔⏩ and Reactive😮⏮️ Tickers: \n\nimage: [most speculative and reactive tickers 8/30-9/3](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fe9219e3f-a6d0-4987-8b31-8e3d32fc3bfd_2203x1315.png)\n\n🔋 FirstEnergy Corp. ($FE): The stock with the most speculative (ie. future-tense) sentiment measured in the news coverage this week was FirstEnergy (speculation score: 95.4%). $FE stock 2.86% this week to $39.59 to cap a 34.16% run in share price year-to-date as the energy utility company has benefited from improving electricity demand in recent months. Per the U.S. Energy Information Administration (EIA), U.S. retail electricity sales are likely to inch up 2.7% in 2021 after sliding 3.9% in 2020. Given the growth in demand, coupled with FirstEnergy’s 96.5% earnings growth this year and given that its stock is still trading 52.8% below its estimated fair value (according to Simply Wall St.), analysts speculate that its stock is set to remain a handsome mid- to long-term investment. Analysts also cite $FE’s 14% return on equity (ROE) as a reassuring sign that the company is growing in value and effectively managing investors’ money. This week’s most speculative $FE article:\n\n“Should You Be Excited About FirstEnergy Corp.'s 14% Return On Equity?” | Simply Wall St.\n\n&amp;#x200B;\n\n👜 PVH Corp. ($PVH): The stock with the most reactive (ie. past-tense) sentiment measured in the news coverage this week was PVH Corp. (reaction score: 53.6%). $PVH stock price stair-stepped up 5.12% to $118.84 per share on Wednesday following the release of its Q2 earnings report, which beat consensus analyst earnings and laid out an upbeat outlook for the remainder of the year. The company (formerly known as Phillips-Van Heusen Corporation) is one of the world’s largest clothing conglomerates and owner/licenser of brands such as Tommy Hilfiger, Calvin Klein, Kenneth Cole New York, and Michael Kors. PVH Corp announced quarterly earnings per share of $2.72 — crushing analyst estimates $1.52 — and posted revenue growth of 46% YoY to $2.31 billion as consumers begin to return to their pre-pandemic apparel shopping habits. Following the beat-and-raise report, analysts at JPMorgan and Credit Suisse both announced increased price targets for $PVH. The most reactive $PVH article this week:\n\n“PVH, IBD Stock Of Day, Breaks Out As Calvin Klein Owner's Earnings Beat” | Investor’s Business Daily\n\n# Biggest Mood Swings and Changes 🎭🔀\n\nEach week we compare the sentiment of each ticker to its sentiment from the previous week. Presented below are the tickers that saw the biggest change in each of our four sentiment metrics this week compared to last: [image](https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F68ffb0c2-1e95-4b38-b913-cf5a9e81061e_2038x769.png)\n\n💽 Advanced Micro Devices ($AMD) saw the largest increase in optimism expressed this week compared to last week after $AMD stock broke resistance above $109 per share early in the week; analysts at Benzinga say the stock has now settled into its second bullish pattern of the past month. On Wednesday, it was reported the U.S. Department of Energy was nearing a deal worth $500 million to purchase a supercomputer made with AMD and NVIDIA Corp.\n\n💰 Coinbase Inc. ($COIN) recorded the largest increase in pessimism expressed this week despite the stock rallying 8.62% to $278.44 per share. This increase in pessimism can be widely attributed to a handful of contrarian, negative articles published by the likes of the Motley Fool and SeekingAlpha arguing that the underlying volatility of digital assets makes Coinbase an inherently risky stock to invest in.\n\n💻 Hewlett Packard Enterprises Co. ($HPE) posted the biggest increase in speculative language expressed this week compared to last as the stock remained relatively flat over the trading period, rising just 0.06% to $15.67 per share. Much of the speculation surrounding the company’s lackluster earnings report released early in the week, in which the company’s continued supply chain issues showed through. Analysts wonder if HP’s component supply concerns will continue.\n\n💉 Moderna Inc. ($MRNA) received the biggest increase in reactive language expressed after increasing in stock price by more than 13% to $416.70 per share on strong trading volume and new research released this week suggesting that the company’s COVID-19 shot may offer longer-lasting protection that Pfizer’s amid growing conversation about the importance (or lack thereof) of booster shots.\n\n# 4. Market Mood Outlook 🌡️🔭\n\nThis past week brought a close to the month of August and commenced the unofficial start of Fall 2021. In terms of market action, August was the 7th consecutive month of stock market growth, and the largest month in history in terms of cryptocurrency trade volume. This past week was no exception to the tremendous momentum in both realms, and news sentiment reflected this: stock market news articles published this week saw more optimism expressed on average than any other week this year except for one (the first week of August, the height of Q2 earnings).\n\nLooking ahead into September and October, the extreme optimism is showing no signs of slowing down as Wall Street expectations for the next stock market earnings season continue to rise. Over July and August, forecasts for third-quarter earnings of companies in the S&amp;P 500 rose 3.8%, according to FactSet. That’s the fourth-largest such increase during the first two months of a quarter since 2009.\n\nWhile market bulls are currently reveling in the continued outperforms of stocks, market bears may be quick to point out that we are growing more and more due for some sort of correction. The S&amp;P 500 hasn’t suffered a 5% pullback since October 2020. The last time the index experienced such a long period without a big drop was from June 2016 to early February 2018. With that in mind, we will continue to watch the progression of international economic factors like the COVID-19 Delta variant and the transition to Taliban rule in Afghanistan for any inkling of adverse impact on the U.S. stock market. That’s all for today’s report; good luck this week everyone, and thanks for reading. 🙏",
        "subreddit": "StockMarket",
        "title": "FULL REVIEW: stock market news sentiment report for this past week (8/30-9/3)",
        "url": "https://www.reddit.com/r/StockMarket/comments/pjfrce/full_review_stock_market_news_sentiment_report/",
        "created": 1631017269.0
    },
    {
        "author": "Adept_Chip",
        "created_utc": 1630704041,
        "id": "phe532",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " Reportlinker.com announces the release of the report \"Global AI in Computer Vision Market By Offering, By Machine Learning Model, By Function, By Application, By End User, By Regional Outlook, COVID-19 Impact Analysis Report and Forecast, 2021 - 2027\" - https://www.reportlinker.com/p06131405/?utm\\_source=GNW  \nThe AI in a computer or a computer-enabled robotic system makes it capable to manage information and generate results in decision making, learning, and solving problems. The results are produced in such a manner that they are quite similar to the thought process of humans.  \n\n\nComputer vision is one of the domains of computer science. It is focused on reproducing the intricacy of the human vision system. This enables the computers to recognize and process objects from the presented images and videos in a similar manner like humans. As a huge amount of data is generated on daily basis, it is important to have the application of computer vision. Therefore, it is the key catalyst for the growth of computer vision. The precision rates of object detection have been improving with superior and advanced hardware and algorithms in computer vision. The percentage of accuracy reached from 50% to 99%, so computers are responding more quickly to visual inputs as compared to humans.  \n\n\nThe increasing need for automation and quality inspection, growing demand for computer vision systems in non-conventional applications are the major factors driving the growth of the AI in computer vision market. Moreover, the increasing need for ASICs is also expected to boost the growth of the market. Similarly, favorable policies and government initiatives to support industrial integration and adoption of AI into the edge devices are likely to create new growth avenues for the market players. However, increasing security concerns associated with cloud-based image processing and analytics are likely to restraint market growth.  \n\n\nCOVID-19 Impact  \n\n\nThe sudden outbreak of the COVID-19 has impacted various industries. Though, it had a negligible impact on AI in the computer vision market. The outbreak of the COVID-19 has caused a major impediment to the export-oriented economies from a regional point of view. It is due to the temporary closure of manufacturing units. For example, the automotive industry of Germany has been rigorously affected because most of the automobile trade in this region takes place with China and Italy. Apart from the issues related to imports and exports, the manufacturing industry growth in Germany has also been hampered by the shutdown of manufacturing plants and reduces speed in operations in order to curb the spread of COVID-19.  \n\n\nOffering Outlook  \n\n\nBased on Offering, the market is segmented into Software and Hardware. Hardware segment is further bifurcated across Processor, Memory and Storage. The software segment would exhibit highest growth rate during the forecast period. Software tools in combination with a suite of computer vision software help an individual to interface with a camera and a production line. It automatically carries out location analysis, image improvement, flaw detection, character recognition, symbol recognition, character verification, and several other functions.  \n\n\nMachine Learning Model Outlook  \n\n\nBased on Machine Learning Model, the market is segmented into Supervised Learning and Unsupervised Learning &amp; Reinforcement Learning. Supervised learning segment would garner a higher share of the AI in the computer vision market in 2020. The increasing adoption of supervised learning in different healthcare applications mainly medical imaging and their usage in different sensors and devices that includes modern facial recognition algorithms are likely to promote the growth of this segment.  \n\n\nFunction Outlook  \n\n\nBased on Function, the market is segmented into Inference and Training. Inspection, measurement, identification, and locating the product are the major applications of computer vision systems in diverse industries. Apart from it, AI-enabled vision systems have methods of developing novel applications like 3D model building, optical character recognition, retail, medical imaging, automobile safety, surveillance &amp; traffic monitoring, morphing, and augmented reality.  \n\n\nApplication Outlook  \n\n\nBased on Application, the market is segmented into Non-industrial and Industrial. The non-industrial segment procured the largest share of AI in the computer vision market in 2020. In the non-industrial market, the increasing demand for camera-enabled smartphones in both front and rear ends is boosting the AI in computer vision market, mainly in the consumer segment. Furthermore, the industrial segment is likely to grow at a higher rate due to the adoption of modern technologies.  \n\n\nEnd User Outlook  \n\n\nBased on End User, the market is segmented into Consumer Electronics, Automotive, Retail, Healthcare, Security &amp; Surveillance, Manufacturing and Others. The Consumer Electronics segment would procure the largest share over the forecast period. There is a growing demand for AI-enabled computer vision systems mainly in consumer electronics like smartphones, laptops, and desktops. This factor is expected to drive the growth of the AI in computer vision market over the forecast period. Healthcare would exhibit the highest CAGR over the forecast period. It is attributed to fact that AI-enabled computer vision technology is finding its applications in radiology and medical imaging.  \n\n\nRegional Outlook  \n\n\nBased on Regions, the market is segmented into North America, Europe, Asia Pacific, and Latin America, Middle East &amp; Africa. Based on region, North America would garner the largest share of the global AI in the computer vision market. The presence of key market players of AI technology including IBM (US), Google (US), Intel (US), Microsoft (US), NVIDIA (US), and Facebook (US) in this region is complementing the growth of the market. In recent years, government interventions have been increased due to rising concerns about the security of crucial infrastructure and sensitive data. This has resulted in the higher adoption of AI in computer vision, especially in security applications.  \n\n\nThe major strategies followed by the market participants are Product Launches. Based on the Analysis presented in the Cardinal matrix; Microsoft Corporation, Intel Corporation, Amazon.com, Inc., Facebook, Inc., and Google, Inc. are the forerunners in the AI in Computer Vision Market. Companies such as NVIDIA Corporation, Basler AG, and Xilinx, Inc. are some of the key innovators in the market.  \n\n\nThe market research report covers the analysis of key stake holders of the market. Key companies profiled in the report include NVIDIA Corporation, Intel Corporation, Microsoft Corporation, IBM Corporation, Qualcomm, Inc., Amazon.com, Inc., Xilinx, Inc., Google, Inc., Facebook, Inc., and Basler AG.  \n\n\nRecent strategies deployed in AI in Computer Vision Market  \n\n\nPartnerships, Collaborations, and Agreements:  \n\n\nApr-2021: Intel teamed up with John Deere, an American manufacturing company. The companies announced a pilot program, which depends on AI &amp; computer vision to identify defects in manufacturing regarding the welding process.  \n\n\nOct-2020: Microsoft partnered with SoftBank, a Japanese multinational conglomerate holding company. This partnership aimed to allow developers to transmit data from Arm-based Internet of Things (IoT) devices to Azure Cloud and also enable developers to easily target a wide variety of Arm-based devices such as intelligent computer-vision-enabled cameras, AI gateways, connected vehicles, and intelligent appliances.  \n\n\nSep-2020: Basler formed a collaboration with Axiomtek, a leader in designing and manufacturing industrial computer products. This collaboration aimed to provide integrated, all-in-one machine vision solutions for factory &amp; machine automation. In addition, the companies also aimed to help manufacturers &amp; system integrators instantly create their own quality inspection applications to make manufacturing processes effective and competitive.  \n\n\nSep-2020: NVIDIA collaborated with HCL Technologies, an Indian multinational information technology services and consulting company. Under this collaboration, HCL joined NVIDIA Partner Network (NPN) to utilize the expanded opportunities in the Artificial Intelligence (AI) space. In addition, HCL also unveiled NEXT.ai, HCL’s AI Lab, aimed at upskilling engineers and architects using AI solutions all over the hardware &amp; software technology stacks, which would improve their offerings to develop AI-led solutions for various HCL customers over various industry verticals.  \n\n\nAcquisition and Mergers:  \n\n\nMay-2021: Basler announced a merger with Silicon Software, a globally recognized technology leader in the programming of FPGA processors. Basler acquired Silicon Software in 2018 and operated it as an independent company under the group structure. Some functions like logistics, production, sales, and technical support were merged after the acquisition, and now the other functional units are followed step by step.  \n\n\nSep-2020: NVIDIA came into an agreement to acquire Arm Limited, a British semiconductor, and software design company. Through this acquisition, NVIDIA would integrate its leading AI computing platform with Arm’s vast ecosystem to make the premier computing enterprise for the age of artificial intelligence, fuelling the innovation and also expanding into big, high-growth markets.  \n\n\nFeb-2020: Facebook took over Scape Technologies, a computer vision startup. This acquisition aimed to support the social media site’s interest in next-generation techs like AI and virtual reality.  \n\n\nProduct Launches and Product Expansions:  \n\n\nApr-2021: Basler introduced a new AI machine vision platform. This platform is based on the artificial intelligence (AI) &amp; machine learning (ML) services provided by Amazon Web Services. The platform involves a 5 MPixel Basler ace camera with GigE interface &amp; the NVIDIA Jetson TX2NX module. Additionally, Basler’s pylon Camera Software Suite is integrated with the AWS Panorama Device SDK, allowing customers to implement and operate AI/ML applications on edge gadgets with device management and precision monitoring support.  \n\n\nApr-2021: Xilinx launched the Kria portfolio of adaptive system-on-modules (SOMs), production-ready small form factor incorporated with boards. Kria adaptive SOMs are the latest way of bringing adaptive computing to AI &amp; software developers, which are coupled with a comprehensive software stack and pre-built, production-grade accelerated applications.  \n\n\nApr-2021: NVIDIA unveiled the next-generation AI-enabled processor for autonomous vehicles, NVIDIA DRIVE Atlan. This product is the latest addition to NVIDIA’s centralized compute roadmap for autonomous vehicles, and it integrates AI &amp; software with enhancements in networking, computing, and security for extraordinary levels of performance &amp; security.  \n\n\nApr-202: NVIDIA launched a new class of NVIDIA-Certified System. It brings AI under the reach of companies, which operate their applications on industry-standard enterprise data center infrastructure. In addition, this new class involves high-volume enterprise servers from leading manufacturers, which can operate the NVIDIA AI Enterprise software portfolio and certified for VMware vSphere 7, which is known as the world’s most broadly utilized compute virtualization platform.  \n\n\nMar- 2021: Facebook introduced SEER, a deep learning solution. This solution aimed to register images on the Internet regardless of curated and labeled data sets. Through the major improvements that are underway in natural language processing (NLP) that includes natural language interference, machine translation, and question answering, SEER utilizes an innovative billion-parameter, self-supervised computer vision model capable of learning from any online image.  \n\n\nMar-2021: Xilinx expanded its UltraScale+ portfolio for markets with the latest applications, which need ultra-compact &amp; intelligent edge solutions. The latest Artix and Zynq UltraScale+ devices can meet a broad range of applications under the industrial, healthcare, vision, broadcast, automotive, consumer, and networking markets.  \n\n\nMar-2021: NVIDIA introduced new updates to CUDA-X AI Software. The NVIDIA CUDA-X AI is a deep learning library for all researchers &amp; software developers to develop high-performance GPU-accelerated applications for recommendation systems, interactive AI, and computer vision.  \n\n\nFeb-2021: Xilinx unveiled a set of tools &amp; services for AI-based video analytics, gathered within the Smart World banner. The core of this offering is the Xilinx Video Machine-learning Streaming Server (VMSS) that helps use cases that include virtual fencing, facial recognition, traffic monitoring, crowd statistics, and object detection.  \n\n\nJan-2021: Intel released a facial recognition feature to its Intel RealSense portfolio. RealSense ID consists of an active depth-sensing camera along with a specified system-on-chip involving Intel’s specialized facial authentication neural network. This product includes the improvements in computer vision &amp; neural networks that made facial recognition &amp; authentication more comprehensive.  \n\n\nDec-2020: Amazon Web Services released Amazon Lookout for Equipment, Amazon Monitron, the AWS Panorama SDK, the AWS Panorama Appliance, and Amazon Lookout for Vision. These five new machine learning services assist industrial &amp; manufacturing clients to implement the intelligence in their production procedures to enhance operational efficiency, security, quality control, and workplace safety.  \n\n\nJul-2020: Qualcomm Technologies introduced the Qualcomm QCS610 and Qualcomm QCS410 system-on-chips (SoCs) to the Qualcomm Vision Intelligence Platform. The QCS610 and QCS410 are developed to bring top-quality camera technology that includes robust artificial intelligence &amp; machine learning features earlier only available to high-end devices, into mid-tier camera categories.  \n\n\nScope of the Study  \n\n\nMarket Segments covered in the Report:  \n\n\nBy Offering  \n\n\n• Software  \n\n\n• Hardware  \n\n\no Processor  \n\n\no Memory  \n\n\no Storage  \n\n\nBy Machine Learning Model  \n\n\n• Supervised Learning  \n\n\n• Unsupervised Learning &amp; Reinforcement Learning  \n\n\nBy Function  \n\n\n• Inference  \n\n\n• Training  \n\n\nBy Application  \n\n\n• Non-industrial  \n\n\n• Industrial  \n\n\nBy End User  \n\n\n• Consumer Electronics  \n\n\n• Automotive  \n\n\n• Retail  \n\n\n• Healthcare  \n\n\n• Security &amp; Surveillance  \n\n\n• Manufacturing  \n\n\n• Others  \n\n\nBy Geography  \n\n\n• North America  \n\n\no US  \n\n\no Canada  \n\n\no Mexico  \n\n\no Rest of North America  \n\n\n• Europe  \n\n\no Germany  \n\n\no UK  \n\n\no France  \n\n\no Russia  \n\n\no Spain  \n\n\no Italy  \n\n\no Rest of Europe  \n\n\n• Asia Pacific  \n\n\no China  \n\n\no Japan  \n\n\no India  \n\n\no South Korea  \n\n\no Singapore  \n\n\no Malaysia  \n\n\no Rest of Asia Pacific  \n\n\n• LAMEA  \n\n\no Brazil  \n\n\no Argentina  \n\n\no UAE  \n\n\no Saudi Arabia  \n\n\no South Africa  \n\n\no Nigeria  \n\n\no Rest of LAMEA  \n\n\nCompanies Profiled  \n\n\n• NVIDIA Corporation  \n\n\n• Intel Corporation  \n\n\n• Microsoft Corporation  \n\n\n• IBM Corporation  \n\n\n• Qualcomm, Inc.  \n\n\n• Amazon.com, Inc.  \n\n\n• Xilinx, Inc.  \n\n\n• Google, Inc.  \n\n\n• Facebook, Inc.  \n\n\n• Basler AG  \n\n\nUnique Offerings  \n\n\n• Exhaustive coverage  \n\n\n• Highest number of market tables and figures  \n\n\n• Subscription based model available  \n\n\n• Guaranteed best price  \n\n\n• Assured post sales research support with 10% customization free  \n\n\nFull report: [https://www.reportlinker.com/p06131405/?utm\\_source=GNW](https://www.globenewswire.com/Tracker?data=M5qOYb4OcGQWiacO4kJkMrxmFu9clcBJDzVi7cB65UwYu_2eGAm72l1wxA97l1-usGC8uxi7p3oL--noFR9T80jDOx_CZx0D3JPoeXElYZUVQefJEQnz42weQXBL3Ertj1bmetkywPJqkocyZk1qkDICixaXR3kEsDrymG7LIXGcrk6h0CUXlDjlPSQgjkFe)",
        "subreddit": "investing",
        "title": "Global AI in Computer Vision Market By Offering, By Machine Learning Model, By Function, By Application, By End User, By Regional Outlook, COVID-19 Impact Analysis Report and Forecast, 2021 - 2027",
        "url": "https://www.reddit.com/r/investing/comments/phe532/global_ai_in_computer_vision_market_by_offering/",
        "created": 1630732841.0
    },
    {
        "author": "senttoschool",
        "created_utc": 1631083058,
        "id": "pk56tj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "My portfolio: [https://imgur.com/a/Kh19asj](https://imgur.com/a/Kh19asj)\n\nI use the services/products from all these companies on a daily or monthly basis. The CRM stock was from the result of Slack acquisition. \n\nFor Intel, I'm waiting to see how their big.Little CPUs and ARC GPUs will perform in reviews. If the reviews are good, I'm going big in Intel. There is usually a huge lag between a reviews of CPUs/GPUs to Wallstreet reacting. For example, AMD Zen2 was going to be a massive success if you read the reviews. Wallstreet didn't react until many months later. In addition, the government will keep Intel alive no matter what because they need a domestic chip manufacturer. Lookout for a ton of government subsidies to Intel.\n\nFor Qualcomm, I'm betting that their Nuvia acquisition will allow them to move into the laptop/desktop market but it's a small bet right now. Again, I will wait for reviews of their first Nuvia product before deciding if I want to buy more because of the lag between reviews and Wallstreet reacting.\n\nSo far, I've beaten S&amp;P500 last year and this year so far.",
        "subreddit": "stocks",
        "title": "Rate my stock picks",
        "url": "https://www.reddit.com/r/stocks/comments/pk56tj/rate_my_stock_picks/",
        "created": 1631111858.0
    },
    {
        "author": "marlinmarlin99",
        "created_utc": 1630695333,
        "id": "phbfst",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": " \n\nBased in Tel-Aviv, Israel, REE  Automotive has managed to stay out of consumer-facing EV news because  its tech has mostly been aimed at other manufacturers, with its role  centered on that of a developer and supplier. Its scheduled  establishment of a US foothold should bring it more publicity, landing  in a city that is rapidly becoming an EV tech hub.\n\nIn  the EV industry and start-up world**, REE is arguably best known for  skateboard platform**s, with the company's calling card being the  industry's flattest EV platform. Dubbed REEcorner, the platform packs  the powertrain, steering, suspension and braking components into the  arch of the wheel, **offering other automakers a ready architecture on  which many different types of vehicle bodies can be fitted.** The compact  module between the chassis and the wheel, therefore, is designed to be  scalable and modular—what the company calls \"agnostic\" to the design and  size of the final vehicle.\n\nThe  **planned Austin facility** will include an integration center, the company  says, that will offer REE's technology to future and current partners in  North America, including Magna International, allowing for the  construction of prototypes.\n\nREE  Automotive has been developing EV chassis that combine the powertrain,  steering, suspension, and braking into a slim platform.\n\nThe  platforms are designed to be scalable and modular, suitable for  vehicles with all types of bodies and different sizes and weight  classes.\n\nREE Automotive will set up US headquarters in Austin, Texas, which is already a tech hub, to work with partners in the US.\n\n**Catalyst:**\n\n# REE is about to participate in a series of conferences starting next week which will provide a huge bump to the price.\n\n1. Cowen's  4th Annual Global Transportation &amp; Sustainable Mobility  ConferencePresentation scheduled for Thursday, September 9 at 9:20am ET  Register to webcast\n2. Morgan Stanley Virtual 9th Annual Laguna Conference Tuesday, September 14\n3. Evercore ISI Autotech &amp; AI ForumPresentation scheduled for Wednesday, September 22 at 8am ET Register to webcast\n4. DA  Davidson 20th Annual Diversified Industrials &amp; Services Conference  Presentation scheduled for Thursday, September 23 at 11am ET Register to  webcast",
        "subreddit": "wallstreetbets",
        "title": "$REE Automotive Catalyst ..",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phbfst/ree_automotive_catalyst/",
        "created": 1630724133.0
    },
    {
        "author": "cru3211",
        "created_utc": 1630607844,
        "id": "pgnvma",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Matterport will create a digital clone of our world for the metaverse.\n\nBefore I explain how, check out my previous DD posts for some context.  \n[MTTR Bringing 3D Photogrammetry Experiences](https://www.reddit.com/r/wallstreetbets/comments/ou2ap9/mttr_bringing_3d_photogrammetry_experiences_to/)  \n[MTTR Explosive Potential](https://www.reddit.com/r/wallstreetbets/comments/p3469k/mttr_update_explosive_avenues_of_potential/)\n\nNow, you’re probably wondering “What is the metaverse u/cru3211?”\n\nLet me tell you.\n\n# The Metaverse\n\nThe **metaverse** is a paradigm shift in the way we organize ourselves as a society. It’s an evolutionary embodiment of technology &amp; the internet. It’s commonly envisioned as a “second layer” to our world. Sort of like… a virtual clone of it… that’s digitized. See where this is going?\n\nThis is the **spatial web**. It represents an emerging three-dimensional web experience. It’ll blow the old internet out of the water.\n\nresearch: metaverse, web 3.0, and spatial web for more insights.\n\nMSG me and I’ll ramble more about the metaverse. For now, just understand that it’s an inevitable innovation that will see widespread growth within the next decade. Matterport is likely (but not guaranteed) to be a part of this evolution.\n\n# Government Contract\n\nMatterport has entered the public sector to digitize the valuable assets of the US government.\n\n&amp;#x200B;\n\n&gt;“Through the use of Matterport’s technology, federal agencies will be  \nable to *digitize and index* government facilities, infrastructure and  \nother assets such ***as airplanes, ships and submarines.”***  \n&gt;  \n&gt;  \n“For example, in the event of an emergency, digital twins of  \n**buildings, roads, bridges, tunnels, water supplies or electrical grids** can be instantly viewed and analyzed by authorized users to  \nrespond more efficiently”  \n&gt;  \n&gt;  \n“Access to 3D digital twins and the spatial data behind them can fuel  \na multitude of use cases such as **emergency response, military**  \n**training and historical preservation**.” - George Hoyem at In-Q-Tel\n\nHow could you not be bullish? They’re creating a private searchable 3D database. This is immensely powerful. Imagine being able to visualize the entire underground infrastructure of NYC without having to dig everything up? \n\n# Collaboration Tool\n\nYou know how on Google docs you can live collaborate with other users on a doc? I use it all the time. Matterport just added that for digital twins. That leads me to my next point.\n\n# Prediction:\n\nI’ve come to believe that Google will want Matterport. I have no evidence of this, it’s just a feeling. This is because the two companies align in a variety of ways. (I guess Google could just develop their own tech, but I just feel like they might take the easy route and acquire.)\n\n* Google Earth has exteriors of 3D buildings, but not interiors. Imagine how Matterport’s 3D dataset could be utilized for that tool?\n* Matterport and Google are both platform companies with a focus on big data and indexing that data.\n* Google Real-estate searching was removed about a decade ago, but what if this was the catalyst for them to bring it back. I predict that Google will bring back real estate searching but integrate it with 3D interactive experiences.\n* Google’s AI research could be fueled by Matterport’s datasets.\n* Matterport could be integrated with Google’s suite of apps.\n\n**My positions:**  \n100 shares at $14. Some calls expiring from Sept – December ranging from $17.5 - $25.",
        "subreddit": "wallstreetbets",
        "title": "$MTTR | METAVERSE FUTURES",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/pgnvma/mttr_metaverse_futures/",
        "created": 1630636644.0
    },
    {
        "author": "marlinmarlin99",
        "created_utc": 1630693404,
        "id": "phaud9",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": " Based in Tel-Aviv, Israel, REE Automotive has  managed to stay out of consumer-facing EV news because its tech has  mostly been aimed at other manufacturers, with its role centered on that  of a developer and supplier. Its scheduled establishment of a US  foothold should bring it more publicity, landing in a city that is  rapidly becoming an EV tech hub.\n\nIn the EV  industry and start-up world, REE is arguably best known for skateboard  platforms, with the company's calling card being the industry's flattest  EV platform. Dubbed REEcorner, the platform packs the powertrain,  steering, suspension and braking components into the arch of the wheel,  offering other automakers a ready architecture on which many different  types of vehicle bodies can be fitted. The compact module between the  chassis and the wheel, therefore, is designed to be scalable and  modular—what the company calls \"agnostic\" to the design and size of the  final vehicle.\n\nThe planned Austin facility will  include an integration center, the company says, that will offer REE's  technology to future and current partners in North America, including  Magna International, allowing for the construction of prototypes.\n\n&amp;#x200B;\n\n* **REE Automotive has been developing EV  chassis that combine the powertrain, steering, suspension, and braking  into a slim platform.**\n* **The platforms are  designed to be scalable and modular, suitable for vehicles with all  types of bodies and different sizes and weight classes.**\n* **REE Automotive will set up US headquarters in Austin, Texas, which is already a tech hub, to work with partners in the US.**\n\n&amp;#x200B;\n\nCatalyst: \n\n# REE is about to participate in a series of conferences starting next week which will provide a huge bump to the price of the stock . Its take a beating but the price is currently at its low. \n\n Read the news: [https://www.wdrb.com/news/national/ree-automotive-to-participate-in-series-of-investor-conferences/article\\_2f4f412c-dd7b-5e4f-8b6e-5849cd913b56.html](https://www.wdrb.com/news/national/ree-automotive-to-participate-in-series-of-investor-conferences/article_2f4f412c-dd7b-5e4f-8b6e-5849cd913b56.html)\n\n[Cowen's 4th Annual Global Transportation &amp; Sustainable Mobility Conference](https://www.globenewswire.com/Tracker?data=Ynts0B9b1DK8XQgnJTK5jiERwsvaQSxVkRiMg-kuwd7tSh6XUU9kwZIB1SHanOd-d5KoMYON2PQw%E2%80%94qki-9%E2%80%94nF3O5sW-Lj4zjCsyn50Ef5qXAZYBTPSavwnEJG4wthOXxKu7jJ-gpBA7wzkx1zKbeSYf7dqQ5VGldFzpzhLJEB3BjEpZx%E2%80%94GYCCPDYoeVC6tdUh2xTyqQlGO96yxw0GCyO6TwbirNV37mSI5tQ6FGuTmTt0W05ytu43mdHVmIG5jyogjI%E2%80%94abdPKAOzjNIhJzsik%E2%80%94vF7bCSg3ANCKWwLozSS7A=)Presentation scheduled for Thursday, September 9 at 9:20am ET [Register to webcast](https://www.globenewswire.com/Tracker?data=clRq8UotEHim061za7lt3BzRiK19usL9Lszv1mtebYqzRWE0cABwh88bRenqp3aoEcmqu5Z77r2ZOz5yyd4KpvzJ7JwzS9rzhfgkXaFzeqyddd7A6m9%E2%80%94jzlv4ELCY5Y68LY16Y51dDIemRkKmNG%E2%80%94Jmbaq0iaar3sFYaxb3hRc5i3TJjEo6FcfAEUr5519UkV0Rw3phAUkgSe%E2%80%94uroHucxzQ==)\n\nMorgan Stanley Virtual 9th Annual Laguna Conference Tuesday, September 14\n\n[Evercore ISI Autotech &amp; AI Forum](https://www.globenewswire.com/Tracker?data=IP-azQjO0Ny01ztp%E2%80%948RCMuMAUZONZruPN-iiXs09-dN3oUEl6RQ2w7u6Y32yx8YcoQlmlL3-Hx6mVlMQ7kxIfKNpZCyQbjdu9lXH6l3cpBBraXyivnbGzzO7OeysD66RVMwkWA-gpHHRuzPhYT50HsHkpyKpHwY5byfhIk1wHn0BEhA9QnoMO96rOM94XpsO)Presentation scheduled for Wednesday, September 22 at 8am ET [Register to webcast](https://www.globenewswire.com/Tracker?data=clRq8UotEHim061za7lt3A-6iYAKOqZmgGEAsCSrjeKEYOjUkSizooRDHimN2x5oKmKOpPFpf-i0X2QeZUsq5YI%E2%80%94a17YkqfH14oxxXSVf9-eCym%E2%80%94MknNdrBOze4YPtnuUSrYTwqbFYSl9xQNFUW061h6vVW-vX6TkVoq6y2JMQ18of0xLd-Q8rMqIQV9PPkNsyRPm1dSLgiZcuj0k4TimGHLLSFWRSs1bhu1Wod2EM8=)\n\nDA  Davidson 20th Annual Diversified Industrials &amp; Services Conference  Presentation scheduled for Thursday, September 23 at 11am ET [Register to webcast](https://www.globenewswire.com/Tracker?data=clRq8UotEHim061za7lt3GpJRorO5P2yMR7xTic6lufIke00GyEgU8IXbQKnCzfl-Cu9NNSkTYttEj1Do4TKtM5mk2ybLi9YbpcR4Nnsjn7FgiM%E2%80%94IMjKm58oKdOtS7odDyPnDkFSoZLCZrO7tb1sKYevTI3pqrguP0-OajI0p%E2%80%94vcpTA%E2%80%94DUvD4hG9ZnGxvy%E2%80%94SEckXZuLgzjSCEw1ctmYJLw==)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nMy position: I currently hold 4k stocks and will be getting some more\n\n[https://imgur.com/a/k6mI4Sd](https://imgur.com/a/k6mI4Sd)",
        "subreddit": "wallstreetbets",
        "title": "$REE Automotive YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phaud9/ree_automotive_yolo/",
        "created": 1630722204.0
    },
    {
        "author": "marlinmarlin99",
        "created_utc": 1630695076,
        "id": "phbcz3",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Based in Tel-Aviv, Israel, REE Automotive has managed to stay out of consumer-facing EV news because its tech has mostly been aimed at other manufacturers, with its role centered on that of a developer and supplier. Its scheduled establishment of a US foothold should bring it more publicity, landing in a city that is rapidly becoming an EV tech hub.\n\nIn the EV industry and start-up world, REE is arguably best known for skateboard platforms, with the company's calling card being the industry's flattest EV platform. Dubbed REEcorner, the platform packs the powertrain, steering, suspension and braking components into the arch of the wheel, offering other automakers a ready architecture on which many different types of vehicle bodies can be fitted. The compact module between the chassis and the wheel, therefore, is designed to be scalable and modular—what the company calls \"agnostic\" to the design and size of the final vehicle.\n\nThe planned Austin facility will include an integration center, the company says, that will offer REE's technology to future and current partners in North America, including Magna International, allowing for the construction of prototypes.\n\nREE Automotive has been developing EV chassis that combine the powertrain, steering, suspension, and braking into a slim platform.\n\nThe platforms are designed to be scalable and modular, suitable for vehicles with all types of bodies and different sizes and weight classes.\n\n REE Automotive will set up US headquarters in Austin, Texas, which is already a tech hub, to work with partners in the US.\n\n**Catalyst:**\n\n# REE is about to participate in a series of conferences starting next week which will provide a huge bump to the price. \n\n1. Cowen's 4th Annual Global Transportation &amp; Sustainable Mobility ConferencePresentation scheduled for Thursday, September 9 at 9:20am ET Register to webcast\n2. Morgan Stanley Virtual 9th Annual Laguna Conference Tuesday, September 14\n3. Evercore ISI Autotech &amp; AI ForumPresentation scheduled for Wednesday, September 22 at 8am ET Register to webcast\n4. DA Davidson 20th Annual Diversified Industrials &amp; Services Conference Presentation scheduled for Thursday, September 23 at 11am ET Register to webcast\n\n**My position:** \n\nI currently hold 4k stocks and will be getting some more\n\n[https://imgur.com/a/k6mI4Sd](https://imgur.com/a/k6mI4Sd)",
        "subreddit": "wallstreetbets",
        "title": "$REE Automotive YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/phbcz3/ree_automotive_yolo/",
        "created": 1630723876.0
    }
]