[
    {
        "author": "Heathenstothemax",
        "created_utc": 1638542372,
        "id": "r80j3o",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Y’all been DMing me a lot so here it is. \n\nThe Fed, China, Evergrande and a Mountain of Dog-shit Wrapped in Cat-shit.\n \nDid the Fed indirectly bail out Chinese commercial paper and bonds issued by Chinese developers, and is still sitting on most of the $750 billion investment?\nWell, currently the Fed continues to add Treasury securities and Mortgage-Backed Securities to its holdings despite raging inflation, and only plans to end these purchases by mid-2022. It has already largely unwound its crisis specials, from repos and liquidity swaps to an alphabet soup of programs of corporate bonds and commercial paper holdings.\nIn total, assets on the Fed's weekly balance sheet have increased by $4.3 trillion since March 11, 2020, when all this money-printing madness began. Special purpose vehicles (SPVS) are legal entities that the Fed created during the crisis to buy assets that it was otherwise prohibited from buying.\nEquity financing was provided by the Treasury, which would absorb the first loss on these assets. The Fed makes loans to the SPVS and shows those and the equity financing from the Treasury in these SPV accounts.\nThe SPV here was called \"Corporate Credit Facilities\" (or CCF). BlackRock and a bunch of other bond funds were involved and everyone began front-running the Fed, and a huge rally in junk bonds, and bond ETFS ensued as the Fed itself bought $750 billion of this stuff.\nLast week, the Fed announced that it was winding down the CCF, but it appears that the Fed still holds most of the $750 billion, here’s the inherent issue. Chinese companies like Evergrande are registered in the Caymans, and junk bond ETFS from BlackRock and others have been bought by the Fed.\nI believe the Fed has been buying Chinese bonds indirectly on a large scale to keep the markets from crashing. Their 2020 Annual Report shows that they’ve invested $539 billion in bonds from Cayman Island issuers, and Blackrock hold a mountain of debt from Evergrande and Chinese real estate developers in their ETFS.\nGaël Fichan, a portfolio manager at SYZ Group wondered last week why total assets in the iShares USD Asia High Yield Bond ETF have risen 385% in two months to $1.8 billion since Sept. 21. So, this begs the question: Did the FED indirectly support Chinese real estate developers by stabilizing bond markets through the ETF purchase program before it stopped?\nIs there now little support for these junk bonds just shortly before bankruptcy will be officially declared and the Fed seems to still sitting indirectly on the majority of these investments?\nThe Fed stated in a report to congress: «...the Board continues to expect that the CCFS will not result in losses to the Federal Reserve...»\nWait, isn’t this the same board that vehemently advocated the fact that inflation was transitory and only as of yesterday on the 30th of November retracted that statement to now say the “inflation is here to stay”?\n \n \n \nBasically, from what I understand, everyone agreed to this pyramid scheme.  Blackrock sells mortgage-backed securities (Chinese real estate) to the Fed through QE.  They do this on margin, so not to even out their own capital reserves, because the treasury is acting as the middle man between BR and the Fed. The CCP recognized that the US was using Blackrock to pump and benefit from the already on fire real estate market, and proceeded to decisively unwind the debt fueled real estate market, recognizing that the Fed is who would take the hit in the event of a default, which as we know is only a matter of days away.\nChinese Real Estate companies need money to develop real estate, thus they sell bonds. Blackrock knows that the FED will buy \"safe debt\" as part of their quantitative easing program. This means that Blackrock has incentive to buy bonds from a lot of Real Estate companies, including China's, to repackage it in Exchange traded funds (ETFs) which ostensibly raises the ETFs' credit rating due to diversification. When the ETFs are considered good enough by at least one of the three major rating agencies (S&amp;P, Moody's or Fitch), the FED can and will buy it. This effectively means that due to QE programs there was an economical incentive for Blackrock to prop up the Chinese Real Estate bond market.\nUS Treasury securities are bought by the FED because they are considered as the safest type of treasury (safe debt from prior). Treasury securities are made when a country's budget has a deficit and also work to increase the amount of money in the economy.\nNow we see BlackRock, iShares and others benefiting from the Fed's special programs to buy Asian junk bond ETFS are abusing the investments for margin collateral to finance other global hedge activities. The Fed has created an alphabet soup of programs as Special Purpose Vehicles to buy ETFS from Blackrock, iShares and others that hold Asian junk bonds. This isn’t even the tip of the iceberg, the fact that these fund companies are abusing the holdings of Chinese commercial bonds for margin collateral to finance other global hedge activities is utterly insane.\nFor example, Ashmore Group. From July to September, as headlines battered Evergrande's stock and bond prices, London-listed Ashmore bought almost another US$100 million of bonds issued by the developer and its subsidiaries. Ashmore brought its holdings of the debt to more than US$500 million at the end of September, according to data compiled by Bloomberg.\nThis means that Ashmore bought US$500 million Asian bonds on a nominal value basis for market value of US$100 million and is using now the US$500 million Asian nominal value bonds as fully accepted collateral to show capital for other hedges in the market like AMC Theatres/GameStop. Once the Chinese real estate industry completely collapses, the Fed's ETFS won't be worth anything and the ETF provider will not be able to use it as collateral. That means once Evergrande goes bankrupt in a few days, the world economy will have a significantly bigger problem.\nThe lack of collateral will force the fund's manager to sell other assets to fill the huge gap of suddenly worthless collateral. This will be a big step and milestone towards the \"Great Reset\" and the proverbial MOASS.",
        "subreddit": "wallstreetbets",
        "title": "Dogshit wrapped in Catshit",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r80j3o/dogshit_wrapped_in_catshit/",
        "created": 1638571172.0
    }
]