[
    {
        "author": "Okmanl",
        "created_utc": 1610389529,
        "id": "kv8kyu",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "People accuse MF of pump and dump schemes, claiming that if they really were successful investors they would be keeping their information to themselves.   \n\n\n1.  If you're invested in a company for the long term, sharing your DD makes it MORE LIKELY for your company to succeed. You get more people to invest in the company you own, the company gets more money to improve their bottom line, (marketing, hiring more engineers, obtaining more money for R&amp;D etc...).  Which then encourages more people to invest in them.  \n\n2. MF has been operating for the past \\~30 years. If they really were operating a pump and dump scheme, they would've been ousted long ago.  \n\n3. One of the MF founders interviewed Jack Bogle. During a segment they discussed that the more often you trade or sell stocks, the more likely you are to underperform the market. And they also found that if Warren Buffet never sold a single stock he would've been much wealthier today. Similarly MF found that if they never sold a single stock that they purchased, they also would've performed better. So they stopped adding when to sell stocks on their news letters. \n\nThat's why long term investors like ARK and Motley Fool SHARE all of their research and purchases. When they do that, more people invest in their companies, those companies then have a better chance of getting an early advantage compared to their competitors, and so on.\n\nDisclaimer: I'm not subscribed to Motley Fool, but my dad has for the past 2 years and his portfolio consists entirely of MF stocks. He bought SHOP and FSLY before they were 1/10 the value they are now. You can judge for yourself whether or not these are short term pump and dump stocks: ZNGA, LMND, SHOP, DIS, TEUM, CHWY, LKNCY, APPN, TER, ASML, CGC, ZM, ROKU, PLUG, FSLY.",
        "subreddit": "investing",
        "title": "Why I think Motley Fool is a legitimate resource for stock picking",
        "url": "https://www.reddit.com/r/investing/comments/kv8kyu/why_i_think_motley_fool_is_a_legitimate_resource/",
        "created": 1610418329.0
    },
    {
        "author": "JohnDere",
        "created_utc": 1610047494,
        "id": "kskjw8",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Hi there,  \nmy Online Broker (Flatex) removed some of there promoted ETFs, so unfortunately one of my ETFs is no longer free as a saving plan. It's not much, like 1,5€/month, but still I don't want to \"waste\" money. So I searched for alternatives and found one but I don't really know if its worth it. I invest 150€/month into this ETF so the 1,5€ would be 1%.  \nMain differentes are:  \nOld (**IE00BJ0KDQ92**)--&gt; TER : 0,19% p.a.,  1%(1,5/150) + 0,2% ATC = 1,2%/order  \nNew (**LU0274208692**) --&gt; TER : 0,45% p.a., 0% + 0.11% ATC = 0.11%/order\n\nSo my question is, with all the transaction cost from moving from the old ETF to the new, is it worth?  \nThanks in advance.",
        "subreddit": "stocks",
        "title": "Broker removed promoted ETFs",
        "url": "https://www.reddit.com/r/stocks/comments/kskjw8/broker_removed_promoted_etfs/",
        "created": 1610076294.0
    }
]