[
    {
        "author": "Karnes",
        "created_utc": 1621738644,
        "id": "niyift",
        "num_comments": 349,
        "num_crossposts": 0,
        "selftext": "Total cash, cash equivalents and marketable securities of the company as per the latest quarter (in billions of dollars).\n\n15. Cigna (NYSE:CI) - 10.1 B\n\n14. Cisco (NASDAQ:CSCO) - 11.8 B\n\n13. Costco (NASDAQ:COST) - 13.6 B\n\n12. IBM (NYSE:IBM) - 14.3 B\n\n11. JPMorgan Chase (NYSE:JPM) - 24.9 B\n\n10. GM (NYSE:GM) - 29 B\n\n9. Oracle (NYSE:ORCL) - 43 B\n\n8. Berkshire Hathaway (NYSE:BRK.A) - 48 B\n\n7. Ford Motors (NYSE:F) - 50 B\n\n6. Facebook (NYSE:FB) - 62 B \n\n5. Alibaba (NYSE:BABA) - 70 B\n\n4. Amazon (NASDAQ:AMZN) - 84.4 B\n\n3. Microsoft (NASDAQ:MSFT) - 132 B\n\n2. Alphabet (NASDAQ:GOOG) - 136.7 B\n\n1. Apple (NASDAQ:AAPL) - 195.6 B\n\nSource:  https://finance.yahoo.com/news/15-companies-most-cash-reserves-182708211.html",
        "subreddit": "stocks",
        "title": "15 Companies With The Most Cash Reserves (Traded in the US)",
        "url": "https://www.reddit.com/r/stocks/comments/niyift/15_companies_with_the_most_cash_reserves_traded/",
        "created": 1621767444.0
    },
    {
        "author": "NrdRage",
        "created_utc": 1620422316,
        "id": "n799ne",
        "num_comments": 324,
        "num_crossposts": 0,
        "selftext": "No unique stock DD this week guys, I had a senior moment and my brain was a day off.  Probably for the best, because this market is off-the-rails broken right now, anyways.  Literally down is up and up is down.\n\n&amp;#x200B;\n\nInstead, let's do an update on the Nrd ETF for the month.  I'll go over some of my trades and, as I have time maybe read how some of you played them and offer some not-financial-advice on how to optimize the plays.\n\n&amp;#x200B;\n\nFor those who want to go to the original discussion, you can find it [here](https://www.reddit.com/r/wallstreetbets/comments/n225dj/because_people_keep_asking_the_nrdrage_etf_may/).  I'll quote box the positions below and then go into it.\n\n&amp;#x200B;\n\n&gt; *My long list (both established positions and sentiment/momentum trades I'll make):*\n\n1. *$CLNE (Positions established; look at DD)*\n2. *$MA*\n3. *$BABA (Positions established; look at DD)*\n4. *$BE (Positions established; look at DD)*\n5. *$CAT (Positions re-established today in fact - July 230c's that I timed perfectly)*\n6. *$EXPE*\n7. *$AAPL*\n8. *$ALGN*\n9. *$PSFE (Positions established earlier)*\n10. *$CVX*\n11. *$ENPH (Positions established today)*\n12. *$TSCO (Positions established)*\n13. *$CAR (Positions established)*\n14. *$KMI (September 18s)*\n15. *$BB (Positions established; see DD)*\n\n&gt;*The Short watch list:*  \n&gt;  \n&gt;*Note  that, when it comes to shorting, I do a lot more scalping and very  short term swing trading.  May is typically a month of low volume, so  you have to be agile.  Puts are generally 2 steps out of the money at  open.  Do your own DD.  This is also not a complete list, just a daily  watch list of companies that I feel are going to fare roughly or whom  have typically underperformed this time of year.  This is also not a  short and hold list.  If you don't know what I'm saying, you should stay  away from these.*\n\n1. *$TSLA (Established today @ an average cost basis of $712.11)*\n2. *$UPST*\n3. *$TWTR (Established April 28th @ $66.08)*\n4. *CLOV (always good for an intraday scalp when the capuchins go full retard)*\n5. *$SPCE*\n6. *$PTON*\n7. *$TSM*\n8. *$BLNK*\n9. *$GS (Established yesterday)*\n10. *$PINS*\n11. *$BMBL*\n12. *$EGHT*\n13. *$MDB*\n14. *$PCG*\n15. *$DASH (Established Wednesday at 162.22)*\n16. *$GRUB (Established Wednesday at 70)*\n17. *$WORK*\n18. *$CAN*\n19. *$BYND*\n20. *$AFRM (Established Wednesday at $77.20)*\n21. *$COUR*\n22. *$HEP*\n23. *$CSCO*\n24. *$PLNT*\n25. *$QS*\n26. *$WMT*\n27. *$ADT*\n28. *$TW*\n29. *$RTX*\n30. *$COF*\n31. *$NOC*\n32. *$ADM*\n33. *$AAL*\n34. *$WHR*\n35. *$LUMN*\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nAnd here's where we are **(LOSERS IN BOLD;** *N/A, draws, or otherwise flat trades in italics)***:**\n\n&amp;#x200B;\n\n1. **$CLNE:  This one got ugly.  Real ugly.  Volume completely dried up, which gave the shorts free rein to walk it down into oblivion all week.  They had an earnings call on Thursday, which was actually quite good (missed on top line EPS, but beat on revenue, upgraded forward guidance, and opened up more about the 1.5bln $AMZN contract, which sounds better and better the more I hear about it.  It actually traded up for a while this morning, but then just got absolutely assaulted the rest of the day because everybody was sitting it out.  I've averaged down - hard - on this one at this stage to make sure that I'm always within a day or two's striking distance of at least breaking even on the June calls.  I have started buying September calls at the same 13 strike.  I also started buying up more shares at $8.85 this afternoon.  I love a sale.   I'm going to re-evaluate how I feel about the June calls in the coming week.  Given that this stock has had 6 red days out of 7, any moves I make right now would be reactionary.  Further, one interesting thing I noticed was that, in the last 5 or 10 minutes or so, other whale buyers showed up HARD at the $8.79 price.  For a stock who's order book all day was just a series of 3-digit and low 4-digit offers, to see 50,000 share bids show up tells me that the shorts who had been fucking this thing all week were covering AND the buyers were coming back in (probably the same assholes who shorted it).**\n2. *$MA:  I'm still yet to open a position here.  I just haven't liked the price action, and the charts have been very choppy.  If you've played it, let me know how it worked out for you.  Looking back at the weekly, I see some openings NOW, but they weren't real clear in the moment.*\n3. $BABA:  I took the opportunity at 226 to finish filling out my call position as referenced in the last solo stock DD.  I know I said in that DD it was impossible to screw up, but apparently I underestimated the internet some, because I've had people messaging me saying they bought in at 234 and are down and \"feeling pain\", when I explicitly said not to buy at those levels.  It's interesting to me that the Chinese stocks, which are universally accepted to be underpriced, are moving in sympathy with domestic growth stocks.  That's broken.  \n4. **$BE:  Bought more August 31's on Thursday when it was at the bottom.  Sub-$20 was too good of an equity price to pass up.  I really liked the price movement on it yesterday and today.  Their earnings call was SPECTACULAR, and their leadership said all the right things.  I feel really good about this one to finally start moving independently of the rest of the green energy sector. Loser for right now, but I'm not getting shaken out**\n5. $CAT:  Those July 230's were made of latinum.  Closed out today for fat profits.  I consider this trade over until $CAT comes back down into the 220's.\n6. $EXPE:  Bought in yesterday morning.  Closed my position at about 2 pm EST today.  I sat on this trade a little too long and left about $3 a share on the table, but profit is profit.  It was a very nice trade.  This trade is closed\n7. *$AAPL:  I never actually got into my long position.  I closed my pre-existing short on Tuesday and have been eyeing an entry, but haven't found one I like yet.*\n8. $ALGN:  In Tuesday @ 575-ish, out today at 600.  Trade is closed\n9. $PSFE:  As discussed in last week's post, I ended up removing this because the apes started trying to meme stock it, and I replaced it with $CVS, which has made me enough tendies to spring for the top shelf lube for when I fuck.  The $CVS trade is still ongoing and a good one to eye an entry, IMO\n10. $CVX:  Jumped in Monday, and I'm still in the trade.  I like the movement on this one.  Still a good trade to enter, IMO\n11. **$ENPH:  I'm upside down on this one, largely because I've been unwilling to average down on it.  My bags aren't super heavy, but I do have some Samsonites right now.  Going to just store it away and let it marinate.  The price action is still downwards here, so if you're eyeing this one, let it come in further**\n12. $TSCO:  The price action on this has been amazing.  I've actually been holding this for quite some time, so my entry is way in the rear view mirror.  But I love how smoothly it's run and feel it's still got a lot more room to till.\n13. **$CAR:  This is another one I've been holding forever, and just don't want to create a taxable event on.  The price action has generally been flat, if you remove the fact they had earnings this week, and we all know what earnings means in this market.  I still like this one for a buy and hold**\n14. $KMI:  We don't talk about $KMI.  But if you're interested, maybe go look at a chart, because it'll make you wet\n15. **$BB:  I haven't done anything with this, and honestly, couldn't even tell you how it's performed.  Probably poorly.**\n\n&amp;#x200B;\n\n# The shorts:\n\n1. $TSLA:  I jumped in at $712.11.  Everybody in the daily told me I hated money.  I got out at 666, even though I was swearing up and down it was going to 650.  The price action just looked like it was turning, so I took tendies.  Then it went to 650 like I thought it would.  Could have done it better, but profit is profit.  I'm eyeing a re-entry to the short side on this one.  I'm thinking 685-690 I'll likely re-establish\n2. $UPST:  My most reliable short  I'm twenty-some dollars a share in the green already and still holding.\n3. $TWTR:  It's been SUUUUUPER choppy this week.  I got out at 52.80 for a nice gain, but I've hated the price action.  Staying away from here on out\n4. *$CLOV:  Never had a good opportunity to play it.  Still watching*\n5. $SPCE:  Death, taxes, and $SPCE tanking.  Still holding for a modest gain with stop losses in place.  Been pretty flat.  Probably still a good short if you can time it.\n6. $PTON:  God bless that Shortbus All-Star kid who got eaten by the treadmill.  Lambo squad trade.  Closed out, and consider the trade done unless I see it in the mid 90's again\n7. *$TSM:  Never entered.  I thought I had a price target in mind, but I wussed out at the last moment.  Doesn't matter, Theta Semi living up to its name*\n8. $BLNK:  30% gain.  I'll look for re-entry at 35.\n9. **$GS:  Defying the odds.  Trimmed my position to hedge losses, but this one isn't working out so far. Will look for weakness to re-establish in full**\n10. $PINS:  Closed half my position at 60 for a nice gain.  Holding the other half with tight stop losses, but I'm optimistic it's got further to fall\n11. *$BMBL:  I missed it.  Kicking myself for it, too.  I knew it was gonna fall.  Not sure how much downside is left*\n12. $EGHT:  Oh the sweet sound of an equity dying.  This one is printing for me hard, and I think it's still got another 3-4 dollars to the downside in it\n13. $MDB:  See $EGHT.  Exact same story\n14. $PCG:  Riding it down like a submissive whore.  I'll probably run this one the entire month.  Printing nicely, still plenty of room to drop\n15. $DASH:  LAMBO SQUAD!  Oh man, this one has been magnificent.  And it's still got downside.  Fair value IMO is 80.  It'll never hit it, but I think 110 is entirely doable.\n16. $GRUB:  Reliable gainer to the downside, but not as nice as $DASH.  Still holding. \n17. $WORK:  Quietly dropped on no news.  Just shows how broken the market is, because the buyout price is baked in.  I was following this so I could see news to potentially short $CRM, but none came.  $CRM, however, fell nicely on the week, but I wasn't there to catch it.  Trade is likely running out of breath\n18. *$CAN  Never entered it, which is sad because it could have been a good gainer.  I'll rectify that mistake on some upwards momentum*\n19. $BYND:  Yacht squad.  What an amazing loser.  Still holding.  I want to see 95\n20. $AFRM:  I love the concept, but I hate the business model.  This one has been a great gainer for me, but I want to see 44.  Still room to drop\n21. $COUR:  Inadvertent earnings play.  Didn't realize t hey were reporting this week.  Happy accidents.  2 bagger, excellent play.  I covered this afternoon.  I think there's probably still another 10% to the downside possible, but I actually like the model and don't want to tempt fate.  This trade is closed to me.\n22. *$HEP:  Got in and got out at dead even.  Thought I had a good entry but then things got choppy and weird.  Removed it from my watch list.  This trade is dead to me with a draw.*\n23. *$CSCO:  never entered.  Which is good, because it's run up.  I'm eyeing an entry*\n24. $PLNT:  Another great winner.  I wanna see another 4 dollars to the downside  Trade still live\n25. $QS:  Patently obvious this was gonna drop like a rock.  Ask me when it's at $10 and I'll probably still be shorting it\n26. *$WMT:  I got cute and walked into a flat trade.  Will exit next week, win lose or draw.*\n27. **$ADT:  Took the L here.  Entered at $9.27, got scared off this afternoon with a small loss.  Took it off my watch list, trade is dead to me**\n28. *$TW, $RTX, $COF, $NOC, $ADM, $AAL, $WHR, $LUMN, didn't enter any of these.  $COF, $AAL and $WHR are the only ones I'm even still tracking.  The others are dead to me*\n\n&amp;#x200B;\n\nRecord after 1 week:  \n\n&amp;#x200B;\n\nLongs:  8-5-2 (given the week that just happened, I'll take it)\n\n&amp;#x200B;\n\nShorts:  18-2-15:  Most of the draws are simply because I never entered the trades.  Take out the trades where I never expended powder and it's 18-2-2.  \n\n# \n\n# Overall (played trades):  26-2-2\n\n&amp;#x200B;\n\nSo....how'd you do?  Let's hear it.",
        "subreddit": "wallstreetbets",
        "title": "The weekend update/discussion of the Nrd May ETF (Thought it was Thursday till 10 after 2 today didn't-write-my-homework edition)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n799ne/the_weekend_updatediscussion_of_the_nrd_may_etf/",
        "created": 1620451116.0
    },
    {
        "author": "gintdm",
        "created_utc": 1620052493,
        "id": "n3xnfj",
        "num_comments": 87,
        "num_crossposts": 0,
        "selftext": "Hi Everyone! Here is my Monday Newsletter :) Happy trades and please DM me with any questions you may have :)  \n**Week of 5/3/21**\n\nThe S&amp;P500 opened Monday 5/3/21 at 4205.86, above the previous close of 4181.61 on Friday 4/30/21.\n\nManufacturing numbers release early in the week, with the April Markit Manufacturing PMI released Monday, and trade deficit &amp; factory orders numbers for March releasing Tuesday, May 4th. Markit services PMI and ISM services index numbers for April release Wednesday, and productivity &amp; labor costs for Q1 release Thursday. The ADP Employment report for April releases Wednesday, and weekly jobless claims numbers release Thursday, May 6th. April unemployment rates release Friday, as well as nonfarm payrolls, and average hourly earnings. \n\nThe average cost to build a home skyrocketed by $36,000 according to the National Association of Homebuilders. The rising prices are likely associated with soaring lumber costs. Lumber futures are up 125% on a 6-month basis. REITs reflected the change, rising throughout April. March construction numbers release Monday at 10AM. \n\n&amp;#x200B;\n\n![img](gh2b3blx1xw61 \"\nLumber Futures 6-Month Chart (LBS)\")\n\nVerizon has reached an agreement with Apollo Global Management to sell its Verizon Media platform, which consists of internet pioneers Yahoo and AOL. The agreement to sell the tech platforms to the private equity firm will be worth $5 Billion. As a stipulation of the agreement Verizon will maintain a 10% stake in the new company, which Apollo plans to call “Yahoo.” Apollo releases earnings on Monday, May 3rd. \n\nChip manufacturers have been inundated with demand following 2020’s COVID shutdowns and the, undoubtedly correlated, increase in demand for consumer electronics. Cisco, one of the world’s largest chip manufacturers, is struggling to keep up with demand. \n\nCisco revealed several steps it is taking to alleviate the imbalance in supply and demand including a $4.5 billion acquisition of Acacia Communications and a $20 billion plan to build two new manufacturing plants in Arizona. Cisco CEO Chuck Robbins commented extensively on the situation, and estimates it could “...\\[take\\] another six months…” for the company to resume normal operation. Around 85% of all internet traffic passes through Cisco hardware. \n\nThe effects of the shortage can be seen across industries. Among companies affected by the shortage are car manufacturers. Wayne Griffiths, head of VW’s Spanish brand, spoke on the issue, stating that the company will, “...need to face considerable challenges in the second quarter…” So far the shortage has prevented the company from building over 100,000 vehicles.  \nGM reports earnings on Wednesday and markets will be curious to see if the chip shortage has affected them. Despite supply chain concerns CNBC’s Jim Cramer was optimistic in his recent review of the company, saying “If you want to bet on electric vehicles with much less risk, I say buy some Ford or General Motors… these are huge, established companies with improving balance sheets and real earnings, earnings that happen to be skyrocketing right now...”\n\nThe United States Government has also expressed concern regarding the chip shortage. United States President Joe Biden held a conference with business leaders in April to address the issue. During the conference the President expressed a desire to move more chip manufacturing into American plants, citing 75% of global manufacturing as being based in East Asia.   \nMeanwhile Taiwan-based chip manufacturing giant TSMC announced a plan worth $100 billion USD to expand their companies manufacturing capacity. The announcement comes in tandem with company founder Morris Chang’s plea to the Taiwanese government for increased support, citing a fear that if the Taiwan-based manufacturer fails to meet demand US or Chinese manufacturers will fill the gap. \n\nThe increase in demand for electronics caused by the pandemic has boded well for Apple, who reported earnings of $1.40 per share on Wednesday, April 28th, exceeding analyst estimates of $0.98 after a strong Q2 for sales. The earnings call comes on the heels of Apple’s first product showcase of the year Wednesday April 21st, and the company’s announcement that it will be taking steps to increase its footing in the instant messaging market. Apple stated it plans to increase the amount of features provided by it’s iMessage app, with the objective being to bring it more in line with popular messengers offered by Facebook, WhatsApp, and Snapchat. \n\nMicrosoft reported earnings of $1.95 per share Tuesday, April 27th, beating analyst estimates of $1.78 by a small margin. Microsoft, who also saw an increase in demand for its technology as a result of the pandemic, has greatly benefitted from an increased demand for cloud-services. Microsoft’s cloud-based service hub, Azure, posted 2020 growth of 43%. The company expects to post great earnings despite the current chip-shortage, having generated much of its growth from the pandemic in the software-as-a-service sector. \n\n**Some of the Companies with Earnings this Week**\n\n**Monday, May 3rd:**  \nEstee Lauder  \nApollo Global Management Inc  \nCarvana  \nON Semiconductor Corp  \nThe Mosaic Company  \nChegg Inc.\n\n**Tuesday, April 27th:**  \nPfizer  \nT-Mobile  \nCVS  \nActivision Blizzard  \nConocoPhillips  \nSysco  \nZillow  \nXilinx  \nHelloFresh  \nUnder Armor  \nWestern Union  \nMcAfee  \n**Wednesday, April 28th:**  \nPaypal Inc.  \nUber  \nGeneral Motors  \nTwilio Inc  \nMetLife Inc  \nBudweiser Brewing Company  \nBarrick Gold Corp.  \nFranco-Nevada Corp  \nEtsy Inc  \nFox Corp  \nGoDaddy  \nZynga  \n**Thursday, April 29th:**  \nSquare  \nNintendo  \nModerna  \nMonster Beverage Corp  \nRegeneron Pharmaceuticals  \nRoku Inc  \nAIG  \nAllstate  \nWayfair Inc  \nCBS Corp  \nPeloton Interactive  \nCloudflare  \nExpedia  \nKellogg Co.  \nAlliant Energy Corp.   \nPenn National Gaming  \nNorwegian Cruise Line Ltd.  \nDropbox\n\n**Friday, April 30th:**  \nDraft Kings  \nNCsoft",
        "subreddit": "wallstreetbets",
        "title": "What's Happening in the Markets: Week of 5/3/2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n3xnfj/whats_happening_in_the_markets_week_of_532021/",
        "created": 1620081293.0
    },
    {
        "author": "pman6",
        "created_utc": 1621066143,
        "id": "nctrqh",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "ZM started at around $100 pre covid.\n\nWent as high as $588, and now sits around $300. I think it will eventually fall back below $150.\n\nWhat does the company have to prop up these prices?\n\nPeople are going back to the office soon, and I'm guessing only a fraction of those people will continue to use Zoom. \n\nSome people might be overestimating how much of the work force will be permanently working from home. Companies are probably not going to suddenly give up their real estate.\n\nZoom's 2020 growth can't be extrapolated into future years.\n\nZoom isn't the only video conferencing player out there, so what's so special about it? People were using Cisco and Google Meet or Hangouts before this.\n\n&amp;#x200B;\n\nMotley fools tried to pump ZM on March 16 as it was falling, when it was at $350, and since then it has fallen 23% to $270 the last few days.\n\nWhy are you going long, or shorting ZM ?",
        "subreddit": "stocks",
        "title": "is ZM gonna collapse further, now that the stay-at-home period is coming to an end?",
        "url": "https://www.reddit.com/r/stocks/comments/nctrqh/is_zm_gonna_collapse_further_now_that_the/",
        "created": 1621094943.0
    },
    {
        "author": "cclagator",
        "created_utc": 1621257922,
        "id": "neg759",
        "num_comments": 71,
        "num_crossposts": 0,
        "selftext": "**The Broader Markets**\n\nLast Week – SPY was down by about 4% at one point during the week but closed the week lower by only about 1.5% vs the 1% move options were pricing. The VIX closed at 18.80, but was high as 28 during the week\n\n**This Week – SPY** options are pricing a **1.5%** move (in either direction) for the upcoming week. That corresponds to about **$411** as a *bearish consensus* and **$423** as a *bullish consensus*.\n\n**Expected Moves for This Week** (via Options AI)\n\n* SPY **1.5%**\n* QQQ **1.9%**\n* IWM **2.5%**\n\n&amp;#x200B;\n\n**In the News**\n\nCryptos... Here's a look at Coinbase, Riot Blockhcain and Marathon Digital expected moves\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ttf54gxojoz61.png?width=628&amp;format=png&amp;auto=webp&amp;s=c84ded3bdf4bbadec2915e918be204638340f67f\n\nThe merging of the crypto and stock headlines (via Elon) feels like a thing that's been building up for a while. I'll be fascinated to see how it plays out. TSLA stock has benefitted more than any other big cap stock by merging those two audiences. But now that Elon is picking sides in crypto one would think it changes the dynamic of his cult. (I don't mean literal cult, but it's certainly a cult stock)\n\n**Earnings This Week**\n\nEarnings season continues with reports from box store retailers Walmart, Target and Home Depot, China stocks Baidu and JD as well as tech names Cisco and Applied Materials. (Links go to the Options AI Calendar, free to use), free to search for anything I may have missed here):\n\nMONDAY\n\n**Plug Power** PLUG / [Expected Move: **11%**](https://tools.optionsai.com/earnings/PLUG) / Recent moves: -14%, -8%, +15%\n\n**Tencent** TME / [Expected Move: **8%**](https://tools.optionsai.com/earnings/TME) / Recent moves: +3%, +2%, -1%\n\nTUESDAY\n\n**Walmart** WMT / [Expected Move: **3.5%** ](https://tools.optionsai.com/earnings/WMT)/ Recent moves: -6%, -2%, -1%\n\n**Home Depot** HD / [Expected Move: **3%**](https://tools.optionsai.com/earnings/HD) / Recent moves: -3%, -3%, -1%\n\n**Baidu** BIDU / [Expected Move: **7%**](https://tools.optionsai.com/earnings/BIDU) / Recent moves: -3%, -3%. -6%\n\nWEDNESDAY\n\n**Cisco** CSCO / [Expected Move: **4%**](https://tools.optionsai.com/earnings/CSCO) / Recent moves: -3%, +7%, -11%\n\n**Target** TGT / [Expected Move: **5%**](https://tools.optionsai.com/earnings/TGT) / Recent moves: -7%, +2%, +12%\n\n**JD.com** JD / [Expected Move: **6%**](https://tools.optionsai.com/earnings/JD)[ ](https://tools.optionsai.com/earnings/LMND)/ Recent moves: +1%, -7%, +8%\n\nTHURSDAY\n\n**Applied Materials AMAT** / [Expected Move: **5%**](https://tools.optionsai.com/AMAT) / Recent moves: +5%, +4%, +4%\n\n**Palo Alto Networks** PANW / [Expected Move: **6%**](https://tools.optionsai.com/earnings/PANW) / Recent moves: -2%, +8%, -2%\n\nFRIDAY\n\n**Deere** DE / [Expected Move: **4%**](https://tools.optionsai.com/earnings/DE) / Recent moves: +10%, -2%, +4%\n\n&amp;#x200B;\n\nLet me know what you're trading or looking at.",
        "subreddit": "options",
        "title": "Expected moves this week. SPY, HD, TGT, AMAT, TSLA, RIOT",
        "url": "https://www.reddit.com/r/options/comments/neg759/expected_moves_this_week_spy_hd_tgt_amat_tsla_riot/",
        "created": 1621286722.0
    },
    {
        "author": "AngeloMonharti",
        "created_utc": 1621530718,
        "id": "nh5tbi",
        "num_comments": 59,
        "num_crossposts": 0,
        "selftext": "I have done so much DD on this play and I really want to share it with you guys since WSB is the reason I started investing over a year ago.\n\nIn this post I'm going to not talk about some kind of currency that can get this post removed. Hint: it crashed big time yesterday. You know the one.\n\nThere is a new kind of this currency that uses a lot of computer storage space. How much? Well - 7 EXABYTES and it's currently adding 1 exabyte every 3 days. I'm going to assume you know about this currency and if not you can look through my post history and see which subreddit I've posted to recently involving this particular one.\n\n#Topics of discussion:\n\n* Why WDC is going to moon in the next 2-12 weeks\n\n* WDC Fundamentals\n\n* Bear case\n\n#If you are reading this on May 20th - you are early\n\nWDC just came off one of their best earnings beats in recent memory. WDC was a beaten-down stock in 2018 after NAND (SSD memory) prices declined, and analysts thought that HDDs (spinning disk hard drives) were going the way of the dinosaur. WDC did see a big increase in data center sales and consumer devices (think external drives for work from home setups) during Covid, but analysts priced in declining sales in 2021 as covid restrictions begin to end. By all accounts, it looked like WDC had no future growth prospects and should be some kind of dividend-yielding boomer stock. WDC reported earnings in April for the quarter ended March 31 - with revenues down only 1% compared to the 20% that analysts expected. The EPS was way higher than expected - non-gaap was expected to be around 0.68, and WDC delivered 1.02. The analysts are already wrong and they don't know what else is coming: The new currency thing that I won't name. They didn't even mention it in the earnings call. None of the investors on the line in the Q&amp;A even asked about it. It's totally under the radar. In the next quarter, WDC is going to deliver their biggest earnings beat ever, and they are going to raise their revenue guidance for the rest of the year as a result, possibly by a gigantic, unheard of margin due to the new demand caused by the currency. When this happens, this stock is going to test its ATHs at around $110 per share but I would not be surprised to see a new ATH far above anything in the past. This stock can double, and it's going to happen AT THE LATEST during WDC's next earnings call. This is expected first week of August. \n\n#Fundamentals\n\nWDC is an American company, they have been publicly traded since 1973 and they have been part of the S&amp;P 500 index since 2009. This is a solid company - we are not betting on dog shit turning to gold, we are betting on gold turning to diamond. WDC has like 64k employees, and is vertically integrated in HDDs and SDDs thanks to a long road of acquisitions like SanDisk in 2016. They own their own supply chain, so they can make bigger margins in the event of the inevitable price increases reminiscent of the GPU market thanks to another currency.\n\nWDC is close to fairly valued at the moment at about $70 per share. They saw some spikes to 75+ recently after earnings but it keeps selling off due to WDC suspending their dividend and boomers wanting out, plus S&amp;P indexes falling and selling off here and there. Suspending the dividend is MAJOR good news. This company has been stagnant for a while, but they are ready to expand. They want to be a growth company again, and they are going to get it when they realize increased HDD and SSD demand is here to stay.\n\n#The new reality is not priced in: WDC's TAM market just increased 50% and nobody knows about it\n\nAn industry expert at Forbes, Tom Coughlin, has estimated that WDC shipped 125 exabytes of HDD storage for Q1 2021. Next quarter, they are expected to ship around the same amount. WDC says there is seasonality but I really don't see it in the numbers. WDC owns somewhere about 35-40% of the HDD market, and around 17% of the SSD market.\n\nThe new currency is currently at 7 exabytes and consumes around 300+ petabytes daily at this point. Even after yesterday's events, the profitability is so high that even if it loses 50% of it's value, it's still worth buying HDDs over MSRP. Farmers can buy HDDs at $50 per TB (double the msrp market rate before the rise) and break even in 1 month. This is unheard of in the space. That's how profitable this is. While it's hard to farm solo if you are a small time farmer, it's worth it for the whales and the whales will eat HDDs until a 8TB drive goes for $400. WDC and Seagate are selling every drive they they can possibly make. If we apply WDC's market share to the current size of the network, we are looking at, conservatively, 2.5 exabytes of extra sales that is not expected or accounted for. \n\nLet's look at it another way - with 125 exabytes shipped in Q1, 90 days, that means WDC ships 1.38 exabytes daily. Half of this goes to datacenter clients in long-term contracts, so say 700 petabytes daily. If the new currency is growing at 300 petabytes daily, and 40% of those drives are WDC, that's an extra 17% more demand than anyone so far knows about. If that doesn't seem like a lot, it's because it's massively understated and not nearly as high as it is in reality.\n\nThe network space is a lagging indicator. People buy hard drives ahead of time, and fill them with plots over time. Plotting speed is the bottleneck. Behind that 7 exabytes of networks space is likely 7 exabytes empty space already purchased, waiting to be consumed, or even more. And its not only farmers buying drives - scalpers are buying drives to scalp the farmers too. Go look on amazon and tell me how many drives you see in stock that are bigger than 6 TB. They are sold out. Supply is also a bottleneck - the new currency would grow even faster if they could buy even more storage. For all intents and purposes, that 700 petabytes of storage provided to consumers daily is almost all consumed by currency farmers. If they could deliver double the storage to consumers, at 1.4 exabytes per day, they would probably still sell all of them.\n\nBut wait - there's more.\n\nWDC also makes SSDs, and Seagate does not (Seagate has 0.2% marketshare of SSDs). I didn't think the new currency would have much affect on the SSD market since the are needed in far smaller quantities than HDDs, and the go-to has mostly been enterprise drives by Intel and Samsung rather than WDC. But I was wrong. Just this morning, I was making my rounds on Amazon and noticed that WD SN750s 1TBs are almost out of stock, there are only 2 available. SN750 2TBs are out of stock. SN 850s are sold out. I'll go into why this is significant.\n\nA company called Phison makes SSD controllers. They recently said they are raising their prices 10% due to supply constraints as the new currency has driven up SSD demand. This is a big indicator that the SSD demand is actually super high. You know those SN drives I talked about earlier almost being out of stock? Yeah, WDC makes their own controllers for those. They don't need Phison. If other manufacturers have to buy more expensive controllers, WDC can just raise their prices and make that profit themselves. SSD demand is certainly less than HDD and it's lagging behind HDD, but an NVME SSD drive shortage could be right around the corner. The new currency is very intensive on the SSDs and they are destroyed quickly, so buying NVMEs are not one-time purchases, they are like the gas the fuels the car. They will need to be purchased as more and more HDDs are purchased continually.\n\n#Bear case\n\nNobody likes bears so I will address the risks quickly. The obvious risk is that the new currency is over priced and will either die out completely or crash to the point people will stop buying HDDs and the demand will only be a momentary spike in the rear view. I strongly do not believe this is the case and I think yesterday is a good test that shows that even under extreme pressure, the new currency is well positioned and strong. It's not going to 0 because of a market crash. I can go far into detail into why I believe this new currency is here to stay, and the demand will persist for potentially years, but I would have to say enough words that I think this post will just be removed.\n\nThe second risk is that NAND flash memory continues to decline in price. Since the pandemic the price has gone up, as datacenters are forced to expand, but I think the effects of the pandemic are not going to end any time soon and in fact that there will be no return to normal at all. I believe work from home is just going to be part of the future regardless of covid, which means more network and more servers and more data is going to be needed. I think the analyst expectation that revenue would collapse in 2021 as the pandemic ends and being surprised that it at least remained flat is going to be wind in WDC's sails even apart from the new currency's affects.\n\nThe third risk is management not dealing with the new currency demand well. If they are really bearish on the currency, they may not raise supply enough to capitalize on the increased demand. They may think the demand is temporary and they will be left with oversupply if they ramp now. David Goeckeler became CEO of WDC last year and he's got a background in tech of course, but more specifically in Cisco. He is known for transformational leadership and I think that shows with his decision to suspend the WDC dividend. If he is looking to transform WDC, I think this is the perfect opportunity for him. \n\n#Summary TL;DR\n\nHDD demand has sold out everything there is to sell out. Price increases are imminent, and SSDs could follow soon. All of this is due to a new currency that uses HDDs and SSDs, which is currently so profitable that whales will continue to buy them even at 30, 50 or 100% premiums. None of this was accounted for in WDC's most recent earnings call, and the price has not reacted to it yet. This thing is a ticking time bomb. WDC was already on track to a better than expected 2021 and this will launch it to interstellar space.\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀Positions🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\n[157 shares (Canadians unite!)](https://i.imgur.com/6y4p3ax.jpg)\n\n[1 leap Jan '23 70c](https://i.imgur.com/SAqvMhA.jpg)\n\nI believe that this trend is lasting all year and we are going to $150+. If you want to make a short term play and go balls deep I recommend July or October calls for 80-90c. If WDC's next earnings are the catalyst, the July calls may not be the best value, but there is a pretty good chance that the market will wake up and see that WDC is killing it well before the first week of August. If you are a real smooth brain ape, you can't go wrong with shares. There is virtually no downside risk, WDC was already turning heads this year even without the new currency. STONKS ONLY GO UP",
        "subreddit": "wallstreetbets",
        "title": "Western Digital Corp ($WDC) DD - Why 2021 is going to be their best year ever and nobody knows about it yet",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nh5tbi/western_digital_corp_wdc_dd_why_2021_is_going_to/",
        "created": 1621559518.0
    },
    {
        "author": "IcyRag3",
        "created_utc": 1620423719,
        "id": "n79si3",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "Hello fellow OTCers',\n\nBelow is my first Reddit due diligence attempt... this is a company that I believe has tremendous growth potential and is severely misunderstood. Incubation/Acceleration companies can be difficult to understand, so I thought if I could write it out piece by piece it would help myself and fellow potential investors. Enjoy your weekend!\n\n**FOMO CORP. ($FOMC)**\n\n[**https://www.fomoworldwide.com/**](https://www.fomoworldwide.com/)\n\n**Executive Summary**\n\nFOMO CORP. is a publicly traded company focused on business incubation and acceleration. The company invests in and advises emerging companies aligned with a growth mandate. **FOMO CORP. is building an “eco-system” of businesses which will work together in providing disinfection, energy efficiency, smart lighting, and system integration.** FOMO CORP. is current regarding SEC reporting requirements as a 1934 Securities Exchange Act company and is up to PCAOB auditing standards.\n\n**Out with the 2050 Motors, in with the… FOMO CORP.?**\n\nTo get acquainted with the firm, how about a little origin story? Great. All below information is consolidated from their 2020 10-K.\n\n*“FOMO CORP. previously known as “2050 Motors, Inc.” (“the Company”) is the successor to an entity incorporated on April 22, 1986 in the state of California. 2050 Motors, Inc., the Company’s sole operating subsidiary from 2014-2019, was incorporated on October 9, 2012 in the state of Nevada to import, market, and sell electric cars manufactured in China. In 2019, management dissolved the Company’s Nevada subsidiary as the electric vehicle (“EV”) strategies had failed.*\n\n*On March 6, 2019, Vikram Grover was appointed the President, Chief Executive Officer, Chief Financial Officer, Secretary and Director.*\n\n***On April 4, 2019, we removed all Officers and/or Directors of our wholly owned subsidiary, 2050 Motors, Inc., a Nevada corporation (“2050 Private”); thereafter, 2050 Private appointed our Chief Executive Officer, Vikram Grover, as 2050 Private’s President and Sole Director. On May 14, 2019, we dissolved our 2050 Motors, Inc. Nevada subsidiary and terminated all discussions and contractual relationships with Chinese manufacturers. On December 16, 2019, we changed our company name to “FOMO CORP.” with the Secretary of State of California on the SEC’s EDGAR system.***\n\n*On November 17, 2020, an application was submitted to FINRA to change the name and ticker symbol from 2050 Motors and ETFM to FOMO CORP. and FOMO, respectively. Subsequently, FINRA stated that the “FOMO” ticker symbol was no longer available, and a new ticker symbol was requested.* ***As of December 30, 2020, the Company was current with its financials.****”*\n\n**Current Capitalization**\n\n* Common Shares: 5,443,861,492 outstanding, 10 billion authorized.\n* Series A Preferred: 5,500,000 outstanding; convert 1-50 into common, vote on an as-converted-basis and pay a $0.035 per share annual dividend in kind or in cash, 78,000,00 authorized.\n* Series B Preferred: 4,938,815 outstanding; convert 1-1000 into common, vote on an as-converted-basis and pay a 1% annual dividend in kind or in cash, 20,000,000 authorized.\n* Series C Preferred: 1,000,000 outstanding; convert into 1-1 into common, vote on a 1-100,000 basis and pay a 1% annual dividend in kind or in cash, 2,000,000 authorized.\n* Convertible debt: Aged variable debt including principal, interest &amp; penalties: $2,286; Jan 2021 redeemable convertible debenture: $205K.\n\n**2020 and Subsequent Accomplishments**\n\nAlright, so FOMO effectively took over a company with dirty baggage. Here is a little of what has been accomplished since:\n\n* Filed all SEC Forms 10-K/10-Q to **regain “current” status as a fully reporting company.**\n* **Restructured balance sheet to eliminate several hundred thousand dollars of corporate liabilities with legacy lenders.**\n* Raised new capital to launch growth strategy, beginning with **acquisition of Purge Virus, LLC** on October 19, 2020.\n* Named Advisory Board consisting of veteran business leaders and in adherence to best practices in Environmental, Social, and Governance (ESG) standards and protocols.\n* **Eliminated all default debt effective March 31, 2020,**\n* Closed **acquisition of assets of Independence LED Lighting, LLC** to move into smart lighting and power over ethernet (“PoE”); [www.independenceled.com](https://www.globenewswire.com/Tracker?data=Ke6XKGt_XMq2syxpFlGG13zWP7e1o6toXdtCBCg6YyA6rq7v3sPtM8f4Jg--V__0mZV3pbYveX-Z7IGVCvIIfVmKtestdCqlLkuDxdIemrw=)\n* Closed **acquisition of assets of Energy Intelligence Center, LLC (“EIC”)** to target energy management services for commercial, industrial and government buildings; [www.energyintelligencecenter.com](https://www.globenewswire.com/Tracker?data=Ke6XKGt_XMq2syxpFlGG17aGixnjOcDGna7FByIZzqsyi7Eazf7cDMOaNMsJaDVSQG1wJYnKrjuNGyjSqPa4RO7A5nqBPZZtVYEaueTRY4B0VK-AgK_aqiq60dgkezSq)\n* Formed **strategic partnership with Online Energy Manager, LLC (“OEM”)** to obtain a license to OEM’s root patent for smart energy software for chiller plants in non-residential buildings with a purchase option for some or all of OEM; [www.oem.us.com](https://www.globenewswire.com/Tracker?data=Ke6XKGt_XMq2syxpFlGG1942zQzBRtKmi0H5mIU0MBvrS5Jx9r7Y69JSH58IUEFYlVUJaAkIG_1oIFX2V1UzIQ==)\n* Signed **letter of intent (“LOI”) to acquire Ecolite Holdings, LLC** for preferred stock, cash, and notes; [www.ecoliteled.com](https://www.globenewswire.com/Tracker?data=Ke6XKGt_XMq2syxpFlGG102jlfhyB4rXyTt2q1z9XbMb3GsXfNde-bE1wBTyLYhsuS2TkEthLfaHCuWCK50dZA==)\n* Signed **LOI to acquire SmartGuard Solutions consisting of LED funding IV and Lux Solutions, LLC** for preferred stock, cash and notes moving into lighting as a service (“LaaS”), energy audits, project design/engineering, and related; [www.smartguard-solutions.com](https://www.globenewswire.com/Tracker?data=Ke6XKGt_XMq2syxpFlGG15BYbeleB48V372728-jUDqSFs_Y9pRESQo_aiTqiYHLGhTBWrOD-wvk1kNGt-uvU3oLlqA_W1LueajIRxXAUSHPMrlo5nVRf6upbjI9PZyb) and [https://www.luxsolutions.com/](https://www.globenewswire.com/Tracker?data=QXBbXpg_fOMAxA17ph6m9VcceXhqt-kgb64ut3EAcM5ory-joXTtEOyAPiQMTBsFUwkMIRjRBYJ4K9DzxPgUqGl8bW0I-ZoGNX5TzsS9IAw=), respectively\n* Signed **LOI to acquire a national HVAC services contractor** (extended to July 1, 2021) to add go-to-market installation capabilities and cross-selling synergies with other portfolio companies; target is currently under national rebranding;\n* Announced **channel partnerships with AGILE Technologies Group, LLC and Clean Peak Energy, LLC** to target their respective commercial and government customers with its growing clean building ecosystem of companies; [www.4agiletech.com](https://www.globenewswire.com/Tracker?data=Ke6XKGt_XMq2syxpFlGG18s_Gr3yh4VQPrriBY_3bkMSX5A1itUNoO76yS1AkTHIEs-8prGULsuRIUR-ZvHsMw==) / [https://cleanpeakenergy.us](https://www.globenewswire.com/Tracker?data=QXBbXpg_fOMAxA17ph6m9e3yFQcovWH-TUDg084yzjfIkwOi2hl8fykqQYOsBHRvNKXYzxdKHzgvKixrbTi7bQ7eRFRhPUzI_9vd0KW3hR4=)\n* Signed a **term sheet for $500,000 equity financing with a qualified institutional buyer (“QIB”), Triton Funds LP, in the form of restricted common stock and common stock purchase warrants.** Use of proceeds include working capital and expenses to close announced and planned mergers and acquisitions.\n* **Applied for uplisting of its common stock to the OTC QB markets.** The Company believes OTC QB uplisting, if approved subject to exchange requirements, will expand its addressable investor base and provide a more efficient market for its common stock, though there are no assurances.\n* **Exposure to hundreds of thousands of industry subscribers through 2021 publishings in the Mann Report, Manufacturing Technology Times, and Properties magazine.**\n* Planting the seed, Philadelphia-based Laboratory School of Communication and Languages engaged Independence LED Lighting for energy efficient perimeter lighting which enhanced the school’s security.\n* SmartGuard Energy, currently under a Letter of Intent for acquisition by FOMO CORP., has recently been **awarded a contract by one of the largest hospitality and gaming entities in the world. The contract is expected to generate over $20 million in revenue over the next few years and is structured around energy project management and technical services and opens the door for many more opportunities with this high-profile customer.**\n* As of March 1, 2021, FOMO Corp. new office headquarters will include over 10,000 sq ft of conference areas to expand our ability to ramp up sales and training for indoor air quality and energy efficiency.\n* **Signed a $10 million financing term sheet with an institutional investor. The fund has committed funding in an equity structure that allows FOMO to obtain capital on its own terms and at its discretion, unlike variable structures of the past.**\n* Increased **branding exposure** with the addition of new website addresses that link into the **FOMO “gear” Shopify store**. The website links align with the forthcoming updates on the gear for I GOT FOMO, I HAVE FOMO, FOMO SHAREHOLDER, and others.\n* **As FOMO has grown, the interconnectivity of the holding companies within its clean technology “eco-system” has expanded. A newly established FOMO Corporate Communications Committee (F-C3) is charged with setting the protocols for all forms of public outreach including press releases, social media, and the D!sc rd shareholder chat room.** The F-C3 members include FOMO’s EVP of Corporate Development and Investor Relations, Wayman Baker, two of FOMO’s Strategic Advisors, Andrea Breaux and Charlie Szoradi (Purge Virus CEO), and two of FOMO’s consultants Dwain Scheck ([https://schenckstrategies.com/](https://www.globenewswire.com/Tracker?data=AUqtS33ZvDVyLfJwqAip06cT_Ly7cy_7IqSylNnNE9AH6XG4dK5ryhaS5dnTgq-9dapC9SpjwF_O8Cxa-SAg2EQ042GFA6AJCQSBWP03TTYiIN4eZeLx74YYvX5FSWbA)) and John Conklin ([https://www.linkedin.com/in/john-conklin-a3307b24/](https://www.globenewswire.com/Tracker?data=AUqtS33ZvDVyLfJwqAip09G5U2OmN9qaqYejhwgxNu7b-dDyQaSoqdeqgs_IL4bT2kDw2Jtdsu0KwyrPraoepi0kK6YJNukkt2gp_-x8-2IC7Xyz-vTflmWRFGcWCaIY4NP1qMdanHopaY51lYHuDUWuM5finek19ozx5kjK7Rg=)). F-C3 will meet weekly to prepare the outline of the upcoming communications activity to present to FOMO’s Advisory Board for review, guidance, and approval.\n\n**The “Eco-System”**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/rwa6lndzprx61.png?width=952&amp;format=png&amp;auto=webp&amp;s=6654443ee262b28e8f43a61546e9a44226133ea3\n\n* **Disinfection Solutions**  \n\n   * Purge Virus (DA - closed)  \n\n      * Completion of six figure revenue disinfection technology project for ten (10) buildings at Navajo Tribal Park and Veterans Museum in Window Rock, Arizona. A case study may be accessed here: [https://purgevirus.com/bipolar-ionization-case-study-highlights/](https://www.globenewswire.com/Tracker?data=tmqB1IcykmDSLNK8rsAvNoiRSL7u6pMzuOU6rsSzPcemBP5pjy25yPhAKvN3rDcgqEz1zF9a4MCwkgcXD7yP5KJUoHSg2-cIrDHO9JdbAIWED0bD5Azq6OvU1nx8pEy0U-yJBv7ePMCp8vbSU7FSc1HCBSIm2rOUNJTTtHWoB91CZ8FXG3m4FhPzIJhUvuZGAaSpCFNPH81HZPvGWQ3wyg==)\n      * Completion of disinfection technology for a women’s conference in Cancun, Mexico. Air Purification technology was provided by Purge Virus, including multiple portable devices that utilize advanced germicidal disinfection that combines Ultraviolet light with Ultrafine Particulate HEPA-Rx Filtration, Activated Carbon Filtration, Hydroxyl Radical Reactivity Chambers and Revitalizing Negative Ion Chambers. The highlight video of the event is on the Purge Virus YouTube Channel. (Direct link: [https://www.youtube.com/watch?v=\\_3NGqq1jBeE&amp;t=18s](https://www.globenewswire.com/Tracker?data=tmqB1IcykmDSLNK8rsAvNvwa5yMxbi28TdTihnSPrwxb_Z89nHZ05WOOG7-KIlFwWgkXp-Iekvymhqy_YYRCBTIJ3GjraZD0_t9GZFvAu9zr6C8s7rMVt0cMc1h0ciJrSYm3nD06SgaF9yVosBieERXmDI7zahvv5Scth0-TX40=)) and the video’s description includes the combination of the disinfection with COVID-19 rapid testing by Agile Technologies Group.\n      * Engagement with FASTSIGNS for “Clean Air!” marketing and disinfection of the location in Exton, PA., which potentially could lead to more work across the 700 U.S. FASTSIGNS locations. Media coverage is available here: [https://greenandsave.com/green\\_news/green-science-and-technology/clean-air-key-reduce-spread-covid-19-indoors](https://www.globenewswire.com/Tracker?data=tmqB1IcykmDSLNK8rsAvNvl1SNjyp05HT7gK_NLX-24Mq_mIQVxeiwhXHdueYQaISCxEvzmZOZ004-htffE8F954wLXYXqLSGTMSxSVSTYvLrah4soRjuCLraV3NBhop0XpNdz4TSi0LkQwC4rfVPaY_DB9uhrmsKPvGUPDdiAARbw7MKcuxuogaFbb37oY1pBUqKQP9EnNzJA39DtSSt2DReRAOqRhwueJ-iAboTEdEcmaFaseHsqsFMO3qMze-5QwGPpYrF44HbjD8BdOCLBr9ynpbouI_yIQbRZ0ecsk0eG7jJB8_D3poWK-RHtXX).\n      * Senior Living: On March 11, 2021, Purge Virus received a bipolar ionization order for air disinfection at a large senior living condominium community, including disinfection for among other areas, the indoor swimming pool and the fitness center. This could lead to many more projects, given that the management team for the condominium community services hundreds of other properties.\n      * Disinfection Products and Services and PPE:\n   * PPESI (LOI – July 1, 2021)\n   * WorkMerk (Partnership)\n   * Agile Technologies (Partnership)\n* **Energy Efficiency**  \n\n   * Energy Intelligence Center (DA - closed)  \n\n      * On Wednesday March 10, EIC hosted the FIVE STAR SOLUTION webinar on Safe and Efficient Buildings. The 26-page presentation download and the 40-minute video recording may be accessed here: [https://energyintelligencecenter.com/clean-tech-webinar/](https://www.globenewswire.com/Tracker?data=tmqB1IcykmDSLNK8rsAvNn-5xx-w40mbc9_w30byZPiW5R3N-9k0v0U-v5o-FOn1dcxxhU92cYOxZRKKK0xpOkaHGIO6XtfPwOTNz5aG9y75ybIItrDYPM_tfnugdMmAYq3g_AdBN_ZNH7BclqLHUqSBCel2GYJHsu7OuakW03F4V8-zOM5jtiSk_A-cDMvW)\n      * EIC added a new strategic clean tech partner to its growing solutions roster. The offering includes nanotechnology to reduce oil fouling in commercial and industrial chillers to save 15% or more on energy. See: [https://energyintelligencecenter.com/clean-tech-partnerships/](https://www.globenewswire.com/Tracker?data=tmqB1IcykmDSLNK8rsAvNn-5xx-w40mbc9_w30byZPiW5R3N-9k0v0U-v5o-FOn1MCVK9J115bCr_VjikJ-fG_yIuBsCDQeyg3O3gMw45-GmZFEY6CCGjDR_LbtLbVdxUiCLdkPLFx4bKxF9N7HjzmKFSZ0hyfpBdMPnMoioijIq10LQaiUfvd5vBNA1X-Hi)\n      * Manufacturing Technology Insights magazine ([https://www.manufacturingtechnologyinsights.com/](https://www.globenewswire.com/Tracker?data=tmqB1IcykmDSLNK8rsAvNtXDQ7ArbTJlZFlBwHn_rEDuhsZ_YIRMbXBw5IVw8oWCuZp6wEyInAiY-MB0uzE4yo-mg0FlOCAufSk7F0bdi1iBfevT_SzZYkRhGXZ5DgS0R2BNP-q0WLSXZwh3tl2Pqvgt9YiiTaxQneu6RFkdQrU=)) is including EIC on its magazine cover with an extensive profile for its Industrial Cooling issue in May. The editorial team chose EIC, after interviewing EIC CEO, Charlie Szoradi.\n   * Clean Peak Energy (Partnership)\n   * Online Energy Manager (Partnership)\n   * Building Fit (Partnership)\n* **Smart Lighting**  \n\n   * Independence LED Lighting (DA - closed)  \n\n      * New Grow Light account: Independence LED has had a multi-year relationship with an indoor farming company that focuses on basil production. They have ordered Independence grow lights for five different locations over the years and this recent request is to expand their farm in Maryland.\n      * Independence LED engaged with a new prospective wholesale buyer who seeks “Made in USA” fixtures that meet the U.S. government’s Buy American Act (BAA) compliance.\n      * Significant previous contracts: Walter Reed Hospital LED retrofit, U.S. Navy hospital ship, VA hospital. ILED is on the GSA schedule - important for future revenues.\n   * EcoLite (LOI – July 1, 2021)\n   * Smartguard Energy (LOI - 51% May 31,2021 – 49% by December 31,2021)  \n\n      * § LED Funding/LUX Solutions (LOI)\n* **System Integration**  \n\n   * National System Integrators (LOI – July 1, 2021)\n   * Kanab Club (under development)\n\n**Who’s Who at FOMO**\n\n&amp;#x200B;\n\nhttps://preview.redd.it/eyhae5i0qrx61.png?width=995&amp;format=png&amp;auto=webp&amp;s=24caaa529b6f47de434ff41a429d9c0a2d9d4bc2\n\n**Vik Grover, President &amp; CEO.** 25 years of experience on Wall Street as an equity research analyst, investment banker and consultant; has been advising, financing, and launching businesses for several years. He was introduced to the founder of Purge Virus three years ago.\n\n**Charles Szoradi, CEO of Purge Virus, LLC Subsidiary &amp; FOMO Advisory Board Member.** Architect and building intelligence executive with 28 years of experience in sustainability and cost-savings for building retrofits and new construction. His two most recent pending patents for Purge Virus focus on advanced in-duct and tabletop disinfection to help reduce the spread of COVID-19 and future viruses. Mr. Szoradi focuses on high performance architecture and is a LEED AP (Leadership in Energy and Environmental Design – Accredited Professional), a Certified Building Performance Institute (BPI) Energy Auditor, a member of the Energy and Sustainability Committee for the Society of American Military Engineers, and the Leadership Council Chairman of the American LED Alliance.\n\n**John Kelly, Founder and CEO of PPE Source International, which is Purge Virus’s partner for PPE.** Mr. Kelly is also CEO of EcoLite, a leader in LED lighting. Mr. Kelly has a multi-decade history of running successful companies. Driven to find the best manufactured PPE products, HVAC solutions, &amp; specialized energy control system, he has become one of the industry leaders in the energy and sustainability space.\n\n**EMPLOYEES &amp; FACILITIES:**\n\n20 FT employees / 10-99’s\n\nHQ: FOMO - Chicago, IL\n\nHQ Purge Virus – Philadelphia, PA\n\n**LEGAL COUNSEL:** Fred Lehrer, Esq.\n\n**TRANSFER AGENT:** Signature Stock\n\n**SEC FILINGS (XBRL) SERVICE:** M2 Compliance\n\n**Auditor:** Boyle CPA, LLC\n\n**Comments from the CEO**\n\nVik Grover, FOMO CEO, commented: “We relaunched FOMO in 2020 with the intent to build and maintain a valuable public company platform to fund, incubate and integrate growth businesses. We announced our first transaction when we acquired Purge Virus (“PV”), LLC in the second half of the year, and we recognized a small amount of revenues in the fourth quarter from the business. This was just the first step, and as we have previously announced in 2021, we are moving closer to our objective of being a one-stop-shop to provide the market with commercial building management services that save money and promote healthy living through smart/digital LED lighting, disinfecting and maintenance, and HVAC solutions. We expect to soon have the products, engineering, and installation services as well as financing capabilities for business, industrial and government customers.”\n\n“As we have built this platform, we have tried to provide the maximum level of transparency of our strategy and each transaction we have pursued, through SEC filings, our website, and social media, and we believe there’s a great message not yet being recognized in the marketplace for our company. Further, our Advisory Board includes talented and experienced leaders in technology, construction, LED, and corporate finance, and reflects a culture of that is committed to being consistent with the ESG initiatives that FOMO is all about.”\n\n“Upon completion of the above transactions which had a combined revenue of \\~$11 MM in 2020, we will be in a position to recognize strong pro forma 2021E revenues based on current bookings alone, excluding sizable project already underway, in clean buildings, energy management, disinfection, and other verticals.”\n\n**Looking Ahead - Strategy and Goals**\n\n“Over the next several years, FOMO intends to focus primarily on the “mission critical” market of Clean Technology. “Clean-Tech” is lucrative, and the demand is increasing given the rising concerns about climate change and the need for economic sustainability. FOMO’s current and possible future companies have demonstrated the energy savings that lower monthly utility bills, which typically serve the U.S. and its territories and international accounts upon request.”\n\nFun Facts\n\n* Global market for energy efficiency is $360 billion/year per Smartcities\n* Biden administration, subject to successful legislation, plans to upgrade 4 million buildings for energy efficiency. $2.3 Trillion of the $4T Economic plan is projected to go to infrastructure development.\n* More than 76% of all U.S. electricity and over 40% of greenhouse gas (GHG) emissions are from buildings according to the U.S. Department of Energy\n\nGoals\n\n* **Contracts. Revenues. $$$.** Each acquisition comes with potential for increased cost synergies and marketing opportunities. Lighting as a service and disinfection as a service are **recurring revenue streams. Per FOMOHour (a weekly chat with the CEO and Investor Relations team), several deals are currently in the works (no assurances). I cannot stress how large this untapped market is.**  \n\n   * Example: Purge Virus and CEO Charlie Szoradi are aggressively pursuing sales. Efforts include their disinfection Webinar and utilizing paid market research data on product purchases at major sites (schools and government agencies).\n   * Here is a rough sales proforma based off data from investor decks. It's important to note this doesn't account for what I believe to be 'extraordinary growth' over the coming year or two.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hmfu7vk1qrx61.png?width=1408&amp;format=png&amp;auto=webp&amp;s=adfe72aa16c4b858a8934f7a85c7e98d274d1334\n\n* Acquire EcoLite Holding LLC (“EcoLite”) and PPE Source International LLC (“PPESI”); definitive agreement extended to July 1, 2021 and the exclusivity period to negotiate the purchase of PPESI to same.\n* **Acquire some or all of SmartGuard’s disinfection business and robots as a service (“RaaS”) unit** ([www.smartguard-disinfection.com](http://www.smartguard-disinfection.com/)).\n* Strategically integrate Kanab Club 2.0 as a health and wellness community... by “growing a user base through that effort and then developing an e-commerce portal for cannabis products and adding other features in the future. We have an excellent development team working on Kanab Club with functionality that is Facebook-like.” - FOMO Investor Relations.\n\n**Risks**\n\nPrior to many of these acquisitions, the major concern was typical of formerly defunct OTC companies. Armed with a new ticker, transparent leadership team, and an abundance of strategic acquisitions, **the primary concern is landing contracts** (revenues). We can only ascertain so much about each subsidiary’s cost structure… and I don’t want to belittle the importance of cost accounting. However, revenue generation is what will launch FOMO to the national/international stage. Future earnings reports will provide margins needed to analyze a detailed cost structure. **A secondary concern is strategic implementation of the various subsidiaries in the ecosystem.** A bunch of acquisitions look pretty on paper, but how do they synergize? The advisory team recently hired a consulting firm… I’m excited to see what is in store.\n\n**Brief Market Research**\n\nInterestingly enough, I have not found a true business incubation company similar to FOMO Corp. Below are some news pieces of market research and companies that operate in the same space as FOMO’s subsidiaries. **Over the coming days/weeks I will provide a more technical DD with price targets and stock/firm valuations.**\n\n* enVerid Systems\n* SecureAire\n* Kanopi by Armstrong Ceilings\n* Virexit (PVDG @ 0.03) - strategic position is similar to Purge Virus\n* Greenbank Capital (GRNBF @ 1.45) - acquisition of CodiKoat which has a strategic position similar to Purge Virus  \n\n   * [https://greenbankcapitalinc.com/greenbank-capital-to-acquire-significant-stake-in-globally-important-covid-killer/](https://greenbankcapitalinc.com/greenbank-capital-to-acquire-significant-stake-in-globally-important-covid-killer/)\n\nDisinfection\n\n“With 87BN square feet of non-residential property in the US and an average cost of $0.23 - $0.50 per square foot for in-duct disinfection, the market size for UV lighting and deionization solutions is an estimated $20BN+ in the U.S. alone. The PPE market – masks, gloves, gowns and related - is multiple billions of $ per year.”\n\nSmart Lighting\n\n“The **top 10 companies** in the market occupied **52.26%** of the market share in the global smart lighting market. **Major players in the smart lighting system market include** Schneider Electric SA, Cisco Systems Inc., Honeywell Inc., Signify Holding (Philips), and Eaton.\n\nThe global smart lighting market reached a value of nearly **$11.06 billion** in 2020, having increased at a compound annual growth rate (CAGR) of **12.1%** since 2015. The market is expected to grow from $11.06 billion in 2020 to **$22.57 billion** in 2025 at a rate of **15.3%**. The smart lighting market growth is then expected to be at a CAGR of **14.3%** from 2025 and reach **$43.97 billion** in 2030.\n\n**North America** was the largest region in the global smart lighting market, accounting for **36.7%** of the total in 2020. It was followed by Western Europe, Asia-Pacific and then the other regions. Going forward, the fastest-growing regions in the smart lighting market will be **Eastern Europe** and **Africa**, where growth will be at CAGRs of **29.1%** and **27.1%** respectively. These will be followed by South America and Middle East where the markets are expected to grow at CAGRs of 25.9% and 21.7% respectively.”\n\n**That was a lot. What’s the bottom-line for us investors?**\n\nI hear you. Having invested in OTCs for a couple years, I can confidently say FOMO Corp. is a diamond in the rough. **The firm is situated in an incredible space, with strategic growth lines in multiple trending 2021+ markets: disinfection, energy efficiency, and clean technology**. **One subsidiary in particular, Purge Virus LLC, has game-changing patents to easily disinfect air and surfaces.** Moreover, **FOMO operates at an elite tier of transparency** (especially in OTC land) and continues to provide updates in the form of acquisitions, debt removal, and financing. For those of you who invested or maybe missed out on other stocks like BNGO, ALPP, TSNP, ABML, MVIS, ZOM, etc… you can certainly appreciate the incredulity of being on the ground floor of a legitimate company.\n\n**Thank you for your time - I appreciate any and all feedback. I also want to thank Hallie for helping me compile this DD.**\n\nDISCLAIMER: This is not financial advice. I hold a long position in FOMO Corp. (OTC: FOMC). Do your own research.",
        "subreddit": "pennystocks",
        "title": "FOMO Corp. ($FOMC) Initial Due Diligence - High Growth Firm in Disinfection, Energy Efficiency, Smart Lighting, $$$. (Part 1 of 2)",
        "url": "https://www.reddit.com/r/pennystocks/comments/n79si3/fomo_corp_fomc_initial_due_diligence_high_growth/",
        "created": 1620452519.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621209195,
        "id": "ne1fla",
        "num_comments": 55,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 5) - $HD, $WMT, $TGT, $LOW, $CSCO, $GOEV, $XL, $SE and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 5 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is slowly coming to an end, so this weeks spreadsheet is a little smaller than prior weeks, but that's alright, there's still money to be made.\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **Expect larger moves coming out of retailers this week**. Home Depot, Lowe's, Walmart, and Target all have fairly conservative historical moves, but will likely break trend this earnings. Last quarter was fucking *massive* for these retail giants, as the holidays combined with stimulus cheques will likely lead to insane profits among them. Expect a large move to happen for each corresponding retailer, to either the upside or downside.\n\n&amp;nbsp;\n\n- **Lots of Chinese tech companies report this week.** If you're looking for a fun little collateral play, you can take a look at various Chinese tech ETFs and paly options on them. The IV on the ETFs is general lower than the ones on the individual tickers, although most of the tickers move in tandem with one another. If one beats, they usually all beat, and vice versa.\n\n&amp;nbsp;\n\n- **Don't fall for the Solar trap**. Solar has been heavily beat down all throughout earnings season, and as a result you may be inclined to buy Puts. Canadian Solar and Maxeon Solar have both slid extremely far following the movements of their peers throughout earnings, and are likely primed for a reversal. There isn't much farther for these stocks to go down, and as a result, a terrible earnings for both of these companies is already priced in. If they even match estimates, or put up a beat, they will likely move upwards. This exact situation occurred with Nikola two weeks back. I would look to play a neutral to bullish strategy on these tickers.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 50 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 5) - $HD, $WMT, $TGT, $LOW, $CSCO, $GOEV, $XL, $SE and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/ne1fla/historical_post_earnings_moves_mega_compilation/",
        "created": 1621237995.0
    },
    {
        "author": "jschulz00",
        "created_utc": 1621720535,
        "id": "nit41b",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "New guy question here- I recently decided to join the terrifying world of stock investments. My wife and I are about to pop out our first child (2 week countdown!) so I figured it was time to start paying closer attention to how my money works for me besides just our 401k. So I did the only (?) logical thing and put $10k on a variety of safe stocks. Microsoft, Amazon, Google, FB, Target, Walmart, Cisco, TMS, PayPal, Square, Applied Materials, Crowdstrike. Yes clearly I work in IT. Companies that are established and would generally be considered, at least from a company success perspective, low risk. And then I proceeded to lose a few hundred bucks in my very first day yesterday. Now I get that stocks are a long term investment. I’m not trying to make a quick buck, day trade or participate in options speculation. I also am aware of the rule don’t bet what you can’t afford to lose. I can zero all of it without an issue…this is a starting point for me. Nonetheless, the results last week left me feeling a little depressed and kind of wanting to take my ball and go home. Can anyone please point towards some good resources to learn more about how to be smart about this? I’ve been lurking here for a long time but it’s hard to tell sound advice from more meme-based advise. To give you an idea how much I don’t know, I almost bought a Motley Fool subscription before reading comments on here about their service. Help my baby please! She wants to go to a good school. \n\nThank you in advance!!",
        "subreddit": "stocks",
        "title": "Life planning via…Reddit and whatever apes are???",
        "url": "https://www.reddit.com/r/stocks/comments/nit41b/life_planning_viareddit_and_whatever_apes_are/",
        "created": 1621749335.0
    },
    {
        "author": "jq419",
        "created_utc": 1620304131,
        "id": "n664o9",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Hi team,\n\nATM LEAP for PMCC + PMCP and keep writing call and put weekly or monthly.\n\nIn case if either side short become ITM, then the the call or put LEAP would kick in to cover that. Since it's covered, it will be exercised and cash-in the LEAP.\n\nOnce either side is cashed-in, close the other LEAP as well and open another ATM LEAP for PMCC + PMCP. The loss of the OTM LEAP would be pretty much covered by the other one, I believed?\n\nIs this a workable approach with low beta stocks (e.g. Costco, Cisco, etc. I know high IV would be fatal for this)? Thank you very much in advance for your insight!\n\nCheers~",
        "subreddit": "options",
        "title": "Just want to hear your insight",
        "url": "https://www.reddit.com/r/options/comments/n664o9/just_want_to_hear_your_insight/",
        "created": 1620332931.0
    },
    {
        "author": "themainvillian",
        "created_utc": 1622205360,
        "id": "nmwwbg",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "\n **Mods do not delete, this is important to me, please read**\n\n&amp;#x200B;\n\nI was in my early teens during the '08 crisis. I vividly remember the enormous repercussions that the reckless actions by those on Wall Street had in my personal life, and the lives of those close to me. I was fortunate - my parents were prudent and a little paranoid, and they had some food storage saved up. When that crisis hit our family, we were able to keep our little house, but we lived off of pancake mix, and powdered milk, and beans and rice for a year. Ever since then, my parents have kept a food storage, and they keep it updated and fresh.\n\nThose close to me, my friends and extended family, were not nearly as fortunate. My aunt moved in with us and paid what little rent she could to my family while she tried to find any sort of work. Do you know what tomato soup made out of school cafeteria ketchup packets taste like? My friends got to find out. Almost a year after the crisis' low, my dad had stabilized our income stream and to help out others, he was hiring my friends' dads for odd house work. One of them built a new closet in our guest room. Another one did some landscaping in our backyard. I will forever be so proud of my parents, because in a time of need, even when I have no doubt money was still tight, they had the mindfulness and compassion to help out those who absolutely needed it.\n\nTo Melvin Capital: you stand for everything that I hated during that time. You're a firm who makes money off of exploiting a company and manipulating markets and media to your advantage. Your continued existence is a sharp reminder that the ones in charge of so much hardship during the '08 crisis were not punished. And your blatant disregard for the law, made obvious months ago through your (for the Melvin lawyers out there: alleged) illegal naked short selling and more recently your obscene market manipulation after hours shows that you haven't learned a single thing since '08. And why would you? Your ilk were bailed out and rewarded for terrible and illegal financial decisions that negatively changed the lives of millions. I bought shares a few days ago. I dumped my savings into GME, paid my rent for this month with my credit card, and dumped my rent money into more GME (which for the people here at WSB, I would not recommend). And I'm holding. This is personal for me, and millions of others. You can drop the price of GME after hours $120, I'm not going anywhere. You can pay for thousands of reddit bots, I'm holding. You can get every mainstream media outlet to demonize us, I don't care. I'm making this as painful as I can for you.\n\nTo CNBC: you must realize your short term gains through promoting institutions' agenda is just that - short term. Your staple audience will soon become too old to care, and the millions of us, not just at WSB but every person affected by the '08 crash that's now paying attention to GME, are going to remember how you stuck up for the firms that ruined so many of us, and tried to tear down the little guys. I know for sure I'll remember this. In response, here is a [list of CNBC sponsors and partners](https://www.cnbcevents.com/sponsors/). They include, but are not limited to, **IBM**, **Cisco**, **TMobile**, **JPMorgan**, **Oracle**, and **ZipRecruiter**. Their parent company is [NBCUniversal](https://en.wikipedia.org/wiki/NBCUniversal), owned by **Comcast** and **GE**.\n\nTo the boomers, and/or people close to that age, just now paying attention to these \"millennial blog posts\": you realize that, even if you weren't adversely effected by the '08 crash, your children and perhaps grandchildren most likely were? *We're not enemies, we're on the same side*. Stop listening to the media that's making us out to be market destroyers, and start rooting for us, because we have a once in a lifetime opportunity to punish the sort of people who caused so much pain and stress a decade ago, and we're taking that opportunity. Your children, your grandchildren, might have suffered as I described because of the institutions that we're fighting against. You really want to choose them, over your own family and friends? We're not asking you to risk your 401k or retirement fund on a single GME bet. We're just asking you to be understanding, supportive, and to not support the people that caused so much suffering a decade ago.\n\nTo WSB: you all are amazing. I imagine that I'm not the only one that this is personal for. I've read myself so many posts on what you guys went through during the '08 crash. Whether you're here for the gains, to stick it to the man as I am, or just to be part of a potentially market changing movement - thank you. Each and every one of you are the reason that we have this chance. I've never felt this optimistic about the future before. This is life changing amounts of money for so many of you, and to be part of a rare instance of a wealth distribution from the rich to the poor is just incredible. I love you all.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nNote: I can't seem to get a hold of mods and they keep fucking removing the post. I have no idea how to get this to stick and its important to me that the people I'm addressing read it.",
        "subreddit": "wallstreetbets",
        "title": "An Open Letter to Melvin Capital, CNBC, Boomers, and WSB",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nmwwbg/an_open_letter_to_melvin_capital_cnbc_boomers_and/",
        "created": 1622234160.0
    },
    {
        "author": "gintdm",
        "created_utc": 1620056156,
        "id": "n3z55u",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": " Hi Everyone! Here is my Monday Newsletter :) Happy trades and please DM me with any questions you may have :)  \n**Week of 5/3/21**\n\nThe S&amp;P500 opened Monday 5/3/21 at 4205.86, above the previous close of 4181.61 on Friday 4/30/21.\n\nManufacturing numbers release early in the week, with the April Markit Manufacturing PMI released Monday, and trade deficit &amp; factory orders numbers for March releasing Tuesday, May 4th. Markit services PMI and ISM services index numbers for April release Wednesday, and productivity &amp; labor costs for Q1 release Thursday. The ADP Employment report for April releases Wednesday, and weekly jobless claims numbers release Thursday, May 6th. April unemployment rates release Friday, as well as nonfarm payrolls, and average hourly earnings.\n\nThe average cost to build a home skyrocketed by $36,000 according to the National Association of Homebuilders. The rising prices are likely associated with soaring lumber costs. Lumber futures are up 125% on a 6-month basis. REITs reflected the change, rising throughout April. March construction numbers release Monday at 10AM.\n\nVerizon has reached an agreement with Apollo Global Management to sell its Verizon Media platform, which consists of internet pioneers Yahoo and AOL. The agreement to sell the tech platforms to the private equity firm will be worth $5 Billion. As a stipulation of the agreement Verizon will maintain a 10% stake in the new company, which Apollo plans to call “Yahoo.” Apollo releases earnings on Monday, May 3rd.\n\nChip manufacturers have been inundated with demand following 2020’s COVID shutdowns and the, undoubtedly correlated, increase in demand for consumer electronics. Cisco, one of the world’s largest chip manufacturers, is struggling to keep up with demand.\n\nCisco revealed several steps it is taking to alleviate the imbalance in supply and demand including a $4.5 billion acquisition of Acacia Communications and a $20 billion plan to build two new manufacturing plants in Arizona. Cisco CEO Chuck Robbins commented extensively on the situation, and estimates it could “...\\[take\\] another six months…” for the company to resume normal operation. Around 85% of all internet traffic passes through Cisco hardware.\n\nThe effects of the shortage can be seen across industries. Among companies affected by the shortage are car manufacturers. Wayne Griffiths, head of VW’s Spanish brand, spoke on the issue, stating that the company will, “...need to face considerable challenges in the second quarter…” So far the shortage has prevented the company from building over 100,000 vehicles.  \nGM reports earnings on Wednesday and markets will be curious to see if the chip shortage has affected them. Despite supply chain concerns CNBC’s Jim Cramer was optimistic in his recent review of the company, saying “If you want to bet on electric vehicles with much less risk, I say buy some Ford or General Motors… these are huge, established companies with improving balance sheets and real earnings, earnings that happen to be skyrocketing right now...”\n\nThe United States Government has also expressed concern regarding the chip shortage. United States President Joe Biden held a conference with business leaders in April to address the issue. During the conference the President expressed a desire to move more chip manufacturing into American plants, citing 75% of global manufacturing as being based in East Asia.  \nMeanwhile Taiwan-based chip manufacturing giant TSMC announced a plan worth $100 billion USD to expand their companies manufacturing capacity. The announcement comes in tandem with company founder Morris Chang’s plea to the Taiwanese government for increased support, citing a fear that if the Taiwan-based manufacturer fails to meet demand US or Chinese manufacturers will fill the gap.\n\nThe increase in demand for electronics caused by the pandemic has boded well for Apple, who reported earnings of $1.40 per share on Wednesday, April 28th, exceeding analyst estimates of $0.98 after a strong Q2 for sales. The earnings call comes on the heels of Apple’s first product showcase of the year Wednesday April 21st, and the company’s announcement that it will be taking steps to increase its footing in the instant messaging market. Apple stated it plans to increase the amount of features provided by it’s iMessage app, with the objective being to bring it more in line with popular messengers offered by Facebook, WhatsApp, and Snapchat.\n\nMicrosoft reported earnings of $1.95 per share Tuesday, April 27th, beating analyst estimates of $1.78 by a small margin. Microsoft, who also saw an increase in demand for its technology as a result of the pandemic, has greatly benefitted from an increased demand for cloud-services. Microsoft’s cloud-based service hub, Azure, posted 2020 growth of 43%. The company expects to post great earnings despite the current chip-shortage, having generated much of its growth from the pandemic in the software-as-a-service sector.\n\n**Some of the Companies with Earnings this Week**\n\n**Monday, May 3rd:**  \nEstee Lauder  \nApollo Global Management Inc  \nCarvana  \nON Semiconductor Corp  \nThe Mosaic Company  \nChegg Inc.\n\n**Tuesday, April 27th:**  \nPfizer  \nT-Mobile  \nCVS  \nActivision Blizzard  \nConocoPhillips  \nSysco  \nZillow  \nXilinx  \nHelloFresh  \nUnder Armor  \nWestern Union  \nMcAfee  \n**Wednesday, April 28th:**  \nPaypal Inc.  \nUber  \nGeneral Motors  \nTwilio Inc  \nMetLife Inc  \nBudweiser Brewing Company  \nBarrick Gold Corp.  \nFranco-Nevada Corp  \nEtsy Inc  \nFox Corp  \nGoDaddy  \nZynga  \n**Thursday, April 29th:**  \nSquare  \nNintendo  \nModerna  \nMonster Beverage Corp  \nRegeneron Pharmaceuticals  \nRoku Inc  \nAIG  \nAllstate  \nWayfair Inc  \nCBS Corp  \nPeloton Interactive  \nCloudflare  \nExpedia  \nKellogg Co.  \nAlliant Energy Corp.  \nPenn National Gaming  \nNorwegian Cruise Line Ltd.  \nDropbox\n\n**Friday, April 30th:**  \nDraft Kings  \nNCsoft",
        "subreddit": "stocks",
        "title": "What's Happening in the Markets: Week of 5/3/2021",
        "url": "https://www.reddit.com/r/stocks/comments/n3z55u/whats_happening_in_the_markets_week_of_532021/",
        "created": 1620084956.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621209271,
        "id": "ne1gh6",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 5) - $HD, $WMT, $TGT, $LOW, $CSCO, $GOEV, $XL, $SE and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 5 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is slowly coming to an end, so this weeks spreadsheet is a little smaller than prior weeks, but that's alright, there's still money to be made.\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **Expect larger moves coming out of retailers this week**. Home Depot, Lowe's, Walmart, and Target all have fairly conservative historical moves, but will likely break trend this earnings. Last quarter was fucking *massive* for these retail giants, as the holidays combined with stimulus cheques will likely lead to insane profits among them. Expect a large move to happen for each corresponding retailer, to either the upside or downside.\n\n&amp;nbsp;\n\n- **Lots of Chinese tech companies report this week.** If you're looking for a fun little collateral play, you can take a look at various Chinese tech ETFs and paly options on them. The IV on the ETFs is general lower than the ones on the individual tickers, although most of the tickers move in tandem with one another. If one beats, they usually all beat, and vice versa.\n\n&amp;nbsp;\n\n- **Don't fall for the Solar trap**. Solar has been heavily beat down all throughout earnings season, and as a result you may be inclined to buy Puts. Canadian Solar and Maxeon Solar have both slid extremely far following the movements of their peers throughout earnings, and are likely primed for a reversal. There isn't much farther for these stocks to go down, and as a result, a terrible earnings for both of these companies is already priced in. If they even match estimates, or put up a beat, they will likely move upwards. This exact situation occurred with Nikola two weeks back. I would look to play a neutral to bullish strategy on these tickers.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 50 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "options",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 5) - $HD, $WMT, $TGT, $LOW, $CSCO, $GOEV, $XL, $SE and More",
        "url": "https://www.reddit.com/r/options/comments/ne1gh6/historical_post_earnings_moves_mega_compilation/",
        "created": 1621238071.0
    },
    {
        "author": "TheSavingsGuy",
        "created_utc": 1620346739,
        "id": "n6lu6u",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "Canada’s market for initial public offerings has shaken off recent investor fears and is set to roar back, with at least 15 issuers preparing to go public in the next few months on the Toronto Stock Exchange.\n\nThe potential offerings span a wide spectrum of industries, including technology, mining, health care and consumer products, say 10 sources familiar with impending deals. Software names dominate following a strong year for new issues from innovative Canadian companies. The Globe is not disclosing the identities of the sources as they are not authorized to speak publicly on the impending issues.\n\nSeveral companies have hired investment bankers and started gauging interest from institutional investors – a process known as “testing the waters” – or are set to do so with hopes of going public by summer. The list includes Toronto-based software providers Q4 Inc., Softchoice Corp., VerticalScope Inc. and LifeSpeak Inc.; Quebec City-based Coveo Solutions Inc.; and Calgary’s Circle Cardiovascular Imaging Inc.\n\nThey join others previously identified by The Globe as near-term IPO candidates, including Loblaw Cos. Ltd.-backed telemedicine provider Maple Corp. and Waterloo-based Auvik Networks Inc., which makes software that manages and monitors internet-network traffic. Other technology companies that have engaged bankers but likely won’t go public until later are online furniture seller Cymax Group Inc. and D2L Corp.\n\nNon-technology names looking to go public include Neighbourly Pharmacy Inc., Canada’s third-largest drugstore chain operator, which filed this week to raise $150-million in an IPO on the TSX. Meanwhile, Brookfield Asset Management Inc. is set to spin out its U.S.-based car battery maker Clarios, which it acquired from Johnson Controls International PLC two years ago.\n\n“The IPO market is reopening with a vengeance,” said Chris Dale, head of equity capital markets at National Bank Financial.\n\nThe expected flurry of new issues represents a rapid acceleration of a trend that took hold last fall. As equity markets rebounded from sharp losses early in the COVID-19 pandemic, investors started clamouring for Canadian IPOs – particularly from technology companies, whose fortunes accelerated as widespread sheltering at home increased use of online tools. The resulting fervour for Canadian and U.S. tech companies created a pace of deals unseen since the dot-com boom.\n\nThe trend extended into early 2021, as Winnipeg’s Farmers Edge Inc., Telus Corp. spinout Telus International (Cda) Inc. and Montreal telemedicine firm Dialogue Health Technologies Inc. completed well-received offerings. But parts of Canada’s booming IPO market started to wobble in late February, largely driven by fears of rising interest rates. With the end of the pandemic in sight in Canada and the U.S., thanks to effective vaccines, many investors expected central banks to consider raising rates, and that worry triggered a sell-off in many growth stocks.\n\nSeveral Canadian IPOs subsequently struggled. MDA Ltd., Boat Rocker Media Inc. and ABC Technologies Holdings all had to cut their offering sizes and prices to complete their IPOs. Saskatoon’s Vendasta Technologies Inc. still hasn’t updated the market on its plans after struggling to raise money in its proposed offering, which it started marketing seven weeks ago.\n\nOn top of the prospects for rising rates, investors have also realized that new issues have delivered mixed returns. Over the first four months of 2021, the Renaissance IPO Index, which tracks U.S. IPOs, returned -3.2 per cent as of Monday, while the S&amp;P 500 index posted an 11.3-per-cent gain. An analysis by The Globe and Mail also shows that the average return among the 14 Canadian IPOs worth $50-million or more over the past six months has been -4.3 per cent since each started trading, while average TSX returns over the same time frames have been 7.3 per cent.\n\nThe data does not include the strong debuts of Waterloo cybersecurity software company Magnet Forensics Inc. and Thinkific Labs Inc., a Vancouver-based online course platform provider, which went public last week, nor the strong market performance of AbCellera Biologics Inc. after it went public in the U.S.\n\nHowever, the success of the two recent Canadian deals has shown there is still plenty of institutional interest in new issues that can push the right buttons with investors. Thinkific and Magnet both saw heavy investor demand and are both trading above their IPO prices.\n\n“Favourable liquidity conditions in the market – easy monetary policy and a strong fiscal backdrop – continue to favour a strong IPO market,” said Lesley Marks, chief investment officer at Mackenzie Investments.\n\nAt the same time, Canada’s publicly traded information technology sector is small relative to other industries, and to technology’s weighting in the S&amp;P 500 in the U.S. Canadian fund managers accustomed to a heavy focus on traditional sectors such as financial services and resources are eager to increase their exposure to a fast-growing sector.\n\nThere has also been a shift in many investors’ mindsets, said Jeff Mo, a portfolio manager at Mawer Investment Management in Calgary. “Canadian investors historically have been very reticent to buy companies that don’t show GAAP profitability,” he said. The stock market performance of software giant Shopify Inc. – which is currently Canada’s most valuable company but was mostly unprofitable before the pandemic - has made people rethink how they construct their portfolios, he said.\n\nIf institutional fund managers remain uncomfortable with unprofitable tech companies, there is a higher chance they will underperform their benchmark indexes by missing out on high-flying but unprofitable names. Among those that went public over the past two years are Lightspeed POS Inc., Dye &amp; Durham Corp. and Nuvei Corp.\n\nWhile investor demand has roared back, bankers stress that investors aren’t as quick to jump at just any IPO as they were six months ago, when pretty much anything would sell. Higher interest rates could also quickly hurt the IPO market. “Investors are more selective,” said Peter Miller, head of equity capital markets at BMO Nesbitt Burns, adding that quality deals will still get sold. “If anything, I think it’s a healthier market.”\n\n### Here’s a look at some of the Canadian companies lining up potential IPOs in the next few months:\n\n**Q4** sells online software to investor relations departments of public companies used to support functions such as hosting webcasts of quarterly earnings calls and annual meetings. It has 2,300 clients, including about half of the S&amp;P 500 companies, and generates about US$50-million in annualized revenues. Its top line increased by 80 per cent last year, with half the gains driven by acquisitions. CIBC Capital Markets, National Bank and Credit Suisse have been hired as underwriters. Q4 CEO Darrell Heaps declined to comment.\n\n**Coveo** sells artificial-intelligence-powered search tools known as “insight engines” to corporate giants such as American Express, Dell and Geico. It is led by veteran software entrepreneur Louis Têtu, whose last company, Taleo Corp., went public in 2005 on Nasdaq and was bought by Oracle Corp. in 2012 for US$1.9-billion. OMERS’ growth-equity arm led a $227-million equity financing for Coveo in fall 2019. Coveo has hired BMO, Bank of America, RBC Capital Markets and UBS as underwriters. Mr. Têtu declined to comment.\n\n**Softchoice** sells technology made by giants such as Microsoft, Google and Cisco to corporate customers and manages it for clients. Owner Birch Hill Equity Partners took the previously public Softchoice private in 2013. TD Securities and Goldman Sachs are leading an expected $350-million offering; other banks are joining the syndicate this week. Softchoice did not reply to a request for comment.\n\n**Lifespeak** provides digital health and wellness content for companies to distribute to their employees. It raised $42-million from Round 13 Growth Fund, Kensington Capital Partners and Roynat Capital last year, and is profitable and growing by more than 50 per cent a year, with annual revenues of about $25-million. It comes to market following recent offerings by digital health companies MindBeacon Holdings Inc. and Dialogue, and as Maple gears up to do the same. RBC, Scotia Capital and Canaccord Genuity are leading the offering. Lifespeak chairman Nolan Bederman declined comment.\n\n**VerticalScope**, a Toronto online media company that is 56-per-cent owned by Torstar Corp., specializes in websites for communities of enthusiasts of topics ranging from beekeeping to fancy watches. The company has more than 1,200 websites, with 1.7 billion content posts and 100-million-plus active users per month. Although organic growth before this year was low, the company has been highly acquisitive. It has about $60-million in annual revenue, largely from advertising, and a roughly 50-per-cent operating profit margin. RBC, Canaccord Genuity and National Bank Financial are leading the deal. Spokespeople for VerticalScope and Torstar declined comment.\n\nSource: [https://www.theglobeandmail.com/business/article-ipo-market-reopens-with-a-vengeance-as-15-plus-canadian-companies-look/](https://www.theglobeandmail.com/business/article-ipo-market-reopens-with-a-vengeance-as-15-plus-canadian-companies-look/)",
        "subreddit": "CanadianInvestor",
        "title": "IPO market reopens ‘with a vengeance’ as 15-plus Canadian companies look to go public",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/n6lu6u/ipo_market_reopens_with_a_vengeance_as_15plus/",
        "created": 1620375539.0
    },
    {
        "author": "JohnLouis24",
        "created_utc": 1620498767,
        "id": "n7vfd5",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "The following is an excerpt taken from StockTwits user “DTGoody”\n\n*The Problem*\n\nIoT devices are a powerful new technology, however, they also create new opportunity for hackers as billions of new entry points that can result in devastating losses for the businesses using them. An enormous and growing unmet need for effective cybersecurity for IoT is demonstrated very clearly by the soaring number of breaches that continue to result in millions of dollars per incident and billions of dollars in losses every year. \n\nAs Niraj Kadakia of IBM Business Development and Embedded Analytics stated above, we clearly have vulnerabilities and a big unmet need for improved secure IoT solutions. \n\n*The Solution*\n\nLife On Earth, Inc. (LFER: OTC) recently announced their Binding Letter of Intent to purchase 100% of SmartAxiom, Inc., a provider of patented technologies based cyber security with unbreakable block chain based IoT solutions for multiple industries that include machine to machine (M2M) communications. \n\nThere are competing cybersecurity solutions for IoT, however, none yet seems to work well enough to prevent hackers from stealing valuable data. \n\nSmartAxiom has built a patented solution based on the decentralized ledger of Blockchain that is getting the attention of big users such as, CSCO, INTC, IBM, MRVL, TOY, HPE, Volvo, Mazda, Xerox, MSFT, Amazon Web Services, Renesas, NXP, NuLeds, boa, Globe Teleservices. \n\nThe next excerpt (below) is from StockTwits user “Chris T” - He does a good job on explaining the significance of the recent $1.6M investment made on LFER by Joseph A:\n\nFor those who don't know who Joseph Abrams is.....see below: \n\nSource:https://www.cicerotransact.com/team \n\nJoe Abrams is co-founder of The Software Toolworks, a publicly held developer, publisher, and distributor of educational and entertainment software, which was sold to Pearson, Plc. for $462 million. Mr. Abrams also co-founded Intermix, the predecessor company to MySpace, which was sold to News Corp. in 2005 for $580 million. He has also served on the Board of Advisors for Akeena Solar and and was an adviser to ZAAG, assisting in public offerings, acquisitions and capital raisings. \n\nMr. Abrams specializes in emerging growth companies in several areas including: technology, drug discovery technology services, consumer products,big data and online job placement. Mr. Abrams also sits on University of Rochester Simon School of Business Executive Advisory Committee.",
        "subreddit": "pennystocks",
        "title": "$LFER - Plans to acquire SmartAxiom Inc. (HUGE NEWS)",
        "url": "https://www.reddit.com/r/pennystocks/comments/n7vfd5/lfer_plans_to_acquire_smartaxiom_inc_huge_news/",
        "created": 1620527567.0
    },
    {
        "author": "RecommendationNo6304",
        "created_utc": 1621622635,
        "id": "nhzqea",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "I just caught a [wired article](https://www.wired.co.uk/article/apple-ios14-facebook) in my feed today that perfectly illustrates the messages in Moore's fantastic book from 97', **Gorilla Game**, regarding *enabling technology* and how to understand the importance it holds.\n\nEnabling hardware serves a very similar function in our world today, the \"Third Wave\" economy as Alvin Toffler put it, to the function served by \"the means of production\" in decades past.\n\nIf you wonder why countries on the come up, from China to India to Brazil, are so intent on building out their own home-grown capacity for hardware production, look no further than Apple and Facebook.\n\n***Facebook*** *is an enabling software platform*. It gives smaller fish (mostly smaller and middle sized businesses) access to an awesome amount of data and analytics on which to advertise.\n\n***Apple*** *is an enabling hardware platform*. It also provides access to a great deal of data and analytics, and supplies platforms (Apple's app store, the iPhone OS, built in apps like News+, etc) to businesses galore, but Apple has one massive advantage Facebook does not - control of the production, top to bottom.\n\nApple dictates the hardware stream, by way of being of such massive scale they are essentially the only customer of importance to whatever chip manufacturer they decide to bless. Further they own the hardware within the iPhone and this acts as the gateway to everything, including \\*trumpet sounds\\*... Facebook on the iPhone.\n\nApple didn't invent this. It's how Microsoft and Cisco have buttered their bread with for decades, and handily dispatched virtually all competitors. Amazon understands it well, and how they managed (so far) to survive amongst whales. They had the foresight to develop their own in-house platform (AWS) to remain independent of reliance on a Gorilla who could squeeze them.\n\nIf you're interested in technology businesses, I can't recommend understanding this crucial concept enough.",
        "subreddit": "ValueInvesting",
        "title": "A textbook example of enabling hardware, and why it matters so damned much",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/nhzqea/a_textbook_example_of_enabling_hardware_and_why/",
        "created": 1621651435.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621281852,
        "id": "neqbh3",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 5) - $HD, $WMT, $TGT, $LOW, $CSCO, $GOEV, $SE and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 5 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is slowly coming to an end, so this weeks spreadsheet is a little smaller than prior weeks, but that's alright, there's still money to be made.\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **Expect larger moves coming out of retailers this week**. Home Depot, Lowe's, Walmart, and Target all have fairly conservative historical moves, but will likely break trend this earnings. Last quarter was fucking *massive* for these retail giants, as the holidays combined with stimulus cheques will likely lead to insane profits among them. Expect a large move to happen for each corresponding retailer, to either the upside or downside.\n\n&amp;nbsp;\n\n- **Lots of Chinese tech companies report this week.** If you're looking for a fun little collateral play, you can take a look at various Chinese tech ETFs and paly options on them. The IV on the ETFs is general lower than the ones on the individual tickers, although most of the tickers move in tandem with one another. If one beats, they usually all beat, and vice versa.\n\n&amp;nbsp;\n\n- **Don't fall for the Solar trap**. Solar has been heavily beat down all throughout earnings season, and as a result you may be inclined to buy Puts. Canadian Solar and Maxeon Solar have both slid extremely far following the movements of their peers throughout earnings, and are likely primed for a reversal. There isn't much farther for these stocks to go down, and as a result, a terrible earnings for both of these companies is already priced in. If they even match estimates, or put up a beat, they will likely move upwards. This exact situation occurred with Nikola two weeks back. I would look to play a neutral to bullish strategy on these tickers.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 50 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 5) - $HD, $WMT, $TGT, $LOW, $CSCO, $GOEV, $SE and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/neqbh3/historical_post_earnings_moves_mega_compilation/",
        "created": 1621310652.0
    },
    {
        "author": "andysinclair",
        "created_utc": 1621599923,
        "id": "nhr98c",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Adobe came out on top and not surprisingly Exxon was bottom.\n\nIn the table below the 2nd column is the Total ESG Risk Score (from Sustainlytics) and the 3rd column is \"difference from peers\".\n\nA low risk score is \"good\" and vice-versa; for the peer comparison a negative number means the company has a better ESG rating than other companies in its industry/sector and vice-versa.\n\nAmazon stands out as particularly bad versus its peers whereas NVIDIA is doing particularly well.\n\nTesla for all its environmental credentials is down near the bottom, although the bottom 5 is dominated by pharma.\n\nI go into some detail on how I built this on my blog: [https://blog.excelpricefeed.com/2021/05/21/getting-started-in-ethical-investing](https://blog.excelpricefeed.com/2021/05/21/getting-started-in-ethical-investing)\n\nCompany | Total ESG Risk Score | Difference to Peers\n\n|Adobe Inc.|11|\\-8|\n|:-|:-|:-|\n|The Home Depot, Inc.|12|\\-5|\n|Cisco Systems, Inc.|12|\\-5|\n|NVIDIA Corporation|13|\\-9|\n|Microsoft Corporation|15|\\-4|\n|Mastercard Incorporated|16|\\-2|\n|The Walt Disney Company|16|\\-1|\n|Apple Inc.|17|0|\n|Intel Corporation|17|\\-5|\n|Berkshire Hathaway Inc.|17|\\-4|\n|Visa Inc.|17|\\-1|\n|Netflix, Inc.|17|2|\n|PayPal Holdings, Inc.|18|\\-1|\n|Verizon Communications Inc.|18|\\-4|\n|AT&amp;T Inc.|19|\\-3|\n|Comcast Corporation|19|4|\n|UnitedHealth Group Incorporated|21|\\-2|\n|Alphabet Inc.|22|4|\n|Pfizer Inc.|25|\\-3|\n|Facebook, Inc.|25|6|\n|The Procter &amp; Gamble Company|25|1|\n|The Coca-Cola Company|25|\\-2|\n|Bank of America Corporation|26|0|\n|Amazon.com, Inc.|27|11|\n|JPMorgan Chase &amp; Co.|28|2|\n|AbbVie Inc.|29|2|\n|Johnson &amp; Johnson|30|2|\n|Abbott Laboratories|30|7|\n|Tesla, Inc.|31|5|\n|Exxon Mobil Corporation|35|\\-3|",
        "subreddit": "investing",
        "title": "I looked at the top 30 stocks in the S&amp;P500 and performed some ESG analysis in Excel.",
        "url": "https://www.reddit.com/r/investing/comments/nhr98c/i_looked_at_the_top_30_stocks_in_the_sp500_and/",
        "created": 1621628723.0
    },
    {
        "author": "Sufficient-Moose-469",
        "created_utc": 1621353519,
        "id": "nfedrl",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hello everyone, I am been currently building my portfolio. Got some stock in Cisco and zoom early thankfully. Have stocks in medical and in tech as well and I have a question. Has anyone purchased any stock in the cruise lines? I know it's probably not a good long term investment, but I see there shares are still trading lower the they were pre covid-19. News now is looking promising for them to reopen. Would love to hear some opinions I'm still a novice in trading. Thanks for any help",
        "subreddit": "options",
        "title": "Building portfolio",
        "url": "https://www.reddit.com/r/options/comments/nfedrl/building_portfolio/",
        "created": 1621382319.0
    },
    {
        "author": "jschulz00",
        "created_utc": 1621720320,
        "id": "nit1hp",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "New guy question here- I recently decided to join the terrifying world of stock investments. My wife and I are about to pop out our first child (2 week countdown!) so I figured it was time to start paying closer attention to how my money works for me besides just our 401k. So I did the only (?) logical thing and put $10k on a variety of safe stocks. Microsoft, Amazon, Google, FB, Target, Walmart, Cisco, TMS, PayPal, Square, Applied Materials, Crowdstrike. Yes clearly I work in IT. Companies that are established and would generally be considered, at least from a company success perspective, low risk. And then I proceeded to lose a few hundred bucks in my very first day yesterday. Now I get that stocks are a long term investment. I’m not trying to make a quick buck, day trade or participate in options speculation. I also am aware of the rule don’t bet what you can’t afford to lose. I can zero all of it without an issue…this is a starting point for me. Nonetheless, the results last week left me feeling a little depressed and kind of wanting to take my ball and go home. Can anyone please point towards some good resources to learn more about how to be smart about this? I’ve been lurking here for a long time but it’s hard to tell sound advice from more meme-based advise. To give you an idea how much I don’t know, I almost bought a Motley Fool subscription before reading comments on here about their service. Help my baby please! She wants to go to a good school. \n\nThank you in advance!!",
        "subreddit": "stocks",
        "title": "Life planning via…apes??",
        "url": "https://www.reddit.com/r/stocks/comments/nit1hp/life_planning_viaapes/",
        "created": 1621749120.0
    },
    {
        "author": "iboratverynice",
        "created_utc": 1621715758,
        "id": "nirhry",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Csco options open to doom -91%",
        "url": "https://i.redd.it/ov37hj71gq071.jpg",
        "created": 1621744558.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621280268,
        "id": "nepmzj",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 5) - $HD, $WMT, $TGT, $LOW, $CSCO, $GOEV, $XL, $SE and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 5 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is slowly coming to an end, so this weeks spreadsheet is a little smaller than prior weeks, but that's alright, there's still money to be made.\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **Expect larger moves coming out of retailers this week**. Home Depot, Lowe's, Walmart, and Target all have fairly conservative historical moves, but will likely break trend this earnings. Last quarter was fucking *massive* for these retail giants, as the holidays combined with stimulus cheques will likely lead to insane profits among them. Expect a large move to happen for each corresponding retailer, to either the upside or downside.\n\n&amp;nbsp;\n\n- **Lots of Chinese tech companies report this week.** If you're looking for a fun little collateral play, you can take a look at various Chinese tech ETFs and paly options on them. The IV on the ETFs is general lower than the ones on the individual tickers, although most of the tickers move in tandem with one another. If one beats, they usually all beat, and vice versa.\n\n&amp;nbsp;\n\n- **Don't fall for the Solar trap**. Solar has been heavily beat down all throughout earnings season, and as a result you may be inclined to buy Puts. Canadian Solar and Maxeon Solar have both slid extremely far following the movements of their peers throughout earnings, and are likely primed for a reversal. There isn't much farther for these stocks to go down, and as a result, a terrible earnings for both of these companies is already priced in. If they even match estimates, or put up a beat, they will likely move upwards. This exact situation occurred with Nikola two weeks back. I would look to play a neutral to bullish strategy on these tickers.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 50 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "smallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 5) - $HD, $WMT, $TGT, $LOW, $CSCO, $GOEV, $XL, $SE and More",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/nepmzj/historical_post_earnings_moves_mega_compilation/",
        "created": 1621309068.0
    },
    {
        "author": "FluxRevived",
        "created_utc": 1621280278,
        "id": "nepn4o",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**Historical Post Earnings Moves MEGA Compilation (Week 5) - $HD, $WMT, $TGT, $LOW, $CSCO, $GOEV, $XL, $SE and More**\n\n&amp;nbsp;\n\nWhat's poppin' bull gang, Flux here with Week 5 of the Historical Post Earnings Moves MEGA Compilation. I hope you all made some good money following the spreadsheet last week, cause it's time to do it all again! Earnings season is slowly coming to an end, so this weeks spreadsheet is a little smaller than prior weeks, but that's alright, there's still money to be made.\n\n&amp;nbsp;\n\nAll that being said, I fucking love earnings season. It’s an absolute battleground out there. Insane volatility, breaking announcements, and huge moves being made every single day for weeks at a time. What’s not to love? Anyone has a chance to pick the correct tickers, roll the dice, and amass a small fortune. That being said, the unpredictable nature of earnings season often makes or breaks traders - many find that they’re one bad trade away from a complete blowout, so you always need to think about each trade critically. No shame in sitting it out altogether.\n\n&amp;nbsp;\n\n\n---\n\n#The Spreadsheet\n\nTo aid us in planning our trades this week, [**I've compiled a spreadsheet consisting of all of the Historical Post Earnings Moves of EVERY stock reporting earnings this week**](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing). Using this spreadsheet, we can determine which options to buy or sell to minimize risk and maximize probability for ANY given ticker. Obviously, past performance isn’t indicative of future success, but we can still use these numbers to gain a general idea of the expected earnings move of a given stock. Gone are the days of getting randomly blown out due to lack of information! If you’re struggling to find a given stock, click on the ticker symbol on the index page, it should hyperlink you straight to the table! If the above link isn’t working for you, refer to the link below!\n\n&amp;nbsp;\n\n[Spreadsheet HERE](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing)\n\n&amp;nbsp;\n\nPlease note that scraping and compiling this data took *hours*. If the sheet has helped you out in any way, please drop an upvote or a comment and peep my socials! It would mean alot to me. Most websites also require you to pay for this data, which I think is a load of shit.\n\n&amp;nbsp;\n\n---\n\n#Interesting Observations and Sample Plays\n\nBelow I’ve compiled some interesting observations which can further aid us in making trades this week, alongside some sample plays for those who are new to playing earnings and need some guidance. If I missed anything, feel free to bring it to my attention!\n\n&amp;nbsp;\n\n- **Expect larger moves coming out of retailers this week**. Home Depot, Lowe's, Walmart, and Target all have fairly conservative historical moves, but will likely break trend this earnings. Last quarter was fucking *massive* for these retail giants, as the holidays combined with stimulus cheques will likely lead to insane profits among them. Expect a large move to happen for each corresponding retailer, to either the upside or downside.\n\n&amp;nbsp;\n\n- **Lots of Chinese tech companies report this week.** If you're looking for a fun little collateral play, you can take a look at various Chinese tech ETFs and paly options on them. The IV on the ETFs is general lower than the ones on the individual tickers, although most of the tickers move in tandem with one another. If one beats, they usually all beat, and vice versa.\n\n&amp;nbsp;\n\n- **Don't fall for the Solar trap**. Solar has been heavily beat down all throughout earnings season, and as a result you may be inclined to buy Puts. Canadian Solar and Maxeon Solar have both slid extremely far following the movements of their peers throughout earnings, and are likely primed for a reversal. There isn't much farther for these stocks to go down, and as a result, a terrible earnings for both of these companies is already priced in. If they even match estimates, or put up a beat, they will likely move upwards. This exact situation occurred with Nikola two weeks back. I would look to play a neutral to bullish strategy on these tickers.\n\n&amp;nbsp;\n\nObviously, since I gave data on over 50 companies, there's plenty that I’ve missed. Dive in, have a look around, and have some fun with it! Use the spreadsheet to aid you in picking the safest strikes, and get the best risk-reward possible. Feel free to share your findings too, I’d love to see what you guys come up with.\n\n&amp;nbsp;\n\n---\n\n# Conclusion\n\nWe’ve got an insane lineup of companies reporting earnings this week, meaning there’s a huge variety of plays to be made for traders of all skills and styles! Use the [spreadsheet](https://docs.google.com/spreadsheets/d/1tiIuvRFHYgqLQpe7HdDYNQ1ZkQGA55gLKc0A_jJQKiQ/edit?usp=sharing) to determine which stocks offer the best risk to reward ratio, and play accordingly! If enough people found these useful, I'll continue making them throughout the earnings season! If the sheet has helped you out in any way, please consider dropping an upvote or a comment, and checking out my socials, it would mean a lot to me! **Happy Trading Everybody! :)**",
        "subreddit": "options",
        "title": "Historical Post Earnings Moves MEGA Compilation (Week 5) - $HD, $WMT, $TGT, $LOW, $CSCO, $GOEV, $XL, $SE and More",
        "url": "https://www.reddit.com/r/options/comments/nepn4o/historical_post_earnings_moves_mega_compilation/",
        "created": 1621309078.0
    },
    {
        "author": "IamLeGend1311",
        "created_utc": 1621332219,
        "id": "nf6qn2",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Cisco Systems releases its quarterly results this week, which look promising\n\nI use the DE000UE4ECY9 with a leverage of 5,7 #YOLO",
        "subreddit": "wallstreetbets",
        "title": "Cisco Systems",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/nf6qn2/cisco_systems/",
        "created": 1621361019.0
    },
    {
        "author": "Desperate-invest-56",
        "created_utc": 1621522074,
        "id": "nh25so",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "RobinHoodPennyStocks",
        "title": "ADXS is next GameShop. Thinking about buying stock in Advaxis, Cisco Systems, Atossa Therapeutics, Palantir Technologies, or Sundial Growers?",
        "url": "https://newsfilter.io/a/a4166e6b8dc1d929e605f81c55bc2221",
        "created": 1621550874.0
    },
    {
        "author": "Desperate-invest-56",
        "created_utc": 1621522194,
        "id": "nh27kq",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Buy ADXS, next to GameShop growth. Thinking about buying stock in Advaxis, Cisco Systems, Atossa Therapeutics, Palantir Technologies, or Sundial Growers?",
        "url": "https://newsfilter.io/a/a4166e6b8dc1d929e605f81c55bc2221",
        "created": 1621550994.0
    },
    {
        "author": "NrdRage",
        "created_utc": 1620422316,
        "id": "n799ne",
        "num_comments": 324,
        "num_crossposts": 0,
        "selftext": "No unique stock DD this week guys, I had a senior moment and my brain was a day off.  Probably for the best, because this market is off-the-rails broken right now, anyways.  Literally down is up and up is down.\n\n&amp;#x200B;\n\nInstead, let's do an update on the Nrd ETF for the month.  I'll go over some of my trades and, as I have time maybe read how some of you played them and offer some not-financial-advice on how to optimize the plays.\n\n&amp;#x200B;\n\nFor those who want to go to the original discussion, you can find it [here](https://www.reddit.com/r/wallstreetbets/comments/n225dj/because_people_keep_asking_the_nrdrage_etf_may/).  I'll quote box the positions below and then go into it.\n\n&amp;#x200B;\n\n&gt; *My long list (both established positions and sentiment/momentum trades I'll make):*\n\n1. *$CLNE (Positions established; look at DD)*\n2. *$MA*\n3. *$BABA (Positions established; look at DD)*\n4. *$BE (Positions established; look at DD)*\n5. *$CAT (Positions re-established today in fact - July 230c's that I timed perfectly)*\n6. *$EXPE*\n7. *$AAPL*\n8. *$ALGN*\n9. *$PSFE (Positions established earlier)*\n10. *$CVX*\n11. *$ENPH (Positions established today)*\n12. *$TSCO (Positions established)*\n13. *$CAR (Positions established)*\n14. *$KMI (September 18s)*\n15. *$BB (Positions established; see DD)*\n\n&gt;*The Short watch list:*  \n&gt;  \n&gt;*Note  that, when it comes to shorting, I do a lot more scalping and very  short term swing trading.  May is typically a month of low volume, so  you have to be agile.  Puts are generally 2 steps out of the money at  open.  Do your own DD.  This is also not a complete list, just a daily  watch list of companies that I feel are going to fare roughly or whom  have typically underperformed this time of year.  This is also not a  short and hold list.  If you don't know what I'm saying, you should stay  away from these.*\n\n1. *$TSLA (Established today @ an average cost basis of $712.11)*\n2. *$UPST*\n3. *$TWTR (Established April 28th @ $66.08)*\n4. *CLOV (always good for an intraday scalp when the capuchins go full retard)*\n5. *$SPCE*\n6. *$PTON*\n7. *$TSM*\n8. *$BLNK*\n9. *$GS (Established yesterday)*\n10. *$PINS*\n11. *$BMBL*\n12. *$EGHT*\n13. *$MDB*\n14. *$PCG*\n15. *$DASH (Established Wednesday at 162.22)*\n16. *$GRUB (Established Wednesday at 70)*\n17. *$WORK*\n18. *$CAN*\n19. *$BYND*\n20. *$AFRM (Established Wednesday at $77.20)*\n21. *$COUR*\n22. *$HEP*\n23. *$CSCO*\n24. *$PLNT*\n25. *$QS*\n26. *$WMT*\n27. *$ADT*\n28. *$TW*\n29. *$RTX*\n30. *$COF*\n31. *$NOC*\n32. *$ADM*\n33. *$AAL*\n34. *$WHR*\n35. *$LUMN*\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nAnd here's where we are **(LOSERS IN BOLD;** *N/A, draws, or otherwise flat trades in italics)***:**\n\n&amp;#x200B;\n\n1. **$CLNE:  This one got ugly.  Real ugly.  Volume completely dried up, which gave the shorts free rein to walk it down into oblivion all week.  They had an earnings call on Thursday, which was actually quite good (missed on top line EPS, but beat on revenue, upgraded forward guidance, and opened up more about the 1.5bln $AMZN contract, which sounds better and better the more I hear about it.  It actually traded up for a while this morning, but then just got absolutely assaulted the rest of the day because everybody was sitting it out.  I've averaged down - hard - on this one at this stage to make sure that I'm always within a day or two's striking distance of at least breaking even on the June calls.  I have started buying September calls at the same 13 strike.  I also started buying up more shares at $8.85 this afternoon.  I love a sale.   I'm going to re-evaluate how I feel about the June calls in the coming week.  Given that this stock has had 6 red days out of 7, any moves I make right now would be reactionary.  Further, one interesting thing I noticed was that, in the last 5 or 10 minutes or so, other whale buyers showed up HARD at the $8.79 price.  For a stock who's order book all day was just a series of 3-digit and low 4-digit offers, to see 50,000 share bids show up tells me that the shorts who had been fucking this thing all week were covering AND the buyers were coming back in (probably the same assholes who shorted it).**\n2. *$MA:  I'm still yet to open a position here.  I just haven't liked the price action, and the charts have been very choppy.  If you've played it, let me know how it worked out for you.  Looking back at the weekly, I see some openings NOW, but they weren't real clear in the moment.*\n3. $BABA:  I took the opportunity at 226 to finish filling out my call position as referenced in the last solo stock DD.  I know I said in that DD it was impossible to screw up, but apparently I underestimated the internet some, because I've had people messaging me saying they bought in at 234 and are down and \"feeling pain\", when I explicitly said not to buy at those levels.  It's interesting to me that the Chinese stocks, which are universally accepted to be underpriced, are moving in sympathy with domestic growth stocks.  That's broken.  \n4. **$BE:  Bought more August 31's on Thursday when it was at the bottom.  Sub-$20 was too good of an equity price to pass up.  I really liked the price movement on it yesterday and today.  Their earnings call was SPECTACULAR, and their leadership said all the right things.  I feel really good about this one to finally start moving independently of the rest of the green energy sector. Loser for right now, but I'm not getting shaken out**\n5. $CAT:  Those July 230's were made of latinum.  Closed out today for fat profits.  I consider this trade over until $CAT comes back down into the 220's.\n6. $EXPE:  Bought in yesterday morning.  Closed my position at about 2 pm EST today.  I sat on this trade a little too long and left about $3 a share on the table, but profit is profit.  It was a very nice trade.  This trade is closed\n7. *$AAPL:  I never actually got into my long position.  I closed my pre-existing short on Tuesday and have been eyeing an entry, but haven't found one I like yet.*\n8. $ALGN:  In Tuesday @ 575-ish, out today at 600.  Trade is closed\n9. $PSFE:  As discussed in last week's post, I ended up removing this because the apes started trying to meme stock it, and I replaced it with $CVS, which has made me enough tendies to spring for the top shelf lube for when I fuck.  The $CVS trade is still ongoing and a good one to eye an entry, IMO\n10. $CVX:  Jumped in Monday, and I'm still in the trade.  I like the movement on this one.  Still a good trade to enter, IMO\n11. **$ENPH:  I'm upside down on this one, largely because I've been unwilling to average down on it.  My bags aren't super heavy, but I do have some Samsonites right now.  Going to just store it away and let it marinate.  The price action is still downwards here, so if you're eyeing this one, let it come in further**\n12. $TSCO:  The price action on this has been amazing.  I've actually been holding this for quite some time, so my entry is way in the rear view mirror.  But I love how smoothly it's run and feel it's still got a lot more room to till.\n13. **$CAR:  This is another one I've been holding forever, and just don't want to create a taxable event on.  The price action has generally been flat, if you remove the fact they had earnings this week, and we all know what earnings means in this market.  I still like this one for a buy and hold**\n14. $KMI:  We don't talk about $KMI.  But if you're interested, maybe go look at a chart, because it'll make you wet\n15. **$BB:  I haven't done anything with this, and honestly, couldn't even tell you how it's performed.  Probably poorly.**\n\n&amp;#x200B;\n\n# The shorts:\n\n1. $TSLA:  I jumped in at $712.11.  Everybody in the daily told me I hated money.  I got out at 666, even though I was swearing up and down it was going to 650.  The price action just looked like it was turning, so I took tendies.  Then it went to 650 like I thought it would.  Could have done it better, but profit is profit.  I'm eyeing a re-entry to the short side on this one.  I'm thinking 685-690 I'll likely re-establish\n2. $UPST:  My most reliable short  I'm twenty-some dollars a share in the green already and still holding.\n3. $TWTR:  It's been SUUUUUPER choppy this week.  I got out at 52.80 for a nice gain, but I've hated the price action.  Staying away from here on out\n4. *$CLOV:  Never had a good opportunity to play it.  Still watching*\n5. $SPCE:  Death, taxes, and $SPCE tanking.  Still holding for a modest gain with stop losses in place.  Been pretty flat.  Probably still a good short if you can time it.\n6. $PTON:  God bless that Shortbus All-Star kid who got eaten by the treadmill.  Lambo squad trade.  Closed out, and consider the trade done unless I see it in the mid 90's again\n7. *$TSM:  Never entered.  I thought I had a price target in mind, but I wussed out at the last moment.  Doesn't matter, Theta Semi living up to its name*\n8. $BLNK:  30% gain.  I'll look for re-entry at 35.\n9. **$GS:  Defying the odds.  Trimmed my position to hedge losses, but this one isn't working out so far. Will look for weakness to re-establish in full**\n10. $PINS:  Closed half my position at 60 for a nice gain.  Holding the other half with tight stop losses, but I'm optimistic it's got further to fall\n11. *$BMBL:  I missed it.  Kicking myself for it, too.  I knew it was gonna fall.  Not sure how much downside is left*\n12. $EGHT:  Oh the sweet sound of an equity dying.  This one is printing for me hard, and I think it's still got another 3-4 dollars to the downside in it\n13. $MDB:  See $EGHT.  Exact same story\n14. $PCG:  Riding it down like a submissive whore.  I'll probably run this one the entire month.  Printing nicely, still plenty of room to drop\n15. $DASH:  LAMBO SQUAD!  Oh man, this one has been magnificent.  And it's still got downside.  Fair value IMO is 80.  It'll never hit it, but I think 110 is entirely doable.\n16. $GRUB:  Reliable gainer to the downside, but not as nice as $DASH.  Still holding. \n17. $WORK:  Quietly dropped on no news.  Just shows how broken the market is, because the buyout price is baked in.  I was following this so I could see news to potentially short $CRM, but none came.  $CRM, however, fell nicely on the week, but I wasn't there to catch it.  Trade is likely running out of breath\n18. *$CAN  Never entered it, which is sad because it could have been a good gainer.  I'll rectify that mistake on some upwards momentum*\n19. $BYND:  Yacht squad.  What an amazing loser.  Still holding.  I want to see 95\n20. $AFRM:  I love the concept, but I hate the business model.  This one has been a great gainer for me, but I want to see 44.  Still room to drop\n21. $COUR:  Inadvertent earnings play.  Didn't realize t hey were reporting this week.  Happy accidents.  2 bagger, excellent play.  I covered this afternoon.  I think there's probably still another 10% to the downside possible, but I actually like the model and don't want to tempt fate.  This trade is closed to me.\n22. *$HEP:  Got in and got out at dead even.  Thought I had a good entry but then things got choppy and weird.  Removed it from my watch list.  This trade is dead to me with a draw.*\n23. *$CSCO:  never entered.  Which is good, because it's run up.  I'm eyeing an entry*\n24. $PLNT:  Another great winner.  I wanna see another 4 dollars to the downside  Trade still live\n25. $QS:  Patently obvious this was gonna drop like a rock.  Ask me when it's at $10 and I'll probably still be shorting it\n26. *$WMT:  I got cute and walked into a flat trade.  Will exit next week, win lose or draw.*\n27. **$ADT:  Took the L here.  Entered at $9.27, got scared off this afternoon with a small loss.  Took it off my watch list, trade is dead to me**\n28. *$TW, $RTX, $COF, $NOC, $ADM, $AAL, $WHR, $LUMN, didn't enter any of these.  $COF, $AAL and $WHR are the only ones I'm even still tracking.  The others are dead to me*\n\n&amp;#x200B;\n\nRecord after 1 week:  \n\n&amp;#x200B;\n\nLongs:  8-5-2 (given the week that just happened, I'll take it)\n\n&amp;#x200B;\n\nShorts:  18-2-15:  Most of the draws are simply because I never entered the trades.  Take out the trades where I never expended powder and it's 18-2-2.  \n\n# \n\n# Overall (played trades):  26-2-2\n\n&amp;#x200B;\n\nSo....how'd you do?  Let's hear it.",
        "subreddit": "wallstreetbets",
        "title": "The weekend update/discussion of the Nrd May ETF (Thought it was Thursday till 10 after 2 today didn't-write-my-homework edition)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n799ne/the_weekend_updatediscussion_of_the_nrd_may_etf/",
        "created": 1620451116.0
    },
    {
        "author": "bheal",
        "created_utc": 1620719996,
        "id": "n9rso8",
        "num_comments": 85,
        "num_crossposts": 0,
        "selftext": " Ok, listen up. A couple helpful posters keyed me into the fact that a certain entity was shorting two stocks, so I went on a bit of a dig.\n\nI present to you Public Enemy #1 and #2.\n\nBlackstone Alternative\n\nand\n\nCutler Group (has a history of violations for naked shorts)\n\nBelow you will find the list of stocks I found them to be short on, and their last reported positions - which in most cases are 5/10 - yeah that's right, YESTERDAY. We know exactly what they've shorted, and we know exactly what to do, right?\n\n**We buy. We Hold. We win.**\n\nThese two are shorting almost every stock we hold dear. They are trying to take our hard earned cash just because they can. These are some of the people who have driven us red the last month. These are the kind of people who think they can have my wife without her boyfriend present. Over my cold, uncooked tendies.\n\nBelow are Blackstone's positions. You will see Cutler on many of those, as well as on some others that Blackstone was not in.\n\nPLTR (5/10)\n\nLatest Disclosed Ownership-157,100 shares Latest Disclosed Value$ -3,658,859\n\nRKT (5/10)\n\nLatest Disclosed Ownership-2,500 shares Latest Disclosed Value$ -57,725\n\nself driving car laser makers (5/10)\n\nLatest Disclosed Ownership-9,600 shares Latest Disclosed Value$ -178,080\n\nvideo game store (3/1)\n\nLatest Disclosed Ownership-21,600 shares Latest Disclosed Value$ -406,944\n\nBABA (5/10)\n\nLatest Disclosed Ownership-2,600 shares Latest Disclosed Value$ -589,498\n\nASO (5/10)\n\nLatest Disclosed Ownership-3,700 shares Latest Disclosed Value$ -99,863\n\nBAK (5/10)\n\nLatest Disclosed Ownership-100 shares Latest Disclosed Value$ -1,422\n\nVIAC (5/10) (Melvin's shorting this too)\n\nLatest Disclosed Ownership-35,329 shares Latest Disclosed Value$ -1,593,337\n\nENPH (5/10)\n\nLatest Disclosed Ownership-1,400 shares Latest Disclosed Value$ -227,024\n\nCLNE (5/10)\n\nLatest Disclosed Ownership-39,000 shares Latest Disclosed Value$ -535,860\n\nBE (5/10)\n\nLatest Disclosed Ownership-1,400 shares Latest Disclosed Value$ -37,870\n\nAdditionally, there's a bonus in this list!\n\nAmong those precious stocks above is one that is primed for a gamma squeeze.\n\nThis stock is a small cap, so WSB can move the price.\n\nThis stock has significant short interest, which will assist in a gamma squeeze (it will not short squeeze, this is just an added little boost if it does gamma squeeze)\n\nThis stock has low average volume, meaning short positions will have higher DTC. This also means quicker and stronger price volatility.\n\nThis stock has been bent over hard and is currently at a bargain price well under any valuation you can find.\n\nThere are 4 million shares worth of options that will be ITM if the stock spikes. Average volume is 3.5m.\n\nI give you CLNE.\n\nIf you want DD on it, do your own. The play is simple.\n\n**Buy shares, Hold shares, Win tendies.**",
        "subreddit": "wallstreetbets",
        "title": "I researched our memefolio to see who was shorting it. Turns out, there's a pattern.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9rso8/i_researched_our_memefolio_to_see_who_was/",
        "created": 1620748796.0
    },
    {
        "author": "Thetrader2896",
        "created_utc": 1620681733,
        "id": "n9ggw9",
        "num_comments": 31,
        "num_crossposts": 0,
        "selftext": "Hello all, after a crazy year last year, I had to avg down on my leaps. I originally bought my 3 leaps on Jan 4th, I now have 9 leaps at an avg of 39.85 and they are going for 19.45, my new plan is to the following: \n\nBuild on stocks that I like, invest 70% of all of my checks and keep 30% for savings/debt. I also plan on keeping my 2023 leaps as I have a lot now and I do think this stock could be 300 by Jan 2023 or Dec 2022(if so ill make 6 figures, I just think the upside is here and not selling the bottom). The company has a killer last Q report, but of course, chip shortage, or I can Plan to roll them to 2024s when they become available later this year. still up from last May. I will appreciate all your post.",
        "subreddit": "stocks",
        "title": "ENPH is now 118, I have 9 leaps now",
        "url": "https://www.reddit.com/r/stocks/comments/n9ggw9/enph_is_now_118_i_have_9_leaps_now/",
        "created": 1620710533.0
    },
    {
        "author": "Take_Notice_Walk",
        "created_utc": 1620312769,
        "id": "n692xb",
        "num_comments": 15,
        "num_crossposts": 0,
        "selftext": "I'm not saying I'm Michael Burry or Warren Buffett. But I sold ETSY @ 220 and FSLY @ 100. I didn't like their valuations, and  150% gains in just a few months was unreasonable though welcomed. So I secured the bag. \n\nUnfortunately, I didn't follow my own advice for SPCE, BEPC, and ENPH\n\nI'm not saying try to time the market. But eventually we all want to sell our stocks for profits down the line. If the market is moving at a faster rate, doesn't that mean we should sell sooner than usual?",
        "subreddit": "stocks",
        "title": "Why is the general consensus that it is better to buy &amp; hold even when the market now is moving at a faster rate than usual?",
        "url": "https://www.reddit.com/r/stocks/comments/n692xb/why_is_the_general_consensus_that_it_is_better_to/",
        "created": 1620341569.0
    },
    {
        "author": "TheStonksHub",
        "created_utc": 1621437771,
        "id": "ng8pre",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "I'm on a mission to provide quality DD on different industries and stocks. Ever since the Gamestop saga many new retail investors have joined the show. A lot of the time they invest in stocks just because they are \"popular\" without really knowing the industry or the company's business model. I'm trying to bridge that gap with my weekly DD series. I hope you enjoy.\n\n# Overview \n\nThe era of clean energy is upon us and the timing couldn’t be better to get behind Joe Biden’s newly proposed [2.3 trillion dollar](https://www.nytimes.com/2020/07/14/us/politics/biden-climate-plan.html) clean energy infrastructure plan. Clean energy generation is about to ride some huge tailwinds as described by this article on Financial Times.\n\n“Biden’s plan would see an infusion of more than $350bn directly into clean energy driving electric-vehicle infrastructure, reinvigorating the grid and boosting research and development plus an estimated $400bn extending and expanding tax credits for clean energy generation and storage. It would also set a clean energy standard mandating utilities to produce power that is carbon-free by 2035.”\n\n**Transition to Clean Energy, the Solar Industry, and Enphase**\n\nOne industry already seeing increased demand as the world shifts to clean energy is solar. In the last decade alone, solar has experienced an average annual growth rate of **42%** ([source](https://www.seia.org/solar-industry-research-data#:~:text=Solar%2520as%2520an%2520Economic%2520Engine,investment%2520in%2520the%2520American%2520economy.)). Solar is currently regarded as the cheapest source of energy in the history of the world, far surpassing coal and gas, as well as beat out wind and other renewables.\n\nhttps://preview.redd.it/4vjgoa4ch3071.png?width=758&amp;format=png&amp;auto=webp&amp;s=f94e4243370525359d8b781d773996be18ef94c0\n\nLet’s talk about one of the biggest players currently dominating this industry, Enphase (ENPH). Enphase is the largest designer and manufacturer in the solar energy market selling micro-inverters for homes, installing solar panels onto their roofs, and currently capturing over 50% of the U.S market. Enphase’s strategy revolves around four core pillars: new product development (innovating the micro-inverter), residential energy storage, commercial solar projects, and services platform.\n\nBy executing the strategies mentioned above they are expecting to increase their Serviceable Addressable Market (SAM) from $4.1 billion in 2020 to roughly \\~$14 billion in 2023. All of this is powered by organic growth and the new clean energy movement providing margins of roughly 40% which are worthy enough to write home about.\n\n**Setbacks**\n\nLike any industry or company, there will be some challenging obstacles to overcome. For Enphase, one of their biggest hurdles is the global semiconductor chip-shortage, which should give some headwinds until at least the end of 2021. The chip-shortage is not a new headline and has been plaguing many industries. On Enphase’s recent earnings call management noted that although demand remains strong they can’t fill orders because there isn’t enough material for them to keep up with demand. However, these are short term headwinds and the global semiconductor chip shortage is not expected to continue forever. Thus, this represents an excellent buying opportunity for ENPH. In a RARE occurrence even Goldman Sachs, JPMorgan, AND Barclays [all agreeing on one thing](https://www.cnbc.com/2021/04/28/enphase-posts-record-quarter-stock-slides-on-chip-shortage-pains.html) that was recommending buying the recent Enphase dip.\n\n“The silver lining is obvious to us: those looking to take the long-view on ENPH will correctly view this eventually transient headwind, as a buying opportunity on any weakness,” noted Barclays, while Goldman said that “demand and margins remain robust.”\n\n**Final Thoughts**\n\nEnphase’s dominance in this industry has allowed them to capture a large piece of this ever-growing pie. Their flagship product is still innovating with each iteration while they expand commercial and residential offerings. Their SAM is expecting to grow exponentially over the next 5-10 years and ENPH is aggressively (and succeeding) trying to capture ever dollar of it. The stock has tumbled from all-time-highs, which leaves some breathing room for a good entry since their valuation has contracted.",
        "subreddit": "StockMarket",
        "title": "The weekly DD - This week's edition is Enphase energy (ENPH): Powering the Future",
        "url": "https://www.reddit.com/r/StockMarket/comments/ng8pre/the_weekly_dd_this_weeks_edition_is_enphase/",
        "created": 1621466571.0
    },
    {
        "author": "Stone_414",
        "created_utc": 1620445437,
        "id": "n7gipw",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "So I have some understanding of wash sales but would love some confirmation.  So I got caught bag holding ENPH with a cost basis of $145.  So my idea was to sell the shares and by a LEAPS to take advantage of the loss but still profit from the upside (if there is any).  However after looking it up it seems like this would still count as a wash.\n\nNew idea buy the LEAPS first, wait 31 days and then sell the shares.  This way I’m not missing out and any potential rebound and if I’m still down and can harvest some losses.  Would this work to avoid a wash?  I understand that I am taking on more risk for those 31 days because I will be overweighted in ENPH.",
        "subreddit": "options",
        "title": "Wash sales and leaps",
        "url": "https://www.reddit.com/r/options/comments/n7gipw/wash_sales_and_leaps/",
        "created": 1620474237.0
    },
    {
        "author": "runner2012",
        "created_utc": 1621259562,
        "id": "negufq",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I out some money on green energy at the end of last year just to realize Enph is going down non-stop. Some research suggests is due to microchips shortage, which makes sense and some further review suggests it has a 50/50 chance of recovery.\n\nThen I got my control number in the mail bc there'll be a vote. Is anyone here investing in Enph? I've reviews the documents and the Board recommendation seem to make sense but wanted to double check and have some discussions here about it. In case there's something going on behind the scenes I'm not aware about. (ie it's also being shorted or something)\n\nI'm all ears, cheers",
        "subreddit": "stocks",
        "title": "Advice on Enph and voting",
        "url": "https://www.reddit.com/r/stocks/comments/negufq/advice_on_enph_and_voting/",
        "created": 1621288362.0
    },
    {
        "author": "wellidliketotellyou",
        "created_utc": 1620138226,
        "id": "n4pkfq",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "ENPH getting hit especially hard",
        "url": "https://www.reddit.com/r/stocks/comments/n4pkfq/enph_getting_hit_especially_hard/",
        "created": 1620167026.0
    },
    {
        "author": "randomaccount0923",
        "created_utc": 1620330495,
        "id": "n6fufl",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "investing",
        "title": "What's going on with ENPH and AMD",
        "url": "https://www.reddit.com/r/investing/comments/n6fufl/whats_going_on_with_enph_and_amd/",
        "created": 1620359295.0
    },
    {
        "author": "bheal",
        "created_utc": 1620716451,
        "id": "n9r09p",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "Ok fuckwits, listen up. Chad Dickens keyed me onto the fact that a certain institution was shorting his beloved CLNE. A helpful autist noticed they were shorting BE as well, so I went on a bit of a dig.\n\n&amp;#x200B;\n\nI present to you Public Enemy #1 and #2.\n\n&amp;#x200B;\n\n[Blackstone Alternative Investment Funds](https://fintel.io/i/blackstone-alternative-investment-funds) \\- [website](https://www.blackstone.com/)\n\nand\n\n[Cutler Group LP](https://fintel.io/i/cutler-group-lp) \\- [website](https://www.cutlergrouplp.com/) (history of [FINRA violations (pg 14)](https://files.brokercheck.finra.org/firm/firm_31730.pdf) for naked shorts)\n\n&amp;#x200B;\n\nBelow you will find the list of stocks I found them to be short on, and their last reported positions - which in most cases are 5/10 - yeah that's right, YESTERDAY. We know exactly what they've shorted, and we know exactly what to do, right?\n\n**We buy. We Hold. We win.**\n\nThese two hedgies are shorting almost every stock we hodl dear. They are trying to take our hard earned stimmies just because they can. Over my cold, dead tendies. These are some of the people who have driven us red the last month. These are the assholes who think they can fuck my wife without her boyfriend present. Oh HELL no.\n\nBelow are Blackstone's positions. You will see Cutler on many of those, as well as on some others that Blackstone was not in.\n\n[PLTR (5/10)](https://fintel.io/sosh/us/pltr?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-157,100 sharesLatest Disclosed Value$ -3,658,859\n\n[RKT (5/10)](https://fintel.io/sosh/us/rkt?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-2,500 sharesLatest Disclosed Value$ -57,725\n\n[MVIS (5/10)](https://fintel.io/sosh/us/mvis?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-9,600 sharesLatest Disclosed Value$ -178,080\n\n[GME (3/1)](https://fintel.io/sosh/us/gme?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-21,600 sharesLatest Disclosed Value$ -406,944\n\n[BABA (5/10)](https://fintel.io/sosh/us/baba?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-2,600 sharesLatest Disclosed Value$ -589,498\n\n[ASO (5/10)](https://fintel.io/sosh/us/aso?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-3,700 sharesLatest Disclosed Value$ -99,863\n\n[BAK (5/10)](https://fintel.io/sosh/us/bak?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-100 sharesLatest Disclosed Value$ -1,422\n\n[VIAC (5/10)](https://fintel.io/sosh/us/viac?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh) (Melvin's shorting this too)\n\nLatest Disclosed Ownership-35,329 sharesLatest Disclosed Value$ -1,593,337\n\n[ENPH (5/10)](https://fintel.io/sosh/us/enph?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -227,024\n\n[CLNE (5/10)](https://fintel.io/sosh/us/clne?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-39,000 sharesLatest Disclosed Value$ -535,860\n\n[BE (5/10)](https://fintel.io/sosh/us/be?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -37,870\n\n&amp;#x200B;\n\nAdditionally, there's a bonus in this list! \n\n&amp;#x200B;\n\nAmong those precious stocks above is one that is factually and demonstrably primed for a gamma squeeze. \n\nThis stock is a small cap, so WSB can move the price. It is not a penny stock, however, shielding it from a lot of fuckery.\n\nThis stock has significant short interest, which will assist in a gamma squeeze (it will not short squeeze, this is just an added little boost if it does gamma squeeze)\n\nThis stock has low average volume, meaning short positions will have higher DTC. This also means quicker and stronger price volatility.\n\nThis stock has been fucked harder than a Palantard and is currently at a bargain price well under any valuation you can find.\n\nAccording to Chad, there are 4 million shares worth of options that will be ITM if the stock spikes. Average volume is 3.5m.\n\nI give you CLNE.\n\nIf you want DD on it, fuck you do your own. The play is simple. \n\n**Buy shares, Hold shares, Win tendies.**",
        "subreddit": "wallstreetbets",
        "title": "DD: Do you retards want to know which specific hedgies are trying to fuck us? Added bonus: possible gamma squeeze.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9r09p/dd_do_you_retards_want_to_know_which_specific/",
        "created": 1620745251.0
    },
    {
        "author": "TheStonksHub",
        "created_utc": 1621437829,
        "id": "ng8qo8",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I'm on a mission to provide quality DD on different industries and stocks. Ever since the Gamestop saga many new retail investors have joined the show. A lot of the time they invest in stocks just because they are \"popular\" without really knowing the industry or the company's business model. I'm trying to bridge that gap with my weekly DD series. I hope you enjoy.\n\n# Overview \n\nThe era of clean energy is upon us and the timing couldn’t be better to get behind Joe Biden’s newly proposed [2.3 trillion dollar](https://www.nytimes.com/2020/07/14/us/politics/biden-climate-plan.html) clean energy infrastructure plan. Clean energy generation is about to ride some huge tailwinds as described by this article on Financial Times.\n\n“Biden’s plan would see an infusion of more than $350bn directly into clean energy driving electric-vehicle infrastructure, reinvigorating the grid and boosting research and development plus an estimated $400bn extending and expanding tax credits for clean energy generation and storage. It would also set a clean energy standard mandating utilities to produce power that is carbon-free by 2035.”\n\n**Transition to Clean Energy, the Solar Industry, and Enphase**\n\nOne industry already seeing increased demand as the world shifts to clean energy is solar. In the last decade alone, solar has experienced an average annual growth rate of **42%** ([source](https://www.seia.org/solar-industry-research-data#:~:text=Solar%2520as%2520an%2520Economic%2520Engine,investment%2520in%2520the%2520American%2520economy.)). Solar is currently regarded as the cheapest source of energy in the history of the world, far surpassing coal and gas, as well as beat out wind and other renewables.\n\n*Processing img yygau7pkh3071...*\n\n&amp;#x200B;\n\nLet’s talk about one of the biggest players currently dominating this industry, Enphase (ENPH). Enphase is the largest designer and manufacturer in the solar energy market selling micro-inverters for homes, installing solar panels onto their roofs, and currently capturing over 50% of the U.S market. Enphase’s strategy revolves around four core pillars: new product development (innovating the micro-inverter), residential energy storage, commercial solar projects, and services platform.\n\nBy executing the strategies mentioned above they are expecting to increase their Serviceable Addressable Market (SAM) from $4.1 billion in 2020 to roughly \\~$14 billion in 2023. All of this is powered by organic growth and the new clean energy movement providing margins of roughly 40% which are worthy enough to write home about.\n\n**Setbacks**\n\nLike any industry or company, there will be some challenging obstacles to overcome. For Enphase, one of their biggest hurdles is the global semiconductor chip-shortage, which should give some headwinds until at least the end of 2021. The chip-shortage is not a new headline and has been plaguing many industries. On Enphase’s recent earnings call management noted that although demand remains strong they can’t fill orders because there isn’t enough material for them to keep up with demand. However, these are short term headwinds and the global semiconductor chip shortage is not expected to continue forever. Thus, this represents an excellent buying opportunity for ENPH. In a RARE occurrence even Goldman Sachs, JPMorgan, AND Barclays [all agreeing on one thing](https://www.cnbc.com/2021/04/28/enphase-posts-record-quarter-stock-slides-on-chip-shortage-pains.html) that was recommending buying the recent Enphase dip.\n\n“The silver lining is obvious to us: those looking to take the long-view on ENPH will correctly view this eventually transient headwind, as a buying opportunity on any weakness,” noted Barclays, while Goldman said that “demand and margins remain robust.”\n\n**Final Thoughts**\n\nEnphase’s dominance in this industry has allowed them to capture a large piece of this ever-growing pie. Their flagship product is still innovating with each iteration while they expand commercial and residential offerings. Their SAM is expecting to grow exponentially over the next 5-10 years and ENPH is aggressively (and succeeding) trying to capture ever dollar of it. The stock has tumbled from all-time-highs, which leaves some breathing room for a good entry since their valuation has contracted.",
        "subreddit": "smallstreetbets",
        "title": "The weekly DD - This week's edition is Enphase energy (ENPH): Powering the Future",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/ng8qo8/the_weekly_dd_this_weeks_edition_is_enphase/",
        "created": 1621466629.0
    },
    {
        "author": "spaceset51",
        "created_utc": 1620164051,
        "id": "n4yy8b",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "What does everyone think of $ENPH?",
        "url": "https://www.reddit.com/r/stocks/comments/n4yy8b/what_does_everyone_think_of_enph/",
        "created": 1620192851.0
    },
    {
        "author": "TheStonksHub",
        "created_utc": 1621437874,
        "id": "ng8req",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "I'm on a mission to provide quality DD on different industries and stocks. Ever since the Gamestop saga many new retail investors have joined the show. A lot of the time they invest in stocks just because they are \"popular\" without really knowing the industry or the company's business model. I'm trying to bridge that gap with my weekly DD series. I hope you enjoy.\n\n# Overview \n\nThe era of clean energy is upon us and the timing couldn’t be better to get behind Joe Biden’s newly proposed [2.3 trillion dollar](https://www.nytimes.com/2020/07/14/us/politics/biden-climate-plan.html) clean energy infrastructure plan. Clean energy generation is about to ride some huge tailwinds as described by this article on Financial Times.\n\n“Biden’s plan would see an infusion of more than $350bn directly into clean energy driving electric-vehicle infrastructure, reinvigorating the grid and boosting research and development plus an estimated $400bn extending and expanding tax credits for clean energy generation and storage. It would also set a clean energy standard mandating utilities to produce power that is carbon-free by 2035.”\n\n**Transition to Clean Energy, the Solar Industry, and Enphase**\n\nOne industry already seeing increased demand as the world shifts to clean energy is solar. In the last decade alone, solar has experienced an average annual growth rate of **42%** ([source](https://www.seia.org/solar-industry-research-data#:~:text=Solar%2520as%2520an%2520Economic%2520Engine,investment%2520in%2520the%2520American%2520economy.)). Solar is currently regarded as the cheapest source of energy in the history of the world, far surpassing coal and gas, as well as beat out wind and other renewables.\n\nhttps://preview.redd.it/yl17uc2qh3071.png?width=758&amp;format=png&amp;auto=webp&amp;s=61e0e8c9f530a906ee92b66003cfde1132ad86d2\n\nLet’s talk about one of the biggest players currently dominating this industry, Enphase (ENPH). Enphase is the largest designer and manufacturer in the solar energy market selling micro-inverters for homes, installing solar panels onto their roofs, and currently capturing over 50% of the U.S market. Enphase’s strategy revolves around four core pillars: new product development (innovating the micro-inverter), residential energy storage, commercial solar projects, and services platform.\n\nBy executing the strategies mentioned above they are expecting to increase their Serviceable Addressable Market (SAM) from $4.1 billion in 2020 to roughly \\~$14 billion in 2023. All of this is powered by organic growth and the new clean energy movement providing margins of roughly 40% which are worthy enough to write home about.\n\n**Setbacks**\n\nLike any industry or company, there will be some challenging obstacles to overcome. For Enphase, one of their biggest hurdles is the global semiconductor chip-shortage, which should give some headwinds until at least the end of 2021. The chip-shortage is not a new headline and has been plaguing many industries. On Enphase’s recent earnings call management noted that although demand remains strong they can’t fill orders because there isn’t enough material for them to keep up with demand. However, these are short term headwinds and the global semiconductor chip shortage is not expected to continue forever. Thus, this represents an excellent buying opportunity for ENPH. In a RARE occurrence even Goldman Sachs, JPMorgan, AND Barclays [all agreeing on one thing](https://www.cnbc.com/2021/04/28/enphase-posts-record-quarter-stock-slides-on-chip-shortage-pains.html) that was recommending buying the recent Enphase dip.\n\n“The silver lining is obvious to us: those looking to take the long-view on ENPH will correctly view this eventually transient headwind, as a buying opportunity on any weakness,” noted Barclays, while Goldman said that “demand and margins remain robust.”\n\n**Final Thoughts**\n\nEnphase’s dominance in this industry has allowed them to capture a large piece of this ever-growing pie. Their flagship product is still innovating with each iteration while they expand commercial and residential offerings. Their SAM is expecting to grow exponentially over the next 5-10 years and ENPH is aggressively (and succeeding) trying to capture ever dollar of it. The stock has tumbled from all-time-highs, which leaves some breathing room for a good entry since their valuation has contracted.",
        "subreddit": "Wallstreetbetsnew",
        "title": "The weekly DD - This week's edition is Enphase energy (ENPH): Powering the Future",
        "url": "https://www.reddit.com/r/Wallstreetbetsnew/comments/ng8req/the_weekly_dd_this_weeks_edition_is_enphase/",
        "created": 1621466674.0
    },
    {
        "author": "valytr",
        "created_utc": 1620022309,
        "id": "n3pcd1",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "You guys should look into ENPH, seems pretty solid on its price.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n3pcd1/you_guys_should_look_into_enph_seems_pretty_solid/",
        "created": 1620051109.0
    },
    {
        "author": "eli_sakhi",
        "created_utc": 1620022876,
        "id": "n3ph22",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "ENPH hop on it before it’s to late!!! Let’s go!! This is easy money 😍",
        "url": "https://i.redd.it/4wij73o8muw61.jpg",
        "created": 1620051676.0
    },
    {
        "author": "bheal",
        "created_utc": 1620719516,
        "id": "n9rone",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": " Ok, listen up. A couple helpful posters keyed me into the fact that a certain entity was shorting two stocks, so I went on a bit of a dig.\n\nI present to you Public Enemy #1 and #2.\n\nBlackstone Alternative Investment Funds\n\nand\n\nCutler Group (has a history of violations for naked shorts)\n\nBelow you will find the list of stocks I found them to be short on, and their last reported positions - which in most cases are 5/10 - yeah that's right, YESTERDAY. We know exactly what they've shorted, and we know exactly what to do, right?\n\n**We buy. We Hold. We win.**\n\nThese two are shorting almost every stock we hold dear. They are trying to take our hard earned cash just because they can. These are some of the people who have driven us red the last month. These are the kind of people who think they can have my wife without her boyfriend present. Over my cold, uncooked tendies.\n\nBelow are Blackstone's positions. You will see Cutler on many of those, as well as on some others that Blackstone was not in.\n\n \n\n[PLTR (5/10)](https://fintel.io/sosh/us/pltr?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-157,100 sharesLatest Disclosed Value$ -3,658,859\n\n[RKT (5/10)](https://fintel.io/sosh/us/rkt?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-2,500 sharesLatest Disclosed Value$ -57,725\n\n[MVIS (5/10)](https://fintel.io/sosh/us/mvis?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-9,600 sharesLatest Disclosed Value$ -178,080\n\n[GME (3/1)](https://fintel.io/sosh/us/gme?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-21,600 sharesLatest Disclosed Value$ -406,944\n\n[BABA (5/10)](https://fintel.io/sosh/us/baba?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-2,600 sharesLatest Disclosed Value$ -589,498\n\n[ASO (5/10)](https://fintel.io/sosh/us/aso?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-3,700 sharesLatest Disclosed Value$ -99,863\n\n[BAK (5/10)](https://fintel.io/sosh/us/bak?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-100 sharesLatest Disclosed Value$ -1,422\n\n[VIAC (5/10)](https://fintel.io/sosh/us/viac?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh) (Melvin's shorting this too)\n\nLatest Disclosed Ownership-35,329 sharesLatest Disclosed Value$ -1,593,337\n\n[ENPH (5/10)](https://fintel.io/sosh/us/enph?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -227,024\n\n[CLNE (5/10)](https://fintel.io/sosh/us/clne?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-39,000 sharesLatest Disclosed Value$ -535,860\n\n[BE (5/10)](https://fintel.io/sosh/us/be?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -37,870\n\nAdditionally, there's a bonus in this list!\n\nAmong those precious stocks above is one that is primed for a gamma squeeze.\n\nThis stock is a small cap, so WSB can move the price.\n\nThis stock has significant short interest, which will assist in a gamma squeeze (it will not short squeeze, this is just an added little boost if it does gamma squeeze)\n\nThis stock has low average volume, meaning short positions will have higher DTC. This also means quicker and stronger price volatility.\n\nThis stock has been bent over hard and is currently at a bargain price well under any valuation you can find.\n\nThere are 4 million shares worth of options that will be ITM if the stock spikes. Average volume is 3.5m.\n\nI give you CLNE.\n\nIf you want DD on it, do your own. The play is simple.\n\n**Buy shares, Hold shares, Win tendies.**",
        "subreddit": "wallstreetbets",
        "title": "Do you want to know which hedgies are stealing our tendies? I sure did.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9rone/do_you_want_to_know_which_hedgies_are_stealing/",
        "created": 1620748316.0
    },
    {
        "author": "bheal",
        "created_utc": 1620718528,
        "id": "n9rgzk",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Ok you retards, listen up. A couple helpful autists keyed me into the fact that a certain hedge was shorting two stocks, so I went on a bit of a dig.\n\n&amp;#x200B;\n\nI present to you Public Enemy #1 and #2.\n\n&amp;#x200B;\n\n[Blackstone Alternative Investment Funds](https://fintel.io/i/blackstone-alternative-investment-funds) \\- [website](https://www.blackstone.com/)\n\nand\n\n[Cutler Group LP](https://fintel.io/i/cutler-group-lp) \\- [website](https://www.cutlergrouplp.com/) (history of [FINRA violations (pg 14)](https://files.brokercheck.finra.org/firm/firm_31730.pdf) for naked shorts)\n\n&amp;#x200B;\n\nBelow you will find the list of stocks I found them to be short on, and their last reported positions - which in most cases are 5/10 - yeah that's right, YESTERDAY. We know exactly what they've shorted, and we know exactly what to do, right?\n\n**We buy. We Hold. We win.**\n\nThese two hedgies are shorting almost every stock we hodl dear. They are trying to take our hard earned stimmies just because they can. These are some of the people who have driven us red the last month. These are the kind of people who think they can have my wife without her boyfriend present. Oh HELL no. Over my cold, dead tendies. \n\nBelow are Blackstone's positions. You will see Cutler on many of those, as well as on some others that Blackstone was not in.\n\n[PLTR (5/10)](https://fintel.io/sosh/us/pltr?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-157,100 sharesLatest Disclosed Value$ -3,658,859\n\n[RKT (5/10)](https://fintel.io/sosh/us/rkt?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-2,500 sharesLatest Disclosed Value$ -57,725\n\nAV LIDAR developer (5/10)\n\nLatest Disclosed Ownership-9,600 sharesLatest Disclosed Value$ -178,080\n\nvideo game store (3/1)\n\nLatest Disclosed Ownership-21,600 sharesLatest Disclosed Value$ -406,944\n\nBABA (5/10)\n\nLatest Disclosed Ownership-2,600 sharesLatest Disclosed Value$ -589,498\n\nASO (5/10)\n\nLatest Disclosed Ownership-3,700 sharesLatest Disclosed Value$ -99,863\n\nBAK (5/10)\n\nLatest Disclosed Ownership-100 sharesLatest Disclosed Value$ -1,422\n\nVIAC (5/10) (Melvin's shorting this too)\n\nLatest Disclosed Ownership-35,329 sharesLatest Disclosed Value$ -1,593,337\n\nENPH (5/10)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -227,024\n\nCLNE (5/10)\n\nLatest Disclosed Ownership-39,000 sharesLatest Disclosed Value$ -535,860\n\nBE (5/10)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -37,870\n\nMost links removed, just change the ticker in the links above to see them.\n\n&amp;#x200B;\n\nAdditionally, there's a bonus in this list! \n\n&amp;#x200B;\n\nAmong those precious stocks above is one that is factually and demonstrably primed for a gamma squeeze. \n\nThis stock is a small cap, so WSB can move the price.\n\nThis stock has significant short interest, which will assist in a gamma squeeze (it will not short squeeze, this is just an added little boost if it does gamma squeeze)\n\nThis stock has low average volume, meaning short positions will have higher DTC. This also means quicker and stronger price volatility.\n\nThis stock has been bent over harder than a Palantard and is currently at a bargain price well under any valuation you can find.\n\nAccording to Chad, there are 4 million shares worth of options that will be ITM if the stock spikes. Average volume is 3.5m.\n\nI give you CLNE.\n\nIf you want DD on it, do your own. The play is simple. \n\n**Buy shares, Hold shares, Win tendies.**",
        "subreddit": "wallstreetbets",
        "title": "Do you want to know which hedgies are trying to take your tendies?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9rgzk/do_you_want_to_know_which_hedgies_are_trying_to/",
        "created": 1620747328.0
    },
    {
        "author": "bheal",
        "created_utc": 1620716854,
        "id": "n9r3ko",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Ok you retards, listen up. Chad Dickens keyed me onto the fact that a certain institution was shorting his beloved CLNE. A helpful autist noticed they were shorting BE as well, so I went on a bit of a dig.\n\n&amp;#x200B;\n\nI present to you Public Enemy #1 and #2.\n\n&amp;#x200B;\n\n[Blackstone Alternative Investment Funds](https://fintel.io/i/blackstone-alternative-investment-funds) \\- [website](https://www.blackstone.com/)\n\nand\n\n[Cutler Group LP](https://fintel.io/i/cutler-group-lp) \\- [website](https://www.cutlergrouplp.com/) (history of [FINRA violations (pg 14)](https://files.brokercheck.finra.org/firm/firm_31730.pdf) for naked shorts)\n\n&amp;#x200B;\n\nBelow you will find the list of stocks I found them to be short on, and their last reported positions - which in most cases are 5/10 - yeah that's right, YESTERDAY. We know exactly what they've shorted, and we know exactly what to do, right?\n\n**We buy. We Hold. We win.**\n\nThese two hedgies are shorting almost every stock we hodl dear. They are trying to take our hard earned stimmies just because they can. Over my cold, dead tendies. These are some of the people who have driven us red the last month. These are the assholes who think they can fuck my wife without her boyfriend present. Oh HELL no.\n\nBelow are Blackstone's positions. You will see Cutler on many of those, as well as on some others that Blackstone was not in.\n\n[PLTR (5/10)](https://fintel.io/sosh/us/pltr?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-157,100 sharesLatest Disclosed Value$ -3,658,859\n\n[RKT (5/10)](https://fintel.io/sosh/us/rkt?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-2,500 sharesLatest Disclosed Value$ -57,725\n\n[MVIS (5/10)](https://fintel.io/sosh/us/mvis?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-9,600 sharesLatest Disclosed Value$ -178,080\n\n[GME (3/1)](https://fintel.io/sosh/us/gme?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-21,600 sharesLatest Disclosed Value$ -406,944\n\n[BABA (5/10)](https://fintel.io/sosh/us/baba?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-2,600 sharesLatest Disclosed Value$ -589,498\n\n[ASO (5/10)](https://fintel.io/sosh/us/aso?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-3,700 sharesLatest Disclosed Value$ -99,863\n\n[BAK (5/10)](https://fintel.io/sosh/us/bak?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-100 sharesLatest Disclosed Value$ -1,422\n\n[VIAC (5/10)](https://fintel.io/sosh/us/viac?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh) (Melvin's shorting this too)\n\nLatest Disclosed Ownership-35,329 sharesLatest Disclosed Value$ -1,593,337\n\n[ENPH (5/10)](https://fintel.io/sosh/us/enph?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -227,024\n\n[CLNE (5/10)](https://fintel.io/sosh/us/clne?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-39,000 sharesLatest Disclosed Value$ -535,860\n\n[BE (5/10)](https://fintel.io/sosh/us/be?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -37,870\n\n&amp;#x200B;\n\nAdditionally, there's a bonus in this list! \n\n&amp;#x200B;\n\nAmong those precious stocks above is one that is factually and demonstrably primed for a gamma squeeze. \n\nThis stock is a small cap, so WSB can move the price. It is not a penny stock, however, shielding it from a lot of fuckery.\n\nThis stock has significant short interest, which will assist in a gamma squeeze (it will not short squeeze, this is just an added little boost if it does gamma squeeze)\n\nThis stock has low average volume, meaning short positions will have higher DTC. This also means quicker and stronger price volatility.\n\nThis stock has been fucked harder than a Palantard and is currently at a bargain price well under any valuation you can find.\n\nAccording to Chad, there are 4 million shares worth of options that will be ITM if the stock spikes. Average volume is 3.5m.\n\nI give you CLNE.\n\nIf you want DD on it, fuck you do your own. The play is simple. \n\n**Buy shares, Hold shares, Win tendies.**",
        "subreddit": "wallstreetbets",
        "title": "DD: Do you retards want to know which specific hedgies are trying to take your tendies? Added bonus: possible gamma squeeze.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9r3ko/dd_do_you_retards_want_to_know_which_specific/",
        "created": 1620745654.0
    },
    {
        "author": "bheal",
        "created_utc": 1620718058,
        "id": "n9rd72",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Ok you retards, listen up. Chad Dickens keyed me onto the fact that a certain institution was shorting his beloved CLNE. A helpful autist noticed they were shorting BE as well, so I went on a bit of a dig.\n\n&amp;#x200B;\n\nI present to you Public Enemy #1 and #2.\n\n&amp;#x200B;\n\n[Blackstone Alternative Investment Funds](https://fintel.io/i/blackstone-alternative-investment-funds) \\- [website](https://www.blackstone.com/)\n\nand\n\n[Cutler Group LP](https://fintel.io/i/cutler-group-lp) \\- [website](https://www.cutlergrouplp.com/) (history of [FINRA violations (pg 14)](https://files.brokercheck.finra.org/firm/firm_31730.pdf) for naked shorts)\n\n&amp;#x200B;\n\nBelow you will find the list of stocks I found them to be short on, and their last reported positions - which in most cases are 5/10 - yeah that's right, YESTERDAY. We know exactly what they've shorted, and we know exactly what to do, right?\n\n**We buy. We Hold. We win.**\n\nThese two hedgies are shorting almost every stock we hodl dear. They are trying to take our hard earned stimmies just because they can. Over my cold, dead tendies. These are some of the people who have driven us red the last month. These are the assholes who think they can fuck my wife without her boyfriend present. Oh HELL no.\n\nBelow are Blackstone's positions. You will see Cutler on many of those, as well as on some others that Blackstone was not in.\n\n[PLTR (5/10)](https://fintel.io/sosh/us/pltr?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-157,100 sharesLatest Disclosed Value$ -3,658,859\n\n[RKT (5/10)](https://fintel.io/sosh/us/rkt?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-2,500 sharesLatest Disclosed Value$ -57,725\n\n[micro vis (5/10)](https://fintel.io/sosh/us/mvis?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-9,600 sharesLatest Disclosed Value$ -178,080\n\n[video game store (3/1)](https://fintel.io/sosh/us/gme?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-21,600 sharesLatest Disclosed Value$ -406,944\n\n[BABA (5/10)](https://fintel.io/sosh/us/baba?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-2,600 sharesLatest Disclosed Value$ -589,498\n\n[ASO (5/10)](https://fintel.io/sosh/us/aso?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-3,700 sharesLatest Disclosed Value$ -99,863\n\n[BAK (5/10)](https://fintel.io/sosh/us/bak?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-100 sharesLatest Disclosed Value$ -1,422\n\n[VIAC (5/10)](https://fintel.io/sosh/us/viac?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh) (Melvin's shorting this too)\n\nLatest Disclosed Ownership-35,329 sharesLatest Disclosed Value$ -1,593,337\n\n[ENPH (5/10)](https://fintel.io/sosh/us/enph?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -227,024\n\n[CLNE (5/10)](https://fintel.io/sosh/us/clne?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-39,000 sharesLatest Disclosed Value$ -535,860\n\n[BE (5/10)](https://fintel.io/sosh/us/be?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -37,870\n\n&amp;#x200B;\n\nAdditionally, there's a bonus in this list! \n\n&amp;#x200B;\n\nAmong those precious stocks above is one that is factually and demonstrably primed for a gamma squeeze. \n\nThis stock is a small cap, so WSB can move the price. It is not a penny stock, however, shielding it from a lot of shenanigans.\n\nThis stock has significant short interest, which will assist in a gamma squeeze (it will not short squeeze, this is just an added little boost if it does gamma squeeze)\n\nThis stock has low average volume, meaning short positions will have higher DTC. This also means quicker and stronger price volatility.\n\nThis stock has been bent over harder than a Palantard and is currently at a bargain price well under any valuation you can find.\n\nAccording to Chad, there are 4 million shares worth of options that will be ITM if the stock spikes. Average volume is 3.5m.\n\nI give you CLNE.\n\nIf you want DD on it, fuck you do your own. The play is simple. \n\n**Buy shares, Hold shares, Win tendies.**",
        "subreddit": "wallstreetbets",
        "title": "Do you want to know which hedgies are trying to take your tendies? Added bonus: possible gamma squeeze.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9rd72/do_you_want_to_know_which_hedgies_are_trying_to/",
        "created": 1620746858.0
    },
    {
        "author": "bheal",
        "created_utc": 1620718896,
        "id": "n9rjv0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " \n\nOk you retards, listen up. A couple helpful autists keyed me into the fact that a certain hedge was shorting two stocks, so I went on a bit of a dig.\n\nI present to you Public Enemy #1 and #2.\n\n[Blackstone Alternative Investment Funds](https://fintel.io/i/blackstone-alternative-investment-funds)\n\nand\n\n[Cutler Group LP](https://fintel.io/i/cutler-group-lp) (history of [FINRA violations (pg 14)](https://brokercheck.finra.org/firm/summary/31730) for naked shorts)\n\nBelow you will find the list of stocks I found them to be short on, and their last reported positions - which in most cases are 5/10 - yeah that's right, YESTERDAY. We know exactly what they've shorted, and we know exactly what to do, right?\n\n**We buy. We Hold. We win.**\n\nThese two hedgies are shorting almost every stock we hodl dear. They are trying to take our hard earned stimmies just because they can. These are some of the people who have driven us red the last month. These are the kind of people who think they can have my wife without her boyfriend present. Oh HELL no. Over my cold, dead tendies. \n\nBelow are Blackstone's positions. You will see Cutler on many of those, as well as on some others that Blackstone was not in.\n\n[PLTR (5/10)](https://fintel.io/sosh/us/pltr?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-157,100 sharesLatest Disclosed Value$ -3,658,859\n\n[RKT (5/10)](https://fintel.io/sosh/us/rkt?utm_source=stocktwits.com&amp;utm_medium=Referral&amp;utm_campaign=sosh)\n\nLatest Disclosed Ownership-2,500 sharesLatest Disclosed Value$ -57,725\n\nAV LIDAR developer (5/10)\n\nLatest Disclosed Ownership-9,600 sharesLatest Disclosed Value$ -178,080\n\nvideo game store (3/1)\n\nLatest Disclosed Ownership-21,600 sharesLatest Disclosed Value$ -406,944\n\nBABA (5/10)\n\nLatest Disclosed Ownership-2,600 sharesLatest Disclosed Value$ -589,498\n\nASO (5/10)\n\nLatest Disclosed Ownership-3,700 sharesLatest Disclosed Value$ -99,863\n\nBAK (5/10)\n\nLatest Disclosed Ownership-100 sharesLatest Disclosed Value$ -1,422\n\nVIAC (5/10) (Melvin's shorting this too)\n\nLatest Disclosed Ownership-35,329 sharesLatest Disclosed Value$ -1,593,337\n\nENPH (5/10)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -227,024\n\nCLNE (5/10)\n\nLatest Disclosed Ownership-39,000 sharesLatest Disclosed Value$ -535,860\n\nBE (5/10)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -37,870\n\nMost links removed, just change the ticker in the links above to see them.\n\n&amp;#x200B;\n\nAdditionally, there's a bonus in this list! \n\nAmong those precious stocks above is one that is factually and demonstrably primed for a gamma squeeze. \n\nThis stock is a small cap, so WSB can move the price.\n\nThis stock has significant short interest, which will assist in a gamma squeeze (it will not short squeeze, this is just an added little boost if it does gamma squeeze)\n\nThis stock has low average volume, meaning short positions will have higher DTC. This also means quicker and stronger price volatility.\n\nThis stock has been bent over harder than a Palantard and is currently at a bargain price well under any valuation you can find.\n\nAccording to Chad, there are 4 million shares worth of options that will be ITM if the stock spikes. Average volume is 3.5m.\n\nI give you CLNE.\n\nIf you want DD on it, do your own. The play is simple. \n\n**Buy shares, Hold shares, Win tendies.**",
        "subreddit": "wallstreetbets",
        "title": "Do you want to know which hedgies are shorting our stocks?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9rjv0/do_you_want_to_know_which_hedgies_are_shorting/",
        "created": 1620747696.0
    },
    {
        "author": "randomaccount0923",
        "created_utc": 1620330417,
        "id": "n6ftdo",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "stocks",
        "title": "What's going on with AMD and ENPH",
        "url": "https://www.reddit.com/r/stocks/comments/n6ftdo/whats_going_on_with_amd_and_enph/",
        "created": 1620359217.0
    },
    {
        "author": "GosuTe",
        "created_utc": 1620385164,
        "id": "n6vu9j",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I know that many of us were in PLUG and in ICLN as well (not CLNE)\n\nICLN - ath $34.25, today $21,65 - 6m change: +1,68%\n\nPLUG - ath $75,49 xd, today $22,77 - 6m change +20.73%\n\n&amp;#x200B;\n\nDon't get me wrong but PLUG has still a lot of space to drop - regarding to ETF.\n\nPLUG weight in ICLN \n\non Dec 31, 2020 - 6,18%, price $33,91\n\non Mar 31, 2021- 7,51%, price $35,84\n\non Apr 30, 2021 - 4.05%, price $28,51\n\non May 05, 2021 - 3,64%, price $24,28\n\nTo be honest PLUG tanks this ETF... fcking great job...\n\n&amp;#x200B;\n\nOkay and now update for May 05, 2021:\n\n1. VWS - Vestas Wind Systems- #green 8,55% &gt; 8,67%\n\n2. ORSTED - ORSTED - #green 6.11% &gt; 6,27%\n\n3. ENPH - Enphase Energy Inc - #red 5.08% &gt; 4,88%\n\n4. XEL - Xcel Energy Inc - #green 4.52% &gt;4,73%\n\n5. IBE - Iberdrola SA - #green 4.42% &gt;4,70%\n\n6. ENEL - Enel - #green 4,21% &gt; 4,44%\n\n7. NEE - Nextera Energy Inc - #green 4,32% &gt; 4,34%\n\n8. PLUG - Plug Power Inc - #red 4.05% &gt; 3,64%\n\n9. SEDG - Solaredge Technologies Inc - #red 3,84% &gt; 3,37%\n\n10. SSE - SSE PLC - #green 3,01% &gt; 3,17%\n\n11. EDP - EDP Energias de Portugal SA - #green 2,77% &gt; 2,88%\n\n12. PCG - PG&amp;E Corp - #green 2,38% &gt; 2,44%\n\n13. SGRE - Siemens Gamesa Renewable E. SA - #red 2,30% &gt; 2,27%\n\n14. RUN - SUNRUN Inc - #red 2,22% &gt; 2,00%\n\n15. ENR - Siemens Energy N AG - #green 1,89% &gt; 1,95%\n\n16. 968 - XINYI Solar Holdings LTD - #green NEW 1,98% \n\n17. FSLR - First Solar Inc - #green 1,83% &gt; 1,88%\n\n18. EDPR - EDP Renovaveis SA - #green 1,45% &gt; 1,50%\n\n19. AQN - Algonquin Power Utilities Corp - #green 1,36% &gt; 1,41%\n\n20. 916 - China Longyuan Power Group - #green 1,28% &gt; 1,35%\n\n21. NPI - Northland Power Inc -#green 1.31% &gt; 1,33%\n\n22. VER - Verbund AG - #green 1,26% &gt; 1,31%\n\n23. IDA - Idacorp Inc - #green 1,10% &gt; 1,15%\n\n24. BLDP - Ballard Power System Inc - #red 1,50% &gt; 1,14%\n\n25. DQ - DAQO New Energy ADR - #green 1,11% &gt; 1,12%\n\n&amp;#x200B;\n\nRest is below 1%, more u can find here: [https://www.ishares.com/us/products/239738/ishares-global-clean-energy-etf](https://www.ishares.com/us/products/239738/ishares-global-clean-energy-etf)\n\n&amp;#x200B;\n\nWhat that mean? In my opinion first of all we are droping this PLUG bagholding...\n\n1. VWS - EPS: -0,06, bottom Mar 8: 27,81 (trend up)\n\n2. ORSTED - EPS 2.8 / Revenue:18.94B, Forecast: bottom May 6: 856,58 (since Mar 8 trend down)\n\n3. ENPH - EPS 0.56 / Revenue: 301,75M, Forecast: 292,45M, bottom May 6: 118.22 (since Mar 8 trend down)\n\n4. XEL - EPS 0.67 / Revenue: 3,54B, Forecast: 2,9B, bottom Mar 3: 58,10 (since Mar 8 trend up)\n\n5. IBE - May 12 earnings call Forecast: 10,75B, bottom Mar 3: 10,01 (since Mar 8 trend up)\n\n6. ENEL - May 7 earnings call, Forecast: 18,79B, bottom Mar 3: 7,62 (since Mar 8 trend up)\n\n7. NEE - EPS 0.67 / Revenue: 3,73B, Forecast: 4,87B, bottom Mar 5: 70,63 (since Mar 8 trend up)\n\n8. PLUG - uhghghgh May 11 earnings call (Feb 25 EPS was -1,12...), Forecast: 74,83M, bottom May 6: 22,47 (since Mar 8 trend fcking down)\n\n9. SEDG - EPS 0.55 / Revenue: 405,49M, Forecast: 395,46M, bottom May 6: 209,30 (since Mar 8 trend down)\n\n10. SSE PLC - May 26 earnings call, Forecast: 4,22B, bottom Mar 3: 1301 (since Mar 8 trend up)\n\n&amp;#x200B;\n\nThat what I see: \n\n1. Company earnings are lower in winter. I don't know nobody who build house in winter and install solars etc...\n\n2. Big correlation with TSLA - car sellings are also lower in winter time ( Christmas etc.) for all car makers.\n\n3. Big correlation with whole tech. market.\n\n4. Pump&amp;Dump with PLUG for sure tanks this ETF\n\n5. Petro time is over (not in 100%, I know we still need this petro)\n\n6. Agenda 2030 and whole climate changes\n\n7. Reversal correlation with petro companys\n\n8. Uncle Joe and green energy promotions\n\n9. In Europe we have big donations from government to promote green energy (solars, cars)\n\n10. Car makers are hitting EV like crazy, all companys are working now on EV.\n\n11. Volkswagen stopped working on new engines, they will only upgrade this what they have now and till 2040 they want to stop using combustion engines.\n\nlink: [https://www.motor1.com/news/495958/vw-stopping-gas-engine-development/](https://www.motor1.com/news/495958/vw-stopping-gas-engine-development/)\n\n&amp;#x200B;\n\nAs long as tech market is growing Clean Energy will grow in the same way.",
        "subreddit": "wallstreetbets",
        "title": "Global Clean Energy ETF - ICLN, update in portfolio",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n6vu9j/global_clean_energy_etf_icln_update_in_portfolio/",
        "created": 1620413964.0
    },
    {
        "author": "Appropriate-Fill9251",
        "created_utc": 1620143981,
        "id": "n4rvs0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "StockMarket",
        "title": "Hello looking for ideas and thoughts. I’m 23 years old. Wanting to be more concentrated on the winners. My current account total $16,xxx TSLA 30% BLOK 10% AMZN 6% AAPL 6% COIN 6% ENPH 6% YOLO 5% ARKG 5% ARKW 5% PBW 5% ETSY 4% NNDM 4% PLTR 4% RDFN 4%",
        "url": "https://www.reddit.com/r/StockMarket/comments/n4rvs0/hello_looking_for_ideas_and_thoughts_im_23_years/",
        "created": 1620172781.0
    },
    {
        "author": "1976transam",
        "created_utc": 1620395311,
        "id": "n6ywr8",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "The hedges have shorted big time. Time for a hug",
        "subreddit": "wallstreetbets",
        "title": "ENPH",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n6ywr8/enph/",
        "created": 1620424111.0
    },
    {
        "author": "valytr",
        "created_utc": 1620022761,
        "id": "n3pg3j",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "ENPH to the moon. Let’s go and get it",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n3pg3j/enph_to_the_moon_lets_go_and_get_it/",
        "created": 1620051561.0
    },
    {
        "author": "GosuTe",
        "created_utc": 1620384358,
        "id": "n6vn12",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hi Apes,  \nI know that many of us were in PLUG and in ICLN as well (not CLNE)  \nICLN - ath $34.25, today $21,65 - 6m change: +1,68%  \nPLUG - ath $75,49 xd, today $22,77 - 6m change +20.73%  \n\n\nDon't get me wrong but PLUG has still a lot of space to drop - regarding to ETF.  \nPLUG weight in ICLN   \non Dec 31, 2020 - 6,18%, price $33,91  \non Mar 31, 2021- 7,51%, price $35,84  \non Apr 30, 2021 - 4.05%, price $28,51  \non May 05, 2021 - 3,64%, price $24,28  \nTo be honest PLUG tanks this ETF... fcking great job...  \n\n\n\\#Okay and now update for May 05, 2021:  \n1. VWS - Vestas Wind Systems- #green 8,55% &gt; 8,67%  \n2. ORSTED - ORSTED - #green 6.11% &gt; 6,27%  \n3. ENPH - Enphase Energy Inc - #red 5.08% &gt; 4,88%  \n4. XEL - Xcel Energy Inc - #green 4.52% &gt;4,73%  \n5. IBE - Iberdrola SA - #green 4.42% &gt;4,70%  \n6. ENEL - Enel - #green 4,21% &gt; 4,44%  \n7. NEE - Nextera Energy Inc - #green 4,32% &gt; 4,34%  \n8. PLUG - Plug Power Inc - #red 4.05% &gt; 3,64%  \n9. SEDG - Solaredge Technologies Inc - #red 3,84% &gt; 3,37%  \n10. SSE - SSE PLC - #green 3,01% &gt; 3,17%  \n11. EDP - EDP Energias de Portugal SA - #green 2,77% &gt; 2,88%  \n12. PCG - PG&amp;E Corp - #green 2,38% &gt; 2,44%  \n13. SGRE - Siemens Gamesa Renewable E. SA - #red 2,30% &gt; 2,27%  \n14. RUN - SUNRUN Inc - #red 2,22% &gt; 2,00%  \n15. ENR - Siemens Energy N AG - #green 1,89% &gt; 1,95%  \n16. 968 - XINYI Solar Holdings LTD - #green NEW 1,98%   \n17. FSLR - First Solar Inc - #green 1,83% &gt; 1,88%  \n18. EDPR - EDP Renovaveis SA - #green 1,45% &gt; 1,50%  \n19. AQN - Algonquin Power Utilities Corp - #green 1,36% &gt; 1,41%  \n20. 916 - China Longyuan Power Group - #green 1,28% &gt; 1,35%  \n21. NPI - Northland Power Inc -#green 1.31% &gt; 1,33%  \n22. VER - Verbund AG - #green 1,26% &gt; 1,31%  \n23. IDA - Idacorp Inc - #green 1,10% &gt; 1,15%  \n24. BLDP - Ballard Power System Inc - #red 1,50% &gt; 1,14%  \n25. DQ - DAQO New Energy ADR - #green 1,11% &gt; 1,12%  \n\n\nRest is below 1%, more u can find here: [https://www.ishares.com/us/products/239738/ishares-global-clean-energy-etf](https://www.ishares.com/us/products/239738/ishares-global-clean-energy-etf)  \n\n\nWhat that mean? In my opinion first of all we are droping this PLUG bagholding...  \n1. VWS - EPS: -0,06, bottom Mar 8: 27,81 (trend up)  \n2. ORSTED - EPS 2.8 / Revenue:18.94B, Forecast: bottom May 6: 856,58 (since Mar 8 trend down)  \n3. ENPH - EPS 0.56 / Revenue: 301,75M, Forecast: 292,45M, bottom May 6: 118.22 (since Mar 8 trend down)  \n4. XEL - EPS 0.67 / Revenue: 3,54B, Forecast: 2,9B, bottom Mar 3: 58,10 (since Mar 8 trend up)  \n5. IBE - May 12 earnings call Forecast: 10,75B, bottom Mar 3: 10,01 (since Mar 8 trend up)  \n6. ENEL - May 7 earnings call, Forecast: 18,79B, bottom Mar 3: 7,62 (since Mar 8 trend up)  \n7. NEE - EPS 0.67 / Revenue: 3,73B, Forecast: 4,87B, bottom Mar 5: 70,63 (since Mar 8 trend up)  \n8. PLUG - uhghghgh May 11 earnings call (Feb 25 EPS was -1,12...), Forecast: 74,83M, bottom May 6: 22,47 (since Mar 8 trend fcking down)  \n9. SEDG - EPS 0.55 / Revenue: 405,49M, Forecast: 395,46M, bottom May 6: 209,30 (since Mar 8 trend down)  \n10. SSE PLC - May 26 earnings call, Forecast: 4,22B, bottom Mar 3: 1301 (since Mar 8 trend up)  \n\n\n\\#That what I see:   \n1. Company earnings are lower in winter. I don't know nobody who build house in winter and install solars etc...  \n2. Big correlation with TSLA - car sellings are also lower in winter time ( Christmas etc.) for all car makers.  \n3. Big correlation with whole tech. market.  \n4. Pump&amp;Dump with PLUG for sure tanks this ETF  \n5. Petro time is over (not in 100%, I know we still need this petro)  \n6. Agenda 2030 and whole climate changes  \n7. Reversal correlation with petro companys  \n8. Uncle Joe and green energy promotions  \n9. In Europe we have big donations from government to promote green energy (solars, cars)  \n10. Car makers are hitting EV like crazy, all companys are working now on EV.  \n11. Volkswagen stopped working on new engines, they will only upgrade this what they have now and till 2040 they want to stop using combustion engines.  \nlink: [https://www.motor1.com/news/495958/vw-stopping-gas-engine-development/](https://www.motor1.com/news/495958/vw-stopping-gas-engine-development/)  \n\n\nAs long as tech market is growing Clean Energy will grow in the same way.",
        "subreddit": "wallstreetbets",
        "title": "ICLN - global clean energy ETF &lt; update in portfolio!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n6vn12/icln_global_clean_energy_etf_update_in_portfolio/",
        "created": 1620413158.0
    },
    {
        "author": "bheal",
        "created_utc": 1620719120,
        "id": "n9rljn",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": " Ok kids, listen up. A couple helpful posters keyed me into the fact that a certain hedge was shorting two stocks, so I went on a bit of a dig.\n\nI present to you Public Enemy #1 and #2.\n\nBlackstone Alternative Investment Funds\n\nand\n\nCutler Group LP (has a history of violations for naked shorts)\n\nBelow you will find the list of stocks I found them to be short on, and their last reported positions - which in most cases are 5/10 - yeah that's right, YESTERDAY. We know exactly what they've shorted, and we know exactly what to do, right?\n\n**We buy. We Hold. We win.**\n\nThese two hedgies are shorting almost every stock we hodl dear. They are trying to take our hard earned stimmies just because they can. These are some of the people who have driven us red the last month. These are the kind of people who think they can have my wife without her boyfriend present. Oh HELL no. Over my cold, dead tendies. \n\nBelow are Blackstone's positions. You will see Cutler on many of those, as well as on some others that Blackstone was not in.\n\nPLTR (5/10)\n\nLatest Disclosed Ownership-157,100 sharesLatest Disclosed Value$ -3,658,859\n\nRKT (5/10)\n\nLatest Disclosed Ownership-2,500 sharesLatest Disclosed Value$ -57,725\n\nAV LIDAR developer (5/10)\n\nLatest Disclosed Ownership-9,600 sharesLatest Disclosed Value$ -178,080\n\nvideo game store (3/1)\n\nLatest Disclosed Ownership-21,600 sharesLatest Disclosed Value$ -406,944\n\nBABA (5/10)\n\nLatest Disclosed Ownership-2,600 sharesLatest Disclosed Value$ -589,498\n\nASO (5/10)\n\nLatest Disclosed Ownership-3,700 sharesLatest Disclosed Value$ -99,863\n\nBAK (5/10)\n\nLatest Disclosed Ownership-100 sharesLatest Disclosed Value$ -1,422\n\nVIAC (5/10) (Melvin's shorting this too)\n\nLatest Disclosed Ownership-35,329 sharesLatest Disclosed Value$ -1,593,337\n\nENPH (5/10)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -227,024\n\nCLNE (5/10)\n\nLatest Disclosed Ownership-39,000 sharesLatest Disclosed Value$ -535,860\n\nBE (5/10)\n\nLatest Disclosed Ownership-1,400 sharesLatest Disclosed Value$ -37,870\n\n&amp;#x200B;\n\nAdditionally, there's a bonus in this list! \n\nAmong those precious stocks above is one that is primed for a gamma squeeze. \n\nThis stock is a small cap, so WSB can move the price.\n\nThis stock has significant short interest, which will assist in a gamma squeeze (it will not short squeeze, this is just an added little boost if it does gamma squeeze)\n\nThis stock has low average volume, meaning short positions will have higher DTC. This also means quicker and stronger price volatility.\n\nThis stock has been bent over hard and is currently at a bargain price well under any valuation you can find.\n\nThere are 4 million shares worth of options that will be ITM if the stock spikes. Average volume is 3.5m.\n\nI give you CLNE.\n\nIf you want DD on it, do your own. The play is simple. \n\n**Buy shares, Hold shares, Win tendies.**",
        "subreddit": "wallstreetbets",
        "title": "Do you want to know which hedge funds are shorting WSB stocks?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n9rljn/do_you_want_to_know_which_hedge_funds_are/",
        "created": 1620747920.0
    }
]