[
    {
        "author": "humptydumptyfrumpty",
        "created_utc": 1610316905,
        "id": "kuog4u",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "I've been in the telecommunications industry for many years, an investor for a few decades but mostly mfunds.  Wsb lurker.\n\nWhat I'm writing today about is my insights to broadband technology to the home. Not 5g, aapl or some shit. All the actual products that make your broadband work.\n\nHistory:\nBack in the day (15 to 20 years ago), your main vendors for dsl was alcatel, adtran, AFC/tellabs, the huge companies.\nCisco focused mostly on cable cmts platforms.\nCosts were very high and it was all capital in equipment spending. Profits were also high as anything other than dialup was worth the huge spend.\n \nI have seen dozens of vendors drop off the face of the earth for broadband such as copper mountain, teledyne, zhone (recently back in the picture but not much), pannaway, occam. Tellabs has fallen to an also ran and adtean also lags well behind in innovation and sales.\n\nIn the last few years the focus has been on fiber to the home which is basically the golden ticket.  Whoever gets there first in a city, wins the customers, spawning a huge race.\nCable is still very fast but DSL, even later versions is way too slow, and fiber is the end goal.\n\nI've used calix equipment for over 15 years and have watched it change from an equipment provider to a behemoth of marketing and monthly income.  Here's a short history to summarize:\n\n-calix has competing platform for vdsl, fiber and dial tone with occam networks.  They purchase occam for the platform, thereby merging two of the largest smaller companies into one. 2010.\n\n-calix purchases ericcsons fiber to the home tech in 2012\n\n-2015, calix focuses on moving things to the cloud using aws. They develop everything from management of the end user devices, customer cloud based app for their antivirus, wifi settings, etc.\nAlso a marketing app that pulls all the customer data, speeds, usage and allows providers to contact and upsell.  A complete ecosystem end to end not just an equipment provider.\n\n-calix becomes first ngpon2 supplier for 10 gigabit pon including signing a huge contract with Verizon a few years ago.\n\n-calix becomes the first mesh wifi provider for good in home wifi from ISP, including new wifi6 802.11ax. no other vendor has a wifi6 solution available.\n\nThat takes us up to where we are now.\nSo what's good going forward ?\n\n1) huawei/zte aren't used in north america much anymore as competition.   Bell canada used them a lot for LTE radios in cellular and for gpon fiber. They have been replaced with alcatel-lucent which is now called nokia.  Nokia costs a lot more, most companies do not use them.\n\n2) ceo and founder is Carl Russo, who also founded cerent before selling to cisco for a fortune. Several vp have come from bell canada, microsoft and at&amp;t and are well known experts in their field.\n\n3) sales and profits have been increasing every quarter for years,. Not pump and dump.\n\n4) manufacturing went to Vietnam in the wake of trump and chinese tariffs, so not affected by potential chinese relations with biden taking over.\n\n5) Covid19- the world is working from home, learning from home. This has caused all levels of government to provide massive subsidies and funding to build broadband to rural and semi rural areas where calix is the number one supplier.  With the monthly cloud subscriptions for managing all the customers it's not just sales, but ongoing revenue.\n\n6) they are hiring at a ridiculous pace. Their website has list to all postings.  \n\n7) the last few years and continuing are broadband initiatives i.e. \nhttps://www.calix.com/news-and-events/news-and-media-hub.html\n\n8) financial reports show good growth and ongoing sales trending upwards. Broadband growth continues to rise. Q4 announcements end of this month.\nStock has already gone up in price by 6x in 12 months.\nhttps://investor-relations.calix.com/home/default.aspx\n\nhttps://finance.yahoo.com/quote/CALX/\n\nI don't own any stock, not saying it's a sure thing or pumping it.  I do think that they are still under valued and growing at a fast but steady rate.\nCheers.",
        "subreddit": "wallstreetbets",
        "title": "CALX DD-as an industry veteran. No current position.Hear me out retards.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kuog4u/calx_ddas_an_industry_veteran_no_current/",
        "created": 1610345705.0
    },
    {
        "author": "DanBaileysBigToe",
        "created_utc": 1611077229,
        "id": "l0ojid",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "I have a question about the recent acquisition of $FLIR by Teledyne. Everything I read said that stock holders will receive $28 dollars cash and 0.0178 shares of Teledyne per share of $FLIR owned.  How is the cash and $TDY distributed? \nAlso, are there any stipulations about how long you previously owned the stock and/or how soon after the acquisition you need to hold the stock?  I own 104 shares and have owned them since March, I am considering selling soon. \nThanks for the help.",
        "subreddit": "stocks",
        "title": "$FLIR acquisition question",
        "url": "https://www.reddit.com/r/stocks/comments/l0ojid/flir_acquisition_question/",
        "created": 1611106029.0
    },
    {
        "author": "cbcady",
        "created_utc": 1609878593,
        "id": "kr70fc",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "I've been a shareholder of FLIR for awhile now. News broke yesterday that Teledyne would be acquiring FLIR where shareholders would receive $28 in cash and 0.0718 shares of Teledyne for each share owned, equal to a total purchase price of $56 per FLIR share. I'm now trying to figure out what to do with the stock. If the FLIR stock goes over $56 before the transition occurs does that mean I should sell? Any other relevant information here I should consider? I'm not as smart as I'd like to be when stuff like this happens so any help would be appreciated. \n\nFor reference, I would be paying Long Term Capital Gains (15%) if I sell.",
        "subreddit": "stocks",
        "title": "FLIR Shareholder Question - Teledyne (TDY) to acquire FLIR (FLIR)",
        "url": "https://www.reddit.com/r/stocks/comments/kr70fc/flir_shareholder_question_teledyne_tdy_to_acquire/",
        "created": 1609907393.0
    },
    {
        "author": "_zerokarma_",
        "created_utc": 1609786125,
        "id": "kqf01x",
        "num_comments": 4,
        "num_crossposts": 0,
        "selftext": "Teledyne Technologies Inc. TDY,  has agreed to acquire Flir Systems Inc. FLIR, in a cash-and-stock deal valued at about $8 billion. Under the terms of the deal, Flir shareholders will receive $28 in cash and 0.0718 shares of Teledyne for each share owned, equal to a total purchase price of $56 per Flir share, based on Teledyne's 5-day volume weighted average price as of December 31. The deal offers a 40% premium over Flir's 30-day volume weighted average price as of December 31. \n\nhttps://www.marketwatch.com/story/teledyne-to-acquire-flir-systems-in-cash-and-stock-deal-valued-at-about-8-billion-2021-01-04\nhttps://techcrunch.com/2021/01/04/teledyne-to-acquire-flir-in-8-billion-cash-and-stock-deal/\n\nSeems a bit low but still welcome news considering it's been dead and trading sideways for a long time.",
        "subreddit": "stocks",
        "title": "Teledyne to acquire FLIR in $8 billion cash and stock deal",
        "url": "https://www.reddit.com/r/stocks/comments/kqf01x/teledyne_to_acquire_flir_in_8_billion_cash_and/",
        "created": 1609814925.0
    },
    {
        "author": "QuantumCatBox",
        "created_utc": 1609943879,
        "id": "krp24w",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "On December 24, 2020 I purchased 4 x July 2021 $55 call contracts for FLIR. My view at the time was that the stock had room to continue going up over the next couple of months and I would hold onto the contracts. My cost basis was $2.50 per contract. \n\nOn January 4th TDY announced their offer to buyout FLIR for $28 per FLIR share plus 0.0718 shares of TDY per FLIR share. Based on TDY's share price, this equated to a buyout price of roughly $56.00 per FLIR shar. During pre-market trading, FLIR jumped about 20%. Before the market opened I used Options Profit Calculator to get a rough idea of what the options I was holding would be worth come market open (clearly, I've never owned an option when a company is bought out). The site's underlying calculations gave a roughly 250% increase in the contract value. To my surprise, when the market opened, the contract I owned was trading at about $1.10 (that was a painful blow).\n\nMy simple assumption is that the $56 buyout price essentially capped FLIR's upside, rendering the $55 strike worth $1 on the market. I noticed that when I run the calculations for the same contract in Options Profit Calculator, the outputs are now entirely different then when I ran it Monday pre-market.\n\nCan anyone with experience owning options when a buyout offer occurs provide some insight or clarity on this?",
        "subreddit": "options",
        "title": "Question about FLIR July 2021 $55 call contract",
        "url": "https://www.reddit.com/r/options/comments/krp24w/question_about_flir_july_2021_55_call_contract/",
        "created": 1609972679.0
    },
    {
        "author": "yolotrumpbucks",
        "created_utc": 1610934008,
        "id": "kzk689",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Just wanted to say I just realized Teledyne Technologies is a real company I thought it was every joking about Aerotyne Industries from Wolf of Wallstreet. Apparently I am a true retard. I also just showed my sister how I dumped Tesla for GME and she thinks I am actually retarded. But little does she know GME is the market now. Soon a share GME will be worth more than a Tesla share and we will have the tendies.",
        "subreddit": "wallstreetbets",
        "title": "Teledyne vs Aerotyne",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kzk689/teledyne_vs_aerotyne/",
        "created": 1610962808.0
    },
    {
        "author": "DaVibes",
        "created_utc": 1609880146,
        "id": "kr7kun",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Teledyne Technologies Incorporated (NYSE:TDY) and FLIR Systems, Inc. (NASDAQ:FLIR) jointly announced today \n\nhttps://focusinvesting.biz/teledyne-to-acquire-flir-systems-transaction-valued-at-approximately-8-0-billion/",
        "subreddit": "investing_discussion",
        "title": "Teledyne to Acquire FLIR Systems, Transaction Valued at Approximately $8.0 Billion",
        "url": "https://www.reddit.com/r/investing_discussion/comments/kr7kun/teledyne_to_acquire_flir_systems_transaction/",
        "created": 1609908946.0
    }
]