[
    {
        "author": "PlayfulChampionship5",
        "created_utc": 1617619432,
        "id": "mkhqgd",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "Look at trit! A disruptive fintech company from Singapore. Recently they brought a company from Dubai and partnership with western union. They are going to publish their earnings on April or on may. The company has almost 40% short volume so this is going to be wild next month",
        "url": "https://i.redd.it/p2kpzrck3cr61.jpg",
        "created": 1617648232.0
    },
    {
        "author": "orion4321",
        "created_utc": 1618773477,
        "id": "mtje45",
        "num_comments": 20,
        "num_crossposts": 0,
        "selftext": "I thought I would make a post about the Microvast period as lockup since has not been mentioned too much. It seems to be quite positive for THCB holders.\n\nThere will also be the $500M PIPE coming in, which I assume is not subject to lock-up?\n\n&amp;#x200B;\n\n&gt;In connection with the Business Combination and concurrently with the execution of the Merger Agreement, Microvast Holdings will enter into the Registration Rights and Lock-Up Agreement, pursuant to which Microvast Holdings will be obligated to file a registration statement to register the resale of certain securities of the Company held by the parties to the Registration Rights and Lock-Up Agreement. The Registration Rights and Lock-Up Agreement will also provide the parties thereto with “piggy-back” registration rights, subject to certain requirements and customary conditions. Subject to certain exceptions, the Registration Rights and Lock-Up Agreement further provides (1) Wu will be subject to a lock-up of one year with respect to 25% of his shares and a lock-up of two years for the remaining 75% of his shares, provided that, with respect to the 25% of his shares subject to the one-year lock-up, he can sell those shares if the shares trade at $15.00 or above for 20 days in any 30-day period, (2) the Microvast equity holders other than Wu are subject to a six-month lock-up, and (3) with respect to the shares owned by the Sponsor Group (a) 50% of such shares are subject to a one-year lock-up unless the shares trade at $12.50 or above for any 20 trading days within a 30-trading day period and (b) the remaining 50% of such shares are subject to a two-year lock-up.\n\n[https://www.sec.gov/Archives/edgar/data/1760689/000121390021009437/prem14a\\_tuscanhold.htm](https://www.sec.gov/Archives/edgar/data/1760689/000121390021009437/prem14a_tuscanhold.htm)\n\n&amp;#x200B;\n\nSo the breakdown\n\nYang Wu (CEO, Founder):\n\n* 75% of his shares have a 2 year lockup, non-negotiable\n* 25% of his shares have a 1 year lockup, but can sell if shares trade $15 or above for 20 days in a 30-day period\n\nOther Microvast holders:\n\n* 6 month lockup\n\nSponsor Group shares:\n\n* 50% of shares have 1 year lockup, but can sell if shares trade above $12.50 for any 20 day trading period\n* 50% of shares have 2 year lockup",
        "subreddit": "SPACs",
        "title": "THCB / Microvast Lock Up period information",
        "url": "https://www.reddit.com/r/SPACs/comments/mtje45/thcb_microvast_lock_up_period_information/",
        "created": 1618802277.0
    }
]