[
    {
        "author": "Newyorkntilikina",
        "created_utc": 1610471564,
        "id": "kvvuce",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "Apart from ETFs, I'm curious what everyone's favorite stocks are for each sector. There are 11 sectors total and I feel like I'm heavily swayed towards Technology and lack stocks in certain sectors. I'll list my top holdings for each sectors and please list picks for sectors I'm lacking.\n\n**Technology**\n\n* MSFT\n* AAPL\n* ADSK\n\n**Consumer Cyclicals**\n\n* NKE\n* CHWY\n\n**Communication Services**\n\n* SE\n* PINS\n* DIS\n\n**Industrials**\n\n* UPWK\n* RTX\n* BA\n\n**Financial**\n\n* LMND\n* PYPL\n* JPM\n\n**Consumer Defensive**\n\n* WMT\n\nI don't have any stock in the following sectors and would like advice: **Energy, Basic Material, Utilities, Healthcare, and Real Estate.**",
        "subreddit": "StockMarket",
        "title": "Diversify portfolio into every sector - need picks",
        "url": "https://www.reddit.com/r/StockMarket/comments/kvvuce/diversify_portfolio_into_every_sector_need_picks/",
        "created": 1610500364.0
    },
    {
        "author": "Sublime_7365",
        "created_utc": 1609652728,
        "id": "kpesxt",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Started investing recently and believe I may be over diversified. Bullish on these tickers but given the number of positions in the portfolio I only have a cursory understanding of those businesses so I'm trying to trim the number of stocks I own - going for quality over quantity. This portfolio beats the SP when I backtested my purchases using SP instead of these tickers but maybe I can do better if I get rid of the gain diluting stocks? Looking for suggestions on what should go and feel free to suggest other positions not on this list that may be better than some of the positions I already have for long term growth. Looking for more genomics exposure as well (maybe ARGK but not a fan of higher expense ratios). Thanks!\n\nPositions:\n\nFB\n\nAMZN\n\nSQ\n\nSE\n\nFVRR\n\nTSLA\n\nSBE\n\nAAPL\n\nSEDG\n\nNET\n\nCRWD\n\nZM\n\nNVDA\n\nU\n\nADSK\t\n\nLMND\n\nCRSP\n\nPINS\n\nNIO\n\nPLTR\n\nSHOP\t\n\nDOCU\t\n\nMSFT\t\n\nDIS\n\nLUV\n\nAMD\n\nBE\n\nCOUP\n\nBA\n\nNEE\n\nFUBO\n\nFSLY\n\nOKTA\n\nPLUG\n\nDDOG\n\nABNB\n\nCRNC\n\nOSS\n\nZBRA\n\nCHGG\n\nAAL\n\nRGEN\n\nGILD",
        "subreddit": "stocks",
        "title": "Trim my portfolio?",
        "url": "https://www.reddit.com/r/stocks/comments/kpesxt/trim_my_portfolio/",
        "created": 1609681528.0
    },
    {
        "author": "simplevalue",
        "created_utc": 1609649285,
        "id": "kpdy03",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hi,\n\nI am looking for old investment letters that highlight investments in companies (before they became multibaggers). The idea is to reverse engineer the thesis and see how it played out / what they saw that the market didn't.\n\nThe companies are:\n\n* Monster Beverage Corporation (MNST)\n* Booking Holdings (BKNG)\n* Amazon (AMZN)\n* Boston Beer Company (SAM)\n* Nvidia Corporation (NVDA)\n* Activision Blizzard (ATVI)\n* Ross Stores (ROST)\n* Edward Lifesciences (EW)\n* [Stamps.com](https://Stamps.com) (STMP)\n* Autodesk (ADSK)\n* Copart, Inc. (CPRT)\n* Fair Isaac Corporation (FICO)\n* Moody's Corporation (MCO)\n* UnitedHealth Group (UNH)\n* Mastercard (MA)\n* Visa (V)\n* Adobe (ADBE)\n* Lockheed Martin (LMT)",
        "subreddit": "SecurityAnalysis",
        "title": "Looking for Old Investment Letters on Companies (Case Studies)",
        "url": "https://www.reddit.com/r/SecurityAnalysis/comments/kpdy03/looking_for_old_investment_letters_on_companies/",
        "created": 1609678085.0
    },
    {
        "author": "SorenLantz",
        "created_utc": 1609528327,
        "id": "kogze1",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "# The Metric\n\nI recently had an idea for a metric to be used to find hot stocks. I call the metric \"Price Elasticity\" and it is comprised of two numbers: upturn elasticity and downturn elasticity.\n\n* Upturn elasticity: the average % change in a stock on market up days\n* Downturn elasticity: the average % change in a stock on market down days\n\nUsing these numbers and a few additional basic requirements (like positive EPS and at least 31 days of trading history), my screener found 99 stocks out of about 5700 searched that have good to exceptional price elasticities. (the list of these stocks is linked below and also [here](https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing))\n\n# What makes for good price elasticity numbers?\n\nI made two classifications for stocks with good price elasticity data.\n\n1. **Irrational** \\- Upturn elasticity &gt; 1, Downturn elasticity &lt; 0\n2. **Responsible** \\- Upturn elasticity &gt; 1, 0 &lt; Downturn elasticity &lt; 1\n\nWith any stock I want an upturn elasticity &gt; 1, meaning that the stock tends to move higher than the market when the market goes up. The \"Irrational\" classification gets its name because if a stock's downturn elasticity is negative this means the stock, on average, moves up when the market goes down. So a stock that moves higher than the market when the market goes up and also moves up when the market goes down is classified as \"Irrational\". These stocks tend to have less trading history and are very volatile.\n\nThen there are \"Responsible\" stocks which like Irrational stocks move higher than the market when the market goes up. Unlike Irrational stocks though, Responsible stocks move lower when the market moves lower. The reason I still consider them good is because their downturn elasticity is &lt;1 and &gt;0, meaning that, while they do move down with the market, they move down to a lesser degree.\n\nSome popular stocks picked up by the screener include: AMD, ADSK, ETSY, NFLX, NVDA, SHOP and TSLA. Many of the other stocks have lower market caps and could be interesting value / growth plays given they too made the cut.\n\n# Link to the 99 stocks found:\n\n[https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing](https://drive.google.com/file/d/1NsbQ42oo6i3kYUWf96Tw5yK3LD04L1CR/view?usp=sharing)\n\n&amp;#x200B;\n\nI have no idea if there is merit to my Price Elasticity metric (or if it has already been \"invented\") but it was a fun project and the screener found some interesting stocks I would have never discovered otherwise. The validity of the metric is entirely based on the assumption that past trends indicate future performance, and for those looking to beat the market the trends of these 99 stocks should be very appealing. I made the screener using Python3 and TD Ameritrade's API. Of the stocks in that list I am currently holding AMD, CAMT, EPAM, and NLOK.",
        "subreddit": "stocks",
        "title": "My Custom Stock Screener Findings",
        "url": "https://www.reddit.com/r/stocks/comments/kogze1/my_custom_stock_screener_findings/",
        "created": 1609557127.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1609889975,
        "id": "kraxx0",
        "num_comments": 9,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Tuesday, January 5, 2021**\n\nStocks rose Tuesday as market participants await results from Georgia’s runoff election and continue to monitor rising coronavirus cases in the US and abroad. \n\nSince Novemeber, market participants have closely monitored developments around Georgia’s runoff Senate election, which is set to decide the balance of power in the Senate. In other words, whichever party wins the election in Georgia will have the majority position in the Senate. Currently, Republicans maintain a narrow majority in the chamber, with 50 seats to the Democrat’s 48 when excluding Georgia. If the Democrats win both seats in Georgia they will have a majority because, in the case of a tie, the Vice-President is able to cast the deciding vote. \n\nThe market favors a divided government because it ensures the regulatory environment will remain little changed. Under a Republican-controlled Senate, the incoming Biden administration will likely be unable to advance many of its campaign promises, including raising corporate taxes and minimum wages, and unveiling reforms around education, housing, and climate change, which could all impact various pockets of the market. However, under a unified Democratic government, Congress is likely to pass a larger additional stimulus package to further support the economy in the near-term.  \n\nSadly, new coronavirus cases in the US hit a staggering one-day record of nearly 300,000 over the weekend, according to Johns Hopkins University, most likely attributed to the increase in travel during the holiday period. Despite repeated warnings from health officials about the dangers of traveling, in the last two weeks of December, the TSA reported more than 7 million people were screened at airport security checkpoints. There are now nearly 21 million cases, 128,000 hospitalizations, and 352,000 deaths attributed to the virus in the US alone. Hospital systems across the country are quickly becoming overwhelmed. In California, officials say ICU units in at least two regions are filled to practical capacity. And because of resource limitations, Los Angeles County ambulance crews have been instructed not to transport any patient in blunt traumatic or nontraumatic cardiac arrest if they can't first be resuscitated in the field.\n\nAs of Monday morning, the first doses of a COVID-19 vaccine had been given to more than 4.5 million people in the U.S., far below the Trump Administration promise of vaccinating 20 million Americans by years-end. Dr. Anthony Fauci, said President-elect Joe Biden’s goal of ramping up distribution to vaccinate 100 million people in his first 100 days was a “realistic goal,” according to an interview with ABC on Sunday.\n\nIn the United Kingdom, Prime Minister Boris Johnson ordered a national lockdown through at least mid-February in an effort to stop the spread of the new, more-infectious COVID-19 strain detected a few weeks ago. He said: “Our hospitals are under more pressure from COVID than at any time since the start of the pandemic. It’s clear that we need to do more together to bring this new variant under control while our vaccines are rolled out.” Under the lockdown, people will only be allowed to leave their homes for a limited number of reasons, including shopping for essentials, going to work if they cannot work from home, exercising, seeking medical advice and providing care. Schools are also shutting down.\n\n**Highlights**\n\n* There were conflicting reports today, with some outlets saying Jack Ma, founder of Alibaba (BABA) and Ant Group, is missing after criticizing the Chinese government while others say he is fine, just “laying low”.\n* Crude oil prices topped $50 per barrel for the first time since February, a remarkable comeback given at one point oil was worth negative $37.\n* Amazon (AMZN) purchased 11 planes after confirming it has plans to build its own fleet. Previously the company used leased aircrafts.\n* After falling more than 40% yesterday, QuantumScape (QS) stock rose around 20% today. Absolutely crazy price action\n* Electric cars rise to a record 54% market share in Norway. Seems everywhere in the world people are buying more electric vehicles.\n* According to a report by Bloomberg, Apple (AAPL) supplier Foxconn Technology Group signed a strategic cooperation deal with embattled Chinese electric-vehicle startup Byton with aims to produce a car by Q1 of 2022.\n* Autodesk (ADSK) target raised by Keycorp from $310 to $345 at Overweight. Stock currently around $296.\n* Arvinas (ARVN) target raised by Cantor Fitzgerald from $66 to $121 at Overweight. Stock  currently around $83.\n* HCA Healthcare (HCA) target raised by Deutsche Bannk from $150 to $180 at Buy. Stock currently around $163.\n* Micron Technology (MU) with two target raises. Stock currently around $74.\n   * Deutsche Bank from $75 to $85 at Buy\n   * Royal Bank of Canada from $57 to $83  at Outperform\n* Sunnova Energy (NOVA) target raised by Goldman Sachs from $45 to $60 at Buy. Stock currently around $45.\n* Nevro (NVRO) target raised by Robert W. Baird from $180 to $200 at Outperform. Stock currently around $170.\n* SVB Financial Group (SIVB) wtih two, bullish target raises. Stock currently around $387.\n   * Royal Bank of Canada from $320 to $437 Outperform\n   * Raymond James from $225 to $400 Outperform\n* Synopsys (SNPS) target raised by Keycorp from $265 to $290 at Overweight. Stock currently around $254.\n* Welbilt (WBT) target raised by Keycorp from $11 to $18 at Overweight. Stock currently around $12.50.\n\n“You get in life what you have the courage to ask for.” - Oprah Winfrey",
        "subreddit": "StockMarket",
        "title": "Daily Market Recap - Tuesday, January 5, 2020",
        "url": "https://www.reddit.com/r/StockMarket/comments/kraxx0/daily_market_recap_tuesday_january_5_2020/",
        "created": 1609918775.0
    },
    {
        "author": "Newyorkntilikina",
        "created_utc": 1610470968,
        "id": "kvvmsc",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Apart from ETFs, I'm curious what everyone's favorite stocks are for each sector. There are 11 sectors total and I feel like I'm heavily swayed towards Technology and lack stocks in certain sectors. I'll list my top holdings for each sectors and please list picks for sectors I'm lacking.\n\n**Technology**\n\n* MSFT \n* AAPL\n* ADSK\n\n**Consumer Cyclicals**\n\n* NKE\n* CHWY\n\n**Communication Services**\n\n* SE\n* PINS\n* DIS\n\n**Industrials**\n\n* UPWK\n* RTX\n* BA\n\n**Financial**\n\n* LMND\n* PYPL\n* JPM\n\n**Consumer Defensive**\n\n* WMT\n\nI don't have any stock in the following sectors and would like advice: **Energy, Basic Material, Utilities, Healthcare, and Real Estate.**",
        "subreddit": "investing",
        "title": "Diversify portfolio into every sector - need picks",
        "url": "https://www.reddit.com/r/investing/comments/kvvmsc/diversify_portfolio_into_every_sector_need_picks/",
        "created": 1610499768.0
    },
    {
        "author": "simplevalue",
        "created_utc": 1609649315,
        "id": "kpdyaa",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " Hi,\n\nI am looking for old investment letters that highlight investments in companies (before they became multibaggers). The idea is to reverse engineer the thesis and see how it played out / what they saw that the market didn't.\n\nThe companies are:\n\n* Monster Beverage Corporation (MNST)\n* Booking Holdings (BKNG)\n* Amazon (AMZN)\n* Boston Beer Company (SAM)\n* Nvidia Corporation (NVDA)\n* Activision Blizzard (ATVI)\n* Ross Stores (ROST)\n* Edward Lifesciences (EW)\n* [Stamps.com](https://stamps.com/) (STMP)\n* Autodesk (ADSK)\n* Copart, Inc. (CPRT)\n* Fair Isaac Corporation (FICO)\n* Moody's Corporation (MCO)\n* UnitedHealth Group (UNH)\n* Mastercard (MA)\n* Visa (V)\n* Adobe (ADBE)\n* Lockheed Martin (LMT)",
        "subreddit": "investing",
        "title": "Looking for Old Investment Letters for the Following Companies",
        "url": "https://www.reddit.com/r/investing/comments/kpdyaa/looking_for_old_investment_letters_for_the/",
        "created": 1609678115.0
    },
    {
        "author": "MuzGotTheBooze",
        "created_utc": 1610913833,
        "id": "kzdrbg",
        "num_comments": 2,
        "num_crossposts": 0,
        "selftext": "PBW, ICLN, QCLN, TAN, FAN, and some other clean energy stocks have been mentioned a lot on this sub, but I haven’t seen any discussion about $PZD. Its a cleantech portfolio with top 5 holdings: \n\n1. ENPH (4.61%)\n2. SEDG (3.74%)\n3. SGRE.BC (3.39%)\n4. VWS (3.35%)\n5. ADSK (3.11%) \n\nIt has an average of 17-19% overlap with the other ETFS so needless to say its not a re-skin of them. I know the other ETFs had a crazy year but looking at growth other than 2020, the ETF did outperform them (especially PBW, it was practically dead till 2020). It doesn’t rely on EV companies such as NIO and TSLA so thats something. \n\nAnyways, would like to hear from others, I’m personally thinking doing a split between $PBW and $PZD.",
        "subreddit": "stocks",
        "title": "$PZD (Powershares Cleantech Portfolio)",
        "url": "https://www.reddit.com/r/stocks/comments/kzdrbg/pzd_powershares_cleantech_portfolio/",
        "created": 1610942633.0
    },
    {
        "author": "MuzGotTheBooze",
        "created_utc": 1609608437,
        "id": "kp1h8a",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "PBW, ICLN, QCLN, TAN, FAN, and some other clean energy stocks have been mentioned a lot on this sub, but I haven’t seen any discussion about $PZD. Its a cleantech portfolio with top 5 holdings: \n\n1. ENPH (4.61%)\n2. SEDG (3.74%)\n3. SGRE.BC (3.39%)\n4. VWS (3.35%)\n5. ADSK (3.11%) \n\nIt has an average of 17-19% overlap with the other ETFS so needless to say its not a re-skin of them. I know the other ETFs had a crazy year but looking at growth other than 2020, the ETF did outperform them (especially PBW, it was practically dead till 2020). It doesn’t rely on EV companies such as NIO and TSLA so thats something. \n\nAnyways, would like to hear from others, I’m personally thinking doing a split between $PBW and $PZD.",
        "subreddit": "stocks",
        "title": "$PZD (PowerShare CleanTeach Portfolio)",
        "url": "https://www.reddit.com/r/stocks/comments/kp1h8a/pzd_powershare_cleanteach_portfolio/",
        "created": 1609637237.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1609605881,
        "id": "kp0nzx",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. Happy New Year! I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week, month and year ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 4th, 2021.\n\n# **Politics will be front and center as a catalyst in the first week of the new year  - [(Source)](https://www.cnbc.com/2020/12/31/politics-will-be-front-and-center-as-a-catalyst-in-the-first-week-of-the-new-year-.html)**\n*****\n&gt; Stocks exit 2020 with strong gains and are riding a tailwind, but already in the dawn of the new year, the market could face its first big challenge.\n*****\n&gt; The final outcome of the 2020 election plays out Tuesday, when voters in Georgia will pick their senators and decide which party controls the U.S. Senate.\n*****\n&gt; With President-elect Joe Biden heading to the White House and a Democratic-controlled House of Representatives, Wall Street has been comfortable with the view that Biden and the Democrats could not succeed with tax hikes and more progressive policy changes while Republicans hold the Senate.\n*****\n&gt; The runoff election for the two Senate seats Tuesday is widely expected to result in one or both of the incumbent Republican senators retaining their seats. But Democrats are close in the polls and should they win, each party would have 50 seats with Vice President-elect Kamala Harris the tie breaker.\n*****\n&gt; “Georgia is the most important thing to the Biden presidency for the next two years,” said Ed Mills, Washington policy analyst at Raymond James. “It’s going to determine what is the legislative agenda and who can get confirmed by the United States Senate.”\n*****\n&gt; Sen. David Perdue is being challenged by Democrat Jon Ossoff, while GOP Sen. Kelly Loeffler is running against Democrat Raphael Warnock. None of the candidates had more than 50% of the vote in the Nov. 3 election, so Georgia law requires a runoff election between the two leading candidates for each seat.\n*****\n&gt; “It’s a binary event,” said Mills, adding it’s of growing interest to markets. “The general sense for the market is that Republicans are well positioned to maintain their majority in the Senate. But I think the 2020 election as well as the 2016 election and to some extent, the 2018 election has humbled us … The Senate outcomes, in particular, seem to be less predictable than almost any other elections.”\n*****\n&gt; Mills said the results may take several days to determine, adding to the uncertainty the event could hold for markets. According to an RBC investor survey, 88% expect Republicans to maintain control, and most say that is a positive for the stock market.\n*****\n&gt; “The market tends to shoot first and ask questions later. There will certainly be a reaction if Democrats win both those seats,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. Strategists say there could be a relief rally if Republican incumbents see a clear victory.\n*****\n&gt; “That totally dominates [trading] because it’s about do we have status quo or do we have Democrats controlling all parts of Washington and what that means for spending and taxes,” Boockvar said. “I think you could see the worries about taxes overwhelming any thoughts on the benefits of more spending” by Democrats.\n*****\n&gt; # By the numbers\n&gt; A year of extreme volatility ended with a big win for stocks, as the pandemic steered the course for markets. The S&amp;P 500 was up 16.3% for the year, ending at 3,756. That gain comes after a 34% decline early in the year, followed by a powerful more-than 65% rebound. Technology was the big winner for the year, and the Nasdaq was up 43.6% at 12,888.\n*****\n&gt; Besides the runoff vote, the market will be watching a stream of data in the coming week, including the important December jobs report Friday. That could show fewer than 100,000 jobs were added as the spreading virus impacted hiring and layoffs. There were 245,000 jobs created in November.\n*****\n&gt; There is also ISM manufacturing data Tuesday, and a number of Fed speakers, including Vice Chairman Richard Clarida on Friday.\n*****\n&gt; The virus itself could also be a factor for stocks.\n*****\n&gt; Conventional wisdom for the coming year has been that vaccines will be widely distributed, and by the second half things will start to get back to normal and the economy will pick up. But the initial distribution has been slow, and far short of the 20 million targeted for December by President Donald Trump’s task force.\n*****\n&gt; In that recent RBC survey, three quarters of investors were optimistic about vaccine distribution with 80% expecting a majority to be vaccinated by the end of 2021. “We suspect that the positive outlook for the stock market and the economy would deteriorate if expectations for a smooth vaccine rollout are not met,” RBC strategists wrote.\n*****\n&gt; They also noted that nearly 60% of the investors surveyed believe high stock market valuations are problematic.\n*****\n&gt; “This suggests to us that any threat to the economic and earnings recovery story could spark profit-taking. On this point, it is worth noting that the vaccine was the No. 1 issue keeping investors up at night, closely followed by monetary policy and excessive optimism on the recovery,” the strategists noted.\n*****\n&gt; Chris Rupkey, chief financial economist at MUFG Union Bank, said investors will also be watching the formal acceptance of the Electoral College vote Wednesday. Strategists expect the vote count to confirm Biden’s presidency.\n*****\n&gt; However, Missouri Sen. Josh Hawley says he will challenge the certification, and several House Republicans have already vowed to contest the election at that time. If one House member and a senator jointly object to a state’s slate of electors, the two houses of Congress must separately debate and vote on the objection.\n*****\n&gt; Strategists see little chance of any impact on the election outcome, but there could be fireworks. Trump has been claiming since the election that there was fraud but multiple courts failed to find any truth to the claims.\n*****\n&gt; Rupkey said investors are not taking into account enough potential for political risk from the deep animosity between the two political parties.\n*****\n&gt; “I think the additional stimulus and hopes for additional stimulus, and infrastructure spending in 2021, I don’t know that that is such a slam dunk, because of the issue of political instability,” he said.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/cAXzkxf.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/HnhSggu.png))**\n\n# **Major Futures Markets as of Thursday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF THURSDAY!](https://i.imgur.com/5egoYkS.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/UlNY0Um.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/z4wSKuc.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/32Ma7rG.png))**\n\n# **Major Indices Pullback/Correction Levels as of Thursday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/mRJqU8A.png)**\n\n# **Major Indices Rally Levels as of Thursday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/J7B4Njx.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/5udYrpD.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/JJmAiwp.png))**\n\n# **Thursday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/1ARzFfu.png))**\n\n*****\n\n&gt; # Why A Year-End Rally Bodes Well For 2021\n\n&gt; Welcome to the last day of 2020! It has been a devastating year in so many ways, yet for investors it has been quite rewarding. Much of the gains in 2020 have taken place the final two months, with the S&amp;P 500 Index up more than 14% in November and December so far, the best end to a year since WWII.\n\n&gt; A big end of year rally could have bulls smiling in 2021. “Turns out a 10% or more gain the final two months of the year has equaled a higher S&amp;P 500 the following year every single time since World War II,” explained LPL Financial Chief Market Strategist Ryan Detrick. “In fact, January was also higher every single time as well, so maybe this strong rally to end the year is a clue for higher prices into next year.”\n\n&gt; As shown in the LPL Chart of the Day, the S&amp;P 500 gained an average of more than 18% the year following a 10% or more surge during the final two months of the year. Meanwhile, January was up 5 for 5 as well, rising an impressive 3% on average.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.31.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; Here’s what the average year looks like after the prior year gains 10% or more the final two months compared to a typical year. Once again, strong returns are the playbook historically.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/12/blog-12.31.20-2.png?ssl=1))**\n\n&gt; We wish everyone a happy and safe New Years Eve and we’ll see you in 2021!\n\n*****\n\n&gt; # Fifty to Zero in 283 Days\n\n&gt; In a year with some pretty crazy charts, the one below is right up there with some of the best. After all the markets have been through this year, bot the S&amp;P 500 and Long-Term Treasuries have seen nearly identical returns on a total return basis. That's right, with just a few hours left in the trading year, the S&amp;P 500's total return in 2020 has been a gain of 17.6%, while Long Term US Treasuries, as measured by the B of A Merrill Lynch Long-Term Treasury Index has rallied 17.3%. What makes this nearly identical performance all the more incredible is that on March 23rd, the performance gap between the two was more than 50 percentage points.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123120-Stocks-Bonds.png))**\n\n&gt; The fact that stocks and bonds have essentially seen identical returns this year isn't typical. The chart below shows the annual performance spread between the S&amp;P 500 and long-term US Treasuries going back to 1978. During that time, the S&amp;P 500 has historically outperformed long-term US Treasuries by an average of 3.9 percentage points per year, but the average gap in performance between the two has been over 15 percentage points. In the 43 years since 1978, there have only been seven other years where the performance spread between the two asset classes was less than five percentage points and just two years (1985 and 1992) where the performance spread was less than a percentage point.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123120-Stocks-Bonds-Annual-Spreads.png))**\n\n*****\n\n&gt; # Back-to-Back Big Years for Technology\n\n&gt; With just two trading days (including today) left in 2020, the S&amp;P 500 Technology sector is on pace for its second year in a row of rallying more than 40%. Going back to 1990, the only time the Technology sector experienced back-to-back returns of more than 40% was in 1998 and 1999. Back then, not only was the Technology sector up 40%+ in back-to-back years, but it was also up over 75% in both of those years. If you think markets are pretty crazy these days, they still have nothing on the last two years of the 1990s!\n\n&gt; In terms of cumulative returns, the Technology sector is up 210% since the last trading day of 2018, whereas in 1999 it was up 317% in a two-year span. What's also interesting to note about the last 31 years of returns for the Technology sector is how it has only experienced five down years, while the S&amp;P 500 has been down in ten different years during that span. Furthermore, since 2009 there has only been one down year and the decline was a paltry 1.6%. Not a bad 12-year run!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Technology-Sector-Performance.png))**\n\n&gt; Given that the sector has more than doubled in the last two years, there have been some big individual winners. Topping the list with a gain of just under 400% is Advanced Micro Devices (AMD). On the last day of 2018, AMD traded hands for under $20 per share. Today's it's over $90. AMD has a lead of more than 100 percentage points over the next closest stock - NVIDIA (NVDA) - which is up 288%. Interestingly, there aren't a lot of major outliers to the upside compared to the sector's 210% gain, but that's because Apple (AAPL), the sector's largest stock, has paced the sector's gains by rallying more than 240%.\n\n&gt; On the downside, just four stocks in the Technology sector have declined in the last two years. The worst of these has been DXC Technology (DXC) which has lost more than half of its value, while Juniper (JNPR) and HP Enterprise (HPE) are down between 10% and 20%. Lastly, FLIR Systems (FLIR) has declined less than 2%, so depending on how it acts in the next two days, it could move into positive territory just as Intel (INTC) did yesterday after Third Point bailed it out and moved the stock barely into positive territory for the last two years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Technology-Sector-Stocks.png))**\n\n*****\n\n&gt; # Growth Dragging on Small Caps\n\n&gt; In the past couple of weeks, we have frequently been keeping tabs on small-cap equities which have been particularly strong performers of late resulting in very overbought readings as well as extended valuations. More specifically, taking a look at growth-oriented small-caps, with only a couple days left in the year small-cap growth stocks—proxied by the Russell 2000 Growth ETF (IWO)—are on pace to have outperformed large-cap equivalents in 2020. On December 10th, IWO surpassed the S&amp;P 500 Growth ETF (IVW) in terms of YTD performance, and even after pulling back in the past week, IWO is still in the lead.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large1.png))**\n\n&gt; As a result of recent moves, there has been a sharp reversal on a relative basis between the two ETFs in the past week. In the chart below, we show the ratio of the Russell 2000 Growth ETF (IWO) versus the S&amp;P 500 Growth ETF (IVW). This ratio took off beginning in the early fall meaning small-cap growth drastically outperformed large-cap growth. But the former's weakness in the past several days has put a halt to that move.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large2.png))**\n\n&gt; As to just how sharp of a reversal this was, in the five days through yesterday's close, the decline in the ratio of IWO to IVW was the largest since June. Before that, April and March saw declines that were even larger. Not only was this one of the biggest drops in the relative performance of small-cap growth to large-cap growth in the past few months, but that also stands in the bottom 0.5% of all readings going back to 2000 when the ETF first began trading. Outside of this past spring, the only other periods that have also experienced this type of underperformance of small-cap growth relative to large-cap growth was at various points in 2011, 2008, and a handful of times in the early 2000s.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large3.png))**\n\n&gt; Small-cap underperformance has not necessarily been broad though. For value stocks, small caps (IWN) have generally outperformed large caps (IVE) for the entirety of the new bull market. While there was a bit of a turn lower in recent days, it has been nowhere close to as dramatic of a move as growth stocks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large4.png))**\n\n&gt; In the charts below, we show average performance over the past week of Russell 2000 stocks broken into deciles based on their price to sales and price to book ratios. As shown, the most aggressively valued deciles have averaged the worst performance in the past week. Stocks with low P/S and P/B ratios have not been immune from the weakness, but they have held up significantly better.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-RTY-Decile.png))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/5udYrpD.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/hQIRBYI.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.4.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 1.4.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  1.5.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZAbC0jw.png))\n\n&gt; # ***Tuesday 1.5.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/wKzyMxp.png))\n\n*****\n\n&gt; # ***Wednesday 1.6.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BUFtffd.png))\n\n&gt; # ***Wednesday 1.6.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cDQHHqx.png))\n\n*****\n\n&gt; # ***Thursday 1.7.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/NhUT413.png))\n\n&gt; # ***Thursday 1.7.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7p03h4M.png))\n\n*****\n\n&gt; # ***Friday 1.8.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 1.8.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Micron Technology, Inc. $75.18\n**Micron Technology, Inc. (MU)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, January 7, 2021. The consensus earnings estimate is $0.71 per share on revenue of $5.73 billion and the Earnings Whisper ® number is $0.78 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat The company's guidance was for earnings of $0.40 to $0.54 per share. Consensus estimates are for year-over-year earnings growth of 69.05% with revenue increasing by 11.39%. Short interest has decreased by 20.0% since the company's last earnings release while the stock has drifted higher by 53.6% from its open following the earnings release to be 46.1% above its 200 day moving average of $51.46. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, December 30, 2020 there was some notable buying of 14,441 contracts of the $72.50 call expiring on Friday, April 16, 2021. Option traders are pricing in a 7.5% move on earnings and the stock has averaged a 7.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Bed Bath &amp; Beyond, Inc. $17.76\n**Bed Bath &amp; Beyond, Inc. (BBBY)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $0.21 per share on revenue of $2.77 billion and the Earnings Whisper ® number is $0.31 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 155.26% with revenue increasing by 0.39%. Short interest has increased by 0.3% since the company's last earnings release while the stock has drifted lower by 3.0% from its open following the earnings release to be 40.2% above its 200 day moving average of $12.66. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, December 22, 2020 there was some notable buying of 6,626 contracts of the $19.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 17.0% move on earnings and the stock has averaged a 15.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BBBY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Simply Good Foods Company $31.36\n**Simply Good Foods Company (SMPL)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, January 6, 2021. The consensus earnings estimate is $0.20 per share on revenue of $208.89 million and the Earnings Whisper ® number is $0.23 per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 9.09% with revenue increasing by 37.29%. Short interest has increased by 5.9% since the company's last earnings release while the stock has drifted higher by 52.9% from its open following the earnings release to be 47.2% above its 200 day moving average of $21.31. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, December 23, 2020 there was some notable buying of 508 contracts of the $30.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 17.5% move on earnings and the stock has averaged a 5.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SMPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Walgreens Boots Alliance Inc $39.88\n**Walgreens Boots Alliance Inc (WBA)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $1.02 per share on revenue of $34.89 billion and the Earnings Whisper ® number is $1.11 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 25.55% with revenue increasing by 1.60%. Short interest has decreased by 15.2% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 1.0% below its 200 day moving average of $40.29. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, December 31, 2020 there was some notable buying of 14,690 contracts of the $40.00 call expiring on Friday, February 19, 2021. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WBA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Constellation Brands, Inc. $219.05\n**Constellation Brands, Inc. (STZ)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $2.39 per share on revenue of $2.22 billion and the Earnings Whisper ® number is $2.45 per share. Investor sentiment going into the company's earnings release has 54% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.68% with revenue increasing by 1.76%. Short interest has decreased by 37.7% since the company's last earnings release while the stock has drifted higher by 14.7% from its open following the earnings release to be 22.6% above its 200 day moving average of $178.74. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, December 24, 2020 there was some notable buying of 2,291 contracts of the $212.50 call expiring on Friday, January 8, 2021. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=STZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # RPM International Inc. $90.78\n**RPM International Inc. (RPM)** is confirmed to report earnings at approximately 6:45 AM ET on Wednesday, January 6, 2021. The consensus earnings estimate is $1.00 per share on revenue of $1.46 billion and the Earnings Whisper ® number is $1.10 per share. Investor sentiment going into the company's earnings release has 40% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 31.58% with revenue increasing by 4.19%. Short interest has decreased by 23.0% since the company's last earnings release while the stock has drifted higher by 4.5% from its open following the earnings release to be 15.8% above its 200 day moving average of $78.42. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 4.3% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RPM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # MSC Industrial Direct Co. Inc. $84.39\n**MSC Industrial Direct Co. Inc. (MSM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, January 6, 2021. The consensus earnings estimate is $1.07 per share on revenue of $774.61 million and the Earnings Whisper ® number is $1.15 per share. Investor sentiment going into the company's earnings release has 25% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 11.57% with revenue decreasing by 5.95%. Short interest has decreased by 21.2% since the company's last earnings release while the stock has drifted higher by 27.3% from its open following the earnings release to be 22.5% above its 200 day moving average of $68.91. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 3.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Conagra Brands, Inc. $36.26\n**Conagra Brands, Inc. (CAG)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $0.73 per share on revenue of $2.99 billion and the Earnings Whisper ® number is $0.77 per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for earnings of $0.70 to $0.74 per share. Consensus estimates are for year-over-year earnings growth of 15.87% with revenue increasing by 6.00%. Short interest has increased by 17.1% since the company's last earnings release while the stock has drifted higher by 0.3% from its open following the earnings release to be 3.7% above its 200 day moving average of $34.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, December 21, 2020 there was some notable buying of 4,915 contracts of the $38.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 6.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CAG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # UniFirst Corporation $211.69\n**UniFirst Corporation (UNF)** is confirmed to report earnings at approximately 8:00 AM ET on Wednesday, January 6, 2021. The consensus earnings estimate is $1.68 per share on revenue of $440.79 million and the Earnings Whisper ® number is $1.79 per share. Investor sentiment going into the company's earnings release has 18% expecting an earnings beat The company's guidance was for earnings of $1.55 to $1.70 per share on revenue of $433.00 million to $443.00 million. Consensus estimates are for earnings to decline year-over-year by 33.33% with revenue decreasing by 5.29%. Short interest has decreased by 62.4% since the company's last earnings release while the stock has drifted higher by 10.4% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Helen of Troy Ltd. $222.19\n**Helen of Troy Ltd. (HELE)** is confirmed to report earnings at approximately 6:45 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $3.10 per share on revenue of $560.13 million and the Earnings Whisper ® number is $3.25 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 5.08% with revenue increasing by 17.99%. Short interest has increased by 53.4% since the company's last earnings release while the stock has drifted higher by 10.9% from its open following the earnings release to be 19.2% above its 200 day moving average of $186.47. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.0% move on earnings and the stock has averaged a 6.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HELE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading year ahead r/wallstreetbets.",
        "subreddit": "wallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning January 4th, 2021 (Happy New Year r/wallstreetbets!)",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/kp0nzx/wall_street_week_ahead_for_the_trading_week/",
        "created": 1609634681.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1609605767,
        "id": "kp0mpi",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/smallstreetbets. Happy New Year! I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week, month and year ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 4th, 2021.\n\n# **Politics will be front and center as a catalyst in the first week of the new year  - [(Source)](https://www.cnbc.com/2020/12/31/politics-will-be-front-and-center-as-a-catalyst-in-the-first-week-of-the-new-year-.html)**\n*****\n&gt; Stocks exit 2020 with strong gains and are riding a tailwind, but already in the dawn of the new year, the market could face its first big challenge.\n*****\n&gt; The final outcome of the 2020 election plays out Tuesday, when voters in Georgia will pick their senators and decide which party controls the U.S. Senate.\n*****\n&gt; With President-elect Joe Biden heading to the White House and a Democratic-controlled House of Representatives, Wall Street has been comfortable with the view that Biden and the Democrats could not succeed with tax hikes and more progressive policy changes while Republicans hold the Senate.\n*****\n&gt; The runoff election for the two Senate seats Tuesday is widely expected to result in one or both of the incumbent Republican senators retaining their seats. But Democrats are close in the polls and should they win, each party would have 50 seats with Vice President-elect Kamala Harris the tie breaker.\n*****\n&gt; “Georgia is the most important thing to the Biden presidency for the next two years,” said Ed Mills, Washington policy analyst at Raymond James. “It’s going to determine what is the legislative agenda and who can get confirmed by the United States Senate.”\n*****\n&gt; Sen. David Perdue is being challenged by Democrat Jon Ossoff, while GOP Sen. Kelly Loeffler is running against Democrat Raphael Warnock. None of the candidates had more than 50% of the vote in the Nov. 3 election, so Georgia law requires a runoff election between the two leading candidates for each seat.\n*****\n&gt; “It’s a binary event,” said Mills, adding it’s of growing interest to markets. “The general sense for the market is that Republicans are well positioned to maintain their majority in the Senate. But I think the 2020 election as well as the 2016 election and to some extent, the 2018 election has humbled us … The Senate outcomes, in particular, seem to be less predictable than almost any other elections.”\n*****\n&gt; Mills said the results may take several days to determine, adding to the uncertainty the event could hold for markets. According to an RBC investor survey, 88% expect Republicans to maintain control, and most say that is a positive for the stock market.\n*****\n&gt; “The market tends to shoot first and ask questions later. There will certainly be a reaction if Democrats win both those seats,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. Strategists say there could be a relief rally if Republican incumbents see a clear victory.\n*****\n&gt; “That totally dominates [trading] because it’s about do we have status quo or do we have Democrats controlling all parts of Washington and what that means for spending and taxes,” Boockvar said. “I think you could see the worries about taxes overwhelming any thoughts on the benefits of more spending” by Democrats.\n*****\n&gt; # By the numbers\n&gt; A year of extreme volatility ended with a big win for stocks, as the pandemic steered the course for markets. The S&amp;P 500 was up 16.3% for the year, ending at 3,756. That gain comes after a 34% decline early in the year, followed by a powerful more-than 65% rebound. Technology was the big winner for the year, and the Nasdaq was up 43.6% at 12,888.\n*****\n&gt; Besides the runoff vote, the market will be watching a stream of data in the coming week, including the important December jobs report Friday. That could show fewer than 100,000 jobs were added as the spreading virus impacted hiring and layoffs. There were 245,000 jobs created in November.\n*****\n&gt; There is also ISM manufacturing data Tuesday, and a number of Fed speakers, including Vice Chairman Richard Clarida on Friday.\n*****\n&gt; The virus itself could also be a factor for stocks.\n*****\n&gt; Conventional wisdom for the coming year has been that vaccines will be widely distributed, and by the second half things will start to get back to normal and the economy will pick up. But the initial distribution has been slow, and far short of the 20 million targeted for December by President Donald Trump’s task force.\n*****\n&gt; In that recent RBC survey, three quarters of investors were optimistic about vaccine distribution with 80% expecting a majority to be vaccinated by the end of 2021. “We suspect that the positive outlook for the stock market and the economy would deteriorate if expectations for a smooth vaccine rollout are not met,” RBC strategists wrote.\n*****\n&gt; They also noted that nearly 60% of the investors surveyed believe high stock market valuations are problematic.\n*****\n&gt; “This suggests to us that any threat to the economic and earnings recovery story could spark profit-taking. On this point, it is worth noting that the vaccine was the No. 1 issue keeping investors up at night, closely followed by monetary policy and excessive optimism on the recovery,” the strategists noted.\n*****\n&gt; Chris Rupkey, chief financial economist at MUFG Union Bank, said investors will also be watching the formal acceptance of the Electoral College vote Wednesday. Strategists expect the vote count to confirm Biden’s presidency.\n*****\n&gt; However, Missouri Sen. Josh Hawley says he will challenge the certification, and several House Republicans have already vowed to contest the election at that time. If one House member and a senator jointly object to a state’s slate of electors, the two houses of Congress must separately debate and vote on the objection.\n*****\n&gt; Strategists see little chance of any impact on the election outcome, but there could be fireworks. Trump has been claiming since the election that there was fraud but multiple courts failed to find any truth to the claims.\n*****\n&gt; Rupkey said investors are not taking into account enough potential for political risk from the deep animosity between the two political parties.\n*****\n&gt; “I think the additional stimulus and hopes for additional stimulus, and infrastructure spending in 2021, I don’t know that that is such a slam dunk, because of the issue of political instability,” he said.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/cAXzkxf.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/HnhSggu.png))**\n\n# **Major Futures Markets as of Thursday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF THURSDAY!](https://i.imgur.com/5egoYkS.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/UlNY0Um.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/z4wSKuc.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/32Ma7rG.png))**\n\n# **Major Indices Pullback/Correction Levels as of Thursday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/mRJqU8A.png)**\n\n# **Major Indices Rally Levels as of Thursday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/J7B4Njx.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/5udYrpD.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/JJmAiwp.png))**\n\n# **Thursday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/1ARzFfu.png))**\n\n*****\n\n&gt; # Why A Year-End Rally Bodes Well For 2021\n\n&gt; Welcome to the last day of 2020! It has been a devastating year in so many ways, yet for investors it has been quite rewarding. Much of the gains in 2020 have taken place the final two months, with the S&amp;P 500 Index up more than 14% in November and December so far, the best end to a year since WWII.\n\n&gt; A big end of year rally could have bulls smiling in 2021. “Turns out a 10% or more gain the final two months of the year has equaled a higher S&amp;P 500 the following year every single time since World War II,” explained LPL Financial Chief Market Strategist Ryan Detrick. “In fact, January was also higher every single time as well, so maybe this strong rally to end the year is a clue for higher prices into next year.”\n\n&gt; As shown in the LPL Chart of the Day, the S&amp;P 500 gained an average of more than 18% the year following a 10% or more surge during the final two months of the year. Meanwhile, January was up 5 for 5 as well, rising an impressive 3% on average.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.31.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; Here’s what the average year looks like after the prior year gains 10% or more the final two months compared to a typical year. Once again, strong returns are the playbook historically.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/12/blog-12.31.20-2.png?ssl=1))**\n\n&gt; We wish everyone a happy and safe New Years Eve and we’ll see you in 2021!\n\n*****\n\n&gt; # Fifty to Zero in 283 Days\n\n&gt; In a year with some pretty crazy charts, the one below is right up there with some of the best. After all the markets have been through this year, bot the S&amp;P 500 and Long-Term Treasuries have seen nearly identical returns on a total return basis. That's right, with just a few hours left in the trading year, the S&amp;P 500's total return in 2020 has been a gain of 17.6%, while Long Term US Treasuries, as measured by the B of A Merrill Lynch Long-Term Treasury Index has rallied 17.3%. What makes this nearly identical performance all the more incredible is that on March 23rd, the performance gap between the two was more than 50 percentage points.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123120-Stocks-Bonds.png))**\n\n&gt; The fact that stocks and bonds have essentially seen identical returns this year isn't typical. The chart below shows the annual performance spread between the S&amp;P 500 and long-term US Treasuries going back to 1978. During that time, the S&amp;P 500 has historically outperformed long-term US Treasuries by an average of 3.9 percentage points per year, but the average gap in performance between the two has been over 15 percentage points. In the 43 years since 1978, there have only been seven other years where the performance spread between the two asset classes was less than five percentage points and just two years (1985 and 1992) where the performance spread was less than a percentage point.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123120-Stocks-Bonds-Annual-Spreads.png))**\n\n*****\n\n&gt; # Back-to-Back Big Years for Technology\n\n&gt; With just two trading days (including today) left in 2020, the S&amp;P 500 Technology sector is on pace for its second year in a row of rallying more than 40%. Going back to 1990, the only time the Technology sector experienced back-to-back returns of more than 40% was in 1998 and 1999. Back then, not only was the Technology sector up 40%+ in back-to-back years, but it was also up over 75% in both of those years. If you think markets are pretty crazy these days, they still have nothing on the last two years of the 1990s!\n\n&gt; In terms of cumulative returns, the Technology sector is up 210% since the last trading day of 2018, whereas in 1999 it was up 317% in a two-year span. What's also interesting to note about the last 31 years of returns for the Technology sector is how it has only experienced five down years, while the S&amp;P 500 has been down in ten different years during that span. Furthermore, since 2009 there has only been one down year and the decline was a paltry 1.6%. Not a bad 12-year run!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Technology-Sector-Performance.png))**\n\n&gt; Given that the sector has more than doubled in the last two years, there have been some big individual winners. Topping the list with a gain of just under 400% is Advanced Micro Devices (AMD). On the last day of 2018, AMD traded hands for under $20 per share. Today's it's over $90. AMD has a lead of more than 100 percentage points over the next closest stock - NVIDIA (NVDA) - which is up 288%. Interestingly, there aren't a lot of major outliers to the upside compared to the sector's 210% gain, but that's because Apple (AAPL), the sector's largest stock, has paced the sector's gains by rallying more than 240%.\n\n&gt; On the downside, just four stocks in the Technology sector have declined in the last two years. The worst of these has been DXC Technology (DXC) which has lost more than half of its value, while Juniper (JNPR) and HP Enterprise (HPE) are down between 10% and 20%. Lastly, FLIR Systems (FLIR) has declined less than 2%, so depending on how it acts in the next two days, it could move into positive territory just as Intel (INTC) did yesterday after Third Point bailed it out and moved the stock barely into positive territory for the last two years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Technology-Sector-Stocks.png))**\n\n*****\n\n&gt; # Growth Dragging on Small Caps\n\n&gt; In the past couple of weeks, we have frequently been keeping tabs on small-cap equities which have been particularly strong performers of late resulting in very overbought readings as well as extended valuations. More specifically, taking a look at growth-oriented small-caps, with only a couple days left in the year small-cap growth stocks—proxied by the Russell 2000 Growth ETF (IWO)—are on pace to have outperformed large-cap equivalents in 2020. On December 10th, IWO surpassed the S&amp;P 500 Growth ETF (IVW) in terms of YTD performance, and even after pulling back in the past week, IWO is still in the lead.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large1.png))**\n\n&gt; As a result of recent moves, there has been a sharp reversal on a relative basis between the two ETFs in the past week. In the chart below, we show the ratio of the Russell 2000 Growth ETF (IWO) versus the S&amp;P 500 Growth ETF (IVW). This ratio took off beginning in the early fall meaning small-cap growth drastically outperformed large-cap growth. But the former's weakness in the past several days has put a halt to that move.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large2.png))**\n\n&gt; As to just how sharp of a reversal this was, in the five days through yesterday's close, the decline in the ratio of IWO to IVW was the largest since June. Before that, April and March saw declines that were even larger. Not only was this one of the biggest drops in the relative performance of small-cap growth to large-cap growth in the past few months, but that also stands in the bottom 0.5% of all readings going back to 2000 when the ETF first began trading. Outside of this past spring, the only other periods that have also experienced this type of underperformance of small-cap growth relative to large-cap growth was at various points in 2011, 2008, and a handful of times in the early 2000s.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large3.png))**\n\n&gt; Small-cap underperformance has not necessarily been broad though. For value stocks, small caps (IWN) have generally outperformed large caps (IVE) for the entirety of the new bull market. While there was a bit of a turn lower in recent days, it has been nowhere close to as dramatic of a move as growth stocks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large4.png))**\n\n&gt; In the charts below, we show average performance over the past week of Russell 2000 stocks broken into deciles based on their price to sales and price to book ratios. As shown, the most aggressively valued deciles have averaged the worst performance in the past week. Stocks with low P/S and P/B ratios have not been immune from the weakness, but they have held up significantly better.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-RTY-Decile.png))**\n\n*****\n\n# **STOCK MARKET VIDEO: Stock Market Analysis Video for Week Ending December 31st, 2020** \n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=oFRABTKrDl8))**\n\n# **STOCK MARKET VIDEO: ShadowTrader Video Weekly 1.3.21**\n###### **([CLICK HERE FOR THE YOUTUBE VIDEO!](https://www.youtube.com/watch?v=prYPiK171zk))**\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n&gt; * **$MU** \n&gt; * **$BBBY** \n&gt; * **$SMPL** \n&gt; * **$WBA** \n&gt; * **$STZ** \n&gt; * **$RPM** \n&gt; * **$MSM** \n&gt; * **$CAG** \n&gt; * **$UNF** \n&gt; * **$HELE** \n&gt; * **$ANGO** \n&gt; * **$SGH** \n&gt; * **$AYI** \n&gt; * **$REVG** \n&gt; * **$LW** \n&gt; * **$WDFC** \n&gt; * **$LNN** \n&gt; * **$LNDC** \n&gt; * **$SAR** \n&gt; * **$RGP** \n&gt; * **$GBX** \n&gt; * **$ACCD** \n&gt; * **$DCT** \n&gt; * **$FC** \n&gt; * **$NTIC** \n&gt; * **$SCHN**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/5udYrpD.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/hQIRBYI.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.4.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 1.4.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  1.5.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZAbC0jw.png))\n\n&gt; # ***Tuesday 1.5.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/wKzyMxp.png))\n\n*****\n\n&gt; # ***Wednesday 1.6.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BUFtffd.png))\n\n&gt; # ***Wednesday 1.6.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cDQHHqx.png))\n\n*****\n\n&gt; # ***Thursday 1.7.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/NhUT413.png))\n\n&gt; # ***Thursday 1.7.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7p03h4M.png))\n\n*****\n\n&gt; # ***Friday 1.8.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 1.8.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Micron Technology, Inc. $75.18\n**Micron Technology, Inc. (MU)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, January 7, 2021. The consensus earnings estimate is $0.71 per share on revenue of $5.73 billion and the Earnings Whisper ® number is $0.78 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat The company's guidance was for earnings of $0.40 to $0.54 per share. Consensus estimates are for year-over-year earnings growth of 69.05% with revenue increasing by 11.39%. Short interest has decreased by 20.0% since the company's last earnings release while the stock has drifted higher by 53.6% from its open following the earnings release to be 46.1% above its 200 day moving average of $51.46. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, December 30, 2020 there was some notable buying of 14,441 contracts of the $72.50 call expiring on Friday, April 16, 2021. Option traders are pricing in a 7.5% move on earnings and the stock has averaged a 7.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Bed Bath &amp; Beyond, Inc. $17.76\n**Bed Bath &amp; Beyond, Inc. (BBBY)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $0.21 per share on revenue of $2.77 billion and the Earnings Whisper ® number is $0.31 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 155.26% with revenue increasing by 0.39%. Short interest has increased by 0.3% since the company's last earnings release while the stock has drifted lower by 3.0% from its open following the earnings release to be 40.2% above its 200 day moving average of $12.66. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, December 22, 2020 there was some notable buying of 6,626 contracts of the $19.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 17.0% move on earnings and the stock has averaged a 15.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BBBY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Simply Good Foods Company $31.36\n**Simply Good Foods Company (SMPL)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, January 6, 2021. The consensus earnings estimate is $0.20 per share on revenue of $208.89 million and the Earnings Whisper ® number is $0.23 per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 9.09% with revenue increasing by 37.29%. Short interest has increased by 5.9% since the company's last earnings release while the stock has drifted higher by 52.9% from its open following the earnings release to be 47.2% above its 200 day moving average of $21.31. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, December 23, 2020 there was some notable buying of 508 contracts of the $30.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 17.5% move on earnings and the stock has averaged a 5.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SMPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Walgreens Boots Alliance Inc $39.88\n**Walgreens Boots Alliance Inc (WBA)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $1.02 per share on revenue of $34.89 billion and the Earnings Whisper ® number is $1.11 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 25.55% with revenue increasing by 1.60%. Short interest has decreased by 15.2% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 1.0% below its 200 day moving average of $40.29. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, December 31, 2020 there was some notable buying of 14,690 contracts of the $40.00 call expiring on Friday, February 19, 2021. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WBA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Constellation Brands, Inc. $219.05\n**Constellation Brands, Inc. (STZ)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $2.39 per share on revenue of $2.22 billion and the Earnings Whisper ® number is $2.45 per share. Investor sentiment going into the company's earnings release has 54% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.68% with revenue increasing by 1.76%. Short interest has decreased by 37.7% since the company's last earnings release while the stock has drifted higher by 14.7% from its open following the earnings release to be 22.6% above its 200 day moving average of $178.74. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, December 24, 2020 there was some notable buying of 2,291 contracts of the $212.50 call expiring on Friday, January 8, 2021. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=STZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # RPM International Inc. $90.78\n**RPM International Inc. (RPM)** is confirmed to report earnings at approximately 6:45 AM ET on Wednesday, January 6, 2021. The consensus earnings estimate is $1.00 per share on revenue of $1.46 billion and the Earnings Whisper ® number is $1.10 per share. Investor sentiment going into the company's earnings release has 40% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 31.58% with revenue increasing by 4.19%. Short interest has decreased by 23.0% since the company's last earnings release while the stock has drifted higher by 4.5% from its open following the earnings release to be 15.8% above its 200 day moving average of $78.42. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 4.3% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RPM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # MSC Industrial Direct Co. Inc. $84.39\n**MSC Industrial Direct Co. Inc. (MSM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, January 6, 2021. The consensus earnings estimate is $1.07 per share on revenue of $774.61 million and the Earnings Whisper ® number is $1.15 per share. Investor sentiment going into the company's earnings release has 25% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 11.57% with revenue decreasing by 5.95%. Short interest has decreased by 21.2% since the company's last earnings release while the stock has drifted higher by 27.3% from its open following the earnings release to be 22.5% above its 200 day moving average of $68.91. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 3.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Conagra Brands, Inc. $36.26\n**Conagra Brands, Inc. (CAG)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $0.73 per share on revenue of $2.99 billion and the Earnings Whisper ® number is $0.77 per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for earnings of $0.70 to $0.74 per share. Consensus estimates are for year-over-year earnings growth of 15.87% with revenue increasing by 6.00%. Short interest has increased by 17.1% since the company's last earnings release while the stock has drifted higher by 0.3% from its open following the earnings release to be 3.7% above its 200 day moving average of $34.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, December 21, 2020 there was some notable buying of 4,915 contracts of the $38.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 6.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CAG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # UniFirst Corporation $211.69\n**UniFirst Corporation (UNF)** is confirmed to report earnings at approximately 8:00 AM ET on Wednesday, January 6, 2021. The consensus earnings estimate is $1.68 per share on revenue of $440.79 million and the Earnings Whisper ® number is $1.79 per share. Investor sentiment going into the company's earnings release has 18% expecting an earnings beat The company's guidance was for earnings of $1.55 to $1.70 per share on revenue of $433.00 million to $443.00 million. Consensus estimates are for earnings to decline year-over-year by 33.33% with revenue decreasing by 5.29%. Short interest has decreased by 62.4% since the company's last earnings release while the stock has drifted higher by 10.4% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Helen of Troy Ltd. $222.19\n**Helen of Troy Ltd. (HELE)** is confirmed to report earnings at approximately 6:45 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $3.10 per share on revenue of $560.13 million and the Earnings Whisper ® number is $3.25 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 5.08% with revenue increasing by 17.99%. Short interest has increased by 53.4% since the company's last earnings release while the stock has drifted higher by 10.9% from its open following the earnings release to be 19.2% above its 200 day moving average of $186.47. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.0% move on earnings and the stock has averaged a 6.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HELE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading year ahead r/smallstreetbets.",
        "subreddit": "smallstreetbets",
        "title": "Wall Street Week Ahead for the trading week beginning January 4th, 2021 (Happy New Year r/smallstreetbets!)",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/kp0mpi/wall_street_week_ahead_for_the_trading_week/",
        "created": 1609634567.0
    },
    {
        "author": "bigbear0083",
        "created_utc": 1609605641,
        "id": "kp0lav",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Good Saturday morning to all of you here on r/stocks. Happy New Year! I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week, month and year ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning January 4th, 2021.\n\n# **Politics will be front and center as a catalyst in the first week of the new year  - [(Source)](https://www.cnbc.com/2020/12/31/politics-will-be-front-and-center-as-a-catalyst-in-the-first-week-of-the-new-year-.html)**\n*****\n&gt; Stocks exit 2020 with strong gains and are riding a tailwind, but already in the dawn of the new year, the market could face its first big challenge.\n*****\n&gt; The final outcome of the 2020 election plays out Tuesday, when voters in Georgia will pick their senators and decide which party controls the U.S. Senate.\n*****\n&gt; With President-elect Joe Biden heading to the White House and a Democratic-controlled House of Representatives, Wall Street has been comfortable with the view that Biden and the Democrats could not succeed with tax hikes and more progressive policy changes while Republicans hold the Senate.\n*****\n&gt; The runoff election for the two Senate seats Tuesday is widely expected to result in one or both of the incumbent Republican senators retaining their seats. But Democrats are close in the polls and should they win, each party would have 50 seats with Vice President-elect Kamala Harris the tie breaker.\n*****\n&gt; “Georgia is the most important thing to the Biden presidency for the next two years,” said Ed Mills, Washington policy analyst at Raymond James. “It’s going to determine what is the legislative agenda and who can get confirmed by the United States Senate.”\n*****\n&gt; Sen. David Perdue is being challenged by Democrat Jon Ossoff, while GOP Sen. Kelly Loeffler is running against Democrat Raphael Warnock. None of the candidates had more than 50% of the vote in the Nov. 3 election, so Georgia law requires a runoff election between the two leading candidates for each seat.\n*****\n&gt; “It’s a binary event,” said Mills, adding it’s of growing interest to markets. “The general sense for the market is that Republicans are well positioned to maintain their majority in the Senate. But I think the 2020 election as well as the 2016 election and to some extent, the 2018 election has humbled us … The Senate outcomes, in particular, seem to be less predictable than almost any other elections.”\n*****\n&gt; Mills said the results may take several days to determine, adding to the uncertainty the event could hold for markets. According to an RBC investor survey, 88% expect Republicans to maintain control, and most say that is a positive for the stock market.\n*****\n&gt; “The market tends to shoot first and ask questions later. There will certainly be a reaction if Democrats win both those seats,” said Peter Boockvar, chief investment officer at Bleakley Advisory Group. Strategists say there could be a relief rally if Republican incumbents see a clear victory.\n*****\n&gt; “That totally dominates [trading] because it’s about do we have status quo or do we have Democrats controlling all parts of Washington and what that means for spending and taxes,” Boockvar said. “I think you could see the worries about taxes overwhelming any thoughts on the benefits of more spending” by Democrats.\n*****\n&gt; # By the numbers\n&gt; A year of extreme volatility ended with a big win for stocks, as the pandemic steered the course for markets. The S&amp;P 500 was up 16.3% for the year, ending at 3,756. That gain comes after a 34% decline early in the year, followed by a powerful more-than 65% rebound. Technology was the big winner for the year, and the Nasdaq was up 43.6% at 12,888.\n*****\n&gt; Besides the runoff vote, the market will be watching a stream of data in the coming week, including the important December jobs report Friday. That could show fewer than 100,000 jobs were added as the spreading virus impacted hiring and layoffs. There were 245,000 jobs created in November.\n*****\n&gt; There is also ISM manufacturing data Tuesday, and a number of Fed speakers, including Vice Chairman Richard Clarida on Friday.\n*****\n&gt; The virus itself could also be a factor for stocks.\n*****\n&gt; Conventional wisdom for the coming year has been that vaccines will be widely distributed, and by the second half things will start to get back to normal and the economy will pick up. But the initial distribution has been slow, and far short of the 20 million targeted for December by President Donald Trump’s task force.\n*****\n&gt; In that recent RBC survey, three quarters of investors were optimistic about vaccine distribution with 80% expecting a majority to be vaccinated by the end of 2021. “We suspect that the positive outlook for the stock market and the economy would deteriorate if expectations for a smooth vaccine rollout are not met,” RBC strategists wrote.\n*****\n&gt; They also noted that nearly 60% of the investors surveyed believe high stock market valuations are problematic.\n*****\n&gt; “This suggests to us that any threat to the economic and earnings recovery story could spark profit-taking. On this point, it is worth noting that the vaccine was the No. 1 issue keeping investors up at night, closely followed by monetary policy and excessive optimism on the recovery,” the strategists noted.\n*****\n&gt; Chris Rupkey, chief financial economist at MUFG Union Bank, said investors will also be watching the formal acceptance of the Electoral College vote Wednesday. Strategists expect the vote count to confirm Biden’s presidency.\n*****\n&gt; However, Missouri Sen. Josh Hawley says he will challenge the certification, and several House Republicans have already vowed to contest the election at that time. If one House member and a senator jointly object to a state’s slate of electors, the two houses of Congress must separately debate and vote on the objection.\n*****\n&gt; Strategists see little chance of any impact on the election outcome, but there could be fireworks. Trump has been claiming since the election that there was fraud but multiple courts failed to find any truth to the claims.\n*****\n&gt; Rupkey said investors are not taking into account enough potential for political risk from the deep animosity between the two political parties.\n*****\n&gt; “I think the additional stimulus and hopes for additional stimulus, and infrastructure spending in 2021, I don’t know that that is such a slam dunk, because of the issue of political instability,” he said.\n*****\n\n# **This past week saw the following moves in the S&amp;P:**\n###### **([CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/cAXzkxf.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/HnhSggu.png))**\n\n# **Major Futures Markets as of Thursday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF THURSDAY!](https://i.imgur.com/5egoYkS.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/UlNY0Um.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/z4wSKuc.png))**\n\n# **S&amp;P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/32Ma7rG.png))**\n\n# **Major Indices Pullback/Correction Levels as of Thursday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/mRJqU8A.png)**\n\n# **Major Indices Rally Levels as of Thursday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/J7B4Njx.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/5udYrpD.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/JJmAiwp.png))**\n\n# **Thursday's Stock Analyst Upgrades &amp; Downgrades:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/1ARzFfu.png))**\n\n*****\n\n&gt; # Why A Year-End Rally Bodes Well For 2021\n\n&gt; Welcome to the last day of 2020! It has been a devastating year in so many ways, yet for investors it has been quite rewarding. Much of the gains in 2020 have taken place the final two months, with the S&amp;P 500 Index up more than 14% in November and December so far, the best end to a year since WWII.\n\n&gt; A big end of year rally could have bulls smiling in 2021. “Turns out a 10% or more gain the final two months of the year has equaled a higher S&amp;P 500 the following year every single time since World War II,” explained LPL Financial Chief Market Strategist Ryan Detrick. “In fact, January was also higher every single time as well, so maybe this strong rally to end the year is a clue for higher prices into next year.”\n\n&gt; As shown in the LPL Chart of the Day, the S&amp;P 500 gained an average of more than 18% the year following a 10% or more surge during the final two months of the year. Meanwhile, January was up 5 for 5 as well, rising an impressive 3% on average.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.31.20-Blog-Chart-1.png?ssl=1))**\n\n&gt; Here’s what the average year looks like after the prior year gains 10% or more the final two months compared to a typical year. Once again, strong returns are the playbook historically.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/12/blog-12.31.20-2.png?ssl=1))**\n\n&gt; We wish everyone a happy and safe New Years Eve and we’ll see you in 2021!\n\n*****\n\n&gt; # Fifty to Zero in 283 Days\n\n&gt; In a year with some pretty crazy charts, the one below is right up there with some of the best. After all the markets have been through this year, bot the S&amp;P 500 and Long-Term Treasuries have seen nearly identical returns on a total return basis. That's right, with just a few hours left in the trading year, the S&amp;P 500's total return in 2020 has been a gain of 17.6%, while Long Term US Treasuries, as measured by the B of A Merrill Lynch Long-Term Treasury Index has rallied 17.3%. What makes this nearly identical performance all the more incredible is that on March 23rd, the performance gap between the two was more than 50 percentage points.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123120-Stocks-Bonds.png))**\n\n&gt; The fact that stocks and bonds have essentially seen identical returns this year isn't typical. The chart below shows the annual performance spread between the S&amp;P 500 and long-term US Treasuries going back to 1978. During that time, the S&amp;P 500 has historically outperformed long-term US Treasuries by an average of 3.9 percentage points per year, but the average gap in performance between the two has been over 15 percentage points. In the 43 years since 1978, there have only been seven other years where the performance spread between the two asset classes was less than five percentage points and just two years (1985 and 1992) where the performance spread was less than a percentage point.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123120-Stocks-Bonds-Annual-Spreads.png))**\n\n*****\n\n&gt; # Back-to-Back Big Years for Technology\n\n&gt; With just two trading days (including today) left in 2020, the S&amp;P 500 Technology sector is on pace for its second year in a row of rallying more than 40%. Going back to 1990, the only time the Technology sector experienced back-to-back returns of more than 40% was in 1998 and 1999. Back then, not only was the Technology sector up 40%+ in back-to-back years, but it was also up over 75% in both of those years. If you think markets are pretty crazy these days, they still have nothing on the last two years of the 1990s!\n\n&gt; In terms of cumulative returns, the Technology sector is up 210% since the last trading day of 2018, whereas in 1999 it was up 317% in a two-year span. What's also interesting to note about the last 31 years of returns for the Technology sector is how it has only experienced five down years, while the S&amp;P 500 has been down in ten different years during that span. Furthermore, since 2009 there has only been one down year and the decline was a paltry 1.6%. Not a bad 12-year run!\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Technology-Sector-Performance.png))**\n\n&gt; Given that the sector has more than doubled in the last two years, there have been some big individual winners. Topping the list with a gain of just under 400% is Advanced Micro Devices (AMD). On the last day of 2018, AMD traded hands for under $20 per share. Today's it's over $90. AMD has a lead of more than 100 percentage points over the next closest stock - NVIDIA (NVDA) - which is up 288%. Interestingly, there aren't a lot of major outliers to the upside compared to the sector's 210% gain, but that's because Apple (AAPL), the sector's largest stock, has paced the sector's gains by rallying more than 240%.\n\n&gt; On the downside, just four stocks in the Technology sector have declined in the last two years. The worst of these has been DXC Technology (DXC) which has lost more than half of its value, while Juniper (JNPR) and HP Enterprise (HPE) are down between 10% and 20%. Lastly, FLIR Systems (FLIR) has declined less than 2%, so depending on how it acts in the next two days, it could move into positive territory just as Intel (INTC) did yesterday after Third Point bailed it out and moved the stock barely into positive territory for the last two years.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Technology-Sector-Stocks.png))**\n\n*****\n\n&gt; # Growth Dragging on Small Caps\n\n&gt; In the past couple of weeks, we have frequently been keeping tabs on small-cap equities which have been particularly strong performers of late resulting in very overbought readings as well as extended valuations. More specifically, taking a look at growth-oriented small-caps, with only a couple days left in the year small-cap growth stocks—proxied by the Russell 2000 Growth ETF (IWO)—are on pace to have outperformed large-cap equivalents in 2020. On December 10th, IWO surpassed the S&amp;P 500 Growth ETF (IVW) in terms of YTD performance, and even after pulling back in the past week, IWO is still in the lead.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large1.png))**\n\n&gt; As a result of recent moves, there has been a sharp reversal on a relative basis between the two ETFs in the past week. In the chart below, we show the ratio of the Russell 2000 Growth ETF (IWO) versus the S&amp;P 500 Growth ETF (IVW). This ratio took off beginning in the early fall meaning small-cap growth drastically outperformed large-cap growth. But the former's weakness in the past several days has put a halt to that move.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large2.png))**\n\n&gt; As to just how sharp of a reversal this was, in the five days through yesterday's close, the decline in the ratio of IWO to IVW was the largest since June. Before that, April and March saw declines that were even larger. Not only was this one of the biggest drops in the relative performance of small-cap growth to large-cap growth in the past few months, but that also stands in the bottom 0.5% of all readings going back to 2000 when the ETF first began trading. Outside of this past spring, the only other periods that have also experienced this type of underperformance of small-cap growth relative to large-cap growth was at various points in 2011, 2008, and a handful of times in the early 2000s.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large3.png))**\n\n&gt; Small-cap underperformance has not necessarily been broad though. For value stocks, small caps (IWN) have generally outperformed large caps (IVE) for the entirety of the new bull market. While there was a bit of a turn lower in recent days, it has been nowhere close to as dramatic of a move as growth stocks.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-Small-Large4.png))**\n\n&gt; In the charts below, we show average performance over the past week of Russell 2000 stocks broken into deciles based on their price to sales and price to book ratios. As shown, the most aggressively valued deciles have averaged the worst performance in the past week. Stocks with low P/S and P/B ratios have not been immune from the weakness, but they have held up significantly better.\n\n&gt; ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/123020-RTY-Decile.png))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/5udYrpD.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/hQIRBYI.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n&gt; # ***Monday 1.4.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n&gt; # ***Monday 1.4.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!]())\n(NONE.)\n\n*****\n\n&gt; # ***Tuesday  1.5.21 Before Market Open:***\n&gt; ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/ZAbC0jw.png))\n\n&gt; # ***Tuesday 1.5.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/wKzyMxp.png))\n\n*****\n\n&gt; # ***Wednesday 1.6.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/BUFtffd.png))\n\n&gt; # ***Wednesday 1.6.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/cDQHHqx.png))\n\n*****\n\n&gt; # ***Thursday 1.7.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/NhUT413.png))\n\n&gt; # ***Thursday 1.7.21 After Market Close:*** \n&gt; ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!](https://i.imgur.com/7p03h4M.png))\n\n*****\n\n&gt; # ***Friday 1.8.21 Before Market Open:*** \n&gt; ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # ***Friday 1.8.21 After Market Close:***\n&gt; ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())\n(NONE.)\n\n*****\n\n&gt; # Micron Technology, Inc. $75.18\n**Micron Technology, Inc. (MU)** is confirmed to report earnings at approximately 4:00 PM ET on Thursday, January 7, 2021. The consensus earnings estimate is $0.71 per share on revenue of $5.73 billion and the Earnings Whisper ® number is $0.78 per share. Investor sentiment going into the company's earnings release has 72% expecting an earnings beat The company's guidance was for earnings of $0.40 to $0.54 per share. Consensus estimates are for year-over-year earnings growth of 69.05% with revenue increasing by 11.39%. Short interest has decreased by 20.0% since the company's last earnings release while the stock has drifted higher by 53.6% from its open following the earnings release to be 46.1% above its 200 day moving average of $51.46. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, December 30, 2020 there was some notable buying of 14,441 contracts of the $72.50 call expiring on Friday, April 16, 2021. Option traders are pricing in a 7.5% move on earnings and the stock has averaged a 7.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Bed Bath &amp; Beyond, Inc. $17.76\n**Bed Bath &amp; Beyond, Inc. (BBBY)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $0.21 per share on revenue of $2.77 billion and the Earnings Whisper ® number is $0.31 per share. Investor sentiment going into the company's earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 155.26% with revenue increasing by 0.39%. Short interest has increased by 0.3% since the company's last earnings release while the stock has drifted lower by 3.0% from its open following the earnings release to be 40.2% above its 200 day moving average of $12.66. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, December 22, 2020 there was some notable buying of 6,626 contracts of the $19.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 17.0% move on earnings and the stock has averaged a 15.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=BBBY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Simply Good Foods Company $31.36\n**Simply Good Foods Company (SMPL)** is confirmed to report earnings at approximately 7:00 AM ET on Wednesday, January 6, 2021. The consensus earnings estimate is $0.20 per share on revenue of $208.89 million and the Earnings Whisper ® number is $0.23 per share. Investor sentiment going into the company's earnings release has 59% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 9.09% with revenue increasing by 37.29%. Short interest has increased by 5.9% since the company's last earnings release while the stock has drifted higher by 52.9% from its open following the earnings release to be 47.2% above its 200 day moving average of $21.31. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, December 23, 2020 there was some notable buying of 508 contracts of the $30.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 17.5% move on earnings and the stock has averaged a 5.3% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SMPL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Walgreens Boots Alliance Inc $39.88\n**Walgreens Boots Alliance Inc (WBA)** is confirmed to report earnings at approximately 7:00 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $1.02 per share on revenue of $34.89 billion and the Earnings Whisper ® number is $1.11 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 25.55% with revenue increasing by 1.60%. Short interest has decreased by 15.2% since the company's last earnings release while the stock has drifted higher by 9.7% from its open following the earnings release to be 1.0% below its 200 day moving average of $40.29. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, December 31, 2020 there was some notable buying of 14,690 contracts of the $40.00 call expiring on Friday, February 19, 2021. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 4.9% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=WBA&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Constellation Brands, Inc. $219.05\n**Constellation Brands, Inc. (STZ)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $2.39 per share on revenue of $2.22 billion and the Earnings Whisper ® number is $2.45 per share. Investor sentiment going into the company's earnings release has 54% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 11.68% with revenue increasing by 1.76%. Short interest has decreased by 37.7% since the company's last earnings release while the stock has drifted higher by 14.7% from its open following the earnings release to be 22.6% above its 200 day moving average of $178.74. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, December 24, 2020 there was some notable buying of 2,291 contracts of the $212.50 call expiring on Friday, January 8, 2021. Option traders are pricing in a 5.6% move on earnings and the stock has averaged a 4.0% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=STZ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # RPM International Inc. $90.78\n**RPM International Inc. (RPM)** is confirmed to report earnings at approximately 6:45 AM ET on Wednesday, January 6, 2021. The consensus earnings estimate is $1.00 per share on revenue of $1.46 billion and the Earnings Whisper ® number is $1.10 per share. Investor sentiment going into the company's earnings release has 40% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 31.58% with revenue increasing by 4.19%. Short interest has decreased by 23.0% since the company's last earnings release while the stock has drifted higher by 4.5% from its open following the earnings release to be 15.8% above its 200 day moving average of $78.42. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 4.3% move on earnings and the stock has averaged a 2.5% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RPM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # MSC Industrial Direct Co. Inc. $84.39\n**MSC Industrial Direct Co. Inc. (MSM)** is confirmed to report earnings at approximately 6:30 AM ET on Wednesday, January 6, 2021. The consensus earnings estimate is $1.07 per share on revenue of $774.61 million and the Earnings Whisper ® number is $1.15 per share. Investor sentiment going into the company's earnings release has 25% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 11.57% with revenue decreasing by 5.95%. Short interest has decreased by 21.2% since the company's last earnings release while the stock has drifted higher by 27.3% from its open following the earnings release to be 22.5% above its 200 day moving average of $68.91. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 3.4% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MSM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Conagra Brands, Inc. $36.26\n**Conagra Brands, Inc. (CAG)** is confirmed to report earnings at approximately 7:30 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $0.73 per share on revenue of $2.99 billion and the Earnings Whisper ® number is $0.77 per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat The company's guidance was for earnings of $0.70 to $0.74 per share. Consensus estimates are for year-over-year earnings growth of 15.87% with revenue increasing by 6.00%. Short interest has increased by 17.1% since the company's last earnings release while the stock has drifted higher by 0.3% from its open following the earnings release to be 3.7% above its 200 day moving average of $34.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, December 21, 2020 there was some notable buying of 4,915 contracts of the $38.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 6.3% move on earnings and the stock has averaged a 6.7% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CAG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # UniFirst Corporation $211.69\n**UniFirst Corporation (UNF)** is confirmed to report earnings at approximately 8:00 AM ET on Wednesday, January 6, 2021. The consensus earnings estimate is $1.68 per share on revenue of $440.79 million and the Earnings Whisper ® number is $1.79 per share. Investor sentiment going into the company's earnings release has 18% expecting an earnings beat The company's guidance was for earnings of $1.55 to $1.70 per share on revenue of $433.00 million to $443.00 million. Consensus estimates are for earnings to decline year-over-year by 33.33% with revenue decreasing by 5.29%. Short interest has decreased by 62.4% since the company's last earnings release while the stock has drifted higher by 10.4% from its open following the earnings release. Overall earnings estimates have been revised lower since the company's last earnings release.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=UNF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n&gt; # Helen of Troy Ltd. $222.19\n**Helen of Troy Ltd. (HELE)** is confirmed to report earnings at approximately 6:45 AM ET on Thursday, January 7, 2021. The consensus earnings estimate is $3.10 per share on revenue of $560.13 million and the Earnings Whisper ® number is $3.25 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 5.08% with revenue increasing by 17.99%. Short interest has increased by 53.4% since the company's last earnings release while the stock has drifted higher by 10.9% from its open following the earnings release to be 19.2% above its 200 day moving average of $186.47. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 7.0% move on earnings and the stock has averaged a 6.1% move in recent quarters.\n\n&gt; #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HELE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading year ahead r/stocks.",
        "subreddit": "stocks",
        "title": "Wall Street Week Ahead for the trading week beginning January 4th, 2021 (Happy New Year r/stocks!)",
        "url": "https://www.reddit.com/r/stocks/comments/kp0lav/wall_street_week_ahead_for_the_trading_week/",
        "created": 1609634441.0
    },
    {
        "author": "swaggymedia",
        "created_utc": 1609689923,
        "id": "kpn2s9",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "What's up fellas at Options. I made a tool called [FD Ranker](https://www.swaggystocks.com/dashboard/stocklabs/fd-ranker) that logs the average IV of popular tickers. The tool is inclusive of almost 1,000 tickers now.\n\n**What is this tool good for**\n\nI posted in ThetaGang the list with HIGH IV options which is great for running the wheel or selling options. This list is an inverse of that list and displays tickers where IV is pretty low, thus, purchasing calls will likely be cheaper. For example, AAPL implied volatility right now is almost back to the pre-March lows. Remember a low IV can go lower and a high IV can go higher. Do your DD before entering any positions!\n\n# Low IV Tickers List\n\n\\*Some of the market cap data is off, so always double check before entering any plays!\n\nPlease note this list is only inclusive of the more popular tickers mentioned around Reddit. If you want to see the full list and filter by ticker, check out the tool in the link at the top.\n\n&amp;#x200B;\n\n|Ticker|Market Cap|Stock Price|IV (%)|\n|:-|:-|:-|:-|\n|WORK - Slack Technologies Inc - Class A|20.7B|$42.24|9%|\n|SPY - SSgA Active Trust - SSGA SPDR S&amp;P 500|330B|$373.88|16%|\n|VZ - Verizon Communications Inc|243B|$58.75|18%|\n|PEP - Pepsico Inc.|205B|$148.42|19%|\n|TM - Toyota Motor Corporation - ADR|252B|$154.57|20%|\n|COST - Costco Wholesale Corp|167B|$376.75|20%|\n|WMT - Walmart Inc|408B|$144.15|21%|\n|PG - Procter &amp; Gamble Co.|345B|$139.14|21%|\n|HD - Home Depot, Inc.|286B|$265.62|21%|\n|WM - Waste Management, Inc.|49.8B|$117.93|21%|\n|ORCL - Oracle Corp.|190B|$64.69|21%|\n|CSCO - Cisco Systems, Inc.|189B|$44.73|22%|\n|HSY - Hershey Company|31.7B|$152.33|22%|\n|MCD - McDonald\\`s Corp|160B|$214.58|22%|\n|KO - Coca-Cola Co|236B|$54.84|22%|\n|KR - Kroger Co.|24.2B|$31.76|23%|\n|QQQ - Invesco Capital Management LLC - Invesco QQQ Trust Series 1|153B|$314.19|23%|\n|NKE - Nike, Inc. - Class B|222B|$141.47|25%|\n|YUM - Yum Brands Inc.|32.7B|$108.56|25%|\n|MMM - 3M Co.|101B|$174.79|25%|\n|JNJ - Johnson &amp; Johnson|414B|$157.38|26%|\n|LOW - Lowe\\`s Cos., Inc.|118B|$160.51|26%|\n|T - AT&amp;T, Inc.|205B|$28.76|26%|\n|V - Visa Inc - Class A|482B|$218.73|26%|\n|MO - Altria Group Inc.|76.2B|$41.00|26%|\n|TGT - Target Corp|88.4B|$176.53|27%|\n|ABT - Abbott Laboratories|194B|$109.49|27%|\n|IWM - BlackRock Institutional Trust Company N.A. - BTC iShares Russell 2000|58.7B|$196.06|27%|\n|DE - Deere &amp; Co.|84.3B|$269.05|27%|\n|CVS - CVS Health Corp|89.4B|$68.30|27%|\n|BMY - Bristol-Myers Squibb Co.|140B|$62.03|27%|\n|DPZ - Dominos Pizza Inc|15.1B|$383.46|27%|\n|HSBC - HSBC Holdings plc - ADR|106B|$25.91|28%|\n|BX - Blackstone Group Inc (The) - Class A|43.7B|$64.81|28%|\n|DLTR - Dollar Tree Inc|25.4B|$108.04|28%|\n|ADBE - Adobe Inc|240B|$500.45|28%|\n|AZN - Astrazeneca plc - ADR|131B|$49.98|29%|\n|MSFT - Microsoft Corporation|1.68T|$222.83|29%|\n|SBUX - Starbucks Corp.|125B|$107.05|29%|\n|JPM - JPMorgan Chase &amp; Co.|387B|$127.07|29%|\n|HPQ - HP Inc|31.7B|$24.59|29%|\n|IBM - International Business Machines Corp.|112B|$125.88|29%|\n|UNH - Unitedhealth Group Inc|333B|$350.68|29%|\n|PFE - Pfizer Inc.|205B|$36.81|30%|\n|SNE - Sony Corporation. - ADR|127B|$101.10|30%|\n|DELL - Dell Technologies Inc - Class C|53.1B|$73.29|30%|\n|MA - Mastercard Incorporated - Class A|353B|$356.94|31%|\n|TXN - Texas Instruments Inc.|151B|$164.19|31%|\n|CRM - Salesforce.Com Inc|204B|$222.53|31%|\n|CAT - Caterpillar Inc.|98.9B|$182.02|31%|\n|BK - Bank Of New York Mellon Corp|37.6B|$42.44|31%|\n|BAC - Bank Of America Corp.|262B|$30.31|31%|\n|FDX - Fedex Corp|68.8B|$259.62|32%|\n|GS - Goldman Sachs Group, Inc.|90.7B|$263.71|32%|\n|ATVI - Activision Blizzard Inc|71.8B|$92.84|32%|\n|GOOGL - Alphabet Inc - Class A|1.18T|$1752.52|32%|\n|GOOG - Alphabet Inc - Class C|1.18T|$1753.86|32%|\n|WMB - Williams Cos Inc|24.3B|$20.05|32%|\n|UPS - United Parcel Service, Inc. - Class B|146B|$168.40|32%|\n|DIS - Walt Disney Co (The)|328B|$181.18|32%|\n|EA - Electronic Arts, Inc.|41.6B|$143.73|33%|\n|DD - DuPont de Nemours Inc|52.2B|$71.11|33%|\n|MS - Morgan Stanley|124B|$68.53|34%|\n|BKNG - Booking Holdings Inc|91.2B|$2224.35|34%|\n|GILD - Gilead Sciences, Inc.|73B|$58.27|34%|\n|NVDA - NVIDIA Corp|323B|$522.43|36%|\n|AMAT - Applied Materials Inc.|78.9B|$86.37|36%|\n|LULU - Lululemon Athletica inc.|43.5B|$348.13|36%|\n|AMZN - Amazon.com Inc.|1.63T|$3258.85|36%|\n|CMG - Chipotle Mexican Grill|38.8B|$1386.71|37%|\n|WDAY - Workday Inc - Class A|43.1B|$239.89|37%|\n|C - Citigroup Inc|128B|$61.66|37%|\n|GOLD - Barrick Gold Corp.|40.5B|$22.78|37%|\n|SPLK - Splunk Inc|27.5B|$169.99|37%|\n|EBAY - EBay Inc.|34.6B|$50.24|38%|\n|FOXA - Fox Corporation - Class A|17.3B|$29.12|38%|\n|TSM - Taiwan Semiconductor Manufacturing - ADR|565B|$109.04|38%|\n|AAPL - Apple Inc|2.26T|$132.65|38%|\n|BABA - Alibaba Group Holding Ltd - ADR|630B|$232.73|39%|\n|DB - Deutsche Bank AG|22.5B|$10.90|39%|\n|GM - General Motors Company|59.6B|$41.64|39%|\n|NOW - ServiceNow Inc|107B|$550.43|39%|\n|TTWO - Take-Two Interactive Software, Inc.|23.9B|$207.84|39%|\n|XOM - Exxon Mobil Corp.|174B|$41.22|40%|\n|F - Ford Motor Co.|34.3B|$8.79|40%|\n|QCOM - Qualcomm, Inc.|172B|$152.50|40%|\n|LOGI - Logitech International S.A.|16.8B|$97.21|40%|\n|LUV - Southwest Airlines Co|27.5B|$46.61|40%|\n|ARKF - ARK ETF Trust - ARK Fintech Innovation ETF|1.94B|$49.71|40%|\n|FB - Facebook Inc - Class A|780B|$273.59|40%|\n|ULTA - Ulta Beauty Inc|16.2B|$287.25|40%|\n|INTC - Intel Corp.|204B|$49.84|41%|\n|ARKW - ARK Investment Management LLC - ARK Next Generation Internet ETF|5.3B|$146.36|41%|\n|LVS - Las Vegas Sands Corp|45.5B|$59.60|41%|\n|WFC - Wells Fargo &amp; Co.|125B|$30.18|41%|\n|PZZA - Papa John\\`s International, Inc.|2.8B|$84.90|41%|\n|PYPL - PayPal Holdings Inc|274B|$234.58|41%|\n|MELI - MercadoLibre Inc|83.5B|$1673.23|41%|\n|WBA - Walgreens Boots Alliance Inc|34.5B|$39.88|41%|\n|ALLY - Ally Financial Inc|13.3B|$35.66|42%|\n|FIT - Fitbit Inc - Class A|1.67B|$6.80|42%|\n|TWTR - Twitter Inc|43.1B|$54.15|43%|\n|BP - BP plc - ADR|69.3B|$20.52|44%|\n|NFLX - NetFlix Inc|239B|$541.00|44%|\n|TEVA - Teva- Pharmaceutical Industries Ltd. - ADR|10.5B|$9.65|45%|\n|OKTA - Okta Inc - Class A|30.8B|$254.33|45%|\n|JD - JD.com Inc - ADR|137B|$87.96|45%|\n|RH - RH - Class A|9.13B|$447.52|45%|\n|PCG - PG&amp;E Corp.|24.7B|$12.46|45%|\n|EXPE - Expedia Group Inc|18B|$132.40|46%|\n|VALE - Vale S.A. - ADR|88.6B|$16.76|46%|\n|PBR - Petroleo Brasileiro S.A. Petrobras - ADR|23.5B|$11.23|46%|\n|UBER - Uber Technologies Inc|90B|$51.00|46%|\n|BA - Boeing Co.|121B|$214.06|47%|\n|ESTC - Elastic N.V|12.8B|$146.13|47%|\n|DBX - Dropbox Inc - Class A|7.01B|$22.18|48%|\n|SMAR - Smartsheet Inc - Class A|8.47B|$69.29|48%|\n|DOCU - DocuSign Inc|41.5B|$222.41|48%|\n|NOK - Nokia Corp - ADR|2.57B|$3.91|48%|\n|UAA - Under Armour Inc - Class A|7.22B|$17.17|48%|\n|TEAM - Atlassian Corporation Plc - Class A|30.9B|$234.14|49%|\n|SHAK - Shake Shack Inc - Class A|3.25B|$84.78|49%|\n|GE - General Electric Co.|94.6B|$10.80|49%|\n|MU - Micron Technology Inc.|84B|$75.19|49%|\n|YETI - YETI Holdings Inc|5.96B|$68.47|49%|\n|SHOP - Shopify Inc - Class A|136B|$1131.95|49%|\n|DAL - Delta Air Lines, Inc.|25.6B|$40.21|49%|",
        "subreddit": "options",
        "title": "Weekend IV Report - Tickers with low IV and cheap premiums",
        "url": "https://www.reddit.com/r/options/comments/kpn2s9/weekend_iv_report_tickers_with_low_iv_and_cheap/",
        "created": 1609718723.0
    },
    {
        "author": "VTX1800Riders",
        "created_utc": 1609567405,
        "id": "kos5bw",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "HPQ Silicon ($URAGF)announced that the major automobile manufacturer that demonstrated an interest in the Spherical Nano Silicon powders to be produced by the PUREVAP TM Nano Silicon Reactor (“NSiR ”) has submitted to HPQ NANO a formal Purchase Order for the material\nThis represents HPQ NANO first ever nanopowders order \nManufacturer is well aware that HPQ NANO will only fulfill this first order in December 2020 and, as such, this order is simply a way for them to guarantee to be first in queue for the material\nThe automobile manufacture’s name shall remain anonymous for competitive and confidential reasons.\n\nIf Elon did, it’s going to be a huge catalyst for this penny. Musk said Silicon will be the way for his next gen battery packs",
        "subreddit": "pennystocks",
        "title": "Did TESLA place the first order for HPQ NANO Silicon?",
        "url": "https://www.reddit.com/r/pennystocks/comments/kos5bw/did_tesla_place_the_first_order_for_hpq_nano/",
        "created": 1609596205.0
    },
    {
        "author": "vacuum_potential",
        "created_utc": 1609694904,
        "id": "kpombe",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Two questions about this stock. It trades on TSX, and I'm able to buy it on E\\*TRADE. Does E\\*TRADE regularly allow you to buy Canadian stocks, or is it only an option for some Canadian stocks? I thought I tried finding a previous Canadian stock on E\\*TRADE and it didn't work. \n\nMy second question is whether you think their nano-silicone technology is unique and whether this company has room to grow. Give me anything you got.",
        "subreddit": "pennystocks",
        "title": "URAGF HPQ Silicon Resources",
        "url": "https://www.reddit.com/r/pennystocks/comments/kpombe/uragf_hpq_silicon_resources/",
        "created": 1609723704.0
    },
    {
        "author": "stoxxxxx",
        "created_utc": 1609698418,
        "id": "kppt2c",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Silicon Battery company with a PUREVAP product that was completed in Dec 2020: [https://www.globenewswire.com/news-release/2020/11/05/2121653/0/en/CORRECTION-HPQ-NANO-on-Track-to-Start-of-Gen1-Reactor-in-December.html](https://www.globenewswire.com/news-release/2020/11/05/2121653/0/en/CORRECTION-HPQ-NANO-on-Track-to-Start-of-Gen1-Reactor-in-December.html)\n\n&amp;#x200B;\n\nBack in October they announced their first order from a \"Major Automobile Manufacturer\": [https://finance.yahoo.com/news/hpq-nano-receives-first-order-190300952.html](https://finance.yahoo.com/news/hpq-nano-receives-first-order-190300952.html)\n\n&amp;#x200B;\n\nOn December 29th, they also filed a patent for a by-product created by their PUREVAP process as material for lithium ion batteries: [https://hpqsilicon.com/press-release/hpq-files-provisional-patent-application-for-silicon-by-product-created-by-purevap-qrr/](https://hpqsilicon.com/press-release/hpq-files-provisional-patent-application-for-silicon-by-product-created-by-purevap-qrr/)\n\n&amp;#x200B;\n\nThis is their company website: [https://hpqsilicon.com/](https://hpqsilicon.com/)",
        "subreddit": "pennystocks",
        "title": "Anybody Keeping an Eye on HPQ Silicon ($URAGF)?",
        "url": "https://www.reddit.com/r/pennystocks/comments/kppt2c/anybody_keeping_an_eye_on_hpq_silicon_uragf/",
        "created": 1609727218.0
    },
    {
        "author": "Letsearnmoney18",
        "created_utc": 1609524954,
        "id": "kofym1",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Gonna throw another 6k in what’s your plays?? \nCan’t play penny’s except HPQ 🇨🇦 🍁",
        "subreddit": "CanadianInvestor",
        "title": "Monday is tsfa top up of 6k!",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/kofym1/monday_is_tsfa_top_up_of_6k/",
        "created": 1609553754.0
    }
]