[
    {
        "author": "Pijoto",
        "created_utc": 1618976335,
        "id": "mv7gs5",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "Morningstar Analyst, Abhinav Davuluri, raised his Fair Value price of $AMD to $101 recently on April 14th \\[[https://www.morningstar.com/stocks/xnas/amd/quote](https://www.morningstar.com/stocks/xnas/amd/quote)\\], from the $77 that he had set back in Jan 27th, when the stock was at $88, made a run for $94 two weeks later, before plunging down the depth of hades shortly thereafter...  I hate that the guy was right, but he was right...  So, maybe he's right about his new target, as well.  Also, AMD has tons of price targets in the $100+ range, and all the rumors and news points to a gangbusters Q1 earnings ($WDC, $MU, $IBM, and $TSM, all major players in the PC and data center space has had huge revenue beats), it's crazy that the stock is still under $80 just a week before earnings!   \n\n\nPersonally, from my own attempts at TA \\[[https://i.imgur.com/rpDaio0.png](https://i.imgur.com/rpDaio0.png)\\], I believe $AMD is at the bottom of it's current price channel, and the stock is going to start recovering towards Q1 earnings; my hope is that AMD will experience a Parabolic jump like it did on July of last year, the situations are similar, where it spent long periods of trading sideways, while the rest of the tech sector was booming, AMD being flat then didn't make any sense, nor does it now.  Full disclosure, I have a ton of 5/7 Call options riding on a Monster Q1 earnings beat and guidance.",
        "subreddit": "stocks",
        "title": "$AMD Fair Value of $101 per Morningstar recent Analyses, up from $77",
        "url": "https://www.reddit.com/r/stocks/comments/mv7gs5/amd_fair_value_of_101_per_morningstar_recent/",
        "created": 1619005135.0
    },
    {
        "author": "vilnitskiy",
        "created_utc": 1619552156,
        "id": "mzwmst",
        "num_comments": 39,
        "num_crossposts": 0,
        "selftext": "I’ve been collecting data on the number of followers on corporate pages of the companies in Twitter, Facebook, Instagram over the past 3 months. In addition, I also analyzed the website’s traffic and the popularity of the company's website search request in Google to see if followers on social networks are converting into leads and to take a more comprehensive look at this situation.\n\nI don’t have statistical confirmation of the connection between the number of followers of the brand in social networks and a positive effect on the stock price, but according to the simple logic - this definitely can affect it. If people are interested in a product and what the company does, they will follow it in the media and become its customers. Sooner or later, this will be reflected in the company's profits and quarterly reports, so do not underrate this data.\n\nYou can find the resulting list below, hope you’ll find this information useful:  \n\n\n**1. XPENG INC. ($XPEV)** \\- Chinese electric vehicle manufacturer. The most dynamic growth of followers in Twitter and Facebook. \n\n[$XPEV](https://preview.redd.it/axabltzxorv61.png?width=2158&amp;format=png&amp;auto=webp&amp;s=f37b2478f0668aeef974af352c49d70ec88423e0)\n\n**2. WESTERN DIGITAL CORPORATION ($WDC)** \\- computer hard disk drive manufacturer and data storage company\n\n[$WDC](https://preview.redd.it/q5jns142prv61.png?width=2162&amp;format=png&amp;auto=webp&amp;s=d7c73768d2dd1b0278d3d581f9f84482af6fcb5a)\n\nBy the way, they are quite active in hiring new people - 700 open job positions with 24K employees - an indicator of the company's healthy growth.\n\n[$WDC](https://preview.redd.it/4z78jcz8prv61.png?width=2248&amp;format=png&amp;auto=webp&amp;s=4218e7de0e2970ee986eb81e60da0983f345f82d)\n\n**3. SUNRUN INC. ($RUN)** \\- solar panels and home batteries manufacturer. Here you can see the sharp increase in the number of Facebook followers.\n\n[$RUN](https://preview.redd.it/mbfzksleprv61.png?width=2228&amp;format=png&amp;auto=webp&amp;s=b513f3aeb7b7e80247115ec3744300402a9d524b)\n\nFurthermore, the guys are actively expanding their staff, and their traffic has been steadily growing for the last 4 months. Of course, all this in the complex was reflected on their revenue - take a look at the last graph.\n\n[$RUN](https://preview.redd.it/7skr15mlprv61.png?width=2082&amp;format=png&amp;auto=webp&amp;s=659c93e39ebeb3395576d3d565b82ee88ff8d77b)\n\n[$RUN](https://preview.redd.it/qkii1lzoprv61.png?width=2086&amp;format=png&amp;auto=webp&amp;s=475370b54f6137abd101f5f46e9ecb45abd7a430)\n\n&amp;#x200B;\n\n[$RUN Revenue](https://preview.redd.it/m5ayqowqprv61.png?width=2188&amp;format=png&amp;auto=webp&amp;s=4a99ca7c084d5a90bb4ca018bc66addca5beb3cb)\n\nLet me know your thoughts on this",
        "subreddit": "wallstreetbets",
        "title": "I’ve analyzed the growth of the followers for all US public companies in Twitter, FB, Instagram. Check out the top 3 ones with the fastest growth of followers over the past month.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mzwmst/ive_analyzed_the_growth_of_the_followers_for_all/",
        "created": 1619580956.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619812906,
        "id": "n2242u",
        "num_comments": 34,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, April 30, 2021**\n\nThe market fell on Friday after a record-setting session, with the S&amp;P 500 (SPY) pulling back after recording fresh intraday highs. Market participants continue to assess the slew of corporate earnings reports and recent, encouraging economic data. \n\nLast night, President Biden addressed a joint session of Congress, during which he said “America was back on the move again” following the coronavirus pandemic that devastated the economy. In his address, President Biden touted his $2 trillion infrastructure plan and unveiled a new $1.8 trillion proposal aimed at supporting children, students, and families. This proposal, called the American Families Plan, would be funded in part with the newly proposed tax increases on the wealthy. [Read the details of the proposal here](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/28/fact-sheet-the-american-families-plan/).\n\nShares of Amazon (AMZN) outperformed the market, jumping to a new record high after reporting blowout Q1 earnings fueled by sustained demand, showing great strength even as the economy in the US begins to reopen. Shares of Twitter, on the other hand, sunk after the company fell short of estimates, disappointing investors who hoped the company would show a strong pick-up in ad sales like peers Snap (SNAP) and Facebook (FB).\n\nMarket participants also digested recent commentary from members of the Federal Open Market Committee (FOMC), which included no major changes to policy but did highlight recent improvements in the US economy. FOMC members said the effective distribution of the vaccine in the US has improved economic conditions but reiterated interest rates will remain near-zero and the current pace of the asset purchasing program in place. The Fed said, “Amid progress and strong policy support, indicators of economic activity and employment have risen.” The committee remains optimistic about the rebound in economic activity, describing the most affected sectors as “having shown improvement”, but shows no signs of slowing quantitative easing or raising interest rates. With more than 8 million people still out of jobs compared to pre-pandemic levels, FOMC reiterated its commitment to supporting the economy.\n\n**Highlights**\n\n* The Labor Department released its Weekly Unemployment Report, which shows fresh pandemic-era lows as the economy gradually reopens.\n   * **Initial jobless claims, week ended April 24:** 553,000 vs. 540,000 expected and an upwardly revised 566,000 during the prior week\n   * **Continuing claims, week ended April 17:** 3.660 million vs. 3.590 million expected and a downwardly revised 3.651 million during the prior week\n* Shares of Uber, Lyft and Doordash (DASH) fell sharply after Reuters reported that Labor Secretary Marty Walsh supported reclassifying gig workers as employees. This change would give workers additional benefits at a large cost to companies. Recall the battle last year over Proposition 22 in California, which eventually passed in favor of companies in the gig-economy. \n* US gross domestic product (GDP) increased at a 6.4% quarter-over-quarter, seasonally adjusted annualized rate in the first three months of 2021, [the Bureau of Economic Analysis said Thursday in its first estimate on GDP. ](https://finance.yahoo.com/news/us-economy-accelerated-robust-6-123644612.html)This marked an acceleration from the 4.3% annualized growth rate from the fourth quarter of 2020\n* New York City [Mayor Bill de Blasio said ](https://twitter.com/Morning_Joe/status/1387733678093127684)that NYC would open with full capacity beginning July 1. \"Our plan is to fully reopen on July 1. We are ready for stores to open, for businesses to open, offices, theaters, full strength,” de Blasio said. \n* Personal income jumped 21.1% in March over February, the Bureau of Economic Analysis said Friday. This came in better than the 20.3% rise expected, according to Bloomberg consensus data.\n* Shares of Nio outperformed the broader market, trading roughly 2% higher after the company reported better-than-expected earnings.\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Agios Pharma (AGIO) target raised by Barclays from $65 to $70. Stock currently around $56\n* Amedisys (AMED) target raised by Royal Bank of Canada from $335 to $350 at Outperform. Stock currently around $286\n* Amazon (AMZN) with a host of target raises following a blowout earnings report. Consensus price target $4200 at Buy. Stock currently around $3471\n* Brunswick (BC) with four target raises. Stock currently around $106\n   * KeyCorp from $99 to $115\n   * Raymond James from $109 to $122 \n   * Royal Bank of Canada from $99 to $116 \n   * Robert W Baird from $100 to $115 at Outperform \n* Burlington Stores (BURL) target raised by Morgan Stanley from $317 to $385 at Overweight. Stock currently around $321\n* Comcast (CMCSA) with two target raises. Stock currently around $56\n   * Goldman Sachs (GS) from $62 to $64 at Buy\n   * Raymond James from $61 to $63\n* Domino's Pizza (DPZ) with three target raises. Stock currently around $416\n   * Oppenheimer from $405 to $450 \n   * Webdush from $475 to $480 \n   * Royal Bank of Canada from $446 to $466\n* Floor &amp; Decor (FND) target raised by Wedbush from $110 to $130 at Outperform. Stock currently around $114\n* IMAX target raised by Macquarie from $25 to $30 at Outperform. Stock currently around $21\n* Mastercard (MA) with three target raises. Stock currently around $389\n   * Mizuho from $430 to $435 at Buy\n   * Macquarie from $385 to $425 at Outperform\n   * Jefferies from $440 to $450 at Buy\n* McDonald's (MCD) with two target raises. Stock currently around $235 \n   * KeyCorp from $235 to $265 \n   * Wedbush from $255 to $260\n* OneWater Marine (ONEW) target raised by Robert W Baird from $40 to $60 at Outperform. Stock currently around $49\n* OSI Systems (OSIS) target raised by Roth Capital from $108 to $122 at Buy. Stock currently around $97\n* Silicom (SILC) target raised by Needham &amp; Co. from $55 to $57 at Buy. Stock currently around $45\n* Atlassian (TEAM) with four target raises after reporting blowout earnings. Stock currently around $228\n   * Morgan Stanley from $275 to $292 \n   * Canaccord Genuity from $260 to $275\n   * Mizuho from $270 to $285\n   * Macquarie from $263 to $270\n* Texas Roadhouse (TXRH) target raised by Wedbush from $110 to $122 at Outperform. Stock currently around $103\n* Western Digital (WDC) with three target raises. Stock currently around $71\n   * Mizuho from $80 to $88 at Buy\n   * Citigroup from $80 to $90 at Buy\n   * Loop Capital from $65 to $90 at Buy\n* JP Morgan (JPM) target raised by Wells Fargo (WFC) from $190 to $195 at Overweight. Stock currently around $155\n* Following a disappointing earnings report, Twitter (TWTR) price target was lowered by a host of analysts. Stock currently around $65\n   * Morgan Stanley from $68 to $62\n   * Oppenheimer from $80 to $70\n   * Rosenblatt Securities $65 to $60\n   * Barclays from $52 to $48\n\n“The two most powerful warriors are patience and time.” - Leo Tolstoy",
        "subreddit": "stocks",
        "title": "PsychoMarket Recap - Friday, April 30, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/n2242u/psychomarket_recap_friday_april_30_2021/",
        "created": 1619841706.0
    },
    {
        "author": "pacosteles",
        "created_utc": 1617306304,
        "id": "mi3bt3",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": "In a time when pervasive chip and semiconductor shortages are snarling supply chains across the globe, it is hardly a surprise that chip giant Micron shares surged more than 5% in premarket trading, after the chipmaker gave a bullish sales and earnings forecast, with analysts positive on pricing trends for dynamic random access memory (DRAM), while highlighting improving demand from enterprise customers.\n\nShares in chip stocks peers also climbed in premarket trading, with Applied Materials up 2.6%, Nvidia gaining 1.5%, and Intel +1.2%. Separately, the WSJ reported that Micron and Western Digital are each exploring a potential deal for Japan’s Kioxia.\n\nBelow, courtesy of Bloomberg, is a snapshot of what analysts said about Micron’s stellar results:\n\nRBC Capital Markets (outperform, raises PT to $120 from $110)\n\n    Micron’s results are “solid across the board” and news of potential consolidation of NAND is an added bonus\n    While revenue midpoint guidance was on top of RBC’s expectations for the May quarter, profits are expanding at a faster rate\n    Micron continues to see “robust” demand from hyperscale companies, and enterprise demand looks to be improving\n\nCowen (outperform, raises PT to $105 from $100)\n\n    Says it is “hard to argue this was anything but a watershed quarter,” noting better results, better guidance and immediate accretion from halting XPoint\n    Prudent capacity planning is now paying off, and is evident from improved pricing and margins\n\nEvercore (outperform, PT $135)\n\n    Severe shortages and disciplined capex is driving a “perfect storm”\n    Says the DRAM market is in “severe” shortage, pricing is increasing rapidly, and Micron’s management expects further tightening through 2021\n    Reflecting on current spending levels on DRAM capex, it’s “hard to see issues head,” especially considering lean inventories at Micron’s customers as well as equipment slots that are largely full until 1H22\n\nPiper Sandler (neutral, PT $90)\n\n    Micron saw strength across the board, and it appears demand has outpaced supply in the DRAM market, driving improving pricing trends\n    Notes data center, 5G handsets, automotive demand all remaining strong, with enterprise demand improving\n    Believes strength is likely to persist through much of calendar 2021 before potentially subsiding to more normal trends in calendar 2022",
        "subreddit": "investing",
        "title": "Micron Soars On Chip Shortage \"Perfect Storm\"",
        "url": "https://www.reddit.com/r/investing/comments/mi3bt3/micron_soars_on_chip_shortage_perfect_storm/",
        "created": 1617335104.0
    },
    {
        "author": "gintdm",
        "created_utc": 1619450615,
        "id": "mz05wl",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Hello Traders and Investors! An exciting week ahead of us, here is my weekly newsletter which I share every Monday to help prepare you for the week! Feel free to DM me and happy trades!\n\n**Week of 4/26/21**\n\nThe S&amp;P500 opened Monday 4/26/21 at 4185.03, above the previous close of 4180.05 on Friday 4/23/21.\n\nChip manufacturers have been inundated with demand following 2020’s COVID shutdowns and the, undoubtedly correlated, increase in demand for consumer electronics. Cisco, one of the world’s largest chip manufacturers, is struggling to keep up with demand.\n\nCisco revealed several steps it is taking to alleviate the imbalance in supply and demand including a $4.5 billion acquisition of Acacia Communications and a $20 billion plan to build two new manufacturing plants in Arizona. Cisco CEO Chuck Robbins commented extensively on the situation, and estimates it could “...\\[take\\] another six months…” for the company to resume normal operation. Around 85% of all internet traffic passes through Cisco hardware.\n\nThe effects of the shortage can be seen across industries. Among companies affected by the shortage are car manufacturers. Wayne Griffiths, head of VW’s Spanish brand, spoke on the issue, stating that the company will, “...need to face considerable challenges in the second quarter…” So far the shortage has prevented the company from building over 100,000 vehicles.\n\nThe United States Government has also expressed concern regarding the chip shortage. United States President Joe Biden held a conference with business leaders earlier this month to address the issue. During the conference the President expressed a desire to move more chip manufacturing into American plants, citing 75% of global manufacturing as being based in East Asia.  \nMeanwhile Taiwan-based chip manufacturing giant TSMC has announced a plan worth $100 billion USD to expand their companies manufacturing capacity. The announcement comes in tandem with company founder Morris Chang’s plea to the Taiwanese government for increased support, citing a fear that if the Taiwan-based manufacturer fails to meet demand US or Chinese manufacturers will fill the gap.\n\nThe increase in demand for electronics caused by the pandemic has boded well for Apple, who reports earnings on Wednesday. Analysts are looking for the technology giant to post earnings of $0.98 on revenue of $77 billion after a strong Q2 for sales. The earnings call comes on the heels of Apple’s first product showcase of the year last Wednesday, and the company’s announcement that it will be taking steps to increase its footing in the instant messaging market. Apple stated it plans to increase the amount of features provided by it’s iMessage app, with the objective being to bring it more in line with popular messengers offered by Facebook, WhatsApp, and Snapchat.\n\nMicrosoft will report earnings Tuesday. Analyst estimates place earnings around $1.78 per share over $43 billion in revenue. Microsoft, who also saw an increase in demand for its technology as a result of the pandemic, has greatly benefitted from an increased demand for cloud-services. Microsoft’s cloud-based service hub, Azure, posted 2020 growth of 43%. The company expects to post great earnings despite the current chip-shortage, having generated much of its growth from the pandemic in the software-as-a-service sector.\n\nExecutives from Facebook, Twitter, and Youtube will testify before a U.S. Senate Judiciary hearing committee on Tuesday. The executives have been called to testify on the use of algorithms to dictate what consumers watch and read on the popular platforms. The hearing comes amid concerns that manipulative practices have led to massive distribution of misinformation, with repercussions that reverberate throughout society. The practice of purposefully serving consumers misinformation has been dubbed “algorithmic amplification,” and the results of the hearings could have a significant impact on the social media industry. All three companies will report earnings this week.\n\nOPEC will hold its opening session Wednesday. The conference will take place over the course of the day, and will include remarks from prominent Russian and Saudi chairman. The conference is meant to be informative and expected to feature little remark on policy. However speculation that additional information on a potential NOPEC bill could have an impact on U.S. trading. The conference comes one day before North American oil giants Exxon and Shell report earnings.\n\nFederal Reserve Chairman Jerome Powell will hold a press conference at 2:30PM Wednesday. Powell’s recent statements at press conferences have highlighted an economy which although largely recovered, still faces a degree of risk in the face of the pandemic. Powell stated in an April 11th CBS interview, “The principal risk to our economy right now really is that the disease would spread again more quickly.” Powell’s comments come a day before advanced release of the Q1 U.S. GDP, which Bank of America analysts predict will show a real growth rate of 6.5%.\n\n**Some of the Companies with Earnings this Week**\n\n**Monday, April 26th:**  \nAmong others, Tesla (TSLA) will hold earnings calls today. Tesla looks to top analyst estimates of $0.75 EPS on $10.5 billion in revenue after a successful quarter for delivery numbers in the face of the ongoing chip shortage.\n\n**Tuesday, April 27th:**  \nMicrosoft  \nGoogle  \nStarbucks  \nGeneral Electric  \nVisa  \nAMD  \nCapital One  \nUBS  \nHasbro  \n**Wednesday, April 28th:**  \nApple  \nSony  \nFacebook  \nShopify  \nEbay  \nFord  \nQualcomm  \nBoeing  \nGeneral Dynamics  \nRockwell Automation  \nRaymond James Financial Inc\n\n**Thursday, April 29th:**  \nAmazon  \nSamsung  \nMastercard  \nComcast  \nMcDonald's  \nShell  \nCaterpillar  \nNorthrop Grumman Corp  \nTwitter  \nNewmont Mining Corp  \nDr. Pepper Snapple Group  \nThe Hershey Co  \nWestern Digital  \nLogitech\n\n**Friday, April 30th:**  \nAlibaba  \nExxon  \nChevron  \nCharter Communications",
        "subreddit": "stocks",
        "title": "What's Happening in the Markets: Week of 4/26/2021",
        "url": "https://www.reddit.com/r/stocks/comments/mz05wl/whats_happening_in_the_markets_week_of_4262021/",
        "created": 1619479415.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1617309148,
        "id": "mi4cgu",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, April 1, 2021**\n\nStocks rose today, extending gains in another record-setting session. The S&amp;P 500 (SPY) closed above $400 for the first time ever, starting the new quarter with a bang after President Biden announced a new $2 trillion infrastructure proposal.\n\nToday marks the first session of Quarter 2, hopefully putting to rest the volatility that dominated the market last quarter. Historically, the month of April has been good for equity markets, with the SPY gaining an average of 1.51% since 1980.\n\nHeading into Q2, we expect cyclical, energy, financial, and reopening stocks, whose performance is strongly tethered to the health of the broader economy, to continue driving the market higher. The last quarter saw the rotation out of tech and growth stocks as the US economy continues to gradually reopen due to the increased pace in vaccinations. Kristina Hooper, chief global market strategist at Invesco agrees, saying “ I think we’re going to see more of the same in terms of market leadership. This is an environment in which the economy is likely to accelerate. And I think that means that we’ll see continued outperformance of areas like energy, like financials, like consumer discretionary, material, industrials — those areas of the stock market that are most sensitive to the economy.”\n\nOn Wednesday, President Biden introduced a new proposal called American Jobs Plan. The proposal includes roughly $2 trillion to help rehabilitate and build out the country's infrastructure, address the crisis around climate change and curb economic inequality. The plan includes spending to repair aging roads and bridges, jump-start transit projects, and rebuild school buildings and hospitals. It would also expand electric vehicles, replace all lead pipes and overhaul the nation’s water systems. To pay for the proposal, Biden will propose raising the corporate tax rate to 28% from 21% for 15 years and implementing other policies to disincentivize offshoring. View a complete breakdown of the bill [here](https://finance.yahoo.com/news/biden-infrastructure-plan-details-113700242.html).\n\nLooking ahead, the March jobs report is set to be released Friday. The report is estimated[ to show the economy created a whopping 630,00 jobs](https://finance.yahoo.com/news/march-jobs-report-consumer-confidence-what-to-know-in-the-week-ahead-160859015.html) in March — the most since October 2019 before the coronavirus pandemic. As a reminder, US exchanges will be closed tomorrow in observance of Good Friday.\n\n**Highlights** \n\n* The Department of Labor released the weekly unemployment report\n   * **Initial jobless claims:** 719,000 vs. 675,000 expected and a revised 658,000 during the prior week\n   * **Continuing claims:** 3.794 million vs. 3.750 million expected and 3.870 million during the prior week\n* [The Institute for Supply Management's March purchasing managers' index ](https://www.ismworld.org/supply-management-news-and-reports/reports/ism-report-on-business/pmi/march/)rose to 64.7 for the highest print in nearly four decades. This came in well above consensus estimates for a rise to 61.5 in March from February's 60.8. Readings above the neutral level of 50 indicate expansion in a sector.\n* A lot of clean energy stocks, that have been beaten down recently, rallied on the back of Biden’s proposal.\n* United Airlines is planning to restart the pilot hiring process it halted last year as the airline gears up to meet rising travel demand, the company told pilots in a memo viewed by The Wall Street Journal. \n* NIO stock gapped up 8% in the morning before falling due to better-than-expected delivery numbers. NIO delivered 7,257 vehicles in March 2021, increasing by 373% year-over-year and 20,060 vehicles in Q1, increasing by 423% year-over-year\n* Elon Musk has been nominated to join the board at Endeavor as the company looks to IPO. Company works in the entertainment industry and recently bought the UFC.\n* **\\*\\*Please note that current stock price was written in the morning and does not reflect intraday movement**\n* Alliance Data Systems (ADS) target raised by Morgan Stanley from $105 to $150. Stock currently around $112\n* American Express (AXP) target raised by Morgan Stanley from $165 to $166 at Overweight. Stock currently around $141\n* Capital One (COF) target raised by Morgan Stanley from $144 to $150 at Overweight. Stock currently around $127\n* DOMO target raised by Morgan Stanley from $76 to $83 at Overweight. Stock currently around $56\n* Darden Restaurants (DRI) with three target raises. Stock currently around $142\n   * UBS Group from $160 to $165 \n   * Credit Suisse from $140 to $160\n   * KeyCorp from $130 to $165\n* HESS target raised by Piper Sandler from $69 to $86 at Overweight. Stock currently around $70\n* Morgan Stanley (MS) target raised by UBS Group from $84 to $92 at Outperform\n* Micron Technology (MU)with a host of target raises. Consensus price target of $117.50 at Buy. Stock currently around $88\n* Oshkosh (OSK) target raised by KeyCorp from $125 to $133 at Overweight. Stock currently around $119\n* PVH target raised by UBS Group from $132 to $141 at Buy. Stock currently around $106\n* Regeneron Pharma (REGN) target raised by SVB Leerink from $655 to $657 at Outperform. Stock currently around $473\n* Restoration Hardware (RH) target raised by Barclays from $562 to $675 at Overweight. Stock currently around $597\n* Western Digital (WFC) target raised by Benchmark from $66 to $75 at Buy. Stock currently around $67\n\n“To bear trials with a calm mind robs misfortune of its strength and burden.” —Seneca",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Thursday, April 1, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mi4cgu/here_is_a_market_recap_for_today_thursday_april_1/",
        "created": 1617337948.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1617309176,
        "id": "mi4cv0",
        "num_comments": 6,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Thursday, April 1, 2021**\n\nStocks rose today, extending gains in another record-setting session. The S&amp;P 500 (SPY) closed above $400 for the first time ever, starting the new quarter with a bang after President Biden announced a new $2 trillion infrastructure proposal.\n\nToday marks the first session of Quarter 2, hopefully putting to rest the volatility that dominated the market last quarter. Historically, the month of April has been good for equity markets, with the SPY gaining an average of 1.51% since 1980.\n\nHeading into Q2, we expect cyclical, energy, financial, and reopening stocks, whose performance is strongly tethered to the health of the broader economy, to continue driving the market higher. The last quarter saw the rotation out of tech and growth stocks as the US economy continues to gradually reopen due to the increased pace in vaccinations. Kristina Hooper, chief global market strategist at Invesco agrees, saying “ I think we’re going to see more of the same in terms of market leadership. This is an environment in which the economy is likely to accelerate. And I think that means that we’ll see continued outperformance of areas like energy, like financials, like consumer discretionary, material, industrials — those areas of the stock market that are most sensitive to the economy.”\n\nOn Wednesday, President Biden introduced a new proposal called American Jobs Plan. The proposal includes roughly $2 trillion to help rehabilitate and build out the country's infrastructure, address the crisis around climate change and curb economic inequality. The plan includes spending to repair aging roads and bridges, jump-start transit projects, and rebuild school buildings and hospitals. It would also expand electric vehicles, replace all lead pipes and overhaul the nation’s water systems. To pay for the proposal, Biden will propose raising the corporate tax rate to 28% from 21% for 15 years and implementing other policies to disincentivize offshoring. View a complete breakdown of the bill [here](https://finance.yahoo.com/news/biden-infrastructure-plan-details-113700242.html).\n\nLooking ahead, the March jobs report is set to be released Friday. The report is estimated[ to show the economy created a whopping 630,00 jobs](https://finance.yahoo.com/news/march-jobs-report-consumer-confidence-what-to-know-in-the-week-ahead-160859015.html) in March — the most since October 2019 before the coronavirus pandemic. As a reminder, US exchanges will be closed tomorrow in observance of Good Friday.\n\n**Highlights** \n\n* The Department of Labor released the weekly unemployment report\n   * **Initial jobless claims:** 719,000 vs. 675,000 expected and a revised 658,000 during the prior week\n   * **Continuing claims:** 3.794 million vs. 3.750 million expected and 3.870 million during the prior week\n* [The Institute for Supply Management's March purchasing managers' index ](https://www.ismworld.org/supply-management-news-and-reports/reports/ism-report-on-business/pmi/march/)rose to 64.7 for the highest print in nearly four decades. This came in well above consensus estimates for a rise to 61.5 in March from February's 60.8. Readings above the neutral level of 50 indicate expansion in a sector.\n* A lot of clean energy stocks, that have been beaten down recently, rallied on the back of Biden’s proposal.\n* United Airlines is planning to restart the pilot hiring process it halted last year as the airline gears up to meet rising travel demand, the company told pilots in a memo viewed by The Wall Street Journal. \n* NIO stock gapped up 8% in the morning before falling due to better-than-expected delivery numbers. NIO delivered 7,257 vehicles in March 2021, increasing by 373% year-over-year and 20,060 vehicles in Q1, increasing by 423% year-over-year\n* Elon Musk has been nominated to join the board at Endeavor as the company looks to IPO. Company works in the entertainment industry and recently bought the UFC.\n* **\\*\\*Please note that current stock price was written in the morning and does not reflect intraday movement**\n* Alliance Data Systems (ADS) target raised by Morgan Stanley from $105 to $150. Stock currently around $112\n* American Express (AXP) target raised by Morgan Stanley from $165 to $166 at Overweight. Stock currently around $141\n* Capital One (COF) target raised by Morgan Stanley from $144 to $150 at Overweight. Stock currently around $127\n* DOMO target raised by Morgan Stanley from $76 to $83 at Overweight. Stock currently around $56\n* Darden Restaurants (DRI) with three target raises. Stock currently around $142\n   * UBS Group from $160 to $165 \n   * Credit Suisse from $140 to $160\n   * KeyCorp from $130 to $165\n* HESS target raised by Piper Sandler from $69 to $86 at Overweight. Stock currently around $70\n* Morgan Stanley (MS) target raised by UBS Group from $84 to $92 at Outperform\n* Micron Technology (MU)with a host of target raises. Consensus price target of $117.50 at Buy. Stock currently around $88\n* Oshkosh (OSK) target raised by KeyCorp from $125 to $133 at Overweight. Stock currently around $119\n* PVH target raised by UBS Group from $132 to $141 at Buy. Stock currently around $106\n* Regeneron Pharma (REGN) target raised by SVB Leerink from $655 to $657 at Outperform. Stock currently around $473\n* Riot Blockchain (RIOT) target raised by HC Wainwright from $28 to $64 at Buy. Stock currently around $54\n* Restoration Hardware (RH) target raised by Barclays from $562 to $675 at Overweight. Stock currently around $597\n* Western Digital (WFC) target raised by Benchmark from $66 to $75 at Buy. Stock currently around $67\n\n“To bear trials with a calm mind robs misfortune of its strength and burden.” —Seneca",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Thursday, April 1, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mi4cv0/here_is_a_market_recap_for_today_thursday_april_1/",
        "created": 1617337976.0
    },
    {
        "author": "spacej3di",
        "created_utc": 1617308509,
        "id": "mi44fb",
        "num_comments": 5,
        "num_crossposts": 0,
        "selftext": "**Dow +0.52%, S&amp;P 500 +1.18%, Nasdaq +1.76%, Russell 2000 +1.50%**  \n\n\n* **Synopsis**\n   * US equities were higher in Thursday trading, finishing near best levels. Major indices all posted gains in the holiday-shortened week as S&amp;P 500 and Dow finished at record closes. Energy led the market on stronger crude. Tech, communication services beat the tape (FANMAG complex broadly higher). Consumer staples, healthcare, utilities the only sectors lower. Treasuries mostly firmer with some notable strength at the long end of the curve. Dollar weaker on the major crosses. Gold finished up 0.7%. WTI crude settled up 3.9% despite OPEC and its allies agreeing increase output by \\~2M bpd through July.\n   * **Infrastructure continued to dominate the headlines with a lot of moving pieces** after White House detailed plans to spend $2.25T+ over next eight years. Fiscal stimulus still a key piece of the bullish narrative for stocks though plans for another big spending also fit with pickup in concerns about inflation/economic overheating. Higher taxes another potential headwind for risk sentiment. Also some focus on how difficult it will be to get infrastructure stimulus passed given the lack of Republican support, competing preferences among Democrats and their razor-thin majorities in both the House and Senate.\n   * Busy on the data front ahead of nonfarm payrolls tomorrow. **ISM manufacturing gauge surged in March** with new orders strong, though growing backlogs and supplier delivery times reinforcing broader themes of supply chain pressures and rising input costs. Press has been picking up this theme, noting some consumer-products firms raising prices. Elsewhere, weekly **US initial jobless claims missed**, seeing a larger-than-expected uptick. On the global front, **US-China tensions** another area of focus with more concerns about Chinese incursions into Taiwan.\n   * **TSM** to spend $100B on capex over next three years. **MU** beat and guided above with focus on favorable DRAM dynamics. Company and **WDC** both exploring an acquisition of Japan's Kioxia for approx. $30B. **KMX** comp sales weaker than expected, though March sales commentary upbeat. **F** announced more shutdowns due to semi shortages. **QS** up big after meeting technical milestone for additional $100M investment from Volkswagen. **CCK** in talks to sell its cans unit for more than $2B. **ANGI** acquired additional 20% interest in its MyBuilder business. **WING** comps better. **EBS** lab errors resulted in 15M ruined **JNJ** vaccine doses (but not expected to impact US supply targets). **PLAY** beat and guidance ahead on better reopening pace but stock already a big ytd gainer. **GES** EPS well ahead of consensus and guidance better with digital a bright spot.\n* **Digest**\n   * **Most sectors higher with growth ahead of value:**\n      * Growth generally led cyclical/value on first day of Q2. **Energy** the standout, following WTI higher with E&amp;Ps particularly strong. **Tech** a big gainer with help from semis and software (MSFT also had a good day). Internets and entertainment the leaders in **communication services**. **Financials** ahead on upside across credit cards and insurance, while banks mostly brushed off Treasury yields move lower down today. **Consumer discretionary** trailed with some weakness among retailers offsetting support from AMZN and homebuilders. **Materials** saw some drag from industrial metals, with steel the weak spot. **Industrials** a bit of an underperformer with select machinery and multis down. **Healthcare** mixed with some weakness in managed care, distributors, and large-cap pharma (JNJ). **Consumer staples** worst performer with HPCs, tobacco, and grocers some of the weights.\n   * **ISM Manufacturing highest in over 37 years, initial jobless claims and continuing claims miss:**\n      * **March ISM Manufacturing** PMI up 3.9 points m/m to 64.7, ahead of 61.5 estimate, for highest print since Dec-1983. New Orders, production indexes highest since Jan-04, employment index highest since Feb-18. Supplier deliveries continued to slow, up to highest reading since Apr-1974. Prices also elevated, holding near highest since Jul-08. **Initial jobless claims** of 719K were up 61K w/w, and missed consensus estimates for 690K. However, prior week revised down 26K to 658K from 684K, which was lowest since the pandemic surge in claims began in Mar-20. **Continuing claims** fell to 3.794M from 3.870M, though also missed estimates for 3.775M. While this week's claims will not flow through to tomorrow's March jobs report (2-Apr, 8:30 ET), labor market data in focus given reopening and vaccine-driven economic momentum. **March nonfarm payrolls** expected to increase by 285K m/m to 614K, which would be the highest since Oct-20.\n   * **OPEC+ agrees to gradual output increases of 1M bpd over the coming months:**\n      * [Bloomberg](https://www.bloomberg.com/news/articles/2021-04-01/opec-agrees-to-gradually-increase-oil-output-in-coming-months?srnd=premium&amp;sref=J9GPLx1B) reported that OPEC and its allies agreed to gradually boost oil output from May to July. The group will add more than 1M bpd over the coming months, incluidng a 350K bpd increase from Saudi Arabia and Russia in May, and an additional 450K bpd in July. Saudi Arabia may also roll back some of its voluntary 1M bpd cuts. While market had expected group to roll over existing limits, article cited analysts who say product demand is expected rise by 3M bpd over the next three months, so increase isn't bearish. Comes against a lot of recent talk of caution from the group, with OPEC Secretary General Barkindo yesterday saying the oil market faces many uncertainties, particularly regarding a Covid upsurge in Europe and elsewhere ([Bloomberg](https://www.bloomberg.com/news/articles/2021-03-31/opec-focuses-on-fragile-demand-before-talks-on-keeping-oil-cuts?sref=J9GPLx1B)), while OPEC+ technical committee this week cut 2021 global demand forecast by 300K bpd.\n   * **Afternoon headlines:**\n      * **Markets:**\n      * **Coronavirus:**\n      * **Corporate:**\n   * **Notable Gainers:**\n      * \\+15% **UTHR** (United Therapeutics): Announced FDA has approved Tyvaso for pulmonary hypertension associated with interstitial lung disease; noted this is the second FDA-approved indication for Tyvaso.\n      * \\+10.2% **QS** (QuantumScape): Announced it had successfully tested its latest solid-state lithium metal cells in a German lab, meeting a technical milestone unlocks an investment of an additional $100M by Volkswagen of America (VOW3.GR).\n      * \\+6.9% **WDC** (Western Digital): Cited in a [WSJ](https://www.wsj.com/articles/micron-western-digital-looking-at-possible-deal-for-chip-maker-kioxia-11617229660?mod=hp_lead_pos3) article as exploring a deal for Japan's Kioxia which specializes in NAND chips where the industry has been consolidating; firms currently have a joint R&amp;D venture through 2027; a deal would likely be valued near $30B though MU also mentioned as a suitor; Toshiba (6502.JP) spun off the company in 2018 but still owns 40% and stated it is considering further investment; [Bloomberg](https://www.bloomberg.com/news/articles/2021-04-01/japan-s-kioxia-is-said-to-focus-on-ipo-in-next-few-months) reported Kioxia is more interested in an IPO.\n      * \\+6.8% **WING** (Wingstop): Preliminary Q1 sales figures better than expected with analysts positive on comp momentum and unit sales growth; takes optimistic given digital strength and solid unit economics though some concerns about tough comps ahead.\n      * \\+4.8% **MU** (Micron Technology): FQ2 earnings and revenue beat with guidance well ahead; analysts noted a tight DRAM market and expense cuts brought gross margin gains; company is among potential suitors (WDC, 6502.JP) for Japan's Kioxia with value expected to be around $30B; semiconductor company specializes in NAND for smartphones and computer servers.\n      * \\+4.7% **VSAT** (ViaSat): Upgraded to strong buy from outperform at Raymond James; expects significant growth potential from launch of ViaSat-3 constellation; positive on recovery in In-Flight Connectivity and said competitive concerns overblown.\n      * \\+4.5% **GES** (Guess?): Q4 revenue missed, but EPS beat; Americas comp decline better than feared; GM; management said it plans to achieve by FY 25 10% OMs and net revenues of $2.9B, a 2% CAGR from FY20; analysts positive on Q1 guidance of revenues down HSD vs Q1-20, highlighting ecomm tailwinds offsetting some brick-and-mortar weakness.\n      * \\+2.2% **GRA** (W.R. Grace): 40 North increased its offer to acquire WR Grace to $70 per share, or $4.6B, a \\~17% premium to Wednesday's close; increases previously disclosed $65 a share offer; due diligence on latest offer could take two weeks.\n      * \\+1.7% **NIO** (NIO Inc): Reported better than expected March deliveries of 7,257 vehicles which was up 373% y/y; analysts noted less impact from chip shortages than expected.\n      * \\+1.5% **FUBO** (fuboTV): Announced agreement with Marquee Sports Network to bring Chicago Cubs game coverage in the coming weeks; subscribers in the extended Chicago area will have access to all other Marquee programming as well.\n   * **Notable Decliners:**\n      * \\-13.4% **EBS** (Emergent BioSolutions): NY Times reported \\~15M doses of JNJ's Covid vaccine were ruined by human error at an EBS plant; has delayed shipments and FDA investigation underway; JNJ said batch was from a site not yet authorized to manufacture Covid vaccine components.\n      * \\-12.1% **XL** (XL Fleet): Q4 earnings a bit better but EPS light; positive on growing demand for electrification services but said Q1 revenue likely to be flat q/q amid OEM delays from semiconductor and other shortages.\n      * \\-7.1% **KMX** (CarMax): Q4 earnings better on financing contribution; revenue in line; comparable used unit sales below consensus and wholesale results weaker (some offset from ASPs); management noted robust March growth supported by tax refunds and stimulus.\n      * \\-5.4% **PLAY** (Dave &amp; Buster's Entertainment): Q4 EPS, revenue, EBITDA beat; OI, EBITDA margin also ahead; comp decline better than feared; guided Q1 revenue ahead of Street; some note shares already priced in reopening momentum (+60% YTD into print), though analysts still looking for more visibility around strategic and operational initiatives.\n   * **S&amp;P 500 Sector Performance**\n      * **Outperformers:** Energy +2.65%, Tech +2.10%, Communication Svcs. +2.06%, REITs +1.59%, Financials +1.28%\n      * **Underperformers:** Consumer Spls. (0.24%), Healthcare (0.22%), Utilities (0.02%), Industrials +0.40%, Materials +0.93%, Consumer Disc. +0.99%\n* **Data**\n   * DXY: 92.91, (0.34)\n   * €-$ +0.0046 or +0.39% to 1.1778\n   * £-$ +0.0052 or +0.38% to 1.3835\n   * $-¥ (0.12) or (0.11%) to 110.60\n   * €-¥ +0.39 or +0.30% to 130.23\n   * 2-year yield (0) bps to 0.16%\n   * 10-year yield (5) bps to 1.69%\n   * 30-year yield (8) bps to 2.34%\n   * WTI Crude (May 21): +$2.06 or +3.48% to $61.22\n   * Gold (Jun 21): +$15.20 or +0.89% to $1730.8\n   * Index Performance\n      * Month-to-date: Dow +0.52%, S&amp;P +1.18%, Nasdaq +1.76% Russell +1.50%\n      * Quarter-to-date: Dow +0.52%, S&amp;P +1.18%, Nasdaq +1.76% Russell +1.50%\n      * Year-to-date: Dow +8.32%, S&amp;P +7.02%, Nasdaq +4.59% Russell +14.13%",
        "subreddit": "stocks",
        "title": "U.S. Market Recap - Thursday, April 1, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/mi44fb/us_market_recap_thursday_april_1_2021/",
        "created": 1617337309.0
    },
    {
        "author": "mryagerr",
        "created_utc": 1619214958,
        "id": "mx63fb",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": " \n\nFirst one of these I am writing - so be gentle\n\nThis is a post about stocks, but it starts with coins created by computers - I got my articles below.\n\n1. Popular \"coins created by computers\" are perceived as having a demand for high energy, and well inherently doesn't do anything besides act as a currency.\n2. Popular \"coins created by computers\" caused a surge in demand for CPU.\n3. Newly designed \"coins created by computers\" use HDD and will do something? so could replace Popular \"coins created by computers\" or at least cause demand like Popular \"coins created by computers\" for CPU.\n4. Hard drives are hard to make.\n5. Hard drive companies are undervalued. Barron's showed that WDC has a price target of 125 while currently at $60.\n\nSo, HDD companies will see a boom like AMD/MU.\n\nWhy am I wrong? Why shouldn't I buy a shit ton of 100$ calls for $10.\n\nLong HDD companies.\n\nThis is not financial advice, see my post where I talk about losing the 150k earnings I had from COVID like a fucking tool for thinking 2 trillion dollars wouldn't jumpstart the economy.\n\nArticles and Stuff\n\n[https://www.barrons.com/articles/western-digital-profit-to-surge-on-higher-flash-memory-prices-analyst-says-51618848790](https://www.barrons.com/articles/western-digital-profit-to-surge-on-higher-flash-memory-prices-analyst-says-51618848790)",
        "subreddit": "wallstreetbets",
        "title": "HDD Demand Soon to come",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mx63fb/hdd_demand_soon_to_come/",
        "created": 1619243758.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1619812942,
        "id": "n224jr",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "**PsychoMarket Recap - Friday, April 30, 2021**\n\nThe market fell on Friday after a record-setting session, with the S&amp;P 500 (SPY) pulling back after recording fresh intraday highs. Market participants continue to assess the slew of corporate earnings reports and recent, encouraging economic data. \n\nLast night, President Biden addressed a joint session of Congress, during which he said “America was back on the move again” following the coronavirus pandemic that devastated the economy. In his address, President Biden touted his $2 trillion infrastructure plan and unveiled a new $1.8 trillion proposal aimed at supporting children, students, and families. This proposal, called the American Families Plan, would be funded in part with the newly proposed tax increases on the wealthy. [Read the details of the proposal here](https://www.whitehouse.gov/briefing-room/statements-releases/2021/04/28/fact-sheet-the-american-families-plan/).\n\nShares of Amazon (AMZN) outperformed the market, jumping to a new record high after reporting blowout Q1 earnings fueled by sustained demand, showing great strength even as the economy in the US begins to reopen. Shares of Twitter, on the other hand, sunk after the company fell short of estimates, disappointing investors who hoped the company would show a strong pick-up in ad sales like peers Snap (SNAP) and Facebook (FB).\n\nMarket participants also digested recent commentary from members of the Federal Open Market Committee (FOMC), which included no major changes to policy but did highlight recent improvements in the US economy. FOMC members said the effective distribution of the vaccine in the US has improved economic conditions but reiterated interest rates will remain near-zero and the current pace of the asset purchasing program in place. The Fed said, “Amid progress and strong policy support, indicators of economic activity and employment have risen.” The committee remains optimistic about the rebound in economic activity, describing the most affected sectors as “having shown improvement”, but shows no signs of slowing quantitative easing or raising interest rates. With more than 8 million people still out of jobs compared to pre-pandemic levels, FOMC reiterated its commitment to supporting the economy.\n\n**Highlights**\n\n* The Labor Department released its Weekly Unemployment Report, which shows fresh pandemic-era lows as the economy gradually reopens.\n   * **Initial jobless claims, week ended April 24:** 553,000 vs. 540,000 expected and an upwardly revised 566,000 during the prior week\n   * **Continuing claims, week ended April 17:** 3.660 million vs. 3.590 million expected and a downwardly revised 3.651 million during the prior week\n* Shares of Uber, Lyft and Doordash (DASH) fell sharply after Reuters reported that Labor Secretary Marty Walsh supported reclassifying gig workers as employees. This change would give workers additional benefits at a large cost to companies. Recall the battle last year over Proposition 22 in California, which eventually passed in favor of companies in the gig-economy. \n* US gross domestic product (GDP) increased at a 6.4% quarter-over-quarter, seasonally adjusted annualized rate in the first three months of 2021, [the Bureau of Economic Analysis said Thursday in its first estimate on GDP. ](https://finance.yahoo.com/news/us-economy-accelerated-robust-6-123644612.html)This marked an acceleration from the 4.3% annualized growth rate from the fourth quarter of 2020\n* New York City [Mayor Bill de Blasio said ](https://twitter.com/Morning_Joe/status/1387733678093127684)that NYC would open with full capacity beginning July 1. \"Our plan is to fully reopen on July 1. We are ready for stores to open, for businesses to open, offices, theaters, full strength,” de Blasio said. \n* Personal income jumped 21.1% in March over February, the Bureau of Economic Analysis said Friday. This came in better than the 20.3% rise expected, according to Bloomberg consensus data.\n* Shares of Nio outperformed the broader market, trading roughly 2% higher after the company reported better-than-expected earnings.\n* **\\*\\*Please note that current stock price was written premarket and does not reflect intraday changes\\*\\***\n* Agios Pharma (AGIO) target raised by Barclays from $65 to $70. Stock currently around $56\n* Amedisys (AMED) target raised by Royal Bank of Canada from $335 to $350 at Outperform. Stock currently around $286\n* Amazon (AMZN) with a host of target raises following a blowout earnings report. Consensus price target $4200 at Buy. Stock currently around $3471\n* Brunswick (BC) with four target raises. Stock currently around $106\n   * KeyCorp from $99 to $115\n   * Raymond James from $109 to $122 \n   * Royal Bank of Canada from $99 to $116 \n   * Robert W Baird from $100 to $115 at Outperform \n* Burlington Stores (BURL) target raised by Morgan Stanley from $317 to $385 at Overweight. Stock currently around $321\n* Comcast (CMCSA) with two target raises. Stock currently around $56\n   * Goldman Sachs (GS) from $62 to $64 at Buy\n   * Raymond James from $61 to $63\n* Domino's Pizza (DPZ) with three target raises. Stock currently around $416\n   * Oppenheimer from $405 to $450 \n   * Webdush from $475 to $480 \n   * Royal Bank of Canada from $446 to $466\n* Floor &amp; Decor (FND) target raised by Wedbush from $110 to $130 at Outperform. Stock currently around $114\n* IMAX target raised by Macquarie from $25 to $30 at Outperform. Stock currently around $21\n* Mastercard (MA) with three target raises. Stock currently around $389\n   * Mizuho from $430 to $435 at Buy\n   * Macquarie from $385 to $425 at Outperform\n   * Jefferies from $440 to $450 at Buy\n* McDonald's (MCD) with two target raises. Stock currently around $235 \n   * KeyCorp from $235 to $265 \n   * Wedbush from $255 to $260\n* OneWater Marine (ONEW) target raised by Robert W Baird from $40 to $60 at Outperform. Stock currently around $49\n* OSI Systems (OSIS) target raised by Roth Capital from $108 to $122 at Buy. Stock currently around $97\n* Silicom (SILC) target raised by Needham &amp; Co. from $55 to $57 at Buy. Stock currently around $45\n* Atlassian (TEAM) with four target raises after reporting blowout earnings. Stock currently around $228\n   * Morgan Stanley from $275 to $292 \n   * Canaccord Genuity from $260 to $275\n   * Mizuho from $270 to $285\n   * Macquarie from $263 to $270\n* Texas Roadhouse (TXRH) target raised by Wedbush from $110 to $122 at Outperform. Stock currently around $103\n* Western Digital (WDC) with three target raises. Stock currently around $71\n   * Mizuho from $80 to $88 at Buy\n   * Citigroup from $80 to $90 at Buy\n   * Loop Capital from $65 to $90 at Buy\n* JP Morgan (JPM) target raised by Wells Fargo (WFC) from $190 to $195 at Overweight. Stock currently around $155\n* Following a disappointing earnings report, Twitter (TWTR) price target was lowered by a host of analysts. Stock currently around $65\n   * Morgan Stanley from $68 to $62\n   * Oppenheimer from $80 to $70\n   * Rosenblatt Securities $65 to $60\n   * Barclays from $52 to $48\n\n“The two most powerful warriors are patience and time.” - Leo Tolstoy",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Friday, April 30, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/n224jr/here_is_a_market_recap_for_today_friday_april_30/",
        "created": 1619841742.0
    },
    {
        "author": "amsnpsch",
        "created_utc": 1619440509,
        "id": "mywn24",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "WDC",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mywn24/wdc/",
        "created": 1619469309.0
    },
    {
        "author": "ajcaca",
        "created_utc": 1619650654,
        "id": "n0r3q4",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "WDC (Western Digital) DD: insane demand",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n0r3q4/wdc_western_digital_dd_insane_demand/",
        "created": 1619679454.0
    },
    {
        "author": "ajcaca",
        "created_utc": 1619650814,
        "id": "n0r5k1",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "*Tldr: good chance that WDC skyrockets are earnings tomorrow. I am long options and stock and will buy call spreads in the morning.*\n\nOver the past few weeks, demand for ultra fast SSD and very large capacity (16TB+) hard disk drives has skyrocketed and prices have gone up significantly.\n\nWhy? Because a new project called Chia created by Bram Cohen (the guy who invented BitTorrent) has come online and instead of proof of work it uses proof of space (ie hard drives). And it has *really* taken off.\n\nAnyway, I'm not here at all to talk about Chia - that is just context for stock plays. My interest right now is in the HDD manufacturers.\n\nSeagate (STX) announced very strong earnings last week and specifically talked about this project driving up demand and learning to a shortage of supply. The stock is up \\~12% since. Western Digital (WDC) is announcing tomorrow after market close and I think they will head towards the moon.\n\nIt's not hard to validate this hypothesis (at least the demand/supply aspect). Go try to find some 7k IO 2GB and 4GB NVME SSD cards or 16TB hard drives and see how many you can get your hands on. They are *really* hard to find right now in many countries and many stores are putting '1 item per customer' limitations on.\n\nI am a degenerate gambler so of course I am long STX and WDC mid May expiry calls as well as $50k of WDC stock going into earnings tomorrow. I'm planning to put on WDC call spreads in the morning so I have the option upside but not the vol crush after earnings.\n\nThis is my first post on WSB but I think I'm supposed to use some emojis, so here we go. 💎💎💎🚀🚀🚀🌈🌈🌈",
        "subreddit": "wallstreetbets",
        "title": "Western Digital (WDC) insane demand not priced into earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n0r5k1/western_digital_wdc_insane_demand_not_priced_into/",
        "created": 1619679614.0
    },
    {
        "author": "gintdm",
        "created_utc": 1619456361,
        "id": "mz2c4g",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Hello Traders and Investors! An exciting week ahead of us, here is my weekly newsletter which I share every Monday to help prepare you for the week! Feel free to DM me and happy trades!\n\n**Week of 4/26/21**\n\nThe S&amp;P500 opened Monday 4/26/21 at 4185.03, above the previous close of 4180.05 on Friday 4/23/21.\n\nChip manufacturers have been inundated with demand following 2020’s COVID shutdowns and the, undoubtedly correlated, increase in demand for consumer electronics. Cisco, one of the world’s largest chip manufacturers, is struggling to keep up with demand.\n\nCisco revealed several steps it is taking to alleviate the imbalance in supply and demand including a $4.5 billion acquisition of Acacia Communications and a $20 billion plan to build two new manufacturing plants in Arizona. Cisco CEO Chuck Robbins commented extensively on the situation, and estimates it could “...\\[take\\] another six months…” for the company to resume normal operation. Around 85% of all internet traffic passes through Cisco hardware.\n\nThe effects of the shortage can be seen across industries. Among companies affected by the shortage are car manufacturers. Wayne Griffiths, head of VW’s Spanish brand, spoke on the issue, stating that the company will, “...need to face considerable challenges in the second quarter…” So far the shortage has prevented the company from building over 100,000 vehicles.\n\nThe United States Government has also expressed concern regarding the chip shortage. United States President Joe Biden held a conference with business leaders earlier this month to address the issue. During the conference the President expressed a desire to move more chip manufacturing into American plants, citing 75% of global manufacturing as being based in East Asia.  \nMeanwhile Taiwan-based chip manufacturing giant TSMC has announced a plan worth $100 billion USD to expand their companies manufacturing capacity. The announcement comes in tandem with company founder Morris Chang’s plea to the Taiwanese government for increased support, citing a fear that if the Taiwan-based manufacturer fails to meet demand US or Chinese manufacturers will fill the gap.\n\nThe increase in demand for electronics caused by the pandemic has boded well for Apple, who reports earnings on Wednesday. Analysts are looking for the technology giant to post earnings of $0.98 on revenue of $77 billion after a strong Q2 for sales. The earnings call comes on the heels of Apple’s first product showcase of the year last Wednesday, and the company’s announcement that it will be taking steps to increase its footing in the instant messaging market. Apple stated it plans to increase the amount of features provided by it’s iMessage app, with the objective being to bring it more in line with popular messengers offered by Facebook, WhatsApp, and Snapchat.\n\nMicrosoft will report earnings Tuesday. Analyst estimates place earnings around $1.78 per share over $43 billion in revenue. Microsoft, who also saw an increase in demand for its technology as a result of the pandemic, has greatly benefitted from an increased demand for cloud-services. Microsoft’s cloud-based service hub, Azure, posted 2020 growth of 43%. The company expects to post great earnings despite the current chip-shortage, having generated much of its growth from the pandemic in the software-as-a-service sector.\n\nExecutives from Facebook, Twitter, and Youtube will testify before a U.S. Senate Judiciary hearing committee on Tuesday. The executives have been called to testify on the use of algorithms to dictate what consumers watch and read on the popular platforms. The hearing comes amid concerns that manipulative practices have led to massive distribution of misinformation, with repercussions that reverberate throughout society. The practice of purposefully serving consumers misinformation has been dubbed “algorithmic amplification,” and the results of the hearings could have a significant impact on the social media industry. All three companies will report earnings this week.\n\nOPEC will hold its opening session Wednesday. The conference will take place over the course of the day, and will include remarks from prominent Russian and Saudi chairman. The conference is meant to be informative and expected to feature little remark on policy. However speculation that additional information on a potential NOPEC bill could have an impact on U.S. trading. The conference comes one day before North American oil giants Exxon and Shell report earnings.\n\nFederal Reserve Chairman Jerome Powell will hold a press conference at 2:30PM Wednesday. Powell’s recent statements at press conferences have highlighted an economy which although largely recovered, still faces a degree of risk in the face of the pandemic. Powell stated in an April 11th CBS interview, “The principal risk to our economy right now really is that the disease would spread again more quickly.” Powell’s comments come a day before advanced release of the Q1 U.S. GDP, which Bank of America analysts predict will show a real growth rate of 6.5%.\n\n**Some of the Companies with Earnings this Week**\n\n**Monday, April 26th:**  \nAmong others, Tesla (TSLA) will hold earnings calls today. Tesla looks to top analyst estimates of $0.75 EPS on $10.5 billion in revenue after a successful quarter for delivery numbers in the face of the ongoing chip shortage.\n\n**Tuesday, April 27th:**  \nMicrosoft  \nGoogle  \nStarbucks  \nGeneral Electric  \nVisa  \nAMD  \nCapital One  \nUBS  \nHasbro  \n**Wednesday, April 28th:**  \nApple  \nSony  \nFacebook  \nShopify  \nEbay  \nFord  \nQualcomm  \nBoeing  \nGeneral Dynamics  \nRockwell Automation  \nRaymond James Financial Inc\n\n**Thursday, April 29th:**  \nAmazon  \nSamsung  \nMastercard  \nComcast  \nMcDonald's  \nShell  \nCaterpillar  \nNorthrop Grumman Corp  \nTwitter  \nNewmont Mining Corp  \nDr. Pepper Snapple Group  \nThe Hershey Co  \nWestern Digital  \nLogitech\n\n**Friday, April 30th:**  \nAlibaba  \nExxon  \nChevron  \nCharter Communications",
        "subreddit": "StockMarket",
        "title": "What's Happening in the Markets: Week of 4/26/2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/mz2c4g/whats_happening_in_the_markets_week_of_4262021/",
        "created": 1619485161.0
    },
    {
        "author": "drsunnyday",
        "created_utc": 1619478456,
        "id": "mzanka",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Hard drive stocks like WDC set to explode\n\nFirst of all, do not sell gme shares to fund this trade. This trade is specifically to distract me from gme so I continue to hold and don’t get distracted. \n\nTLDR: there is a new internet unicorn dollar coming out that uses hard drives to mine. Hard drives have likely seen a huge boom in purchases and WDC reports earnings this Thursday 4/26/21\n\nThere is a new internet currency coming out may 3 called Chia. It’s founded by brahm cohen, founder of bit Torrent. Dude has made a new blockchain that uses proof of space instead of proof of work. \n\nBasically what that means is instead of burning a shit ton of energy to mine a nicotine dollar , they just show that you used up 100gb chunks of a hard drive to mine chia. They call it farming instead of mining Bc it’s way greener and uses way less energy. \n\nRight now chia is in a pre-mine period where they are letting people farm their hard drives. Since the premine started the space on the network has exploded. People are buying lots of ssds and hdd hard drives to farm chia. And by a lot I mean a lot. Like 4K worth each. \n\nInterestingly wdc, aka western digital, one of the major hdd and ssd drive manufacturers is reporting earnings this Thursday. \n\nI think chia is relatively unheard of enough to where this phenomenon is off a lot of traders radar so there could still be price discovery here. \n\nChia network currently has 862 PiB of storage. 1 PiB is 1125 terabytes. So there are almost a million terabytes (970k) of hard drives mining chia and that number is growing daily. \n\nAdditionally to make the 100gb farm to “mine” chia you have to plot it with ssd drives which likely means another product of western digital got into high demand. \n\nMy calls all expire may 7 because that also gives time for chia to announce what price it trades at. If chia announces a high price miners will flock to buy more hard drives and WDC should sell a lot of inventory. The price could go up on speculation alone. \n\nPositions: May 7 call 70 strike.",
        "subreddit": "wallstreetbets",
        "title": "WDC set to rise due to increased hard drive demand",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mzanka/wdc_set_to_rise_due_to_increased_hard_drive_demand/",
        "created": 1619507256.0
    },
    {
        "author": "nord2rocks",
        "created_utc": 1619458403,
        "id": "mz34tw",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Computer Storage Companies, Seagate and Western Digital are positioned for short and maybe long term growth",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mz34tw/computer_storage_companies_seagate_and_western/",
        "created": 1619487203.0
    },
    {
        "author": "osaruben",
        "created_utc": 1619728065,
        "id": "n1df1m",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Guy don't loose the rocket 🚀🚀🚀\nWD going to the moon. I been checking for it from last week and investing. Probably the reason the new \"chia coin\" coming soon. HDD sales are on fire. Check also Seagate stock",
        "subreddit": "wallstreetbets",
        "title": "Western Digital (WDC) #TOTHEMOON!!!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n1df1m/western_digital_wdc_tothemoon/",
        "created": 1619756865.0
    },
    {
        "author": "amsnpsch",
        "created_utc": 1619484271,
        "id": "mzcj6n",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "WDC up big today",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mzcj6n/wdc_up_big_today/",
        "created": 1619513071.0
    },
    {
        "author": "drsunnyday",
        "created_utc": 1619477818,
        "id": "mzafld",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "Hard drive stocks like WDC set to explode",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mzafld/hard_drive_stocks_like_wdc_set_to_explode/",
        "created": 1619506618.0
    }
]