[
    {
        "author": "horsetrich",
        "created_utc": 1638437411,
        "id": "r73o10",
        "num_comments": 1,
        "num_crossposts": 0,
        "selftext": "Article link: https://erikbern.com/2021/11/30/storm-in-the-stratosphere-how-the-cloud-will-be-reshuffled.html\n\n&gt;Predictions\n\n&gt;* The cloud market will grow to $1T/year in revenue. Ok, that's almost entirely noncontroversial.\n\n&gt;* Most engineers will never interact directly with cloud vendors, but through services on top of those.\n\n&gt;* The database market (OLAP, OLTP, you name it) will be dominated by vendors running on top of cloud vendors, where the underlying layer is completely abstract.\n \n&gt;* We will have some amazing new runtimes, finally figuring out the developer experience problems that are currently holding serverless solutions back.\n\n&gt;* We will see a lot of partnerships between startups and cloud vendors, where a cloud vendor may concede an area and try to be a preferred partner with a startup instead.\n \n&gt;* Kubernetes will be some weird thing people loved for five years, just like Hadoop was 2009-2013, but the world will move on.\n\n&gt;* Resource utilization in the cloud will be much better, and engineers will spend an order of magnitude less time thinking about resource allocation and provisioning.\n\n&gt;* IBM has finally given up on “hybrid multi-cloud”.\n \n&gt;* YAML will be something old jaded developers bring up after a few drinks. You know it's time to wrap up at the party at that point.\n\nWhat do you think are the companies that show great potential to be a top could service provide in the next 5-10 years?",
        "subreddit": "stocks",
        "title": "The cloud will be reshuffled. What are your thoughts? Will AWS continue to dominate the market in the next decade?",
        "url": "https://www.reddit.com/r/stocks/comments/r73o10/the_cloud_will_be_reshuffled_what_are_your/",
        "created": 1638466211.0
    },
    {
        "author": "Thetallshorttt",
        "created_utc": 1638386079,
        "id": "r6ml9m",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "I’m definitely seeing value here, it seems massively undervalued since the split from IBM. Although unprofitable at present it still has massive blue chip customers and $20b revenue. It’s a fucking value play.",
        "subreddit": "wallstreetbets",
        "title": "Kyndryl - DFV play at 0.7x book value and 0.25x sales?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/r6ml9m/kyndryl_dfv_play_at_07x_book_value_and_025x_sales/",
        "created": 1638414879.0
    }
]