[
    {
        "author": "theepicone111",
        "created_utc": 1637687403,
        "id": "r0hyto",
        "num_comments": 687,
        "num_crossposts": 0,
        "selftext": "Does anything in particular look like a good deal right now? A lot of red, although from ATH in many cases, but some red is starting to look quite attractive to me. \nPersonally I’m looking at DIS, INTC, PYPL, PLTR, BABA, V\n\nWhat have you been buying/eyeing?",
        "subreddit": "stocks",
        "title": "Anything on a good sale right now?",
        "url": "https://www.reddit.com/r/stocks/comments/r0hyto/anything_on_a_good_sale_right_now/",
        "created": 1637716203.0
    },
    {
        "author": "brownedout17",
        "created_utc": 1637596494,
        "id": "qzojom",
        "num_comments": 543,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "The Future of PAYPAL? As this stock continues to decline, and hit 52-week lows today, at what point would it be wise to cut your losses and seek an exit opportunity on this stock. For those holding and confident it'll bounce back, what is your reasoning behind it?",
        "url": "https://i.redd.it/jz0qn6mm56181.jpg",
        "created": 1637625294.0
    },
    {
        "author": "sick-gii",
        "created_utc": 1637436078,
        "id": "qycoal",
        "num_comments": 516,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "What’s the deal with PayPal? Is this a good time to buy?",
        "url": "https://i.redd.it/tsaqfutlws081.jpg",
        "created": 1637464878.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1637338221,
        "id": "qxjgcu",
        "num_comments": 350,
        "num_crossposts": 0,
        "selftext": "My Paypal cost is around $235, paypal and venmo are very widely used by many people. But the stock just keep trading lower everyday and now it is hitting 52 week low from November 2020. Does anyone know is this a macro-trend issue or reasons from paypal itself.",
        "subreddit": "stocks",
        "title": "Why is Paypal keep trading lower everyday",
        "url": "https://www.reddit.com/r/stocks/comments/qxjgcu/why_is_paypal_keep_trading_lower_everyday/",
        "created": 1637367021.0
    },
    {
        "author": "liberalvisa",
        "created_utc": 1636503428,
        "id": "qqha3a",
        "num_comments": 326,
        "num_crossposts": 0,
        "selftext": "**BUY PayPal stock now** \n\nPayPal (NASDAQ:PYPL)  price was beaten down after a series of events and yesterday the CEO has delivered a weak guidance despite announcing the partnership with Amazon. They are well established, and they have a solid track record with big growth potential. With the current price, it offer investor a better opportunity to enter into the stock and potentially to buy at a lower price. \n\n**Lets take a look at PayPal (NASDAQ:PYPL)** \n\n**Financial Health - no issue** \n\nLiabilities - debt to equity ratio of 42.8% (Total debt 8,945 Million / Total Equity 20,905 Million) as at June 30, 2021. *As interest rate is low, it is an excellent strategy to take on more debts to have more rooms for business expansion.* \n\nDebt Coverage - PayPal is well covered by operating cash flow (64%)\n\nInterest Coverage - PayPal's interest payments on debts are well covered by EBIT (24.7x coverage) \n\nCash &amp; Short term investments USD$12.4 billion \n\n**Earnings - Positive Earning Trend** \n\nTheir profit margin have been growing from 5.2% in year 2014 to 20.4% in year 2021. They have grown significantly by an average of 25% per year over the past 5 years.\n\nHigh ROE - 23.3% (ROE indicates how well a company's management deploys shareholder capital). \n\n**Ownership breakdown** \n\nInstitutions make up 82% of majority of ownership and general public of 17.9% . Big institutional / fund house such as Vanguards, Blackrock, state street global advisors are the top shareholders holding majority of the shares.\n\n**Future - Partnership with Amazon**\n\n PayPal said it had inked a deal with Amazon to allow the firm’s Venmo wallets in the U.S. to be accepted on Amazon’s website and mobile app starting next year. Amazon being the largest e-commerce in the world, has **300 million active users** as of (1 November 2021) and **162 million active users** are from US.  Due to Amazon’s global scope and reach, it is also considered one of the most valuable brand worldwide. This also means that PayPal got to access to Amazon users and the payments can be done through PayPal's Venmo wallets. This is going to be the biggest revenue source going forward. \n\n**Digitalization  - convenience is part of us now after Covid19** \n\nEven economies are re-opening, we are every much used to digitalization where we find convenience in purchasing groceries and items online. Even the economy are open, my family and I still find these habits are to stay, we don't physically go to the stores and pick up items that often because I find (1) the prices online are usually more competitive, (2) I do not need to carry large bulky items home (3) whatever I sees in the stores, I will be able to buy online, so if I am not in a rush, I will still get my items online. My family did the same too. \n\nWith Covid19, it had sped up our pace of digitalization, the baby boomer and generation X who are usually not good with computers and mobile applications are forced to use online payments to minimized human contact. Once they got hold of it, the habits are to stay. My mother had learnt to order Amazon Prime for groceries have been very happy with it, she commented that she got competitive prices like other supermarket, and most importantly, the groceries are delivered right to the doorstep without her going out and carrying the items home which she had to persuade my brother to go with her to help her in carrying. Even economy are opening up, she is still going to continue to do that as she had found the conveniences and comfort of online shopping. And prior to Covid19, even amazon prime was around, she had refused to learn to shop online. \n\n**Forward guidance Vs potential** \n\nI will think the forward guidance from the CEO, Dan Schulman, is an overstatement. He is trying to manage expectations but it came out badly. But as well, it has presented us an opportunity to get the PayPal as the potential is huge.",
        "subreddit": "wallstreetbets",
        "title": "BUY PayPal stock now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qqha3a/buy_paypal_stock_now/",
        "created": 1636532228.0
    },
    {
        "author": "Altruistic-Fudge-522",
        "created_utc": 1636578296,
        "id": "qr4603",
        "num_comments": 312,
        "num_crossposts": 0,
        "selftext": "I purchased some PayPal shares at 230$ because I was told it was a good buy, and because I frequently use PayPal as well and it had not been that low in a while. But it has just continued to drop all the way down to 204$?? Does anyone know if there is a reason for this",
        "subreddit": "stocks",
        "title": "Why is PayPal so low?",
        "url": "https://www.reddit.com/r/stocks/comments/qr4603/why_is_paypal_so_low/",
        "created": 1636607096.0
    },
    {
        "author": "gorays21",
        "created_utc": 1636208278,
        "id": "qo16cu",
        "num_comments": 302,
        "num_crossposts": 0,
        "selftext": "This week will be massive with the infrastructure bill being passed and some of reddit's favorite companies with earnings, it could be absolute chaos. Here are some companies with earnings this week\n\n• Disney\n\n• Palantir\n\n• Corsair\n\n• Paypal\n\n• Coinbase\n\n• SoFi\n\n• Roblox\n\n• Virginia Galactic\n\n• The Trade desk\n\n• A Chinese car company who's name I cannot mention\n\nWhat do you guys think about this upcoming week?",
        "subreddit": "stocks",
        "title": "This week will be massive!",
        "url": "https://www.reddit.com/r/stocks/comments/qo16cu/this_week_will_be_massive/",
        "created": 1636237078.0
    },
    {
        "author": "Hour_Amphibian1844",
        "created_utc": 1636040182,
        "id": "qmn9m3",
        "num_comments": 298,
        "num_crossposts": 0,
        "selftext": "Believe it or not I still have some money left to lose, so let’s go. This one is straightforward. Pinterest reports earnings today. The stock has already been beaten down a lot after last earnings and the failed PayPal acquisition rumor. However, I think their data looks really weak and there’s some space for a further drop. It’s a dangerous play however, since Pinterest already dropped something like 25% during their last earnings call. Proceed with caution.\n\nAnalysts will be watching Pinterest’s user number very closely. If they don’t manage to reverse the MAU drop they experienced during the last earnings call, things could still get uglier. \n\n**Weak website hits**\n\nIn every single one of the countries it’s active in, Pinterest has suffered a drop in website views since April. The biggest drops came from European countries, but US suffered as well. In October, views were basically steady from September, and the biggest drops came during the month of June, with Q3 being slightly more stable m-o-m. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/n53wgzh6llx71.png?width=481&amp;format=png&amp;auto=webp&amp;s=7168ee3ae26d0a6b80057c05cfa980a3c0e0a8bb\n\n**Weak app downloads**\n\nApp downloads also have decreased a lot, with steady decreases across 2021, and also a pretty sudden recent drop. The pattern kind of reminds me of Wish, which had a similar sudden drop in app downloads, right before they announced during earnings that they were halting marketing aimed at new customers. Not saying Pinterest will suffer a similar fate, but it’s notable how its rankings are at an extremely low level compared even to pre-pandemic levels. \n\n&amp;#x200B;\n\nhttps://preview.redd.it/9fdr3547llx71.png?width=531&amp;format=png&amp;auto=webp&amp;s=584ae048cd6709b3eed454ebabf3c7981798d564\n\n**Positions**",
        "subreddit": "wallstreetbets",
        "title": "Pinterest ($PINS) 40k earnings put YOLO",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qmn9m3/pinterest_pins_40k_earnings_put_yolo/",
        "created": 1636068982.0
    },
    {
        "author": "I_whip_idiots",
        "created_utc": 1637715841,
        "id": "r0scoo",
        "num_comments": 270,
        "num_crossposts": 0,
        "selftext": "With $4000, I was thinking of buying 1 PYPL $200C expiring in January 2023 and 3 ATVI $70C also expiring in January 2023. I’m also interested in OPEN $20C with the same expiry but lean more towards ATVI. I’m a little reluctant to go for a far OTM and not so sure I should just start from ITM. I never have bought a LEAP before. Advise please.",
        "subreddit": "options",
        "title": "LEAP Calls with $4000?",
        "url": "https://www.reddit.com/r/options/comments/r0scoo/leap_calls_with_4000/",
        "created": 1637744641.0
    },
    {
        "author": "werewere223",
        "created_utc": 1636472575,
        "id": "qq6ef5",
        "num_comments": 208,
        "num_crossposts": 0,
        "selftext": "At the time of typing this Paypal is down 12% to 201.60$ a share. Is this stock a buy at that price and why exactly is it still tumbling? Personally I don't have any shares, but I have been watching them closely these past weeks and may finally make a move at that price.",
        "subreddit": "stocks",
        "title": "$PYPL taking a Nose Dive day after Earnings",
        "url": "https://www.reddit.com/r/stocks/comments/qq6ef5/pypl_taking_a_nose_dive_day_after_earnings/",
        "created": 1636501375.0
    },
    {
        "author": "liberalvisa",
        "created_utc": 1636503569,
        "id": "qqhbra",
        "num_comments": 206,
        "num_crossposts": 0,
        "selftext": " **BUY PayPal stock now**\n\nPayPal (NASDAQ:PYPL) price was beaten down after a series of events and yesterday the CEO has delivered a weak guidance despite announcing the partnership with Amazon. They are well established, and they have a solid track record with big growth potential. With the current price, it offer investor a better opportunity to enter into the stock and potentially to buy at a lower price.\n\n**Lets take a look at PayPal (NASDAQ:PYPL)**\n\n**Financial Health - no issue**\n\nLiabilities - debt to equity ratio of 42.8% (Total debt 8,945 Million / Total Equity 20,905 Million) as at June 30, 2021. *As interest rate is low, it is an excellent strategy to take on more debts to have more rooms for business expansion.*\n\nDebt Coverage - PayPal is well covered by operating cash flow (64%)\n\nInterest Coverage - PayPal's interest payments on debts are well covered by EBIT (24.7x coverage)\n\nCash &amp; Short term investments USD$12.4 billion\n\n**Earnings - Positive Earning Trend**\n\nTheir profit margin have been growing from 5.2% in year 2014 to 20.4% in year 2021. They have grown significantly by an average of 25% per year over the past 5 years.\n\nHigh ROE - 23.3% (ROE indicates how well a company's management deploys shareholder capital).\n\n**Ownership breakdown**\n\nInstitutions make up 82% of majority of ownership and general public of 17.9% . Big institutional / fund house such as Vanguards, Blackrock, state street global advisors are the top shareholders holding majority of the shares.\n\n**Future - Partnership with Amazon**\n\nPayPal said it had inked a deal with Amazon to allow the firm’s Venmo wallets in the U.S. to be accepted on Amazon’s website and mobile app starting next year. Amazon being the largest e-commerce in the world, has **300 million active users** as of (1 November 2021) and **162 million active users** are from US. Due to Amazon’s global scope and reach, it is also considered one of the most valuable brand worldwide. This also means that PayPal got to access to Amazon users and the payments can be done through PayPal's Venmo wallets. This is going to be the biggest revenue source going forward.\n\n**Digitalization - convenience is part of us now after Covid19**\n\nEven economies are re-opening, we are every much used to digitalization where we find convenience in purchasing groceries and items online. Even the economy are open, my family and I still find these habits are to stay, we don't physically go to the stores and pick up items that often because I find (1) the prices online are usually more competitive, (2) I do not need to carry large bulky items home (3) whatever I sees in the stores, I will be able to buy online, so if I am not in a rush, I will still get my items online. My family did the same too.\n\nWith Covid19, it had sped up our pace of digitalization, the baby boomer and generation X who are usually not good with computers and mobile applications are forced to use online payments to minimized human contact. Once they got hold of it, the habits are to stay. My mother had learnt to order Amazon Prime for groceries have been very happy with it, she commented that she got competitive prices like other supermarket, and most importantly, the groceries are delivered right to the doorstep without her going out and carrying the items home which she had to persuade my brother to go with her to help her in carrying. Even economy are opening up, she is still going to continue to do that as she had found the conveniences and comfort of online shopping. And prior to Covid19, even amazon prime was around, she had refused to learn to shop online.\n\n**Forward guidance Vs potential**\n\nI will think the forward guidance from the CEO, Dan Schulman, is an overstatement. He is trying to manage expectations but it came out badly. But as well, it has presented us an opportunity to get the PayPal as the potential is huge.",
        "subreddit": "StockMarket",
        "title": "BUY PayPal stock now",
        "url": "https://www.reddit.com/r/StockMarket/comments/qqhbra/buy_paypal_stock_now/",
        "created": 1636532369.0
    },
    {
        "author": "stockist420",
        "created_utc": 1636789867,
        "id": "qswdrr",
        "num_comments": 204,
        "num_crossposts": 0,
        "selftext": "Paypal has been taking a beating for the last few months and then was KOed post-earnings. Their forward guidance for next quarter was a bit muted, but the stock IMO is still solid. Analysts have downgraded their PT, but they are still 20-30% higher than the current price. With their venemo amzn deal, Christmas around the corner, they should have a decent quarter. Just want to get some thoughts on say why even current price levels might be higher or essentially any other downsides. Thanks!",
        "subreddit": "stocks",
        "title": "Why would you NOT buy paypal at current level?",
        "url": "https://www.reddit.com/r/stocks/comments/qswdrr/why_would_you_not_buy_paypal_at_current_level/",
        "created": 1636818667.0
    },
    {
        "author": "deezenemious",
        "created_utc": 1635957644,
        "id": "qlyhml",
        "num_comments": 178,
        "num_crossposts": 0,
        "selftext": "This DD is going to be quick and theoretical, and maybe less DD than some people like. I don't care. Your loss. One of the potential greatest earnings beats of all time is coming 11/10 (quick discussion [here](https://www.reddit.com/r/wallstreetbets/comments/pawnga/opendoor_is_on_pace_to_blow_away_q3_estimates/)). This is on top of a stupid discount with the stock being coupled to $ZG's downfall. This will de-couple.   \n\n\nKeith Rabois: PayPal mafia, Musk and Thiel friend, edgy fuck-you attitude online. This man is somehow so under talked about in this thread and is one of the kings of tech and Twitter. Keith should be a legend of this sub. He is right time after time. He doesn't care about discourse. He just executes. Opendoor has been his long time baby, which he has waited to start to get the timing right. Co-founder, now executive chairman, and a Twitter account that is tweeting out borderline NMPI.   \n\n\nLongterm, $OPEN is going to have similar / greater top line numbers as Walmart. People are concerned about a downturn in the housing market being non-survivable. Wrong. The model has been back-tested through the 2008 crisis and beyond. Opendoor can still make money. The collapse in housing markets are much slower than you want to believe, and with the right vertical model in place, Opendoor can make money while losing a couple of basis points. They are so misunderstood, and this is the discounted time to join.  \n\n\nOpendoor has an actual model. They understand how to price homes and when to pull on/off on different regions, and they don't overreact to the market to end up fucked by 700 basis points ala Zillow. Opendoor also doesn't have the same fiduciary responsibility that Zillow does. They have to (and are) making this model work. Zillow simply had to pull out for two reasons: 1) they didn't know what they were doing. 2) they owed a fiduciary responsibility to the shareholders to quit while they can and focus on their main model (which will also get swallowed in the coming years). This is now Opendoor's market to run with. Google ($OPEN) vs Yahoo.  \n\n\nTo the tweets. Rabois is addicted to Twitter. Similar to Elon, but different. In some ways more professional, in some ways more unhinged and quite a few red pilled based takes. Anyways, he's been obsessed with tweeting Q3 takes, while searching and favoriting $OPEN tweets, and engaging in discussion. He calls doubters stupid in public. Here are a few from the past few weeks:  \n\n\n1. \"Opendoor does not lose money.\" [here](https://twitter.com/rabois/status/1450115678346924038?s=20)\n2. \"wait until Nov 10 and you will concede I was correct\" [here](https://twitter.com/rabois/status/1453880268851404806?s=20)\n3. \"nope.  TKO.  Opendoor is doing better than ever.\" [here](https://twitter.com/rabois/status/1449792434062438406?s=20)\n4. \"they are going to look like the Tesla cynics in 3 weeks.\" [here](https://twitter.com/rabois/status/1449787713394253825?s=20)\n5. \"Selling or shorting Opendoor due to Zillow’s flaws is akin to shorting Google due to Yahoo’s inability to monetize search well or return long tail queries properly.\" [here](https://twitter.com/rabois/status/1455564619494436870?s=20) \n   1. Note here: short numbers that kicked in after the Zillow earnings are not public yet, and will not be public before earnings. Give the action a look and you'll see a bunch of shorts likely kicked up, and will be put in a need to cover position based off the earnings and a longer short ratio.\n6. \"LOL.  We are consistently profitable.  We know exactly what we are doing.\" [here](https://twitter.com/rabois/status/1449783187656355846?s=20)  \n\n\nThis is more than just pre-bragging earnings. Chairmen and founders used to be more discreet by taking lavish vacations before earnings. Then Michael Jung from NYU published research to connect behavior to upcoming releases and it all stopped. Keith is straight up dancing in public. He's celebrating Zillow taking a beating. He's also publicly called Zillow becoming a disaster [from the archives](https://twitter.com/rabois/status/984609468355719168?s=20).\n\nAnalysts like Opendoor. The cap table is ELITE. Real Estate agents provide negative value in a broken industry., which leads me to one final point. The effects of the tech industry and Keith's pinned tweet which he bases his career on:  \n\n\n&gt;***Formula for startup success: Find large highly fragmented industry w low NPS; vertically integrate a solution to simplify value product.*** \n\n  \niBuying is just the entry. Cash flow heavy, with a potential to open up a MASSIVE vertical moat. Open has already completed 2 acqui-hires this year. This is a $5TN company in the making and it's currently valued at \\~$13BN.   \n\n\nIf you're an agent in the industry and are mad about Opendoor, don't come in and say it won't work. You're wrong. Take your massive winning year and hedge against your job being automated away. You'll get to retire even sooner. This is the way.",
        "subreddit": "wallstreetbets",
        "title": "$OPEN THE MOST UNDERVALUED MOAT OF ALL TIME",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qlyhml/open_the_most_undervalued_moat_of_all_time/",
        "created": 1635986444.0
    },
    {
        "author": "coolcomfort123",
        "created_utc": 1636407050,
        "id": "qpnqqe",
        "num_comments": 162,
        "num_crossposts": 0,
        "selftext": "https://www.cnbc.com/2021/11/08/paypal-pypl-earnings-q3-2021.html\n\nEarnings per share: $1.11, adjusted, vs. $1.07 expected in a Refinitiv survey of analysts\n\nRevenue: $6.18 billion vs. $6.23 billion expected\n\nPayPal reported a 13% increase in year-over-year revenue for the third quarter.\n\nThe company issued a fourth-quarter forecast that fell well short of analysts’ expectations.\n\nThe stock finally get a boost after the earning report. It has been down from $310 to $230 and it is definitely oversold. Investors should buy the stock here as PayPal is still growing very healthy and there is still plenty of opportunities for PayPal to expand.",
        "subreddit": "stocks",
        "title": "PayPal reports 13% revenue increase in the third quarter but lowers annual forecast",
        "url": "https://www.reddit.com/r/stocks/comments/qpnqqe/paypal_reports_13_revenue_increase_in_the_third/",
        "created": 1636435850.0
    },
    {
        "author": "LuxGang",
        "created_utc": 1635863143,
        "id": "ql5dmc",
        "num_comments": 155,
        "num_crossposts": 0,
        "selftext": "I've been watching V and MA quite closely since their earnings, and they seem to be approaching attractive levels.\n\nPYPL is another one that looks to be approaching a buy zone, but before I pull the trigger on any of these 3, I wanted to get your thoughts on which Fintech seems to be the best value at these levels.\n\nI've also considered SQ but they are quite richly priced, and I'd like to wait for earnings.\n\nAny thoughts on these 4 names? Should I even consider something like AFFRM or SOFI or stick with the big boys?",
        "subreddit": "stocks",
        "title": "Best Fintech stock to own at these levels? V, MA, PYPL, SQ, etc.",
        "url": "https://www.reddit.com/r/stocks/comments/ql5dmc/best_fintech_stock_to_own_at_these_levels_v_ma/",
        "created": 1635891943.0
    },
    {
        "author": "Miker1730",
        "created_utc": 1637542038,
        "id": "qz8wyi",
        "num_comments": 133,
        "num_crossposts": 0,
        "selftext": "Hey Everyone,\nI recently bought some paypal as it dropped over the last few days with 100 shares at a total cost basis of 198. Now i a plan on selling some covered calls to lower my cost basis.\n\nIs anyone else bullish on paypal? \nthe whole sector seems to be crapping the bucket",
        "subreddit": "stocks",
        "title": "Who is loading up on paypal?",
        "url": "https://www.reddit.com/r/stocks/comments/qz8wyi/who_is_loading_up_on_paypal/",
        "created": 1637570838.0
    },
    {
        "author": "ZincMagnesiumCalcium",
        "created_utc": 1636696827,
        "id": "qs4tiv",
        "num_comments": 132,
        "num_crossposts": 0,
        "selftext": "Paypal at PE of 48.6\n\nMastercard at 43.6\n\nVisa at 37.4\n\nWhile Paypal is the most expensive purely from PE point of view, I'm leaning more towards them because they've historically had higher revenue growth compared to the other two and they're diversified or are trying to diversity into things like crypto, stock broker, etc. Also Paypal is around 33% off from its 52 week high, which is far lower than V or MA.\n\nIf you had to pick one out of these 3? Which would you buy at today's prices?",
        "subreddit": "stocks",
        "title": "At current prices, which would you choose between V, MA, and PYPL?",
        "url": "https://www.reddit.com/r/stocks/comments/qs4tiv/at_current_prices_which_would_you_choose_between/",
        "created": 1636725627.0
    },
    {
        "author": "gabugabuchan",
        "created_utc": 1636145943,
        "id": "qnki3s",
        "num_comments": 120,
        "num_crossposts": 0,
        "selftext": "Personally feel that they're way oversold and a huge overreaction, down almost 20% since PINS acquisition rumors and no other news, except the DOJ fintech probing, which didn't affect Visa's rally today anyway.\n\nSome questions that I would like to hear your thoughts on:\n\n* What's your short-term and long-term price target? Say by both EOY and perhaps 2023 outlook respectively.\n* Do you think PayPal still have a moat with so many potential competitors in the fintech industry such as Stripe and Square?\n* What are your thoughts regarding the earnings? Considering that cryptocurrencies rallied hard recently and PayPal has quite a few legs in it. \n* Would love to hear bear cases, both short-term and long-term.\n* What do you think of the recent price actions?",
        "subreddit": "stocks",
        "title": "PayPal's looking tasty for upcoming earnings. What are your thoughts?",
        "url": "https://www.reddit.com/r/stocks/comments/qnki3s/paypals_looking_tasty_for_upcoming_earnings_what/",
        "created": 1636174743.0
    },
    {
        "author": "danktim",
        "created_utc": 1635809490,
        "id": "qkqv6q",
        "num_comments": 120,
        "num_crossposts": 0,
        "selftext": "Current Price $231.50 \nMarket Cap $271 B\n52 Week High $310.16\n52 Week Low $174.81\n\nPayPal is growing a comprehensive platform to power the global digital economy. PayPal is constantly improving its product to meet the needs of their customers. The app was updated in September with a plethora of new features with the hopes of turning it into a super app. Venmo is now offering goods and service payment, and cry.pto currency is now available for you to buy/sell. The fees are even cheaper than Coinbase on a $150 or less purchase. \n\nPositive things about PayPal \n\n1. Updated App in September\n2. Venmo revenue growing every quarter \n3. Buy Now Pay Later option added\n4. Venmo is now offering goods and services option \n5. Honey acquisition is now being utilized on Venmo “DEALS” feature. \n6. Aquired Paidy in September. It’s a Japanese Unicorn. Great acquisition. A Japanese leader. This will increase marker share. \n7. PayPal savings account is coming soon. Earn interest and watch your money grow. No minimum amount needed. \n8. Cry.pto part of their business has taken off. PayPal/Venmo has 2x as many active users than Coinbase. And it’s only been around since April. \n\nI feel the cry.pto part of their business has been overlooked. Bit.coin is at all time high, and I’m sure the ability to buy it on PayPal/Venmo has only helped it get there. \n\nLook for PayPal to use some of its cash reserves 11-12B to acquire companies over the next 12 months OR aggressively buy back shares. \n\nPayPal is revolutionizing how we do business/finance online. If you own a small business (like I do) and you sell a product/service online you most likely get paid in paypal. It’s the king. Millennials prefer to use Venmo, and boomers use paypal. By getting involved in the buy now pay later space they are taking advantage of one of the hottest markets to be in. \n\n\nThe Pinterest news caused an initial drop in stock price, and then PayPals denial of the purchase of Pinterest brought it down even more. This is an incredibly opportunity to buy the dip. No bad news has came out about PayPal. I know it’s not the next Tesla, or some sexy small cap EV company. But, this is a FANTASTIC company with LOADS of potential over the next 12 months. The king of online payments. Building a super app. Earnings are next Monday. I am super excited to see the results. I expect them to MURDER earnings. \n\nThis is not financial advise. I’m just a dumb ape. 🦧[Pictures of some DD. ](https://gyazo.com/4128aa1775f917ad990cee26da474882)",
        "subreddit": "wallstreetbets",
        "title": "$PYPL Due Diligence",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qkqv6q/pypl_due_diligence/",
        "created": 1635838290.0
    },
    {
        "author": "RomeoinA",
        "created_utc": 1637665895,
        "id": "r0ayly",
        "num_comments": 104,
        "num_crossposts": 0,
        "selftext": "As of yesterday, I thought this was nothing but an overreaction to that infamous downgrade. Now I’m not sure. It even makes me think shouldn’t they come up and try that PINS deal again.\n\nI think this stock, with all its challenges, belongs to the high 200$’s. Thoughts?",
        "subreddit": "stocks",
        "title": "PYPL anyone?",
        "url": "https://www.reddit.com/r/stocks/comments/r0ayly/pypl_anyone/",
        "created": 1637694695.0
    },
    {
        "author": "jj456___",
        "created_utc": 1636074132,
        "id": "qmzkzm",
        "num_comments": 102,
        "num_crossposts": 0,
        "selftext": "FPAC is a spac taking crypto exchange Bullish public. The valuation of FPAC at 10$ is 9$ billion, while their assets in terms of coins are $FPAC has 164K BTC and BTC at $62K, it is worth $10.17B. FPAC will adjust for the prices in the time of the merger for their coin value, but we're gonna get a MSTR here with a better valuation PLUS a crypto exchange. With the likes of FTX$ hitting a 25$ billion valuation I believe this will run for sure. Peter Thiel the founder has also had a plethora of success in his career co-founding both Paypal and Palantir so he knows a thing or two about tech and exchanges.",
        "subreddit": "SPACs",
        "title": "$FPAC is gonna be the next de-spac to run",
        "url": "https://www.reddit.com/r/SPACs/comments/qmzkzm/fpac_is_gonna_be_the_next_despac_to_run/",
        "created": 1636102932.0
    },
    {
        "author": "Thetrader2896",
        "created_utc": 1636312178,
        "id": "qovfxd",
        "num_comments": 101,
        "num_crossposts": 0,
        "selftext": "So I have Jan 2022 250s call and bought them when PYPl was trading at like 242, now at 225 I am down 50% on them lmfao. How are we feeling going into earnings on Monday. I like 280-300 by Dec 31 tbh",
        "subreddit": "options",
        "title": "PYPL ER",
        "url": "https://www.reddit.com/r/options/comments/qovfxd/pypl_er/",
        "created": 1636340978.0
    },
    {
        "author": "lilaznjocky",
        "created_utc": 1635787253,
        "id": "qkiuz3",
        "num_comments": 99,
        "num_crossposts": 0,
        "selftext": "Ok, so I can see that investors didn’t look too favorable towards the Pinterest acquisition. But that’s old news now, so what’s driving down the price of the stock? Seems like it’s just being manipulated at this point and has nothing to do with the actual value. I have no idea, but just I’ve watched this go up a tiny bit in the morning to tank every single day for 2 weeks.",
        "subreddit": "stocks",
        "title": "PayPal still down trending with no new updates",
        "url": "https://www.reddit.com/r/stocks/comments/qkiuz3/paypal_still_down_trending_with_no_new_updates/",
        "created": 1635816053.0
    },
    {
        "author": "Puzzleheaded_Bill_10",
        "created_utc": 1637662912,
        "id": "r0a9j3",
        "num_comments": 88,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "When you release Paypal hasn't been at this price since literally a 12 months ago.... Insiders are selling at $216 and buying at $207. Just Venmo me bro!",
        "url": "https://www.reddit.com/gallery/r0a9j3",
        "created": 1637691712.0
    },
    {
        "author": "BagholdingWISH4ever",
        "created_utc": 1636124372,
        "id": "qncz20",
        "num_comments": 81,
        "num_crossposts": 0,
        "selftext": "Most companies with a broken model realize it waaaaaay too late. Their balance sheet is trashed, all the talented employees have left, the share price has been destroyed through dilution and secondary offerings, and their reputation is tarnished, etc. \n\nWISH has about $1.4 BILLION cash and virtually no debt. They have acknowledged significant issues and have already made some adjustments with more coming. They have also brought in legit new talent (google, PayPal, Amazon, Shutterfly) with backgrounds in FinTech and product development among other specialties. They have the balance sheet to “pivot” and reinvent themselves. They also are still generating a ton of revenue and have a big following with one of the most downloaded apps in the entire world. \n\nThe key is getting in BEFORE the turnaround. Earnings are next week. I’m expecting them to be shit. So is everyone else. There will quite possibly be one last dump next week, but anything under $5 is a gift. \n\nHaving said that, I also feel like last quarter was the “kitchen sink” quarter where they ripped the band aid off and took their lumps. I wouldn’t be surprised if this rips to the upside if they have better-than-expected numbers.\n\nI’ve been bagholding this trash since before bagholding was cool. Having said that, I’ve actually gone from disgruntled to bullish on this junk 😂\n\n$10 by Jan 1st. \n$25 by 1/1/23. \nCalling my shot.",
        "subreddit": "wallstreetbets",
        "title": "The simple reason it’s time to buy $WISH — they’re garbage but they know it",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qncz20/the_simple_reason_its_time_to_buy_wish_theyre/",
        "created": 1636153172.0
    },
    {
        "author": "Defiantbeta",
        "created_utc": 1636655958,
        "id": "qrrv0e",
        "num_comments": 76,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$PYPL 🚀🚀. Perfect time to get in. Bayesian statistic show that the bottom is right now",
        "url": "https://i.redd.it/ncw4szkxg0z71.jpg",
        "created": 1636684758.0
    },
    {
        "author": "ENDTHEFED777",
        "created_utc": 1637354765,
        "id": "qxp5xv",
        "num_comments": 76,
        "num_crossposts": 0,
        "selftext": "Let’s start a discussion \n\n-thoughts on the current company? \n\n-long term outlook? \n\n- Your buy/sell Price Targets?",
        "subreddit": "ValueInvesting",
        "title": "$PYPL has just gone below $200 this afternoon session.",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/qxp5xv/pypl_has_just_gone_below_200_this_afternoon/",
        "created": 1637383565.0
    },
    {
        "author": "mark_the_narc",
        "created_utc": 1637164719,
        "id": "qw2cvg",
        "num_comments": 75,
        "num_crossposts": 0,
        "selftext": "Now disney is fairly stable of a company so im not gonna sit here and say its gonna plummet to 0. But after the huge decrease after quarterly reports alot of analysts are lowering their projection. So what im here to ask you is do you think disney will start to rebound this month keep going down or plateau?\n\nIm a firm believer in the mouse and ive already bought the dip but next paycheck im thinking if its my best bet to buy in again or to go with something like paypal.",
        "subreddit": "stocks",
        "title": "Disney rebound?",
        "url": "https://www.reddit.com/r/stocks/comments/qw2cvg/disney_rebound/",
        "created": 1637193519.0
    },
    {
        "author": "TaxShield",
        "created_utc": 1636406719,
        "id": "qpnmhb",
        "num_comments": 69,
        "num_crossposts": 0,
        "selftext": " Q3’21: Total Payment Volume (TPV) reaches $310 billion with 416 million active accounts • TPV of $310 billion, growing 26%, and 24% on an FX-neutral basis (FXN); net revenue of $6.18 billion, growing 13% on a spot and FXN basis • GAAP EPS of $0.92 compared to $0.86 in Q3’20; non-GAAP EPS of $1.11 compared to $1.07 in Q3’20 • 13.3 million Net New Active Accounts (NNAs) added; ended the quarter with 416 million active accounts • Operating Cash Flow of $1.51 billion, growing 15%; Free Cash Flow of $1.29 billion, growing 20% \n\nFY’21: Revenue expected to grow \\~18% and end the year with &gt;430M active accounts • TPV growth now expected to be in the range of \\~33%-34% at current spot rates and \\~31%-32% on an FXN basis; net revenue expected to be in the range of \\~$25.3 billion to \\~$25.4 billion, representing growth of \\~18% at current spot rates and \\~17% on an FXN basis • GAAP EPS expected to be \\~$3.62 compared to $3.54 in FY’20; non-GAAP EPS expected to grow \\~19% to \\~$4.60 • \\~55 million NNAs expected to be added in FY’21, including \\~3 million active accounts added from the acquisition of Paidy • Venmo users in the U.S. will be able to pay with Venmo on Amazon.com starting in 2022 \n\n[https://s1.q4cdn.com/633035571/files/doc\\_financials/2021/q3/Q3-21-PayPal-Earnings-Release.pdf](https://s1.q4cdn.com/633035571/files/doc_financials/2021/q3/Q3-21-PayPal-Earnings-Release.pdf)",
        "subreddit": "stocks",
        "title": "Paypal Q3 earnings release",
        "url": "https://www.reddit.com/r/stocks/comments/qpnmhb/paypal_q3_earnings_release/",
        "created": 1636435519.0
    },
    {
        "author": "august2014",
        "created_utc": 1636357690,
        "id": "qp8sj9",
        "num_comments": 68,
        "num_crossposts": 0,
        "selftext": "I would like your thoughts on buying the dip:\n\n$T / AT&amp;T\n\n$MU / Micron\n\n$PYPL / Paypal\n\n$BA / Boeing\n\nI am already fully vested in $AAPL $SPY $MSFT $MA etc. I want to go on margin (maybe 30% of account net worth) and buy these guys because I believe their fundamental business model ( and read lots of opinions and other people's arguments about being near-monopolies or unique). I have never tried to time the lows like this, let alone on margin. I just learned that at IBKR I pay like 1% for margin borrowing.  I am really interested in hearing some perspectives.\n\nAlso, another idea on the recent $TSLA poll from Musk about him selling his own position -- how do you feel about trying to time selling some $TSLA puts this coming week?",
        "subreddit": "stocks",
        "title": "Thoughts on buying the dip: $T, $MU, $PYPL, $BA",
        "url": "https://www.reddit.com/r/stocks/comments/qp8sj9/thoughts_on_buying_the_dip_t_mu_pypl_ba/",
        "created": 1636386490.0
    },
    {
        "author": "SavienKennedy",
        "created_utc": 1637443573,
        "id": "qyf7fb",
        "num_comments": 66,
        "num_crossposts": 0,
        "selftext": "Good morning fellow apes; I’m here to tell you about Micron Technology and answer a few questions: what is it, why is it trending, and is there a future for it?\n\n&amp;#x200B;\n\n**WHAT IS MU?**\n\n**Micron Technology, Inc. (NASDAQ: MU)** is an American producer of computer memory and computer data storage. This includes DRAM (dynamic random-access memory), flash memory, and USB flash drives. Its consumer products are marketed under the brands Crucial and Ballistix. Micron and Intel together created IM Flash Technologies, which produces NAND flash memory.\n\n&amp;#x200B;\n\n**WHY IS MU TRENDING ON** r/wallstreetbets**?**\n\nEvercore Fundamental Research Analyst C.J. Muse boosted to his firm’s “Top Picks” list last week. He argues that MU could benefit from the “green shoots” he’s seeing in the memory industry.\n\nEven though MU lost 1.3% since the start of June (and competitor Lam has fallen 0.8%, while the Semiconductor index has increased 22.8% in the same time frame), Muse confidently states that “..it is clear that the tides are shifting, with pricing decline expectations into 1HCY22 becoming ‘less bad,’ estimates likely bottoming in 1H22, and green shoots arising from PC constraints elsewhere easing, and hyperscale capex spend likely improving before year end. Thus, we think it is game on for memory.”\n\n“From an investor positioning perspective, we note investors are generally eager to get back into memory for anticipated outperformance in 2022 but are not there today,” Muse wrote. “So when the turn comes, we think it will be fast and furious.”\n\nApart from EverCore, there are other financial analysts who believe MU is poised to take advantage of the future of memory. Citi analyst Christopher Danely notes that the firm's DRAM analyst Peter Lee recently raised his DRAM pricing expectations for Q4 of 2021 and Q1 of 2022, driven mostly by upside from the PC end market, which led the DRAM correction. Channel checks indicate there has been some upside from the PC market for DRAM and demand from the server end market for Q1 of 2022 appears to be better than expected, Danely tells investors in a research note. As such, the analyst expects \"more positive catalysts\" for DRAM in the coming months and initiated a \"positive catalyst watch\" on Buy-rated Micron. He expects the stock to trade higher as investors gain more confidence the DRAM correction \"is drawing to a close.\" Danely keeps a $120 price target on the stock, currently trading just north of $80 a share.  \n \n\nAfter the two above reports became public, the market started to react. MU recently started trending as one of the top 3 most mentioned tickers on r/wallstreetbets, beating out PayPal, Tilray, Amazon, and Aurora.\n\n&amp;#x200B;\n\n**THE FUTURE OF MEMORY AND MU**\n\nThe memory-chip market hit the skids in the second half of 2018 when sales of smartphones, personal computers, servers and other gear slowed. But memory-chip sales rebounded in late 2020.\n\nBoise, Idaho-based Micron makes two main types of memory chips: DRAM and Nand. Dynamic random-access memory, or DRAM, accounted for 74% of Micron's revenue in its fiscal fourth quarter. Nand flash memory accounted for 24% of its revenue during the period.\n\nDRAM chips act as the main memory in PCs, smartphones and other devices, working closely with central processing units. Nand flash provides longer-term data storage.\n\n&amp;#x200B;\n\n**WHAT IS DRAM?**\n\nNormal RAM is a semiconductor that is placed on a processor that stores variables for calculations. RAM provides memory locations for requested data. The CPU receives a data read instruction with the data’s memory address or location, and then it sends the address to the RAM controller.\n\nThe controller, in turn, sends the address to the proper pathway, opening path transistors and reading each capacitor value. The read data is transmitted back to the CPU’s cache.\n\nThe speed of this read/write operation is important to know about. They are called timings: faster timings with less lag between them result in faster access times. Slower timings result in lower performance. Bandwidth also affect performance: the larger the bandwidth, the more data per second RAM can process and the faster the timings.\n\nBasically, if you want the best SSD for your buck, you want to know if you are getting something with fast timings or slow timings.. namely, SRAM or DRAM.\n\n   \n\n* SRAM has lower access time, and is faster whereas DRAM has a higher access time and is slower compared to SRAM.\n* SRAM users transistors and latches while DRAM uses capacitors and very few transistors.\n* L2 and L3 CPU cache units are some general applications of a SRAM while the DRAM is mostly found as the main memory in computers.\n* SRAM offers low packaging density while DRAM offers a high packaging density.\n* SRAM is in the form of on-chip memory, but DRAM has the characteristics of off-chip memory.\n\nIn short, DRAM uses very few transistors, has the characteristics of off chip memory, and is available in larger storage capacity\n\n&amp;#x200B;\n\n**ADVANTAGES OF DRAM**\n\n* Cheaper compared to SRAM.\n* It has a higher storage capacity. Hence it is used to create a larger RAM space system.\n* Offers simple structure.\n* It doesn’t require to refresh the memory contents.\n* You don’t need to refresh the memory contents and its access time is faster.\n* Logic or circuitry is needed, so the memory module itself is simpler.\n\n&amp;#x200B;\n\n**THE SEMICONDUCTOR INDUSTRY**\n\nWorldwide sales of semiconductors in Q3 2021 were $144.8 billion, an increase of 27.6% over Q3 2020 and 7.4% more than Q2 2021, reported by the Semiconductor Industry Association.\n\nJohn Neuffer, SIA president and CEO says “Semiconductor shipments reached all-time highs in the third quarter of 2021, demonstrating both the ongoing high global demand for chips and the industry’s extraordinary efforts to ramp up production to meet that demand.”\n\nGlobal sales for the month of September 2021 were $48.3 billion, an increase of 27.6% over the total from September 2020 and 2.2% more than sales from August 2021.\n\nRegionally, year-to-year sales increased in the Americas 33.5%, Europe 32.3%, Asia Pacific/All Other 27.2%, Japan 24.5%, and China 24.0%.\n\nMonth-to-month sales increased in the Americas 3.9%, Europe 2.0%, Japan 2.0%, Asia Pacific/All Other 1.9%, and China 1.5%.\n\n&amp;#x200B;\n\n**ANALYSIS OF MU – CUP AND HANDLE**\n\nOn Nov. 6, MU started to break out of a cup-with-handle according to IBD MarketSmith charts. A three-weeks-tight pattern in late December offered an add-on buy point at 74.71.\n\nMicron stock has an **IBD Accumulation/Distribution Rating** of B-, indicating modest institutional buying of MU stock.\n\n&amp;#x200B;\n\n[MU Cup and Handle](https://preview.redd.it/at41phf8ht081.png?width=623&amp;format=png&amp;auto=webp&amp;s=74012005729ab7a8ded8e662cc9ff1ce85970c17)\n\nMicron wasn't directly affected by the chip shortage, since it manufactures its own chips instead of outsourcing them to third-party foundries. However, it expects shortages of other PC components -- including CPUs and GPUs -- to indirectly curb the market's near-term demand for its memory chips. That warning, along with a softer-than-expected forecast for the first quarter, spooked investors last month.\n\nDespite these challenges, analysts still expect Micron's revenue and earnings to rise 15% and 44%, respectively, this year, as it benefits from the secular expansion of the gaming, data center, cloud, 5G, and automotive markets. Those catalysts might also spark a \"super cycle\" in memory chip upgrades, which could last much longer than previous cycles and propel Micron's stock to fresh highs.\n\n&amp;#x200B;\n\n**DISCLAIMER**\n\nThis is not financial advice. Do your own DD before investing. My position is 25 x 115c exp 17 Dec\n\n&amp;#x200B;\n\n[My Position in MU](https://preview.redd.it/j3r8voypht081.png?width=1415&amp;format=png&amp;auto=webp&amp;s=45e46a1d377890cf3b357cddf855a7cea3615167)\n\n**PM ME FOR SOURCES.**\n\nMU to the ~~MUn~~ moon!! 🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "What Is Micron Technology (MU) and Why Is It Trending?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qyf7fb/what_is_micron_technology_mu_and_why_is_it/",
        "created": 1637472373.0
    },
    {
        "author": "investortrade",
        "created_utc": 1635788576,
        "id": "qkjc8y",
        "num_comments": 64,
        "num_crossposts": 0,
        "selftext": "I was wondering was the community thinks about PayPal (PYPL) right now. I bought my shares and have averaged down, buying at $279, $258, and $241 with my cost basis now at $255. My total loss is 9.49% right now, but at least I'm selling some covered calls to make some premium. It's currently trading around $231 and I was thinking of maybe buying some more here to bring down my cost basis even further. If I didn't own PYPL at all right now, I'd be buying like crazy right now. But since I've already bought three times already averaging down, I'm not sure I should buy more again now. I'm only down about 4.4% from my last buy. If it got to -10% from my last buy, I would definitely buy more at that point. What are your thoughts on PYPL here and going forward over the next few months?",
        "subreddit": "stocks",
        "title": "Your thoughts on PayPal at current price",
        "url": "https://www.reddit.com/r/stocks/comments/qkjc8y/your_thoughts_on_paypal_at_current_price/",
        "created": 1635817376.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1636031615,
        "id": "qmka5l",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "Here are the final Parts 8-10, of an article addressing the main bear arguments on Paysafe.  Parts 1-7 covered Paysafe’s outlook on growth, debt, and profit, along with insider ownership and competition.  I recommend starting with the [introduction in Part 1](https://www.reddit.com/r/wallstreetbets/comments/qkg3i5/gaining_visibility_on_paysafe_psfe/) (Growth), and following the links from there if still interested.\n\n&amp;#x200B;\n\n# 8. Management\n\nAs part of Paysafe’s preparations for the next phase of growth, the company has undergone a complete management overhaul. Along with replacing nearly all the Board of Directors, in the last two years, they’ve hired a new CEO, new CFO, new CTO, new CIO, new CRO and new CISO. They’ve hired PayPal’s Chief Risk Officer and have also filled key division CEO positions with Facebook’s Head of Payments and Amazon Intl’s Head of Payments.  This does not sound like an operation with a passive outlook.\n\nStill, many are rightfully frustrated that management has done little publicly to support the share price since going public. Despite a steady supply of [positive news](https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes_value_creation_trajectory_is_very_much/), the CEO has not once meaningfully engaged the media to highlight Paysafe’s value story.  It may be that management is deliberately downplaying its messaging while shares move from short-term trader’s hands to those of value-seeking funds in order to better secure long-term share value.  Or, they are simply focused on producing the numbers.\n\nRegardless, what management may lack in public storytelling, it makes up for in execution. In the short time since they went public, they have announced 3 new acquisitions and over 25 expanded partnerships with the likes of [Visa](https://www.paysafe.com/en/paysafegroup/news/detail/skrill-usa-launches-skrill-virtual-visar-prepaid-card-in-us/), [Coinbase](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-issues-coinbase-s-new-visa-debit-card-enabling-easier-cryptocurrency-spending/), [Fubo Gaming](https://www.paysafe.com/eu-en/paysafegroup/news/detail/paysafe-streamlines-payments-for-interactive-wagering-with-fubo-gaming-in-us/), [FOXbet](https://www.njgamblingfun.com/nj/sports-news/paysafe-continues-its-push-into-online-gaming), [Golden Nugget](http://www.greensheet.com/newswire.php?newswire_id=53685), [Bankable](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-partners-with-bankable-to-provide-omnichannel-banking-services/), [Wix](https://www.pymnts.com/digital-payments/2021/smbs-can-accept-payments-with-paysafe-skrill-on-wix/), [Repay](https://www.repay.com/repay-partners-with-paysafe-to-enable-u-s-merchants-to-accept-online-cash-payments/), [WynnBet](https://www.electronicpaymentsinternational.com/news/wynnbet-taps-paysafe-for-payments-and-marketing-solutions/), [Betfred USA](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-expands-betfred-usa-sports-partnership-through-income-access-deal/), [OwnersBox](https://incomeaccess.com/contenthub/ownersbox-launches-affiliate-program/), [Dutch neobank bunq](https://www.paysafe.com/eu-en/paysafegroup/news/detail/bunq-partners-with-paysafe-to-enable-cash-deposits-for-digital-banking/), [IntelliPay](https://intellipay.com/paysafe-expands-us-partnership-with-intellipayto-offer-online-cash-payments/), Glory Ltd, Parx Interactive, TripGift, SweePay, SimplePayMe, [Smart Property Systems](https://globalfintechseries.com/banking/digital-payments/paysafe-partners-with-smart-property-systems-in-north-america/), Ambassador Cruise Line, Shelby Financial, ResponseCRM, ZEN, [Montana Lottery](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-powers-online-payments-for-montana-lotterys-sportsbook/), PlayUP, [SuperBook Sports](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-platform-launches-with-superbook-sports-in-colorado-and-new-jersey/) and [Bitrise](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-accelerates-innovation-with-bitrise-for-faster-digital-wallets-payments/).\n\nIn that same period, they’ve also:\n\n* expanded their US launch of digital wallet Skrill to [48 states](https://www.paysafe.com/en/paysafegroup/news/detail/paysafes-skrill-expands-its-crypto-service/),\n* expanded their digital wallets to [trade](https://www.paysafe.com/en/paysafegroup/news/detail/paysafes-neteller-launches-fiat-to-crypto-withdrawal-service/) 38 \\[digital\\]currencies and 40 global fiat currencies\n* launched online cash payments on Microsoft’s [Xbox](https://www.pymnts.com/news/payment-methods/2021/xbox-gamers-can-now-pay-with-cash-online-with-paysafe/) in 22 countries\n* struck deals with [Snowflake](https://www.atmmarketplace.com/news/paysafe-integrates-snowflake-to-power-cloud-based-approach-for-enhanced-customer-experiences/) and Amazon’s [AWS](https://www.electronicpaymentsinternational.com/news/paysafe-partners-aws-to-become-cloud-based-payments-provider/) to support its migration to a cloud-based platform as part of their strategy to scale quickly and leverage data to drive customer acquisition,\n* [launched](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-launches-safeguarding-model-for-the-travel-industry-globally/) a new global travel safeguarding model,\n* a unique innovation that quickly led to a new [deal](https://www.paysafe.com/eu-en/paysafegroup/news/detail/paysafe-and-arc-partner-to-deliver-innovative-payments-solution-for-airlines/) with ARC, a payment settlement service that processes $97 billion for over 200 airlines globally.\n\nAlso during this time, they announced the appointments of:\n\n* Digital wallet division CEO, [Chirag Patel](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-appoints-chirag-patel-to-lead-its-digital-wallets-division/) (fmr Head of Payments at Amazon Intl., Santander)\n* North American iGaming CEO, [Zak Cutler](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-appoints-zak-cutler-to-lead-its-north-america-igaming-business/) (fmr DraftKings exec),\n* Boardmember [Mark Brooker](https://fxnewsgroup.com/forex-news/executives/paysafe-appoints-mark-brooker-as-non-exec-director/) (fmr COO Betfair, non-exec dir. William Hill)\n\nAll that done while reporting a profitable quarter, beating on revenue and EPS consensus, reporting 41% total payment volume (TPV) growth, refinancing all debt for significant cost savings, after putting deals in place throughout North America to lead in any new iGaming market as soon as it opens (as just happened with their 100% positioning in Canada’s [newly opened](https://ca.news.yahoo.com/canada-legalizes-single-game-sports-191629457.html) sports betting market).  As Bill Foley said, “we’re seeding the future growth right now… The day a state opens up, we are there ready from a regulatory perspective, from a risk perspective, and from a product perspective…It’s our job to be there first and to make sure we dominate.”  They have not slept on this promise even as they quietly lay the groundwork to do the same thing in South America.\n\nLastly, major shareholder and Paysafe Chairman of the Board, Bill Foley has repeatedly proven himself to be a trusted and highly effective deal maker with a remarkably consistent track record in growing shareholder value.  Bloomberg describes Foley as someone who prides himself on operating experience, who has a known talent for corporate maneuvering and brings with him a full team of seasoned financial managers.\n\nThe types of acquisitions described in Part 1 are central to Paysafe’s “value creation playbook” which is exactly how Foley, grew FIS 36x from a market cap of $2.5 billion to over $90 billion. From the beginning of the deal to bring Paysafe public, Foley [said](https://www.paysafe.com/fileadmin/user_upload/Foley-Trasimene-Acquisition-Corp-II-and-Paysafe-investor-call-Final.pdf), “those characteristics of FIS are right in line with what we plan on doing with Paysafe... FIS has very similar characteristics to Paysafe – an attractive platform with a defensible market position. Upside from acquisition integration, platform consolidation and cross-selling. We will cross-sell, cross-sell, and cross-sell.”\n\nIn this context, it’s worth underscoring Foley’s undeniably history of simultaneously growing multiple companies.  Over just the last six years, Foley successfully grew Ceridian 3.3x, Dun &amp; Bradstreet 5.6x, and Black Knight 8.7x. He’s also known for growing Fidelity National Financial from $3 Million market cap to $10.8 Billion (3,600x). In all cases, he has significantly expanded their margins between 500 to 1800 bps. Foley said, “My whole history and career has been around acquiring companies and fixing companies.”  Though he’s not Paysafe’s front man, his fingerprints are evident and IR has recently assured that “  Bill is highly engaged with the company.” Personally, I don’t doubt it.\n\n&amp;#x200B;\n\n# 9. Lockup Expiration\n\nSome bears still point to PSFE overhang from lockups but all share lockups expired months ago, except for founder shares which constitute about 4% of outstanding shares ([20F p. 135](https://www.sec.gov/Archives/edgar/data/1833835/000119312521104105/d159702d20f.htm#toc)). That lockup is expected to expire in December. Personally, lockup expiry of such a small percentage of shares is not deterring me from continuing to build a position before Paysafe starts reporting better numbers. This is especially true when those shares are controlled by Chairman Foley, who is central to Paysafe’s value creation playbook. Between Foley’s consistent track record, the proxy statement below and Blackstone’s stance on future growth, all signs indicate a long-term hold.\n\nUpon approving the deal to bring Paysafe public, the founders identified “base returns for a four year hold period” of “2.9x to 3.8x” from $10.  \n\nFrom their proxy statement (SEC filing-[DEFM14A](https://pdf.secdatabase.com/2681/0001193125-21-060961.pdf)): “The Business Combination could provide base returns for a four year hold period assuming exit multiples between 20-25x next twelve month EBITDA, reflecting a range of internal rate of return of 30.9% to 39.2% and a multiple on invested capital of 2.9x to 3.8x, in each case, based on the FTAC initial public offering price of $10.00 per share, while recognizing that the achievement of such returns could not be assured, and that the Business Combination has similar characteristics to other transactions involving Mr. Foley in the financial technologies industry, including an attractive platform with a defensible market position and multiple attractive acquisition opportunities to strengthen market position further, each of which made PGHL an attractive investment for FTAC.”\n\n&amp;#x200B;\n\n# 10. Valuation\n\nPaysafe is building an integrated architecture that is worth more than the sum of its parts.  By leveraging an asset-light cloud-based model to efficiently scale up in new high growth markets globally, Paysafe is a perfect example of the low capex Fintech profile that generally warrants high valuation multiples.\n\nNow trading around 4x a conservative F2022 revenue with nearly every institutional owner’s cost basis 20-40% higher than the current price, it would appear PSFE is severely undervalued. Perhaps because Paysafe didn't go public via the traditional IPO method it is being lumped in with highly speculative pre-revenue ventures.  But Paysafe is anything but that.\n\nOr maybe the current low price is simply a reflection of broadly disseminated misleading information like the articles on debt quoted in Part 2 or like the several articles falsely claiming Paysafe went public at a 3x higher valuation above its 2017 take private price. Some articles claim this by mistaking British pounds for US dollars while a Yahoo Finance article claimed a \"300% higher\" valuation with bad math and a false comparison between enterprise value (inclusive of debt) and a misquoted 2017 market cap price of “$3.7 billion”, exclusive of debt.  Inclusive of debt (enterprise value), Paysafe was taken private for $4.7 billion, according to [Reuters.](https://www.reddit.com/r/PSFE/comments/qfopku/credit_suisse_revised_to_neutral_detail/)  To make its bear case, that article misquotes the relevant 2017 take private value by a full billion dollars.\n\nInitially, I wondered why just about every bearish article relied on faulty or misleading information to make its valuation case, or why so many platforms misreported PSFE’s financial data, like YF’s overstating a Q1 EPS miss as -0.23 EPS instead of -0.05 (fixed months later); or why does a [Credit Suisse analyst](https://www.reddit.com/r/PSFE/comments/qfopku/credit_suisse_revised_to_neutral_detail/) offer new price targets 4 times in 5 months with the first change just two days after initiating coverage and the last change, to neutral, just two weeks before Q3ER.  Instead of waiting a few days for new data highly relevant to his thesis, the analyst cites, as if Q2 were a new revelation, months old information most of which was available before he first initiated coverage. (Coincidentally, he issued this two minutes before pre-market, precisely when PSFE was on the verge of breaking above the confluence of its 9-month downtrend resistance line and the 50DMA).  Negligence or intentional price manipulation, take your pick.  Skeptics may cringe at this idea but this is really nothing new.  It’s not like the market is [unaware](https://www.sec.gov/tm/reportspubs/investor-publications/investorpubsanalystshtm.html) of analyst [conflicts of interest](https://web.williams.edu/Economics/Honors/2004/MSirignanoThesis.pdf) or that Credit Suisse has shown itself to be an upstanding market participant (think lawsuit for misleading investors on [Archegos](https://fortune.com/2021/07/29/credit-suisse-report-archegos-loss-bank-massive-culture-problem/), [$5.3B fine](https://www.cnbc.com/2016/12/23/deutsche-bank-and-credit-suisse-agree-billion-dollar-fines-with-us-authorities.html) for mortgage backed securities,[$2.5B fine](https://cn.reuters.com/article/uk-creditsuisse-investigation-idUKKBN0E00WM20140520) after pleading guilty for aiding in tax fraud, and the recent [$547M fine](https://www.justice.gov/usao-edny/pr/credit-suisse-resolves-fraudulent-mozambique-loan-case-547-million-coordinated-global) after admitting to regulatory breaches, secret loans, lying to authorities and spying on employees). On the other hand, this could be CS trying to clean up its act by playing it safe or an analyst trying to preserve his reputation by keeping price targets closer to market.  If so, this may have the flip-side benefit of future incremental upgrades.\n\nObviously, this is all conjecture, which really doesn’t matter in the long run.\n\nTrue price discovery will take form as share rotation plays out and Paysafe's value story becomes clear.\n\n&amp;#x200B;\n\nUntil then, here are a few reference points:\n\n&amp;#x200B;\n\nLooking at Paysafe’s eCash segment as a separate company:\n\nThe eCash segment is a high margin business with over 12 million active users, $5 billion in volume, $405 million in TTM revenue and $157 million EBITDA. For H1/21, they just reported 49.4% YoY revenue growth and 81.6% YoY EBITDA growth. Not many Fintech companies can claim that.\n\nAdyen is a Fintech with a similar growth profile, (46% YoY revenue growth and 27% YoY EBITDA growth). Applying Adyen’s 19x EV/rev ratio to Paysafe’s eCash business alone, would give it a $7.6 billion enterprise value. That’s close to the current valuation of the entirety of Paysafe, yet this one segment represents less than a third of total revenue.\n\nUsing Adyen’s EV/EBITDA ratio of 149x would value Paysafe’s eCash segment at $23.3 billion. Even when applying the company’s entire debt to that one segment, the share price for just the eCash business alone would still be $26.62.\n\nAgain, that represents less than a third of Paysafe’s total business.\n\n&amp;#x200B;\n\nBrick &amp; Mortar Payment Processing\n\nPaysafe is a value play right now but bears focus on growth.  Paysafe has an established history of 27-30% CAGR but because recent growth was temporarily stifled by China de-risking exits and Covid-related closures, some equally hard-hit brick &amp; mortar payment processing partners, like Visa and Mastercard, offer an interesting comparison.\n\nFor 2020, Visa reported negative YoY revenue growth (-8.7%) and negative EBITDA growth (-10.2%). Similarly, Mastercard reported negative YoY revenue growth (-9.4%) and negative EBITDA growth (-14.20%). Their forward growth is projected to be 7.7% and 10% respectively. \n\nIn all forward growth metrics, including EBITDA and EPS, they do worse than Paysafe, yet they both trade at an EV/Rev multiple of roughly 24X.  This would put PSFE at $41.80.\n\n&amp;#x200B;\n\nDigital Wallet vs. Digital Wallet\n\nMany compare the #1 digital wallet, PayPal, to the #2 digital wallet, Paysafe, so, hopefully without striking a nerve, here’s a deeper look into that comparison:\n\nAs noted earlier, Paysafe’s stock was recently clobbered down 30% (to 3.2x P/S) on soft Q3 guidance even though they reaffirmed full year guidance and beat consensus on revenue and EPS.\n\nBy comparison, PayPal missed Q3 guidance for both revenue and EPS. PayPal was also reported to be falling short on their 2021 full year guidance AND they missed on Q2 revenue consensus while also reporting a -23%YoY decline on EPS. PYPL only went down 10% (from a lofty 15x P/S) as news outlets characterized PayPal’s troubles as a “buying opportunity.”\n\nSome will reasonably say that’s because PayPal has such strong growth history but, from the time PayPal’s numbers were available separately from its parent eBay, 2012-2020, PayPal grew 17.8% CAGR ([$5.6b](https://en.wikipedia.org/wiki/PayPal) to [$21.5b](https://s1.q4cdn.com/633035571/files/doc_financials/2020/q4/Q4-FY-20-PayPal-Earnings-Release.pdf)). In that same period, Paysafe has grown 30.5% CAGR ([$169m](https://www.investing.com/analysis/optimal-payments:-still-at-discount-despite-ebitda-growth-137908) to [$1.43b](https://d1io3yog0oux5.cloudfront.net/_60f30e3ae06e5db5459655316a65dc97/paysafe/db/1111/9761/file/Supplemental+Financial+Information_+Paysafe+Limited_+Q1+2021.xlsx)).\n\nPaysafe reported 27%CAGR prior to 2020’s restructuring and, in just the last year, when excluding Paysafe’s 2020 de-risking exits, they reported 23% YoY growth for Q2 which is on par with PayPal’s recent report of 19% YoY growth. This comparative history serves only to show that Paysafe has a strong track record that should not be discounted.\n\nPaysafe is still priced as if it is a zero growth, pre-revenue speculative venture. Meanwhile, though some have called PayPal a “free cash flow machine,” Paysafe already generates proportionately more free cash flow than PayPal (25% FCF margin vs. 20% FCF margin).\n\nThere’s obviously more to this complex story but, for reference, below is PSFE potential share value when applying PYPL’s multiples (now 25% off highs) when factoring in all of PSFE’s potential acquisition debt and dilution:\n\n* PayPal’s EV/FCF ratio of 66.9X puts PSFE at $33.10\n* PayPal’s EV/EBITDA ratio of 44.3X puts PSFE at $24.90\n* PayPal’s Price to Sales ratio of 13.5X puts PSFE at $28.40.\n* PayPal’s EV/Rev ratio of 12.4x puts PSFE at $20.75\n* PayPal’s free cash flow yield of 1.7% puts PSFE at $29.41\n\nThose metrics average to a share price of $27.31\n\nWhen factoring in a potential 24% growth, 35% EBITDA margin, 75-80% FCF conversion, the potential share value climbs fairly quickly.\n\n&amp;#x200B;\n\nSector multiples:\n\nBecause Paysafe is far more diversified than the average Fintech, a while back I compared it to a wide basket of Fintech peers including PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, BILL, GPN, and Paysign. Collectively, they have a \\~12.5% growth rate. Unlike Paysafe, a third of this group reported negative free cash flow and negative EBITDA and half reported negative EBITDA growth. Paysafe also currently has better EPS and a better Debt/EBITDA ratio than over half the group.\n\nAfter removing the top-end outliers in each category that put PSFE above $100 and discounting all by an additional 10%, here’s Paysafe’s share price with the averaged peer multiples:\n\n* EV/EBITDA ratio : $45.67\n* EV/Rev ratio : $40.17\n* EV/FCF ratio : $39.72\n\nAverage : $41.84\n\n&amp;#x200B;\n\nIt's worth pointing out here that, as happened with FIS’s tremendous growth history, stock prices tend to temporarily pull back in association with acquisitions. This may explain some of PSFE’s recent price action, but certainly not all.\n\n&amp;#x200B;\n\nSure, it’s easy to read all of the material in Parts 1-10 and say, “the market doesn’t care,” but I’m confident that’ll change when share rotation settles and quarterly ER’s gradually shift focus from the past to the future.  Stripped of superficial misdirection, bear arguments often devolve down to variations of “look at the chart” and “price is truth.”  This has been said about many companies in the past as they position themselves for future growth.\n\nNo, this is not the next Amazon but Bezos had it right when he said, “The stock is not the company. And the company is not the stock. ... And so, while the stock price was going the wrong way, everything inside the company was going the right way.”\n\nDo with this what you will. These are simply observations. Feel free to correct any errors, point out things I missed or use this material any way you wish. To be perfectly clear, this is not financial advice. I am not a financial advisor nor am I associated in any way with any commercial interests beyond my own.  Given how much disinformation has been out there, I thought I’d do my bit to peel back the layers on what I consider to be a reliable long term investment.\n\n&amp;#x200B;\n\nThis concludes our public service announcement. We now return to normal programming.",
        "subreddit": "wallstreetbets",
        "title": "Gaining Visibility on Paysafe (PSFE) Parts 8-10",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qmka5l/gaining_visibility_on_paysafe_psfe_parts_810/",
        "created": 1636060415.0
    },
    {
        "author": "aqjingson",
        "created_utc": 1637266625,
        "id": "qwyk1h",
        "num_comments": 63,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Found out PYPL really stands for Pay Up Pal 💀",
        "url": "https://i.redd.it/8cbyq9lbwe081.png",
        "created": 1637295425.0
    },
    {
        "author": "BrownGaze",
        "created_utc": 1636891410,
        "id": "qtog7c",
        "num_comments": 62,
        "num_crossposts": 0,
        "selftext": "Asking from a certified DIS and PYPL bagholder, just curious to know how you deal with that stock that you think is gonna grow or moon and it ends up landing in the trash bin while others stocks take off.",
        "subreddit": "stocks",
        "title": "To all the bagholders - do you really believe/think in your stock picks?",
        "url": "https://www.reddit.com/r/stocks/comments/qtog7c/to_all_the_bagholders_do_you_really_believethink/",
        "created": 1636920210.0
    },
    {
        "author": "The_OG_Steve",
        "created_utc": 1637347553,
        "id": "qxmq4o",
        "num_comments": 61,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$PYPL to 180 next week",
        "url": "https://i.redd.it/wnpgjycell081.jpg",
        "created": 1637376353.0
    },
    {
        "author": "Slaxle",
        "created_utc": 1635801076,
        "id": "qknxjw",
        "num_comments": 57,
        "num_crossposts": 0,
        "selftext": "I want to hear your bear case scenarios for PayPal: \n\nhttps://www.google.com/amp/s/m.investing.com/analysis/paypal-cautiously-optimistic-on-the-stock-ahead-of-earnings-200606945%3fampMode=1\n\n\nI'm considering going all in on this stock, all it's fundamentals seem good. P/E, valuation and institutional ownership all appear to be the same even though the stock is 40% short of it's ATH. Analyst price targets are high. PayPal itself has established a reliable history and has stronger fundamentals then competitors. \n\nI don't see how this stock won't be a winner in the future.",
        "subreddit": "stocks",
        "title": "The Bear Case for Paypal",
        "url": "https://www.reddit.com/r/stocks/comments/qknxjw/the_bear_case_for_paypal/",
        "created": 1635829876.0
    },
    {
        "author": "wsb202009",
        "created_utc": 1636996140,
        "id": "qul65y",
        "num_comments": 56,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "PYPL - Long YOLO",
        "url": "https://i.redd.it/megum8bbksz71.png",
        "created": 1637024940.0
    },
    {
        "author": "forzan",
        "created_utc": 1636741162,
        "id": "qshbxw",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "#What happened\n\n[$PSFE had some particularly shitty Q3 earnings on 11/11](https://finance.yahoo.com/news/paysafe-reports-third-quarter-2021-115900850.html). Earnings were reported before open, and the stock value nearly halved, from $7.28 -&gt; $4.16  in the first thirty minutes of trading.\n\n#What the fuck is a Paysafe\n\nPaysafe is basically Paypal/Venmo for non-Americans. They sell 'payment processing solutions.' The shit is really boring and you can look at the PDFs on their website if you really care. They're a transaction middle man that sells stuff to businesses for charging money to people, and they have a digital wallet (like Venmo) that they want people to use for transactions. The digital wallet is where they expected most of their revenue growth to come from this year.\n\n#Why earnings sucked\n\nIn the earnings report, it looks like they're losing money -- the company listed a net loss of $147.2M. However, that includes a $322.2M loss from the company devaluing their digital wallet business. That means the accountants just decided something they owned was worth less money than the value they originally made up -- so they made up a new number -- and put the difference as a loss on their earnings sheet.\n\nThey technically made $106.4M cash profit in Q3. However, the value of their digital wallet business they claimed in previous quarters was actually a complete fugazi. That's spooky shit for investors. But fundamentally, accounting on earnings reports is just smoke and mirrors anyway -- you're stupid if all you're looking at is EPS.\n\nThen, as a fucking cherry on top, the CFO said they're going to make a smaller revenue and profit than they originally planned for at least the next year. (yikes) He did an AMA on Twitter though, and made some solid arguments for why the company could still pull some interesting shit off. (meh)\n\n#Analysis\n\nWhat you're witnessing on the price drop isn't people running from a company losing money -- $PSFE makes steady profits -- what you're witnessing is investors bailing from what they though was a growth company. The promise of growth dried up.\n\nThis isn't a potential downward spiral into bankruptcy like $WISH or $NKLA. It's just a boring company with $1.5B of annual revenue and $400M of annual profits if they don't start flexing harder. Frankly, value is there, and the growth potential still exists (if they get their shit together).\n\nMore importantly, the IV is fucking retarded right now because of the drop. You can turn this into a pretty easy theta play by buying a discounted stock and selling covered calls to idiots that think a squeeze is coming.\n\nThere is no evidence of this bEiNg AnOtHer ShOrT sQueEze, it's more likely some large institutions bailed when they realized this thing wasn't a growth stock -- and their portfolio required a growth stock. However, if you're a conspiracy theorist, buy and hold I guess.\n\n#Positions:\nThis isn't a yolo or a profit thread, it's DD \nbut:\n2,500 shares @ 4.28\nSelling OTM FDs for dumb prices",
        "subreddit": "wallstreetbets",
        "title": "$PSFE is a good theta play",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qshbxw/psfe_is_a_good_theta_play/",
        "created": 1636769962.0
    },
    {
        "author": "RomeoinA",
        "created_utc": 1637202859,
        "id": "qwfit8",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "So I’m waiting to join the party with PYPL and these guys come and downgrade the stock. Like a coitus interruptus, don’t tell me that they weren’t waiting to watch it start flying like it was during the past week.\n\n220$ they say, with all their math and analysis and knowledge. I don’t believe them though. But either if is that or 260$ now my question is how much will this drop if it will keep dropping. \n\nAny thoughts?",
        "subreddit": "stocks",
        "title": "PYPL - Dropping more?",
        "url": "https://www.reddit.com/r/stocks/comments/qwfit8/pypl_dropping_more/",
        "created": 1637231659.0
    },
    {
        "author": "InvestigatorFree697",
        "created_utc": 1636510617,
        "id": "qqjn27",
        "num_comments": 54,
        "num_crossposts": 0,
        "selftext": "Anybody else thinking about buying some OTM calls on PYPL, longer dated? Their revenue still rose 13% and the deal with Amazon seems pretty good.",
        "subreddit": "options",
        "title": "PYPL Options",
        "url": "https://www.reddit.com/r/options/comments/qqjn27/pypl_options/",
        "created": 1636539417.0
    },
    {
        "author": "buddyboh12",
        "created_utc": 1636329477,
        "id": "qp19a6",
        "num_comments": 52,
        "num_crossposts": 0,
        "selftext": "I've been trying to post this for the past hour, but automod keeps removing my post to no avail, so I'm stripping it clean and giving you all the raw version. In hindsight, this post will contain too few characters thereby getting removed once again, but I am a broken man willing to try one final time. I hope this makes it to you all, enjoy!\n\n&amp;nbsp;\n\nThe spreadsheet containing all of the historical post earnings moves can be found [here.](https://docs.google.com/spreadsheets/d/1BysxbNDCeUhukPrkM7rwv-mg10e_wIIqkHonMJikEcs/edit?usp=sharing)\n\nMy weekly earnings analysis can be found [here.](https://www.hungrybotalerts.com/blog/historical-post-earnings-moves-w5q3)",
        "subreddit": "wallstreetbets",
        "title": "Historical Post Earnings Moves MEGA Compilation AND Analysis (Q3 Week 5) - $CLOV, $PLTR, $SPCE, $PYPL, $DIS, $NIO, $UPST and More",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qp19a6/historical_post_earnings_moves_mega_compilation/",
        "created": 1636358277.0
    },
    {
        "author": "RetailLemming",
        "created_utc": 1637556474,
        "id": "qzdb4n",
        "num_comments": 49,
        "num_crossposts": 0,
        "selftext": "On 10/21/21, after $PYPL dropped \\~10% to 246 on adverse PINS news, I sold a 30 day (11/19) exp 190/200 vertical credit put spread on $PYPL so I could have a steak this weekend instead of cat food. The 200 short put was -1.6 sigma (19%) OTM. Kept it to exp when $PYPL closed at 193.61, another -21% price drop. What a dog for 30 days. WOOF!  Broke my assignment cherry with a 3% starting loss. No steak, but 100 sh $PYPL (granted, at a 29% discount from recent high). So is there still more downside to $PYPL for god knows why that I should protect (??), or bail? Or start rolling short calls with the stock on the way back up? Short risk reversal with stock rolling calls up? Stagflation or recovery/spending?",
        "subreddit": "options",
        "title": "Has $PYPL bottomed?",
        "url": "https://www.reddit.com/r/options/comments/qzdb4n/has_pypl_bottomed/",
        "created": 1637585274.0
    },
    {
        "author": "snowmail-",
        "created_utc": 1637194197,
        "id": "qwcqk9",
        "num_comments": 48,
        "num_crossposts": 0,
        "selftext": "So, PayPal.\n\nAs some may have seen the last couple weeks PayPal's stock price has been on a down trend since the announcement of the Amazon partnership with Venmo (which PayPal owns). This will come into effect in early 2022. I really don't see too much of a downside to this, Venmo has been supporting cryptocurrencies just this year and I see this as a direct line for amazon purchases to be paid via cryptocurrency. And if we keep seeing adoption rates rising then this could be a huge play for PayPal to hold the advantage over Affirm and other payment platforms.\n\nOkay, Q3 Earnings.\n\nFor this quarter, we see an income increase of only 6% over Q2, 1.02b to 1.08 b. Net revenue increase of 13%, $5.4b to $6.2b, long term debt is down roughly $1 billion as well from Dec 2020. Total Liabilities was up 2b, mostly in accrued expenses and funds payable to customers. As a whole, PayPal's debt came to $52 billion, and with annual revenue at $21.4b this is a tad concerning. Free cash flow increased 19%, and this year PayPal also increased spending in marketing and technology/development while decreasing spending for administration, so take this as you will.\n\nNet new active accounts has fallen since last year by 12%. But, total payment volume since last year rose from $247b to $310b Number of payment transactions has also increased by about the same value (4%), but I see this increasing in Q1-Q2 of next year with Venmo partnering with Amazon. So as a whole there is strong customer engagement and a growing balance sheet.\n\nNow, future outlook.\n\nPaidy, a Japanese two sided buy-now, pay-later platform closed in October, so PayPal is looking to expand in Japan. This is big as Japans e-commerce is third ranking in the world. Along with this PayPal looks to develop more in app purchasing and expansion in various cryptocurrencies.\n\nRecently there has been a lot of stirring in the news about PayPal needing to take a defensive stance against companies like Shopify, Affirm, and other BNPL services. On top of this Bernstein analysts downgraded their stock from a \"buy\" to \"hold\". The headlines defiantly resonated poorly with stock price, now down roughly 4%.\n\nConcluding this little deep dive I find it hard to believe that PayPal will be a roll over in the next two to three years, as they are one of a few market leaders in their sector. In my opinion the nose dive in stock price is somewhat of a knee jerk reaction, and PayPal is now in a nice place to buy in.\n\nI'm also curious where everyone's opinion is regarding PayPal.\n\nThanks for Reading.\n\nSources:\n\n[https://s1.q4cdn.com/633035571/files/doc\\_financials/2021/q3/Q3-21-PayPal-Earnings-Release.pdf](https://s1.q4cdn.com/633035571/files/doc_financials/2021/q3/Q3-21-PayPal-Earnings-Release.pdf)\n\n[https://www.cnbc.com/2021/11/17/paypal-shares-drop-after-bernstein-downgrades-stock-.html](https://www.cnbc.com/2021/11/17/paypal-shares-drop-after-bernstein-downgrades-stock-.html)\n\n[https://www.marketwatch.com/story/paypal-now-risks-gettingdisrupted-by-competitors-analyst-says-in-downgrade-11637160014](https://www.marketwatch.com/story/paypal-now-risks-gettingdisrupted-by-competitors-analyst-says-in-downgrade-11637160014)",
        "subreddit": "wallstreetbets",
        "title": "PayPal Deep Dive and Quantitative Analysis",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qwcqk9/paypal_deep_dive_and_quantitative_analysis/",
        "created": 1637222997.0
    },
    {
        "author": "MarketMastered",
        "created_utc": 1636474073,
        "id": "qq6xpd",
        "num_comments": 46,
        "num_crossposts": 0,
        "selftext": "PYPL is a strong buy. 30% down from average yearly price, currently sitting below the average price paid this entire DECADE. IT is 25% down from the 200 [EMA](https://www.tradingview.com/ideas/ema/) , in the entire history of paypal it has never been this low relative to the 200 average. Which means unless you think they are bankrupting you will never get it cheaper to the average price than you can within the next few days. This is an easy buy. Current fair price is $260. Fear mongering for cheaper tute shares. Don't listen to donkey brain bears who started trading this year. Not financial advice. but you know, to the moon lol. \n\n[https://www.tradingview.com/chart/PYPL/1xn0gxg0-PYPL-cheaper-relatively-to-average-price-than-it-has-ever-been/](https://www.tradingview.com/chart/PYPL/1xn0gxg0-PYPL-cheaper-relatively-to-average-price-than-it-has-ever-been/)",
        "subreddit": "wallstreetbets",
        "title": "PYPL to the moon or at least it's previous price",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qq6xpd/pypl_to_the_moon_or_at_least_its_previous_price/",
        "created": 1636502873.0
    },
    {
        "author": "Clambucket1",
        "created_utc": 1636404439,
        "id": "qpmsw0",
        "num_comments": 45,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "earnings szn - $PYPL 46k yolo",
        "url": "https://i.redd.it/yuhripoxofy71.jpg",
        "created": 1636433239.0
    },
    {
        "author": "FalconPunchT",
        "created_utc": 1635895542,
        "id": "qlh6e4",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": " \n\nRecently started eying the stock market and these 2 caught my eye. Both are good looking companies that fell by 30% after the hype died down. What are the chances of them going back up to the same numbers ? And how long would that take on average ?",
        "subreddit": "stocks",
        "title": "How are V(Visa) and PYPL(PayPal) looking",
        "url": "https://www.reddit.com/r/stocks/comments/qlh6e4/how_are_vvisa_and_pyplpaypal_looking/",
        "created": 1635924342.0
    },
    {
        "author": "NY10",
        "created_utc": 1637158471,
        "id": "qw06b3",
        "num_comments": 44,
        "num_crossposts": 0,
        "selftext": "As title says, all of above stocks is associated/related in the financial sector. These are getting hit hard lately and I think it might be a good time to buy the dip. All of them looks pretty solid in the long term and offers a decent growth.\nIf you have to pick one stock to invest above then what is your pick? why?",
        "subreddit": "stocks",
        "title": "V vs. PYPL vs. GPN",
        "url": "https://www.reddit.com/r/stocks/comments/qw06b3/v_vs_pypl_vs_gpn/",
        "created": 1637187271.0
    },
    {
        "author": "liberalvisa",
        "created_utc": 1636503835,
        "id": "qqhexw",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": " **BUY PayPal stock now**\n\nPayPal (NASDAQ:PYPL) price was beaten down after a series of events and yesterday the CEO has delivered a weak guidance despite announcing the partnership with Amazon. They are well established, and they have a solid track record with big growth potential. With the current price, it offer investor a better opportunity to enter into the stock and potentially to buy at a lower price.\n\n**Lets take a look at PayPal (NASDAQ:PYPL)**\n\n**Financial Health - no issue**\n\nLiabilities - debt to equity ratio of 42.8% (Total debt 8,945 Million / Total Equity 20,905 Million) as at June 30, 2021. *As interest rate is low, it is an excellent strategy to take on more debts to have more rooms for business expansion.*\n\nDebt Coverage - PayPal is well covered by operating cash flow (64%)\n\nInterest Coverage - PayPal's interest payments on debts are well covered by EBIT (24.7x coverage)\n\nCash &amp; Short term investments USD$12.4 billion\n\n**Earnings - Positive Earning Trend**\n\nTheir profit margin have been growing from 5.2% in year 2014 to 20.4% in year 2021. They have grown significantly by an average of 25% per year over the past 5 years.\n\nHigh ROE - 23.3% (ROE indicates how well a company's management deploys shareholder capital).\n\n**Ownership breakdown**\n\nInstitutions make up 82% of majority of ownership and general public of 17.9% . Big institutional / fund house such as Vanguards, Blackrock, state street global advisors are the top shareholders holding majority of the shares.\n\n**Future - Partnership with Amazon**\n\nPayPal said it had inked a deal with Amazon to allow the firm’s Venmo wallets in the U.S. to be accepted on Amazon’s website and mobile app starting next year. Amazon being the largest e-commerce in the world, has **300 million active users** as of (1 November 2021) and **162 million active users** are from US. Due to Amazon’s global scope and reach, it is also considered one of the most valuable brand worldwide. This also means that PayPal got to access to Amazon users and the payments can be done through PayPal's Venmo wallets. This is going to be the biggest revenue source going forward.\n\n**Digitalization - convenience is part of us now after Covid19**\n\nEven economies are re-opening, we are every much used to digitalization where we find convenience in purchasing groceries and items online. Even the economy are open, my family and I still find these habits are to stay, we don't physically go to the stores and pick up items that often because I find (1) the prices online are usually more competitive, (2) I do not need to carry large bulky items home (3) whatever I sees in the stores, I will be able to buy online, so if I am not in a rush, I will still get my items online. My family did the same too.\n\nWith Covid19, it had sped up our pace of digitalization, the baby boomer and generation X who are usually not good with computers and mobile applications are forced to use online payments to minimized human contact. Once they got hold of it, the habits are to stay. My mother had learnt to order Amazon Prime for groceries have been very happy with it, she commented that she got competitive prices like other supermarket, and most importantly, the groceries are delivered right to the doorstep without her going out and carrying the items home which she had to persuade my brother to go with her to help her in carrying. Even economy are opening up, she is still going to continue to do that as she had found the conveniences and comfort of online shopping. And prior to Covid19, even amazon prime was around, she had refused to learn to shop online.\n\n**Forward guidance Vs potential**\n\nI will think the forward guidance from the CEO, Dan Schulman, is an overstatement. He is trying to manage expectations but it came out badly. But as well, it has presented us an opportunity to get the PayPal as the potential is huge.",
        "subreddit": "ValueInvesting",
        "title": "BUY PayPal stock now",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/qqhexw/buy_paypal_stock_now/",
        "created": 1636532635.0
    },
    {
        "author": "KGisTop15All_Time",
        "created_utc": 1635863359,
        "id": "ql5gav",
        "num_comments": 43,
        "num_crossposts": 0,
        "selftext": "PayPal has been slumping ever since previous highs from earlier this year and has not been following the market lately. I think they’ve had something like 9 red days in a row. I know they barely missed on Q2 earnings this summer but I didn’t expect this much of a drop. It’s slowly pushing toward $220s range after eclipsing $300 earlier this year. The FinTech industry has slowed this year, but Square has held much better than PayPal. Thoughts?",
        "subreddit": "stocks",
        "title": "What’s going on with PayPal (PYPL)?",
        "url": "https://www.reddit.com/r/stocks/comments/ql5gav/whats_going_on_with_paypal_pypl/",
        "created": 1635892159.0
    },
    {
        "author": "liberalvisa",
        "created_utc": 1637171383,
        "id": "qw4rx7",
        "num_comments": 41,
        "num_crossposts": 0,
        "selftext": "**Paypal (NASDAQ:PYPL)**\n\nPaypal after dropping from 310.16 from the high. Now seems to be a good potential for averaging in. At this price Paypal seems to be extremely attractive. Paypal is a well establish company with a huge capital market cap of US$253.4 Billion and it is listed in 11 stock exchanges. \n\n**Stable Growing Profit Margin** \n\nProfit Margin as of 30 sep is 20.1% and they have been growing significantly by 26.8% per annual over the past 5 years. \n\n**Healthy Financial** \n\nDebt to Equity ratio is 40.5% ( Total Debt 8947 million to  Total Equity 22,090 million) \n\nThe debt are well covered by operating cash flow (66.2%) \n\nInterest Payments are well covered by EBIT (24.7x) \n\n**Business is on the right track** \n\n**Partnering with Amazon** \n\nPaypal is on the right track on tieing up with the trillion market cap giant - Amazon on the Venmo payments, which will enable the e-commerce giant to start accepting Venmo payments in 2022. Venmo is already a peer-to-peer payments leader with over 80 million customers, but it's facing tough competition from Square's Cash App, which surpassed 70 million annual active users earlier this year. Partnering with Amazon will generate fresh tailwinds for Venmo and help the service maintain its narrow lead. \n\n**Cryptocurrency** \n\nThey are on cryptocurrency business too. \n\n**PayPal's user base continues to grow**\n\nPayPal ended the third quarter with 416 million active accounts, and its total payment volume (TPV) hit $310 billion. Those core metrics, along with its total revenue, have consistently grown by double digits year over year. \n\nDuring the earnings call, CEO Dan Schulman said PayPal still remained \"quite confident\" in its goal of hitting 750 million active accounts in 2025. That target, which supports another goal of generating more than $50 billion of revenue by that same year, implies its active accounts will increase at a compound annual rate (CAGR) of nearly 15% over the next four years.\n\nThat expansion relies on the ability of PayPal's new \"super app\" -- which bundles together a digital wallet, a savings account, peer-to-peer payments, bill payments, direct deposits, cryptocurrency services, BNPL (buy now, pay later) services, and other offerings -- to lock in its users, widen its moat against rivals like Square, and reduce its churn rates.",
        "subreddit": "wallstreetbets",
        "title": "Cheap Stocks to BUY for now",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qw4rx7/cheap_stocks_to_buy_for_now/",
        "created": 1637200183.0
    },
    {
        "author": "B_b__",
        "created_utc": 1636250830,
        "id": "qoetrt",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": "\n[Easy read for Apes 🦍](https://investors.abcellera.com/events/default.aspx)\n\nHolding 200 shares and 50 call options. Earnings November 9th.\n\nAI driven discovery process, the possibilities are endless, large cash sums. \n\nPeter Theil is one of big board members, same one from PYPL and PLTR. \n \nUnusual short volume occurred Friday from Dark pools, perhaps the shorts are trying to keep the price movement down, fearing upward trend after good earnings. It was 1.7 million versus average 50-70k short volume. \n\nMost analysts rate the stock a buy, pricing it 30-55 dollars.  I’m holding mine for long term. \n💎 🙌",
        "subreddit": "wallstreetbets",
        "title": "Is $ABCL $TSLA of Pharma world?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qoetrt/is_abcl_tsla_of_pharma_world/",
        "created": 1636279630.0
    },
    {
        "author": "Jerome_BRRR_Powell",
        "created_utc": 1637116114,
        "id": "qvoqlf",
        "num_comments": 38,
        "num_crossposts": 0,
        "selftext": " \n\nI would like to introduce you to a company that me and some fellows have been bag holding (in the red) for a while.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/o01aea0zg2081.png?width=1811&amp;format=png&amp;auto=webp&amp;s=9b1c2ff27d98e97fadffb57f7ac6e47fe697f5de\n\n&amp;#x200B;\n\nhttps://preview.redd.it/0tbh460zg2081.png?width=515&amp;format=png&amp;auto=webp&amp;s=e2a9b37a3ca822dfcab595c03876e864a4ec0b20\n\nMe - Bagholder of Warrants @ $4.0\n\nPayoneer vs PayPal\n\n&gt;*Payoneer, the Paypal for Shithole Developing Countries*\n\nPayoneer is Paypal for B2B global commerce, particularly outside North American and Europe. The company provides B2B services for millions of SMB and enterprises around the world\n\nThe growth of Payoneer’s global network included a move into India in April 2016, following a partnership with Pune-based IndusInd Bank and expressions of interest in its services from more than 10,000 freelancers and small businesses across the country.\n\n2018 PayPal study suggest that India’s freelancers represent around one quarter of the world’s gig workforce.\n\n**In August 2019, Payoneer announced a year-on-year increase of 400% in its customer base and a threefold increase in payment volumes processed in India.**\n\n*“PayPal says to shut domestic payments business in India” \\~ Reuters*\n\nNEW DELHI (Reuters) - PayPal Holdings Inc will wind down its domestic payments business in India from April 1,2021 the company said in a statement on Friday.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/hhza5041h2081.png?width=1743&amp;format=png&amp;auto=webp&amp;s=68e6bf53ca2bac7703919dbfab86bacbc49c0e89\n\nhttps://preview.redd.it/x0b8v621h2081.png?width=1759&amp;format=png&amp;auto=webp&amp;s=bb18aeaaf2806e2c0123eff083901b6b53691b5b\n\nThe ideal customer is a small but growing SMB doing business all over the world which needs currency, compliance and business services. Payoneer is an obvious candidate to handles these needs given its global network.\n\n· Payoneer offers vendors the ability to move money with a U.S. bank account and pay suppliers, without having to deal with too many banking hurdles or red tape.\n\n· A lot of freelancers on Upwork.com use Payoneer because many of them live in countries that Upwork.com can't wire money to.\n\n· Once vendors receive funds into their Payoneer account they can either withdraw the cash using their Payoneer provided Master Card or do a direct bank transfer from Payoneer to their local bank. Usually funds arrive within 1-2 business days.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/okzrve92h2081.png?width=1764&amp;format=png&amp;auto=webp&amp;s=c61bd06737a159941b6f9f26d96255fc497029c7\n\nSo, it is basically a bank that includes an accountant to help meet a business’ needs. The one product or feature that is missing is digital coins.\n\nSay a consumer wants to rent an airbnb. They use a credit card (or other payment method) to pay airbnb, a payment gateway facilitates payment acceptance. The payment is then processed and Airbnb ends up with the money from the transaction. Airbnb has now gathered cash through its acquirers (e.g., Adyen, ACI). Airbnb now needs to distribute funds to its SMB sellers. Airbnb uses payoneer to disburse funds to sellers. From this example, you can see Payoneer isn't competing with companies like Adyen or other acquirers/ processors, even though they are processing payments.\n\nPayoneer signs up individual sellers, which allows the sellers to use payoneer across platforms (e.g., facebook marketplace and amazon). Hyperwallet (owned by PayPal) is one of their competitors, but Hyperwallet operates completely differently, they sign up users via the platform, but this means you can't use hyperwallet for your business on both amazon and fb marketplace without going through the onboarding process again. Given the trend towards SMB sellers operating across multiple marketplaces, this is a huge benefit for payoneer, and makes PayPal's offering a lot less competitive. It also means Payoneer owns the seller relationship in a way that PayPal doesn't do as effectively, and makes it easier for them to package other offerings (e.g., working capital). These other offerings provide a two-fold benefit - their customer relationships become stronger, so revenue is seen as more recurring and investors will pay a higher multiple; and they'll make more money per customer.\n\nMy view is that Payoneer should see an S-type growth curve, where they'll hit a critical mass of users and see exponential growth, like cashapp, or venmo. Their investor presentation projects 25% revenue growth over the next couple years, I think this is super conservative, especially considering that 25% growth rate doesn't account for the two travel related marketplaces that got screwed by covid. Once they hit that critical mass of users, they'll pop off, sales &amp; marketing expenses will drop, and they'll become profitable.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/h4bl85z2h2081.png?width=1556&amp;format=png&amp;auto=webp&amp;s=70d883ab62f7fb8a486f106a561fb6b927009211\n\nThe company’s focus on investing for future services is actually what gets me most excited as it may ward off near-term investor interest and improves its competitive position. It’s also a sign of a mature management team. The opportunity to provide additional services such as working capital, compliance and tax services seems like an obvious strategic move to drive growth. Specifically, working capital is far and away the most important service and something SMBs are desperate for.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/r6mxf5e3h2081.png?width=1664&amp;format=png&amp;auto=webp&amp;s=b56c5ccf853698f4f9ded9ecff758e2235e20180\n\nWho are their customers and where are they know? 5 million businesses in 190 countries. Customers include Amazon, Wish, Lazada (owned by Alibaba) Shopee, and Ebay. Weird right, they work with Ebay given Paypal does too. This is because they work with countries and specific clients that Paypal not accept into their platform. Investors need to understand that sometimes people have to use other platforms because they the Paypal’s or banks are NOT willing to take the risk. Sure the risk is probably higher but the amount of people that need access to capital or payment process is high when many banks in many countries do not approve people for such type of access.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/bt75qez3h2081.png?width=1631&amp;format=png&amp;auto=webp&amp;s=16c8e2fe383ce420e3c7a435f414ce4a74f599fd\n\nB2B global marketplace. The attractiveness of FinTech can be summarized in a few words, namely, “scale” and “network effects”. From the metrics Payoneer shared, it looks like they’re benefitting from these dynamics. Analysts estimate the global B2B market at tens of trillions $ and cross-border payments at $300bn. Obviously the pandemic only accelerated these trends. (From the presentation, it looks like company B2B AR/AP volume more than doubled at 140% in 2020 although the CFO later cited a 53% increase in volumes so not sure exactly how to interpret that.)\n\nVolume and customer growth drives revenues. Volumes grew over 53% in 2020 (67% adjusted for the pandemic) and are expected to grow at 44% and 33% in 2021 and 2022, respectively, which translates into 25% annual revenue growth per year for the next two years.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/ez48k0d4h2081.png?width=1721&amp;format=png&amp;auto=webp&amp;s=a58e917de3a963c384df9a7c6075f317d4539789\n\nThe benefits of network effects cannot be overstated as Paypal has proven. As a company acquires more customers, the value of its network increases. Payoneer’s business model leverages this same dynamic. Moreover, its network would be very difficult to replicate. The company’s global platform includes over 80 banks and clearing partners in over 100 countries. The company also provides customers data about its transactions, which I believe will be increasingly useful and sticky.\n\n&amp;#x200B;\n\nhttps://preview.redd.it/fbqvrzp4h2081.png?width=1797&amp;format=png&amp;auto=webp&amp;s=0b11294b0e932cc3737f7a0dba4788d382fc59e9\n\nWhat do I think the future holds for Payoneer? I actually think there are several exits for this company.\n\n**Growth:**\n\nNote that Payoneer currently doesn’t do B2C, hence it may be quite common for retail to never even have heard of it, unless they are a business or in the gig economy. That is one of the problems for the stock, no one has heard of it (yet) because it works quietly behind the scenes. Given enough funding, who knows, Payoneer may well expand to B2C. Alibaba initially started as B2B as well but has since expanded to B2C (Taobao).\n\nWe just need Payoneer to be 5% of PayPal (ie. $15B market cap) in order for stock price to be in the $30-$40 range. ($6B market cap corresponds to around $13-$15 stock price.)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/mdrd9h35h2081.png?width=1748&amp;format=png&amp;auto=webp&amp;s=141ff8aaf50438f69846e1cdf874a66a59c8fc8f\n\n\\*\\*Acquisition:\\*\\*Large international payments processer buys them. Could be Paypal, Square, Stripe, First Data, etc. consolidation WILL happen in this space and I think short-term Payoneer will acquire some companies and then be sold to a bigger company. Think of this as how banks in the USA were allowed to merge in 1995 given the law that passed. Before you had 100,000 banks then it was 50,000 banks, then 10,000 banks and now like 5,000 banks but the top 10 banks make up a large % of the business/volume.\n\nWildcard: CRM business buys them. What many people do not realize is that CRM’s have been changing the game. First it was to help you sell with marketing tools, then it is to improve communication within the team, then it will be storage, and legal transactions then it will be financial transaction. They are literally going to control the beginning to the end of the customer relationship and all of that data they possess is very valuable to help their customers grow.\n\nThis is not financial advice, i am not a financial advisor. I have a long position with the warrants that i purchased in February and are therefore in the red.",
        "subreddit": "wallstreetbets",
        "title": "Payoneer (PAYO) - Emerging Markets are BACK!",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qvoqlf/payoneer_payo_emerging_markets_are_back/",
        "created": 1637144914.0
    },
    {
        "author": "consciousnes5",
        "created_utc": 1637224200,
        "id": "qwlben",
        "num_comments": 37,
        "num_crossposts": 0,
        "selftext": "PayPal Holdings, Inc. (NASDAQ:PYPL) Director John J. Donahoe bought 9,780 shares of the stock in a transaction on Tuesday, November 9th. The stock was purchased at an average price of $204.42 per share, for a total transaction of $1,999,227.60. The transaction was disclosed in a filing with the Securities &amp; Exchange Commission, which can be accessed through this link.\n\nInsider buying means insiders know that the stock will go up, why else would they buy and who better to know if a stock to go up more than an insider.",
        "subreddit": "wallstreetbets",
        "title": "Insider Buying: PayPal Holdings, Inc. (NASDAQ:PYPL) Director Purchases 9,780 Shares of Stock",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qwlben/insider_buying_paypal_holdings_inc_nasdaqpypl/",
        "created": 1637253000.0
    },
    {
        "author": "Artivist",
        "created_utc": 1636063771,
        "id": "qmw1jo",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "PTON allowed me to more than double my HSA account. I was long since it was in the 40s pre pandemic and went all the way to 150+ within a year. It's a great product with an extremely high user satisfaction. They ran into the same problem as Tesla where the supply couldn't keep up with the demand. Plus, a big part of their revenue is subscription. \n\nSo, when it was hovering around 80, I got in thinking it was a steal. However, I made sure to minimize my risk as much as I could. So, I kept stop loss just below a strong support or previous resistance (over a longer time period). And, if the price went up I would move my stop loss higher. \n\nYes, there is a risk that stop loss can get triggered frequently, but I'm more than happy to sell it than be a bag holder. Today, PTON dropped 28% after earnings. My stop loss got triggered right before the big dump. Saved me a few grand. And, this is not the first time. I have had my stop losses triggered on BABA, NIO, PYPL to name a few. Meanwhile, I have had great success on others like AFRM. \n\nTo conclude, it's not worth getting lazy and hope for the best. Take active control over your YOLO trades.",
        "subreddit": "wallstreetbets",
        "title": "Stop loss. Use them. Saved me over 25% today on PTON.",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qmw1jo/stop_loss_use_them_saved_me_over_25_today_on_pton/",
        "created": 1636092571.0
    },
    {
        "author": "cclagator",
        "created_utc": 1636316886,
        "id": "qox1xa",
        "num_comments": 35,
        "num_crossposts": 0,
        "selftext": "### The Broader Markets\n\n**Last Week –** **SPY** was higher by about 1.7% (or $7) last week, more than the 1% move options were pricing.\n\n**This Week – SPY** options are again pricing about a 1% move (or just less than $5 in either direction) for the upcoming week. With the SPY about **$468**, that corresponds to just above **$473** on the upside and around **$463** on the downside.\n\n**Implied Volatility** – The VIX ended Friday around 16.50, up slightly from the week before and up a bit to end the week from lows it saw under 15 mid week. The VIX remains below its historical average entering this week.\n\n**Expected Moves for This Week** (via Options AI)\n\nOptions are pricing similar market moves this week than they priced last week. Here are the expected moves for the week in the major ETFs:\n\n* SPY **1%**\n* QQQ **1.5%**\n* IWM **2.0%**\n* DIA **1.1%**\n\nAs an example of how the 1% expected move translates into strike selections, here’s an Iron Condor with short strikes set at the expected move (based on the close Friday). It would need the ETF to finish between $463 and $472 to see Max Gain:\n\n&amp;#x200B;\n\nhttps://preview.redd.it/gfun2vgje8y71.png?width=573&amp;format=png&amp;auto=webp&amp;s=cc34590345aba5a79ba116143186fd10f5534c94\n\n### In the News\n\nElon Musk posted a Twitter poll over the weekend asking whether he should sell 10% of his Tesla stock. He followed with a tweet saying he would abide by the poll. “Yes” won. It’s unclear what would happen next, as Twitter polls are generally not considered legally binding. Tesla options are pricing about a 6% move for the upcoming week and about 12% for the remainder of November:\n\n### Expected Moves for Companies Reporting Earnings\n\nThe *expected moves* below are for this Friday and link to the Options AI Calendar. *Recent moves* on prior earnings start with the most recent quarter.\n\nMonday\n\n**Paypal** PYPL / [Expected Move: **6.1%**](https://tools.optionsai.com/earnings/Z) / Recent moves: -6%, +2%, +7%\n\n**AMC** AMC / [Expected Move: **13.3%**](https://tools.optionsai.com/earnings/AMC) / Recent moves: -6%, +6%, +4%\n\nTuseday\n\n**Palantir** PLTR / [Expected Move: **8.4%**](https://tools.optionsai.com/earnings/ATVI) / Recent moves: +11%, +9%, -13%\n\n**NIO** NIO / [Expected Move: **7.1%**](https://tools.optionsai.com/earnings/ATVI) / Recent moves: -3%, +2%, -13%\n\n**Wynn** **Resorts** WYNN / [Expected Move: **5.3%**](https://tools.optionsai.com/earnings/ROKU) / Recent moves: +8%, -1%, +8%\n\nWednesday\n\n**Disney** DIS / [Expected Move: **4.2%**](https://tools.optionsai.com/earnings/QCOM) / Recent moves: +1%, -3%, -2%\n\n**SoFi** SOFI / [Expected Move: **10.4%**](https://tools.optionsai.com/earnings/FSLY) / Recent moves: -14%\n\n**Beyond Meat** BYND / [Expected Move: **8.3%**](https://tools.optionsai.com/earnings/ETSY) / Recent moves: +2%, -7%, +1%",
        "subreddit": "options",
        "title": "Expected Moves this Week, TSLA, DIS, AMC, COIN, NIO, PLTR and more.",
        "url": "https://www.reddit.com/r/options/comments/qox1xa/expected_moves_this_week_tsla_dis_amc_coin_nio/",
        "created": 1636345686.0
    },
    {
        "author": "kevinbevindevin",
        "created_utc": 1636042453,
        "id": "qmo4bk",
        "num_comments": 33,
        "num_crossposts": 0,
        "selftext": "I have two portfolios, one in index and sector funds and another in individual stocks. They all purchased around mid-October:\n\nCHPT at 23\n\nFB at 324\n\nJPM at 169\n\n**PENN at 74.76 (sold today at $62/share due to** [**big profit miss**](https://www.marketwatch.com/story/penn-national-gaming-stock-tumbles-after-big-profit-miss-as-momentum-slowed-mid-quarter-2021-11-04)**)**\n\nPLAY at 37.50\n\nTSM at 113\n\n**PYPL at 241.32 (sold yesterday at $226/share as it continues to plummet)**\n\nSome of them do pretty well, especially CHPT, but not so much for PENN and PYPL. Am I just being impatient or am I just making horrible stock picks? My index and sector funds seems to do very well, but I am subsidizing the gains there to make up for the losses I made on individual stocks. Thoughts?",
        "subreddit": "stocks",
        "title": "I make horrible stock picks!",
        "url": "https://www.reddit.com/r/stocks/comments/qmo4bk/i_make_horrible_stock_picks/",
        "created": 1636071253.0
    },
    {
        "author": "LifeInAction",
        "created_utc": 1636470999,
        "id": "qq5umq",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "It seems like earnings have been met with Paypal, revenues have grown, but also applies as well with most Fintech companies, yet is there a reason almost all Fintech, like Paypal (PYPL), Mastercard (MA), Visa (V), Square (SQ), Discover (DFS), going down lately? If solid financials lead to major dips, then what could possibly cause reversals from here? Only thing I can think of is increase competition, but so far it hasn't really seem to make massive impacts to their companies' ability to physically make money.",
        "subreddit": "stocks",
        "title": "Despite Solid Earnings, Why Has Paypal and Most Fintech Stocks Have Been Going Down Lately?",
        "url": "https://www.reddit.com/r/stocks/comments/qq5umq/despite_solid_earnings_why_has_paypal_and_most/",
        "created": 1636499799.0
    },
    {
        "author": "rugerapatt",
        "created_utc": 1637244753,
        "id": "qwqllz",
        "num_comments": 30,
        "num_crossposts": 0,
        "selftext": "PayPal Holdings Inc. has a reputation for disrupting the payments ecosystem, but it “now risks getting disrupted” itself, according to an analyst. Bernstein’s Harshita Rawat downgraded the stock to market perform from outperform Wednesday, citing various competitive pressures for the digital payments giant. Shares of PayPal PYPL, -4.36% are off 2.5% in premarket trading.\n\nRawat worries about the “increasing aggregation” of e-commerce activity on large platforms like Amazon.com Inc. AMZN, +0.23% and Shopify Inc. SHOP, -2.24%, which she estimates are together responsible for about 32% of U.S. commerce. “Amazon currently doesn’t accept PayPal and just agreed to accept Venmo starting in 2022,” she wrote. “Shopify has ambitions of creating its own payments business and has been pushing its merchants aggressively to convert to Shopify payments platform (and also towards the Shop Pay button).”\n\nSmaller merchants “are PayPal’s bread and butter, and Shopify’s meteoric rise and push towards its own payments platform is particularly problematic,” Rawat continued. PayPal’s transaction economics are better with smaller businesses than with very large ones, she argued. Shopify Inc. represents an “unassailable competitor” when it comes to the small-business demographic, in her view.\n\nRawat is also concerned that PayPal’s market-share gains will slow. The company has typically won share at the expense of manual card entry onto a website, but fewer consumers are entering their card information this way, she said, meaning there is less available land to grab there. She estimates that manual card entry now accounts for about 20% of e-commerce checkout, down from roughly 33% four years back. More broadly, she thinks that share gains could slow “by a thousand cuts” thanks to the rise of a number of technologies that separately eat away at opportunities for PayPal. These include the growth of buy-now pay-later (BNPL) services, the ability to auto-fill credit-card information on some web browsers, and the threat of Apple Pay as ever more commerce shifts online. “It is an understatement to say that the payments landscape is rapidly evolving with many powerful trends emerging,” Rawat said in her note to clients. “While PayPal is actively investing and evolving, it simply has more turf to defend versus peers in our view.” Rawat acknowledged that her thesis could prove incorrect if PayPal delivers upbeat surprises with its efforts to drive more revenue from its Venmo app and its “superapp” redesign that focuses on features beyond just payments. “After years of false starts, we believe Venmo is finally on the cusp of getting monetized,” she wrote. While Rawat has “historically been skeptical of aggressive monetization estimates for Venmo,” she feels more “constructive” now. “Venmo monetization is now less about following the PayPal playbook and more about following Cash App’s journey,” she wrote, referencing Square Inc.’s SQ, -2.78% mobile wallet.\n\nShares of PayPal have declined 20% over the past three months as the S&amp;P 500 SPX, -0.26% has risen about 6%.\n\n[https://www.marketwatch.com/story/paypal-now-risks-gettingdisrupted-by-competitors-analyst-says-in-downgrade-11637160014?mod=mw\\_quote\\_news](https://www.marketwatch.com/story/paypal-now-risks-gettingdisrupted-by-competitors-analyst-says-in-downgrade-11637160014?mod=mw_quote_news)",
        "subreddit": "stocks",
        "title": "PayPal ‘now risks getting disrupted’ by competitors, analyst says in downgrade",
        "url": "https://www.reddit.com/r/stocks/comments/qwqllz/paypal_now_risks_getting_disrupted_by_competitors/",
        "created": 1637273553.0
    },
    {
        "author": "Noir-21",
        "created_utc": 1635939486,
        "id": "qlsjue",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "Hey guys,  \nHope everyone is doing well!\n\n$PINS is reporting earnings tomorrow and I'm curious to see how some of you are going to play it out. \n\nOf course everyone was aware of the news around PayPal acquiring them and in the end it turned out it was just a rumor. Some say that was based on Pinterest's announcement of enabling sellers to upload images and catalogues and offering them directly to an online audience. \n\nThe expansion into online shopping is what makes Pinterest attractive to PayPal and the other digital payment companies. A number of analysts say they expect the tie-ups within e-commerce/social media companies and digital payment giants to grow in the future. \n\nThe bad news around PINS is that the co-founder Evan Sharp is stepping down from the company and has sold all of his shares in the month of October. According to Finviz, a number of other insiders has been selling stock recently as well. \n\nThe other bad news is that Pinterest reported it had lost 42 million active monthly users as we are moving out from the pandemic. \n\nSo what's your take and where do you see PINS going tomorrow?",
        "subreddit": "stocks",
        "title": "$PINS - Pinterest Earnings",
        "url": "https://www.reddit.com/r/stocks/comments/qlsjue/pins_pinterest_earnings/",
        "created": 1635968286.0
    },
    {
        "author": "Tara_Sean",
        "created_utc": 1636404287,
        "id": "qpmqvu",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$PYPL YOLO sending my graduate tuition to the moon 🌙🚀🚀🚀",
        "url": "https://i.redd.it/ushf48yeofy71.jpg",
        "created": 1636433087.0
    },
    {
        "author": "KitKatBarMan",
        "created_utc": 1635888305,
        "id": "qlemwr",
        "num_comments": 29,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "All in on PYPL",
        "url": "https://i.redd.it/5u55u43729x71.png",
        "created": 1635917105.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1636493733,
        "id": "qqdy4r",
        "num_comments": 28,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Tuesday, November 9, 2021**\n\nThe stock market took a breather, putting a pause on this record-breaking rally, with all three major indexes closing the day lower. In recent weeks, market participants have rode an extended wave of optimism amid better than expected earnings season, new, better than expected economic data, the passage of the $1.2 trillion infrastructure bill in Congress, and a new antiviral coronavirus pill from Pfizer (PFE). \n\nWith roughly 89% of companies in the S&amp;P 500 (SPY) having already reported earnings, 81% of those have so far posted better than expected earnings per share and 75% of those reported better than expected revenue. FactSet projects that the year-on-year earnings growth rate for the index stands at 40%, though this number has continued creeping higher as earnings season unfolds. \n\n[https://www.factset.com/hubfs/Website/Resources%20Section/Research%20Desk/Earnings%20Insight/EarningsInsight\\_110521.pdf](https://www.factset.com/hubfs/Website/Resources%20Section/Research%20Desk/Earnings%20Insight/EarningsInsight_110521.pdf)\n\nMarci McGregor, Bank of America Merryl Lynch Senior Investment Strategist said, “I still think it’s all about corporate profits.  I know a lot of my peers are concerned that peak earnings growth is behind us. But I think peak earnings isn’t even a 2022 story. We’re seeing solid consumer demand, a strong U.S. economy, and I think we’re going to have a capex cycle in 2022. And I think that’s all positive for corporate profits, and that underpins this market, in my view.”\n\nHowever, despite positive earnings, a host of companies have cited constraints around raw materials, labor shortages, and general supply-chain disruptions affecting the bottom line. According to Bank of America, mentions of supply chains on quarterly earnings calls have surged by 360% compared to last year, underscoring the widespread nature of these pressures. These supply-related issues have also contributed to still-elevated inflationary trends. Tuesday's Producer Price Index from the Bureau of Labor Statistics showed that producer prices rose by 8.6% over last year, matching October's rate for the fastest on record in data going back to Nov. 2010. \n\nKristina Hooper, Chief Global Market Strategist at Invesco, said “I would expect inflation to peak by mid-year 2022. It should remain elevated but it should move lower in the back half of 2022. So while this is certainly an issue, it is part of what we should expect coming out of the pandemic. We have gotten out of a burning building, but we should expect that there is a little smoke and water damage as a result. That’s really what we’re experiencing with elevated inflation and supply chain disruptions”. I agree with this position and think the analogy is very apt. \n\n**Highlights**\n\n* Tesla (TSLA) stock fell more than 10%, pushing down the entire EV sector with it, as the stock price feels the effect of Elon Musk’s poll where he said he would be selling 10% of his stake in Tesla. \n* President Biden interviewed Federal Reserve Governor Lael Brainard for the job of Chairperson, signaling a serious rival to Jerome Powell Powell as Biden is set to nominate a new leader to the Fed in the coming weeks. I really hope Powell is re-assigned, the market does not need a shakeup right now.\n* Peloton (PTON) continued its sharp drop following earnings, dispute the company revealing a new product designed to track your performance on the bike and give you feedback\n* Roblox (RBLX) stock gapped up hard today while PayPal (PYPL) fell after reporting earnings yesterday afternoon. \n* Twitter (TWTR) launched a new subscription service, called Twitter Blue for $3 a month that allows one to undo or correct tweets, among other mostly aesthetic upgrades.\n* NVIDIA (NVDA), my favorite stock, said it was partnering with a range of self-driving sensor companies, including lidar firm Luminar Technologies (LAZR), to put together a system for autonomous driving as soon as 2024.\n* Moreover, NVIDIA also announced it was releasing a set of tools, called “Omniverse Enterprise”. Their Omniverse, which was beta launched in December, is a simulation and collaboration platform which “serves as the connective tissue for physically accurate 3D virtual worlds,” according to the company. In prepared remarks, Nvidia Chief Executive Jensen Huang said in his keynote address that with Omniverse, “we now have the technology to create new 3D worlds or model our physical world.” Omniverse Enterprise, which costs $9,000 a year, is also available to customers in a 30-day trial. Just another example of how NVIDIA is going key to powering technology of the future.   \n* Netflix (NFLX) is launching a new TikTok-like short clip feature for kids called “Kids Clips” as soon as this week. Netflix said it would add new shirts based on its current and future offerings.\n* **\\*\\*Please note that current stock price was written premarket and may not reflect closing prices\\*\\***\n* Advanced Micro Devices (AMD) with two target raises. Stock currently around $149\n   * Susquehanna from $145 to $175 at Positive\n   * Wedbush from $140 to $165 at Outperform\n* Apollo Global Management (APO) target raised by Argus from $76 to $90 at Buy. Stock currently around $76\n* Five9 (FIVN) with two target raises. Stock currently around $167\n   * KeyCorp from $200 to $208 Overweight\n   * Wells Fargo from $200 to $210 at Overweight\n* Humana (HUM) target raised by Citigroup from $510 to $528 at Buy. Stock currently around $450\n* Take-Two Interactive (TTWO) target raised by Deutsche Bank from $218 to $225 at Buy. Stock currently around $185\n* Zscaler (ZS) target raised by BTIG Research from $324 to $401 at Buy. Stock currently around $353\n\n“Always remember that you are absolutely unique. Just like everyone else.” - Margaret Mead",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Tuesday, Nov 9, 2021",
        "url": "https://www.reddit.com/r/stocks/comments/qqdy4r/here_is_a_market_recap_for_today_tuesday_nov_9/",
        "created": 1636522533.0
    },
    {
        "author": "HedgeFundHunter69420",
        "created_utc": 1637288361,
        "id": "qx5uoa",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "Bullish on $PYPL",
        "url": "https://www.coinsnews.com/paypal-has-enabled-bitcoin-payments-at-checkout-for-millions-of-merchants",
        "created": 1637317161.0
    },
    {
        "author": "Roulettebellagio",
        "created_utc": 1636512201,
        "id": "qqk5e1",
        "num_comments": 27,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "$PYPL YOLO! Gotta bounce somewhere.",
        "url": "https://i.redd.it/dxdsvzqgloy71.jpg",
        "created": 1636541001.0
    },
    {
        "author": "Brownski84",
        "created_utc": 1636471056,
        "id": "qq5vd0",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "What are your thoughts on PYPL? I have my number, but is anyone else looking at it went on a steep discount?",
        "subreddit": "ValueInvesting",
        "title": "PYPL",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/qq5vd0/pypl/",
        "created": 1636499856.0
    },
    {
        "author": "zatrades",
        "created_utc": 1636399278,
        "id": "qpkyny",
        "num_comments": 26,
        "num_crossposts": 0,
        "selftext": "  \n\nHi Guys and Gals, I sold PYPL Nov 19 210 put a few weeks ago for 1.40. The PYPL chart looks ugly and earnings is tonight! Would you just take the loss and get out? Thank you, any suggestions appreciated!!",
        "subreddit": "options",
        "title": "PYPL loss on short put help needed",
        "url": "https://www.reddit.com/r/options/comments/qpkyny/pypl_loss_on_short_put_help_needed/",
        "created": 1636428078.0
    },
    {
        "author": "Alexxei",
        "created_utc": 1636817500,
        "id": "qt3lav",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "In Sweden we have something called Swish that was created by a group of banks that makes it really easy to send money from your bank account to anyone or almost everything.\n\nI wanted to invest something similar in the US or international.\nAs I understand it, Venmo is not really the same. Its not connected to your bank account but you have to send money to Venmo first (paypal account?). And you can not buy most things with it yet, though connection with Amazon is coming soon.\n\nSo I just heard about Novi, something created to be really easy to send money, even overseas, without charge.\nBeing able to integrate it with Messenger and Whatsapp it could reach out to a lot of people.\n\n1.How do you in US see Venmos growth in the future, will more merchants accept Venmo payments?\n\n2.Will Novi be able to take marketshare from Venmo and Cashapp?\n\n3.Do most people even care or know that Novi is old Libra and owned by Facebook? Most people on every stocksubreddit doesnt seem to understand that Instagram and Whatsapp is owned by FB",
        "subreddit": "stocks",
        "title": "Paypals Venmo vs Facebooks Novi",
        "url": "https://www.reddit.com/r/stocks/comments/qt3lav/paypals_venmo_vs_facebooks_novi/",
        "created": 1636846300.0
    },
    {
        "author": "Fit_Rooster2702",
        "created_utc": 1635779352,
        "id": "qkg143",
        "num_comments": 24,
        "num_crossposts": 0,
        "selftext": "To get my full breakdown check it out [here.](https://greencandleinvestments.substack.com/p/pinterest-inc-ticker-pins-brief-breakdown?r=ksa6f&amp;utm_campaign=post&amp;utm_medium=web&amp;utm_source=)\n\nCompany Description  \nPinterest Inc is an image sharing social media service and visual discovery engine designed to enable saving and discovering information and ideas on the internet through images, animated GIFs, and videos collated on customizable pinboards. Popular ideas found on Pinterest include recipes, home and style ideas, travel destinations, and many others. There’s an algorithm that provides visual recommendations based on personal tastes and interests.  \n\n\nQuantitative Analysis  \nAt the time of this writing (10/31/2021), PINS is trading at $44.64 with a 52 week range of $44.04 - $89.90 and a market cap of $28.78B. In Q2 of 2021, revenue increased 125% year-over-year (YoY) to $613 million. GAAP net income was $69 million for Q2 and adjusted EBITDA was $178 million for Q2. Return of equity (ROE: Net Income / Total Equity \\*100) of PINS is 7.16% and net margin (net income / revenue) is 7.18%. The debt to equities ratio (total liabilities / total equity) is 0.15 and the price to earnings (P/E) ratio is 177.14.  \n\n\nQualitative Analysis  \nPinterest global monthly active users grew 9% year over year to 454 million. Pinterest currently has a unique niche that few other social media outlets can offer. Pinterest allows users to create a curated pinboard of content to see designs and ideas that interest them. With more and more content creators coming onto the scene, Pinterest is slightly losing its moat to other outlets that offer newsfeeds and photos and videos, like Instagram. Pinterest currently has the 3rd highest global users according to GlobalStats with 8.15% of the market share and is the 3rd highest user base of any social media behind Facebook and Twitter. Rumors of a potential acquisition by PayPal have been floating around recently, however this is unlikely to actually happen. PayPal announced last week that it was not pursuing the acquisition, causing a sharp drop in Pinterest stock price. It will be interesting to see if Apple’s new privacy policy will affect Pinterest as drastically as it affected other social media companies, like Snap Inc.  \n\n\nBullish Thesis  \n1. Strong financial performance: Despite waning active user growth, PINS continues to post strong revenue growth. In their 2021 Q2 report, they posted $613M in global revenue, a 125% increase from 2020 Q2. Most of this revenue growth came from users outside of the U.S., which is unsurprising given that their increase in active monthly users during this time period came entirely from outside the U.S. (active monthly users from Q2 of 2020 to 2021 increased by 13% internationally but decreased by 5% in the U.S.). Unfortunately for PINS, the average revenue per US user is $5.08 compared to $0.36 for the international users. If PINS can stop losing U.S. users and find ways to increase revenue in their international user base, they could really see a boost in value.    \n   \n2. E-Commerce Integration: In May of 2020 Pinterest announced that they would allow Shopify merchants to quickly upload catalogs into shoppable Pins. From Q1 to Q2 2021, catalog uploads grew 50%, driven in large part by their expansion to include international merchants. In Q3 PINS began testing their integration of Automattic’s WooCommerce, an open source ecommerce plug-in for WordPress (we should get an update on this when PINS reports Q3 earnings, scheduled for November 4th). Integration of in-app ecommerce functionality will likely increase per-user revenue, which could help combat a waning user base (at least in the U.S.) and new policies making it difficult for advertisers to track user data.  \n\n\n3. Leadership Recognition of Challenges: In their Q2 2021 letter to investors, PINS leadership clearly acknowledged lower user engagement (see snippet from the letter below). While recognition is only the first step in problem solving, it’s without a doubt an important part of the process. Investors should be glad to see leadership at PINS recognizing and defining the challenges they face coming out of the pandemic but will need to keep an eye on how well they generate solutions.  \n\n\nBearish Thesis  \n1. Losing Uniqueness: Pinterest is known as a place where you could curate a pinboard of cool ideas and designs with short GIFs and other ideas, but now with more and more content creators there are plenty of other outlets like TikTok and Instagram which either curate a newsfeed for you or you can create a newsfeed with creators who put out content you enjoy. With more and more social media outlets offering different ways to consume, it seems Pinterest is just another social media app that people will only go to when they would like to do a DIY project. Some DIY projects can be found on TikTok, Instagram and YouTube so some users may not go to Pinterest as the first stop. Also Pinterest is a social media that many go to for purchasing goods and unique items where few other social medias can compete, but with the addition of Instagram shop and Facebook marketplace others that moat may be shrinking.  \n\n\n2. Declining Views:  According to Nasdaq, visitors to Pinterest via the phone app and website are lower than numbers seen in Q3 of 2019. Many speculate that this is due to countries opening up after the COVID-19 pandemic and spending less time on apps and websites in general, but these are numbers that are below the start of the pandemic. If this trend continues, this could mean the beginning of the end of Pinterest. There has been rumors that companies like PayPal and Target are attempting to acquire Pinterest but it seems that even the acquisition interest is declining. As less people visit the application and website, the less money will be spent on advertising in a growingly difficult world to advertise with Apple’s new privacy structure. All in all, this rapid decline in viewership is something to keep an eye on in earnings going forward.  \n\n\n3. Heavy advertising dependency: Similarly to Snap, Pinterest has a huge reliance on advertisements for their revenue. Snap saw a massive dip in revenue and stock price and Pinterest has seen a similar dip. Pinterest's only revenue source is advertisements and unlike Snap, Pinterest does not have another revenue source or something proprietary to profit off of.  Pinterest will have to adjust how they use advertisements, which could be more based on the interest of their pinboards instead of based on search history and other targeted ads. Time will tell how successful this strategy will be and how much advertisers will pay for this type of advertising. \n\n&amp;#x200B;\n\nTo get my full breakdown check it out [here.](https://greencandleinvestments.substack.com/p/pinterest-inc-ticker-pins-brief-breakdown?r=ksa6f&amp;utm_campaign=post&amp;utm_medium=web&amp;utm_source=)\n\n&amp;#x200B;\n\nAre you bullish or bearish on Pinterest?",
        "subreddit": "ValueInvesting",
        "title": "Pinterest Inc. (Ticker: PINS) - Brief Breakdown",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/qkg143/pinterest_inc_ticker_pins_brief_breakdown/",
        "created": 1635808152.0
    },
    {
        "author": "sidward35",
        "created_utc": 1636753131,
        "id": "qsljob",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "StockMarket",
        "title": "PYPL starting to recover, Airline industry takes a hit on a fairly positive day in the market",
        "url": "https://i.imgur.com/2OdTkxt.png",
        "created": 1636781931.0
    },
    {
        "author": "VonDerBerg",
        "created_utc": 1636358190,
        "id": "qp8wd5",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "Big banks, Intel, PayPal, Oil Co's etc have done it in the past, which has proven to be a poor allocation of capital. It seems like business reinvestment that diversifies the optionality, enhances existing products and penetrates new markets is always a correct way forward for the med/long term.\n\nCan anyone share white papers or studies on the topic?",
        "subreddit": "stocks",
        "title": "Historically: How does taking debt on to buy back stocks pan out for the companies?",
        "url": "https://www.reddit.com/r/stocks/comments/qp8wd5/historically_how_does_taking_debt_on_to_buy_back/",
        "created": 1636386990.0
    },
    {
        "author": "jjd1226",
        "created_utc": 1636498346,
        "id": "qqfkbl",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/jq6r4xmffny71.png?width=2240&amp;format=png&amp;auto=webp&amp;s=1d044634195a67e77d00cf310e85622e8e8b526c\n\n# US Market Wrap - Financial Juice\n\n* As treasuries rose, US stocks paused their longest advance since 2017, bringing key indexes lower from all-time highs.\n* The S&amp;P 500 index dipped for the first time in nine sessions, driven by a decrease in banking stocks, which were hit by a drop in the 10-year yield, which fell to its lowest level in seven weeks. Following a tweet by investor Michael Burry, Tesla dropped as much as 13%.\n* PayPal dropped after the company's guidance fell short of expectations. General Electric soared after announcing that it would be split into three businesses.\n* Investors are weighing robust earnings, easing travel restrictions and US infrastructure expenditure against the possibility of sustained inflation, which might lead to tighter monetary policy. The producer price index rose in October, adding to concerns about inflationary pressures in the economy.\n* On Wednesday, new consumer price data could contribute to the monetary policy debate, which saw another surprise on Tuesday with reports that Fed's Brainard was interviewed by Biden as he considers whether to re-appoint Fed's Powell.\n* In the meantime, positioning adjustments have spurred advances in long-end Treasuries, bringing the 30-year yield to its lowest level since July. The yield on the US 10-year note has dropped to 1.44%.\n\nhttps://preview.redd.it/mxi1em0ifny71.png?width=1046&amp;format=png&amp;auto=webp&amp;s=f6e3ef9d681257bc928a2c1438d42704a7a8d6aa\n\n[🕵️‍♂️ I SPY, QQQ, IWM TA - Tuesday Nov. 9, 2021](https://www.reddit.com/r/wallstreetbets/comments/qprlpe/i_spy_ta_tuesday_nov_9_2021/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n\n# SPY Recap - Nov. 9\n\n* *Support - 468.99 - 467.29*\n* *🔎 resistance - 470.68*\n* *🐂 🎯 - 473.54 - 476.08*\n* *🐻 🎯 - 465.26 - 463.61 - 462.01*\n* *🐂 in charge above 20 SMMA*\n\nhttps://preview.redd.it/tw3hsemmfny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=d164076e5953892417ac2cf2740c8148ac4718c0\n\n## SPY - Nov. 9 - Price Action\n\n* *Open:* 469.32\n* *High:* 469.57\n* *Low:* 465.88\n* *Close:* 467.42\n* *Volume: 48,912,903*\n\nhttps://preview.redd.it/x19yynjofny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=a4008d16672a5db2f9bc33c21f6c2cf98c6855f7\n\n# SPY - Nov. 10 - Analysis\n\n## Options Data\n\n*Volume totals reflect options traded during the current session (10/9)*\n\n* Put Volume Total: 656,350\n* Call Volume Total: 583,305\n* Put/Call Volume Ratio: 1.13\n* Put Open Interest Total: 200,720\n* Call Open Interest Total: 139,742\n* Put/Call Open Interest Ratio: 1.44\n\nhttps://preview.redd.it/y256jwyqfny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=30889cfb00b402c01ede38c00f3dc314a826287d\n\nhttps://preview.redd.it/lndypcrrfny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=92c0434d3b33d82aecde498e0bf17ace1c31d8e3\n\n## Technical Analysis - 65 min.\n\n* Support - 467.20 - 466.03\n* 🔎 resistance - 468.29, 469.49\n* 🐂 🎯 - 470.06 - 471.16 - 472.05 -473.39\n* 🐻 🎯 - 464.90 - 463.61 - 462.01 - 460.97\n* Resistance at 20 SMMA\n\nNotes:\n\n* Downtrend confirmed with lower-low from Nov. 5\n* Bottomed out for the day at 466.03 ish\n* Fell below 20 SMMA (since 10/27)\n\nhttps://preview.redd.it/puu2ggwtfny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=fdd9d5d2039f8bcb4a133b4f56099d85a9216d44\n\n## RSI - 65 min.\n\n* Below 50\n* Continued downtrend from Nov. 5\n* Still room to run before oversold\n\nhttps://preview.redd.it/yajb61mvfny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=0d46c2f9462697be3e431c8142c8ad68ed28e4ed\n\n# MACD - 65 min.\n\n* Extension\n* Near 0 line\n\nhttps://preview.redd.it/h9te0e6xfny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=3dcbb0595a537f1770710c148b47140bee9f7068\n\n## VI - 65 min. \n\n* Cross\n* Still room to run so may not be bottom\n\nhttps://preview.redd.it/u8763ssyfny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=a8bc9fe7ffc93d8d26b54f98adb169191e84bd39\n\n## VIX - 65 min.\n\n* Filled gap from 10/11\n* Broke downtrend line\n\nhttps://preview.redd.it/qsber0e0gny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=ceb0c8c8405ece1f5b8409a3f5f4634689abb3b2\n\n## Need to Know Market Risk - Financial Juice\n\n* Biden called Walmart, UPS, FedEx, and Target CEOs on the supply chain. Discussing speeding deliveries and prices.\n* Fed's Kashkari: The future forecast for inflation is dependent in part on what happens with labour supply.\n* Biden extends emergency order for China investments for 1 year.\n* US EIA raises forecast for 2021 world oil demand growth by 60,000 bpd, now sees 5.11 mln bpd YoY increase.\n\n# Current Positions:\n\nhttps://preview.redd.it/0ylyd8z3gny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=d8781e49ab6e8c826bb5923ebf2990539b663b5d\n\nThanks for reading,\n\n🌝NightMan",
        "subreddit": "wallstreetbets",
        "title": "🕵️‍♂️ I SPY TA - Wednesday Nov. 10, 2021",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qqfkbl/i_spy_ta_wednesday_nov_10_2021/",
        "created": 1636527146.0
    },
    {
        "author": "segaman1",
        "created_utc": 1637205203,
        "id": "qwg9ar",
        "num_comments": 23,
        "num_crossposts": 0,
        "selftext": "I have ~65% of my portfolio in Nvidia, AMD, Microsoft, and Apple. I'm always fighting with myself over whether to add more into my best stocks &amp; average up OR to go for the dips like paypal/visa &amp; wait for those to recover. All 4 have been fairly flat for perhaps over a month now.\n\nI don't have the cash to do both. I know it's okay to average up, but isn't it better to buy dips of other great companies?? That way you don't sacrifice your gain % on your best stocks, and you can scoop in larger gains from something in a dip than something that is already ATH. Or is that a wrong way to think about it?",
        "subreddit": "stocks",
        "title": "Better to average up on best holdings or open new positions on other dips?",
        "url": "https://www.reddit.com/r/stocks/comments/qwg9ar/better_to_average_up_on_best_holdings_or_open_new/",
        "created": 1637234003.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1636195880,
        "id": "qnxu7t",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "Hey guys, upcoming earnings! It's a massive one (AMC, Palantir, Wendys, Disney, Fiverr, Energizer and mooore).\n\nWhich ones are you waiting for most? Where do you place your bets?\n\nhttps://preview.redd.it/xrkys7iugyx71.png?width=1772&amp;format=png&amp;auto=webp&amp;s=d756cb14b2a481c3b71963b3691cf7314767306f\n\nMON  \n     Before MO: $TTD $COTY $NSSC $VTRS $TSEM $PSEC $USFD $EHTH $KOS $GTES $NERV $RDNT $MTNB  $LINC  $EDIT $CECE   \n     After MO: $AMC $PYPL $RBLX $CLOV $SPCE $DDD $SDC $LMND $TME $ZNGA $NVTA $MTRX $UEPS $REAL $TRIP $LOTZ $JKHY $RCEL\n\nTUE  \n     Before MO: $PLTR $WKHS $BNTX $UWMC $DHI $HUYA $PRPL $MSGE $SYY $OCGN $VFF $BHVN  \n     After MO: $NIO $FUBO $COIN $UPST $ACB $DASH $U $WYNN $ELY $FLGT $INO $VRM\n\nWED  \n     Before MO: $AFMD $WEN $FVRR $MCFT $BIOX $PFGC $ENR $EYE $KRNT $MNDY $APPH $WISA  \n     After MO: $DIS $WISH $SOFI $AFRM $BYND $OPEN $TTCF $GEVO $ROOT $LX $RRGB $MBII\n\nTHU  \n     Before MO: $GRWG $PSFE $MT $WIX $YETI $TPR $MYTE $SANW $WB $TXMD $BAM $LIQT $UTZ  \n     After MO: $SNDL $BLNK $RIDE $CPNG $KRUS $ARRY $LTRX $XAIR $GAN $SFT $WATT\n\nFRI     Before MO: $AZN $TH $SPB $SOHO $VERO $SDPI $VIVO $CASI $NYC $MOTS $EFOI",
        "subreddit": "options",
        "title": "Most Anticipated Earnings Releases for the week beginning November 8th, 2021 - it's a big one again!",
        "url": "https://www.reddit.com/r/options/comments/qnxu7t/most_anticipated_earnings_releases_for_the_week/",
        "created": 1636224680.0
    },
    {
        "author": "darktidelegend",
        "created_utc": 1636055102,
        "id": "qmstvx",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "All in on PayPal",
        "url": "https://i.redd.it/v0tmvn0aumx71.jpg",
        "created": 1636083902.0
    },
    {
        "author": "aahahahah-thats-hot",
        "created_utc": 1636044352,
        "id": "qmoul2",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "PayPal has dropped about 25% since highs in July. They have only grown 5% this year despite their revenue growing 20%. They do have a p/e of 55 and p/b of 15 but compared to companies like $SQ, $AFRM, $COIN and other fin tech/ money transfer companies they are reasonably valued. I particularly admire their venmo segment that is growing at 50%&lt; per year.",
        "subreddit": "ValueInvesting",
        "title": "PayPal dip an opportunity?",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/qmoul2/paypal_dip_an_opportunity/",
        "created": 1636073152.0
    },
    {
        "author": "jjd1226",
        "created_utc": 1636499046,
        "id": "qqftcn",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n\nhttps://preview.redd.it/3twzi4dihny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=e4f76b8e306bef65448721953bc51fb469a0c7a0\n\n# US Market Wrap - Financial Juice\n\n* As treasuries rose, US stocks paused their longest advance since 2017, bringing key indexes lower from all-time highs.\n* The S&amp;P 500 index dipped for the first time in nine sessions, driven by a decrease in banking stocks, which were hit by a drop in the 10-year yield, which fell to its lowest level in seven weeks. Following a tweet by investor Michael Burry, Tesla dropped as much as 13%.\n* PayPal dropped after the company's guidance fell short of expectations. General Electric soared after announcing that it would be split into three businesses.\n* Investors are weighing robust earnings, easing travel restrictions and US infrastructure expenditure against the possibility of sustained inflation, which might lead to tighter monetary policy. The producer price index rose in October, adding to concerns about inflationary pressures in the economy.\n* On Wednesday, new consumer price data could contribute to the monetary policy debate, which saw another surprise on Tuesday with reports that Fed's Brainard was interviewed by Biden as he considers whether to re-appoint Fed's Powell.\n* In the meantime, positioning adjustments have spurred advances in long-end Treasuries, bringing the 30-year yield to its lowest level since July. The yield on the US 10-year note has dropped to 1.44%.\n* After rising beyond $68,000 for the first time, bitcoin's gains were trimmed back. After a bearish report, crude oil jumped more than 3% in New York. Gold Rose.\n\nhttps://preview.redd.it/a85bsbdkhny71.png?width=1046&amp;format=png&amp;auto=webp&amp;s=23d64e929ab4269b95853f2ef96bf7bbd0067152\n\n[🕵️‍♂️ I SPY, QQQ, IWM TA - Tuesday Nov. 9, 2021](https://www.reddit.com/r/options/comments/qprpqy/i_spy_ta_tuesday_nov_9_2021/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n\n# SPY Recap - Nov. 9\n\n* *Support - 468.99 - 467.29*\n* Micro *resistance - 470.68*\n* Bullish targets *- 473.54 - 476.08*\n* Bearish  *- 465.26 - 463.61 - 462.01*\n* Bulls *in charge above 20 SMMA*\n\nhttps://preview.redd.it/g13j1t8ohny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=17a6c6d3b1ccada45e406366fa5a6ce8a720f821\n\n## SPY - Nov. 9 - Price Action\n\n* *Open:* 469.32\n* *High:* 469.57\n* *Low:* 465.88\n* *Close:* 467.42\n* *Volume: 48,912,903*\n\nhttps://preview.redd.it/f7jrdfcshny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=2ad3c61828c2caebb8240b82a7b181565f6bb462\n\n# SPY - Nov. 10 - Analysis\n\n## Options Data\n\n*Volume totals reflect options traded during the current session (10/9)*\n\n* Put Volume Total: 656,350\n* Call Volume Total: 583,305\n* Put/Call Volume Ratio: 1.13\n* Put Open Interest Total: 200,720\n* Call Open Interest Total: 139,742\n* Put/Call Open Interest Ratio: 1.44\n\nhttps://preview.redd.it/dspkw9quhny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=bc9080d7b10ffe35b42526c9f33558f13890f76c\n\nhttps://preview.redd.it/45dl3okvhny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=add8ee0b27f8be479920e51ae3b83a1971df41a5\n\n## Technical Analysis - 65 min.\n\n* Support - 467.20 - 466.03\n* Micro resistance - 468.29, 469.49\n* Bullish targets - 470.06 - 471.16 - 472.05 -473.39\n* Bearish targets - 464.90 - 463.61 - 462.01 - 460.97\n* Resistance at 20 SMMA\n\nNotes:\n\n* Downtrend confirmed with lower-low from Nov. 5\n* Bottomed out for the day at 466.03 ish\n* Fell below 20 SMMA (since 10/27)\n\nhttps://preview.redd.it/nawfidixhny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=19d06974569d6eff5c61e99ebd7df3b126172474\n\n## RSI - 65 min.\n\n* Below 50\n* Continued downtrend from Nov. 5\n* Still room to run before oversold\n\nhttps://preview.redd.it/kkboqjdzhny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=7e37d51b66d69ddc0249df730083c72358eeebed\n\n# MACD - 65 min.\n\n* Extension\n* Near 0 line\n\nhttps://preview.redd.it/l4hxpl71iny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=d4aeadaac0fc2269d1138fe9fbe1b495639b4c99\n\n## VI - 65 min. \n\n* Cross\n* Still room to run so may not be bottom\n\nhttps://preview.redd.it/5axnfzx2iny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=31ccffefea1100f29cbdf9d1a4aa9a567a014aa5\n\n## VIX - 65 min.\n\n* Filled gap from 10/11\n* Broke downtrend line\n\nhttps://preview.redd.it/wndw6tj4iny71.png?width=1456&amp;format=png&amp;auto=webp&amp;s=664360b9cb51179378d6a55da1904dd579dfee5e\n\n## Need to Know Market Risk - Financial Juice\n\n* Biden called Walmart, UPS, FedEx, and Target CEOs on the supply chain. Discussing speeding deliveries and prices.\n* Fed's Kashkari: The future forecast for inflation is dependent in part on what happens with labour supply.\n* Biden extends emergency order for China investments for 1 year.\n* US EIA raises forecast for 2021 world oil demand growth by 60,000 bpd, now sees 5.11 mln bpd YoY increase.\n\nThanks for reading,\n\n🌝NightMan",
        "subreddit": "options",
        "title": "🕵️‍♂️ I SPY TA - Wednesday Nov. 10, 2021",
        "url": "https://www.reddit.com/r/options/comments/qqftcn/i_spy_ta_wednesday_nov_10_2021/",
        "created": 1636527846.0
    },
    {
        "author": "Background_Egg_8497",
        "created_utc": 1637712671,
        "id": "r0r94o",
        "num_comments": 22,
        "num_crossposts": 0,
        "selftext": "I feel like some stocks PLTR, PYPL etc have come back down to earth and are now fairly valued but it’s so hard to not catch a falling knife. \n\nHow do you guys feel about selling naked puts 10-15OTM. They’d still fetch a decent return with the volatility in the underlying and it gives some downside protection.",
        "subreddit": "options",
        "title": "Selling OTM puts on high volume stocks",
        "url": "https://www.reddit.com/r/options/comments/r0r94o/selling_otm_puts_on_high_volume_stocks/",
        "created": 1637741471.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1636194738,
        "id": "qnxlq5",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hey guys, upcoming earnings! It's a massive one (AMC, Palantir, Wendys, Disney, Fiverr, Energizer and mooore).\n\nWhich ones are you waiting for most? Where do you place your bets? \n\nhttps://preview.redd.it/v5tmo8yddyx71.png?width=1772&amp;format=png&amp;auto=webp&amp;s=edf22ab4250017813734c9fc7f9a4164605fbfca\n\nMON  \n     Before MO: $TTD $COTY $NSSC $VTRS $TSEM $PSEC $USFD $EHTH $KOS $GTES $NERV $RDNT $MTNB  $LINC  $EDIT $CECE   \n     After MO: $AMC $PYPL $RBLX $CLOV $SPCE $DDD $SDC $LMND $TME $ZNGA $NVTA $MTRX $UEPS $REAL $TRIP $LOTZ $JKHY $RCEL\n\nTUE  \n     Before MO: $PLTR $WKHS $BNTX $UWMC $DHI $HUYA $PRPL $MSGE $SYY $OCGN $VFF $BHVN  \n     After MO: $NIO $FUBO $COIN $UPST $ACB $DASH $U $WYNN $ELY $FLGT $INO $VRM\n\nWED  \n     Before MO: $AFMD $WEN $FVRR $MCFT $BIOX $PFGC $ENR $EYE $KRNT $MNDY $APPH $WISA  \n     After MO: $DIS $WISH $SOFI $AFRM $BYND $OPEN $TTCF $GEVO $ROOT $LX $RRGB $MBII\n\nTHU  \n     Before MO: $GRWG $PSFE $MT $WIX $YETI $TPR $MYTE $SANW $WB $TXMD $BAM $LIQT $UTZ  \n     After MO: $SNDL $BLNK $RIDE $CPNG $KRUS $ARRY $LTRX $XAIR $GAN $SFT $WATT\n\nFRI     Before MO: $AZN $TH $SPB $SOHO $VERO $SDPI $VIVO $CASI $NYC $MOTS $EFOI",
        "subreddit": "StockMarket",
        "title": "Most Anticipated Earnings Releases for the week beginning November 8th, 2021 - it's a big one again!",
        "url": "https://www.reddit.com/r/StockMarket/comments/qnxlq5/most_anticipated_earnings_releases_for_the_week/",
        "created": 1636223538.0
    },
    {
        "author": "Aquaticdigest",
        "created_utc": 1637499667,
        "id": "qyui02",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hello Everyone, I recently bought into individual stocks on 1.10.2021 (around 2 months ago) and my results of the percentage gains and number of holding with priority (higher investments) are as follows:\n\n&amp;#x200B;\n\nAAPL : +15.7%\n\nMSFT : +24%\n\nNVDA : +64%a\n\nTSLA : +52%\n\nAMD : +56%\n\nPYPL : -14.5%\n\nMCD : +6.5%\n\nFSLY : -30%\n\nPLTR : -12%\n\nNET : +90%\n\nV : -6%\n\nCOIN : +50%\n\nINTC : -4%\n\nTWLO : -10.5%\n\nO : +12.5%\n\nSQ : -4.8%\n\n&amp;#x200B;\n\nI am up 20% on my whole portfolio. QQQ at this time rose 12% which is quite insane as well. I usually invest monthly around 1000$ and right now my portfolio is worth around 10k$. I wanted some opinions from the people here. \n\n&amp;#x200B;\n\n1. What would be some readjustments I should make to this portfolio. \n2. As previously I had invested lumpsum 8k into these stocks, how do I continue to invest. Should I pick out new companies or keep piling onto the same positions? Should I keep the same priority by value of investment that I currently have?\n3. Which stocks do you think would not do well in the future. My current bags are (FSLY, PYPL, PLTR)",
        "subreddit": "stocks",
        "title": "How to Refactor A Portfolio when Adding Monthly Investments?",
        "url": "https://www.reddit.com/r/stocks/comments/qyui02/how_to_refactor_a_portfolio_when_adding_monthly/",
        "created": 1637528467.0
    },
    {
        "author": "JOsephshamon",
        "created_utc": 1636137412,
        "id": "qnhlfl",
        "num_comments": 21,
        "num_crossposts": 0,
        "selftext": "Hey I’m 15 years old and I’m thinking off starting to invest in stocks or maybe crypto I have a bit off money in a PayPal account. Altough I can’t provide parent info or whatever most sites need what do I do my parents will not allow me. And they will just demotivate me is there some site I can use ? Everything can be helpful thanks",
        "subreddit": "stocks",
        "title": "Investing as a teenager without parent’s consent",
        "url": "https://www.reddit.com/r/stocks/comments/qnhlfl/investing_as_a_teenager_without_parents_consent/",
        "created": 1636166212.0
    },
    {
        "author": "08u3a1o",
        "created_utc": 1636196050,
        "id": "qnxvhu",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "Hey guys, upcoming earnings! It's a massive one (AMC, Palantir, Wendys, Disney, Fiverr, Energizer and mooore).\n\nWhich ones are you waiting for most? Where do you place your bets?\n\nhttps://preview.redd.it/9obz0qzchyx71.png?width=1772&amp;format=png&amp;auto=webp&amp;s=944781a4bc1568a002cf65f1b737a270c1d74a6c\n\nMON  \n     Before MO: $TTD $COTY $NSSC $VTRS $TSEM $PSEC $USFD $EHTH $KOS $GTES $NERV $RDNT $MTNB  $LINC  $EDIT $CECE   \n     After MO: $AMC $PYPL $RBLX $CLOV $SPCE $DDD $SDC $LMND $TME $ZNGA $NVTA $MTRX $UEPS $REAL $TRIP $LOTZ $JKHY $RCEL\n\nTUE  \n     Before MO: $PLTR $WKHS $BNTX $UWMC $DHI $HUYA $PRPL $MSGE $SYY $OCGN $VFF $BHVN  \n     After MO: $NIO $FUBO $COIN $UPST $ACB $DASH $U $WYNN $ELY $FLGT $INO $VRM\n\nWED  \n     Before MO: $AFMD $WEN $FVRR $MCFT $BIOX $PFGC $ENR $EYE $KRNT $MNDY $APPH $WISA  \n     After MO: $DIS $WISH $SOFI $AFRM $BYND $OPEN $TTCF $GEVO $ROOT $LX $RRGB $MBII\n\nTHU  \n     Before MO: $GRWG $PSFE $MT $WIX $YETI $TPR $MYTE $SANW $WB $TXMD $BAM $LIQT $UTZ  \n     After MO: $SNDL $BLNK $RIDE $CPNG $KRUS $ARRY $LTRX $XAIR $GAN $SFT $WATT\n\nFRI     Before MO: $AZN $TH $SPB $SOHO $VERO $SDPI $VIVO $CASI $NYC $MOTS $EFOI",
        "subreddit": "CanadianInvestor",
        "title": "Most Anticipated Earnings Releases for the week beginning November 8th, 2021 - it's a big one again!",
        "url": "https://www.reddit.com/r/CanadianInvestor/comments/qnxvhu/most_anticipated_earnings_releases_for_the_week/",
        "created": 1636224850.0
    },
    {
        "author": "liberalvisa",
        "created_utc": 1636555971,
        "id": "qqw50g",
        "num_comments": 19,
        "num_crossposts": 0,
        "selftext": "**What to invest?**\n\nIf you have some spare funds and waiting to deploy for investment, you may to invest in PayPal   (NASDAQ:PYPL)  as the price has come off significantly. I am waiting for an opportunity to invest into well establish companies at a lower price, PayPal is one of them.  The company had **377 million active accounts at the end of 2020, including 29 million merchant accounts**. The company also owns Xoom, an international money transfer business, and Venmo, a person-to-person payment platform.\n\n**Positive Earning Trend and debts are not an issue**\n\nTheir profit margin have been growing from 5.2% in year 2014 to 20.4% in year 2021. They have grown significantly by an average of 25% per year over the past 5 years.\n\nLast profit margin is 20.1% as at 30 September 2021 with a net income of USD4,997 Millions\n\nHigh ROE - 23.3% (ROE indicates how well a company's management deploys shareholder capital).\n\nLiabilities - debt to equity ratio of 36% (Total debt 7,949 Million / Total Equity 22,090 Million) as at Sep 30, 2021. *As interest rate is low, it is an excellent strategy to take on more debts to have more rooms for business expansion. Note that the debts to equity ratio had reduced from 42.8% to 36% in a quarter.*\n\nDebt Coverage - PayPal is well covered by operating cash flow (74.5%)\n\nInterest Coverage - PayPal's interest payments on debts are well covered by EBIT (35.7x coverage)\n\nCash &amp; Short term investments improves from USD$12.4 billion to USD$13.292\n\n**Potential - partnership with Amazon** \n\n PayPal said it had inked a deal with Amazon to allow the firm’s Venmo wallets in the U.S. to be accepted on Amazon’s website and mobile app starting next year. Amazon being the largest e-commerce in the world, has **300 million active users** as of (1 November 2021) and **162 million active users** are from US. Due to Amazon’s global scope and reach, it is also considered one of the most valuable brand worldwide. This also means that PayPal got to access to Amazon users and the payments can be done through PayPal's Venmo wallets. This is going to be the biggest revenue source going forward. \n\n**Plenty of room to grow in the ecommerce space**\n\nThere is still plenty of runway for growth in electronic payments. Electronic payments only surpassed cash payments on a global basis a couple of years especially during the pandemic period where the baby boomer started to explore the online and as well as developing countries who started to use online and more of the payment services. Over the years, PayPal had built a good reputation on the payment services for being highly secured and as well as bringing conveniences. \n\n**Unique business Model - ability to combat fraud** \n\nPayPal have this  unique business model centers around a two-sided platform, with PayPal enjoying relationships with both merchants and consumers. This approach has material benefits and was instrumental in allowing PayPal to develop its current foothold in the industry. Having information on both sides of the transaction gives PayPal a meaningful edge in combating fraud, which was a very meaningful factor in the early days of the Internet, and remains a key issue. With an ability to combat fraud, PayPal was in a position to become a valued partner on both sides of a payment. (Source: Morningstar) With this feature, I will always opt to have my items checkout using PayPal if there is an option for it because I know it will be highly secured. \n\n**Who are the shareholders of PayPal?** \n\nOwnership breakdown\n\n* **82% Institutional** \n* 17.9% General Public \n* State or Government 0.04%\n* Individual Insider 0.08% \n\n[Top shareholders of PayPal ](https://preview.redd.it/kgwoblux5sy71.jpg?width=701&amp;format=pjpg&amp;auto=webp&amp;s=b4a3c78c9cd04c52b7409ab766d2abfc04376955)\n\nAs you can see, the top shareholders of PayPal are mostly institutional/ fund houses which make up of 82%. They do also that believe that PayPal have a value to hold for long term. \n\n**Fair Value**\n\nWith an established client based, strong brand name, good balance sheet and potential. I  will believe that PayPal will have a long way to do. My fair value for PayPal is around 255. \n\n&amp;#x200B;\n\n&gt;*Hey Reddit friends, please follow me if you likes my article. I will explain more in my next article.*   \n&gt;  \n&gt;*Thank you*",
        "subreddit": "wallstreetbets",
        "title": "What to invest now?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qqw50g/what_to_invest_now/",
        "created": 1636584771.0
    },
    {
        "author": "skibud2",
        "created_utc": 1636475443,
        "id": "qq7f9m",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": "I am surprised that people are not as excited about the Venmo revenue growth. If feels like this will be their future, making PayPal a top player in digital payments. \n\n* 2017 - $160M\n* 2018 - $200M\n* 2019 - $300M\n* 2020 - $450M\n* 2021 - $900M (estimate)\n\nAm I missing something here? Feels like this is going to be huge!\n\n[https://imgur.com/a/j10Nqw3](https://imgur.com/a/j10Nqw3)",
        "subreddit": "stocks",
        "title": "Paypal Venmo Growth",
        "url": "https://www.reddit.com/r/stocks/comments/qq7f9m/paypal_venmo_growth/",
        "created": 1636504243.0
    },
    {
        "author": "daddyforce69",
        "created_utc": 1637633788,
        "id": "r02d9a",
        "num_comments": 18,
        "num_crossposts": 0,
        "selftext": " Hello all,\n\nI'm  a 24 year old newbie just started to invest for about 3 months. I do not have a good income rn (\\~25k a year but starting in next spring I will have a raise and bump it to 50-70k.) but i just want to dip my toes in the water and start learning about investing. Was doing okay  (initial deposit was 3.5k) and was up about 5% until I find out WSB.  Made some retard plays (listened to those \"DD\" about CLOV, IRNT, CRSR)  and lost about 15% of my portfolio. After that I started to do a lot  more DD and here are my current position:\n\nTD account\n\n3 shares of AAPL @ 150\n\n3 shares of AMC @ 40\n\n1 share of AMD @ 105\n\n1 share of DIS @ 160\n\n15 shares of SOFI @ 19 and 2 option plays April 2022 strike 25 and 30 (bought that 6 weeks ago first and only option play)\n\n1 share of tsm @ 110\n\n1 share of unity @ 120\n\n1 share of V @ 210\n\n1 share of VOO @ 410\n\nWEBULL account\n\n1.5 share of AFRM @ 130\n\n0.12 share of GOOG @ 2680\n\n1 share of MSFT @ 283\n\n0.5 share of TSLA (Bought @ 700 and sold half @ 1150 \\~10 days ago, totally lucky play)\n\n0.1 share of AMZN @ 3250\n\n1.3 share of FB @ 330\n\n2.5 share of PYPL @ 235 (RIP)\n\n1 share of NVDA @ 200\n\nAs  you can see I have tons of different stocks all over the places, I'm up  about 8% overall even after those retard plays (been adding more  deposits overtime so total principle now is 5.5k) until recently SOFI  start tanking and today a lot of tech stocks tank because of the  treasury yields FUD.\n\nI'm glad that  I started to invest in a relatively young age, and I've been reading a  lot of articles and books to understand the market, but the more i know  the more I don't know. And my biggest problem is I keep looking at my  phone every 5 mins and it has been heavily influence my work life and  life in general negatively.\n\nNow here's my question;\n\nShould  i just put like 75% of my portfolio and a few ETFs so I can actually  enjoy life and not to worry about stock every 5 sec? I would be lying to  say I don't want to make big money quick but I've learn my lesson  knowing I'm not smart or experienced enough to swing trade (or have time  to do so.) I've been looking at putting 50% of my port in QQQ and VOO,  and 20% to SMH and then 20% with specific stocks that i like and 10%  cash. Any recommendation of what kinds of ETFs should I get base on the  stocks that I own rn? I'm still young so I'm fine with higher risk ETFs  plus I only have like 6k in my account so it's not that big of a deal.  But keep tracking on the market has drained my life and i need to get  out of it this swamp.\n\nAny help would be appreciated!\n\nP.S. I will keep putting 2-300 bucks a month in and 500 after I get a raise",
        "subreddit": "StockMarket",
        "title": "A struggling newbie need some help",
        "url": "https://www.reddit.com/r/StockMarket/comments/r02d9a/a_struggling_newbie_need_some_help/",
        "created": 1637662588.0
    },
    {
        "author": "thehouseofcrazies",
        "created_utc": 1636036231,
        "id": "qmluk0",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "Listen up silly turkeys, I get it. It's been a really rough few months. Everytime there's a small spike hedgies manage to smack the price right back down. This is exactly how the short sellers want us to feel so we just give up and paper hand. Well guess what? Not me mother fuckers because I know what I own. RKT is thee most undervalued stock in the current market. There's plenty of solid DD that has been previously posted but I'll point out a few highlights. \n\n1. Q2 2021: $2.67 in revenue / $920M income. Approx 4B cash on hand \n2. 90% customer retention rate\n3. RKT enjoys approx 10% market share of a 3.5T consumer lending market.\n4. Recently launched Rocket homes, Rocket Auto which is doing very well. \n\nRocket is a Fintech company. The ability of being able to apply for a home loan, car loan, solar loan on your PC or phone is the definition of Fintech. This company is literally printing money while the rest of Reddit is busy pumping and dumping SPAC's and dinosaurs. Don't believe all the FUD about housing crash because it's not happening. The federal government is 30T in debt and cannot afford higher interest rates. They will keep interest rates low even if it means letting inflation and housing prices run hot. The recent slow down in housing numbers is due to lack of supply, not lack of demand. \nIt's pretty obvious that some big dog(s) is targeting this stock. My guess is that the big banks are the prime suspects. They have been losing crap loads of revenue to the likes of PayPal, Square etc and cannot afford to lose their mortgage business to another Fintech. Again, I have no proof, this is just a hunch but keep in mind that Jamie Dimon from JPMorgan said he considers fintech's the biggest threat to their business and gives him night sweats so just connect the dots. Banks have unlimited amounts of money, just look at the prices of Gold and Silver prices which are being heavily shorted by the banks and I believe that RKT is a victim of these criminals as well. \n\nThe obvious question is why should I buy RKT right now with all these headwinds? \n\nFor starters, RKT still has a $1B open stock buyback program. According to their latest 10Q filing, they purchased $8M worth of stock last quarter at $16.74. If you haven't realized, shorts are having a very hard time pushing the price lower in the last few weeks while short volume has remained steady. This leads me to believe that the company is actively buying back shares at these prices. \nI've read all the bear thesis on RKT and it's all hogwash. Oh, Dan Gilbert owns 93% of the company, this company shouldn't have gone public yada yada yada.... \nWould you rather own a small piece of a good thing or nothing at all? So that's a good reason to short this company to oblivion? What's the problem, you won't be able to buy a large stake and control a company that has been in business for over 35+ years? \nOh yea I forgot, THERE'S A HOUSING CRASH COMING..... \nI wish people would stop referencing Evergrande and comparing the US housing market to the Chinese fiasco. We don't have ghost cities around here and we're actually short seven million homes. \nYes, homes are expensive but there's still solid demand that will keep prices stable. \nFollowing up on the fed meeting yesterday, Jpow is in no rush to raise interest rates which is a great tailwind for the industry. \nThere aren't a lot of bargains left in the stock market and RKT is definitely the best bang for the buck. Earnings are coming up after the bell and I'm expecting beats all around and that elusive divvy 🙏 \n\nI'm high as fuck writing this so please don't take this as financial advice. \n🚀🚀🚀🚀🚀🚀🚀",
        "subreddit": "wallstreetbets",
        "title": "Knock Knock, Who's there? RKT A$$HOLE",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qmluk0/knock_knock_whos_there_rkt_ahole/",
        "created": 1636065031.0
    },
    {
        "author": "CurrentPangolin",
        "created_utc": 1636619702,
        "id": "qrgs4a",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": "&amp;#x200B;\n        \n|Ticker|Company|# Mentions (24H)|Mentions and Charts|\n|:-|:-|:-|:-|\n|TSLA|Tesla Inc|[19](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tesla%20Inc/TSLA?utm_source=rsmb&amp;utm_medium=stockmarket)\n|PLTR|Palantir Technologies Inc|[6](https://www.memebergterminal.com/stock/Palantir%20Technologies%20Inc/PLTR?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Palantir%20Technologies%20Inc/PLTR?utm_source=rsmb&amp;utm_medium=stockmarket)\n|CPI|IQ Real Return ETF|[6](https://www.memebergterminal.com/stock/IQ%20Real%20Return%20ETF/CPI?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/IQ%20Real%20Return%20ETF/CPI?utm_source=rsmb&amp;utm_medium=stockmarket)\n|GME|GameStop Corp|[4](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/GameStop%20Corp/GME?utm_source=rsmb&amp;utm_medium=stockmarket)\n|PYPL|PayPal Holdings Inc|[3](https://www.memebergterminal.com/stock/PayPal%20Holdings%20Inc/PYPL?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/PayPal%20Holdings%20Inc/PYPL?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TG|Tredegar Corporation|[1](https://www.memebergterminal.com/stock/Tredegar%20Corporation/TG?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tredegar%20Corporation/TG?utm_source=rsmb&amp;utm_medium=stockmarket)\n|SAVE|Spirit Airlines Inc|[1](https://www.memebergterminal.com/stock/Spirit%20Airlines%20Inc/SAVE?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Spirit%20Airlines%20Inc/SAVE?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TBT|ProShares UltraShort 20+ Year Treasury|[1](https://www.memebergterminal.com/stock/ProShares%20UltraShort%2020%2B%20Year%20Treasury/TBT?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/ProShares%20UltraShort%2020%2B%20Year%20Treasury/TBT?utm_source=rsmb&amp;utm_medium=stockmarket)\n|ARVL|Arrival|[1](https://www.memebergterminal.com/stock/Arrival/ARVL?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Arrival/ARVL?utm_source=rsmb&amp;utm_medium=stockmarket)\n|MSN|Emerson Radio Corp|[1](https://www.memebergterminal.com/stock/Emerson%20Radio%20Corp/MSN?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Emerson%20Radio%20Corp/MSN?utm_source=rsmb&amp;utm_medium=stockmarket)\n|USB|U.S. Bancorp|[1](https://www.memebergterminal.com/stock/U.S.%20Bancorp/USB?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/U.S.%20Bancorp/USB?utm_source=rsmb&amp;utm_medium=stockmarket)\n|HR|Healthcare Realty Trust Incorporated|[1](https://www.memebergterminal.com/stock/Healthcare%20Realty%20Trust%20Incorporated/HR?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Healthcare%20Realty%20Trust%20Incorporated/HR?utm_source=rsmb&amp;utm_medium=stockmarket)\n|GS|The Goldman Sachs Group Inc|[1](https://www.memebergterminal.com/stock/The%20Goldman%20Sachs%20Group%20Inc/GS?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/The%20Goldman%20Sachs%20Group%20Inc/GS?utm_source=rsmb&amp;utm_medium=stockmarket)\n|SPY|SPDR S&amp;P 500 ETF Trust|[1](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/SPDR%20S%26P%20500%20ETF%20Trust/SPY?utm_source=rsmb&amp;utm_medium=stockmarket)\n|TIPS|Tianrong Internet Products and Services Inc|[1](https://www.memebergterminal.com/stock/Tianrong%20Internet%20Products%20and%20Services%20Inc/TIPS?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Tianrong%20Internet%20Products%20and%20Services%20Inc/TIPS?utm_source=rsmb&amp;utm_medium=stockmarket)\n|CPG|Crescent Point Energy Corp|[1](https://www.memebergterminal.com/stock/Crescent%20Point%20Energy%20Corp/CPG?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Crescent%20Point%20Energy%20Corp/CPG?utm_source=rsmb&amp;utm_medium=stockmarket)\n|MJ|ETFMG Alternative Harvest ETF|[1](https://www.memebergterminal.com/stock/ETFMG%20Alternative%20Harvest%20ETF/MJ?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/ETFMG%20Alternative%20Harvest%20ETF/MJ?utm_source=rsmb&amp;utm_medium=stockmarket)\n|IVOL|Krane Shares Trust - Quadratic Interest Rate Volatility and Inflation Hedge ETF|[1](https://www.memebergterminal.com/stock/Krane%20Shares%20Trust%20-%20Quadratic%20Interest%20Rate%20Volatility%20and%20Inflation%20Hedge%20ETF/IVOL?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Krane%20Shares%20Trust%20-%20Quadratic%20Interest%20Rate%20Volatility%20and%20Inflation%20Hedge%20ETF/IVOL?utm_source=rsmb&amp;utm_medium=stockmarket)\n|MMT|MFS Multimarket Income Trust|[1](https://www.memebergterminal.com/stock/MFS%20Multimarket%20Income%20Trust/MMT?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/MFS%20Multimarket%20Income%20Trust/MMT?utm_source=rsmb&amp;utm_medium=stockmarket)\n|GFI|Gold Fields Limited|[1](https://www.memebergterminal.com/stock/Gold%20Fields%20Limited/GFI?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/Gold%20Fields%20Limited/GFI?utm_source=rsmb&amp;utm_medium=stockmarket)\n|AMC|AMC Entertainment Holdings Inc|[1](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=stockmarket)|[See Specific Mentions](https://www.memebergterminal.com/stock/AMC%20Entertainment%20Holdings%20Inc/AMC?utm_source=rsmb&amp;utm_medium=stockmarket)",
        "subreddit": "StockMarket",
        "title": "I scraped r/stockmarket for the top ticker mentions in the last 24H. Here are the results (Thursday November 11, 2021)",
        "url": "https://www.reddit.com/r/StockMarket/comments/qrgs4a/i_scraped_rstockmarket_for_the_top_ticker/",
        "created": 1636648502.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1636493757,
        "id": "qqdygh",
        "num_comments": 17,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Tuesday, November 9, 2021**\n\nThe stock market took a breather, putting a pause on this record-breaking rally, with all three major indexes closing the day lower. In recent weeks, market participants have rode an extended wave of optimism amid better than expected earnings season, new, better than expected economic data, the passage of the $1.2 trillion infrastructure bill in Congress, and a new antiviral coronavirus pill from Pfizer (PFE). \n\nWith roughly 89% of companies in the S&amp;P 500 (SPY) having already reported earnings, 81% of those have so far posted better than expected earnings per share and 75% of those reported better than expected revenue. FactSet projects that the year-on-year earnings growth rate for the index stands at 40%, though this number has continued creeping higher as earnings season unfolds. \n\n[https://www.factset.com/hubfs/Website/Resources%20Section/Research%20Desk/Earnings%20Insight/EarningsInsight\\_110521.pdf](https://www.factset.com/hubfs/Website/Resources%20Section/Research%20Desk/Earnings%20Insight/EarningsInsight_110521.pdf)\n\nMarci McGregor, Bank of America Merryl Lynch Senior Investment Strategist said, “I still think it’s all about corporate profits.  I know a lot of my peers are concerned that peak earnings growth is behind us. But I think peak earnings isn’t even a 2022 story. We’re seeing solid consumer demand, a strong U.S. economy, and I think we’re going to have a capex cycle in 2022. And I think that’s all positive for corporate profits, and that underpins this market, in my view.”\n\nHowever, despite positive earnings, a host of companies have cited constraints around raw materials, labor shortages, and general supply-chain disruptions affecting the bottom line. According to Bank of America, mentions of supply chains on quarterly earnings calls have surged by 360% compared to last year, underscoring the widespread nature of these pressures. These supply-related issues have also contributed to still-elevated inflationary trends. Tuesday's Producer Price Index from the Bureau of Labor Statistics showed that producer prices rose by 8.6% over last year, matching October's rate for the fastest on record in data going back to Nov. 2010. \n\nKristina Hooper, Chief Global Market Strategist at Invesco, said “I would expect inflation to peak by mid-year 2022. It should remain elevated but it should move lower in the back half of 2022. So while this is certainly an issue, it is part of what we should expect coming out of the pandemic. We have gotten out of a burning building, but we should expect that there is a little smoke and water damage as a result. That’s really what we’re experiencing with elevated inflation and supply chain disruptions”. I agree with this position and think the analogy is very apt. \n\n**Highlights**\n\n* Tesla (TSLA) stock fell more than 10%, pushing down the entire EV sector with it, as the stock price feels the effect of Elon Musk’s poll where he said he would be selling 10% of his stake in Tesla. \n* President Biden interviewed Federal Reserve Governor Lael Brainard for the job of Chairperson, signaling a serious rival to Jerome Powell Powell as Biden is set to nominate a new leader to the Fed in the coming weeks. I really hope Powell is re-assigned, the market does not need a shakeup right now.\n* Peloton (PTON) continued its sharp drop following earnings, dispute the company revealing a new product designed to track your performance on the bike and give you feedback\n* Roblox (RBLX) stock gapped up hard today while PayPal (PYPL) fell after reporting earnings yesterday afternoon. \n* Twitter (TWTR) launched a new subscription service, called Twitter Blue for $3 a month that allows one to undo or correct tweets, among other mostly aesthetic upgrades.\n* NVIDIA (NVDA), my favorite stock, said it was partnering with a range of self-driving sensor companies, including lidar firm Luminar Technologies (LAZR), to put together a system for autonomous driving as soon as 2024.\n* Moreover, NVIDIA also announced it was releasing a set of tools, called “Omniverse Enterprise”. Their Omniverse, which was beta launched in December, is a simulation and collaboration platform which “serves as the connective tissue for physically accurate 3D virtual worlds,” according to the company. In prepared remarks, Nvidia Chief Executive Jensen Huang said in his keynote address that with Omniverse, “we now have the technology to create new 3D worlds or model our physical world.” Omniverse Enterprise, which costs $9,000 a year, is also available to customers in a 30-day trial. Just another example of how NVIDIA is going key to powering technology of the future.   \n* Netflix (NFLX) is launching a new TikTok-like short clip feature for kids called “Kids Clips” as soon as this week. Netflix said it would add new shirts based on its current and future offerings.\n* **\\*\\*Please note that current stock price was written premarket and may not reflect closing prices\\*\\***\n* Advanced Micro Devices (AMD) with two target raises. Stock currently around $149\n   * Susquehanna from $145 to $175 at Positive\n   * Wedbush from $140 to $165 at Outperform\n* Apollo Global Management (APO) target raised by Argus from $76 to $90 at Buy. Stock currently around $76\n* Five9 (FIVN) with two target raises. Stock currently around $167\n   * KeyCorp from $200 to $208 Overweight\n   * Wells Fargo from $200 to $210 at Overweight\n* Humana (HUM) target raised by Citigroup from $510 to $528 at Buy. Stock currently around $450\n* Take-Two Interactive (TTWO) target raised by Deutsche Bank from $218 to $225 at Buy. Stock currently around $185\n* Zscaler (ZS) target raised by BTIG Research from $324 to $401 at Buy. Stock currently around $353\n\n“Always remember that you are absolutely unique. Just like everyone else.” - Margaret Mead",
        "subreddit": "StockMarket",
        "title": "Here is a Market Recap for today Tuesday, Nov 9, 2021",
        "url": "https://www.reddit.com/r/StockMarket/comments/qqdygh/here_is_a_market_recap_for_today_tuesday_nov_9/",
        "created": 1636522557.0
    },
    {
        "author": "Living_Impact_7047",
        "created_utc": 1637592235,
        "id": "qzmyds",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "Hey guys I'm 20 years old and started investing a couple months back.\n I saw a few companies I saw I liked \nZillow, Lemonade, PayPal, Fubo, and Apple\n\nZillow was a really big buy for me I bought 250 shares on an average purchase price of $89 I thought Zillow had a lot of potential to go to $125 so even though I don't usually put more then 10% of my portfolio in one company I thought is saw a great deal so I put a lot of money in to it I thought I got a great deal at 89\n\nLemonade I bought on an average purchase price of $64 to me it looked like the robinhood of insurance and I thought I got another great steal because I thought it can hit $90\n\nPayPal I bought 50 shares on an average purchase price of $225 yet again I thought I had a great deal but the stock is really tanking\n\nFubo tv I bought for an average of $25 I really loved how they are growing they have 1 million subscribers and its a good tv provider for very cheap\n\nApple was  a really good investment for me it gave me a really nice return I bought at 100 shares at $120\n\n\n\nI'm going to hold all these companies I have a feeling of regret that's  bothering me because I lost all that money the way I get rid of those thoughts is knowing I'm the only one I know at 20 years old with 50k   but it's still a lot of money to lose but knowing I have 50k and a lot of people that are 30 don't have that brings me some peace in mind",
        "subreddit": "wallstreetbets",
        "title": "I'm 20 years old and I went from 80k to 50k",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qzmyds/im_20_years_old_and_i_went_from_80k_to_50k/",
        "created": 1637621035.0
    },
    {
        "author": "KitKatBarMan",
        "created_utc": 1636057696,
        "id": "qmts51",
        "num_comments": 16,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "PYPL Yolo day 3.",
        "url": "https://i.redd.it/obuxo58y1nx71.png",
        "created": 1636086496.0
    },
    {
        "author": "ykilu2009",
        "created_utc": 1636468882,
        "id": "qq53t8",
        "num_comments": 14,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "RBLX gains ~+450k, added my beautiful PYPL calls as well I bought yesterday",
        "url": "https://www.reddit.com/gallery/qq53t8",
        "created": 1636497682.0
    },
    {
        "author": "Noir-21",
        "created_utc": 1635939577,
        "id": "qlsko6",
        "num_comments": 12,
        "num_crossposts": 0,
        "selftext": "Hey guys,  \nHope everyone is doing well!\n\n$PINS is reporting earnings tomorrow and I'm curious to see how some of you are going to play it out. \n\nOf course everyone was aware of the news around PayPal acquiring them and in the end it turned out it was just a rumor. Some say that was based on Pinterest's announcement of enabling sellers to upload images and catalogues and offering them directly to an online audience. \n\nThe expansion into online shopping is what makes Pinterest attractive to PayPal and the other digital payment companies. A number of analysts say they expect the tie-ups within e-commerce/social media companies and digital payment giants to grow in the future. \n\nThe bad news around PINS is that the co-founder Evan Sharp is stepping down from the company and has sold all of his shares in the month of October. According to Finviz, a number of other insiders has been selling stock recently as well. \n\nThe other bad news is that Pinterest reported it had lost 42 million active monthly users as we are moving out from the pandemic. \n\nSo what's your take and where do you see PINS going tomorrow?",
        "subreddit": "wallstreetbets",
        "title": "$PINS - Pinterest Earnings",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qlsko6/pins_pinterest_earnings/",
        "created": 1635968377.0
    },
    {
        "author": "liberalvisa",
        "created_utc": 1636651840,
        "id": "qrqc7g",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "“Mad Money” host Jim Cramer explained Wednesday why he believes investors should take advantage of the recent pullback in PayPal shares\n\n[Video](https://www.cnbc.com/video/2021/10/13/jim-cramer-says-paypal-is-a-buy-after-pulling-back-from-its-high.html)\n\nPayPal (NASDAQ:PYPL) price was beaten down after a series of events and yesterday the CEO has delivered a weak guidance despite announcing the partnership with Amazon. They are well established, and they have a solid track record with big growth potential. With the current price, it offer investor a better opportunity to enter into the stock and potentially to buy at a lower price.\n\n**I had bought PayPal (NASDAQ:PYPL) and below is my analysis:**\n\n**My analysis for PayPal**\n\n1. The company had **377 million active accounts at the end of 2020, including 29 million merchant accounts**. The company also owns Xoom, an international money transfer business, and Venmo, a person-to-person payment platform.\n2. **Positive Earning Trend and debts are well covered.**\n\nTheir profit margin have been growing from 5.2% in year 2014 to 20.4% in year 2021. They have grown significantly by an average of 25% per year over the past 5 years.\n\nLast profit margin is 20.1% as at 30 September 2021 with a net income of USD4,997 Millions\n\nHigh ROE - 23.3% (ROE indicates how well a company's management deploys shareholder capital).\n\nLiabilities - debt to equity ratio of 36% (Total debt 7,949 Million / Total Equity 22,090 Million) as at Sep 30, 2021. *As interest rate is low, it is an excellent strategy to take on more debts to have more rooms for business expansion. Note that the debts to equity ratio had reduced from 42.8% to 36% in a quarter.*\n\nDebt Coverage - PayPal is well covered by operating cash flow (74.5%)\n\nInterest Coverage - PayPal's interest payments on debts are well covered by EBIT (35.7x coverage)\n\nCash &amp; Short term investments improves from USD$12.4 billion to USD$13.292\n\n**3. Partnership with Amazon**\n\nPayPal said it had inked a deal with Amazon to allow the firm’s Venmo wallets in the U.S. to be accepted on Amazon’s website and mobile app starting next year. Amazon being the largest e-commerce in the world, has **300 million active users** as of (1 November 2021) and **162 million active users** are from US. Due to Amazon’s global scope and reach, it is also considered one of the most valuable brand worldwide. This also means that PayPal got to access to Amazon users and the payments can be done through PayPal's Venmo wallets. This is going to be the biggest revenue source going forward.\n\n**4. Plenty of room to grow in the ecommerce space**\n\nThere is still plenty of runway for growth in electronic payments. Electronic payments only surpassed cash payments on a global basis a couple of years especially during the pandemic period where the baby boomer started to explore the online and as well as developing countries who started to use online and more of the payment services. Over the years, PayPal had built a good reputation on the payment services for being highly secured and as well as bringing conveniences.\n\n**5. Unique business Model - ability to combat fraud**\n\nI believe this area is critical, no one wishes their credit/debit card information to be leaked or to be hacked and misused. **Using PayPal is extremely secured.**\n\nPayPal have this unique business model centers around a two-sided platform, with PayPal enjoying relationships with both merchants and consumers. This approach has material benefits and was instrumental in allowing PayPal to develop its current foothold in the industry. Having information on both sides of the transaction gives PayPal a meaningful edge in combating fraud, which was a very meaningful factor in the early days of the Internet, and remains a key issue.\n\nWith an ability to combat fraud, PayPal was in a position to become a valued partner on both sides of a payment. (Source: Morningstar) With this feature, I will always opt to have my items checkout using PayPal if there is an option for it because I know it will be highly secured.\n\n**6. Who owns PayPal, who are the shareholders?**\n\nPayPal are mostly institutional/ fund houses which make up of 82%. This means that many mutual funds or pension funds have invested PayPal for their long term value. \n\n**Conclusion**\n\nI believe with such a mega cap company, well established company and with lots of potential to grow. No doubt, they might face some competition from square, Apple pay and Alipay but PayPal has already a huge and stable customer based (377 million active users) and they will have the potential to grow even more as popularity on online payments grew. At the current price, it is not expensive.",
        "subreddit": "wallstreetbets",
        "title": "Jim Cramer explained Wednesday why he believes investors should take advantage of the recent pullback in PayPal shares - BUY",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/qrqc7g/jim_cramer_explained_wednesday_why_he_believes/",
        "created": 1636680640.0
    },
    {
        "author": "MrComedy325",
        "created_utc": 1636465065,
        "id": "qq3unt",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Shares of PayPal (Nasdaq: PYPL) dropped 5.04% in after-hours trading on Monday after the fintech giant posted mixed earnings results, but announced a new partnership.\n\nNumbers: PayPal reported a $1.11 earnings per share, which was better than analyst projections. But, its revenue of $6.18 billion fell slightly under expectations.\n\nChallenges: In particular, its eBay (Nasdaq: EBAY) numbers were not that good, with eBay marketplaces volumes dropping 45%. The company also lowered its full-year guidance.\n\nNew Partnership: On the bright side, PayPal announced a new partnership that will allow users in the U.S. to pay with Venmo while checking out on Amazon (Nasdaq: AMZN).\n\nQuote: “The strength of PayPal’s two-sided platform and ubiquity in our core markets has set us up to grow at scale, expand our work with existing merchants and attract new partners.” - PayPal President and CEO Dan Schulman.\n\nFinal Thoughts: PayPal was very successful during the pandemic. It will need partnerships, such as the new one with Amazon, to help the company in a post-pandemic world.\n\nHope you enjoyed this commentary. Please subscribe to Early Bird, a free daily newsletter that helps you identify investment trends: https://earlybird.email/",
        "subreddit": "StockMarket",
        "title": "PayPal Expands Venmo to Amazon",
        "url": "https://www.reddit.com/r/StockMarket/comments/qq3unt/paypal_expands_venmo_to_amazon/",
        "created": 1636493865.0
    },
    {
        "author": "stonkstistic",
        "created_utc": 1637164055,
        "id": "qw24gz",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "PayPal looks like it is at an extremely attractive price right now. Anybody else think we are at a good price for a good hold? I'm going to start loading up using 210 as my bottom and buying up thru 215 thru Friday. Throwing 10k at it. Not advice in the least bit. Just want to spark a discussion. I didn't do any dd other than look on Google for this one. \n\nSomething I have looked into however is desert mountain energy. They're lined up to sell helium out of Arizona to surrounding areas Inc gov contracts likely to come once they're producing within the year. Worth a look and discounted at the moment because their 4th well results weren't amazing compared to others but anyone who knows about mining and drilling startups knows they're doing great and have great numbers. I trust engineers more than businessmen.\n\nLast question... do you think Ford will sell rivian shares soon?",
        "subreddit": "stocks",
        "title": "Some light discussion on PayPal, Desert Mountain Energy and Ford",
        "url": "https://www.reddit.com/r/stocks/comments/qw24gz/some_light_discussion_on_paypal_desert_mountain/",
        "created": 1637192855.0
    },
    {
        "author": "SkinnyStacks",
        "created_utc": 1637197418,
        "id": "qwdsmd",
        "num_comments": 11,
        "num_crossposts": 0,
        "selftext": "Interested in both of these as they look to be at a decent discount. Was looking for some opinions on which one you would go with at the current prices and why?\n\nPYPL being the larger company that currently took a solid hit.\n\nPSFE being the smaller company that is more of a buyout/merger prospect, but also took a large hit recently.\n\nHave read most DD's and know most of the pros and cons, just looking for some opinions.\n\nThanks!",
        "subreddit": "smallstreetbets",
        "title": "PYPL vs PSFE, Discount? Better Play?",
        "url": "https://www.reddit.com/r/smallstreetbets/comments/qwdsmd/pypl_vs_psfe_discount_better_play/",
        "created": 1637226218.0
    },
    {
        "author": "greensymbiote",
        "created_utc": 1636031961,
        "id": "qmke65",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "Here are the final Parts 8-10, of an article addressing the main bear arguments on Paysafe.  Parts 1-7 covered Paysafe’s outlook on growth, debt, and profit, along with insider ownership and competition.  I recommend starting with the [introduction in Part 1](https://www.reddit.com/r/stocks/comments/qlw7ro/peeling_back_the_layers_on_paysafe_psfe_parts_57/) (Growth), and following the links from there if still interested.\n\n&amp;#x200B;\n\n# 8. Management\n\nAs part of Paysafe’s preparations for the next phase of growth, the company has undergone a complete management overhaul. Along with replacing nearly all the Board of Directors, in the last two years, they’ve hired a new CEO, new CFO, new CTO, new CIO, new CRO and new CISO. They’ve hired PayPal’s Chief Risk Officer and have also filled key division CEO positions with Facebook’s Head of Payments and Amazon Intl’s Head of Payments.  This does not sound like an operation with a passive outlook.\n\nStill, many are rightfully frustrated that management has done little publicly to support the share price since going public. Despite a steady supply of [positive news](https://www.reddit.com/r/PSFE/comments/oak2jx/paysafes_value_creation_trajectory_is_very_much/), the CEO has not once meaningfully engaged the media to highlight Paysafe’s value story.  It may be that management is deliberately downplaying its messaging while shares move from short-term trader’s hands to those of value-seeking funds in order to better secure long-term share value.  Or, they are simply focused on producing the numbers.\n\nRegardless, what management may lack in public storytelling, it makes up for in execution. In the short time since they went public, they have announced 3 new acquisitions and over 25 expanded partnerships with the likes of [Visa](https://www.paysafe.com/en/paysafegroup/news/detail/skrill-usa-launches-skrill-virtual-visar-prepaid-card-in-us/), [Coinbase](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-issues-coinbase-s-new-visa-debit-card-enabling-easier-cryptocurrency-spending/), [Fubo Gaming](https://www.paysafe.com/eu-en/paysafegroup/news/detail/paysafe-streamlines-payments-for-interactive-wagering-with-fubo-gaming-in-us/), [FOXbet](https://www.njgamblingfun.com/nj/sports-news/paysafe-continues-its-push-into-online-gaming), [Golden Nugget](http://www.greensheet.com/newswire.php?newswire_id=53685), [Bankable](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-partners-with-bankable-to-provide-omnichannel-banking-services/), [Wix](https://www.pymnts.com/digital-payments/2021/smbs-can-accept-payments-with-paysafe-skrill-on-wix/), [Repay](https://www.repay.com/repay-partners-with-paysafe-to-enable-u-s-merchants-to-accept-online-cash-payments/), [WynnBet](https://www.electronicpaymentsinternational.com/news/wynnbet-taps-paysafe-for-payments-and-marketing-solutions/), [Betfred USA](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-expands-betfred-usa-sports-partnership-through-income-access-deal/), [OwnersBox](https://incomeaccess.com/contenthub/ownersbox-launches-affiliate-program/), [Dutch neobank bunq](https://www.paysafe.com/eu-en/paysafegroup/news/detail/bunq-partners-with-paysafe-to-enable-cash-deposits-for-digital-banking/), [IntelliPay](https://intellipay.com/paysafe-expands-us-partnership-with-intellipayto-offer-online-cash-payments/), Glory Ltd, Parx Interactive, TripGift, SweePay, SimplePayMe, [Smart Property Systems](https://globalfintechseries.com/banking/digital-payments/paysafe-partners-with-smart-property-systems-in-north-america/), Ambassador Cruise Line, Shelby Financial, ResponseCRM, ZEN, [Montana Lottery](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-powers-online-payments-for-montana-lotterys-sportsbook/), PlayUP, [SuperBook Sports](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-platform-launches-with-superbook-sports-in-colorado-and-new-jersey/) and [Bitrise](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-accelerates-innovation-with-bitrise-for-faster-digital-wallets-payments/).\n\nIn that same period, they’ve also:\n\n* expanded their US launch of digital wallet Skrill to [48 states](https://www.paysafe.com/en/paysafegroup/news/detail/paysafes-skrill-expands-its-crypto-service/),\n* expanded their digital wallets to [trade](https://www.paysafe.com/en/paysafegroup/news/detail/paysafes-neteller-launches-fiat-to-crypto-withdrawal-service/) 38 \\[digital\\]currencies and 40 global fiat currencies\n* launched online cash payments on Microsoft’s [Xbox](https://www.pymnts.com/news/payment-methods/2021/xbox-gamers-can-now-pay-with-cash-online-with-paysafe/) in 22 countries\n* struck deals with [Snowflake](https://www.atmmarketplace.com/news/paysafe-integrates-snowflake-to-power-cloud-based-approach-for-enhanced-customer-experiences/) and Amazon’s [AWS](https://www.electronicpaymentsinternational.com/news/paysafe-partners-aws-to-become-cloud-based-payments-provider/) to support its migration to a cloud-based platform as part of their strategy to scale quickly and leverage data to drive customer acquisition,\n* [launched](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-launches-safeguarding-model-for-the-travel-industry-globally/) a new global travel safeguarding model,\n* a unique innovation that quickly led to a new [deal](https://www.paysafe.com/eu-en/paysafegroup/news/detail/paysafe-and-arc-partner-to-deliver-innovative-payments-solution-for-airlines/) with ARC, a payment settlement service that processes $97 billion for over 200 airlines globally.\n\nAlso during this time, they announced the appointments of:\n\n* Digital wallet division CEO, [Chirag Patel](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-appoints-chirag-patel-to-lead-its-digital-wallets-division/) (fmr Head of Payments at Amazon Intl., Santander)\n* North American iGaming CEO, [Zak Cutler](https://www.paysafe.com/en/paysafegroup/news/detail/paysafe-appoints-zak-cutler-to-lead-its-north-america-igaming-business/) (fmr DraftKings exec),\n* Boardmember [Mark Brooker](https://fxnewsgroup.com/forex-news/executives/paysafe-appoints-mark-brooker-as-non-exec-director/) (fmr COO Betfair, non-exec dir. William Hill)\n\nAll that done while reporting a profitable quarter, beating on revenue and EPS consensus, reporting 41% total payment volume (TPV) growth, refinancing all debt for significant cost savings, after putting deals in place throughout North America to lead in any new iGaming market as soon as it opens (as just happened with their 100% positioning in Canada’s [newly opened](https://ca.news.yahoo.com/canada-legalizes-single-game-sports-191629457.html) sports betting market).  As Bill Foley said, “we’re seeding the future growth right now… The day a state opens up, we are there ready from a regulatory perspective, from a risk perspective, and from a product perspective…It’s our job to be there first and to make sure we dominate.”  They have not slept on this promise even as they quietly lay the groundwork to do the same thing in South America.\n\nLastly, major shareholder and Paysafe Chairman of the Board, Bill Foley has repeatedly proven himself to be a trusted and highly effective deal maker with a remarkably consistent track record in growing shareholder value.  Bloomberg describes Foley as someone who prides himself on operating experience, who has a known talent for corporate maneuvering and brings with him a full team of seasoned financial managers.\n\nThe types of acquisitions described in Part 1 are central to Paysafe’s “value creation playbook” which is exactly how Foley, grew FIS 36x from a market cap of $2.5 billion to over $90 billion. From the beginning of the deal to bring Paysafe public, Foley [said](https://www.paysafe.com/fileadmin/user_upload/Foley-Trasimene-Acquisition-Corp-II-and-Paysafe-investor-call-Final.pdf), “those characteristics of FIS are right in line with what we plan on doing with Paysafe... FIS has very similar characteristics to Paysafe – an attractive platform with a defensible market position. Upside from acquisition integration, platform consolidation and cross-selling. We will cross-sell, cross-sell, and cross-sell.”\n\nIn this context, it’s worth underscoring Foley’s undeniably history of simultaneously growing multiple companies.  Over just the last six years, Foley successfully grew Ceridian 3.3x, Dun &amp; Bradstreet 5.6x, and Black Knight 8.7x. He’s also known for growing Fidelity National Financial from $3 Million market cap to $10.8 Billion (3,600x). In all cases, he has significantly expanded their margins between 500 to 1800 bps. Foley said, “My whole history and career has been around acquiring companies and fixing companies.”  Though he’s not Paysafe’s front man, his fingerprints are evident and IR has recently assured that “  Bill is highly engaged with the company.” Personally, I don’t doubt it.\n\n&amp;#x200B;\n\n# 9. Lockup Expiration\n\nSome bears still point to PSFE overhang from lockups but all share lockups expired months ago, except for founder shares which constitute about 4% of outstanding shares ([20F p. 135](https://www.sec.gov/Archives/edgar/data/1833835/000119312521104105/d159702d20f.htm#toc)). That lockup is expected to expire in December. Personally, lockup expiry of such a small percentage of shares is not deterring me from continuing to build a position before Paysafe starts reporting better numbers. This is especially true when those shares are controlled by Chairman Foley, who is central to Paysafe’s value creation playbook. Between Foley’s consistent track record, the proxy statement below and Blackstone’s stance on future growth, all signs indicate a long-term hold.\n\nUpon approving the deal to bring Paysafe public, the founders identified “base returns for a four year hold period” of “2.9x to 3.8x” from $10.\n\nFrom their proxy statement (SEC filing-[DEFM14A](https://pdf.secdatabase.com/2681/0001193125-21-060961.pdf)): “The Business Combination could provide base returns for a four year hold period assuming exit multiples between 20-25x next twelve month EBITDA, reflecting a range of internal rate of return of 30.9% to 39.2% and a multiple on invested capital of 2.9x to 3.8x, in each case, based on the FTAC initial public offering price of $10.00 per share, while recognizing that the achievement of such returns could not be assured, and that the Business Combination has similar characteristics to other transactions involving Mr. Foley in the financial technologies industry, including an attractive platform with a defensible market position and multiple attractive acquisition opportunities to strengthen market position further, each of which made PGHL an attractive investment for FTAC.”\n\n&amp;#x200B;\n\n# 10. Valuation\n\nPaysafe is building an integrated architecture that is worth more than the sum of its parts.  By leveraging an asset-light cloud-based model to efficiently scale up in new high growth markets globally, Paysafe is a perfect example of the low capex Fintech profile that generally warrants high valuation multiples.\n\nNow trading around 4x a conservative F2022 revenue with nearly every institutional owner’s cost basis 20-40% higher than the current price, it would appear PSFE is severely undervalued. Perhaps because Paysafe didn't go public via the traditional IPO method it is being lumped in with highly speculative pre-revenue ventures.  But Paysafe is anything but that.\n\nOr maybe the current low price is simply a reflection of broadly disseminated misleading information like the articles on debt quoted in Part 2 or like the several articles falsely claiming Paysafe went public at a 3x higher valuation above its 2017 take private price. Some articles claim this by mistaking British pounds for US dollars while a Yahoo Finance article claimed a \"300% higher\" valuation with bad math and a false comparison between enterprise value (inclusive of debt) and a misquoted 2017 market cap price of “$3.7 billion”, exclusive of debt.  Inclusive of debt (enterprise value), Paysafe was taken private for $4.7 billion, according to [Reuters.](https://www.reddit.com/r/PSFE/comments/qfopku/credit_suisse_revised_to_neutral_detail/)  To make its bear case, that article misquotes the relevant 2017 take private value by a full billion dollars.\n\nInitially, I wondered why just about every bearish article relied on faulty or misleading information to make its valuation case, or why so many platforms misreported PSFE’s financial data, like YF’s overstating a Q1 EPS miss as -0.23 EPS instead of -0.05 (fixed months later); or why does a [Credit Suisse analyst](https://www.reddit.com/r/PSFE/comments/qfopku/credit_suisse_revised_to_neutral_detail/) offer new price targets 4 times in 5 months with the first change just two days after initiating coverage and the last change, to neutral, just two weeks before Q3ER.  Instead of waiting a few days for new data highly relevant to his thesis, the analyst cites, as if Q2 were a new revelation, months old information most of which was available before he first initiated coverage. (Coincidentally, he issued this two minutes before pre-market, precisely when PSFE was on the verge of breaking above the confluence of its 9-month downtrend resistance line and the 50DMA).  Negligence or intentional price manipulation, take your pick.  Skeptics may cringe at this idea but this is really nothing new.  It’s not like the market is [unaware](https://www.sec.gov/tm/reportspubs/investor-publications/investorpubsanalystshtm.html) of analyst [conflicts of interest](https://web.williams.edu/Economics/Honors/2004/MSirignanoThesis.pdf) or that Credit Suisse has shown itself to be an upstanding market participant (think lawsuit for misleading investors on [Archegos](https://fortune.com/2021/07/29/credit-suisse-report-archegos-loss-bank-massive-culture-problem/), [$5.3B fine](https://www.cnbc.com/2016/12/23/deutsche-bank-and-credit-suisse-agree-billion-dollar-fines-with-us-authorities.html) for mortgage backed securities,[$2.5B fine](https://cn.reuters.com/article/uk-creditsuisse-investigation-idUKKBN0E00WM20140520) after pleading guilty for aiding in tax fraud, and the recent [$547M fine](https://www.justice.gov/usao-edny/pr/credit-suisse-resolves-fraudulent-mozambique-loan-case-547-million-coordinated-global) after admitting to regulatory breaches, secret loans, lying to authorities and spying on employees). On the other hand, this could be CS trying to clean up its act by playing it safe or an analyst trying to preserve his reputation by keeping price targets closer to market.  If so, this may have the flip-side benefit of future incremental upgrades.\n\nObviously, this is all conjecture, which really doesn’t matter in the long run.\n\nTrue price discovery will take form as share rotation plays out and Paysafe's value story becomes clear.\n\n&amp;#x200B;\n\nUntil then, here are a few reference points:\n\n&amp;#x200B;\n\nLooking at Paysafe’s eCash segment as a separate company:\n\nThe eCash segment is a high margin business with over 12 million active users, $5 billion in volume, $405 million in TTM revenue and $157 million EBITDA. For H1/21, they just reported 49.4% YoY revenue growth and 81.6% YoY EBITDA growth. Not many Fintech companies can claim that.\n\nAdyen is a Fintech with a similar growth profile, (46% YoY revenue growth and 27% YoY EBITDA growth). Applying Adyen’s 19x EV/rev ratio to Paysafe’s eCash business alone, would give it a $7.6 billion enterprise value. That’s close to the current valuation of the entirety of Paysafe, yet this one segment represents less than a third of total revenue.\n\nUsing Adyen’s EV/EBITDA ratio of 149x would value Paysafe’s eCash segment at $23.3 billion. Even when applying the company’s entire debt to that one segment, the share price for just the eCash business alone would still be $26.62.\n\nAgain, that represents less than a third of Paysafe’s total business.\n\n&amp;#x200B;\n\nBrick &amp; Mortar Payment Processing\n\nPaysafe is a value play right now but bears focus on growth.  Paysafe has an established history of 27-30% CAGR but because recent growth was temporarily stifled by China de-risking exits and Covid-related closures, some equally hard-hit brick &amp; mortar payment processing partners, like Visa and Mastercard, offer an interesting comparison.\n\nFor 2020, Visa reported negative YoY revenue growth (-8.7%) and negative EBITDA growth (-10.2%). Similarly, Mastercard reported negative YoY revenue growth (-9.4%) and negative EBITDA growth (-14.20%). Their forward growth is projected to be 7.7% and 10% respectively.\n\nIn all forward growth metrics, including EBITDA and EPS, they do worse than Paysafe, yet they both trade at an EV/Rev multiple of roughly 24X.  This would put PSFE at $41.80.\n\n&amp;#x200B;\n\nDigital Wallet vs. Digital Wallet\n\nMany compare the #1 digital wallet, PayPal, to the #2 digital wallet, Paysafe, so, hopefully without striking a nerve, here’s a deeper look into that comparison:\n\nAs noted earlier, Paysafe’s stock was recently clobbered down 30% (to 3.2x P/S) on soft Q3 guidance even though they reaffirmed full year guidance and beat consensus on revenue and EPS.\n\nBy comparison, PayPal missed Q3 guidance for both revenue and EPS. PayPal was also reported to be falling short on their 2021 full year guidance AND they missed on Q2 revenue consensus while also reporting a -23%YoY decline on EPS. PYPL only went down 10% (from a lofty 15x P/S) as news outlets characterized PayPal’s troubles as a “buying opportunity.”\n\nSome will reasonably say that’s because PayPal has such strong growth history but, from the time PayPal’s numbers were available separately from its parent eBay, 2012-2020, PayPal grew 17.8% CAGR ([$5.6b](https://en.wikipedia.org/wiki/PayPal) to [$21.5b](https://s1.q4cdn.com/633035571/files/doc_financials/2020/q4/Q4-FY-20-PayPal-Earnings-Release.pdf)). In that same period, Paysafe has grown 30.5% CAGR ([$169m](https://www.investing.com/analysis/optimal-payments:-still-at-discount-despite-ebitda-growth-137908) to [$1.43b](https://d1io3yog0oux5.cloudfront.net/_60f30e3ae06e5db5459655316a65dc97/paysafe/db/1111/9761/file/Supplemental+Financial+Information_+Paysafe+Limited_+Q1+2021.xlsx)).\n\nPaysafe reported 27%CAGR prior to 2020’s restructuring and, in just the last year, when excluding Paysafe’s 2020 de-risking exits, they reported 23% YoY growth for Q2 which is on par with PayPal’s recent report of 19% YoY growth. This comparative history serves only to show that Paysafe has a strong track record that should not be discounted.\n\nPaysafe is still priced as if it is a zero growth, pre-revenue speculative venture. Meanwhile, though some have called PayPal a “free cash flow machine,” Paysafe already generates proportionately more free cash flow than PayPal (25% FCF margin vs. 20% FCF margin).\n\nThere’s obviously more to this complex story but, for reference, below is PSFE potential share value when applying PYPL’s multiples (now 25% off highs) when factoring in all of PSFE’s potential acquisition debt and dilution:\n\n* PayPal’s EV/FCF ratio of 66.9X puts PSFE at $33.10\n* PayPal’s EV/EBITDA ratio of 44.3X puts PSFE at $24.90\n* PayPal’s Price to Sales ratio of 13.5X puts PSFE at $28.40.\n* PayPal’s EV/Rev ratio of 12.4x puts PSFE at $20.75\n* PayPal’s free cash flow yield of 1.7% puts PSFE at $29.41\n\nThose metrics average to a share price of $27.31\n\nWhen factoring in a potential 24% growth, 35% EBITDA margin, 75-80% FCF conversion, the potential share value climbs fairly quickly.\n\n&amp;#x200B;\n\nSector multiples:\n\nBecause Paysafe is far more diversified than the average Fintech, a while back I compared it to a wide basket of Fintech peers including PayPal, Square, Nuvei, Repay, Shift4, Adyen, Affirm, BILL, GPN, and Paysign. Collectively, they have a \\~12.5% growth rate. Unlike Paysafe, a third of this group reported negative free cash flow and negative EBITDA and half reported negative EBITDA growth. Paysafe also currently has better EPS and a better Debt/EBITDA ratio than over half the group.\n\nAfter removing the top-end outliers in each category that put PSFE above $100 and discounting all by an additional 10%, here’s Paysafe’s share price with the averaged peer multiples:\n\n* EV/EBITDA ratio : $45.67\n* EV/Rev ratio : $40.17\n* EV/FCF ratio : $39.72\n\nAverage : $41.84\n\n&amp;#x200B;\n\nIt's worth pointing out here that, as happened with FIS’s tremendous growth history, stock prices tend to temporarily pull back in association with acquisitions. This may explain some of PSFE’s recent price action, but certainly not all.\n\n&amp;#x200B;\n\nSure, it’s easy to read all of the material in Parts 1-10 and say, “the market doesn’t care,” but I’m confident that’ll change when share rotation settles and quarterly ER’s gradually shift focus from the past to the future.  Stripped of superficial misdirection, bear arguments often devolve down to variations of “look at the chart” and “price is truth.”  This has been said about many companies in the past as they position themselves for future growth.\n\nNo, this is not the next Amazon but Bezos had it right when he said, “The stock is not the company. And the company is not the stock. ... And so, while the stock price was going the wrong way, everything inside the company was going the right way.”\n\nDo with this what you will. These are simply observations. Feel free to correct any errors, point out things I missed or use this material any way you wish. To be perfectly clear, this is not financial advice. I am not a financial advisor nor am I associated in any way with any commercial interests beyond my own.  Given how much disinformation has been out there, I thought I’d do my bit to peel back the layers on what I consider to be a reliable long term investment.\n\n&amp;#x200B;\n\nThis concludes our public service announcement. We now return to normal programming.",
        "subreddit": "stocks",
        "title": "Gaining Visibility on Paysafe (PSFE) Parts 8-10",
        "url": "https://www.reddit.com/r/stocks/comments/qmke65/gaining_visibility_on_paysafe_psfe_parts_810/",
        "created": 1636060761.0
    },
    {
        "author": "infected_butter",
        "created_utc": 1637376413,
        "id": "qxvz9k",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "",
        "subreddit": "wallstreetbets",
        "title": "PYPL why you do this to me!",
        "url": "https://i.redd.it/knbao945zn081.png",
        "created": 1637405213.0
    },
    {
        "author": "psychotrader00",
        "created_utc": 1637360264,
        "id": "qxqzpj",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": " \n\n**PsychoMarket Recap - Friday, November 19, 2021**\n\nThe stock market traded mixed today, with the both the S&amp;P 500 (SPY) and Dow Jones (DIA) slipping whiled the tech-heavy Nasdaq (QQQ) outperformed on the day, driven higher by a strong performance in mega-caps like Apple (AAPL), Microsoft (MSFT), and NVIDIA (NVDA). Market participants continue to digest mixed economic data, with retail sales surprising to the upside despite the fastest pace of inflation in roughly 30 years. Moreover, market participants are growing increasingly concerned about a wave of new COVID with new restrictions announced in Europe and cases in the US ticking back higher after two consecutive months of declines.\n\nNotable Numbers Today\n\n* SPY: -0.19%\n* QQQ: +0.56%\n* DIA: -0.76%\n* Russell 2000 (IWM): -0.91%\n* Apple (AAPL): +1.70%\n* NVIDIA (NVDA): +4.14%\n* Roblox (RBLX): +6.82%\n* PayPal (PYPL): -3.44%\n* Lucid Motors (LCID): 17.34%\n\nMarkets were unsettled after a slew of European countries announced new COVID-related restrictions as the winter holidays begin. The Austrian government announced a full lockdown starting Monday in response to surging COVID cases. The lockdown will include both those vaccinated and unvaccinated, it will last for 10 days minimum, but could be extended for 10 days further. \n\nJim Reid, Chief Economist at Deutsche Bank, said “although all the headlines are in Europe at the moment, will the U.S. be more vulnerable than many European countries over the course of the full winter? Recent history suggests the U.S. has a higher bar for economic restrictions related to covid but it also has a lower vaccination rate than their European peers.”\n\nIn particular, the price of oil sank by over 3%, reflecting jitters that lockdowns will curb energy demand. However, Goldman Sachs said “Just like with headlines on Wednesday, we estimate this move lower has far overshot the actual fundamental risk due to low trading volumes.\n\nAdding another wrench in the plans, President Biden is expected to announce his nominee to be the Chair of the Fed. So far, the two main candidates are incumbent Jerome Powell and current Fed Governor Lael Brainard. \n\nYesterday, the Labor Department’s Weekly Unemployment Report came in slightly higher than expected but still eked out a new pandemic-era low. Here are the numbers:\n\n* **Initial unemployment claims, week ended November 13:** 268,000 vs. 260,000 expected and an upwardly revised 269,000 during prior week \n* **Continuing claims, week ended November 5:** 2.080 million vs. 2.120 million expected and an upwardly revised 2.209 million during prior week\n\n**Highlights**\n\n* The FDA approved boosters of the Pfizer/BioNTech (PFE, BNTX) and Moderna (MRNA) COVID-19 vaccines for all adults in the US.\n* Apple regained the mantle of most valuable company from Microsoft, with the company reaching a fresh all-time high today\n* After a pop in the beginning of November, weed stocks continued their steep declines as nationwide legalization efforts in the US continue to falter. The largest fund tracking the pot industry, ETFMG Alternative Harvest ETF (MJ) tumbled to its lowest price since last year and is down 60% from its high in February.\n* As talked about yesterday, Apple (AAPL) is reportedly accelerating development on its fully autonomous Apple Car, set to debut in 2025. A Morgan Stanley analyst said the car would double revenues and market value.\n* The Pentagon announced it has issued formal solicitations to Amazon (AMZN), Microsoft (MSFT), Alphabet (GOOG), and Oracle (ORCL) for a multibillion-dollar cloud-computing contract to replace the JEDI procurement, which became mired in litigation between Microsoft and Amazon and objections from Congress.\n* **\\*\\*Please note that current stock price was written during the session and may not reflect closing prices\\*\\***\n* Applied Materials (AMAT) with a host of target raises following its earnings report. Average price target $175 at Buy. Stock currently around $150\n* ConocoPhillips (COP) target raised by Morgan Stanley from $90 to $95 at Overweight. Stock currently around $70\n* Chevron (CVX) target raised by Morgan Stanley from $149 to $155 at Overweight. Stock currently around $112\n* Diamondback Energy (FANG) with two target raises. Stock currently around $102\n   * Wells Fargo from $112 to $137 at Overweight\n   * Morgan Stanley from $122 to $150 at Overweight\n* Globant (GLOB) with two target raises. Stock currently around $306\n   * Piper Sandler from $300 to $352 at Overweight\n   * Citigroup from $310 to $370 at Buy\n* Hess (HESS) target raised by Morgan Stanley from $115 to $117 at overweight. Stock currently around $76\n* HubSpot (HUBS) target raised by Argus from $930 to $970 at Buy. Stock currently around 2.1%\n* Intuit (INTU) with a host of target raises after posting blowout earnings. Average price target $800 at Overweight. Stock currently around $692\n* Palo Alto Networks (PANW) with a host of target raises (literally 12). Average price target $600 at Buy. Stock currently around $530\n* Plug Power (PLUG) target raised by Morgan Stanley from $43 to $65 at Overweight. Stock currently around $45\n* Tesla (TSLA) target raised by Wedbush from $1100 to $1400 at Outperform. Stock currently around $1135\n* Workday (WDAY) with three target raises. Stock currently around $286\n   * Barclays from $340 to $345 at Overweight\n   * Goldman Sachs from $340 to $345 at Buy\n   * Needham &amp; Co from $310 to $360 at Buy\n\n\"It does not matter how slowly you go as long as you do not stop.\" -*Confucius*",
        "subreddit": "stocks",
        "title": "Here is a Market Recap for today Friday, Nov 19, 2021. Please enjoy!",
        "url": "https://www.reddit.com/r/stocks/comments/qxqzpj/here_is_a_market_recap_for_today_friday_nov_19/",
        "created": 1637389064.0
    },
    {
        "author": "EvangelineRain",
        "created_utc": 1635808242,
        "id": "qkqg80",
        "num_comments": 10,
        "num_crossposts": 0,
        "selftext": "In an experience that taught me the limitations of stop limit orders, I am currently holding PayPal stock at a significant loss (bought near the ATH). And some call options that are negative, in a move that will optimistically be “buying the dip” or less optimistically “throwing good money after bad.”\n\nAny insights on what’s going on here? Original drop was because of earnings. Then it went down from there. Next was the Pinterest rumor drop. Then a temporary increase when they backed away from that idea (when I stupidly missed an opportunity to profit on an option), only to then drop further. I’m worried about what will happen to the stock when earnings are announced next week.",
        "subreddit": "StockMarket",
        "title": "Thoughts on what’s been happening with PYPL?",
        "url": "https://www.reddit.com/r/StockMarket/comments/qkqg80/thoughts_on_whats_been_happening_with_pypl/",
        "created": 1635837042.0
    }
]