[
    {
        "author": "larrytheliquidator",
        "created_utc": 1618431235,
        "id": "mqyzm1",
        "num_comments": 3,
        "num_crossposts": 0,
        "selftext": "Recently I took a small position in Hammerson PLC. Not a long term play but that should be a good rebound play as lockdowns ease up. However, the company has got some debt problems. Many investors are viewing Hammerson as the next Intu. However, reports of flocking to stores / massive increase in footfall has me bullish on the stock and that its current property valuations may undergo an impairment reversal in the near future. \n\nLike other investors, I'm concerned about the debt and how management is going to handle it. \n\nWhat factors do you look out for when determining whether or not a company is going to go bankrupt?\n\nHere is my list;\n\n* Is it generating enough operating cash flow to service debt repayments?\n* What is the interest cover on the company \n* How liquid is the balance sheet? \n* What type of assets does the company own?\n* Is there any massive insider selling? \n* Is the company breaching covenants / re-negotiating?\n* Is the debt callable? \n* Is the debt publically or privately held? \n* Are board members leaving during this challenge?",
        "subreddit": "ValueInvesting",
        "title": "Investing in a distressed company - what to look out for?",
        "url": "https://www.reddit.com/r/ValueInvesting/comments/mqyzm1/investing_in_a_distressed_company_what_to_look/",
        "created": 1618460035.0
    },
    {
        "author": "hiddenvalleyranch8",
        "created_utc": 1617858895,
        "id": "mmko65",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "[removed]",
        "subreddit": "wallstreetbets",
        "title": "INTU 05/21 $430",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mmko65/intu_0521_430/",
        "created": 1617887695.0
    },
    {
        "author": "Brothanogood",
        "created_utc": 1618853291,
        "id": "mu5ql0",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "Mastercard Inc said on Monday it had agreed to buy digital identity verification company Ekata in a deal valued at $850 million, as the global payments processor bets on a boom in demand for companies in the digital security space.\n\nEkata's products allow businesses to separate fraudsters from legitimate customers during digital interactions like opening an online account or making digital payments. It operates in three industries: e-commerce, payments and financial services, according to its website.\n\n\"The acceleration of online transactions has thrust global digital identity verification to the forefront as one of the biggest opportunities to build digital trust and combat global fraud,\" said Rob Eleveld, chief executive officer of Ekata, in a statement.\n\nSeattle-headquartered Ekata counts more than 2,000 companies as its partners, including credit reporting company Equifax Inc and software firm Intuit Inc, its website showed.\n\nIts products, which include Ekata Identity Graph and Ekata Identity Network, allow companies to combat online fraud, it said.\n\nIn February, Ekata said its revenue had surged in 2020, as the COVID-19 pandemic accelerated the adoption of e-commerce, boosting demand for services to safeguard against cyber fraud.\n\nEkata added 300 new customers last year, including food and grocery-delivery startup Postmates, which was acquired by Uber Technologies last year. (https://bwnews.pr/32qaUG7)\n\nThe payments processor said the deal is expected to close in the next six months, adding that it does not expect the deal to be a drag on its business for more than two years.\n\n[Source](https://finance.yahoo.com/news/mastercard-buy-digital-id-verification-134157685.html)",
        "subreddit": "stocks",
        "title": "Mastercard to buy digital ID verification firm Ekata in $850 million deal",
        "url": "https://www.reddit.com/r/stocks/comments/mu5ql0/mastercard_to_buy_digital_id_verification_firm/",
        "created": 1618882091.0
    },
    {
        "author": "lilpebble2021",
        "created_utc": 1617894123,
        "id": "mmtpie",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "**RE-INITIATING ON SOFTWARE NAMES…** *Adobe, Hubspot, Docusign and Intuit all at BUY*. VMWare comes in at Neutral. The framework that analyst Brad Sills is using addresses the “4 Ms”…. Market, Moat, Management and Margin potential. [Framework](https://rsch.baml.com/r?q=3ZJbwi7o-u9qjGbEyR8v3A&amp;e=daniel.nadler%40gmail.com&amp;h=8KalDA).  \n·         ***Adobe: 15% upside*****…** strong Digital Experience pipeline driving revenue acceleration with 2 year FCF CAGR of 15%. $570 target (based on 37x 2022 EV/FCF). [Adobe](https://rsch.baml.com/r?q=psCd55P5ZodqjGbEyR8v3A&amp;e=daniel.nadler%40gmail.com&amp;h=bLUQNg).  \n·         ***Hubspot: 20% upside*****…** CMS Hub interest strong. Expecting 25% revenue growth. $600 target (based on 20x EV/C22E revenue). [HubSpot](https://rsch.baml.com/r?q=7QbDSCeTETlqjGbEyR8v3A&amp;e=daniel.nadler%40gmail.com&amp;h=tFpb9A).  \n·         ***Docusign: 20% upside*****…** strong adoption cycle with Notary and Analyzer as near term catalysts. $250 target (based on 21x 2022 EV/Revenue). [DocuSign](https://rsch.baml.com/r?q=XBIbpWIyMEpqjGbEyR8v3A&amp;e=daniel.nadler%40gmail.com&amp;h=IdNxoQ).  \n·         ***Intuit: 15 upside…*** sustained market share gains with dominant QuickBooks and TurboTax brands. $460 target. [Intuit](https://rsch.baml.com/r?q=9h-EwuNeIwxqjGbEyR8v3A&amp;e=daniel.nadler%40gmail.com&amp;h=EXjQlw)  \n·         ***Splunk: 30% upside…*** this is the “top pick”. growing pipeline builds for the emerging observability suite, driving 30%+ ARR growth in the coming 3-5 years. $180 target. [Splunk](https://rsch.baml.com/r?q=yhmp!DygQN5qjGbEyR8v3A&amp;e=daniel.nadler%40gmail.com&amp;h=T4qDOg).  \n·         ***VMware: 16% upside…*** neutral initiation. core SDDC biz represents majority of revenue, where demand could be challenged as enterprises migrate to public cloud. $175 target",
        "subreddit": "wallstreetbets",
        "title": "Software Names via BAML. Any thoughts here? ANyone have a different view?",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/mmtpie/software_names_via_baml_any_thoughts_here_anyone/",
        "created": 1617922923.0
    },
    {
        "author": "Warrriors_1fan",
        "created_utc": 1619671332,
        "id": "n0wz18",
        "num_comments": 0,
        "num_crossposts": 0,
        "selftext": "NNOX has game changing product for X Ray technology that the whole world will be using very soon, the stock went down because of FDA approval and then more after FDA approval. I am all in on NNOX, it should be like Intuit Surgical very soon.  [https://www.engadget.com/nanox-arc-x-ray-demonstration-160045549.html](https://www.engadget.com/nanox-arc-x-ray-demonstration-160045549.html)",
        "subreddit": "wallstreetbets",
        "title": "NNOX being shorted for no reason",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/n0wz18/nnox_being_shorted_for_no_reason/",
        "created": 1619700132.0
    }
]