[
    {
        "author": "bingojed",
        "body": "I’m all for bashing adobe but gimp is no where near as good. User interface makes a huge portion of a product and gimp is bad. Affinity is close, however. Missing a few features and stability but for most people it will do.",
        "created_utc": 1578935985,
        "id": "fe9axj6",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1578964785.0
    },
    {
        "author": "IS_JOKE_COMRADE",
        "body": "Just sold 80k worth of ADBE. Market is too damn high. Insane to think this can continue. I'm now like...75% cash gang outside of retirement accounts, or 50% cash gang total.",
        "created_utc": 1577997583,
        "id": "fcv9qaw",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1578026383.0
    },
    {
        "author": "Obamasamerica420",
        "body": "Open source stuff is fine for students and hobbyists, but in the professional world, there is no competition to Adobe. Our companies are going to be paying that subscription until the end of time.",
        "created_utc": 1578416398,
        "id": "fdh6gdn",
        "score": 7,
        "subreddit": "investing",
        "created": 1578445198.0
    },
    {
        "author": "__fritzz",
        "body": "hey stormpass guy ill have u know i spent the girthier portion of my morning editing that video :( i had to watch two youtube videos on adding text using adobe premier pro",
        "created_utc": 1579479318,
        "id": "ff1hir1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1579508118.0
    },
    {
        "author": "IS_JOKE_COMRADE",
        "body": "I think I’m gonna but a ton of ADBE again tbh",
        "created_utc": 1578867079,
        "id": "fe5amgg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1578895879.0
    },
    {
        "author": "RLaG69",
        "body": "As a adobe suite user for the past 6 years, I can say that their apps are becoming increasingly glitchier and nearly unusable to the point where I actually switched over to a different set of programs lately. I’ve also seen a increase in the videography industry of people steering away from adobe. I haven’t really done any DD on them, but speaking from experience adobe is getting outdated.",
        "created_utc": 1578184254,
        "id": "fd61k09",
        "score": 3,
        "subreddit": "stocks",
        "created": 1578213054.0
    },
    {
        "author": "farnamst",
        "body": "PE means nothing, not trying to trigger people but it’s nothing more than a ratio.\n\nCompanies that earn high rates of return on low levels of capital investment always have high P/E ratios. Adobe needs about 0.40/sh capital investment to generate about 5.50/sh in earnings. The reason their P/E ratios run high is because of the efficiency of their earnings.\n\nCompare that to Caterpillar, capital investments of 3.50/Sh to earn about 7-10/sh.\n\nOne company needs 1/10th earning power to grow the business and earn 20% roic and the other needs 1/3rd earning power to just maintain the business and generate 10% roic (not bad for their business but not as good as an asset light business like adobe).\n\nThat said, Adobe is probably a 120b company right now selling for 160b. A far cry from 8/2002 when it was worth about 44b selling for 10b growing the top line at a +10% clip. That discount to fair value is what drove to future high rates of return + savvy management in significantly growing the intrinsic value of the business. Good luck, forget PE and ignore adobe unless you think they can grow fcf to 12.5b annually from the current 3.8b. Enjoy.",
        "created_utc": 1578189914,
        "id": "fd6eux2",
        "score": 3,
        "subreddit": "stocks",
        "created": 1578218714.0
    },
    {
        "author": "grambus121",
        "body": "Adobe Audition is industry standard in audio editing (e.g. production for radio commercials).",
        "created_utc": 1578945885,
        "id": "fea9aru",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1578974685.0
    },
    {
        "author": "IS_JOKE_COMRADE",
        "body": "TSLA ADBE ARKG",
        "created_utc": 1578191086,
        "id": "fd6hh6z",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1578219886.0
    },
    {
        "author": "SamFish3r",
        "body": "Read the earnings report ... Azure and Subscription models For MS office suite was a game changer for them. They will continue to steal Cloud computing and services space from AWS. It’s trading at a fairly decent price range at the moment compared to a lot of tech stocks . MSFT pays a decent Div for a Blue chip tech stock compared to Adobe, CRM or Apple they are a much better stock to invest and hold lo term .",
        "created_utc": 1580072445,
        "id": "ffnyzgc",
        "score": 2,
        "subreddit": "stocks",
        "created": 1580101245.0
    },
    {
        "author": "IS_JOKE_COMRADE",
        "body": "Sold 82k of ADBE before market close. Holding 20k of Norway etf. (Oil+ socialism). 80k + 82 now In cash. Man I feel fucking good. GETTEM DONNIE\n\nRip my 35k in SPY",
        "created_utc": 1578024039,
        "id": "fcwf5ao",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1578052839.0
    },
    {
        "author": "MrOaiki",
        "body": "There is ton of software competing with Adobe. On the film editing side, there’s Final Cut Pro for quick media editing and there’s Avid for films and TV. For Audition, there’s Pro Tools that is pretty much the goto program for professional sound editing. As for Photoshop, that’s where Adobe is dominant for pros and semi-pros. But even when it comes to the latter, they have competition from phone app creators and easy to use “quick-fix filter apps”. Adobe has tried to go into that space with Photoshop Express but they’ve failed. So Adobe is a player among many, where they’re only dominant in still image processing.",
        "created_utc": 1578422833,
        "id": "fdhhmxd",
        "score": 2,
        "subreddit": "investing",
        "created": 1578451633.0
    },
    {
        "author": "JustinTheJovial3030",
        "body": "AAPL, ADBE, DOCU.",
        "created_utc": 1578160792,
        "id": "fd3qdgh",
        "score": 1,
        "subreddit": "investing",
        "created": 1578189592.0
    },
    {
        "author": "kill0kong",
        "body": "Thanks for the comment. Curious. What makes you say RDFN will be out of business?\nMy RDFN avg is $16 and is up pretty good from that point. I think it is better positioned in real estate market than other technology focussed companies like Zillow in the space. Its focus on tech and investments in expanding platform capabilities is amazing. IMO it is a slow but sure winner in real estate brokerage space.\nMy GWRE average is $79. GWRE is a monopoly in end to end cloud based solutions for large insurance companies. Insurance companies have just started investing in technology/ digital transformation for their processes and have a long way to go. GWRE is coupling its platform capabilities with AI/ML which allows for better CRM, risk management and pricing. I know few consultant friends who are making a killing in implementing this for their customers. The management is awesome as it is led by a former McKinsey partner who had worked in this space for 15 yrs or so.\nWill take your word and buy more ADBE :)",
        "created_utc": 1577899573,
        "id": "fcrbj8b",
        "score": 1,
        "subreddit": "stocks",
        "created": 1577928373.0
    },
    {
        "author": "jonahsrevenge",
        "body": "Depending on what you mean by solid ...\n\nI hold MSFT, ADBE, COR",
        "created_utc": 1579048307,
        "id": "fef4zh9",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1579077107.0
    },
    {
        "author": "jonahsrevenge",
        "body": "1. COR, not MSFT\n2. ADBE has no dividend - my mistake\n3. Should have listed HASI\n\nIf I'm buying for the dividend I look for 4% or greater yield.  Below there I look at both yield and growth rate.",
        "created_utc": 1579049039,
        "id": "fef62d2",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1579077839.0
    },
    {
        "author": "fresh_ny",
        "body": "ADBE has a data play",
        "created_utc": 1578999512,
        "id": "fed58z9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579028312.0
    },
    {
        "author": "Meymo",
        "body": "Adobe. \n\nThey’ve moved to a SaaS model and the majority of Fortune 500 enterprises are subscribed to them. They have a huge moat and are the undisputed leader in professional digital editing tools. Yes, there are free products that “do similar things”, but those tools are not used by experts in the industry. In addition to the corporate world, all of your favorite movie studios rely on Adobe’s products.",
        "created_utc": 1578924822,
        "id": "fe8cmlx",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578953622.0
    },
    {
        "author": "doomrabbit",
        "body": "I'm a web designer by trade. Around 2002ish, the two big names in software for the graphics industry were Macromedia and Adobe. They were trading lawsuits like crazy, alternately claiming that one was copying the other's interface. Stock reporters were claiming Macromedia was going to get killed. I saw the Macromedia team coming up with unique solutions and rolling out constant updates to dodge the lawsuits. It was childish finger-pointing. Macromedia finally invented the modern slider/docked sidebar method that is popular today and the lawsuits stopped. Stock kept tanking, I started investing. Bounced back 2.5x once it blew over.  Should have stayed on board when Adobe bought them out to get the better solution they made, but never second guess taking a good profit.",
        "created_utc": 1578532673,
        "id": "fdlubmt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578561473.0
    },
    {
        "author": "Scorface",
        "body": "I recommend TECL, it's a 3x leveraged ETF of whatever the daily return is of XLK.  XLK is just the Technology Sector ETF from the S&amp;P 500.  It helps me sleep at night knowing that while there could be a market crash and I may be screwed, I know tech sector will rise over the course of my lifetime.  I am just a regular guy in my 20s so I dont mind holding this for many years to come\n\nHere are the top 10 holdings which make up about 65% of the etf:\n\nApple\n\nMicrosoft \n\nVisa\n\nMastercard\n\nIntel\n\nCisco\n\nAdobe\n\nSalesforce\n\nNvidia\n\nPaypal",
        "created_utc": 1579308248,
        "id": "feoynrb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579337048.0
    },
    {
        "author": "realister",
        "body": "If AirPods was a separate company it would be the 4th largest Tech company with revenues higher than AMD, nVidia, Adobe, Twitter, Square.\n\nhttps://i.imgur.com/zEvhVX9.png",
        "created_utc": 1579230943,
        "id": "felu2as",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579259743.0
    },
    {
        "author": "gizamo",
        "body": "Indeed. I just meant that Google was pushing Kotlin for Android devs. But, you're right that even we Java guys are giving up on it.     \n     \nAnyway, I disagree that Angular was beaten down by React, and I very much disagree that none of those platforms/libraries could be monetized. Xcode is monetized. PRGS's shit software is monetized. ADBE monetizes Magento (and before that EBAY tried. Lol). Google cloud has all sorts of integrations that could be monetized, and if done right, would sell like hotcakes. But, back to my main point, Google has been shitting the bed on its cloud. So, they aren't doing any of that.",
        "created_utc": 1579495875,
        "id": "ff27bgb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579524675.0
    },
    {
        "author": "xpercipio",
        "body": "I would go apple Microsoft Adobe tesla",
        "created_utc": 1579773359,
        "id": "ffbmx41",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1579802159.0
    },
    {
        "author": "captainhaddock",
        "body": "I assume this was inspired by David Gardner's latest podcast.\n\nThe first stock I bought when I started investing in 2018 was Apple for that reason. Others I could put in that category are SBUX, DIS, and ADBE. And I wish I owned some AMZN.",
        "created_utc": 1580278609,
        "id": "ffvztd3",
        "score": 1,
        "subreddit": "investing",
        "created": 1580307409.0
    },
    {
        "author": "garbagepk2",
        "body": "Pirating adobe premiere is not very hard and easy to learn on tbh that's what I did",
        "created_utc": 1580331491,
        "id": "ffxsepo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580360291.0
    },
    {
        "author": "grackychan",
        "body": "The software as a subscription model, ie O365 and Adobe software, literally prints money. In my opinion it is anti-consumer, but I can't argue that it is extremely profitable.",
        "created_utc": 1580397864,
        "id": "fg013k9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580426664.0
    },
    {
        "author": "Stockbaron",
        "body": "Bilibili provides high-quality content and an immersive entertainment experience, and have built their platform based on the strong emotional connections of their users to their content and communities. They started as a content community inspired by ACG, and have evolved into a full-spectrum online entertainment world covering a wide array of genres and media formats, including videos, live broadcasting, and mobile games. They have a young and culturally aspirational user base willing to invest in a high-quality entertainment experience.\n\nBilibili uses an Adobe Flash or HTML5 player, which can be manually switched, to play user-submitted videos hosted by either itself or third-party sources, while featuring a real-time overlaying subtitle system for interactive playback experience.",
        "created_utc": 1579571945,
        "id": "ff4tbjr",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1579600745.0
    },
    {
        "author": "wellscounty",
        "body": "CRM, adi, hon, ADBE",
        "created_utc": 1578160413,
        "id": "fd3ov9u",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578189213.0
    },
    {
        "author": "DrUNC83",
        "body": "Nah I think they sold recently to Adobe\n\n\nEdit- just read seems they sold just one component/program",
        "created_utc": 1578263512,
        "id": "fdbxk1f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578292312.0
    },
    {
        "author": "IS_JOKE_COMRADE",
        "body": "Really divided on whether I should hold adbe through early 2020. Have a ton of it priced at 118.",
        "created_utc": 1577888253,
        "id": "fcqls11",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1577917053.0
    },
    {
        "author": "NextTrillion",
        "body": "Strong statement considering very, very few companies ever have more than 25% market share as the market matures, unless they have bought out most of their competition (AB InBev has an estimated 28% market share) or they offer a very unique product that can not be replicated easily (Boeing, Adobe, Visa, etc).\n\nThrow in some limited licenses and state border restrictions, and you may have strong contenders for a while, but once the market matures and regulations are loosened up, 25% is far too difficult to maintain. TRUL has captured most of the FL market, but that will dwindle as a percentage. They’ll still see strong growth, but the competition will always find a way to undercut their market share. It’s just basic market fundamentals.\n\nAs the cannaguy mentioned, 3/21 (14%) for CL and 2/21 (9.5%), of cultivation. That’s about 24% and doesn’t factor in retail establishments or newer small craft growers that could take over a huge % of the market. There are a lot of assumptions, simplifications, etc. Aka *napkin math.*\n\nJust because some companies have a head start doesn’t mean they will be able to easily maintain it. Especially in the CPG market.",
        "created_utc": 1578036431,
        "id": "fcwt1bt",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1578065231.0
    },
    {
        "author": "Nikandro",
        "body": "Came here to say Adobe, although I wouldn't say a complete monopoly. There are great alternatives, and in the film world there are even more.",
        "created_utc": 1578429857,
        "id": "fdhtgin",
        "score": 1,
        "subreddit": "investing",
        "created": 1578458657.0
    },
    {
        "author": "Dykchaney",
        "body": "They wont have any fuel to fly here to sign the deal next week. You think they can sign in adobe docusign, or is a trade deal like a sign in person type thing, only?",
        "created_utc": 1578446250,
        "id": "fdimk7l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578475050.0
    },
    {
        "author": "UnknownParentage",
        "body": "This is a core problem with SaaS for companies like Adobe. The guaranteed revenue stream reduces the pressure on the team to innovate, as well as the feedback loop between sales and release quality (previously, people might not pay for the upgrade if they didn't feel a CS6 was significantly better than CS5).\n\nWithout feedback, the temptation is to get lazy and say \"we can't do any better\".",
        "created_utc": 1578951184,
        "id": "feapv9q",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578979984.0
    },
    {
        "author": "iUsedToUseMyRealName",
        "body": "and the prize goes to ADOBE, for being the flattest of flat stocks today!",
        "created_utc": 1579034524,
        "id": "feeinsh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579063324.0
    },
    {
        "author": "xpercipio",
        "body": "Apple, spy, tesla, amd, target, adobe, disney,  microsoft. That is my green team.",
        "created_utc": 1578822749,
        "id": "fe15lkr",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1578851549.0
    },
    {
        "author": "ExiledinElysium",
        "body": "It's coming from poor people. The overwhelming majority of earnings growth in large corporations right now is from their ability to squeeze more money out of their customers for the exact same thing, not because they're generating new real value in the economy. Microsoft and Adobe are good examples. They're leaders in a tech sector that's switched almost entirely from permanent-license software sales to a subscription model. It's just making customers pay more over time for the same thing. Same with nearly all gaming companies--the move to subscriptions and in-game microtransactions.\n\nThis is, of course, just my angry morning opinion based on very little real information.",
        "created_utc": 1579276852,
        "id": "fen4m2o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579305652.0
    },
    {
        "author": "4pooling",
        "body": "Great companies win in the end. It's simple. \n\nThere are amazing companies that do pay a dividend and there are ones that don't (BRK.B, AMZN, FB, ADBE, INTU, NFLX, etc). \n\nWhich is why simple market cap funds (which track both dividend paying and non-dividend paying stocks are so potent. \n\nReally difficult to beat the Market consistently over time.",
        "created_utc": 1578617685,
        "id": "fdp1drf",
        "score": 1,
        "subreddit": "investing",
        "created": 1578646485.0
    },
    {
        "author": "justknoweverything",
        "body": "I like how you use ADSK, the biggest fucking joke of a company and shittiest software other than adobe and these dumbfuck investors continue to prob that shit up like it's some amazing growth stock and amazing tech.  I can't wait until a competitor destroys that fucking loser overvalued joke of a company.",
        "created_utc": 1578646098,
        "id": "fdpyjup",
        "score": 1,
        "subreddit": "investing",
        "created": 1578674898.0
    },
    {
        "author": "ijakinov",
        "body": "HBO Max is going to do well I think they won't be as world wide as Netflix but they can always still make money in those regions by licensing deals (that have next to no operation costs).  they secured some good 3rd party content, secure some good talent, got some good brands, WB, Friends, Big Bang Theory, and some ambitious/innovative ideas for their streaming app.  The problem is that it's owned by $T which own some other business that won't last; and I'm not sure how that's going to affect their stock price.\n\nNetflix and Disney (Hulu) are your best bets.\n\nAlso, Microsoft and Adobe do not have streaming services.",
        "created_utc": 1579587451,
        "id": "ff5coof",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579616251.0
    },
    {
        "author": "TravelingArthur",
        "body": "Everyone gives the same answers.\n\nMicrosoft, Shopify, Facebook, Apple, Amazon, Netflix. Visa, MasterCard, SPY, QQQ, Adobe, Disney, AMD, Berkshire,  Alibaba, Tencent\n\nDividends are T, V, \n\nHealth is Teledoc, UNH, and ISRG. \n\nMajority thinks the same and has the same strategy.",
        "created_utc": 1580003700,
        "id": "ffjpi8z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580032500.0
    },
    {
        "author": "heliumbox",
        "body": "Held APPL for a year to breakeven after buying like a day before December crash, sold it, half my AMD @42, half my ADBE at like 5% profit a year ago bought CRON, APHA, few others, lost on all of them.",
        "created_utc": 1580486630,
        "id": "fg3p3xo",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1580515430.0
    },
    {
        "author": "pcguywilson",
        "body": "Buy when its low IV (2-3+ weeks prior) or hope it keeps going up the next couple days at a quick rate. \n\nYou should try to go at least a week out from earnings (more if you can) because sometimes the market waits for analysts to give their opinion before buying. Adobe comes to mind. Look at whats happened since theyre last report.",
        "created_utc": 1580500250,
        "id": "fg4bjdm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580529050.0
    },
    {
        "author": "firststrike001",
        "body": "&gt;perts in the industry. In addition to the corporate world, all of your favorite movie studios rely on Adobe’s products.\n\nphoto/video editing is only a slice of what they offer. Adobe offers many other tools that help run applications on web. Not to forget analytics and Ai",
        "created_utc": 1578948199,
        "id": "feag0oi",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578976999.0
    },
    {
        "author": "heydude1473",
        "body": "I mean, boo fucking hoo honestly lol, welcome to the world of software? Just because the marginal cost for Adobe to send you photoshop is basically $0, doesn't entitle you to have it for that amount.\n\nTesla includes basic lane keep assist by default, and if you want the more advanced feature set you can pay and upgrade at any time. That may be a new concept in a car, but if you want to quibble about software costing money then build a time machine and go take it up with Bill Gates 40 years ago my friend. Tesla did not invent the idea.",
        "created_utc": 1579007815,
        "id": "fedcrwv",
        "score": 1,
        "subreddit": "investing",
        "created": 1579036615.0
    },
    {
        "author": "akmalhot",
        "body": "damn yo I wanted to buy leveraged etfs like 2 years ago (maybe 10% of portolio) and everyone said Id def lose it all.\n\nBut then again without a deep understanding of these things probably shouldn't be messing with them anyway.\n\n\nI'll enjoy my pretend great stock picking when in reality everything has just been up, realize I've probably been equally lucky and good. Continue to focus solid companies when they aren't overextended that are already in my portolio (crm, msft, adbe [stupidly sold half of it], sold all of my appl ;(, payc, v/ma, brkb) and just buy etfs/funds",
        "created_utc": 1578924667,
        "id": "fe8c57z",
        "score": 1,
        "subreddit": "investing",
        "created": 1578953467.0
    },
    {
        "author": "Vast_Cricket",
        "body": "No offense. A lot of speculative positions. If you stay with FAANG or microsoft brick and mortar, Adobe, McDonald stocks everyone understands the results are more predicable.\n\nGE aviation is struggling. It contributes to just 25% of corporate revenue. With 737 airplane production on hold both Europe and US are laying off skilled workers. Eric vowed to contribute to 5G and was a strong player sometime ago.  Nokia is a Buy from Hold, and cut Ericsson to Hold from Buy. Ericsson for 5G is facing expectations that may be too high. The companies benefit ultimately are not phone companies. [Rather the cell tower companies need to install a lot more transceivers.](https://www.landmarkdividend.com/how-will-the-5g-rollout-impact-cell-tower-lease-rates/) I doubt by the end of 2020 the 5G stocks which is a lot will show up on the income statements. you can look at the [complicity and vendors (table btm) involved.](https://www.tomsguide.com/us/5g-release-date,review-5063.html) If you can find a 5G mutual funds I will recommend. If you find one etf, mf please post here.\n\nGood luck.",
        "created_utc": 1578971437,
        "id": "fecdnnc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579000237.0
    },
    {
        "author": "shadybounce",
        "body": "Visa/adobe/axp /SPY",
        "created_utc": 1579300419,
        "id": "feoht2i",
        "score": 1,
        "subreddit": "options",
        "created": 1579329219.0
    },
    {
        "author": "4pooling",
        "body": "No, that's not what makes sense for most investors. \n\nI remember first learning about investing and obsessing about dividends. Then I learned about total return, tax efficiency and Risk Management. \n\nFocus on total return (price appreciation + dividends). \n\nMaybe you're aware there are also highly valuable stocks that don't pay a dividend. To name a few: FB, AMZN, ADBE, INTU, BRK.B, NFLX, etc. The S&amp;P 500 includes both dividend payers and non-dividend payers. \n\nIf you're insistent on dividends, there are several tax efficient dividend growth funds (for a taxable account) that closely track the Market (S&amp;P 500). An example would be VIG (VDADX is the mutual fund equivalent) and NOBL.",
        "created_utc": 1578753035,
        "id": "fdvxzfi",
        "score": 1,
        "subreddit": "investing",
        "created": 1578781835.0
    },
    {
        "author": "jonnydoo84",
        "body": "I feel like a stock like ADBE will always go up. .. yeah there's competitors in some apps. but the moat has been made.",
        "created_utc": 1578801049,
        "id": "fe01y2v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578829849.0
    },
    {
        "author": "usom",
        "body": "AVLR ADBE UPWK INTU ADP",
        "created_utc": 1578109320,
        "id": "fczvic4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578138120.0
    },
    {
        "author": "lthopper",
        "body": "Check out Adobe",
        "created_utc": 1578080587,
        "id": "fcyi6z3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578109387.0
    },
    {
        "author": "wilfredian",
        "body": "Facebook, Adobe, IAC (parent of Match)? All were obvious buys on Jan 1, 2019 and all outperformed the market. All three are major ownings of mine bought in late 2018 based on basic fundamental analysis (which includes growth and size of moat considerations!).\n\nOf course fundamental investing can work. People sprout the fact that the majority fail to beat the indices as if it is proof that it fails. But the fact that the majority do worse than the average is an *absolutely trivial statement* with no worth. Almost any skill at all will have a distribution of results like that.",
        "created_utc": 1578606542,
        "id": "fdojqmr",
        "score": 1,
        "subreddit": "investing",
        "created": 1578635342.0
    },
    {
        "author": "TheGloriousPlatitard",
        "body": "Uh I use Adobe Rush or Adobe premier on my laptop. I like to dedicate high level production tools for garbage content.",
        "created_utc": 1578625087,
        "id": "fdpcdf6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578653887.0
    },
    {
        "author": "taiwansteez",
        "body": "I've made &gt; 50% gains on AAPL(65%), MSFT(60%), FB(50%), ADBE(65%), V(50%), NVDA(60%).\n\nBut the companies that have surprised me the most with their gains are MTCH(95%), SHOP(240%), TSLA(130%), TGT(85%), SBUX(70%).",
        "created_utc": 1578529499,
        "id": "fdlpncc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578558299.0
    },
    {
        "author": "Vast_Cricket",
        "body": "Suggest you consolidate.  Rdfn is over valued and will eventually go out of business. GWRE unsure of its ultimate results.....  Will not be rich throwing dots at these supposed good valued stocks. The portfolio is good .. Adbe has tremendous growth put in more. Happy New Year.",
        "created_utc": 1577896352,
        "id": "fcr3r7m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1577925152.0
    },
    {
        "author": "hkindness",
        "body": "Geez my ADBE 335/337.5c 1/10 credit spread making me a little nervous now 😬",
        "created_utc": 1577986917,
        "id": "fcurbq7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578015717.0
    },
    {
        "author": "4pooling",
        "body": "I notice he doesn't go into detail of his simple money weighted returns and only focuses on his dividend income. \n\nIn his taxable account, he has an asset allocation of 80/20 stocks/bonds. \n\n20% of his pie is allocated towards REITs which the dividends are taxed at his high income tax rate (he's a software developer). Therefore the other 60% of his stock dividends are taxed at the 15% qualified rate. \n\nHe's mentioned he doesn't have a 401k which would protect his assets from taxation. He's most likely above the 22% tax rate and is now earning even more income thru YouTube ads. \n\nYou may outperform his pie by letting professional portfolio managers track a dividend growth index. Some funds that have done extremely well in this bull market include VIG, VDIGX, NOBL, etc. \n\nBesides all that, in 2019, the S&amp;P 500 which includes non dividend stocks like GOOG, AMZN, FB, INTU, ADBE, BRK.B gained 30%. It outperformed all of the funds listed above. \n\nYou would have to compare 80% S&amp;P 500, 20% bonds to his 80/20 portfolio of stock picks.",
        "created_utc": 1579744646,
        "id": "ffauagj",
        "score": 1,
        "subreddit": "investing",
        "created": 1579773446.0
    },
    {
        "author": "veritasinvestments",
        "body": "Oh absolutely. I’m half in aapl 315 calls and msft 165 calls all for march 20 and selling weeklies on them to hedge against small downward market movements. I’m actually more bullish on msft rn since they’re not even connected to China to the level that aapl is. My focus will be more on msft-esque companies such as Adobe and Atlassian besides my already existing positions on Aapl and msft.",
        "created_utc": 1580283504,
        "id": "ffw44zg",
        "score": 1,
        "subreddit": "options",
        "created": 1580312304.0
    },
    {
        "author": "ClearVisibility",
        "body": "Companies posting record earnings and people are trying to crash the market over a virus. Desparate. How does Adobe and Netflix get affected by this?",
        "created_utc": 1580406341,
        "id": "fg0evnl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580435141.0
    },
    {
        "author": "Dr_Raaky",
        "body": "Hey, thanks for posting this. I hadn't heard of the wheel strategy before. It's less aggressive than what a lot of people on here do, but I think it fits my slightly risk-averse personality better. Plus I'm down about $2k today on SPY and ADBE calls so I'm looking for a way to make money more consistently.\n\nThe whole strategy requires selling calls at the same strike as your puts so you always net back to zero (excluding premium) during a turbulent market, right?",
        "created_utc": 1580488094,
        "id": "fg3rhpr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580516894.0
    },
    {
        "author": "killer_otter",
        "body": "I would like to get into DOCU, but a bit fearful that ADBE will cut into their business.",
        "created_utc": 1580488529,
        "id": "fg3s6xo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580517329.0
    },
    {
        "author": "lschozar",
        "body": "I have been oogling amd due to the recent drop and their extreme good products/executing history under Lisa su, at&amp;t because of its good divdend history and growth, Microsoft because they are one of the main players in the most future proof market ever (imo): servers (for cloud business) and Adobe just because the PDF format is never going anywhere and with all services going online editing these will be more and more important and Adobe reader is by default the most common software to edit PDFs (source:own experience, put too much value on this).",
        "created_utc": 1580454728,
        "id": "fg2t2r4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580483528.0
    },
    {
        "author": "t35t0r",
        "body": "I hold ~30% of these at any given time, but frequently by in and out of all of them :\n\naig\nbac\nbmy\nbynd\ncsco\neem\nefx\nfitb\nflgt\nfmc\nfxi\ngild\nhd\nhtht\nipar\nkbh\nlevi\nlh\nlly\nlscc\nluv\nmcd\nmrvl\npanw\npayc\nqcom\nroku\nspot\ntm\nttgt\nvtr\nzbra\n\nabbv\nabt\nacn\nadbe\nadsk\naltr\nathm\nazo\nbaba\nbax\nbrk.b\nburl\nc\ncdlx\ncmg\ncrm\ncsii\nctas\ndhr\ndpz\ndva\nenph\netsy\new\nfive\nfiw\nfn\ngpn\ngs\nhi\nhii\nhum\nhuya\nilmn\nintc\niq\nirmd\nisrg\nitgr\njbht\njd\nklac\nlk\nlow\nlrcx\nmdt\nmmm\nmnst\nmoh\nmsci\nmsft\nmt\nmtch\nmu\nneo\nnke\nnoc\nosk\npall\nqqq\nrace\nregn\nrost\nrrgb\nschb\nsea\nsedg\nshop\nskyw\nspgi\nstaa\nstm\ntgh\ntgt\ntsla\ntsm\nttd\ntxn\nuctt\nUI\nUL\nunh\nvar\nvrtx\nvti\nwfc\nwing\nxpo\nzbh\n\naap\naapl\nadi\nakam\namat\namd\namgn\namt\namzn\navgo\nba\nbax\nbeat\nbidu\nbzun\ncdxs\ncma\ncrsp\ndgx\ndhi\nemn\nens\netfc\nfpay\ngasx\nglw\nhon\nimgn\nintu\nkeys\nlhx\nlmt\nlrcx\nlyft\nma\nmdb\nmsft\nnflx\nnio\nnow\nntnx\nnvta\norcl\npdd\npfe\nphm\nptc\nrdfn\nrtn\nsbac\nsbux\nsdc\nsina\nteva\ntmo\ntol\ntri\ntsn\nual\nutx\nv\nvar\nvrsn\nvslr\nwb\nyum\nzg\nzs\n\nazn\nbdry\ngis\nmrk\nnvs\npgre\nshw\ntndm\nuaa\nveon\n\nlit\nendp\n\n\ntdg\nrtn\nutx\n\nosk\n\ngd\nldos\nhxl",
        "created_utc": 1578802764,
        "id": "fe04d2b",
        "score": 0,
        "subreddit": "RobinHood",
        "created": 1578831564.0
    }
]