[
    {
        "author": "Rageoftheage",
        "body": "I'm Long HASI, NEP, BEPC, DNNGY, VWDRY, AES, ENPH, TSLA, CLSK, SHLL, DHPC, WKHS, SBE, SNPR, SOAC.\n\nMarket is correcting and I'm on fresh all time highs mostly due to EV and biotech plays",
        "created_utc": 1600569174,
        "id": "g5wtksi",
        "score": 11,
        "subreddit": "investing",
        "created": 1600597974.0
    },
    {
        "author": "t33po",
        "body": "This sub is somehow the fastest to information and also the slowest to act on it. It really confusing. It must be a lack of confidence. The time act on NKLA was Thursday morning when the news was plastered all over the daily thread. It's old news now and likely getting a puts slaughtering bounce - see ENPH, GSX etc.",
        "created_utc": 1600005623,
        "id": "g540vul",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600034423.0
    },
    {
        "author": "The_Goodest_Dude",
        "body": "ENPH\n\nEdit: forgot you were interested in an ETF. If that’s the case just use TAN",
        "created_utc": 1600267361,
        "id": "g5h3xfx",
        "score": 9,
        "subreddit": "stocks",
        "created": 1600296161.0
    },
    {
        "author": "Klutzy_Hamster",
        "body": "AMZN NVDA FB  SQ ENPH\n\nI think that provides a good representation of leaders across fast growing tech subsectors (e-commerce/cloud/semiconductor/AI/social media/fintech/green energy/microinverters).\n\nI would also throw in TER in there as an honorary mention for an automation play",
        "created_utc": 1600136246,
        "id": "g5bd73c",
        "score": 5,
        "subreddit": "stocks",
        "created": 1600165046.0
    },
    {
        "author": "disorientedcheerio",
        "body": "Just my two cents, but I like to compare $SBE to Enphase Energy ($ENPH) in terms of growth. $ENPH is even listed as a benchmark company for ChargePoint, in terms of public space, in $SBE's investor presentation here: [http://switchback-energy.com/wp-content/uploads/2020/09/ChargePoint-New-Investor-Deck-23-Sept-2020-8K.pdf](http://switchback-energy.com/wp-content/uploads/2020/09/ChargePoint-New-Investor-Deck-23-Sept-2020-8K.pdf)\n\nChargePoint had an implied valuation of 2.4 billion when $SBE was $10 per share. I believe a fair valuation for ChargePoint as a company will be about 8-9 billion in a year, similar to where $ENPH is now. Given that valuation, my price target for $SBE would be around $20 before the merger, which implies a valuation of around 5 billion.\n\nIt's best to just invest now, no reason to try and time it. This is a solid company with products that everyone already loves.",
        "created_utc": 1601256309,
        "id": "g6wrqie",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1601285109.0
    },
    {
        "author": "Rageoftheage",
        "body": "My favorite ETF is ACES otherwise:  \n\n\nHASI, NEP, BEPC, ENPH, DNNGY, SHLL, DPHC, TSLA, WKHS",
        "created_utc": 1600141489,
        "id": "g5bm0nv",
        "score": 5,
        "subreddit": "investing",
        "created": 1600170289.0
    },
    {
        "author": "GromGrommeta",
        "body": "It sounds like your problem is trading rather than coming up with solid long-term theses that allow you to view temporary dips as opportunities. You don't mention in any of your paragraphs why you bought what you bought except for ENPH being down because of a news article.\n\nI do understand position sizing and FOMO. I started buying TDOC in the 30s, maybe 5-10 shares each purchase. Looking back sure, I wish it was 50-100 shares I was purchasing. But you gotta have a strategy and stick to it. I accumulate positions in speculative companies slowly and have specific results/metrics I want to see before making them a main position. \n\nOf course, this is investing advice that takes a long-term mindset. If you want trading advice and a short-term mindset, there's a few other subs for that. But speaking from experience, a short-term mindset will continue to weigh on your mental health.",
        "created_utc": 1601070479,
        "id": "g6krsm4",
        "score": 4,
        "subreddit": "investing",
        "created": 1601099279.0
    },
    {
        "author": "moo_blue",
        "body": "AAPL - 14%, MSFT - 14%, SQ - 12%, SE - 11%, ENPH - 10%, PINS - 8%, TDOC - 8%, WMT - 6%, PTON - 5%, DKNG - 5%, EXPI - 4%, NIO 3%\n\n22 year old who is willing to take on more risk in his 20's",
        "created_utc": 1599677514,
        "id": "g4kn9y1",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599706314.0
    },
    {
        "author": "deGoblin",
        "body": "As close as they seem SEDG might be more fitting for large solar fields, and ENPH for residential ones.",
        "created_utc": 1600558345,
        "id": "g5vtvpb",
        "score": 3,
        "subreddit": "stocks",
        "created": 1600587145.0
    },
    {
        "author": "Zairieminx",
        "body": "This is coming from an uninformed investor so take what you will. Some may downvote me, or agree, but you might have one too many different stocks. You're trying to cover all bases(I did this as well), but I started to understand it's far too much stress. If you feel like watching 19 different ETF or stocks that's great, but which to add too is where it gets tricky and stressful.\n\nIn fact, I just sold off some stocks and ETF's to get myself back under 10 currently at 9 different holdings, and the amount of stress that takes away is actually noticeable. \n\nARKF if not mistaken is Financial Tech so I would think they have SQ themselves for example. Might be better to hold it vs just SQ alone, but that's your choice of course. \n\n&amp;#x200B;\n\nP.S just word to the wise this is hindsight, but I didn't realize VSLR was @ 32.64 I've had 3 different stocks in very cheap territory and could have made a killing ENPH and AMD were the other two. \n\nAMD was in at $1.43, ENPH @ 1.50, and VSLR @ 4.5 this was couple years ago. \n\nWhat could have been....................",
        "created_utc": 1600369826,
        "id": "g5mapgm",
        "score": 3,
        "subreddit": "investing",
        "created": 1600398626.0
    },
    {
        "author": "LivingLosDream",
        "body": "Care to share what the stock is? ENPH?",
        "created_utc": 1599002886,
        "id": "g3nn103",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599031686.0
    },
    {
        "author": "Jericho3434",
        "body": "Pick 2 companies and put 5k each to lower risk. I would say a solar company like ENPH or SEDG and Amazon. Amazon is going nowhere in 5-10 years.",
        "created_utc": 1601267263,
        "id": "g6x9d3r",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601296063.0
    },
    {
        "author": "oshtitswaynebradyson",
        "body": "ENPH, DAVA, SDGR",
        "created_utc": 1600601783,
        "id": "g5yqlgn",
        "score": 3,
        "subreddit": "stocks",
        "created": 1600630583.0
    },
    {
        "author": "radarbot",
        "body": "Definitely like ICLN. It holds a lot of the stocks that I was individually looking at: https://www.ishares.com/us/products/239738/ishares-global-clean-energy-etf\n\nTake a look at the top holdings:\n\nRUN\n\nPLUG\n\nSEDG\n\nENPH\n\n\nAll stocks that have surged 100% in the past 6 months.",
        "created_utc": 1600282839,
        "id": "g5hzmmx",
        "score": 3,
        "subreddit": "stocks",
        "created": 1600311639.0
    },
    {
        "author": "forwardpass",
        "body": "What do you guys think about ENPH and SEDG right now?\n\nI'm super bullish on solar, and these guys seem solid - but also look pricey as fuck, especially ENPH. I also don't want to miss the renewables train completely.",
        "created_utc": 1600174128,
        "id": "g5cm6l7",
        "score": 3,
        "subreddit": "stocks",
        "created": 1600202928.0
    },
    {
        "author": "pogchimp123",
        "body": "sold off a bunch a voo today to buy a few stocks and grab some more nvidia, this is what i'm working with now:\n\nNVDA: 19.81%\n\nMSFT: 19.79%\n\nVOO: 20.88%\n\nBABA: 18.45%\n\nENPH: 9.06%\n\nLVGO: 12.03%\n\nLooking alright?",
        "created_utc": 1599097639,
        "id": "g3spmbu",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599126439.0
    },
    {
        "author": "astrophysics23",
        "body": "Okay, but shitron also said ENPH was a fraud and that was kinda false. Really don't know why these guys have street cred because they really seem to just be front running their statements",
        "created_utc": 1599857682,
        "id": "g4v46us",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599886482.0
    },
    {
        "author": "ShortyOnFire",
        "body": "bought some enph today that it gonna see how things play out monday",
        "created_utc": 1599851868,
        "id": "g4ur6hp",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599880668.0
    },
    {
        "author": "GenTelGuy",
        "body": "My ENPH shares crashed like 10% - from +30% since may to +20%",
        "created_utc": 1599157177,
        "id": "g3vppe2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599185977.0
    },
    {
        "author": "oshtitswaynebradyson",
        "body": "Choose some good single stocks like MAXR, LSCC, ENPH, etc",
        "created_utc": 1600615058,
        "id": "g5zm4ji",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600643858.0
    },
    {
        "author": "verstehenie",
        "body": "If you’re looking for value in this area, you have to go against the herd to an extent.  TSLA is a great company, but its valuation won’t make sense for another 5 years.  It’s similar with SEDG and ENPH; good companies, but expensive (SMA/S92 is my pick in the inverter space).  On the other hand, I think there is a strong bull case for solar module manufacturers over the next few years because they are currently profitable even with record low prices/LCOE.  Lower module costs drive demand growth for commercial- and utility-scale solar, and companies like JKS, CSIQ, and FSLR are bulking up capacity to benefit.  I particularly like JKS due to its high growth and market share, but as of this week those are starting to get priced in.\n\nMost of the other companies I’m in are probably overvalued.  Siemens-Gamesa and Vestas are well-positioned for growth, but expensive relative to earnings.  Same with Ørsted, although earnings from asset divestiture are lumpy.  BEP might be a decent buy.  One company I’m currently excited about is the developer/asset owner Neoen, who commissioned that record-breaking [Tesla battery in Australia](https://en.wikipedia.org/wiki/Hornsdale_Power_Reserve).  They are growing aggressively, with the kind of vision (and, frankly, leverage) that the climate situation demands, but that makes them risky.  I’m also in a handful of hydrogen companies (NEL/D7G, ITM/IJ8, and BLDP), but those are highly speculative at this point.",
        "created_utc": 1600909292,
        "id": "g6dgu5p",
        "score": 2,
        "subreddit": "investing",
        "created": 1600938092.0
    },
    {
        "author": "JKK201519",
        "body": "I’m here Citron is full of shit .. known shorter who makes a killing off BS allegations that you all buy into. Remember his PTON $5 target price? Remember ENPH target price of $0? Yeah. Go ahead and sell. My position is steady and will DAC more.",
        "created_utc": 1600259703,
        "id": "g5gr0oc",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600288503.0
    },
    {
        "author": "Big80sweens",
        "body": "Funds: ICLN, QCLN, ACES\nStocks I own: AQN, NPI, FTS, BEP(C), BLX, RNW, ENPH, RUN\nInteresting green tech I have taken a punt on: DYA.TO, EWS.V, SHRC.V, POND.V (DYA I actually think will explode soon with the upcoming caveats)",
        "created_utc": 1600287817,
        "id": "g5iakc2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600316617.0
    },
    {
        "author": "checkraiseblufff",
        "body": "ENPH all the way",
        "created_utc": 1601091139,
        "id": "g6m1l8a",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601119939.0
    },
    {
        "author": "phoenixmusicman",
        "body": "TAN or ICLN for the solar/sustainable ETFs\n\nI went for CSIQ and ENPH as they seem to be ahead of the pack",
        "created_utc": 1601426195,
        "id": "g74gs2h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601454995.0
    },
    {
        "author": "Napalm32",
        "body": "Exactly. I have to admit I'm a dumbass and sold from the ENPH news because I wasn't sure if it was real. I bought back in last week and am long from now on. I learned my lesson.",
        "created_utc": 1600210340,
        "id": "g5evxbf",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600239140.0
    },
    {
        "author": "imm_uol1819",
        "body": "Postgrad student, started trading in late May but I've only recently created a portfolio I'm happy with:\n\n- Solar 35%: CSIQ, ENPH, RUN\n\n- Tech 20%: AAPL, NVDA, SQ\n\n- Speculative trades 20%: NIO, DOYU\n\n- Cloud 8.5%: NET\n\n- Crypto 8.5%: ETH, BTC\n\n- Cash 8% (mainly used to day trade Silver)\n\nI'm all in on NASDAQ though, any suggestions on how to change that? \n\nI was thinking of including some WMT and KO and reduce my exposure to speculative trades (i.e. get rid of DOYU).\n\nAlso, how fucked am I if Trump wins?",
        "created_utc": 1600171422,
        "id": "g5cifrz",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600200222.0
    },
    {
        "author": "michael370662",
        "body": "Energy sector shift is a long term play. Nuclear energy and solar had all moved up. can take a look at CCJ and ENPH.\n\nCoal play is short term bullish, long term bearish. \n\nAll coal miners are currently below their fair value, it's a value play, not a long term play. If you look at VALE, PBR, SSL, they all had not returned back to Feb valuation. Coal is the same. Would you be long term bullish on oil when TSLA will replace gas station? \n\nBut in the near term, these will go back to a fair valuation before the slow grind down. \n\nI had no benefits from this, why would I pump and dump. It make sense if I had a position and try to get out but I don't. (those few shares that I have won't make back what I lose)",
        "created_utc": 1600482637,
        "id": "g5ruh71",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600511437.0
    },
    {
        "author": "knitekloud",
        "body": "Just picked up enph, Rkt, net, and carr",
        "created_utc": 1599282816,
        "id": "g433goe",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599311616.0
    },
    {
        "author": "DerpsMcGeeOnDowns",
        "body": "DOCU\n\nENPH\n\nRUN\n\nATHX\n\nSE\n\nRKT",
        "created_utc": 1599250188,
        "id": "g419oro",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599278988.0
    },
    {
        "author": "Ensemble_InABox",
        "body": "We call them Shitron over on the ENPH stocktwits board, company is scum. They are not a “research” group by any stretch of the imagination. They just publish propaganda and then market the hell out of it to manipulate share price. Any company they short is a pretty strong bet to rebound. Don’t know anything about nautilus myself, though.",
        "created_utc": 1599754966,
        "id": "g4pd5iw",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599783766.0
    },
    {
        "author": "_blk_swn_",
        "body": "So look, anyone could tell you your highly concentrated. But i’ma tell you this\n\n1) you are fucking highly concentrated in some of the largest and most volatile large cap tech companies. TSLA, AAPL, and ENPH will move together since they have overlapping revenues (meaning semiconductors often fuel smartphone and other computer processing companies. \n\n2) SPCE is just getting its footing and Islas a long road ahead of it. Your time horizon, and if you are playing with stocks; Seems to be 1y+. But since you are on this site, I doubt you were thinking multi-year gains. Volatility will happen. Accept it. You are only down 2k. Ever lose 100k? How about 500k?  If you haven’t. Don’t be complaining. Try managing someone else’s money then having to explain to them why they are down 50% after giving you 25m to manage 3 weeks prior. 2k is small on the grand scale of things. It’s not about how much you lose, it’s about how fast you bounce back. \n\n3) Vol happens, live with it, love it, embrace it, trade it. Vol can be your best friend or worse nightmare. In your case, having some pretty volatile stocks doesn’t help and you’ll be exposed to it more often. Just realize that. Additionally, the market is kinda over extended, SPY and SPX calls are not being rolled up primarily cause we got an election coming and investors feel like we need a 5-10% pullback. It could happen, but historically, trading before an election is usually pretty choppy. So get used to it.\n\nIf you can trade options, use that to offset losses. Or, take some gains off the table and keep in cash for if the market dips",
        "created_utc": 1599087619,
        "id": "g3s59ii",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599116419.0
    },
    {
        "author": "cryptic_soul",
        "body": "SHOP, NVDA, SE, ENPH, NET, BIGC, OKTA, LSPD, GMHI.",
        "created_utc": 1599093324,
        "id": "g3shjcf",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1599122124.0
    },
    {
        "author": "Bhawks489",
        "body": "Solar has been great. Its taken a beating today though. Good discounts on SEDG/ENPH",
        "created_utc": 1599173743,
        "id": "g3x16ju",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1599202543.0
    },
    {
        "author": "richbeezy",
        "body": "ENPH stock.",
        "created_utc": 1599686536,
        "id": "g4l5tbm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599715336.0
    },
    {
        "author": "Stonkydonkey12",
        "body": "Dip on RKT? Acquired. \n\nEntry into Enph on dip? Established\n\nSweating balls on buying Tesla at the top? Happening",
        "created_utc": 1599055487,
        "id": "g3px4z9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599084287.0
    },
    {
        "author": "Grymninja",
        "body": "ENPH tho.",
        "created_utc": 1599146051,
        "id": "g3utm3l",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599174851.0
    },
    {
        "author": "GenTelGuy",
        "body": "VTI or VOO - broad market index funds, very safe\n\nENPH - microinverters for solar panels, down a ton today\n\nNERD - eSports ETF diversified among many gaming companies, up a ton this year as people in quarantine turn to digital entertainment\n\nAAPL  - you've already got this, I just got in today on this",
        "created_utc": 1599160317,
        "id": "g3vyz0r",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599189117.0
    },
    {
        "author": "mattcor76",
        "body": "SPY - 13.82%\n\nQTEC - 10.62%\n\nAMZN - 11.69%\n\nAAPL - 4.97%\n\nGOOGL - 6.89%\n\nPYPL -7.06%\n\nHD - 4.90%\n\nJNJ - 3.23%\n\nDNKN - 4.80%\n\nMCD - 4.81%\n\nKO - 2.37%\n\nENPH - 3.44%\n\nRUN - 1.91%\n\nTXN - 3.33%\n\nJ - 2.47%\n\nRKT - 5.03%\n\nHON - 5.46%\n\nPM - 3.15%\n\n&amp;#x200B;\n\nStarted on robinhood about 3 weeks ago and have built this portfolio quickly with mostly long term but some short term speculative plays. Initially I had too many eggs in the tech basket so I decided to spread it out more to control the damage once this bubble pops. What do you think?",
        "created_utc": 1598997386,
        "id": "g3nbf7y",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599026186.0
    },
    {
        "author": "SaveThemTurdles",
        "body": "I’d strongly urge you to avoid cannabis stock for now. It seems like a promising, untapped market but no cannabis company has been proven to be successful so far with a good long term outlook. Pretty much every cannabis stock has crashed with no signs of recovery. \n\nIf you want to invest long term into the future, consider the renewable energy sector, especially solar. Solar is the fastest growing renewable energy sector, expected to take up about 50% of the renewable energy sector by 2050. I hold SEDG, ENPH, and TAN. \n\nOther than that, tech, fintech, health, and EVs, have a great future outlook in my opinion.",
        "created_utc": 1601417502,
        "id": "g741kh2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601446302.0
    },
    {
        "author": "Thefinalwerd",
        "body": "I think ENPH is overvalued right now getting huge pumps from Biden. If he wins could go up more but if he loses it will drop like a stone. \n\nMSFT is probably the safest at its price.",
        "created_utc": 1601483119,
        "id": "g76pnr8",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601511919.0
    },
    {
        "author": "byrnedoctor",
        "body": "A diversified and parabolic portfolio\n\n&amp;#x200B;\n\nTSLA, OSTK, NVDA, GOOG, U, ENPH\n\nPTON, UBER, NFLX, CRM, HD\n\nTGT, HON, EA\n\nPYPL, UNH, SQ, SNOW, YUM\n\n&amp;#x200B;\n\nHINT: TONGUE PUNCH THE PUSSY",
        "created_utc": 1601478832,
        "id": "g76fa40",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601507632.0
    },
    {
        "author": "disorientedcheerio",
        "body": "I'm just going to re-comment what I stated in another $SBE thread. First of all, SPACs never buy a whole company. Most of the shares are held by people in the acquired company. For example, $SHLL only bought 14% of Hyliion, per their investor presentation: [https://www.sec.gov/Archives/edgar/data/1759631/000121390020015311/ea123187ex99-3\\_tortoiseacq.htm](https://www.sec.gov/Archives/edgar/data/1759631/000121390020015311/ea123187ex99-3_tortoiseacq.htm)\n\nAnd my personal DD on $SPE from the same thread:\n\n&gt;Just my two cents, but I like to compare $SBE to Enphase Energy ($ENPH) in terms of growth. $ENPH is even listed as a benchmark company for ChargePoint, in terms of public space, in $SBE's investor presentation here: [http://switchback-energy.com/wp-content/uploads/2020/09/ChargePoint-New-Investor-Deck-23-Sept-2020-8K.pdf](http://switchback-energy.com/wp-content/uploads/2020/09/ChargePoint-New-Investor-Deck-23-Sept-2020-8K.pdf)  \n&gt;  \n&gt;ChargePoint had an implied valuation of 2.4 billion when $SBE was $10 per share. I believe a fair valuation for ChargePoint as a company will be about 8-9 billion in a year, similar to where $ENPH is now. Given that valuation, my price target for $SBE would be around $20 before the merger, which implies a valuation of around 5 billion.  \n&gt;  \n&gt;It's best to just invest now, no reason to try and time it. This is a solid company with products that everyone already loves.\n\n$SBE / ChargePoint has great growth potential. I currently have 3,500 common shares @ 12.95.",
        "created_utc": 1601328776,
        "id": "g6zx3gu",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1601357576.0
    },
    {
        "author": "sunshinelighter",
        "body": "My two largest holdings...\n\n$ENPH has made me over $700k since last February. Swinging it daily the past month.\n\nWill be increasing my $SBE holdings in the coming weeks",
        "created_utc": 1601258061,
        "id": "g6wuxlc",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1601286861.0
    },
    {
        "author": "alexgoestotown",
        "body": "haha nice, ENPH is a company that I want to get into. After I started looking into residential installations I really started to appreciate their products - but I'm still holding out for a dip. Maybe I'm just salty that I missed out on 200% gains, but who knows I might be kicking myself in another year from now",
        "created_utc": 1599522438,
        "id": "g4e3b7t",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599551238.0
    },
    {
        "author": "GenTelGuy",
        "body": "ENPH, SEDG, FSLR - I personally hold ENPH",
        "created_utc": 1599858666,
        "id": "g4v6e1r",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599887466.0
    },
    {
        "author": "alberto_pescado",
        "body": "Such a shady company.   I sold shares at a loss a few months ago cause it just seems like such a scam.\n\nWatch it rally like ENPH now after the short report, reaching ATM cause that's just the world we are living in.",
        "created_utc": 1599776552,
        "id": "g4rgmvm",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1599805352.0
    },
    {
        "author": "Thetrader2896",
        "body": "Spce, enph, apple and more and tesla",
        "created_utc": 1599938924,
        "id": "g4yscqj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599967724.0
    },
    {
        "author": "kenkennedyho",
        "body": "Although I don’t trade options like so many autists here, I do have a diversified portfolio of stocks. I have minor positions in ENPH and SEDG. with all these wildfires, I’m betting on some kind of regulations or future push towards renewables. I’m up a little but hopefully I’m not too late. If Biden wins, it’ll run, if not, hopefully it’ll be a good long term investment.",
        "created_utc": 1600211244,
        "id": "g5exksh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600240044.0
    },
    {
        "author": "spartyparty33",
        "body": "Hoping for an ENPH run-up back past 70+ reallllly quick. Got some Odts relying on it",
        "created_utc": 1600373362,
        "id": "g5mk4q1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600402162.0
    },
    {
        "author": "Huey_Long_Schong",
        "body": "ALL OF THEM.\nENPH, VSLR, TAN, SEDG, RUN, etc.",
        "created_utc": 1600117701,
        "id": "g5ab2bs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600146501.0
    },
    {
        "author": "Time_Kaleidoscope",
        "body": "Oh word? Can’t say I look at this shit much. I own ENPH and I noticed TSLA has not been eating as much market share so I guess I’m not surprised",
        "created_utc": 1598956253,
        "id": "g3kloiq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598985053.0
    },
    {
        "author": "WhiteHoney88",
        "body": "1.AMZN, 2. AAPL, 3. GOOGL, 4. ENPH, 5. MSFT, 6. WMT, 7. MA, 8. V, 9. COST, 10. VEEV",
        "created_utc": 1599660164,
        "id": "g4jp2d0",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599688964.0
    },
    {
        "author": "deGoblin",
        "body": "There's that risk, definetly. I'm weighing it against policies regarding corporate taxes and middle class consumer strength. \n\nFor reference about a third of my net worth is in ENPH+SEDG, and I believe Trump has a better chance than Biden.",
        "created_utc": 1599520724,
        "id": "g4e0g9a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599549524.0
    },
    {
        "author": "mlm55",
        "body": "Still on the website, but they could be haven't followed it that closely. Your best bet might be TAN or ENPH, get at that market indirectly.",
        "created_utc": 1599491088,
        "id": "g4c6j2c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599519888.0
    },
    {
        "author": "Big80sweens",
        "body": "Funds: ICLN, QCLN, ACES\nStocks I own: AQN, NPI, FTS, BEP(C), BLX, RNW, ENPH, RUN\nInteresting green tech I have taken a punt on: DYA.TO, EWS.V, SHRC.V, POND.V (DYA I actually think will explode soon with the upcoming caveats)",
        "created_utc": 1599498391,
        "id": "g4cnxmd",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599527191.0
    },
    {
        "author": "majorchamp",
        "body": "&gt; ENPH \n\nstill seems near an all time high right now, anticipate it likely going higher in the future.... I've been looking to jump into a niche that ideally isn't already near a peak.",
        "created_utc": 1599146554,
        "id": "g3uv6dx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599175354.0
    },
    {
        "author": "LordJayfield",
        "body": "Bought ENPH at 78 and PEP at 135. I have no idea what I'm doing.",
        "created_utc": 1599147433,
        "id": "g3uxw7c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599176233.0
    },
    {
        "author": "Snow478",
        "body": "It's hilarious that so many responses to this post asking for green companies to invest in are \"BiLl gATeS?!?!\" People just can't help themselves lol. \nI've invested money into ENPH and REGI, and have been reasonably happy with both.",
        "created_utc": 1599221316,
        "id": "g3z1f50",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599250116.0
    },
    {
        "author": "winter32842",
        "body": "Bought NVDA, AMD, ETSY, FSLY, TAN, ENPH, NET and AAPL.",
        "created_utc": 1599148815,
        "id": "g3v21y6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599177615.0
    },
    {
        "author": "Thetrader2896",
        "body": "Lmao ikr, well had 100 shares of enph and it tanked hard. Sold at 75 and now at 68. Nice sell imo, and will buy again i guess I got lucky today. How long you think we will be in red. September could be a mini March",
        "created_utc": 1599157929,
        "id": "g3vsalr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599186729.0
    },
    {
        "author": "Big80sweens",
        "body": "Companies/ ETFs I’ve invested in: AQN, FTS, RNW, BEP(C), NPI, BLX, ENPH, NEE, ICLN, RUN Also interesting tech which is certainly more risky but I think worth it: DYA.TO, POND.V, SAY.V, SHRC.V",
        "created_utc": 1599232624,
        "id": "g3ztghi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599261424.0
    },
    {
        "author": "300fredosantana",
        "body": "VSLR PLUG and ENPH",
        "created_utc": 1599260423,
        "id": "g422ykq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599289223.0
    },
    {
        "author": "LeafsAreCryBabies",
        "body": "$RUN is operating at a big loss yearly. I don’t know if they’re the big play. But I’ll check out $ENPH",
        "created_utc": 1599383302,
        "id": "g47sx9z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599412102.0
    },
    {
        "author": "canadianfriesss",
        "body": "I agree with the AQN pick as well as BEPC and ENPH which others have mentioned. I would like to add GRN to the list as I believe it has amazing long term growth potential in a sector that is largely untapped",
        "created_utc": 1599335465,
        "id": "g45prtv",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599364265.0
    },
    {
        "author": "EuropeanFellow",
        "body": "I hate Biden, I hope he loses but I've got tons of ENPH and NIO and I believe that this industry is always a buy. Here in Europe everybody is super interested in renewables, it's unfortunate that the Republicans are so wrong in this subject but the stocks will go up in any circumstance.",
        "created_utc": 1600463923,
        "id": "g5qtc7r",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600492723.0
    },
    {
        "author": "Klutzy_Hamster",
        "body": "ROKU,PINS,ENPH,Z,SQ,INMD,PGNY",
        "created_utc": 1600924151,
        "id": "g6e4o6o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600952951.0
    },
    {
        "author": "cyberpimp2",
        "body": "I panic sold enph after short report. Figured I wouldn’t make they mistake again... so I panic held Nkla after that short report... fml",
        "created_utc": 1600926541,
        "id": "g6e7i8j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600955341.0
    },
    {
        "author": "Napalm32",
        "body": "Idk about best. I don't think anyone on here knows about best. But for great returns I suggest clean energy. BEPC, ENPH, SEDG even WM.",
        "created_utc": 1600803587,
        "id": "g68uptb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600832387.0
    },
    {
        "author": "upvotemeok",
        "body": "When everyone sells I buy, contrarian ENPH June 17",
        "created_utc": 1599889569,
        "id": "g4wluie",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599918369.0
    },
    {
        "author": "KimJongUnsTrousers",
        "body": "Reasons I think NKLA is a fraud but didn't get puts:\n1. GSX\n2. ENPH\n3. LK, which was also making new highs 2 months after Muddy Waters dropped the 🔨",
        "created_utc": 1600146565,
        "id": "g5btfd5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600175365.0
    },
    {
        "author": "JKK201519",
        "body": "Yeah bro remember when Citron did a report on ENPH and how they were a doozie? Sort of like today with NNOX. These fools all fall for this losers reports just so he can short and continue to make unreal amounts of money every year. I mean Citron said they were going no where, remember when PTON was given a $5 price point? Anyways love ENPH. Just wanted to point out all these sheep. I’m long on my position on NNOX but getting in at $25 definitely will make these bumps over the next year or two easier to stomach.",
        "created_utc": 1600210089,
        "id": "g5evgrk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600238889.0
    },
    {
        "author": "Snow478",
        "body": "I have had ENPH for a while now, and it's been one of the few keeping me afloat",
        "created_utc": 1600177762,
        "id": "g5cs28t",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600206562.0
    },
    {
        "author": "NewResearcher2030",
        "body": "Same shit here was 40% nio. Now 60% nio and 40% msft. Currently 6% down. \nThinking to diversy with the current dip to 20% nio 20% msft 10%amazon 10%HD 10%Dis 5%enph 5%CSIQ 5%NET\n5% fsly",
        "created_utc": 1599954995,
        "id": "g504ep3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599983795.0
    },
    {
        "author": "forwardpass",
        "body": "Why Sedg and no Enph?",
        "created_utc": 1600952961,
        "id": "g6f568q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600981761.0
    },
    {
        "author": "roundupinthesky",
        "body": "Just go with buzz stocks: Bynd, tsla, rkt, snow, enph, amd/nvda",
        "created_utc": 1600314600,
        "id": "g5jtfxu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600343400.0
    },
    {
        "author": "ShortyOnFire",
        "body": "aapl,msft,sedg,enph",
        "created_utc": 1600369312,
        "id": "g5m9g8o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600398112.0
    },
    {
        "author": "jumpingjacks86",
        "body": "You guys remember a few months back when some investment group with short positions on ENPH said they they had a former employee in Germany say ENPH was cooking the books and the stock free fell from 70 to under 40. Haven’t heard any investigation on this, it cucked a lot of people and I’m sure insiders made a fuck load of money off it as ENPH is back near ATH",
        "created_utc": 1601214256,
        "id": "g6ujab0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601243056.0
    },
    {
        "author": "Thalesian",
        "body": "Problem is, all our goody-two-shoes investments in green energy ($TAN, $ENPH, etc.) are hitting all time highs as SPY drops. Makes it hard to leave. \n\nBut I’ll bring it up at the next CNN-Soros meeting. We can always use the cashed out equities to pay more protestors.",
        "created_utc": 1601438784,
        "id": "g753c9l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601467584.0
    },
    {
        "author": "ShortyOnFire",
        "body": "TAN etf,enph,sedg",
        "created_utc": 1601393021,
        "id": "g72hqgz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601421821.0
    },
    {
        "author": "sunshinelighter",
        "body": "I have shares in my long-term account (avg. $5~...those are the ones I won't touch).\n\nI swing trade the shares day after day...and then I'll day trade the option calls that expire usually the following month. \n\n$ENPH is pretty predictable pattern, 'ol classic \"Rip and Dip\" or the \"Dip and Rip\".",
        "created_utc": 1601304262,
        "id": "g6yevdj",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601333062.0
    },
    {
        "author": "vaporwaverhere",
        "body": "NVDA, ENPH.",
        "created_utc": 1601299856,
        "id": "g6y7acl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601328656.0
    },
    {
        "author": "BOOmabad",
        "body": "ENPH is looking like a good solar play.",
        "created_utc": 1601319075,
        "id": "g6zc7qx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601347875.0
    },
    {
        "author": "mercury2six",
        "body": "I hate this stock along with enph. I have serious hindsight on these two. \nHad a hundred shares of enph early last year around $9/share. I sold happily around 12/share. \nVslr this summer I bought 10 calls at an 11 strike. Paid $800. I normally don't hold those very long. I held these contracts for over a month and carried the bag the entire time. I finally cut my losses and took a near 45% loss. \nThe fucking same day I closed my calls out, they announced the merger and skyrocketed. \nSo now I just own TAN.",
        "created_utc": 1601062274,
        "id": "g6kcvc4",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1601091074.0
    },
    {
        "author": "JohnWall135",
        "body": "ENPH",
        "created_utc": 1601075654,
        "id": "g6l1vrs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601104454.0
    },
    {
        "author": "upvotemeok",
        "body": "Told y'all nkla would bounce back. Just like ENPH. When everyone's hating I'm buying. I'll sell when people stop hating.",
        "created_utc": 1600102246,
        "id": "g590su6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600131046.0
    },
    {
        "author": "inb4ElonMusk",
        "body": "It’s one thing to inverse immediate sentiment on ENPH after the report on them, but with NKLA it’s a whole other.",
        "created_utc": 1600211490,
        "id": "g5ey0mx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600240290.0
    },
    {
        "author": "Klutzy_Hamster",
        "body": "ENPH/SEDG",
        "created_utc": 1600123299,
        "id": "g5aoh5h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600152099.0
    },
    {
        "author": "Peregrination",
        "body": "Look at GSX. Plenty of fraud yet it ran up significantly after initially falling from a short seller report. Granted it's also got shady China money, but similar short squeezing applied there. ENPH also jumped a bit on fraud allegations too. \n\nPeople love bankruptcy and scam companies these days. IDK.",
        "created_utc": 1600096412,
        "id": "g58lcbw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600125212.0
    },
    {
        "author": "RaptorMan333",
        "body": "Agree 100% jump in now while you can. They're super overlooked in favor of popular stuff like ENPH, ICLN and SEDG",
        "created_utc": 1600289701,
        "id": "g5if6ou",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600318501.0
    },
    {
        "author": "visioNteaM",
        "body": "my pos: ROKU // CRM // DELL // MTCH // NIO // ENPH // FDX",
        "created_utc": 1599861650,
        "id": "g4vd2p8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599890450.0
    },
    {
        "author": "wellidliketotellyou",
        "body": "Hi all, 24 years old. I’m trying to strike a balance in my portfolio between high-risk, high-reward stocks and relatively safe/stable stocks. Here is my portfolio:\n\n\n\nDKNG - 100 shares\n\n\n\nENPH - 100 shares\n\n\n\nDIS - 35 shares\n\n\n\nVTI - 20 shares \n\n\n\nARKK - 6 shares \n\n\n\nMSFT - 4 shares \n\n\n\nO - 4 shares\n\n\n\nI would like to continue building a position in the last three holdings. I’ve recently been enamored by the prospect of ARKK, because it allows me to satiate my desire for companies with high-growth potential without having to fear losing it all if I choose the wrong company. I’ve been hearing some stuff about how actively managed funds are always going to underperform, so I suppose I would appreciate some insight as to how ARKK may be a good decision or a bad one.",
        "created_utc": 1599492921,
        "id": "g4carvb",
        "score": 1,
        "subreddit": "investing",
        "created": 1599521721.0
    },
    {
        "author": "wellidliketotellyou",
        "body": "Hi all, 24 years old. My portfolio:\n\n\n\nDKNG - 100 shares\n\n\n\nENPH - 100 shares\n\n\n\nDIS - 35 shares\n\n\n\nVTI - 20 shares \n\n\n\nARKK - 6 shares \n\n\n\nMSFT - 4 shares \n\n\n\nO - 4 shares\n\n\n\nI would like to continue building a position in the last three holdings. Any advice before diving in?",
        "created_utc": 1599492627,
        "id": "g4ca2zt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599521427.0
    },
    {
        "author": "SaveThemTurdles",
        "body": "I’d buy more now if I had the funds. See how the market moves on Tuesday but if you’re holding long term it won’t matter that much. ENPH is a solid company that has the largest market share of Microinverters manufactured and sold. Super innovative company that I think will continue to grow with the growth of the solar sector",
        "created_utc": 1599409277,
        "id": "g48sa7a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599438077.0
    },
    {
        "author": "JKK201519",
        "body": "Nope didn’t. RIP to everyone who didn’t sell ENPH who Citron reported was a dud with a price target of $0 right? Same to the people who held PTON after the report saying it had a price point of $5. Keep following the dude who makes sheep like you sell off so he can short and continue to make an absolute fortune.",
        "created_utc": 1600308254,
        "id": "g5jgn25",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600337054.0
    },
    {
        "author": "Time_Kaleidoscope",
        "body": "Don’t forget they own one of the largest if not the largest solar panel company in North America. Solar stocks have been on fire this year as well, look at VSLR and ENPH. We are diverging from oil based economy into renewables and as much as I hate this valuation as well in a decade it will make sense",
        "created_utc": 1598943871,
        "id": "g3kaaj6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598972671.0
    },
    {
        "author": "Grymninja",
        "body": "AAPL NIO ENPH all day.",
        "created_utc": 1599184730,
        "id": "g3xqco7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599213530.0
    },
    {
        "author": "Big80sweens",
        "body": "Funds: ICLN, QCLN, ACES\nStocks I own: AQN, NPI, FTS, BEP(C), BLX, RNW, ENPH, RUN\nInteresting green tech I have taken a punt on: DYA.TO, EWS.V, SHRC.V, POND.V (DYA I actually think will explode soon with the upcoming caveats)",
        "created_utc": 1599325221,
        "id": "g45503y",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599354021.0
    },
    {
        "author": "sh0ckt",
        "body": "6% UNA \n\n6% ASRNL \n\n12% ASML \n\n5% CRBN \n\n8% AD\n\n5% INTC \n\n2% AVTX\n\n2% ENPH \n\n5% INGA\n\n2% BAC\n\n16% AAPL\n\n24% MSFT\n\n3% NEE\n\n2% PLUG \n\nlooking to rebalance a bit away from tech",
        "created_utc": 1599260111,
        "id": "g422b5u",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599288911.0
    },
    {
        "author": "Mossles",
        "body": "Join the enph train. Especially now that's its pulled back",
        "created_utc": 1599400708,
        "id": "g48bspp",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599429508.0
    },
    {
        "author": "Oggang1255",
        "body": "Nvidia, msft, fortinet, palo alto networks, Mastercard, Visa",
        "created_utc": 1599176648,
        "id": "g3x9u5s",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599205448.0
    },
    {
        "author": "SteveSharpe",
        "body": "I am in the industry, and CrowdStrike makes a good product, but endpoint security solutions seem to come and go in popularity all the time.  A few years ago the hot one was Carbon Black.  Now it's CrowdStrike with all the hype.\n\nI suspect in a few years something new and better will emerge.  Cybersecurity is tough to invest in because it changes so rapidly.  Rather than invest in a point solution company, I'd recommend looking at a security company that is much more diverse like a Fortinet or Palo Alto Networks.",
        "created_utc": 1599095482,
        "id": "g3slh6l",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599124282.0
    },
    {
        "author": "BigDickRetard69",
        "body": "FTNT",
        "created_utc": 1599330192,
        "id": "g45f1os",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599358992.0
    },
    {
        "author": "mrelisamuel",
        "body": "CRWD will not disappoint. Fortinet (a smaller company) reported weeks earlier and  it beated  its estimates. CRWD can only go up.",
        "created_utc": 1598999412,
        "id": "g3nfun1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599028212.0
    },
    {
        "author": "Kay312010",
        "body": "More TDOC and FTNT. Dollar cost average on good long term plays.",
        "created_utc": 1599084992,
        "id": "g3rzmxb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599113792.0
    },
    {
        "author": "paranoidandroid59",
        "body": "FedEx. UPS. Amazon. Walmart. Berkshire. Corning. Google. P&amp;G. All resilient companies and have proven they aren’t going anywhere bc of Covid. \n\nI’ll add in Facebook. I hate the company but this is an election year and advertising spending is the only way candidates are getting in front of voters.",
        "created_utc": 1598998452,
        "id": "g3ndv8b",
        "score": 9,
        "subreddit": "stocks",
        "created": 1599027252.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW only pumps when I sell my calls",
        "created_utc": 1599070958,
        "id": "g3qzsy1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599099758.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "I might just go in on GLW. They’re manufacturing the vials for the vaccine",
        "created_utc": 1599084494,
        "id": "g3ryoz3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599113294.0
    },
    {
        "author": "paranoidandroid59",
        "body": "FedEx. UPS. Amazon. Walmart. Berkshire. Corning. Google. P&amp;G. All resilient companies and have proven they aren’t going anywhere bc of Covid. \n\nI’ll add in Facebook. I hate the company but this is an election year and advertising spending is the only way candidates are getting in front of voters.",
        "created_utc": 1598998452,
        "id": "g3ndv8b",
        "score": 9,
        "subreddit": "stocks",
        "created": 1599027252.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW only pumps when I sell my calls",
        "created_utc": 1599070958,
        "id": "g3qzsy1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599099758.0
    },
    {
        "author": "thatlookslikemydog",
        "body": "I’m sorry I made Tesla go down today. I bought 2 shares and I forgot to warn you all that whenever I buy Tesla it goes down.",
        "created_utc": 1598986207,
        "id": "g3mis9s",
        "score": 209,
        "subreddit": "wallstreetbets",
        "created": 1599015007.0
    },
    {
        "author": "hedgeAgainst",
        "body": "Yes... this is actually some good trading advice. If it ever feels like it's become too easy, it's about to flip on you. Get out while you're ahead.",
        "created_utc": 1598990129,
        "id": "g3mt8go",
        "score": 180,
        "subreddit": "wallstreetbets",
        "created": 1599018929.0
    },
    {
        "author": "bigd710",
        "body": "It takes money to save money",
        "created_utc": 1598991787,
        "id": "g3mxvmc",
        "score": 113,
        "subreddit": "wallstreetbets",
        "created": 1599020587.0
    },
    {
        "author": "manitirol13u",
        "body": "Trust me, it won't happen.",
        "created_utc": 1599021489,
        "id": "g3omagw",
        "score": 108,
        "subreddit": "investing",
        "created": 1599050289.0
    },
    {
        "author": "BigPamp",
        "body": "See the problem is I need like 100k for this. I own one Apple leap and it is like half my net worth.",
        "created_utc": 1599010224,
        "id": "g3o3eat",
        "score": 81,
        "subreddit": "wallstreetbets",
        "created": 1599039024.0
    },
    {
        "author": "reeses4brkfst",
        "body": "You're making a good decision. Set limits or you will gamble till you lose it all. If it's good enough to screenshot it's good enough to sell.",
        "created_utc": 1598990197,
        "id": "g3mtffx",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1599018997.0
    },
    {
        "author": "SECwontletMEB",
        "body": "The problem is, like you said, in 10 minutes you can make more than you do working full time for a month.  How the fuck are you supposed to slave away at an hourly wage job when you see how easy it is to make money?  Do you remember that rush when you wake up to a 10 bagger? It’s better than sex. You’ll be back, no one stays away for long.",
        "created_utc": 1598990940,
        "id": "g3mvhoc",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1599019740.0
    },
    {
        "author": "Sarkham89",
        "body": "Don’t tell her or anyone. It doesn’t benefit anyone, it would only make you feel good about yourself.",
        "created_utc": 1598996322,
        "id": "g3n96zq",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1599025122.0
    },
    {
        "author": "FATTEST_CAT",
        "body": "The whole five way split thing has really screwed with my mind.  Like I thought it was crazy when it went up to 900 busks the first time, so I didn't buy any.  It dropped to 450 so I bought a couple of shares, and now it's split and I have more.  But I have to keep reminding myself that if it's above 200 bucks a share then by my estimates it's over valued, and yet somehow I'm expecting it to go up to like 700 a share, even though it would really be 3500 a share pre split.  So I thought 900 was crazy and yet think 3500 is somehow possible.  \n\nI just need to stop looking at it.",
        "created_utc": 1598996505,
        "id": "g3n9l3b",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1599025305.0
    },
    {
        "author": "HyruleJedi",
        "body": "Yeah total butfucking after 3 years of crushing it \n\nI thought today was gonna be a lot worse with you autist retards finally buying the hype yesterday",
        "created_utc": 1598994843,
        "id": "g3n5tgl",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1599023643.0
    },
    {
        "author": "IndianBoglehead",
        "body": "The markets can remain irrational longer than you can remain solvent.\n\nBe calm. Have an emergency fund for basic expenses. Keep dollar cost averaging. And if there is a market recession, invest a lumpsum. That’s it.",
        "created_utc": 1599025221,
        "id": "g3or4le",
        "score": 55,
        "subreddit": "investing",
        "created": 1599054021.0
    },
    {
        "author": "quantum-black",
        "body": "Lol I think aside from money, what gets people hooked to try chasing those 10 baggers is that feeling of validated. You feel validated by the market that your intuition was correct amongst all the idiots that picked wrong, and all the times you picked the wrong side. It feels good to be right ... 1 out of 100",
        "created_utc": 1598997998,
        "id": "g3ncqh4",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1599026798.0
    },
    {
        "author": "Red-eleven",
        "body": "Which of you jacked it to these cartoon sluts?",
        "created_utc": 1598993440,
        "id": "g3n2c6g",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1599022240.0
    },
    {
        "author": "SolitaryEgg",
        "body": "The year: 2074.\n\nI'm an old man now. My body is a shell of what it once was. My wife left this world some years ago. That's when the joy left. That's when hope left. \n\nI'm not a religious man, but I sometimes allow my mind to slip away as I imagine holding her again. I run my fingers through her strawberry-blonde hair. Maybe it's in heaven, or some other ethereal place. I don't believe, but pretending that I do makes me feel alive again, if only for one fleeting moment. \n\nI turn on my neuralink and close my eyes. I flip through old pictures. It's her. For a moment, I can almost smell her in the room. Lavender, and fresh wildflowers. It's enough to bring a strained smile to this old, callous, weathered face.\n\nI open a browser and check the S&amp;P futures. 3536. It hasn't moved in decades now, it would seem. But I keep checking. I don't know why. Maybe the repetition takes my mind off things, or maybe it just reminds me of the old days. When I was happy. \n\nSitting in the empty, dusty room, I let out a broken whimper: \"futures flat... and gay.\"",
        "created_utc": 1599022641,
        "id": "g3onv2f",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1599051441.0
    },
    {
        "author": "sirms",
        "body": "TSLA S&amp;P inclusion obviously imminent. stock split and now the capital raise to pay off debt. Elon clearly getting it cleaned up and ready to go for the S&amp;P",
        "created_utc": 1598991168,
        "id": "g3mw5nq",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1599019968.0
    },
    {
        "author": "shliam",
        "body": "Not being confrontational, but why wouldn't AWS be able to function in the same way as it's own company?  It has the highest profit margins on any of Amazon's entities ( I believe I've heard 90+%, however, I haven't confirmed this).",
        "created_utc": 1599024445,
        "id": "g3oq6qy",
        "score": 45,
        "subreddit": "investing",
        "created": 1599053245.0
    },
    {
        "author": "hydershykh",
        "body": "Here's a layman explanation for the tool. This might be helpful to the non-tech folks:\n\nSo  let's stay there is a day when vaccine comes up, all stocks start to  rally hard and volume increases significantly. It keeps going on for a  few days for many biotech stocks but there is a certain stock X where  the volume keeps increasing but the price isn't increasing similar to  others.\n\nNow in this case, that is  an anomaly or an unusual pattern. What might be happening is rich folks  getting large positions in X and they are pretty sure that it's gonna  rocket in near future. This is what this tool tries to catch - stocks  that behave abnormal relative to the entire stock market.\n\nThat's all you need to know, the technicals are not necessary.\n\nHope this makes more sense.",
        "created_utc": 1598996438,
        "id": "g3n9gej",
        "score": 43,
        "subreddit": "pennystocks",
        "created": 1599025238.0
    },
    {
        "author": "MoneybagginYourMom",
        "body": "My dog died in my lap today listening to the song Good Riddance(Time of your life) by Greenday (he loved rock)\n\nRip bubba it was a good 15 years..",
        "created_utc": 1598975057,
        "id": "g3lnt61",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1599003857.0
    },
    {
        "author": "hirme23",
        "body": "And that's how it should be. Yolo'ing 5k is easy when making 70k/year. Yolo'ing 300k, you think twice before clicking the buy button Hahaha\n\nWell done mate!",
        "created_utc": 1598998766,
        "id": "g3nemkh",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1599027566.0
    },
    {
        "author": "alexanderflynn81",
        "body": "“Happy to advise them for free” shut the fuck up, guy talks like he’s the hottest shit in the world. As great as it would be to see NKLA change the EV game in the next decade, it would suck to see this fool get dragged along with them. \n\nThat being said SHLL GANG LETS RIDE",
        "created_utc": 1599007427,
        "id": "g3nxhi4",
        "score": 35,
        "subreddit": "SPACs",
        "created": 1599036227.0
    },
    {
        "author": "solidmussel",
        "body": "No tsla is risk free because it only goes up",
        "created_utc": 1599015930,
        "id": "g3odm9m",
        "score": 35,
        "subreddit": "investing",
        "created": 1599044730.0
    },
    {
        "author": "jbrownwood",
        "body": "What the hell do think yesterday was? Did you not see the .25% correction? How much further do you want it to drop you greedy gay bear.",
        "created_utc": 1598954270,
        "id": "g3kjt28",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1598983070.0
    },
    {
        "author": "TheFalcoholic247",
        "body": "I kinda like it like that",
        "created_utc": 1598991063,
        "id": "g3mvurr",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1599019863.0
    },
    {
        "author": "seancarr181",
        "body": "People who are rooting for a stock like TSLA or RKT to fail and have no positions in it need to fuck off. We don’t give three shits about the fundamentals. We’re here for the lulz and tendies. Stop hating from the sidelines.",
        "created_utc": 1598991335,
        "id": "g3mwmc5",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1599020135.0
    },
    {
        "author": "rainman_104",
        "body": "The market can stay irrational longer than you can stay solvent.    I dumped tesla when it approached ford levels of valuation.   I just didn't see it surpassing Ford.   Here we are, the stock market is making them the single largest car company in the world.\n\nYes they are more.  Herp so is Toyota, Hyundai, Volvo, and VW.   They're much more than car companies too.   \n\n&amp;#x200B;\n\nLet's see where it goes, but I'm going to stay away from this.  Enjoy the ride folks, it's been fun to watch everyone be so happy.\n\n&amp;#x200B;\n\nHowever let's not let emotion get the better of us.  People who say: \"you just don't understand Tesla like I do\" are just using confirmation bias to justify their positions.   \n\n&amp;#x200B;\n\nGreat company with great engineers and great leadership.  All that is absolutely true.   Good diversity in their positions beyond just cars is true as well.   None of this justifies them as a top ten company in the world.",
        "created_utc": 1598990243,
        "id": "g3mtjye",
        "score": 34,
        "subreddit": "stocks",
        "created": 1599019043.0
    },
    {
        "author": "sandawg_",
        "body": "Ah yes. Thank you for this DD after it went up 15% today. You're doing god's work, good sir",
        "created_utc": 1599005475,
        "id": "g3nszrq",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1599034275.0
    },
    {
        "author": "Grumpy-james",
        "body": "fucking finally someone made it ive been waiting for this one",
        "created_utc": 1598985327,
        "id": "g3mgapb",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1599014127.0
    },
    {
        "author": "MAGA_WALL_E",
        "body": "YOLO on RKT. Either I'm buying the Wendy's or I'm sucking dick behind it.",
        "created_utc": 1598991630,
        "id": "g3mxgn4",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1599020430.0
    },
    {
        "author": "MattDamonIsGod",
        "body": "My coworker started talking to me about stocks in the break room so I pretended I knew nothing about it and acted like he was a genuis for knowing what a call is and profiting off of AAPL. It's the little things that give people a reason to hang on.",
        "created_utc": 1598958384,
        "id": "g3kntnm",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1598987184.0
    },
    {
        "author": "insectidentify",
        "body": "Why would people buy food at the grocery store when they can just grow it in their back yard?",
        "created_utc": 1599032258,
        "id": "g3oz2a2",
        "score": 31,
        "subreddit": "investing",
        "created": 1599061058.0
    },
    {
        "author": "bottledfart_tv",
        "body": "If TSLA was “finished” it would absolutely tank.  This price action is healthy moving forward",
        "created_utc": 1598981704,
        "id": "g3m6brw",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1599010504.0
    },
    {
        "author": "simplenicc",
        "body": "Made the horrible mistake of showing my buddy options now he won't stfu about it.  MF just let me gamble in peace",
        "created_utc": 1599028080,
        "id": "g3oudo7",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1599056880.0
    },
    {
        "author": "Letpigeonsfly",
        "body": "AAPL runs another 4% tomorrow I will do nothing but tell you guys I made tendies. If it falls I will tell you to buy the dip. That is all.",
        "created_utc": 1599008844,
        "id": "g3o0nus",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1599037644.0
    },
    {
        "author": "ATL_LAX",
        "body": "The psychological effect due to a stock split makes it worthwhile",
        "created_utc": 1598993046,
        "id": "g3n18jv",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1599021846.0
    },
    {
        "author": "abcwalmart",
        "body": "Holy shit guys, I am actually fucking retarded.\n\nI'm up 17% today on fucking Apple calls I bought at 11:30. \n\nLiterally all you have to do to make money in this market is buy tech calls!!!!1!1! It's that fucking simple!!! Fuck your TA, if you want to make easy money, all you have to do is listen to all these TSLA and AAPL shills in the daily threads and stop buying the retarded shit your gUt tElLs yOu to buy!!!1! It really is that easy!!!\n\nThis is coming from someone who generally tries to time puts on SPY based on the VIX accelerating, which obviously wouldn't have worked out well for the past few days.\n\n........The bad news is that if the most stubborn 🏳️‍🌈🐻 are capitulating, this must be the top",
        "created_utc": 1598991194,
        "id": "g3mw87r",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1599019994.0
    },
    {
        "author": "Simercs",
        "body": "This is the way, never doubt your vibe. And if it turns out you flew too close to the 🌞, fuck the haters at least you tried.",
        "created_utc": 1598994365,
        "id": "g3n4pry",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1599023165.0
    },
    {
        "author": "isellgoodqualitygood",
        "body": "Nice nice nice. I actually do like this... I had January 2021 calls for Apple that I bought for 3k back in April (500c)  &amp; they’re worth about 200k now, didn’t know what I was doing so I never held. I’ll be doing something similar this week setting aside about 2-3k for boeing calls OTM, this time just sitting on it.",
        "created_utc": 1599010247,
        "id": "g3o3fqx",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1599039047.0
    },
    {
        "author": "Nanostrip",
        "body": "\"fuck it, I already lost it all once.\"",
        "created_utc": 1598992225,
        "id": "g3mz0uk",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1599021025.0
    },
    {
        "author": "_ddeeezzzz",
        "body": "Roth IRA, max it out please.",
        "created_utc": 1598997306,
        "id": "g3nb8q0",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1599026106.0
    },
    {
        "author": "brontide",
        "body": "20 miles... wimp.  Make it 100 miles to make it interesting.",
        "created_utc": 1599000597,
        "id": "g3ni2et",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1599029397.0
    },
    {
        "author": "Jabbermouth",
        "body": "Hit 28k today\n\nStarted with 5.5k back in mid June\n\nI’d like to say it was all luck\n\nBut it was actually all tech calls",
        "created_utc": 1599005591,
        "id": "g3nt9pg",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1599034391.0
    },
    {
        "author": "limited_juice",
        "body": "Just Google it on Bing!",
        "created_utc": 1598993948,
        "id": "g3n3qn5",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1599022748.0
    },
    {
        "author": "uaoleksiy",
        "body": "Ok bed time. 1g of mediocre blow finished, 9 beers deep. About to smoke a j and try to go to bed. The woman is pissed as fuck because I day drank. Jokes on her pull out couch from bobs furniture is a queen size bed and I have Roku w CNBC on it in our office. See you bois tomor",
        "created_utc": 1599029662,
        "id": "g3ow1xw",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1599058462.0
    },
    {
        "author": "nosalute",
        "body": "ZM was so obvious that it wasnt.",
        "created_utc": 1599010453,
        "id": "g3o3t51",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1599039253.0
    },
    {
        "author": "lomohodler",
        "body": "Why would he raise and pay off debt? Debt is cheap right now. That raise will be used as LTV for more debt. You don’t grow exponentially by paying off debt, you do it by leveraging up.",
        "created_utc": 1598975213,
        "id": "g3lo82v",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1599004013.0
    },
    {
        "author": "The-WanderingBread",
        "body": "I bought more shll calls a few minutes ago and it pops up all of a sudden. Up 50% on those calls already",
        "created_utc": 1598987020,
        "id": "g3ml28y",
        "score": 26,
        "subreddit": "SPACs",
        "created": 1599015820.0
    },
    {
        "author": "AnonymousAstro",
        "body": "I sold a naked 9/4 $410c at close as a part of a strangle because an “$85 move up in a day is impossible”. I sold it for $70 and ate a $2800 loss this morning.\n\n**One big lesson learned:** people will buy up everything and try to make it the new TSLA. ZM has EPS of $.92 and a current P/E ratio of $1700ish. It’s now worth more than IBM.\n\nAs long as “stonks go up”, I’ll stick to selling puts only.",
        "created_utc": 1598993396,
        "id": "g3n27ob",
        "score": 26,
        "subreddit": "options",
        "created": 1599022196.0
    },
    {
        "author": "Whats_Up_Joe",
        "body": "Win or lose you TSLA boys are the bright spot of 2020. You drove up the price so far on a previously shaky company that used to receive so much hate, that it can pay off a huge chunk of debt with a small offering. It's place in our future and Elon's ability to change the world has been stregthened by your efforts. \n\nBless you all, and hope you didn't have FD calls lol",
        "created_utc": 1598991083,
        "id": "g3mvwx2",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1599019883.0
    },
    {
        "author": "lasco10",
        "body": "Y’all haven’t seen a real rug pull and it really shows.",
        "created_utc": 1599058084,
        "id": "g3q35zr",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1599086884.0
    },
    {
        "author": "csyuppie",
        "body": "People are downvoting this but take it from CSYuppie, one of the people automating away the jobs: if we don’t have some form of UBI in the next 20 years the average American is going to get really poor really fast.",
        "created_utc": 1599067971,
        "id": "g3qs79p",
        "score": 24,
        "subreddit": "investing",
        "created": 1599096771.0
    },
    {
        "author": "Tjhuntz",
        "body": "TSLA gang where you at if you made it through today we eatin like kings for breakfast",
        "created_utc": 1598993832,
        "id": "g3n3fcq",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1599022632.0
    },
    {
        "author": "Wheream_I",
        "body": "A fast casual restaurant (like a poke place) is doing ducking amazingly if it is doing $1 million a year in revenue. \n\nThis guy seriously thinks a single location is $1 **Billion?** How dumb is he...\n\nEdit: my dad was a restauranteur his entire life and has taken 1 public, and he’s mentioned the above to me. Get out of here with your downvotes",
        "created_utc": 1598999748,
        "id": "g3nghbp",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1599028548.0
    },
    {
        "author": "HGInvestor",
        "body": "I watched as an autist, by the time it finished I was a retard.",
        "created_utc": 1598986716,
        "id": "g3mk8ge",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1599015516.0
    },
    {
        "author": "Flyguy8701",
        "body": "Lmao it says he was credited $33 for each contract and he has 2. I don’t understand.",
        "created_utc": 1599010482,
        "id": "g3o3uzj",
        "score": 23,
        "subreddit": "RobinHood",
        "created": 1599039282.0
    },
    {
        "author": "GourmetFilet",
        "body": "Just scroll through and read the comments. I don’t know when half these people joined, but the retard level of some of the questions tonight is off the charts. \n\nit sounds like some of these people legit haven’t purchased an option before, and they are in here. \n\nThis sub is getting ridiculous. This is the fucking top.",
        "created_utc": 1599027822,
        "id": "g3ou3if",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1599056622.0
    },
    {
        "author": "Griffinhunters",
        "body": "You guys remember COVID?   Man that sure was crazy wasn’t it.",
        "created_utc": 1599011743,
        "id": "g3o65p4",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1599040543.0
    },
    {
        "author": "DKNG-STONK",
        "body": "Trevor is a douchebag. And even given the opportunity to shit talk Trevor, Healy, handled it tactfully. \n\nHealy is legit. He sounds like a pragmatic, salt of the earth kind of guy. Boomers are going to love investing in Hyliion because of him. Trucking companies are going to love to buy from a guy like him. \n\nHe’s not flashy, which is good because the trucking industry isn’t flashy. It’s blue collar and hardworking. Trevors flashy elitism “happy to advise them for free” should be one of many red flags.",
        "created_utc": 1599008438,
        "id": "g3nzr6s",
        "score": 23,
        "subreddit": "SPACs",
        "created": 1599037238.0
    },
    {
        "author": "Houston_swimmer",
        "body": "Buy the dip bro i can’t believe it’s so cheap, it was 2500 just last week",
        "created_utc": 1599018161,
        "id": "g3ohblj",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1599046961.0
    },
    {
        "author": "almostmicrochip",
        "body": "when u decide to take psychedelics and trade options because u think you’ll be able to see the patterns\n\nbut instead u realize that money is just a social construct created for the purchase of goods and services with no inherent value. \n\n\nyou could live a life out in the mountains. smoke coming out of your tiny cabin. deer walk up to you, allowing you to pet it. all without a single dime spent.\n\n\n\n\n... aaaaand your account is worthless. next time don’t trade while tripping you dummy.",
        "created_utc": 1598982584,
        "id": "g3m8p0k",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1599011384.0
    },
    {
        "author": "AlteredCabron",
        "body": "Yea, just don’t kill yourself. Not worth it",
        "created_utc": 1598982098,
        "id": "g3m7drs",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1599010898.0
    },
    {
        "author": "_metoo_x_x",
        "body": "Everyone’s doing it",
        "created_utc": 1598991083,
        "id": "g3mvww3",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1599019883.0
    },
    {
        "author": "1058pm",
        "body": "I just threw some money in it that i dont expect back and said fuck it",
        "created_utc": 1598998676,
        "id": "g3nef3p",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1599027476.0
    },
    {
        "author": "subnative1",
        "body": "**DD**  \n\nListen, fellas, and even gay bears.  \nThe nasdaq is nothin' but a big titty stripper with a fat ass, that *everyone* is throwin' hundreds at. and the best part is, she doesn't even notice when you pick up a bill you already tossed at 'er, and stuff it right back into her g-string.   \nfeel like you missed out?  \nlost money on retarded walmart weeklies?  \nyou didn't miss out on anything babe.  \njust buy tomorrow.   \n\nIt works till it doesn't :)",
        "created_utc": 1598995365,
        "id": "g3n70tc",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1599024165.0
    },
    {
        "author": "NovelOrganization5",
        "body": "Step 1: buy tech calls\n\nStep 2: that’s it. That’s literally all you have to do.",
        "created_utc": 1599022358,
        "id": "g3onhfd",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1599051158.0
    },
    {
        "author": "AdditionalLawyers",
        "body": "TSLA going to have to do another stock split when it hits $2000 again on Friday",
        "created_utc": 1598950159,
        "id": "g3kg59e",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1598978959.0
    },
    {
        "author": "lllkill",
        "body": "lmao it is so ugly",
        "created_utc": 1599002344,
        "id": "g3nlrgc",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1599031144.0
    },
    {
        "author": "TudorMeister1270",
        "body": "YOLO it in TSLA calls so she can move out with her boyfriend",
        "created_utc": 1598952334,
        "id": "g3ki216",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1598981134.0
    },
    {
        "author": "LittleStett",
        "body": "Like im not gay but if Elon presented me with the option I feel like I owe it to him",
        "created_utc": 1598951165,
        "id": "g3kh1b4",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1598979965.0
    },
    {
        "author": "nacliamsi",
        "body": "as usual, wsb DD comes out after a 75% move. IV already thru the roof.\n\nit means we could dip a little to shake out newcomers.\n\nwith that said, i'm long October $8 and $10 calls. i think the big squeeze will be after earnings and if/when Cohen buys more.",
        "created_utc": 1598984326,
        "id": "g3mdhms",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1599013126.0
    },
    {
        "author": "Zachincool",
        "body": "if it was actually you, thanks bro",
        "created_utc": 1599069359,
        "id": "g3qvsol",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1599098159.0
    },
    {
        "author": "OlyBomaye",
        "body": "Here’s some DD.  I asked my consumer spending analyst (girlfriend who has been sitting around my house for the past 6 months watching tv and raising our daughter while I work all day) which of the shitty retail stocks will beat earnings this week and she said the following:\n\nMichaels had great curbside pickup and she did arts and crafts all summer.  Some of her art that she created on a whim is hanging on my wall next to my masters degree that I worked really hard to obtain.  Strong buy.\n\nVera Bradley probably benefited from people like her sitting around all day buying their shit online\n\nShoe Carnival sucks\n\nFive Below is probably bankrupt\n\nMacy’s is actually bankrupt\n\nWe agreed not to even think about Duluth Trading because it seems like it should do well but nobody knows anybody who has ever bought anything from them.",
        "created_utc": 1599016050,
        "id": "g3odtly",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1599044850.0
    },
    {
        "author": "JayMoney2424",
        "body": "RKT is ready to crush it tomorrow",
        "created_utc": 1598995516,
        "id": "g3n7dia",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1599024316.0
    },
    {
        "author": "-GregTheGreat-",
        "body": "I told my Dad that I’ve made 2.5x my original investment in under 3 weeks in the stock market and he started freaking out about how I needed to cash out those positions and diversify them into safe stocks immediately before I lose it and regret it. \n\nOkay boomer 🙄",
        "created_utc": 1599026628,
        "id": "g3osrzz",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1599055428.0
    },
    {
        "author": "CptTonyStark",
        "body": "I'm just here for a little while, I realized I don't actually like Reddit I just use it to fill the emptiness Inside, as a substitute for something real",
        "created_utc": 1599009656,
        "id": "g3o2dpj",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1599038456.0
    },
    {
        "author": "iamchromes",
        "body": "It makes me sad knowing I started with $15k in July and I’m still hovering around $15k after 2 months",
        "created_utc": 1599017298,
        "id": "g3ofxe0",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1599046098.0
    },
    {
        "author": "NimbusFlyHigh",
        "body": "&gt;now I say $150!!!!!\n\nI just downvoted you, do it again please.\n\nedit: yo stop upvoting them",
        "created_utc": 1598993378,
        "id": "g3n25yx",
        "score": 20,
        "subreddit": "SPACs",
        "created": 1599022178.0
    },
    {
        "author": "nosalute",
        "body": "# I BOUGHT THE DIP\n\n*narrator: it was not the dip*",
        "created_utc": 1599055729,
        "id": "g3pxonj",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1599084529.0
    },
    {
        "author": "dvdmovie1",
        "body": "\"Many people are making the case for a significant correction in markets right now.\"\n\nYes, and many have on here since the March low and many have on here for large stretches of the last 5 years and they've been *completely wrong*, or they've been apocalypse-level bearish at the exact wrong time (mid-March, December 2018) or people cheerlead for a market crash (see 2019 on here) and then when one actually happens, people acted in March like people were morons for buying. \n\nThere's a portion of this sub that has been negative for years and has complained when markets are going up (\"the market isn't doing what I think it should\" is something I've read on here a lot in the last 2 years and really, the market doesn't care what you think it should do; invest in the market that's in front of you, not the market you think it should be), seems *certain* that it is going much lower at bottoms (March, December 18) and then is frustrated and upset when the rebound happens and complains all the way up again (\"The Circle of r/investing Bearishness.\")\n\nThere will be a correction. When will it be? I have no idea and nobody on here has a crystal ball. It might be tomorrow, it might be a 10% correction after the market has already gone another 5% higher.  A 10% correction used to be considered normal and healthy. Now it's like \"DEFCON-1\" or something. \n\nHonestly, understand your risk tolerance and the risk in your portfolio, don't invest more than you're comfortable with, don't get complacent, take *some* profit into strength at times and patiently wait to redeploy. Have a *long-term* plan and stick to it. Don't try and avoid every bit of potential turbulence, don't just sell everything every time there *might* be volatility (periods like March are times when there's great opportunities, they're not something to be completely avoided; if you avoid situations that cause market volatility and only get back in when everything is a-okay again, you're actively choosing to avoid opportunities) and honestly, \"selling everything\" is something that someone should do very, very rarely if ever but it seems to be a more and more common thing on here.\n\nI've posted this what feels hundreds of times on here: \"“Far more money has been lost by investors preparing for corrections, or trying to anticipate corrections, than has been lost in corrections themselves.” - Peter Lynch. It's really, *really* true and this sub over the last 5 years has often been a fantastic example of it.",
        "created_utc": 1598995073,
        "id": "g3n6cy3",
        "score": 19,
        "subreddit": "investing",
        "created": 1599023873.0
    },
    {
        "author": "DrKolagani",
        "body": "“Hey son are you investing in stocks now? Let me show you something”\n\nMy dad called me over to his laptop and opened his fidelity. This dude has 960k and needs +4% from the market to become a stock millionaire.\n\n18 years and he never told me he was this rich smh, guess that’s why he was so smug\n\nHe also right then and there liquidated 2k worth of  garbage and put it into tech because I said so\n\n\nEdit: He has about 650k of leveraged tech ETFs so just do that and it should work out alright",
        "created_utc": 1599010637,
        "id": "g3o45da",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1599039437.0
    },
    {
        "author": "orbitbrasil",
        "body": "Hey man. Jumping right into a $4k Tesla OTM call is sort of baptism by fire. If you're willing to lose all of that, then stick with it. Obviously, you can gain quite a bit from it as well. I know you're already locked in to that...but I would highly suggest playing around with \\~$300 or so to get a feel of how options work before diving head first into a large position (as you have.) Find a ticker that has options with low premiums (WORK is a good one, for example) and test the waters there. From there, you'll learn about how all of this works -- what constitutes as high IV, the effect of theta, etc. Once you get a good (if even possible) grasp on all of this...then you are ready to go. That being said, that Tesla call could very well make you a lot of money. It could also very well lose you a lot of money. Godspeed young one.",
        "created_utc": 1599017500,
        "id": "g3og97r",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1599046300.0
    },
    {
        "author": "always_a_tinker",
        "body": "Duuuuude. You sold two of these contracts, right? What are they selling for now. Sell a third and you'll figure it out.\n\nEdit:\nReally, you are talking about the return on a spread but you show the stats on half of it. Take your time to figure out what you are doing and how to know where you are. You'll be better for it",
        "created_utc": 1599007610,
        "id": "g3nxw1c",
        "score": 19,
        "subreddit": "RobinHood",
        "created": 1599036410.0
    },
    {
        "author": "Deddd3",
        "body": "https://www.reddit.com/r/wallstreetbets/comments/ikek5e/i_am_known_as_the_market_crasher_and_i_will_buy/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\n\nLmfao this guy really did it. Wow",
        "created_utc": 1599062167,
        "id": "g3qdaf6",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1599090967.0
    },
    {
        "author": "imagine-grace",
        "body": "Yes I noticed this too.\n\nI just chuck it up to Federal reserve stimulus meeting a millennial generation bigger than the baby boom generation starting to invest.\n\nI don't really like it because it doesn't feel safe.  \n\nBut I am in it and it's working and it reminds me of an important maxim... The trend is your friend.",
        "created_utc": 1599026418,
        "id": "g3osjee",
        "score": 19,
        "subreddit": "investing",
        "created": 1599055218.0
    },
    {
        "author": "Herbertonic",
        "body": "Best advice on here, especially since you're just doing this as a one time round of fundraising, you could easily track down a brick, step on it/cut it, and slang it 24/7 for a week easily hitting your target",
        "created_utc": 1599013510,
        "id": "g3o9cnh",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1599042310.0
    },
    {
        "author": "patsy1995",
        "body": "How the fuck do people buy into the corporate lifestyle so easily? Been at it 3 years and this shit blows",
        "created_utc": 1599015078,
        "id": "g3oc3mc",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1599043878.0
    },
    {
        "author": "deGoblin",
        "body": "It's not just about monopoly, there's a huge overlap in development and infestructure. For example, Facebook develops cybersecurity that is relevant to both FB and Insta. If those split then each will need to develop it individually.",
        "created_utc": 1599028346,
        "id": "g3ouo2z",
        "score": 18,
        "subreddit": "investing",
        "created": 1599057146.0
    },
    {
        "author": "luponicdistortion",
        "body": "I think it would be pretty gangster if Bezos announced a 4 to 1 reverse split \n\n\"I believe my peers may be trying to take advantage of retail investors. At amazon, we try to deliver value to the consumer, not extract value from them. It is with this mindset that you now must be...this tall to ride this ride\"",
        "created_utc": 1598957323,
        "id": "g3kmqcx",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1598986123.0
    },
    {
        "author": "Hubers57",
        "body": "Looks like retard runs in the family if your dad was willing to drop like 60k based on you telling him these dudes make rockets or something and my internet friends really like it",
        "created_utc": 1599014872,
        "id": "g3obqoo",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1599043672.0
    },
    {
        "author": "EchoooEchooEcho",
        "body": "I remember Elon said that it doesn't make sense for Tesla to raise more money because they will be cashflow positive very soon. In the last 12 months, Tesla raised money twice lmao.",
        "created_utc": 1599017950,
        "id": "g3ogzkr",
        "score": 18,
        "subreddit": "stocks",
        "created": 1599046750.0
    },
    {
        "author": "t33po",
        "body": "When this bubble finally pops, the shock is gonna make for years of a boring ass market. People are gonna be celebrating 2% moves and fundamentals will actually matter....For about 9.5 years and we'll do it all over again.",
        "created_utc": 1599027402,
        "id": "g3otmyv",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1599056202.0
    },
    {
        "author": "brutalpancake",
        "body": "Jesus the strikes people come up with on here. I’m looking at the 570s like ‘that’s super aggressive and the premium isn’t worth it’ but then I see shit here it’s like people just flick to the bottom of the chain and buy whatever is at the end.",
        "created_utc": 1598992110,
        "id": "g3myp79",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1599020910.0
    },
    {
        "author": "BLACKdrew",
        "body": "When i sell and it instantly fills it’s always like WAIT NO I CHANGE MY MIND",
        "created_utc": 1598986188,
        "id": "g3miq9n",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1599014988.0
    },
    {
        "author": "Pizza_Bagel_",
        "body": "Right but you made the very bad move of predicting when it will fall, at least implicitly by saying buyers now will definitely lose their shirt. You don’t know that. Especially if you’re buying calls.",
        "created_utc": 1598996432,
        "id": "g3n9fws",
        "score": 18,
        "subreddit": "stocks",
        "created": 1599025232.0
    },
    {
        "author": "RootNPC",
        "body": "Bears don’t realize the rug they’re trying to pull is from Aladdin, it can fly",
        "created_utc": 1599070436,
        "id": "g3qyhmg",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1599099236.0
    },
    {
        "author": "DrunknHamster",
        "body": "Boys I did it! I unlocked the color green on my all time chart on Robinhood today! 3K to $600 and then all the way back to 3.1K today!",
        "created_utc": 1599032758,
        "id": "g3ozrng",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1599061558.0
    },
    {
        "author": "noentic",
        "body": "Daily Market and Options Summary for Sept 1st, 2020\n\nDaily Synopsis\n\n* The S&amp;P 500 (+0.8%) and Nasdaq Composite (+1.4%) rallied to fresh record highs on Tuesday, with the Nasdaq getting an added boost from the momentum in the mega-caps and growth stocks. The wealth spread around to the Russell 2000 (+1.1%) and Dow Jones Industrial Average (+0.8%), too.\n* Today's key moves were Apple (AAPL 134.18, +5.14, +4.0%) rising 4% after JPMorgan raised its price target on the stock to $150 from $115, and Zoom Video (ZM 457.69, +132.59, +40.8%) surging 40% after it crushed Q2 earnings expectations.\n* Apple was a major factor in today's index gains given its 7.3% weight in the S&amp;P 500, while Zoom provided the fuel for other growth stocks like Netflix (NFLX 556.55, +26.99, +5.1%) and DocuSign (DOCU 268.80, +45.80, +20.5%). Another supporting factor was the ISM Manufacturing Index for August increasing to 56.0% (consensus 54.5%) from 54.2% in July.\n* The manufacturing data helped lift the S&amp;P 500 materials (+2.8%) and industrials (+1.0%) sectors into positive territory with the information technology (+1.9%), communication services (+1.0%), and consumer discretionary (+1.1%) sectors. Each advanced at least 1.0%.\n* Conversely, the utilities (-1.1%), health care (-1.0%), and energy (-0.9%) sectors underperformed and declined around 1.0%.\n* Recapping some other mega-cap moves, Walmart (WMT 147.59, +8.74, +6.3%) climbed 6% after officially introducing its Walmart+ membership program. Tesla (TSLA 475.05, -23.27, -4.7%), however, was a notable holdout after the company disclosed plans to sell up to $5 billion in stock.\n* U.S. Treasuries ended the day higher after reclaiming overnight losses. The 2-yr yield declined two basis points to 0.11%, and the 10-yr yield declined two basis points to 0.67%. The U.S. Dollar Index increased 0.2% to 92.34 after being down 0.4% in the morning. WTI crude futures increased 0.3%, or $0.14, to $42.76/bbl.\n* Looking ahead, investors will receive the ADP Employment Change Report for August, the Fed's Beige Book, Factory Orders for July, and the weekly MBA Mortgage Applications Index, and auto and truck sales for August on Wednesday.\n\nIndex Summary\n\n**S&amp;P 500 :** (+0.94%);  **NasDaq :** (+1.72%);  \n**Russell 2000 :**(+1.15%);  **Dow :**(+0.88%);  \n\\*\\*Vix :\\*\\*26.12 -0.29 (-1.1%)\n\nSector Summary -\n\n(1-day %), \\[5-day %\\], {10-day %}\n\n***Currency -***  \n\\*\\*USD Index :\\*\\*92.131 (-0.31%); \\[-1.24%\\]; {-1.5%}; \\*\\*BC :\\*\\*11835 (+1.77%); \\[+4.92%\\]; {+2.99%}\n\n***Precious Metals -***  \n\\*\\*Gold :\\*\\*1978.6 (+0.94%); \\[+2.91%\\]; {+3.23%} ; \\*\\*Silver :\\*\\*28.594 (+1.91%); \\[+6.23%\\]; {+9.1%}\n\n***Farming -***  \n\\*\\*Soybeans :\\*\\*953.5(-0.29%); \\[+1.44%\\]; {+5.55%}; \\*\\*Corn :\\*\\*357.75(-1.12%); \\[-1.12%\\]; {+3.74%};  \n\\*\\*Coffee :\\*\\*129.05(+2.36%); \\[+7.44%\\]; {+9.99%}\n\n***Industrials -***  \n\\*\\*Crude :\\*\\*42.61 (+1.17%); \\[-0.65%\\]; {+1.82%}; \\*\\*Nat Gas :\\*\\*2.63 (-1.03%); \\[+5.77%\\]; {+6.33%}  \n\\*\\*Copper :\\*\\*3.0615 (+0.18%); \\[+3.63%\\]; {+5.27%}\n\nOptions Fast Facts\n\n***CBOE Put/Call Ratio - 0.45***  \n***Highest Multiple Over Daily Average -*** GOGO with 4263x the ADV of 72004. There were 13976 calls and 58028 puts.  \n\\*\\*\\*Ticker with Most Contracts -\\*\\*\\*AAPL with 2988454 contracts traded today with an AVD of 1294635. There were 2147094 calls and 841360 puts.  \n***Largest Put / Call Ratio -*** TRGP with a 0.04898054839465667 P/C ratio. There were 17068puts and 836 calls.  \n***Largest Call / Put Ratio -*** STM with a98.36254295532646 C/P ratio. There were 57247 calls and 582 puts.\n\n\\*Stocks must be &gt;$6, Highest Multiple must have &gt;1k ADV, Largest ratios must have an option volume &gt;10k",
        "created_utc": 1598994944,
        "id": "g3n625j",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1599023744.0
    },
    {
        "author": "Shtonky",
        "body": "And you would be correct. That’s totally a thing. 8am - 11am PST is ‘algo’ time as my trading room calls it.",
        "created_utc": 1598997883,
        "id": "g3ncgqr",
        "score": 17,
        "subreddit": "RobinHood",
        "created": 1599026683.0
    },
    {
        "author": "Centralredditfan",
        "body": "Is it hacking though, or is it just the teachers not properly password protecting and limiting participants to a whitelist? \n\nI'm talking about real hacking/security issues + the scare of Zoom being a Chinese company.",
        "created_utc": 1598999473,
        "id": "g3nfyv4",
        "score": 17,
        "subreddit": "stocks",
        "created": 1599028273.0
    },
    {
        "author": "brutalpancake",
        "body": "Just keep posting every 50 points. You’ll nail it eventually #bearlogic",
        "created_utc": 1599008579,
        "id": "g3o02g5",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1599037379.0
    },
    {
        "author": "BenjaminWobbles",
        "body": "How much money would it take for you to actually retire, quit work and options, get in something safe and ride it out for the rest of your life? I'm at like 8 million for a basic bitch suburban lifestyle. McMansion, UGG boots, C class Mercedes, daily injections of pumpkin spice latte and an hour a day of yoga. A mother fucker could really settle in for 8 million.",
        "created_utc": 1599008171,
        "id": "g3nz5bp",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1599036971.0
    }
]