[
    {
        "author": "ReyesA1991",
        "body": "Not just NET. Fastly, Fortinet, Limelight, Sea Limited, Shopify, Square all taking dumps too.",
        "created_utc": 1594668020,
        "id": "fxyjqti",
        "score": 9,
        "subreddit": "stocks",
        "created": 1594696820.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Thanks for your feedback. Regarding Fortinet. I think they just announced that they will be offering secure SD-WAN solution for multi-cloud. Plus it’s the only company from the stocks I mentioned that is consistently making money every quarter and beating earnings expectations. Last quarter they reported $1.4 billion in liquidity and nominal leverage. Looks like they are financially capable to expand through M&amp;A activities. Let me know if I’m missing anything.",
        "created_utc": 1595121906,
        "id": "fyin640",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1595150706.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Yea, I am leaning towards Fortinet. Strong liquidity, low leverage, good leadership, been around for quite some time, recognized by other larger companies. I think I will end up investing in it.",
        "created_utc": 1595111749,
        "id": "fyi6mmd",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1595140549.0
    },
    {
        "author": "LSatou",
        "body": "CIBR and HACK are good ETFs.\n\nNET, PANW, FTNT, CRWD are a few of my favorite individuals",
        "created_utc": 1595415023,
        "id": "fyuzhv6",
        "score": 3,
        "subreddit": "stocks",
        "created": 1595443823.0
    },
    {
        "author": "Sixers0321",
        "body": "Isnt NET more of a CDN? \n\nI think FTNT is the most reasonably priced cloud security right now.",
        "created_utc": 1595277507,
        "id": "fyp2h9f",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595306307.0
    },
    {
        "author": "lucidvein",
        "body": "Not too shabby OP.  I have all of those except Coca Cola, Pepsi, and McDonalds since most of their stuff is based on unhealthy products even w/ their market penetration I'm not convinced society is heading in that direction.\n\nI can post my top 20 holdings for you.  I've been lucky enough to typically beat the S&amp;P.  40% of my portfolio are in mutual funds but my individual picks are:\n\n1. Amazon: 6.6% - #1 Ecommerce subscription \\[moat\\], hardware, twitch, ecosystem\n2. Johnson and Johnson: 6% - #1 Pharma giant\n3. Next Era Energy: 5.8% - Moated energy utility in SE USA, going 20% solar too soon\n4. Google: 5.0% - #1 Search engine, Data monster, Youtube, Invests in SpaceX etc.\n5. Gold: 5% - Hedge\n6. Intel: 4.6% - Chipset King.  Might dip w/ AMD on rise.\n7. Cadence Design: 4% - Electronic Design Automation\n8. Apple: 3.7% - World class phone maker, ecosystem, cult following w/ services\n9. Microsoft: 3.4% - Azure, Office Suite, Windows, Solid\n10. Lockheed Martin: 3.4% - Defense spending won't be going away. Industry leader.\n11. Illumina: 3% - Genetic Analysis, human health advancement\n12. Wheaton Precious Metals: 2.8% - Favorite precious metals miner\n13. United Health Group: 2.8% - Industry leader in Health Insurance\n14. Waste Management: 2.6% - Garbage isn't going to go away anytime soon\n15. Market Axcess: 2.5% -  Electronic trading platform for bonds/fixed income\n16. Disney: 2.3% - Media &amp; entertainment giant\n17. Nvidia 1.8% - #1 video card company, gaming, business visualization, solid AI r&amp;d\n18. Raytheon: 1.5% - More Defense\n19. Visa: 1.4% - Fintech &amp; market penetration\n20. Adobe: 1.4% - Subscription service for top graphic suite\n21. Crispr: 1.1% - Genetic Editing R&amp;D and interesting possibilities\n\nSome other stocks I own and don't mind recommending are HD, LULU, BLK, SPCE (can't fight the memes), Alibaba, Tencent, Qdel, Fortinet, Berkshire, Paypal, Texas Instruments, Qcom, some beat down covid stocks like RCL &amp; Boeing.",
        "created_utc": 1595027757,
        "id": "fyetcay",
        "score": 2,
        "subreddit": "investing",
        "created": 1595056557.0
    },
    {
        "author": "NocNocNoc19",
        "body": "Im not sure how much money you have to start with. Vanguard index funds have been my overall best investment. Voo, VTI, VT. if you dont have enough to buy whole shares of those robin hood offers fractional shares but I have never gone that route so I honestly don't know how good of a thing they are. Other then that do a lot of research. Read a lot. Dont buy and think your going to sell again any time soon. Ive only been actually investing for about 2 years. In that time I have only sold 1 position because I no longer liked the investment long term. Everything else i have bought with the intent to hold for 10+ years baring something extremely unforeseen. I buy a lot of blue chips and companies im somewhat familiar with as well. I work in tech so I own cisco, palo alto, fortinet, netapp because I work with there products a lot. But i probably only own about 30 individual companies and over 50% of my portfolio is in those index funds i mentioned earlier. Is this winning advice, I have no idea but its been working for me.",
        "created_utc": 1594219150,
        "id": "fxbeshq",
        "score": 1,
        "subreddit": "investing_discussion",
        "created": 1594247950.0
    },
    {
        "author": "buildapchelper",
        "body": "Fortinet",
        "created_utc": 1593589564,
        "id": "fwka6z9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593618364.0
    },
    {
        "author": "MrGiggles668",
        "body": "FTNT CANNOT stop getting humped, holy hell",
        "created_utc": 1594993736,
        "id": "fycxibb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595022536.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Thanks for a detailed response. I agree with you. Plus it was recognized as winner of Microsoft’s 2020 Commercial Maketplace Partner. Doesn’t hurt to get a recognition from such a great company as Microsoft. So many people say that Palo Alto is the leader in this particular area (firewall) but I think Fortinet is very underestimated.",
        "created_utc": 1595111378,
        "id": "fyi5z1o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595140178.0
    },
    {
        "author": "joe_garbagio98",
        "body": "You should also be aware that fortinet is the discount (Toyota) vendor in the infosec space. Palo Alto is the Ferrari. Not many people can afford a Ferrari, but lots of Toyotas get purchased. In a cost conscious environment, I would bet on fortinet.",
        "created_utc": 1595114044,
        "id": "fyiamky",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595142844.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Yea, keep hearing great things about Okta. Jim Cramer keeps talking about Crowd Strike. Fortinet has the strongest balance sheet. Palo Alto is growing very aggressive. Decisions decisions",
        "created_utc": 1593808681,
        "id": "fwu8jhp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593837481.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "What about Fortinet? I am shocked that people overlook how strong thing company is from liquidity and leverage standpoint.",
        "created_utc": 1593828914,
        "id": "fwv65eg",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593857714.0
    },
    {
        "author": "BenjyExpert",
        "body": "Yeah, kinda a bit of both to be honest. Its an Authentication API but our business with 80k employees use it to work from home. Some real big name clients which just gets bigger every year.\nFortinet would be worth a look too.",
        "created_utc": 1594133245,
        "id": "fx7js5q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594162045.0
    },
    {
        "author": "lupi5",
        "body": "I’m 24. Started 2 years ago and made a new strategy for myself, started this buying around June and have added a couple. \n\nROKU - 105 (~20%). Sell 240\n\nAPPS - 4.94 (~20%). Sell 15-20. Rebuy, sell 30\n\nLHX - buy 155 (big buy). Sell 255\n\nAMD - 48. Sell 85\n\nBOOT - 23. Sell even/25\n\nDIN - 40. Sell 60\n\nAAMC - 15.50. Sell 30-60\n\nDMRC - 17.30 (stop 14). Sell 50-60+\n\nFTNT - 141. Sell 160\n\nJPM - 93. Sell 103. Rebuy, hold\n\nPAYS - 9.12. Sell 18\n\nPD - 30 (will add). Sell 42\n\nRL - 73. Sell 95\n\nWTRH - 2.23. Sell 5-7\n\nYY - 83 (will add). Sell 150+\n\nBA - watching. Sell 700\n\nDIS - watching. Hold\n\nEdit: add in’s/stop, sells, and LHX",
        "created_utc": 1594614774,
        "id": "fxwe1da",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594643574.0
    },
    {
        "author": "ImagineThat710",
        "body": "$ftnt mooning, unusual option activity, and ironically  [https://www.fortinet.com/](https://www.fortinet.com/)  is down... anyone got news on this?",
        "created_utc": 1594227046,
        "id": "fxbv35i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594255846.0
    },
    {
        "author": "Rossoneri",
        "body": "He has a cyber security company but doesn't know what Fortinet does... please disregard his info.  How do you not know your industry &amp; competitors?",
        "created_utc": 1595126304,
        "id": "fyitzl3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595155104.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Oh, I see. That’s cool, makes sense why you don’t own any stocks in this industry. If you would have to choose only one stock from 5 I listed above, which company do you will outperform them all? I really like strong balance sheet, track record and longevity of Fortinet.",
        "created_utc": 1595109907,
        "id": "fyi3ewj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595138707.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Fortinet went from $40 in June of 2015 to $138 in June of 2020. I don’t think why it wouldn’t keep growing in the 5 years. Time will tell.",
        "created_utc": 1593816351,
        "id": "fwum5jv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593845151.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "I know but I think this pandemic changed companies’ outlook and the way they conduct business. More and more companies are transitioning to WFH and with constant growth of technology, security will always be extremely important. I am leaning toward Fortinet 🤔",
        "created_utc": 1593813225,
        "id": "fwugndy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593842025.0
    },
    {
        "author": "shacoand2boxes",
        "body": "Akamai Technologies stock is trading higher Thursday after Cowen analyst Colby Synesael raised his rating on the content-delivery network company to Outperform from Market Perform, while upping his target price to $150 from $107.\n\nSynesael is basically making the observation (which I made in an April Tech Trader column) that Akamai shares (ticker: AKAM) have not participated in the huge rally in internet infrastructure plays amid the Covid-19 pandemic. The analyst says there is now a \"meaningful disconnect\" between Akamai and other security and CDN stocks, despite its larger scale, higher profitability and \" still solid growth.\" He sees Akamai as an \"attractive way\" to play long-term trends like cloud security and edge computing.\n\nSynesael points out that the stock looks cheap relative to both security plays like Palo Alto Networks (PANW) and Fortinet (FTNT) and to other content- delivery networks, such as Cloudflare (NET), Fastly (FSLY), and Limelight Networks (LLNW). He argues that Covid-19 has served as a catalyst to Akamai's security and CDN businesses.\n\n\"We believe Covid-19 has resulted in increased demand for both its enterprise and internet security product offerings given the increase in the number of attacks across organizations and the internet,\" Synesael writes. \"We believe Akamai's security business is an underappreciated component of its long- term growth opportunity and that as it becomes a larger portion of total revenue more investors are likely to start valuing it on its [sum of the parts] which we believe will result in a significant re-rating of the stock.\"\n\nThe analyst notes that there have been investor concerns about the company losing market share to peers like Fastly, but asserts that \"the growth of competitors is more a function of an expanding opportunity for CDN providers rather than share stealing from Akamai.\"\n\nAkamai shares were up 7%, at $113.78, in recent trading, while the S&amp;P 500 was up 0.9%. The stock is up about 32% year to date, which is impressive growth -- except when compared with Cloudflare, which has more than doubled, and Fastly, which has more than quadrupled",
        "created_utc": 1594008784,
        "id": "fx2g6sr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594037584.0
    },
    {
        "author": "FrangosV",
        "body": "exactly my friend, FTNT is a very solid company not inflated as others in the software/tech sector nowadays run by people that are knowledgable and trust-worthy.Very healthy balance sheet and already profitalbe with consecutive years on positive free cash flow and quite top margins compared to the competitors...",
        "created_utc": 1593942350,
        "id": "fwzhch6",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593971150.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Agree as typically the case with all the new companies associated with all the buzz words you mentioned above (cloud, SaaS, machine learning, etc.). To switch the topic slightly. Any idea why cyber security stocks (Fortinet, Palo Alto, CrowdStrike, etc) are down close to 15-20%)? Profit taking?",
        "created_utc": 1594948288,
        "id": "fybbnyu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594977088.0
    },
    {
        "author": "nedylan",
        "body": "This reminds me of fortinet taking off because old people thought they were buying stocks in Fortnite",
        "created_utc": 1595012087,
        "id": "fydyr7p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595040887.0
    },
    {
        "author": "FiaRua_",
        "body": "honestly i expect it to hit $75 by next friday. i probably should have sold already but i've sold too early too often and missed out on 1000% gainers (FTNT, LVGO, AMZN)",
        "created_utc": 1594594585,
        "id": "fxvi2s7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594623385.0
    },
    {
        "author": "Mana_nas",
        "body": "Man I can keeping on going on this one\n\nTsla 230 sold at 260\nFb 200 sold at 210\nApple 300 sold at 298\nFortinet 76 sold at 90\nKinaxis 105 sold at 114\n\nAnd fucking bag holding Disney right now at 140",
        "created_utc": 1594523528,
        "id": "fxsjl5q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594552328.0
    },
    {
        "author": "neti4",
        "body": "Yeah cloudflare is not a security product really. It's a CDN and it offers some server security but not anywhere to the same degree as fortinet, or other vendors.",
        "created_utc": 1595300163,
        "id": "fyq87f4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595328963.0
    },
    {
        "author": "Sixers0321",
        "body": "I personally wont buy anything with a &gt;25price to sales. So I'd wait til it comes down to that level. I never really looked into FTNT, I actually like it a lot off of just 10 mins research. I'm gonna have to do a deeper dive but it actually looks reasonably priced.",
        "created_utc": 1595123271,
        "id": "fyip9ug",
        "score": 0,
        "subreddit": "StockMarket",
        "created": 1595152071.0
    },
    {
        "author": "Steelhwk",
        "body": "What’s up with fortinet guys? Are you memeing this thing?",
        "created_utc": 1594227726,
        "id": "fxbwjkx",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1594256526.0
    },
    {
        "author": "ZeroBullshitMan",
        "body": "Mine, I literally own one.\n\nWorking out pretty well so far.\n\nPalo Alto just got smashed with a pretty big 0-day, so they'll be undervalued right now.\n\nCrowsStrike is also a good option, if not for the recent Twitter hacks. EDR will be pretty big going forward.\n\nOkta/Zscaler for the same reason.\n\nFortinet I can never figure out what they do.\n\nI've not really seen anything that's wowed me and is publicly available.\n\nIf you list some more I'd be happy to share my opinion on the tech.",
        "created_utc": 1595109349,
        "id": "fyi2g6c",
        "score": -4,
        "subreddit": "stocks",
        "created": 1595138149.0
    },
    {
        "author": "Old_Feed_2654",
        "body": "How would this look?\nMRNA, ZYXI, AZN, FTNT",
        "created_utc": 1595427849,
        "id": "fyvhvij",
        "score": -7,
        "subreddit": "stocks",
        "created": 1595456649.0
    },
    {
        "author": "BongRips4Jezus",
        "body": "My hands are going to be tested these next few days. Most of my positions are calls for AAPL and MSFT in January. And GLW shares",
        "created_utc": 1594938460,
        "id": "fyaubwi",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594967260.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW: Glass manufacturer that is used in vials, phones, TVs, and other medical/commercial appliances. They have a contract to produce vials for Pfizer, and received a grant from the government to ensure that they will be able to produce enough vials for the future vaccine. Had their price target upgraded to $33 by Citigroup, currently oversold at $25.75\n\nDon’t know when this thing is gonna moon again, but I hope it’s soon. Probably needs to announce another biomed contract to turn more heads. White knuckling these calls hoping the market realizes its value soon",
        "created_utc": 1593635683,
        "id": "fwmf23z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593664483.0
    },
    {
        "author": "FormalFew",
        "body": "Last chance on cheap GLW $30 calls, don't say you weren't warned",
        "created_utc": 1594928968,
        "id": "fyaay6c",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594957768.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "True, hoping to catch lightening in a bottle with GLW again. Their PT was raised to 36 and they broke $28 resistance yesterday.",
        "created_utc": 1595015966,
        "id": "fye6mz9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595044766.0
    },
    {
        "author": "AstockcollapseNow",
        "body": "Anyone have a read on GLW, JNPR, CIEN, etc.; the \"fiber optics\" plays?  \n\n\nNext major stimulus should have a big broadband piece to it.",
        "created_utc": 1595018337,
        "id": "fyebbwf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595047137.0
    },
    {
        "author": "emtendo",
        "body": "Corning as well (GLW) make the glass bottles that all the vaccines will be stored in...\n\nEdit: got ticker symbol wrong",
        "created_utc": 1594799365,
        "id": "fy4gvhi",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594828165.0
    },
    {
        "author": "peter-doubt",
        "body": "First: congrats .. good ride!\n\nSecond: you beat me in... @70 vs me @140.\n\nThird: we agree .. this price is nuts!  \n\nPercentagewise, your timing has helped you outperform me.  By a long shot!  \n\nWhat to do next?  I'm looking at SMH.... Semiconductor ETF .. weighted to 5G build out. . oh, NVDA is part of it.\n\nAs for dividends.. not much unless you're taking risks with oils, but at 3%, I could suggest Corning (GLW).  Their market volume may be declining, but there's little comment about the volume they can supply to pharma packaging (think billions of doses in glass vials).\n\nAny other ideas?",
        "created_utc": 1594167043,
        "id": "fx9fy4k",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594195843.0
    },
    {
        "author": "oaklandChi84",
        "body": "My GLW and NOK calls are coming back to life. About damn time.",
        "created_utc": 1594315580,
        "id": "fxfxcce",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594344380.0
    },
    {
        "author": "FormalFew",
        "body": "For realises, this is your final reminder on the day that Corning Glass/$GLW is only going to profit from lockdowns. They're also heavy in the plexiglass/vinyl market",
        "created_utc": 1594755972,
        "id": "fy2ieuf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594784772.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW leaving oversold territory. About damn time",
        "created_utc": 1594047880,
        "id": "fx3s8pg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594076680.0
    },
    {
        "author": "cutiesarustimes2",
        "body": "Owens corning makes the best cotton candy imo.",
        "created_utc": 1594708056,
        "id": "fy0ghdv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594736856.0
    },
    {
        "author": "_Oboe_",
        "body": "Corning is a great play for shares. \n\nNo option volume. So, not a good WSB post.",
        "created_utc": 1594913011,
        "id": "fy9e018",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594941811.0
    },
    {
        "author": "BeginningOriginal0",
        "body": "Good luck, I’ve been long Corning for a few years and hopped on calls early this morning with the news. Awesome company with exposure to many different activities (5G, med devices, electronics). Also a great town to visit in upstate ny.",
        "created_utc": 1594909441,
        "id": "fy973l6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594938241.0
    },
    {
        "author": "LavenderAutist",
        "body": "First it was gorilla glass. And now this?\n\nGLW is never going anywhere.",
        "created_utc": 1594921841,
        "id": "fy9wdan",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594950641.0
    },
    {
        "author": "visionarymind",
        "body": "🔱🎩 cumpenny  ℹ️💲 GLW❔\n\n👁 will wait \n\n⏳",
        "created_utc": 1594939384,
        "id": "fyaw0wa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594968184.0
    },
    {
        "author": "999rwh",
        "body": "GLW- Glass Vials",
        "created_utc": 1594784589,
        "id": "fy3ym2h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594813389.0
    },
    {
        "author": "FormalFew",
        "body": "Last chance to get in on GLW, you've been warned",
        "created_utc": 1594753605,
        "id": "fy2dg2x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594782405.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Well over $10,000. Instead I’m still down 2,000. The most I fucked up on was selling my GLW 24c when it was trading at 23. Had already quintupled my money and got out. Then over the next week it shot up to $28. Could’ve turned $150 into $6,000.",
        "created_utc": 1594747220,
        "id": "fy1zw31",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594776020.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "C’mon GLW, break $28, start the new uptrend!",
        "created_utc": 1594835288,
        "id": "fy5zl4x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594864088.0
    },
    {
        "author": "FormalFew",
        "body": "GLW 28/28.5c 7/31",
        "created_utc": 1594837663,
        "id": "fy64ny1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594866463.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Hey I missed an opportunity to turn $150 into $12,000 on GLW calls. Made a profit of $600 and thought I was being smart. Then it mooned, and I just watched in disbelief.",
        "created_utc": 1593798609,
        "id": "fwtpvsm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593827409.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Called that GLW breakout yesterday. $35 here we come",
        "created_utc": 1594909475,
        "id": "fy975uo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594938275.0
    },
    {
        "author": "StrictDefinition4",
        "body": "If we need 8 billion vials I think glass companies will profit like crazy GLW has the biggest contract I believe and they got a 200$ million contract from the government to expand.",
        "created_utc": 1594922468,
        "id": "fy9xog5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594951268.0
    },
    {
        "author": "everybodzzz",
        "body": "&gt; GLW\n\npriced in - if you're hearing about a DoD contract now, every contractor's mistress in DC knew about it a month ago.",
        "created_utc": 1594916708,
        "id": "fy9lksc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594945508.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Get in on this GLW uptrend. Cheap options and this stock likes to rise for a week or two despite overall market movement when it breaks out of resistance",
        "created_utc": 1594910241,
        "id": "fy98l7r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594939041.0
    },
    {
        "author": "ShirleyDirty",
        "body": "Ppg and corning",
        "created_utc": 1594335022,
        "id": "fxh1rip",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594363822.0
    },
    {
        "author": "_Oboe_",
        "body": "Corning is going to kill it, but absolutely no volume on calls.",
        "created_utc": 1594827053,
        "id": "fy5i6nm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594855853.0
    },
    {
        "author": "Es-Click",
        "body": "PGE, AZN, K12,Corning,NRZ,",
        "created_utc": 1594829570,
        "id": "fy5ndyd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594858370.0
    },
    {
        "author": "seancarr181",
        "body": "I have no idea what Corning is but I'll look into it lol. I'm assuming calls",
        "created_utc": 1595048983,
        "id": "fyfq3ma",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595077783.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW and AZN",
        "created_utc": 1595005443,
        "id": "fydkwdf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595034243.0
    },
    {
        "author": "math1024",
        "body": "The main difference between 5G and the previous roll outs is just a lot more fiber and small cell antennas. I think the best 5G plays would be fiber companies like GLW, COMM, and OCC.\n\nThere's also been [legislation](https://en.wikisource.org/wiki/Executive_Order_13858) promoting onshoring so you might want to focus on american manufacturers.",
        "created_utc": 1594988527,
        "id": "fycpcsq",
        "score": 1,
        "subreddit": "investing",
        "created": 1595017327.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW reported 5 new insider trades to the SEC yesterday.\n\n\n$19,709.90 of shares acquired by Henretta Deborah A (Director)\n\n\n$33,592.30 of shares acquired by Cummings Robert F Jr (Director)   \n\n\n$11,655.00 of shares acquired by Canning John A Jr  \n\n\n$24,864.00 of shares acquired by Burns Stephanie (Director)  \n\n$28,179.20 of shares acquired by Martin Kevin J (Director)",
        "created_utc": 1593799277,
        "id": "fwtr64r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593828077.0
    },
    {
        "author": "ValenTom",
        "body": "Initiated a position in Prudential Financial in my Roth IRA today. I was previously targeting Realty Income but the share price is just a tad higher than where I’d like to continue accumulating. As long as PRU stays around these levels I’ll continue accumulating 8-10 shares per month for the foreseeable future. \n\nBrings my Roth IRA to five total holdings as I develop a DGI portfolio there. \n\nAT&amp;T\n\nCVS\n\nCorning Glass\n\nRealty Income\n\nPrudential Financial",
        "created_utc": 1594050147,
        "id": "fx3wleb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594078947.0
    },
    {
        "author": "iamfar_",
        "body": "Schott, Corning and BD are all bigger players.\n\nPlus given the timelines of these vaccine projects I doubt pharma companies are going to spend the time to evaluate an alternate container closure system.",
        "created_utc": 1594791137,
        "id": "fy47qbb",
        "score": 1,
        "subreddit": "investing",
        "created": 1594819937.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW started its breakout. Could be a really good play for the next two weeks",
        "created_utc": 1594845334,
        "id": "fy6kuiy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594874134.0
    },
    {
        "author": "smungung",
        "body": "$103 calls on Corning!? What type of crack are you smoking?",
        "created_utc": 1594907980,
        "id": "fy94gxr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594936780.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW actually held stable today, could be the sign of the next leg up",
        "created_utc": 1593732795,
        "id": "fwr35wv",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1593761595.0
    }
]