[
    {
        "author": "timboSlice490",
        "body": "Literally every play I have went the opposite direction today. BABA &amp; SPY puts, DKNG/VTIQ/COTY/DIS calls. Not to mention my CRM/MRNA calls that we’re already in the shitter and keep going lower.\n\nIt’s astounding how bad my moves are",
        "created_utc": 1591120657,
        "id": "fsnpa69",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591149457.0
    },
    {
        "author": "MAXSPEED321",
        "body": "From Barrons. new Goldman price targets 6/24\n\n&amp;#x200B;\n\n* Adobe (ADBE), Neutral rated, to $460 from $350\n* Akamai Technologies (AKAM), Neutral rated, to $107 from $102\n* Alphabet, Buy rated, to $1,775 from $1,425\n* Anaplan (PLAN), Buy rated, to $57 from $51\n* Atlassian (TEAM), Buy rated, to $218 from $194\n* Autodesk (ADSK), Buy rated, to $265 from $228\n* Citrix Systems (CTXS), Buy rated, to $172 from $154\n* Cloudflare (NET), Neutral rated, to $39 from $27\n* CrowdStrike Holdings (CRWD), Neutral rated, to $107 from $87\n* DocuSign (DOCU), Neutral rated, to $175 from $100\n* Dropbox (DBX), Sell rated, to $22 from $19\n* Dynatrace (DT), Buy rated, to $55 from $51\n* Elastic (ESTC), Neutral rated, to $100 from $75\n* Facebook, Buy rated, to $265 from $250\n* [Microsoft](https://www.barrons.com/quote/stock/MSFT) (MSFT) Buy rated, to $215 from $198\n* MongoDB (MDB), Neutral rated, to $215 from $169\n* Okta (OKTA), Buy rated, to $230 from $173\n* Oracle (ORCL), Buy rated, to $61 from $58\n* Ping Identity Holding (PING), Neutral rated, to $35 from $22\n* RingCentral (RNG), Buy rated, to $320 from $275\n* Salesforce.com (CRM), Buy rated, to $220 from $204\n* Slack Technologies (WORK), Sell rated, to $31 from $30\n* SolarWinds (SWI), Sell rated, to $18 from $16\n* Twilio (TWLO), Neutral rated, to $225 from $137\n* VMware (VMW), Neutral rated, to $158 from $143\n* Workday (WDAY), Buy rated, to $210 from $181\n* Zoom Video Communications (ZM), Sell rated, to $187 from $154",
        "created_utc": 1593051081,
        "id": "fvwyzmj",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1593079881.0
    },
    {
        "author": "MustWarn0thers",
        "body": "CRM can go fuck its ass with a rusty rebar dildo. I lost so much fucking money on the piece of shit buying what appeared to be dips, with 2-3 week out strikes for some breathing room, with prices right near or ITM.\n\nNow of course it's this fucking week it climbs to 180.\n\nIf you made money on it, I hope you accidentally order 10 times as many dildos as you had in your online cart and waste it all.",
        "created_utc": 1591811677,
        "id": "ftluvvc",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1591840477.0
    },
    {
        "author": "smmartinez6",
        "body": "Always listen to your intuition. Closed out some CRM and BYND Calls the first hour of trading today. Pigs get fed, Hogs get slaughtered... next week starts a new slate. Let’s fucking go 🙌🙌",
        "created_utc": 1592617037,
        "id": "fved9y0",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1592645837.0
    },
    {
        "author": "Kaith8",
        "body": "I actually made back everything I lost since starting in late March thanks to CRM, FB, WORK, a little DKNG, KOS, and CRWD. Now that earnings season is winding down tho I have literally no idea what my next move will be. I don’t wanna yolo now that I’ve made it all back. Wanna see real gains. But no idea where to go that was as successful as these last 3-4 days. This sucks.",
        "created_utc": 1591043918,
        "id": "fskaipz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591072718.0
    },
    {
        "author": "10x_EBITDA",
        "body": "CRM is one of the only software stocks not at all time highs. And it’s arguably the best one with a reasonable valuation. Plus the CEO is a known pumper on CNBC",
        "created_utc": 1591715932,
        "id": "fthezn0",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591744732.0
    },
    {
        "author": "PauperGod",
        "body": "SUN $32.5 Call\n7/17 Exp · 20 Buys\n-$140.00\n\nWTI $3 Call\n7/17 Exp · 10 Buys\n+$200.00\n\nERX $25 Call\n7/17 Exp · 20 Buys\n+$1,000.00\n\nCVX $105 Call\n7/17 Exp · 3 Buys\n+$372.00\n\nET $10 Call\n7/17 Exp · 30 Buys\n+$450.00\n\nPBR $10 Call\n7/17 Exp · 5 Buys\n+$100.00\n\nWLL $1 Call\n7/17 Exp · 5 Buys\n+$185.00\n\nUCO $34 Call\n7/17 Exp · 4 Buys\n+$444.00\n\nUSO $32 Call\n7/17 Exp · 3 Buys\n+$153.00\n\nMRO $8 Call\n7/17 Exp · 20 Buys\n+$840.00\n\nCRM $195 Call\n7/17 Exp · 2 Buys\n-$32.00\n\nBP $31 Call\n7/17 Exp · 40 Buys\n+$1,000.00\n\nENB $37.5 Call\n7/17 Exp · 15 Buys\n-$30.00\n\nRDSA $40 Call\n7/17 Exp · 5 Buys\n+$365.00\n\nXOM $60 Call\n7/17 Exp · 20 Buys\n+$760.00\n\nBABA $255 Call\n7/17 Exp · 10 Buys\n-$730.00\n\nAQST $7.5 Call\n7/17 Exp · 5 Buys\n-$725.00\n\nStocks\n\nDKNG\n150 Shares\n+$45.00\n\nNRGU\n700 Shares\n+$1,151.01\n\nHow you guys think I'm looking going into this week?",
        "created_utc": 1591479282,
        "id": "ft6y4wv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591508082.0
    },
    {
        "author": "tyrilu",
        "body": "Calls\n\n- RTX\n- TSLA\n- NIO\n- INTU\n- CRM\n\n&amp;nbsp;\n\nPuts\n\n- CMCSA\n- T\n- F\n- GM\n- GE",
        "created_utc": 1591674847,
        "id": "ftfxu2c",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591703647.0
    },
    {
        "author": "theChad802",
        "body": "I've tried 3 times to post this in a new thread, but it never gets approved I guess. So here is the story I want to share with you all.\n\n-80% to +40% lifetime swapping from mostly bear to mostly bull recently.\n\n[https://imgur.com/a/Q3xvUK7](https://imgur.com/a/Q3xvUK7)\n\nI joined both WSB and Robinhood a little over 3 months ago during the  whole SPCE TO THE MOON!!! period and made some modest gains (that teeny  tiny bump at the start) and proceeded to baghold too long and sell for a  loss. Then after a series of bad plays (again, holding too long) and  mistimed puts,  I started pouring more and more money in to try to  recoup the losses but kept losing. What started as a deposit of my \\~$600  tax return to play around with became a $13k nightmare.\n\nAnyway,  eventually I went full bull at the bottom, and was able to recover it  all much quicker than I lost it. At peak, I was down -80% all time and  from yesterday to today alone, I went from -38% to +40%. I'll be cashing  out my initial investment + a bit extra so it's all play money from  here.\n\nPositions that won big:\n\nRTX, SPY, FB, ACB, DKNG, NAT **calls**\n\nPositions that lost big:\n\nUSO, NAT, AL, CHGG **calls**\n\nSNAP, AAPL, GILD, CHGG, CRM, SPY **puts**\n\nWhat I learned:\n\n\\- Don't chase dips you aren't VERY confident about\n\n\\- Usually but not always inverse WSB\n\n\\- Don't bet against America",
        "created_utc": 1591408503,
        "id": "ft1jzhy",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591437303.0
    },
    {
        "author": "michaelchao3000",
        "body": "There are different kinds of cloud companies that operate at different levels of the cloud: infrastructure-as-service, platform-as-a-service, software-as-a-service, data centers, companies that manufacture the server components, consultant companies that build and maintain cloud systems for their clients. \n\nMake sure you understand what category each cloud company falls under. Some examples are..\n\nInfrastructure-as-a-service - AMZN, FSLY, MDB\nPlatform-as-a-service - MSFT, DDOG, SPLK, ZS\nSoftware-as-service - CRM, PLAN, AVLR, SPOT\n\nAs always, do your own research and reach your own convictions about why you would buy and hold these companies long-term through any short-term volatility. The money will be made on holding them as they scale and grow over years and even decades, not trading in and out each day. Best wishes to you on your investing journey!",
        "created_utc": 1593206705,
        "id": "fw3rwur",
        "score": 4,
        "subreddit": "stocks",
        "created": 1593235505.0
    },
    {
        "author": "uveski",
        "body": "Get woke go broke - top woke brands to short\n\nTwitter (disclosure - already shorted Twitter 3 times, made money twice and lost once)\n\nSalesForce\n\nBen and Jerry’s \n\nStarBucks\n\nNike\n\nLululemon\n\nPatagonia\n\nZappos \n\nMark’s and Spencer\n\nLacoste \n\nAnything to do with the NBA",
        "created_utc": 1593541865,
        "id": "fwi2558",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1593570665.0
    },
    {
        "author": "831sweatyfeet",
        "body": "Subscription based cloud storage and body cam. It is now a tech company with value added in the subscription based model. They will never need to show a profit and eventually they will be seen as having the first movers advantage in a space with ***unlimited upside*** using advanced facial recognition Ai, block chain, the cloud, Saas, and more. Users will take comfort in knowing they can pay using cryptocurrency. They even have a white paper.\n\nAnalysts everywhere agree this has the potential to be the next salesforce in the making, combined with the ease of use of Shopify, and the loyalty of Apple customers.  Literally can’t go tits up.",
        "created_utc": 1591687286,
        "id": "ftgde7t",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591716086.0
    },
    {
        "author": "Plumpeo",
        "body": "crm ipo uppp",
        "created_utc": 1591717897,
        "id": "fthizkt",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591746697.0
    },
    {
        "author": "phoovoo",
        "body": "CRM is like the most boring stock",
        "created_utc": 1591114536,
        "id": "fsnce8b",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591143336.0
    },
    {
        "author": "2dum2FUNction",
        "body": "Poots on Salesforce. Trash product, trash company.",
        "created_utc": 1592952735,
        "id": "fvskpum",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1592981535.0
    },
    {
        "author": "Trappedintheshower",
        "body": "Corporations are greedy. Also, they are pushing the game as a service model very hard. Look at Xbox game pass. The goal is so that you never actually own your games and just pay a service fee every month. They want they same kind of revenue and stability all the enterprise SaaS companies get, think ADBE and CRM. Their revenue is so predictable and shows steady growth as long as they get new subscriptions.",
        "created_utc": 1591910898,
        "id": "ftqm03m",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591939698.0
    },
    {
        "author": "3min33sec",
        "body": "CRM really is a dog. FUQ",
        "created_utc": 1591221716,
        "id": "fssm95w",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591250516.0
    },
    {
        "author": "WhereAreMyPants44",
        "body": "So tempting to get out of a lot of my positions. \n\n- Up 250% on AMD\n- Up 100% on APPL\n- Up 70% on SPLK\n- Up 60% on CRM\n- Up 50% on NVDA\n- Up 30% on FB\n\n\nI think all of these stocks are long term winners but they are at or very close to all times highs. This is frustrating",
        "created_utc": 1591798662,
        "id": "ftl5wto",
        "score": 3,
        "subreddit": "stocks",
        "created": 1591827462.0
    },
    {
        "author": "lincoln929",
        "body": "What do you guys think of CRM?",
        "created_utc": 1591762306,
        "id": "ftjw3tu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591791106.0
    },
    {
        "author": "Japples123",
        "body": "CRM and FB calls seemed like a good idea. Ffs. RIP next week",
        "created_utc": 1592611861,
        "id": "fve4rwk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1592640661.0
    },
    {
        "author": "firestormdude",
        "body": "You should buy some. If it drops, then buy more. I think this stock will be a $7,000 stock someday and will hit $1200 in the next 12 months and possibly even by the end of the year.\n\nIt’s vulnerable to more volatility short term but if you’re playing the long game, it’s hard to go wrong.\n\nBuy some and keep some cash available in case you get a good deal. Shopify is a runaway winner for small business owners. I’ve been a web developer for the last decade and the competition is decent but not great. Shopify is the clear de facto solution just like Salesforce, Adobe, etc.",
        "created_utc": 1592943746,
        "id": "fvs2uuo",
        "score": 3,
        "subreddit": "investing",
        "created": 1592972546.0
    },
    {
        "author": "maveryc",
        "body": "Tableau is owned by Salesforce, so you can invest indirectly.",
        "created_utc": 1593106926,
        "id": "fvz46io",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593135726.0
    },
    {
        "author": "motomike1",
        "body": "I really had nothing but problems out of salesforce as an end user and as such refuse to invest or gamble on it.",
        "created_utc": 1593118322,
        "id": "fvzs1vo",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593147122.0
    },
    {
        "author": "gnsmsk",
        "body": "TL;DR: As an investor, here is what you are betting on if you decide to invest in Snowflake.\n\n  1. Data analysis is going to be important more than ever to get competitive advantage as a company. Data is the new oil as they say.\n  2. Big companies spent and continue to spend billions to build their data analytics platform (and now selling these to other big names and SMEs)\n  3. Other big names and SMEs will need to spend some of their revenue on analytics to better understand their customers and improve their products/services\n  4. They will look for a cheap, easy to use analytics platform that integrates well with known apps, tools, technologies and platforms that they have been using, such as Google Sheets/Excel, relational databases, text files, salesforce, you name it.\n  5. Snowflake will be the go-to platform for these needs and my investment will grow fast with the company.\n\nNow read the rest if you are bored and want to get bored even more.\nSome facts first:\n\n  * There are two major types of databases: transactional and analytical. Analytical data often comes from transactional data after it is transformed, enriched, joined etc.\n\n  * Snowflake is an analytical database.\n\n  * Amazon and Microsoft provide both types of databases on their respective platforms, AWS and Azure. \n\nSo, as a company if your enterprise apps are hosted on AWS it makes sense to use their transactional database, called Aurora, for your apps. If you are on Azure, the equivalent would be SQL Server. **Snowflake replaces neither of these.**\n\nNow, if you also want to invest in data analysis as a company (because this is where you get competitive advantage), then you hire a few data engineers/analysts/scientists and provide them an analytics platform. The database component of that platform has to be an analytical database and that is where Snowflake shines. \n\nAs stated in the quote you shared, your data engineer pulls large amounts of data across multiple cloud platforms (mostly transactional databases but also other online services like SAP, Salesforce, Google Analytics etc) and puts it in an analytical database. Then your analyst/scientist analyzes it. For a company, if they are already using AWS or Azure it makes sense to get the analytical database from the same platform (for compatibility, support etc), namely Redshift in AWS and Data Warehouse (what a boring name) in Azure. \n\nThis is another area where Snowflake continues to shine. See, they built their platform on the shoulders of giants: AWS and Azure. Behind the scenes, they actually use these platforms to store and process your data. This is a very wise decision because:\n\n  * it enables them to scale without any additional work\n  * it makes it easier for companies to switch to Snowflake as if it is a native component of those platforms. \n  * it makes the service very cheap from the day 1\n  * they pose as an ally to the giants rather than a rival that needs to be crushed before it steals too much of their share. It is win-win-win scenario.\n\nOn top of all these, they have built an excellent platform which any data engineer/analyst/scientist would be pleased to use.",
        "created_utc": 1591772049,
        "id": "ftk8qgg",
        "score": 3,
        "subreddit": "investing",
        "created": 1591800849.0
    },
    {
        "author": "Madharder",
        "body": "V, MasterCard, google, Netflix, fb, Uber, interactive Brokers, Salesforce, Home Depot, all have broken 3 month trend lines...since the bottom. If those names are weakening it could be a short pullback no matter what the fed says bc they are so far off trend it would take a ginormous move to get back. \n\nFor any one reading this. Apple, Microsoft, Tesla, PayPal, square and nividia all are above trend but not by much. Still very bullish!’",
        "created_utc": 1592260214,
        "id": "fuy8e9g",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1592289014.0
    },
    {
        "author": "diabeetusboy",
        "body": "CRM &amp; the evil bitch whore SNAP",
        "created_utc": 1591062186,
        "id": "fsl91wl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591090986.0
    },
    {
        "author": "shacoand2boxes",
        "body": "CRM",
        "created_utc": 1591062248,
        "id": "fsl95rw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591091048.0
    },
    {
        "author": "AlexValleDoesCocaine",
        "body": "MSFT, AAPL, AMZN, GOOG, CRM, MA, V, CCI.\n\nDOCU, AYX, SQ, PYPL, CDNS, XLNX, TER.\n\nTDOC, CRNC, ALRM, LITE.\n\nFree reveal of one \"top\" stocks: https://imgur.com/a/FKAPgzc. \n\n[Shh.](https://imgur.com/a/nhAfyA2) Don't Tekashi 6ix9ine this thread.",
        "created_utc": 1591320595,
        "id": "fsxc5a8",
        "score": 2,
        "subreddit": "investing",
        "created": 1591349395.0
    },
    {
        "author": "eli_lilly",
        "body": "Yeah CRM sucks a fat one for sure.",
        "created_utc": 1591126406,
        "id": "fso1j9s",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591155206.0
    },
    {
        "author": "ComfortablyNumbLoL",
        "body": "70% of my portfolio in CRM calls... wish me luck",
        "created_utc": 1591128469,
        "id": "fso60sg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591157269.0
    },
    {
        "author": "Sandroli",
        "body": "CRM or ROKU calls",
        "created_utc": 1592867800,
        "id": "fvorun0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592896600.0
    },
    {
        "author": "engineerTEXAS",
        "body": "Lol pretty sure that FB drop brought down my CRM too",
        "created_utc": 1593120687,
        "id": "fvzx0xr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593149487.0
    },
    {
        "author": "soAsian",
        "body": "https://www.fool.com/investing/2020/06/25/salesforce-is-launching-a-mobile-chat-and-collabor.aspx\n\nTLDR: SalesForce 🚀. Slack is a 🌈🐻\n\nSalesForce is number one CRM and if your company don't use SalesForce that mean you are gay and poor. SalesForce previously said they going to integrate with Slack but now its going to have its own Slack. SalesForce know it control its customer's data and those bitchies ain't going anywhere once SalesForce come out with a Slack style hook.\n\nwhat does this mean for Slack? Everyone and their mama that can code can basically come out with a Slack clone. Microsoft know this and now SalesForce. \n\nSlack have no moat! Fucking Zoom with an army of Chinese coders can build a better shit than Slack and we all saw ZOOM MOON 🌙",
        "created_utc": 1593118241,
        "id": "fvzrvgy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593147041.0
    },
    {
        "author": "eyerollingsex",
        "body": "I’m in NYC area, so 70k+, depends on the title. You can get to 100k+ with a CRM manager or Growth Marketing Director role",
        "created_utc": 1592589527,
        "id": "fvcyqaz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592618327.0
    },
    {
        "author": "strawberry-jam-boy",
        "body": "Not bad not bad\n\nBetter than that 210 crm",
        "created_utc": 1592510828,
        "id": "fv9kqsp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592539628.0
    },
    {
        "author": "Jay0903",
        "body": "CRM and AMD",
        "created_utc": 1591062465,
        "id": "fsl9k01",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591091265.0
    },
    {
        "author": "lilfianchetto",
        "body": "CRM my least favorite stock ever i use their software at work &amp; it’s absolute trash. lightning, their newest iteration, is disturbingly slow &amp; the UI is ugly. also i lost 2k cuz i held my calls through earnings fuck u benioff lil swine",
        "created_utc": 1591064998,
        "id": "fsldz23",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591093798.0
    },
    {
        "author": "jd_coud9",
        "body": "&gt; ORCL is the next CRM\n\nthe retardation is strong",
        "created_utc": 1591031522,
        "id": "fsjkuqw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591060322.0
    },
    {
        "author": "avelak",
        "body": "yeah... fucking hate CRM lol, there were so many plays I missed just waiting on CRM, if I had played just about anything else for those two weeks I probably would've doubled up at minimum\n\nLooks like the others all probably worked out for you fabulously though!",
        "created_utc": 1591044539,
        "id": "fskbsil",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591073339.0
    },
    {
        "author": "Camaron-richard",
        "body": "Lmfao fuck CRM",
        "created_utc": 1591295891,
        "id": "fsvyuai",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591324691.0
    },
    {
        "author": "staunch_character",
        "body": "Ouch.\n\nI’m still bagholding CRM calls down 75% if it makes you feel any better. Was hoping they’d crush ER. That happens more often than continuing the huge run up.",
        "created_utc": 1591133109,
        "id": "fsoft98",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591161909.0
    },
    {
        "author": "zdonkeyspeaks",
        "body": "Hello there. Yes, some stocks are great!! You have a few good ones there. But some good Tech/ more consumer plays.  Ex.  AAPL PYPL NKE SQ CRM are some. Good luck!",
        "created_utc": 1591137798,
        "id": "fsopa7h",
        "score": 2,
        "subreddit": "investing",
        "created": 1591166598.0
    },
    {
        "author": "johnn2015",
        "body": "CRM is old news.",
        "created_utc": 1591047098,
        "id": "fskgzvm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591075898.0
    },
    {
        "author": "alotovanal",
        "body": "In JPOW's new paradigm, high pee ratios are good. Look at TSLA, ZM, CRM, AMZN, and all the rest. So if high pee ratios are better and negative pee ratios are the best, then a company whose pee ratio wraps around infinity and fucks itself in the asshole is the bomb. History will dub it, \"The FED/jpow reach-around.\"",
        "created_utc": 1591126713,
        "id": "fso275e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591155513.0
    },
    {
        "author": "MrMcjibblets1990",
        "body": "Sold the 0 DTE SPY 310!!!!!!!!!!!!! Still holding ROKU and CRM poots tho :)",
        "created_utc": 1591984050,
        "id": "fumczjg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592012850.0
    },
    {
        "author": "PAHoosier",
        "body": "Yes, I would say 95% of my portfolio is in long term holds. I just do penny stocks mainly for fun while I am Working From Home.\n\nCheck out this subreddit - r/stocks\n\nSome of my portfolio includes - JNJ, MSFT, PFE, UAL, NVDA, DAL, SPG, DIS, AMZN, CRM",
        "created_utc": 1592588921,
        "id": "fvcxhqp",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1592617721.0
    },
    {
        "author": "Waffini",
        "body": "I am long on alteryx, but they need to expand their stack or they'll be priced out.\nTableau has already a good share in the data visualization area, expanding into the analytics space occupied by alteryx and soon the integration will Salesforce will become even more relevant, I can easily see Salesforce installations bringing tableau as part of the deal, effectively cutting out alteryx.\nIn the meantime, alteryx is a standalone product that comes with a hefty price tag for the desktop version.\nImho they need a) move the client to cloud b) increase collaboration capabilities (now you need to save and share the workflow file) c) expand the stack vertically either in the reporting direction, or ETL one.",
        "created_utc": 1593034695,
        "id": "fvw8aj4",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593063495.0
    },
    {
        "author": "0000GKP",
        "body": "I was reading an article about my state's COVID-19 contact tracing that mentioned Salesforce CRM software. I did a little reading on Salesforce and saw mention of a software company that Salesforce partners with called Snowflake. Snowflake is about to IPO. A little more reading on Snowflake led me to a podcast called Rise of the Data Cloud where the CEO of Snowflake was talking about how all these tech companies collect obscene amounts of data, but all that data is kept in each individual's company's realm. Snowflake developed or is working on a platform to make all that data compatible and interchangeable between companies or individuals. Pretty interesting stuff. I started looking to see what kind of funds were holding Salesforce stock, and that led me to Information Technology sector funds. The same funds that hold Salesforce also  hold Apple, Microsoft, VISA, Mastercard, Adobe, and other very large companies. I bought some VGT at Vanguard.",
        "created_utc": 1592942171,
        "id": "fvrzmrf",
        "score": 2,
        "subreddit": "investing",
        "created": 1592970971.0
    },
    {
        "author": "quartzcrisis",
        "body": "It's not a big chunk of my investment which is generally in pretty stable stocks/etfs (VOO, QQQ, MSFT, AAPL, AMD, ATVI, CRM, NET). My goals are long term for the above investments. Ford was more of just a shot in the dark to see some larger percentage gains, same as my investments in PLUG (bought at $2.83) and TRTX (bought at $2.85). So my risk tolerance for this particular Ford trade is pretty high. My problem is that I do not know enough to make an informed decision about their potential as a business going forward. I suppose my timeline could be 10 years if holding it would be worthwhile. I don't have a need for any of this investment money for the foreseeable future.",
        "created_utc": 1592311900,
        "id": "fv08v1g",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592340700.0
    },
    {
        "author": "jamesewelch",
        "body": "Based on my experiences, once you go to Salesforce you're locked-in. It becomes too expensive to migrate your data to another platform (to recode any specialized forms, reports, modules, etc.). It's way more expensive than MS CRM (and I'm a fan of MS CRM), but it has the name that C-suite staff love to repeat because it sounds better than saying MSFT. It's good for at least 2-5 years. It'll retain most of their existing customers and just keep growing due to vendor lock-in.",
        "created_utc": 1592320947,
        "id": "fv0p7or",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592349747.0
    },
    {
        "author": "ikover15",
        "body": "If we call short term=daytrade\nMid term =1-3 weeks\n\nIf I find a stock with a large discrepancy between bid volume and ask volume I’ll buy the corresponding option and then exit the trade once the bid/ask volume evens out or turns against me.\n\nMid-term I follow about 10-15 stocks price movements and buy a call when its at the low end of its normal movements or a put at high end.\nFor example for the past 5 weeks or so Salesforce has been fluctuating pretty consistently between the low $170’s and low $180’s. The past few times it’s dropped into the low $170’s I’ve purchased a call with 10+ DTE. Bought puts at high $170’s low $180’s. Not HR trades but pretty easy money",
        "created_utc": 1592152118,
        "id": "fut9buz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592180918.0
    },
    {
        "author": "MrMcjibblets1990",
        "body": "Yeah I'm short ROKU, CRM, and BYND. Sweating is correct.",
        "created_utc": 1592233973,
        "id": "fuwpg7h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592262773.0
    },
    {
        "author": "Firm_Principle",
        "body": "I would just buy VGT.  Its top 10 holdings (58%) are:\n\n1 \tApple Inc.\n\n2 \tMicrosoft Corp.\n\n3 \tVisa Inc.\n\n4 \tMastercard Inc.\n\n5 \tIntel Corp.\n\n6 \tNVIDIA Corp.\n\n7 \tCisco Systems Inc.\n\n8 \tAdobe Inc.\n\n9 \tPayPal Holdings Inc.\n\n10 \tsalesforce.com Inc.\n\nI guess google isn't in the top 10 because they tend to break the law, and have to pay billions in fines.  Vanguard doesn't really go in for that kind of company.",
        "created_utc": 1592148736,
        "id": "fut3b7w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592177536.0
    },
    {
        "author": "C-rad06",
        "body": "Check out companies like lending loop. I don't know what those specific companies are like but tech sales in general is relatively chill compared to corporate life (so I'm told) and you're experience should make an easy transition. Either that type of role or even a company doing ERP type work (Salesforce, Oracle, SAP, Workday etc) could benefit with your experience working with corporate clients and understanding their business.",
        "created_utc": 1592176092,
        "id": "fuuh0y7",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1592204892.0
    },
    {
        "author": "edible_scissors",
        "body": "I think people are banking on SHOP becoming a CRM, with similar aggressive customer lock in.  Can't wait to see what happens after they lose meme status.\n\nI'd like to see a part two with NVIDIA and AMD.",
        "created_utc": 1592498331,
        "id": "fv8wo8w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592527131.0
    },
    {
        "author": "Oversteer929",
        "body": "Salesforce(CRM)",
        "created_utc": 1592514530,
        "id": "fv9s94j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592543330.0
    },
    {
        "author": "spy66may",
        "body": "Been working for me I can't believe CRM but I'm holding 6/12 192.5c and printing",
        "created_utc": 1591049920,
        "id": "fskmjxz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591078720.0
    },
    {
        "author": "tsho24",
        "body": "Thoughts on CRM?",
        "created_utc": 1591041811,
        "id": "fsk67gn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591070611.0
    },
    {
        "author": "avelak",
        "body": "Damn, lucky to have made money on CRM... I bought two weeks out and ended up selling at EOD on ER day for a loss (could've had small profit if I sold earlier in day), you must've gotten in later/cheaper than I did",
        "created_utc": 1591043995,
        "id": "fskaoge",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591072795.0
    },
    {
        "author": "Schnevets",
        "body": "They're having a virtual launch of a new product called Aspen on 6/16. I could see them ($8b market cap) taking lessons from $CRM ($158b market cap) and $NOW ($73b market cap) on making a cloud framework for insurance. And fuck are insurance companies going to need a cloud framework for this shitshow of a year.\n\nMy positions are 6/19 $115, 6/19 $120, and 1/15 $150",
        "created_utc": 1591065867,
        "id": "fslfge6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591094667.0
    },
    {
        "author": "Schnevets",
        "body": "If you love CRM, can I interest you in a sexy new GWRE?",
        "created_utc": 1591065164,
        "id": "fsle9g6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591093964.0
    },
    {
        "author": "Ernest_Graham",
        "body": "Tuesday... bought before earnings thinking it would tank like CRM did",
        "created_utc": 1591397241,
        "id": "ft0ul8f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591426041.0
    },
    {
        "author": "kidze",
        "body": "I did miss out on CRM. Thanks!",
        "created_utc": 1591337682,
        "id": "fsy2v0n",
        "score": 1,
        "subreddit": "investing",
        "created": 1591366482.0
    },
    {
        "author": "TJnova",
        "body": "I've been out of b2b sales for about 5 years (and some of the companies I worked for were shit, especially at supporting sales).\n\nIf it's that popular, Salesforce should buy and integrate it. I'm in.",
        "created_utc": 1591707139,
        "id": "ftgz6ha",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591735939.0
    },
    {
        "author": "paxnjackson",
        "body": "Bynd and CRM calls 😤",
        "created_utc": 1591796529,
        "id": "ftl1z48",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591825329.0
    },
    {
        "author": "amerricka369",
        "body": "I was looking into software companies recently too and found the price multiples outrageous from a market cap perspective and profitability stance. Crowd strike for instance has a phenomenal and important product but lacks profitability and its market cap is many many multiples ahead of revenue and long term future projected profitability. Data dog can be copied but it has the first market leadership. If they can continue to eat market share as they have and continue to extend their offerings, it builds them a wider moat and leads to improved profitability and free cash flow. Much like what Salesforce has done. \nDespite really liking Okta, Slack, Zoom, etc, I can’t see them extending their offerings in a meaningful way which puts a ceiling on them from both revenue, market cap and long term sustainability.",
        "created_utc": 1591752593,
        "id": "ftjg4c6",
        "score": 1,
        "subreddit": "investing_discussion",
        "created": 1591781393.0
    },
    {
        "author": "VaginalDischarge",
        "body": "2k - 4k - 12k in 1 week with a deliberate plan. Then had I followed the rest of the plan it would have been 30 or 40k.\n\nInstead I full on fucked my account with CRM.\n\nNow I'm just hoping for some miracle.",
        "created_utc": 1591116287,
        "id": "fsng1p8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591145087.0
    },
    {
        "author": "aj6469",
        "body": "CRM?",
        "created_utc": 1591128898,
        "id": "fso6xww",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591157698.0
    },
    {
        "author": "dvdmovie1",
        "body": "\"However, if we really sit down and think about what has already happened and what is on the way for the rest of this year, I truly can't see this momentum going through 2020 and into 2021\"\n\nPeople said that in March and April too. I think that there will be a rotation out of growth (I know there's part of this sub that hates to hear this because it doesn't go with their \"everything is awful\" narrative, but there are things that are doing quite well during this and those are growth stocks; Druckenmiller discussed this, there have been multiple conference calls discussing growth being pulled forward by \"years\" (such as Microsoft) and even the Salesforce call discussed how this situation has resulted in an unusual situation of companies that are very impacted and others not so much. \n\nI do think that there will be a rotation and probably a moderate correction would be healthy but I thought that in early May. You got a rotation out of growth that was swift last week and it lasted for about a day and a half before people piled back in again - the dip buyers were out n full force for things like TWLO.  \n\nI do think that things aren't sustainable short-term. If I could have the kind of investment performance I've had for the first 6 months of the year repeated in the back half I'd be thrilled but I think that's highly unlikely unless this time is really awfully different. That said, long-term I think I've never been more excited about the prospects of the companies that I own. \n\n\"3) \"Unlimited\" QE can only do so much:\" \n\nJohn Hussman has fought the Fed for over a decade now and his \"market neutral\" fund has lost more than half its value and most of his AUM has fled. He has written countless, lengthy bear letters for years. Maybe he's eventually right, but which comes first, him being right or his fund closing? There has been this continued proclamation that \"the Fed can't do anything more!\" for years and then this happens and Powell basically goes, \"Now witness the power of this fully operational and armed battle station.\"  The Fed cannot do everything, but they can do an awful lot and perhaps for longer than you think.\n\n\"How sustainable is it really?\"\n\nPart of this sub has been asking that for the last 40% or so. I've read what feels like a hundred \"list of bad stuff that nobody seems to be paying attention to but me!\" threads on here. This sub spent a month in a pointless debate about whether this was a \"bull trap.\"\n\n\"I'm shorting the market using inverse ETFs. Who agrees?\"\n\nJust take profits and build some cash into strength. There have been a lot of very dismaying stories about people who have lost a lot shorting this and I do feel genuinely badly for the people who have lost a lot doing this. Maybe you will be lucky and time it right or maybe not but I'm not seeing what you feel is the catalyst to turn the market now.\n\nAdditionally, I genuinely do feel that this is a market of winners and losers and I do think that people should read conference calls and see what companies are saying rather than going on broad headlines but (shrug.) Additionally, some of the sectors that are impacted by this were already in decline before it and this pulled forward what might have been years of further slow decline into one or two. \n\nI don't agree with the selling everything (although I don't even know what you own) or nearly everything and piling into shorts (want to gradually sell some into strength and raise money to patiently wait for a better opportunity? fine) but good luck.",
        "created_utc": 1591094999,
        "id": "fsmgedw",
        "score": 1,
        "subreddit": "investing",
        "created": 1591123799.0
    },
    {
        "author": "tubby_LULZ",
        "body": "Fuck CRM\n\nNot only do I work on their trash platform every day, they robbed me of tendies",
        "created_utc": 1591142843,
        "id": "fsoyjuj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591171643.0
    },
    {
        "author": "Personal_coach",
        "body": "looks like CRM coming back to life",
        "created_utc": 1591804399,
        "id": "ftlg8ft",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591833199.0
    },
    {
        "author": "itsicitoissrevolting",
        "body": "CRM",
        "created_utc": 1592919239,
        "id": "fvqpm2c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592948039.0
    },
    {
        "author": "jhs1981",
        "body": "If you'd like, I have a full report on CRM I can send to you, I just don't know how to. Feel free to PM me your email.\n\nEdit: for what it's worth, I took a look at $CRM and $OKTA a while back and ended up going with $OKTA.",
        "created_utc": 1592950670,
        "id": "fvsgt1b",
        "score": 1,
        "subreddit": "options",
        "created": 1592979470.0
    },
    {
        "author": "lurk2learn",
        "body": "I have around 150 stocks in my portfolio, but I'm still holding some amount of all of the ones mentioned. Recently ones that have been doing well:\n\n* Fastly has blown up to 370% and has become my largest holding\n* Docusign 251%\n* Zoom 150%\n* Ringcentral 132%\n* Square 105% (Bought this at $11, but have continued to add more)\n* Spotify 74%\n* Atlassian 70%\n* Paypal 45%\n\nHonestly, I invest in a lot of tech because it's what I have a better understanding of but a lot of these have been spiking due to COVID and I'm a bit worried about the valuations being too high.\n\nSome of the things I bought in March/April that I'm hesitant about:\n\n* Airlines (Alaskan, Delta, United, Southwest, Spirit, Hawaiian, and American in that order)\n* Hotels (Hyatt, Marriott, Wynn, MGM in that order)\n* Cruise lines\n* Boeing (I've continued adding to this position)\n* Ford\n* Disney\n\nSome others that I recently have added:\n\n* ZoomInfo (decent weight, have a lot of faith)\n* Cloudflare (small amount so far)\n* Agora (small amount so far)\n* Slack (have been in this from the start +14%, but I have a lot of faith in this in the mid-term and as an acquisition target)\n\nSome of my largest and longest-term holdings:\n\n* Amazon\n* Microsoft\n* Salesforce\n* Google\n* Paypal\n* Netflix\n* Apple\n* Adobe\n\nAnd then I have a lot more smaller holdings and of course index funds.",
        "created_utc": 1593240382,
        "id": "fw5825i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593269182.0
    },
    {
        "author": "Tyngast",
        "body": "I would probably consider buying around $300 as well. Higher than that though and for many different reasons mentioned in other posts I wouldnt touch it.\n\n&amp;#x200B;\n\nCompanies still have to grow into their valuation (if they are not Amazon or Salesforce ) \n\n;)",
        "created_utc": 1592681607,
        "id": "fvgusft",
        "score": 1,
        "subreddit": "investing",
        "created": 1592710407.0
    },
    {
        "author": "iWriteYourMusic",
        "body": "Zuckerburg is handsome and CRM is what my campaigners will be using. You're welcome.",
        "created_utc": 1592703114,
        "id": "fvhvyph",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592731914.0
    },
    {
        "author": "VolvoKoloradikal",
        "body": "Is something that Salesforce does truly something so hard to replicate? It has been well over a decade with Salesforce and competitors have not really taken market share from them.\n\nI don't know much about Splunk besides of a friend of mine getting a job offer there for like 180K right out of college, does seem like an operation with some very fat margins based on that.",
        "created_utc": 1592663446,
        "id": "fvfy89r",
        "score": 1,
        "subreddit": "investing",
        "created": 1592692246.0
    },
    {
        "author": "eldobs",
        "body": "Salesforce gross margin - pricing is more demand-based than cost-based. Even though it only costs Salesforce $25 to provide the service, they know its worth $100 to customers, so why price it at anything other than $100?\n\n&amp;#x200B;\n\nSome of your other numbers, I am just not seeing them. Realty Income, for Q1 2020 I'm reading net income of $147M on revenue of $414M, a 36% margin (although of course for REITs net income isn't relevant). [Link](https://s21.q4cdn.com/421822989/files/doc_financials/2020/q1/realty-income-form-10q.pdf)",
        "created_utc": 1592662597,
        "id": "fvfwwa2",
        "score": 1,
        "subreddit": "investing",
        "created": 1592691397.0
    },
    {
        "author": "VolvoKoloradikal",
        "body": "\nSo why can't say a company called Salesforce II come in and provide the service for $35 instead of $100? Where is the competition?\n\nAs for the others, my mistake I should've double checked my source.\n\nIt seems to be one of those auto-article generators from Yahoo which is why it's giving such oddly calculated margins.",
        "created_utc": 1592662950,
        "id": "fvfxfyn",
        "score": 1,
        "subreddit": "investing",
        "created": 1592691750.0
    },
    {
        "author": "zoltanyoursavior",
        "body": "That's probably the reason I hate Salesforce so much. In a lot of ways they are doing what Intel did with the initial microprocessor. They lock in customers with contracts that cost millions to get out of, and if a customer wants to switch platforms, the cost of doing so is astronomical. Someone posted once how they tried to migrate their data from one platform to another and the company they were switching from was holding their data hostage until they covered the fees for migration. \n\nUntil regulation steps in like it did in the cell phone carrier industry, these switching costs will likely get worse the more customers trust others with their data.",
        "created_utc": 1592665023,
        "id": "fvg0vhf",
        "score": 1,
        "subreddit": "investing",
        "created": 1592693823.0
    },
    {
        "author": "WinterWeather5",
        "body": "okay, so here is Draftking (DKNG): \n\n[https://imgur.com/4wRqQsZ](https://imgur.com/4wRqQsZ)\n\nanother stock, PDD:\n\n[https://imgur.com/dlUKdlT](https://imgur.com/dlUKdlT)\n\nSalesforce (CRM):\n\n[https://imgur.com/xfQ95NT](https://imgur.com/xfQ95NT)\n\nL-Brands (LB):\n\n[https://imgur.com/EDBbKZm](https://imgur.com/EDBbKZm)\n\nSo my question really is these large blocks are happening on the day of quad-witching and I am making the assumption that it is somehow related, that's all, but not sure how. I have always noticed large opening and closing trade blocks on the day of quad-witching, why is that?",
        "created_utc": 1592793852,
        "id": "fvll5vs",
        "score": 1,
        "subreddit": "options",
        "created": 1592822652.0
    },
    {
        "author": "layinzer",
        "body": "Salesforce CRM dumping slack integration - WORK heading down",
        "created_utc": 1593096213,
        "id": "fvyimbd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593125013.0
    },
    {
        "author": "Albedo100",
        "body": "This is not uncommon. Dropbox has a 75% gross profit margin and has the same marketcap with over 5x the revenue. Even salesforce has that margin and is barely positive. \n\nI'm not convinced a company like Cloudflare and Fastly can just drop their sales and be profitable. Switching between CDNs is one of the easiest things a tech department can do. It's literally drag and drop stuff or a couple lines of code. It's not like using salesforce where it benefits from being an expert in it and you have an entire team developed around using it. \n\nCDN stocks are just a flavor of the season and are pumping high because of their low market caps.",
        "created_utc": 1592932500,
        "id": "fvrflvy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592961300.0
    },
    {
        "author": "StayClassynet",
        "body": "I spent 10 years in ecomm selling personalization (web and email) and ecommerce platform software (ie. the website + shopping cart, inventory/promotion management etc.). My company was a partner of Avalara's for years.\n\nI'm not familiar with AVLR's financials so I can't speak to how efficiently they are being run, but they are virtually guaranteed to continue their strong revenue growth. As it relates to the US ecommerce market, it's been the wild west since online shopping's inception. AVLR automates key tax processes &amp; compliance by State, which as most would imagine differs significantly from one State to another and is a real pain in the ass for online retailers to keep up with changes/nuances/requirements/regulations. Up until the last few years, there hasn't been any governance around taxes for online shopping (even for large online retailers like Amazon). It sounds crazy, but a lot of online transactions haven't been taxed properly/correctly. That's starting to change and be monitored by Government, State by State and Avalara offers a great solution for this. With ecommerce adoption being further accelerated thanks to COVID, it stands to reason that an already growing industry (ecommerce) will continue to grow and AVLR stand to benefit nicely from this.\n\nThey are not the only players in this space (they do have lots of competition), but are easily one of the leading solution providers and have been for some time. One of the big keys to me for software like this is integration into other core ecommerce systems like payment processors/systems, ecommerce platform (ECP), order management (OMS), CRM/ERP/and more. AVLR do a really good job here.",
        "created_utc": 1592573568,
        "id": "fvc3rww",
        "score": 1,
        "subreddit": "investing",
        "created": 1592602368.0
    },
    {
        "author": "7FigureMarketer",
        "body": "$250k + $250k RSU's, most likely. Top engineers at Salesforce are getting the same. This is almost industry standard pay for Sr. Level Engineers at the big 5.",
        "created_utc": 1593310369,
        "id": "fw86odc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593339169.0
    },
    {
        "author": "Grrr_Mondays",
        "body": "I’m UVXY calls for 7/1 and 7/17. Been selling short term legs when vix was spiking to cut my cost basis. Otherwise I’ve got a few long dated puts on IIPR, CRM, and MMM for October and SPX puts for 7/1. Been thinking about selling some cash covered GE, T and C puts but waiting until after quad witching.\n\nOtherwise thinking about yoloing some LQD puts for December. Blackrock is keeping the price supported currently but once defaults hit underlying asset value will impact the etf price. That and pretty low IV in general.",
        "created_utc": 1592104002,
        "id": "furl2w7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592132802.0
    },
    {
        "author": "balzacthemoist",
        "body": "I like the idea. TWTR has lower profit potential than other tech companies I think, but premiums are low. I’m considering CRM. Have more research to do first",
        "created_utc": 1592329331,
        "id": "fv1907q",
        "score": 1,
        "subreddit": "options",
        "created": 1592358131.0
    },
    {
        "author": "MrMcjibblets1990",
        "body": "Yeah DKNG is saving me a bit today. Holding CRM, ROKU, and BYND poots. BYND was a bad idea",
        "created_utc": 1592232726,
        "id": "fuwmy0a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592261526.0
    },
    {
        "author": "MrMcjibblets1990",
        "body": "Thinking some CRM poots are looking juicy for next Friday",
        "created_utc": 1591976156,
        "id": "fuluyr9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592004956.0
    },
    {
        "author": "sixtysixer",
        "body": "CRM",
        "created_utc": 1592407169,
        "id": "fv4ou7s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592435969.0
    },
    {
        "author": "alkaline119",
        "body": "I have great faith in FSLY and CRM. Especially FSLY. It's my second largest holding. I say go for it.",
        "created_utc": 1592458683,
        "id": "fv7ecym",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592487483.0
    },
    {
        "author": "ComfortablyNumbLoL",
        "body": "Wanna buy CRM puts",
        "created_utc": 1592500117,
        "id": "fv90dkp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592528917.0
    },
    {
        "author": "PotatoWriter",
        "body": "anyone going long on CRM? Or should I sell soon before Q3 blows up",
        "created_utc": 1591047071,
        "id": "fskgxzs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591075871.0
    },
    {
        "author": "Jay0903",
        "body": "CRM XOMING BACK TO LIFE ,",
        "created_utc": 1591031668,
        "id": "fsjl5jd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591060468.0
    },
    {
        "author": "datrades",
        "body": "Bruh CRM fucking blows",
        "created_utc": 1591021085,
        "id": "fsj0zbr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591049885.0
    },
    {
        "author": "yolo_tron",
        "body": "Has any one actually ever uses this software? I did some training on it. The best way I can describe it is the Windows Millennium of CRM products. Do you like lag? Earnings to the moon then!",
        "created_utc": 1591094970,
        "id": "fsmgd9w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591123770.0
    },
    {
        "author": "3min33sec",
        "body": "Sold CRM calls at loss of about 80%. Feels good to remove that hot fuming turd. Removed the ticker from watchlist as well.",
        "created_utc": 1591281911,
        "id": "fsv4zcj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591310711.0
    },
    {
        "author": "TML_34",
        "body": "Salesforce controls the CRM market. \n\nAnd btw, WM is the biggest player in the space, but there are still many other large players. \n- RSG\n- Waste Connection\n- GFL\n- Covanta\n-Stericycle\n- US ecology",
        "created_utc": 1591331130,
        "id": "fsxtpen",
        "score": 1,
        "subreddit": "investing",
        "created": 1591359930.0
    },
    {
        "author": "Neemz1844",
        "body": "Same. That and CRM for me. So annoying.",
        "created_utc": 1591361428,
        "id": "fsyujca",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591390228.0
    },
    {
        "author": "PharmDinvestor",
        "body": "DFS, WELL, CCI, SWK, CRM, COLM, CODI,ROKU, TGT, CUB, ICE, RTX, FTV, DFEN, FAS",
        "created_utc": 1591308289,
        "id": "fswpavz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591337089.0
    },
    {
        "author": "Raoul_Puke",
        "body": "Yes, that's why I prefer Margin accounts even with less than $25k as it provides some flexibility. Just gotta be cognizant of how many day trades you're making.",
        "created_utc": 1591217922,
        "id": "fsseak4",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591246722.0
    }
]