[
    {
        "author": "Dingaling015",
        "body": "Just a few I've come across so far:\n\nDLPN - public offering ends tomorrow, ER expected by end of next week or sooner, already getting pumped by Yates though so caution here.\n\nEROS - Rumored merger announcement with STX, recently been approved so we're all just waiting for a PR. It's already run up quite though (again thanks to Yates lol) so who knows.\n\nThere's also CHFS which has been well enough talked about here but I did not buy so do your own DD. There are also several other COVID plays that people have been talking about but hardly any volume to merit a second look.\n\nBut yeah this week's been meh.",
        "created_utc": 1594243569,
        "id": "fxcu7ou",
        "permalink": "/r/pennystocks/comments/hnppgm/not_a_single_swing_trade_out_there_is_it/fxcu7ou/",
        "score": 7,
        "subreddit": "pennystocks",
        "created": 1594272369.0
    },
    {
        "author": "MostRetardedAutist",
        "body": "I've got AMD $63p weekly FD.  Hoping STX is the fortune teller for AMD.",
        "created_utc": 1595967045,
        "id": "fzjqjb1",
        "permalink": "/r/wallstreetbets/comments/hzlx0h/what_are_your_moves_tomorrow_july_29_2020/fzjqjb1/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595995845.0
    },
    {
        "author": "reddituseranyonymous",
        "body": "I bought 5 shares of STX two days ago just because it has a nice dividend.",
        "created_utc": 1596074961,
        "id": "fzor9lb",
        "permalink": "/r/smallstreetbets/comments/i0d2w6/tomorrows_alerts_from_my_ai_options_tool_codx/fzor9lb/",
        "score": 4,
        "subreddit": "smallstreetbets",
        "created": 1596103761.0
    },
    {
        "author": "j33tAy",
        "body": "no problem.\n\npeople get theta gang confused sometimes because they are looking for stock to own solely sell calls against. that's a recipe for bagholding shitty stock.\n\ninstead everyone should build up a base of good stock they wanna hold long term and sell calls on it. the strike should be any price they are okay with selling the stock at. i sell weeklies because they pretty much are always worthless at expiration.\n\ncurrently selling calls on: XLE, XLF, XLK, SRNE, AMD, STX",
        "created_utc": 1594316604,
        "id": "fxfzkny",
        "permalink": "/r/wallstreetbets/comments/ho5k1p/amazon_earnings_play_dd/fxfzkny/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594345404.0
    },
    {
        "author": "SuspiciousStuff3",
        "body": "Western fucking digital, slayed on their last earnings never recovered and Seagate just got wacked for missing, their direct competition 9/18 45 calls bias",
        "created_utc": 1596062819,
        "id": "fzo51ul",
        "permalink": "/r/wallstreetbets/comments/i07nqx/what_are_your_moves_tomorrow_july_30_2020/fzo51ul/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596091619.0
    },
    {
        "author": "MustardQuenelle",
        "body": "Why isn't Seagate in the graphic?",
        "created_utc": 1595934696,
        "id": "fzi2l9z",
        "permalink": "/r/wallstreetbets/comments/hzbt6u/earnings_thread_for_tuesday_728/fzi2l9z/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595963496.0
    },
    {
        "author": "VeggieVendor",
        "body": "Started investing about 3 weeks ago. Made some mistakes but I think my portfolio right now is decent. Any feedback is much appreciated.\n\nABBV - 4 @ 96.73 (99.28)\n\nSPCE - 5 @ 16.07 (16.79)\n\nSTX - 5 @ 50.32 (46.56)\n\nTSLA - 0.1488 @ 1343.25 (1365.88)\n\nNFLX - 1.43131 @ 457.62 (502.78)\n\nFB - 2 @ 212.20 (243.58)\n\nAAPL - 1.32175 @ 359.56 (381.37)\n\nMSFT - 2.51192 @199.49 (212.83)\n\nMCD - 2 @ 186.21 (185.83)\n\nQQQ - 1 @ 255.93 (259.99)\n\nVYM - 3 @ 79.87 (78.90)\n\nI want to slowly increase my holdings in MSFT and NFLX long term, as well as in QQQ.",
        "created_utc": 1594260978,
        "id": "fxdq9u7",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fxdq9u7/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594289778.0
    },
    {
        "author": "Rossoneri",
        "body": "&gt;  this sub has really rejected the potential of this stock for no reason\n\nThe reason is that it's got 40M in market cap.  It's a tiny company that does a tiny amount of business.  Your list of \"partners\" paints an overly optimistic picture when it's really more of a list of \"people who buy their products and people who sell products to them\".  The build some specialty computing, nothing really groundbreaking here. \n\nAlso \"Puma\" is one of their brands, it's not their partner.  They might be an interesting company, but the shilling and misleading posts indicate that they are closer to being pump &amp; dump than real quality.\n\n-----------------------------------------------\n\n**For comparison:**\n\n**broadberry.com** Partners: toshiba, seagate, intel, amd, windows, nvidia\n\n**dihuni.com** Partners: lockheed, duke, intel, johns hopkins, NASA, US Navy, FDA, UCIrvine, UCSF\n\n**abmx.com** Partners: microsoft, redhat, western digital, intel, supermicro, vmware, ubuntu\n\nIf anybody claims a company has a \"partnership\" without showing the contract details.  Ignore them.",
        "created_utc": 1594701368,
        "id": "fy08a0s",
        "permalink": "/r/pennystocks/comments/hqm2v8/oss_detailed_dd_on_the_pcie_backbone_of_nvidia/fy08a0s/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1594730168.0
    },
    {
        "author": "andrewchapman17",
        "body": "greenland staring gerald butler by stx entertainment in theaters august 16th, official trailer on youtube has over 7 million views",
        "created_utc": 1594263549,
        "id": "fxdulww",
        "permalink": "/r/stocks/comments/hns0wo/eros_indias_competition_commission_approves/fxdulww/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594292349.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 27th of July\n\n\n\n## Upcoming events for Monday, July 27th\n\n - Stock splits:\n\n    - FMO @ **1:5**\n    - MCC @ **1:20**\n\n - Expected earnings:\n\n  ABCB, ACI, AGNC, AMG, AMKR, ARE, ARLP, AVY, BOH, BRO, BSVN, CATY, CBU, CINF, CMRE, CR, CSBR, CX, DGICA, DSX, EHC, EQT, FBMS, FFIV, FIBK, FIX, FRBA, FRTA, FSB, GOOD, HAS, HBMD, HBT, HMST, HSII, HSTM, HTLF, HXL, IBA, IVAC, JBT, JJSF, LECO, LKFN, LM, LXFR, MEDP, MEDS, MMLP, MNSB, NBTB, NOV, NWBI, NXPI, OGS, OMF, PCH, PFG, PMBC, PPBI, PRK, QCRH, QTS, RBB, RNST, RPM, SALT, SAP, SBFG, SI, SMBC, SSD, TBI, TCF, TESS, TFII, TNET, UHS, USAK, VCRA, VET\n\n - Ex-div:\n\n  CVLY, FAST, SAFM\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.193%)\n    - 3-Month Bill Auction (previous: 0.120%)\n    - 5-Year Note Auction (previous: 0.330%)\n    - 6-Month Bill Auction (previous: 0.130%)\n    - Core Durable Goods Orders (consensus: 3.5%, previous: 3.7%)\n    - Dallas Fed Mfg Business Index (previous: -6.1)\n    - Durable Goods Orders (consensus: 7.2%, previous: 15.7%)\n    - Durables Excluding Defense (previous: 15.3%)\n    - Goods Orders Non Defense Ex Air (consensus: 2.3%, previous: 1.6%)\n    - Investing.com Gold Index (actual: 52.6%, previous: 50.9%)\n    - Investing.com S&amp;P 500 Index (actual: 41.0%, previous: 40.0%)\n\n## Upcoming events for Tuesday, July 28th\n\n - Stock splits:\n\n    - EMO @ **1:5**\n    - CEM @ **1:5**\n    - CTR @ **1:5**\n\n - Expected earnings:\n\n  AAT, ABG, ACCO, AFL, AGYS, AKAM, ALRS, AMAL, AMD, AMED, AMGN, APAM, APEN, ARCH, ASC, ASH, ATEN, ATRC, AUDC, AWI, AXS, B, BDGE, BE, BEN, BGFV, BPFH, BSBR, BUSE, BXP, BYD, CAC, CAR, CATC, CB, CCS, CE, CHRW, CMI, CNC, COWN, CSGP, CSLT, CSV, CVLT, CYH, DCOM, DENN, DHI, DTE, DXCM, EBAY, EBMT, ECL, EDU, EGP, EIX, ENVA, EQR, FBC, FBP, FCF, FELE, FEYE, FTV, GLW, GSS, HA, HAFC, HBCP, HIW, HLI, HOG, HP, HRZN, HUN, IBCP, IBTX, IMAX, IRDM, IVZ, JBLU, JNPR, LBC, LBRT, LH, LSCC, LW, MASI, MCD, MDC, MDLZ, MLM, MMM, MO, MPWR, MRC, MSCI, MTDR, MXIM, NBR, NEO, NWE, OKE, OMCL, OVV, OXSQ, PEGA, PFC, PFE, PII, PJT, PKG, PKI, PLT, PRGX, PRLB, PROV, QUMU, RCKY, RDHL, RNR, ROK, ROP, RRD, RTX, RVSB, RXN, SAN, SBUX, SHW, SIFY, SITC, SPGI, SPN, SQNS, SSNC, SSTK, ST, STAG, STX, SYX, TCS, TENB, THFF, THG, TPB, TRMK, TRU, TRVG, UDR, UMBF, UNM, USX, V, VBTX, WAB, WAT, WDR, WH, WNC, WNEB, WRE, XGN, XRX, YNDX, ZBRA\n\n - Ex-div:\n\n  AMRB, ATR, CFG, CLX, ENTG, GBX, WST\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 0.511%)\n    - API Weekly Crude Oil Stock (previous: 7.544M)\n    - CB Consumer Confidence (consensus: 94.5, previous: 98.1)\n    - Dallas Fed Services Revenues (previous: 5.7)\n    - Redbook (previous: -7.5%)\n    - Redbook (previous: 1.9%)\n    - Richmond Manufacturing Index (previous: -27)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -28)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 4.0%, previous: 4.0%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 0.3%, previous: 0.3%)\n    - Texas Services Sector Outlook (previous: 2.1)\n\n## Upcoming events for Wednesday, July 29th\n\n - Expected earnings:\n\n  AAN, ACGL, ADM, ADP, AEGN, AEM, AER, AGI, AHCO, AHT, AIN, AJRD, ALG, ALGT, ALIM, ALKS, ALTA, ALTM, AM, AMP, ANTM, APA, APHA, APLS, APRN, AQMS, AR, ARCB, ASGN, ATNI, AVB, AVGR, AVTR, AX, AXTA, BA, BBVA, BCO, BDC, BG, BHLB, BKCC, BKU, BLKB, BOOT, BSGM, BSMX, BSX, BTU, BXMT, CAKE, CBL, CCI, CCJ, CDE, CERN, CF, CFFN, CFMS, CGNX, CHDN, CHE, CHEF, CHT, CLS, CME, CMO, CMPR, CNMD, CODI, CONE, CORR, CPAC, CPF, CPLP, CRHM, CRTO, CS, CTO, CTSH, CVEO, CXO, DIN, DRE, DRTT, DT, DX, EEFT, EGOV, ENB, EPD, EQC, EQIX, ESRT, ETN, ETR, EVBN, EXEL, EZPW, FB, FBHS, FCPT, FICO, FISI, FLOW, FSS, FTI, GAIN, GD, GE, GIB, GLDD, GM, GRFS, GRMN, GWB, HBB, HBNC, HES, HESM, HI, HOLX, HOME, HPP, HWKN, ILPT, INOV, IO, IPG, IRT, ISBC, JAKK, JCS, JHG, JRVR, KAMN, KGC, KLIC, KN, KRA, KRC, KTOS, LADR, LFUS, LIVN, LRCX, LXU, LYG, MAA, MANT, MC, MCO, MEET, MEOH, MFG, MGLN, MGRC, MHH, MHO, MKSI, MLVF, MMSI, MNRO, MOBL, MPX, MSEX, MTOR, MTSI, MUFG, MYRG, NEXA, NGVT, NLS, NLY, NMM, NMR, NOA, NOVA, NOW, NSC, NSCO, NYCB, OC, OCX, OII, OIS, OMC, ONDK, ORLY, ORN, PAG, PB, PDM, PEIX, PGRE, PI, PPC, PS, PTC, PYPL, QCOM, QEP, QRVO, R, RAIL, RDWR, RDY, RES, RGCO, RIG, RJF, ROIC, ROL, RYI, SAIA, SANM, SBBP, SBH, SBPH, SC, SCI, SDPI, SFM, SGC, SHOO, SHOP, SIGI, SIMO, SITE, SIX, SKY, SLAB, SLRX, SMG, SNY, SP, SPFI, SPG, SPOT, SRDX, SREV, SRI, STRA, SWIR, TAK, TARO, TBIO, TBPH, TDOC, TEL, TGI, TKC, TLRD, TMDI, TPC, TPL, TRNO, TROW, TROX, TRTX, TS, TSE, TSEM, TSU, TT, TTEK, TTMI, TUP, TX, TYL, UCTT, URI, UTHR, UVE, VAC, VGZ, VICI, VKTX, VNDA, VSEC, VTVT, WERN, WHD, WING, WIRE, WLL, WRI, WTI, WTRE, XAN, YUM, YUMC\n\n - Ex-div:\n\n  AM, BPMP, ERF, FRC, HMLP, KNOP, MSB, PVBC\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.076M)\n    - Crude Oil Inventories (consensus: -2.088M, previous: 4.892M)\n    - Cushing Crude Oil Inventories (previous: 1.375M)\n    - Distillate Fuel Production (previous: -0.097M)\n    - EIA Refinery Crude Runs  (previous: -0.103M)\n    - EIA Weekly Distillates Stocks (consensus: -0.618M, previous: 1.073M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.5%, previous: -0.2%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (consensus: -1.386M, previous: -1.802M)\n    - Gasoline Production (previous: -0.016M)\n    - Goods Trade Balance (previous: -75.26B)\n    - Heating Oil Stockpiles (previous: -0.750M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 5.1%)\n    - Pending Home Sales (consensus: 15.3%, previous: 44.3%)\n    - Pending Home Sales Index (previous: 99.6)\n    - Retail Inventories Ex Auto (previous: -1.6%)\n    - Seevol Cushing Storage Report (previous: 0.769M)\n    - Wholesale Inventories (previous: -1.2%)\n\n## Upcoming events for Thursday, July 30th\n\n - Expected earnings:\n\n  AAPL, ABTX, ACA, ADSW, AGCO, AGIO, AIMT, AINC, AJG, ALXN, AMSF, AMT, AMZN, ANIK, AOS, APO, APTV, ARI, ARW, ASPN, ATR, ATUS, AZN, BAND, BAX, BC, BGCP, BGS, BHR, BIO, BLDR, BPMC, BRKS, BSAC, BUD, BVN, BZH, CARR, CARS, CASA, CBTX, CBZ, CC, CCC, CFR, CG, CGEN, CI, CLF, CMCO, CMCSA, CNHI, CNOB, CNX, CNXM, COG, COHU, COLM, COOP, COP, COR, CPG, CPT, CRAI, CROX, CRS, CRY, CUBI, CUZ, CVA, CWT, CXP, DAN, DBD, DCO, DD, DECK, DLA, DLR, DLX, DNKN, DRQ, DSPG, DVA, EA, EBS, EGHT, EGO, EKSO, ELAN, ERII, ERJ, ESXB, EVLO, EXAS, EXP, EXPE, EXPO, F, FCN, FHI, FLEX, FLS, FMBH, FMS, FND, FORM, FORR, FTAI, FTS, FWRD, GHM, GIL, GILD, GLPI, GNRC, GOOG, GOOGL, GPC, GPI, GRA, GTX, HBI, HGV, HIG, HOPE, HST, HTGC, HTH, HUBB, HUBG, HURN, ICE, IDA, INFI, INT, IP, IRMD, ISDR, ITGR, JILL, K, KDP, KEX, KHC, KNSL, LAWS, LIN, LKQ, LLY, LNTH, LOCO, LPLA, LTC, LXRX, MA, MAS, MATW, MD, MDRX, MELI, MERC, MGM, MGNX, MGPI, MHK, MITK, MIXT, MMC, MMP, MN, MOH, MPW, MSA, MT, MTA, MTD, MTLS, MTX, MTZ, MWK, MX, MYE, NATI, NEM, NOC, NTCT, NTUS, NVCR, NVST, NXGN, ODFL, OFC, ONEW, OPI, ORBC, ORC, OSK, PATK, PBI, PCG, PEB, PFPT, PFS, PG, POWI, PQG, PRFT, PRO, QDEL, RDFN, RDS.A, RGEN, ROG, RP, RTRX, SAH, SEM, SGEN, SHAK, SIRI, SKYW, SNDR, SO, SOI, SPSC, SPXC, SSB, STBA, SWK, SWN, SYK, TAL, TAP, TBBK, TEAM, TEX, TFX, TIGO, TMHC, TNC, TNDM, TPX, TRP, TRS, TW, TWOU, TXT, ULH, UPS, UTL, VC, VCYT, VLO, VRAY, VRTU, VRTX, WEX, WLTW, WM, WRTC, WWE, WYND, X, XEL, XFOR, XHR, XLNX, XPO, XYL, ZEN\n\n - Ex-div:\n\n  AGNC, ALLY, AOS, ATLO, AVAL, BMRC, BRMK, BSRR, CADE, CCLP, COST, CRT, CSWI, DCP, DD, DNP, EFC, ENLC, EPD, EV, FT, GECC, GEL, GPP, GRP.U, KFFB, LNT, MCBS, MS, NI, NNN, NWN, OHI, ORC, OSBC, OVBC, PAA, PAGP, PBT, PETS, PFE, PLBC, PSEC, PSXP, SBNY, SLG, STAG, TGP, TRGP, TXN, UNM, USAC, UVE, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 17,067K, previous: 16,197K)\n    - Core PCE Prices (consensus: 1.40%, previous: 1.70%)\n    - GDP (consensus: -34.0%, previous: -5.0%)\n    - GDP Price Index (consensus: 1.2%, previous: 1.6%)\n    - GDP Sales (previous: -3.5%)\n    - Initial Jobless Claims (consensus: 1,400K, previous: 1,416K)\n    - Jobless Claims 4-Week Avg. (previous: 1,360.25K)\n    - Natural Gas Storage (consensus: 36B, previous: 37B)\n    - PCE Prices (previous: 1.3%)\n    - Real Consumer Spending (previous: -6.8%)\n\n^^^^2020-07-27",
        "created_utc": 1595844034,
        "id": "fze1qb2",
        "permalink": "/r/RobinHood/comments/hyph34/daily_discussion_thread_july_27th_2020/fze1qb2/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1595872834.0
    },
    {
        "author": "UpperSpinach",
        "body": "Remember in 2011 when Thailand had floods, hard drive prices went through the roof and WDC, STX fucking mooned\n\nIf this flood starts hitting Shenzhen and disrupting tech supply chain, we could moon again.",
        "created_utc": 1594559314,
        "id": "fxtqbom",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxtqbom/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594588114.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "STX is the better IC. High dividend limits upside. Stronger underlying performance than WDC limits downside. \n\nBeen selling puts and covered calls on STX for a few months. If the put gets exercised, I’m fine with owning more stock so I can sell more covered calls and get more dividends. If the call gets exercised, I’ll sell a put to get the stock back. The stock barely moves anyway, making great for selling options on.\n\nAlthough I own some of the stock on margin too so I’ve made it a little bit more risky, but the strategy is yielding more than TD’s margin rate so it’s all good.",
        "created_utc": 1594818582,
        "id": "fy52j70",
        "permalink": "/r/wallstreetbets/comments/hrkzcb/daily_discussion_thread_for_july_15_2020/fy52j70/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594847382.0
    },
    {
        "author": "MASters0fTheUn1verse",
        "body": "https://erosplc.com/wp-content/uploads/2020/04/Eros-International-STX-Announcement.pdf\n\nThis was on the front page of Eros website yesterday, does this not count as official PR?",
        "created_utc": 1594287527,
        "id": "fxeo04a",
        "permalink": "/r/pennystocks/comments/hnwd9f/eros_merger/fxeo04a/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594316327.0
    },
    {
        "author": "DOLLARS4NINJAS",
        "body": "Merger confirmed with stx.",
        "created_utc": 1594302956,
        "id": "fxf7wsq",
        "permalink": "/r/pennystocks/comments/ho3934/eros/fxf7wsq/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594331756.0
    },
    {
        "author": "anthnyl",
        "body": "Question: How would I completely delta-hedge a long stock position (of any number of shares) without or greatly minimizing theta burn.\n\nI am trying to understand how I would go about \\*completely\\* delta hedging a long stock position (of any number of shares) while having no/minimal theta burn (which I believe disqualifies protective puts).\n\nFor example, in an ideal scenario: Suppose I hold 1000 shares of some stock, I would like to figure out an option scheme such any direction of price movement of said stock, my account balance stays completely flat (or bull biased with all potential downside mitigated).  However, I want to be able to completely hedge with extremely minimal theta costs.  Would this imply deeply in the money and long dated puts/LEAPS? Or is there some kind of spread that would allow me to do this more cheaply?\n\nSpecific example, going in WORK earnings last month with 1K shares and 10 puts expiring June 30th, however, WORK tanked but my 10 puts were not enough to offset my losses when the market opened the next day.  Was it purely not having enough put delta?  I want to be able to have come out of WORK earnings somehow covering all potential downside of the stock declining and have it cost a very/small amount of theta as possible.\n\nAnother example, I bought STX into an ex-dividend last month for a day to capture the dividend then exit asap, but I wanted to ensure that any price drop would be mitigated so that I can go into the ex-dividend without the typical risk of the stock dropping by the price of the dividend and creating a decline in balance.  \n\nI can't help but feel I am misunderstanding something.",
        "created_utc": 1594243549,
        "id": "fxcu649",
        "permalink": "/r/options/comments/hm0f9k/noob_safe_haven_thread_july_0612_2020/fxcu649/",
        "score": 1,
        "subreddit": "options",
        "created": 1594272349.0
    },
    {
        "author": "WinterPiratefhjng",
        "body": "I am an American and interested in a stock for which the company is headquartered in Ireland.  The company pays dividends, which the Irish government then withholds some percent.  Let's use Seagate, STX, as an example.\n\nThere is some paperwork I can fill-out and send to the Irish government, and withholding won't happen.\n\nIs there a better/easier/more efficient method of handling this?\nIf I own a fund that holds STX stock, do they take care of this paperwork?\n\nWhat paperwork should I expect that will reflect this withholding?\n\nDoes withholding like this impact the stock price? (i.e. Are professional investors \"put off\" by the dividend withholding paperwork?)",
        "created_utc": 1596029210,
        "id": "fzmampl",
        "permalink": "/r/investing/comments/hzzmru/daily_advice_thread_all_basic_help_or_advice/fzmampl/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596058010.0
    },
    {
        "author": "UpperSpinach",
        "body": "So did you buy puts on EEM? That's the obvious move for you then, isnt it?\n\nTo anybody else reading this, please refer to charts of WDC and STX when Thailand flooded in late 2011-early 2012. Natural disasters and their impacts on economies don't have a simple positive correlation with markets",
        "created_utc": 1595381714,
        "id": "fytu592",
        "permalink": "/r/wallstreetbets/comments/hveqed/what_are_your_moves_tomorrow_july_22_2020/fytu592/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595410514.0
    },
    {
        "author": "willshekillme",
        "body": "I got a good feeling about STX. Not a great feeling, but enough of one to get some smol tendies.",
        "created_utc": 1596226549,
        "id": "fzwon28",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzwon28/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596255349.0
    },
    {
        "author": "lmmortalMachine",
        "body": "What about data storage companies like Western Digital and Seagate? Always going to need it and more so in this digital age and furthermore.",
        "created_utc": 1594978481,
        "id": "fycedna",
        "permalink": "/r/investing/comments/hslmcw/my_buy_and_hold_forever_portfolio/fycedna/",
        "score": 1,
        "subreddit": "investing",
        "created": 1595007281.0
    },
    {
        "author": "wambamsamalamb",
        "body": "Going to wait and see if KO, STX, RTX drop some more.\n\nETFs and such, I’m eyeing XLU, ITA, ICLN, FTEC always a good time to add a little of these.\n\nAlso looking at some acq corps but you can’t talk about them here I guess",
        "created_utc": 1594600612,
        "id": "fxvs5mm",
        "permalink": "/r/stocks/comments/hpww89/what_stocks_will_you_buy_next_week/fxvs5mm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594629412.0
    },
    {
        "author": "zomboyashik",
        "body": "STX",
        "created_utc": 1594402241,
        "id": "fxju1uf",
        "permalink": "/r/StockMarket/comments/hokmsc/what_stocks_are_you_eyeing_for_next_week/fxju1uf/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1594431041.0
    },
    {
        "author": "stephenphph",
        "body": "Wasnt this released months ago????\n\n&amp;#x200B;\n\n[https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749](https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749)",
        "created_utc": 1594225434,
        "id": "fxbrmss",
        "permalink": "/r/pennystocks/comments/hnjnb9/erosstx_merger_approved/fxbrmss/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594254234.0
    },
    {
        "author": "ThesisRobot",
        "body": "I didn't see that on the front page, but I have access to the bloomberg terminal, so all official PR's come through my breaking news wire. And all we see is the    \n\n\n\"  \\*CCI APPROVES MERGER OF EROS INTL, STX FILMWORKS, MARCO ALLIANCE \"  that is just the government agency that approves these types of mergers from what I understand. I'd also like to add the CEO has said he will do an announcement on Friday at 11 (not sure what time zone)   \n\n\nSo I am a little confused, I was really hoping for a nice sell the news here.",
        "created_utc": 1594295896,
        "id": "fxex5ab",
        "permalink": "/r/pennystocks/comments/hnwd9f/eros_merger/fxex5ab/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594324696.0
    },
    {
        "author": "orlezea",
        "body": "SHOULD I REPLACE MICROSOFT WITH SEAGATE FOR MY PORTFOLIO?",
        "created_utc": 1596203938,
        "id": "fzv1fph",
        "permalink": "/r/wallstreetbets/comments/i15376/daily_discussion_thread_for_july_31_2020/fzv1fph/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596232738.0
    },
    {
        "author": "neocoff",
        "body": "Dip on STX then",
        "created_utc": 1596057646,
        "id": "fznuu6h",
        "permalink": "/r/options/comments/i05nuk/intc_long_calls/fznuu6h/",
        "score": 1,
        "subreddit": "options",
        "created": 1596086446.0
    },
    {
        "author": "ylmir03",
        "body": "To answer your question, the earnings call early this morning showed massively negative statistics across the board, which is likely the stimulus for the massive dump of shares and subsequent reduction in price. By no means am I an expert in this field yet, but I'm betting that their sizable increase in subscriptions, and the completion of the STX merger opening up new markets and increasing equity funding and credit (from JP Morgan), will lead to the price increasing in the long run. We'll probably see a similar pump up soon before their brand launch in September, followed by profit-taking. Of course, since I have money invested here, it'll most likely all just go to crap because that's how things actually work.",
        "created_utc": 1596156687,
        "id": "fzt9bj9",
        "permalink": "/r/pennystocks/comments/i0tqxb/what_happened_with_eros/fzt9bj9/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1596185487.0
    },
    {
        "author": "ryit29",
        "body": "How come computer storage companies like WDC and STX are tanking? More cloud means more hard drives needed. What am I missing?",
        "created_utc": 1596113412,
        "id": "fzq2ona",
        "permalink": "/r/wallstreetbets/comments/i0ji8h/daily_discussion_thread_for_july_30_2020/fzq2ona/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596142212.0
    },
    {
        "author": "Bobodelboy",
        "body": "STX. Getting a nice bounce back from earnings, low IV ripe for a 10 bagger 46c 7/31 .12, in the money at .90/1.00",
        "created_utc": 1596043086,
        "id": "fzn0eci",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzn0eci/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596071886.0
    },
    {
        "author": "p0tempkin",
        "body": "STX crashing 10% AH",
        "created_utc": 1595966759,
        "id": "fzjpxnd",
        "permalink": "/r/wallstreetbets/comments/hzc3ko/daily_discussion_thread_for_july_28_2020/fzjpxnd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595995559.0
    },
    {
        "author": "wsb-narrator",
        "body": "Seagate garbage",
        "created_utc": 1595966873,
        "id": "fzjq6fu",
        "permalink": "/r/wallstreetbets/comments/hzc3ko/daily_discussion_thread_for_july_28_2020/fzjq6fu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595995673.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 28th of July\n\n\n\n## Upcoming events for Tuesday, July 28th\n\n - Stock splits:\n\n    - EMO @ **1:5**\n    - CEM @ **1:5**\n    - CTR @ **1:5**\n    - PKKFF @ **1:10**\n\n - Expected earnings:\n\n  AAT, ABG, ACCO, AFL, AGYS, AKAM, ALRS, AMAL, AMD, AMED, AMGN, APAM, APEN, ARCH, ASC, ASH, ATEN, ATRC, AUDC, AWI, AXS, B, BDGE, BE, BEN, BGFV, BPFH, BSBR, BUSE, BXP, BYD, CAC, CAR, CATC, CB, CCS, CE, CHRW, CMI, CNC, COWN, CSGP, CSLT, CSV, CVLT, CYH, DCOM, DENN, DHI, DTE, DXCM, EBAY, EBMT, ECL, EDU, EGP, EIX, ENVA, EQR, FBC, FBP, FCF, FELE, FEYE, FTV, GLW, GSS, HA, HAFC, HBCP, HIW, HLI, HOG, HP, HRZN, HUN, IBCP, IBTX, IMAX, IRDM, IVZ, JBLU, JNPR, KAI, LBC, LBRT, LH, LSCC, LW, MASI, MCD, MDC, MDLZ, MLM, MMM, MO, MPWR, MRC, MSCI, MTDR, MXIM, NBR, NCR, NEO, NWE, OKE, OMC, OMCL, OVV, OXSQ, PEGA, PFC, PFE, PII, PJT, PKG, PKI, PLT, PRGX, PRLB, PROV, QUMU, RCKY, RDHL, RNR, ROK, ROP, RRD, RTX, RVSB, RXN, SAN, SBUX, SHW, SIFY, SITC, SPGI, SPN, SQNS, SSNC, SSTK, ST, STAG, STX, SYX, TCS, TENB, THFF, THG, TPB, TRMK, TRU, TRVG, UDR, UMBF, UNM, USX, V, VBTX, WAB, WAT, WDR, WH, WNC, WNEB, WRE, XGN, XRX, YNDX, ZBRA\n\n - Ex-div:\n\n  AMRB, ATR, CFG, CLX, ENTG, GBX, WST\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 0.511%)\n    - API Weekly Crude Oil Stock (previous: 7.544M)\n    - CB Consumer Confidence (consensus: 94.5, previous: 98.1)\n    - Dallas Fed Services Revenues (previous: 5.7)\n    - Redbook (previous: -7.5%)\n    - Redbook (previous: 1.9%)\n    - Richmond Manufacturing Index (previous: -27)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -28)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 4.0%, previous: 4.0%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 0.3%, previous: 0.3%)\n    - Texas Services Sector Outlook (previous: 2.1)\n\n## Upcoming events for Wednesday, July 29th\n\n - Expected earnings:\n\n  AAN, ACGL, ADM, ADP, AEGN, AEM, AER, AGI, AHCO, AHT, AIN, AJRD, ALG, ALGT, ALIM, ALKS, ALTA, ALTM, AM, AMP, ANTM, APA, APHA, APLS, APRN, AQMS, AR, ARCB, ASGN, ATNI, AVB, AVGR, AVTR, AX, AXTA, BA, BBVA, BCO, BDC, BFST, BG, BHLB, BKCC, BKU, BLKB, BOOT, BSGM, BSMX, BSX, BTE, BTU, BXMT, CAJ, CAKE, CBD, CBL, CCI, CCJ, CDE, CERN, CF, CFFN, CFMS, CGNX, CHDN, CHE, CHEF, CHT, CKH, CLBK, CLS, CME, CMO, CMPR, CNMD, CODI, CONE, CORR, CPF, CRHM, CRTO, CS, CTO, CTSH, CVEO, CXO, DB, DIN, DORM, DRE, DRTT, DT, DX, EEFT, EGOV, ENB, EPD, EQC, EQIX, ESRT, ETN, ETR, EVBN, EXEL, EZPW, FARO, FB, FBHS, FCPT, FICO, FISI, FLOW, FSS, FTI, GAIN, GD, GE, GIB, GLDD, GM, GRFS, GRMN, GSK, GWB, HBB, HBNC, HES, HESM, HI, HOLX, HOME, HPP, HWKN, ILPT, INOV, INVA, IO, IPG, IRT, ISBC, JAKK, JCS, JHG, JMP, JRVR, KAMN, KGC, KLIC, KN, KRA, KRC, KTOS, LFUS, LIVN, LN, LRCX, LXU, LYG, MAA, MANT, MC, MCO, MEET, MEOH, MFG, MGLN, MGRC, MHH, MHO, MKSI, MLCO, MLVF, MMSI, MNRO, MOBL, MPX, MSC, MSEX, MTOR, MTSI, MUFG, MYRG, NBN, NEXA, NGVT, NLS, NLY, NMM, NMR, NOA, NOVA, NOW, NSC, NYCB, OC, OCX, ODT, OII, OIS, ONDK, ORLY, ORN, PAG, PB, PDM, PEIX, PGRE, PI, PPC, PS, PTC, PYPL, QCOM, QEP, QRVO, R, RAIL, RDWR, RDY, RES, RGCO, RIG, RJF, ROIC, ROL, RYI, SAIA, SANM, SBBP, SBH, SBPH, SC, SCCO, SCI, SFM, SGC, SHOO, SHOP, SIGI, SIMO, SITE, SIX, SKY, SLAB, SLRX, SMG, SNY, SONM, SPFI, SPG, SPOT, SRDX, SREV, SRI, STRA, SWIR, TAK, TARO, TBIO, TBPH, TCFC, TDOC, TEL, TKC, TLRD, TMDI, TPC, TPL, TRNO, TROW, TROX, TRTX, TS, TSE, TSEM, TSU, TT, TTEK, TTMI, TUP, TX, TYL, UCTT, URI, USAP, UTHR, UVE, VAC, VGZ, VICI, VKTX, VNDA, VSEC, VTVT, WERN, WHD, WING, WIRE, WLL, WPG, WRI, WSBF, WTI, WTRE, XAN, YUM, YUMC\n\n - Ex-div:\n\n  AM, BPMP, ERF, FRC, HMLP, KNOP, MSB, PVBC\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.076M)\n    - Crude Oil Inventories (consensus: -2.088M, previous: 4.892M)\n    - Cushing Crude Oil Inventories (previous: 1.375M)\n    - Distillate Fuel Production (previous: -0.097M)\n    - EIA Refinery Crude Runs  (previous: -0.103M)\n    - EIA Weekly Distillates Stocks (consensus: -0.333M, previous: 1.073M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.5%, previous: -0.2%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (consensus: -0.967M, previous: -1.802M)\n    - Gasoline Production (previous: -0.016M)\n    - Goods Trade Balance (previous: -75.26B)\n    - Heating Oil Stockpiles (previous: -0.750M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 5.1%)\n    - Pending Home Sales (consensus: 15.0%, previous: 44.3%)\n    - Pending Home Sales Index (previous: 99.6)\n    - Retail Inventories Ex Auto (previous: -1.6%)\n    - Seevol Cushing Storage Report (previous: 0.769M)\n    - Wholesale Inventories (previous: -1.2%)\n\n## Upcoming events for Thursday, July 30th\n\n - Expected earnings:\n\n  AAPL, ABTX, ACA, ADSW, AGCO, AGIO, AIMT, AINC, AJG, ALXN, AMSF, AMT, AMZN, ANIK, AOS, APO, APTV, ARI, ARW, ASPN, ATR, ATUS, AZN, BAND, BAX, BC, BEAT, BGCP, BGS, BHR, BIO, BLDR, BPMC, BRKS, BSAC, BUD, BVN, BZH, CACC, CARR, CARS, CASA, CBTX, CBZ, CC, CCC, CFR, CG, CGEN, CI, CLF, CMCO, CMCSA, CNHI, CNOB, CNX, CNXM, COG, COHU, COLM, COOP, COP, COR, CPG, CPT, CRAI, CROX, CRS, CRY, CUBI, CUZ, CVA, CWT, CXP, DAN, DBD, DCO, DD, DECK, DLA, DLR, DLX, DNKN, DRQ, DSPG, DVA, EA, EBS, EGHT, EGO, EKSO, ELAN, ERII, ERJ, ESXB, EVLO, EXAS, EXP, EXPE, EXPO, F, FCN, FHI, FLEX, FLS, FMBH, FMS, FND, FORM, FORR, FTAI, FTS, FWRD, GFF, GHM, GIL, GILD, GLPI, GNRC, GOOG, GOOGL, GPC, GPI, GRA, GRUB, GSHD, GTX, HBI, HGV, HIG, HOPE, HST, HTGC, HTH, HUBB, HUBG, HURN, ICE, IDA, INFI, INT, IP, IRMD, ISDR, ITGR, JILL, K, KDP, KEX, KHC, KL, KNSL, KRNY, LADR, LAWS, LIN, LKQ, LLY, LNTH, LOCO, LPLA, LXRX, MA, MAS, MATW, MD, MDRX, MELI, MERC, MGM, MGNX, MGPI, MHK, MITK, MIXT, MMC, MMP, MN, MOH, MPW, MSA, MT, MTA, MTD, MTLS, MTX, MTZ, MWK, MX, MYE, NATI, NEM, NOC, NTCT, NTUS, NVCR, NVST, NXGN, ODFL, OFC, ONEW, OPI, ORBC, ORC, OSK, PATK, PBI, PCG, PEB, PFPT, PFS, PG, POWI, PQG, PRFT, PRO, QDEL, RARE, RDFN, RDS.A, RGEN, RLGY, ROG, RP, RTRX, RWT, SAH, SAND, SEM, SGEN, SHAK, SIRI, SKYW, SNDR, SO, SOI, SPSC, SPXC, SSB, STBA, SWK, SWN, SYK, TAL, TAP, TBBK, TEAM, TEX, TFX, TIGO, TMHC, TNC, TNDM, TPX, TRP, TRS, TW, TWOU, TXT, ULH, UPS, UTL, VC, VCYT, VLO, VRAY, VRTU, VRTX, WEX, WLTW, WM, WRLD, WRTC, WWE, WYND, X, XEL, XFOR, XHR, XLNX, XPO, XYL, ZEN\n\n - Ex-div:\n\n  AGNC, ALLY, AOS, ATLO, AVAL, BMRC, BRMK, BSRR, CADE, CCLP, COST, CRT, CSWI, DCP, DD, DNP, EFC, ENLC, EPD, EV, FT, GECC, GEL, GPP, GRP.U, KFFB, LNT, MCBS, MS, NI, NNN, NWN, OHI, ORC, OSBC, OVBC, PAA, PAGP, PBT, PETS, PFE, PLBC, PSEC, PSXP, SBNY, SLG, STAG, TGP, TRGP, TXN, UNM, USAC, UVE, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 16,200K, previous: 16,197K)\n    - Core PCE Prices (consensus: 1.00%, previous: 1.70%)\n    - GDP (consensus: -34.1%, previous: -5.0%)\n    - GDP Price Index (consensus: 1.1%, previous: 1.6%)\n    - GDP Sales (previous: -3.5%)\n    - Initial Jobless Claims (consensus: 1,450K, previous: 1,416K)\n    - Jobless Claims 4-Week Avg. (previous: 1,360.25K)\n    - Natural Gas Storage (consensus: 36B, previous: 37B)\n    - PCE Prices (previous: 1.3%)\n    - Real Consumer Spending (previous: -6.8%)\n\n## Upcoming events for Friday, July 31st\n\n - Stock splits:\n\n    - TLSA @ **5:2** (Payable date: 07/30/2020)\n\n - Expected earnings:\n\n  ABBV, AON, AROC, ASIX, ASX, ATRO, AXL, BAH, BCBP, BCPC, BERY, CAT, CBOE, CBRE, CHD, CHTR, CL, CPLP, CTS, CVX, D, ES, FCAU, GLYC, GT, HRC, IMGN, IMO, ITT, ITW, JCI, LAZ, LHX, LTC, LYB, MGI, MRK, NVT, NWL, OFS, OIIM, OXLC, PBF, PBFX, PEG, PINS, PIPR, PNM, POR, PSX, PSXP, SCM, SHLX, SLCA, SNA, SPB, SRC, TAC, TU, UAA, UBX, VFC, WETF, WPC, WY, XOM\n\n - Ex-div:\n\n  AB, AES, AON, ASRV, BMTC, BX, C, CASY, CNBKA, DGICA, DGICB, DMLP, FCCO, HAS, HEP, HFBL, KMI, LBAI, LCUT, MATW, MCI, NRG, NSEC, NVEC, O, OCFC, OKE, ORRF, OVLY, PAYX, PBCT, PEBO, PNW, RELX, STL, SXT, SYF, TCP, WABC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 125.0K)\n    - CFTC Copper speculative net positions (previous: 38.6K)\n    - CFTC Corn speculative net positions (previous: -98.9K)\n    - CFTC Crude Oil speculative net positions (previous: 548.9K)\n    - CFTC Gold speculative net positions (previous: 266.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 15.7K)\n    - CFTC Natural Gas speculative net positions (previous: -22.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -43.0K)\n    - CFTC Silver speculative net positions (previous: 46.8K)\n    - CFTC Soybeans speculative net positions (previous: 121.5K)\n    - CFTC Wheat speculative net positions (previous: 18.8K)\n    - Chicago PMI (consensus: 43.9, previous: 36.6)\n    - Core PCE Price Index (consensus: 0.2%, previous: 0.1%)\n    - Core PCE Price Index (consensus: 1.0%, previous: 1.0%)\n    - Dallas Fed PCE (previous: 1.50%)\n    - Employment Benefits (previous: 0.40%)\n    - Employment Cost Index (consensus: 0.6%, previous: 0.8%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (consensus: 2.70%, previous: 2.50%)\n    - Michigan Consumer Expectations (consensus: 66.2, previous: 72.3)\n    - Michigan Consumer Sentiment (consensus: 73.0, previous: 73.2)\n    - Michigan Current Conditions (consensus: 84.2, previous: 87.1)\n    - Michigan Inflation Expectations (consensus: 3.1%, previous: 3.0%)\n    - PCE Price index (previous: 0.5)\n    - PCE price index (previous: 0.1%)\n    - Personal Income (consensus: -0.5%, previous: -4.2%)\n    - Personal Spending (consensus: 5.5%, previous: 8.2%)\n    - Real Personal Consumption (previous: 8.1%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 181)\n    - U.S. Baker Hughes Total Rig Count (previous: 251)\n\n^^^^2020-07-28",
        "created_utc": 1595930416,
        "id": "fzhy8hz",
        "permalink": "/r/RobinHood/comments/hzbxy3/daily_discussion_thread_july_28th_2020/fzhy8hz/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1595959216.0
    },
    {
        "author": "RichardCabeza",
        "body": "\n\n\nYep they installed back doors on huawei, which is actually one if the reasons they pulled out of the US in 2014.\n\nAccording to the report, the NSA has planted backdoors to access computers, hard drives, routers, and other devices from companies such as Cisco, Dell, Western Digital, Seagate, Maxtor, Samsung, and Huawei.\n\nhttps://www.spiegel.de/international/world/catalog-reveals-nsa-has-back-doors-for-numerous-devices-a-940994.html",
        "created_utc": 1594395033,
        "id": "fxjf83g",
        "permalink": "/r/stocks/comments/hog1q3/chinese_stocks_are_stunningly_fraudulent_the_sec/fxjf83g/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594423833.0
    },
    {
        "author": "RichardCabeza",
        "body": "So your point is spying on your own people isnbad but nothing compared to a country using its supply chain to spy on the world right?\n\nYou do know that we spied on our allies including tapping Merkel's phone right?\n\nHeres a quote from Spiegel on the snowden report\n\nNSA has planted backdoors to access computers, hard drives, routers, and other devices from companies such as Cisco, Dell, Western Digital, Seagate, Maxtor, Samsung, and Huawei.\n\nhttps://www.spiegel.de/international/world/catalog-reveals-nsa-has-back-doors-for-numerous-devices-a-940994.html\n\nDo you not know about this and snowden?  Like seriously?\n\nAnd idk how you can make the comment theres no longer back doors.  Its like oh weve only done it 3 or 4 times but for reals weve stopped now.",
        "created_utc": 1594394961,
        "id": "fxjf32q",
        "permalink": "/r/stocks/comments/hog1q3/chinese_stocks_are_stunningly_fraudulent_the_sec/fxjf32q/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594423761.0
    },
    {
        "author": "KnightAnthony",
        "body": "Lol, there's a funny and profitable story regarding this company. I had very little idea about this one until I began looking into streaming choices due to COVID stay-at-home orders! I'm a cable cord cutter, but family wanted entertainment. So I compared mainly Netflix with Amazon, but research led me to study Roku.....and only for the remote control ability! I had a great experience with Seagate, and this Roku was giving me a similar vibe. So I took a gamble and bought 150 shares in one of my \"forget-it-about\" brokerage accounts. $10K is usually my starting investment, and I got it around $72 back in March. Again....TOTAL speculation and totally forgot I owned it! And if it weren't for some chatter about it yesterday, I would never had known how much it had appreciated. Lol, my PT was only $100, but when I saw that it was $150, I sold it all! Doubled my money in just a few months on something I wasn't expecting much. Might get back into it, but ROKU is not something I \"love\" so will have to think about it.",
        "created_utc": 1594903175,
        "id": "fy8wkou",
        "permalink": "/r/stocks/comments/hs7w6o/roku/fy8wkou/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594931975.0
    },
    {
        "author": "TheSuper_Namek",
        "body": "Eros will be probably announce ER after Netflix dropped theirs, eros is like the bollywood Netflix with their Eros now platform and eh they just got  approval from indian goverment to merge with STX entertainment  that is a Hollywood filmmaker they are going international after the merger  and they are dirt cheap right now.. company has potential but management doesn't seem to care about the shareholders",
        "created_utc": 1594869794,
        "id": "fy7tnlk",
        "permalink": "/r/wallstreetbets/comments/hrq9k3/psa_netflix_nflx_earnings_tomorrow_astrazeneca/fy7tnlk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594898594.0
    },
    {
        "author": "minawarr",
        "body": "I grew up on bollywood movies and we are a bollywood household I will say. Eros has dwindled out of being one of the large production houses in India. The last hit movie it produced was in 2015 (bajirao mastani). I cant even recall any new bollywood music they have produced. \n\nI enjoyed watching the Eros entertainment banner when I was younger, but the scene is alot more competitive than it used to be in India in the 80s and 90s. All the top actors have launched their own production houses and tseries basically rules the music rights. \n\nI'm not sure how the STX merger will pan out. STX is more of a indie based company and  Indians enjoy over the top extravagant movies. Most indie productions don't bring in the box office numbers.",
        "created_utc": 1594273739,
        "id": "fxe9g3t",
        "permalink": "/r/pennystocks/comments/hnl87s/thank_me_next_week/fxe9g3t/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594302539.0
    },
    {
        "author": "stephenphph",
        "body": "I saw this from April.....\n\n[https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749](https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749)",
        "created_utc": 1594225459,
        "id": "fxbroq4",
        "permalink": "/r/pennystocks/comments/hnjnb9/erosstx_merger_approved/fxbroq4/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594254259.0
    },
    {
        "author": "SirPounces",
        "body": "STX calls",
        "created_utc": 1595445041,
        "id": "fywhg1r",
        "permalink": "/r/wallstreetbets/comments/hvr7i6/daily_discussion_thread_for_july_22_2020/fywhg1r/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595473841.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "Because WDC is dogshit. Long STX all the way",
        "created_utc": 1595817464,
        "id": "fzd67xw",
        "permalink": "/r/wallstreetbets/comments/hydr22/what_are_your_moves_tomorrow_july_27_2020/fzd67xw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595846264.0
    },
    {
        "author": "ChiefGriffey",
        "body": "Buy STX on this dip?",
        "created_utc": 1596038581,
        "id": "fzmrn4o",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzmrn4o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596067381.0
    },
    {
        "author": "wild__illusion",
        "body": "What's going on with STX??",
        "created_utc": 1595966573,
        "id": "fzjpjp9",
        "permalink": "/r/wallstreetbets/comments/hzc3ko/daily_discussion_thread_for_july_28_2020/fzjpjp9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595995373.0
    },
    {
        "author": "stephenphph",
        "body": "i personally think they are waiting till friday for the PR. i read somewhere that Friday they are doing a live interview about their merger and future associations with apple, youtube, &amp; microsoft.  this stock is massively undervalued. people have been saying $12 PT since talks of a merger last year. there were 2m dark pool buys today. honestly the movies their merger STX has come out with are pretty damn good and if thats the direction of bollywood. this is a good long term hold. sure make some quick profits but def keep some in for long term. i might buy more in the PM tomorrow.",
        "created_utc": 1594263778,
        "id": "fxduzcn",
        "permalink": "/r/pennystocks/comments/hnjtnz/eros_merger_get_in_now/fxduzcn/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594292578.0
    },
    {
        "author": "j33tAy",
        "body": "yup exactly. my covered calls are XLK, XLF, AMD, STX, SRNE and EEM. \n\nIV is high enough that I can make a solid 1% a week selling weekly calls when the stock goes sideways.\n\nlet me know what kinda house you get in 2 years!",
        "created_utc": 1594248465,
        "id": "fxd42g7",
        "permalink": "/r/wallstreetbets/comments/hnmunz/32_of_us_missed_housing_payment/fxd42g7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594277265.0
    },
    {
        "author": "The_Big_Willy",
        "body": "I have WDC in my Roth IRA. Since you hold STX, let me ask you, does the fact that they’re not diversifying into NAND technology concern you? That’s the only reason I picked up WDC over STX.",
        "created_utc": 1594819262,
        "id": "fy53ms9",
        "permalink": "/r/wallstreetbets/comments/hrkzcb/daily_discussion_thread_for_july_15_2020/fy53ms9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594848062.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "They diversified into NAND tech back in 2017. They were severely undervalued compared to WDC at the time, as investors were sleeping on that fact. Personally, I even own a Seagate NVMe SSD.",
        "created_utc": 1594819548,
        "id": "fy543sw",
        "permalink": "/r/wallstreetbets/comments/hrkzcb/daily_discussion_thread_for_july_15_2020/fy543sw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594848348.0
    },
    {
        "author": "Adelphia_",
        "body": "$STX 8/20 50C Earnings Play",
        "created_utc": 1594827589,
        "id": "fy5ja0x",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy5ja0x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594856389.0
    },
    {
        "author": "Various_Art",
        "body": "These are my predictions do something near it. \nBuy CRESY @ $3.61. An agricultural stock from some South American Country (Argentina). Agriculture is automated and if they are about to be hungry I would prefer you donate the gains to South America.\nThis would be 27.7K shares. If it gains 125% in the next 6 months due to famine you can do well. Also if it reaches $12.5 you can make $346,250. You should obviously diversify.\nTWLO ~$313  Dec. 21, 2020.\n\nBEEEG YOLO RISK\n\nAnytime you write a contract called an option you have unlimited risk. DO NOT WRITE A CONTRACT. \n\nYou will be purchasing a contract. You want something that is out of the money going into the money meaning, it won't look like it is about to make money before the strike date.\n\nCurrently I would suggest a CALL option. I will leave some predictions below for most likely to succeed. You need to buy a few things to get \n\nMMM ~$179 Oct. 30, 2020\nSPY ~$336 Nov. 13, 2020\nCOST ~$340 Oct 16, 2020\n\n\nBEEG Mooon Strat\n\nSTX Call Option ~$60 Nov. 13, 2020\nCACC Call Option ~$555 Aug. 21, 2020\nFOX Call Option ~$35 Jan. 1, 2021\nBBBY Call Option ~$25 Nov. 25, 2020\n\n\nSafe Bet \n\nTL;DR - I suggest a straight purchase of shares.  \nSuch as: JPM @ 99.73 7/15. Hold for 25% gain, unfortunately leaves you at $125,000. \n\nWhatever you do pick something with positive net income for at least 3 years. Has a minimum of 5 M volume or similar Blue chip qualities.",
        "created_utc": 1594864522,
        "id": "fy7ks9d",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy7ks9d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594893322.0
    },
    {
        "author": "ImportantLog8",
        "body": "The reason why it tanked is because it was a reverse merger. EROS is getting absorbed by STX so to speak, not the other way around. But people oversold, panicked, algos sold, and it was red across the market on top of all that. It’ll come around. I’m gonna hold and have PAYtience on that one. :-)",
        "created_utc": 1596182557,
        "id": "fzuc09y",
        "permalink": "/r/pennystocks/comments/i0tqxb/what_happened_with_eros/fzuc09y/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1596211357.0
    },
    {
        "author": "Sailo21",
        "body": "STX-EROS MERGER CLOSES. \n\nhttps://www.hollywoodreporter.com/news/stx-eros-merger-closes-creating-global-content-streaming-player-1300854",
        "created_utc": 1596117859,
        "id": "fzqa2xg",
        "permalink": "/r/pennystocks/comments/i0lhu4/eros_merger_news_today/fzqa2xg/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1596146659.0
    },
    {
        "author": "SamuraiHelmet",
        "body": "Spitballing here, but STX and WDC were and probably still are dominated by sales of magnetic storage, which is on its way out. They've pivoted slowly into solid state storage, but they're not the technological leaders, and they lack the state backing of some of the big Korean storage companies.",
        "created_utc": 1595978769,
        "id": "fzkdnx4",
        "permalink": "/r/investing/comments/hzndv3/stx_wdc_and_other_storage_companies_tanking_while/fzkdnx4/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596007569.0
    },
    {
        "author": "TAWS",
        "body": "Seagate vs. WDC. Which is the better company?",
        "created_utc": 1596030305,
        "id": "fzmcgul",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzmcgul/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596059105.0
    },
    {
        "author": "james00543",
        "body": "sure, how much of those are equipped with seagate drives? I think consumer laptop/desktop uses samsung/micron. \n\nsource: in the storage industry.",
        "created_utc": 1596031140,
        "id": "fzmdwiy",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzmdwiy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596059940.0
    },
    {
        "author": "wild__illusion",
        "body": "What are your thoughts on STX earnings? Hold?",
        "created_utc": 1595964438,
        "id": "fzjl2iu",
        "permalink": "/r/wallstreetbets/comments/hzc3ko/daily_discussion_thread_for_july_28_2020/fzjl2iu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595993238.0
    },
    {
        "author": "wild__illusion",
        "body": "STX down almost 10% AH.",
        "created_utc": 1595966645,
        "id": "fzjpp2s",
        "permalink": "/r/wallstreetbets/comments/hzc3ko/daily_discussion_thread_for_july_28_2020/fzjpp2s/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595995445.0
    },
    {
        "author": "Ernest_EA",
        "body": "What happened to STX seagate?",
        "created_utc": 1596034752,
        "id": "fzmkiys",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzmkiys/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596063552.0
    },
    {
        "author": "orlezea",
        "body": "SEAGATE CRASHING! TIME TO BUY? WOULDNT THERE BE MORE DEMAND FOR STORAGE BECAUSE EVERYONE BUYING COMPUTER FOR WORK FROM HOME?",
        "created_utc": 1596030449,
        "id": "fzmcpj6",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzmcpj6/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1596059249.0
    },
    {
        "author": "public_instigator",
        "body": "AMD, STX, ADBE, AAPL, DIS",
        "created_utc": 1594877426,
        "id": "fy84kui",
        "permalink": "/r/wallstreetbets/comments/hs38pl/playing_earnings_of_coronavirus_beneficiaries/fy84kui/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594906226.0
    }
]