[
    {
        "author": "spyaintnobitch",
        "body": "Congress: \"We need to split up big tech\"\n\nIBM: 'Sure boss! We'll split into 2 companies'\n\nCongress: \"We mean actual big tech\"",
        "created_utc": 1602189549,
        "id": "g85c2c0",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1602218349.0
    },
    {
        "author": "massiveboner911",
        "body": "They are a giant old company that is so big and old they cant maneuver. They let the bean counters completely take over and overwhelm the RND centers. I’m out. They are turning into IBM.",
        "created_utc": 1603411887,
        "id": "g9pgbfn",
        "score": 13,
        "subreddit": "investing",
        "created": 1603440687.0
    },
    {
        "author": "Ashamed-Unit1004",
        "body": "AAPL - Steve Jobs = new GE/IBM with cash and zero innovation",
        "created_utc": 1602626188,
        "id": "g8qjar6",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1602654988.0
    },
    {
        "author": "mattw08",
        "body": "Not to mention extremely overpaid bean counters. I read through the previous annual reports hoping this would mimic Microsoft not IBM but doesn’t look that.",
        "created_utc": 1603407306,
        "id": "g9p8b80",
        "score": 7,
        "subreddit": "investing",
        "created": 1603436106.0
    },
    {
        "author": "Techoptions",
        "body": "You all really are a bunch of fucking retards. Talking about Tesla calls and docking with your cousin. I haven’t heard anyone even remotely mention IBM. There’s your yolo yo yos. You’re welcome.",
        "created_utc": 1603255118,
        "id": "g9ifkt7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1603283918.0
    },
    {
        "author": "Mpcars",
        "body": "Petition to remove BA, IBM, JPM from the Dow and replace with PTON, ZM, amd TWLO.",
        "created_utc": 1602642002,
        "id": "g8rbhp9",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1602670802.0
    },
    {
        "author": "Electrical_Spite_477",
        "body": "Your picks are trash. IBM? Lol.  You suck at stock analysis",
        "created_utc": 1603860941,
        "id": "gacpcy4",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1603889741.0
    },
    {
        "author": "whatshisuserface",
        "body": "what calls are you buying when the market opens and selling eod tomorrow? pfe pton pg ibm nflx phm pm snap tsla abt?\n\nwhat are your thoughts about trv?",
        "created_utc": 1603067828,
        "id": "g99zxkg",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1603096628.0
    },
    {
        "author": "ReversalTheory",
        "body": "* 1 week ago, Fed chair Jerome Powell acknowledged that a central bank digital currency could be beneficial for the US\n\n* 3 days ago, IBM And R3 announce collaboration to provide a highly secured platform certified to meet the highest level of security certification commercially available for clients with highly sensitive data and workloads such as digital identity, digital assets, central bank digital currencies.\n\n* 3 days ago, IBM executives and board members start insider buying \nhttps://fintel.io/n/us/ibm\n\n* Today, Fed adjusts terms on MSLP showing desperate last attempt that didn't work. The fed have to take interest rates into negative but they can't do it with cash in the current system.\n\n* Future, US central bank digital currency system is coming. It's only a matter of time. And they are secretly working with IBM to make it happen\n\nFuck IBM but \nIBM 115c 11/27, 120c 12/18, and 125c 1/15/2021 lol",
        "created_utc": 1604087458,
        "id": "gamsd34",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604116258.0
    },
    {
        "author": "RyFba",
        "body": "Let me tell you about IBM...",
        "created_utc": 1603484472,
        "id": "g9slcog",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1603513272.0
    },
    {
        "author": "ExtensionAd2828",
        "body": "You have to be a special kind of retard to bet on Intel lol They’re the new IBM",
        "created_utc": 1603399096,
        "id": "g9or0nn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1603427896.0
    },
    {
        "author": "PutsTookMyMoney",
        "body": "I’m so bullish on Tesla and wanted to strictly play this shit but played ibm (lost 90% of my account) added more $ played Netflix (losing 90% tomorrow) I’ll play Tesla and actually win but it won’t be shit with my account tomorrow",
        "created_utc": 1603225848,
        "id": "g9gyfjc",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1603254648.0
    },
    {
        "author": "tropicalia84",
        "body": "Sitting over here with my Intel scratch off yolo puts waiting for it to do exactly the same thing IBM did.",
        "created_utc": 1603393054,
        "id": "g9ocd8f",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1603421854.0
    },
    {
        "author": "skilliard7",
        "body": "I panicked a bit because I had a lot in REITs,  you had 20% unemployment, businesses being forcibly closed and not paying rent, and the government banning evictions. It just seemed like a recipe for massive losses that I didn't think the market was properly pricing. So I sold and went into silver. My rationale was fiscal stimulus + quantitive easing +supply chain disruptions from shutdowns will create stagflation concerns once the immediate liquidity fears are gone. Historically silver performed well in similar conditions(GFC and 80's stagflation, and silver was at historical lows, so it seemed like a low risk high reward bet. So I sold REITs and went silver.\n\nInitially took a large capital loss, but the silver I bought more than doubled in value before I sold, so I ended up making a ton of money such that my portfolio has a 54% ROI YTD.\n\nNow I'm slowly building up a new dividend portfolio. Still a bit early to tell how I'm doing, but generally I've been doing pretty good at timing the market on individual stocks. Bought in IBM at the right time, sold right on the news of spinoff boosting its price before it dropped back down. The difference is I'm buying stocks that seem to be valued low in terms of P/E and price/book value, but also are in a position to perform well during the pandemic or survive okay. So avoiding stocks like XOM, but buying stocks like LUMN, T, etc",
        "created_utc": 1602801764,
        "id": "g8y2o1g",
        "score": 4,
        "subreddit": "investing",
        "created": 1602830564.0
    },
    {
        "author": "Libertymark",
        "body": "No idea all i know is this is not healthy\n\nAlmost every great american company i wanted to own failed me from ibm to rtx to lmt\n\n\nRtx down 7% today dude\n\nLmfao\n\nWealth being destroyed as indices are barely red\n\nIts not just robinhood muppets getting crushed",
        "created_utc": 1603851911,
        "id": "gacay70",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1603880711.0
    },
    {
        "author": "Dmillehee",
        "body": "No wonder IBM flopped \n\nHave you seen that Garbage they came out with on Fantasy Football... IBM Watson worst shit i ever seen",
        "created_utc": 1603247962,
        "id": "g9i51af",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1603276762.0
    },
    {
        "author": "Longboarding-Is-Life",
        "body": "Tech is how things work now. It's what runs our society. Classifying everything from apple to Google to cloud flare as the same thing is stupid. \n\nDo you really think that so many investors are stupid and that your money is better spent on companies where most of their cost is on a per unit sold basis, unlike software, for example, where one more customer doesn't cost nearly as much as ford needs to pay for every car sold?\n\nClassifying so much as tech is like classifying everything in the 80s as \"engineering\" including everything from IBM to general motors.",
        "created_utc": 1603307763,
        "id": "g9kkfys",
        "score": 4,
        "subreddit": "investing",
        "created": 1603336563.0
    },
    {
        "author": "TheRahulParmar",
        "body": "Made 5K on Logi Calls and 3K on IBM puts.\nJust put that 8K into QQQ puts lmao",
        "created_utc": 1603206348,
        "id": "g9ft7nt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1603235148.0
    },
    {
        "author": "Coz131",
        "body": "I think your entire thesis on buying IBM is terrible. They were losing relevance hence the low PE because it's seen as a shit stock.",
        "created_utc": 1602197904,
        "id": "g85tjv1",
        "score": 4,
        "subreddit": "investing",
        "created": 1602226704.0
    },
    {
        "author": "AllHailtheKingg",
        "body": "bought $1k worth of IBM leaps 145C 3/19/21",
        "created_utc": 1602186272,
        "id": "g8547dq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602215072.0
    },
    {
        "author": "howtoreadspaghetti",
        "body": "Nothing good. It's a dying legacy business with decaying operating profit margins and taking on billions in restructuring charges that shift the chairs around on hiding the big fact looming over them: there is an economic future without IBM and it's coming. You can sit and collect dividend payments and all, and it Isn't exactly a bad way to return capital to shareholders. But there is a future without IBM in it and it's not far away I'm afraid.",
        "created_utc": 1602210370,
        "id": "g86fkwf",
        "score": 3,
        "subreddit": "investing",
        "created": 1602239170.0
    },
    {
        "author": "hubbs_j",
        "body": "I made bank on puts today. I almost bought calls when I sold at $117, but it shouldn't be too late to get in. I probably wont though, because fuck IBM",
        "created_utc": 1603214732,
        "id": "g9gaek7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1603243532.0
    },
    {
        "author": "BuffettGOAT",
        "body": "I see IBM has earnings first Monday. The boomer in me definitely will play it.",
        "created_utc": 1602885230,
        "id": "g91o4vc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602914030.0
    },
    {
        "author": "ShadowLiberal",
        "body": "My portfolio is mostly dividend stocks, except for TSLA shares I picked up a year and a half ago (TSLA is what got me into buying stocks). Excluding TSLA from my numbers, my dividend portfolio is a mixed bag. Overall I'm up 9.79% with dividends since I first started investing in mid to late 2019, I'm not sure what I was up pre-COVID, but I've added a lot of money to my portfolio during 2020.\n\nMy biggest losers are:\n\n* WFC - This is the biggest disaster of my investing career. I bought into it literally right before COVID, I'm down 49.79% with dividends. Fortunately I didn't put much money into this so it barely moves the numbers. I might cut my losses in this stock before the end of the year.\n\n* DIS - The dividend got cut, but because I bought more shares during the peek of the COVID drop (before their dividend cut) I'm up 5% right now counting the dividend I received in the past. I'll probably keep holding this for a number of years even if they don't reinstate the dividend.\n\n* IBM - Like WFC I bought into this right before COVID, so I'm down like 10.57% right now. I don't have much money invested into this. This is a turnaround play for me with their shift to cloud. I may buy a little bit more before the end of the year, but this will never be a large position for me.\n\n* T - I made the mistake as a new investor of getting into this when they were in the high $30's. Still, I think it's worth the risk as a dividend investment. I've been slowly DCAing into it more to reduce my cost basis and up my dividend income. I'm currently down 14.49% with dividends on this.\n\nThose 3 are the only ones I'm net down on right now.\n\nMy biggest dividend winners on the other hand are:\n\n* ALB - Picked up during the peak of the COVID drop, up 65%. I really wish I had bought more back then given how many months I had waited for it to reach that price target. The EV/TSLA hype has pushed this stock up to absurd highs in my opinion. Unfortunately this is one of my smaller positions.\n\n* MCD - I consistently added to this before and during COVID while it was under $200. I'm up 27.68%, and they just raised the dividend a week ago. This is my 3rd biggest dividend investment.\n\n* JNJ - My largest dividend holding by far. Overall I'm up by only 10.32% with dividends, but that's because I've been DCAing into it a lot the last few months which lowered my overall ROI. My pre-COVID shares are up much more then that. Their dividend raise during COVID was a nice boost to my dividend income.\n\n* DUK - I picked this one up during COVID. All the acquisition talks involving them &amp; NEE has pushed me up to a 16.79% ROI. This is one of my larger holdings.\n\n* MSFT - Up 18.88% currently. I started buying in during COVID. I've been slowly DCAing into them each month so I can eventually turn this into a bigger position.\n\nI also have some that haven't really gone much of anywhere from start to now of COVID (though I did add more to portfolio during their COVID drops), including PEP, VZ, MMM, HON.",
        "created_utc": 1602804415,
        "id": "g8y7bq6",
        "score": 3,
        "subreddit": "investing",
        "created": 1602833215.0
    },
    {
        "author": "navyguy666",
        "body": "CSCO last earnings is my biggest loss ever\n\n 99% loss after the massive earnings dip that still hasn’t recovered. Shit volume on options so I had to hold it until it expired with a 99.8% loss mocking me for 2 weeks lol\n\nBad outlook on the company. Can’t make money during covid. Look at their earnings sheets voip is a very small earner for them, they make most of their money on hardware which is declining.  Look at companies like SAP and IBM absolute garbage grandpa stocks. I’d stay away but if you believe the garbage you’re spouting go ahead and hold",
        "created_utc": 1603823538,
        "id": "gaarlgg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1603852338.0
    },
    {
        "author": "The_Folkhero",
        "body": "The only way you can utter IBM and the word \"cloud\" is if you say \"IBM has its head in the clouds if they think they can compete as being a cloud infrastructure play.\" \n\nGoogle Cloud Services has been throwing a ton of money and smart people at cloud for a while and they still have a long way to sit close to the head of the table of AWS and Azure. \n\nThe pace of innovation moves at the speed of pondwater at IBM and this effort is too little too late. Sell, sell, and then sell it again when you're done.",
        "created_utc": 1602207876,
        "id": "g86b47y",
        "score": 3,
        "subreddit": "investing",
        "created": 1602236676.0
    },
    {
        "author": "bigkev2569",
        "body": "10/23 IBM 150c",
        "created_utc": 1602712175,
        "id": "g8u7mm8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602740975.0
    },
    {
        "author": "bbbpppccc",
        "body": "Me right now with my -90% losses on IBM.  \nIt's not a loss until I sell",
        "created_utc": 1603214417,
        "id": "g9g9s42",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1603243217.0
    },
    {
        "author": "Flat-Principle",
        "body": "“is there really any reason not to invest everything into Cisco or IBM?”\n\npeople a couple short decades ago",
        "created_utc": 1602563406,
        "id": "g8nx4oh",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1602592206.0
    },
    {
        "author": "Shacreme",
        "body": "Just wondering, what the fuck does IBM do?",
        "created_utc": 1602889040,
        "id": "g91unkn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602917840.0
    },
    {
        "author": "Jimtonicc",
        "body": "Up 10k today, thanks IBM",
        "created_utc": 1604090407,
        "id": "gamy16l",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604119207.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Buy XOM and IBM calls too",
        "created_utc": 1601772975,
        "id": "g7l789d",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601801775.0
    },
    {
        "author": "thalassamikra",
        "body": "Ironically IBM has an Indian CEO now",
        "created_utc": 1603397984,
        "id": "g9ooeen",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1603426784.0
    },
    {
        "author": "MichaelBurryScott",
        "body": "Usually as in more than 50% of the time? Sure.\n\nBut the remaining times you would be better off selling your shares right away.\n\nLet's take an example. Imagine you own 100 shares of IBM. You can sell the shares now for $115.76 each.\n\nOr, you can sell an ITM call (let's say you sell the $110 call expiring on 11/20 for $6.75). Here are the possible scenarios with the call:\n\n1. **IBM is at or above $110 on 11/20:** you sell your shares for $110, and you keep $6.75 of premium. Which means you effectively sold your shares at $116.75 ($0.99 more than just selling your shares right away).\n2. **IBM closes between $110 and $109.01 on 11/20:** You keep your shares (which you can sell them right then at $109.01-$110) And you keep your $6.75 premium, which means you can make $0.00-$0.99 more per share than just selling the shares out right today.\n3. **IBM closes below $109:** You keep the shares and the premium. But now when you sell the shares at $109 or below, you lost money. For example, if IBM closes at $105, then you sell your shares at $105 and you kept the $6.75 premium which means you effectively sold your shares at $111.75 (instead of selling them at $115.75 today).\n\nYou can see that in case 3 the shares can drop dramatically. The question is what are the chances of each of these cases? Here are what the Black-Scholes model gives:\n\n1. Probability of IBM closing above $110 is 78%.\n2. Probability that IBM closes between $109 and $110 is around 3%.\n3. Probability that IBM closes below $109 is around 19%.\n\nThere is a 9% probability that IBM closes at $105 or below. This is a large enough probability to make you doubt taking that risk and locking up $11576 for 30 days just to make an extra $99 of potential extra gain. Like I said, there is no guaranteed profit. Options are priced pretty fairly such that every profit comes with a comparable risk.\n\n&amp;#x200B;\n\nPS, the reason I chose IBM is they're a large enough company that already had their earnings out, so the options prices would reflect regular pricing and not include any earnings inflated IV.",
        "created_utc": 1603427594,
        "id": "g9q9c3d",
        "score": 3,
        "subreddit": "options",
        "created": 1603456394.0
    },
    {
        "author": "silverbugoutbag",
        "body": "These fuckin boomers are playing IBM PFE and even Citigroup in bull call spreads what the fuck guys is this supposed to be sector rotation or somethin",
        "created_utc": 1603237587,
        "id": "g9hn2oh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1603266387.0
    },
    {
        "author": "TrissYenbestcouple",
        "body": "Why did you have IBM to begin with?",
        "created_utc": 1602191986,
        "id": "g85hv13",
        "score": 3,
        "subreddit": "investing",
        "created": 1602220786.0
    },
    {
        "author": "xxjoker122",
        "body": "IBM, coco cola, Procter gamble,Exxon,Clorox \nKellogg,\nAll\nOver 100 years old. And that’s just on top of my head.",
        "created_utc": 1602558416,
        "id": "g8npkda",
        "score": 3,
        "subreddit": "stocks",
        "created": 1602587216.0
    },
    {
        "author": "trader9899",
        "body": "IBM is a boomer stock that is trying to be relevant I think this is a sell the pop play as it’s on a multi year down trend. It pay good dividend so its in a lot of boomers portfolio but the stock itself imho it’s a put on any upward movement. A better play would be long semi conductor on dip.",
        "created_utc": 1602559537,
        "id": "g8nrglf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602588337.0
    },
    {
        "author": "bigkev2569",
        "body": "IBM",
        "created_utc": 1602685925,
        "id": "g8srw60",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602714725.0
    },
    {
        "author": "dwdsquared2",
        "body": " https://twitter.com/DeItaone/status/1321856032981815296?s=20 \n\n [**$IBM**](https://twitter.com/search?q=%24IBM&amp;src=cashtag_click) Insider Buys",
        "created_utc": 1603990296,
        "id": "gai9c3v",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604019096.0
    },
    {
        "author": "BigPhotojournalist34",
        "body": "They couldn’t manage one company, IBM was the worst-performing large-cap tech stock during Rometty's tenure. What makes you believe they will properly manage two separate companies. Sold IBM at 180 long time ago and never go back.",
        "created_utc": 1602199195,
        "id": "g85vsnr",
        "score": 2,
        "subreddit": "investing",
        "created": 1602227995.0
    },
    {
        "author": "daytrader987654321",
        "body": "I’ve been slowly selling stuff but I’m stuck with LYFT and IBM now",
        "created_utc": 1602177087,
        "id": "g84jwqw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602205887.0
    },
    {
        "author": "papabear570",
        "body": "I don’t know but either way this will be good for IBM.",
        "created_utc": 1602177246,
        "id": "g84k8fm",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1602206046.0
    },
    {
        "author": "Lewsor",
        "body": "IBM doc for anything but the simplest of tasks is usually atrocious.\n\nAnyways, to be realistic, I don't see mainframes/DB2 ever going away, or at least not in the short term, because none of the largest customers are ever going to want to sink in the time and money to migrate to a different platform. There have been more failed migrations off mainframe than successful ones, not to mention the headache of replicating security setups off the mainframe.\n\nThere's also been a serious (and smart IMO) push to make things more accessible, and modernizing things. Linux, java, nodejs, spark all exist on the mainframe now.",
        "created_utc": 1602276654,
        "id": "g8945r6",
        "score": 2,
        "subreddit": "investing",
        "created": 1602305454.0
    },
    {
        "author": "rhoadsalive",
        "body": "IBM to the moon",
        "created_utc": 1602447638,
        "id": "g8itc67",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1602476438.0
    },
    {
        "author": "woahwoahwoahokay",
        "body": "You’re fucked. GOOGL has turned into IBM.",
        "created_utc": 1601844876,
        "id": "g7q05g8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601873676.0
    },
    {
        "author": "learningorsomething",
        "body": "IBM interest me as well.\n\nThe news of them spinning off into two companies though makes me feel like I have no idea if strong earnings makes them appealing, or if that element of uncertainty is too big a wall.",
        "created_utc": 1602963232,
        "id": "g94rvh4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602992032.0
    },
    {
        "author": "KingDongTinyHands",
        "body": "Mandelbrot is dead. Who cares about IBM.",
        "created_utc": 1603081228,
        "id": "g9allgy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603110028.0
    },
    {
        "author": "skilliard7",
        "body": "There are a lot of smaller tech companies in the SP500 that you might not be aware of, it's just that the biggest players people pay attention to are Amazon/Microsoft/Apple/Google/Maybe Facebook(although they didn't IPO until 2012)\n\nJuniper Networks, Cisco, Nvidia, IBM, etc.",
        "created_utc": 1602973838,
        "id": "g95e4t9",
        "score": 2,
        "subreddit": "investing",
        "created": 1603002638.0
    },
    {
        "author": "CarRamRob",
        "body": "This stock has a higher market cap than XOM, Union Pacific, Eli Lilly, Lowe’s, IBM, Lockheed Martin, Phillip Morris, Starbucks, 3M etc. Just because something “can” grow the market is being wholly irrational about where that growth ultimately ends. \n\nI posted this in a similar thread, but who is investing in this company thinking they should be as valued as those listed companies? Even if Covid lifestyle was permanent, their earnings would have to grow 5x to get to a respectable P/E. Against that, it could be argued that they likely will never see as a committed customer base to work from home as now, and their earnings in the next decade cannot match what they will get in the next year. \n\nThen there are many competitors in an environment that one of their competitors controls (Workplace software - Microsoft). \n\nEasily this stock will come crashing down. When?  Matters what happens with covid",
        "created_utc": 1603234394,
        "id": "g9hhi0t",
        "score": 2,
        "subreddit": "investing",
        "created": 1603263194.0
    },
    {
        "author": "ChingityChingtyChong",
        "body": "Exactly. Microsoft good ibm bad",
        "created_utc": 1603509391,
        "id": "g9uffo5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603538191.0
    },
    {
        "author": "supermoore1025",
        "body": "That's like in 6 days.  U really think IBM is about to move that much?",
        "created_utc": 1602958246,
        "id": "g94ibbu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602987046.0
    },
    {
        "author": "OneOfDozDeservesGold",
        "body": "Nah, it's alive and kicking. If anything this is IBM trying to become Red Hat.",
        "created_utc": 1602803335,
        "id": "g8y5h24",
        "score": 2,
        "subreddit": "investing",
        "created": 1602832135.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "Intel, IBM and GE - Boomer's hat trick",
        "created_utc": 1603401238,
        "id": "g9ow0kd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603430038.0
    },
    {
        "author": "Tetkobear",
        "body": "I might double up on IBM. Had some insider activity a few days ago that has been bleeding and now it’s climbing back up for earnings next week",
        "created_utc": 1602686650,
        "id": "g8st9e1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602715450.0
    },
    {
        "author": "Kashm11r",
        "body": "I'll cut them some slack with some positives. They have over 3 times the money they need to service their existing debt which would allow them to sustain the net few years of operations without issue. They have a superior product to Microsoft and portfolio of services that appeal more to the user. Microsoft is only a serious threat because they can afford to provide Teams for free and subsidize that cost through their other revenue streams. Slack's current P/S ratio is under 23 and P/B ratio is under 21. They have a revenue retention rate of over 125% and target smaller businesses with greater appeal than Microsoft while still having a wide customer base among the large corporations including Shopify, IBM, Lyft, BBC, Intuit, Splunk, Fastly, RBC, Newscorp, Hubspot, TD Ameritrade, Vodafone, Target, Jet, Hello Fresh, NASA, Liberty Mutual, NBC, Buzzfeed, Turner, Nasdaq, Walmart, Nike, McKinsey, T-Mobile, Comcast, Airbnb, NY Times and many more. Ark Invest is bullish on this company and it is the 7th largest holding in their Inovation ETF and the 6th largest holding in their Next Generation Internet ETF. People may not like to root for the underdog when it comes to the stock market and monopolistic behemoth tech companies like Microsoft, but I like the idea of rooting for the smaller players with superior products and services that are trying to provide in a new market segment. Slack is also posting over 50% revenue growth this year and should post over 35% revenue growth next year.",
        "created_utc": 1603330626,
        "id": "g9lse3d",
        "score": 2,
        "subreddit": "stocks",
        "created": 1603359426.0
    },
    {
        "author": "infinitelimits00",
        "body": "Lol IBM is lower than summer of 1999.",
        "created_utc": 1603917513,
        "id": "gaf49fo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603946313.0
    },
    {
        "author": "Jimtonicc",
        "body": "IBM with retard strength today",
        "created_utc": 1604071604,
        "id": "galwf2g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604100404.0
    },
    {
        "author": "E5150_Julian",
        "body": "If the New IBM is mostly Red Hat with old IBM sprinkled in, is there really a difference?",
        "created_utc": 1602261439,
        "id": "g88bl7s",
        "score": 2,
        "subreddit": "investing",
        "created": 1602290239.0
    },
    {
        "author": "blacklassie",
        "body": "If you own IBM shares as of the record date, you will automatically receive shares in the spin off. In this case, I don't know if IBM has set the distribution ratio yet (e.g. - for every 1 IBM share, you'll receive X shares in the new company). The shares in the spin off should automatically appear in your brokerage account. \n\nHow this affects IBM's share price is unclear. Technically, the spin off reduces IBM's book value, but investors may see the move as a positive catalyst and price the shares accordingly. \n\nOnce the spin off shares are posted to your account, check the cost basis for the spin off shares and IBM. The combined cost basis for both companies should equal your cost basis for IBM before the spin off.",
        "created_utc": 1602171171,
        "id": "g84800x",
        "score": 2,
        "subreddit": "investing",
        "created": 1602199971.0
    },
    {
        "author": "skilliard7",
        "body": "&gt; I won't disagree with you except to say you make money based on investor sentiment not the underlying numbers. That's why Tesla is Tesla.\n\nIn the short term, yes, returns are based on sentiment, but in the long term, you make money based on the numbers. You only profit off of sentiment if you sell before sentiment changes.\n\nToday's 8%(now closer to 5%) boost in prices was me profiting based off of sentiment. I bought into IBM a few weeks ago because they seemed relatively cheap for their industry in terms of P/E and had a lot of businesses \"locked in\" to their software. I sold today because the stock went up 8% for little reason and seems due for a correction.",
        "created_utc": 1602171932,
        "id": "g849iwy",
        "score": 2,
        "subreddit": "investing",
        "created": 1602200732.0
    },
    {
        "author": "reaper527",
        "body": "FTA:\n\n&gt;The proposed separation is expected to be effected through a pro-rata spin-off to IBM\nshareowners that will be tax-free for U.S. federal income tax purposes. The transaction is \nsubject to customary closing conditions, including Form 10 registration with th\ne U.S. Securities \nand Exchange Commission, receipt of a tax opinion from counsel, and final approval by \nIBM\n’s \nBoard of Directors. The separation is currently expected to be completed by the end of 2021.  \n\nso does this basically mean that it's kind of like a stock split, but if someone owned 100 shares before the spinoff instead of turning to say 400 shares (in the event of a 4:1 split) it turns into X shares of ibm and Y shares of the new company (with X and Y being arbitrary numbers derived by some IBM approved formula)",
        "created_utc": 1602181588,
        "id": "g84t5w1",
        "score": 2,
        "subreddit": "stocks",
        "created": 1602210388.0
    },
    {
        "author": "KetaBoy123",
        "body": "BABA ASML JD BEP and since today IBM are the only stocks I own. I am a fucking genius. Convince me otherwise.",
        "created_utc": 1602187816,
        "id": "g857ua6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602216616.0
    },
    {
        "author": "shadowpawn",
        "body": "$IBM?",
        "created_utc": 1602966880,
        "id": "g94zjuj",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1602995680.0
    },
    {
        "author": "JG-Goldbricker",
        "body": "IBM long into earnings Monday.\n\nA heel ta da bawls...",
        "created_utc": 1602984179,
        "id": "g95yucc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603012979.0
    },
    {
        "author": "SolitaryEgg",
        "body": "IBM*",
        "created_utc": 1602611496,
        "id": "g8povxa",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602640296.0
    },
    {
        "author": "Funny_Story2759",
        "body": "I feel like ibm has been underperforming i think more ppl will pull out at earnings.",
        "created_utc": 1603071526,
        "id": "g9a6bpa",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603100326.0
    },
    {
        "author": "bobthedestroyers",
        "body": "Do not say you know it will go back up. You are extrapolating. IBM was the Apple/Microsoft/Google of its day. In the late 60s, IBM was worth over a trillion in today's dollars.... now look at it.",
        "created_utc": 1603259841,
        "id": "g9il8ox",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603288641.0
    },
    {
        "author": "daytrader987654321",
        "body": "LYFT and IBM would like a word sir...",
        "created_utc": 1602517440,
        "id": "g8llx1e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602546240.0
    },
    {
        "author": "justanoththrowaway94",
        "body": "If IBM misses should we be worried about other cloud stocks?",
        "created_utc": 1602885515,
        "id": "g91omh8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602914315.0
    },
    {
        "author": "awxiety",
        "body": "Why is $AAPL such a shit stock now is it like $IBM? Too big of a whale now and no longer a growth stock?",
        "created_utc": 1602788477,
        "id": "g8xd9s7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602817277.0
    },
    {
        "author": "Jimtonicc",
        "body": "Ok Boomers, I’m loading up on IBM.",
        "created_utc": 1603306028,
        "id": "g9kgshm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603334828.0
    },
    {
        "author": "skat_in_the_hat",
        "body": "Why are you hard set there? Diversify. IBM got kicked in the dick today, seems like its a good price. Especially considering the dividend.",
        "created_utc": 1603332044,
        "id": "g9luujv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1603360844.0
    },
    {
        "author": "fjik1623",
        "body": "IBM. They are leading the development in blockchain, they have 100s of patents and have built an entire infrastructure around hyperledger fabric which is the blockchain tech that virtually all the major companies will build on",
        "created_utc": 1603653716,
        "id": "ga3a0wq",
        "score": 2,
        "subreddit": "investing",
        "created": 1603682516.0
    },
    {
        "author": "HackJandie",
        "body": "SA has articles on IBM constantly.  Best is the Boomers telling me how IBM is their cloud play lol.",
        "created_utc": 1604019007,
        "id": "gajxycp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604047807.0
    },
    {
        "author": "carlos5577",
        "body": "Buy some XLE It is cheap and XOM is the future. Also buy INTC, IBM, CSCO, and CTXS",
        "created_utc": 1603432938,
        "id": "g9qfwr7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603461738.0
    },
    {
        "author": "duathman",
        "body": "Wow IBM finally caught a bid.  It was acting worse than a boomer stock whatever that might be.  Absolute trash",
        "created_utc": 1603390068,
        "id": "g9o5vr1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603418868.0
    },
    {
        "author": "daytrader987654321",
        "body": "That’s what I thought after IBM tanked.",
        "created_utc": 1603397521,
        "id": "g9on9xp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603426321.0
    },
    {
        "author": "g_bab",
        "body": "My IBM 2020-11-27 119 calls are fuckin me in the ass rn",
        "created_utc": 1603826682,
        "id": "gaay7x8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603855482.0
    },
    {
        "author": "BakGikHung",
        "body": "Yes and no one ever got fired for buying IBM.",
        "created_utc": 1603754719,
        "id": "ga7vjab",
        "score": 2,
        "subreddit": "investing",
        "created": 1603783519.0
    },
    {
        "author": "Artistic-Chemical-74",
        "body": "your assuming perfect execution and lack of competition , IBM was once the computer giant. were in the early days of EV, it could happen. But I wouldnt be placing bets on it, so to answer your questions, stuff goes wrong and competition",
        "created_utc": 1601678588,
        "id": "g7gi7p6",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601707388.0
    },
    {
        "author": "PennerBrody",
        "body": "Try checking out IBM and the tech sector, they're somewhat related so that might help? Depends on how hard you search though lol",
        "created_utc": 1601666781,
        "id": "g7fmf3s",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601695581.0
    },
    {
        "author": "belicee12",
        "body": "i wouldnt be surprised if ibm crashed 30 percent after earnings",
        "created_utc": 1603080124,
        "id": "g9ak4at",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603108924.0
    },
    {
        "author": "Abstractsource",
        "body": "Tomorrow Plays!!! Will take me to a gated community or woods. \n\nWhirlpool Calls\n\nTesla calls\n\nIBM puts\n\nNetflix puts\n\nNIO 10/23 32C",
        "created_utc": 1603081521,
        "id": "g9alz78",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603110321.0
    },
    {
        "author": "navyguy666",
        "body": "EARNINGS ON IBM AND PHILLIP MORRIS? 🤣🤣🤣🤣🤣 hahahahahaha",
        "created_utc": 1603393786,
        "id": "g9oe7kp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603422586.0
    },
    {
        "author": "myglasstrip",
        "body": "That's why I'm long IBM still. People wrote them off but they'll be back!",
        "created_utc": 1603437713,
        "id": "g9qkt5j",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603466513.0
    },
    {
        "author": "Kfilllla",
        "body": "I did a consulting project for IBM. Jesus fucking christ it was insane the processes and systems they were using",
        "created_utc": 1603341475,
        "id": "g9m9bbu",
        "score": 2,
        "subreddit": "investing",
        "created": 1603370275.0
    },
    {
        "author": "proret4rd",
        "body": "Intel the new IBM",
        "created_utc": 1603398913,
        "id": "g9oqlc4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603427713.0
    },
    {
        "author": "BabySniffingAyniss",
        "body": "GM or IBM. Or tsla if u have the balls",
        "created_utc": 1603256275,
        "id": "g9ih28f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603285075.0
    },
    {
        "author": "suckfail",
        "body": "It's worse than that, this is the 9th consecutive quarter of flat or declining sales.\n\nhttps://www.bnnbloomberg.ca/ibm-shares-slip-on-quarterly-sales-decline-no-outlook-1.1510184",
        "created_utc": 1603235667,
        "id": "g9hjqqu",
        "score": 2,
        "subreddit": "investing",
        "created": 1603264467.0
    },
    {
        "author": "bigkev2569",
        "body": "IBM $150c on recent news",
        "created_utc": 1602468114,
        "id": "g8jwmkp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602496914.0
    },
    {
        "author": "USFederalReserve",
        "body": "Yeah, you're missing the fact that IBM doesn't plan on doing this until 2021/2022.",
        "created_utc": 1602451035,
        "id": "g8j13m2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602479835.0
    },
    {
        "author": "bimm42",
        "body": "When I look up those three mutual funds it looks like they have the same top holdings...weird.  If this is in a tax advantaged account like an IRA you might want to swap out those high expense ratio mutual funds and bulk up the holdings of the Vanguard ETFs that you have and maybe some VTI or VOO.    \nWhat is FIDS?  I don't see any results when I look up that ticker.  \nThe top 3 holdings in TDIV are IBM INTC CSCO which are all companies that have not been doing well lately.  Trying to get dividends out of tech stocks is sort of an oxymoron.  Take a look at SCHD instead of TDIV.  \nOn another note, your dad is the man!  Great job getting you on your way.",
        "created_utc": 1603915137,
        "id": "gaez99n",
        "score": 2,
        "subreddit": "stocks",
        "created": 1603943937.0
    },
    {
        "author": "shortedurmomat420",
        "body": "Do you mean in the year 2125? I don't understand. IBM? Look outside, is it 1979?",
        "created_utc": 1603738107,
        "id": "ga6z87r",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603766907.0
    },
    {
        "author": "GuiBz123",
        "body": "Markets are forward looking. What do you project for Intel IN THE FUTURE? They fell behind technologically against AMD. Sure, they plan to reach AMD by 2022, but by that time, maybe AMD would have taken 2 more additional steps ahead. Apple have confirmed that they will use their own chip, so no more Intel in every Iphone, it is a big hit. Their last Q3 earnings are disappointing. What do expect for the future of that tech dinosaur company? I honestly don't see anything bright, and that's why the company is trading at a low price earning.\n\n15 years ago, if I would have asked you, what are the solid tech companies for the future? You may have said IBM, Blackberry, Samsung, SONY, Intel, and Microsoft. The clear winners is Microsoft, the rest is so so. New companies like Google, Apple,  Facebook took the lead. It is a bit like AMD vs Intel, the new competitor managed to bypass the giant dinosaur.",
        "created_utc": 1603840661,
        "id": "gabq4to",
        "score": 2,
        "subreddit": "investing",
        "created": 1603869461.0
    },
    {
        "author": "AnotherThroneAway",
        "body": "&gt; are used to it, it's what will be used.\n\nThat just doesn't last, though. Quark used to have an ironclad monopoly on publishing and layout, then Adobe bought/developed InDesign, and Quark went from 95% market share to 0% (nobody takes their files) inside a decade. \n\nHP, IBM, Oracle...the world is already full of tech dinos on their way out. An event like Covid could just seal their fate. \n\nSo yeah, anybody thinking about it, don't buy SAP, when there are such dynamic alternatives to put your money.",
        "created_utc": 1603742304,
        "id": "ga77uqa",
        "score": 2,
        "subreddit": "investing",
        "created": 1603771104.0
    },
    {
        "author": "daytrader987654321",
        "body": "Lol love how IBM decided to be green on the worse day, after fucking me for 2 weeks",
        "created_utc": 1604072765,
        "id": "galyquh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604101565.0
    },
    {
        "author": "DarkDoomDoom",
        "body": "Intel is the IBM. They will not crash but will be a joke in the tech industry.",
        "created_utc": 1602069538,
        "id": "g7zpvss",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602098338.0
    },
    {
        "author": "meritorius_demotion",
        "body": "Boomer classic: ge\n\nBoomer lite: ibm",
        "created_utc": 1601987753,
        "id": "g7w0d32",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602016553.0
    },
    {
        "author": "daytrader987654321",
        "body": "What the hell IBM!?! I was considering buying it yesterday :(((",
        "created_utc": 1602159447,
        "id": "g83nu16",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602188247.0
    },
    {
        "author": "SealCub-ClubbingClub",
        "body": "Imagine basing this months price action on TA when everything is going to be driven by the news cycles around 2 events. I'm waiting for AMD moon this month because their 2 significant product launches are not sufficiently priced in.\n\nWhy do I say that? Look at any \"investing\" comments section on AMD and all they will talk about is how AMD is overpriced because their P/E is 160 lol or AMD is just another overvalued tech company like Tesla. Completely ignoring the fact that AMD's 2 direct competitors are like &gt;2X and &gt;3X the market cap and now have products that AMD either straight up beat or directly compete with. They look at trailing market shares in laptops, datacentre, GPU when AMD's products were inferior while ignoring the fact that AMD's products are now good enough that they can sell as many chips as TSMC give them. TSMC capacity is literally AMD's only constraint on how much product they can sell for the next year+ and fortunately AMD have an absolute tonne of N7P wafers this year and N5 wafers lined up in 2021.\n\nAll the talk has been about consoles, yet in terms of profit per wafer they are probably the worst product AMD are producing right now, I'm sure Zen3 will make them waaay more per wafer.\n\nZen 3 - 8th\n\nThe tech community have known for a long time that Zen 3 IPC and clock uplifts will take the single-thread crown from Intel, however the price only started to move with the recent leaks that add weight to these rumours. However everyone's news feeds on Oct 9th are going to be full of articles and youtube videos like \"AMD finally beat Intel in gaming\" \"AMD CPUs better at every price point\" \"AMD to dominate desktop, mobile and sever into 2021\" and there is no way the price isn't jumping when that happens.\n\nRDNA 2 - 28th\n\nAgain anyone following it knows that RDNA 2 is going to be competitive with the 3070 and 3080 in terms of performance, but I don't think this is sufficiently priced in - I think the market expects better performance/$ and performance/watt and maybe competition at the low-mid tier (which is AMD's normal spot) but I don't think they appreciate AMD will offer 4K-viable cards. I think people aren't appreciating the fact AMD will have decent supply and decent driver support this time around so this will be followed with headlines like \"6900 is about the same as a 3080 and you can actually buy one now!\" \"6900 gives similar performance but doesn't require a nuclear power station to run\" \"Don't bother waiting for a 3070, spend $100 extra and get 15% better performance with a 6900\" etc..\n\nThese events (+the leaks that come before them and the commentary that follows them) are going to dominate the price action this month and I don't see how TA helps with that. Last weeks action was all about the 5800X AotS benchmark leaks - without knowing when future leaks are coming I don't see how we can predict any specific movements.\n\nMarch 21 95C, 100Cs",
        "created_utc": 1601853091,
        "id": "g7qf0sp",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1601881891.0
    },
    {
        "author": "MadMadMad2018",
        "body": "So Lisa Su walks out tomorrow and says that their next gen CPU's are 100x more powerful than that Intel shit and also half the cost. AMD stock immediately rockets to 300 dollars, and we all retire. \n\n&amp;#x200B;\n\nOr the event is underwhelming and the stock drops in which case I hope you all like bread sandwiches.",
        "created_utc": 1602103160,
        "id": "g81gicn",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1602131960.0
    },
    {
        "author": "HWL_Nissassa",
        "body": "AMD is about to shit on NVDA and INTC in the same month.",
        "created_utc": 1601856118,
        "id": "g7qk4m9",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1601884918.0
    },
    {
        "author": "MathFerret1013",
        "body": "This is a chip company that cant fab 5 year old shit. Oh look another 10nm delay from today https://www.kitguru.net/components/cpu/joao-silva/intel-is-reportedly-delaying-the-ice-lake-sp-10nm-processor-architecture-again/\n\nHow the fuck are they going up when they can't even ship their own chips? Do you have any idea how hard it is to change process nodes even if tscm will take them on? We're talking months. They seriously threw around the idea of having someone else to fabs their own chips ON AN EARNINGS CALL. This is like microsoft having to get apple to wrote their software because they can't figure it out! This is the actual situation for Intel.\n \nFuck you buy more puts.\n\nEDIT:\nTake a look at Intel's cash flow: https://finance.yahoo.com/quote/INTC/cash-flow?p=INTC\n\nRepurchase of Capital Stock going up? This is bullshit, this is a pump and dump by intel execs.",
        "created_utc": 1602039359,
        "id": "g7yt43i",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1602068159.0
    },
    {
        "author": "JustYourNormalGuy",
        "body": "Did intel hurt you as a child",
        "created_utc": 1602037520,
        "id": "g7ypzjl",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1602066320.0
    },
    {
        "author": "marinesol",
        "body": "In my heart Im hoping that intel, apple and micrsoft drop like 10% so I can make a couple grand, but in my brain I feel like Ill make at most 20$.",
        "created_utc": 1601620568,
        "id": "g7dkf7y",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1601649368.0
    },
    {
        "author": "Berrymore13",
        "body": "Why are you guys selling your AMD calls? If they expire in November or later like they should if you weren’t retarded, this is just the beginning. October is the month that AMD kicks Intel in the nuts, and then knees them in the nose",
        "created_utc": 1601930994,
        "id": "g7ttzv9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1601959794.0
    },
    {
        "author": "Ryankinsey1",
        "body": "All the boomers without twitter like, \"WTF Happened?! My Intel , Exxon, and GE calls just shit themselves\"",
        "created_utc": 1602011891,
        "id": "g7xcz78",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1602040691.0
    },
    {
        "author": "SealCub-ClubbingClub",
        "body": "Where have you been? PE is like 160 now, although it's completely irrelevant right now. All that matters is what share AMD will take from Intel / Nvidia. I think we could easily see 30% in a year or 2 considering AMD have better/directly competing products.\n\nIf there is a semiconductor correction I'm more worried about the 2 companies worth 550bn with similar products than the one worth 100bn.",
        "created_utc": 1601854980,
        "id": "g7qi7l7",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1601883780.0
    },
    {
        "author": "cranial_pudding",
        "body": "Imagine going long INTC after Steam reported AMD is taking 1% market share a month",
        "created_utc": 1601859443,
        "id": "g7qptw1",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1601888243.0
    },
    {
        "author": "Reden95",
        "body": "INTC. Intel makes 40 bn a yr, spends 13 bn in R&amp;D and 20 bn on buybacks. Somehow their marketcap is 200bn. Once they figure out their 7nm process I believe they will soar to 500 billion.",
        "created_utc": 1601932907,
        "id": "g7tyk8l",
        "score": 7,
        "subreddit": "stocks",
        "created": 1601961707.0
    },
    {
        "author": "notyetcomitteds2",
        "body": "When I was in grad school, had 3 marines in my group and yeah, they told me they googled most shit.  Figured they had high level military produced intel and stuff, but no, Google.  Mostly the cia world Factbook. One dude was an interrogator and said thats how he learned about culture.",
        "created_utc": 1601583000,
        "id": "g7bpugx",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1601611800.0
    },
    {
        "author": "MathFerret1013",
        "body": "Oh that thing? DELAYED! [https://www.nytimes.com/2020/08/27/technology/intel-aurora-supercomputer.html](https://www.nytimes.com/2020/08/27/technology/intel-aurora-supercomputer.html)  \n\n\nFUCK YOU TOO! MORE PUTS!",
        "created_utc": 1602039798,
        "id": "g7ytuwi",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1602068598.0
    },
    {
        "author": "drnick5",
        "body": "The problem is, how long does this \"Strategic funk\" last?     \n\nIntel has been stagnant for YEARS now, being stuck on 14nm, while AMD has closed the performance gap. That doesn't seem to be coming to an end anytime soon either given all the delays they've had. Last they said, they won't have 7nm chips out until 2022! At that point, AMD will be rolling out 5nm chips.      \n   \nThen you can talk about the multiple security vulnerabilities they've had with in their chips, with their only solution being \"Turn off hyper treading, that will fix it\". Eventually they released some fixes, but this also hurt CPU performance. \n\nI'm not going to say INTC is a sinking ship or anything, I just don't really see them as being that undervalued.",
        "created_utc": 1601573117,
        "id": "g7b2cmv",
        "score": 6,
        "subreddit": "stocks",
        "created": 1601601917.0
    },
    {
        "author": "ReversalTheory",
        "body": "TSM, manufacturer of AMD and intel chips has earnings on Oct 15. Ran up 15% two weeks leading up to last earnings",
        "created_utc": 1601658098,
        "id": "g7f2vr9",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1601686898.0
    },
    {
        "author": "JRCee",
        "body": "https://www.notebookcheck.net/Intel-Tiger-Lake-H-Alder-Lake-P-and-Alder-Lake-S-detailed-Alder-Lake-to-offer-up-to-8C-16T-configs-with-Xe-LP-DDR5-4400-RAM-Wi-Fi-6E-and-PCIe-Gen5-support.496197.0.html\n\n$AMD leaks... $90 EOD.",
        "created_utc": 1601911008,
        "id": "g7sna1l",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1601939808.0
    },
    {
        "author": "undermon",
        "body": "Pentagon announcing alien-related intel tomorrow at 11am. Book it",
        "created_utc": 1602053015,
        "id": "g7zbau7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1602081815.0
    },
    {
        "author": "worryie",
        "body": "AMD. The new CPU’s are gonna throat fuck intel and their GPUs are gonna be super competitive with nvidia.",
        "created_utc": 1601854335,
        "id": "g7qh4py",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1601883135.0
    },
    {
        "author": "dreammanalishi",
        "body": "I concur on INTC.\n\nhttps://finance.yahoo.com/screener/predefined/undervalued_growth_stocks/?offset=0&amp;count=100\n\nhttps://finance.yahoo.com/screener/predefined/undervalued_large_caps/?offset=0&amp;count=100",
        "created_utc": 1601933022,
        "id": "g7tyty7",
        "score": 6,
        "subreddit": "stocks",
        "created": 1601961822.0
    },
    {
        "author": "pgh1979",
        "body": "INTC is USA's National Champion Semi manufacturer. Noone else manufactures in the US so expect a multi billion dollar bailout for INTC",
        "created_utc": 1602039659,
        "id": "g7ytmbm",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1602068459.0
    },
    {
        "author": "HalleysComet41",
        "body": "&gt;This is a chip company\n\nhahahahahaha dumbass intel does so much more than chips and may even move away from chips (chip fab, for sure) in the future\n\nmy desktop at home is 100% amd btw.",
        "created_utc": 1602039946,
        "id": "g7yu3ra",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1602068746.0
    },
    {
        "author": "Swayyyettts",
        "body": "If you think TSM is anywhere close to any of these stocks, I feel bad for you.  All the greatest chips are made by TSM and they’ve literally got the most advanced processes in the world.  Look up “largest semiconductor company in the world” on Google and it’ll be TSM because their market cap is over $400 billion.  In comparison, Intel is $224 billion and AMD is  $100 billion.\n\nLet’s put it this way: if you’re pumping AMD and Apple, but short on TSM, you’re literally betting on red AND black at the roulette table.",
        "created_utc": 1602113289,
        "id": "g81zwhf",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1602142089.0
    },
    {
        "author": "MathFerret1013",
        "body": "I'll tell you what you pathetic excuse for a mis-aborted fetus.  This right here sums up your whole fucking post.\n\n&gt;I don't know what they're doing with data trafficking and I frankly don't care.\n\nNo shit you don't care, you don't understand anything about this industry and this is why all you did was quote a bunch of garbage finance crap without saying anything regarding Intel's core business model. You sound almost as full of shit as Bob Swan himself.\n\nThey are currently 4-5 years behind in their core business and not competitive in their other segments. They have a ton of cash and they will keep using it to try and spend themselves out of this mess while they suffer delay after delay. By the time they even have EUV basics figured out TSMC will likely be producing 3nm chips.\n\nWhat does this mean? Dramatically lower power consumption (\\~ 25%) especially in the mobile sector. With the advent of 5G applications, better power/performance ratio is everything for mobile which AMD will then take from intel too.\n\n[https://www.howtogeek.com/394267/what-do-7nm-and-10nm-mean-and-why-do-they-matter/](https://www.howtogeek.com/394267/what-do-7nm-and-10nm-mean-and-why-do-they-matter/)\n\nLearn about how these things are actually made and how this shit works and you will see clear as day, they have made EVERY wrong move. 4 years of stagnation and failure is not an accident. They are going in the shitter and their core business is on life support. They are fucked.",
        "created_utc": 1602049391,
        "id": "g7z7k0y",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1602078191.0
    },
    {
        "author": "alphuscorp",
        "body": "I want to bet on AMD this week, but I’m unsure about the rest of the market. Therefore I bought puts on Intel.",
        "created_utc": 1601864952,
        "id": "g7qz4kb",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601893752.0
    },
    {
        "author": "crackercider",
        "body": "Leaks claiming +25% single core performance, got intel sweating.",
        "created_utc": 1601659642,
        "id": "g7f6db9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601688442.0
    },
    {
        "author": "skaterkud",
        "body": "I bought 100 shares of intel at $50.71, will hold forever",
        "created_utc": 1601777549,
        "id": "g7lkipw",
        "score": 4,
        "subreddit": "stocks",
        "created": 1601806349.0
    },
    {
        "author": "Au_contraire_zippy",
        "body": "well exactly my reason for posting. to hear what other people think. here are some of my thoughts on the entire situation...\n\n1. the semiconductor impact\nbecause this is such a huge player in the markets at the moment between AMD, NVDA, INTC et al, could effect the entire Tech sector. It all pivots on TMC in Taiwan which makes it tricky.\n2. 3500 US companies are suing Trump for blocking China trade access. which implies US companies want to go to China not stay locked into US.\n3. DCEP Chinese digital currency, not mentioned but could challenge the global dollar in time.\n4. Democrats are going to be more aggressive than Trump towards China. They called him \"Uncle Donald\" at one point. friendly-ish, they likely respect his financial approach even if he is brash. I dont think US will be friendly if Dems get in, and the vibe towards China will get a lot colder and nastier. that is not good if they are losing the global cold trade war, then US will start to play dirty tricks. Hilary would have had us all in a war by now imo. psychopathic woman. maybe she is still pulling strings somewhere. I truly hope not.\n5. Propaganda machine that has been driving Anti-Chinese sentiment for months is working very well and that is a big worry as once China feel even more cornered, they will likely react more aggressively. US are the cause of this whole fiasco, not the Chinese, but we are being sold differently on that narrative because US are dirty war players. history upholds that truth.\n6. China gaining more economic power and US losing it globally would totally change the face of world economy and markets fundamentally to the point it is almost impossible to imagine what that future would look like and one big question - how far would US Government be willing to go to stop that happening? that is scary because historically US Govmt have no limits that they have not been willing to go to before, including killing their own in extremely large numbers.\n\nAnyway, how all that effects trade, we will only really know after the election. I was hoping other peeps might share their wisdom/thoughts here which was my reason for posting.",
        "created_utc": 1601945426,
        "id": "g7ulum9",
        "score": 4,
        "subreddit": "investing",
        "created": 1601974226.0
    },
    {
        "author": "COKEWHITESOLES",
        "body": "$50.84 for Intel??? Intel?? Hot damn.",
        "created_utc": 1601771756,
        "id": "g7l3duo",
        "score": 4,
        "subreddit": "stocks",
        "created": 1601800556.0
    },
    {
        "author": "dsdanieloh",
        "body": "Mr. Pence, please save my INTC calls.",
        "created_utc": 1602116110,
        "id": "g824xkk",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1602144910.0
    },
    {
        "author": "PassiveF1st",
        "body": "Why would you sell AMD this month at all?\n\n8th - ZEN 3 Presentation\n\n22nd - Intel Earnings\n\n27th - AMD Earnings\n\n28th - RDNA  2 Presentation",
        "created_utc": 1601925614,
        "id": "g7thsoz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601954414.0
    },
    {
        "author": "dwdsquared2",
        "body": " [https://twitter.com/DeItaOne/status/1313871771557392394?s=20](https://twitter.com/DeItaOne/status/1313871771557392394?s=20)\n\n INTEL CORP SAYS \"ROCKET LAKE\" 11TH GENERATION DESKTOP PROCESSOR CHIPS WILL LAUNCH IN FIRST QUARTER OF 2021 - BLOG POST",
        "created_utc": 1602086440,
        "id": "g80i77b",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602115240.0
    },
    {
        "author": "BecomingWhatIThink",
        "body": "INTC is the way barley affected by the crash!",
        "created_utc": 1602015772,
        "id": "g7xmhjd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602044572.0
    },
    {
        "author": "BornShook",
        "body": "It won't. Doesn't matter who wins the election. We live in a technocracy. Tech runs this country. The virus and the lockdowns have been the best thing that could've ever happened for tech. \n\nIf there are more lockdowns, more people buy microsoft's new xbox how'd they find out about it? Facebook ads. Where do they buy it? Amazon of course. On their apple laptop, using Googles web browser. Boom they just went full circle. Bonus, AMD and Intel chips. Tech tech tech tech tech endless loop. You can't stop the nasdaq\n\nThink for a second. Trump getting really sick from covid. Is that going to change anything? No. Apple is still going to keep selling phones and so on. Just hold. \n\nAlso we have a vice presidential debate coming up so keep an eye on Mike Pence.\n\nIf Trumps condition becomes severe, -1.5%. If he dies, -5% briefly then close -3%, then up and down/ flat till post election. If Trump becomes really sick and markets tank, buy more shares.",
        "created_utc": 1601963268,
        "id": "g7vctgb",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601992068.0
    },
    {
        "author": "gaybearishair",
        "body": "intel is at its highest price since it got fucked up by amd\n\n\n😬",
        "created_utc": 1601585624,
        "id": "g7bw5ln",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601614424.0
    },
    {
        "author": "robmafia",
        "body": "he said servers.\n\n&gt;Intel still makes the best cpus (excluding cost), amd is a meme stock trending up. This isn’t US politics you can stick to facts.\n\nlolz.  god, no.  epyc is so far ahead of xeon that it's really not even close.",
        "created_utc": 1601753484,
        "id": "g7jm417",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601782284.0
    },
    {
        "author": "bluechipmonk",
        "body": "It’s not always about profitability. Growth plays a huge factor. I think Intel is priced ok.",
        "created_utc": 1601783719,
        "id": "g7m1ybn",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601812519.0
    },
    {
        "author": "kisssmysaas",
        "body": "Intel had a different team of executives in 2006. Right now they only have fuckboys",
        "created_utc": 1601756840,
        "id": "g7jvsof",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601785640.0
    },
    {
        "author": "fRaNkR016",
        "body": "☕️&amp;🤚el forming on Intel©",
        "created_utc": 1601924740,
        "id": "g7tfxug",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601953540.0
    },
    {
        "author": "cranial_pudding",
        "body": "Kinda surprised INTC is up the way it is considering AMD is swallowing their market share\n\nmaybe AMD pumping on product releases alone",
        "created_utc": 1601925916,
        "id": "g7tigi9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601954716.0
    },
    {
        "author": "slhsdt",
        "body": "I would consider INTC cause it is floating around 50s",
        "created_utc": 1601999836,
        "id": "g7wlt6r",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602028636.0
    },
    {
        "author": "terriblepicker",
        "body": "Ok every dd that is worth reading has to mention both upsides and downsides. You clearly have fapped a years worth of cum over the bear case. Now be an intelligent Individual and tell me how you think you might be wrong. What are the risks and what can happen that make intel strong in five years?",
        "created_utc": 1602041045,
        "id": "g7yvyij",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602069845.0
    },
    {
        "author": "blah021902190219",
        "body": "INTC a great play. Massive overreaction to 7nm notes in last ER. Holding 10x 52.50c 6/18/2020 and hoping we get that pop back to above 60 this ER.",
        "created_utc": 1602088929,
        "id": "g80n7ri",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602117729.0
    },
    {
        "author": "SHNARFF_",
        "body": "Why would Nvidia reverse? Lol. Tomorrow is Zen 3. CPUs with no talks of GPUs. If anything, Intel would be the ones to reverse.",
        "created_utc": 1602110131,
        "id": "g81tten",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602138931.0
    },
    {
        "author": "vobamba",
        "body": "TSM, idk if INTC counts as semi",
        "created_utc": 1602123890,
        "id": "g82jqa5",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1602152690.0
    },
    {
        "author": "sully_underwater",
        "body": "They are apparently gaining market share at a crazy rate and their margins are improving rapidly. Their main rival (Intel) has twice the market cap but will lose customers because their 7nm chip delay and issues with their 10nm.",
        "created_utc": 1602037641,
        "id": "g7yq73k",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602066441.0
    },
    {
        "author": "gaybearishair",
        "body": "ah yes, airline aid is good for intel\n\n\nmakes sense\n\n🤡",
        "created_utc": 1601656756,
        "id": "g7f07ab",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601685556.0
    },
    {
        "author": "VERTIKAL19",
        "body": "On what metric does Intel make the best CPUs? Epyc crushes Xeon. Intel doesn’t even has anything that can really compete with Threadripper and now it looks like Ryzen may fully surpass the desktop chips too. AMD also is making inroads on the laptop market with straightup better cpus.",
        "created_utc": 1601755089,
        "id": "g7jqqof",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601783889.0
    },
    {
        "author": "SMOO765",
        "body": "If anyone loves dividends, nows the time is jump into INTC",
        "created_utc": 1601569106,
        "id": "g7atbnm",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601597906.0
    },
    {
        "author": "BlackenedPS4",
        "body": "Not only that, new products, in which they can officially take the crown from Intel in the CPU market(if everything goes well) and they could even give Nvidia a good scare in the GPU market if Big Navi is at least on par with Nvidia with performance. If both of those happen, it would definitely help AMD’s stock, and their earnings should already be pretty good.",
        "created_utc": 1601914908,
        "id": "g7sv633",
        "score": 3,
        "subreddit": "options",
        "created": 1601943708.0
    },
    {
        "author": "npdaly",
        "body": "Fucking Mango and his tweets. My 10/16 INTC $52.50c contracts finally go ITM and then immediately dump after the tweet. I'm on the road the rest of the week so diamond hands for me.",
        "created_utc": 1602042775,
        "id": "g7yyuro",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602071575.0
    },
    {
        "author": "SunriseSurprise",
        "body": "INTC 10/9 53c's ended yesterday at 0.08 and are almost ITM now.",
        "created_utc": 1602083397,
        "id": "g80c2dc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602112197.0
    },
    {
        "author": "-X-Fire",
        "body": "AMD is already the best. There is no way better won't be better. People forget that Intel announced that their competition CPUs won't be out for another 6 months. That is 6 months of uncontested dominance in performance, and it will probably still be top even once rocket lake is released.",
        "created_utc": 1602103464,
        "id": "g81h4e9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602132264.0
    },
    {
        "author": "psychotrader00",
        "body": "ohh yeah.. INTC looks good for a swing. if it breaks that $52.70 level tomorrow we are in for a good day I reckon. Ill post a chart on it tomorrow",
        "created_utc": 1602130453,
        "id": "g82ugs6",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1602159253.0
    },
    {
        "author": "v-shizzle",
        "body": "anyone buy Intel PUTS for cheap today in hopes of it tanking on a good AMD event tomorrow?",
        "created_utc": 1602132807,
        "id": "g82xouf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602161607.0
    },
    {
        "author": "ltsconnor",
        "body": "SPY up... AAPL up... INTC up... AMD? FLATTTT",
        "created_utc": 1602095523,
        "id": "g810te8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602124323.0
    },
    {
        "author": "Huey_Long_Schong",
        "body": "Never touched it in the past 3 months but Intel finally real shit this time? Strong consolidation around 51-52 for a few days now",
        "created_utc": 1602001434,
        "id": "g7wozrd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602030234.0
    },
    {
        "author": "vego",
        "body": "Did I miss any Intel news or is it get going up because really it can't go any lower but it has to move?",
        "created_utc": 1602007926,
        "id": "g7x3n18",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602036726.0
    },
    {
        "author": "Matrix1216",
        "body": "AMD gonna crush whatever momentum INTC has",
        "created_utc": 1602006360,
        "id": "g7wzwcd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602035160.0
    },
    {
        "author": "nordmys",
        "body": "I have both AMD and INTC calls. 🧠🧠🧠",
        "created_utc": 1601927115,
        "id": "g7tkxlg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601955915.0
    },
    {
        "author": "WSBnoobxor",
        "body": "Will INTC shit the bed this week...",
        "created_utc": 1601927459,
        "id": "g7tllz0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601956259.0
    },
    {
        "author": "arice948",
        "body": "I highly doubt AMD's GPU lineup will even match NVIDIAS 30-series. Even if it does AMD has a terrible history with driver support and they also dont have the slew of software to go with it like NVIDIA. On the other hand I am eager to see what the new Ryzen CPU lineup looks like. IF they can match Intel on single core clock speeds then they might gain a good bit of traction in that department. If they dont then I would probably think there would be a sell off around the announcement time.\n\n&amp;#x200B;\n\nJust my thoughts as someone who is a PC gamer",
        "created_utc": 1601931620,
        "id": "g7tvi7u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601960420.0
    },
    {
        "author": "Startzagain",
        "body": "Intel...intel slow cooking tendies, there’s no other way. LVS",
        "created_utc": 1602096255,
        "id": "g812c23",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602125055.0
    },
    {
        "author": "isospeedrix",
        "body": "im long both amd and intel. if intel rises due to amd underwhelming then im ok with that. just as long as they dont' both tank.",
        "created_utc": 1602103440,
        "id": "g81h2o7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602132240.0
    },
    {
        "author": "cheerfulwish",
        "body": "If it mimics the intel event or nvda gpu event profits were maxed out like 10 minutes into the event. It probably makes more sense to compare this to the intel event and the event in a few weeks to the nvidia event id say.",
        "created_utc": 1602103485,
        "id": "g81h5u2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602132285.0
    },
    {
        "author": "blah021902190219",
        "body": "INTC leaps are ez money people. Just sit back and watch if go back up from your intel powered windows machine.",
        "created_utc": 1601997740,
        "id": "g7whli7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602026540.0
    },
    {
        "author": "Zodyu",
        "body": "Fuck it. Intel is going to have amazing earnings this quarter. Im jumping",
        "created_utc": 1602014187,
        "id": "g7xinq4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602042987.0
    },
    {
        "author": "MathFerret1013",
        "body": "&gt;No. I was making the bear case for the long term. 10/22 is Intel earning hence my put date.  This guys cannot handle tough questions from his shareholders and her is terrible for investor confidence when they grill him (and they do).   \n   \nRead this ass wipe.  \n  \n&gt;  \n&gt;**Stacy Rasgon** \\-- *Bernstein Research -- Analyst*  \n&gt;  \n&gt;Hi, guys. Thanks for taking my question. I want to ask about the acceleration in 10-nanometer. Is this really because yields are getting better and there's higher demand or because you're trying to offset the seven-nanometer delay? **Because it's hitting the margins big time, which doesn't really tie in my head to, like, yields getting hugely better versus where you thought they were going to be in January.**  \n&gt;  \n&gt;So how do I think about the drivers of that seven-nanometer acceleration in light of the seven -- or 10-nanometer acceleration in light of the seven-nanometer delay given what it's doing to the margins?  \n&gt;  \n&gt;**George Davis** \\-- *Chief Financial Officer*  \n&gt;  \n&gt;Yeah. Stacy, this is George. Maybe I'll just cover it in general on the margin picture for the year 'cause it's clearly -- it's having an impact there. The acceleration is really definitionally tied to the fact that we're growing faster than we expected in 2020.  \n&gt;  \n&gt;And we're -- part of that growth is a higher mix on the PC side and, I would say, on the comms and 5G ASIC side, higher demand for products that are on 10-nanometer than we had forecasted for the year. So it's why you're seeing a little less flow-through on revenue than we would have expected for the year. It's a positive growth story in that, again, we're seeing customers attracted to the 10-nanometer products.  \n&gt;  \n&gt;**Stacy Rasgon** \\-- *Bernstein Research -- Analyst*  \n&gt;  \n&gt;**But wait a minute. If I look at your annual guidance now versus where it was in the beginning of the year, it's higher, but it's actually lower in the second half versus what you had implied in -- when you first gave the annual guidance six months ago. How does that imply that demand is higher versus where you were now given you've actually lowered the second half?**  \n&gt;  \n&gt;**George Davis** \\-- *Chief Financial Officer*  \n&gt;  \n&gt;It's the demand for 10-nanometer products within the mix of our overall revenue, Stacy.  \n&gt;  \n&gt;**Bob Swan** \\-- *Chief Executive Officer*  \n&gt;  \n&gt;Well, I think I'll start with our full-year demand relative to where we were at the beginning of the year is our guidance is up by $1.5 billion in revenue. So that's --  \n&gt;  \n&gt;**Stacy Rasgon** \\-- *Bernstein Research -- Analyst*  \n&gt;  \n&gt;**Yeah. But you're just making it sound like where you can typically get to, is there --**  \n&gt;  \n&gt;**Bob Swan** \\-- *Chief Executive Officer*  \n&gt;  \n&gt;Let me just finish, Stacy. I think it's a good question, but maybe if you could give me a chance to answer it. So --  \n&gt;  \n&gt;**Stacy Rasgon** \\-- *Bernstein Research -- Analyst*  \n&gt;  \n&gt;Sorry.  \n&gt;  \n&gt;**Bob Swan** \\-- *Chief Executive Officer*  \n&gt;  \n&gt;Full-year demand for the company is higher. Secondly, the yields for 10-nanometer we've kind of set are in line with what we expected coming into the year through the first six months, and we feel pretty good about where we are on yields. Third, that the overall demand for our products on PC side and for the 5G SoC in the comms sector is higher than we expected. That is part of the contribution to the $1.5 billion of higher revenue for the year.  \n&gt;  \n&gt;And as we accelerate 10 faster, because customers are banding it more, the implications are that our margins, all else equal, will be lower. George kind of highlighted those were the primary drivers of the one-point decline. 10-nanometer products are ramping faster, and our 5G comms business and the data center group is growing much quicker than we had anticipated. I put ramping of 10-nanometer faster in the good category.  \n&gt;  \n&gt;We know margins are lower when we start a new node versus exit an old node. 10-nanometer margins are lower than 14 at this stage of the game. Ramping 10, we think, is a good thing for customers. We do take a dip in yield.  \n&gt;  \n&gt;If it's more of our growth than we had anticipated, all else equal, margins will be a little bit lower. And that's kind of the updated guidance for the year. Higher growth in a more challenging market, more demand for our 10-nanometer products that we're ramping as we -- ramping yields as we expected with more volume, all else equal, will have a modest impact on our gross margin for the full year. Thank you.  \n&gt;  \n&gt;**Operator**  \n&gt;  \n&gt;Thank you. Our next question comes from Timothy Arcuri with UBS. Your line is now open.\n\n&amp;#x200B;\n\n[https://www.fool.com/earnings/call-transcripts/2020/07/23/intel-intc-q2-2020-earnings-call-transcript.aspx](https://www.fool.com/earnings/call-transcripts/2020/07/23/intel-intc-q2-2020-earnings-call-transcript.aspx)\n\nI bolded her questions. Read bobby's had wavy bullshit response. She had a VERY GOOD very precise point as she caught them in their bullshit. Then he just bobble headed through with a response that has nothing to do with what she asked. He is covering up.\n\nIntel IS going to have another shit quarter full of delays and missed deals they couldn't fulfill. There will be another terrible conference call like that and the stock will tank because Bob Swan is a fucktard.  \n\n\nI'm not only shorting Intel, I'm shorting Bob Swan himself.",
        "created_utc": 1602043001,
        "id": "g7yz7cy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602071801.0
    },
    {
        "author": "ghostbearinforest",
        "body": "It is most def not priced in.  This will be around 85-90 all month with gpus coming the 28th.  Intel keeps floundering day after day, Nvidia botched releasee and bad arm press.  Amd to 100 by end of year/early 2021.",
        "created_utc": 1601852569,
        "id": "g7qe4to",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601881369.0
    },
    {
        "author": "adamrch",
        "body": "Big Navi gpu benchmark leaks and AMD 5000 CPU series seem to wipe the floor with Intel and NVIDIA",
        "created_utc": 1601852938,
        "id": "g7qerhl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601881738.0
    },
    {
        "author": "VictorVEnciso",
        "body": "$INTC and $MU",
        "created_utc": 1601859386,
        "id": "g7qpqib",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601888186.0
    },
    {
        "author": "LMY723",
        "body": "It makes me so happy seeing intel get shit on lmao",
        "created_utc": 1601865434,
        "id": "g7qzwdu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601894234.0
    },
    {
        "author": "fRaNkR016",
        "body": "U/dwdsquared2 3 500k leap positions on INTC opened up today. Thoughts?",
        "created_utc": 1601918737,
        "id": "g7t3xcf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601947537.0
    },
    {
        "author": "andstopher",
        "body": "I got an ad regarding their new transistor that, from what I understood, crosses two transistors in a 3 dimensional way, along with a bunch of other improvements in the way of materials engineering that can vastly improve processing speeds. I think INTC will spike once this is released.",
        "created_utc": 1601567252,
        "id": "g7ap10u",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601596052.0
    },
    {
        "author": "ch1p_skylark",
        "body": "some big dick CPU that makes intel look like little cucks",
        "created_utc": 1601589503,
        "id": "g7c3n0x",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601618303.0
    },
    {
        "author": "mishka__",
        "body": "Careful every IT dork at my company still thinks us spending tens of millions of dollars a year on Intel processors is “preferable because we have a good relationship”. These nerds are easily swayed by corporate politics.",
        "created_utc": 1601948732,
        "id": "g7urxms",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601977532.0
    },
    {
        "author": "somanychins",
        "body": "Any idea why INTC is sledding down a hill?",
        "created_utc": 1601917782,
        "id": "g7t1qcf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601946582.0
    },
    {
        "author": "p3arbear123",
        "body": "My friend who works in tech and knows this shit really well says he thinks AMD is going to be releasing really good graphics cards.  He says they won't be as good as Nvidea but that they don't need to be because they will probably sell them cheaper and they will be super compatible with AMD cpu chips.  Needless to say he has an AMD chip in his computer and hes going to be buying their graphics card for it.  He also told me hes seen a huge trend in his industry with companies kicking out Intel chips for their servers and replacing it with, you guessed it, AMD.  Intell struggling to get them 10 nanometer chips and AMD bout to have 5 nanos by the end of 2022.  Less nanos is good for you retards.  Oh and they have already started r and d on making 3 nanometers.  So what does all this mean.  I donno I dont trade gay options but I also aint no gay bear so buy calls faggots.",
        "created_utc": 1601959290,
        "id": "g7v897v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601988090.0
    },
    {
        "author": "boring_name_here",
        "body": "Fuck, IDK. I'm trying to think this through. \n\nLogically, AMD is still announcing new procs that are expected to kick ass in two days. Then they're announcing new gfx cars EOM, presumably all for EOY release. Not to mention they're still the only graphics supplier for both MS and Sony for next gen. Plus Intel admitted to fucking up their next gen procs.\n\nMy money is still on AMD to be more green than red.\n\nBut, the lack of a potential, if likely bullshit, stimulus is fucked for a lot of people who will have no money to spend on new stuff going into '21 and spring. \n\nTl;Dr: fuck IDK. Fuck mango for this. Bitch couldn't have waited until Monday to shit all over us?\n\nHold me bby.",
        "created_utc": 1602019251,
        "id": "g7xte3t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602048051.0
    },
    {
        "author": "Huey_Long_Schong",
        "body": "INTC breakout. It's fucking happening!",
        "created_utc": 1602006314,
        "id": "g7wzs8z",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602035114.0
    },
    {
        "author": "npdaly",
        "body": "What are you holding? Most of my INTC calls went green today.",
        "created_utc": 1602116224,
        "id": "g8254ms",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602145024.0
    },
    {
        "author": "JRCee",
        "body": "It’s really going to depend on the next 20 days. Big event tomorrow with another toward the end of the month. Most are saying 100 by Halloween. AMD is now taking a fuck ton of Intel market share. \n\nIntel has started “leaking” their shit CPU’s with delays because they’re afraid of embarrassment.",
        "created_utc": 1602084407,
        "id": "g80e2sz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602113207.0
    },
    {
        "author": "smokeyjay",
        "body": "Good bye INTC.  Thanks for all those put spreads.  Hope you come back",
        "created_utc": 1602086710,
        "id": "g80iqko",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602115510.0
    },
    {
        "author": "Jamdam911",
        "body": "Intel has been such a champ",
        "created_utc": 1602081446,
        "id": "g808a3c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602110246.0
    },
    {
        "author": "Normie_O1",
        "body": "Everybody! Dump NIO and INTC!",
        "created_utc": 1601649781,
        "id": "g7emk30",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601678581.0
    },
    {
        "author": "learningtosail",
        "body": "They don't make Intel's main line they make little things like NICs for intel.\n  \nBut yeah they're the best. Earnings won't be exciting though, just a mild improvement on April",
        "created_utc": 1601658261,
        "id": "g7f3764",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601687061.0
    },
    {
        "author": "Greedox2",
        "body": "INTEL PUTS! GET YA INTEL PUTS HERE!",
        "created_utc": 1601576606,
        "id": "g7badrl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601605406.0
    },
    {
        "author": "ErectHippo",
        "body": "Aren't you afraid their price already reflects this and once Intel gets their shit together AMD will take a dump?\n\nI'm on AMD too but that's my dear at least.",
        "created_utc": 1601775726,
        "id": "g7lf852",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601804526.0
    },
    {
        "author": "the_dark_side",
        "body": "Well, amd almost went bankrupt. But they are back in it. They are smaller than intel/nvidia - but are spending to catch up.",
        "created_utc": 1601778959,
        "id": "g7lowxe",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601807759.0
    },
    {
        "author": "the_dark_side",
        "body": "Haha. True.  But nukes are hated and the military loves moabs.  Nvidia’s latest card is hot and ... not a huge bump in performance.  AMD is about to drop a great new cpu to upset Intel(again) and potentially upset nvidia with a gpu in a single month.",
        "created_utc": 1601782425,
        "id": "g7ly9kp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601811225.0
    },
    {
        "author": "farrapona",
        "body": "I lost about 15k back in the late 90s on AOL INTC EBAY and maybe one other stock, can't remember.  I got out of investments except for some crappy mutual funds until 2012 and since then, well as you know it's been good times!",
        "created_utc": 1601777160,
        "id": "g7ljasf",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601805960.0
    },
    {
        "author": "noahsarc21",
        "body": "intel looks like a steal compared to other competitors in market",
        "created_utc": 1601755979,
        "id": "g7jtb1l",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601784779.0
    },
    {
        "author": "cowardly_lying",
        "body": "theta loves intc",
        "created_utc": 1601590795,
        "id": "g7c5zb4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601619595.0
    },
    {
        "author": "Long-John2",
        "body": "Not sure about monopoly. Intel still exists",
        "created_utc": 1601837436,
        "id": "g7pj1r4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601866236.0
    },
    {
        "author": "marinesol",
        "body": "So an expansive DD on Tesla. Don't do it. If the constant 10% percent fluctuations don't kill you, then the insane over 1000$ per option absolutely will.\n\nBuy calls in something like AMD which had near constantly been up and its calls are much cheaper than Tesla calls.\n\n  Also calls on both Intel and AMD. Yeah that seems like a dichotomy but both have show great performance from their laptop chips albeit in different areas. Also we are in bubble .\n\nBuy schlitz beer.",
        "created_utc": 1601873033,
        "id": "g7ranpk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601901833.0
    },
    {
        "author": "cloudone",
        "body": "She didn't buy NKLA as far as I know\n\nHer strategy make so much more sense than /r/investing 's favorites - XOM, INTC, and god forbid muh dividend Ford.",
        "created_utc": 1601842862,
        "id": "g7pvw71",
        "score": 2,
        "subreddit": "investing",
        "created": 1601871662.0
    },
    {
        "author": "Investinwaffl3s",
        "body": "Not me, About $150k in AMD Epyc servers since last year.\n\nWas a godsend while trying to scale out VDI this year. Intel all fucing backordered, only the highest SKU's in stock\n\nAMD shipping out next day overnight. Thanks again HPE, always saving my clients ass when they sit on a quote for months on end and all of a sudden need everything overnighted",
        "created_utc": 1601949370,
        "id": "g7ut2cc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601978170.0
    },
    {
        "author": "MathFerret1013",
        "body": "Intel IS the next RadioShack.",
        "created_utc": 1602042202,
        "id": "g7yxwz4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602071002.0
    },
    {
        "author": "chrischen1911",
        "body": "Inverse WSB, so all in on Intel calls.",
        "created_utc": 1602040910,
        "id": "g7yvqss",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602069710.0
    },
    {
        "author": "MathFerret1013",
        "body": "&gt;2, the upcoming arcetecture change is a dope game changer.\n\nYou cannot be serious. They have been late on chips for FOUR YEARS. 4! Thats insane you think they are going to successfully launch anew architecture they haven't fabbed yet?   \n\n\nThis new architecture is just \"big little\" which AMD is already working on. [https://www.guru3d.com/news-story/amd-flirting-with-big-little-processor-design-files-a-patent.html](https://www.guru3d.com/news-story/amd-flirting-with-big-little-processor-design-files-a-patent.html)  \n\n\n&gt; 5, puts on amd are more valuable in the mid term. Way the fuck overpriced and due for a correction.\n\nThey are literally cheaper, better, have more stable supply chain, you can actually buy them, and they keep getting better. No one is buy intel if they have a choice.",
        "created_utc": 1602044208,
        "id": "g7z0yps",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602073008.0
    },
    {
        "author": "totally_not_a_bot_ok",
        "body": "Come on intc gap up you bitch!",
        "created_utc": 1602087600,
        "id": "g80kja7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602116400.0
    },
    {
        "author": "SealCub-ClubbingClub",
        "body": "Imagine basing this months price action on TA when everything is going to be driven by the news cycles around 2 events. I'm waiting for AMD moon this month because their 2 significant product launches are not sufficiently priced in.\n\nWhy do I say that? Look at any \"investing\" comments section on AMD and all they will talk about is how AMD is overpriced because their P/E is 160 lol or AMD is just another overvalued tech company like Tesla. Completely ignoring the fact that AMD's 2 direct competitors are like &gt;2X and &gt;3X the market cap and now have products that AMD either straight up beat or directly compete with. They look at trailing market shares in laptops, datacentre, GPU when AMD's products were inferior while ignoring the fact that AMD's products are now good enough that they can sell as many chips as TSMC give them. TSMC capacity is literally AMD's only constraint on how much product they can sell for the next year+ and fortunately AMD have an absolute tonne of N7P wafers this year and N5 wafers lined up in 2021.\n\nAll the talk has been about consoles, yet in terms of profit per wafer they are probably the worst product AMD are producing right now, I'm sure Zen3 will make them waaay more per wafer.\n\nZen 3 - 8th\n\nThe tech community have known for a long time that Zen 3 IPC and clock uplifts will take the single-thread crown from Intel, however the price only started to move with the recent leaks that add weight to these rumours. However everyone's news feeds on Oct 9th are going to be full of articles and youtube videos like \"AMD finally beat Intel in gaming\" \"AMD CPUs better at every price point\" \"AMD to dominate desktop, mobile and sever into 2021\" and there is no way the price isn't jumping when that happens.\n\nRDNA 2 - 28th\n\nAgain anyone following it knows that RDNA 2 is going to be competitive with the 3070 and 3080 in terms of performance, but I don't think this is sufficiently priced in - I think the market expects better performance/$ and performance/watt and maybe competition at the low-mid tier (which is AMD's normal spot) but I don't think they appreciate AMD will offer 4K-viable cards. I think people aren't appreciating the fact AMD will have decent supply and decent driver support this time around so this will be followed with headlines like \"6900 is about the same as a 3080 and you can actually buy one now!\" \"6900 gives similar performance but doesn't require a nuclear power station to run\" \"Don't bother waiting for a 3070, spend $100 extra and get 15% better performance with a 6900\" etc..\n\nThese events (+the leaks that come before them and the commentary that follows them) are going to dominate the price action this month and I don't see how TA helps with that. Last weeks action was all about the 5800X AotS benchmark leaks - without knowing when future leaks are coming I don't see how we can predict any specific movements.\n\nMarch 21 95C, 100Cs",
        "created_utc": 1601853091,
        "id": "g7qf0sp",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1601881891.0
    },
    {
        "author": "HWL_Nissassa",
        "body": "AMD is about to shit on NVDA and INTC in the same month.",
        "created_utc": 1601856118,
        "id": "g7qk4m9",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1601884918.0
    },
    {
        "author": "MathFerret1013",
        "body": "This is a chip company that cant fab 5 year old shit. Oh look another 10nm delay from today https://www.kitguru.net/components/cpu/joao-silva/intel-is-reportedly-delaying-the-ice-lake-sp-10nm-processor-architecture-again/\n\nHow the fuck are they going up when they can't even ship their own chips? Do you have any idea how hard it is to change process nodes even if tscm will take them on? We're talking months. They seriously threw around the idea of having someone else to fabs their own chips ON AN EARNINGS CALL. This is like microsoft having to get apple to wrote their software because they can't figure it out! This is the actual situation for Intel.\n \nFuck you buy more puts.\n\nEDIT:\nTake a look at Intel's cash flow: https://finance.yahoo.com/quote/INTC/cash-flow?p=INTC\n\nRepurchase of Capital Stock going up? This is bullshit, this is a pump and dump by intel execs.",
        "created_utc": 1602039359,
        "id": "g7yt43i",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1602068159.0
    },
    {
        "author": "JustYourNormalGuy",
        "body": "Did intel hurt you as a child",
        "created_utc": 1602037520,
        "id": "g7ypzjl",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1602066320.0
    },
    {
        "author": "marinesol",
        "body": "In my heart Im hoping that intel, apple and micrsoft drop like 10% so I can make a couple grand, but in my brain I feel like Ill make at most 20$.",
        "created_utc": 1601620568,
        "id": "g7dkf7y",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1601649368.0
    },
    {
        "author": "Berrymore13",
        "body": "Why are you guys selling your AMD calls? If they expire in November or later like they should if you weren’t retarded, this is just the beginning. October is the month that AMD kicks Intel in the nuts, and then knees them in the nose",
        "created_utc": 1601930994,
        "id": "g7ttzv9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1601959794.0
    },
    {
        "author": "Ryankinsey1",
        "body": "All the boomers without twitter like, \"WTF Happened?! My Intel , Exxon, and GE calls just shit themselves\"",
        "created_utc": 1602011891,
        "id": "g7xcz78",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1602040691.0
    },
    {
        "author": "SealCub-ClubbingClub",
        "body": "Where have you been? PE is like 160 now, although it's completely irrelevant right now. All that matters is what share AMD will take from Intel / Nvidia. I think we could easily see 30% in a year or 2 considering AMD have better/directly competing products.\n\nIf there is a semiconductor correction I'm more worried about the 2 companies worth 550bn with similar products than the one worth 100bn.",
        "created_utc": 1601854980,
        "id": "g7qi7l7",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1601883780.0
    },
    {
        "author": "cranial_pudding",
        "body": "Imagine going long INTC after Steam reported AMD is taking 1% market share a month",
        "created_utc": 1601859443,
        "id": "g7qptw1",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1601888243.0
    },
    {
        "author": "Reden95",
        "body": "INTC. Intel makes 40 bn a yr, spends 13 bn in R&amp;D and 20 bn on buybacks. Somehow their marketcap is 200bn. Once they figure out their 7nm process I believe they will soar to 500 billion.",
        "created_utc": 1601932907,
        "id": "g7tyk8l",
        "score": 7,
        "subreddit": "stocks",
        "created": 1601961707.0
    },
    {
        "author": "notyetcomitteds2",
        "body": "When I was in grad school, had 3 marines in my group and yeah, they told me they googled most shit.  Figured they had high level military produced intel and stuff, but no, Google.  Mostly the cia world Factbook. One dude was an interrogator and said thats how he learned about culture.",
        "created_utc": 1601583000,
        "id": "g7bpugx",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1601611800.0
    },
    {
        "author": "MathFerret1013",
        "body": "Oh that thing? DELAYED! [https://www.nytimes.com/2020/08/27/technology/intel-aurora-supercomputer.html](https://www.nytimes.com/2020/08/27/technology/intel-aurora-supercomputer.html)  \n\n\nFUCK YOU TOO! MORE PUTS!",
        "created_utc": 1602039798,
        "id": "g7ytuwi",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1602068598.0
    },
    {
        "author": "drnick5",
        "body": "The problem is, how long does this \"Strategic funk\" last?     \n\nIntel has been stagnant for YEARS now, being stuck on 14nm, while AMD has closed the performance gap. That doesn't seem to be coming to an end anytime soon either given all the delays they've had. Last they said, they won't have 7nm chips out until 2022! At that point, AMD will be rolling out 5nm chips.      \n   \nThen you can talk about the multiple security vulnerabilities they've had with in their chips, with their only solution being \"Turn off hyper treading, that will fix it\". Eventually they released some fixes, but this also hurt CPU performance. \n\nI'm not going to say INTC is a sinking ship or anything, I just don't really see them as being that undervalued.",
        "created_utc": 1601573117,
        "id": "g7b2cmv",
        "score": 6,
        "subreddit": "stocks",
        "created": 1601601917.0
    },
    {
        "author": "ReversalTheory",
        "body": "TSM, manufacturer of AMD and intel chips has earnings on Oct 15. Ran up 15% two weeks leading up to last earnings",
        "created_utc": 1601658098,
        "id": "g7f2vr9",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1601686898.0
    },
    {
        "author": "JRCee",
        "body": "https://www.notebookcheck.net/Intel-Tiger-Lake-H-Alder-Lake-P-and-Alder-Lake-S-detailed-Alder-Lake-to-offer-up-to-8C-16T-configs-with-Xe-LP-DDR5-4400-RAM-Wi-Fi-6E-and-PCIe-Gen5-support.496197.0.html\n\n$AMD leaks... $90 EOD.",
        "created_utc": 1601911008,
        "id": "g7sna1l",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1601939808.0
    },
    {
        "author": "undermon",
        "body": "Pentagon announcing alien-related intel tomorrow at 11am. Book it",
        "created_utc": 1602053015,
        "id": "g7zbau7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1602081815.0
    },
    {
        "author": "worryie",
        "body": "AMD. The new CPU’s are gonna throat fuck intel and their GPUs are gonna be super competitive with nvidia.",
        "created_utc": 1601854335,
        "id": "g7qh4py",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1601883135.0
    },
    {
        "author": "dreammanalishi",
        "body": "I concur on INTC.\n\nhttps://finance.yahoo.com/screener/predefined/undervalued_growth_stocks/?offset=0&amp;count=100\n\nhttps://finance.yahoo.com/screener/predefined/undervalued_large_caps/?offset=0&amp;count=100",
        "created_utc": 1601933022,
        "id": "g7tyty7",
        "score": 6,
        "subreddit": "stocks",
        "created": 1601961822.0
    },
    {
        "author": "pgh1979",
        "body": "INTC is USA's National Champion Semi manufacturer. Noone else manufactures in the US so expect a multi billion dollar bailout for INTC",
        "created_utc": 1602039659,
        "id": "g7ytmbm",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1602068459.0
    },
    {
        "author": "HalleysComet41",
        "body": "&gt;This is a chip company\n\nhahahahahaha dumbass intel does so much more than chips and may even move away from chips (chip fab, for sure) in the future\n\nmy desktop at home is 100% amd btw.",
        "created_utc": 1602039946,
        "id": "g7yu3ra",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1602068746.0
    },
    {
        "author": "MathFerret1013",
        "body": "I'll tell you what you pathetic excuse for a mis-aborted fetus.  This right here sums up your whole fucking post.\n\n&gt;I don't know what they're doing with data trafficking and I frankly don't care.\n\nNo shit you don't care, you don't understand anything about this industry and this is why all you did was quote a bunch of garbage finance crap without saying anything regarding Intel's core business model. You sound almost as full of shit as Bob Swan himself.\n\nThey are currently 4-5 years behind in their core business and not competitive in their other segments. They have a ton of cash and they will keep using it to try and spend themselves out of this mess while they suffer delay after delay. By the time they even have EUV basics figured out TSMC will likely be producing 3nm chips.\n\nWhat does this mean? Dramatically lower power consumption (\\~ 25%) especially in the mobile sector. With the advent of 5G applications, better power/performance ratio is everything for mobile which AMD will then take from intel too.\n\n[https://www.howtogeek.com/394267/what-do-7nm-and-10nm-mean-and-why-do-they-matter/](https://www.howtogeek.com/394267/what-do-7nm-and-10nm-mean-and-why-do-they-matter/)\n\nLearn about how these things are actually made and how this shit works and you will see clear as day, they have made EVERY wrong move. 4 years of stagnation and failure is not an accident. They are going in the shitter and their core business is on life support. They are fucked.",
        "created_utc": 1602049391,
        "id": "g7z7k0y",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1602078191.0
    },
    {
        "author": "alphuscorp",
        "body": "I want to bet on AMD this week, but I’m unsure about the rest of the market. Therefore I bought puts on Intel.",
        "created_utc": 1601864952,
        "id": "g7qz4kb",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601893752.0
    },
    {
        "author": "crackercider",
        "body": "Leaks claiming +25% single core performance, got intel sweating.",
        "created_utc": 1601659642,
        "id": "g7f6db9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601688442.0
    },
    {
        "author": "skaterkud",
        "body": "I bought 100 shares of intel at $50.71, will hold forever",
        "created_utc": 1601777549,
        "id": "g7lkipw",
        "score": 4,
        "subreddit": "stocks",
        "created": 1601806349.0
    },
    {
        "author": "Au_contraire_zippy",
        "body": "well exactly my reason for posting. to hear what other people think. here are some of my thoughts on the entire situation...\n\n1. the semiconductor impact\nbecause this is such a huge player in the markets at the moment between AMD, NVDA, INTC et al, could effect the entire Tech sector. It all pivots on TMC in Taiwan which makes it tricky.\n2. 3500 US companies are suing Trump for blocking China trade access. which implies US companies want to go to China not stay locked into US.\n3. DCEP Chinese digital currency, not mentioned but could challenge the global dollar in time.\n4. Democrats are going to be more aggressive than Trump towards China. They called him \"Uncle Donald\" at one point. friendly-ish, they likely respect his financial approach even if he is brash. I dont think US will be friendly if Dems get in, and the vibe towards China will get a lot colder and nastier. that is not good if they are losing the global cold trade war, then US will start to play dirty tricks. Hilary would have had us all in a war by now imo. psychopathic woman. maybe she is still pulling strings somewhere. I truly hope not.\n5. Propaganda machine that has been driving Anti-Chinese sentiment for months is working very well and that is a big worry as once China feel even more cornered, they will likely react more aggressively. US are the cause of this whole fiasco, not the Chinese, but we are being sold differently on that narrative because US are dirty war players. history upholds that truth.\n6. China gaining more economic power and US losing it globally would totally change the face of world economy and markets fundamentally to the point it is almost impossible to imagine what that future would look like and one big question - how far would US Government be willing to go to stop that happening? that is scary because historically US Govmt have no limits that they have not been willing to go to before, including killing their own in extremely large numbers.\n\nAnyway, how all that effects trade, we will only really know after the election. I was hoping other peeps might share their wisdom/thoughts here which was my reason for posting.",
        "created_utc": 1601945426,
        "id": "g7ulum9",
        "score": 4,
        "subreddit": "investing",
        "created": 1601974226.0
    },
    {
        "author": "COKEWHITESOLES",
        "body": "$50.84 for Intel??? Intel?? Hot damn.",
        "created_utc": 1601771756,
        "id": "g7l3duo",
        "score": 4,
        "subreddit": "stocks",
        "created": 1601800556.0
    },
    {
        "author": "PassiveF1st",
        "body": "Why would you sell AMD this month at all?\n\n8th - ZEN 3 Presentation\n\n22nd - Intel Earnings\n\n27th - AMD Earnings\n\n28th - RDNA  2 Presentation",
        "created_utc": 1601925614,
        "id": "g7thsoz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601954414.0
    },
    {
        "author": "dwdsquared2",
        "body": " [https://twitter.com/DeItaOne/status/1313871771557392394?s=20](https://twitter.com/DeItaOne/status/1313871771557392394?s=20)\n\n INTEL CORP SAYS \"ROCKET LAKE\" 11TH GENERATION DESKTOP PROCESSOR CHIPS WILL LAUNCH IN FIRST QUARTER OF 2021 - BLOG POST",
        "created_utc": 1602086440,
        "id": "g80i77b",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602115240.0
    },
    {
        "author": "BecomingWhatIThink",
        "body": "INTC is the way barley affected by the crash!",
        "created_utc": 1602015772,
        "id": "g7xmhjd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602044572.0
    },
    {
        "author": "BornShook",
        "body": "It won't. Doesn't matter who wins the election. We live in a technocracy. Tech runs this country. The virus and the lockdowns have been the best thing that could've ever happened for tech. \n\nIf there are more lockdowns, more people buy microsoft's new xbox how'd they find out about it? Facebook ads. Where do they buy it? Amazon of course. On their apple laptop, using Googles web browser. Boom they just went full circle. Bonus, AMD and Intel chips. Tech tech tech tech tech endless loop. You can't stop the nasdaq\n\nThink for a second. Trump getting really sick from covid. Is that going to change anything? No. Apple is still going to keep selling phones and so on. Just hold. \n\nAlso we have a vice presidential debate coming up so keep an eye on Mike Pence.\n\nIf Trumps condition becomes severe, -1.5%. If he dies, -5% briefly then close -3%, then up and down/ flat till post election. If Trump becomes really sick and markets tank, buy more shares.",
        "created_utc": 1601963268,
        "id": "g7vctgb",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601992068.0
    },
    {
        "author": "gaybearishair",
        "body": "intel is at its highest price since it got fucked up by amd\n\n\n😬",
        "created_utc": 1601585624,
        "id": "g7bw5ln",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601614424.0
    },
    {
        "author": "robmafia",
        "body": "he said servers.\n\n&gt;Intel still makes the best cpus (excluding cost), amd is a meme stock trending up. This isn’t US politics you can stick to facts.\n\nlolz.  god, no.  epyc is so far ahead of xeon that it's really not even close.",
        "created_utc": 1601753484,
        "id": "g7jm417",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601782284.0
    },
    {
        "author": "bluechipmonk",
        "body": "It’s not always about profitability. Growth plays a huge factor. I think Intel is priced ok.",
        "created_utc": 1601783719,
        "id": "g7m1ybn",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601812519.0
    },
    {
        "author": "kisssmysaas",
        "body": "Intel had a different team of executives in 2006. Right now they only have fuckboys",
        "created_utc": 1601756840,
        "id": "g7jvsof",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601785640.0
    },
    {
        "author": "fRaNkR016",
        "body": "☕️&amp;🤚el forming on Intel©",
        "created_utc": 1601924740,
        "id": "g7tfxug",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601953540.0
    },
    {
        "author": "cranial_pudding",
        "body": "Kinda surprised INTC is up the way it is considering AMD is swallowing their market share\n\nmaybe AMD pumping on product releases alone",
        "created_utc": 1601925916,
        "id": "g7tigi9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601954716.0
    },
    {
        "author": "slhsdt",
        "body": "I would consider INTC cause it is floating around 50s",
        "created_utc": 1601999836,
        "id": "g7wlt6r",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602028636.0
    },
    {
        "author": "terriblepicker",
        "body": "Ok every dd that is worth reading has to mention both upsides and downsides. You clearly have fapped a years worth of cum over the bear case. Now be an intelligent Individual and tell me how you think you might be wrong. What are the risks and what can happen that make intel strong in five years?",
        "created_utc": 1602041045,
        "id": "g7yvyij",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602069845.0
    },
    {
        "author": "sully_underwater",
        "body": "They are apparently gaining market share at a crazy rate and their margins are improving rapidly. Their main rival (Intel) has twice the market cap but will lose customers because their 7nm chip delay and issues with their 10nm.",
        "created_utc": 1602037641,
        "id": "g7yq73k",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602066441.0
    },
    {
        "author": "gaybearishair",
        "body": "ah yes, airline aid is good for intel\n\n\nmakes sense\n\n🤡",
        "created_utc": 1601656756,
        "id": "g7f07ab",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601685556.0
    },
    {
        "author": "VERTIKAL19",
        "body": "On what metric does Intel make the best CPUs? Epyc crushes Xeon. Intel doesn’t even has anything that can really compete with Threadripper and now it looks like Ryzen may fully surpass the desktop chips too. AMD also is making inroads on the laptop market with straightup better cpus.",
        "created_utc": 1601755089,
        "id": "g7jqqof",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601783889.0
    },
    {
        "author": "SMOO765",
        "body": "If anyone loves dividends, nows the time is jump into INTC",
        "created_utc": 1601569106,
        "id": "g7atbnm",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601597906.0
    },
    {
        "author": "BlackenedPS4",
        "body": "Not only that, new products, in which they can officially take the crown from Intel in the CPU market(if everything goes well) and they could even give Nvidia a good scare in the GPU market if Big Navi is at least on par with Nvidia with performance. If both of those happen, it would definitely help AMD’s stock, and their earnings should already be pretty good.",
        "created_utc": 1601914908,
        "id": "g7sv633",
        "score": 3,
        "subreddit": "options",
        "created": 1601943708.0
    },
    {
        "author": "npdaly",
        "body": "Fucking Mango and his tweets. My 10/16 INTC $52.50c contracts finally go ITM and then immediately dump after the tweet. I'm on the road the rest of the week so diamond hands for me.",
        "created_utc": 1602042775,
        "id": "g7yyuro",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602071575.0
    },
    {
        "author": "SunriseSurprise",
        "body": "INTC 10/9 53c's ended yesterday at 0.08 and are almost ITM now.",
        "created_utc": 1602083397,
        "id": "g80c2dc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602112197.0
    },
    {
        "author": "Huey_Long_Schong",
        "body": "Never touched it in the past 3 months but Intel finally real shit this time? Strong consolidation around 51-52 for a few days now",
        "created_utc": 1602001434,
        "id": "g7wozrd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602030234.0
    },
    {
        "author": "vego",
        "body": "Did I miss any Intel news or is it get going up because really it can't go any lower but it has to move?",
        "created_utc": 1602007926,
        "id": "g7x3n18",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602036726.0
    },
    {
        "author": "Matrix1216",
        "body": "AMD gonna crush whatever momentum INTC has",
        "created_utc": 1602006360,
        "id": "g7wzwcd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602035160.0
    },
    {
        "author": "nordmys",
        "body": "I have both AMD and INTC calls. 🧠🧠🧠",
        "created_utc": 1601927115,
        "id": "g7tkxlg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601955915.0
    },
    {
        "author": "WSBnoobxor",
        "body": "Will INTC shit the bed this week...",
        "created_utc": 1601927459,
        "id": "g7tllz0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601956259.0
    },
    {
        "author": "arice948",
        "body": "I highly doubt AMD's GPU lineup will even match NVIDIAS 30-series. Even if it does AMD has a terrible history with driver support and they also dont have the slew of software to go with it like NVIDIA. On the other hand I am eager to see what the new Ryzen CPU lineup looks like. IF they can match Intel on single core clock speeds then they might gain a good bit of traction in that department. If they dont then I would probably think there would be a sell off around the announcement time.\n\n&amp;#x200B;\n\nJust my thoughts as someone who is a PC gamer",
        "created_utc": 1601931620,
        "id": "g7tvi7u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601960420.0
    },
    {
        "author": "blah021902190219",
        "body": "INTC leaps are ez money people. Just sit back and watch if go back up from your intel powered windows machine.",
        "created_utc": 1601997740,
        "id": "g7whli7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602026540.0
    },
    {
        "author": "Zodyu",
        "body": "Fuck it. Intel is going to have amazing earnings this quarter. Im jumping",
        "created_utc": 1602014187,
        "id": "g7xinq4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602042987.0
    },
    {
        "author": "MathFerret1013",
        "body": "&gt;No. I was making the bear case for the long term. 10/22 is Intel earning hence my put date.  This guys cannot handle tough questions from his shareholders and her is terrible for investor confidence when they grill him (and they do).   \n   \nRead this ass wipe.  \n  \n&gt;  \n&gt;**Stacy Rasgon** \\-- *Bernstein Research -- Analyst*  \n&gt;  \n&gt;Hi, guys. Thanks for taking my question. I want to ask about the acceleration in 10-nanometer. Is this really because yields are getting better and there's higher demand or because you're trying to offset the seven-nanometer delay? **Because it's hitting the margins big time, which doesn't really tie in my head to, like, yields getting hugely better versus where you thought they were going to be in January.**  \n&gt;  \n&gt;So how do I think about the drivers of that seven-nanometer acceleration in light of the seven -- or 10-nanometer acceleration in light of the seven-nanometer delay given what it's doing to the margins?  \n&gt;  \n&gt;**George Davis** \\-- *Chief Financial Officer*  \n&gt;  \n&gt;Yeah. Stacy, this is George. Maybe I'll just cover it in general on the margin picture for the year 'cause it's clearly -- it's having an impact there. The acceleration is really definitionally tied to the fact that we're growing faster than we expected in 2020.  \n&gt;  \n&gt;And we're -- part of that growth is a higher mix on the PC side and, I would say, on the comms and 5G ASIC side, higher demand for products that are on 10-nanometer than we had forecasted for the year. So it's why you're seeing a little less flow-through on revenue than we would have expected for the year. It's a positive growth story in that, again, we're seeing customers attracted to the 10-nanometer products.  \n&gt;  \n&gt;**Stacy Rasgon** \\-- *Bernstein Research -- Analyst*  \n&gt;  \n&gt;**But wait a minute. If I look at your annual guidance now versus where it was in the beginning of the year, it's higher, but it's actually lower in the second half versus what you had implied in -- when you first gave the annual guidance six months ago. How does that imply that demand is higher versus where you were now given you've actually lowered the second half?**  \n&gt;  \n&gt;**George Davis** \\-- *Chief Financial Officer*  \n&gt;  \n&gt;It's the demand for 10-nanometer products within the mix of our overall revenue, Stacy.  \n&gt;  \n&gt;**Bob Swan** \\-- *Chief Executive Officer*  \n&gt;  \n&gt;Well, I think I'll start with our full-year demand relative to where we were at the beginning of the year is our guidance is up by $1.5 billion in revenue. So that's --  \n&gt;  \n&gt;**Stacy Rasgon** \\-- *Bernstein Research -- Analyst*  \n&gt;  \n&gt;**Yeah. But you're just making it sound like where you can typically get to, is there --**  \n&gt;  \n&gt;**Bob Swan** \\-- *Chief Executive Officer*  \n&gt;  \n&gt;Let me just finish, Stacy. I think it's a good question, but maybe if you could give me a chance to answer it. So --  \n&gt;  \n&gt;**Stacy Rasgon** \\-- *Bernstein Research -- Analyst*  \n&gt;  \n&gt;Sorry.  \n&gt;  \n&gt;**Bob Swan** \\-- *Chief Executive Officer*  \n&gt;  \n&gt;Full-year demand for the company is higher. Secondly, the yields for 10-nanometer we've kind of set are in line with what we expected coming into the year through the first six months, and we feel pretty good about where we are on yields. Third, that the overall demand for our products on PC side and for the 5G SoC in the comms sector is higher than we expected. That is part of the contribution to the $1.5 billion of higher revenue for the year.  \n&gt;  \n&gt;And as we accelerate 10 faster, because customers are banding it more, the implications are that our margins, all else equal, will be lower. George kind of highlighted those were the primary drivers of the one-point decline. 10-nanometer products are ramping faster, and our 5G comms business and the data center group is growing much quicker than we had anticipated. I put ramping of 10-nanometer faster in the good category.  \n&gt;  \n&gt;We know margins are lower when we start a new node versus exit an old node. 10-nanometer margins are lower than 14 at this stage of the game. Ramping 10, we think, is a good thing for customers. We do take a dip in yield.  \n&gt;  \n&gt;If it's more of our growth than we had anticipated, all else equal, margins will be a little bit lower. And that's kind of the updated guidance for the year. Higher growth in a more challenging market, more demand for our 10-nanometer products that we're ramping as we -- ramping yields as we expected with more volume, all else equal, will have a modest impact on our gross margin for the full year. Thank you.  \n&gt;  \n&gt;**Operator**  \n&gt;  \n&gt;Thank you. Our next question comes from Timothy Arcuri with UBS. Your line is now open.\n\n&amp;#x200B;\n\n[https://www.fool.com/earnings/call-transcripts/2020/07/23/intel-intc-q2-2020-earnings-call-transcript.aspx](https://www.fool.com/earnings/call-transcripts/2020/07/23/intel-intc-q2-2020-earnings-call-transcript.aspx)\n\nI bolded her questions. Read bobby's had wavy bullshit response. She had a VERY GOOD very precise point as she caught them in their bullshit. Then he just bobble headed through with a response that has nothing to do with what she asked. He is covering up.\n\nIntel IS going to have another shit quarter full of delays and missed deals they couldn't fulfill. There will be another terrible conference call like that and the stock will tank because Bob Swan is a fucktard.  \n\n\nI'm not only shorting Intel, I'm shorting Bob Swan himself.",
        "created_utc": 1602043001,
        "id": "g7yz7cy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602071801.0
    },
    {
        "author": "ghostbearinforest",
        "body": "It is most def not priced in.  This will be around 85-90 all month with gpus coming the 28th.  Intel keeps floundering day after day, Nvidia botched releasee and bad arm press.  Amd to 100 by end of year/early 2021.",
        "created_utc": 1601852569,
        "id": "g7qe4to",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601881369.0
    },
    {
        "author": "adamrch",
        "body": "Big Navi gpu benchmark leaks and AMD 5000 CPU series seem to wipe the floor with Intel and NVIDIA",
        "created_utc": 1601852938,
        "id": "g7qerhl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601881738.0
    },
    {
        "author": "VictorVEnciso",
        "body": "$INTC and $MU",
        "created_utc": 1601859386,
        "id": "g7qpqib",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601888186.0
    },
    {
        "author": "LMY723",
        "body": "It makes me so happy seeing intel get shit on lmao",
        "created_utc": 1601865434,
        "id": "g7qzwdu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601894234.0
    },
    {
        "author": "fRaNkR016",
        "body": "U/dwdsquared2 3 500k leap positions on INTC opened up today. Thoughts?",
        "created_utc": 1601918737,
        "id": "g7t3xcf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601947537.0
    },
    {
        "author": "andstopher",
        "body": "I got an ad regarding their new transistor that, from what I understood, crosses two transistors in a 3 dimensional way, along with a bunch of other improvements in the way of materials engineering that can vastly improve processing speeds. I think INTC will spike once this is released.",
        "created_utc": 1601567252,
        "id": "g7ap10u",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601596052.0
    },
    {
        "author": "ch1p_skylark",
        "body": "some big dick CPU that makes intel look like little cucks",
        "created_utc": 1601589503,
        "id": "g7c3n0x",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601618303.0
    },
    {
        "author": "mishka__",
        "body": "Careful every IT dork at my company still thinks us spending tens of millions of dollars a year on Intel processors is “preferable because we have a good relationship”. These nerds are easily swayed by corporate politics.",
        "created_utc": 1601948732,
        "id": "g7urxms",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601977532.0
    },
    {
        "author": "somanychins",
        "body": "Any idea why INTC is sledding down a hill?",
        "created_utc": 1601917782,
        "id": "g7t1qcf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601946582.0
    },
    {
        "author": "p3arbear123",
        "body": "My friend who works in tech and knows this shit really well says he thinks AMD is going to be releasing really good graphics cards.  He says they won't be as good as Nvidea but that they don't need to be because they will probably sell them cheaper and they will be super compatible with AMD cpu chips.  Needless to say he has an AMD chip in his computer and hes going to be buying their graphics card for it.  He also told me hes seen a huge trend in his industry with companies kicking out Intel chips for their servers and replacing it with, you guessed it, AMD.  Intell struggling to get them 10 nanometer chips and AMD bout to have 5 nanos by the end of 2022.  Less nanos is good for you retards.  Oh and they have already started r and d on making 3 nanometers.  So what does all this mean.  I donno I dont trade gay options but I also aint no gay bear so buy calls faggots.",
        "created_utc": 1601959290,
        "id": "g7v897v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601988090.0
    },
    {
        "author": "boring_name_here",
        "body": "Fuck, IDK. I'm trying to think this through. \n\nLogically, AMD is still announcing new procs that are expected to kick ass in two days. Then they're announcing new gfx cars EOM, presumably all for EOY release. Not to mention they're still the only graphics supplier for both MS and Sony for next gen. Plus Intel admitted to fucking up their next gen procs.\n\nMy money is still on AMD to be more green than red.\n\nBut, the lack of a potential, if likely bullshit, stimulus is fucked for a lot of people who will have no money to spend on new stuff going into '21 and spring. \n\nTl;Dr: fuck IDK. Fuck mango for this. Bitch couldn't have waited until Monday to shit all over us?\n\nHold me bby.",
        "created_utc": 1602019251,
        "id": "g7xte3t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602048051.0
    },
    {
        "author": "Huey_Long_Schong",
        "body": "INTC breakout. It's fucking happening!",
        "created_utc": 1602006314,
        "id": "g7wzs8z",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602035114.0
    },
    {
        "author": "JRCee",
        "body": "It’s really going to depend on the next 20 days. Big event tomorrow with another toward the end of the month. Most are saying 100 by Halloween. AMD is now taking a fuck ton of Intel market share. \n\nIntel has started “leaking” their shit CPU’s with delays because they’re afraid of embarrassment.",
        "created_utc": 1602084407,
        "id": "g80e2sz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602113207.0
    },
    {
        "author": "smokeyjay",
        "body": "Good bye INTC.  Thanks for all those put spreads.  Hope you come back",
        "created_utc": 1602086710,
        "id": "g80iqko",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602115510.0
    },
    {
        "author": "Jamdam911",
        "body": "Intel has been such a champ",
        "created_utc": 1602081446,
        "id": "g808a3c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602110246.0
    },
    {
        "author": "Normie_O1",
        "body": "Everybody! Dump NIO and INTC!",
        "created_utc": 1601649781,
        "id": "g7emk30",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601678581.0
    },
    {
        "author": "learningtosail",
        "body": "They don't make Intel's main line they make little things like NICs for intel.\n  \nBut yeah they're the best. Earnings won't be exciting though, just a mild improvement on April",
        "created_utc": 1601658261,
        "id": "g7f3764",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601687061.0
    },
    {
        "author": "Greedox2",
        "body": "INTEL PUTS! GET YA INTEL PUTS HERE!",
        "created_utc": 1601576606,
        "id": "g7badrl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601605406.0
    },
    {
        "author": "ErectHippo",
        "body": "Aren't you afraid their price already reflects this and once Intel gets their shit together AMD will take a dump?\n\nI'm on AMD too but that's my dear at least.",
        "created_utc": 1601775726,
        "id": "g7lf852",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601804526.0
    },
    {
        "author": "the_dark_side",
        "body": "Well, amd almost went bankrupt. But they are back in it. They are smaller than intel/nvidia - but are spending to catch up.",
        "created_utc": 1601778959,
        "id": "g7lowxe",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601807759.0
    },
    {
        "author": "the_dark_side",
        "body": "Haha. True.  But nukes are hated and the military loves moabs.  Nvidia’s latest card is hot and ... not a huge bump in performance.  AMD is about to drop a great new cpu to upset Intel(again) and potentially upset nvidia with a gpu in a single month.",
        "created_utc": 1601782425,
        "id": "g7ly9kp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601811225.0
    },
    {
        "author": "farrapona",
        "body": "I lost about 15k back in the late 90s on AOL INTC EBAY and maybe one other stock, can't remember.  I got out of investments except for some crappy mutual funds until 2012 and since then, well as you know it's been good times!",
        "created_utc": 1601777160,
        "id": "g7ljasf",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601805960.0
    },
    {
        "author": "noahsarc21",
        "body": "intel looks like a steal compared to other competitors in market",
        "created_utc": 1601755979,
        "id": "g7jtb1l",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601784779.0
    },
    {
        "author": "cowardly_lying",
        "body": "theta loves intc",
        "created_utc": 1601590795,
        "id": "g7c5zb4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601619595.0
    },
    {
        "author": "Long-John2",
        "body": "Not sure about monopoly. Intel still exists",
        "created_utc": 1601837436,
        "id": "g7pj1r4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601866236.0
    },
    {
        "author": "marinesol",
        "body": "So an expansive DD on Tesla. Don't do it. If the constant 10% percent fluctuations don't kill you, then the insane over 1000$ per option absolutely will.\n\nBuy calls in something like AMD which had near constantly been up and its calls are much cheaper than Tesla calls.\n\n  Also calls on both Intel and AMD. Yeah that seems like a dichotomy but both have show great performance from their laptop chips albeit in different areas. Also we are in bubble .\n\nBuy schlitz beer.",
        "created_utc": 1601873033,
        "id": "g7ranpk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601901833.0
    },
    {
        "author": "cloudone",
        "body": "She didn't buy NKLA as far as I know\n\nHer strategy make so much more sense than /r/investing 's favorites - XOM, INTC, and god forbid muh dividend Ford.",
        "created_utc": 1601842862,
        "id": "g7pvw71",
        "score": 2,
        "subreddit": "investing",
        "created": 1601871662.0
    },
    {
        "author": "Investinwaffl3s",
        "body": "Not me, About $150k in AMD Epyc servers since last year.\n\nWas a godsend while trying to scale out VDI this year. Intel all fucing backordered, only the highest SKU's in stock\n\nAMD shipping out next day overnight. Thanks again HPE, always saving my clients ass when they sit on a quote for months on end and all of a sudden need everything overnighted",
        "created_utc": 1601949370,
        "id": "g7ut2cc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601978170.0
    },
    {
        "author": "MathFerret1013",
        "body": "Intel IS the next RadioShack.",
        "created_utc": 1602042202,
        "id": "g7yxwz4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602071002.0
    },
    {
        "author": "chrischen1911",
        "body": "Inverse WSB, so all in on Intel calls.",
        "created_utc": 1602040910,
        "id": "g7yvqss",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602069710.0
    },
    {
        "author": "MathFerret1013",
        "body": "&gt;2, the upcoming arcetecture change is a dope game changer.\n\nYou cannot be serious. They have been late on chips for FOUR YEARS. 4! Thats insane you think they are going to successfully launch anew architecture they haven't fabbed yet?   \n\n\nThis new architecture is just \"big little\" which AMD is already working on. [https://www.guru3d.com/news-story/amd-flirting-with-big-little-processor-design-files-a-patent.html](https://www.guru3d.com/news-story/amd-flirting-with-big-little-processor-design-files-a-patent.html)  \n\n\n&gt; 5, puts on amd are more valuable in the mid term. Way the fuck overpriced and due for a correction.\n\nThey are literally cheaper, better, have more stable supply chain, you can actually buy them, and they keep getting better. No one is buy intel if they have a choice.",
        "created_utc": 1602044208,
        "id": "g7z0yps",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602073008.0
    },
    {
        "author": "poofscoot",
        "body": "&amp;#x200B;\n\nThis is a bunch of mumbo jumbo about intel..",
        "created_utc": 1601911100,
        "id": "g7snght",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601939900.0
    },
    {
        "author": "Spadez-",
        "body": "Lmao first DD I followed on here and I'm up 80% on those calls. this tendies shit is easy\n\nIntel 51c 10/30\n\nEdit* charts good, DD good, stonks good",
        "created_utc": 1601911300,
        "id": "g7snugh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601940100.0
    },
    {
        "author": "Jimtonicc",
        "body": "INTC calls",
        "created_utc": 1601853746,
        "id": "g7qg4ur",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601882546.0
    },
    {
        "author": "Gahvynn",
        "body": "Im now long shares on TSLA.\n\nThis will absolutely tank based on any time I’ve started going long on a stock (AMD, MSFT, INTC) so buy your puts now, or sell calls, or just straight up short it.\n\nI’m only doing it to collect premium without selling naked calls/puts (I’m writing covered calls) but I fully expect a $50/share drop before next Friday.",
        "created_utc": 1601932891,
        "id": "g7tyixz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601961691.0
    },
    {
        "author": "Pluto515",
        "body": "I usually play INTC as a low IV alternative to SPY because it followed it almost perfectly candle for candle since Sept 2, and I'm a poor. \n\nIt's recently divorced its movements from SPY, keeping all of the upside but holding strong during market downturns. I think this means it could be a good long play up to earnings.",
        "created_utc": 1601998179,
        "id": "g7wigz8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602026979.0
    },
    {
        "author": "ThrowaWayneGretzky99",
        "body": "Motley Fool is entertaining banter.  Do not trade based on their recommendations.  You'll get better intel here.",
        "created_utc": 1602004170,
        "id": "g7wukar",
        "score": 1,
        "subreddit": "investing",
        "created": 1602032970.0
    },
    {
        "author": "_Saythe_",
        "body": "No one going to talk about INTC sneaking up?",
        "created_utc": 1601993824,
        "id": "g7wa5rz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602022624.0
    },
    {
        "author": "Jamdam911",
        "body": "Intel baby !!!",
        "created_utc": 1601993156,
        "id": "g7w8yut",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602021956.0
    },
    {
        "author": "d19mc",
        "body": "It seems like you think that Apple was recycling so they can promote their pro-green stance. Which is true and it is how branding works, by enforcing what your company beliefs are, but having a look at the company as a whole, they are moving towards being self sufficient such as with their A series microprocessors, the rumored ARM MacBook (which would make them not need Intel and seeing as their contract expires this year, it makes sense to promote their pro-green actions).\n\nThis would make it so that Apple will eventually control the entire process of manufacturing, from buying the minerals from Miners to giving the product in the hands of the customer, which is cheaper than buying components through other companies such as the Intel CPUs for the current MacBooks. \n\nNow for the statement, it looks like you think that the recycling company was hired for the pure sense of recycling, and you’re right, they were: but if Apple was truly sticking by their chance of being pro-green, wouldn’t you think that Apple shouldn’t have an issue with them reselling phones the phones that Apple provides them. The recycling company wouldn’t have phone repairers (because it would be unwise to set a specialized department for one specific client), hence its more than likely for the devices to be sold to people who would like Apple devices but can’t afford new ones, or phone repairers that believe that the devices have a longer lifetime. \n\nIn short, it sounds like you believe that since the company has been hired to recycle, they should only do that, which is completely fair, but if you had the opportunity to support your business further and not break the ideals of your client (being pro-green as reselling actually does reduce pollution by a minuscule amount), wouldn’t you opt for that offer?",
        "created_utc": 1602006563,
        "id": "g7x0duw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602035363.0
    },
    {
        "author": "Oasishurler",
        "body": "Pick a company you know will win in their industry, sit back for a few decades, and enjoy the ride. I put 1k in AMD at $9 because I knew they had a better manufacturing process than Intel. I sold it all once it went up 10% to be equal with the yearly market return. Trust your instincts and just assume you'll own the stock you buy forever.",
        "created_utc": 1602006186,
        "id": "g7wzh7l",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1602034986.0
    },
    {
        "author": "_thechosenbuck",
        "body": "Wtf Intel",
        "created_utc": 1602010310,
        "id": "g7x91o9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602039110.0
    },
    {
        "author": "razorteddy",
        "body": "I like intel at 45ish but what the hell it’s not like I’m putting down millions where a few bucks makes any difference.",
        "created_utc": 1601934796,
        "id": "g7u2u8m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601963596.0
    },
    {
        "author": "CJK02",
        "body": "INTC Jan 2022 52.50C\n\nThoughts on upcoming ER?",
        "created_utc": 1601932365,
        "id": "g7txa76",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601961165.0
    },
    {
        "author": "Normie_O1",
        "body": "Fo fuking reals lol intel is boomer af now",
        "created_utc": 1601927090,
        "id": "g7tkvrr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601955890.0
    },
    {
        "author": "ExtendedDeadline",
        "body": "I think NVDA and AMD are fairly valued compared to each other, but incredibly overvalued compared to Intel. NVDA/AMD are likely also fairly or undervalued compared to the broader markets - which are grossly overvalued.\n\nFor AMD - they will soon be revenue constrained based on TSMC capacity. ATM, it looks like they're selling everything they produce. As more and more of their sales mix shifts to TSMC fabs, they will become more constrained. Even with the better products, they will only ever be able to grow revenue by a predictable amount. They're consistent, but with this constraint in place, I don't know how you can justify their current valuation.\n\nNVDA - I think they are currently worth more than INTC, while INTC makes twice the operating income that NVDA makes in total revenue. Not only this, but INTC is actually still growing revenue. \n\nThe whole TAM is expanding, such that even though NVDA and AMD have comparable or superior products, INTC is actually still growing at a respectable pace and generating considerably more revenue and profit. Part of this comes down to the fact that INTC is less supply constrained - huge fab space. Part of this is that even though AMD products are generally superior, they aren't superior for the average consumer - i.e. people buying laptops for general work, people buying desktops for general work. INTC wins in gaming, but AMD works in productivity (parallel workloads), but has a worse software stack.\n\nNVDA is growing in the server space, but not unperturbed. Competition is growing faster than NVDA is improving, and this space will be under attack in the coming half-decade. On the gaming front, NVDA is seeing it's gap close against AMD, but NVDA still has a far superior software stack. INTC is entering the GPU space in both server and consumer segments. This will still take them time, but in this time, they'll likely also remedy a lot of their FAB issues.\n\nOverall, I think AMD and NVDA have more downside than upside risk atm. They're both very vulnerable to competition, fighting for fab space and very vulnerable to any trade issues (fabs are overseas).\n\nJust my own thoughts, though.",
        "created_utc": 1601929794,
        "id": "g7tr5t2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601958594.0
    }
]