[
    {
        "author": "KenSpliffeyJr",
        "body": "PLTR forming the Wu-Tang formation meaning its about to pop high af",
        "created_utc": 1605798456,
        "id": "gcu1xs0",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1605827256.0
    },
    {
        "author": "Baydreams",
        "body": "Imagine riding your horse down to the western union so the clerk could send your buy order over the telegraph via Morse code",
        "created_utc": 1606009080,
        "id": "gd55ghy",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1606037880.0
    },
    {
        "author": "doctorsloth",
        "body": "Here are 3 that I think would be a good starting point. I personally hold these at about an even split as my bond allocation.\n\n* AGG: iShares Core Total US Bond Market ETF (U.S. Bonds)\n* MUB: iShares National AMT-Free Muni Bond ETF (U.S. Municipal Bonds)\n* BNDX: Vanguard Total International Bond ETF (International Bonds)\n\nAlso dividends from MUB are exempt from federal income taxes, so that's a perk for a taxable account.\n\nBottom line, \"You need to diversify yo bonds\" - Wu-Tang Financial",
        "created_utc": 1605677241,
        "id": "gcoxjvb",
        "score": 5,
        "subreddit": "investing",
        "created": 1605706041.0
    },
    {
        "author": "Flat_asteroids",
        "body": "Mans gotta do what mans gotta do. \n\nIt was either that or cash advance from western union.",
        "created_utc": 1606343507,
        "id": "gdllte1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606372307.0
    },
    {
        "author": "dragoniteVS",
        "body": "- First off, the founder/chairman Bruno Wu founded a company a while back called Sun Seven Stars group. There were a couple scandals that the group was related to that was pretty fishy. It didn't originate from them, but some of the people they were doing business with ended up taking a lot of money from investors.\n\n- Wu also has had no clear vision for Ideanomics. It's been a while that I did research on this so I forget some of the paths they took, but I know at one point IDEX used to be in the oil business (lol?). They would be the middle man of selling oil directly from the supplier to the consumer. It failed miserably, so then they got into fintech/blockchain because it was the next big thing (also failed). Now they're in the EV space because, you guessed it, it's the next big thing.\n\n- Ideanomics has cycled through more leadership than I care to count. I don't mind Alf Poor, but he doesn't get me excited to invest in the company.\n\n- Hindenburg Research put an article out on them back in June/July about a few things I mentioned above, but they also targeted the MEG center (glorified EV expo). They claimed that IDEX mislead shareholders into thinking that IDEX owned this entire facility, when in fact they were given permission to use part of it for selling EVs by the Chinese government. I always take everything Hindenburg says with a grain of salt because they are short sellers and looking to profit off stocks selling, but I already knew this. The way Alf and the company explained MEG to the shareholders did make it seem like they owned the entire building and that it was a full fledged operation. Not true\n\n- Speaking again of Hindenburg and MEG, they sent someone to this expo and had them take pictures and ask around about IDEX. They claimed there was no IDEX presence there in their article. IDEX took a very long time to provide any sort of proof that they actually had presence at the MEG center, and it came in the form of an LED sign outside the building that read \"MEG\". Those were probably the most painful weeks any investor has experienced, and I know they lost a TON of trust with people during this time. Imo this is the biggest point, because once you lose trust with someone, it's over.\n\n- From a financial/actual business perspective, their balance sheet was bad at the start of this year, but I will say they did clean it up a little regarding debt (nothing too impressive). The thing that was keeping their share price so high (and is now) is the China EV market. I will admit, there is amazing potential there, and when Alf laid out the PowerPoints with the potential order numbers, I was impressed. I sat on so many virtual conferences with these guys, and I always liked the outlook. However, when actual numbers came in, they were abysmal. The meat of their backlog is the electric bus orders, but as far as I know, none have been filled even to this day.\n\nThere's a lot more but I'll spare the details. It's fine to play the hype train, but from a long term investing perspective, I will never buy and hold IDEX. Good luck 👍",
        "created_utc": 1605919759,
        "id": "gd0036l",
        "score": 3,
        "subreddit": "investing",
        "created": 1605948559.0
    },
    {
        "author": "Ameri-CantBeWrong",
        "body": " *“Rail travel at high speed is not possible because passengers, unable to breathe, would die of asphyxia.” – Dr. Dionysius Lardner, 1830 (the Shanghai Maglev can travel at 267 mph/431 km/hr)* \n\n&amp;#x200B;\n\n *“This ‘telephone’ has too many shortcomings to be seriously considered as a means of communication.” — William Orton, President of Western Union – 1876* \n\n&amp;#x200B;\n\n *“I must confess that my imagination refuses to see any sort of submarine doing anything but suffocating its crew and floundering at sea.” – HG Wells – 1901* \n\n&amp;#x200B;\n\n *“Stock prices have reached a permanently high plateau.” – Yale economist, Irving Fisher, 1929, after the Dow Jones reached 381.17 points (Currently the Dow Jones is at 26,048.51 points which is a 6733.83% increase upon his prediction, and not far off the all-time record of 26,828.39 set on October 3, 2018)* \n\n&amp;#x200B;\n\n *“Heavier-than-air flying machines are impossible.” – Lord Kelvin, Mathematician and Physicist, President of the Royal Society, 1895* \n\n&amp;#x200B;\n\n *“A rocket will never be able to leave the Earth’s atmosphere.” – New York Times, 1936 (Manned missions to Mars are planned by the mid 2030’s)* \n\n&amp;#x200B;\n\n *“The horse is here to stay, but the automobile is only a novelty, a fad.” – President of the Michigan Savings Bank, 1903 (Currently there are 1.2 billion motor vehicles in the world and that number is expected to grow to 2 billion by 2040)* \n\n&amp;#x200B;\n\n *“There is not the slightest indication that nuclear energy will ever be obtainable. It would mean that the atom would have to be shattered at will.” – Albert Einstein, 1932* \n\n&amp;#x200B;\n\n *“Television won’t last because people will soon get tired of staring at a plywood box every night.” – Darryl Zanuck, co-founder of 20th Century Fox, 1946 (The average American watches 5 hours of TV a day which works out to be 15 years/12% of your life, if you live to the average life expectancy of 78)* \n\n&amp;#x200B;\n\n *“I think there is a world market for maybe five computers.” – Thomas Watson, president of IBM, 1943* \n\n&amp;#x200B;\n\n *“Remote shopping, while entirely feasible, will flop, because women like to get out of the house, like to handle the merchandise, like to be able to change their minds.” – Time Magazine, 1966 (E-commerce is currently a $2.3 Trillion dollar a year economy, and it is projected to grow to $4.88 trillion US dollars in 2021* \n\n&amp;#x200B;\n\n *“I predict the internet will soon go spectacularly supernova and in 1996 catastrophically collapse.” – Robert Metcalfe, Founder of 3 Com, 1995 (two years later he was forced to eat his words during his keynote speech* *at the International World Wide Web Conference in 1997, when he took a printed copy of his column that predicted the collapse, put it in a blender with some liquid and then drank it)* \n\n&amp;#x200B;\n\n *“There’s no chance that the iPhone is going to get any significant market share.” — Steve Ballmer, Microsoft CEO, 2007 (The iPhone is easily the world’s most popular smartphone and now owns at least 40% of the US market. Since it’s release in 2007, Apple has sold over 1.2 Billion iPhone’s making $100+ Billion in net profit)* \n\n&amp;#x200B;\n\n *“Everything that can be invented, has been invented.” Charles H. Duell, Commissioner of US patent office, 1899 (There are now at least 10 Million Patents in America alone and at least 300, 000 new patents issued each year)* ",
        "created_utc": 1606500286,
        "id": "gdsbcii",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606529086.0
    },
    {
        "author": "StonkerGraduation",
        "body": "Also found this\n\n“That is going to have an impact on how the market values it and sees the risk,” said Mr Wu, whose fund owns a stake in Alibaba, the Chinese ecommerce group from which Ant was spun off.\n\nThe IPO is “not going to happen any time soon”, he added. “It could be six months, nine months, a year or two.”",
        "created_utc": 1605727195,
        "id": "gcqyh0y",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605755995.0
    },
    {
        "author": "afishnsea",
        "body": "We should bring Chappelle's dream of Wu Tang Financial to fruition with a new ETF, we'll call it WUT.  Accepting company holding ideas below:",
        "created_utc": 1604683649,
        "id": "gbd5v5a",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604712449.0
    },
    {
        "author": "TopShelfStanley",
        "body": "“Diversify your bonds, nigga.” \n- The GZA, Wu-Tang Clan.\n\nYou’re playing options and not bonds, you shouldn’t diversify, classic misunderstanding.",
        "created_utc": 1606264305,
        "id": "gdi41hx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606293105.0
    },
    {
        "author": "hodlforlyfe",
        "body": "Half you people won't know what this is but...Moneygram. Shares and LEAPS will print over the next 1-2 years. Just look at the innovation and growth this company has had the last year. $500 million market cap? Are you kidding me? Its closest competitor Western Union is worth $8b, so the upside is tremendous. I'm telling you this thing is a grandslam. Read the latest earnings and transaction growth and see for yourself.\n\n\nTLDR: buy moneygram foogitz",
        "created_utc": 1605570018,
        "id": "gcjyz55",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605598818.0
    },
    {
        "author": "44allstar",
        "body": "My son's mom just canceled hers for spring as well...these cruise plays are anything but certain.  The kind of ppl that like cruises are the same assholes that wear a mask everywhere and are terrified of the wu flu.",
        "created_utc": 1606686438,
        "id": "ge32c2m",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606715238.0
    },
    {
        "author": "xolican",
        "body": "Jordan Wu is that you? Already up 50%? Sounds about right for WSB",
        "created_utc": 1606613470,
        "id": "gdyjl93",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606642270.0
    },
    {
        "author": "bubblesmcnutty",
        "body": "&gt;How can it be a reserve asset when it has no intrinsic use? \n\nIt has plenty of intrinsic value (see below). As for it being a reserve asset, it is the hardest asset known to man. There is a reason BTC was recently added to the balance sheets of Square, MicroStrategy, and numerous hedge funds. \n\nhttps://ir.microstrategy.com/news-releases/news-release-details/microstrategy-adopts-bitcoin-primary-treasury-reserve-asset\n\nhttps://squareup.com/us/en/press/2020-bitcoin-investment\n\n&gt;Gold and silver are semiconductors and thus always have some value. \n\nSomething like 20% of golds price is based on utility. The rest is entirely speculative. Its use-case outside of semiconductors is even worse than BTC. It has an unknown supply and is very difficult to transport and transact with. \n\nBitcoin has plenty of intrinsic use. These include borderless transfer without needing to convert to to local currency (cant do this with Western Union), black markets, safe haven from oppressive governments, sending aid to citizens of oppressive governments, ways to bypass import sanctions (see Iran), and more. Just because you don't have intrinsic use for BTC, doesn't mean others don't (see links below). \n\nhttps://www.nytimes.com/2019/02/23/opinion/sunday/venezuela-bitcoin-inflation-cryptocurrencies.html\n\nhttps://www.nasdaq.com/articles/amid-protests-bitcoin-gives-nigerians-alternative-to-banking-system-2020-10-19\n\nhttps://asiatimes.com/2020/10/iran-to-use-bitcoin-to-fund-imports/\n\n&gt;Anyone can clone Bitcoin and spin up their own Blockchain, and there are hundreds of altcoins that do things better.\n\nOf course they can and they have, thats the beauty of being open source. However, all of those forks continue to die a slow, painful death. This is like saying anyone can create a better social network than Facebook and therefore Facebook has no value. Just like with Facebook,  network effects are real. BTC is trusted and secure and every day it doesn't die it becomes stronger. \n\n&gt;Best case scenario Bitcoin remains a niche currency used by tech enthusiasts and criminals online. Worst case scenario governments ban it due to usage by criminals, and it's valuation tanks due to inability to buy/sell through an exchange.\n\nWrong. Best case scenario is that BTC continues to be added to the balance sheets of large, publicly traded companies and that small nations continue adopting it until it can no longer be ignored all while second layer solutions continue to be improved upon. This is literally already happening. Its not speculative at this point\n\n&gt;You can say \"what about fiat currency it has no intrinsic use\". It's still legally required to be accepted to settle debts, and is required to pay taxes that are mandated by law. So it has statutory support. Also fiat currency generally isn't an investment besides as a hedge.\n\nAgain BTC does have intrinsic use today and those uses will continue to expand. The genie is out of the bottle at this point and adoption is occurring rapidly.",
        "created_utc": 1605023106,
        "id": "gbu4a2k",
        "score": 2,
        "subreddit": "investing",
        "created": 1605051906.0
    },
    {
        "author": "cheeseburger5786",
        "body": "Wu Tang Clan ain’t nutin to fuck with!",
        "created_utc": 1605760403,
        "id": "gcsri4p",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1605789203.0
    },
    {
        "author": "Au_contraire_zippy",
        "body": "hang dai, Wu  🤞\n\ncocksucker",
        "created_utc": 1604336624,
        "id": "gawv7f9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604365424.0
    },
    {
        "author": "dwaynebank",
        "body": "Not nearly as exciting as some other people on here, but I put a considerable amount of money into TTD a year ago and I've gotten over 200% return. Pretty crazy considering as covid was breaking out I was 50% in the red. lol\n\nI've since pulled out half of my investment and moved into other great investments that I'm excited about. [Listen to Wu-Tang.](https://www.youtube.com/watch?v=DdSfTsTSjwA)",
        "created_utc": 1605051321,
        "id": "gbvqqt4",
        "score": 2,
        "subreddit": "investing",
        "created": 1605080121.0
    },
    {
        "author": "morten_tor",
        "body": "You are comparing a currency to a payment processor. You should compare BTC to currency and the coin exchanges (on- and offboard) to PayPal and Western Union. You could also compare to VISA and SWIFT. \n\nThe difference then, is that FIAT is backed by the threat of violence, whereas BTC is not backed by anything. There is no government willing to protect its value. But on the other hand, no government can debase it. But debasement protection does not require BTC either,",
        "created_utc": 1606674430,
        "id": "ge29uen",
        "score": 2,
        "subreddit": "investing",
        "created": 1606703230.0
    },
    {
        "author": "rainforestriver",
        "body": "Is this from Shkreli's Wu-Tang album",
        "created_utc": 1606204002,
        "id": "gdf5rwq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606232802.0
    },
    {
        "author": "ssryoken2",
        "body": "They are first company to use blockchain at scale to reduce the cost remittances by 60+% using XRP payment corridors. Currently they are doing 10 percent of all US to Mexican peso remittances up from 4 percent just last year and that volume is growing. This is why Western Union offered to buy them but moneygram turned them down. It’s cause they know the technology is gonna put western union in second place.",
        "created_utc": 1605573799,
        "id": "gck6te5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605602599.0
    },
    {
        "author": "numbnah",
        "body": "You're probably right. I lowballed my numbers by a lot to appease the 5 dime (Wu Mao)",
        "created_utc": 1604816809,
        "id": "gbkh8u1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604845609.0
    },
    {
        "author": "BenZaye",
        "body": "It’s like western union is a money transfer company",
        "created_utc": 1605614450,
        "id": "gclp53c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605643250.0
    },
    {
        "author": "RecklesslyPessmystic",
        "body": "wu wu wu wu wu",
        "created_utc": 1605644253,
        "id": "gcn9my0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605673053.0
    },
    {
        "author": "bubblesmcnutty",
        "body": "&gt;That's not how it would work if tether fraudulent. People could be stuck completely unable to pull money out of the system. If the whole market is propped up by dollars that are not real dollars but people accept them as real dollars, then guess what happens if that falls apart.\n\nAgain, Tether likely does some sketchy shit. Its looked down upon by crypto purists as well. That being said, its not nearly as significant as its made out to be.\n\n&gt;yeah I'm calling bullshit that corporations are buying it hand over fist. It's a supply-demand commodity that a bunch of people are bag holding and doing nothing with... As a result the market appears to have limited supply at times, but it's only a few market manipulators and a little bit of momentum. None of that is really a value proposition.\n\nI never said companies are buying it hand over fist (yet).I said large, pubicly traded companies have just begun not only buying it, but adding it to their balance sheets. Square and MicroStrategy are the two biggest examples.\n\nI believe this trend is just getting started. Time will tell.\n\n&gt;chaos hedge? If there's actual chaos, you need internet and electricity for it to even matter. Actual chaos has neither of those things. The rest of what you said is crypto fan fic. Might as well build a bunker and stock it full of guns and canned food.\n\nInteresting, i wasn't aware chaos had to involve a complete and utter shutdown of the electricity grid and/or Internet. Bit hyperbolic dont you think?\n\n&gt;it's still a drop in the bucket compared to 2016. Congrats on Paypal, still latgely irrelevant. It's always about it's price in sweet sweet USD after all.\n\nNo no -- right now is most similar to 2016. It was in 2016 when BTC slowly made its way back to its previous ATH of $1K (from $200). It was 2017 when the fireworks started. Those are coming. Interestingly enough 2016-2018 was almost entirely retail investors. Now that institutions are in the mix? Look out.\n\n&gt;oh Jesus Christ. A) there are other ways to avoid hyper inflation than buying bitcoin.\n\nSuch as?\n\n&gt;B) most of the people in those countries don't own bitcoin and won't.\n\nMost don't, plenty do. Who are you to criticize what actions they take to protect themselves and their families?\n\n&gt;If you actually cared about those people you'd probably try to circulate the currency around instead of pretending that the best thing we can all do for the really poor people in hyperinflation countries is to just buy and hold bitcoin.\n\nHow exactly do you plan to do that? Sending them money via Western Union forces them to withdraw in their home currency. The same home currency that devalues itself by the literal minute.\n\nFurthermore, both Venezuela and Nigeria were seizing aid because...central banking! BTC helps to solve this. Also - how do you know I haven't sent small amounts of BTC as aid to both countries. Many people have - thats why its been so helpful!\n\n&gt;Do it for the poor starving kids. BTC to $1MM.\n\nBTC to $1mm would be beneficial to myself as well as those in Venezuela who are holding it. It's not an either/or situation, pal.",
        "created_utc": 1604431105,
        "id": "gb18yxv",
        "score": 1,
        "subreddit": "investing",
        "created": 1604459905.0
    },
    {
        "author": "Au_contraire_zippy",
        "body": "celestial cock suckers, Wu",
        "created_utc": 1604453758,
        "id": "gb2he19",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604482558.0
    },
    {
        "author": "Unsavory1",
        "body": "Should I yolo some ZM? All the talking heads are saying dark harrowing winter coming up because of the wu flu.",
        "created_utc": 1605179652,
        "id": "gc19wgl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605208452.0
    },
    {
        "author": "thedmob",
        "body": "Eu will never matter a lot for weed. Consumers don’t use weed there as much as in the US. WU doesn’t matter for booze because they drink beer and wine. Will be same for weed.",
        "created_utc": 1605202866,
        "id": "gc2cwal",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1605231666.0
    },
    {
        "author": "Jos_Meid",
        "body": "Something with a low P/E ratio, regular, steady profits and a long track record of being a sustainable business. Personally, I invested in Western Union for that reason, but most blue chip stocks would work just fine.",
        "created_utc": 1605459619,
        "id": "gcejvs4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605488419.0
    },
    {
        "author": "___alexa___",
        "body": "ɴᴏᴡ ᴘʟᴀʏɪɴɢ: [Wu-Tang Clan - Protect Ya Ne](https://www.youtube.com/watch?v=1_-3Bh1VFI8) ─────────⚪───── ◄◄⠀[▶](https://www.youtube.com/watch?v=1_-3Bh1VFI8)⠀►►⠀ 3:06 / 4:39 ⠀ ───○ 🔊 ᴴᴰ ⚙️",
        "created_utc": 1605643342,
        "id": "gcn7nqh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605672142.0
    },
    {
        "author": "StubaKuula",
        "body": "Yang Wu, Microvast's founder, Chairman and CEO added: \"Our potential transition into a public company will help continue to fuel our design and development of market-leading ultra-fast charging, long-life battery power systems. Microvast expects to generate over $100 million of revenue this financial year. With the automotive technology experience and capital this transaction with Tuscan is intended to provide, we are confident we can build upon our established success and accelerate our growth in the electric vehicle battery industry.\"",
        "created_utc": 1606544206,
        "id": "gduc3r1",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1606573006.0
    },
    {
        "author": "SlowerThanSuperman",
        "body": "You can send funds to anyone, anywhere, and nobody can stop you. Cuba was recently cut off from Western Union transactions, and this is only one recent example of government interference that Bitcoin is immune to.\n\nYou may not think this is valuable, but if you found yourself in a situation where a powerful entity was preventing you from spending or sending money for whatever reason you would start to understand.",
        "created_utc": 1606532150,
        "id": "gdtvafw",
        "score": 1,
        "subreddit": "investing",
        "created": 1606560950.0
    },
    {
        "author": "Jp30696",
        "body": "Well, I got family in Manassas, this seems a very reasonable solution but I don't have a visa for enter right now in the US. And if I use their banks accounts the only way I could transfer me money would be on paypal or western union (very dangerous since I could be mugged in Nic), nor directly into my account here in Nicaragua, and so far I know our nationals banks don't support an paypal-to-account transfer service.",
        "created_utc": 1606008342,
        "id": "gd53zzc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606037142.0
    },
    {
        "author": "BTC-100k",
        "body": "Thank you for sharing. \n\nFrom my POV, one shouldn't focus on the value or the price. It's also too early to trying to figure out exactly what bitcoin is or will become (store of value, payment system, monetary unit, method for software applications to validate each other without a central provider, etc).\n\nIt isn't about getting rich and it isn't about a new world order. I find it most useful to think of the bitcoin protocol in the same way we view other protocols (ftp for files, https for secure web, sip for calls, tcp for data assembly, ip for data routing, etc). It's just another layer to the internet, albeit an incredibly powerful layer that I personally believe will eclipse all others aside from tcp/ip &amp; https.\n\nEvery time I hear people trying to prescribe what exactly bitcoin is or will be all I can think about are these quotes:\n\n&gt;\"By 2005 or so, it will become clear that the Internet’s impact on the economy has been no greater than the fax machine’s.” Paul Krugman\n\n&gt;\"This 'telephone' has too many shortcomings to be seriously considered as a means of communication.\" William Orton, President of Western Union\n\n&gt;“Fooling around with alternating current (AC) is just a waste of time. Nobody will use it, ever.” Thomas Edison \n\n&gt;\"I think there is a world market for maybe five computers.\" Thomas Watson, chairman of IBM\n\nThe limited supply and ownership of a digital asset that is secured by a system processing 131,000,000,000,000,000,000 SHA-256 calculations per second on a global scale that has built in governance and economic incentive is powerful. Will it change the world, yes. Will it make everyone who invests rich or poor, who the heck knows :)",
        "created_utc": 1605824455,
        "id": "gcvmwvi",
        "score": 1,
        "subreddit": "investing",
        "created": 1605853255.0
    },
    {
        "author": "soyarriba",
        "body": "Western union puts",
        "created_utc": 1604271071,
        "id": "gau8pi6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604299871.0
    },
    {
        "author": "skilliard7",
        "body": "&gt; Bitcoin has plenty of intrinsic use. These include borderless transfer without needing to convert to to local currency (cant do this with Western Union), black markets, safe haven from oppressive governments, sending aid to citizens of oppressive governments, ways to bypass import sanctions (see Iran), and more. Just because you don't have intrinsic use for BTC, doesn't mean others don't (see link below).\n\nYou can do this with Ethereum, Litecoin, Monero, Vertcoin, even Dogecoin. I agree cryptocurrency and blockchains are useful but I don't see Bitcoin as a long term store of value. It's far more volatile than precious metals and also intangible.\n\nIBM is making huge strides towards quantum computing, and once they pull it off, Bitcoin will become worthless once the public/private key cryptography is cracked and anyone with access to a quantum computer can simply sign transactions to send coins to themselves. We're easily within 10 years at this point, possibly less.\n\n&gt;This is like saying anyone can create a better social network than Facebook and therefore Facebook has no value\n\nWhat about Myspace? It came first.\n\n&gt;Wrong. Best case scenario is that BTC continues to be added to the balance sheets of large, publicly traded companies\n\nLike 1 or 2 companies that hold it as a tiny position. I think Overstock and Square? Most companies that accept it just use Bitpay or Coinbase to instantly sell it.",
        "created_utc": 1605023410,
        "id": "gbu4wlq",
        "score": 1,
        "subreddit": "investing",
        "created": 1605052210.0
    },
    {
        "author": "zhalek",
        "body": "please don’t disgrace the wu with your ev banter",
        "created_utc": 1605285691,
        "id": "gc5z37n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605314491.0
    },
    {
        "author": "cordialpumpkin",
        "body": "AMZN daily chart repping  Wu-Tang",
        "created_utc": 1605300980,
        "id": "gc6u84v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605329780.0
    },
    {
        "author": "anundfuersich",
        "body": "90+% revenue and most operations, employees, and mfg in China. \n\nCEO is Yang Wu\nCFO is Yanzhuan Zheng \nCTO is Li Xiang\nCOO is Diaokun Xiao \n\nThe HQ in TX is a small presence — maybe 10 people on busier days — in a crappy office building. They have huge campus in Huzhou with thousands of employee. Most Sr Management and more than 95% of employees are based in China.\n\nEven CEO/CFO pre COVID spent most of their time in China.",
        "created_utc": 1605633706,
        "id": "gcmmlv1",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1605662506.0
    },
    {
        "author": "dragoniteVS",
        "body": "Copy and pasted from another comment, TL;DR I'm staying away:\n\n- First off, the founder/chairman Bruno Wu founded a company a while back called Sun Seven Stars group. There were a couple scandals that the group was related to that was pretty fishy. It didn't originate from them, but some of the people they were doing business with ended up taking a lot of money from investors.\n\n- Wu also has had no clear vision for Ideanomics. It's been a while that I did research on this so I forget some of the paths they took, but I know at one point IDEX used to be in the oil business (lol?). They would be the middle man of selling oil directly from the supplier to the consumer. It failed miserably, so then they got into fintech/blockchain because it was the next big thing (also failed). Now they're in the EV space because, you guessed it, it's the next big thing.\n\n- Ideanomics has cycled through more leadership than I care to count. I don't mind Alf Poor, but he doesn't get me excited to invest in the company.\n\n- Hindenburg Research put an article out on them back in June/July about a few things I mentioned above, but they also targeted the MEG center (glorified EV expo). They claimed that IDEX mislead shareholders into thinking that IDEX owned this entire facility, when in fact they were given permission to use part of it for selling EVs by the Chinese government. I always take everything Hindenburg says with a grain of salt because they are short sellers and looking to profit off stocks selling, but I already knew this. The way Alf and the company explained MEG to the shareholders did make it seem like they owned the entire building and that it was a full fledged operation. Not true\n\n- Speaking again of Hindenburg and MEG, they sent someone to this expo and had them take pictures and ask around about IDEX. They claimed there was no IDEX presence there in their article. IDEX took a very long time to provide any sort of proof that they actually had presence at the MEG center, and it came in the form of an LED sign outside the building that read \"MEG\". Those were probably the most painful weeks any investor has experienced, and I know they lost a TON of trust with people during this time. Imo this is the biggest point, because once you lose trust with someone, it's over.\n\n- From a financial/actual business perspective, their balance sheet was bad at the start of this year, but I will say they did clean it up a little regarding debt (nothing too impressive). The thing that was keeping their share price so high (and is now) is the China EV market. I will admit, there is amazing potential there, and when Alf laid out the PowerPoints with the potential order numbers, I was impressed. I sat on so many virtual conferences with these guys, and I always liked the outlook. However, when actual numbers came in, they were abysmal. The meat of their backlog is the electric bus orders, but as far as I know, none have been filled even to this day.\n\nThere's a lot more but I'll spare the details. It's fine to play the hype train, but from a long term investing perspective, I will never buy and hold IDEX. Good luck 👍",
        "created_utc": 1606246242,
        "id": "gdh4027",
        "score": 1,
        "subreddit": "investing",
        "created": 1606275042.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "https://www.prnewswire.com/news-releases/tuscan-holdings-corp-announces-intent-to-combine-with-microvast-inc-301172882.html\n\n&gt; \"Microvast has a compelling financial profile, with significant historical revenues as well as projected growth and profitability.  With its battery technology installed in over 28,000 vehicles worldwide, an impressive,  growing list of global OEM customers, and a strategic partnership with Fiat Power Train Industrial, Microvast is a proven technology leader driving the mass adoption of EVs.  We are excited to partner with Mr. Wu and his experienced team and believe the valuation negotiated provides long term intrinsic value to Tuscan shareholders.  We look forward to supporting Microvast in its next phase of growth as a public company,",
        "created_utc": 1606263293,
        "id": "gdi268n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606292093.0
    },
    {
        "author": "WaySheGoesBub",
        "body": "Wu-Tang Financial Services",
        "created_utc": 1606412353,
        "id": "gdojqoa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606441153.0
    },
    {
        "author": "zxcvzzzzxz",
        "body": "Killa Beez - Wu Tang Clan",
        "created_utc": 1606414752,
        "id": "gdop1ol",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606443552.0
    },
    {
        "author": "kingsOTHERjester",
        "body": "Question:\n\nWhat is the intrinsic value of PayPal or western union?",
        "created_utc": 1606673924,
        "id": "ge28t06",
        "score": -1,
        "subreddit": "investing",
        "created": 1606702724.0
    },
    {
        "author": "KenSpliffeyJr",
        "body": "PLTR forming the Wu-Tang formation meaning its about to pop high af",
        "created_utc": 1605798456,
        "id": "gcu1xs0",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1605827256.0
    },
    {
        "author": "Baydreams",
        "body": "Imagine riding your horse down to the western union so the clerk could send your buy order over the telegraph via Morse code",
        "created_utc": 1606009080,
        "id": "gd55ghy",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1606037880.0
    },
    {
        "author": "doctorsloth",
        "body": "Here are 3 that I think would be a good starting point. I personally hold these at about an even split as my bond allocation.\n\n* AGG: iShares Core Total US Bond Market ETF (U.S. Bonds)\n* MUB: iShares National AMT-Free Muni Bond ETF (U.S. Municipal Bonds)\n* BNDX: Vanguard Total International Bond ETF (International Bonds)\n\nAlso dividends from MUB are exempt from federal income taxes, so that's a perk for a taxable account.\n\nBottom line, \"You need to diversify yo bonds\" - Wu-Tang Financial",
        "created_utc": 1605677241,
        "id": "gcoxjvb",
        "score": 5,
        "subreddit": "investing",
        "created": 1605706041.0
    },
    {
        "author": "Flat_asteroids",
        "body": "Mans gotta do what mans gotta do. \n\nIt was either that or cash advance from western union.",
        "created_utc": 1606343507,
        "id": "gdllte1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606372307.0
    },
    {
        "author": "dragoniteVS",
        "body": "- First off, the founder/chairman Bruno Wu founded a company a while back called Sun Seven Stars group. There were a couple scandals that the group was related to that was pretty fishy. It didn't originate from them, but some of the people they were doing business with ended up taking a lot of money from investors.\n\n- Wu also has had no clear vision for Ideanomics. It's been a while that I did research on this so I forget some of the paths they took, but I know at one point IDEX used to be in the oil business (lol?). They would be the middle man of selling oil directly from the supplier to the consumer. It failed miserably, so then they got into fintech/blockchain because it was the next big thing (also failed). Now they're in the EV space because, you guessed it, it's the next big thing.\n\n- Ideanomics has cycled through more leadership than I care to count. I don't mind Alf Poor, but he doesn't get me excited to invest in the company.\n\n- Hindenburg Research put an article out on them back in June/July about a few things I mentioned above, but they also targeted the MEG center (glorified EV expo). They claimed that IDEX mislead shareholders into thinking that IDEX owned this entire facility, when in fact they were given permission to use part of it for selling EVs by the Chinese government. I always take everything Hindenburg says with a grain of salt because they are short sellers and looking to profit off stocks selling, but I already knew this. The way Alf and the company explained MEG to the shareholders did make it seem like they owned the entire building and that it was a full fledged operation. Not true\n\n- Speaking again of Hindenburg and MEG, they sent someone to this expo and had them take pictures and ask around about IDEX. They claimed there was no IDEX presence there in their article. IDEX took a very long time to provide any sort of proof that they actually had presence at the MEG center, and it came in the form of an LED sign outside the building that read \"MEG\". Those were probably the most painful weeks any investor has experienced, and I know they lost a TON of trust with people during this time. Imo this is the biggest point, because once you lose trust with someone, it's over.\n\n- From a financial/actual business perspective, their balance sheet was bad at the start of this year, but I will say they did clean it up a little regarding debt (nothing too impressive). The thing that was keeping their share price so high (and is now) is the China EV market. I will admit, there is amazing potential there, and when Alf laid out the PowerPoints with the potential order numbers, I was impressed. I sat on so many virtual conferences with these guys, and I always liked the outlook. However, when actual numbers came in, they were abysmal. The meat of their backlog is the electric bus orders, but as far as I know, none have been filled even to this day.\n\nThere's a lot more but I'll spare the details. It's fine to play the hype train, but from a long term investing perspective, I will never buy and hold IDEX. Good luck 👍",
        "created_utc": 1605919759,
        "id": "gd0036l",
        "score": 3,
        "subreddit": "investing",
        "created": 1605948559.0
    },
    {
        "author": "Ameri-CantBeWrong",
        "body": " *“Rail travel at high speed is not possible because passengers, unable to breathe, would die of asphyxia.” – Dr. Dionysius Lardner, 1830 (the Shanghai Maglev can travel at 267 mph/431 km/hr)* \n\n&amp;#x200B;\n\n *“This ‘telephone’ has too many shortcomings to be seriously considered as a means of communication.” — William Orton, President of Western Union – 1876* \n\n&amp;#x200B;\n\n *“I must confess that my imagination refuses to see any sort of submarine doing anything but suffocating its crew and floundering at sea.” – HG Wells – 1901* \n\n&amp;#x200B;\n\n *“Stock prices have reached a permanently high plateau.” – Yale economist, Irving Fisher, 1929, after the Dow Jones reached 381.17 points (Currently the Dow Jones is at 26,048.51 points which is a 6733.83% increase upon his prediction, and not far off the all-time record of 26,828.39 set on October 3, 2018)* \n\n&amp;#x200B;\n\n *“Heavier-than-air flying machines are impossible.” – Lord Kelvin, Mathematician and Physicist, President of the Royal Society, 1895* \n\n&amp;#x200B;\n\n *“A rocket will never be able to leave the Earth’s atmosphere.” – New York Times, 1936 (Manned missions to Mars are planned by the mid 2030’s)* \n\n&amp;#x200B;\n\n *“The horse is here to stay, but the automobile is only a novelty, a fad.” – President of the Michigan Savings Bank, 1903 (Currently there are 1.2 billion motor vehicles in the world and that number is expected to grow to 2 billion by 2040)* \n\n&amp;#x200B;\n\n *“There is not the slightest indication that nuclear energy will ever be obtainable. It would mean that the atom would have to be shattered at will.” – Albert Einstein, 1932* \n\n&amp;#x200B;\n\n *“Television won’t last because people will soon get tired of staring at a plywood box every night.” – Darryl Zanuck, co-founder of 20th Century Fox, 1946 (The average American watches 5 hours of TV a day which works out to be 15 years/12% of your life, if you live to the average life expectancy of 78)* \n\n&amp;#x200B;\n\n *“I think there is a world market for maybe five computers.” – Thomas Watson, president of IBM, 1943* \n\n&amp;#x200B;\n\n *“Remote shopping, while entirely feasible, will flop, because women like to get out of the house, like to handle the merchandise, like to be able to change their minds.” – Time Magazine, 1966 (E-commerce is currently a $2.3 Trillion dollar a year economy, and it is projected to grow to $4.88 trillion US dollars in 2021* \n\n&amp;#x200B;\n\n *“I predict the internet will soon go spectacularly supernova and in 1996 catastrophically collapse.” – Robert Metcalfe, Founder of 3 Com, 1995 (two years later he was forced to eat his words during his keynote speech* *at the International World Wide Web Conference in 1997, when he took a printed copy of his column that predicted the collapse, put it in a blender with some liquid and then drank it)* \n\n&amp;#x200B;\n\n *“There’s no chance that the iPhone is going to get any significant market share.” — Steve Ballmer, Microsoft CEO, 2007 (The iPhone is easily the world’s most popular smartphone and now owns at least 40% of the US market. Since it’s release in 2007, Apple has sold over 1.2 Billion iPhone’s making $100+ Billion in net profit)* \n\n&amp;#x200B;\n\n *“Everything that can be invented, has been invented.” Charles H. Duell, Commissioner of US patent office, 1899 (There are now at least 10 Million Patents in America alone and at least 300, 000 new patents issued each year)* ",
        "created_utc": 1606500286,
        "id": "gdsbcii",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606529086.0
    },
    {
        "author": "StonkerGraduation",
        "body": "Also found this\n\n“That is going to have an impact on how the market values it and sees the risk,” said Mr Wu, whose fund owns a stake in Alibaba, the Chinese ecommerce group from which Ant was spun off.\n\nThe IPO is “not going to happen any time soon”, he added. “It could be six months, nine months, a year or two.”",
        "created_utc": 1605727195,
        "id": "gcqyh0y",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605755995.0
    },
    {
        "author": "afishnsea",
        "body": "We should bring Chappelle's dream of Wu Tang Financial to fruition with a new ETF, we'll call it WUT.  Accepting company holding ideas below:",
        "created_utc": 1604683649,
        "id": "gbd5v5a",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604712449.0
    },
    {
        "author": "TopShelfStanley",
        "body": "“Diversify your bonds, nigga.” \n- The GZA, Wu-Tang Clan.\n\nYou’re playing options and not bonds, you shouldn’t diversify, classic misunderstanding.",
        "created_utc": 1606264305,
        "id": "gdi41hx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606293105.0
    },
    {
        "author": "hodlforlyfe",
        "body": "Half you people won't know what this is but...Moneygram. Shares and LEAPS will print over the next 1-2 years. Just look at the innovation and growth this company has had the last year. $500 million market cap? Are you kidding me? Its closest competitor Western Union is worth $8b, so the upside is tremendous. I'm telling you this thing is a grandslam. Read the latest earnings and transaction growth and see for yourself.\n\n\nTLDR: buy moneygram foogitz",
        "created_utc": 1605570018,
        "id": "gcjyz55",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605598818.0
    },
    {
        "author": "xolican",
        "body": "Jordan Wu is that you? Already up 50%? Sounds about right for WSB",
        "created_utc": 1606613470,
        "id": "gdyjl93",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606642270.0
    },
    {
        "author": "bubblesmcnutty",
        "body": "&gt;How can it be a reserve asset when it has no intrinsic use? \n\nIt has plenty of intrinsic value (see below). As for it being a reserve asset, it is the hardest asset known to man. There is a reason BTC was recently added to the balance sheets of Square, MicroStrategy, and numerous hedge funds. \n\nhttps://ir.microstrategy.com/news-releases/news-release-details/microstrategy-adopts-bitcoin-primary-treasury-reserve-asset\n\nhttps://squareup.com/us/en/press/2020-bitcoin-investment\n\n&gt;Gold and silver are semiconductors and thus always have some value. \n\nSomething like 20% of golds price is based on utility. The rest is entirely speculative. Its use-case outside of semiconductors is even worse than BTC. It has an unknown supply and is very difficult to transport and transact with. \n\nBitcoin has plenty of intrinsic use. These include borderless transfer without needing to convert to to local currency (cant do this with Western Union), black markets, safe haven from oppressive governments, sending aid to citizens of oppressive governments, ways to bypass import sanctions (see Iran), and more. Just because you don't have intrinsic use for BTC, doesn't mean others don't (see links below). \n\nhttps://www.nytimes.com/2019/02/23/opinion/sunday/venezuela-bitcoin-inflation-cryptocurrencies.html\n\nhttps://www.nasdaq.com/articles/amid-protests-bitcoin-gives-nigerians-alternative-to-banking-system-2020-10-19\n\nhttps://asiatimes.com/2020/10/iran-to-use-bitcoin-to-fund-imports/\n\n&gt;Anyone can clone Bitcoin and spin up their own Blockchain, and there are hundreds of altcoins that do things better.\n\nOf course they can and they have, thats the beauty of being open source. However, all of those forks continue to die a slow, painful death. This is like saying anyone can create a better social network than Facebook and therefore Facebook has no value. Just like with Facebook,  network effects are real. BTC is trusted and secure and every day it doesn't die it becomes stronger. \n\n&gt;Best case scenario Bitcoin remains a niche currency used by tech enthusiasts and criminals online. Worst case scenario governments ban it due to usage by criminals, and it's valuation tanks due to inability to buy/sell through an exchange.\n\nWrong. Best case scenario is that BTC continues to be added to the balance sheets of large, publicly traded companies and that small nations continue adopting it until it can no longer be ignored all while second layer solutions continue to be improved upon. This is literally already happening. Its not speculative at this point\n\n&gt;You can say \"what about fiat currency it has no intrinsic use\". It's still legally required to be accepted to settle debts, and is required to pay taxes that are mandated by law. So it has statutory support. Also fiat currency generally isn't an investment besides as a hedge.\n\nAgain BTC does have intrinsic use today and those uses will continue to expand. The genie is out of the bottle at this point and adoption is occurring rapidly.",
        "created_utc": 1605023106,
        "id": "gbu4a2k",
        "score": 2,
        "subreddit": "investing",
        "created": 1605051906.0
    },
    {
        "author": "cheeseburger5786",
        "body": "Wu Tang Clan ain’t nutin to fuck with!",
        "created_utc": 1605760403,
        "id": "gcsri4p",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1605789203.0
    },
    {
        "author": "Au_contraire_zippy",
        "body": "hang dai, Wu  🤞\n\ncocksucker",
        "created_utc": 1604336624,
        "id": "gawv7f9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604365424.0
    },
    {
        "author": "dwaynebank",
        "body": "Not nearly as exciting as some other people on here, but I put a considerable amount of money into TTD a year ago and I've gotten over 200% return. Pretty crazy considering as covid was breaking out I was 50% in the red. lol\n\nI've since pulled out half of my investment and moved into other great investments that I'm excited about. [Listen to Wu-Tang.](https://www.youtube.com/watch?v=DdSfTsTSjwA)",
        "created_utc": 1605051321,
        "id": "gbvqqt4",
        "score": 2,
        "subreddit": "investing",
        "created": 1605080121.0
    },
    {
        "author": "rainforestriver",
        "body": "Is this from Shkreli's Wu-Tang album",
        "created_utc": 1606204002,
        "id": "gdf5rwq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606232802.0
    },
    {
        "author": "ssryoken2",
        "body": "They are first company to use blockchain at scale to reduce the cost remittances by 60+% using XRP payment corridors. Currently they are doing 10 percent of all US to Mexican peso remittances up from 4 percent just last year and that volume is growing. This is why Western Union offered to buy them but moneygram turned them down. It’s cause they know the technology is gonna put western union in second place.",
        "created_utc": 1605573799,
        "id": "gck6te5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605602599.0
    },
    {
        "author": "numbnah",
        "body": "You're probably right. I lowballed my numbers by a lot to appease the 5 dime (Wu Mao)",
        "created_utc": 1604816809,
        "id": "gbkh8u1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604845609.0
    },
    {
        "author": "BenZaye",
        "body": "It’s like western union is a money transfer company",
        "created_utc": 1605614450,
        "id": "gclp53c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605643250.0
    },
    {
        "author": "RecklesslyPessmystic",
        "body": "wu wu wu wu wu",
        "created_utc": 1605644253,
        "id": "gcn9my0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605673053.0
    },
    {
        "author": "bubblesmcnutty",
        "body": "&gt;That's not how it would work if tether fraudulent. People could be stuck completely unable to pull money out of the system. If the whole market is propped up by dollars that are not real dollars but people accept them as real dollars, then guess what happens if that falls apart.\n\nAgain, Tether likely does some sketchy shit. Its looked down upon by crypto purists as well. That being said, its not nearly as significant as its made out to be.\n\n&gt;yeah I'm calling bullshit that corporations are buying it hand over fist. It's a supply-demand commodity that a bunch of people are bag holding and doing nothing with... As a result the market appears to have limited supply at times, but it's only a few market manipulators and a little bit of momentum. None of that is really a value proposition.\n\nI never said companies are buying it hand over fist (yet).I said large, pubicly traded companies have just begun not only buying it, but adding it to their balance sheets. Square and MicroStrategy are the two biggest examples.\n\nI believe this trend is just getting started. Time will tell.\n\n&gt;chaos hedge? If there's actual chaos, you need internet and electricity for it to even matter. Actual chaos has neither of those things. The rest of what you said is crypto fan fic. Might as well build a bunker and stock it full of guns and canned food.\n\nInteresting, i wasn't aware chaos had to involve a complete and utter shutdown of the electricity grid and/or Internet. Bit hyperbolic dont you think?\n\n&gt;it's still a drop in the bucket compared to 2016. Congrats on Paypal, still latgely irrelevant. It's always about it's price in sweet sweet USD after all.\n\nNo no -- right now is most similar to 2016. It was in 2016 when BTC slowly made its way back to its previous ATH of $1K (from $200). It was 2017 when the fireworks started. Those are coming. Interestingly enough 2016-2018 was almost entirely retail investors. Now that institutions are in the mix? Look out.\n\n&gt;oh Jesus Christ. A) there are other ways to avoid hyper inflation than buying bitcoin.\n\nSuch as?\n\n&gt;B) most of the people in those countries don't own bitcoin and won't.\n\nMost don't, plenty do. Who are you to criticize what actions they take to protect themselves and their families?\n\n&gt;If you actually cared about those people you'd probably try to circulate the currency around instead of pretending that the best thing we can all do for the really poor people in hyperinflation countries is to just buy and hold bitcoin.\n\nHow exactly do you plan to do that? Sending them money via Western Union forces them to withdraw in their home currency. The same home currency that devalues itself by the literal minute.\n\nFurthermore, both Venezuela and Nigeria were seizing aid because...central banking! BTC helps to solve this. Also - how do you know I haven't sent small amounts of BTC as aid to both countries. Many people have - thats why its been so helpful!\n\n&gt;Do it for the poor starving kids. BTC to $1MM.\n\nBTC to $1mm would be beneficial to myself as well as those in Venezuela who are holding it. It's not an either/or situation, pal.",
        "created_utc": 1604431105,
        "id": "gb18yxv",
        "score": 1,
        "subreddit": "investing",
        "created": 1604459905.0
    },
    {
        "author": "Au_contraire_zippy",
        "body": "celestial cock suckers, Wu",
        "created_utc": 1604453758,
        "id": "gb2he19",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604482558.0
    },
    {
        "author": "Unsavory1",
        "body": "Should I yolo some ZM? All the talking heads are saying dark harrowing winter coming up because of the wu flu.",
        "created_utc": 1605179652,
        "id": "gc19wgl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605208452.0
    },
    {
        "author": "thedmob",
        "body": "Eu will never matter a lot for weed. Consumers don’t use weed there as much as in the US. WU doesn’t matter for booze because they drink beer and wine. Will be same for weed.",
        "created_utc": 1605202866,
        "id": "gc2cwal",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1605231666.0
    },
    {
        "author": "Jos_Meid",
        "body": "Something with a low P/E ratio, regular, steady profits and a long track record of being a sustainable business. Personally, I invested in Western Union for that reason, but most blue chip stocks would work just fine.",
        "created_utc": 1605459619,
        "id": "gcejvs4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605488419.0
    },
    {
        "author": "___alexa___",
        "body": "ɴᴏᴡ ᴘʟᴀʏɪɴɢ: [Wu-Tang Clan - Protect Ya Ne](https://www.youtube.com/watch?v=1_-3Bh1VFI8) ─────────⚪───── ◄◄⠀[▶](https://www.youtube.com/watch?v=1_-3Bh1VFI8)⠀►►⠀ 3:06 / 4:39 ⠀ ───○ 🔊 ᴴᴰ ⚙️",
        "created_utc": 1605643342,
        "id": "gcn7nqh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605672142.0
    },
    {
        "author": "StubaKuula",
        "body": "Yang Wu, Microvast's founder, Chairman and CEO added: \"Our potential transition into a public company will help continue to fuel our design and development of market-leading ultra-fast charging, long-life battery power systems. Microvast expects to generate over $100 million of revenue this financial year. With the automotive technology experience and capital this transaction with Tuscan is intended to provide, we are confident we can build upon our established success and accelerate our growth in the electric vehicle battery industry.\"",
        "created_utc": 1606544206,
        "id": "gduc3r1",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1606573006.0
    },
    {
        "author": "SlowerThanSuperman",
        "body": "You can send funds to anyone, anywhere, and nobody can stop you. Cuba was recently cut off from Western Union transactions, and this is only one recent example of government interference that Bitcoin is immune to.\n\nYou may not think this is valuable, but if you found yourself in a situation where a powerful entity was preventing you from spending or sending money for whatever reason you would start to understand.",
        "created_utc": 1606532150,
        "id": "gdtvafw",
        "score": 1,
        "subreddit": "investing",
        "created": 1606560950.0
    },
    {
        "author": "Jp30696",
        "body": "Well, I got family in Manassas, this seems a very reasonable solution but I don't have a visa for enter right now in the US. And if I use their banks accounts the only way I could transfer me money would be on paypal or western union (very dangerous since I could be mugged in Nic), nor directly into my account here in Nicaragua, and so far I know our nationals banks don't support an paypal-to-account transfer service.",
        "created_utc": 1606008342,
        "id": "gd53zzc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606037142.0
    },
    {
        "author": "BTC-100k",
        "body": "Thank you for sharing. \n\nFrom my POV, one shouldn't focus on the value or the price. It's also too early to trying to figure out exactly what bitcoin is or will become (store of value, payment system, monetary unit, method for software applications to validate each other without a central provider, etc).\n\nIt isn't about getting rich and it isn't about a new world order. I find it most useful to think of the bitcoin protocol in the same way we view other protocols (ftp for files, https for secure web, sip for calls, tcp for data assembly, ip for data routing, etc). It's just another layer to the internet, albeit an incredibly powerful layer that I personally believe will eclipse all others aside from tcp/ip &amp; https.\n\nEvery time I hear people trying to prescribe what exactly bitcoin is or will be all I can think about are these quotes:\n\n&gt;\"By 2005 or so, it will become clear that the Internet’s impact on the economy has been no greater than the fax machine’s.” Paul Krugman\n\n&gt;\"This 'telephone' has too many shortcomings to be seriously considered as a means of communication.\" William Orton, President of Western Union\n\n&gt;“Fooling around with alternating current (AC) is just a waste of time. Nobody will use it, ever.” Thomas Edison \n\n&gt;\"I think there is a world market for maybe five computers.\" Thomas Watson, chairman of IBM\n\nThe limited supply and ownership of a digital asset that is secured by a system processing 131,000,000,000,000,000,000 SHA-256 calculations per second on a global scale that has built in governance and economic incentive is powerful. Will it change the world, yes. Will it make everyone who invests rich or poor, who the heck knows :)",
        "created_utc": 1605824455,
        "id": "gcvmwvi",
        "score": 1,
        "subreddit": "investing",
        "created": 1605853255.0
    },
    {
        "author": "soyarriba",
        "body": "Western union puts",
        "created_utc": 1604271071,
        "id": "gau8pi6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604299871.0
    },
    {
        "author": "skilliard7",
        "body": "&gt; Bitcoin has plenty of intrinsic use. These include borderless transfer without needing to convert to to local currency (cant do this with Western Union), black markets, safe haven from oppressive governments, sending aid to citizens of oppressive governments, ways to bypass import sanctions (see Iran), and more. Just because you don't have intrinsic use for BTC, doesn't mean others don't (see link below).\n\nYou can do this with Ethereum, Litecoin, Monero, Vertcoin, even Dogecoin. I agree cryptocurrency and blockchains are useful but I don't see Bitcoin as a long term store of value. It's far more volatile than precious metals and also intangible.\n\nIBM is making huge strides towards quantum computing, and once they pull it off, Bitcoin will become worthless once the public/private key cryptography is cracked and anyone with access to a quantum computer can simply sign transactions to send coins to themselves. We're easily within 10 years at this point, possibly less.\n\n&gt;This is like saying anyone can create a better social network than Facebook and therefore Facebook has no value\n\nWhat about Myspace? It came first.\n\n&gt;Wrong. Best case scenario is that BTC continues to be added to the balance sheets of large, publicly traded companies\n\nLike 1 or 2 companies that hold it as a tiny position. I think Overstock and Square? Most companies that accept it just use Bitpay or Coinbase to instantly sell it.",
        "created_utc": 1605023410,
        "id": "gbu4wlq",
        "score": 1,
        "subreddit": "investing",
        "created": 1605052210.0
    },
    {
        "author": "zhalek",
        "body": "please don’t disgrace the wu with your ev banter",
        "created_utc": 1605285691,
        "id": "gc5z37n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605314491.0
    },
    {
        "author": "cordialpumpkin",
        "body": "AMZN daily chart repping  Wu-Tang",
        "created_utc": 1605300980,
        "id": "gc6u84v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605329780.0
    },
    {
        "author": "anundfuersich",
        "body": "90+% revenue and most operations, employees, and mfg in China. \n\nCEO is Yang Wu\nCFO is Yanzhuan Zheng \nCTO is Li Xiang\nCOO is Diaokun Xiao \n\nThe HQ in TX is a small presence — maybe 10 people on busier days — in a crappy office building. They have huge campus in Huzhou with thousands of employee. Most Sr Management and more than 95% of employees are based in China.\n\nEven CEO/CFO pre COVID spent most of their time in China.",
        "created_utc": 1605633706,
        "id": "gcmmlv1",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1605662506.0
    },
    {
        "author": "dragoniteVS",
        "body": "Copy and pasted from another comment, TL;DR I'm staying away:\n\n- First off, the founder/chairman Bruno Wu founded a company a while back called Sun Seven Stars group. There were a couple scandals that the group was related to that was pretty fishy. It didn't originate from them, but some of the people they were doing business with ended up taking a lot of money from investors.\n\n- Wu also has had no clear vision for Ideanomics. It's been a while that I did research on this so I forget some of the paths they took, but I know at one point IDEX used to be in the oil business (lol?). They would be the middle man of selling oil directly from the supplier to the consumer. It failed miserably, so then they got into fintech/blockchain because it was the next big thing (also failed). Now they're in the EV space because, you guessed it, it's the next big thing.\n\n- Ideanomics has cycled through more leadership than I care to count. I don't mind Alf Poor, but he doesn't get me excited to invest in the company.\n\n- Hindenburg Research put an article out on them back in June/July about a few things I mentioned above, but they also targeted the MEG center (glorified EV expo). They claimed that IDEX mislead shareholders into thinking that IDEX owned this entire facility, when in fact they were given permission to use part of it for selling EVs by the Chinese government. I always take everything Hindenburg says with a grain of salt because they are short sellers and looking to profit off stocks selling, but I already knew this. The way Alf and the company explained MEG to the shareholders did make it seem like they owned the entire building and that it was a full fledged operation. Not true\n\n- Speaking again of Hindenburg and MEG, they sent someone to this expo and had them take pictures and ask around about IDEX. They claimed there was no IDEX presence there in their article. IDEX took a very long time to provide any sort of proof that they actually had presence at the MEG center, and it came in the form of an LED sign outside the building that read \"MEG\". Those were probably the most painful weeks any investor has experienced, and I know they lost a TON of trust with people during this time. Imo this is the biggest point, because once you lose trust with someone, it's over.\n\n- From a financial/actual business perspective, their balance sheet was bad at the start of this year, but I will say they did clean it up a little regarding debt (nothing too impressive). The thing that was keeping their share price so high (and is now) is the China EV market. I will admit, there is amazing potential there, and when Alf laid out the PowerPoints with the potential order numbers, I was impressed. I sat on so many virtual conferences with these guys, and I always liked the outlook. However, when actual numbers came in, they were abysmal. The meat of their backlog is the electric bus orders, but as far as I know, none have been filled even to this day.\n\nThere's a lot more but I'll spare the details. It's fine to play the hype train, but from a long term investing perspective, I will never buy and hold IDEX. Good luck 👍",
        "created_utc": 1606246242,
        "id": "gdh4027",
        "score": 1,
        "subreddit": "investing",
        "created": 1606275042.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "https://www.prnewswire.com/news-releases/tuscan-holdings-corp-announces-intent-to-combine-with-microvast-inc-301172882.html\n\n&gt; \"Microvast has a compelling financial profile, with significant historical revenues as well as projected growth and profitability.  With its battery technology installed in over 28,000 vehicles worldwide, an impressive,  growing list of global OEM customers, and a strategic partnership with Fiat Power Train Industrial, Microvast is a proven technology leader driving the mass adoption of EVs.  We are excited to partner with Mr. Wu and his experienced team and believe the valuation negotiated provides long term intrinsic value to Tuscan shareholders.  We look forward to supporting Microvast in its next phase of growth as a public company,",
        "created_utc": 1606263293,
        "id": "gdi268n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606292093.0
    },
    {
        "author": "WaySheGoesBub",
        "body": "Wu-Tang Financial Services",
        "created_utc": 1606412353,
        "id": "gdojqoa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606441153.0
    },
    {
        "author": "zxcvzzzzxz",
        "body": "Killa Beez - Wu Tang Clan",
        "created_utc": 1606414752,
        "id": "gdop1ol",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606443552.0
    }
]