[
    {
        "author": "davidbigham",
        "body": "Quite a lot of big volume traded on TXN call.  Follow the big guy and lose money together boyz.",
        "created_utc": 1580924998,
        "id": "fgmi2rc",
        "permalink": "/r/wallstreetbets/comments/ez7z3h/daily_discussion_thread_february_05_2020/fgmi2rc/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1580953798.0
    },
    {
        "author": "Psicopro",
        "body": "Tesla barely makes the same product as Ford.  It would be like Apple (Steve jobs Apple, not Tim Cook Apple) buying Texas Instruments.\n\nUnless there is a supply chain or assembly line benefit I can't think of, it would complicate an already difficult to control product lineup and give no value add to the products that are driving the hope of growth into realization of valuations.",
        "created_utc": 1581109737,
        "id": "fgtv55w",
        "permalink": "/r/investing/comments/f0fnok/ford_shakes_up_top_management_promises_faster/fgtv55w/",
        "score": 3,
        "subreddit": "investing",
        "created": 1581138537.0
    },
    {
        "author": "IQisbae1",
        "body": "It personally depends on your objective after answering the questions. \n\nI'm a value investor(I like to buy out of favor sectors to create margin of safety) so I can give you some insights on what I think are good sectors to look into.  I usually look at a horizon of 5+ years\n\nThe following is for income:\n\n1) The energy sector : been severely beaten down due to low oil prices. However, you have to keep in mind that not all companies in the oil sector make money based on oil prices , example: MLP sectors that have volume contract in place for moving oil (ie: the more oil they transport , the more they make). You can check into ET , MPLX, EPD, KMI, PAA/PAGP in that sector. You can also look into the oil majors like Xom Mobil (XOM), Royal Dutch Shell (RDS.B), Equinor (EQNR)\n\n2) Financial sector: some banks in Europe are currently very attractively valued. I personally have LYG (it's a bank in England with price actions that has gone side ways due to the Brexit Issue). You can also look at domestic banks although I think a lot of them are already out of my price range with the exception of OZK\n\n3) Consumer Staples: think of some companies that you can't live your daily life without. Notably toothpaste , tooth brush, shower gel, basic food items, etc. Try and see which companies made the product and look into them. Ex. JNJ, CL, etc.\n\nThe following is for growth:\n\n1) Tech sector: Not to be surprised but I wouldn't go for the big names (FB,APPLE,NVDA, etc) . I would go for some of the lessor known names. Currently TXN and MU are on my watch list but both are out of my comfortable buying range\n\n2) REIT: some subsector of REIT offers tremendous growth as well, notably the data center and the cell tower REITs. Just keep in mind to value them properly prior to buying as overpaying for a company reduces potential returns.\n\nOn an end note, do keep in mind that you and I have different investing objectives. I'm just looking for safe income in general while waiting for the market to properly value these companies correctly. As a value investor, you'll be under the water short term with your investments as you would be in a out of favor sector. \n\nIf you have any further questions, feel free to message me. Good luck with investing!",
        "created_utc": 1582109901,
        "id": "fi3b48p",
        "permalink": "/r/investing_discussion/comments/f68wzq/where_to_even_begin_investing/fi3b48p/",
        "score": 1,
        "subreddit": "investing_discussion",
        "created": 1582138701.0
    },
    {
        "author": "anhties",
        "body": "&gt;Micron Technology shares jumped higher in pre-market trading Wednesday after analysts at UBS boosted their rating and price target on the chipmaker amid what it sees as a \"cyclical upswing\" for global memory markets.\n\nUBS analyst Timothy Arcuri lifted his price target on Micron by nearly 60%, to $75 per share, and improved his rating to \"buy\" from \"neutral\", citing \"higher estimates and improving industry dynamics\" for the group, particularly in markets for DRAM memory chips, which are commonly found in computers and severs. Arcuri said the DRAM upswing should last \"deep into 2021\" and argued that Micron is in a stronger position to benefit from the cyclical changes than some of its domestic peers.\n\n\"After only modestly outperforming the S&amp;P 500 over the past two years, we believe the time has finally come when Micron can materially outperform over a sustained period of time,\" Arcuri said. \"We also argue that Micron deserves a higher multiple given its improving competitive position and through-cycle financial performance that is comparable to or even better than other major semis peers with integrated manufacturing models like Intel or Texas Instruments.\" \n\nhttps://www.thestreet.com/investing/micron-shares-jump-after-ubs-boosts-rating-price-target\n\nTim Arcuri was the analyst that downgraded Micron with a price price target in the 30s while all of the other analysts had targets of $80-100. He's back on board with Micron. Check out his previous history. This guy has been pretty accurate on Micron.\n\nhttps://www.tipranks.com/analysts/timothy-arcuri",
        "created_utc": 1582323661,
        "id": "fibk3bg",
        "permalink": "/r/wallstreetbets/comments/f7emhl/micron_technology_mu_dd/fibk3bg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582352461.0
    },
    {
        "author": "mililani",
        "body": "If you sell in a tax year and have capital gains, and then reuse that money to rebuy the stock at whatever price, you will need to file those gains on your taxes.  Even if you re-bought the stock, and the stock went DOWN netting you a net capital loss, if you don't sell the second txn in the tax year, you can't claim that as a net loss on your taxes for the year.  So, what I'm saying is, if you rebuy with the intention of holding the stock into future tax years, then set aside enough money to pay the capital gains.  The idea of whether to buy it low enough to offset the taxes are irrelevant because of that.",
        "created_utc": 1582912204,
        "id": "fj1378s",
        "permalink": "/r/investing/comments/faui5y/can_anyone_explain_the_taxes_on_selling_and/fj1378s/",
        "score": 1,
        "subreddit": "investing",
        "created": 1582941004.0
    },
    {
        "author": "Davge107",
        "body": "Go to wallstreetbets. But long term a lot are good like Amazon Microsoft BMY AMAT INTC TXN Apple etc...",
        "created_utc": 1581871719,
        "id": "fht8nua",
        "permalink": "/r/stocks/comments/f4t21k/what_stocks_to_buy_tomorrow_for_short_term_gains/fht8nua/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581900519.0
    },
    {
        "author": "jimbob1911",
        "body": "TXN making a jump for some reason...",
        "created_utc": 1580822248,
        "id": "fgii11c",
        "permalink": "/r/wallstreetbets/comments/eyoh7t/daily_discussion_thread_february_04_2020/fgii11c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580851048.0
    },
    {
        "author": "jonathant4563",
        "body": "Bought TXN calls just yesterday @ noon. Watched them go a solid 430% today. Chose to hold. Might sell tomorrow idk",
        "created_utc": 1580956471,
        "id": "fgnzpfq",
        "permalink": "/r/wallstreetbets/comments/ezgfp6/what_are_your_moves_tomorrow_february_06/fgnzpfq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580985271.0
    },
    {
        "author": "oppressorbot",
        "body": "BTC is working on the fee issue. But currently it's a few cents. The real problem is txn time and that is being addressed, but no idea how long that will take. \n\n[https://www.investopedia.com/news/bitcoin-lightning-network/](https://www.investopedia.com/news/bitcoin-lightning-network/)",
        "created_utc": 1581254255,
        "id": "fh2iqa6",
        "permalink": "/r/investing/comments/f14uqh/bitcoin_just_hit_10000_again_bubble_20_in_the/fh2iqa6/",
        "score": 1,
        "subreddit": "investing",
        "created": 1581283055.0
    },
    {
        "author": "y7nx90",
        "body": "Yea that's right, I think MMs must've initially put in a later earnings date based on history and then when ROKU announced an earlier date, a lot of them were screwed.  And it's a lot more costly to be wrong in ROKU since it actually moves a lot for earnings so the earnings implied vol is quite high and costly to be short vol a week in which you thought had 0% chance to be earnings but turned out to be the earnings week.\n\nAMZN is very consistent and a lot of names are, but a lot aren't.  Even a stock like GOOG is kind of inconsistent (when they announce and also the date they announce it for).  A lot of times, it's a guessing game, so you'll see MM split their probability like 60% vs. 40% on two weeks.\n\nThe question you are asking on when an earnings date is announced kind of just comes from experience and since most traders have only like 4-5 names they look at, they have a general sense.  Like I don't really trade TSLA, but I wanted to look at it just for fun with the recent news, and I noticed they sometimes announce an earnings date on Friday NIGHT even (after market is closed) for a date that is less than 2 weeks away (happened this year).  So you kind of just have to know based on each stock you trade from experience and assign probabiltiies.  For like AMZN, you should almost know 100% since they are just way too consistent.  If AMZN earnings is not on a Thursday and not announced 2 weeks before, that's probably not good lol.\n\nFor your LRCX example, I would imagine the primary MM trading at these large firms only trade like LRCX, TXN, AMAT, TSM, or something like that and work closely with the AMD, NVDA trader and the SMH ETF trader, so they have it all covered.  Because not only do you want to know LRCX's earnings date/earning's timing, but it helps knowing when NVDA's earnings are since NVDA's large enough earnings could move the entire semi-sector.  So it's just they have so few names to cover, they have enough experience to kind of at least get a solid sense of it but not 100% of course unless it's something like AMZN.  Finally, the LRCX trader has access to order flow (retail vs. \"smarter\" hedge funds) which can also help them assign their probabiltiies better.",
        "created_utc": 1581377742,
        "id": "fh9bz7w",
        "permalink": "/r/options/comments/f1yvs9/historical_earnings_announcement_dates_and_process/fh9bz7w/",
        "score": 1,
        "subreddit": "options",
        "created": 1581406542.0
    },
    {
        "author": "uKnownSource_",
        "body": "Buy TXN calls",
        "created_utc": 1580940144,
        "id": "fgn9c7k",
        "permalink": "/r/wallstreetbets/comments/ezgfp6/what_are_your_moves_tomorrow_february_06/fgn9c7k/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580968944.0
    },
    {
        "author": "davidbigham",
        "body": "BTFD on TXN .",
        "created_utc": 1581103946,
        "id": "fgtftxj",
        "permalink": "/r/wallstreetbets/comments/f0902f/daily_discussion_thread_february_07_2020/fgtftxj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581132746.0
    },
    {
        "author": "spy400qqq300",
        "body": "Long Texas Instruments. Chinese calculators don't work.",
        "created_utc": 1581662349,
        "id": "fhk12hg",
        "permalink": "/r/wallstreetbets/comments/f3o58t/china_cant_count_long_stonks/fhk12hg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581691149.0
    },
    {
        "author": "wizard_mitch",
        "body": "The safest stock to invest in would be an ETF of the market such as $SPY, $QQQ or $VTI but this is not as exciting as owing a share in a company.\n\nSome well know companies that your son has probably heard of and I would also consider to be good investments are:\n\n* Disney ($DIS)\n* Microsoft ($MSFT)\n* Alphabet ($GOOGL)\n* Amazon ($AMZN)\n* Lockheed Martin($LMT)\n* Boeing ($BA)\n* Southern Company ($SO)\n* Waste Management ($WM)\n* Carnival Corp ($CCL)\n* Home Depot ($HD)\n* Colgate-Palmolive ($CL)\n* Clorox Company ($CLX)\n* Costco ($COST)\n* General Electric ($GE)\n* Stanley Black &amp; Decker (SWK)\n* Expedia Group Inc ($EXPE)\n* Hasbro ($HAS)\n* NextEra Energy ($NEE)\n* General Mills ($GIS)\n* Kellogg Company ($K)\n* Kraft Heinz ($KHC)\n* Mondelez ($MDLZ)\n* Tyson Foods ($TSN)\n* Johnson &amp; Johnson ($JNJ)\n* Yum! Brands ($YUM)\n* Starbucks ($SBUX)\n* Mcdonald's ($MCD)\n* PepsiCo ($PEP)\n* Coca-Cola Co ($KO)\n* Texas Instruments ($TXN)\n* Qualcomm ($QCOM)\n* Micron ($MU)\n\n\n\nAssuming you are from the US so I picked US companies. Lots of the companies will have large share prices for a gift so you may have to look for a broker that offers fractional shares.",
        "created_utc": 1582165984,
        "id": "fi5m2je",
        "permalink": "/r/stocks/comments/f6c770/15_year_old_son_wants_stocks_for_birthday/fi5m2je/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1582194784.0
    },
    {
        "author": "IQisbae1",
        "body": "\n-BAM/Blackrock: investment firm that manages finance across multiple sectors and markets. I personally prefer BAM because of management over REIT and the energy sector ( renewable energy )\n- VISA/ MasterCard : needs no introduction. Great finance  tech stock with great moat and growth \n-TXN/AVGO/Samsung : Tech sector involved in semiconductors",
        "created_utc": 1581864258,
        "id": "fhsqzca",
        "permalink": "/r/investing/comments/f4p569/following_the_investment_philosophy_of_warren/fhsqzca/",
        "score": 1,
        "subreddit": "investing",
        "created": 1581893058.0
    },
    {
        "author": "LeonardoRafaell",
        "body": "Value is not doing well as a whole  , but some single stocks are.\n\nABBV, TXN, TSM, GILD some others",
        "created_utc": 1581775382,
        "id": "fhovnmq",
        "permalink": "/r/stocks/comments/f49cgs/what_are_the_best_dividend_stocks_for_2020/fhovnmq/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581804182.0
    },
    {
        "author": "garythfla1",
        "body": "Before I say anything just remember that I am not a financial advisor so this is just like, my opinion, man...\n\nI think blue chips are a good idea. My personal opinion is have about 70% of my portfolio in stuff like Coke, McDonalds, Visa, Microsoft, maybe a good utility that has a healthy dividend record (ED and SO are mine). I think McCormick and Smuckers are some other good ones although i haven't bought either yet. I think Johnson and Johnson is a good one too. I've done quite well with that last one. Proctor and Gamble also.\n\nThink about it...people always going to have babies, eat, drink, take a dump, etc. Who makes most of the stuff that covers those needs? Also credit card companies. how many people do you know who dont use a credit card?\n\nNow for the other 30%, I have stuff that is a little more risky. Thats where your Tesla's and Nvidia's come in. I've always heard that computer chips are cyclical so be ready for that with Nvidia in my opinion. Also for the electronics/internet...look at FTEC. I think they are going to blow up in the next few years...it's a still-cheap QQQ in my opinion.\n\nIf you have 15 years to retirement or more, Tesla and Nvidia are good. In the electronics area, I think you'd like Texas Instruments stock also. Very good track record there.\n\nlike i said, this is just what i think and what i have done in the past. it's worked out for me but i have stayed in the market a long time. don't expect to get rich over night. with this stuff you won't go broke over night either.\n\nalso, i dont pull out everything every time the market tanks....i buy more.\n\nedit: spelling",
        "created_utc": 1582920592,
        "id": "fj1i733",
        "permalink": "/r/StockMarket/comments/faxea8/etfs_or_individual_companies_on_the_rise_up/fj1i733/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1582949392.0
    },
    {
        "author": "CarlSagan79",
        "body": "&gt; It may be an annual reoccurrence like the common influenza.\n\nBut this is also what they said about SARS and Avian Flu and Swine Flu and Zika. It's this weird 5 year cadence that seems to match more appropriately with a new cycle than anything viruses are doing.\n\nIt's like sharks, but more RNA.",
        "created_utc": 1583090890,
        "id": "fj7fd6l",
        "permalink": "/r/investing/comments/fbwi8y/wsj_coronavirus_is_different_almost_no_company_is/fj7fd6l/",
        "score": 2,
        "subreddit": "investing",
        "created": 1583119690.0
    },
    {
        "author": "gizamo",
        "body": "Dev here. I'll pass. AWS, Azure, and GCP all offer their own CDNs for free, and if I'm going to pay for another CDN, it'd be Netlify, or if on AWS, maybe Datapath....which might be free, I don't remember. Point is, CDNs are going to be dominated by the biggies or the freebies. There is no need for intermediates, imo.",
        "created_utc": 1583895800,
        "id": "fk689jo",
        "permalink": "/r/wallstreetbets/comments/fgq6mx/want_some_nice_easy_tendies_look_out_for_net/fk689jo/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1583924600.0
    },
    {
        "author": "CarlSagan79",
        "body": "&gt; It may be an annual reoccurrence like the common influenza.\n\nBut this is also what they said about SARS and Avian Flu and Swine Flu and Zika. It's this weird 5 year cadence that seems to match more appropriately with a new cycle than anything viruses are doing.\n\nIt's like sharks, but more RNA.",
        "created_utc": 1583090890,
        "id": "fj7fd6l",
        "permalink": "/r/investing/comments/fbwi8y/wsj_coronavirus_is_different_almost_no_company_is/fj7fd6l/",
        "score": 2,
        "subreddit": "investing",
        "created": 1583119690.0
    },
    {
        "author": "rikki-tikki-deadly",
        "body": "I honestly wonder about that.  Like, when you see the people at his rallies laughing and cheering at sentences that are completely incomprehensible, are they even processing what he's saying?  Or are they just responding to keywords and cadence?",
        "created_utc": 1583593643,
        "id": "fjs4obn",
        "permalink": "/r/wallstreetbets/comments/feig6i/weekend_discussion_thread_march_68_2020/fjs4obn/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583622443.0
    },
    {
        "author": "gizamo",
        "body": "Lol. [You blatantly lie](https://aws.amazon.com/cloudfront/) and then claim I don't have experience. Idiot. Then, you seeming intentionally misconstrue my meanings for Netlify and Datapath. [Netlify Edge](https://www.netlify.com/products/edge/) and Datapath's cloud-to-cloud are advancements upon CDNs. I was saying that if you're going to pay for something like Cloudflare, you should be doing something more specific or something better that ties in with AWS, GCP, and Azure CDNs. But, yes you're right there hundreds like datapath, just as there are hundreds like Cloudflare. If you're not willing to pay for AWS, GCP, or Azure, itmeans you're going the cheapest route possible, which might land you with Cloudflare, or much more likely, you'll piece together a bunch of the cheaper services and free services out there to do whatever specific thing you want. From what I can tell, Cloudflare is picking up scraps at best, and is getting squeezed in a race to the bottom.",
        "created_utc": 1583930708,
        "id": "fk78lj7",
        "permalink": "/r/wallstreetbets/comments/fgq6mx/want_some_nice_easy_tendies_look_out_for_net/fk78lj7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583959508.0
    },
    {
        "author": "ManiGandham",
        "body": "Cloudflare is a CDN, security (DDOS/firewall/vpn/beyondcorp access) and edge computing company that handles roughly 10% of the internet's traffic. It's also free for the vast majority of users, and one of the only CDNs that doesn't charge for bandwidth.\n\nNone of the clouds offer a CDN for free, they all charge on bandwidth and all cloud vendors are notoriously expensive for that. Netlify isn't a CDN, it's a static site hosting service that uses Fastly and other actual CDNs. Datapath isn't a CDN, it's a 3rd tier networking company amongst hundreds in that niche.\n\nYou don't seem to have much experience with space.",
        "created_utc": 1583916851,
        "id": "fk6ulbp",
        "permalink": "/r/wallstreetbets/comments/fgq6mx/want_some_nice_easy_tendies_look_out_for_net/fk6ulbp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583945651.0
    }
]