[
    {
        "author": "thewimsey",
        "body": "No, it's not sketchy because money is involved.\n\nThe key to Bill Gates being successful wasn't that his mother knew some guy at IBM; it was that his wealthy family sent him to an expensive private school where he both met Paul Allen *and* learned about computers.  Gates's mom served on a charitable board with the CEO of IBM; they were more associates than friends, and that wouldn't have helped Gates at all if he hadn't already, you know, founded MS. \n\nElon's family didn't own an emerald mine, and he was $100k in debt when he graduated college. \n\nMeritocracy just means that merit - mostly in the sense of skills - is rewarded. It doesn't mean that everyone necessarily has an equal chance. \n\nIf a company needs and engineer and I have an engineering degree, and you don't - maybe because you had an abusive family growing up wit a father in prison and so never graduated from HS, the company is hiring me *on merit*. I'm an engineer; you're not; you can't do the job. \n\nThis doesn't mean that if our lives were switched at age 3 I would have done any better; that's just a separate question from meritocracy. \n\nI mean, if a company needs someone who speaks French, and my wealthy family summered in France every year and sent me there one a gap year and then on a junior year abroad...while you took French in HS...merit means I get the job *even though* I was only able to obtain my qualifications because my family was rich enough to keep sending me to France. \n\nBut the company isn't hiring me because of who I am, but because of what I can do, and that I can do it better than you can.",
        "created_utc": 1604800948,
        "id": "gbj9kou",
        "score": 8,
        "subreddit": "investing",
        "created": 1604829748.0
    },
    {
        "author": "KomputerIdiat",
        "body": "This is r/stockmarket. Money is money dude. I mean IBM sold their products to the Nazi to help to keep track of all the Jews they gassed or something. If people have to die, why not make some money while at it. As long as the killing is not done in our backyard it should be fine.",
        "created_utc": 1604883400,
        "id": "gbo897u",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1604912200.0
    },
    {
        "author": "LucisMensEtManus",
        "body": "You have a number of comments on your financial model, so I won't comment there.\n\nTo me, what is missing is the story. First, comparison to the Leidos, CACI, BAH, IBM, HPE etc. of the government consulting world. They too employ a lot of talent. What is the difference with PLTR? Second, government consulting is often a \"customer intimate\" model, not quality leadership. Govt says it wants high tech, but they often buy those companies who understand them most. Which model is PLTR using? Why will PLTR succeed in Govt? Is it primarily IC?\n\nThird, if PLTR has silicon valley magic in it, then why is the commercial business not taking off? If you have a superior value proposition, that will be reflected in high margins and a kind of inevitability of customers who are drawn to your products. A weakness there would make me pause.",
        "created_utc": 1604902300,
        "id": "gbp1ury",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1604931100.0
    },
    {
        "author": "3000dollarsuitCOMEON",
        "body": "Competition, brand deterioration, and forced breakups by government action. \n\nNo company is invulnerable given time. Standard Oil in the early 1900s, IBM when mainframes were everything. Capital is so cheap right now that it's easy for startups to get funds. It may not seem like it but consumers will switch for better products or ways of doing things. Brands don't last forever and companies become more and more difficult to manage as their size increases.\n\nAlso don't forget the world is much bigger than just the US. China and other large developed countries are full of brilliant people, lots of access to capital. How long until Alibaba has boots on the ground in USA and starts aggressively pressuring Amazon?\n\nMy guess is that eventually the government will put a stop to big tech simply buying out their competitors. It's already a bipartisan talking point.",
        "created_utc": 1604850215,
        "id": "gbmc202",
        "score": 1,
        "subreddit": "investing",
        "created": 1604879015.0
    },
    {
        "author": "audion00ba",
        "body": "I can't even say whether this is sarcasm or not. You mean the IBM Power10 processor? \n\nThe only thing that's sort of interesting is the \"Distributed Memory Disaggregation and Sharing\"-feature, but that processor is not available until the end of 2021. If there is any proof that it is *real* and is competitive in terms of pricing, then I might see some value there. \n\nThe world has been moving to commodity servers for the past 15 years. IBM is everything but that. \n\nIBM has a debt of 50B. I don't see how their current assets are worth more than their debt.",
        "created_utc": 1604855624,
        "id": "gbmlzud",
        "score": 1,
        "subreddit": "investing",
        "created": 1604884424.0
    },
    {
        "author": "diesel408",
        "body": "So the other response summed it up pretty well, but left one other important factor out. The importance of Intel's architecture is fading. It will always be around of course, but anyone that doesn't think ARM is going to keep getting a larger and larger bite of the pie isn't paying attention. Apple will give everyone permission to target software for ARM architecture and we'll soon see a second attempt from Microsoft. Again, we'll always have applications for Intel, but it won't be nearly as dominant. Intel's production woes over the past half decade are well documented, and it's clear that they are about as well run as Boeing these days. The problem for Intel is that they face much more fierce competition than Boeing. Intel will survive of course, but they'll be a shell of their former self, and they'll have fumbled their flagship products and missed the boat on the areas of the industry that are sure to see rapid growth. I understand that people want to target value, but Intel is priced the way they are for good reason. If you're looking for value in Intel then I have some IBM stock to sell you as well.",
        "created_utc": 1604375350,
        "id": "gayyy7s",
        "score": 1,
        "subreddit": "investing",
        "created": 1604404150.0
    },
    {
        "author": "howtoreadspaghetti",
        "body": "IBM also comes to mind.",
        "created_utc": 1604318700,
        "id": "gaw082y",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1604347500.0
    },
    {
        "author": "letsdoit60",
        "body": "I wasn’t considering ibm tech!",
        "created_utc": 1604410417,
        "id": "gb03ko0",
        "score": 1,
        "subreddit": "investing",
        "created": 1604439217.0
    },
    {
        "author": "lucidvein",
        "body": "I would not recommend buying IBM at this time.  It's a company to watch with the restructuring changes, but they are restructuring to stay afloat.  They didn't adapt with the times and have been completely bypassed when it comes to cloud offerings etc.  \n\nThey did buy redhat which is likely a good investment, but the stock has been tracking downward for quite some time.  I'd absolutely wait dipping your foot in until they manage to turn their actual stock performance around as it's a stock continuing to experience negative momentum in a very bullish tech sector.",
        "created_utc": 1604783588,
        "id": "gbhuh98",
        "score": 1,
        "subreddit": "investing",
        "created": 1604812388.0
    },
    {
        "author": "stvaccount",
        "body": "He meant that apple is building their own ARM chips. And MSFT builds xbox hardware. Intel is strong, because of their startup investments.  \n\n\nThe fastest chip today is built by IBM and produced by Samsung FAB.  \n\n\nEveryone uses TSMC to build CPUs (also Intel). Samsung has a shot for a big comeback, Intel also but slimmer.\n\n&amp;#x200B;\n\nThe question is: which FPGA comany is bought next and what will happen to companies without their own FPGA company.",
        "created_utc": 1604793310,
        "id": "gbinoa9",
        "score": 1,
        "subreddit": "investing",
        "created": 1604822110.0
    },
    {
        "author": "SudsAde6985",
        "body": "IBM raging. Lol. Truly nonsensical...all of it. Just gotta dodge &amp; weave. GL!",
        "created_utc": 1605026765,
        "id": "gbubye9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605055565.0
    },
    {
        "author": "kotsumu",
        "body": "They have small competitors here and there, mostly small scale startups. Closest ones worth mentioning that I can think of and are not mainstream companies like IBM are companies like Leidos and Booz Allen Hamilton.\n\nThe way their business model works is fundamentally different from Palantir. They evaluate technologies and purchase/ contracts from smaller companies (maybe startups) and package it up as a complete solution and sell it to the government. This essentially means that these companies are a little more than resellers of tech. Palantir's direct to consumer model focus their investments in RnD.",
        "created_utc": 1604958784,
        "id": "gbrg8ao",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604987584.0
    },
    {
        "author": "jpric155",
        "body": "IBM and INTC.   Boomer stocks saving me today.",
        "created_utc": 1605024167,
        "id": "gbu6h1f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605052967.0
    },
    {
        "author": "bald_bankrupt",
        "body": "You are wrong on everything. \n\niPhone 12 cpu is made by TMSC. \n\nXbox are PC parts from different manufacturers. \n\nIBM does not have anything close to the fastest cpu and its sales decline year after year since it was invented,\n\nIntel makes its own CPUs, all of them. Intel never outsourced manufacturing.",
        "created_utc": 1604850051,
        "id": "gbmbril",
        "score": 1,
        "subreddit": "investing",
        "created": 1604878851.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  9th of November\n\n\n\n## Upcoming events for Monday, November  9th\n\n - Stock splits:\n\n    - DSE @ **1:10**\n    - WYY @ **1:10**\n\n - Expected earnings:\n\n  ABST, AC, ACB, ACTG, ADES, ADMP, AESE, AGM, AKTX, AL, ALE, ALLK, ALUS, AMBC, APEI, APPF, APTS, APYX, ARCT, ARNA, ASM, ASUR, AT, ATCO, ATCX, ATHX, ATRA, ATXI, AVD, AVDL, BATL, BCOR, BHVN, BIP, BKI, BLRX, BRMK, BTU, BXRX, BYFC, BYND, CARA, CARS, CASI, CCO, CCXI, CEPU, CGC, CLAR, CLPR, CNNE, CNSP, CNXN, CPRX, CRESY, CSTL, CTRA, CVGI, DFFN, DHT, DIOD, EBIX, EBR, EBR.B, EC, ELVT, ELY, EQX, ESTA, EVFM, FBRX, FENG, FF, FLGT, FPAY, FPI, FSK, FSKR, FTK, FTSI, FUNC, GAIA, GECC, GFN, GLT, GOGO, GPMT, GSKY, GSL, GTH, HBB, HCHC, HGBL, HGEN, HIL, HL, HMTV, HPK, HPR, HROW, HT, HWM, HYMC, ICCC, ICCH, ICMB, ICPT, IDEX, IEA, IFF, IHRT, III, IIN, INFI, INO, INUV, IPAR, IRIX, IRS, ITCI, IVR, KIN, KLR, KNDI, KOS, KRYS, LIQT, LIZI, LMNL, LNSR, LUNA, MARA, MBI, MBII, MCD, MCRB, MGNI, MPAA, MRKR, MRNS, MRSN, MTBC, MWA, MWK, MYGN, NATR, NBEV, NBIX, NCLH, NEOS, NGL, NHI, NKLA, NLS, NMRD, NNOX, NOAH, NSCO, NSPR, NSTG, NVAX, NXE, OMER, OPRX, OR, ORGO, OSH, OXBR, OXY, PAM, PDLI, PEIX, PFIE, PGEN, PHUN, PLSE, PLUG, PRCP, PROG, PROS, PRTS, PRTY, PTE, PTMN, PWFL, RAIL, RAMP, RDNT, REAL, REED, REI, REPH, RETA, RMTI, RNA, RNG, RPAY, RUBY, RVMD, RVNC, SAMA, SCOR, SCSC, SCU, SENS, SESN, SIEN, SMTS, SNCR, SND, SNDE, SOHO, SPG, SPNE, SPT, SRT, SSTI, STAY, STRS, STXS, SVC, SWAV, SYNL, TCO, TGNA, TH, TLGT, TLND, TLRY, TPTX, TRVN, TSQ, TTCF, TXMD, TYME, UNIT, URGN, VERI, VRS, VUZI, WATT, WBAI, WES, WHF, WIFI, WKHS, WPM, WPRT, WVE, XERS, XP, XPER, YALA, ZAGG, ZGNX, ZI, ZIXI\n\n - Ex-div:\n\n  AEP, AMSF, AWK, BFIN, CDR, CG, COLB, CSTR, DCF, DEA, DVD, EBTC, FBMS, FCCY, FDP, GABC, GBX, GGB, GHM, HBI, HOMB, IBM, INVH, ISBC, KMT, LARK, LSTR, MCBC, MDC, MKTX, MPB, MPX, MSM, MTG, MWA, NBN, NFBK, OLN, PAG, PCAR, PGC, PPG, PPR, PZZA, RA, RILY, ROL, SASR, SCCO, SFBC, SON, SSSS, SXI, WBK, WBS, WCN, WELL, WETF, WINA, WNEB, WST, WTBA, XLNX\n\n## Upcoming events for Tuesday, November 10th\n\n - Stock splits:\n\n    - SMLP @ **1:15**\n\n - Expected earnings:\n\n  AAME, AAP, ABEO, ADPT, AER, AFMD, AGTC, AIKI, AKRO, ALC, ALEC, ALT, AMK, AMTI, APTO, ARA, ARMP, ASH, ATHM, ATNM, AVEO, AVGR, BBDC, BBQ, BCEL, BDTX, BNTX, BOMN, BOXL, BPT, BRKS, BSY, BWL.A, CAAS, CAE, CELP, CFRX, CHFS, CHMI, CHRA, CHSCP, CLPT, CLRB, CLSD, CLSK, CNR, COCP, COGT, COHR, CPHC, CPIX, CPST, CRBP, CRIS, CRNX, CRSR, CRTX, CRWS, CTIC, CVET, CVV, CWCO, CXDO, CYAN, CYBR, DDOG, DHI, DMS, DMTK, DOX, DQ, DTIL, EGAN, ELMD, ELP, ELSE, EQ, ERJ, EVI, EVOL, EYEN, FAT, FBIO, FENC, FICO, FIXX, FLUX, FONR, FOXF, FPH, FRHC, FTEK, FUBO, FULC, FURY, FUSN, GALT, GBIO, GBLI, GEC, GEVO, GILT, GLOG, GLOP, GMDA, GO, GOSS, GRFS, GSAT, GSH, GTT, HAIN, HCAT, HOTH, HTGM, HTHT, ICON, IFS, IMOS, INSE, INTT, ISR, ITRM, JMIA, KOD, KODK, KRNT, LAC, LGL, LJPC, LOGC, LORL, LPCN, LPRO, LUMO, LUNG, LYFT, MARK, MBIO, MBRX, MCF, MDNA, MDRR, MDWD, MMX, MNDO, MODN, MOGO, MOR, MORF, MVO, MYO, NEON, NES, NEXT, NGM, NHC, NK, NOVT, NRBO, NSYS, NTIC, NTRP, NTWK, OCGN, OCN, OEG, ONCY, ONEM, ONTX, OPRT, PASG, PAYS, PBT, PECK, PFMT, PHIO, PLMR, PLRX, PMD, PNTG, POLA, PRPH, PRPL, PRSP, PRVL, PSTL, RADA, RCEL, RCMT, RDCM, RDVT, RESN, RIOT, RKT, RLGT, RMBL, ROK, RXT, SANM, SAVA, SCPH, SCYX, SHIP, SHSP, SILK, SILV, SJT, SNGX, SNMP, SNSS, SPKE, SRRK, SSKN, SSNT, STAF, STEP, STOK, STSA, SURF, SWTX, SYN, TAT, TCON, TCP, TCRR, TGTX, THCA, TIMB, TME, TRMD, TRQ, TXG, VCNX, VEC, VIE, VIR, VITL, VIV, VNRX, VSTM, VTSI, VXRT, WHLM, WILC, WISA, WMG, WSTG, XBIT, XELA, XGN, ZOM\n\n - Ex-div:\n\n  ACV, AIO, AROC, CBH, COG, DBL, DLY, DSL, EFL, EHT, ETR, EVF, FANG, GILT, GWB, HNNA, HPF, HPI, HPS, HTD, IVZ, KBH, LPLA, MATX, MSA, NCV, NCZ, NTB, OPY, PCI, PCK, PCN, PCQ, PDI, PEAK, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, POOL, PTY, PYN, PZC, RMD, SBUX, SHEN, SIMO, TBNK, VGI, VNOM, WTFC, XOM, ZION, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.765%)\n    - API Weekly Crude Oil Stock (previous: -8.010M)\n    - EIA Short-Term Energy Outlook\n    - FOMC Member Brainard Speaks\n    - IBD/TIPP Economic Optimism (previous: 55.2)\n    - JOLTs Job Openings (consensus: 5.590M, previous: 6.493M)\n    - NFIB Small Business Optimism (consensus: 102.2, previous: 104.0)\n    - Redbook (previous: 1.2%)\n    - Redbook (previous: 3.2%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, November 11th\n\n - Expected earnings:\n\n  ACER, ACIA, ACIU, ACST, ADNT, AGRO, AIRT, ALAC, ALNA, ANVS, APD, APEN, APG, APLT, ARCO, ARDS, ASND, ASTC, ATEX, ATLO, ATO, ATOS, ATTO, AWX, AXAS, BEAM, BEDU, BEST, BFRA, BKTI, BSGM, CARV, CBMG, CBPO, CCF, CCMP, CFBI, CHEK, CIB, CIH, CMCL, CMCM, CNFR, CODX, CVU, CYCC, CYD, CYRN, CZZ, DCTH, DOYU, DSSI, DYAI, EDAP, EDN, EMX, ENOB, ENS, ENSV, EPM, EPSN, ESSA, EVK, EVOL, EXPI, FOSL, FTHM, GGAL, GIB, GLAD, GOCO, GRNQ, GRWG, GSV, HI, HMG, HOLI, HUYA, HYRE, IDXG, IDYA, IGC, IMTX, IMVT, ISIG, ISNS, ITCB, JCTCF, JE, KMDA, KTRA, LINC, LINX, LMND, LND, LPL, LRMR, LYRA, MCEP, MCFT, MFC, MIRM, MIST, MLND, MLVF, MOSY, MUFG, NCNA, NEPT, NLTX, NSEC, NTN, NVEE, NVFY, NVGS, NVUS, NYMX, OFED, OM, ONCY, OPGN, OSW, PANL, PATI, PCOM, PCVX, PDSB, PEBK, PNBK, PRPO, PRQR, PTN, PTVE, PYPD, QLGN, RAVE, RDI, REYN, RHE, RLMD, RPRX, RVLV, SA, SANW, SCPE, SGRP, SIEB, SLGG, SLNO, SLP, SLRX, SMFG, SNDL, SNES, SONM, SPTN, SYNC, TCOM, TELA, TG, TGA, TGC, TRNO, TRT, TRVI, TTEK, USAS, VEL, VERX, VOC, VRCA, VRM, VYGR, WHLR, WTER, WVVI, XAIR, XELB, XPEL, ZYNE\n\n## Upcoming events for Thursday, November 12th\n\n - Stock splits:\n\n    - PDS @ **1:20**\n\n - Expected earnings:\n\n  AACG, AAU, ACHV, ACY, ADCT, ADIL, AEYE, AFIB, AGBA, AGE, AGRX, AHPI, AIHS, AIM, AKER, AKUS, ALTG, ALYA, AMAT, AMTX, AMWL, ANDA, ANY, APTX, AQN, ARL, ASLN, ATLC, AUPH, AVCO, AWH, AXLA, AXU, AYLA, AYTU, AZRX, BAK, BAM, BANX, BBI, BCOW, BHB, BIOC, BIOL, BIOX, BKYI, BLI, BLNK, BLU, BNGO, BRP, BSQR, BTAI, BTN, BW, BXG, BZH, CALT, CANG, CBLI, CBMB, CCNC, CDOR, CELH, CERC, CETX, CHCI, CJJD, CLRO, CLSN, CMPS, CNET, CREX, CRHM, CRTD, CSCO, CSSE, CTEK, CURI, CXDC, CZNC, DARE, DAVA, DDS, DESP, DGII, DGLY, DIS, DLB, DLPN, DRAD, DRIO, DTSS, DYNT, EAST, ECOR, EDRY, EFOI, ENR, EPC, ESP, ETON, EYES, FFBW, FLY, FMTX, FRD, FSEA, FSI, FSM, FTCH, GBR, GDRX, GHSI, GLG, GLMD, GLOB, GNLN, GNPX, GP, GPOR, GRVY, GSMG, GURE, GWGH, HAYN, HEPA, HFFG, HIMX, HJLI, HOOK, HQI, HRMY, HSDT, HSTO, HUSA, HYLN, IBIO, ICL, IFMK, IGIC, IGT, IMAC, IMV, INFU, INMD, INOD, INPX, INTZ, IOR, IPWR, IZEA, JAGX, JAMF, JOBS, JRSH, KB, KBNT, KFFB, KROS, LEDS, LEGH, LIFE, LMB, LMFA, LMPX, LPTX, LSF, LTRX, LWAY, MARPS, MBOT, MDLY, MEG, METX, MFG, MIC, MICT, MOTS, MPLN, MSN, MTOR, MTR, MYOV, MYSZ, NAII, NAK, NARI, NBAC, NBSE, NBY, NETE, NGVC, NICE, NNDM, NTIP, NVMI, NWGI, NYC, OBCI, OBLG, OCX, OGEN, OMEX, OPHC, OPNT, OSMT, OSS, PCSA, PDD, PFIN, PHAS, PHGE, PIH, PLAG, PLTR, PRT, PRTH, PXS, QRHC, RBCN, RDHL, REDU, REKR, RELV, RMED, RPTX, RSSS, RVP, SACH, SALM, SB, SBH, SBS, SCX, SDGR, SELF, SFT, SGBX, SHI, SINA, SJ, SLGL, SLS, SMTI, SNBP, SNCA, SNFCA, SNOA, SOLY, SONN, SPH, SRAX, SSRM, SSY, SSYS, STON, SUMR, SUNW, SVT, SWIR, SYPR, TAIT, TARA, TCDA, TCI, TDG, TENX, TGH, TGP, THMO, THRY, TIG, TK, TKAT, TKC, TMDI, TNK, TR, TRIL, TSEM, TTNP, TUFN, TYHT, U, UAMY, UAVS, UBOH, UFAB, UNAM, UONE, UONEK, USEG, USIO, VBFC, VEDL, VERB, VERY, VET, VISL, VIVE, VJET, VRME, WB, WF, WINT, WIX, WORX, WTT, XNET, XPEV, XSPA, YRD, YTEN, ZEAL, ZNTL, ZSAN\n\n - Ex-div:\n\n  ABST, ADS, AHC, ARCB, ASTE, AUB, AVK, BFST, BPRN, BRKL, BSET, BSM, BWFG, CCD, CGNX, CGO, CHI, CHW, CLCT, CPZ, CSQ, CTVA, CVCY, CVGW, CWBC, DUK, EBMT, EMR, ENB, EQNR, EVA, FCFS, FMO, FNWB, GBAB, GCBC, GDV, GGM, GHY, GLW, GNT, GOF, GRC, GSK, GUT, HON, HP, HTLF, IHIT, ISD, IVH, JBGS, JCO, JEF, JEMD, JFR, JGH, JHAA, JHB, JLS, JOE, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LAD, LGI, LLY, LPX, MMS, MSCI, MSEX, MSVB, MUSA, NAC, NAD, NAN, NBB, NCB, NDMO, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NYV, NZF, OBNK, ODC, OMP, OPP, OTTR, OXLC, OXSQ, PCSB, PFC, PFS, PGZ, RDS.A, RDS.B, RFM, RGR, RIV, RMI, RMM, RSF, RTX, SAL, SALT, SCHW, SHBI, SHW, SIGI, SJM, SJR, SMBC, SSB, SSBI, TAIT, TCF, TFC, TFX, TSBK, UPS, USA, V, VBF, VTA, VVR, WAB, WAL, WD, WEC, WRK, WTRG, XEC\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.578%)\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.085%)\n    - CPI (consensus: 0.2%, previous: 0.2%)\n    - CPI (consensus: 1.3%, previous: 1.4%)\n    - CPI Index, n.s.a. (consensus: 260.59, previous: 260.28)\n    - CPI Index, s.a (previous: 260.21)\n    - CPI, n.s.a (previous: 0.14%)\n    - Chicago Fed President Evans Speaks\n    - Cleveland CPI (previous: 0.1%)\n    - Continuing Jobless Claims (consensus: 7,200K, previous: 7,285K)\n    - Core CPI (consensus: 0.2%, previous: 0.2%)\n    - Core CPI (consensus: 1.7%, previous: 1.7%)\n    - Core CPI Index (previous: 269.26)\n    - Crude Oil Imports (previous: 0.560M)\n    - Crude Oil Inventories (previous: -7.998M)\n    - Cushing Crude Oil Inventories (previous: 0.936M)\n    - Distillate Fuel Production (previous: 0.149M)\n    - EIA Refinery Crude Runs  (previous: 0.164M)\n    - EIA Weekly Distillates Stocks (previous: -1.585M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.4%, previous: 0.7%)\n    - FOMC Member Williams Speaks\n    - Federal Budget Balance (consensus: -124.0B, previous: -125.0B)\n    - Gasoline Inventories (consensus: -0.871M, previous: 1.541M)\n    - Gasoline Production (previous: -0.023M)\n    - Heating Oil Stockpiles (previous: -0.395M)\n    - IEA Monthly Report\n    - Initial Jobless Claims (consensus: 738K, previous: 751K)\n    - Jobless Claims 4-Week Avg. (previous: 787.00K)\n    - Real Earnings (previous: 0.2%)\n\n^^^^2020-11-09",
        "created_utc": 1604919625,
        "id": "gbpii9c",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1604948425.0
    },
    {
        "author": "abcomputer",
        "body": "IBM cloud?",
        "created_utc": 1604247716,
        "id": "gasy3c0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604276516.0
    },
    {
        "author": "Vast_Cricket",
        "body": "**Spce** is legit. Keep in mind that is a rocket science company. Suppose gov't did not give the clearance for 2 years we understand they are ready can wait for 2 years.  So I will be around so long there are investors willing to keep the company running.\n\nAs for the eV controversial giant, this is not quite finished. Personally even if they have no product or schedule they will linger around awhile. They can use their patents sue every manufacturer in eV and often they generate revenue from those manufacturers as hush up money.\n\nSome years ago, a hard disk manufacturer making 3.5\" hard drive business was failing. It had a strong intellectual property department sued every hard disk manufacturer in the 3.5\" drive claiming patient infringement. In 1990 IBM was hit with a lawsuit as an inventor of the drive and sue by a smaller player. It paid some hush money. Seagate was dismissed in 1997, sue again and paid [$45 M to R+ as late as 2000](https://www.electronicsweekly.com/news/archived/resources-archived/seagate-to-pay-rodime-45m-to-settle-suit-2000-01/).   R+ only exists as a shell company and its share price soared on news of the patent settlement.  I think **NKLA** can remain as a shell company with its patent portfolio covering designs that covers most vehicles built electric or not. [It sue Tsla earlier](https://www.forbes.com/sites/alanohnsman/2020/04/20/teslas-effort-to-short-circuit-nikola-lawsuit-fizzles-as-patent-office-denies-door-argument/?sh=44dc21a45d78). That Tesla copied NKLA on shield, cab shape and windshield design sued for $2B. If you think you will prosper you can bag hold your stocks.",
        "created_utc": 1604267257,
        "id": "gau1cea",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604296057.0
    },
    {
        "author": "Jarlaxle_rigged_it",
        "body": "Ones that have been performing weak lately.. that shows skepticism..  also high P/E ratio. e.g Tesla was the obvious choice and i still didn't hop on the run down cause it was all too far/was working. Also look at distance to next support or so.  \n\n\nCandidates i have for next week are still Tesla, NVDA, IBM, NFLX",
        "created_utc": 1604238515,
        "id": "gasisd6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604267315.0
    },
    {
        "author": "Shklyar1902",
        "body": "Honestly, in the current market, it's far more speculative then in the past (*cough* Tesla *cough*)\nNvidia would be a good hold it for a while stock, just in my eyes they seem to be heading the route of IBM, going more into the commercial business (cloud storage, servers...)  which will cause an initial drop in stock",
        "created_utc": 1604443975,
        "id": "gb1zqaa",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604472775.0
    },
    {
        "author": "peter-doubt",
        "body": "Have you collected (not cashed) the checks? \n\nAre you the executor ( or she?)\n\nCopy them .  Send the copy back to their investor relations dept., explaining the predicament.\n\nIBM doesn't want it, and doing so defines the nightmare *they* have.. sending you reports every year at $20  plus administering your unwanted account.. you don't want it, nor do they! \n\nI'd start there. If you had the certificate, selling costs money, too. I'd find a charity and give it away for the deduction.",
        "created_utc": 1604318866,
        "id": "gaw0ep9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604347666.0
    },
    {
        "author": "Summebride",
        "body": "I'd discourage hyperbole like \"longer than your lifetime\".  Statements like,that haven't aged well for Xerox, Commodore, IBM, GE, Blackberry, Enron, Exxon, Blockbuster, and more.",
        "created_utc": 1604503122,
        "id": "gb4fq97",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604531922.0
    },
    {
        "author": "FifiandColumbo",
        "body": "They let her cash/deposit checks without his signature for a few months after he passed away, but it's been a year and a half, and now they're telling her any checks need to be in her name.  She's a sweet little old lady, though, so maybe she can sweet talk them into it. \n\nCalling IR at IBM is worth a try. Thanks for the suggestion.",
        "created_utc": 1604425161,
        "id": "gb0wge7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604453961.0
    },
    {
        "author": "Fractadactyl",
        "body": "Ibm dip",
        "created_utc": 1604425895,
        "id": "gb0y183",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604454695.0
    },
    {
        "author": "ReflectAA",
        "body": "Why can’t your mom cash your dads checks? That is the most unusual part of this. Were they never married? It might be easier to bring his death certificate to a bank and explain the situation and see if they allow her to cash his checks as the surviving spouse. \n\nI would not bother with the Compushare BS. If the bank doesn’t work you can try contacting IR directly for IBM and tell them that Compushare is being intentionally difficult. I’ve never tried that myself though it may lead nowhere.",
        "created_utc": 1604404699,
        "id": "gazvw05",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604433499.0
    },
    {
        "author": "djpitagora",
        "body": "IBM, Apple and Microsoft disagree.",
        "created_utc": 1604410283,
        "id": "gb03d41",
        "score": 1,
        "subreddit": "investing",
        "created": 1604439083.0
    },
    {
        "author": "036Gooddaysir036",
        "body": "IBM is also an excellent buy. It just recently became an Aristocrat since it increased its dividend for 25 years now. So both, both is good. But if you're only considering one or the other then it is going to come down to which you believe has a better business model and is more likely to continue to increase their dividend payout.",
        "created_utc": 1604299457,
        "id": "gaviemp",
        "score": 1,
        "subreddit": "investing",
        "created": 1604328257.0
    },
    {
        "author": "thewimsey",
        "body": "MSFT wasn't  a computer company. It was a software company. IBM was a computer company.\n\nThe brilliance of MSFT was in - and this seems weird today - realizing that a company could make money just selling software. A ton of money. More money than computer makers could make by themselves. This was a kind of radical idea at the time.\n\nJobs was very successful at the computer business; the Apple was the bestselling PC from 1977-1982.\n\nApple wasn't killed by MSFT, it was killed by IBM, which built a PC from more or less off the shelf parts allowing *anyone* to build a clone. (Which, incidentally, would run windows). \n\nApple's computers couldn't compete with PCs built with off the shelf parts. It's not about Jobs being bad; it's about other people being better.\n\nIBM's approach almost immediately priced *them* out of the PC market, leaving the profits to MSFT and intel (and a tiny bit for clone makers, who mostly ended up in a low margin commodity business).",
        "created_utc": 1604280445,
        "id": "gauq3df",
        "score": 1,
        "subreddit": "investing",
        "created": 1604309245.0
    },
    {
        "author": "lucky_ducker",
        "body": "IBM used to be the classic \"widows and orphans\" stock. New stockbrokers were told that they could never lose their jobs by losing clients' money in IBM.",
        "created_utc": 1604445328,
        "id": "gb22b5c",
        "score": 1,
        "subreddit": "investing",
        "created": 1604474128.0
    },
    {
        "author": "Lie-Minimum",
        "body": "IBM and INTC",
        "created_utc": 1604713824,
        "id": "gbetpab",
        "score": 1,
        "subreddit": "investing",
        "created": 1604742624.0
    },
    {
        "author": "DarkStarOptions",
        "body": "&gt;It does limit your loss by a half, but it does increase your probability of loss by a factor of two as well. Now that you close the spread once it gets touched, your probability of loss is now the probability of touching the short strike (which is approximately twice the probability of being ITM).\n\nAs opposed to waiting to see if the stock rebounds off the short strike?  \n\nMakes sense.\n\n&amp;#x200B;\n\nI opened a spread against IBM about 3 weeks ago, a 35 day spread.  It initially dipped below the short strike but I didn't freak out because I had 30 days for it to go back up....and it did.  Now my spread is OTM and profitable and has been for about a week.  \n\n&amp;#x200B;\n\nThis guy was putting forth a strategy of writing a spread with a short strike of 20 delta for &lt; 14 days.  I guess the thought is if the stock moved that much in a short amount of time to test the short strike, probably best to just close it for a loss rather than manage it with just a few days left until expiration.  That's my guess but I don't know because I didn't ask him.",
        "created_utc": 1604733204,
        "id": "gbflvpd",
        "score": 1,
        "subreddit": "options",
        "created": 1604762004.0
    },
    {
        "author": "TheGoodBunny",
        "body": "Define \"safest\" and \"long term\" for yourself. No single company is safe forever. 10-15 years ago you would have picked Ford, IBM, Exxon as \"safest for long term\". For buy-and-forget you will be better off investing in an index.",
        "created_utc": 1604779663,
        "id": "gbhio59",
        "score": 1,
        "subreddit": "investing",
        "created": 1604808463.0
    },
    {
        "author": "ascendtofutility",
        "body": "It could happen over a period of five years or so. Yes it's unlikely. How likely was it for the Lehman bros and bear Stearns to collapse? How likely was it for IBM to fuck up and get knocked off the top? What I'm trying to say, there's more risk indexing right now than there ever was. My personal opinion, we are in a coronavirus bubble that will pop in a year or so when people can allocate money to other equities safely. Money doesn't disappear, it just moves around.",
        "created_utc": 1604769111,
        "id": "gbgw3mn",
        "score": 1,
        "subreddit": "investing",
        "created": 1604797911.0
    },
    {
        "author": "Kashm11r",
        "body": "BAM, FB, GOOG, IBM all have multi billion dollar investments in India. Major energy companies like Sunpower, First Solar, Canadian Solar, GE, Vestas as well.",
        "created_utc": 1605023076,
        "id": "gbu47vp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605051876.0
    },
    {
        "author": "skilliard7",
        "body": "&gt; Bitcoin has plenty of intrinsic use. These include borderless transfer without needing to convert to to local currency (cant do this with Western Union), black markets, safe haven from oppressive governments, sending aid to citizens of oppressive governments, ways to bypass import sanctions (see Iran), and more. Just because you don't have intrinsic use for BTC, doesn't mean others don't (see link below).\n\nYou can do this with Ethereum, Litecoin, Monero, Vertcoin, even Dogecoin. I agree cryptocurrency and blockchains are useful but I don't see Bitcoin as a long term store of value. It's far more volatile than precious metals and also intangible.\n\nIBM is making huge strides towards quantum computing, and once they pull it off, Bitcoin will become worthless once the public/private key cryptography is cracked and anyone with access to a quantum computer can simply sign transactions to send coins to themselves. We're easily within 10 years at this point, possibly less.\n\n&gt;This is like saying anyone can create a better social network than Facebook and therefore Facebook has no value\n\nWhat about Myspace? It came first.\n\n&gt;Wrong. Best case scenario is that BTC continues to be added to the balance sheets of large, publicly traded companies\n\nLike 1 or 2 companies that hold it as a tiny position. I think Overstock and Square? Most companies that accept it just use Bitpay or Coinbase to instantly sell it.",
        "created_utc": 1605023410,
        "id": "gbu4wlq",
        "score": 1,
        "subreddit": "investing",
        "created": 1605052210.0
    },
    {
        "author": "dampon",
        "body": "You know that decades ago that GE, Kodak, Xerox, IBM, Sears, etc. were the Amazons of those time periods right?\n\nHow are they doing today?\n\nCan't use hindsight to pick a stock. And you can't assume just because Amazon is on top now it will continue to be forever.",
        "created_utc": 1604954794,
        "id": "gbr83vn",
        "score": 1,
        "subreddit": "investing",
        "created": 1604983594.0
    },
    {
        "author": "Applesauce9210",
        "body": "If you want individual stock exposure, XOM. Maybe IBM if you’re looking for tech tilt",
        "created_utc": 1605011702,
        "id": "gbtl6hi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605040502.0
    },
    {
        "author": "audion00ba",
        "body": "&gt; The fastest chip today is built by IBM\n\nWhich one would that be?",
        "created_utc": 1604848088,
        "id": "gbm8e7x",
        "score": 1,
        "subreddit": "investing",
        "created": 1604876888.0
    },
    {
        "author": "dareftw",
        "body": "It’s pretty true. I have a BS in Economics and an MA in applied economics and an MQM (Masters in Quantitative Management) as well. And the first question people ask when they find out what I did in college is about the economy and stocks. And it’s a dumb question and they don’t even realize it. Like I spent years learning about scarcity and a bunch of basically applied calculus and statistics. \n\nUnless I work directly for a brokerage I wouldn’t have enough time to make an informed decision any one way or the other, and even then it would only be a best estimate and one with enough of a likely chance to not be correct that it would be pretty irresponsible to give an opinion on it. \n\nI can fully do the math behind it sure, but the stock market has proven time and time again that it’s irrational and not really predictable with any algorithm. There is a reason that economic theory even says throwing a dart at a chart of stocks and picking where it lands is just as likely to be accurate than if you picked it based on extensive amounts of DD and research. \n\nBut I just point people towards index’s, tell them if they aren’t retiring in the next 5 years don’t be afraid or worried that the stock market drops every now and then etc etc. \n\ntl;dr Economists don’t study the economy they study scarcity. I’d be extremely skeptical of any economist claiming to know what the market will do or that they have figured out the stock market. We exist to do small scale data analysis, or to advise large scale economic moves aka monetary/fiscal policy, we aren’t adept at guessing small movements within certain markets. And if we’re in a spot where we can then we are also in a spot where the sec would have something to say if we profited off it.",
        "created_utc": 1604436008,
        "id": "gb1jcz6",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1604464808.0
    },
    {
        "author": "submarine-observer",
        "body": "I understand China = bad on Reddit. But basically Jack Ma wants Ants financial to act like a bank without the banking regulations. He is bloodsucker worse than Jeff Bezos.",
        "created_utc": 1604420121,
        "id": "gb0lrf9",
        "score": 14,
        "subreddit": "investing",
        "created": 1604448921.0
    },
    {
        "author": "beyondarmonia",
        "body": "Jack Ma was an English teacher 😅",
        "created_utc": 1604427292,
        "id": "gb110eu",
        "score": 12,
        "subreddit": "investing",
        "created": 1604456092.0
    },
    {
        "author": "RealisticHumanBot",
        "body": "5M MA crossover, the bulls have won",
        "created_utc": 1604284502,
        "id": "gaux9kw",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1604313302.0
    },
    {
        "author": "vitaq",
        "body": "Ever seen that Elon / Jack Ma interview? Cringe worthy",
        "created_utc": 1604420942,
        "id": "gb0nhni",
        "score": 10,
        "subreddit": "investing",
        "created": 1604449742.0
    },
    {
        "author": "stonkpicks",
        "body": "Jack Ma vs Elon Musk. Clearly Elon is crushing it today",
        "created_utc": 1604427926,
        "id": "gb12cm5",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1604456726.0
    },
    {
        "author": "swolking",
        "body": "Jack Ma is literally one of us and you should buy the dip to support him.\n\n “As the Chinese like to say, if you borrow 100,000 yuan from the bank, you are a bit scared; if you borrow a million yuan, both you and the bank are a little nervous; but if you take a 1 billion yuan loan, you are not scared at all, the bank is,” Ma said. ",
        "created_utc": 1604427637,
        "id": "gb11qol",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1604456437.0
    },
    {
        "author": "bad_ass_blunts",
        "body": "In a way, yes.\n\nMany wealthy businessmen in China are charged with crimes.\n\nJack Ma is the useful kind of capitalist that won't step too much on the PRC's toes, and can serve as an ambassador for China's state capitalism.",
        "created_utc": 1604422610,
        "id": "gb0r1lo",
        "score": 7,
        "subreddit": "investing",
        "created": 1604451410.0
    },
    {
        "author": "wvwvvwvvvw",
        "body": "Have you watched the video with him and Elon? Jack ma is literally retarded",
        "created_utc": 1604442729,
        "id": "gb1x9q1",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604471529.0
    },
    {
        "author": "rightovahere",
        "body": "Lmao Jack Ma really went off and started talking shit to the Chinese Govt right before his IPO? That's a big dick move right there.\n\nI might get back into BABA with this wild dip. Earnings coming up too",
        "created_utc": 1604430020,
        "id": "gb16r4s",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604458820.0
    },
    {
        "author": "coldhamm",
        "body": "Jack Ma got caught in a sex scandal with 5 Taiwanese lads",
        "created_utc": 1604420161,
        "id": "gb0ludg",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604448961.0
    },
    {
        "author": "HotStockSlinger",
        "body": "Jack Ma is going to have a mysterious accident soon.",
        "created_utc": 1604422005,
        "id": "gb0prac",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604450805.0
    },
    {
        "author": "Cyrusis",
        "body": "They (Chinese regulators) are showing Jack Ma who is boss. It’s a joke.",
        "created_utc": 1604443867,
        "id": "gb1ziqx",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604472667.0
    },
    {
        "author": "Furloughedinvester",
        "body": "Couldn't Uncle Ma Ma keep his mouth shut till AFTER the damn ipo??",
        "created_utc": 1604462577,
        "id": "gb2x5xo",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604491377.0
    },
    {
        "author": "VaginalDischarge",
        "body": "Wish I could roll Jack Ma up into a little ball like in the cartoons and dunk him in an over the door Nerf hoop right about now.",
        "created_utc": 1604428507,
        "id": "gb13kk6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604457307.0
    },
    {
        "author": "Stlblues1516",
        "body": "Technically MasterCard and visa are in the technology sector.",
        "created_utc": 1604354341,
        "id": "gaxwffw",
        "score": 5,
        "subreddit": "stocks",
        "created": 1604383141.0
    },
    {
        "author": "drrbillionaire",
        "body": "curfews occurring in MA again. other states might follow. lockdowns in EU already. is it time to get calls on ZM or wait until the EOW?",
        "created_utc": 1604349743,
        "id": "gaxmzz6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604378543.0
    },
    {
        "author": "shivdvm",
        "body": "BABA’s Jack Ma is the Chinese equivalent to Musk.... Innovating and talking shit w/ the govt and ramping up volatility. Here hoping today was just his version of “price to high IMO”",
        "created_utc": 1604442592,
        "id": "gb1x00b",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604471392.0
    },
    {
        "author": "cariusQ",
        "body": "Who the fuck upvoted you?\n\nThis is most batshit insane comment I have read about Ma.",
        "created_utc": 1604437297,
        "id": "gb1m5cz",
        "score": 4,
        "subreddit": "investing",
        "created": 1604466097.0
    },
    {
        "author": "flyedchicken",
        "body": "Jack Ma made big China mad",
        "created_utc": 1604421815,
        "id": "gb0pchg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604450615.0
    },
    {
        "author": "ImNoAlbertFeinstein",
        "body": "\"ANT would not be systemic risk to Chinese economic system because China does not have a system.\"\n-Jack Ma",
        "created_utc": 1604420333,
        "id": "gb0m77p",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604449133.0
    },
    {
        "author": "BlackcockInvestments",
        "body": "They got my boy jack ma, free ma!",
        "created_utc": 1604370849,
        "id": "gayr2mv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604399649.0
    },
    {
        "author": "donefukupped",
        "body": "Ma is already on a leash. Cannot escape China with his momey. He cannot leave the county with his family.",
        "created_utc": 1604380614,
        "id": "gaz6zla",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604409414.0
    },
    {
        "author": "Technoho",
        "body": "Nio done incredible today when u consider every other China stock is heavy red thanks to Jack Ma spanking",
        "created_utc": 1604417911,
        "id": "gb0h8ki",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604446711.0
    },
    {
        "author": "rluo92",
        "body": "Don't get me wrong, more power to any of you who made money off of NIO or BABA or any other Chinese companies, but if any of yall retards are still surprised that this is happening, you deserve to lose money if you did. This is why, as appealing as any Chinese companies seems, I personally don't touch them since the government can literally fuck you in the ass anytime.\n\nThis shit happened cause Ma said some non PC stuff regarding the country, if you piss off the govt in anyway, you will burn for it, any of the big companies in china needs approval from the govt to be successful in any major form, and they can take that opportunity from you just as quickly as when they first gave it to you.\n\nGood luck guys.",
        "created_utc": 1604425849,
        "id": "gb0xxll",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604454649.0
    },
    {
        "author": "txrazorhog",
        "body": "That was his other cousin Lo Ma, using Albert's handle.  He's dyslexic.",
        "created_utc": 1604421545,
        "id": "gb0orwc",
        "score": 3,
        "subreddit": "investing",
        "created": 1604450345.0
    },
    {
        "author": "cafenegroporfa",
        "body": "jack ma was just blitzed on scorpion liquor",
        "created_utc": 1604469841,
        "id": "gb38l7v",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604498641.0
    },
    {
        "author": "Dmoan",
        "body": "Not about power but about greed they likely want Jack ma to throw all commie party member couple billion. How do you think so many communist party officials have condos in NY, Toronto and London",
        "created_utc": 1604440977,
        "id": "gb1tstk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604469777.0
    },
    {
        "author": "throwaway__3012",
        "body": "The issue is the Chinese govt is retaliating against jack ma after he criticized the govt. I think they might shut down the ipo for longer or not let it go through",
        "created_utc": 1604425376,
        "id": "gb0wwzl",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604454176.0
    },
    {
        "author": "yeahman64",
        "body": "Grapefruit and MasterCard calls for December.",
        "created_utc": 1604354737,
        "id": "gaxx82g",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604383537.0
    },
    {
        "author": "ImmigrantInvester",
        "body": "But he is an idiot though. Checkout his interview with Elon Musk. It hurts so much to watch Ma being an idiot. He however has good connection with CCPA and uses slave labor for his Alibaba. He even stole the name from the people who he enslaves with the help of CCPA.",
        "created_utc": 1604428866,
        "id": "gb14bix",
        "score": 3,
        "subreddit": "investing",
        "created": 1604457666.0
    },
    {
        "author": "ForgotUsername98767",
        "body": "Real key issue:\n\n-Jack Ma criticized the gouvernment and system too hard for once and CCP decided to send a warning\n\nChinese companies work because the CCP allows it. They can randomly pump 10% and lose 10% according to the whims of the communist party. Nobody here should forget that.",
        "created_utc": 1604427111,
        "id": "gb10mg6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604455911.0
    },
    {
        "author": "miaomiaomiao",
        "body": "Chinese government needs the innovation that Jack Ma's companies have provided, and Jack Ma needs a non-hostile Chinese gov that allows him to expand his businesses. I'm sure they will figure it out together because it will advantage them both.",
        "created_utc": 1604427971,
        "id": "gb12g1g",
        "score": 3,
        "subreddit": "investing",
        "created": 1604456771.0
    },
    {
        "author": "send_the_gnar",
        "body": "MA checking in happy to vote for ranked choice in future elections. fingers crossed here",
        "created_utc": 1604437741,
        "id": "gb1n1q0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604466541.0
    },
    {
        "author": "RationallyXuberant",
        "body": "#WELP\n\nhttps://www.bloomberg.com/news/articles/2020-11-04/china-is-planning-a-bigger-ant-crackdown-with-bank-funding-curbs-kh2wr8pb\n\n&gt; The shock suspension of Ant Group Co.’s $35 billion initial public offering is just the beginning of a renewed campaign by China to rein in the fintech empire controlled by Jack Ma, Bloomberg reports.\n\n&gt; Authorities are now setting their sights on Ant’s biggest source of revenue: its credit platforms that funnel loans from banks and other financial institutions to millions of consumers across China, according to people familiar with the matter.",
        "created_utc": 1604465062,
        "id": "gb31asv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604493862.0
    },
    {
        "author": "Shorter_McGavin",
        "body": "Nope.  Source: My wife is a teacher in MA",
        "created_utc": 1604356307,
        "id": "gay0bu1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604385107.0
    },
    {
        "author": "longGERN",
        "body": "Wanna play mastercard dip, maybe march 320 or Jan 310",
        "created_utc": 1604271994,
        "id": "gauahon",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604300794.0
    },
    {
        "author": "dr_vegapunk",
        "body": "I think this is Xi just making sure Ma knows who's the boss.",
        "created_utc": 1604380890,
        "id": "gaz7czh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604409690.0
    },
    {
        "author": "throwaway__3012",
        "body": "I might buy in but this might be China trying to fuck ma",
        "created_utc": 1604420943,
        "id": "gb0nhr6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604449743.0
    },
    {
        "author": "cocococopuffs",
        "body": "If anyone’s wondering why BABA ANT financial is being suspended in China it’s because lately Jack Ma been talking a lot of shit about China’s banking system and bad mouthing the government and calling their system fraud. Alipay has also been offering services he government has deemed illegal. \n\nThis shit ain’t going through",
        "created_utc": 1604421479,
        "id": "gb0omve",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604450279.0
    },
    {
        "author": "Pablo_Sumo",
        "body": "I saw that one.  I think Ma was smoking something on that day.\nI saw lots of ma's talks and interviews he never talked like that before.",
        "created_utc": 1604441248,
        "id": "gb1ucf7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604470048.0
    },
    {
        "author": "ZillionMidi",
        "body": "I love when people make this argument because it has absolutely zero logic at all. If anything the electoral college creates herd mentality because of the winner take all aspect to it and it lowers voter turnout. Republican votes in MA, NY, and CA don’t matter. If we switched to a popular vote then republicans in California would have their vote matter.",
        "created_utc": 1604478833,
        "id": "gb3jzs4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604507633.0
    },
    {
        "author": "canadianformalwear",
        "body": "Did a google search, Jack Ma isn’t in a gulag somewhere so, all in BABA calls.",
        "created_utc": 1604418904,
        "id": "gb0j7v7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604447704.0
    },
    {
        "author": "BenjaminGunn",
        "body": "Fuck you Jack Ma get in there and suck some commie dick like my calls depend on it!!!",
        "created_utc": 1604444928,
        "id": "gb21kjf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604473728.0
    },
    {
        "author": "PajeetScammer",
        "body": "Have you ever seen the Elon + Jack Ma interview? Not sure if it was a language barrier thing but Ma seemed genuinely retarded. \n\nAll success in China is based on nepotism and scamming",
        "created_utc": 1604434798,
        "id": "gb1gqoh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604463598.0
    },
    {
        "author": "usingthisonthetoilet",
        "body": "Bigger than PayPal though, it’s like a MasterCard and Financial services company had a baby",
        "created_utc": 1604426537,
        "id": "gb0zety",
        "score": 2,
        "subreddit": "investing",
        "created": 1604455337.0
    },
    {
        "author": "lifesaboxofchoco",
        "body": "Yeah I really think it's a good value to buy now but then I don't know if there's still other \"punishment\" awaiting since Jack Ma criticised them so bluntly last week. It' s a solid company though aside from the politic factors",
        "created_utc": 1604429578,
        "id": "gb15t4u",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604458378.0
    },
    {
        "author": "lifesaboxofchoco",
        "body": "It's utterly ridiculous how this has been planned and approved for months, the IPO subscription is completed with many retail and institutional investor subscribed with margin borrowing, and then China just suddenly decide to change the regulation and pull the plug 2 days before the IPO.\n\nWhat a coincidence that this sudden decision was made a week after Jack Ma gave a long blunt criticism about China's current financial system and regulations in a financial forum in Shanghai, in front of hundreds of bankers and regulators. You really don't want to piss the Chinese authority man.",
        "created_utc": 1604429203,
        "id": "gb150si",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604458003.0
    },
    {
        "author": "raiderkev",
        "body": "Jack Ma shitted on Gyna. Now he has to go to reeducation camp and ANT IPO cancelled",
        "created_utc": 1604431360,
        "id": "gb19i4y",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604460160.0
    },
    {
        "author": "whatshisuserface",
        "body": "how do you translate “fell out of a window” from russian to chinese? because jack ma might fall out of a window soon",
        "created_utc": 1604431967,
        "id": "gb1arwr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604460767.0
    },
    {
        "author": "kg9936",
        "body": "Checking in from Eastern MA. Also found out on WSB",
        "created_utc": 1604366066,
        "id": "gayien4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604394866.0
    },
    {
        "author": "shehatezme1",
        "body": "CCP fucking BABA over Jack Ma comments on China monetary policies is all you need to know about power",
        "created_utc": 1604419194,
        "id": "gb0jtfq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604447994.0
    },
    {
        "author": "Zonked420",
        "body": "Jack Ma ANT gang in shambles",
        "created_utc": 1604421301,
        "id": "gb0o96a",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604450101.0
    },
    {
        "author": "Cj96734",
        "body": "jack ma opened his fat mouth and criticized gyna. now ant ipo on hold, or off the table",
        "created_utc": 1604426861,
        "id": "gb103gb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604455661.0
    },
    {
        "author": "nightfucker",
        "body": "What did Ma say?",
        "created_utc": 1604415963,
        "id": "gb0ddp3",
        "score": 2,
        "subreddit": "investing",
        "created": 1604444763.0
    },
    {
        "author": "jimmbean",
        "body": "MA and MI both implementing stronger virus measures/curfews. Yup this thing is gonna tank when all the other blue states follow after Tuesday.",
        "created_utc": 1604346697,
        "id": "gaxgm4j",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604375497.0
    },
    {
        "author": "ChrisBattles",
        "body": "How is it misinformation? I'm guessing the title included the reference to Canoo to describe the relevance to this sub. And, it's good info.\n\nSame for the past info that Jack Ma had sought out Canoo.\n\nNot all info is an attempt to manipulate stock prices. Get a grip.",
        "created_utc": 1604366973,
        "id": "gayk15s",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1604395773.0
    },
    {
        "author": "-Mr_Unknown-",
        "body": "No honey... because Ma is desperately pushing Ant as a Tech company and CCP just told him “lol, no. You are a financial institution and will be regulated accordingly, by the way, you don’t meet half the requirements as such.”",
        "created_utc": 1604437182,
        "id": "gb1lwei",
        "score": 2,
        "subreddit": "investing",
        "created": 1604465982.0
    },
    {
        "author": "wdcvvv",
        "body": "Not as high as Jack Ma",
        "created_utc": 1604469800,
        "id": "gb38j4u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604498600.0
    },
    {
        "author": "Jarlaxle_rigged_it",
        "body": "its still below its 100day ma.. wouldnt go near it until its back above \\~3300.",
        "created_utc": 1604351764,
        "id": "gaxr7e2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604380564.0
    },
    {
        "author": "shagagav",
        "body": "Jack ma don’t fuck me tm bb!!",
        "created_utc": 1604458426,
        "id": "gb2pp7x",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604487226.0
    },
    {
        "author": "meetmyphantoms",
        "body": "Jack Ma curse strikes again",
        "created_utc": 1604454869,
        "id": "gb2je3r",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604483669.0
    },
    {
        "author": "mcramalot",
        "body": "Fuck jack ma and his stupid mouth",
        "created_utc": 1604414447,
        "id": "gb0aj5f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604443247.0
    },
    {
        "author": "bad_ass_blunts",
        "body": "They criticize privately, or publicly with under the table permission.\n\nMa does have an interesting history of working abroad but seems more likely a tool than an insurrectionary.",
        "created_utc": 1604422749,
        "id": "gb0rc5k",
        "score": 2,
        "subreddit": "investing",
        "created": 1604451549.0
    },
    {
        "author": "Buildsoc",
        "body": "This guy whining about what others are doing has to be the biggest snowflake move ever on a stock message board 😂Wah,...other people are being too politically correct Wah😂 ma feels",
        "created_utc": 1604268996,
        "id": "gau4qsd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604297796.0
    },
    {
        "author": "Technoho",
        "body": "Nah Jack Ma just publicly chatted shite about Chinese state banks and they can't have their top business magnate doing that sorta stuff",
        "created_utc": 1604435291,
        "id": "gb1hsuq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604464091.0
    },
    {
        "author": "Myther6",
        "body": "Spot just chilling below that 30 day MA. Cmon baby lets go down",
        "created_utc": 1604331663,
        "id": "gawkthy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604360463.0
    },
    {
        "author": "LlamaPajamasBanana",
        "body": "TSLA weekly FD’s. Amirite\n\nShits trading at 69 day ma. Fuckin no brainer boys.",
        "created_utc": 1604366528,
        "id": "gayj8c3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604395328.0
    },
    {
        "author": "Game__0n",
        "body": "[Callaway to Merge with TopGolf](https://www.reuters.com/article/topgolf-ma-callaway-golf-idUKL4N2HI4PH)",
        "created_utc": 1604367572,
        "id": "gayl3qs",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1604396372.0
    },
    {
        "author": "longGERN",
        "body": "MA $320c gang?",
        "created_utc": 1604331157,
        "id": "gawjsmz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604359957.0
    },
    {
        "author": "EmptyLevel",
        "body": "i’m a retard but v and ma been giving me boomer vibes lately",
        "created_utc": 1604398126,
        "id": "gazpgy8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604426926.0
    },
    {
        "author": "TimCooksButtBuddy",
        "body": "Why cant i deposit $ into my Draftkings in MA for DFS?  I just downloaded this shit since i bought 500 shares last week. I know the sportsbook is off limits but i should be able to deposit for dfs",
        "created_utc": 1604241765,
        "id": "gasnuej",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604270565.0
    },
    {
        "author": "New_Great",
        "body": "More than 50% of the companies currently listed will likely go to zero in your lifetime. Saying Amazon can't fail likely means there are other investors that share your same attitude, not only is that incorrect but it is priced in. You can draw the same conclusion throughout history with companies like exxon, general electric, ma bell, how could they lose and they did.\n\nAlso, Amazon is great i own a lot. I did make a weighted bet and I do agree no more than 10% per company.",
        "created_utc": 1604415937,
        "id": "gb0dbuw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604444737.0
    },
    {
        "author": "abcomputer",
        "body": "Jack Ma criticized China's stock exchange. Shit might just go down hard.",
        "created_utc": 1604414936,
        "id": "gb0bfo2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604443736.0
    },
    {
        "author": "Boomtown626",
        "body": "Ant Group statement on CNBC: Apologies to investors for inconvenience, will wait for regulators' further notice for future developments. \n\nBest case scenario imo: Jack Ma has been humbled and embarrassed. Chinese government makes its point, eventually this comes back around. When that happens, we see the green twin to today's red candle.",
        "created_utc": 1604414675,
        "id": "gb0ay5o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604443475.0
    },
    {
        "author": "djrocks420",
        "body": "Is Ma part of everything in china?...",
        "created_utc": 1604417713,
        "id": "gb0guda",
        "score": 1,
        "subreddit": "investing",
        "created": 1604446513.0
    },
    {
        "author": "datacanbeuseful",
        "body": "Ma got carried away. He could be the next top 10 richest Chinese behind bars.",
        "created_utc": 1604418146,
        "id": "gb0hpno",
        "score": 1,
        "subreddit": "investing",
        "created": 1604446946.0
    },
    {
        "author": "longGERN",
        "body": "Is MA Jan 320c a hold",
        "created_utc": 1604418771,
        "id": "gb0iy72",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604447571.0
    },
    {
        "author": "3250feralhogs",
        "body": "What is with these dudes like Ma and the Twitter guy running two companies? Is the job of CEO that un-taxing that you can run two major corporations at once?",
        "created_utc": 1604419462,
        "id": "gb0kdkm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604448262.0
    },
    {
        "author": "EmbiidWeTrust",
        "body": "Fuck China man. Ma you can come to TrumpMerica and make some money",
        "created_utc": 1604419873,
        "id": "gb0l8l1",
        "score": 1,
        "subreddit": "investing",
        "created": 1604448673.0
    },
    {
        "author": "Au_contraire_zippy",
        "body": "wtf are you talking about? I was asking about the 52 week Moving Average (MA) setting he is using, genius. \n\nget back in your cage.",
        "created_utc": 1604410221,
        "id": "gb039n6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604439021.0
    },
    {
        "author": "wilstreak",
        "body": "It has been suspended.\n\nhttps://www.bloomberg.com/news/articles/2020-11-03/jack-ma-s-ant-group-ipo-suspended-by-shanghai-star-board",
        "created_utc": 1604410336,
        "id": "gb03g5u",
        "score": 1,
        "subreddit": "investing",
        "created": 1604439136.0
    },
    {
        "author": "KiloGrah4m",
        "body": "No dude. \n\nBiggest IPO in the world, China trying to build their stock market, need to look like it's regulated and they care.\n\nThey are going to have Jack Ma on TV just like those americans have the Zucker and Hobo Jack on TV.",
        "created_utc": 1604410189,
        "id": "gb037vv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604438989.0
    },
    {
        "author": "ace425",
        "body": "Knowing the Chinese, they'll find a way to seize the company and have him replaced with someone willing to toe the party line instead of outright destroying the company. If they outright fucked over one of the single largest Chinese companies in existence it would destroy international trust and investment in Chinese firms for a long time to come. They aren't that stupid. They'll find a way to make Ma bend to their will, or they'll hand the company over to someone else. Then the IPO will move forward.",
        "created_utc": 1604425724,
        "id": "gb0xnxy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604454524.0
    },
    {
        "author": "Cj96734",
        "body": "yeah, that was dumb of ma to pop off like that, but still think the ipo goes thru",
        "created_utc": 1604425591,
        "id": "gb0xdrx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604454391.0
    },
    {
        "author": "mollyhollygolly",
        "body": "Not unless Jack Ma wants to get invited back for “tea”",
        "created_utc": 1604411354,
        "id": "gb052yj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604440154.0
    },
    {
        "author": "shagagav",
        "body": "Jack ma throw some lube on plz",
        "created_utc": 1604427173,
        "id": "gb10r6b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604455973.0
    },
    {
        "author": "dbergkamp10",
        "body": "Jack Ma didn’t kiss the ring and called the banks pawnshops. This looks awful for China and HK for foreign investors who they want to IPO versus NYSE. Expect him to publicly apologize. Goes live next Tuesday. Too many investors with too much tied up capital.",
        "created_utc": 1604430500,
        "id": "gb17pkz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604459300.0
    },
    {
        "author": "-xMrMx-",
        "body": "Ma is one of the dumbest people I have ever heard speak. Puts on Gina",
        "created_utc": 1604461300,
        "id": "gb2uwcs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604490100.0
    },
    {
        "author": "firstonesnotfree",
        "body": "It’s not about the language, but the conversation surrounding AI and other technological improvements. That conversation was laughable.\n\nAgreed that Jack Ma is a very smart person, when it relates to business. Of course, AliBaba isn’t a “new” idea. It’s just Amazon copy pasted in China.",
        "created_utc": 1604458185,
        "id": "gb2p9pc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604486985.0
    },
    {
        "author": "voodoodudu",
        "body": "I heard Ma said something to piss off the govt. Anyone know what he said?",
        "created_utc": 1604457171,
        "id": "gb2ngiw",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1604485971.0
    },
    {
        "author": "deah12",
        "body": "Ma pissed off the CCP seriously",
        "created_utc": 1604486203,
        "id": "gb3rd58",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604515003.0
    },
    {
        "author": "HotStockSlinger",
        "body": "Will BABA go up or down if Jack Ma disappears suddenly?",
        "created_utc": 1604432960,
        "id": "gb1cv0c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604461760.0
    },
    {
        "author": "miaomiaomiao",
        "body": "Why does this affect BABA?\n\n - Alibaba purchased a 33% stake in Ant Group in 2018\n - Alibaba uses Alipay\n - Jack Ma is founder of both companies\n\nOnly the first one should affect the value of BABA stock, right?",
        "created_utc": 1604413305,
        "id": "gb08g6e",
        "score": 1,
        "subreddit": "investing",
        "created": 1604442105.0
    },
    {
        "author": "ntipMIRV",
        "body": "Look at that clear breakout, this bitch does not want to visit 20d ma.",
        "created_utc": 1604220730,
        "id": "garxf8s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604249530.0
    },
    {
        "author": "Sablac",
        "body": "Didnt MA report earnings last wednesday?",
        "created_utc": 1604232582,
        "id": "gasazog",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604261382.0
    },
    {
        "author": "darkrood",
        "body": "My dad withdrawal my foreign saving that i've saved up since I was little.\n\nHe also got the nerve going around telling everyone that \"I want ma son to grow and not rely on inheritance.\"\n\nFuck you pop, you didn't even pay for my elementary school.",
        "created_utc": 1604222293,
        "id": "garzdni",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604251093.0
    },
    {
        "author": "tirth__p",
        "body": "lol all MA just went green",
        "created_utc": 1604284910,
        "id": "gauxz3o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604313710.0
    },
    {
        "author": "fredczar",
        "body": "Why do we always assume that there’s some form of conspiracy going on with anything China does. If anything, China is a huge supporter of Ma. Pretty sure the IPO will go through in the future.",
        "created_utc": 1604443559,
        "id": "gb1yx29",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604472359.0
    },
    {
        "author": "westtownie",
        "body": "next year.  Chinese banks are butt hurt because Ant only has 2% of its loans on its balance sheet when traditional banks have to carry 30% and apparently Jack Ma pissed off  some people in the party and now Ant is being investigated",
        "created_utc": 1604435593,
        "id": "gb1ig6f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604464393.0
    },
    {
        "author": "DrDonkeyBrains",
        "body": "just gave my girlfriend a RH referral code and she got a god damn MSFT stock, didn't think that was possible",
        "created_utc": 1604430377,
        "id": "gb17gid",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1604459177.0
    },
    {
        "author": "JW4974",
        "body": "GOOG 12/3 1550P 1590P\n\nMSFT 12/19 160P 180P\n\nSPY 11/21 320P\n\nDown $73,595\n\n🌈🐻",
        "created_utc": 1604421816,
        "id": "gb0pcj5",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1604450616.0
    },
    {
        "author": "Houston_swimmer",
        "body": "I’ve only heard that 400 times lol. Not an msft fan but I respect the play",
        "created_utc": 1604345753,
        "id": "gaxemxw",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1604374553.0
    },
    {
        "author": "Okmanl",
        "body": "Most fund managers don’t beat the market. Because they’re not trying to. Many fund managers and professional investors also have regulations they have to follow. They can’t make concentrated investments. They have to show quarterly results and so forth. For example Cathy Wood said she would’ve put a lot more into Tesla but because of rules and regulations the max she can invest is ~10% per fund she manages. \n\n\nIndividual investors can definitely beat the market by having a concentrated portfolio. Knowing the stock that they own intimately and not letting emotions get involved. \n\nThere are quite a few people who have a concentrated portfolio on 3-4 companies like Square, peloton, Tesla, Amazon, Microsoft, AMD and so forth. And they have all outperformed the market over 5-10 years. \n\nIf you have a high risk tolerance then buying single stocks can be worth it.",
        "created_utc": 1604268188,
        "id": "gau36se",
        "score": 10,
        "subreddit": "investing",
        "created": 1604296988.0
    },
    {
        "author": "WrongWeekToQuit",
        "body": "I still see the comparisons...\n\nYou had outright fraud from Enron, Worldcom, etc... not unlike Lickin, Wirecard, Nikola.\n\nYou had companies with high valuations that confounded the people who tried to value them like Amazon.  The same things being said of Tesla were said about Amazon back then.\n\nYou had tech darlings like Microsoft, Cisco, Oracle, Intel, etc... that ran up huge amounts, making employees into millionaires.\n\nYou had highly anticipated IPOs of companies, some very immature like pets.com, but some big like doubleclick, etc... If you look at Big Commerce's or Lemonade's financials, they aren't great.  And some of the SPAC mergers are pretty suspect especially when compared to how much they run up around merger time.  \n\nI agree that there was more vaporware back in the late 90s, BUT, the fervor, the blind investing into companies without knowing anything about their financials, the double or triple digit gains within a single year.... remind you of any recent times?",
        "created_utc": 1604369137,
        "id": "gaynxua",
        "score": 9,
        "subreddit": "investing",
        "created": 1604397937.0
    },
    {
        "author": "JW4974",
        "body": "🌈🐻 Reporting - SPY 330 breached, MSFT tanked\n\nElite Team 6 going in.\n\nLuv, 🌈🐻 maintenance team",
        "created_utc": 1604333977,
        "id": "gawpkqg",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1604362777.0
    },
    {
        "author": "www123x",
        "body": "Officially Microsoft Excel certified baby😎😎😎fucking sexy",
        "created_utc": 1604378479,
        "id": "gaz40v1",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1604407279.0
    },
    {
        "author": "IronManKillsThanos",
        "body": "&gt;\"As stocks rocketed today; Facebook, Amazon, Apple and Microsoft all closed lower.\"\n\nLmao and that's how you know which stocks r/wallstreetbets is holding.",
        "created_utc": 1604379275,
        "id": "gaz5643",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1604408075.0
    },
    {
        "author": "troylus81",
        "body": "Holding puts til after the election. Then going all in on microsoft leaps. Microsoft under 200 is a money maker buying leaps and letting it ride all of 2021.",
        "created_utc": 1604274755,
        "id": "gaufril",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1604303555.0
    },
    {
        "author": "fawkesmulder",
        "body": "You guys freaking out about big tech need to grow some balls and hold or add. Also I know this isn’t the wsb way but shares are a practical guarantee to be a big winner on these, no matter the choppiness of things like elections.\n\nI like to think - in 20 years will this company still be dominant? \n\nI feel like humanity will end if google dies. Similar with Amazon.\n\nThose are my big two but also feel super safe with apple, Microsoft, Facebook, visa as long term positions.\n\nLong term thesis is tech is the way with growth of AI and efficient solutions. Especially if we ever get to AGI which I think we will in our lifetimes.",
        "created_utc": 1604357647,
        "id": "gay2xqe",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1604386447.0
    },
    {
        "author": "Cybertruckwraps",
        "body": "When is msft going to buy Nokia again?",
        "created_utc": 1604339170,
        "id": "gax0mqh",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1604367970.0
    },
    {
        "author": "swolking",
        "body": "MSFT $200 is the stonewall upon which the bull market rests. Many a bear has fallen before it.",
        "created_utc": 1604344064,
        "id": "gaxb36i",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1604372864.0
    },
    {
        "author": "spald01",
        "body": "Yep, just like all of those things have sent MSFT, AAPL, and GOOG into the tank...oh wait.",
        "created_utc": 1604358026,
        "id": "gay3o18",
        "score": 6,
        "subreddit": "stocks",
        "created": 1604386826.0
    },
    {
        "author": "Carsrcool12345",
        "body": "I'I keep mostly all of them but Zoom. It's beyond me how that stock is at what its at and how much it has increased since Covid especially when Microsoft has a product that directly competes with Zoom that is the same level of quality if not better. I only see that stock going down.",
        "created_utc": 1604285926,
        "id": "gauzq5h",
        "score": 6,
        "subreddit": "stocks",
        "created": 1604314726.0
    },
    {
        "author": "marcus_aurelius_wsb",
        "body": "I think puts before tech earnings is the way to go. Out of AAPL, MSFT, GOOGL, TWTR, AMZN, PYPL only GOOG was up, rest all drilled to the core.",
        "created_utc": 1604352692,
        "id": "gaxt31i",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604381492.0
    },
    {
        "author": "mare1999",
        "body": "MSFT 300 EOW",
        "created_utc": 1604425579,
        "id": "gb0xcsd",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604454379.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "MSFT STILL hates 200. Good.",
        "created_utc": 1604341808,
        "id": "gax6b3b",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604370608.0
    },
    {
        "author": "Zephyr101",
        "body": "superfuk positions \n\n$35p SNAP 11/6\n\n$5c NOK 11/20\n\n$25c SPCE 12/18\n\n$130c AAPL 1/15/21\n\n$250c MSFT 12/18\n\n$40c NIO 12/18 (Saving grace)",
        "created_utc": 1604343211,
        "id": "gax9b5t",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604372011.0
    },
    {
        "author": "-Jocko-",
        "body": "microsoft",
        "created_utc": 1604251184,
        "id": "gat4j9k",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604279984.0
    },
    {
        "author": "adayofjoy",
        "body": "Agreed with you on the IPO fervor as well as fraud cases like Nikola, but the big established tech companies like Microsoft, Facebook, Google etc. that are trading at a 30 pe ratio aren't anywhere near dot com bubble valuations.\n\nAt worst their stock prices might get knocked down ~20% before these big tech growth companies with amazing balance sheets and a bright future end up having a similar PE ratio to many older value companies.",
        "created_utc": 1604369972,
        "id": "gaypgiy",
        "score": 5,
        "subreddit": "investing",
        "created": 1604398772.0
    },
    {
        "author": "Churner_throwaway-",
        "body": "just means MSFT and AMZN are cheap",
        "created_utc": 1604336748,
        "id": "gawvh4d",
        "score": 5,
        "subreddit": "stocks",
        "created": 1604365548.0
    },
    {
        "author": "addictedtothetendies",
        "body": "My MSFT and QQQ 2022 leaps went from 100% to -5% in 2 weeks. I ain’t selling",
        "created_utc": 1604343786,
        "id": "gaxaih3",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604372586.0
    },
    {
        "author": "NeurotypicalPanda",
        "body": "Fuck microsoft \nFuck paypal",
        "created_utc": 1604357658,
        "id": "gay2yj1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604386458.0
    },
    {
        "author": "obi1013",
        "body": "msft at 200 is free money",
        "created_utc": 1604353902,
        "id": "gaxvja1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604382702.0
    },
    {
        "author": "braamdepace",
        "body": "Agreed, but one thing I will add is this... when the market drops big often times it’s hard to look at your account it’s frustrating and you almost want to ignore it, or forget about it like a bad grade, relationship, bill or anything else that causes anxiety...  but it’s at this time you need to calm your emotions and spend more time researching and critically thinking about your account.\n\nAlso you will have big losses, and it’s hard to sell those even though there is much better places for your money.  One of the examples I will give you is from me personally this year.  I had 25% my account in BAC-K.  This is a preferred callable stock that trades around $25 and pays 7% dividend payment.  When the market crashed this “crashed” too.  It dropped to $20 (a 20% drop) and I was pissed cause it shouldn’t have moved that much cause I knew BAC was capable of making the dividend payment and they had to pay me before their common shareholders.  As much as I didn’t want to sell this stock knowing it would recover back to $25 pretty easily I had to force myself to realize that there were other stocks out there that lost much more and long term were better spots for my money.  Companies like MSFT, AAPL, and other amazing companies dropped 35-50%... this was an opportunity I wouldn’t get again and as hard as it was I had to realize I had time and some risk tolerance to take advantage of this opportunity.  So I knew selling a stock that had no business being down 20% at a loss and repositioning would be more beneficial long term.\n\nTLDR when shit hits the fan it’s natural to pull out or ignore your account, but you have to fight that urge.  It’s at that time you double down on research and evaluating your financial situation.",
        "created_utc": 1604368955,
        "id": "gaynm14",
        "score": 5,
        "subreddit": "investing",
        "created": 1604397755.0
    },
    {
        "author": "ShaidarHaran2",
        "body": "I'm very long on TSMC, but I would assume this is both priced in and a relatively small thing compared to iPhones and AMD (which = consoles). As long as they keep Apple, AMD, Microsoft, Sony, and a few smaller phone vendors happy.\n\nApple in particular is fill",
        "created_utc": 1604344195,
        "id": "gaxbd1p",
        "score": 4,
        "subreddit": "stocks",
        "created": 1604372995.0
    },
    {
        "author": "t33po",
        "body": "What's protecting NET from the encroaching MSFT, GOOG, AMZN cloud and C.D.N. services? It just seems like FSLY, NET type companies are just proving concepts for network services for the monsters to copy and better intergrate into their own platforms. Am I crazy here?",
        "created_utc": 1604267858,
        "id": "gau2j8e",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604296658.0
    },
    {
        "author": "throwaway__3012",
        "body": "Microsoft getting awfully close to 200 support and spy is getting close to 290",
        "created_utc": 1604339282,
        "id": "gax0vfc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604368082.0
    },
    {
        "author": "NewResearcher2030",
        "body": "Solar companies like CSIQ and FSLR or even buy ICLN. Also MSFT and BABA as your time horizon is 6 years. Hold on amazon why would you care if you not day or swing trading.",
        "created_utc": 1604334907,
        "id": "gawrjfr",
        "score": 3,
        "subreddit": "stocks",
        "created": 1604363707.0
    },
    {
        "author": "eatalaskansalmon",
        "body": "Msft bottom 200 , calls easy money",
        "created_utc": 1604350901,
        "id": "gaxpfdo",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604379701.0
    },
    {
        "author": "t777m",
        "body": "I’m 18, a student, getting money by saving parts of my student loan. My objectives are to simply get an understanding of investment and then work towards targets (a quick way of getting money would be nice but i understand that in my position its not faesible). As I’m starting off with a weak source of money i’d prefer a safer strategy, for now. I managed to get hold of 0.02 ETH and a share of SDC.\n\nI have recently picked up an interest in investing and am thinking about starting in the coming days, on trading 212. Ive selected the FAANG companies, Microsoft, Tesla, Shopify, Salesforce, Nvidia, Adobe and Vanguard emerging markets etf. I’m not sure about the percentages.\n\nis this a good pie and what percentages should i use?",
        "created_utc": 1604276240,
        "id": "gauijhz",
        "score": 3,
        "subreddit": "investing",
        "created": 1604305040.0
    },
    {
        "author": "FearlessTrader",
        "body": "Okay guys, realistic question, at what levels would you be comfortable buying leaps for the following stocks:\n\n1. FB\n2. SQ\n3. AMZN\n4. MSFT\n5. TSLA\n6. AAPL",
        "created_utc": 1604277014,
        "id": "gaujyjs",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604305814.0
    },
    {
        "author": "Bolkonsky999",
        "body": "i am all in on spt and ccl puts, and only thing worrying me about my positions is tech. amazon is already at 3000, msft at 200, i don't think they'll go much lower than that. Now, I am hoping tech won't move much on monday while everything else tanks, so spy goes down. i should be buying dia puts instead haha",
        "created_utc": 1604252963,
        "id": "gat7wpg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604281763.0
    },
    {
        "author": "professorsquat",
        "body": "I sold 13k worth of NIO on Friday so I could buy MSFT leaps. AMA",
        "created_utc": 1604329064,
        "id": "gawfq76",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604357864.0
    },
    {
        "author": "STERLING_ARCHER_AMA",
        "body": "I need MSFT to go up 1 more dollar to break even on the retarded trade from last week. Break even = big time win in my book",
        "created_utc": 1604419067,
        "id": "gb0jk0m",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604447867.0
    },
    {
        "author": "Matrix1216",
        "body": "Msft 275/310 Jan 2022 call leap spread",
        "created_utc": 1604421991,
        "id": "gb0pq69",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604450791.0
    },
    {
        "author": "Zephyr101",
        "body": "Fuck Microsoft fuck Apple",
        "created_utc": 1604331520,
        "id": "gawkiu9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604360320.0
    },
    {
        "author": "Itsme_eljefe",
        "body": "ARKK\nARKQ\nARKF\nSPY\nAMD\nTSLA\nQQQ\nTQQQ\nSNAP\nCHWY\nAMZN\nMSFT\nTSM\nASML\nSOXL",
        "created_utc": 1604265001,
        "id": "gatwunf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604293801.0
    },
    {
        "author": "bshaman1993",
        "body": "Will MSFT ever relieve itself off the $200 curse",
        "created_utc": 1604343766,
        "id": "gaxah1d",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604372566.0
    },
    {
        "author": "Cwc123",
        "body": "msft",
        "created_utc": 1604251181,
        "id": "gat4j28",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604279981.0
    },
    {
        "author": "TheQsandCuesrules",
        "body": "You’re absolutely correct man, I’m just scared I’ll make the wrong choice or baghold a stock for a while where as with an etf the upside is way less but downside is minimal compared to a TSLA NVDA AMD (tech or growth stocks - even MSFT AAPL with their dividends still fluctuate). \n\nYour stock picks outperform the market or your main goal is let me just choose sound companies with dividend growth?",
        "created_utc": 1604287406,
        "id": "gav27jh",
        "score": 3,
        "subreddit": "stocks",
        "created": 1604316206.0
    },
    {
        "author": "pain474",
        "body": "WTF I am a bull but even I think this is ridculous. Bought 2 MSFT puts and already down 100$. It just keeps going",
        "created_utc": 1604415800,
        "id": "gb0d2j3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604444600.0
    },
    {
        "author": "SudsAde6985",
        "body": "Will MSFT close below 200? Hasn’t happened since 6/19 🤔",
        "created_utc": 1604350192,
        "id": "gaxnxbl",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604378992.0
    },
    {
        "author": "PepeSilviaFTW",
        "body": "Calls on MSFT. \n\nZM is Gyyna, so I expect American Terrorist cells to use Teams.",
        "created_utc": 1604373852,
        "id": "gaywdq9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604402652.0
    },
    {
        "author": "ApolloFirstBestCAG",
        "body": "Microsoft why you being this way BB why you so dead",
        "created_utc": 1604354279,
        "id": "gaxwawa",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604383079.0
    },
    {
        "author": "Subscribe-to",
        "body": "In hindsight it's easy to say she should've just invested in AAPL, MSFT or AMZN 20 years ago but she could've just as easily invested in GE.\n\n&amp;#x200B;\n\nThis also doesn't take into account taxes",
        "created_utc": 1604258171,
        "id": "gatilmz",
        "score": 2,
        "subreddit": "investing",
        "created": 1604286971.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "Fam if MSFT goes below 200 its over. Stonk is dead.",
        "created_utc": 1604336511,
        "id": "gawuyr3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604365311.0
    },
    {
        "author": "selladoordali",
        "body": "MSFT, AMZN, NASDAQ, and SPY all near very important levels",
        "created_utc": 1604344885,
        "id": "gaxcsv7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604373685.0
    },
    {
        "author": "Zephyr101",
        "body": "can we not lmao I’m cool with y’all killing my aapl positions not my Microsoft too 😭",
        "created_utc": 1604344945,
        "id": "gaxcxc9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604373745.0
    },
    {
        "author": "TheJpow",
        "body": "And not the xbox? I was recently told that xbox is better because msft keeps buying these games studios and therefore is will have the larger selection. \n\nDisclaimer: I game exclusively on pc so I am not part of the console wars",
        "created_utc": 1604356683,
        "id": "gay126d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604385483.0
    },
    {
        "author": "dpetropo",
        "body": "MSFT is yet to demonstrate they know how to develop/publish an original hit (in many many years at least). They couldn’t even figure Halo out for launch.",
        "created_utc": 1604356837,
        "id": "gay1d06",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604385637.0
    },
    {
        "author": "Okmanl",
        "body": "Yeah I think I agree with this one. The CEO is extremely forward looking. They benefit from the network effect. The more people who join the platform, the more valuable the product becomes. Microsoft has market share, but I don't think they will put Slack out of business per se. I am looking forward to how this company will do in the future.",
        "created_utc": 1604385439,
        "id": "gazd12p",
        "score": 2,
        "subreddit": "investing",
        "created": 1604414239.0
    },
    {
        "author": "SamFish3r",
        "body": "Boring advice , but MSFT, AAPL, VISA, Costco Walmart are some good buys they pay Decent enough dividends as well and have potential to keep growing as they are solid companies . There is uncertainty in the market COVID globally and COVID + Elections in the US . Don’t go all in. \n   I had 21 k to invest earlier this year.  the market was insanely high valuations and meanwhile as I enjoyed huge gains on my existing positions, I was afraid to buy at ATH prices...and than CoVID crash happened .\nSince than I split th3 total amount  up into 3 investment runs of 7 k each and over all its been up 18% and these are diversified mutual funds not individual stocks . So do your Research find companies that you feel Comfortable with and invest in Phases .. don’t feel like you are missing out as your are simply protecting your money . Remember it’s your money people love to brag\nAbout their gains no one mentions  how much they lost so be cautious and take calculatedRisks . Most folks who have been investing for the past 5-10 year have seen insane growth and there will be profit taking so keep that in mind as well.",
        "created_utc": 1604338438,
        "id": "gawz2c5",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604367238.0
    },
    {
        "author": "STERLING_ARCHER_AMA",
        "body": "Actual retarded question for you guys - I wrote a MSFT put at 207.50 for $300 premium. I ended up getting assigned the shares. I’m about break even for the shares now but did my portfolio keep the +300 in premium?\n\nI make so many autistic trades and my portfolio fluctuates so much that I literally have no idea since I never write / sell options and end up getting assigned.",
        "created_utc": 1604425287,
        "id": "gb0wq01",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604454087.0
    },
    {
        "author": "SudsAde6985",
        "body": "I’m no bull, but if MSFT closes below 200 any day before next earnings, I’d be surprised. Shorted it at 210 &amp; 225 this summer. Got to 196.25 for a moment, but still closed @ 202. Flirted with it lately, but now long 195 again on Friday. Most confident trade I made last week. Considering I’m getting slaughtered in my TUP short at the moment. Who’da thunk?",
        "created_utc": 1604252224,
        "id": "gat6inh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604281024.0
    },
    {
        "author": "AtWarWithAll",
        "body": "microsoft",
        "created_utc": 1604253153,
        "id": "gat89r3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604281953.0
    },
    {
        "author": "MoarTarriffs",
        "body": "I like picking riskier medium cap growth stocks such as NET, CRWD, ENPH, SQ, TDOC, TSLA. These have potential to grow more than stocks such as MSFT. But MSFT and AAPL are great additions to growth portfolios",
        "created_utc": 1604255995,
        "id": "gate1ib",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604284795.0
    },
    {
        "author": "Electrical_Spite_477",
        "body": "Costco, Amazon, Microsoft, apple... are all going to sell the exact amount of shit no matter who wins",
        "created_utc": 1604258677,
        "id": "gatjo7h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604287477.0
    },
    {
        "author": "spacedoutspacey",
        "body": "I was looking at investing in Coca-Cola, J&amp;J, NIO, Microsoft, Apple and Disney",
        "created_utc": 1604351379,
        "id": "gaxqet8",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604380179.0
    },
    {
        "author": "sola_rpi",
        "body": "microsoft :(",
        "created_utc": 1604352294,
        "id": "gaxs9zi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604381094.0
    },
    {
        "author": "swolking",
        "body": "Many a fallen soldier. \nAMZN\nTSLA\nMSFT\nFB\nPYPL\nAAPL\nATVI\nTDOC\nTEAM",
        "created_utc": 1604379882,
        "id": "gaz606v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604408682.0
    },
    {
        "author": "LavenderAutist",
        "body": "How does that work out when Microsoft falls 30%?",
        "created_utc": 1604297360,
        "id": "gavg0wv",
        "score": 2,
        "subreddit": "investing",
        "created": 1604326160.0
    },
    {
        "author": "jimmyrmatthews",
        "body": "it depends on brokerage. for instance, if i sell a CSP on MSFT at 207.50 strike for 3.00 premium, when I get assigned, it shows that I actually bought at 204.50 (it rolls the premium into cost basis). So, if your purchase price for MSFT shows your actual strike price of the put (207.50), then that $300 premium just went into your account (as cash proceeds) but not counted as a P&amp;L because it's not tied to the underlying performance.\n\nmake sense? basically, if you now sell MSFT at 204.50, you've broken even (if you include proceeds from the premium). what you *should* do is now sell a CC a couple strikes above where MSFT is.\n\ngood luck have fun",
        "created_utc": 1604426764,
        "id": "gb0zw4l",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604455564.0
    },
    {
        "author": "swolking",
        "body": "Please, proceed to explain to me how MSFT/FB/GOOG with 10-20% growth rates at 30x next year earnings, in a zero interest rate/growth starved environment is so insanely bubbly. Worlds changed a bit since 1970 Benjamin Graham.",
        "created_utc": 1604431902,
        "id": "gb1an0o",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604460702.0
    },
    {
        "author": "paragon_1235",
        "body": "Msft 200 gonna be back on the menu",
        "created_utc": 1604336593,
        "id": "gawv50c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604365393.0
    },
    {
        "author": "Boomtown626",
        "body": "Looks like FAANGs, MSFT, ZM, and the other biggest winners of the year are weighing on things right now. I think valuations are going to try to level back out. I think a lot of people are sitting on cash at this point. Curious where it's all going to come back in on Wednesday and Thursday.",
        "created_utc": 1604341274,
        "id": "gax55j9",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604370074.0
    },
    {
        "author": "slymerva",
        "body": "If MSFT breaks below 200 we enter the forsaken realm once again...",
        "created_utc": 1604344215,
        "id": "gaxbems",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604373015.0
    },
    {
        "author": "idanfl8",
        "body": "Bro Netflix doesn’t make money u know that? Creating content is incredibly difficult and doesn’t leave them a lot of room for profit. I think if u want to go long on one of the big ones Netflix and aapl are the weakest in that list. At least split ur investment to msft and fb or something which are also a household names and would be around for a long time. Good luck with ur investments I hope it works out for u whatever u decide.😎👍",
        "created_utc": 1604355965,
        "id": "gaxzng8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604384765.0
    },
    {
        "author": "PlanetExperience",
        "body": "You guys think it's too early to buy MSFT 1/15 2021 230C?",
        "created_utc": 1604333155,
        "id": "gawnvon",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604361955.0
    },
    {
        "author": "Boomtown626",
        "body": "Disagreed, I think they make more sense long-term, but reading your post just got me to go fractionally reduce exposure to MSFT, GOOGL, NFLX, and the chip-makers I have (AMD, NXPI, MRVL, SWKS, SOXX), because I want the cash available to buy the dip whenever this week's bloodbath happens, and I think reducing exposure there makes more sense in the short-term than reducing my holdings in the names that will be exposed to good vaccine news and good reopening news. \n\nRemember Moderna, Pfizer, and JNJ all have stage 3 vaccine trial results they plan to announce within the next month. If you wait until the news cycle starts reminding us, then you've already missed a bigger bounce than you can reasonably expect from this year's biggest tech winners over the next few weeks.",
        "created_utc": 1604347953,
        "id": "gaxj85f",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604376753.0
    },
    {
        "author": "rifle5k",
        "body": "MSFT $200/ AMAZON $3000 rest wouldn't buy.",
        "created_utc": 1604277120,
        "id": "gauk5su",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604305920.0
    },
    {
        "author": "KraheKaiser",
        "body": "I sold short term /NQ call spreads and bought 2023 leaps on MSFT, and a Jan $600 call on NVDA which is retarded.. need to sell more spreads to at least cover all this extrinsic value  but its too risky to do all at once.",
        "created_utc": 1604332345,
        "id": "gawm807",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604361145.0
    },
    {
        "author": "BakedForskin",
        "body": "That would be awesome. I have 50k I wanna buy and hold with but I was thinking amazon msft or apple.",
        "created_utc": 1604344163,
        "id": "gaxbalm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604372963.0
    },
    {
        "author": "throwaway__3012",
        "body": "If msft loses 200 drill team 6 is gonna come out",
        "created_utc": 1604344975,
        "id": "gaxczka",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604373775.0
    },
    {
        "author": "TendiesForTheBoys",
        "body": "Me too... I sold 1,200 shares of MSFT at $223.86 only to buy it back at $221.00 and watch it drop to $202 and probably more.... I will be holding LONG though",
        "created_utc": 1604280555,
        "id": "gauqa7d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604309355.0
    },
    {
        "author": "Kaffikup",
        "body": "Probably just better to use the cash collateral to buy beaten down stocks down. Msft at 200 is a buy in my opinion..",
        "created_utc": 1604381631,
        "id": "gaz8crg",
        "score": 2,
        "subreddit": "investing",
        "created": 1604410431.0
    },
    {
        "author": "ShaidarHaran2",
        "body": "Microsoft has one of the worst reliability records for laptops, unfortunately, for the one that should have been the \"this is how you do it right\" option. \n\n\nI wish laptop reliability surveys separated out high end and low end stuff, but my experience having seen hundreds if not thousands deployed has always been you get what you pay for, the difference is Apple and Microsoft just don't make the budget stuff, Microsoft had issues breaking into the hardware game anew, but if you take a comparably priced professional machine from Dell, Lenovo, etc compared to a Macbook Pro, they're also going to last, and are cheaper to repair.",
        "created_utc": 1604357892,
        "id": "gay3eml",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604386692.0
    },
    {
        "author": "Electrical_Spite_477",
        "body": "YeH, there's a point where they're too small to prevent being crushed like Slack is getting crushed by Microsoft. But if they can overcome the small cap stage and become entrenched, like Zoom, they become too big to be crushed.",
        "created_utc": 1604268551,
        "id": "gau3vgt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604297351.0
    },
    {
        "author": "AngelaQQ",
        "body": "Japan’s lost decades was a combination of fiscal mismanagement, overbearing debt load, and complete lack of technology growth, leading to stagnation.  \n\nAs a result, Japanese investors and savers pulled their money from the Nikkei and put it into US equities. Equities like Microsoft, Apple, Sun, Oracle saw a huge influx of Japanese capital as their markets stagnated.  \n\nEven today, none of Japan’s top 20 companies by market cap are internet or software/tech companies. \n\nThey’ve basically missed the boat on every single technological revolution of the past 30 years.\n\nI’m not as worried about the US, because the US (and China) are the world leaders in technological innovation in almost all major sectors.\n\nIf there IS for some reason a lost decade in the US, China will benefit, as they are the only country that can compete technologically, and their debt position vis a vis the rest of world is favorable.",
        "created_utc": 1604251434,
        "id": "gat50uk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604280234.0
    },
    {
        "author": "AmazingConcept3",
        "body": "Hello, I am looking for some advice on a potential portfolio allocation that I am considering. I am a new college graduate looking to begin investing. Before I list out the portfolio I am considering, please see my answers to the relevant information questions:\n\n&amp;#x200B;\n\n* How old are you? **23**\n* Are you employed/making income? How much? **Yes, $110k/year salary**\n* What are your objectives with this money? (buy a house? Retirement savings?) **Potentially looking to go to business school in 2-5 years, but definitely looking to buy a house (in probably 5-10 years). Not sure how much of the returns from the market I will use on this vs. taking out a loan. So otherwise, I am looking for retirement savings**\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?) **I've got a long time horizon so my tolerance is fairly high**\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?) **None**\n* Any other assets? House paid off? Cars? Expensive significant other? **$20k in cash, plus I am looking to invest at least half of my salary this year since I am living with my parents and have no expenses.**\n* What is your time horizon? Do you need this money next month? Next 20yrs? **I am prepared to hold onto my investments up until retirement, though I MIGHT want to take some money out to pay for business school/house**\n* Any big debts? **None**\n* Any other relevant financial information will be useful to give you a proper answer. **None**\n\nThe allocation I am considering is:\n\nS&amp;P 500 - 30%\n\nVWIGX (Vanguard International Growth ETF) - 15%\n\nVDADX (Vanguard Dividend Appreciation ETF) - 15%\n\nQQQ (Tracks NASDAQ 100) - 20%\n\nWCLD (Bessemer Cloud Computing ETF) - 5%\n\nFINX (Fintech ETF) - 5%\n\nAAPL - 5%\n\nMSFT - 5%\n\n&amp;#x200B;\n\nI've got a few questions:\n\n1) given my goals and time horizons, is this too aggressive an allocation?\n\n2) am I missing any categories in which I should be diversified?\n\n3) for paying for business school ($200k-$250k if I decide to go) and buying a house down the line, does it make sense to liquidate some of what I will have in the market by then and take out a loan for the rest, or should I just leave it in the market and take out a loan for the full amount?\n\n&amp;#x200B;\n\nThank you!",
        "created_utc": 1604272400,
        "id": "gaub9e3",
        "score": 1,
        "subreddit": "investing",
        "created": 1604301200.0
    },
    {
        "author": "RedRiki24",
        "body": "Using MS Edge I see, $MSFT long 2022? lol",
        "created_utc": 1604285135,
        "id": "gauyd0h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604313935.0
    },
    {
        "author": "gonewildpapi",
        "body": "Microsoft is trying to compete but dynamics is nowhere near as polished",
        "created_utc": 1604288547,
        "id": "gav42or",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604317347.0
    },
    {
        "author": "thekingbun",
        "body": "I wouldn’t sell shop or Msft out of those",
        "created_utc": 1604288149,
        "id": "gav3fkq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604316949.0
    },
    {
        "author": "throughthevalley77",
        "body": "All the things I own is  red except for Apple , MSFT, SNOW, and NEE",
        "created_utc": 1604288526,
        "id": "gav41fs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604317326.0
    },
    {
        "author": "tirth__p",
        "body": "It's overpriced af. Now MSFT is different thing. That should be at least 220 rn",
        "created_utc": 1604324486,
        "id": "gaw7sbr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604353286.0
    },
    {
        "author": "Planets_and_plants",
        "body": "Bullish NIO / MSFT \n\nCrazy?",
        "created_utc": 1604307185,
        "id": "gavpu95",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604335985.0
    },
    {
        "author": "Waffini",
        "body": "it's blue chips, they may go down, or up, but no one believes Amazon, Unilever, or MSFT will have much impact due to elections. Sure, on the short term their price may go down, but that's not because of Amazon or theothers.\n\nkeep everything invested and check again in late november.",
        "created_utc": 1604311755,
        "id": "gavtpfc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604340555.0
    },
    {
        "author": "ChiefSwampass",
        "body": "MSFT up today and I’m down on my calls. Lol classic",
        "created_utc": 1604327630,
        "id": "gawd1pb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604356430.0
    },
    {
        "author": "jpsgshow",
        "body": "That I own: MO, FSLY, MSFT\n\nThat I want to own: SE, SQ, AAPL",
        "created_utc": 1604334407,
        "id": "gawqh90",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604363207.0
    },
    {
        "author": "atdharris",
        "body": "Congress can do or say whatever they want. I just can't imagine any court would rule to break up Amazon in its current form, at least not using that argument. If anything, it would be spinning off AWS, but I don't know a compelling reason to force that before ordering other remedies. It's very rare companies are straight up broken up, even Microsoft avoided that in 2000 when they controlled 97% of the PC market.",
        "created_utc": 1604335184,
        "id": "gaws4ee",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604363984.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "MSFT isnt below 200 so we good fam.",
        "created_utc": 1604336378,
        "id": "gawuohz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604365178.0
    },
    {
        "author": "quaddles",
        "body": "For earnings? I got fucked by msft",
        "created_utc": 1604337667,
        "id": "gawxf8t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604366467.0
    },
    {
        "author": "coolcomfort123",
        "body": "no more selloff, I am holding msft, amzn and aapl, I am ready for tomorrow.",
        "created_utc": 1604361198,
        "id": "gay9kcu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604389998.0
    },
    {
        "author": "NPRjunkieDC",
        "body": "I love onigiris and they sell them at a local Japanese grocery in downtown Washington DC. First 2 companies in your list are based here! DHR reminds me of MSFT with several strong income streams .",
        "created_utc": 1604360517,
        "id": "gay8b6k",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604389317.0
    },
    {
        "author": "Incognitary",
        "body": "Microsoft Surface Duo",
        "created_utc": 1604365678,
        "id": "gayhpom",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604394478.0
    },
    {
        "author": "Velociraptor451",
        "body": "I'm thinking MSFT and FB, buy @ 10:30am sell @ 3:30pm. Some days MSFT is up while FB is down I can sell one or wait. I'll do a test tomorrow. And why Apple?",
        "created_utc": 1604374022,
        "id": "gaywo8v",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604402822.0
    },
    {
        "author": "thelunarlemur",
        "body": "This post just made me realize that Microsoft is the ultimate worst penis status you can possibly attain",
        "created_utc": 1604369240,
        "id": "gayo4ho",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604398040.0
    },
    {
        "author": "marcusstoin",
        "body": "The answer will vary from person to person.  \nTalking about my investments, for short-term investments, I have invested in Microsoft Corp. (MSFT), Nike (NKE), and Nautilus (NLS) with TurnkeyForex and DEGIRO. For long-term investments, I have invested in Square (NYSE: SQ), Walmart (NYSE: WMT), and Waste Management (NYSE: WM) with Interactive Investor and Saxo Markets.",
        "created_utc": 1604386793,
        "id": "gazekfa",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604415593.0
    },
    {
        "author": "diesel408",
        "body": "So the other response summed it up pretty well, but left one other important factor out. The importance of Intel's architecture is fading. It will always be around of course, but anyone that doesn't think ARM is going to keep getting a larger and larger bite of the pie isn't paying attention. Apple will give everyone permission to target software for ARM architecture and we'll soon see a second attempt from Microsoft. Again, we'll always have applications for Intel, but it won't be nearly as dominant. Intel's production woes over the past half decade are well documented, and it's clear that they are about as well run as Boeing these days. The problem for Intel is that they face much more fierce competition than Boeing. Intel will survive of course, but they'll be a shell of their former self, and they'll have fumbled their flagship products and missed the boat on the areas of the industry that are sure to see rapid growth. I understand that people want to target value, but Intel is priced the way they are for good reason. If you're looking for value in Intel then I have some IBM stock to sell you as well.",
        "created_utc": 1604375350,
        "id": "gayyy7s",
        "score": 1,
        "subreddit": "investing",
        "created": 1604404150.0
    },
    {
        "author": "-Jocko-",
        "body": "Last time you'll ever get MSFT for 200 again",
        "created_utc": 1604345708,
        "id": "gaxejjk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604374508.0
    },
    {
        "author": "Okmanl",
        "body": "Most fund managers don’t beat the market. Because they’re not trying to. Many fund managers and professional investors also have regulations they have to follow. They can’t make concentrated investments. They have to show quarterly results and so forth. For example Cathy Wood said she would’ve put a lot more into Tesla but because of rules and regulations the max she can invest is ~10% per fund she manages. \n\n\nIndividual investors can definitely beat the market by having a concentrated portfolio. Knowing the stock that they own intimately and not letting emotions get involved. \n\nThere are quite a few people who have a concentrated portfolio on 3-4 companies like Square, peloton, Tesla, Amazon, Microsoft, AMD and so forth. And they have all outperformed the market over 5-10 years. \n\nIf you have a high risk tolerance then buying single stocks can be worth it.",
        "created_utc": 1604268188,
        "id": "gau36se",
        "score": 10,
        "subreddit": "investing",
        "created": 1604296988.0
    },
    {
        "author": "JW4974",
        "body": "🌈🐻 Reporting - SPY 330 breached, MSFT tanked\n\nElite Team 6 going in.\n\nLuv, 🌈🐻 maintenance team",
        "created_utc": 1604333977,
        "id": "gawpkqg",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1604362777.0
    },
    {
        "author": "troylus81",
        "body": "Holding puts til after the election. Then going all in on microsoft leaps. Microsoft under 200 is a money maker buying leaps and letting it ride all of 2021.",
        "created_utc": 1604274755,
        "id": "gaufril",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1604303555.0
    },
    {
        "author": "Carsrcool12345",
        "body": "I'I keep mostly all of them but Zoom. It's beyond me how that stock is at what its at and how much it has increased since Covid especially when Microsoft has a product that directly competes with Zoom that is the same level of quality if not better. I only see that stock going down.",
        "created_utc": 1604285926,
        "id": "gauzq5h",
        "score": 6,
        "subreddit": "stocks",
        "created": 1604314726.0
    },
    {
        "author": "-Jocko-",
        "body": "microsoft",
        "created_utc": 1604251184,
        "id": "gat4j9k",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604279984.0
    },
    {
        "author": "t33po",
        "body": "What's protecting NET from the encroaching MSFT, GOOG, AMZN cloud and C.D.N. services? It just seems like FSLY, NET type companies are just proving concepts for network services for the monsters to copy and better intergrate into their own platforms. Am I crazy here?",
        "created_utc": 1604267858,
        "id": "gau2j8e",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604296658.0
    },
    {
        "author": "t777m",
        "body": "I’m 18, a student, getting money by saving parts of my student loan. My objectives are to simply get an understanding of investment and then work towards targets (a quick way of getting money would be nice but i understand that in my position its not faesible). As I’m starting off with a weak source of money i’d prefer a safer strategy, for now. I managed to get hold of 0.02 ETH and a share of SDC.\n\nI have recently picked up an interest in investing and am thinking about starting in the coming days, on trading 212. Ive selected the FAANG companies, Microsoft, Tesla, Shopify, Salesforce, Nvidia, Adobe and Vanguard emerging markets etf. I’m not sure about the percentages.\n\nis this a good pie and what percentages should i use?",
        "created_utc": 1604276240,
        "id": "gauijhz",
        "score": 3,
        "subreddit": "investing",
        "created": 1604305040.0
    },
    {
        "author": "FearlessTrader",
        "body": "Okay guys, realistic question, at what levels would you be comfortable buying leaps for the following stocks:\n\n1. FB\n2. SQ\n3. AMZN\n4. MSFT\n5. TSLA\n6. AAPL",
        "created_utc": 1604277014,
        "id": "gaujyjs",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604305814.0
    },
    {
        "author": "Bolkonsky999",
        "body": "i am all in on spt and ccl puts, and only thing worrying me about my positions is tech. amazon is already at 3000, msft at 200, i don't think they'll go much lower than that. Now, I am hoping tech won't move much on monday while everything else tanks, so spy goes down. i should be buying dia puts instead haha",
        "created_utc": 1604252963,
        "id": "gat7wpg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604281763.0
    },
    {
        "author": "professorsquat",
        "body": "I sold 13k worth of NIO on Friday so I could buy MSFT leaps. AMA",
        "created_utc": 1604329064,
        "id": "gawfq76",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604357864.0
    },
    {
        "author": "Zephyr101",
        "body": "Fuck Microsoft fuck Apple",
        "created_utc": 1604331520,
        "id": "gawkiu9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604360320.0
    },
    {
        "author": "Itsme_eljefe",
        "body": "ARKK\nARKQ\nARKF\nSPY\nAMD\nTSLA\nQQQ\nTQQQ\nSNAP\nCHWY\nAMZN\nMSFT\nTSM\nASML\nSOXL",
        "created_utc": 1604265001,
        "id": "gatwunf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604293801.0
    },
    {
        "author": "Cwc123",
        "body": "msft",
        "created_utc": 1604251181,
        "id": "gat4j28",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604279981.0
    },
    {
        "author": "TheQsandCuesrules",
        "body": "You’re absolutely correct man, I’m just scared I’ll make the wrong choice or baghold a stock for a while where as with an etf the upside is way less but downside is minimal compared to a TSLA NVDA AMD (tech or growth stocks - even MSFT AAPL with their dividends still fluctuate). \n\nYour stock picks outperform the market or your main goal is let me just choose sound companies with dividend growth?",
        "created_utc": 1604287406,
        "id": "gav27jh",
        "score": 3,
        "subreddit": "stocks",
        "created": 1604316206.0
    },
    {
        "author": "Subscribe-to",
        "body": "In hindsight it's easy to say she should've just invested in AAPL, MSFT or AMZN 20 years ago but she could've just as easily invested in GE.\n\n&amp;#x200B;\n\nThis also doesn't take into account taxes",
        "created_utc": 1604258171,
        "id": "gatilmz",
        "score": 2,
        "subreddit": "investing",
        "created": 1604286971.0
    },
    {
        "author": "SudsAde6985",
        "body": "I’m no bull, but if MSFT closes below 200 any day before next earnings, I’d be surprised. Shorted it at 210 &amp; 225 this summer. Got to 196.25 for a moment, but still closed @ 202. Flirted with it lately, but now long 195 again on Friday. Most confident trade I made last week. Considering I’m getting slaughtered in my TUP short at the moment. Who’da thunk?",
        "created_utc": 1604252224,
        "id": "gat6inh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604281024.0
    },
    {
        "author": "AtWarWithAll",
        "body": "microsoft",
        "created_utc": 1604253153,
        "id": "gat89r3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604281953.0
    },
    {
        "author": "MoarTarriffs",
        "body": "I like picking riskier medium cap growth stocks such as NET, CRWD, ENPH, SQ, TDOC, TSLA. These have potential to grow more than stocks such as MSFT. But MSFT and AAPL are great additions to growth portfolios",
        "created_utc": 1604255995,
        "id": "gate1ib",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604284795.0
    },
    {
        "author": "Electrical_Spite_477",
        "body": "Costco, Amazon, Microsoft, apple... are all going to sell the exact amount of shit no matter who wins",
        "created_utc": 1604258677,
        "id": "gatjo7h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604287477.0
    },
    {
        "author": "LavenderAutist",
        "body": "How does that work out when Microsoft falls 30%?",
        "created_utc": 1604297360,
        "id": "gavg0wv",
        "score": 2,
        "subreddit": "investing",
        "created": 1604326160.0
    },
    {
        "author": "PlanetExperience",
        "body": "You guys think it's too early to buy MSFT 1/15 2021 230C?",
        "created_utc": 1604333155,
        "id": "gawnvon",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604361955.0
    },
    {
        "author": "rifle5k",
        "body": "MSFT $200/ AMAZON $3000 rest wouldn't buy.",
        "created_utc": 1604277120,
        "id": "gauk5su",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604305920.0
    },
    {
        "author": "KraheKaiser",
        "body": "I sold short term /NQ call spreads and bought 2023 leaps on MSFT, and a Jan $600 call on NVDA which is retarded.. need to sell more spreads to at least cover all this extrinsic value  but its too risky to do all at once.",
        "created_utc": 1604332345,
        "id": "gawm807",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604361145.0
    },
    {
        "author": "TendiesForTheBoys",
        "body": "Me too... I sold 1,200 shares of MSFT at $223.86 only to buy it back at $221.00 and watch it drop to $202 and probably more.... I will be holding LONG though",
        "created_utc": 1604280555,
        "id": "gauqa7d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604309355.0
    },
    {
        "author": "Electrical_Spite_477",
        "body": "YeH, there's a point where they're too small to prevent being crushed like Slack is getting crushed by Microsoft. But if they can overcome the small cap stage and become entrenched, like Zoom, they become too big to be crushed.",
        "created_utc": 1604268551,
        "id": "gau3vgt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604297351.0
    },
    {
        "author": "AngelaQQ",
        "body": "Japan’s lost decades was a combination of fiscal mismanagement, overbearing debt load, and complete lack of technology growth, leading to stagnation.  \n\nAs a result, Japanese investors and savers pulled their money from the Nikkei and put it into US equities. Equities like Microsoft, Apple, Sun, Oracle saw a huge influx of Japanese capital as their markets stagnated.  \n\nEven today, none of Japan’s top 20 companies by market cap are internet or software/tech companies. \n\nThey’ve basically missed the boat on every single technological revolution of the past 30 years.\n\nI’m not as worried about the US, because the US (and China) are the world leaders in technological innovation in almost all major sectors.\n\nIf there IS for some reason a lost decade in the US, China will benefit, as they are the only country that can compete technologically, and their debt position vis a vis the rest of world is favorable.",
        "created_utc": 1604251434,
        "id": "gat50uk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604280234.0
    },
    {
        "author": "AmazingConcept3",
        "body": "Hello, I am looking for some advice on a potential portfolio allocation that I am considering. I am a new college graduate looking to begin investing. Before I list out the portfolio I am considering, please see my answers to the relevant information questions:\n\n&amp;#x200B;\n\n* How old are you? **23**\n* Are you employed/making income? How much? **Yes, $110k/year salary**\n* What are your objectives with this money? (buy a house? Retirement savings?) **Potentially looking to go to business school in 2-5 years, but definitely looking to buy a house (in probably 5-10 years). Not sure how much of the returns from the market I will use on this vs. taking out a loan. So otherwise, I am looking for retirement savings**\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?) **I've got a long time horizon so my tolerance is fairly high**\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?) **None**\n* Any other assets? House paid off? Cars? Expensive significant other? **$20k in cash, plus I am looking to invest at least half of my salary this year since I am living with my parents and have no expenses.**\n* What is your time horizon? Do you need this money next month? Next 20yrs? **I am prepared to hold onto my investments up until retirement, though I MIGHT want to take some money out to pay for business school/house**\n* Any big debts? **None**\n* Any other relevant financial information will be useful to give you a proper answer. **None**\n\nThe allocation I am considering is:\n\nS&amp;P 500 - 30%\n\nVWIGX (Vanguard International Growth ETF) - 15%\n\nVDADX (Vanguard Dividend Appreciation ETF) - 15%\n\nQQQ (Tracks NASDAQ 100) - 20%\n\nWCLD (Bessemer Cloud Computing ETF) - 5%\n\nFINX (Fintech ETF) - 5%\n\nAAPL - 5%\n\nMSFT - 5%\n\n&amp;#x200B;\n\nI've got a few questions:\n\n1) given my goals and time horizons, is this too aggressive an allocation?\n\n2) am I missing any categories in which I should be diversified?\n\n3) for paying for business school ($200k-$250k if I decide to go) and buying a house down the line, does it make sense to liquidate some of what I will have in the market by then and take out a loan for the rest, or should I just leave it in the market and take out a loan for the full amount?\n\n&amp;#x200B;\n\nThank you!",
        "created_utc": 1604272400,
        "id": "gaub9e3",
        "score": 1,
        "subreddit": "investing",
        "created": 1604301200.0
    },
    {
        "author": "RedRiki24",
        "body": "Using MS Edge I see, $MSFT long 2022? lol",
        "created_utc": 1604285135,
        "id": "gauyd0h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604313935.0
    },
    {
        "author": "gonewildpapi",
        "body": "Microsoft is trying to compete but dynamics is nowhere near as polished",
        "created_utc": 1604288547,
        "id": "gav42or",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604317347.0
    },
    {
        "author": "thekingbun",
        "body": "I wouldn’t sell shop or Msft out of those",
        "created_utc": 1604288149,
        "id": "gav3fkq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604316949.0
    },
    {
        "author": "throughthevalley77",
        "body": "All the things I own is  red except for Apple , MSFT, SNOW, and NEE",
        "created_utc": 1604288526,
        "id": "gav41fs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604317326.0
    },
    {
        "author": "tirth__p",
        "body": "It's overpriced af. Now MSFT is different thing. That should be at least 220 rn",
        "created_utc": 1604324486,
        "id": "gaw7sbr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604353286.0
    },
    {
        "author": "Planets_and_plants",
        "body": "Bullish NIO / MSFT \n\nCrazy?",
        "created_utc": 1604307185,
        "id": "gavpu95",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604335985.0
    },
    {
        "author": "Waffini",
        "body": "it's blue chips, they may go down, or up, but no one believes Amazon, Unilever, or MSFT will have much impact due to elections. Sure, on the short term their price may go down, but that's not because of Amazon or theothers.\n\nkeep everything invested and check again in late november.",
        "created_utc": 1604311755,
        "id": "gavtpfc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604340555.0
    },
    {
        "author": "ChiefSwampass",
        "body": "MSFT up today and I’m down on my calls. Lol classic",
        "created_utc": 1604327630,
        "id": "gawd1pb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604356430.0
    },
    {
        "author": "jpsgshow",
        "body": "That I own: MO, FSLY, MSFT\n\nThat I want to own: SE, SQ, AAPL",
        "created_utc": 1604334407,
        "id": "gawqh90",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604363207.0
    },
    {
        "author": "IWorkForTheEnemyAMA",
        "body": "I second this. Let’s get a Bull prayer circle for MSFT. 🙏 ⭕️",
        "created_utc": 1604319931,
        "id": "gaw1m6s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604348731.0
    },
    {
        "author": "CallidusVulpes",
        "body": "Nvidia is a safe investment in the long run (they might go down a bit this month though due to AMD, but overall Nvidia has went up consistently over the past 5 years and has shown no signs of deviating significantly from that), Microsoft is safe, Tesla is too scary for me personally. I don't buy ETFs or evaluate them, I evaluate individual stocks then choose whether or not I would like to purchase them. I play for large short term gains (large relative to my investment portfolio and short meaning a few months typically). I've made a 17.49% profit in the past 2 weeks (starting with 2k) due to making \"all in\" bets on Corsair (to be clear to do this I was incredibly confident it was going to go up, but I definitely wouldn't advise it if you do not need the money, I have a stupidly low retirement target). Corsair was likely my most risky investment that's why I left quickly. AMD and TSMC are great investments for a couple of years, probably 3 years or more (TSMC almost definitely 3 years or more since they make the most powerful CPUs that go in the new Xbox, PS5, AMD CPUs, Apple CPUs, and they even have Intel waiting in line since their factories are all in use). You'll almost definitely hate my diversity, but I'm likely going to buy all AMD and TSMC (In my opinion diversity is for people who don't know much about the market they are invested in or don't feel like keeping up with the news). If I were to make a more long-term safer account I'd buy NVidia, Apple, AMD, and TSMC (Diversification in different sectors doesn't help if the entire market goes down, and I don't believe these specific tech stocks have exited a year down for the past decade (I know at least for the past 5 years they haven't), except for AMD which completely changed as a company). I'm putting all of my money on AMD and TSMC once the market opens tomorrow (I'd recommend stocking up ASAP on those stocks since they had a bad day on Friday). Apple will likely not see that much growth if any this quarter, but they'll be great for the long term. If you don't have the stomach or patience for seeing temporary losses then I would not recommend tech (Microsoft isn't too bad actually). I've sat on 200 USD losses (which is 10% of my portfolio) and went positive 145 USD the next day (that was my worst timed trade with Corsair). This probably looks very frantic, sorry, I'm a bit too excited.",
        "created_utc": 1604280086,
        "id": "gaupgm9",
        "score": 1,
        "subreddit": "investing",
        "created": 1604308886.0
    },
    {
        "author": "thatradsguy",
        "body": "Yeah for real, what do you even mean by this? MSFT doesn't need GME for online at all, I think it's a great deal to have their financing plan but it literally serves MSFT no benefit whatsoever to make an online component.  They already have full autonomy over their store and can discount whatever they want.",
        "created_utc": 1604269284,
        "id": "gau5arm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604298084.0
    },
    {
        "author": "nanaboostme",
        "body": "MSFT not as much SNE",
        "created_utc": 1604333090,
        "id": "gawnqzb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604361890.0
    },
    {
        "author": "UsernameTaken_123",
        "body": "Of course they're holding both Google, Apple and Microsoft 😂",
        "created_utc": 1604219995,
        "id": "garwpak",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604248795.0
    },
    {
        "author": "RepresentativeIcy922",
        "body": "20 years ago you say? Home Depot? according to Google, Home Depot (NYSE:HD) was $41.19 on Nov 3, 2000. Today it is $266.71, that is a more than 6x (600% ?) return  in 20 years, or an average of more than 30% a year, not even including dividends.   \n\n\nI still don't see how it would have been better if she had sold it and kept everything in cash. Of course she could have bought AAPL or MSFT or AMZN, but maybe she preferred to stay in her circle of competence.",
        "created_utc": 1604221796,
        "id": "garysbn",
        "score": 1,
        "subreddit": "investing",
        "created": 1604250596.0
    },
    {
        "author": "Dmoan",
        "body": "You don't buy a stock of a company which is not profitable and is facing life or death battle with big tech (Microsoft Teamd in this case).",
        "created_utc": 1604226650,
        "id": "gas4jka",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604255450.0
    },
    {
        "author": "coolcomfort123",
        "body": "yup, keep holding amzn and msft as covid play.",
        "created_utc": 1604242508,
        "id": "gasoy2i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604271308.0
    },
    {
        "author": "Dmoan",
        "body": "MSFT 2021 estimate is 30 pe which is pretty reasonable as they can likely beat it.",
        "created_utc": 1604247537,
        "id": "gasxrdu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604276337.0
    },
    {
        "author": "Dmoan",
        "body": "If things settle down come Wednesday I will stick to what works which is stay at home stocks that are priced reasonably. Apple, ATVI, MSFT, SNE, CHWY, SQ or PYPL, UPS would be my plays",
        "created_utc": 1604249675,
        "id": "gat1oyn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604278475.0
    },
    {
        "author": "Farrrrout",
        "body": "Msft is my next buy if it drops more",
        "created_utc": 1604253621,
        "id": "gat96l7",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1604282421.0
    },
    {
        "author": "peanutbutteryummmm",
        "body": "Buying when fearful works until it doesn’t. Try buying Microsoft pre .com bubble. Great company, but it still took a long time\nTo recover. There are always risks. DCA is a good strategy right now",
        "created_utc": 1604260837,
        "id": "gato5xn",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1604289637.0
    },
    {
        "author": "Chris-in-PNW",
        "body": "I absolutely would not buy MSFT at current valuations. But I'm also not inclined to sell any of my shares at the moment. While I don't disagree with your assessment of their products, their enduring appeal to enterprise in spite of those products is hard to ignore.\n\nI like AAPL much better, but I am neither increasing nor decreasing my position right now. \n\nI won't touch FB, because I don't trust Mark Zuckerberg's leadership ability.\n\nI avoid TSLA because I don't understand why it should be valued so much higher than other auto manufacturers who will ultimately be strong competitors in the sector. And I don't trust Elon Musk's leadership ability.",
        "created_utc": 1604220368,
        "id": "garx2bu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604249168.0
    },
    {
        "author": "RepresentativeIcy922",
        "body": "It's easy to see that Zoom is (was?) undervalued. People are having more meetings online because of covid-19, and a lot of them are using Zoom. It seems everywhere you look someone has an online meeting on Zoom. Schools that are closed have classes on Zoom.   \nZoom seems to be like the Microsoft of online meetings these days, it's the de-facto industry standard for online meetings. So on that basis alone, Zoom seems undervalued (at this point in time.) \n\nThey're more popular now than they ever were, and that potentially means more money, and that in turn means the price might go up.   \n\n\nThe thing about active trading is, well, that it's active. The fund managers try to figure out what will go up and buy it, and sell it before it drops. They're more momentum players than long-term holders, so I guess based on that alone they might buy Zoom (because everyone seems to be using it these days, and that can't be a bad thing as far as the price is concerned (for now anyway.)  \n\n\nThere was a lot of hype around Zoom, and when it appeared on a lot of people's radars it was a lot cheaper than it is now.  They would have likely bought in when they first started seeing all those ads for seminars on Zoom, and notices of schools being closed and having classes on Zoom.",
        "created_utc": 1604214954,
        "id": "garsd9o",
        "score": 1,
        "subreddit": "investing",
        "created": 1604243754.0
    },
    {
        "author": "Heim23",
        "body": "Time didn't move, just your dumb Microsoft Windows clock.",
        "created_utc": 1604224112,
        "id": "gas1k0l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604252912.0
    },
    {
        "author": "fyjx",
        "body": "COVID spurs cloud adoption and will continue to do so. The cloud adoption takes time for companies to take full advantage of it and thrive. That means you will see huge upside for cloud providers like MSFT and AMZN after 1 or 2 years.",
        "created_utc": 1604247747,
        "id": "gasy5f3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604276547.0
    },
    {
        "author": "MAndrewNg",
        "body": "Okay, thank you much! What are some of your growth stocks? The usual appl / fb / msft?",
        "created_utc": 1604250771,
        "id": "gat3qzu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604279571.0
    },
    {
        "author": "coolcomfort123",
        "body": "msft, aapl, and amzn.",
        "created_utc": 1604242628,
        "id": "gasp4yt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604271428.0
    },
    {
        "author": "FluffyTheWonderHorse",
        "body": "My portfolio is mostly Tesla, Microsoft and AMD but was looking at buying more dividend stocks next year.\n\nI pay a stupid amount of money into my Prudential Life insurance that I'd now rather be investing (10% of my yearly income) which I'll get back at about a 1% return :(\n\nQuestion is: would investing in Prudential be a bad idea due to the fact I'm putting me net into them anyway?\n\nIt's currently a 6-7% dividend payout.",
        "created_utc": 1604271157,
        "id": "gau8vfu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604299957.0
    },
    {
        "author": "OriginallyWhat",
        "body": "\"The market\" in general, you're totally right. But if the Google ceo tells you that they're buying out Microsoft next month, there's a solid chance the price will go up when the news comes out.\n\nNot trying to say you're wrong or argue, because 99% you're correct. Just wanted to point out one of the few exceptions.",
        "created_utc": 1604280859,
        "id": "gauqtfy",
        "score": 1,
        "subreddit": "investing",
        "created": 1604309659.0
    },
    {
        "author": "PowerOfExponents",
        "body": "A quarter of QQQ is literally blue chip tech a la apple and Microsoft",
        "created_utc": 1604283447,
        "id": "gauvex2",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1604312247.0
    },
    {
        "author": "insanegreek2020",
        "body": "It’s all about liquidity. You want to be able to get in and out quick with options with minimal bid/ask spreads. Any big tech is good. Google for some reason has shitty options imo. There’s not much volume on any given day. Aapl msft fb spy the best",
        "created_utc": 1604238192,
        "id": "gasiapy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604266992.0
    },
    {
        "author": "jacektrocinski",
        "body": "I'm a Microsoft partner and they don't answer my calls as well so don't worry about it, it's normal.",
        "created_utc": 1604307422,
        "id": "gavq1ng",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604336222.0
    },
    {
        "author": "jHyGxgYag",
        "body": "Yeah I’m trading using price action. I think right now could be a good entry on Microsoft. It’s at its 1 month support level",
        "created_utc": 1604312306,
        "id": "gavu6h3",
        "score": 1,
        "subreddit": "investing",
        "created": 1604341106.0
    },
    {
        "author": "ApolloFirstBestCAG",
        "body": "My Costco stock is here lagging to remind me I should've bought more Microsoft instead",
        "created_utc": 1604314643,
        "id": "gavw8iv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604343443.0
    },
    {
        "author": "General_Asleep",
        "body": "Msft has been disappointing for a while too :(",
        "created_utc": 1604315887,
        "id": "gavxddt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604344687.0
    },
    {
        "author": "Murda_City",
        "body": "Set a price to buy in at. I see msft at 200. I buy it. Simple plan. Works until it doesn't.",
        "created_utc": 1604318944,
        "id": "gaw0huh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604347744.0
    },
    {
        "author": "badtradesguy",
        "body": "honestly man, like others have mentioned...this article is just regurgitating information that a lot of us already consider as risk factors...at least for the last 2-3 years.\n\nThis shouldnt be news.\n\nthe solution is strategic DCA and utilization option strategies.\n\nStrategic DCA is having planned entry points where youre putting more cash than your regular dca amounts.\n\nOption strategies like covered calls and selling puts to make entry.\n\nDoing this, even if the US went through something similar to japan, the actual return to profit would be a fraction of the time.\n\nThis isnt to say you shouldnt be diversified globally. However, if you look at all the big players, there really isnt a more free market with stronger companies than the US.\n\nGoogle,Aapl, Msft, amzn...all tech, but also all entrenched in the globally.",
        "created_utc": 1604296464,
        "id": "gavezf6",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1604325264.0
    },
    {
        "author": "MGT01",
        "body": "I say AMZN is most vulnerable to a break up bc they’re having a direct effect on B&amp;M and smaller businesses. That looks bad politically when mom and pop are closing their doors bc AMZN can sell for a lot less. GOOG, I agree is a bigger and more monopolistic company compared to AMZN, but from a political lense, who are they hurting? Yahoo and Bing?\n\nAs someone who buys AdWords, I get that GOOG hurts mom and pop, too; but I kind of like having GOOG being the dominant player. Means I don’t have to pay MSFT and whoever owns Yahoo for the same marketing. I think that’s a common sentiment that will protect GOOG for a while.\n\nIn the end though, I don’t think any will be broken up, either. But that heat from Congress will impede their growth. That’s all I’m saying.",
        "created_utc": 1604329612,
        "id": "gawgrh0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604358412.0
    },
    {
        "author": "LogicalTranquility",
        "body": "MSFT, BYND, SQ",
        "created_utc": 1604330291,
        "id": "gawi2q2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604359091.0
    },
    {
        "author": "geflab",
        "body": "MSFT 220c 3/20",
        "created_utc": 1604333743,
        "id": "gawp3au",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604362543.0
    },
    {
        "author": "TellYourSisterILover",
        "body": "If msft could pump hugely on some Xbox news or something, that would be great.",
        "created_utc": 1604319390,
        "id": "gaw0ziq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604348190.0
    },
    {
        "author": "noveltieaccount",
        "body": "31 years old - Keeping some money out of stocks for now because of high valuations. I want to have a little something to put in if the market drops.\n\nIRAs (85% of total investments)\n55% SP500 index\n15% Bonds\n15% Small cap index\n15% International stock index\n\nTaxable accounts - for fun (15% of total investments)\n19% BOMN\n14% Cash\n11% Short Term Bonds\n8% LGL\n8% COLM\n8% BRK.B\n7% TXRH\n3% MSFT\n2% NCBS\n2% TTC\n2% DIS\n2% JCTCF\n22% Other stocks",
        "created_utc": 1604325896,
        "id": "gawa1su",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604354696.0
    },
    {
        "author": "CXXIX129",
        "body": "JNJ MSFT STOR\n\nV",
        "created_utc": 1604333417,
        "id": "gawof2u",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604362217.0
    },
    {
        "author": "astearns31",
        "body": "You seriously think it’s the best run company? Match  it’s total return to say the S&amp;P or an actual well run company like Danaher/Microsoft/SPGI.",
        "created_utc": 1604240160,
        "id": "gaslb39",
        "score": 1,
        "subreddit": "investing",
        "created": 1604268960.0
    },
    {
        "author": "Lord_Stinkler",
        "body": "Opened a Roth a year ago and MSFT, AAPL, AQN, BMO and AMD are my  recommendations for single stock. \n\nWith a Roth you planning on leaving in for a while so the rest I put into ETFs and mutual funds and they do solid over long term (5+ years). ETFs I like are VIG SCHX and ESPO (covid has ESPO booming prior to the past week). Mutual Funds I like mainly is PRDGX and any S&amp;P 500 fund.",
        "created_utc": 1604218483,
        "id": "garvfay",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604247283.0
    },
    {
        "author": "jacektrocinski",
        "body": "The big short is $SNOW, they're trying to compete with Oracle, Microsoft and Amazon in the database space, they're going to get crushed.",
        "created_utc": 1604215335,
        "id": "garsp81",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604244135.0
    },
    {
        "author": "StarWolf478",
        "body": "The big two for me are:\n\nNetflix - The Q2 lockdown was the absolute most perfect condition imaginable for Netflix's business and anybody that had any interest in Netflix should have already subscribed by that point in time. I think that there now has to be some significant growth slowdown after such perfect business conditions start to come to an end. Plus, more and more competitors are entering the market to compete for Netflix's subscribers while also pulling their content from Netflix which forces Netflix to spend more money to develop their own content. All of that makes me think that Netflix cannot maintain the high growth that they have had thus far and if they can't maintain that growth then investors will eventually start to abandon them. I'm still bullish on streaming though, so I've invested in Roku instead as my streaming stock since they are the \"picks and shovels seller\" for the \"streaming gold rush\" and unlike Netflix, they benefit from the increased competition entering the streaming market.\n\nGoogle - They have started to remind me of Microsoft during the Steve Ballmer era. When was the last time that Google successfully executed upon a great new product and didn't ultimately send it to ever growing [Google Graveyard](https://killedbygoogle.com/)? I think that it has been about a decade and they have just been living off of their successes from over a decade ago since then. Maybe Google will eventually get new management that revitalizes the company like Microsoft eventually got after Nadella became CEO, but for the foreseeable future, I've lost confidence in them, so I'm out. I've replaced them with Pinterest in my portfolio as my new search/advertising stock. Social search is the future and I now see the genius advertising potential of the Pinterest platform; I see them stealing advertising dollars away from Google and growing much better than Google over the next 5 years.",
        "created_utc": 1604217818,
        "id": "garuvnr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604246618.0
    },
    {
        "author": "Phantomoftheopoohra",
        "body": "So don't tell my wife I told you guys this because she is gonna be pissed. \n\nI come home from working over night shift. Wife is all excited. She tells me she bought 100 shares of TSLA. She is totally risk averse. Prior to buying TSLA she was in full boomer stock mode. PCG, F, GE, UPS and the majority in conservative Vanguard funds. I swear to God nothing gets her going more than a dividend. My first thought when she told me she just dropped nearly 50k on TSLA was holy shit I need to get some fucking puts on that right now. Needless to say it was August 31st. Didn't but the puts...she gets pissed anytime I even mention TSLA. I bought some in the mid 300s. Told her I was cost averaging down on it for us. We have separate finances for most things. Told her about the money I lost on MSFT and AAPL options to make her feel better. Didn't work. Said that it made her more pissed. \n\nTLDR wife holding TSLA bags, gets pissed everytime TSLA comes up.",
        "created_utc": 1604223113,
        "id": "gas0f2r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604251913.0
    },
    {
        "author": "MementoMori97",
        "body": "The total market index is still about 25% tech so it would make sense that this helps bring the value up to where it is now. Looking at ITOT (ishares total market etf) about 19% or so is in Microsoft, Apple, Amazon Facebook and Google, so these would definitely help elevate the total index value.\n\nEdit: ITOT also only fell about 1% friday when most of those stocks were down about 5%, so there is a buffer there.",
        "created_utc": 1604246748,
        "id": "gaswc35",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604275548.0
    },
    {
        "author": "Jansboobjob",
        "body": "Same, TSLA and MSFT doing me dirty these days",
        "created_utc": 1604245336,
        "id": "gastse6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604274136.0
    },
    {
        "author": "JaJaJalisco",
        "body": "bro they got MSFT Office now.",
        "created_utc": 1604295948,
        "id": "gaveddb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604324748.0
    },
    {
        "author": "OACAE",
        "body": "Look it up you retard as of july 2020 they were at 10429 on the year. Do you guys know that you cant go from making 50k cars to 500k cars in a year? You realize you dont make cars solely in excel spreadsheets and Microsoft powerpoints?\n\nThis market will either crash and we can in a few years go back to blowing bubbles or stagnate over the next 10+ years. Buying in this market is nothing but a game of hot potato where you're banking on there being a dumber motherfucker than you willing to buy your \"share\" of a company that doesnt make a profit at a higher price.",
        "created_utc": 1604323362,
        "id": "gaw64ij",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604352162.0
    },
    {
        "author": "Rick_Perrys_Asshole",
        "body": "That is absolutely contrary to how algos work. Algos work off history and they force it to repeat itself. Hence why there are support and resistance levels \n\nLike Msft $200",
        "created_utc": 1604324304,
        "id": "gaw7ia6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604353104.0
    },
    {
        "author": "Dmillehee",
        "body": "How to invest in Microsoft AWS",
        "created_utc": 1604327812,
        "id": "gawdddt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604356612.0
    },
    {
        "author": "noahalaktas",
        "body": "extend: MSFT, VTV, VYM\nnew: NIO, Visa",
        "created_utc": 1604329236,
        "id": "gawg1za",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604358036.0
    },
    {
        "author": "Visceroth",
        "body": "WTF is keeping SPY afloat? Apple isn't that far up. Amazon is red. MSFT is flat. GOOG is on the downtrend.",
        "created_utc": 1604329500,
        "id": "gawgjse",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604358300.0
    },
    {
        "author": "JW4974",
        "body": "GOOG 1550P 1590P 12/3, MSFT 160P 180P 12/19\n\n-$16,390",
        "created_utc": 1604329116,
        "id": "gawftuw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604357916.0
    },
    {
        "author": "Boomtown626",
        "body": "Boomer stocks leading this morning - KO, V, AXP, HON in particular. Underperformance from AMZN, MSFT, AAPL, and some smaller communications stocks are weighing on Nasdaq.",
        "created_utc": 1604329750,
        "id": "gawh0ug",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604358550.0
    },
    {
        "author": "heapsp",
        "body": "So i had 500 bucks laying around and thought, let me try out this robinhood thing....\n\nBought Tesla 10/30 $385 puts on 10/29 for like nothing, Tesla just happened to dip to like $384 and i tripled my money.\n\nNow i rolled it into MSFT $255 2/19/21 calls and will sit on them until they expire.\n\nIf Microsoft hits like $280 before 2/19/21 I will be the dumbest motherfucker to ever make a significant amount of money playing stonks.",
        "created_utc": 1604331049,
        "id": "gawjkr0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604359849.0
    },
    {
        "author": "asorich1",
        "body": "I have the same with a little Microsoft and Facebook thrown in there.  I have no clue what the ceiling for BABA is, but I hope buying in the high 200s and low 300s pays off one day.",
        "created_utc": 1604331088,
        "id": "gawjnll",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604359888.0
    },
    {
        "author": "thewimsey",
        "body": "MSFT wasn't  a computer company. It was a software company. IBM was a computer company.\n\nThe brilliance of MSFT was in - and this seems weird today - realizing that a company could make money just selling software. A ton of money. More money than computer makers could make by themselves. This was a kind of radical idea at the time.\n\nJobs was very successful at the computer business; the Apple was the bestselling PC from 1977-1982.\n\nApple wasn't killed by MSFT, it was killed by IBM, which built a PC from more or less off the shelf parts allowing *anyone* to build a clone. (Which, incidentally, would run windows). \n\nApple's computers couldn't compete with PCs built with off the shelf parts. It's not about Jobs being bad; it's about other people being better.\n\nIBM's approach almost immediately priced *them* out of the PC market, leaving the profits to MSFT and intel (and a tiny bit for clone makers, who mostly ended up in a low margin commodity business).",
        "created_utc": 1604280445,
        "id": "gauq3df",
        "score": 1,
        "subreddit": "investing",
        "created": 1604309245.0
    },
    {
        "author": "jasonbourne0413",
        "body": "Microsoft employees should look at bitcoin",
        "created_utc": 1604303974,
        "id": "gavmxpr",
        "score": 1,
        "subreddit": "investing_discussion",
        "created": 1604332774.0
    },
    {
        "author": "Wear-Outrageous",
        "body": "Weren’t you chest thumping about MSFT er not so long ago 🌚",
        "created_utc": 1604302097,
        "id": "gavl3zw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604330897.0
    },
    {
        "author": "ATG915",
        "body": "You need to call bill gates if you want tocall Microsoft. It all goes through him",
        "created_utc": 1604303476,
        "id": "gavmgp0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604332276.0
    },
    {
        "author": "dixiemaisie",
        "body": "Any chance MSFT 240C gets in the money kthnx",
        "created_utc": 1604301713,
        "id": "gavkqbn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604330513.0
    },
    {
        "author": "t777m",
        "body": "That was a great read. Very insightful.\n\nDid some more research into TSM and am definitely considering investing.\n\nI’ve asked around and have decided to completely reorganise. I got rid of the FAANG companies, Microsoft, Tesla and the emerging markets etf. I then added QQQ as it includes a lot of the big companies i already listed. And also added TSM.\n\nJust playing around with the percentages now, to see what gets the best projection",
        "created_utc": 1604283430,
        "id": "gauvdu7",
        "score": 1,
        "subreddit": "investing",
        "created": 1604312230.0
    },
    {
        "author": "spacemaster13",
        "body": "Microsoft, icln, voo",
        "created_utc": 1604305313,
        "id": "gavo6ox",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604334113.0
    },
    {
        "author": "pickbot",
        "body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**MSFT**|**$210**|**BUY CALL**|**2020-11-13**|**$3.33**|**$202.47**|**3509**|**1677**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckgzhoa63hn6u071765062aa9) | [Track Record](https://www.pickmojo.com/user/Trappin-Shoes/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**",
        "created_utc": 1604257802,
        "id": "gathtrd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604286602.0
    },
    {
        "author": "Amurphy747",
        "body": "Guys hear me out...what if because everybody expects the election to be a complete shitshow, and once it’s over the market is big green cause of all the money on the sidelines waiting to get back in and they realize the world isn’t really on the verge of civil war like everyone thinks every election year. Just look at the fact that this week travel stocks got fucked like tech stocks. That’s not because of corona. Apple and amazon after good earnings report got fucked, same for Microsoft. People are limiting exposure to the market as a whole and just waiting to get back in the stock and don’t want to get fucked by the election and corona news, but decided now wasn’t the time. When it is the time, the trend will reverse hard. Apple was down 6% after a good earnings report and amazon was 5.5%.",
        "created_utc": 1604236038,
        "id": "gasf6vx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604264838.0
    },
    {
        "author": "Kay312010",
        "body": "I bought more MSFT and APPL on the big dip Wednesday and Friday. If DPZ dips, I’ll probably pile on since COVID orders and deliveries continues to look good across the globe for them.",
        "created_utc": 1604258200,
        "id": "gatinq1",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1604287000.0
    },
    {
        "author": "Prayers4Wuhan",
        "body": "Csiq is headed to $30. $160 for Msft is a fair price",
        "created_utc": 1604292715,
        "id": "gavaaxr",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1604321515.0
    },
    {
        "author": "belmont5",
        "body": "That's good deal for GameStop.  They'll probably get bought by Microsoft or Amazon eventually.   Tendies for the chewy guy.  Tendies for Michael Burry, aka Autist Jesus. Tendies for all!",
        "created_utc": 1604292223,
        "id": "gav9nb8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604321023.0
    },
    {
        "author": "ml78779",
        "body": "Yeah I don't have much in. I'm a little over 60% of my overall money, 10.2k in safe longterm investments: AAPL, MSFT, BA, SPY, and AMZN. I'm thinking of getting some first solar calls hoping Biden is going to win, but honestly I'm betting Trumpbis going to, although a Biden presidency would be better for everyone.",
        "created_utc": 1604291668,
        "id": "gav8v8r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604320468.0
    },
    {
        "author": "Okmanl",
        "body": "Most fund managers don’t beat the market. Because they’re not trying to. Many fund managers and professional investors also have regulations they have to follow. They can’t make concentrated investments. They have to show quarterly results and so forth. For example Cathy Wood said she would’ve put a lot more into Tesla but because of rules and regulations the max she can invest is ~10% per fund she manages. \n\n\nIndividual investors can definitely beat the market by having a concentrated portfolio. Knowing the stock that they own intimately and not letting emotions get involved. \n\nThere are quite a few people who have a concentrated portfolio on 3-4 companies like Square, peloton, Tesla, Amazon, Microsoft, AMD and so forth. And they have all outperformed the market over 5-10 years. \n\nIf you have a high risk tolerance then buying single stocks can be worth it.",
        "created_utc": 1604268188,
        "id": "gau36se",
        "score": 10,
        "subreddit": "investing",
        "created": 1604296988.0
    },
    {
        "author": "troylus81",
        "body": "Holding puts til after the election. Then going all in on microsoft leaps. Microsoft under 200 is a money maker buying leaps and letting it ride all of 2021.",
        "created_utc": 1604274755,
        "id": "gaufril",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1604303555.0
    },
    {
        "author": "Carsrcool12345",
        "body": "I'I keep mostly all of them but Zoom. It's beyond me how that stock is at what its at and how much it has increased since Covid especially when Microsoft has a product that directly competes with Zoom that is the same level of quality if not better. I only see that stock going down.",
        "created_utc": 1604285926,
        "id": "gauzq5h",
        "score": 6,
        "subreddit": "stocks",
        "created": 1604314726.0
    },
    {
        "author": "-Jocko-",
        "body": "microsoft",
        "created_utc": 1604251184,
        "id": "gat4j9k",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604279984.0
    },
    {
        "author": "t33po",
        "body": "What's protecting NET from the encroaching MSFT, GOOG, AMZN cloud and C.D.N. services? It just seems like FSLY, NET type companies are just proving concepts for network services for the monsters to copy and better intergrate into their own platforms. Am I crazy here?",
        "created_utc": 1604267858,
        "id": "gau2j8e",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604296658.0
    },
    {
        "author": "t777m",
        "body": "I’m 18, a student, getting money by saving parts of my student loan. My objectives are to simply get an understanding of investment and then work towards targets (a quick way of getting money would be nice but i understand that in my position its not faesible). As I’m starting off with a weak source of money i’d prefer a safer strategy, for now. I managed to get hold of 0.02 ETH and a share of SDC.\n\nI have recently picked up an interest in investing and am thinking about starting in the coming days, on trading 212. Ive selected the FAANG companies, Microsoft, Tesla, Shopify, Salesforce, Nvidia, Adobe and Vanguard emerging markets etf. I’m not sure about the percentages.\n\nis this a good pie and what percentages should i use?",
        "created_utc": 1604276240,
        "id": "gauijhz",
        "score": 3,
        "subreddit": "investing",
        "created": 1604305040.0
    },
    {
        "author": "FearlessTrader",
        "body": "Okay guys, realistic question, at what levels would you be comfortable buying leaps for the following stocks:\n\n1. FB\n2. SQ\n3. AMZN\n4. MSFT\n5. TSLA\n6. AAPL",
        "created_utc": 1604277014,
        "id": "gaujyjs",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604305814.0
    },
    {
        "author": "Bolkonsky999",
        "body": "i am all in on spt and ccl puts, and only thing worrying me about my positions is tech. amazon is already at 3000, msft at 200, i don't think they'll go much lower than that. Now, I am hoping tech won't move much on monday while everything else tanks, so spy goes down. i should be buying dia puts instead haha",
        "created_utc": 1604252963,
        "id": "gat7wpg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604281763.0
    },
    {
        "author": "Itsme_eljefe",
        "body": "ARKK\nARKQ\nARKF\nSPY\nAMD\nTSLA\nQQQ\nTQQQ\nSNAP\nCHWY\nAMZN\nMSFT\nTSM\nASML\nSOXL",
        "created_utc": 1604265001,
        "id": "gatwunf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604293801.0
    },
    {
        "author": "Cwc123",
        "body": "msft",
        "created_utc": 1604251181,
        "id": "gat4j28",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604279981.0
    },
    {
        "author": "TheQsandCuesrules",
        "body": "You’re absolutely correct man, I’m just scared I’ll make the wrong choice or baghold a stock for a while where as with an etf the upside is way less but downside is minimal compared to a TSLA NVDA AMD (tech or growth stocks - even MSFT AAPL with their dividends still fluctuate). \n\nYour stock picks outperform the market or your main goal is let me just choose sound companies with dividend growth?",
        "created_utc": 1604287406,
        "id": "gav27jh",
        "score": 3,
        "subreddit": "stocks",
        "created": 1604316206.0
    },
    {
        "author": "Subscribe-to",
        "body": "In hindsight it's easy to say she should've just invested in AAPL, MSFT or AMZN 20 years ago but she could've just as easily invested in GE.\n\n&amp;#x200B;\n\nThis also doesn't take into account taxes",
        "created_utc": 1604258171,
        "id": "gatilmz",
        "score": 2,
        "subreddit": "investing",
        "created": 1604286971.0
    },
    {
        "author": "SudsAde6985",
        "body": "I’m no bull, but if MSFT closes below 200 any day before next earnings, I’d be surprised. Shorted it at 210 &amp; 225 this summer. Got to 196.25 for a moment, but still closed @ 202. Flirted with it lately, but now long 195 again on Friday. Most confident trade I made last week. Considering I’m getting slaughtered in my TUP short at the moment. Who’da thunk?",
        "created_utc": 1604252224,
        "id": "gat6inh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604281024.0
    },
    {
        "author": "AtWarWithAll",
        "body": "microsoft",
        "created_utc": 1604253153,
        "id": "gat89r3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604281953.0
    },
    {
        "author": "MoarTarriffs",
        "body": "I like picking riskier medium cap growth stocks such as NET, CRWD, ENPH, SQ, TDOC, TSLA. These have potential to grow more than stocks such as MSFT. But MSFT and AAPL are great additions to growth portfolios",
        "created_utc": 1604255995,
        "id": "gate1ib",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604284795.0
    },
    {
        "author": "Electrical_Spite_477",
        "body": "Costco, Amazon, Microsoft, apple... are all going to sell the exact amount of shit no matter who wins",
        "created_utc": 1604258677,
        "id": "gatjo7h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604287477.0
    },
    {
        "author": "rifle5k",
        "body": "MSFT $200/ AMAZON $3000 rest wouldn't buy.",
        "created_utc": 1604277120,
        "id": "gauk5su",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604305920.0
    },
    {
        "author": "TendiesForTheBoys",
        "body": "Me too... I sold 1,200 shares of MSFT at $223.86 only to buy it back at $221.00 and watch it drop to $202 and probably more.... I will be holding LONG though",
        "created_utc": 1604280555,
        "id": "gauqa7d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604309355.0
    },
    {
        "author": "Electrical_Spite_477",
        "body": "YeH, there's a point where they're too small to prevent being crushed like Slack is getting crushed by Microsoft. But if they can overcome the small cap stage and become entrenched, like Zoom, they become too big to be crushed.",
        "created_utc": 1604268551,
        "id": "gau3vgt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604297351.0
    },
    {
        "author": "AngelaQQ",
        "body": "Japan’s lost decades was a combination of fiscal mismanagement, overbearing debt load, and complete lack of technology growth, leading to stagnation.  \n\nAs a result, Japanese investors and savers pulled their money from the Nikkei and put it into US equities. Equities like Microsoft, Apple, Sun, Oracle saw a huge influx of Japanese capital as their markets stagnated.  \n\nEven today, none of Japan’s top 20 companies by market cap are internet or software/tech companies. \n\nThey’ve basically missed the boat on every single technological revolution of the past 30 years.\n\nI’m not as worried about the US, because the US (and China) are the world leaders in technological innovation in almost all major sectors.\n\nIf there IS for some reason a lost decade in the US, China will benefit, as they are the only country that can compete technologically, and their debt position vis a vis the rest of world is favorable.",
        "created_utc": 1604251434,
        "id": "gat50uk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604280234.0
    },
    {
        "author": "AmazingConcept3",
        "body": "Hello, I am looking for some advice on a potential portfolio allocation that I am considering. I am a new college graduate looking to begin investing. Before I list out the portfolio I am considering, please see my answers to the relevant information questions:\n\n&amp;#x200B;\n\n* How old are you? **23**\n* Are you employed/making income? How much? **Yes, $110k/year salary**\n* What are your objectives with this money? (buy a house? Retirement savings?) **Potentially looking to go to business school in 2-5 years, but definitely looking to buy a house (in probably 5-10 years). Not sure how much of the returns from the market I will use on this vs. taking out a loan. So otherwise, I am looking for retirement savings**\n* What is your risk tolerance? (Do you mind risking it at blackjack or do you need to know its 100% safe?) **I've got a long time horizon so my tolerance is fairly high**\n* What are you current holdings? (Do you already have exposure to specific funds and sectors?) **None**\n* Any other assets? House paid off? Cars? Expensive significant other? **$20k in cash, plus I am looking to invest at least half of my salary this year since I am living with my parents and have no expenses.**\n* What is your time horizon? Do you need this money next month? Next 20yrs? **I am prepared to hold onto my investments up until retirement, though I MIGHT want to take some money out to pay for business school/house**\n* Any big debts? **None**\n* Any other relevant financial information will be useful to give you a proper answer. **None**\n\nThe allocation I am considering is:\n\nS&amp;P 500 - 30%\n\nVWIGX (Vanguard International Growth ETF) - 15%\n\nVDADX (Vanguard Dividend Appreciation ETF) - 15%\n\nQQQ (Tracks NASDAQ 100) - 20%\n\nWCLD (Bessemer Cloud Computing ETF) - 5%\n\nFINX (Fintech ETF) - 5%\n\nAAPL - 5%\n\nMSFT - 5%\n\n&amp;#x200B;\n\nI've got a few questions:\n\n1) given my goals and time horizons, is this too aggressive an allocation?\n\n2) am I missing any categories in which I should be diversified?\n\n3) for paying for business school ($200k-$250k if I decide to go) and buying a house down the line, does it make sense to liquidate some of what I will have in the market by then and take out a loan for the rest, or should I just leave it in the market and take out a loan for the full amount?\n\n&amp;#x200B;\n\nThank you!",
        "created_utc": 1604272400,
        "id": "gaub9e3",
        "score": 1,
        "subreddit": "investing",
        "created": 1604301200.0
    },
    {
        "author": "RedRiki24",
        "body": "Using MS Edge I see, $MSFT long 2022? lol",
        "created_utc": 1604285135,
        "id": "gauyd0h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604313935.0
    },
    {
        "author": "gonewildpapi",
        "body": "Microsoft is trying to compete but dynamics is nowhere near as polished",
        "created_utc": 1604288547,
        "id": "gav42or",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604317347.0
    },
    {
        "author": "thekingbun",
        "body": "I wouldn’t sell shop or Msft out of those",
        "created_utc": 1604288149,
        "id": "gav3fkq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604316949.0
    },
    {
        "author": "throughthevalley77",
        "body": "All the things I own is  red except for Apple , MSFT, SNOW, and NEE",
        "created_utc": 1604288526,
        "id": "gav41fs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604317326.0
    },
    {
        "author": "CallidusVulpes",
        "body": "Nvidia is a safe investment in the long run (they might go down a bit this month though due to AMD, but overall Nvidia has went up consistently over the past 5 years and has shown no signs of deviating significantly from that), Microsoft is safe, Tesla is too scary for me personally. I don't buy ETFs or evaluate them, I evaluate individual stocks then choose whether or not I would like to purchase them. I play for large short term gains (large relative to my investment portfolio and short meaning a few months typically). I've made a 17.49% profit in the past 2 weeks (starting with 2k) due to making \"all in\" bets on Corsair (to be clear to do this I was incredibly confident it was going to go up, but I definitely wouldn't advise it if you do not need the money, I have a stupidly low retirement target). Corsair was likely my most risky investment that's why I left quickly. AMD and TSMC are great investments for a couple of years, probably 3 years or more (TSMC almost definitely 3 years or more since they make the most powerful CPUs that go in the new Xbox, PS5, AMD CPUs, Apple CPUs, and they even have Intel waiting in line since their factories are all in use). You'll almost definitely hate my diversity, but I'm likely going to buy all AMD and TSMC (In my opinion diversity is for people who don't know much about the market they are invested in or don't feel like keeping up with the news). If I were to make a more long-term safer account I'd buy NVidia, Apple, AMD, and TSMC (Diversification in different sectors doesn't help if the entire market goes down, and I don't believe these specific tech stocks have exited a year down for the past decade (I know at least for the past 5 years they haven't), except for AMD which completely changed as a company). I'm putting all of my money on AMD and TSMC once the market opens tomorrow (I'd recommend stocking up ASAP on those stocks since they had a bad day on Friday). Apple will likely not see that much growth if any this quarter, but they'll be great for the long term. If you don't have the stomach or patience for seeing temporary losses then I would not recommend tech (Microsoft isn't too bad actually). I've sat on 200 USD losses (which is 10% of my portfolio) and went positive 145 USD the next day (that was my worst timed trade with Corsair). This probably looks very frantic, sorry, I'm a bit too excited.",
        "created_utc": 1604280086,
        "id": "gaupgm9",
        "score": 1,
        "subreddit": "investing",
        "created": 1604308886.0
    },
    {
        "author": "thatradsguy",
        "body": "Yeah for real, what do you even mean by this? MSFT doesn't need GME for online at all, I think it's a great deal to have their financing plan but it literally serves MSFT no benefit whatsoever to make an online component.  They already have full autonomy over their store and can discount whatever they want.",
        "created_utc": 1604269284,
        "id": "gau5arm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604298084.0
    },
    {
        "author": "UsernameTaken_123",
        "body": "Of course they're holding both Google, Apple and Microsoft 😂",
        "created_utc": 1604219995,
        "id": "garwpak",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604248795.0
    },
    {
        "author": "RepresentativeIcy922",
        "body": "20 years ago you say? Home Depot? according to Google, Home Depot (NYSE:HD) was $41.19 on Nov 3, 2000. Today it is $266.71, that is a more than 6x (600% ?) return  in 20 years, or an average of more than 30% a year, not even including dividends.   \n\n\nI still don't see how it would have been better if she had sold it and kept everything in cash. Of course she could have bought AAPL or MSFT or AMZN, but maybe she preferred to stay in her circle of competence.",
        "created_utc": 1604221796,
        "id": "garysbn",
        "score": 1,
        "subreddit": "investing",
        "created": 1604250596.0
    },
    {
        "author": "Dmoan",
        "body": "You don't buy a stock of a company which is not profitable and is facing life or death battle with big tech (Microsoft Teamd in this case).",
        "created_utc": 1604226650,
        "id": "gas4jka",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604255450.0
    },
    {
        "author": "coolcomfort123",
        "body": "yup, keep holding amzn and msft as covid play.",
        "created_utc": 1604242508,
        "id": "gasoy2i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604271308.0
    },
    {
        "author": "Dmoan",
        "body": "MSFT 2021 estimate is 30 pe which is pretty reasonable as they can likely beat it.",
        "created_utc": 1604247537,
        "id": "gasxrdu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604276337.0
    },
    {
        "author": "Dmoan",
        "body": "If things settle down come Wednesday I will stick to what works which is stay at home stocks that are priced reasonably. Apple, ATVI, MSFT, SNE, CHWY, SQ or PYPL, UPS would be my plays",
        "created_utc": 1604249675,
        "id": "gat1oyn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604278475.0
    },
    {
        "author": "Farrrrout",
        "body": "Msft is my next buy if it drops more",
        "created_utc": 1604253621,
        "id": "gat96l7",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1604282421.0
    },
    {
        "author": "peanutbutteryummmm",
        "body": "Buying when fearful works until it doesn’t. Try buying Microsoft pre .com bubble. Great company, but it still took a long time\nTo recover. There are always risks. DCA is a good strategy right now",
        "created_utc": 1604260837,
        "id": "gato5xn",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1604289637.0
    },
    {
        "author": "Chris-in-PNW",
        "body": "I absolutely would not buy MSFT at current valuations. But I'm also not inclined to sell any of my shares at the moment. While I don't disagree with your assessment of their products, their enduring appeal to enterprise in spite of those products is hard to ignore.\n\nI like AAPL much better, but I am neither increasing nor decreasing my position right now. \n\nI won't touch FB, because I don't trust Mark Zuckerberg's leadership ability.\n\nI avoid TSLA because I don't understand why it should be valued so much higher than other auto manufacturers who will ultimately be strong competitors in the sector. And I don't trust Elon Musk's leadership ability.",
        "created_utc": 1604220368,
        "id": "garx2bu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604249168.0
    },
    {
        "author": "RepresentativeIcy922",
        "body": "It's easy to see that Zoom is (was?) undervalued. People are having more meetings online because of covid-19, and a lot of them are using Zoom. It seems everywhere you look someone has an online meeting on Zoom. Schools that are closed have classes on Zoom.   \nZoom seems to be like the Microsoft of online meetings these days, it's the de-facto industry standard for online meetings. So on that basis alone, Zoom seems undervalued (at this point in time.) \n\nThey're more popular now than they ever were, and that potentially means more money, and that in turn means the price might go up.   \n\n\nThe thing about active trading is, well, that it's active. The fund managers try to figure out what will go up and buy it, and sell it before it drops. They're more momentum players than long-term holders, so I guess based on that alone they might buy Zoom (because everyone seems to be using it these days, and that can't be a bad thing as far as the price is concerned (for now anyway.)  \n\n\nThere was a lot of hype around Zoom, and when it appeared on a lot of people's radars it was a lot cheaper than it is now.  They would have likely bought in when they first started seeing all those ads for seminars on Zoom, and notices of schools being closed and having classes on Zoom.",
        "created_utc": 1604214954,
        "id": "garsd9o",
        "score": 1,
        "subreddit": "investing",
        "created": 1604243754.0
    },
    {
        "author": "Heim23",
        "body": "Time didn't move, just your dumb Microsoft Windows clock.",
        "created_utc": 1604224112,
        "id": "gas1k0l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604252912.0
    },
    {
        "author": "fyjx",
        "body": "COVID spurs cloud adoption and will continue to do so. The cloud adoption takes time for companies to take full advantage of it and thrive. That means you will see huge upside for cloud providers like MSFT and AMZN after 1 or 2 years.",
        "created_utc": 1604247747,
        "id": "gasy5f3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604276547.0
    },
    {
        "author": "MAndrewNg",
        "body": "Okay, thank you much! What are some of your growth stocks? The usual appl / fb / msft?",
        "created_utc": 1604250771,
        "id": "gat3qzu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604279571.0
    },
    {
        "author": "coolcomfort123",
        "body": "msft, aapl, and amzn.",
        "created_utc": 1604242628,
        "id": "gasp4yt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604271428.0
    },
    {
        "author": "FluffyTheWonderHorse",
        "body": "My portfolio is mostly Tesla, Microsoft and AMD but was looking at buying more dividend stocks next year.\n\nI pay a stupid amount of money into my Prudential Life insurance that I'd now rather be investing (10% of my yearly income) which I'll get back at about a 1% return :(\n\nQuestion is: would investing in Prudential be a bad idea due to the fact I'm putting me net into them anyway?\n\nIt's currently a 6-7% dividend payout.",
        "created_utc": 1604271157,
        "id": "gau8vfu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604299957.0
    },
    {
        "author": "OriginallyWhat",
        "body": "\"The market\" in general, you're totally right. But if the Google ceo tells you that they're buying out Microsoft next month, there's a solid chance the price will go up when the news comes out.\n\nNot trying to say you're wrong or argue, because 99% you're correct. Just wanted to point out one of the few exceptions.",
        "created_utc": 1604280859,
        "id": "gauqtfy",
        "score": 1,
        "subreddit": "investing",
        "created": 1604309659.0
    },
    {
        "author": "PowerOfExponents",
        "body": "A quarter of QQQ is literally blue chip tech a la apple and Microsoft",
        "created_utc": 1604283447,
        "id": "gauvex2",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1604312247.0
    },
    {
        "author": "insanegreek2020",
        "body": "It’s all about liquidity. You want to be able to get in and out quick with options with minimal bid/ask spreads. Any big tech is good. Google for some reason has shitty options imo. There’s not much volume on any given day. Aapl msft fb spy the best",
        "created_utc": 1604238192,
        "id": "gasiapy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604266992.0
    },
    {
        "author": "astearns31",
        "body": "You seriously think it’s the best run company? Match  it’s total return to say the S&amp;P or an actual well run company like Danaher/Microsoft/SPGI.",
        "created_utc": 1604240160,
        "id": "gaslb39",
        "score": 1,
        "subreddit": "investing",
        "created": 1604268960.0
    },
    {
        "author": "Lord_Stinkler",
        "body": "Opened a Roth a year ago and MSFT, AAPL, AQN, BMO and AMD are my  recommendations for single stock. \n\nWith a Roth you planning on leaving in for a while so the rest I put into ETFs and mutual funds and they do solid over long term (5+ years). ETFs I like are VIG SCHX and ESPO (covid has ESPO booming prior to the past week). Mutual Funds I like mainly is PRDGX and any S&amp;P 500 fund.",
        "created_utc": 1604218483,
        "id": "garvfay",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604247283.0
    },
    {
        "author": "jacektrocinski",
        "body": "The big short is $SNOW, they're trying to compete with Oracle, Microsoft and Amazon in the database space, they're going to get crushed.",
        "created_utc": 1604215335,
        "id": "garsp81",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604244135.0
    },
    {
        "author": "StarWolf478",
        "body": "The big two for me are:\n\nNetflix - The Q2 lockdown was the absolute most perfect condition imaginable for Netflix's business and anybody that had any interest in Netflix should have already subscribed by that point in time. I think that there now has to be some significant growth slowdown after such perfect business conditions start to come to an end. Plus, more and more competitors are entering the market to compete for Netflix's subscribers while also pulling their content from Netflix which forces Netflix to spend more money to develop their own content. All of that makes me think that Netflix cannot maintain the high growth that they have had thus far and if they can't maintain that growth then investors will eventually start to abandon them. I'm still bullish on streaming though, so I've invested in Roku instead as my streaming stock since they are the \"picks and shovels seller\" for the \"streaming gold rush\" and unlike Netflix, they benefit from the increased competition entering the streaming market.\n\nGoogle - They have started to remind me of Microsoft during the Steve Ballmer era. When was the last time that Google successfully executed upon a great new product and didn't ultimately send it to ever growing [Google Graveyard](https://killedbygoogle.com/)? I think that it has been about a decade and they have just been living off of their successes from over a decade ago since then. Maybe Google will eventually get new management that revitalizes the company like Microsoft eventually got after Nadella became CEO, but for the foreseeable future, I've lost confidence in them, so I'm out. I've replaced them with Pinterest in my portfolio as my new search/advertising stock. Social search is the future and I now see the genius advertising potential of the Pinterest platform; I see them stealing advertising dollars away from Google and growing much better than Google over the next 5 years.",
        "created_utc": 1604217818,
        "id": "garuvnr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604246618.0
    },
    {
        "author": "Phantomoftheopoohra",
        "body": "So don't tell my wife I told you guys this because she is gonna be pissed. \n\nI come home from working over night shift. Wife is all excited. She tells me she bought 100 shares of TSLA. She is totally risk averse. Prior to buying TSLA she was in full boomer stock mode. PCG, F, GE, UPS and the majority in conservative Vanguard funds. I swear to God nothing gets her going more than a dividend. My first thought when she told me she just dropped nearly 50k on TSLA was holy shit I need to get some fucking puts on that right now. Needless to say it was August 31st. Didn't but the puts...she gets pissed anytime I even mention TSLA. I bought some in the mid 300s. Told her I was cost averaging down on it for us. We have separate finances for most things. Told her about the money I lost on MSFT and AAPL options to make her feel better. Didn't work. Said that it made her more pissed. \n\nTLDR wife holding TSLA bags, gets pissed everytime TSLA comes up.",
        "created_utc": 1604223113,
        "id": "gas0f2r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604251913.0
    },
    {
        "author": "MementoMori97",
        "body": "The total market index is still about 25% tech so it would make sense that this helps bring the value up to where it is now. Looking at ITOT (ishares total market etf) about 19% or so is in Microsoft, Apple, Amazon Facebook and Google, so these would definitely help elevate the total index value.\n\nEdit: ITOT also only fell about 1% friday when most of those stocks were down about 5%, so there is a buffer there.",
        "created_utc": 1604246748,
        "id": "gaswc35",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604275548.0
    },
    {
        "author": "Jansboobjob",
        "body": "Same, TSLA and MSFT doing me dirty these days",
        "created_utc": 1604245336,
        "id": "gastse6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604274136.0
    },
    {
        "author": "thewimsey",
        "body": "MSFT wasn't  a computer company. It was a software company. IBM was a computer company.\n\nThe brilliance of MSFT was in - and this seems weird today - realizing that a company could make money just selling software. A ton of money. More money than computer makers could make by themselves. This was a kind of radical idea at the time.\n\nJobs was very successful at the computer business; the Apple was the bestselling PC from 1977-1982.\n\nApple wasn't killed by MSFT, it was killed by IBM, which built a PC from more or less off the shelf parts allowing *anyone* to build a clone. (Which, incidentally, would run windows). \n\nApple's computers couldn't compete with PCs built with off the shelf parts. It's not about Jobs being bad; it's about other people being better.\n\nIBM's approach almost immediately priced *them* out of the PC market, leaving the profits to MSFT and intel (and a tiny bit for clone makers, who mostly ended up in a low margin commodity business).",
        "created_utc": 1604280445,
        "id": "gauq3df",
        "score": 1,
        "subreddit": "investing",
        "created": 1604309245.0
    },
    {
        "author": "t777m",
        "body": "That was a great read. Very insightful.\n\nDid some more research into TSM and am definitely considering investing.\n\nI’ve asked around and have decided to completely reorganise. I got rid of the FAANG companies, Microsoft, Tesla and the emerging markets etf. I then added QQQ as it includes a lot of the big companies i already listed. And also added TSM.\n\nJust playing around with the percentages now, to see what gets the best projection",
        "created_utc": 1604283430,
        "id": "gauvdu7",
        "score": 1,
        "subreddit": "investing",
        "created": 1604312230.0
    },
    {
        "author": "pickbot",
        "body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**MSFT**|**$210**|**BUY CALL**|**2020-11-13**|**$3.33**|**$202.47**|**3509**|**1677**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckgzhoa63hn6u071765062aa9) | [Track Record](https://www.pickmojo.com/user/Trappin-Shoes/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**",
        "created_utc": 1604257802,
        "id": "gathtrd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604286602.0
    },
    {
        "author": "Amurphy747",
        "body": "Guys hear me out...what if because everybody expects the election to be a complete shitshow, and once it’s over the market is big green cause of all the money on the sidelines waiting to get back in and they realize the world isn’t really on the verge of civil war like everyone thinks every election year. Just look at the fact that this week travel stocks got fucked like tech stocks. That’s not because of corona. Apple and amazon after good earnings report got fucked, same for Microsoft. People are limiting exposure to the market as a whole and just waiting to get back in the stock and don’t want to get fucked by the election and corona news, but decided now wasn’t the time. When it is the time, the trend will reverse hard. Apple was down 6% after a good earnings report and amazon was 5.5%.",
        "created_utc": 1604236038,
        "id": "gasf6vx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604264838.0
    },
    {
        "author": "Kay312010",
        "body": "I bought more MSFT and APPL on the big dip Wednesday and Friday. If DPZ dips, I’ll probably pile on since COVID orders and deliveries continues to look good across the globe for them.",
        "created_utc": 1604258200,
        "id": "gatinq1",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1604287000.0
    },
    {
        "author": "Henkss",
        "body": "Thing is big tech will always thrive. Look at their earnings, revenue, pile of cash on Balance sheet. Little to no debt..\n\nUntil a new disruptive technology emerges (in what form we do not know) - whatever big comes out of internet/robotics/AI space/Data, big tech will absorb it right away. It's all about data. Something interesting will emerge, and it will be bought right away. Why do you think these companies have more cash than most countries combined.\n\nSure they can go lower in the short run but what do you think is going to happen a year from now.\n\nDo we think MSFT adding 8-10% rev growth on a 40bn revenue company will be $100 per share? Kingpin Bezos? Daddy Cook? Zuck?\n\nIf big tech was supposed to go down, they should have been broken apart already. It is too late now. Only thing that can disrupt is a complete new technology - the way green tech reshaping energy industry.",
        "created_utc": 1604251681,
        "id": "gat5hr4",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1604280481.0
    },
    {
        "author": "Dmoan",
        "body": "Sitting in at about 40% cash: CHWY, SQ, MSFT, UPS, CHGG, AMD, ATVI, MDLZ, SNE, GOLD are main holdings. Let’s see how this week turns out",
        "created_utc": 1604269660,
        "id": "gau60xx",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1604298460.0
    },
    {
        "author": "CurveAhead69",
        "body": "So...what’s stopping msft utilizing gme (and their agreement), stepping up into online gaming via gme, using msft cloud, selling Xbox with credit for said cloud (or with a discount) through gme?\n  \n🌝?\n  \nEdit: thanks for the award kind stranger - pays to ask questions.",
        "created_utc": 1604268932,
        "id": "gau4m9q",
        "score": -2,
        "subreddit": "wallstreetbets",
        "created": 1604297732.0
    },
    {
        "author": "TheKnightIsForPlebs",
        "body": "Tl;dr this is good for micron",
        "created_utc": 1604267853,
        "id": "gau2iw1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604296653.0
    }
]