[
    {
        "author": "SiaCurious",
        "body": "Be me, try to sell your TWO calls for that sweet ~50% gains\n\nPage isn't loading fast enough, F5, click click, don't check whether you're buying or selling, end up buying another 20 contracts.\n\nThe light and glory of our Lord Jerome was flowing through me",
        "created_utc": 1591654622,
        "id": "fteyrm2",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591683422.0
    },
    {
        "author": "2gurleys1kupp",
        "body": "f5",
        "created_utc": 1593131270,
        "id": "fw0gkf3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593160070.0
    },
    {
        "author": "verto0912",
        "body": "Crowdstrike, Palo Alto Networks, Okta, Splunk, etc.\n\nI live in Australia and there's a Cybersecurity ETF here - I'm sure there are a couple in the US too. Anyhow, here are the top 10 holdings for it.\n\nCrowdstrike - 8.5%\n\nSplunk - 6.3%\n\nPalo Alto - 6.3%\n\nCisco - 5.8%\n\nBroadcom - 5.7%\n\nZscaler - 5.2%\n\nOkta - 3.8%\n\nFortinet - 3.4%\n\nF5 Networks - 3.0%\n\nAkamai - 3.0%",
        "created_utc": 1592356664,
        "id": "fv2rtop",
        "score": 2,
        "subreddit": "stocks",
        "created": 1592385464.0
    },
    {
        "author": "WittsandGrit",
        "body": "Just spent 10 minutes spamming F5 and upvoting every comment. The amount of energy that takes leads me to believe that this downvoter has lost the entire nut and didn't even save enough for ROPE.",
        "created_utc": 1593470993,
        "id": "fwf111i",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593499793.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "might hold CRWD 90c thru EOW given Bofa conf on June 4.\n\nNVDA presenting on that day too.\n\nother noteworthy tech shit is prob WDC, ESTC, UBER (CEO will keynote but i doubt he'll say anything that'll move the stock), WDAY, FFIV",
        "created_utc": 1591133771,
        "id": "fsoh6qw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591162571.0
    },
    {
        "author": "RayCashIsTrashDalio",
        "body": "WLL already filed for bankruptcy. You're part of the massive RH crowd buying a bankrupt company. Not to say they won't run any higher, but they literally declared and filed for bankruptcy like 1-2 months ago. It's literally just being pumped by retail buying bankrupt stocks. https://www.bloomberg.com/news/articles/2020-06-08/retail-traders-flout-legal-logic-in-dash-for-bankrupt-stocks?srnd=premium F5 and spam ESC to remove the premium popup",
        "created_utc": 1591685921,
        "id": "ftgbwu8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591714721.0
    },
    {
        "author": "The_Alternate_1",
        "body": "If you go to Yahoo Finance and F5 enough you can get real time data/candles. Unfortunately volume doesn't track, but you can add volume indicators.",
        "created_utc": 1591977540,
        "id": "fulybth",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592006340.0
    },
    {
        "author": "weedgang420",
        "body": "f5 gang wya",
        "created_utc": 1591988448,
        "id": "fumm0jm",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592017248.0
    },
    {
        "author": "chirping_birds",
        "body": "I keep hitting F5 here:\n\nhttps://www.marketwatch.com/investing/stock/gnus  \n I need to go outside.",
        "created_utc": 1592225128,
        "id": "fuwa4gn",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592253928.0
    },
    {
        "author": "Moon2MOONs",
        "body": "\"f5 f5 f5 f5 f5 f5 f5 f5 f5 f5\"",
        "created_utc": 1591819632,
        "id": "ftmbuwl",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591848432.0
    },
    {
        "author": "someguytwo",
        "body": "Actually cloudflare is 80% of my portfolio. They have a lot more than just a CDN, their tech is awesome and I can see them eating F5's lunch.",
        "created_utc": 1592516926,
        "id": "fv9wzla",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592545726.0
    },
    {
        "author": "Moon2MOONs",
        "body": "I miss the days when I would \"f5\" all day at work while I read over 1 million comments a day. It used to be sofa king exciting lol.. now we get to read 200 comments (if we are lucky)",
        "created_utc": 1591301829,
        "id": "fswbp22",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591330629.0
    },
    {
        "author": "muzakx",
        "body": "Just F5 on that shit all day.",
        "created_utc": 1591752033,
        "id": "ftjf5c6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591780833.0
    },
    {
        "author": "Electronic-Donkey",
        "body": "Not for me. If the Trade screen isn't loading, press refresh (F5) every couple seconds til it does.",
        "created_utc": 1591194028,
        "id": "fsqzdki",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1591222828.0
    },
    {
        "author": "EggersIsland",
        "body": "F5-ing for the same answer.",
        "created_utc": 1591122157,
        "id": "fsnsgs2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591150957.0
    },
    {
        "author": "dirovame",
        "body": "Same here.  My F5 button asked for a break",
        "created_utc": 1592585947,
        "id": "fvcrfo9",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592614747.0
    },
    {
        "author": "Dstrat33",
        "body": " [https://i.pinimg.com/originals/66/f5/88/66f5880453d5344208b2b34c6ab12d1e.gif](https://i.pinimg.com/originals/66/f5/88/66f5880453d5344208b2b34c6ab12d1e.gif)",
        "created_utc": 1592878027,
        "id": "fvp9mxk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592906827.0
    },
    {
        "author": "pereira_alex",
        "body": "[computer says no....](https://i.pinimg.com/originals/f5/16/49/f51649c3de47d44dec942d5c0f2ad3b5.gif)",
        "created_utc": 1591033994,
        "id": "fsjpywr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591062794.0
    },
    {
        "author": "tmlangen",
        "body": "F5",
        "created_utc": 1592169471,
        "id": "fuu4xfw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592198271.0
    },
    {
        "author": "lloydgross24",
        "body": "waiting for earnings. F5 F5 F5... Anyone else all about this?",
        "created_utc": 1592337686,
        "id": "fv1rjzp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592366486.0
    },
    {
        "author": "kumquatdumpster",
        "body": "Its dumb how excited i get to hit f5.",
        "created_utc": 1592769306,
        "id": "fvkfxr8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592798106.0
    },
    {
        "author": "2gurleys1kupp",
        "body": "knight to f5",
        "created_utc": 1593390703,
        "id": "fwbir1c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593419503.0
    },
    {
        "author": "Fear_Jaire",
        "body": "F5",
        "created_utc": 1592918487,
        "id": "fvqocue",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592947287.0
    },
    {
        "author": "Uda880",
        "body": "Jesus christ people. I'm in AKAM, and sold off FSLY and F5. But yes, thanks.",
        "created_utc": 1592258476,
        "id": "fuy4na6",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1592287276.0
    },
    {
        "author": "831sweatyfeet",
        "body": "Mixed conservative bag right now. I went easy knowing I have money on the sidelines that I’ve been waiting to get my hands on. Should be here next week. \nPutting 80% into the market wherever I see value, without over extending risk. \n\nMo pm bac brk.b jpm\n\nAdding next week and looking at forward thinking stuff like lulu ulta dpz gpn ma v. Probably add some conservative tech like txn intc etc. not looking to make any outsized gains but to hold. Might use some cash to say trade and keeping 10-20% in cash to buy any kind of dips",
        "created_utc": 1591390969,
        "id": "ft0hqgg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591419769.0
    },
    {
        "author": "millerlit",
        "body": "aapl,msft,googl,gpn,v,ma,dis,ba,nvda,amd,amzn",
        "created_utc": 1591562741,
        "id": "ftaweta",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591591541.0
    },
    {
        "author": "w1na",
        "body": "She did a good job, no one could even imagine even 5 years ago where AMD would be today.\nWhen she took office, the cupboard were bare, there was no sales, no good architecture, losing for 2 decade to intel. Since the first athlon x64, they kept releasing bad products most of the time. In just 3 years, she made AMD go from Zero to Hero!\n\nAMD now trading at tremendous numbers, no one thought would be possible ever. Heck just look 7 years back, the share price was about 2 bucks.\n\nIf there is any CEO who you feel should earn so much, it’s not people from Moderna, but Lisa Su.\n\nJust to give you an idea, back in 2014 or so, I remember trying to buy AMD shares under 2 euros each (I wanted to get 2000 euro), before the order went through, it asked me for some paperwork confirmation, I then did not go through with the order and never did.\n\nMissed on 1000 shares from AMD. I did not believe back then, although I saw it was incredibly cheap.",
        "created_utc": 1591071652,
        "id": "fslovb3",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591100452.0
    },
    {
        "author": "kontekisuto",
        "body": "Linux recommends AMD over Intel, that's all I need to know.",
        "created_utc": 1591070661,
        "id": "fslncru",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591099461.0
    },
    {
        "author": "rasuzuki",
        "body": "She fucking deserves it tho, look at AMD! Just ass fucking Intel for 3 years straight",
        "created_utc": 1591066371,
        "id": "fslgasz",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591095171.0
    },
    {
        "author": "mechtech",
        "body": "Well this is /r/investing, so buy quality and hold, diversify (beyond just bonds which may or may not have a good future in a zero rate world), and have worldwide exposure/don't arbitrarily lock yourself to your own country.\n\nI actively trade, but in all likelihood in 2040 the investors at the top will likely have stories like \"As Waymo got bigger, my ETF kept buying more, and now Waymo is 10 trillion dollars. And as that Chinese electric car company grew and took 1/3 of the 1 billion person Chinese market, my ETF kept buying more on the way up.\"\n\nAlthough in that same vein, getting ahead of the tech curve might be one of the few ways for someone outside of the professional investor/institutional world to realistically get ahead. The trick is having the fortitude to hold for 1-2 decades. The financial crisis in '08 blew me out of so many hilariously good positions, like SBAC because the iPhone was just invented and 3G means more cell phone towers... It's not always rocket science. Anyone with some specialized insight into the future, whatever it may be, should consider putting a small well thought out speculative position on and leave it be. Small enough to not hurt if it goes nowhere, but big enough to care enough to check up and manage every few months.\n\nWow, just looked up an email from over 10 years ago. These names are probably in the mainstream investing language now, but wow... 10-100x if they were held. And it wasn't complex quant investing or anything, just looking ahead, positioning, and waiting.\n\nQuotes from the email circa 10 years ago: \"NVDA... They are also making a leap into scientific computing, where there's a lot of money to be made. They're the first major player to enter that arena to fight Intel and AMD in a long time, and their architecture is much more suited to scientific computing than the traditional CPUs that currently rule the top 100 supercomputer list. I think I'll see how that works out before selling NVDA\"\n\n\"I might want to put some money in AMD as well. They're here to stay and may still be undervalued...\"\n\n\"Universal Display Corp and LG Display (PANL/LPL) are also the leaders and partners in OLED screen development, which is bound to catch on eventually. Lower power use and much better image quality mean that it's just a matter of time before more devices adopt this new display technology and it becomes a new standard. I actually expect Apple to eventually partner up with LG (I think LG is their main LCD supplier) and use and use an OLED display on either a new product or a new Iphone version, which will kick OLED production into overdrive.\"\n\nFood for thought... MicroLED is likely going to grow 1000x over the coming decades. AR and LIDAR sensors for AR will probably not just be used for face unlock and will get some killer apps, the next Snapchat or TikTok might be AR based. Self-Driving is going to be powered by thousands of companies, not just NVIDIA and Waymo. Quantum computing? AI providers in the military contracting space? Clean cargo ship tech to get in front of green regulations? It's endless, and so many people know about these little niches of information that very few others do. Even mundane spaces see world changing innovation every day. Getting in front of a curve is inherently speculative but it is also entertaining, educational to follow through development, and can be extremely profitable.\n\nThat's my appeal for pulling a few pennies out of the ETF pile and doing some a little different, especially if you have a \"wheelhouse\" that you know a little bit more about.",
        "created_utc": 1591160039,
        "id": "fsprhaz",
        "score": 9,
        "subreddit": "investing",
        "created": 1591188839.0
    },
    {
        "author": "WSBankrupt",
        "body": "5G is going to be pushed hard.  I've done a fair bit of research on tickers that are worthwhile if it blows up as much as I think it will.  The implementation of these mesh networks could be huge for many companies.\n\nNetwork Implementation - NOK and ERIC (Would grab NOK asap)\n\nBase Station Chipsets - MRVL\n\nPhone Semis - QCOM\n\nIndustrial + Vehicle Semis - NXPI\n\nShared Comms Infrastructure - AMT\n\nMulti Discipline - INTC\n\n&amp;#x200B;\n\nI hold positions (leaps or stonks in almost all of the above)",
        "created_utc": 1591055320,
        "id": "fskwp03",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591084120.0
    },
    {
        "author": "TheMailmanic",
        "body": "I can't believe it.  I used to exclusively buy AMD computers back in the 90s because fuck Intel.   Then Intel pulled ahead and it looked like AMD was going down the drain.  Can't believe I lost my faith",
        "created_utc": 1591071010,
        "id": "fslnw2y",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591099810.0
    },
    {
        "author": "necrophrenic",
        "body": "Looks like INTC is gonna ride back up if AMD does, so I approve this message.",
        "created_utc": 1591117830,
        "id": "fsnjanh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591146630.0
    },
    {
        "author": "TripleBrain",
        "body": "Now why the fuck exactly would any company that’s not the size of intel, Apple, ibm etc need 150 hosts??? You know the point of a host right? It’s to host a meeting. You really think anyone will need to host 150 meetings in the same time frame? Hell no.\n\nAnd aside from that, you know these are not gonna be large companies because they won’t be categorizing it as “companies with 10+” employees. That’s like using inches to measure a mile. \nI’d bet a majority of those companies have under 10 hosts.",
        "created_utc": 1591158971,
        "id": "fsppy0c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591187771.0
    },
    {
        "author": "p_giggles",
        "body": "I'd say that because companies which are heavily shorted are often smaller companies, there isn't a lot of other (non-financial) recognition. So if people can't find much besides a \"short the shit out of this company\" report, it might be more important for management to attempt to keep the stock afloat, whether it's in their own self interest or not.\n\nIf you try to short Intel it's a bit of a different story considering there are 40 analysts covering it and an ungodly amount of brand recognition. If one analyst comes out with a short and 39 say Intel is fine, it's unlikely the short piece actually does anything. But if you have three analysts covering you, which is very common for small-cap companies, one short piece can actually fuck your shit up. \n\nAlso since companies often use their equity as collateral for a loan, the higher stock price could afford more reasonable loan terms, which could help the company's actual business.",
        "created_utc": 1591061591,
        "id": "fsl7zvc",
        "score": 2,
        "subreddit": "SecurityAnalysis",
        "created": 1591090391.0
    },
    {
        "author": "peon72",
        "body": "ARM is the Linux of the CPU world. The plebs out here thinking that Intel and AMD are a big deal meanwhile literally every machine that isn't a desktop computer is running an ARM processor.",
        "created_utc": 1591126729,
        "id": "fso28ck",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591155529.0
    },
    {
        "author": "BF5lagsssss",
        "body": "AMD greatest ever. Their semiconductor business is excellent they beat Intel. For one stage Intel dominated 70 percent of the processor market and now the Ryzen processors have basically contributed to more sales tha Intel. Now AMD is now a dominant player due to the popularity of the Ryzen and maybe the Radeon GPU.",
        "created_utc": 1591072682,
        "id": "fslqeqf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591101482.0
    },
    {
        "author": "somanychins",
        "body": "Can anyone explain INTC to me? They trade at a multiple of 12 with a 2% div yield, meanwhile almost everything is 24+ in tech. I know they're mature and have competition, but what gives?",
        "created_utc": 1591028003,
        "id": "fsjdqb9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591056803.0
    },
    {
        "author": "Lil_Musket",
        "body": "Thats the relationship amd and intel have. Its always been a constant battle. I can't remember the exact details but intel has used shady political tactics to dick down amd before",
        "created_utc": 1591085669,
        "id": "fsm6spf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591114469.0
    },
    {
        "author": "ThroneTrader",
        "body": "What? 20 years? You're just gonna gloss over the athlon xp and athlon 64? Those were chips that kicked Intel's ass I'm the desktop space, especially as Intel tried to milk the netburst architecture for every Hz it could give them. That was early 2000s. \n\nIt wasn't till Intel rolled out the core 2 duo that they took back the crown.",
        "created_utc": 1591082231,
        "id": "fsm2ymc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591111031.0
    },
    {
        "author": "A_Simple_Simpleton",
        "body": "Well it's believable cause amd was truly a big pile of doodoo. I bought amd cause I was a poor high schooler but it was obviously under performing Intel",
        "created_utc": 1591102377,
        "id": "fsmpmaa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591131177.0
    },
    {
        "author": "boon4376",
        "body": "When Jim Keller goes to work somewhere, you know that in 2-3 years that company will be cranking out new game changing products. Apple / AMD / Tesla.\n\nJim joined Intel in 2018 after leaving Tesla. Presumably to help Intel get their shit together. I'd anticipate we'll see Intel come roaring back starting in 2021.\n\nJim coordinates chip makers into a well oiled machine. \n\nHopefully AMD's architecture and practices that Jim left in place have legs to keep up with whatever Intel develops.",
        "created_utc": 1591103731,
        "id": "fsmrq4a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591132531.0
    },
    {
        "author": "somanychins",
        "body": "I have Stockholm syndrome with INTC, I just can't stop buying it, and it just keeps abusing me.",
        "created_utc": 1591117304,
        "id": "fsni6p8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591146104.0
    },
    {
        "author": "GamblingMikkee",
        "body": "XOM, MMM, RTX, MCD, FDX, INTC, CVX, CVS, MO",
        "created_utc": 1591179733,
        "id": "fsqelfi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591208533.0
    },
    {
        "author": "rp_whybother",
        "body": "Pentium IV was a dog. Intel really lost it with that. worse performance then P3. Things only came good with core 2. I remember working on quite a few P IV and just thinking what's going on here, so slow.",
        "created_utc": 1591100715,
        "id": "fsmn8jh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591129515.0
    },
    {
        "author": "somanychins",
        "body": "BABA, EWH, INTC, PFE, TWTR long calls\nMSFT, BRKB, CVX, EURN, FDX, EWH, INTC, LAZ, PEP, PFE, PTON, UPS, XOM shares\nMSFT short calls",
        "created_utc": 1591128122,
        "id": "fso59is",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156922.0
    },
    {
        "author": "gaysaucemage",
        "body": "AMD has been kicking their ass for about 2 years while Intel has been stuck on 14nm process since 2014.",
        "created_utc": 1591028325,
        "id": "fsjedd6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591057125.0
    },
    {
        "author": "cranial_pudding",
        "body": "I think there's money to be made on INTC short term, there's some weird call activity all the way up to 70, I just wouldn't expect it to meme out like some of these other tech stocks\n\nIf you're playing in this sector right now, QCOM has some wild activity on 85c 6/12",
        "created_utc": 1591028595,
        "id": "fsjewrx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591057395.0
    },
    {
        "author": "JimC29",
        "body": "EPD since 04. INTC since 09. MO since last year. PM since November of 18. With dividends I'm  about even on PM and  on MO. They were both limit orders I had for a while I never expected to get that low.",
        "created_utc": 1591041714,
        "id": "fsk607u",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1591070514.0
    },
    {
        "author": "nemoTheKid",
        "body": "&gt; Now why the fuck exactly would any company that’s not the size of intel, Apple, ibm etc need 150 hosts??? \n\nThere are plenty of enterprise SaaS companies that have more than 150 sales people that aren't anywhere near the size of IBM, much less Apple. If every sales guy can host a Zoom call to talk to a prospective client, that's a host right there.\n\nWhy would you assume Zoom hosts are only for people internal to the company?",
        "created_utc": 1591166544,
        "id": "fsq016a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591195344.0
    },
    {
        "author": "jxxc7",
        "body": "Intel",
        "created_utc": 1591124398,
        "id": "fsnx9wc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591153198.0
    },
    {
        "author": "reddituseranyonymous",
        "body": "Im stuck at work...everything 2002. AMGN, INTC GE\n\nRegret not buyjng\nSBUX circa 1996\nAcre with 100ft of shore on a SW Florida barrier island near Ft Myers $5000 Fall 1999",
        "created_utc": 1591125094,
        "id": "fsnyr2q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591153894.0
    },
    {
        "author": "necrophrenic",
        "body": "Intel dropping off a cliff too. Be nice to the chip makers this week pls.",
        "created_utc": 1591109275,
        "id": "fsn1p53",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591138075.0
    },
    {
        "author": "firefoxx04",
        "body": "&gt;Linux recommends AMD over Intel, that's all I need to know.\n\nYeah I bet you have not heard of cloud huh? Where important workloads run. Even Azure is mostly Linux.",
        "created_utc": 1591114014,
        "id": "fsnbbiv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591142814.0
    },
    {
        "author": "duckbill_principate",
        "body": "$62B are you fucking shitting me. Did we time travel to 1999?\n\n\nBA and 3M and UPS: 90\nBP and Blackrock and AXP: 83\nSNE and BUD: 80\nUN and CI and INTU: 75\nIntel: 72\nTrendy video conferencing: 62\n\n\nFucking hell.",
        "created_utc": 1591195842,
        "id": "fsr2ys8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591224642.0
    },
    {
        "author": "learningis1st",
        "body": "FXAIX - 24%\n\nCSIQ - 23%\n\nTSM - 6%\n\nGILD - 6%\n\nINTC - 4%\n\nCTXS - 2%\n\nSTX - 2%\n\nTER - 2%\n\nLOGM - 2%\n\nDBX - 2%\n\nABBV - 1%\n\n...",
        "created_utc": 1591081909,
        "id": "fsm2l4k",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591110709.0
    },
    {
        "author": "cranial_pudding",
        "body": "That makes sense, INTC has some unusual call activity too but nothing like QCOM",
        "created_utc": 1591026364,
        "id": "fsjagae",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591055164.0
    },
    {
        "author": "Chucklate-LeClaire",
        "body": "Their new budget chip line + high end consumer is going to decimate Intel this cycle",
        "created_utc": 1591098252,
        "id": "fsmk2hp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591127052.0
    },
    {
        "author": "krische",
        "body": "&gt; It wasn't till Intel rolled out the core 2 duo that they took back the crown.\n\nAnd that was based on a design they stole from the University of Wisconsin: https://www.engadget.com/2008-02-07-intel-sued-for-core-2-duo-patent-infringement-by-the-universi.html",
        "created_utc": 1591116422,
        "id": "fsngbtz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591145222.0
    },
    {
        "author": "ixamnis",
        "body": "HUM (Humana):  9.7 Equity Score Summary; Valuation Score: 95 (Undervalued); (S&amp;P Global Market Intelligence); short term outlook is weak (less than 6 weeks) but long term outlook is strong.\n\nSFM (Sprouts Farmer's Market): 9.5 Equity Score Summary; Valuation: 80 (Undervalued)\n\nSPGI (S &amp; P Global, Inc); 9.7 Equity Score Summary; Valuation: 82 (Undervalued)\n\nINTC (Intel Corp); 9.9 Equity Score Summary; Valuation: 94 (Undervalued)\n\nCPB (Campbell's Soup); 9.1 Equity Score; Valuation: 71 (Undervalued)\n\nThere are plenty of blue chips out there (and small and mid-cap stocks) that are still a good value, but they don't always get a lot of attention.\n\n&amp;#x200B;\n\n(All intel is from Fidelity; I own shares in SFM and INTC)",
        "created_utc": 1591105675,
        "id": "fsmuzny",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591134475.0
    },
    {
        "author": "Deus_ex69",
        "body": "I won't argue if she deserved it or not, but the fact is AMD still struggles making profit compared to Intel or Nvidia. Even Micron makes in two weeks more then AMD makes in a year and AMD market cap is bigger. Makes you wonder if AMD isn't heavily overvalued atm.",
        "created_utc": 1591129717,
        "id": "fso8out",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591158517.0
    },
    {
        "author": "damianwrx",
        "body": "Thanks for the excellent value Ryzen CPUs! Rocking one in my rig after using intel all my life",
        "created_utc": 1591131303,
        "id": "fsoc1uz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591160103.0
    },
    {
        "author": "azwel",
        "body": "i see they own  \n\n* Microsoft Corporation 18.51%\n* Apple Inc.\n* Visa Inc. Class A 4.15%\n* Intel Corporation 3.81%\n* Mastercard Incorporated Class A 3.51%\n* Cisco Systems, Inc.\n* Adobe Inc.\n* NVIDIA Corporation 2.48\n\nI Have a lot of those.  A couple like cisco  adobe, nvidia, i dont have.  I could either buy those few,  or just this etf..",
        "created_utc": 1591126310,
        "id": "fso1bpq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591155110.0
    },
    {
        "author": "Jay_x_Playboy",
        "body": "Intel just released their new stuff that crushes AMD’s current lineup. Not a great time to buy IMO",
        "created_utc": 1591178728,
        "id": "fsqdipk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591207528.0
    },
    {
        "author": "Bwesson",
        "body": "Semi conductors ETF like SMH and SOXX hold em all !! Qualcomm, Nvidia, Intel, AMD, etc.",
        "created_utc": 1591194556,
        "id": "fsr0ek0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591223356.0
    },
    {
        "author": "Shaun80",
        "body": "Some sectors are booming because of the pandemic and have huge growth potential when we emerge into our new normal post pandemic. This is especially true for technology allowing remote entertainment, medicine , commerce, payment and communication.  Netflix, E-commerce (Amazon,Shop) , Zoom video conferencing, cloud computing  (MSFT, Veev, Crm,fsly) , AI robotics (NVIDiA ,TSLA,TWLO, GOOG), 5G technology, semiconductors (AMD,TSM, QCOM, INTC) fintech (Square, Paypal, MA ,V), telemedicine (TDOC)   Brick and mortar retailers,oil , resources , REITs, financial sector will all take a hit when the economy opens to the new normal.",
        "created_utc": 1591154675,
        "id": "fspj7rc",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1591183475.0
    }
]