[
    {
        "author": "galra001",
        "body": "ANET",
        "created_utc": 1604691318,
        "id": "gbdm7sq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604720118.0
    },
    {
        "author": "ItsDokk",
        "body": "Take this with a grain of salt because I’ve only been trading options for a little over a year, but generally speaking if IV, and IV rank more importantly, are up it can be pretty profitable to sell in the direction of movement. You can give yourself a little room by selling OTM for a little less premium if you’re bullish, or you can sell ATM if you’re bearish and looking for a correction. \n\nI’m working with a smaller account so I stick to safer trades and trade OTM spreads with the short strike between .20-.30 delta. I didn’t check the quote, but this kind of move on ANET is the sort of thing I would normally consider as a potential trade, if the volume is there.",
        "created_utc": 1604467275,
        "id": "gb34sm6",
        "score": 2,
        "subreddit": "options",
        "created": 1604496075.0
    },
    {
        "author": "surmoiFire",
        "body": "csco guys, earning in 2 days, goes up in these 2 days while Nasdaq down. look at ANET, JNPR, very similar trends",
        "created_utc": 1605079854,
        "id": "gbwzc6u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605108654.0
    },
    {
        "author": "surmoiFire",
        "body": "ANET 🙏🙏🙏🙏🙏",
        "created_utc": 1604351088,
        "id": "gaxpt9e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604379888.0
    },
    {
        "author": "Investinwaffl3s",
        "body": "Sold my ANET shares like a paper handed bitch last week ‍🤦‍♂️",
        "created_utc": 1604354779,
        "id": "gaxxaxn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604383579.0
    },
    {
        "author": "SummerSnow8",
        "body": "ANET calls tomorrow SEDG puts",
        "created_utc": 1604372195,
        "id": "gayti4w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604400995.0
    },
    {
        "author": "goldensn1per3",
        "body": "Young and avid investor who began about 3 years ago. With total of $40k I am currently holding:\n\nCARR - 34 shares\nMSFT - 25\nCNR - 25 \nENB - 100\nTRP - 86 \nCNQ - 100\nCSCO - 106\nGLW - 90\nNIO - 27\nPLTR - 60\nCAE - 35\nSNC - 50\n\nThinking of dropping SNC and buying BNS. Have a bunch of other stocks on my watchlist like SBUX, DIS, ANET, OTIS, RCI, BCE, V, MA, PYPL.",
        "created_utc": 1606544706,
        "id": "gducosq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606573506.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  2nd of November\n\n\n\n## Upcoming events for Monday, November  2nd\n\n - Stock splits:\n\n    - MDLY @ **1:10**\n\n - Expected earnings:\n\n  ADTN, ADUS, AGRX, AIZ, AKTX, ALUS, ALX, AMC, AMCX, AMRC, ANET, ANH, APPF, ARGO, ARVN, ATXI, AWR, BCC, BKH, BRKR, BSM, BTE, BWXT, BYFC, CBFV, CCLP, CCXI, CDEV, CDK, CDLX, CDW, CINR, CLCT, CLX, CNA, CNO, CNTY, CORR, CPAC, CPE, CPLP, CRD.A, CRD.B, CRNT, CRUS, CTIC, CVI, CWH, DEA, DEI, DOOR, DRIO, DRRX, DSPG, EC, ECPG, EEX, EGRX, EL, ELVT, ENIA, ESPR, EVER, EVRI, EXTN, FANG, FBM, FE, FICO, FMC, FN, FNCB, FRPT, FTSI, FUNC, FUSB, G, GAIN, GHL, GIFI, HALO, HCKT, HGEN, HLIO, HMN, HNRG, HRTG, HSIC, HUD, HURN, HZNP, IAA, ICCH, ICHR, IHT, INGR, INSP, IOVA, IPI, IR, IRET, ISEE, ITIC, ITRI, ITUB, JAKK, JAZZ, JCOM, JLL, KFRC, KMPR, KMT, KNSA, KPTI, KRYS, L, LCII, LDOS, LEG, LITE, LL, LNT, LPG, MATX, MDLZ, MEC, MED, MG, MGP, MIME, MITT, MOS, MPC, MPLX, MRTX, MSGN, MVBF, MYGN, MYOK, NC, NCMI, NERV, NI, NNN, NPTN, NSP, NSSC, NTP, NTR, NWHM, NXE, O, OGS, OMI, ON, ONCS, ONTO, OSPN, OTTR, OXBR, OXLC, PAA, PACB, PAGP, PARR, PBR, PBR.A, PEAK, PINC, PMBC, PUMP, PYPL, QTNT, RGS, RIG, RMBS, RPAI, RVNC, RYAAY, SAMA, SANM, SBAC, SEDG, SIBN, SIMO, SNDX, SOGO, SOHU, SRC, SRRA, STE, STIM, STRL, SUP, SWKS, SYN, TCMD, TEN, TLGT, TMBR, TPTX, TREX, TRVG, TRVN, TYME, UAN, UROV, USFD, VCTR, VCYT, VEON, VNO, VNOM, WBK, WING, WLFC, WM, WMB, WMK, XENT, YRCW\n\n - Ex-div:\n\n  ASGI, ASML, BANR, BKEP, CAPL, ETRN, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, IID, ITUB, KEN, LBAI, LMRK, MET, SHLX, SPH, SRCE, USDP, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.100%)\n    - 6-Month Bill Auction (previous: 0.110%)\n    - Construction Spending (consensus: 0.9%, previous: 1.4%)\n    - Core PCE Price Index (previous: 0.3%)\n    - Core PCE Price Index (previous: 1.6%)\n    - ISM Manufacturing Employment (previous: 49.6)\n    - ISM Manufacturing New Orders Index (previous: 60.2)\n    - ISM Manufacturing PMI (consensus: 55.8, previous: 55.4)\n    - ISM Manufacturing Prices (consensus: 58.6, previous: 62.8)\n    - Investing.com Gold Index (actual: 56.5%, previous: 58.5%)\n    - Investing.com S&amp;P 500 Index (actual: 65.9%, previous: 58.7%)\n    - Loan Officer Survey\n    - Manufacturing PMI (previous: 53.3)\n    - PCE Price index (previous: 1.4)\n    - PCE price index (previous: 0.3%)\n    - Total Vehicle Sales (previous: 15.70M)\n\n## Upcoming events for Tuesday, November  3rd\n\n - Expected earnings:\n\n  ACET, ACOR, AGCO, AJX, AKR, ANAT, ANDE, APLS, AQB, ARA, ARCB, ARNC, AROC, ATH, ATHM, AUBN, AVD, AVNS, AVNT, BBGI, BBU, BCTX, BHC, BLD, BMCH, BRY, BTG, BTU, CARA, CARG, CBAY, CBD, CC, CGBD, CHCT, CHFS, CHSCP, CLSK, CLW, COHR, COKE, CORT, CPTA, CRIS, CRVL, CTLT, EAF, EMR, ES, ETN, ETRN, EURN, EXC, EXK, EXPD, FATE, FI, FOX, FOXA, FSP, GBLI, GCI, GLDD, GORO, GRFS, GSH, GTE, GTES, GWPH, HBM, HRZN, HSC, HTA, HUM, HY, HYRE, ICD, ICPT, INN, INS, IOSP, IPAR, IT, ITCI, JBGS, JCI, JELD, KAR, KE, KOPN, KRMD, LFC, LFVN, LGIH, LPX, LUNA, MBI, MCK, MCRB, MCS, MCY, MDNA, MDRR, METC, MOR, MRCY, MYL, NBR, NES, NEX, NEXT, NHC, NK, NP, NPO, NR, NRC, NSIT, OCFT, OCN, OMP, OPCH, ORA, OTEL, OXFD, PACD, PAYS, PEI, PFHD, PFIS, PKOH, PMD, PRU, PTRS, PTVCA, PTVCB, QUAD, RACE, RCM, RCUS, RHP, RNWK, RVI, SAVA, SCOR, SHIP, SIM, SMCI, SMIT, SPKE, SPR, STAR, SUPN, SYY, TCFC, TCON, TEF, TIMB, TISI, TREC, TRHC, TRI, TRMT, TTI, TX, UEC, UFPT, USAC, VIST, VIV, VPG, VSH, VSTM, W, WBT, WEC, WEYS, WLK, WLKP, WMG, WTRG, WTTR, XENE, XNCR, XOMA, Y, ZBRA, ZYME\n\n - Ex-div:\n\n  AIV, AMRB, BRO, CLX, EIG, FMX, HFWA, MCBS, PCB, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.140%)\n    - API Weekly Crude Oil Stock (previous: 4.577M)\n    - Durables Excluding Defense (previous: 3.4%)\n    - Factory Orders (consensus: 1.0%, previous: 0.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 55.2)\n    - ISM NY Business Conditions (previous: 56.1%)\n    - ISM-New York Index (previous: 807.3)\n    - Redbook (previous: 0.8%)\n    - Redbook (previous: 1.2%)\n    - U.S. Presidential Election\n\n## Upcoming events for Wednesday, November  4th\n\n - Expected earnings:\n\n  AAMC, ABIO, ACAD, ACIA, AE, AEE, AFIN, AGLE, AGM, AHCO, ALB, ALBO, ALL, ALLO, ALLT, ALSK, ALTM, AMEH, AMOT, AMSC, ANIK, ANSS, ANVS, APA, APEN, AQST, ARC, ARDX, ARTNA, ASC, ASTE, ATAX, ATEX, ATLO, AVA, AWK, AXNX, AZPN, BBD, BBDO, BBSI, BCH, BEP, BIDU, BIOL, BKCC, BKD, BKEP, BKTI, BLCM, BLPH, BRX, BSBR, BSGM, BWEN, CAPL, CBMG, CCAP, CCJ, CCRN, CCU, CDXC, CEA, CECE, CF, CFMS, CHEK, CHNG, CIA, CIB, CIM, CIX, CLFD, CLH, CLI, CMP, COHN, CPK, CRK, CRY, CSGS, CSII, CSTE, CTSO, CTVA, CUTR, CVU, CWBR, CXW, CYTK, DAR, DCP, DFIN, DHX, DK, DKL, DMAC, DNLI, DNOW, DRTT, DXPE, EGY, ELF, ELY, ENBL, ENLC, EPM, EPR, EPRT, EQH, ESSA, ET, EXPE, EXPI, EXR, FCRD, FIT, FLMN, FLXN, FNF, FNHC, FNV, FOE, FRG, FRGI, FROG, FRPH, FSTR, FTDR, FUN, GDDY, GDOT, GFL, GHC, GIB, GLMD, GLRE, GMAB, GMRE, GNK, GNW, GOL, GOOD, GPL, GPP, GPRE, GPRK, GRNQ, GRP.U, GTHX, H, HAE, HARP, HBB, HEP, HLNE, HLT, HNGR, HOFV, HOLX, HR, HST, IAG, IBOC, IDN, IGC, IIPR, IMXI, INFI, INGN, INPX, IO, IONS, IQ, ITI, JCAP, JKHY, KAMN, KBAL, KGC, KIDS, KLDO, KRUS, KW, KZR, LANC, LAND, LAZY, LBTYA, LBTYB, LBTYK, LC, LCI, LCTX, LHCG, LILA, LILAK, LMRK, LNC, LND, LPI, LPL, LRMR, LTBR, LTRPA, LTRPB, LUMN, LYRA, MCEP, MCHX, MDGL, MDU, MELI, MET, MFA, MGEE, MGNX, MIRM, MLAB, MLP, MLR, MLVF, MNKD, MOSY, MRCC, MRO, MRSN, MTCH, MTG, MTRX, MTW, NEWT, NGD, NHTC, NMFC, NODK, NTN, NUS, NWPX, OESX, OLN, ORCC, ORIC, ORTX, OSUR, OTIC, OUT, PAAS, PAHC, PATI, PAYC, PDCE, PDLB, PEBK, PFBI, PFGC, PING, PIRS, PLUS, PLYA, PODD, PRAH, PRGO, PRI, PRQR, PRTA, PSA, PSEC, PSN, PTGX, PXD, QCOM, QLYS, QRTEA, QRTEB, QRVO, QTWO, QUIK, RC, RCMT, RDN, RDWR, REI, RESI, REXN, RGLD, RGNX, RKDA, RLJ, RPD, RPT, RTLR, RYAM, SAFT, SBGI, SBOW, SENEA, SENEB, SG, SGA, SGMO, SGMS, SGRY, SITM, SJI, SJW, SLF, SMG, SMSI, SMTX, SPPI, SRDX, SRT, STAA, STN, SUN, SUZ, SWM, SWX, SYKE, SYNC, TA, TAC, TACT, TALO, TBIO, TELL, TG, TGA, TISI, TLK, TMDX, TPC, TPCO, TRC, TRMB, TRNO, TRTX, TS, TSLX, TTEC, TTGT, TTOO, TWO, TYL, UBX, UFCS, UHAL, UMH, UNVR, UPWK, USDP, USWS, VAC, VAPO, VBIV, VMD, VOYA, VRCA, VRSK, VRT, VST, VTOL, VTVT, VVNT, VYGR, WEN, WHD, WHLR, WK, WRN, WSTG, WTI, WTM, WTS, WYNN, XAN, XEC, ZAGG, ZNGA, ZNH, ZYNE\n\n - Ex-div:\n\n  AMG, AWI, BBD, BBDO, CATC, CFBK, FELE, HESM, IBCP, IDA, LSBK, MTRN, NEP, NWBI, OFED, PVBC, STBA, VBTX, WSFS, XYL\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 650K, previous: 749K)\n    - All Car Sales (previous: 3.75M)\n    - All Truck Sales (previous: 12.59M)\n    - Crude Oil Imports (previous: 0.122M)\n    - Crude Oil Inventories (previous: 4.320M)\n    - Cushing Crude Oil Inventories (previous: -0.422M)\n    - Distillate Fuel Production (previous: -0.005M)\n    - EIA Refinery Crude Runs  (previous: 0.362M)\n    - EIA Weekly Distillates Stocks (previous: -4.491M)\n    - EIA Weekly Refinery Utilization Rates (previous: 1.7%)\n    - Exports (previous: 171.90B)\n    - Gasoline Inventories (previous: -0.892M)\n    - Gasoline Production (previous: 0.162M)\n    - Heating Oil Stockpiles (previous: -0.299M)\n    - ISM Non-Manufacturing Business Activity (previous: 63.0)\n    - ISM Non-Manufacturing Employment (previous: 51.8)\n    - ISM Non-Manufacturing New Orders (previous: 61.5)\n    - ISM Non-Manufacturing PMI (consensus: 57.5, previous: 57.8)\n    - ISM Non-Manufacturing Prices (previous: 59.0)\n    - Imports (previous: 239.00B)\n    - MBA 30-Year Mortgage Rate (previous: 3.00%)\n    - MBA Mortgage Applications (previous: 1.7%)\n    - MBA Purchase Index (previous: 305.2)\n    - Markit Composite PMI (consensus: 55.5, previous: 54.3)\n    - Mortgage Market Index (previous: 807.8)\n    - Mortgage Refinance Index (previous: 3,711.6)\n    - Seevol Cushing Storage Report (previous: -2.538M)\n    - Services PMI (consensus: 56.0, previous: 54.6)\n    - Trade Balance (consensus: -64.00B, previous: -67.10B)\n\n^^^^2020-11-02",
        "created_utc": 1604314822,
        "id": "gavwe93",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1604343622.0
    },
    {
        "author": "galra001",
        "body": "ANET",
        "created_utc": 1604691443,
        "id": "gbdmgdo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604720243.0
    },
    {
        "author": "ElmerFUDz",
        "body": "Closed most of my sells from various spreads during the dip. ANET wasn't one of those 😒 so my $3k gain/contract is capped at $1.5k/contract",
        "created_utc": 1604398027,
        "id": "gazpdp2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604426827.0
    },
    {
        "author": "ElmerFUDz",
        "body": "FUCK why did I do spreads on ANET🤡🤡🤡 I closed so many fucking short legs on the dip but thought to myself \"eh no way it will go through $230 I'll just keep it\" DOPE I'm a sucker",
        "created_utc": 1604422160,
        "id": "gb0q361",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604450960.0
    },
    {
        "author": "arigold940",
        "body": "ANET looks like the only one that beat bigly",
        "created_utc": 1604352107,
        "id": "gaxrwnm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604380907.0
    },
    {
        "author": "galra001",
        "body": "$anet",
        "created_utc": 1604691232,
        "id": "gbdm1di",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604720032.0
    },
    {
        "author": "galra001",
        "body": "ANET over 260 about to pop off",
        "created_utc": 1604691281,
        "id": "gbdm54a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604720081.0
    },
    {
        "author": "NameNumber7",
        "body": "Familiar names (on mobile). Baba, oracle, msft, Amazon. I suppose you could be asking me questions to make me think harder 😁. Your prodding makes me less convinced it is what OP wants. The total of top 10 is 37.36%.\n\nhttps://www.etf.com/SKYY\n\nSKYY Top 10 Holdings\n\n[Alphabet Inc. Class A](https://www.etf.com/stock/GOOGL)4.23%\n\nKingsoft Cloud Holdings Ltd Sponsored ADR4.16%\n\n[Alibaba Group Holding Ltd. Sponsored ADR](https://www.etf.com/stock/BABA)3.96%\n\n[Oracle Corporation](https://www.etf.com/stock/ORCL)3.88%\n\n[Arista Networks, Inc.](https://www.etf.com/stock/ANET)3.82%\n\n[VMware, Inc. Class A](https://www.etf.com/stock/VMW)3.81%\n\n[Microsoft Corporation](https://www.etf.com/stock/MSFT)3.79%\n\n[Amazon.com, Inc.](https://www.etf.com/stock/AMZN)3.56%\n\n[MongoDB, Inc. Class A](https://www.etf.com/stock/MDB)3.34%\n\n[Lumen Technologies, Inc.](https://www.etf.com/stock/LUMN)2.80",
        "created_utc": 1605109367,
        "id": "gbxz1uy",
        "score": 1,
        "subreddit": "investing",
        "created": 1605138167.0
    },
    {
        "author": "stockfun77",
        "body": "There are so many. Made 30k almost over night on butterfly - that should be the easiest 4 bagger of your life within 6-12 months, look up the CEO RATHBERG. That’s a pony you wanna place your money on. A-P-x-t same story, buy the dips. G h m I, l c aNet, APPS, Unity. Don’t get me started on P I C. \n\nTLS just IPOd and no one is talking about them. Easy 5-7 bagger.  They are outside DC doing cyber security work. ThEy HaVe a GENERAL oN tHeir board. Think they might get some govt jobs? I n a q. Here’s another pony that will run PSNL, led by John West. Jesus. E t M, I D, OPTT NNDM. Fuck you could create your own basket of every ticker I just need mentioned and buy your rotund girlfriend a Lambo in two years.  But for gods sake buy L G V W",
        "created_utc": 1606658895,
        "id": "ge17reu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606687695.0
    },
    {
        "author": "thewimsey",
        "body": "No, it's not sketchy because money is involved.\n\nThe key to Bill Gates being successful wasn't that his mother knew some guy at IBM; it was that his wealthy family sent him to an expensive private school where he both met Paul Allen *and* learned about computers.  Gates's mom served on a charitable board with the CEO of IBM; they were more associates than friends, and that wouldn't have helped Gates at all if he hadn't already, you know, founded MS. \n\nElon's family didn't own an emerald mine, and he was $100k in debt when he graduated college. \n\nMeritocracy just means that merit - mostly in the sense of skills - is rewarded. It doesn't mean that everyone necessarily has an equal chance. \n\nIf a company needs and engineer and I have an engineering degree, and you don't - maybe because you had an abusive family growing up wit a father in prison and so never graduated from HS, the company is hiring me *on merit*. I'm an engineer; you're not; you can't do the job. \n\nThis doesn't mean that if our lives were switched at age 3 I would have done any better; that's just a separate question from meritocracy. \n\nI mean, if a company needs someone who speaks French, and my wealthy family summered in France every year and sent me there one a gap year and then on a junior year abroad...while you took French in HS...merit means I get the job *even though* I was only able to obtain my qualifications because my family was rich enough to keep sending me to France. \n\nBut the company isn't hiring me because of who I am, but because of what I can do, and that I can do it better than you can.",
        "created_utc": 1604800948,
        "id": "gbj9kou",
        "score": 8,
        "subreddit": "investing",
        "created": 1604829748.0
    },
    {
        "author": "KomputerIdiat",
        "body": "This is r/stockmarket. Money is money dude. I mean IBM sold their products to the Nazi to help to keep track of all the Jews they gassed or something. If people have to die, why not make some money while at it. As long as the killing is not done in our backyard it should be fine.",
        "created_utc": 1604883400,
        "id": "gbo897u",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1604912200.0
    },
    {
        "author": "xexelthrowaway",
        "body": "Yeah, some data in IBM, some in our caches. No one is freaking out about it. We can frankenstein a user profile together.",
        "created_utc": 1605028937,
        "id": "gbugnil",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1605057737.0
    },
    {
        "author": "clint1reid",
        "body": "I unfortunately bought yesterday lol. But also bought some today. I believe it has lots of room for growth. And current tech selloff and new antitrust news offer great entry points. Not sure if JD will reach BABA levels anytims soon (have this one as well) as it is more diversified, their cloud revenue just surpassed IBM. However, I have them both and plan to hold them long term.",
        "created_utc": 1605029599,
        "id": "gbui30x",
        "score": 2,
        "subreddit": "stocks",
        "created": 1605058399.0
    },
    {
        "author": "LucisMensEtManus",
        "body": "You have a number of comments on your financial model, so I won't comment there.\n\nTo me, what is missing is the story. First, comparison to the Leidos, CACI, BAH, IBM, HPE etc. of the government consulting world. They too employ a lot of talent. What is the difference with PLTR? Second, government consulting is often a \"customer intimate\" model, not quality leadership. Govt says it wants high tech, but they often buy those companies who understand them most. Which model is PLTR using? Why will PLTR succeed in Govt? Is it primarily IC?\n\nThird, if PLTR has silicon valley magic in it, then why is the commercial business not taking off? If you have a superior value proposition, that will be reflected in high margins and a kind of inevitability of customers who are drawn to your products. A weakness there would make me pause.",
        "created_utc": 1604902300,
        "id": "gbp1ury",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1604931100.0
    },
    {
        "author": "3000dollarsuitCOMEON",
        "body": "Competition, brand deterioration, and forced breakups by government action. \n\nNo company is invulnerable given time. Standard Oil in the early 1900s, IBM when mainframes were everything. Capital is so cheap right now that it's easy for startups to get funds. It may not seem like it but consumers will switch for better products or ways of doing things. Brands don't last forever and companies become more and more difficult to manage as their size increases.\n\nAlso don't forget the world is much bigger than just the US. China and other large developed countries are full of brilliant people, lots of access to capital. How long until Alibaba has boots on the ground in USA and starts aggressively pressuring Amazon?\n\nMy guess is that eventually the government will put a stop to big tech simply buying out their competitors. It's already a bipartisan talking point.",
        "created_utc": 1604850215,
        "id": "gbmc202",
        "score": 1,
        "subreddit": "investing",
        "created": 1604879015.0
    },
    {
        "author": "audion00ba",
        "body": "I can't even say whether this is sarcasm or not. You mean the IBM Power10 processor? \n\nThe only thing that's sort of interesting is the \"Distributed Memory Disaggregation and Sharing\"-feature, but that processor is not available until the end of 2021. If there is any proof that it is *real* and is competitive in terms of pricing, then I might see some value there. \n\nThe world has been moving to commodity servers for the past 15 years. IBM is everything but that. \n\nIBM has a debt of 50B. I don't see how their current assets are worth more than their debt.",
        "created_utc": 1604855624,
        "id": "gbmlzud",
        "score": 1,
        "subreddit": "investing",
        "created": 1604884424.0
    },
    {
        "author": "diesel408",
        "body": "So the other response summed it up pretty well, but left one other important factor out. The importance of Intel's architecture is fading. It will always be around of course, but anyone that doesn't think ARM is going to keep getting a larger and larger bite of the pie isn't paying attention. Apple will give everyone permission to target software for ARM architecture and we'll soon see a second attempt from Microsoft. Again, we'll always have applications for Intel, but it won't be nearly as dominant. Intel's production woes over the past half decade are well documented, and it's clear that they are about as well run as Boeing these days. The problem for Intel is that they face much more fierce competition than Boeing. Intel will survive of course, but they'll be a shell of their former self, and they'll have fumbled their flagship products and missed the boat on the areas of the industry that are sure to see rapid growth. I understand that people want to target value, but Intel is priced the way they are for good reason. If you're looking for value in Intel then I have some IBM stock to sell you as well.",
        "created_utc": 1604375350,
        "id": "gayyy7s",
        "score": 1,
        "subreddit": "investing",
        "created": 1604404150.0
    },
    {
        "author": "howtoreadspaghetti",
        "body": "IBM also comes to mind.",
        "created_utc": 1604318700,
        "id": "gaw082y",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1604347500.0
    },
    {
        "author": "letsdoit60",
        "body": "I wasn’t considering ibm tech!",
        "created_utc": 1604410417,
        "id": "gb03ko0",
        "score": 1,
        "subreddit": "investing",
        "created": 1604439217.0
    },
    {
        "author": "lucidvein",
        "body": "I would not recommend buying IBM at this time.  It's a company to watch with the restructuring changes, but they are restructuring to stay afloat.  They didn't adapt with the times and have been completely bypassed when it comes to cloud offerings etc.  \n\nThey did buy redhat which is likely a good investment, but the stock has been tracking downward for quite some time.  I'd absolutely wait dipping your foot in until they manage to turn their actual stock performance around as it's a stock continuing to experience negative momentum in a very bullish tech sector.",
        "created_utc": 1604783588,
        "id": "gbhuh98",
        "score": 1,
        "subreddit": "investing",
        "created": 1604812388.0
    },
    {
        "author": "stvaccount",
        "body": "He meant that apple is building their own ARM chips. And MSFT builds xbox hardware. Intel is strong, because of their startup investments.  \n\n\nThe fastest chip today is built by IBM and produced by Samsung FAB.  \n\n\nEveryone uses TSMC to build CPUs (also Intel). Samsung has a shot for a big comeback, Intel also but slimmer.\n\n&amp;#x200B;\n\nThe question is: which FPGA comany is bought next and what will happen to companies without their own FPGA company.",
        "created_utc": 1604793310,
        "id": "gbinoa9",
        "score": 1,
        "subreddit": "investing",
        "created": 1604822110.0
    },
    {
        "author": "skilliard7",
        "body": "They already have a working proof of concept. https://www.ibm.com/quantum-computing/developers/\n\nhttps://quantum-computing.ibm.com/docs/iql/first-circuit\n\nIBM innovates a lot more than people think. The average consumer might associate them with ancient mainframes and PCs that never sell anymore, but they innovate a lot in the enterprise space.",
        "created_utc": 1605027432,
        "id": "gbudedb",
        "score": 1,
        "subreddit": "investing",
        "created": 1605056232.0
    },
    {
        "author": "SudsAde6985",
        "body": "IBM raging. Lol. Truly nonsensical...all of it. Just gotta dodge &amp; weave. GL!",
        "created_utc": 1605026765,
        "id": "gbubye9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605055565.0
    },
    {
        "author": "ifsksndfhsowo",
        "body": "IBM is the only one I wouldn't hold",
        "created_utc": 1605038152,
        "id": "gbv0gj1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605066952.0
    },
    {
        "author": "kotsumu",
        "body": "They have small competitors here and there, mostly small scale startups. Closest ones worth mentioning that I can think of and are not mainstream companies like IBM are companies like Leidos and Booz Allen Hamilton.\n\nThe way their business model works is fundamentally different from Palantir. They evaluate technologies and purchase/ contracts from smaller companies (maybe startups) and package it up as a complete solution and sell it to the government. This essentially means that these companies are a little more than resellers of tech. Palantir's direct to consumer model focus their investments in RnD.",
        "created_utc": 1604958784,
        "id": "gbrg8ao",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604987584.0
    },
    {
        "author": "jpric155",
        "body": "IBM and INTC.   Boomer stocks saving me today.",
        "created_utc": 1605024167,
        "id": "gbu6h1f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605052967.0
    },
    {
        "author": "bald_bankrupt",
        "body": "You are wrong on everything. \n\niPhone 12 cpu is made by TMSC. \n\nXbox are PC parts from different manufacturers. \n\nIBM does not have anything close to the fastest cpu and its sales decline year after year since it was invented,\n\nIntel makes its own CPUs, all of them. Intel never outsourced manufacturing.",
        "created_utc": 1604850051,
        "id": "gbmbril",
        "score": 1,
        "subreddit": "investing",
        "created": 1604878851.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  9th of November\n\n\n\n## Upcoming events for Monday, November  9th\n\n - Stock splits:\n\n    - DSE @ **1:10**\n    - WYY @ **1:10**\n\n - Expected earnings:\n\n  ABST, AC, ACB, ACTG, ADES, ADMP, AESE, AGM, AKTX, AL, ALE, ALLK, ALUS, AMBC, APEI, APPF, APTS, APYX, ARCT, ARNA, ASM, ASUR, AT, ATCO, ATCX, ATHX, ATRA, ATXI, AVD, AVDL, BATL, BCOR, BHVN, BIP, BKI, BLRX, BRMK, BTU, BXRX, BYFC, BYND, CARA, CARS, CASI, CCO, CCXI, CEPU, CGC, CLAR, CLPR, CNNE, CNSP, CNXN, CPRX, CRESY, CSTL, CTRA, CVGI, DFFN, DHT, DIOD, EBIX, EBR, EBR.B, EC, ELVT, ELY, EQX, ESTA, EVFM, FBRX, FENG, FF, FLGT, FPAY, FPI, FSK, FSKR, FTK, FTSI, FUNC, GAIA, GECC, GFN, GLT, GOGO, GPMT, GSKY, GSL, GTH, HBB, HCHC, HGBL, HGEN, HIL, HL, HMTV, HPK, HPR, HROW, HT, HWM, HYMC, ICCC, ICCH, ICMB, ICPT, IDEX, IEA, IFF, IHRT, III, IIN, INFI, INO, INUV, IPAR, IRIX, IRS, ITCI, IVR, KIN, KLR, KNDI, KOS, KRYS, LIQT, LIZI, LMNL, LNSR, LUNA, MARA, MBI, MBII, MCD, MCRB, MGNI, MPAA, MRKR, MRNS, MRSN, MTBC, MWA, MWK, MYGN, NATR, NBEV, NBIX, NCLH, NEOS, NGL, NHI, NKLA, NLS, NMRD, NNOX, NOAH, NSCO, NSPR, NSTG, NVAX, NXE, OMER, OPRX, OR, ORGO, OSH, OXBR, OXY, PAM, PDLI, PEIX, PFIE, PGEN, PHUN, PLSE, PLUG, PRCP, PROG, PROS, PRTS, PRTY, PTE, PTMN, PWFL, RAIL, RAMP, RDNT, REAL, REED, REI, REPH, RETA, RMTI, RNA, RNG, RPAY, RUBY, RVMD, RVNC, SAMA, SCOR, SCSC, SCU, SENS, SESN, SIEN, SMTS, SNCR, SND, SNDE, SOHO, SPG, SPNE, SPT, SRT, SSTI, STAY, STRS, STXS, SVC, SWAV, SYNL, TCO, TGNA, TH, TLGT, TLND, TLRY, TPTX, TRVN, TSQ, TTCF, TXMD, TYME, UNIT, URGN, VERI, VRS, VUZI, WATT, WBAI, WES, WHF, WIFI, WKHS, WPM, WPRT, WVE, XERS, XP, XPER, YALA, ZAGG, ZGNX, ZI, ZIXI\n\n - Ex-div:\n\n  AEP, AMSF, AWK, BFIN, CDR, CG, COLB, CSTR, DCF, DEA, DVD, EBTC, FBMS, FCCY, FDP, GABC, GBX, GGB, GHM, HBI, HOMB, IBM, INVH, ISBC, KMT, LARK, LSTR, MCBC, MDC, MKTX, MPB, MPX, MSM, MTG, MWA, NBN, NFBK, OLN, PAG, PCAR, PGC, PPG, PPR, PZZA, RA, RILY, ROL, SASR, SCCO, SFBC, SON, SSSS, SXI, WBK, WBS, WCN, WELL, WETF, WINA, WNEB, WST, WTBA, XLNX\n\n## Upcoming events for Tuesday, November 10th\n\n - Stock splits:\n\n    - SMLP @ **1:15**\n\n - Expected earnings:\n\n  AAME, AAP, ABEO, ADPT, AER, AFMD, AGTC, AIKI, AKRO, ALC, ALEC, ALT, AMK, AMTI, APTO, ARA, ARMP, ASH, ATHM, ATNM, AVEO, AVGR, BBDC, BBQ, BCEL, BDTX, BNTX, BOMN, BOXL, BPT, BRKS, BSY, BWL.A, CAAS, CAE, CELP, CFRX, CHFS, CHMI, CHRA, CHSCP, CLPT, CLRB, CLSD, CLSK, CNR, COCP, COGT, COHR, CPHC, CPIX, CPST, CRBP, CRIS, CRNX, CRSR, CRTX, CRWS, CTIC, CVET, CVV, CWCO, CXDO, CYAN, CYBR, DDOG, DHI, DMS, DMTK, DOX, DQ, DTIL, EGAN, ELMD, ELP, ELSE, EQ, ERJ, EVI, EVOL, EYEN, FAT, FBIO, FENC, FICO, FIXX, FLUX, FONR, FOXF, FPH, FRHC, FTEK, FUBO, FULC, FURY, FUSN, GALT, GBIO, GBLI, GEC, GEVO, GILT, GLOG, GLOP, GMDA, GO, GOSS, GRFS, GSAT, GSH, GTT, HAIN, HCAT, HOTH, HTGM, HTHT, ICON, IFS, IMOS, INSE, INTT, ISR, ITRM, JMIA, KOD, KODK, KRNT, LAC, LGL, LJPC, LOGC, LORL, LPCN, LPRO, LUMO, LUNG, LYFT, MARK, MBIO, MBRX, MCF, MDNA, MDRR, MDWD, MMX, MNDO, MODN, MOGO, MOR, MORF, MVO, MYO, NEON, NES, NEXT, NGM, NHC, NK, NOVT, NRBO, NSYS, NTIC, NTRP, NTWK, OCGN, OCN, OEG, ONCY, ONEM, ONTX, OPRT, PASG, PAYS, PBT, PECK, PFMT, PHIO, PLMR, PLRX, PMD, PNTG, POLA, PRPH, PRPL, PRSP, PRVL, PSTL, RADA, RCEL, RCMT, RDCM, RDVT, RESN, RIOT, RKT, RLGT, RMBL, ROK, RXT, SANM, SAVA, SCPH, SCYX, SHIP, SHSP, SILK, SILV, SJT, SNGX, SNMP, SNSS, SPKE, SRRK, SSKN, SSNT, STAF, STEP, STOK, STSA, SURF, SWTX, SYN, TAT, TCON, TCP, TCRR, TGTX, THCA, TIMB, TME, TRMD, TRQ, TXG, VCNX, VEC, VIE, VIR, VITL, VIV, VNRX, VSTM, VTSI, VXRT, WHLM, WILC, WISA, WMG, WSTG, XBIT, XELA, XGN, ZOM\n\n - Ex-div:\n\n  ACV, AIO, AROC, CBH, COG, DBL, DLY, DSL, EFL, EHT, ETR, EVF, FANG, GILT, GWB, HNNA, HPF, HPI, HPS, HTD, IVZ, KBH, LPLA, MATX, MSA, NCV, NCZ, NTB, OPY, PCI, PCK, PCN, PCQ, PDI, PEAK, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, POOL, PTY, PYN, PZC, RMD, SBUX, SHEN, SIMO, TBNK, VGI, VNOM, WTFC, XOM, ZION, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.765%)\n    - API Weekly Crude Oil Stock (previous: -8.010M)\n    - EIA Short-Term Energy Outlook\n    - FOMC Member Brainard Speaks\n    - IBD/TIPP Economic Optimism (previous: 55.2)\n    - JOLTs Job Openings (consensus: 5.590M, previous: 6.493M)\n    - NFIB Small Business Optimism (consensus: 102.2, previous: 104.0)\n    - Redbook (previous: 1.2%)\n    - Redbook (previous: 3.2%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, November 11th\n\n - Expected earnings:\n\n  ACER, ACIA, ACIU, ACST, ADNT, AGRO, AIRT, ALAC, ALNA, ANVS, APD, APEN, APG, APLT, ARCO, ARDS, ASND, ASTC, ATEX, ATLO, ATO, ATOS, ATTO, AWX, AXAS, BEAM, BEDU, BEST, BFRA, BKTI, BSGM, CARV, CBMG, CBPO, CCF, CCMP, CFBI, CHEK, CIB, CIH, CMCL, CMCM, CNFR, CODX, CVU, CYCC, CYD, CYRN, CZZ, DCTH, DOYU, DSSI, DYAI, EDAP, EDN, EMX, ENOB, ENS, ENSV, EPM, EPSN, ESSA, EVK, EVOL, EXPI, FOSL, FTHM, GGAL, GIB, GLAD, GOCO, GRNQ, GRWG, GSV, HI, HMG, HOLI, HUYA, HYRE, IDXG, IDYA, IGC, IMTX, IMVT, ISIG, ISNS, ITCB, JCTCF, JE, KMDA, KTRA, LINC, LINX, LMND, LND, LPL, LRMR, LYRA, MCEP, MCFT, MFC, MIRM, MIST, MLND, MLVF, MOSY, MUFG, NCNA, NEPT, NLTX, NSEC, NTN, NVEE, NVFY, NVGS, NVUS, NYMX, OFED, OM, ONCY, OPGN, OSW, PANL, PATI, PCOM, PCVX, PDSB, PEBK, PNBK, PRPO, PRQR, PTN, PTVE, PYPD, QLGN, RAVE, RDI, REYN, RHE, RLMD, RPRX, RVLV, SA, SANW, SCPE, SGRP, SIEB, SLGG, SLNO, SLP, SLRX, SMFG, SNDL, SNES, SONM, SPTN, SYNC, TCOM, TELA, TG, TGA, TGC, TRNO, TRT, TRVI, TTEK, USAS, VEL, VERX, VOC, VRCA, VRM, VYGR, WHLR, WTER, WVVI, XAIR, XELB, XPEL, ZYNE\n\n## Upcoming events for Thursday, November 12th\n\n - Stock splits:\n\n    - PDS @ **1:20**\n\n - Expected earnings:\n\n  AACG, AAU, ACHV, ACY, ADCT, ADIL, AEYE, AFIB, AGBA, AGE, AGRX, AHPI, AIHS, AIM, AKER, AKUS, ALTG, ALYA, AMAT, AMTX, AMWL, ANDA, ANY, APTX, AQN, ARL, ASLN, ATLC, AUPH, AVCO, AWH, AXLA, AXU, AYLA, AYTU, AZRX, BAK, BAM, BANX, BBI, BCOW, BHB, BIOC, BIOL, BIOX, BKYI, BLI, BLNK, BLU, BNGO, BRP, BSQR, BTAI, BTN, BW, BXG, BZH, CALT, CANG, CBLI, CBMB, CCNC, CDOR, CELH, CERC, CETX, CHCI, CJJD, CLRO, CLSN, CMPS, CNET, CREX, CRHM, CRTD, CSCO, CSSE, CTEK, CURI, CXDC, CZNC, DARE, DAVA, DDS, DESP, DGII, DGLY, DIS, DLB, DLPN, DRAD, DRIO, DTSS, DYNT, EAST, ECOR, EDRY, EFOI, ENR, EPC, ESP, ETON, EYES, FFBW, FLY, FMTX, FRD, FSEA, FSI, FSM, FTCH, GBR, GDRX, GHSI, GLG, GLMD, GLOB, GNLN, GNPX, GP, GPOR, GRVY, GSMG, GURE, GWGH, HAYN, HEPA, HFFG, HIMX, HJLI, HOOK, HQI, HRMY, HSDT, HSTO, HUSA, HYLN, IBIO, ICL, IFMK, IGIC, IGT, IMAC, IMV, INFU, INMD, INOD, INPX, INTZ, IOR, IPWR, IZEA, JAGX, JAMF, JOBS, JRSH, KB, KBNT, KFFB, KROS, LEDS, LEGH, LIFE, LMB, LMFA, LMPX, LPTX, LSF, LTRX, LWAY, MARPS, MBOT, MDLY, MEG, METX, MFG, MIC, MICT, MOTS, MPLN, MSN, MTOR, MTR, MYOV, MYSZ, NAII, NAK, NARI, NBAC, NBSE, NBY, NETE, NGVC, NICE, NNDM, NTIP, NVMI, NWGI, NYC, OBCI, OBLG, OCX, OGEN, OMEX, OPHC, OPNT, OSMT, OSS, PCSA, PDD, PFIN, PHAS, PHGE, PIH, PLAG, PLTR, PRT, PRTH, PXS, QRHC, RBCN, RDHL, REDU, REKR, RELV, RMED, RPTX, RSSS, RVP, SACH, SALM, SB, SBH, SBS, SCX, SDGR, SELF, SFT, SGBX, SHI, SINA, SJ, SLGL, SLS, SMTI, SNBP, SNCA, SNFCA, SNOA, SOLY, SONN, SPH, SRAX, SSRM, SSY, SSYS, STON, SUMR, SUNW, SVT, SWIR, SYPR, TAIT, TARA, TCDA, TCI, TDG, TENX, TGH, TGP, THMO, THRY, TIG, TK, TKAT, TKC, TMDI, TNK, TR, TRIL, TSEM, TTNP, TUFN, TYHT, U, UAMY, UAVS, UBOH, UFAB, UNAM, UONE, UONEK, USEG, USIO, VBFC, VEDL, VERB, VERY, VET, VISL, VIVE, VJET, VRME, WB, WF, WINT, WIX, WORX, WTT, XNET, XPEV, XSPA, YRD, YTEN, ZEAL, ZNTL, ZSAN\n\n - Ex-div:\n\n  ABST, ADS, AHC, ARCB, ASTE, AUB, AVK, BFST, BPRN, BRKL, BSET, BSM, BWFG, CCD, CGNX, CGO, CHI, CHW, CLCT, CPZ, CSQ, CTVA, CVCY, CVGW, CWBC, DUK, EBMT, EMR, ENB, EQNR, EVA, FCFS, FMO, FNWB, GBAB, GCBC, GDV, GGM, GHY, GLW, GNT, GOF, GRC, GSK, GUT, HON, HP, HTLF, IHIT, ISD, IVH, JBGS, JCO, JEF, JEMD, JFR, JGH, JHAA, JHB, JLS, JOE, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LAD, LGI, LLY, LPX, MMS, MSCI, MSEX, MSVB, MUSA, NAC, NAD, NAN, NBB, NCB, NDMO, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NYV, NZF, OBNK, ODC, OMP, OPP, OTTR, OXLC, OXSQ, PCSB, PFC, PFS, PGZ, RDS.A, RDS.B, RFM, RGR, RIV, RMI, RMM, RSF, RTX, SAL, SALT, SCHW, SHBI, SHW, SIGI, SJM, SJR, SMBC, SSB, SSBI, TAIT, TCF, TFC, TFX, TSBK, UPS, USA, V, VBF, VTA, VVR, WAB, WAL, WD, WEC, WRK, WTRG, XEC\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.578%)\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.085%)\n    - CPI (consensus: 0.2%, previous: 0.2%)\n    - CPI (consensus: 1.3%, previous: 1.4%)\n    - CPI Index, n.s.a. (consensus: 260.59, previous: 260.28)\n    - CPI Index, s.a (previous: 260.21)\n    - CPI, n.s.a (previous: 0.14%)\n    - Chicago Fed President Evans Speaks\n    - Cleveland CPI (previous: 0.1%)\n    - Continuing Jobless Claims (consensus: 7,200K, previous: 7,285K)\n    - Core CPI (consensus: 0.2%, previous: 0.2%)\n    - Core CPI (consensus: 1.7%, previous: 1.7%)\n    - Core CPI Index (previous: 269.26)\n    - Crude Oil Imports (previous: 0.560M)\n    - Crude Oil Inventories (previous: -7.998M)\n    - Cushing Crude Oil Inventories (previous: 0.936M)\n    - Distillate Fuel Production (previous: 0.149M)\n    - EIA Refinery Crude Runs  (previous: 0.164M)\n    - EIA Weekly Distillates Stocks (previous: -1.585M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.4%, previous: 0.7%)\n    - FOMC Member Williams Speaks\n    - Federal Budget Balance (consensus: -124.0B, previous: -125.0B)\n    - Gasoline Inventories (consensus: -0.871M, previous: 1.541M)\n    - Gasoline Production (previous: -0.023M)\n    - Heating Oil Stockpiles (previous: -0.395M)\n    - IEA Monthly Report\n    - Initial Jobless Claims (consensus: 738K, previous: 751K)\n    - Jobless Claims 4-Week Avg. (previous: 787.00K)\n    - Real Earnings (previous: 0.2%)\n\n^^^^2020-11-09",
        "created_utc": 1604919625,
        "id": "gbpii9c",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1604948425.0
    },
    {
        "author": "abcomputer",
        "body": "IBM cloud?",
        "created_utc": 1604247716,
        "id": "gasy3c0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604276516.0
    },
    {
        "author": "Vast_Cricket",
        "body": "**Spce** is legit. Keep in mind that is a rocket science company. Suppose gov't did not give the clearance for 2 years we understand they are ready can wait for 2 years.  So I will be around so long there are investors willing to keep the company running.\n\nAs for the eV controversial giant, this is not quite finished. Personally even if they have no product or schedule they will linger around awhile. They can use their patents sue every manufacturer in eV and often they generate revenue from those manufacturers as hush up money.\n\nSome years ago, a hard disk manufacturer making 3.5\" hard drive business was failing. It had a strong intellectual property department sued every hard disk manufacturer in the 3.5\" drive claiming patient infringement. In 1990 IBM was hit with a lawsuit as an inventor of the drive and sue by a smaller player. It paid some hush money. Seagate was dismissed in 1997, sue again and paid [$45 M to R+ as late as 2000](https://www.electronicsweekly.com/news/archived/resources-archived/seagate-to-pay-rodime-45m-to-settle-suit-2000-01/).   R+ only exists as a shell company and its share price soared on news of the patent settlement.  I think **NKLA** can remain as a shell company with its patent portfolio covering designs that covers most vehicles built electric or not. [It sue Tsla earlier](https://www.forbes.com/sites/alanohnsman/2020/04/20/teslas-effort-to-short-circuit-nikola-lawsuit-fizzles-as-patent-office-denies-door-argument/?sh=44dc21a45d78). That Tesla copied NKLA on shield, cab shape and windshield design sued for $2B. If you think you will prosper you can bag hold your stocks.",
        "created_utc": 1604267257,
        "id": "gau1cea",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604296057.0
    },
    {
        "author": "Jarlaxle_rigged_it",
        "body": "Ones that have been performing weak lately.. that shows skepticism..  also high P/E ratio. e.g Tesla was the obvious choice and i still didn't hop on the run down cause it was all too far/was working. Also look at distance to next support or so.  \n\n\nCandidates i have for next week are still Tesla, NVDA, IBM, NFLX",
        "created_utc": 1604238515,
        "id": "gasisd6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604267315.0
    },
    {
        "author": "Shklyar1902",
        "body": "Honestly, in the current market, it's far more speculative then in the past (*cough* Tesla *cough*)\nNvidia would be a good hold it for a while stock, just in my eyes they seem to be heading the route of IBM, going more into the commercial business (cloud storage, servers...)  which will cause an initial drop in stock",
        "created_utc": 1604443975,
        "id": "gb1zqaa",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604472775.0
    },
    {
        "author": "peter-doubt",
        "body": "Have you collected (not cashed) the checks? \n\nAre you the executor ( or she?)\n\nCopy them .  Send the copy back to their investor relations dept., explaining the predicament.\n\nIBM doesn't want it, and doing so defines the nightmare *they* have.. sending you reports every year at $20  plus administering your unwanted account.. you don't want it, nor do they! \n\nI'd start there. If you had the certificate, selling costs money, too. I'd find a charity and give it away for the deduction.",
        "created_utc": 1604318866,
        "id": "gaw0ep9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604347666.0
    },
    {
        "author": "Summebride",
        "body": "I'd discourage hyperbole like \"longer than your lifetime\".  Statements like,that haven't aged well for Xerox, Commodore, IBM, GE, Blackberry, Enron, Exxon, Blockbuster, and more.",
        "created_utc": 1604503122,
        "id": "gb4fq97",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604531922.0
    },
    {
        "author": "FifiandColumbo",
        "body": "They let her cash/deposit checks without his signature for a few months after he passed away, but it's been a year and a half, and now they're telling her any checks need to be in her name.  She's a sweet little old lady, though, so maybe she can sweet talk them into it. \n\nCalling IR at IBM is worth a try. Thanks for the suggestion.",
        "created_utc": 1604425161,
        "id": "gb0wge7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604453961.0
    },
    {
        "author": "Fractadactyl",
        "body": "Ibm dip",
        "created_utc": 1604425895,
        "id": "gb0y183",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604454695.0
    },
    {
        "author": "ReflectAA",
        "body": "Why can’t your mom cash your dads checks? That is the most unusual part of this. Were they never married? It might be easier to bring his death certificate to a bank and explain the situation and see if they allow her to cash his checks as the surviving spouse. \n\nI would not bother with the Compushare BS. If the bank doesn’t work you can try contacting IR directly for IBM and tell them that Compushare is being intentionally difficult. I’ve never tried that myself though it may lead nowhere.",
        "created_utc": 1604404699,
        "id": "gazvw05",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604433499.0
    },
    {
        "author": "djpitagora",
        "body": "IBM, Apple and Microsoft disagree.",
        "created_utc": 1604410283,
        "id": "gb03d41",
        "score": 1,
        "subreddit": "investing",
        "created": 1604439083.0
    },
    {
        "author": "036Gooddaysir036",
        "body": "IBM is also an excellent buy. It just recently became an Aristocrat since it increased its dividend for 25 years now. So both, both is good. But if you're only considering one or the other then it is going to come down to which you believe has a better business model and is more likely to continue to increase their dividend payout.",
        "created_utc": 1604299457,
        "id": "gaviemp",
        "score": 1,
        "subreddit": "investing",
        "created": 1604328257.0
    },
    {
        "author": "thewimsey",
        "body": "MSFT wasn't  a computer company. It was a software company. IBM was a computer company.\n\nThe brilliance of MSFT was in - and this seems weird today - realizing that a company could make money just selling software. A ton of money. More money than computer makers could make by themselves. This was a kind of radical idea at the time.\n\nJobs was very successful at the computer business; the Apple was the bestselling PC from 1977-1982.\n\nApple wasn't killed by MSFT, it was killed by IBM, which built a PC from more or less off the shelf parts allowing *anyone* to build a clone. (Which, incidentally, would run windows). \n\nApple's computers couldn't compete with PCs built with off the shelf parts. It's not about Jobs being bad; it's about other people being better.\n\nIBM's approach almost immediately priced *them* out of the PC market, leaving the profits to MSFT and intel (and a tiny bit for clone makers, who mostly ended up in a low margin commodity business).",
        "created_utc": 1604280445,
        "id": "gauq3df",
        "score": 1,
        "subreddit": "investing",
        "created": 1604309245.0
    },
    {
        "author": "lucky_ducker",
        "body": "IBM used to be the classic \"widows and orphans\" stock. New stockbrokers were told that they could never lose their jobs by losing clients' money in IBM.",
        "created_utc": 1604445328,
        "id": "gb22b5c",
        "score": 1,
        "subreddit": "investing",
        "created": 1604474128.0
    },
    {
        "author": "Lie-Minimum",
        "body": "IBM and INTC",
        "created_utc": 1604713824,
        "id": "gbetpab",
        "score": 1,
        "subreddit": "investing",
        "created": 1604742624.0
    },
    {
        "author": "DarkStarOptions",
        "body": "&gt;It does limit your loss by a half, but it does increase your probability of loss by a factor of two as well. Now that you close the spread once it gets touched, your probability of loss is now the probability of touching the short strike (which is approximately twice the probability of being ITM).\n\nAs opposed to waiting to see if the stock rebounds off the short strike?  \n\nMakes sense.\n\n&amp;#x200B;\n\nI opened a spread against IBM about 3 weeks ago, a 35 day spread.  It initially dipped below the short strike but I didn't freak out because I had 30 days for it to go back up....and it did.  Now my spread is OTM and profitable and has been for about a week.  \n\n&amp;#x200B;\n\nThis guy was putting forth a strategy of writing a spread with a short strike of 20 delta for &lt; 14 days.  I guess the thought is if the stock moved that much in a short amount of time to test the short strike, probably best to just close it for a loss rather than manage it with just a few days left until expiration.  That's my guess but I don't know because I didn't ask him.",
        "created_utc": 1604733204,
        "id": "gbflvpd",
        "score": 1,
        "subreddit": "options",
        "created": 1604762004.0
    },
    {
        "author": "TheGoodBunny",
        "body": "Define \"safest\" and \"long term\" for yourself. No single company is safe forever. 10-15 years ago you would have picked Ford, IBM, Exxon as \"safest for long term\". For buy-and-forget you will be better off investing in an index.",
        "created_utc": 1604779663,
        "id": "gbhio59",
        "score": 1,
        "subreddit": "investing",
        "created": 1604808463.0
    },
    {
        "author": "ascendtofutility",
        "body": "It could happen over a period of five years or so. Yes it's unlikely. How likely was it for the Lehman bros and bear Stearns to collapse? How likely was it for IBM to fuck up and get knocked off the top? What I'm trying to say, there's more risk indexing right now than there ever was. My personal opinion, we are in a coronavirus bubble that will pop in a year or so when people can allocate money to other equities safely. Money doesn't disappear, it just moves around.",
        "created_utc": 1604769111,
        "id": "gbgw3mn",
        "score": 1,
        "subreddit": "investing",
        "created": 1604797911.0
    },
    {
        "author": "bazookatroopa",
        "body": "False. They sell over 50% of all CPUs already. \n\nNVIDIA actually just acquired ARM. ARM produces over 50% of all CPUs. Just not desktop or laptop. \n\nApple was the original founder of ARM. They created their own ARM based processor. They cut IBM and now Intel. They are using their own processors in their phones, watches, and tablets already. Now they are going to use their processors in their laptops and desktops. \n\nLook up the fall off IBM, that shit is happening again with Intel. ARM &gt; i86 &gt; PowerPC. Mobile devices first, then consumer hardware, and finally servers will be replaced.",
        "created_utc": 1605030485,
        "id": "gbuk02r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605059285.0
    },
    {
        "author": "Kashm11r",
        "body": "BAM, FB, GOOG, IBM all have multi billion dollar investments in India. Major energy companies like Sunpower, First Solar, Canadian Solar, GE, Vestas as well.",
        "created_utc": 1605023076,
        "id": "gbu47vp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605051876.0
    },
    {
        "author": "skilliard7",
        "body": "&gt; Bitcoin has plenty of intrinsic use. These include borderless transfer without needing to convert to to local currency (cant do this with Western Union), black markets, safe haven from oppressive governments, sending aid to citizens of oppressive governments, ways to bypass import sanctions (see Iran), and more. Just because you don't have intrinsic use for BTC, doesn't mean others don't (see link below).\n\nYou can do this with Ethereum, Litecoin, Monero, Vertcoin, even Dogecoin. I agree cryptocurrency and blockchains are useful but I don't see Bitcoin as a long term store of value. It's far more volatile than precious metals and also intangible.\n\nIBM is making huge strides towards quantum computing, and once they pull it off, Bitcoin will become worthless once the public/private key cryptography is cracked and anyone with access to a quantum computer can simply sign transactions to send coins to themselves. We're easily within 10 years at this point, possibly less.\n\n&gt;This is like saying anyone can create a better social network than Facebook and therefore Facebook has no value\n\nWhat about Myspace? It came first.\n\n&gt;Wrong. Best case scenario is that BTC continues to be added to the balance sheets of large, publicly traded companies\n\nLike 1 or 2 companies that hold it as a tiny position. I think Overstock and Square? Most companies that accept it just use Bitpay or Coinbase to instantly sell it.",
        "created_utc": 1605023410,
        "id": "gbu4wlq",
        "score": 1,
        "subreddit": "investing",
        "created": 1605052210.0
    },
    {
        "author": "wikipedia_answer_bot",
        "body": "Share may refer to:\n\nShare, to make joint use of a resource (such as food, money, or space); see Sharing\nShare (finance), a stock or other financial security (such as a mutual fund)\nShare, Kwara, a town and LGA in Kwara State, NigeriaShare may also refer to:\n\n\n== Arts, entertainment, and media ==\nShare (2015 film), a short drama film\nShare (2019 film), a feature drama film\nShare (newspaper), a newspaper in Toronto, Canada\nRatings share, percentage of television sets in use tuned to a program, according to the Nielsen Ratings\n\n\n== Computing ==\nshare (command), a shell command\nSHARE (computing), a user group for IBM mainframe computers\nShare (P2P), a Japanese P2P computer program, the successor to Winny\nShare, a software service of Acrobat.com used for sending files\nFile sharing\nNetwork share, a file storage area that is available over a computer network\nShare icon, a user interface icon intended to convey performing a share action\nSHARE Operating System, the first operating system, by the SHARE user group\n\n\n== Organizations ==\nSHARE cancer support, a New York City organization supporting women with cancer\nSHARE Foundation (El Salvador), an El Salvador justice organization\nShare Foundation, a medical charity in Newfoundland\nSHARE in Africa, an American charity organization\nShare International, a religious movement founded by British painter Benjamin Creme\nSkeptics and Humanist Aid and Relief Effort, or SHARE, a charity arm of the Center for Inquiry\nStudents Harness Aid for the Relief of the Elderly, or SHARE, a charity in Cork, Ireland\n\n\n== Other uses ==\nSouthern Hemisphere Auroral Radar Experiment, or SHARE, tracking space weather from Antarctica\nSurvey of Health, Ageing and Retirement in Europe, or SHARE, a health and social study in Europe\n\n\n== See also ==\nAll pages with titles beginning with Share \nAll pages with titles containing Share\nCher\nPlowshare, the cutting blade of a plow (plough)\nRidesharing (disambiguation)\nShared (disambiguation)\nTimeshare (disambiguation)\n\nMore details here: https://en.wikipedia.org/wiki/Share \n\n\n\n*This comment was left automatically (by a bot). If something's wrong, please, report it.*\n\n*Really hope this was useful and relevant :D*\n\n*If I don't get this right, don't get mad at me, I'm still learning!*",
        "created_utc": 1605049512,
        "id": "gbvncd7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605078312.0
    },
    {
        "author": "dampon",
        "body": "You know that decades ago that GE, Kodak, Xerox, IBM, Sears, etc. were the Amazons of those time periods right?\n\nHow are they doing today?\n\nCan't use hindsight to pick a stock. And you can't assume just because Amazon is on top now it will continue to be forever.",
        "created_utc": 1604954794,
        "id": "gbr83vn",
        "score": 1,
        "subreddit": "investing",
        "created": 1604983594.0
    },
    {
        "author": "Applesauce9210",
        "body": "If you want individual stock exposure, XOM. Maybe IBM if you’re looking for tech tilt",
        "created_utc": 1605011702,
        "id": "gbtl6hi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605040502.0
    },
    {
        "author": "audion00ba",
        "body": "&gt; The fastest chip today is built by IBM\n\nWhich one would that be?",
        "created_utc": 1604848088,
        "id": "gbm8e7x",
        "score": 1,
        "subreddit": "investing",
        "created": 1604876888.0
    },
    {
        "author": "ninja_batman",
        "body": "&gt; IBM is making huge strides towards quantum computing, and once they pull it off, Bitcoin will become worthless once the public/private key cryptography is cracked and anyone with access to a quantum computer can simply sign transactions to send coins to themselves. We're easily within 10 years at this point, possibly less.\n\nHahaha. I am doubtful that IBM will be the company to pull off a feasible Quantum computer.",
        "created_utc": 1605027324,
        "id": "gbud5y5",
        "score": -1,
        "subreddit": "investing",
        "created": 1605056124.0
    },
    {
        "author": "thewimsey",
        "body": "No, it's not sketchy because money is involved.\n\nThe key to Bill Gates being successful wasn't that his mother knew some guy at IBM; it was that his wealthy family sent him to an expensive private school where he both met Paul Allen *and* learned about computers.  Gates's mom served on a charitable board with the CEO of IBM; they were more associates than friends, and that wouldn't have helped Gates at all if he hadn't already, you know, founded MS. \n\nElon's family didn't own an emerald mine, and he was $100k in debt when he graduated college. \n\nMeritocracy just means that merit - mostly in the sense of skills - is rewarded. It doesn't mean that everyone necessarily has an equal chance. \n\nIf a company needs and engineer and I have an engineering degree, and you don't - maybe because you had an abusive family growing up wit a father in prison and so never graduated from HS, the company is hiring me *on merit*. I'm an engineer; you're not; you can't do the job. \n\nThis doesn't mean that if our lives were switched at age 3 I would have done any better; that's just a separate question from meritocracy. \n\nI mean, if a company needs someone who speaks French, and my wealthy family summered in France every year and sent me there one a gap year and then on a junior year abroad...while you took French in HS...merit means I get the job *even though* I was only able to obtain my qualifications because my family was rich enough to keep sending me to France. \n\nBut the company isn't hiring me because of who I am, but because of what I can do, and that I can do it better than you can.",
        "created_utc": 1604800948,
        "id": "gbj9kou",
        "score": 8,
        "subreddit": "investing",
        "created": 1604829748.0
    },
    {
        "author": "KomputerIdiat",
        "body": "This is r/stockmarket. Money is money dude. I mean IBM sold their products to the Nazi to help to keep track of all the Jews they gassed or something. If people have to die, why not make some money while at it. As long as the killing is not done in our backyard it should be fine.",
        "created_utc": 1604883400,
        "id": "gbo897u",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1604912200.0
    },
    {
        "author": "LucisMensEtManus",
        "body": "You have a number of comments on your financial model, so I won't comment there.\n\nTo me, what is missing is the story. First, comparison to the Leidos, CACI, BAH, IBM, HPE etc. of the government consulting world. They too employ a lot of talent. What is the difference with PLTR? Second, government consulting is often a \"customer intimate\" model, not quality leadership. Govt says it wants high tech, but they often buy those companies who understand them most. Which model is PLTR using? Why will PLTR succeed in Govt? Is it primarily IC?\n\nThird, if PLTR has silicon valley magic in it, then why is the commercial business not taking off? If you have a superior value proposition, that will be reflected in high margins and a kind of inevitability of customers who are drawn to your products. A weakness there would make me pause.",
        "created_utc": 1604902300,
        "id": "gbp1ury",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1604931100.0
    },
    {
        "author": "3000dollarsuitCOMEON",
        "body": "Competition, brand deterioration, and forced breakups by government action. \n\nNo company is invulnerable given time. Standard Oil in the early 1900s, IBM when mainframes were everything. Capital is so cheap right now that it's easy for startups to get funds. It may not seem like it but consumers will switch for better products or ways of doing things. Brands don't last forever and companies become more and more difficult to manage as their size increases.\n\nAlso don't forget the world is much bigger than just the US. China and other large developed countries are full of brilliant people, lots of access to capital. How long until Alibaba has boots on the ground in USA and starts aggressively pressuring Amazon?\n\nMy guess is that eventually the government will put a stop to big tech simply buying out their competitors. It's already a bipartisan talking point.",
        "created_utc": 1604850215,
        "id": "gbmc202",
        "score": 1,
        "subreddit": "investing",
        "created": 1604879015.0
    },
    {
        "author": "audion00ba",
        "body": "I can't even say whether this is sarcasm or not. You mean the IBM Power10 processor? \n\nThe only thing that's sort of interesting is the \"Distributed Memory Disaggregation and Sharing\"-feature, but that processor is not available until the end of 2021. If there is any proof that it is *real* and is competitive in terms of pricing, then I might see some value there. \n\nThe world has been moving to commodity servers for the past 15 years. IBM is everything but that. \n\nIBM has a debt of 50B. I don't see how their current assets are worth more than their debt.",
        "created_utc": 1604855624,
        "id": "gbmlzud",
        "score": 1,
        "subreddit": "investing",
        "created": 1604884424.0
    },
    {
        "author": "diesel408",
        "body": "So the other response summed it up pretty well, but left one other important factor out. The importance of Intel's architecture is fading. It will always be around of course, but anyone that doesn't think ARM is going to keep getting a larger and larger bite of the pie isn't paying attention. Apple will give everyone permission to target software for ARM architecture and we'll soon see a second attempt from Microsoft. Again, we'll always have applications for Intel, but it won't be nearly as dominant. Intel's production woes over the past half decade are well documented, and it's clear that they are about as well run as Boeing these days. The problem for Intel is that they face much more fierce competition than Boeing. Intel will survive of course, but they'll be a shell of their former self, and they'll have fumbled their flagship products and missed the boat on the areas of the industry that are sure to see rapid growth. I understand that people want to target value, but Intel is priced the way they are for good reason. If you're looking for value in Intel then I have some IBM stock to sell you as well.",
        "created_utc": 1604375350,
        "id": "gayyy7s",
        "score": 1,
        "subreddit": "investing",
        "created": 1604404150.0
    },
    {
        "author": "howtoreadspaghetti",
        "body": "IBM also comes to mind.",
        "created_utc": 1604318700,
        "id": "gaw082y",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1604347500.0
    },
    {
        "author": "letsdoit60",
        "body": "I wasn’t considering ibm tech!",
        "created_utc": 1604410417,
        "id": "gb03ko0",
        "score": 1,
        "subreddit": "investing",
        "created": 1604439217.0
    },
    {
        "author": "lucidvein",
        "body": "I would not recommend buying IBM at this time.  It's a company to watch with the restructuring changes, but they are restructuring to stay afloat.  They didn't adapt with the times and have been completely bypassed when it comes to cloud offerings etc.  \n\nThey did buy redhat which is likely a good investment, but the stock has been tracking downward for quite some time.  I'd absolutely wait dipping your foot in until they manage to turn their actual stock performance around as it's a stock continuing to experience negative momentum in a very bullish tech sector.",
        "created_utc": 1604783588,
        "id": "gbhuh98",
        "score": 1,
        "subreddit": "investing",
        "created": 1604812388.0
    },
    {
        "author": "stvaccount",
        "body": "He meant that apple is building their own ARM chips. And MSFT builds xbox hardware. Intel is strong, because of their startup investments.  \n\n\nThe fastest chip today is built by IBM and produced by Samsung FAB.  \n\n\nEveryone uses TSMC to build CPUs (also Intel). Samsung has a shot for a big comeback, Intel also but slimmer.\n\n&amp;#x200B;\n\nThe question is: which FPGA comany is bought next and what will happen to companies without their own FPGA company.",
        "created_utc": 1604793310,
        "id": "gbinoa9",
        "score": 1,
        "subreddit": "investing",
        "created": 1604822110.0
    },
    {
        "author": "SudsAde6985",
        "body": "IBM raging. Lol. Truly nonsensical...all of it. Just gotta dodge &amp; weave. GL!",
        "created_utc": 1605026765,
        "id": "gbubye9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605055565.0
    },
    {
        "author": "kotsumu",
        "body": "They have small competitors here and there, mostly small scale startups. Closest ones worth mentioning that I can think of and are not mainstream companies like IBM are companies like Leidos and Booz Allen Hamilton.\n\nThe way their business model works is fundamentally different from Palantir. They evaluate technologies and purchase/ contracts from smaller companies (maybe startups) and package it up as a complete solution and sell it to the government. This essentially means that these companies are a little more than resellers of tech. Palantir's direct to consumer model focus their investments in RnD.",
        "created_utc": 1604958784,
        "id": "gbrg8ao",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604987584.0
    },
    {
        "author": "jpric155",
        "body": "IBM and INTC.   Boomer stocks saving me today.",
        "created_utc": 1605024167,
        "id": "gbu6h1f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605052967.0
    },
    {
        "author": "bald_bankrupt",
        "body": "You are wrong on everything. \n\niPhone 12 cpu is made by TMSC. \n\nXbox are PC parts from different manufacturers. \n\nIBM does not have anything close to the fastest cpu and its sales decline year after year since it was invented,\n\nIntel makes its own CPUs, all of them. Intel never outsourced manufacturing.",
        "created_utc": 1604850051,
        "id": "gbmbril",
        "score": 1,
        "subreddit": "investing",
        "created": 1604878851.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  9th of November\n\n\n\n## Upcoming events for Monday, November  9th\n\n - Stock splits:\n\n    - DSE @ **1:10**\n    - WYY @ **1:10**\n\n - Expected earnings:\n\n  ABST, AC, ACB, ACTG, ADES, ADMP, AESE, AGM, AKTX, AL, ALE, ALLK, ALUS, AMBC, APEI, APPF, APTS, APYX, ARCT, ARNA, ASM, ASUR, AT, ATCO, ATCX, ATHX, ATRA, ATXI, AVD, AVDL, BATL, BCOR, BHVN, BIP, BKI, BLRX, BRMK, BTU, BXRX, BYFC, BYND, CARA, CARS, CASI, CCO, CCXI, CEPU, CGC, CLAR, CLPR, CNNE, CNSP, CNXN, CPRX, CRESY, CSTL, CTRA, CVGI, DFFN, DHT, DIOD, EBIX, EBR, EBR.B, EC, ELVT, ELY, EQX, ESTA, EVFM, FBRX, FENG, FF, FLGT, FPAY, FPI, FSK, FSKR, FTK, FTSI, FUNC, GAIA, GECC, GFN, GLT, GOGO, GPMT, GSKY, GSL, GTH, HBB, HCHC, HGBL, HGEN, HIL, HL, HMTV, HPK, HPR, HROW, HT, HWM, HYMC, ICCC, ICCH, ICMB, ICPT, IDEX, IEA, IFF, IHRT, III, IIN, INFI, INO, INUV, IPAR, IRIX, IRS, ITCI, IVR, KIN, KLR, KNDI, KOS, KRYS, LIQT, LIZI, LMNL, LNSR, LUNA, MARA, MBI, MBII, MCD, MCRB, MGNI, MPAA, MRKR, MRNS, MRSN, MTBC, MWA, MWK, MYGN, NATR, NBEV, NBIX, NCLH, NEOS, NGL, NHI, NKLA, NLS, NMRD, NNOX, NOAH, NSCO, NSPR, NSTG, NVAX, NXE, OMER, OPRX, OR, ORGO, OSH, OXBR, OXY, PAM, PDLI, PEIX, PFIE, PGEN, PHUN, PLSE, PLUG, PRCP, PROG, PROS, PRTS, PRTY, PTE, PTMN, PWFL, RAIL, RAMP, RDNT, REAL, REED, REI, REPH, RETA, RMTI, RNA, RNG, RPAY, RUBY, RVMD, RVNC, SAMA, SCOR, SCSC, SCU, SENS, SESN, SIEN, SMTS, SNCR, SND, SNDE, SOHO, SPG, SPNE, SPT, SRT, SSTI, STAY, STRS, STXS, SVC, SWAV, SYNL, TCO, TGNA, TH, TLGT, TLND, TLRY, TPTX, TRVN, TSQ, TTCF, TXMD, TYME, UNIT, URGN, VERI, VRS, VUZI, WATT, WBAI, WES, WHF, WIFI, WKHS, WPM, WPRT, WVE, XERS, XP, XPER, YALA, ZAGG, ZGNX, ZI, ZIXI\n\n - Ex-div:\n\n  AEP, AMSF, AWK, BFIN, CDR, CG, COLB, CSTR, DCF, DEA, DVD, EBTC, FBMS, FCCY, FDP, GABC, GBX, GGB, GHM, HBI, HOMB, IBM, INVH, ISBC, KMT, LARK, LSTR, MCBC, MDC, MKTX, MPB, MPX, MSM, MTG, MWA, NBN, NFBK, OLN, PAG, PCAR, PGC, PPG, PPR, PZZA, RA, RILY, ROL, SASR, SCCO, SFBC, SON, SSSS, SXI, WBK, WBS, WCN, WELL, WETF, WINA, WNEB, WST, WTBA, XLNX\n\n## Upcoming events for Tuesday, November 10th\n\n - Stock splits:\n\n    - SMLP @ **1:15**\n\n - Expected earnings:\n\n  AAME, AAP, ABEO, ADPT, AER, AFMD, AGTC, AIKI, AKRO, ALC, ALEC, ALT, AMK, AMTI, APTO, ARA, ARMP, ASH, ATHM, ATNM, AVEO, AVGR, BBDC, BBQ, BCEL, BDTX, BNTX, BOMN, BOXL, BPT, BRKS, BSY, BWL.A, CAAS, CAE, CELP, CFRX, CHFS, CHMI, CHRA, CHSCP, CLPT, CLRB, CLSD, CLSK, CNR, COCP, COGT, COHR, CPHC, CPIX, CPST, CRBP, CRIS, CRNX, CRSR, CRTX, CRWS, CTIC, CVET, CVV, CWCO, CXDO, CYAN, CYBR, DDOG, DHI, DMS, DMTK, DOX, DQ, DTIL, EGAN, ELMD, ELP, ELSE, EQ, ERJ, EVI, EVOL, EYEN, FAT, FBIO, FENC, FICO, FIXX, FLUX, FONR, FOXF, FPH, FRHC, FTEK, FUBO, FULC, FURY, FUSN, GALT, GBIO, GBLI, GEC, GEVO, GILT, GLOG, GLOP, GMDA, GO, GOSS, GRFS, GSAT, GSH, GTT, HAIN, HCAT, HOTH, HTGM, HTHT, ICON, IFS, IMOS, INSE, INTT, ISR, ITRM, JMIA, KOD, KODK, KRNT, LAC, LGL, LJPC, LOGC, LORL, LPCN, LPRO, LUMO, LUNG, LYFT, MARK, MBIO, MBRX, MCF, MDNA, MDRR, MDWD, MMX, MNDO, MODN, MOGO, MOR, MORF, MVO, MYO, NEON, NES, NEXT, NGM, NHC, NK, NOVT, NRBO, NSYS, NTIC, NTRP, NTWK, OCGN, OCN, OEG, ONCY, ONEM, ONTX, OPRT, PASG, PAYS, PBT, PECK, PFMT, PHIO, PLMR, PLRX, PMD, PNTG, POLA, PRPH, PRPL, PRSP, PRVL, PSTL, RADA, RCEL, RCMT, RDCM, RDVT, RESN, RIOT, RKT, RLGT, RMBL, ROK, RXT, SANM, SAVA, SCPH, SCYX, SHIP, SHSP, SILK, SILV, SJT, SNGX, SNMP, SNSS, SPKE, SRRK, SSKN, SSNT, STAF, STEP, STOK, STSA, SURF, SWTX, SYN, TAT, TCON, TCP, TCRR, TGTX, THCA, TIMB, TME, TRMD, TRQ, TXG, VCNX, VEC, VIE, VIR, VITL, VIV, VNRX, VSTM, VTSI, VXRT, WHLM, WILC, WISA, WMG, WSTG, XBIT, XELA, XGN, ZOM\n\n - Ex-div:\n\n  ACV, AIO, AROC, CBH, COG, DBL, DLY, DSL, EFL, EHT, ETR, EVF, FANG, GILT, GWB, HNNA, HPF, HPI, HPS, HTD, IVZ, KBH, LPLA, MATX, MSA, NCV, NCZ, NTB, OPY, PCI, PCK, PCN, PCQ, PDI, PEAK, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, POOL, PTY, PYN, PZC, RMD, SBUX, SHEN, SIMO, TBNK, VGI, VNOM, WTFC, XOM, ZION, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.765%)\n    - API Weekly Crude Oil Stock (previous: -8.010M)\n    - EIA Short-Term Energy Outlook\n    - FOMC Member Brainard Speaks\n    - IBD/TIPP Economic Optimism (previous: 55.2)\n    - JOLTs Job Openings (consensus: 5.590M, previous: 6.493M)\n    - NFIB Small Business Optimism (consensus: 102.2, previous: 104.0)\n    - Redbook (previous: 1.2%)\n    - Redbook (previous: 3.2%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, November 11th\n\n - Expected earnings:\n\n  ACER, ACIA, ACIU, ACST, ADNT, AGRO, AIRT, ALAC, ALNA, ANVS, APD, APEN, APG, APLT, ARCO, ARDS, ASND, ASTC, ATEX, ATLO, ATO, ATOS, ATTO, AWX, AXAS, BEAM, BEDU, BEST, BFRA, BKTI, BSGM, CARV, CBMG, CBPO, CCF, CCMP, CFBI, CHEK, CIB, CIH, CMCL, CMCM, CNFR, CODX, CVU, CYCC, CYD, CYRN, CZZ, DCTH, DOYU, DSSI, DYAI, EDAP, EDN, EMX, ENOB, ENS, ENSV, EPM, EPSN, ESSA, EVK, EVOL, EXPI, FOSL, FTHM, GGAL, GIB, GLAD, GOCO, GRNQ, GRWG, GSV, HI, HMG, HOLI, HUYA, HYRE, IDXG, IDYA, IGC, IMTX, IMVT, ISIG, ISNS, ITCB, JCTCF, JE, KMDA, KTRA, LINC, LINX, LMND, LND, LPL, LRMR, LYRA, MCEP, MCFT, MFC, MIRM, MIST, MLND, MLVF, MOSY, MUFG, NCNA, NEPT, NLTX, NSEC, NTN, NVEE, NVFY, NVGS, NVUS, NYMX, OFED, OM, ONCY, OPGN, OSW, PANL, PATI, PCOM, PCVX, PDSB, PEBK, PNBK, PRPO, PRQR, PTN, PTVE, PYPD, QLGN, RAVE, RDI, REYN, RHE, RLMD, RPRX, RVLV, SA, SANW, SCPE, SGRP, SIEB, SLGG, SLNO, SLP, SLRX, SMFG, SNDL, SNES, SONM, SPTN, SYNC, TCOM, TELA, TG, TGA, TGC, TRNO, TRT, TRVI, TTEK, USAS, VEL, VERX, VOC, VRCA, VRM, VYGR, WHLR, WTER, WVVI, XAIR, XELB, XPEL, ZYNE\n\n## Upcoming events for Thursday, November 12th\n\n - Stock splits:\n\n    - PDS @ **1:20**\n\n - Expected earnings:\n\n  AACG, AAU, ACHV, ACY, ADCT, ADIL, AEYE, AFIB, AGBA, AGE, AGRX, AHPI, AIHS, AIM, AKER, AKUS, ALTG, ALYA, AMAT, AMTX, AMWL, ANDA, ANY, APTX, AQN, ARL, ASLN, ATLC, AUPH, AVCO, AWH, AXLA, AXU, AYLA, AYTU, AZRX, BAK, BAM, BANX, BBI, BCOW, BHB, BIOC, BIOL, BIOX, BKYI, BLI, BLNK, BLU, BNGO, BRP, BSQR, BTAI, BTN, BW, BXG, BZH, CALT, CANG, CBLI, CBMB, CCNC, CDOR, CELH, CERC, CETX, CHCI, CJJD, CLRO, CLSN, CMPS, CNET, CREX, CRHM, CRTD, CSCO, CSSE, CTEK, CURI, CXDC, CZNC, DARE, DAVA, DDS, DESP, DGII, DGLY, DIS, DLB, DLPN, DRAD, DRIO, DTSS, DYNT, EAST, ECOR, EDRY, EFOI, ENR, EPC, ESP, ETON, EYES, FFBW, FLY, FMTX, FRD, FSEA, FSI, FSM, FTCH, GBR, GDRX, GHSI, GLG, GLMD, GLOB, GNLN, GNPX, GP, GPOR, GRVY, GSMG, GURE, GWGH, HAYN, HEPA, HFFG, HIMX, HJLI, HOOK, HQI, HRMY, HSDT, HSTO, HUSA, HYLN, IBIO, ICL, IFMK, IGIC, IGT, IMAC, IMV, INFU, INMD, INOD, INPX, INTZ, IOR, IPWR, IZEA, JAGX, JAMF, JOBS, JRSH, KB, KBNT, KFFB, KROS, LEDS, LEGH, LIFE, LMB, LMFA, LMPX, LPTX, LSF, LTRX, LWAY, MARPS, MBOT, MDLY, MEG, METX, MFG, MIC, MICT, MOTS, MPLN, MSN, MTOR, MTR, MYOV, MYSZ, NAII, NAK, NARI, NBAC, NBSE, NBY, NETE, NGVC, NICE, NNDM, NTIP, NVMI, NWGI, NYC, OBCI, OBLG, OCX, OGEN, OMEX, OPHC, OPNT, OSMT, OSS, PCSA, PDD, PFIN, PHAS, PHGE, PIH, PLAG, PLTR, PRT, PRTH, PXS, QRHC, RBCN, RDHL, REDU, REKR, RELV, RMED, RPTX, RSSS, RVP, SACH, SALM, SB, SBH, SBS, SCX, SDGR, SELF, SFT, SGBX, SHI, SINA, SJ, SLGL, SLS, SMTI, SNBP, SNCA, SNFCA, SNOA, SOLY, SONN, SPH, SRAX, SSRM, SSY, SSYS, STON, SUMR, SUNW, SVT, SWIR, SYPR, TAIT, TARA, TCDA, TCI, TDG, TENX, TGH, TGP, THMO, THRY, TIG, TK, TKAT, TKC, TMDI, TNK, TR, TRIL, TSEM, TTNP, TUFN, TYHT, U, UAMY, UAVS, UBOH, UFAB, UNAM, UONE, UONEK, USEG, USIO, VBFC, VEDL, VERB, VERY, VET, VISL, VIVE, VJET, VRME, WB, WF, WINT, WIX, WORX, WTT, XNET, XPEV, XSPA, YRD, YTEN, ZEAL, ZNTL, ZSAN\n\n - Ex-div:\n\n  ABST, ADS, AHC, ARCB, ASTE, AUB, AVK, BFST, BPRN, BRKL, BSET, BSM, BWFG, CCD, CGNX, CGO, CHI, CHW, CLCT, CPZ, CSQ, CTVA, CVCY, CVGW, CWBC, DUK, EBMT, EMR, ENB, EQNR, EVA, FCFS, FMO, FNWB, GBAB, GCBC, GDV, GGM, GHY, GLW, GNT, GOF, GRC, GSK, GUT, HON, HP, HTLF, IHIT, ISD, IVH, JBGS, JCO, JEF, JEMD, JFR, JGH, JHAA, JHB, JLS, JOE, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LAD, LGI, LLY, LPX, MMS, MSCI, MSEX, MSVB, MUSA, NAC, NAD, NAN, NBB, NCB, NDMO, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NYV, NZF, OBNK, ODC, OMP, OPP, OTTR, OXLC, OXSQ, PCSB, PFC, PFS, PGZ, RDS.A, RDS.B, RFM, RGR, RIV, RMI, RMM, RSF, RTX, SAL, SALT, SCHW, SHBI, SHW, SIGI, SJM, SJR, SMBC, SSB, SSBI, TAIT, TCF, TFC, TFX, TSBK, UPS, USA, V, VBF, VTA, VVR, WAB, WAL, WD, WEC, WRK, WTRG, XEC\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.578%)\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.085%)\n    - CPI (consensus: 0.2%, previous: 0.2%)\n    - CPI (consensus: 1.3%, previous: 1.4%)\n    - CPI Index, n.s.a. (consensus: 260.59, previous: 260.28)\n    - CPI Index, s.a (previous: 260.21)\n    - CPI, n.s.a (previous: 0.14%)\n    - Chicago Fed President Evans Speaks\n    - Cleveland CPI (previous: 0.1%)\n    - Continuing Jobless Claims (consensus: 7,200K, previous: 7,285K)\n    - Core CPI (consensus: 0.2%, previous: 0.2%)\n    - Core CPI (consensus: 1.7%, previous: 1.7%)\n    - Core CPI Index (previous: 269.26)\n    - Crude Oil Imports (previous: 0.560M)\n    - Crude Oil Inventories (previous: -7.998M)\n    - Cushing Crude Oil Inventories (previous: 0.936M)\n    - Distillate Fuel Production (previous: 0.149M)\n    - EIA Refinery Crude Runs  (previous: 0.164M)\n    - EIA Weekly Distillates Stocks (previous: -1.585M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.4%, previous: 0.7%)\n    - FOMC Member Williams Speaks\n    - Federal Budget Balance (consensus: -124.0B, previous: -125.0B)\n    - Gasoline Inventories (consensus: -0.871M, previous: 1.541M)\n    - Gasoline Production (previous: -0.023M)\n    - Heating Oil Stockpiles (previous: -0.395M)\n    - IEA Monthly Report\n    - Initial Jobless Claims (consensus: 738K, previous: 751K)\n    - Jobless Claims 4-Week Avg. (previous: 787.00K)\n    - Real Earnings (previous: 0.2%)\n\n^^^^2020-11-09",
        "created_utc": 1604919625,
        "id": "gbpii9c",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1604948425.0
    },
    {
        "author": "abcomputer",
        "body": "IBM cloud?",
        "created_utc": 1604247716,
        "id": "gasy3c0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604276516.0
    },
    {
        "author": "Vast_Cricket",
        "body": "**Spce** is legit. Keep in mind that is a rocket science company. Suppose gov't did not give the clearance for 2 years we understand they are ready can wait for 2 years.  So I will be around so long there are investors willing to keep the company running.\n\nAs for the eV controversial giant, this is not quite finished. Personally even if they have no product or schedule they will linger around awhile. They can use their patents sue every manufacturer in eV and often they generate revenue from those manufacturers as hush up money.\n\nSome years ago, a hard disk manufacturer making 3.5\" hard drive business was failing. It had a strong intellectual property department sued every hard disk manufacturer in the 3.5\" drive claiming patient infringement. In 1990 IBM was hit with a lawsuit as an inventor of the drive and sue by a smaller player. It paid some hush money. Seagate was dismissed in 1997, sue again and paid [$45 M to R+ as late as 2000](https://www.electronicsweekly.com/news/archived/resources-archived/seagate-to-pay-rodime-45m-to-settle-suit-2000-01/).   R+ only exists as a shell company and its share price soared on news of the patent settlement.  I think **NKLA** can remain as a shell company with its patent portfolio covering designs that covers most vehicles built electric or not. [It sue Tsla earlier](https://www.forbes.com/sites/alanohnsman/2020/04/20/teslas-effort-to-short-circuit-nikola-lawsuit-fizzles-as-patent-office-denies-door-argument/?sh=44dc21a45d78). That Tesla copied NKLA on shield, cab shape and windshield design sued for $2B. If you think you will prosper you can bag hold your stocks.",
        "created_utc": 1604267257,
        "id": "gau1cea",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604296057.0
    },
    {
        "author": "Jarlaxle_rigged_it",
        "body": "Ones that have been performing weak lately.. that shows skepticism..  also high P/E ratio. e.g Tesla was the obvious choice and i still didn't hop on the run down cause it was all too far/was working. Also look at distance to next support or so.  \n\n\nCandidates i have for next week are still Tesla, NVDA, IBM, NFLX",
        "created_utc": 1604238515,
        "id": "gasisd6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604267315.0
    },
    {
        "author": "Shklyar1902",
        "body": "Honestly, in the current market, it's far more speculative then in the past (*cough* Tesla *cough*)\nNvidia would be a good hold it for a while stock, just in my eyes they seem to be heading the route of IBM, going more into the commercial business (cloud storage, servers...)  which will cause an initial drop in stock",
        "created_utc": 1604443975,
        "id": "gb1zqaa",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604472775.0
    },
    {
        "author": "peter-doubt",
        "body": "Have you collected (not cashed) the checks? \n\nAre you the executor ( or she?)\n\nCopy them .  Send the copy back to their investor relations dept., explaining the predicament.\n\nIBM doesn't want it, and doing so defines the nightmare *they* have.. sending you reports every year at $20  plus administering your unwanted account.. you don't want it, nor do they! \n\nI'd start there. If you had the certificate, selling costs money, too. I'd find a charity and give it away for the deduction.",
        "created_utc": 1604318866,
        "id": "gaw0ep9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604347666.0
    },
    {
        "author": "Summebride",
        "body": "I'd discourage hyperbole like \"longer than your lifetime\".  Statements like,that haven't aged well for Xerox, Commodore, IBM, GE, Blackberry, Enron, Exxon, Blockbuster, and more.",
        "created_utc": 1604503122,
        "id": "gb4fq97",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604531922.0
    },
    {
        "author": "FifiandColumbo",
        "body": "They let her cash/deposit checks without his signature for a few months after he passed away, but it's been a year and a half, and now they're telling her any checks need to be in her name.  She's a sweet little old lady, though, so maybe she can sweet talk them into it. \n\nCalling IR at IBM is worth a try. Thanks for the suggestion.",
        "created_utc": 1604425161,
        "id": "gb0wge7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604453961.0
    },
    {
        "author": "Fractadactyl",
        "body": "Ibm dip",
        "created_utc": 1604425895,
        "id": "gb0y183",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604454695.0
    },
    {
        "author": "ReflectAA",
        "body": "Why can’t your mom cash your dads checks? That is the most unusual part of this. Were they never married? It might be easier to bring his death certificate to a bank and explain the situation and see if they allow her to cash his checks as the surviving spouse. \n\nI would not bother with the Compushare BS. If the bank doesn’t work you can try contacting IR directly for IBM and tell them that Compushare is being intentionally difficult. I’ve never tried that myself though it may lead nowhere.",
        "created_utc": 1604404699,
        "id": "gazvw05",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604433499.0
    },
    {
        "author": "djpitagora",
        "body": "IBM, Apple and Microsoft disagree.",
        "created_utc": 1604410283,
        "id": "gb03d41",
        "score": 1,
        "subreddit": "investing",
        "created": 1604439083.0
    },
    {
        "author": "036Gooddaysir036",
        "body": "IBM is also an excellent buy. It just recently became an Aristocrat since it increased its dividend for 25 years now. So both, both is good. But if you're only considering one or the other then it is going to come down to which you believe has a better business model and is more likely to continue to increase their dividend payout.",
        "created_utc": 1604299457,
        "id": "gaviemp",
        "score": 1,
        "subreddit": "investing",
        "created": 1604328257.0
    },
    {
        "author": "thewimsey",
        "body": "MSFT wasn't  a computer company. It was a software company. IBM was a computer company.\n\nThe brilliance of MSFT was in - and this seems weird today - realizing that a company could make money just selling software. A ton of money. More money than computer makers could make by themselves. This was a kind of radical idea at the time.\n\nJobs was very successful at the computer business; the Apple was the bestselling PC from 1977-1982.\n\nApple wasn't killed by MSFT, it was killed by IBM, which built a PC from more or less off the shelf parts allowing *anyone* to build a clone. (Which, incidentally, would run windows). \n\nApple's computers couldn't compete with PCs built with off the shelf parts. It's not about Jobs being bad; it's about other people being better.\n\nIBM's approach almost immediately priced *them* out of the PC market, leaving the profits to MSFT and intel (and a tiny bit for clone makers, who mostly ended up in a low margin commodity business).",
        "created_utc": 1604280445,
        "id": "gauq3df",
        "score": 1,
        "subreddit": "investing",
        "created": 1604309245.0
    },
    {
        "author": "lucky_ducker",
        "body": "IBM used to be the classic \"widows and orphans\" stock. New stockbrokers were told that they could never lose their jobs by losing clients' money in IBM.",
        "created_utc": 1604445328,
        "id": "gb22b5c",
        "score": 1,
        "subreddit": "investing",
        "created": 1604474128.0
    },
    {
        "author": "Lie-Minimum",
        "body": "IBM and INTC",
        "created_utc": 1604713824,
        "id": "gbetpab",
        "score": 1,
        "subreddit": "investing",
        "created": 1604742624.0
    },
    {
        "author": "DarkStarOptions",
        "body": "&gt;It does limit your loss by a half, but it does increase your probability of loss by a factor of two as well. Now that you close the spread once it gets touched, your probability of loss is now the probability of touching the short strike (which is approximately twice the probability of being ITM).\n\nAs opposed to waiting to see if the stock rebounds off the short strike?  \n\nMakes sense.\n\n&amp;#x200B;\n\nI opened a spread against IBM about 3 weeks ago, a 35 day spread.  It initially dipped below the short strike but I didn't freak out because I had 30 days for it to go back up....and it did.  Now my spread is OTM and profitable and has been for about a week.  \n\n&amp;#x200B;\n\nThis guy was putting forth a strategy of writing a spread with a short strike of 20 delta for &lt; 14 days.  I guess the thought is if the stock moved that much in a short amount of time to test the short strike, probably best to just close it for a loss rather than manage it with just a few days left until expiration.  That's my guess but I don't know because I didn't ask him.",
        "created_utc": 1604733204,
        "id": "gbflvpd",
        "score": 1,
        "subreddit": "options",
        "created": 1604762004.0
    },
    {
        "author": "TheGoodBunny",
        "body": "Define \"safest\" and \"long term\" for yourself. No single company is safe forever. 10-15 years ago you would have picked Ford, IBM, Exxon as \"safest for long term\". For buy-and-forget you will be better off investing in an index.",
        "created_utc": 1604779663,
        "id": "gbhio59",
        "score": 1,
        "subreddit": "investing",
        "created": 1604808463.0
    },
    {
        "author": "ascendtofutility",
        "body": "It could happen over a period of five years or so. Yes it's unlikely. How likely was it for the Lehman bros and bear Stearns to collapse? How likely was it for IBM to fuck up and get knocked off the top? What I'm trying to say, there's more risk indexing right now than there ever was. My personal opinion, we are in a coronavirus bubble that will pop in a year or so when people can allocate money to other equities safely. Money doesn't disappear, it just moves around.",
        "created_utc": 1604769111,
        "id": "gbgw3mn",
        "score": 1,
        "subreddit": "investing",
        "created": 1604797911.0
    },
    {
        "author": "Kashm11r",
        "body": "BAM, FB, GOOG, IBM all have multi billion dollar investments in India. Major energy companies like Sunpower, First Solar, Canadian Solar, GE, Vestas as well.",
        "created_utc": 1605023076,
        "id": "gbu47vp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605051876.0
    },
    {
        "author": "skilliard7",
        "body": "&gt; Bitcoin has plenty of intrinsic use. These include borderless transfer without needing to convert to to local currency (cant do this with Western Union), black markets, safe haven from oppressive governments, sending aid to citizens of oppressive governments, ways to bypass import sanctions (see Iran), and more. Just because you don't have intrinsic use for BTC, doesn't mean others don't (see link below).\n\nYou can do this with Ethereum, Litecoin, Monero, Vertcoin, even Dogecoin. I agree cryptocurrency and blockchains are useful but I don't see Bitcoin as a long term store of value. It's far more volatile than precious metals and also intangible.\n\nIBM is making huge strides towards quantum computing, and once they pull it off, Bitcoin will become worthless once the public/private key cryptography is cracked and anyone with access to a quantum computer can simply sign transactions to send coins to themselves. We're easily within 10 years at this point, possibly less.\n\n&gt;This is like saying anyone can create a better social network than Facebook and therefore Facebook has no value\n\nWhat about Myspace? It came first.\n\n&gt;Wrong. Best case scenario is that BTC continues to be added to the balance sheets of large, publicly traded companies\n\nLike 1 or 2 companies that hold it as a tiny position. I think Overstock and Square? Most companies that accept it just use Bitpay or Coinbase to instantly sell it.",
        "created_utc": 1605023410,
        "id": "gbu4wlq",
        "score": 1,
        "subreddit": "investing",
        "created": 1605052210.0
    },
    {
        "author": "dampon",
        "body": "You know that decades ago that GE, Kodak, Xerox, IBM, Sears, etc. were the Amazons of those time periods right?\n\nHow are they doing today?\n\nCan't use hindsight to pick a stock. And you can't assume just because Amazon is on top now it will continue to be forever.",
        "created_utc": 1604954794,
        "id": "gbr83vn",
        "score": 1,
        "subreddit": "investing",
        "created": 1604983594.0
    },
    {
        "author": "Applesauce9210",
        "body": "If you want individual stock exposure, XOM. Maybe IBM if you’re looking for tech tilt",
        "created_utc": 1605011702,
        "id": "gbtl6hi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605040502.0
    },
    {
        "author": "audion00ba",
        "body": "&gt; The fastest chip today is built by IBM\n\nWhich one would that be?",
        "created_utc": 1604848088,
        "id": "gbm8e7x",
        "score": 1,
        "subreddit": "investing",
        "created": 1604876888.0
    }
]