[
    {
        "author": "gnuacc",
        "body": "FTEC is pretty safe. single stocks: MSFT, GOOGL, LRCX.",
        "created_utc": 1605485459,
        "id": "gcfxs6j",
        "permalink": "/r/RobinHood/comments/jur9qt/best_safe_long_term_growth_stocks/gcfxs6j/",
        "score": 7,
        "subreddit": "RobinHood",
        "created": 1605514259.0
    },
    {
        "author": "dscg24",
        "body": "ASML/LRCX... they make the proprietary tooling for all chip manufacturers",
        "created_utc": 1606053313,
        "id": "gd7u0il",
        "permalink": "/r/wallstreetbets/comments/jyvo8s/mrvl_next_great_chip_play/gd7u0il/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1606082113.0
    },
    {
        "author": "MMOAddict",
        "body": "IKR who trades in Lam Research.. more like Lame Research?",
        "created_utc": 1605752491,
        "id": "gcsdtfo",
        "permalink": "/r/wallstreetbets/comments/jwk8bh/woke_up_a_millionaire_thanks_to_crsr_nice/gcsdtfo/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1605781291.0
    },
    {
        "author": "Summebride",
        "body": "I assume you mean LRCX?  I've rode them forever, but finally took profits last week at 430.  Nothing against them at all and wouldn't be surprised to see them continue.  However it seems to me like semiconductors at least rhyme with cyclical, so perhaps their recent oversized performance might revert to mean.  But even in a better case scenario of moderate gains, I'm wanting to redeploy to something that's just starting its own explosive run.",
        "created_utc": 1605495355,
        "id": "gcggsxj",
        "permalink": "/r/stocks/comments/juspqu/if_all_youre_looking_for_growth_stocks_then_here/gcggsxj/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1605524155.0
    },
    {
        "author": "verydigbick",
        "body": "I've been holding LRCX since early 2018. Over 120% in gains. Really enjoyed the great run past couple weeks but don't know how much more it'll grow. Any other growth companies you are looking at to replace LRCX?",
        "created_utc": 1605498514,
        "id": "gcgmjb8",
        "permalink": "/r/stocks/comments/juspqu/if_all_youre_looking_for_growth_stocks_then_here/gcgmjb8/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1605527314.0
    },
    {
        "author": "Summebride",
        "body": "Micron up 20% in a month, and you would also have missed LRCX monster move.",
        "created_utc": 1605609340,
        "id": "gclk4v4",
        "permalink": "/r/stocks/comments/jvp9wd/rstocks_daily_discussion_technicals_tuesday_nov/gclk4v4/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1605638140.0
    },
    {
        "author": "mechtech",
        "body": "To break down some clean energy trends I have exposure to that I'd like to share:\n\nWind Turbine component suppliers and manufacturers. TPIC, BWEN.\n\nOffshore Wind.\n\nAdditionally:\n\nSilicon Lithography EUV transition: ASML, KLAC, LRCX\n\nBuilt In America - Likely the only meeting ground for a Republican Senate and Biden for upcoming fiscal spending. TPIC and BWEN share this narrative. I also hold INDS which fits into this, as well as COVID recovery which is another broad trend that I hold, if you'd call it a trend.\n\nLIDAR is another interesting sub-trend of autonomy. I honestly do not like discussing it on Reddit because it immediately dovetails into discussion of lvl 4/5 self driving autos (which is a small subset of LIDAR TAM) and Tesla (which as a ticker grossly overdiscussed and therefore not interesting), and then additionally the companies involved went public through SPAC and are have the typical absurd valuation and penny stock retail crowd. Rough all around. That said, worth reading the actual investor presentations and projections, and the Luminar investor day presentation is especially great with over an hour of technical Q&amp;A at the end. Due to the extreme volatility of SPACs, average in over a very long period to build a position and cut volatility exposure. We're talking build out a position over a year+. It is what it is.\n\nMaterials used in the green transition is almost a trend in and of itself. Of course everyone knows Lithium, but the numbers and projections behind copper and some other materials are quite interesting as well.",
        "created_utc": 1604778404,
        "id": "gbhetvm",
        "permalink": "/r/investing/comments/jpt7nr/master_list_future_trends_to_buy_right_now/gbhetvm/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604807204.0
    },
    {
        "author": "Summebride",
        "body": "Same here.  I swapped it out for PLTR when it dipped to sub-$14 last week.  I still like the Lam Research company, but like you, I questioned whether it can keep doubling.  If there were a big correction it would certainly be on my shopping list.  I always get burned holding semis for too long and I needed a source of funds for PLTR.",
        "created_utc": 1605532664,
        "id": "gchq7pf",
        "permalink": "/r/stocks/comments/juspqu/if_all_youre_looking_for_growth_stocks_then_here/gchq7pf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605561464.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "ASML, AMD, TSM, LRCX, ENPH.",
        "created_utc": 1605297329,
        "id": "gc6mw51",
        "permalink": "/r/stocks/comments/jtfs5i/what_is_the_one_stock_in_your_portfolio_that_you/gc6mw51/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605326129.0
    },
    {
        "author": "upsidedownbovine",
        "body": "TSM and LRCX calls",
        "created_utc": 1604345660,
        "id": "gaxefti",
        "permalink": "/r/wallstreetbets/comments/jmsbzu/one_more_thing_aapl_event_coming/gaxefti/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604374460.0
    },
    {
        "author": "upsidedownbovine",
        "body": "LRCX 430C",
        "created_utc": 1605214394,
        "id": "gc32s8n",
        "permalink": "/r/wallstreetbets/comments/jssu2g/daily_discussion_thread_for_november_12_2020/gc32s8n/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605243194.0
    },
    {
        "author": "robswins",
        "body": "If you timed it right at least you got some nice premiums. Covered call I sold on LRCX is currently sitting at -483% return though, oops!",
        "created_utc": 1605344388,
        "id": "gc8m67q",
        "permalink": "/r/investing/comments/jtoh2z/sp_500_jumps_more_than_1_to_a_record_close/gc8m67q/",
        "score": 1,
        "subreddit": "investing",
        "created": 1605373188.0
    },
    {
        "author": "upsidedownbovine",
        "body": "LRCX continues to be my little gem. Too bad I sold my 400C last week…",
        "created_utc": 1605542454,
        "id": "gci7b0v",
        "permalink": "/r/wallstreetbets/comments/jv52hs/daily_discussion_thread_for_november_16_2020/gci7b0v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605571254.0
    },
    {
        "author": "upsidedownbovine",
        "body": "Any thoughts on LRCX? I figure this Apple “one more thing” is going to be a chipset announcement and Lam will be involved.",
        "created_utc": 1605013944,
        "id": "gbto5qd",
        "permalink": "/r/wallstreetbets/comments/jriieh/daily_discussion_thread_for_november_10_2020/gbto5qd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605042744.0
    },
    {
        "author": "upsidedownbovine",
        "body": "LRCX is at 420.69",
        "created_utc": 1604930009,
        "id": "gbpuwkn",
        "permalink": "/r/wallstreetbets/comments/jqv478/daily_discussion_thread_for_november_09_2020/gbpuwkn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604958809.0
    },
    {
        "author": "nu-ku-lar",
        "body": "I recently sold at 55. Bought in October for around 40. It is a good stock for swing trades.\n\nWhen I look at the margin and ROE and of course the growth of MU, there are better stocks to be had.\n\nCurrently holding TSM and LRCX for Semiconductor stocks.",
        "created_utc": 1604834425,
        "id": "gbljqm0",
        "permalink": "/r/stocks/comments/jpxywy/anyone_still_like_micron_mu/gbljqm0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604863225.0
    },
    {
        "author": "upsidedownbovine",
        "body": "LRCX or TDD",
        "created_utc": 1605916943,
        "id": "gczv4xx",
        "permalink": "/r/wallstreetbets/comments/jxxiry/weekend_discussion_thread_for_the_weekend_of/gczv4xx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605945743.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "I noticed AMD around 2017, I think a year after Lisa Su came in. I saw the Ryzen product and looked into the company as a whole, then looked into their competitors. Based on that information, I predicted a price of $75 for AMD at that time. Today, AMD is ~$90.\n\nI don't look at PE ratio much. I look at the company website, how they represent themselves to themselves, what products they sell, who do they work with, and revenue over time. Then I look at their competition and see if there is a market they're dominating in, is their competition capable of competing? Who's their customer?\n\nBased on that I purchased AMD. Intel seemed incompetent and incapable of competing. AMD is, and realizes that they can't run their own fab, so they relied on outside sources for that and they did excellent. Engineering leadership led them to success. Now they're going to continue to dominate and lead.\n\nI did this exact search over this past week on Lam Research and ASML, along with their competition. I have a strong belief in both of these companies, and I bought even though they are now at an all time high. In my mind, these companies are able to compete and will dominate this EUV market for a VERY long time. There used to be an argument for Lam Research to not be able to help in EUV, but they recently made a dry method to make things faster. That's innovative and competitive, they introduced themselves as a need in a market they were once recognized as not being able to penetrate.\n\nI stop investing when I see better opportunities elsewhere, I sense a worrisome market and need to keep cash aside, or I reach the price target and sense that the company is no longer able to compete. Again, doing the same research I did above but periodically and keep up with the news for the companies I'm invested in, and in their competition.\n\nIt requires time and energy to do all of this. I hope this helps.",
        "created_utc": 1604686037,
        "id": "gbdb2jh",
        "permalink": "/r/stocks/comments/jom17r/cant_make_sense_of_this_market_so_im_still_doing/gbdb2jh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604714837.0
    },
    {
        "author": "the13thrabbit",
        "body": "LRCX an even better semi equipment stock",
        "created_utc": 1605190583,
        "id": "gc1o647",
        "permalink": "/r/wallstreetbets/comments/jssu2g/daily_discussion_thread_for_november_12_2020/gc1o647/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605219383.0
    },
    {
        "author": "DamnGoodCheeze",
        "body": "It's all growth stocks and some dividends at this point.  \nHere's my top 10: AAPL, NVDA, STOR, MSFT, MCD, TSM, ACN, DLB, LRCX, PLTR 🤑",
        "created_utc": 1605572288,
        "id": "gck40yx",
        "permalink": "/r/wallstreetbets/comments/jvg43g/tell_all_the_homies_im_coming_back_for_my_money/gck40yx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605601088.0
    },
    {
        "author": "the13thrabbit",
        "body": "Lam research will go down as my best buy. Regret not getting more",
        "created_utc": 1604939093,
        "id": "gbqbjnt",
        "permalink": "/r/wallstreetbets/comments/jqv478/daily_discussion_thread_for_november_09_2020/gbqbjnt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604967893.0
    },
    {
        "author": "BigBrianBrand",
        "body": "Long response coming in just a heads up\n\nEasier said than done for sure. It helps to have good outlets of information like twitter, or reading the various stock subreddits, or talking to other investors  to lead you in the right direction. \n\nBuying opportunities aren’t always there, sometimes you have to wait for a good opportunity, and capitalize before the window closes and the stock runs up.\n\nIm assuming based on your reply, you believe that to make more money requires taking on more risk...which isn’t always true and is a logical fallacy in the stock market. There are plenty of decent floor, huge upside stock prices out there. You just have to hope you end up finding the right information that lets you figure out where the stock market is wrong (and no, it doesn’t have to be insider trading because the market sucks at pricing intuition). \n\nA Great recent example is CVS. CVS has continued to generate 15%ish net income growth over the last 5 years, yet the stock price keeps falling despite solid financials, because of both fears: that amazon will overtake pharma retail, and Medicare for all will be legislated by the government causing CVS’ Medicare Part D subscriptions to be wiped out. CVS delivers drugs via mail orders, and is transitioning to healthcare with its Aetna acquisition so thinking amazon will run CVS out of business is a joke. Also if you’ve followed politics and looked at voter data, it’s obvious Medicare for all is not a popular government program by politicians and citizens.\n\nThere are other great examples like back in 2018 when Facebook crashed -40% in July because their operating costs were going up 40% as they were throwing more money into security after the Cambridge analytica scandal in April of that year. Yet anyone that followed Facebook closely knew that targeted ad growth was much higher than 40% which makes up for the cyber security costs. \n\nAnother great example was the September-December 2018 time period when the Trump tariff war with China was going on. There were irrational fears that we would stop doing business with China and companies such as semi conductors were screwed... Obviously Trump wouldn’t damage our economy since that wouldn’t get him re-elected so the fears were non-existent. There were several companies with great financials that had their stock price tank like Apple and Lam Research, that have 4x’ed their stock price in the 2 years since then.",
        "created_utc": 1605803522,
        "id": "gcuc44i",
        "permalink": "/r/investing/comments/jx46if/newbies_if_you_convinced_yourself_to_buy/gcuc44i/",
        "score": 1,
        "subreddit": "investing",
        "created": 1605832322.0
    },
    {
        "author": "Magabeef",
        "body": "Thank you! Have shares in around 22 companies.\n\nMost of my gains are from Tesla, Nvidia, Lam Research and Digital Turbine. In the March dip also threw in around 3k in cruiseliners, boeing and wynn.",
        "created_utc": 1606568846,
        "id": "gdv8xdh",
        "permalink": "/r/wallstreetbets/comments/k2n77i/started_trading_around_1_year_ago_dont_have_the/gdv8xdh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606597646.0
    },
    {
        "author": "HypersonicHobo",
        "body": "Amazon, AWS comprises a colossal amount of their net revenue and is only going up. If I could buy just AWS without amazon retail I would. Even then its worth it.\n\n&amp;#x200B;\n\nAfter that go hardware. AMD for their EPYC processors, nvidia for their A100 and Tesla lineups. \n\n&amp;#x200B;\n\nAfter those go for the companies that build those chips. Correction 'company'. TSMC who practically monopolizes production of high end chips of the 7nm and soon to be 5nm processes (smaller is much better).\n\n&amp;#x200B;\n\nAfter that, the companies that build the machines that make the processors. ASML who builds the lithography machines and Lam Research (LRCX) that does the wafer processing. \n\n&amp;#x200B;\n\nI like owning supply chains.",
        "created_utc": 1605113399,
        "id": "gby71ty",
        "permalink": "/r/investing/comments/js7hdo/which_big_data_stocks_do_you_recommend_to_buy_hold/gby71ty/",
        "score": 1,
        "subreddit": "investing",
        "created": 1605142199.0
    },
    {
        "author": "Brazilll",
        "body": "AMAT, ASML, LRCX, SNPS, CRSP, EDIT, NTLA, BEAM, NVTA, ILMN, U",
        "created_utc": 1606225850,
        "id": "gdfws3g",
        "permalink": "/r/stocks/comments/k008sn/what_are_some_stocks_you_deeply_believe_in_not/gdfws3g/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606254650.0
    },
    {
        "author": "Jwceltic5",
        "body": "Not discrediting TSM’s position in the supply chain, but you’re right. They don’t design or manufacture any of their equipment. It’s all from AMAT, LRCX, ASML, etc. So those suppliers have pricing power.",
        "created_utc": 1605412078,
        "id": "gcc1jal",
        "permalink": "/r/stocks/comments/jue3xa/tsmcs_planned_capacity_expansion/gcc1jal/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1605440878.0
    },
    {
        "author": "BigBrianBrand",
        "body": "The issue with investing in individual stocks for their dividend is that you will never beat the market this way while taking on the general risk of investing in individual companies.\n\nThe Stock Market will generally price a stock with a good paying dividend really high to limit your returns. Coke is the most staple dividend stock out there, and it only returns a dividend that's 5% of its stock price (5% dividend yield). The S&amp;P500 historically has returned 9% on average. The dividends have less volatility since it's a consistent 5% meanwhile the S&amp;P500 could have 5 years where the annual return is -1%, 3%, 30%, 15%, -2% (comes out to 9% on average over 5 year time span). But if you're just buying and holding then it makes sense just to buy the S&amp;P500.\n\nThe risk with dividends is that during tough times the first thing a company will cut to save money is the dividend. Typically the stock price falls along with the dividend. So if Coke were to suddenly crumble (let's say news/studies came out suggesting Coke causes cancer) and people stopped buying Coke then not only does the 5% dividend go away, but the stock price will probably fall 20+%.\n\nThere are instances where a company has financially plateu'd or been in a minor decline, but they have not slashed their dividend because they know investors will jump ship the moment their dividend is slashed. So a stock price drop but a maintained dividend causes the dividend yield to shoot up which makes it really attractive...the issue is that assuming the stock price drop is well deserved and not an overreaction by the market. If the company's financials continue to crumble then the dividends will be getting slashed eventually. Gamestop and General electric the past several years are great examples of why investing just for a company's dividend is not a good strategy.\n\nThe trick to beating the market is to not focus on dividends, but instead focus on how a company's net income growth % annually is performing relative to changes in the stock price. If a company's net income growth yearly is 20% on average...and the stock price is only growing 5% on average then you will probably make more money investing there because the stock price will eventually catch up and grow at a 20% rate as well (15% net gain which beats out a 5% dividend). Apple and Lam Research in late 2018, and CVS this past year are great examples of great buying opportunities where the stock price was way lower relative to the company's net income growth %, and eventually the stock prices shot up to reflect the financial growth.",
        "created_utc": 1605290910,
        "id": "gc69smx",
        "permalink": "/r/investing/comments/jthaq0/does_is_make_sense_to_start_with_base_stocks/gc69smx/",
        "score": 0,
        "subreddit": "investing",
        "created": 1605319710.0
    },
    {
        "author": "rumcatto",
        "body": "I'm 26 with no debt and I want to put 15k into just one or two high growth stocks. My aim is to (ideally) double my money within a year. For this specific sum, I'm willing to take risks. \n\nMy current holdings are: 50% IWDA and the rest spread evenly through ADBE LRCX CRM DKNG MSFT.",
        "created_utc": 1605664804,
        "id": "gcodi5b",
        "permalink": "/r/investing/comments/jvrx8a/daily_advice_thread_all_basic_help_or_advice/gcodi5b/",
        "score": -1,
        "subreddit": "investing",
        "created": 1605693604.0
    },
    {
        "author": "robmafia",
        "body": "???\n\namd did purchase them.  at a bad price.  at an awful conversion rate.  at the stock's expense.\n\n($35B based on 10/8 valuation, xlnx shares will convert to amd shares at a rate of 1:1.72)\n\ngreat deal for xlnx shareholders/autists with calls.  \n\nawful assraping for amd share/callholders",
        "created_utc": 1604440456,
        "id": "gb1sq1b",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb1sq1b/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604469256.0
    },
    {
        "author": "BoardButcherer",
        "body": "xilinx buyout bullish as fuck. Intel's over there in the corner selling off fabs and industry arms, AMD is buying big players.",
        "created_utc": 1604345452,
        "id": "gaxe067",
        "permalink": "/r/wallstreetbets/comments/jmto48/dear_amazon/gaxe067/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604374252.0
    },
    {
        "author": "Boomtown626",
        "body": "Tech is facing some headwinds right now in terms of the broader market reevaluating the increased valuations this year, and AMD's recent purchase of XLNX diluted the shares a bit. I hadn't planned on getting in originally, but those two things together I think have amplified this dip a bit, and the XLNX purchase is a long-term win for sure. \n\nIf you can stomach the idea that it could be down 5 or 7 percent six weeks from now (no specific reason to say that, just acknowledging the possibility), and your response to that would be to buy a little more if it happens, then yeah, I think AMD has some solid long-term potential. Just make sure that you plan on sticking around until the XLNX purchase goes through (end of 2021), plus a few more months. That will be the way to maximize your value, assuming the timeline and risk profile fit your investment strategy.",
        "created_utc": 1604428739,
        "id": "gb1423y",
        "permalink": "/r/stocks/comments/jn6j76/rstocks_daily_discussion_technicals_tuesday_nov/gb1423y/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604457539.0
    },
    {
        "author": "Charlietango2007",
        "body": "Well, after running around the house screaming like a mad idiot for hours on and pulling out my hair thinking about going out in the front yard dousing myself with gasoline and lighting my self on fire.\nI've come to the sad realization that Nokia is just a business they're doing a lot of incredible things you think it would hit the stock price through the roof or to the Moon as they say. But they're also spending a hell of a lot of money to get all this other crap done. I have January calls it'll probably expire worthless. I've come to accept that unless Microsoft or the government or somebody buys a company which unfortunately is not for sale. But then again everything has its price. Including me because I've been giving $5 blow jobs behind the Wendy's dumpster near my house just to make ends meet.\nI've already lost my half my portfolio which is about $80,000 thank you AMD for moving your earnings date without telling anyone and buying xilinx. And now dunkin' donuts is going private and I knew about it and I didn't buy any calls or puts or any goddamn thing.\nThe only advice I can give you is stay out of this for a while or buy leaps for 2022. Nokia doesn't move enough to day trade you're better off investing in Erickson or Comcast or T-Mobile. Even Qualcomm I stay away from AT&amp;T though period well good luck with your investment you can always buy Tesla. I just bought Amazon and the price went down even though earnings were through the roof. The stock market is just not stable right now it's almost as if Trump is running that also as well as the country period both are in very sad state. Put your money in the bank and leave it there for a while you're better off period again this is only my opinion or is everyone says the mad ravings of a madman Good luck Chuck. Cheers",
        "created_utc": 1604287869,
        "id": "gav2z46",
        "permalink": "/r/options/comments/jmfobx/nok_call_holders_plans/gav2z46/",
        "score": 1,
        "subreddit": "options",
        "created": 1604316669.0
    },
    {
        "author": "bmjcoding",
        "body": "My understanding is Xilinx will help the future of AMD (stocks in this case), not necessarily immediate. With the acquisition of Xilinx, AMD becomes more of a threat to its rivals (Intel &amp; NVIDIA) in the data center sector. Unlike your average consumer (AMD vs Intel vs NVIDIA), data centers will always prefer price:performance rather than simple branding. If this merge works in AMD’s favor, in time data centers will begin to adopt AMD architecture over NVIDIA (if price:performance is reasonable) thus increasing overall profit.",
        "created_utc": 1604337261,
        "id": "gawwk4l",
        "permalink": "/r/investing/comments/jmqzqr/nasdaq_amd_week_45/gawwk4l/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604366061.0
    },
    {
        "author": "TheFatality1",
        "body": "If only Xilinx didn't exist...",
        "created_utc": 1604336387,
        "id": "gawup7i",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gawup7i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604365187.0
    },
    {
        "author": "moneygardener",
        "body": "Have any of you guys listened to the podcast \"WSJ Tech News Briefing\"?\n\nA couple days ago they had a piece on mergers and aquisitions in the chipmaker industry. AMD/XLNX and MRVL/IPHI was being discussed. They also discussed Intel's production difficulties, albeit with an obvious shortcoming in the technical understanding. I was giggling at the \"expert\" responses from the reporters. How can they land a job in the \"tech space\" of Wall Street Journal, with so little actual technical insight?\n\nI don't know if this is worthy of a post on it's own? There's probably a lot of ears listening in on that show.",
        "created_utc": 1604368648,
        "id": "gayn1ym",
        "permalink": "/r/stocks/comments/jmjnqp/rstocks_daily_discussion_monday_nov_02_2020/gayn1ym/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604397448.0
    },
    {
        "author": "TFWPKY360",
        "body": "The integration of Xilinx will hurt results in the upcoming quarters after acquisition is closed since it is not immediately accretive to AMD's bottom line since Xilinx would need to double its profits to not be dilutive. It could work out in the end giving AMD a foothold in FPGAs and 5G but this is a long term play &amp; personally I think most of the momentum will be sucked out of AMD until it is proven that the Xilinx merger was accretive. Bolt on acquisitions are usually what drives stock prices higher short term.\n\nPersonally, I would wait but if you think its a steal at $75 go for it but I see a growth company adding a non-growth company in a field that they are not proficient in. I still remember the ATA acquisition by AMD and that was a disaster.",
        "created_utc": 1604409348,
        "id": "gb01xox",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb01xox/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604438148.0
    },
    {
        "author": "ahsan_shah",
        "body": "Reading the comments it looks like bears have taken control. LOL. Oh boy they were wrong when SP was at $2 and they are still wrong when SP is around $75. Remember due to Intel process woes they will continue to lag behind certainly till 2023. AMD has 10% of data center market share and around 20% in desktop and we are no way near to saturation. AMD will continue to market share at Intel expense.\n\nComing to GPUs. LOL what can I say? It just took one attempt to match or surpass NVIDIA and people were very pessimistic about GPU prospects. AMD has &lt;10% of dedicated laptop market and around 25-30% of desktop market. Coming to data center (growing rapidly) I think its fair to say its below 5% if you compare against NVIDIA. \n\nNVIDIA is going to feel the pain now. Jensen is already sweating in his leather jackets. News of NVIDIA testing and cancelling of various Ampere SKUs is all over Twitter. First 3080 20GB, then 3070 16GB then 3070Ti. NVIDIA is poised to lose big chunk of market share especially in the notebook market as Ampere perf/watt is worse than RDNA2 and with superior efficiency of Ryzen 4000 and upcoming 5000 APU, AMD Ryzen+Radeon combo will sell like hot cakes in comparison to power hog Intel Skylake and Ampere.\n\nComing to Xilinx deal, shorts have no clue. If the deal closes, AMD will become a computing powerhouse with presence in 5G, automotive, AI, IOT, networking. Coming to dilution as they always bring, this dilution will bring $3b in annual revenue and $1b in profit\n\nPessimistic can sale and shorts can short. AMD has long term growth prospects. Long AMD since 2016",
        "created_utc": 1604410106,
        "id": "gb0339p",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb0339p/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604438906.0
    },
    {
        "author": "tim48134",
        "body": "&gt;American's once again tell the coastal elites who control the media that they don't pick the president. The people do. \n\nI mean, I agree that middle America is overlooked. But you're clearly implying that coastal elites are are bad, and you seem happy that Trump won. So assuming you were a Trump supporter, I was pointing out that Trump himself is both coastal and elite to point out the hypocrisy...\n\nBut ya know what, fuck this, I'm drunk. AMD stock: post election drama, think it'll go up with the GPU and console launch? Or will the Xilinx stuff continue to drag on it? Not actually sure how the merger works, lol. I'm recently in for 1/21 85c and wanna know how retarded I am",
        "created_utc": 1604465490,
        "id": "gb31zpn",
        "permalink": "/r/wallstreetbets/comments/jnllmp/perielection_election_discussion_thread/gb31zpn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604494290.0
    },
    {
        "author": "robmafia",
        "body": "*facepalm*\n\nway to evade all the actual data.  ie: math.\n\nie:  valuation of $25B then becomes $35B but the tether was based on 10/8.\n\nanalysts upgraded amd to $120... but then (after the deal) downgraded xlnx to $130. (ie:  not ~200)\n\nthe math does not add up.  this is off by such an absurd margin.  far beyond arbitrage.\n\nyou also omit amd going from 88 to 74 on the rumour/news, despite their best er in history and 2 other major catalysts.\n\nkick rocks",
        "created_utc": 1604504384,
        "id": "gb4iaf2",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb4iaf2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604533184.0
    },
    {
        "author": "Coat_Dry",
        "body": "The chart isn't just an arbitrary line. AMD+Xilinx is not the same as AMD stocks plus Xilinx stocks.\n\n&amp;#x200B;\n\nIntel bought Altera for a reason, FGPAs are the hot 16 year old high school sophomore that's going to wreck a lot of homes once they've matured. AMD+Xilinx=Intel and Nvidia killer.\n\n&amp;#x200B;\n\nIn this situation Intel is a 50 year old ex bodybuilder that wanted some eye candy, but the steroids ruined their sex drive and now all they have are fading memories and sagging bitch tits. They barely avoid jail time after picking up a 14 year old at the mall.\n\n&amp;#x200B;\n\nNvidia is a small asian man in a leather jacket that picked up a cheap hooker in Vegas (ARM) because they think that's what you're supposed to do when you're rich and powerful. They don't tell their wife because they don't want to admit they spent 4 hours watching softcore porn on cable before she took his money and left.",
        "created_utc": 1604455536,
        "id": "gb2kl81",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb2kl81/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604484336.0
    },
    {
        "author": "ceskanda",
        "body": "AMD went down bc of dilution from the XLNX acquisition announcement",
        "created_utc": 1604287285,
        "id": "gav20dz",
        "permalink": "/r/wallstreetbets/comments/jlrft5/earnings_for_the_week_of_november_2/gav20dz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604316085.0
    },
    {
        "author": "rxpillme",
        "body": "Yeah Xlnx will be bought at 35 bil valuation. Every Xlnx share get 1.7 shares of AMD",
        "created_utc": 1604337180,
        "id": "gawwe0a",
        "permalink": "/r/investing/comments/jmqzqr/nasdaq_amd_week_45/gawwe0a/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604365980.0
    },
    {
        "author": "ceskanda",
        "body": "Amd was the best until they announced Xlnx concurrent with the tech dump 😫",
        "created_utc": 1604372111,
        "id": "gaytcm9",
        "permalink": "/r/wallstreetbets/comments/jmv1ax/what_are_your_moves_tomorrow_november_03_2020/gaytcm9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604400911.0
    },
    {
        "author": "no_more_Paw_patrol",
        "body": "short term no idea. long term I like the xilinx deal. \nnot a huge fan of the last 10 days, I would buy more shares if I had cash on hand. I will sit on these puppies for a few years probably. my FDs are currently in dope and renewables playing a biden win.",
        "created_utc": 1604338725,
        "id": "gawzog0",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gawzog0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604367525.0
    },
    {
        "author": "PandaGodFliesToMoon",
        "body": "xlnx nov 20 calls have 63 volume and 2.6k + open interests... any of you know what's going on?",
        "created_utc": 1604248917,
        "id": "gat0avo",
        "permalink": "/r/wallstreetbets/comments/jl45xl/weekend_discussion_thread_for_the_weekend_of/gat0avo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604277717.0
    },
    {
        "author": "ThrowawayAl2018",
        "body": "AMD with Xilinx marriage may or may not work long term (look at Intel with Altera, didn't exactly pan out). The deal won't be finalized till end of next year so lots can change by then.\n\nAs you can hold 9 months, I would wait for a bottom threshold of mid $60's to pick some up, and more on each dip. Learn how to DCA long term as stock prices is quite volatile these days",
        "created_utc": 1604259652,
        "id": "gatlob6",
        "permalink": "/r/stocks/comments/jlzk8q/hold_amd_or_dump_them_on_monday_and_reinvest_into/gatlob6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604288452.0
    },
    {
        "author": "Arrowtotheknee99",
        "body": "I wouldn’t exactly say I’ve seen a lot of hate on AMD lately. The only problem I’ve seen is that they could be acquiring Xilinx at a inflated value. But long term there’s not really much to be concerned about. \nThe share price is a bit weird but the entire market is a bit weird.",
        "created_utc": 1604408897,
        "id": "gb019v4",
        "permalink": "/r/investing/comments/jn9ksc/amd/gb019v4/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604437697.0
    },
    {
        "author": "MrMineHeads",
        "body": "Maybe, but what the market doesn't think so so far. I mean everyone already knows what your posted. Q3, Xilinx, new GPUs; you have to be expecting something that's unexpected, which really doesn't make sense.\n\nPlus, you can't just give one example. That is such a ridiculous practice in this sub. Imagine if I said smoking doesn't cause cancer because my uncle who smoked a pack a day for 40 years died of a car crash.",
        "created_utc": 1604411111,
        "id": "gb04oo1",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb04oo1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604439911.0
    },
    {
        "author": "get_MEAN_yall",
        "body": "I mean it doesn't really matter how I feel about it now. The decision to buy was based on the companies financials, products, competition, etc...   \n\nI bought in before the XLNX acquisition and before Q3 earnings.",
        "created_utc": 1604411484,
        "id": "gb05aro",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb05aro/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604440284.0
    },
    {
        "author": "convolutionx",
        "body": "Doesn't xilinx increase amd TAM though?",
        "created_utc": 1604447503,
        "id": "gb26coq",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb26coq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604476303.0
    },
    {
        "author": "lambda-man",
        "body": "_facepalm_\n\nWay to interpret this like a fast-food transaction. Give me a break.\n\n&gt; ie: valuation of $25B then becomes $35B but the tether was based on 10/8.\n\nThis isn't a Wendy's where you're buying a hamburger for the price on the menu. There's a **stiff** premium to be paid for acquiring a company that wasn't looking to be acquired. Many of those executives will lose their jobs, they need a golden parachute. Shareholders need to be compensated for their loss of control. It's **really** **fucking** **expensive**.\n\n&gt; analysts upgraded amd to $120... but then (after the deal) downgraded xlnx to $130. (ie: not ~200)\n\nAnalysts are a bunch of dum-dums. I don't care about their \"upgrades\" and \"downgrades\" Go look at Enron's \"grade\". Look at Tesla's \"grade\". It's all bullshit.\n\n &gt; the math does not add up. this is off by such an absurd margin. far beyond arbitrage.\n\nYeah, because this wasn't a hamburger at Wendy's and shouldn't be analyzed as if it were.\n\n&gt; you also omit amd going from 88 to 74 on the rumour/news, despite their best er in history and 2 other major catalysts.\n\nAcquiring a company isn't a short term cash grab, it's a long term synergistic value proposition. If you were in AMD for short term gains it made sense to exit. If you were in AMD long term, it's a reason to hold or increase your position. That played out exactly how I expected it would.",
        "created_utc": 1604516785,
        "id": "gb58s3n",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb58s3n/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604545585.0
    },
    {
        "author": "TheEnd187",
        "body": "I remember a week ago Xilinx said AMD wasn't buying them.  Don't trust anyone.",
        "created_utc": 1604245039,
        "id": "gast998",
        "permalink": "/r/wallstreetbets/comments/jlwv11/psth_dd_on_my_24m_bet_11_downside_now_huge_upside/gast998/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604273839.0
    },
    {
        "author": "deah12",
        "body": "Not buying AMD when I can buy XLNX and end up with AMD shares at a better price.",
        "created_utc": 1604284795,
        "id": "gauxry7",
        "permalink": "/r/wallstreetbets/comments/jli0x0/amd_is_an_absolute_steal_at_75/gauxry7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604313595.0
    },
    {
        "author": "gainbabygain",
        "body": "But is it good or bad overall? What about the seller side? Are people selling because it's a distressed company or is it a healthy merger like amd &amp; xilinx\n\nEither way, it's going to be one of those too big to fail. Less competition and the consumer get fucked.",
        "created_utc": 1604496711,
        "id": "gb443gt",
        "permalink": "/r/wallstreetbets/comments/jnsglz/ma_bankers_we_never_been_this_busy_the_overall/gb443gt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604525511.0
    },
    {
        "author": "ShaidarHaran2",
        "body": "If AMD is a steal at 75 dollars, I wonder, why not pick up Xilinx stock to be converted at 1.7 AMD stocks per share?",
        "created_utc": 1604439639,
        "id": "gb1r06x",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb1r06x/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604468439.0
    },
    {
        "author": "robmafia",
        "body": "&gt; The chart isn't just an arbitrary line. AMD+Xilinx is not the same as AMD stocks plus Xilinx stocks.\n\n\ni never said it was.\n\ni said xlnx is no growth.  because they are.  hence, their lack of growth in their financials and chart being dead until the rumour broke.\n\nyou omit the issues with the overpayment and worse, the 1.72 tether (and subsequent dilution).\n\nthere's a reason why amd's sp went from 88 down to 74, amidst the best ER they've ever had (with beats on eps, rev, and guidance) and 2 major catalysts (zen3 and big navi).  without the xlnx deal, it would have rocketed to 100 and probably beyond.",
        "created_utc": 1604455660,
        "id": "gb2ksz2",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb2ksz2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604484460.0
    },
    {
        "author": "frankalliance",
        "body": "Question: how does the AMD acquisition of Xilinx affect Xilinx investors? They were on my watch list a few months back.",
        "created_utc": 1604336611,
        "id": "gawv6ex",
        "permalink": "/r/investing/comments/jmqzqr/nasdaq_amd_week_45/gawv6ex/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604365411.0
    },
    {
        "author": "rxpillme",
        "body": "Yeah for Xlnx investors",
        "created_utc": 1604337323,
        "id": "gawwot6",
        "permalink": "/r/investing/comments/jmqzqr/nasdaq_amd_week_45/gawwot6/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604366123.0
    },
    {
        "author": "maxkingusa",
        "body": "The Xlnx deal is AMD.  Did you mean Mellanox or ARM?",
        "created_utc": 1604339218,
        "id": "gax0qhp",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gax0qhp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604368018.0
    },
    {
        "author": "TryingToBeUnabrasive",
        "body": "Xilinx acquisition. Top comment about tech bull run is accurate but the fact that it’s flat and not declining after an a zero-debt acquisition announcement actually *is* a sign that the company is doing well.\n\nLong term this company is gold. Just chill and be patient.",
        "created_utc": 1604333411,
        "id": "gawoend",
        "permalink": "/r/stocks/comments/jmphoa/why_is_amd_so_flat/gawoend/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604362211.0
    },
    {
        "author": "Boomtown626",
        "body": "Same. I also had XLNX heading into the announcement, so after getting the bump from them, I liquidated and got into AMD instead. I have good feeling about how that will all play out in the end.",
        "created_utc": 1604330070,
        "id": "gawhn5n",
        "permalink": "/r/stocks/comments/jmjnqp/rstocks_daily_discussion_monday_nov_02_2020/gawhn5n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604358870.0
    },
    {
        "author": "bobthedestroyers",
        "body": "High P/E momentum stock + stock dilution with the overvalued Xilinx deal makes it temporarily worth less.",
        "created_utc": 1604332552,
        "id": "gawmnaq",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gawmnaq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604361352.0
    },
    {
        "author": "4OFourUnknown",
        "body": "The stock was doing well. Then the rumors about purchasing Xilinx came out and investors were mixed. Great earnings were shadowed by confirmation about the $35 billion all stock purchase and again, people were divided. People either sold on the good earnings or on the Xilinx deal. AMD seems to stays pretty flat on good news, but then just one day down the road, it takes off. It’s a wild ride, but YTD, it’s doing really well",
        "created_utc": 1604331467,
        "id": "gawkf05",
        "permalink": "/r/stocks/comments/jmphoa/why_is_amd_so_flat/gawkf05/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604360267.0
    },
    {
        "author": "DividendWin",
        "body": "&gt;When something like snap or zoom happens and you happen to be on the winning side of that ... it’s luck.\n\nI've been doing this for a little longer than this year and nothing I've said doesn't apply to other years. M&amp;A plays and such are all the same every year with the same results and rewards and sometimes even greater ones.\n\nI called Zoom 3 months before it happened based entirely on the Corona Virus Pandemic and it's use in my workplace going up ridiculous amounts. It wasn't luck. In fact that's the problem here; Zoom was not luck. The uncertainty didn't lie in whether it was being used but instead by how much it would profit from it's use during the pandemic. Apparently everyone was blown away with massive increase in value because in this environment it really is just that useful. \n\nThe part I am trying to get across is that it isn't luck at all. At least not in this case. If something has a strong correlation with the SP500 for instance and that is tanking it is very unlikely that any news is going to outrun the beta on the stock so it isn't really as shocking as it might seem that earnings in the past week, even on things we already knew would go up from a comparative view, were still not producing strong calls or positive prices. They simply fell with the market as a whole at the time. The same had to be true of the things that fell with their earnings in Feb / Mar into April. \n\n&gt;It is a relatively new phenom with know real rhyme or reason behind it.\n\nThis is not new. You can go back to any bubble, any bust and any memetic behavior and see the same thing over and over. This is incredibly profitable hence all the sentiment concepts and scraping of forums and such; the data is profitable for certain. If it were new and no one knew what was happening there'd be no money in it.\n\n&gt;You could argue that currently,the possibility of newbie traders stumbling upon massive gains from meme stock culture is elevated .. Id argue that the probability is still low.\n\nYou don't \"stumble\" across companies you know. That's my point. No one \"stumbles across\" Snapchat. We all know what Snapchat is. You \"stumble across\" Regeneron. You \"stumble across\" Xilinx. You don't stumble across AMD.\n\n&gt;Is it possible to hit a 5k lotto ticket .. sure But in all probability it will be a while before you have a trade that successful.\n\nAgain this strongly depends on what your cost basis is. To get a trade that hits 5k from 2.5k is ... actually really common. Very. It was before this. It will be after. It even happens on just the stocks and not even the derivatives; a lot of people think that these market moves are rare but they aren't, and instead, they are heavily spaced out and complex to track so making 100% across 9 months in a year isn't what anyone is looking for but that is exactly how it tends to work out.\n\nI personally think that your first 20k is the hardest because it's easy to get the 1 that takes you to even 10k buy 20+ in one go is very rare so you do have to actually string together trades and that lowers the probability of success substantially. This is especially true because capital sensitivity worsens as you get wealthier; the same amount of money you need to achieve a return is not the absolute value of a cashflow anymore so when you worked at Wendy's (whose earnings are this week ;) ) your making 30k was huge but if you work at your own firm or a bank or something like that your making 30k is sometimes a pittance.\n\n&gt;I think it’s dangerous to spread a narrative that suggests Snap like plays happen so consistently that all you have to do is be familiar with these types of cult companies to secure large profits.\n\nI cannot stress enough that this stuff happens all the time. It is so common in fact that there is no one talking about it. I mean the Fastly puts thing with a 392x value? *That* is rare. From 2 ~ 18 based on the contract within a year is not astronomically rare because remember it's all leverage so the bet itself doesn't move linearly like the base might presuming the basis isn't an option itself. Heh. Options on options are freaking crazy.",
        "created_utc": 1604258809,
        "id": "gatjy5p",
        "permalink": "/r/wallstreetbets/comments/jm5cvm/your_first_5k_win/gatjy5p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604287609.0
    },
    {
        "author": "stonk_street",
        "body": "yeah, also AMD all stock purchase of XLNX is a huge L to stockholders.",
        "created_utc": 1604349458,
        "id": "gaxmec5",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gaxmec5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604378258.0
    },
    {
        "author": "stonk_street",
        "body": "AMD stock buy of XLNX is a huge L. Apple moving to ARM is also a big L to them as more companies will switch from x86.",
        "created_utc": 1604352095,
        "id": "gaxrvqr",
        "permalink": "/r/wallstreetbets/comments/jmv1ax/what_are_your_moves_tomorrow_november_03_2020/gaxrvqr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604380895.0
    },
    {
        "author": "robmafia",
        "body": "yes.  but you seemed to miss the points spectacularly.\n\namd is high growth\nxlnx is no growth\n\namd is overpaying out the ass\n\nie: the shareholders are paying out the ass to be shackled to a company with no growth.  they're tying a golden anvil to their rocketship.",
        "created_utc": 1604447725,
        "id": "gb26rdi",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb26rdi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604476525.0
    },
    {
        "author": "convolutionx",
        "body": "Why is Xilinx viewed as a no growth company? Won't the acquisition allow AMD to enter new markets and continue to grow?",
        "created_utc": 1604447791,
        "id": "gb26voy",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb26voy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604476591.0
    },
    {
        "author": "robmafia",
        "body": "yeah, because their growth is constrained by the xlnx anchor they're tied to.",
        "created_utc": 1604443700,
        "id": "gb1z6z7",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb1z6z7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604472500.0
    },
    {
        "author": "rankiba",
        "body": "AMD paid 35 b to Xilinx, NVDA paid 40b for ARM is a better deal no?",
        "created_utc": 1604376769,
        "id": "gaz1b15",
        "permalink": "/r/wallstreetbets/comments/jmv1ax/what_are_your_moves_tomorrow_november_03_2020/gaz1b15/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604405569.0
    },
    {
        "author": "lambda-man",
        "body": "Your logic here boils down to \"xilinx was a mistake, I know better than AMD's leadership what is best for their company\".\n\nNot saying you're wrong, but I would like to know why adding a no-growth company to a growth company to make a hybrid is a negative.",
        "created_utc": 1604501667,
        "id": "gb4culu",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb4culu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604530467.0
    },
    {
        "author": "robmafia",
        "body": "and it doesn't matter, since the xlnx deal will cripple amd for a year.",
        "created_utc": 1604434085,
        "id": "gb1f7nc",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb1f7nc/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1604462885.0
    }
]