[
    {
        "author": "iitaeja",
        "body": "You tryna paypal me the $39.25 or what?",
        "created_utc": 1600463382,
        "id": "g5qs5kr",
        "score": 250,
        "subreddit": "wallstreetbets",
        "created": 1600492182.0
    },
    {
        "author": "bozzthebro",
        "body": "If you send me 5k on paypal I’ll upvote this shitty post. Congratulations &amp; fuck you",
        "created_utc": 1600614069,
        "id": "g5zjvq9",
        "score": 221,
        "subreddit": "wallstreetbets",
        "created": 1600642869.0
    },
    {
        "author": "SaneLad",
        "body": "You'll get a $5 paypal check for every $100 preorder you put in.",
        "created_utc": 1600401412,
        "id": "g5o4fvy",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1600430212.0
    },
    {
        "author": "theaashes",
        "body": "Musk at least had some success with PayPal. At one point he funded the entire Tesla startup with his PayPal money and almost went broke. With Trevor there is no success story. He is a sales guy, used to selling. Nothing else. \n\nHow he is valued at $3Bn is beyond me.",
        "created_utc": 1600092578,
        "id": "g58bxro",
        "score": 32,
        "subreddit": "investing",
        "created": 1600121378.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Apple, Microsoft, Adobe, PayPal, Nvidia.",
        "created_utc": 1600132336,
        "id": "g5b673d",
        "score": 24,
        "subreddit": "stocks",
        "created": 1600161136.0
    },
    {
        "author": "07Ghost",
        "body": "It's a business that gives out loans for god sake. You really think this company gonna grow 10x to compete with the big banks in the mortgage business? Especially in a low interest rate environment, there's a reason why most of the bank stocks were and are still lousy investments ever since 2008. NIM is everything in the lending business. I'd stay away any business whose outlook prospers on a change in interest rate and the housing economy, because those factors are outside of the company's control.\n\nSeriously, some of you have the weirdest DDs that maybe you're just thinking too hard. If you want to go with high growth, high risk company in finance, you have a better chance to double, triple, maybe even 5x your money with digital payment companies like Paypal and Square that sit well with Millennial &amp; Gen Z. If you want to invest in stable growing financial company with lower risk, Visa and Mastercard are the choices in the digital era.",
        "created_utc": 1599976630,
        "id": "g51xtaa",
        "score": 24,
        "subreddit": "stocks",
        "created": 1600005430.0
    },
    {
        "author": "realister",
        "body": "**Nancy Pelosi went deep in $PYPL recently.**\n\naccording to her latest financial disclosure:\n\nShe got 10,000 shares and 50 $100 strike $PYPL leaps too. \n\nShe dropped a few million on this bet. \n\nhttps://i.imgur.com/KjejXpm.png\n\n*source: https://disclosures-clerk.house.gov/PublicDisclosure/FinancialDisclosure*",
        "created_utc": 1601324131,
        "id": "g6znzif",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1601352931.0
    },
    {
        "author": "godfather188",
        "body": "Dudes plz do enable two-way authentication security. My paypal, fb ads acct, AND ROBINHOOD was hacked last week and up til today. Fucking fraud transactions in my bank acct and credit cards rn holy fucks\n\nFucking hackers they deserve to get shot gunned in their face",
        "created_utc": 1599506519,
        "id": "g4d7a0x",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1599535319.0
    },
    {
        "author": "bobthedestroyers",
        "body": "Tesla actually had working prototypes, top leading engineering, etc. NKLA has none. Elon has a track record of building successful businesses, zip2, paypal, spacex.  NKLA's CEO has a record of fraud. \n\nNKLA has photoshop and non operating car shells they roll off hills.\n\nNKLA has no tech. They are utilizing GM's tech, GM's manufacturing.",
        "created_utc": 1599765220,
        "id": "g4qauuu",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1599794020.0
    },
    {
        "author": "aaiwani",
        "body": "Clown response.... I see absolutely zero wrong with any of these selections / the mix.\n \nApple: technically it’s a consumer discretionary, technology, and future health care giant all in \none.\n\nMicrosoft:  cloud + enterprise software + gaming + LinkedIn all in one\n\nAdobe:  king of creative cloud + enterprise solutions \n\nPayPal:  Fintech \n\nNvdia:  exposure to gaming, internet of things, cloud , 5g , computer \n\nWhat’s your proposed “diversified risk mix”?",
        "created_utc": 1600138763,
        "id": "g5bhj5t",
        "score": 18,
        "subreddit": "stocks",
        "created": 1600167563.0
    },
    {
        "author": "godfather188",
        "body": "Fuck man. I got my paypal acct hacked and this mofo russian dipshit took my $6k. Chase fraud dept is soooooooooo fucking slow to resolve the issue I won’t get my money back until October. Bitchass slow ass boomer bank fuckfaces",
        "created_utc": 1600567319,
        "id": "g5wnfjl",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1600596119.0
    },
    {
        "author": "Nawtreallyme",
        "body": "ORCL, BABA, CRM, PYPL, ADBE, NVDA, CSCO, PD, DDOG, NET, FB, AMZN, AAPL, MSFT, CLOU, AMD, FSLY, NFLX, SKYY, XLK",
        "created_utc": 1600222901,
        "id": "g5fitjz",
        "score": 17,
        "subreddit": "stocks",
        "created": 1600251701.0
    },
    {
        "author": "Blackops_21",
        "body": "PayPal is back to July 20th\n\nNetflix is back to July 1st\n\nMicrosoft is back to June 30th\n\nAmazon is back to July 7th\n\nGoogle is back to July 6th\n\nAMD back to July 29th\n\nFacebook back to Aug 6th\n\nThe S&amp;P charts dont tell the whole story. The big names where most retail money is situated got hit hard.",
        "created_utc": 1600383369,
        "id": "g5n84u7",
        "score": 17,
        "subreddit": "StockMarket",
        "created": 1600412169.0
    },
    {
        "author": "TexBabushka",
        "body": "Elon literally designed and wrote PayPal when he and his brother had no money to throw at an army of engineers, which isn’t designing and doing everything at SpaceX but still impressive and his money to throw at SpaceX engineers came from the money he made building PayPal. You’re trying so hard to be contrarian and cool that you have no damn idea what you’re talking about.",
        "created_utc": 1601167284,
        "id": "g6r5b89",
        "score": 14,
        "subreddit": "investing",
        "created": 1601196084.0
    },
    {
        "author": "ComfortableComa",
        "body": "Your tech heavy. That is doable, however know your exposed here and if Tech ETF is down heavy-so will you be. Consider making some placements spread out to different sectors, finacial should be in there for example. I have been taking position in BAC for banking\nAnd either Visa or Paypal for another pairing with BAC. \nBAC has been really cleaning up thier books and setting up for long term sucess precovid, post covid, you have buffet giving it attention amd some $. If you watch the headline you can see Buffet is shifting his portfolio. I dont always like his picks honestly. 50/50 at best but BAC will be a great risk to reward ratio on placing money in a longer term asset(aka Buffets M.O.) specifically in the financial sector. Paypal could deflate most but could also inflate in price most in my opinion. \n\nConsumer. Get one at least. Every suggests the \"this\" version of amazon. Stick with Amazon. Jeff Bezos isnt running those knock of Amazons. Pick Amazon if you like amazon. In lomg term portfolio management you need to care about your companies leadership. Im day trading you dont even need to care about what ticker tag you are trading. \nAmazon. Nuff said. \n\nI would take a 50/50 split of AMD, and Nvidia right now to cover semiconductors. \n(Your already heavy tech or id do full positions in both)\n\nIf you do a consumer defense stock, id do walmart. They are pishing thier ecommerce and puttting thier leadership equity into that direction. I think they see Amazon and know what needs to happen to survive if a new commerce age comes. Great Amazon pairing to, as if one drops the other may get an increase due to thier respective market share. \n\nIf you are not going to manage yoyr portfolio a few times a week I wouldnt get any more in depth than that. \n\nSplit picks into secotrs and you account will take sharp downswing less often. More important to keep your money than to make alot. If you cannot keep what you make you will only borrow it mistakenly thinking you had ownership.",
        "created_utc": 1599975793,
        "id": "g51vvv6",
        "score": 12,
        "subreddit": "stocks",
        "created": 1600004593.0
    },
    {
        "author": "Dackelzz",
        "body": "3.9k to 12.1k. Thanks WMT DOCU PYPL HD SQ MSFT",
        "created_utc": 1599000514,
        "id": "g3nhwpj",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599029314.0
    },
    {
        "author": "GoldFox1984",
        "body": "Posted this earlier but expanded on it + positions:\n\nTech bubble was caused by dumb companies that made no money (Pets.com famously sold merchandise 27% below cost)\n\n2008 was caused by the housing crisis (evictions are now illegal).\n\n2001 crash was caused by 9/11.\n\nWhat could pop this bubble? (If it's even a bubble). I’m holding my calls because it keeps going up no matter what. When we have a red day or negative news I tell myself: \"Stonks go up\" and either by EOD or the next day, it goes green without fail.\n\nBut at the same time I’m starting to get worried about a bubble- but what will trigger it? \nMoney is practically free, poor people who are getting devastated by the virus with no stimulus never invested in the market anyways. If anything the average person with spare change can now throw their money into the market easier than ever before with RH.\n\nI understand the subprime crisis was undetected, so what could possibly be undetected now? \nWhat will pop this? Am I missing something? Give me a reason not to hold my tech calls.\nSometimes I feel like the market will pop is because doubling my money in months doesn't sound right, this isn't supposed to happen. But maybe we're just smarter than the rest and making as much as we can while the printer is on (this doesn't sound right either).  \n\n**Positions:**\n\nFB 300c 3/19\n\nMSFT 230c 4/16\n\n2x MSFT 220c 6/18\n\nNVDA 600c 3/19\n\nORCL 60c 9/11 (somehow up 14%)\n\n2x PYPL 200c 1/15\n\nPYPL 210c 3/19\n\n2x SPY 360c 9/21 (2021) \n\n5 shares of AMZN (sold after making $10K on 3600c 1/15)\n\n25 shares of MSFT\n\n30 Shares of PYPL",
        "created_utc": 1599103198,
        "id": "g3szdnn",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599131998.0
    },
    {
        "author": "YungKiyan",
        "body": "Yeah, I'm tempted to buy ADBE, PYPL, SQ and some others because of these 5-10% dips, but they're just like at the same levels where they were like 2-3 weeks ago",
        "created_utc": 1599233607,
        "id": "g3zw8x9",
        "score": 11,
        "subreddit": "stocks",
        "created": 1599262407.0
    },
    {
        "author": "lomoprince",
        "body": "I think people consider SQ more exciting with greater growth potential but PYPL is certainly growing quickly too and is more well established.",
        "created_utc": 1600405394,
        "id": "g5oa3dq",
        "score": 10,
        "subreddit": "stocks",
        "created": 1600434194.0
    },
    {
        "author": "GlassWeird",
        "body": "Bro, while in undergrad i flew across the country to watch this Autist speak at the 2001 ISDC keynote dinner presentation in LA, when SpaceX just launched their fourth and first successful falcon 1 rocket and he was still known as the “paypal guy.” I know elon has been fucking for the last two decades.",
        "created_utc": 1600236718,
        "id": "g5g44w9",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600265518.0
    },
    {
        "author": "s4swordfish",
        "body": "thats not exactly true. peter theil founded paypal and was competing against elon. they were essentially in a pricing war and decided to combine enterprises",
        "created_utc": 1601172624,
        "id": "g6rjwz0",
        "score": 10,
        "subreddit": "investing",
        "created": 1601201424.0
    },
    {
        "author": "Yallfuckwith",
        "body": "Dudes like Elon operate on a different motor. He had all the money in the world after paypal to chill, yet he still kept going.",
        "created_utc": 1600222914,
        "id": "g5fiuh1",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600251714.0
    },
    {
        "author": "LetsSeeThatNow",
        "body": "Part of it is nationalism.  Elon is from SA but Tesla is a US company.  \n\nAnd they make shit you can point at and touch.\n\nThey don't make services.  They manufacture actual things.  Not clicks or eye-balls or ads or games.\n\nThat is an anomaly in a degenerating empire.\n\nAnd Musk, who has been around the internet culture since before fucking paypal, is unreasonable enough to force reality to bend around him.\n\nAnd TSLA touches SpaceX.  And the satellite internet thingy.  And eco-capitalism.\n\nThere is a lot going on there.",
        "created_utc": 1600890657,
        "id": "g6cmyq7",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1600919457.0
    },
    {
        "author": "smallstreetgains",
        "body": "##Top trending tickers, sentiments, and options on /r/wallstreetbets for the day of September 22, 2020.\n\n────────────────\n\n###Trending Tickers:\n\n**Ticker**|**Company**|**Mentions**|**Bulls / Bears**|**Price**|**Change**|**P/E**\n:-:|:--|:-:|:-:|:-:|:-:|:-:\nTSLA|Tesla, Inc.|527|77.70% / 22.30%|$427.04|-4.97%|1155.24\nAAPL|Apple Inc.|182|84.27% / 15.73%|$112.19|1.92%|33.47\nNKLA|Nikola Corporation|178|59.21% / 40.79%|$28.13|1.98%|-\nSPY|Exchange Traded Fund|159|50.38% / 49.62%|$329.05|0.63%|-\nVALE|Vale S.A.|154|90.40% / 9.60%|$10.63|-2.89%|46.36\nGME|GameStop Corp.|120|56.14% / 43.86%|$10.68|22.06%|-\nAMZN|Amazon.com, Inc.|96|76.36% / 23.64%|$3123.28|5.50%|113.79\nZM|Zoom Video Communicat|86|68.18% / 31.82%|$491.32|4.88%|598.30\nQQQ|Exchange Traded Fund|70|42.50% / 57.50%|$272.66|1.93%|-\nMSFT|Microsoft Corporation|67|94.44% / 5.56%|$207.40|2.40%|35.14\nAMD|Advanced Micro Device|59|63.16% / 36.84%|$77.38|-0.72%|154.95\nVXX|Exchange Traded Fund|51|76.19% / 23.81%|$25.16|0.00%|-\n\n\n────────────────\n\n###Trending Options:\n\n**Ticker**|**Strike**|**Type**|**Expiration**\n:-:|:-:|:-:|:-:\nTSLA|$500|Call|9/25\nMSFT|$205|Call|9/16\nVALE|$10|Put|9/25\nVALE|$8|Put|9/25\nTSLA|$800|Call|9/25\nCVNA|$200|Call|9/25\nMSFT|$205|Call|9/25\nSPY|$260|Put|10/23\nAAPL|$115|Call|10/2\nAMD|$80|Call|10/30\nSPY|$302|Put|9/23\nAAPL|$120|Call|9/25\nAMZN|$3050|Call|9/25\nAMD|$75|Call|10/30\nPYPL|$185|Call|10/30\n\n\n────────────────\n\n###Trending Sentiment:\n\n**Sentiment**|**Comments**|**%**\n:--|:--|:--\nBullish|945|63.94%\nNeutral|8684|-\nBearish|533|36.06%\n\n\n────────────────\n\n###Other Data:\n\n**Overall Market Sentiment:** Bullish\n\n**Comments Searched:** 10162\n\n**Newly Trending Tickers:** GME, VXX\n\n────────────────\n\nYou can view all top trending tickers on /r/RedditTickers.\n\nNotice an error or have questions? Reply to this post or message /u/smallstreetgains.\n\nFinancial data provided by [finviz](https://finviz.com/).",
        "created_utc": 1600805224,
        "id": "g68y36h",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1600834024.0
    },
    {
        "author": "swolking",
        "body": "I will continue to buy the Paypal and MSFT dip even if it kills me.",
        "created_utc": 1600287705,
        "id": "g5iaags",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1600316505.0
    },
    {
        "author": "OppaGamerStyle",
        "body": "PayPal better be north of 200 by October or I'm going to be on welfare",
        "created_utc": 1600821479,
        "id": "g69s1wv",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600850279.0
    },
    {
        "author": "ValueInvestingIsDead",
        "body": "Elong created Tesla Automotive as a proof of concept for a battery-powered future; he's overturning a century-old+ industry just as collateral damage for the big play.\n\nAny member of the PayPal Mafia (specifically Musk, Thiel) knows damn well you invest in the platform, not the product. Elon is not stupid enough to have the short-sighted vision of Tesla as a product (car) company. TSLA is a $1TN **energy** **conglomerate** by 2025-2030. For as long as the talking heads are talking about automotive sales and the \"competition\", it's just more time for me to gather up those shares.\n\n*edit: original cost-basis is $30-something but I've, of course, been adding and becoming less-diverse as the stonk was headline-driven to the ~$180)\n\n\nedit2: For anyone interested, Peter Thiel's Zero to One is an excellent read on how to interpret modern tech markets, and if you read it in 2013, you'd have incredible returns (1000%+), an incredible hit-ratio, with the ability to identify exponential-growth tech stocks with such precision that you'd think the person had a crystal ball.",
        "created_utc": 1600202115,
        "id": "g5edzgz",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600230915.0
    },
    {
        "author": "WolfOctober",
        "body": "The fact that you made this post signals to me that even your gut is telling you that it's risky to having an entirely tech portfolio. \n\nIt never hurts to diversify. \n\nDon't get me wrong, every company in your portfolio is doing well (even a meme stock like TSLA) right now but that could change very quickly (see TSLA). As one of the unlucky people who bought into the TSLA hype too late, I'm kicking myself.\n\nCan't hurt to throw some ETFs in there to mitigate risk and further diversify. Throw in some financial stocks and some of the bigger healthcare or retail players too while you're at it.\n\nVOO, ABT, COST, NKE, V, MA, PYPL, and HD have all treated me very well these past few months",
        "created_utc": 1599075637,
        "id": "g3rc9wz",
        "score": 8,
        "subreddit": "stocks",
        "created": 1599104437.0
    },
    {
        "author": "yooobrad",
        "body": "Hey if anyone wants to bet this idiot takes paypal.",
        "created_utc": 1599082431,
        "id": "g3ruar9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599111231.0
    },
    {
        "author": "waylon106",
        "body": "Stay-at-home stock gains this year:\n\nZoom: +630%\n\nWayfair: +225%\n\nDocusign: +189%\n\nTeladoc: +162%\n\nEtsy: +167%\n\nPayPal: +73%\n\nAmazon: +68%\n\nFedEx: +65%\n\nGrubhub: +48%\n\nNetflix: +49%\n\nDomino’s: +42%\n\nUPS: +41%\n\neBay: +45%\n\nClorox: +38%\n\nTwitter: +37%\n\nLowe’s: +33%\n\nFacebook: +24%\n\nHome Depot: +23%",
        "created_utc": 1601143896,
        "id": "g6pe4oc",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1601172696.0
    },
    {
        "author": "zipykido",
        "body": "That's so dumb. It's clearly just a really big paypal account that he uses to venmo his buddies money.",
        "created_utc": 1599794291,
        "id": "g4sei1n",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599823091.0
    },
    {
        "author": "orange_king108",
        "body": "Imo Visa and MasterCard are also great buy options from COVID-19 for long term hold. They also prosper from a cashless society and have more global reach than SQ/PayPal currently, which are built on top of their payment networks.\n\nMay have less growth potential than SQ but far less risk from that perspective",
        "created_utc": 1600208449,
        "id": "g5es57y",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1600237249.0
    },
    {
        "author": "GameDoesntStop",
        "body": "Yeah, that valuation is absolutely nuts.  It's valued higher than the likes of:\n\n* AMD\n\n* Lockheed Martin\n\n* Royal Bank of Canada\n\n* Citigroup\n\n* Starbucks\n\n* Wells Fargo\n\n* Boeing\n\n* 3M\n\n* Raytheon\n\n* TD\n\nIt is at valued at between 50% - 99.9% of the likes of:\n\n* Netflix\n\n* Paypal\n\n* Verizon\n\n* Disney\n\n* Bank of America\n\n* Oracle\n\n* McDonalds\n\n* Costco\n\n* Shopify\n\nWhat do people think this tool is going to bring to the market that justifies its valuation?  It's far from the first prominent communications app to enjoy it's 15 minutes, and it won't be the last.",
        "created_utc": 1599005986,
        "id": "g3nu72b",
        "score": 7,
        "subreddit": "options",
        "created": 1599034786.0
    },
    {
        "author": "Vcize",
        "body": "Imagine if the idiots at Paypal had listened to Elon way back when they said he was stupid for wanting to make an online bank because no one would ever trust their money to online transactions and they should just be a shitty payment processor for Ebay instead.",
        "created_utc": 1599410482,
        "id": "g48utfv",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599439282.0
    },
    {
        "author": "taiwansteez",
        "body": "Do VOOG. They're basically QQQ with a lower expense ratio.\n\nTop 10 Holdings/Allocation\n\n1. [**Apple Inc.**](https://www.etf.com/stock/AAPL)10.63%\n2. [**Microsoft Corporation**](https://www.etf.com/stock/MSFT)9.54%\n3. [**Amazon.com, Inc.**](https://www.etf.com/stock/AMZN)8.14%\n4. [**Facebook, Inc. Class A**](https://www.etf.com/stock/FB)3.74%\n5. [**Alphabet Inc. Class A**](https://www.etf.com/stock/GOOGL)2.72%\n6. [**Alphabet Inc. Class C**](https://www.etf.com/stock/GOOG)2.68%\n7. [**Visa Inc. Class A**](https://www.etf.com/stock/V)1.97%\n8. [**Mastercard Incorporated Class A**](https://www.etf.com/stock/MA)1.67%\n9. [**NVIDIA Corporation**](https://www.etf.com/stock/NVDA)1.60%\n10. [**PayPal Holdings Inc**](https://www.etf.com/stock/PYPL)1.41%",
        "created_utc": 1600190879,
        "id": "g5dm8he",
        "score": 7,
        "subreddit": "stocks",
        "created": 1600219679.0
    },
    {
        "author": "FunkyOldMayo",
        "body": "Just PayPal me your money, every couple of weeks I’ll swing by and kick you in the balls.",
        "created_utc": 1600175881,
        "id": "g5cox94",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600204681.0
    },
    {
        "author": "CharlieBrown364",
        "body": "Both are great. PYPL is more stable but SQ has more growth potential.",
        "created_utc": 1600184052,
        "id": "g5d5gmx",
        "score": 6,
        "subreddit": "stocks",
        "created": 1600212852.0
    },
    {
        "author": "himecut",
        "body": "Serious answer here, if you used Paypal you can dispute it and say some story that your item was never delivered or whatever and you never got a tracking number. If they can't provide one, Paypal will refund your money.\n\n2. You can call your bank for a chargeback. Again, a story about you being ripped off by a vendor. Some banks don't do too much investigating and just get their/your money back.\n\nPlease please please please never give your money to some random stranger online! 1K is a lot of money to be giving up so easily, so either you're rich and money isn't a problem for you or there's something more going on. In any case, please take care of your money and if you're serious about investing you can:\n\n\\-Read The Most Important Thing by Howard Marks.\n\n\\-Read other people's experience from good blogs out there and more serious forums other than WSB.\n\n\\-Do it on your own! Start small and with enough research and practice, you can learn how to at least always stay positive with your portfolio.\n\nAnyway, anyone can find themselves in a similar position and at least you didn't lose thousands upon thousands like most people on WSB do, so don't feel too down and you can get your money back. Best of luck and learn from this experience, friendo.",
        "created_utc": 1600551902,
        "id": "g5varwr",
        "score": 6,
        "subreddit": "smallstreetbets",
        "created": 1600580702.0
    },
    {
        "author": "Kreval",
        "body": "Is this broker also a Nigerian prince???  Seems legit some random dude on the internetz sends you a PayPal link asking for your tuition in exchange for a hot stock tip.  Sounds like it literally can't go tits up 😆👍",
        "created_utc": 1600370498,
        "id": "g5mccbr",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600399298.0
    },
    {
        "author": "sgtblast",
        "body": "As an active eBay seller, I can confidently say eBay is leaving the door wide open for someone to eat their food.  They refuse to update and adapt to changes in the market and the platform is ancient.  \n\nI use PayPal more and more to conduct business transactions outside of eBay (no eBay fees, no tax) on platforms like Reddit, Facebook, Instagram, etc. \n\nI’m very bullish on PayPal, even before this news.",
        "created_utc": 1601313965,
        "id": "g6z0el4",
        "score": 6,
        "subreddit": "stocks",
        "created": 1601342765.0
    },
    {
        "author": "jimmyolsenblues",
        "body": "@WilliamNextLev1: on Sept 2nd, #stockmarket was at highs &amp; everyone was hoping for a 10% correction to buy stocks at better prices.\n\nWell, we got it!\nAnd now ppl afraid to buy stocks. LOL.\n\n$AMZN down -17%\n$MELI -23%\n$AAPL -21%\n$OKTA -15%\n$NVDA -17%\n$DOCU -35%\n$ETSY -21%\n$PYPL -17%\n\n#BuytheDip",
        "created_utc": 1600602102,
        "id": "g5yr6mk",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600630902.0
    },
    {
        "author": "TheMagpulMaster",
        "body": "21 y/o college student. Roommates and I all just tested positive for the rona. Time to learn actual TA and do some DD during these retarded zoom classes. Anyone have any medium term plays on their mind? Picked up some PYPL $230 4/21c and CHWY $55 3/21cs yesterday",
        "created_utc": 1601493392,
        "id": "g77fr44",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1601522192.0
    },
    {
        "author": "absoluteScientific",
        "body": "Okay Trump now say PayPal for some reason",
        "created_utc": 1601429290,
        "id": "g74m3fb",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1601458090.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "I don't have an OF but I will send you a picture of my booty hole if you PYPL me $20",
        "created_utc": 1601325040,
        "id": "g6zpt03",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1601353840.0
    },
    {
        "author": "Trumpowell",
        "body": "Who went shopping for calls\n\nSome tickers on fire sale (PYPL, FB, , SQ)",
        "created_utc": 1599256856,
        "id": "g41u3gt",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599285656.0
    },
    {
        "author": "mingling4502",
        "body": "AAPL and PYPL can start to recover tomorrow. It's time.",
        "created_utc": 1600377461,
        "id": "g5muwci",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600406261.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "Last week, instead of averaging down on **SQ**, I averaged down on **PYPL**.  \n  \nNow I watch in horror.",
        "created_utc": 1600184101,
        "id": "g5d5kz0",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600212901.0
    },
    {
        "author": "lomoprince",
        "body": "I own MA, V, and PYPL. Have been a shareholder of V since 2009. I’m comfortable holding all 3 because they’re all making significant investments in the next generation of transactions and payment services. Bonus is both V and MA don’t assume any of the underlying credit risk as they merely facilitate the transactions for a fee. Substantial moats especially for V where their market positions are unparalleled. These companies are just buy on dips and steadily accumulate for a decade plus and not worry about it.",
        "created_utc": 1600139906,
        "id": "g5bjg6x",
        "score": 6,
        "subreddit": "stocks",
        "created": 1600168706.0
    },
    {
        "author": "staynight",
        "body": "Fuck u PayPal",
        "created_utc": 1600194165,
        "id": "g5du46a",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600222965.0
    },
    {
        "author": "Yknot56",
        "body": "SQ has much more growth potential just based on market cap alone (SQ-$64 billion vs PYPL-$206 billion). PYPL is much more stable however, but the growth will be reduced compared to SQ. Both companies have recently the same amount of users. Like you said though, it would probably be best to own both stocks",
        "created_utc": 1600409946,
        "id": "g5ofppf",
        "score": 5,
        "subreddit": "stocks",
        "created": 1600438746.0
    },
    {
        "author": "okgenxer",
        "body": "On the next big down day(s) I'm buying calls for PYPL, SQ, UPS, and maybe DHI for upcoming earnings",
        "created_utc": 1601484656,
        "id": "g76thxf",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1601513456.0
    },
    {
        "author": "CCLyolo",
        "body": "Its just that there was an explosion of new users since pandemic started and if they invested in pretty much anything first few months they would be in the profit right now unless yoloing rediculously, and even then some rediculous yolos have been paying off (e.g tsla, PayPal, etc)",
        "created_utc": 1600233378,
        "id": "g5g04cx",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600262178.0
    },
    {
        "author": "skywalker4588",
        "body": "Venmo is owned by PayPal along with a bunch of other services",
        "created_utc": 1600188968,
        "id": "g5dhlh5",
        "score": 5,
        "subreddit": "stocks",
        "created": 1600217768.0
    },
    {
        "author": "Derpinator_30",
        "body": "their game is attempting to take the goods of HQ and fix the negatives (fan burn out and unable to finance/monetize the game,). one example is the prize money. \n\nHQ was hard af to win and even if you were lucky enough to be a winner you had to split a prize with hundreds of other people and you end up with only like $0.02. I can remember being one of those people and not being very happy... WinQuik will only have a handful of winners and you'll actually win legit prize money.\n\nWinQuik is also monetized with microtransactions (personally hate MTs as a gamer, but they're good for the bottom dollar as an investor) that are essentially power-ups that can help you with questions, so those that really want to win can buy these to get an edge, but it's still possible to win without them.\n\nYou can also challenge other people 1v1, and someone speak up if I'm wrong, but IIRC, you can wager money on these challenges (can't remember if its directly money or tokens or something from microtransactions).\n\nAll cash pay in and out is secure via PayPal.\n\nWinQuik will also be using ads and sponsors for revenue and prize money, they already had Burger King signed on just for the beta, speculation is with their ties to the sports world the NFL and ESPN may follow.\n\nThis doesn't even touch on the ensemble of hosts they've acquired. No, its not Leo D or Matt Damon, I dont know why people think that A-list celebs would host a trivia app anyways, but these are legitimate personalities from the NFL, Discovery Channel, Food Network, contributor to NASA and SpaceX, the list goes on.\n\nAnd this is only WinQuik, the first app. ClickStream also recently acquired a major stake in GOOO. theres some DD out there in the r/CLIS sub, but speculation is that they are looking to create a sports book/gambling website/app after the successful launch of WinQuik.\n\nTLDR : buy $CLIS  = 🚀🚀🚀",
        "created_utc": 1600297409,
        "id": "g5iwd96",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1600326209.0
    },
    {
        "author": "NeelAsman",
        "body": "Shopping list: AMZN, BABA, PYPL, FDX, ZS, COST, WORK, SPY, MU",
        "created_utc": 1599147736,
        "id": "g3uyu5k",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599176536.0
    },
    {
        "author": "theknowndude",
        "body": "Didn‘t realize Paypal is a 250bn company",
        "created_utc": 1599151087,
        "id": "g3v8jdj",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599179887.0
    },
    {
        "author": "RiceHer0z",
        "body": "Paypal anyone?",
        "created_utc": 1600626894,
        "id": "g60f9pf",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600655694.0
    },
    {
        "author": "HornetCandid",
        "body": "Throw it in my PayPal account",
        "created_utc": 1600980344,
        "id": "g6gsq4z",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1601009144.0
    },
    {
        "author": "Rcrowley3",
        "body": "Not the kinda guy that wants to pump positions at all but PayPal earnings are 10/21, is that not an obvious run up play? Wouldn’t mind hearing the bear side.",
        "created_utc": 1601060336,
        "id": "g6k969l",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1601089136.0
    },
    {
        "author": "Itsme_eljefe",
        "body": "Me in the last hour:\n\nOpe, time to buy PYPL - drops when I buy\nOpe, time to buy CHWY - drops when I buy\nOpe, time to buy AMZN - drops when I buy\nOpe, time to buy AAPL - drops when I buy\nOpe, time to buy TSLA - drops when I buy\n\n\nWhat the fucking fuck, man.",
        "created_utc": 1600800638,
        "id": "g68os2a",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600829438.0
    },
    {
        "author": "VictoriousSecret111",
        "body": "Can someone Venmo me or PayPal me $1,000? I want to do some YOLO plays",
        "created_utc": 1601400600,
        "id": "g730oaq",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1601429400.0
    },
    {
        "author": "Dackelzz",
        "body": "My very first stock purchase was 50 shares of PYPL at a cost basis of 55. 🦖",
        "created_utc": 1599005421,
        "id": "g3nsvb2",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599034221.0
    },
    {
        "author": "OppaGamerStyle",
        "body": "Where my PYPL bois at",
        "created_utc": 1600817367,
        "id": "g69l3ji",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600846167.0
    },
    {
        "author": "Overchipped",
        "body": "PayPal credit uses credit rating information to offer what is marked on your credit file as a credit card offering 3 month interest free before kicking in an average interest rate. A BNPL company normally charges HUGE amounts of interest on the purchase amount - if PayPal can find the balance between not credit checking customers like most after pay services and charging a reasonable amount of credit then PayPal could position itself quite well in the market.\n\nEdit: Grammer",
        "created_utc": 1598946491,
        "id": "g3kcti3",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598975291.0
    },
    {
        "author": "123boar",
        "body": "Is palantir that company owned by the gay republican dude that founded PayPal with elon",
        "created_utc": 1599689258,
        "id": "g4lb19j",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599718058.0
    },
    {
        "author": "dbgtboi",
        "body": "Usually when I am feeling down, I find that being charitable helps you feel a lot better about yourself and clears up depression 100% of the time.\n\nDrop me a DM and I can give you my paypal for your first charitable donation.",
        "created_utc": 1600129685,
        "id": "g5b0juk",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600158485.0
    },
    {
        "author": "Amadon29",
        "body": "I just noticed that Pelosi invested 2 million in Paypal in June (mostly shares, but still bought 50 2022 calls). They have only gone up 15% over the last few months. Not too late to join her?",
        "created_utc": 1600219321,
        "id": "g5fc8ew",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600248121.0
    },
    {
        "author": "1hertz",
        "body": "Fuck this asshole with the 10,000 share ask wall on PYPL premarket. This is precious pump time, dick",
        "created_utc": 1600173974,
        "id": "g5cly5o",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600202774.0
    },
    {
        "author": "BeernerdoMazzeroli",
        "body": "I'm holding AMD LEAP options. Just waiting for a confirmation of continuing bull market before I jump in on NVDA, will probably hold off until they reach new highs. It's an easy play, the growth is exceptional in both these companies. AMD has an EPS growth rate of 159% and NVDA 38%. These stonks aren't overvalued.\n\nLong $AMD\n\nLong $ADBE\n\nLong $PYPL\n\nLong $TSM\n\nLong $MSFT\n\n\nShort $SLV\n\nShort $SCS\n\nShort\t$NNOX",
        "created_utc": 1600242007,
        "id": "g5g9ksg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600270807.0
    },
    {
        "author": "Squezeplay",
        "body": "A good point is how easily cryptocurrency can be exchanged for each other and traditional currency. So the payments functionality can be separated from the the store of value functionality. And I agree the later is many magnitudes more valuable. A lot of people see bitcoin has some sort paypal replacement. In my opinion its real value is that its one of the only monetary systems that is entirely isolated from government influence, and not controlled by any one entity, including other cryptocurrencies that are essentially \"owned\" by one company or group. Bitcoin can have value to society just by existence as an alternative to keep governments and centrals banks in check. It could potentially be an even larger asset than gold, and it wouldn't even have to \"take over\" the dollar or anything at point.",
        "created_utc": 1599839439,
        "id": "g4u1gah",
        "score": 4,
        "subreddit": "investing",
        "created": 1599868239.0
    },
    {
        "author": "ETisME",
        "body": "Everything is dropping, including my energy and infrastructure stock. Tech has massive drops, nvidia, apple, Microsoft, PayPal, square etc all crashed hard for me.\n\nI think if its just a broad market crash, I would just sit it out",
        "created_utc": 1599192588,
        "id": "g3y3idw",
        "score": 4,
        "subreddit": "investing",
        "created": 1599221388.0
    },
    {
        "author": "hughesmaxwell",
        "body": "Banks are bad business in a low-rate environment. Plenty of amazing growth stories out there instead of CCL. I would consider NET CRWD FSLY TTD SHOP SE Z AMD BABA COUP OKTA DDOG ZS AYX PYPL etc.",
        "created_utc": 1601179660,
        "id": "g6s4qo4",
        "score": 4,
        "subreddit": "stocks",
        "created": 1601208460.0
    },
    {
        "author": "alphamd4",
        "body": "that really makes no sense, elon only built paypal before tesla. by your logic he cannot do it either",
        "created_utc": 1601415919,
        "id": "g73yjhc",
        "score": 4,
        "subreddit": "investing",
        "created": 1601444719.0
    },
    {
        "author": "rhganggang",
        "body": "Marry SE, fuck AMD, kill PYPL",
        "created_utc": 1599260976,
        "id": "g424625",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599289776.0
    },
    {
        "author": "Educational_Author_4",
        "body": "Drop PYPL and get SQ instead.",
        "created_utc": 1599009039,
        "id": "g3o138m",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599037839.0
    },
    {
        "author": "Leroy--Brown",
        "body": "Under rated comment.\n\nWhile my personal investing account would be happy that SQ does as OP predicts, that's why I hold both. I have V in my Roth account, and won't sell it, basically forever, or at least 5-10 years. Visa and mastercard are likely the only finance companies related to consumer spending that have an actual moat due to their ability to process payments immediately in a way that literally every other bank (large or small, old or fintech) is required to utilize their channels to have payments process.\n\nYes, SQ is a bank now. Yes I'm happy they've had a huge run up for the past couple years. Yes I'm sad that I sold half of my position when I had 100% return. No, I do not plan on selling more. Yes SQ is fantastic, and yes I hold a similar amount in PYPL as well. \n\nNo, I do not think SQ or PYPL will surpass visa as the king of payment processing. Visa is a giant, and could simply reveal their own p2p lending platform if any of the minor banks manages to cross their moat....it still hasn't been crossed yet.",
        "created_utc": 1599285604,
        "id": "g437if5",
        "score": 3,
        "subreddit": "investing",
        "created": 1599314404.0
    },
    {
        "author": "88ace",
        "body": "I’ve never paid interest on consumer items so in my case the guy above is absolutely right. If you pay 7 percent interest on something like a TV or Xbox you’re right and it’s ridiculous but anytime I make a big electronics purchase whether through PayPal finance or an Amazon credit promotion it’s 0 percent interest with monthly payments. Sometimes it is in the buyers interest to take the financing IF there’s no interest attached.",
        "created_utc": 1599676571,
        "id": "g4klcp1",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1599705371.0
    },
    {
        "author": "Pustiki",
        "body": "PYPL $220c 10/16",
        "created_utc": 1599185925,
        "id": "g3xsfwz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599214725.0
    },
    {
        "author": "RaptorMan333",
        "body": "I bought a small amount of AMD, MSFT, NVDA, ARKK, APPL, SQ, PYPL. These are all solid choices, but honestly there's a good chance things will dip even further. Keep in mind that even with the 5-8% downturn, they're still just at the levels they were at literally 3-4 weeks ago. Don't FOMO buy with all your money. Keep some ready in case things get hairy.",
        "created_utc": 1599154796,
        "id": "g3vi9df",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599183596.0
    },
    {
        "author": "MrRapCap",
        "body": "PayPal mooning",
        "created_utc": 1599160746,
        "id": "g3w09ns",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599189546.0
    },
    {
        "author": "Klutzy_Hamster",
        "body": "Cathie Wood is more bullish on SQ than PYPL. She mentioned SQ has more ambitious plans down the road.\n\nEDIT: Not to say that PYPL is a bad pick. I'm sure it will also do relatively well compared to the market. SQ is just a higher volatility/higher reward type of play.",
        "created_utc": 1600191581,
        "id": "g5dnxzk",
        "score": 3,
        "subreddit": "stocks",
        "created": 1600220381.0
    },
    {
        "author": "staynight",
        "body": "Never touching PayPal again",
        "created_utc": 1600192875,
        "id": "g5dqyzp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600221675.0
    },
    {
        "author": "DonCorleone47",
        "body": "PayPal needs it’s blood oxygen levels checked",
        "created_utc": 1600193571,
        "id": "g5dsobe",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600222371.0
    },
    {
        "author": "skywalker4588",
        "body": "Does make sense. I do prefer a more aggressive portfolio so might do a 60-40 SQ / PYPL split",
        "created_utc": 1600184715,
        "id": "g5d741d",
        "score": 3,
        "subreddit": "stocks",
        "created": 1600213515.0
    },
    {
        "author": "8KB8_M",
        "body": "Paypal me $5 to photoshop your portfolio green  🤡🤡🤡",
        "created_utc": 1600686158,
        "id": "g636g6s",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600714958.0
    },
    {
        "author": "nycgarbage",
        "body": "Because PayPal",
        "created_utc": 1600813879,
        "id": "g69ey38",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600842679.0
    },
    {
        "author": "RaptorMan333",
        "body": "Buy now honestly. Or partially buy now. Paypal is pretty fair rn esp compared to SQ (which I also love but you're paying for that future growth).\n\nI love paypal personally. I think it's a super decent buy right now. It's something you're going to want come next year or the year after.",
        "created_utc": 1600234323,
        "id": "g5g1b12",
        "score": 3,
        "subreddit": "stocks",
        "created": 1600263123.0
    },
    {
        "author": "iggaguy",
        "body": "Someone please tell me pypl won't shit the bed again tomorrow so I can sleep easy tonight.",
        "created_utc": 1600226681,
        "id": "g5fpicv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600255481.0
    },
    {
        "author": "OppaGamerStyle",
        "body": "Balls deep in PYPL and it feels damn good",
        "created_utc": 1601443765,
        "id": "g75a1ya",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601472565.0
    },
    {
        "author": "Rcrowley3",
        "body": "PYPL doing me well.",
        "created_utc": 1601348269,
        "id": "g70v9i8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601377069.0
    },
    {
        "author": "TerrorDeity",
        "body": "then maybe a good time to get pypl?",
        "created_utc": 1600179191,
        "id": "g5cuo7s",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600207991.0
    },
    {
        "author": "skywalker4588",
        "body": "It’s interesting that ARKF has a top holding of SQ at 11.33% but PYPL isn’t in its top 10 holdings.",
        "created_utc": 1600185501,
        "id": "g5d92rq",
        "score": 3,
        "subreddit": "stocks",
        "created": 1600214301.0
    },
    {
        "author": "AllDatDalton",
        "body": "FDX UPS PYPL SQ c\n\nMRNA BA NCLH p",
        "created_utc": 1600029705,
        "id": "g55rux3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600058505.0
    },
    {
        "author": "OGWFORLIFE",
        "body": "Welp, looks like I will once again sell all my positions for a loss trying to play a pullback. The only one who made a measly $500 profit was BA. I never got the memo that AAPL, AMD, and PYPL were all shitty companies with shit stock.",
        "created_utc": 1600436267,
        "id": "g5p8akr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600465067.0
    },
    {
        "author": "jbrownwood",
        "body": "Yea both of my friends had cash app on their phone linked to their bank accounts. Scary stuff as there’s nothing you could do to prevent it. I’ll just stay away from those apps and hope they don’t figure out how to do it through PayPal.",
        "created_utc": 1600551167,
        "id": "g5v8m7g",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600579967.0
    },
    {
        "author": "A-Pak-Of-Brownguys",
        "body": "Worst DD ever. \n\n1. Nike layoffs were planned years ago and the result was not Covid related. The matrix within the company became inefficient where horny leadership boomers were creating position for extremely attractive interns.  Don’t believe me? Explain why 7 top executives abruptly left. There was a teammate who was responsible for our emails, PDFs and sending out daily reminders. She also filled in when someone called out.\n\n2. Nike is transitioning and expanding into technology. The reason why Jeff Donaugh took over as CEO. He has decades of experience at EBay and PayPal. We’re in the midst of upgrading everything tech related and started using cloud related services. Same with our logistics.\n\n3. Nike spent billions expanding manufacturing in Central America due to the deteriorating relationship with China.\n\n4. Nike is innovating their shipping order system. If your located in and order something online, it will be fulfilled near the closest distribution center rather than across the country. This results in tou getting the product faster. \n\n5. I am an internal mid level employee who’s attractive assistance was laid off.\n\nBtw all of this information can be found by an advanced google search",
        "created_utc": 1599513869,
        "id": "g4dos1p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599542669.0
    },
    {
        "author": "Jm2421",
        "body": "I would just lose the money I PayPal to myself anyways",
        "created_utc": 1599740692,
        "id": "g4nz7nq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599769492.0
    },
    {
        "author": "ghathawayjunior",
        "body": "I was thinking of taking my SQ gains into MA or PYPL to have a less volatile position",
        "created_utc": 1599104754,
        "id": "g3t21lo",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599133554.0
    },
    {
        "author": "RatchetCliquet",
        "body": "PYPL a sleeping meme stock",
        "created_utc": 1598969095,
        "id": "g3l7w9m",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598997895.0
    },
    {
        "author": "JabootieeIsGroovy",
        "body": "i’m rly betting on a red monday not for my puts but so i can buy some leaps for fdx, ups, and so that i can play paypal earnings",
        "created_utc": 1601063407,
        "id": "g6kf02d",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601092207.0
    }
]