[
    {
        "author": "Leroy--Brown",
        "body": "Who makes the patents that Huawei uses? Qualcomm. Who makes the patents that every company (except Samsung) used for 4g also? Qualcomm. They're my large cap choice. They are sitting on a cash horde, and continue to spend the vast majority of their revenue on R&amp;D. They also have a track record of producing the best revolutionary modems and chipsets out there, so I'm betting it'll happen again. Their leadership isn't the best though.\n\nThere are a bunch of foreign choices also, if you invest in the South Korean index, you're investing in Samsung. They will continue to be a dominant player in the space. \n\nSome small cap choices, skyworks, Marvell, and inseego. I haven't done full DD on those small cap picks yet. \n\nAlso the safe and boring bet is AMT, CCI or SBAC. \n\nNon american bets would be Ericson or Nokia, but rumor is it that Nokia will lose the transmission race. \n\nSafe bets are also on VZ or T. Those are boring choices, but they're also prepared to have towers and phones for whoever makes the best transmitters/modems.\n\nDo a search, people were talking about 5g on here for the past 6 months.",
        "created_utc": 1585019890,
        "id": "flc4roo",
        "score": 5,
        "subreddit": "investing",
        "created": 1585048690.0
    },
    {
        "author": "p_giggles",
        "body": "Not true. When companies come out and say they're going to miss guidance/pre announce earnings (AAPL, QRVO, SWKS, NXP to name a few), it's clearly a very real shock to the economy. Once the quarter itself ends on 3/31 we will see another much bigger wave of preannouncements.",
        "created_utc": 1583972301,
        "id": "fk9avde",
        "score": 4,
        "subreddit": "stocks",
        "created": 1584001101.0
    },
    {
        "author": "inferno9416",
        "body": "skyworks is aapl supplier which is why im bagholding puts.",
        "created_utc": 1583381180,
        "id": "fjj1yg7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1583409980.0
    },
    {
        "author": "WestmontOG07",
        "body": "Amazon, google, FB, Qcom, SWKS, VOO, CSCO, Pfizer and Intel all the way down!\n\nAlso buying puts on the SPY!\n\nWhat are you buying?",
        "created_utc": 1584406963,
        "id": "fkpcnfl",
        "score": 2,
        "subreddit": "stocks",
        "created": 1584435763.0
    },
    {
        "author": "WestmontOG07",
        "body": "Conceptually, I completely agree with the thinking, but I am holding because the companies I own have safe dividends, are essential companies and, frankly, I don't want to sell: Google, Amazon, Facebook, Pfizer, CVS, Cisco, Intel, Qcom, Swks, VOO. I'll take the dividend re-investment at these low prices (On the ones paying dividends, of course), continue to add to my positions on decent dips, and look back in, very likely, 12 months and be looking at all time highs again. \n\nIt was a story I told my brothers yesterday, on an anecdotal level, of course, but one that I do believe applies to many Americans:\n\nI had to run to CVS to get a prescription for my daughter yesterday, while I was waiting in line, I used my apple iPhone, on my Verizon cell phone, to call my wife to make sure we didn't need anything else. All the while, I went on Facebook to see what late / great breaking news there would be. When I finally got to the cashier, I used my American express credit card to buy the goods. On the way out, I happened to see some Cherry Vanilla Coke, of which I bought, and then left. \n\nMy point is that, if the common investor, like myself, can take a step back, specifically at these market prices, we really are getting unreal buys for the long term with companies that are well capitalized, well used and well positioned, when the corona virus goes away, to succeed in the future. \n\nBTW: I would order off of Amazon, but we all know they are focused on the medical / essential side of things. \n\nWorking under the presumption that the government is going to bail out the American worker, I think now may be the greatest investment opportunity we have had in a while for stock pickers. \n\nGood luck everyone!",
        "created_utc": 1584636082,
        "id": "fkxv825",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584664882.0
    },
    {
        "author": "WestmontOG07",
        "body": "Magic:\n\nSure, I like: Amazon 1650 or less is a steal. (Retail Landscape will forever be changed, with incoming bankruptcies for certain, and amazon will be a go to — more so than they already are)\n\nFB: anything less than 130 is a steal. Advertising king.\n\nCVS: high 40’s and I’m backing up the truck. This is an essential stock in any economy.\n\nGOOg: any price, they are just so powerful with search and YouTube, not to mention android. The king of Kings on advertising.\n\nVOO: broad S&amp;P coverage. (Spy works too)\n\nHome Depot: best in class and solid dividend.\n\nCisco: networking and now their webex platform. \n\nQCOM / SWKS: (both, at current prices, are ridiculously cheap) direct plays on 5g.\n\nIntel: anything under 40 is literally stealing on this behemoth. (Solid dividend play with tons of FCF)\n\nSpeculative plays: UBER — under 20 / AXP — under 70. PFizer: Under 30 is cheap on this one and they pay one hell of a dividend. Tons of FCF too.",
        "created_utc": 1584753759,
        "id": "fl2lbsa",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584782559.0
    },
    {
        "author": "thesnukeIL",
        "body": "More good news !\n\n [https://finance.yahoo.com/news/apple-supplier-skyworks-sees-no-134542109.html](https://finance.yahoo.com/news/apple-supplier-skyworks-sees-no-134542109.html)",
        "created_utc": 1583330152,
        "id": "fjglu31",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583358952.0
    },
    {
        "author": "CapitalC5",
        "body": "30% of your portfolio per company is way too much. For my portfolio of 8k, I work like this:\n\n3 around 15% (Disney, Mastercard, Google)\n4 around 10% (Skyworks, Square, AMD, Delta)\n2 around 5-6% (Twitter, Incyte)\n1 or 2 around 2% (Nio)\n\nPart 1 are the big cash companies, will come through this recession easily and have good potential upside.\nPart 2 are sub companies. Not the market leaders, but high potential to become a leader. Delta is just an easy pick up at this price.\nPart 3 again higher risk, higher potential. Twitter should be more in the 2nd category, but I didn't want to pay more. Think they will be stable and peak at the end of the year.\nPart 4 is a stocking horse, 5+ years. Maybe it doubles, maybe it goes bankrupt. Worst case, I lose 2% of my portfolio, but I'm confident the other companies will make up for that loss.",
        "created_utc": 1583934183,
        "id": "fk7dmmh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583962983.0
    },
    {
        "author": "m00n3p14",
        "body": "Shall we buy the dip on SWKS?",
        "created_utc": 1583943610,
        "id": "fk7u0qh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583972410.0
    },
    {
        "author": "lessthanpopi",
        "body": "Longterm manly IBM, amd, skyworks, uber, footlocker, UPS, facebook, disney, beyond meat, qualcomm, verizon and few others. Also keeping an eye on stuff like CCL, airlines and RVLV although i don’t feel very confident about them.",
        "created_utc": 1584136451,
        "id": "fkfkjh4",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1584165251.0
    },
    {
        "author": "theducatiguy",
        "body": "Actually, that's not what I said. And if you go read a couple of posts that I made last Thursday and Friday, you will see that the trades in question follow my strategy almost to a \"T\". I average about $141/trade and I've found when I'm cautious, I get to keep my stock and all of my premiums......100% of the time FUCK-STICK. However having said that, I'm prepared to \"settle\" for $50 - $75 on a trade to protect a position.....remember, my AVERAGE is $141/trade. Now if you go read those posts, I was actually quite disappointed and actually quite critical of myself FUCK-STICK because on the JPM $93, we were at about $95 at the close of business on Thursday night. Thankfully we had a down day on Friday, but I was able to keep the stock and the premiums....but it was too close for comfort. And on the SWKS calls, again I had the 3/20 $90 written and at the close of business on Thursday, SWKS was at something like $92 - $93. Again, I was fortunate to be able to keep them but I don't trade on LUCK. if you are trading on luck, you are going to lose your ass and jump out of a window. The fact that I used luck this time was unsettling for me and forced me to take a step back, reevaluate my strategy and make the changes necessary on Monday to make sure I don't do it again (it's kind of nice to be able to report 100% dead on accuracy for a full 6 month cycle in an absolute blood-bath of a market.....even if FUCK-STICKS on Reddit don't get it). Now there you go FUCK-STICK. I actually re-capped that for you. I actually wasn't proud of either one of those trades, but do you know what? I can still say I haven't had an option exercised in more than 6 months. Again, that absolutely could change this week, and if it does, it's going to suck, but this week, I WILL be more careful. By the way, if I do this on 10 or 20 stocks, do you wonder how much money I'm actually going to make?\n\nOne other thing FUCK-STICK, I put my fucking money where my mouth is. I have been buying stock and have made purchases about every few weeks since the first of the year. My last purchase was CREE on 3/26. I absolutely don't give a FUCK what anybody thinks and just for the record, I have owned most of my stocks since about the mid 90's. This would be a good chance to work on your charting skills FUCK-STICK!!!!!\n\nCheers!",
        "created_utc": 1585548061,
        "id": "flweogj",
        "score": 1,
        "subreddit": "options",
        "created": 1585576861.0
    },
    {
        "author": "WestmontOG07",
        "body": "Why pick just MSFT.\n\nThere are so many relatively fairly priced stocks / undervalued stocks, such as:\n\ngoogle\n\nFacebook\n\nAmazon\n\nTOL\n\nAXP\n\nQCOM\n\nSWKS\n\nAll have solid balance sheets and all will be around when we come out of this VIA: 5G, customer spending, e-commerce, home buying and advertising!",
        "created_utc": 1585501690,
        "id": "flufpwa",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585530490.0
    },
    {
        "author": "WestmontOG07",
        "body": "Real simple breakdown of my stocks, and why:\n\nVOO: General S&amp;P coverage, yield and historical growth.\n\nAXP: consumer, when we get back to normal life, Is going to be stronger than ever and will be spending money! (Visa / MasterCard also would be solid buys if price fell more)\n\nCVS: General pharmacy, pharmacy benefits manager and healthcare provider all, literally, under one hood at CVS.\n\nGOOG: search and advertising for when consumer gets back to the world and, don’t forget, we have a presidential election coming!\n\nFB: same as google. Plus their growth and these for growth is still in fact.\n\nAmazon: after this pandemic, I’m convinced that this company will be the king of retail, not just e-commerce, but retail in general.\n\nWFC: solid balance sheet and solid dividend. If there are mass defaults, I think this company is less effected than say a BOFA / JPM / GS.\n\nTOL: Home building isn’t going away anytime soon and people need a place to live!\n\nINTC: king of chips, solid balance sheet, solid cash, solid dividend and, oh yeah, look at microns performance during their earnings, data center is king which intel thrives at!\n\nQCOM: 5G, solid balance sheet, solid cash flow.\n\nSWKS: 5g. No debt. Could be a 200 stock when the ice breaks and 5G blows up!",
        "created_utc": 1585400795,
        "id": "flqn8a2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585429595.0
    },
    {
        "author": "WestmontOG07",
        "body": "My portfolio, for the communities thoughts:\n\nCVS\n\nVerizon\n\nPfizer\n\nIntel\n\nApple\n\nMicrosoft\n\nGoogle\n\nQualcomm\n\nVOO (S&amp;P ETF)\n\nLyondell Basell (Plastics / Polyurethane Manufacturer)\n\nSkyworks (5G)\n\nAmazon\n\nFoot Locker (Wish I wouldn't have bought this one but I'm in the game)\n\nFacebook\n\nCisco",
        "created_utc": 1583670365,
        "id": "fjxenu3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583699165.0
    },
    {
        "author": "WestmontOG07",
        "body": "Hard to argue with the dead cat bounce perspective. History shows we have to retest the lows before the market can steadily bounce back up. All indications are to keep buying puts, but eventually, the market will turn. I'll probably bang out a combination of puts and calls tomorrow on names I like, IE: FB, AAPL, VOO, SWKS, CCL, AAL --- all puts. (It may seem crazy though, I am heavily considering buying AAL calls too, specifically, as I think this stock may get a big bounce.) thoughts?",
        "created_utc": 1583276764,
        "id": "fjer8yo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583305564.0
    },
    {
        "author": "CapitalC5",
        "body": "I don't think 5G will have a big impact on these companies. There will probably also be a lot of problems after the launch, so I would prefer ATT here.\n\nIf you wanna buy stock that benefit more from 5G, think further. Maybe the companies that make the network (Skyworks, Qorvo, etc) or an industry like gaming",
        "created_utc": 1583880435,
        "id": "fk5h7t7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583909235.0
    },
    {
        "author": "WestmontOG07",
        "body": "My rationale is relatively simple, pertaining to the stocks I own, AMZN, GOOG, FB, CVS, PFE, QCOM, SWKS, in that, should job growth decrease and, layoffs occur in abundance, how significant will the earnings of these specific companies be hurt? Do you retrench earnings back 10%, 20%, 30%, again, specifically related to these companies. Personally, based on what I have seen in the past, I believe it's more reasonable, than not, to assume those specific companies will likely see a decrease to the tune of 10% in earnings, given that they are, essentially, vital to the normal routine lives of a majority of the people, not only in this country, but across the world. So, using Google as an example, they had FY earnings of, about, $50 EPS in 2019. Their high was about $1525. Assume, for the sake of the argument that their EPS declines to the tune of 10%, or $5 EPS, making their prospective 2020 total $45. Using a fair multiple, of say 22X, that puts fair value of that stock at: $990 --- would you buy google at $990, or do you think there is further downside? The exercise can go on for the likes of CVS, where folks are going to get their scripts filled, one way or the other, and FB, where, I could argue, the more people are at home, the more people are using it and Instagram. Again, it's a numbers game. This is how I value stocks and, at least for myself, value how I will buy the stocks OR how I will buy puts / buy calls against and for them.",
        "created_utc": 1584322947,
        "id": "fkm803k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584351747.0
    },
    {
        "author": "MakeMyDayGypsy",
        "body": "I don’t think 5G will be as big as people think. XLNX, SWKS.",
        "created_utc": 1585499534,
        "id": "flubx60",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585528334.0
    },
    {
        "author": "theducatiguy",
        "body": "I'll give you two more pieces of information to chew on:\n\n1) All of the numbers I presented to you are from trades I am making weekly, or on an ongoing basis. Two trades I made this week might be worth looking at. On Tuesday, 3/24 I sold covered calls on JPM &amp; SWKS (I own both stocks).\n\nJPM (200 shares) - I sold the 3/27 Call at $93 for $0.72 and made $139 (plus or minus a few pennies for commissions). We closed today (Fri) at $91.13. I got to keep both my stock, and my option premium.\n\nSWKS (200 shares) - I sold the 3/27 Call at $90 for $0.74 and made $145 (plus or minus a few pennies for commissions). We closed today at $87.09. I got to keep both my stock, and my option premium.\n\nI think a fair number of people would look at that and say \"wow, you're a genius. You got to keep your stock AND you made $285 in 3 trading days, and you will get to do it again on Monday.\" And while I did get to keep my $285 and my stock, I looked at both of these trades as pretty close to abject failures....and here's why:  On Tuesday, I was expecting Wed/Thur/Fri to be either neutral, or down days based on the prior few trading sessions. Thursday surprised me by being a fairly strong up day and by the end of the day, I was out of the money on both of these trades. I was incredibly lucky that the market was down today. Had the market stayed neutral (or gone up) I would have lost both of my stocks. I would have generated a taxable event on both of these stocks, and because both of these stocks pay dividends, I would have lost about $270 worth of dividends. This, potentially for me, was a disastrous trade. I got DAMN lucky, and sometimes it's ok if you have just a little bit of luck on your side, but it is ALWAYS better to not need it. The question I ask myself is did I REALLY need to make $285? Could I have \"settled\" for $200? Or $185? Or $100? And the answer is that I could have easily settled for less option premium and less risk that I would have my stock called away. I kind of got cocky and stretched my own trading rules and nearly paid the price. When I do this next week, when I start asking myself questions about my risk/reward, I will likely answer those questions quite differently, and accept slightly less option premium for more comfort that I won't get my options exercised.\n\n2) All of the numbers that I gave you before, regarding my trades really include just my normal option trading strategies on stocks that I hold in my portfolio.....but once in a while, I like to jump out there and have a little bit of fun with what I call a \"FUN\" trade. On 3/24 Boeing was on a bit of a bounce from their low of about $90. Being down from $349 to $90, I see value in BA as long as I'm comfortable that they are not going out of business. So again, on Tuesday with BA at around $120, I jumped out there and sold 4/17 $110 PUTS for $16.00/share. I expected some form of stimulus package from the U.S. Gov't and upside to come. I was fully prepared to own BA at $110 (actually at $94 because I've already received $16 on my PUTS), and I still am if BA should  drop below $110. Well, within 24 hours, the Boeing CEO made a statement that they really don't need the $60 Billion dollars that they wanted entirely for free as long as the Gov't was planning to take an equity stake in the company.....and within two trading sessions, BA was at $180/share on its way to the moon. Now I was prepared to own Boeing at $94 and still will be if it drops below $110 on 4/17.  I could have stepped out there and bought a couple of hundred shares and made quite a bit of money, but that's not my game. I'm prepared to \"settle\" for what I considered a REALLY safe 24 day bet, and if I don't own BA, I can settle for my $1,600/contract. If BA is above $110 but below where it is today, I can potentially lower my cost basis even more by selling another put, or if BA is already past the moon and on its way up to mars, I can happily wave goodbye knowing I already squeezed what I wanted out of it with little to no risk. I use this as an entrance strategy, and truthfully I believe I will own BA before this is all over with and I believe I will own it for less than $90/share.\n\nI will post a snapshot of the trades I made above under my profile and will delete them within 24 hours just so you know I'm not blowing smoke up your ass.\n\nEveryone gets to select their own trading / investing strategy and mine happens to be a very conservative strategy using the most aggressive tools in the industry (options). LOL When I tell people that I trade options and it's \"conservative\", they have a really difficult time getting their heads wrapped around that. I also have friends that believe a 90% success rate with their trades is acceptable so when I say my goal is 100%, again they have a really difficult time with that conceptually. Nobody should ever set their goal to be a loser if you are not...but we all get to select a risk/reward strategy that works best for us.\n\nI wish you the best of luck!",
        "created_utc": 1585350489,
        "id": "flp2rch",
        "score": 1,
        "subreddit": "options",
        "created": 1585379289.0
    },
    {
        "author": "Glockachuuuu",
        "body": "SWKS, TM, LMT, PANW, SRE",
        "created_utc": 1585690989,
        "id": "fm25j5w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585719789.0
    },
    {
        "author": "eoliveri",
        "body": "I don't know why, but the same thing happened to me with the SWKS $101 puts I wrote last Monday that expired Friday.  SWKS closed at $100.18, but I haven't had to buy the stock yet ....",
        "created_utc": 1583085432,
        "id": "fj731f5",
        "score": 1,
        "subreddit": "options",
        "created": 1583114232.0
    },
    {
        "author": "WestmontOG07",
        "body": "Forget price but also look at:\n\nGoog\nAmzn\nFB\nQCOMM\nSWKS\n\nThe big names are the first to get hammered but the first to skyrocket too.\n\nAlso, use the dip and downturn to roll out of mid tier names into the highest quality names. \n\nThis will put your portfolio in a solid position, when the world straightens itself out, for years to come.\n\nLastly, use common sense. The market rebounded by 1,200 points yesterday, why!? What changed from the down 2,000 point day before? Nothing!\n\nGood luck to all!!",
        "created_utc": 1583933055,
        "id": "fk7bwhu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583961855.0
    },
    {
        "author": "Antennangry",
        "body": "Heard about it a year ago. Was like \"wtf are options, sounds risky, market could turn south at any moment\". Stayed far away. Then a month ago China goes on lockdown and I'm like \"okay, how do I bet against Apple's silicon vendors? Bet those wallstreetbets idiots know\". I buy one SWKS put contract, and a MSFT FD call because I was told it literally could not go tits up. MSFT call goes to shit instant, obvi, but the SWKS put starts creeping up in value. Then Feb 24 rolls around and suddenly my portfolio is raining tendies. Transferred as much cash as I felt comfortable losing into my brokerage account, and it been an obsession from that point forward.\n\nPersonal high score was 16k profit, down to 8k after the presser pump yesterday. HOLDING MY FUCKING PUTS.",
        "created_utc": 1584194216,
        "id": "fkhb1dp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584223016.0
    },
    {
        "author": "WestmontOG07",
        "body": "Taeqwondeles, completely agree for long term investors. \n\nEventually, we are going to hear of the government stimulus, when that happens, I believe everyone will start to have a comfort level regarding the employment situation. \n\nUnfortunately, there are going to be a lot of layoffs, but, with a long term horizon, there are some homeruns out there. \n\n5G, qualcomm and skyworks specifically, have blown up in early day trading. \n\nGood luck but I am buying as well.",
        "created_utc": 1584629822,
        "id": "fkxk3uc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584658622.0
    },
    {
        "author": "zachyal",
        "body": "MA, DIS, TSLA, MSFT, FB, GOOGL, SQ (Will be volatile), Big 4 Banks, SWKS",
        "created_utc": 1584884185,
        "id": "fl6uyzc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584912985.0
    },
    {
        "author": "WestmontOG07",
        "body": "I think we are still in a technological revolution.\n\nAmazon, Google, Facebook and Apple are the top names IMO. I like these names because they are top of class and, arguably, have the best balance sheets in the world, google specifically. (They are the first to get crushed BUT they are also the first names to skyrocket)\n\nWhen 5g rolls around, I also believe we will look back at the price of Qualcomm and Skyworks and ask ourselves why we didn’t buy!\n\nDiversity, unless you’re buying bonds, is a silly game to play knowing the power these companies have, again, IMO!",
        "created_utc": 1584036472,
        "id": "fkbnu2g",
        "score": 0,
        "subreddit": "stocks",
        "created": 1584065272.0
    }
]