[
    {
        "author": "i_ate_too_much",
        "body": "Citrix fucking sucks and the products suck.  They had that embarrassment of a vulnerability they didn’t patch until recently.  Garbage company with 2nd tier products.  They ain’t an industry leader.  FYI VMWare is king of VM and the real chads are in AWS anyway.",
        "created_utc": 1582618616,
        "id": "fips3bc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582647416.0
    },
    {
        "author": "catchyphrase",
        "body": "VMW is also a great buy right now for July. VMW delivers solid back end hypervisor solution but it’s front end deliver is dirt. Fred Flinstone technology. No one does DaaS better than Citrix. most every major bank and financial institution runs Citrix front end delivery. You’re right, I’ll also pick up some VMW. I like backends, I can not lie.",
        "created_utc": 1582659172,
        "id": "fir7z1l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582687972.0
    },
    {
        "author": "kjc623",
        "body": "hahahaha my iq just halved because of this post. At least I’m still double digits unlike OP. Citrix bad VMware good.",
        "created_utc": 1582636172,
        "id": "fiq61ft",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582664972.0
    },
    {
        "author": "TheLevelHeadedGuy",
        "body": "My company just switched from Citrix to windows for our remote network, so that’s a no from me dog",
        "created_utc": 1582635100,
        "id": "fiq4sqf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582663900.0
    },
    {
        "author": "hugsfunny",
        "body": "&gt; Yes.  Or only a handful of people who work as a team.  You haven't heard the expression, \"too many chefs in the kitchen?\"\n&gt; Data is useful for scientific exploration.  It is NOT useful in designing usability for software.\n&gt; It's not up to physicians to come up with the solution.  That's the whole point.  Just like food critics don't need to be world class chefs to be able to tell what's good food from bad food. To be a leader in any field means presenting to the public what they never knew they needed.  I presume you are aware of the history of technology.  You shouldn't need me to explain this to you.\n\nIt’s not the 1960s anymore. You’re describing the cowboy Don Draper way of doing business. Multi-billion dollar enterprises don’t operate that way. Period. It’s not as effective as data driven decision making. \n\nFor example, if there are 3 different workflows for completing the same task, with 300 hospitals having  adopted each workflow, Epic can collect KPIs related to user satisfaction, efficiency, health outcomes, billing outcomes, etc for each workflow. Keep in mind that these KPIs are designed by organizations like Epic then recommends the workflow with the best outcomes, and they design their system around it. \n\nNo single human being is wise enough to consistently beat this model by choosing the workflow with their “gut”. That sort of “visionary” is myth. Nothing more. \n\n&gt; More IT people isn't going to help the problem.  The problem is the fundamental model of Epic is not well-designed and depends far too much on healthcare workers who know what they need FOR THEIR JOB, but don't know what they need from Epic to get it done optimally.\n\nUntil there’s further standardization in healthcare models, I’m afraid more QUALIFIED IT workers are necessary. There’s a certain amount of adjusting that’s required not because Epic is flawed but because every health organization is using slightly different workflows, slightly different orders, slightly different physical layouts, etc. \n\n&gt; Yet, they expected us to know how Epic, a software that we had no experience in, should build our module.\n\nSounds like you had some incompetent implementers. They should have been able to build the system for you based on a serious of Q&amp;A’s that require zero knowledge of Epic. Basically, “Do you do it this way or that way? Do you have this device or that device?” Etc \n\n&gt; FINALLY, one day I figured out what happened.  My keyboard has a backslash key above the Enter key that I was accidentally brushing when I was typing.  Apparently, doing this while in a report, it functions as some kind of \"escape\" key.  If you keep typing on the keyboard, nothing appears.  However, if you tap it again, it brings up a little window that shows everything you were typing while it was in \"escape\" mode.  The IT people had no idea why it was doing that nor what it was for.  There is NO indication on the screen that you've entered this mode, or what that little window is for after you type it in.  As far as I can tell, it's some developer's backdoor way of doing something to the system. That is just a tiny example of all the little random unexplainable hair pulling shit that happens in Epic.\n\nThis is exactly what I’m talking about in my previous post. This has NOTHING to do with Epic. That’s not an epic function. No idea why your computer was doing that. Maybe your IT staff installed a program that hijacked the / key? Or they installed something on the Citrix server? \n\n&gt; Okay, it's pretty clear that you work for Epic at this point.  Judy is NOT Steve Jobs.  Maybe she's a good company leader - I don't know.  I have no knowledge of her at all.  But based on the software, she's certainly not a visionary. \n\nI don’t work for Epic. \n\n&gt;  I get frustrated with Epic not because it's not functional.   We certainly CAN get our jobs done by figuring out workarounds.  But there are so many examples of things that shouldn't need a workaround.  I get frustrated because being a tech savvy person, I KNOW that current day software is capable of so much more and has been for a long time.  Another example?  The search bar in Epic feels like it's there just because Google made it trendy.  I've tried searching for so many things.  It's pretty much useless.  If I have to learn how to use a search bar, it's already a failure.\n\nEpic is functional. You think companies like Mayo Clinic, Cleveland Clinic, and KP would invest in a software that doesn’t function? Your particular build of Epic might require workarounds but that’s because your IT staff messed it up. And the search function works great. No idea why you think it doesn’t. It’s not complicated. \n\nAnyways, not arguing for the sake of being controversial, it’s just not often I get to have this conversation anonymously. Dialogue can be constructive :)",
        "created_utc": 1582317659,
        "id": "fiba23m",
        "score": 1,
        "subreddit": "investing",
        "created": 1582346459.0
    },
    {
        "author": "burlapballsack",
        "body": "I was looking at that - I've only got access to a Mac at home.  The required Citrix client connects but tells me it can't log in.  Unsure if it's me or them.",
        "created_utc": 1581090448,
        "id": "fgsqfr9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581119248.0
    },
    {
        "author": "burlapballsack",
        "body": "Yeah, for some reason I've never been able to get it to connect using the Citrix client on MacOS.  It connects, but tells me it can't log in.  Unfortunately I don't have access to a Windows box at home to install the native application.\n\nThat seems to be my next step though.  I'll probably keep fucking with it.  At some point my desire for tendies will outweigh my lethargy about installing Windows in a VM.",
        "created_utc": 1581090624,
        "id": "fgsqpvq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581119424.0
    },
    {
        "author": "Arvan_Carrick",
        "body": "I mean, the web interface is pretty shit, but the street smart edge application that runs on citrix is pretty baller, there is a mobile application for it too.",
        "created_utc": 1581708854,
        "id": "fhm66qr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581737654.0
    },
    {
        "author": "nerdyspartan12",
        "body": "Does Citrix will also benefit from remote working?",
        "created_utc": 1582859740,
        "id": "fizd0dn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582888540.0
    },
    {
        "author": "frankenbenz",
        "body": "$CTXS puts?!",
        "created_utc": 1582631666,
        "id": "fiq1dmt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582660466.0
    },
    {
        "author": "PapaCharlie9",
        "body": "&gt; just open a roth ira at fidelity or vanguard and contribute there.\n\nThis. Run, do not walk, away from American Funds as fast as you can.\n\nJust go with Fidelity for both. Easiest option. You can buy Vanguard ETFs for free with a Fidelity IRA or brokerage account.",
        "created_utc": 1580674578,
        "id": "fgcnz9t",
        "score": 2,
        "subreddit": "investing",
        "created": 1580703378.0
    },
    {
        "author": "Napalm32",
        "body": "I like Fidelity's trading platform. It's very clean, minimalistic, relatively intuitive. I can't speak for any other platform but Fidelity. It does everything I need it to do and more. Would highly recommend.",
        "created_utc": 1580596331,
        "id": "fg7mtan",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580625131.0
    },
    {
        "author": "Calivan",
        "body": "Ah... what? Fidelity has free trades, not just ETFs but also stock. Been that way for a while now.",
        "created_utc": 1580598217,
        "id": "fg7pi0c",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1580627017.0
    },
    {
        "author": "jaysomething2",
        "body": "With current conditions like the viruses that are going is it a bad idea to invest in index funds? Do we expect the market to go down or these to continue to go up. I have money and FZROX at Fidelity and I’m wondering if I should move it to biomedical Stark’s instead.",
        "created_utc": 1580624305,
        "id": "fg8mer8",
        "score": 1,
        "subreddit": "investing",
        "created": 1580653105.0
    },
    {
        "author": "venelj",
        "body": "Brokerage Account:\n\nTesla ($TSLA) 23.19%\nMasterCard ($MA) 22.67%\nSquare ($SQ) 18.73%\nInvitae ($NVTA) 13.38%\nMicrosoft ($MSFT) 12.21%\nSea ($SE) 6.49%\nDataDog ($DDOG) 3.32%\n\nRoth IRA:\n\nFidelity Total Market Index Fund ($FSKAX) 100%",
        "created_utc": 1580648335,
        "id": "fga98v5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580677135.0
    },
    {
        "author": "venelj",
        "body": "Brokerage Account:\n\nTesla ($TSLA) 23.19%\n\nMasterCard ($MA) 22.67%\n\nSquare ($SQ) 18.73%\n\nInvitae ($NVTA) 13.38%\n\nMicrosoft ($MSFT) 12.21%\n\nSea ($SE) 6.49%\n\nDataDog ($DDOG) 3.32%\n\nRoth IRA:\n\nFidelity Total Market Index Fund ($FSKAX) 100%",
        "created_utc": 1580648437,
        "id": "fga9i9z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580677237.0
    },
    {
        "author": "Power80770M",
        "body": "Forgot to mention that I'm using Fidelity.",
        "created_utc": 1580651336,
        "id": "fgahhpn",
        "score": 1,
        "subreddit": "options",
        "created": 1580680136.0
    },
    {
        "author": "Power80770M",
        "body": "Hwhaaattt? I can trade options in premarket trading with Fidelity? I genuinely had no idea.",
        "created_utc": 1580654344,
        "id": "fgaqv9v",
        "score": 1,
        "subreddit": "options",
        "created": 1580683144.0
    },
    {
        "author": "binstinsfins",
        "body": "Still on the waitlist since day one, so I moved my account to Fidelity. Already have my 401 and HSA through them, may as well consolidate.",
        "created_utc": 1580589104,
        "id": "fg7ccrz",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1580617904.0
    },
    {
        "author": "Cruian",
        "body": "I'd move everything from American to your choice of Fidelity, Schwab, or Vanguard. All 3 offer great index funds and target date index funds of their own with very low (and in the case for 4 Fidelity funds, even no) expense ratios.\n\n&amp;#x200B;\n\nFidelity and Schwab do have mutual funds that are much easier to get into, with only $1 initial and ongoing required. I'd also personally prefer these 2 since they offer more than Vanguard: 24/7 customer service, checking or cash management accounts with ATM fee refunds (Vanguard closed the closest thing they had over the summer, and even then, it was much more limited than Fidelity or Schwab's offerings), and both offer optional credit cards if you wish. For stocks and ETFs, Fidelity is in the process of rolling out fractional shares over the next few weeks, Schwab has announced it but has not started a rollout yet (I believe I heard spring?).\n\n&amp;#x200B;\n\nYou should open a high yield savings account in addition to everything else, possibly except if you go with Fidelity or Schwab and use their CMA or checking accounts (since you can invest money there in money market funds which should return similar to a HYSA, but you do give up FDIC or NCUA insurance by doing this).",
        "created_utc": 1580674576,
        "id": "fgcnz1p",
        "score": 1,
        "subreddit": "investing",
        "created": 1580703376.0
    },
    {
        "author": "Iamnota_man",
        "body": "At Fidelity, pretty much the 1st statement.   Though in reality, every stock you buy could go to zero/bankrupt.....leveraged funds could do it quicker",
        "created_utc": 1580568377,
        "id": "fg6hu6y",
        "score": 1,
        "subreddit": "investing",
        "created": 1580597177.0
    },
    {
        "author": "Ugadawg7",
        "body": "Fidelity",
        "created_utc": 1580571123,
        "id": "fg6liyv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580599923.0
    },
    {
        "author": "JerseyFlashBoys",
        "body": "Update: Fidelity didn't issue me a 1099-B just a 1099-R so i did something wrong",
        "created_utc": 1580601918,
        "id": "fg7upay",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580630718.0
    },
    {
        "author": "hexleythepatypus",
        "body": "A couple questions for you:\n\n1) Which target date fund are you holding in your 401k? One of the standard Fidelity Index ones? (e.g. I have a good bit of Fidelity’s 2055 Index FDEWX). I ask because Fidelity has different target date funds, some of which are much more expensive.\n\n2) What funds are available in your 401k plan? Can you purchase iShares ETFs? Or is the fund selection pretty small?\n\nI ask these things because while factor investing is pretty cool and technically more theoretically optimal when implemented properly, it’s hard to beat the behavioral benefits of automatically DCA-ing into a dead simple one fund portfolio that automatically rebalances for you.\n\nIf you’re really dying to get some flexibility though, then I think your plan of contributing up to the 401k match then maxing your Roth IRA (do Roth if you can) is good. But I would put leftover money after this back into the 401k and max it before looking at a taxable account. Utilize those tax advantages accounts as much as you can!",
        "created_utc": 1580573258,
        "id": "fg6oko9",
        "score": 1,
        "subreddit": "investing",
        "created": 1580602058.0
    },
    {
        "author": "SirGlass",
        "body": "Note I don't hate robinhood but I appreciate what they have done. Now nearly every major brokerage charges no commission . Schwab, Fidelity , Etrade , TD Ameridtrade and a whole slew of other brokerages.\n\nRobinhood forced there hand, even if you think it sucks you can appreciate competition being good for the comsumer",
        "created_utc": 1580603629,
        "id": "fg7x0fo",
        "score": 1,
        "subreddit": "investing",
        "created": 1580632429.0
    },
    {
        "author": "Monstructs",
        "body": "I have a Rollover IRA with 52k. I’m looking for advice on where I should move it to potentially the best products to put it in. \n\nMy wife and I are in our mid/late 40’s. Combined we make right around $200k a year. We have about $95k in retirement accounts and about $10k in savings. We want to continue to grow our retirement savings, and still be able to travel.\n\nWe’re not against taking risks and playing the long game. Thought our single largest Rollover IRA has been fairly flat for the last 10 years (currently at $52k). It’s in a managed account with a financial advisory firm and in a fidelity account. The fees are $628 per month. I believe the fees are destroying my gains. It looks like the fund choices are producing, but the bottom line has felt flat (slightly upwards over the last 10 years). \n\nOut of that $95k, $18k is in a separate Fidelity account in a S&amp;P 500 fund/product. And we have  5 shares of Amazon (totaling about $10k now) and a few shares of Visa &amp; MasterCard (totaling $2.5k). \n\nOur home is valued at about $360k and we have about $250k left on the mortgage. Out two vehicles were both PreOwned, but not inexpensive and we owe about $20k on the 2016 Mini Cooper and $33k on the 2013 Porsche Cayenne. We have about $20k credit card debit we’ve been grinding down the CC debt over time. From as high as $45k or so, to $20k). \n\nMy wife is very good with money. I am not. We money becomes an issue, I tend to look for a different employer. (My job is in pretty high demand and I have a good bit of experience).  \n\nThe two other upcoming expenses we foresee will be buying a preowned Airstream travel trailer and replacing our floors in our home. Other than that, it will be retirement savings. \n\nAny advice would be welcome.",
        "created_utc": 1580654599,
        "id": "fgarm3y",
        "score": 1,
        "subreddit": "investing",
        "created": 1580683399.0
    },
    {
        "author": "Ken385",
        "body": "Yes, but Fidelity doesn't offer access to the full session.  I believe they allow access at 7am et. (could be a bit earlier).  Only the SPX and VIX options trade in this early session.\n\nYou will need to use their Active Trader Pro software and pick extended hours when you place the order.\n\nJust a heads up, many reps there do not know that this can be done.  I entered an order last week to confirm that it is still possible and it is.",
        "created_utc": 1580654678,
        "id": "fgarty0",
        "score": 1,
        "subreddit": "options",
        "created": 1580683478.0
    },
    {
        "author": "SageCactus",
        "body": "Fidelity will let you do it.  You need to sign up for international trading in your account and then tell them Poland.",
        "created_utc": 1580641723,
        "id": "fg9plew",
        "score": 1,
        "subreddit": "investing",
        "created": 1580670523.0
    },
    {
        "author": "Ken385",
        "body": "Yes, the SPX and VIX options have a early session of trading between 3am and 915am et.  Liquidity isn't bad either.  The only retail broker that I know of that offers access to the whole session is IB, with Fidelity offering access to the latter part.  I have been trading this for some time and there are some opportunities every now and then.\n\nStarted about 5 years ago. Here is a Bloomberg article about it.\n\n[https://www.bloomberg.com/professional/blog/response-overseas-demand-cboe-extends-vix-spx-options-trading-hours/](https://www.bloomberg.com/professional/blog/response-overseas-demand-cboe-extends-vix-spx-options-trading-hours/)",
        "created_utc": 1580663130,
        "id": "fgbkrid",
        "score": 1,
        "subreddit": "options",
        "created": 1580691930.0
    },
    {
        "author": "leadrain86",
        "body": "Nah. Just do both.  Don’t blow your investment account(s) on trading. \n\nINVESTING AND TRADING ARE SEPARATE THINGS. \n\nYou can buy and hold in one account and stock trade in another. \n\nNOT DOING BOTH AND KEEPING BOTH SEPARATE were OPs mistakes, not trading itself. \n\nHere’s the correct way: \n\n1. 401k investing (or something similar).  This is your first and foremost, put the money away, let Fidelity or whoever do their jobs, don’t touch it.  Monitor it, ask questions, maybe make some changes WITH your financial advisor.  Other than that, leave it alone. \n\n2.  Want to be like OP and never trade again, cuz you suck at it? Ok, open a second IRA, a Roth preferably, 100% ran by you, buy and hold the next Amazon, Apple, Netflix, etc. Woohoo, you’re a genius. \n\n3.  Not touching 1 or 2 whatsoever, day trade with separate funds that you’re ok with losing.  Have some type of limit...IE “if I lose 50k, I’m done because obviously I suck at this.”",
        "created_utc": 1580641456,
        "id": "fg9orqk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580670256.0
    },
    {
        "author": "jamesbondc",
        "body": "None. Why go with these if you can now trade commission free on big reputable brokerages like for example Fidelity, Td, Schwab or etc.",
        "created_utc": 1580644715,
        "id": "fg9yqn4",
        "score": 1,
        "subreddit": "investing",
        "created": 1580673515.0
    },
    {
        "author": "RVWood",
        "body": "I really love Schwab.  I have only used the majors, but between Vanguard, Fidelity and Schwab I think Schwab has the best overall user experience in terms of personal service and website usability.  In the end, they all have about the same offering though.",
        "created_utc": 1580654113,
        "id": "fgapvt0",
        "score": 1,
        "subreddit": "investing",
        "created": 1580682913.0
    },
    {
        "author": "BooneCreek",
        "body": "This is possible on fidelity, which is what I use.",
        "created_utc": 1580583145,
        "id": "fg73irv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580611945.0
    },
    {
        "author": "trader_dennis",
        "body": "I was a former Lightspeed customer and when zero commissions were announced I tried fidelity. Active trader pro is impossible to day trade on. I could not submit an order in less than 15 seconds. \n\nI also found active trader pro lagged in quotes at the opening.  And my computer has 16gb sad and a 50 mb internet connection. \n\nI switched to Tda think or swim. Almost as good as Lightspeed and I can easily open a new stock and have an opening order submitted a within a second if I choose. The ladder is good to trade on. I submit multiple orders to layer into my position  I like to layer into post earnings trades so speed and quickness are requirements.",
        "created_utc": 1580605937,
        "id": "fg802ta",
        "score": 1,
        "subreddit": "investing",
        "created": 1580634737.0
    },
    {
        "author": "Calls-Only",
        "body": "Fidelity has an etf screener",
        "created_utc": 1580562921,
        "id": "fg6bsco",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580591721.0
    },
    {
        "author": "thewestcoastavenger",
        "body": "I listen to Bloomberg on SiriusXM. I mostly read analyst reports through Fidelity. I've found that most financial reports are like NFL sideline reporters. They don't tell you anything you don't know and often you're thinking \"no shit, everyone knows that\".",
        "created_utc": 1580571653,
        "id": "fg6m9la",
        "score": 1,
        "subreddit": "investing",
        "created": 1580600453.0
    },
    {
        "author": "Cruian",
        "body": "I'm msot familiar with Fidelity. For FTEC for example at Fidelity: [https://screener.fidelity.com/ftgw/etf/snapshot/snapshot.jhtml?symbols=Ftec](https://screener.fidelity.com/ftgw/etf/snapshot/snapshot.jhtml?symbols=Ftec)\n\n\"Prospectus, Reports, Holdings &amp; Index\" near the top. Then in the popup window, the last tab \"Daily Holdings Report\" and open with PDF viewer of your choice.",
        "created_utc": 1580592889,
        "id": "fg7huyb",
        "score": 1,
        "subreddit": "investing",
        "created": 1580621689.0
    },
    {
        "author": "fourteenstix",
        "body": "Thanks for posting this. I’m trying to figure out the best way to get from where I’m at, which is almost all of my retirement holdings in a Fidelity 401k invested in a target retirement fund with limited options, to getting the small cap value exposure Ben recommends. \n\nShould I be in a target retirement fund at all?  Should I reduce my 401k contributions just to my company’s match and out the rest in my IRA for more flexibility, towards attaining the portfolio characteristics I’m after?",
        "created_utc": 1580558923,
        "id": "fg68h3c",
        "score": 1,
        "subreddit": "investing",
        "created": 1580587723.0
    }
]