[
    {
        "author": "andrewwdmoschh",
        "body": "Individual Account\n\n**MFs**\n\nFBGRX\n\nFSELX\n\nVFIAX\n\n**ETFs**\n\nBLOK\n\nDIVO\n\nIBB\n\nSOXX\n\nSWAN\n\nVGT\n\nVUG\n\nVXF\n\nWCLD\n\n**STOCKS**\n\nANET\n\nASML\n\nATVI\n\nAYX\n\nCGNX\n\nCRWD\n\nGMED\n\nNVDA\n\nTSM\n\nVRTX\n\nWEX\n\nWST  \n\n&amp;#x200B;\n\nThanks for taking a glance! This is my personal portfolio I set up in March. I've allocated 16k to the mutual funds, 8k in ETFs, and about 10K in stocks. Currently trying to make ETFs more weighted than stocks and thinking of how to tighten up the stock section before the next downturn. I believe I need not nearly as many and to learn to realize the gains. Stocks are up 7.83% and the entire portfolio is up 5.03%.",
        "created_utc": 1596045672,
        "id": "fzn5tao",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596074472.0
    },
    {
        "author": "sanchezzi",
        "body": "Looking to play DPZ on call side Monday. Also have the following:\n\nCCL Aug 27.50C\nWMT Sep 160C\nCRM Aug 250C\nNOW Aug 590C\nCHWY Aug 65C\nDIS Oct 170C\nFB Sept 335C\nPLAY Aug 22.50C\nANET September 310C",
        "created_utc": 1594598240,
        "id": "fxvoagx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594627040.0
    },
    {
        "author": "veediepoo",
        "body": "Trade Desk, Appian, Elastic NV, Roku, Fulgent Therapeutics, Smartsheet, Appfolio, Slack, Kinsale, Arista Networks",
        "created_utc": 1594831453,
        "id": "fy5re13",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594860253.0
    },
    {
        "author": "Bullish_Investor",
        "body": "BAM, won't have the same massive % growth, but will continue to provide long term value and appreciation through growing dividends and more. \n\nThe only tech and other growth stocks I'm planning to continue to hold are AMD, PINS, STAA, TTD, PEGA, MA, NVDA, ANET, and SWKS.",
        "created_utc": 1593824885,
        "id": "fwv00pu",
        "score": 1,
        "subreddit": "investing",
        "created": 1593853685.0
    },
    {
        "author": "WrongWeekToQuit",
        "body": "CRWD must have been on last year's list or was a web site pick as it's not in the two publications in front of me.  \n\nHere is their \"Election Playbook\", in no order:\n\n&gt;!\n- ERTS\n- EPAM\n- SE\n- AYX\n- ANET\n- ESTC\n- EQIX\n- FSLY\n- MDB\n- PODD\n- NVCR\n- TDOC",
        "created_utc": 1594944663,
        "id": "fyb5jh6",
        "score": 1,
        "subreddit": "investing",
        "created": 1594973463.0
    },
    {
        "author": "sc_shay20",
        "body": "I think this could be right. But who knows. \n\nIf this is the case, ANET will destroy their earnings expectations most likely",
        "created_utc": 1595197823,
        "id": "fylo9nd",
        "score": 1,
        "subreddit": "investing",
        "created": 1595226623.0
    },
    {
        "author": "techmagenta",
        "body": "Juniper, Cisco, ciena, Arista. The other companies aren’t that important",
        "created_utc": 1594746187,
        "id": "fy1xpr3",
        "score": -1,
        "subreddit": "investing",
        "created": 1594774987.0
    },
    {
        "author": "357050",
        "body": "Sold aph at $21 a share ....",
        "created_utc": 1593832425,
        "id": "fwvbavd",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1593861225.0
    },
    {
        "author": "orobsky",
        "body": "I understand your dislike for aph, but I dont get why you are invested in any company in this entire sector. Especially aleafia. Emblem had a ton of potential, but when it didn't work out and they got acquired, why didn't you get out? Do you honestly think that of all the outdoor growers in canada, aleafia will succeed?",
        "created_utc": 1593751966,
        "id": "fwrxi93",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1593780766.0
    },
    {
        "author": "CannaVestments",
        "body": "As others have pointed out, there are some huge flaws and unfound assumptions in your investing premise:\n\n1. Federal legalization, especially as outlined by Biden, certainly does not mean open border cannabis trade with Canada, even it was for just medical. One of the primary foundations of the US cannabis industry is the wealth of jobs and tax revenue it creates here locally... why would Biden/Trump or any state legislature create a federal legalization framework that would hand over the market to Canadian imports??\n2. Given (1), the primary methods LPs will then enter the US market is buying out licenses or partnering with existing operators (as we have seen CGC attempt to do already). CGC/CRON and maybe APH are the only ones with enough capital to make a significant entry and they will be paying top dollar to do so as license valuations will shoot through the roof upon federal legalization. The majority of LPs are just attempting to stay afloat at this point given cash burn rates... not sure how you envision them buying out US operators with far better financials.\n3. The idea that hemp operations will be an avenue to future THC licensing is also unproven at this point. It could, but no states have allowed this to-date so investing based on that thesis would be quite the gamble.\n\nAs such, the idea of investing in LPs on the potential that they might pay top dollar for future US licenses seems extremely inefficient, especially considering the wealth of new capital that would enter the market at the same time. Owning well-run US operators who would be attractive buy-out targets seems like a far better method of capitalizing on US legalization. The OTC/CSE critique is nonsense imo- under the scenario you outline, those US operators would be allowed to uplist to the higher exchanges anyway. Not to mention, the top MSO CSE stocks have been outperforming LPs on larger exchanges for some time now.",
        "created_utc": 1594657692,
        "id": "fxxy2z9",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1594686492.0
    },
    {
        "author": "BoomBoom_King",
        "body": "Would you rather own:\n\n1000 CGC\nOr\n1000 Aph and 1000 TRUL\n\nIts around the same price for either of these options.",
        "created_utc": 1594229141,
        "id": "fxbzlpc",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1594257941.0
    },
    {
        "author": "ps3alltheway",
        "body": "Fuck I'm tired of holding Aph in my account. 3.5 years 0% returns.",
        "created_utc": 1593698579,
        "id": "fwp3t0a",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1593727379.0
    },
    {
        "author": "everythings-awkward",
        "body": "Can we sign out by saying Tune in tomorrow.  Same aph channel. Same aph time? 😂 ahhh i kid i kid",
        "created_utc": 1594645195,
        "id": "fxxbed0",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1594673995.0
    },
    {
        "author": "ps3alltheway",
        "body": "The only real thing I can say is diversify your portfolio. I don't think you will lose holding Aphria, but I don't think this is a 5 bagger/10 bagger like I used to think. \nA few provinces fucked up the roll out so Aphria has not reached it'a full potential yet, so for that reason I don't worry about selling at loss since it's one of the best managed mj companies (sigh). But weed as a cap just like booze has one.  +/- 40 million habitants in Canada, not everyone consumes cannabis. I remember all theses posts about how millenials give up alcohol for cannabis and this is truly not true. People that like to drink and hang out will keep drinking, doesn't matter if they are millenials or not, people that want to chill will keep smoking. Legalization Didn't contribute in creating many more users, all the people that smoked are still smoking and I don't know that many people that dropped booze for weed, yes there are a few but not as much people think. The only difference is instead of buying weed from Little joe or buymyweedonline people go to retail shops. So this said, Aphria IMO as more room to grow, but do I think this is a 10b company in the future? Look at what is happening in the world, by the time Europe and LATAM fully legalizes Aph will have the operations overseas shut down to focus on cost control here in Canada IMO. Covid's colleteral damage on the economy has not even started yet",
        "created_utc": 1594241207,
        "id": "fxcpa9a",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1594270007.0
    },
    {
        "author": "crabby_crusader",
        "body": "1000 aph",
        "created_utc": 1594229412,
        "id": "fxc06sy",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1594258212.0
    },
    {
        "author": "drguid",
        "body": "My complete list of UK mid-caps with progressive dividends. They're not all pharma but there are some real gems here (e.g. KETL). As always DYOR. I've stripped out anything in covid-risk areas and culled out a few more that have suspended dividends.\n\nAlso look at Hikma (although it's pretty big these days) and IBT is a great investment trust that holds pharma growth stocks but also pays a meaty dividend.\n\n&lt;&lt;FTSE250&gt;&gt;\n\nLMP\n\nBME\n\nBWY\n\nFCSS\n\nTEP\n\nBYG\n\nCSP\n\nSVS\n\nULE\n\nUDG\n\nFEV\n\nVSVS\n\nDPLM\n\nCTY\n\nBVIC\n\nQQ\n\nRDW\n\nMGNS\n\nGNS\n\nIHP\n\nCHG\n\nROR\n\nRAT\n\nSXS\n\nSCT\n\nMGGT\n\nFEVR\n\nPLP\n\nRNK\n\nCBG\n\nICGT\n\nPAG\n\nOSB\n\nDPH\n\nHAS\n\nMSLH\n\nUTG\n\nVTY\n\nMCRO\n\nDIGS\n\nSMP\n\nSHB\n\nGPOR\n\n&amp;#x200B;\n\n&lt;&lt;AIM 100&gt;&gt;\n\nABDP\n\nABC (ABCAM)\n\nAMS\n\nWJG\n\nCTH\n\nAPH\n\nKETL\n\nAFX\n\nBVXP\n\nMPE\n\nSMS\n\nFEVR\n\nCVSG\n\nBRK\n\nCLIN\n\nCRW\n\nDTG\n\nRNWH\n\nEMIS\n\nNFC\n\nFDP\n\nNICL\n\nYOU\n\nTUNE\n\nRWS\n\nGAMA\n\nJHD\n\nTRCS\n\nGBG\n\nGHH\n\nIDEA\n\nIGR\n\nRST (RESTORE)",
        "created_utc": 1594140025,
        "id": "fx7xad2",
        "score": 1,
        "subreddit": "investing",
        "created": 1594168825.0
    },
    {
        "author": "GuyOnTheCouch420",
        "body": "I think there’s more of a spread between top Canadian companies and the rest than Us companies.  The top 5 Canadian companies raised an insane amount of capital a few years ago that is just light years beyond what the Us companies did. Add up CGC, CRON, ACB, APH, TLRY...it’s a ton. After that there is a pretty big drop off. But agree their revenues don’t compare. \n\nThe Us, you still have some top ones. But the spread between CURA, TRuL, GTi from a capital raising perspective isn’t as huge compared to MMEN, Cresco, Harvest, IaN, etc. though Cura does seem to be in a different class from a dollars raised view. \n\nSo all that being said, US companies overall are far behind CDN even a few years ago dollars raised (CDN companies haven’t raise nearly as much last year and half as they did before). But when you take out CDN outliers (especially CGC/CRON), I think you’re right as far as where they are positioned.",
        "created_utc": 1593891301,
        "id": "fwxjsal",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1593920101.0
    },
    {
        "author": "Shotgun516",
        "body": "APH And both MSOs are both great companies. If you want to participate in a good bull run (hopefully) then MSOs are where it’s at",
        "created_utc": 1594494909,
        "id": "fxq9of1",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1594523709.0
    },
    {
        "author": "shockfast",
        "body": "I was holding aph at 4.19 sold Alpha at 4.95, bought back in at 4.68 AH and it s already a back up to 4.82...let’s go",
        "created_utc": 1594681336,
        "id": "fxzasvc",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1594710136.0
    },
    {
        "author": "akstock",
        "body": "APH should announce earnings date next week. At least a little run before is probable.",
        "created_utc": 1594396552,
        "id": "fxjiamh",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1594425352.0
    }
]