[
    {
        "author": "Gorndog92",
        "body": "BIGC, UAL (If cash injected by Buffet), CRWD, FTNT, NEE.",
        "created_utc": 1603829149,
        "id": "gab3e5f",
        "score": 2,
        "subreddit": "stocks",
        "created": 1603857949.0
    },
    {
        "author": "hummus_is_yummus1",
        "body": "NET, FTNT, TEAM, keeping an eye on KC.\nThen obviously AMZN, MSFT, GOOG.\nMostly bull call spreads with 3+ month expiry for all. Expect that many more promising cloud computing companies will emerge over the next couple years.",
        "created_utc": 1602485036,
        "id": "g8kjjii",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602513836.0
    },
    {
        "author": "quashiorkor",
        "body": "20 years old, started this month \\[numbers in 100€\\]\n\n\\-Moderna 14  \nShell 10  \nZalando 9  \nAmgen 8  \nZynga 7  \nNokia 6,5  \nIntel 6,5  \nFortinet 5,5  \nAT&amp;T 5  \nDisney 4  \nEricsson 4  \nVectron 4  \nMonster 3  \nHensoldt 3\n\nI also have 6k left to invest",
        "created_utc": 1603302623,
        "id": "g9k9lko",
        "score": 1,
        "subreddit": "stocks",
        "created": 1603331423.0
    },
    {
        "author": "preferoldredditcom",
        "body": "You hardly know about the company and you want to invest in them?\n\nWhy Cisco? There are a multitude of cyber security companies that are taking them on. They sell \n\nIf you look at their 10-Q\n\n&gt;\"What's a 10-Q?\"\n\n75% of their revenue comes from hardware sales which competes with $ANET $JNPR, $PANW, $EXTR, etc\n\nTheir revenues are not growing at all and have been stagnant.\n\nOn the software side, you have $NET, $RPD, $FTNT, etc which compete with their cybersecurity offerings and have strong revenue growth.\n\nNext time, do some research so you can have a proper discussion instead of getting others to spoon feed you the answers. You haven't made a case for investing in these companies at all.",
        "created_utc": 1601629860,
        "id": "g7duhnl",
        "score": 1,
        "subreddit": "investing",
        "created": 1601658660.0
    },
    {
        "author": "ixamnis",
        "body": "ETFs help you diversify and by picking the right ETFs or the right mix of ETFs you should be able to at least keep pace with the market and in many cases beat the market.\n\nPeople buy individual stocks for a variety of reasons, but mostly the goal is to significantly beat the market.  Over the last 20 years, if you owned stocks in companies like Apple, Amazon, Netflix, Google, Facebook, Home Depot, Lowes, Monster Beverage Co, Tractor Supply, Old Dominion Freight, Altria Group, Market Axess, Broadcom, United Rentals, Nvidia, Ross, Fortinet, Cintas, O'Reilly Automotive, etc .... you would have significantly outperformed the market and all ETFs.\n\n* ETFs for diversification and to make sure you keep pace with the market (or better)\n* individual stocks for better overall growth or for better dividends\n\nThat said, yes, you can have a great portfolio of just ETFs.",
        "created_utc": 1601643334,
        "id": "g7ebhpo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601672134.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 28th of October\n\n\n\n## Upcoming events for Wednesday, October 28th\n\n - Expected earnings:\n\n  ACA, ADP, AEGN, AEM, AEMD, AFG, AGI, AIN, AINC, AIT, ALG, ALGT, ALIM, ALRS, ALSN, ALTA, AM, AMAL, AMED, AMGN, AMP, AMSF, ANTM, AR, ARES, ASGN, ATNI, AVB, AVID, AVT, AVTR, AXS, AXTI, BA, BCPC, BDC, BG, BGCP, BHE, BHR, BKU, BLKB, BOOT, BPOP, BRKL, BSGM, BSMX, BSX, BX, BXC, CACI, CASA, CASH, CCS, CDE, CERN, CFFN, CGNX, CHDN, CHEF, CHX, CLDB, CLS, CME, CMO, CMPR, CNMD, CODI, CONE, CPF, CREE, CRTO, CTO, CTSH, CUBI, CUZ, CVCY, CVEO, CW, CXO, DAN, DBD, DCO, DGICA, DGICB, DIN, DMRC, DORM, DRE, DT, DX, EAT, EBAY, ECHO, EEFT, EGHT, EGOV, EHC, EPD, EQC, EQIX, ERJ, ESRT, ESS, ETR, ETSY, EXTR, F, FARO, FBHS, FBNC, FCAU, FDBC, FDP, FLOW, FMNB, FMX, FORM, FRME, FRTA, FSLY, FSV, FVRR, FXNC, GD, GE, GHM, GILD, GMED, GNMK, GNRC, GRA, GRMN, GRUB, GSK, GSS, GWB, HBMD, HBNC, HCC, HEES, HES, HESM, HVT, HVT.A, HZO, IART, IBA, ILPT, INOV, INVH, IRT, ISBC, JMP, JRVR, KLAC, KRA, KRC, KRG, LFUS, LPL, LSBK, LVGO, MA, MAA, MAS, MEOH, MHH, MHO, MKL, MMSI, MN, MNRO, MOH, MORN, MPX, MRC, MSA, MUSA, MYRG, NDLS, NESR, NEU, NFBK, NLY, NOA, NOVA, NOW, NSC, NTB, NYCB, OBNK, OC, OII, OPOF, ORBC, ORLY, ORN, OVV, PB, PCSB, PE, PEGA, PEN, PERI, PFBI, PGRE, PI, PINS, PKI, PLXS, PPC, PROV, PSB, PTC, QEP, QMCO, QNST, R, RBC, RCII, RDY, RES, RGR, RJF, ROL, RYI, RYN, SAVE, SBT, SC, SCI, SEE, SF, SFM, SIGI, SITE, SIX, SLAB, SNE, SPOK, SPSC, SPWR, SREV, SRI, SSNC, SU, SYBT, TARO, TDOC, TEL, TESS, TMHC, TRIB, TROX, TT, TTMI, TUP, TW, TXRH, UCTT, UPS, URI, UTHR, UVSP, V, VGZ, VICI, VKTX, VNDA, VSEC, VVV, WCN, WDC, WELL, WERN, WH, WHG, WRI, WSBF, WYND, YNDX, YUMC, ZVO\n\n - Ex-div:\n\n  AM, BPMP, CMC, FRC, MAIN\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.275%)\n    - Crude Oil Imports (previous: -1.069M)\n    - Crude Oil Inventories (consensus: 1.230M, previous: -1.001M)\n    - Cushing Crude Oil Inventories (previous: 0.975M)\n    - Distillate Fuel Production (previous: -0.138M)\n    - EIA Refinery Crude Runs  (previous: -0.551M)\n    - EIA Weekly Distillates Stocks (consensus: -2.065M, previous: -3.832M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.8%, previous: -2.2%)\n    - FOMC Member Kaplan Speaks\n    - Gasoline Inventories (consensus: -0.961M, previous: 1.895M)\n    - Gasoline Production (previous: -0.307M)\n    - Goods Trade Balance (previous: -83.11B)\n    - Heating Oil Stockpiles (previous: 0.350M)\n    - MBA 30-Year Mortgage Rate (previous: 3.02%)\n    - MBA Mortgage Applications (previous: -0.6%)\n    - MBA Purchase Index (previous: 304.6)\n    - Mortgage Market Index (previous: 794.2)\n    - Mortgage Refinance Index (previous: 3,620.5)\n    - Retail Inventories Ex Auto (previous: 0.5%)\n    - Seevol Cushing Storage Report (previous: 1.180M)\n    - Wholesale Inventories (previous: 0.5%)\n\n## Upcoming events for Thursday, October 29th\n\n - Stock splits:\n\n    - JGSMY @ **105:100** (Payable date: 12/11/2020)\n\n - Expected earnings:\n\n  AAN, AAON, AAPL, ABMD, ABTX, ACGL, ACHC, ACRE, ADM, ADS, AGEN, AIV, AJG, ALEX, ALKS, ALXN, AME, AMT, AMTB, AMZN, AOS, APO, APPS, APRN, APTV, ARAY, ARW, ASLN, ASPN, AT, ATI, ATOM, ATR, ATSG, ATUS, ATVI, AUY, AX, AXGN, BAND, BAX, BBVA, BC, BCO, BE, BEAT, BGS, BHB, BIO, BIO.B, BL, BLDR, BLUE, BPMC, BSIG, BSVN, BUD, BVN, BWA, BXG, BXMT, CACC, CAKE, CAR, CARR, CATM, CBL, CBRE, CBTX, CBZ, CCC, CDNA, CDR, CENX, CERS, CFR, CFX, CG, CHD, CHE, CLDT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, COG, COHU, COLB, COLM, COOP, COP, COR, CPG, CPT, CRAI, CRL, CTB, CTS, CTT, CURO, CVA, CVE, CVNA, CWST, CXP, CZNC, DAIO, DD, DECK, DLR, DMLP, DNKN, DRQ, DVA, DVD, DVN, DWSN, DZSI, EGO, EIDX, EIGI, EKSO, EME, EMN, ERIE, ERII, ESCA, ETH, EVBN, EVLO, EVTC, EXAS, EXLS, EXP, EXPO, FB, FCN, FDUS, FHI, FIS, FISI, FIVN, FLEX, FLL, FLNT, FLWS, FMS, FND, FORR, FSS, FTAI, FTNT, FWRD, GEO, GIGM, GIL, GNCA, GOOG, GOOGL, GPI, GPN, GPOR, GRBK, GSHD, GSIT, HBP, HGV, HIG, HJLI, HLI, HPP, HTGC, HUBG, HUN, ICE, IDA, IDXX, IKNX, ILMN, IMAX, ING, INSM, INT, IP, IPHI, ISDR, ITGR, IVC, JCS, JHG, K, KBR, KDP, KEX, KHC, KIQ, KN, KNSL, KTB, KTOS, LADR, LAWS, LAZ, LEAF, LIND, LIVN, LKQ, LMAT, LOCO, LPLA, LPSN, LTC, LTRN, LYTS, MCO, MDC, MDCA, MDRX, MERC, METX, MFNC, MGLN, MGM, MGPI, MGRC, MHK, MIC, MIXT, MLM, MMC, MOBL, MPW, MPWR, MRLN, MRNA, MSI, MTLS, MTX, MTZ, MVIS, MX, MYE, NATI, NBR, NEM, NEXA, NFE, NMM, NOK, NREF, NTCT, NTLA, NTST, NTUS, NUVA, NVCR, NVST, OCFC, OFC, OHI, OIS, OLED, ONEW, OPK, ORC, OSB, OSIS, OSK, OSTK, PATK, PBF, PBFX, PCG, PCRX, PDM, PEB, PENN, PFPT, PFSI, PH, PLT, PLX, PMT, POWI, PRFT, PRLB, PRO, PSMT, PTCT, PTR, PVG, PWR, PXLW, QDEL, RBBN, RBKB, RCL, RDS.A, RDS.B, RE, RFL, RILY, RL, RLGY, RM, RMD, ROCK, ROG, RRC, RWT, SAH, SAIA, SAMG, SAN, SAND, SBBP, SBFG, SBUX, SCX, SEM, SGC, SGEN, SHAK, SHOP, SILC, SKX, SKYW, SLCA, SLCT, SM, SNDR, SNP, SNY, SO, SOI, SPOT, SPR, SPXC, SRDX, SRGA, SSB, STKL, STNE, SUNW, SWN, SXI, SYK, SYNH, TAK, TAP, TAP.A, TARA, TBBK, TDS, TEAM, TFX, TGH, THRM, TKC, TKR, TMST, TNC, TPL, TPR, TPX, TROW, TRP, TRS, TRUP, TRWH, TSBK, TWTR, TXT, UBOH, UDR, UHS, ULBI, ULH, UMC, USAK, USCR, USM, UTL, VBFC, VC, VCRA, VET, VIAO, VNT, VRTX, VVI, VYNE, WAB, WD, WEX, WLTW, WRE, WRTC, WTBA, WU, WW, WWE, X, XEL, XTNT, XYL, YRCW, YUM, ZEN\n\n - Ex-div:\n\n  AES, AGNC, ALLY, AOS, ATLO, BRMK, BSRR, CARR, CBAN, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, ERF, EV, FT, GECC, GEL, GRP.U, HCA, HMLP, HOPE, KFFB, KNOP, KOF, LNT, MS, MSB, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSEC, PSHG, PSXP, PZN, SCHL, SJT, SLG, STAG, TRGP, TXN, UL, UN, UNB, UNM, VOC, VRTS, WES, WHF\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.085%)\n    - 7-Year Note Auction (previous: 0.462%)\n    - 8-Week Bill Auction (previous: 0.090%)\n    - Continuing Jobless Claims (consensus: 7,700K, previous: 8,373K)\n    - Core PCE Prices (consensus: 4.00%, previous: -0.80%)\n    - GDP (consensus: 31.0%, previous: -31.4%)\n    - GDP Price Index (consensus: 2.8%, previous: -2.1%)\n    - GDP Sales (previous: -28.1%)\n    - Initial Jobless Claims (consensus: 775K, previous: 787K)\n    - Jobless Claims 4-Week Avg. (previous: 811.25K)\n    - Natural Gas Storage (previous: 49B)\n    - PCE Prices (previous: -1.6%)\n    - Pending Home Sales (consensus: 3.4%, previous: 8.8%)\n    - Pending Home Sales Index (previous: 132.8)\n    - Real Consumer Spending (previous: -33.2%)\n\n## Upcoming events for Friday, October 30th\n\n - Stock splits:\n\n    - CMHHY @ **102.155:100** (Payable date: 11/23/2020)\n    - HPR @ **1:50**\n    - JT @ **1:8**\n\n - Expected earnings:\n\n  ABBV, AON, ASIX, ATRO, AXL, BAH, BELFA, BELFB, BR, BSAC, CBOE, CHTR, CL, CSWC, CVX, DSKE, FBP, FLIR, FTS, GT, HON, HONE, IMO, IPGP, IRMD, ITCB, ITT, KKR, LEA, LGND, LHX, LYB, MGI, MMP, MO, NVT, NWL, OIIM, OPI, PBI, PEG, PFS, PIPR, PNM, PNW, POR, PQG, PSX, PSXP, ROLL, RUTH, SCM, SHLX, SJR, SNR, SPAQ, TIGO, TWIN, UA, UAA, WETF, WPC, WY, XHR, XOM\n\n - Ex-div:\n\n  AB, AON, ASRV, AVAL, BMO, BMTC, C, CADE, CAG, CASY, CNBKA, CPLP, CZNC, DGICA, DGICB, DMLP, EVTC, EWBC, FBIZ, FCCO, GRFS, HAS, HCC, HEP, HFBL, KMI, KRP, LCUT, MCI, MTX, NRG, NSEC, NVEC, O, OHI, OKE, ORRF, PAYX, PBCT, PEBO, PLBC, PNM, PNW, RBB, SBNY, SCHN, SGU, SPFI, STL, SXT, SYF, TCP, TGP, WABC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 165.9K)\n    - CFTC Copper speculative net positions (previous: 67.3K)\n    - CFTC Corn speculative net positions (previous: 329.9K)\n    - CFTC Crude Oil speculative net positions (previous: 490.3K)\n    - CFTC Gold speculative net positions (previous: 249.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 6.1K)\n    - CFTC Natural Gas speculative net positions (previous: 70.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 57.8K)\n    - CFTC Silver speculative net positions (previous: 44.7K)\n    - CFTC Soybeans speculative net positions (previous: 259.9K)\n    - CFTC Wheat speculative net positions (previous: 46.5K)\n    - Chicago PMI (consensus: 58.0, previous: 62.4)\n    - Core PCE Price Index (consensus: 0.2%, previous: 0.3%)\n    - Core PCE Price Index (consensus: 1.7%, previous: 1.6%)\n    - Core PCE Prices (previous: -0.80%)\n    - Corporate Profits (previous: -10.7%)\n    - Dallas Fed PCE (previous: 2.60%)\n    - Employment Benefits (previous: 0.80%)\n    - Employment Cost Index (consensus: 0.5%, previous: 0.5%)\n    - Employment Wages (previous: 0.40%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.40%)\n    - Michigan Consumer Expectations (previous: 78.8)\n    - Michigan Consumer Sentiment (consensus: 81.2, previous: 81.2)\n    - Michigan Current Conditions (previous: 84.9)\n    - Michigan Inflation Expectations (previous: 2.7%)\n    - Mortgage Market Index (previous: 769.6)\n    - Mortgage Refinance Index (previous: 3,346.9)\n    - PCE Price index (previous: 1.4)\n    - PCE Prices (previous: -1.6%)\n    - PCE price index (previous: 0.3%)\n    - Personal Income (consensus: 0.4%, previous: -2.7%)\n    - Personal Spending (consensus: 1.0%, previous: 1.0%)\n    - Real Consumer Spending (previous: -33.2%)\n    - Real Personal Consumption (previous: 0.7%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 211)\n    - U.S. Baker Hughes Total Rig Count (previous: 287)\n\n## Upcoming events for Saturday, October 31st\n\n - Economic events and announcements:\n\n    - Total Vehicle Sales (previous: 15.70M)\n\n^^^^2020-10-28",
        "created_utc": 1603879218,
        "id": "gad709i",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1603908018.0
    },
    {
        "author": "JTTRad",
        "body": "Checkpoint &amp; Fortinet will be the real multi-baggers in cybersecurity.",
        "created_utc": 1602500577,
        "id": "g8kx49k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602529377.0
    },
    {
        "author": "BobbyPhistHer",
        "body": "$FTNT calls",
        "created_utc": 1603991424,
        "id": "gaibs2i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604020224.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 26th of October\n\n\n\n## Upcoming events for Monday, October 26th\n\n - Stock splits:\n\n    - LVNSF @ **1:30**\n    - TRQ @ **1:10**\n\n - Expected earnings:\n\n  ACC, AGNC, AGRX, ALX, AMG, AMKR, APPF, ARE, ARI, ARLP, AROC, BFIN, BHLB, BMRC, BOH, BRO, BYD, BYND, CAJ, CATY, CBFV, CBU, CCB, CFBK, CHGG, CINF, CKH, CPAC, CR, CRSP, CVCO, CVLG, DRIO, EC, ENIA, FBK, FBMS, FEDU, FFIV, FIBK, FIX, FLXS, FNCB, FNWB, FRBA, FRBK, FUNC, FUSB, GABC, HAS, HBT, HCA, HEXO, HFBL, HGEN, HLIT, HMST, HSBC, HSII, HSTM, HTLF, IBTX, IHT, IVAC, JBSS, KNL, KNSA, KREF, LRN, LXFR, MC, MEDP, MEDS, MVBF, NBN, NBTB, NOV, NPK, NRIM, NRZ, NTP, NWBI, NXE, NXPI, OFIX, OMF, ONCS, OTIS, PBR, PBR.A, PCH, PETS, PFG, PKG, PMBC, PRK, QTS, QURE, RBB, ROIC, SAMA, SANM, SAP, SI, SMBC, SMPL, SSD, TBI, TCBK, TCF, TMBR, TNET, TWLO, UFI, VRNS, WSR\n\n - Ex-div:\n\n  CE, CRS, CVLY, FAST\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.100%)\n    - 5-Year Note Auction (previous: 0.275%)\n    - 6-Month Bill Auction (previous: 0.115%)\n    - Chicago Fed National Activity (previous: 0.79)\n    - Dallas Fed Mfg Business Index (previous: 13.6)\n    - Investing.com Gold Index (actual: 58.5%, previous: 55.8%)\n    - Investing.com S&amp;P 500 Index (actual: 58.7%, previous: 45.9%)\n    - New Home Sales (consensus: 1,025K, previous: 1,011K)\n    - New Home Sales (consensus: 2.8%, previous: 4.8%)\n\n## Upcoming events for Tuesday, October 27th\n\n - Stock splits:\n\n    - NEE @ **4:1** (Payable date: 10/26/2020)\n\n - Expected earnings:\n\n  AAT, ABG, ACCO, AFL, AGYS, AHC, AHT, AKAM, AMD, APAM, ARCC, ATEN, AUBN, AUDC, AWI, BCTX, BDGE, BEN, BGFV, BLX, BP, BUSE, BXP, CAC, CAMT, CAT, CB, CBNK, CEQP, CHRW, CHSCP, CIGI, CMI, CNC, COFS, COWN, CROX, CSGP, CSTM, CSV, CVLT, CYH, DCOM, DENN, DTE, DXCM, EBMT, EBSB, ECL, EGP, EIX, ENPH, ENVA, EQR, ESI, FCBC, FCF, FCPT, FELE, FEYE, FFIC, FFWM, FISV, FSLR, FTV, GLPI, GLW, HA, HAFC, HIW, HNP, HOG, HUBB, IBCP, IEX, IVZ, JBLU, JBT, JNPR, KTCC, LARK, LBC, LBRT, LDL, LECO, LH, LLY, LSCC, MASI, MKSI, MKTX, MMM, MMYT, MRK, MSCI, MSFT, MSM, MSTR, MSVB, MTDR, MXIM, NCR, NEO, NVS, NXRT, ODFL, OI, OKE, OMC, OMCL, OXSQ, PFE, PFHD, PFIS, PII, PJT, PMD, PPBI, PPD, PRGX, PTRS, QCRH, QSR, QUMU, RARE, RCKY, RIVE, RNDB, RNR, RNST, ROP, RRD, RRR, RTX, RXN, SALT, SBCF, SHOO, SHW, SITC, SKY, SMED, SMIT, SPFI, SPGI, SQNS, SSBI, SSTK, ST, SUM, SWI, SWK, SYX, TCFC, TECK, TENB, TEX, THG, TLC, TPB, TRMK, TRNS, TRU, TWOU, UEC, UIS, UMBF, UNM, UVE, VAR, VBTX, VECO, VIST, WAT, WDR, WIRE, WNEB, XRX\n\n - Ex-div:\n\n  ATR, BK, CFG, ENTG\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.136%)\n    - API Weekly Crude Oil Stock (previous: 0.584M)\n    - CB Consumer Confidence (consensus: 102.5, previous: 101.8)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.6%)\n    - Dallas Fed Services Revenues (previous: 14.0)\n    - Durable Goods Orders (consensus: 0.5%, previous: 0.5%)\n    - Durables Excluding Defense (previous: 0.9%)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 1.9%)\n    - House Price Index (previous: 1.0%)\n    - House Price Index (previous: 293.0)\n    - House Price Index (previous: 6.5%)\n    - Redbook (previous: 1.0%)\n    - Redbook (previous: 2.5%)\n    - Richmond Manufacturing Index (previous: 21)\n    - Richmond Manufacturing Shipments (previous: 13)\n    - Richmond Services Index (previous: 6)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 0.2%, previous: 0.6%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 4.2%, previous: 3.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 0.5%, previous: 0.6%)\n    - Texas Services Sector Outlook (previous: 11.5)\n\n## Upcoming events for Wednesday, October 28th\n\n - Expected earnings:\n\n  ACA, ADP, AEGN, AEM, AEMD, AFG, AGI, AIN, AINC, AIT, ALG, ALGT, ALIM, ALKS, ALRS, ALSN, ALTA, AM, AMAL, AMED, AMGN, AMP, AMSF, ANTM, AR, ARES, ASGN, ATNI, AVB, AVID, AVT, AVTR, AXS, AXTI, BA, BCPC, BDC, BG, BGCP, BHE, BHR, BKU, BLKB, BOOT, BPOP, BRKL, BSGM, BSX, BX, BXC, CACI, CASA, CASH, CCS, CDE, CERN, CFFN, CGNX, CHDN, CHEF, CHX, CLDB, CLS, CME, CMO, CMPR, CMRE, CNMD, CODI, CONE, CPF, CREE, CRTO, CTO, CTSH, CUBI, CUZ, CVEO, CW, CXO, DAN, DBD, DCO, DGICA, DGICB, DIN, DMRC, DORM, DRE, DT, DX, EAT, EBAY, ECHO, EEFT, EGHT, EGOV, EHC, EPD, EQC, EQIX, ERJ, ESRT, ESS, ETR, ETSY, EXTR, F, FARO, FBHS, FBNC, FCAU, FDBC, FDP, FLOW, FMNB, FMX, FORM, FRME, FRTA, FSLY, FSV, FVRR, FXNC, GCBC, GD, GE, GHM, GILD, GMED, GNMK, GNRC, GRA, GRMN, GRUB, GSS, GWB, HBMD, HBNC, HCC, HEES, HES, HESM, HVT, HVT.A, HZO, IART, IBA, ILPT, INOV, INVH, IRT, ISBC, JMP, JRVR, KLAC, KRA, KRC, KRG, LFUS, LPL, LSBK, LVGO, MA, MAA, MAS, MEOH, MHH, MHO, MKL, MMSI, MN, MNRO, MOH, MORN, MPX, MRC, MSA, MUSA, MYRG, NDLS, NESR, NEU, NFBK, NLY, NOA, NOVA, NOW, NSC, NTB, NWFL, NYCB, OBNK, OC, OII, OPOF, ORBC, ORLY, ORN, OSBC, OVV, PB, PCSB, PE, PEGA, PEN, PERI, PFBI, PGRE, PI, PINS, PKI, PLXS, PPC, PROV, PSB, PTC, QEP, QMCO, QNST, R, RBC, RCII, RDY, RES, RGR, RJF, ROL, RYI, RYN, SAVE, SBT, SC, SCI, SEE, SF, SFM, SIGI, SITE, SIX, SLAB, SNE, SPOK, SPSC, SPWR, SREV, SRI, SSNC, SU, SYBT, TARO, TDOC, TEL, TESS, TMHC, TROX, TT, TTMI, TUP, TW, TXRH, UCTT, UPS, URI, UTHR, UVSP, V, VGZ, VICI, VKTX, VNDA, VSEC, VVV, WCN, WDC, WELL, WERN, WH, WHG, WRI, WSBF, WYND, YNDX, YUMC, ZVO\n\n - Ex-div:\n\n  AM, BPMP, CMC, FRC, MAIN\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.275%)\n    - Crude Oil Imports (previous: -1.069M)\n    - Crude Oil Inventories (previous: -1.001M)\n    - Cushing Crude Oil Inventories (previous: 0.975M)\n    - Distillate Fuel Production (previous: -0.138M)\n    - EIA Refinery Crude Runs  (previous: -0.551M)\n    - EIA Weekly Distillates Stocks (previous: -3.832M)\n    - EIA Weekly Refinery Utilization Rates (previous: -2.2%)\n    - FOMC Member Kaplan Speaks\n    - Gasoline Inventories (previous: 1.895M)\n    - Gasoline Production (previous: -0.307M)\n    - Goods Trade Balance (previous: -83.11B)\n    - Heating Oil Stockpiles (previous: 0.350M)\n    - MBA 30-Year Mortgage Rate (previous: 3.02%)\n    - MBA Mortgage Applications (previous: -0.6%)\n    - MBA Purchase Index (previous: 304.6)\n    - Mortgage Market Index (previous: 794.2)\n    - Mortgage Refinance Index (previous: 3,620.5)\n    - Retail Inventories Ex Auto (previous: 0.5%)\n    - Seevol Cushing Storage Report (previous: 1.180M)\n    - Wholesale Inventories (previous: 0.5%)\n\n## Upcoming events for Thursday, October 29th\n\n - Stock splits:\n\n    - JGSMY @ **105:100** (Payable date: 12/11/2020)\n\n - Expected earnings:\n\n  AAN, AAON, AAPL, ABMD, ABTX, ACGL, ACHC, ACRE, ADM, ADS, AGEN, AIV, AJG, ALEX, ALNY, ALXN, AME, AMT, AMTB, AMZN, AOS, APO, APPS, APRN, APTV, ARAY, ARW, ASLN, ASPN, AT, ATI, ATOM, ATR, ATUS, ATVI, AUY, AX, AXGN, BAND, BAX, BBVA, BC, BCO, BE, BGS, BHB, BIO, BIO.B, BL, BLDR, BLUE, BPMC, BSIG, BSMX, BSVN, BUD, BVN, BWA, BXG, BXMT, CAKE, CAR, CARR, CATM, CBL, CBRE, CBTX, CBZ, CCC, CDNA, CDR, CENX, CERS, CFR, CFX, CG, CHD, CHE, CLCT, CLDT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, COG, COHU, COLB, COLM, COOP, COP, COR, CPG, CPLP, CPT, CRAI, CRL, CTB, CTS, CTT, CURO, CVA, CVE, CVNA, CWST, CXP, CZNC, DAIO, DD, DECK, DLR, DMLP, DNKN, DRQ, DVA, DVN, DWSN, EGO, EIDX, EIGI, EKSO, EME, EMN, ERIE, ERII, ESCA, ETH, EVBN, EVTC, EXAS, EXLS, EXP, EXPO, FB, FCN, FDUS, FHI, FIS, FISI, FIVN, FLEX, FLL, FLWS, FND, FNKO, FORR, FSS, FTAI, FTNT, FWRD, GEO, GIGM, GIL, GOLF, GOOG, GOOGL, GPI, GPN, GPOR, GRBK, GSIT, HBP, HGV, HIG, HJLI, HLI, HPP, HTGC, HUBG, HUN, ICE, IDA, IDXX, IKNX, ILMN, IMAX, ING, INSM, INT, IP, IPHI, IRWD, ISDR, ITGR, IVC, JCS, JHG, K, KBR, KDP, KEX, KHC, KIQ, KN, KNSL, KTB, KTOS, LAWS, LAZ, LEAF, LIND, LIVN, LKQ, LMAT, LOCO, LPLA, LPSN, LTC, LTRN, LYTS, LYV, MCO, MDC, MDCA, MDRX, MERC, METX, MFNC, MGLN, MGM, MGPI, MGRC, MHK, MIC, MIXT, MLM, MMC, MOBL, MPW, MPWR, MRLN, MRNA, MSI, MTLS, MTX, MTZ, MX, MYE, NATI, NBR, NEM, NEXA, NFE, NMM, NREF, NTCT, NTLA, NTST, NTUS, NUVA, NVCR, NVST, OCFC, OFC, OHI, OIS, OLED, ONEW, OPK, ORC, OSB, OSIS, OSK, OSTK, PATK, PBF, PBFX, PCG, PCRX, PDFS, PDM, PEB, PENN, PFPT, PFSI, PH, PLT, PLX, PMT, POWI, PRFT, PRLB, PRO, PSMT, PTCT, PTR, PVG, PWR, PXLW, QDEL, RBBN, RBKB, RDS.A, RDS.B, RE, RFL, RFP, RL, RLGY, RM, RMD, ROCK, ROG, RRC, RWT, SABR, SAH, SAIA, SAMG, SAN, SAND, SBBP, SBFG, SBUX, SCX, SEM, SGC, SGEN, SHAK, SHOP, SILC, SKX, SKYW, SLCA, SLCT, SM, SNDR, SNP, SNY, SO, SOI, SPOT, SPR, SPXC, SRDX, SRGA, SSB, STKL, STNE, SUNW, SWN, SYK, SYNH, TAK, TAP, TAP.A, TARA, TBBK, TDS, TEAM, TFX, TGH, THRM, TKC, TKR, TMST, TNC, TPL, TPR, TPX, TROW, TRP, TRS, TRUP, TRWH, TSBK, TWTR, TXT, UBOH, UDR, ULBI, ULH, UMC, USAK, USCR, USM, UTL, VBFC, VC, VCRA, VET, VNT, VRTX, VVI, VYNE, WAB, WD, WEX, WLTW, WRE, WRTC, WTBA, WU, WW, WWE, X, XEL, XTNT, XYL, YRCW, YUM, ZEN\n\n - Ex-div:\n\n  AES, AGNC, ALLY, AOS, ATLO, BRMK, BSRR, CARR, CBAN, CCLP, COST, CRT, CSWI, DCP, DNP, EFC, ENLC, EPD, ERF, EV, FT, GECC, GEL, GRP.U, HMLP, HOPE, KFFB, KNOP, KOF, LNT, MS, MSB, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSEC, PSHG, PSXP, PZN, SCHL, SJT, SLG, STAG, TRGP, TXN, UNM, VOC, VRTS, WES, WHF\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.085%)\n    - 7-Year Note Auction (previous: 0.462%)\n    - 8-Week Bill Auction (previous: 0.090%)\n    - Continuing Jobless Claims (consensus: 9,500K, previous: 8,373K)\n    - Core PCE Prices (consensus: 4.00%, previous: -0.80%)\n    - GDP (consensus: 31.9%, previous: -31.4%)\n    - GDP Price Index (consensus: 1.1%, previous: -2.1%)\n    - GDP Sales (previous: -28.1%)\n    - Initial Jobless Claims (consensus: 780K, previous: 787K)\n    - Jobless Claims 4-Week Avg. (previous: 811.25K)\n    - Natural Gas Storage (previous: 49B)\n    - PCE Prices (previous: -1.6%)\n    - Pending Home Sales (consensus: 4.5%, previous: 8.8%)\n    - Pending Home Sales Index (previous: 132.8)\n    - Real Consumer Spending (previous: -33.2%)\n\n^^^^2020-10-26",
        "created_utc": 1603706417,
        "id": "ga5ivrk",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1603735217.0
    },
    {
        "author": "aharmlessloaf",
        "body": "FTNT and KC.",
        "created_utc": 1601907805,
        "id": "g7shcv9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601936605.0
    },
    {
        "author": "novydoo",
        "body": "My IG got hacked by russians (I know bc the email ended in .ru) calls on cyber security companies CRWD FEYE FTNT",
        "created_utc": 1602743928,
        "id": "g8vkgyk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602772728.0
    },
    {
        "author": "BearsAreGei",
        "body": "Damn, $FTNT is burning",
        "created_utc": 1604066393,
        "id": "galmf06",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604095193.0
    },
    {
        "author": "Kay312010",
        "body": "FTNT \n\nWith more remote work, that will propel their continued earnings growth. Cyber security is need more than ever across all sectors. They have growth year over year of more than 45% with rev at 20% plus. The next earning report is tomorrow.",
        "created_utc": 1603941575,
        "id": "gagf344",
        "score": 1,
        "subreddit": "investing",
        "created": 1603970375.0
    }
]