[
    {
        "author": "kurtesh",
        "body": "Check ourt $ROKT ETF\n\nRTX, LMT, MAXR, TDY \n\nAll going big dick this week",
        "created_utc": 1590869256,
        "id": "fsch4wt",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590898056.0
    },
    {
        "author": "RosesFurTu",
        "body": "I have an email subscription set up through the SEC that tells me whenever someone that is on their list that I choose to follow makes trades. It's how I found out about Teledyne actually.",
        "created_utc": 1590803478,
        "id": "fs9jnjx",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1590832278.0
    },
    {
        "author": "bitteryw",
        "body": "Why didn’t you sell tdy man",
        "created_utc": 1588626356,
        "id": "fphr9zn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588655156.0
    },
    {
        "author": "jhoffvt",
        "body": "One of the better ETFs is ITA. It's also cheating to put in Amazon since they're not involved with Blue Origin.\n\nYou also forgot Honeywell, Raytheon, Teledyne, and L3.",
        "created_utc": 1590188231,
        "id": "frhwwuo",
        "score": 2,
        "subreddit": "investing",
        "created": 1590217031.0
    },
    {
        "author": "CaptainStavros",
        "body": "I’ve been buying up DFEN anything around $10-$11 or below. All companies are government backed for the most part and have very little chance of failing especially if tensions continue to rise with this “was it made in a lab or wasn’t it” deal going on or if another country tries to take advantage of the Covid situation. \n\nDFEN holds Lockheed, United tech (not airline), Boeing, General Dynamics, Teledyne, L3 Harris, Northrop Grumman, Trasdigm group, Raytheon, Huntington Ingralls. Biggest holding being Lockheed, United Tech, Boeing at around 15% a piece the rest of the companies are around 5% of holdings. \n\nIt is a 3X’s ETF and was sitting between $60-$70 before crash currently at $10 if you believe defense/aerospace will make a comeback eventually you can get good exposure through it. I don’t believe it will hit previous highs unless Boeing gets there shit as it is a larger holding but I do believe most holdings are extremely oversold and even through just buying shares you can easily net 75-100% return due to 3X’s exposure.",
        "created_utc": 1588661704,
        "id": "fpjak6g",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588690504.0
    },
    {
        "author": "richbeezy",
        "body": "I like TDY better, just waiting for a decent dip. They have a better over-all valuation, in my opinion of course.",
        "created_utc": 1589237638,
        "id": "fqbijth",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589266438.0
    }
]