[
    {
        "author": "dpetropo",
        "body": "I worked at IBM for 2 years, those boomers would have absolutely no fucking clue what to do with TikTok.",
        "created_utc": 1596300024,
        "id": "fzzy3fi",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596328824.0
    },
    {
        "author": "LovableContrarian",
        "body": "I wonder if people said that when IBM had little dips in the 80s.",
        "created_utc": 1596308333,
        "id": "g00fdpu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596337133.0
    },
    {
        "author": "ichbintrash",
        "body": "all these posts bout intl reminds me of ibm 16,  \"wow what a dip, market overreaction, itll hit a new ath withhin this yr its tech, dont bet against big blue\"\n\n4 years l8r, n that garbage is nowhere near where they used to be",
        "created_utc": 1596413773,
        "id": "g05p9ty",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596442573.0
    },
    {
        "author": "t33po",
        "body": "If, huge **IF**, the Tik Tok thing isn't settled by monday open, I'm getting some itm IBM calls. 1. Their cloud services could use a headline grabbing client - higher offer. 2. Boomers love some old school blue chips - regulatory approval could get fastracked without the anti-trust blah blah. 3. On the 1% chance it happens, it will pop way more than MSFT- already a $1.5T company.\n\nWorst case, it stays flat as usual and I'm out a couple hundred in two weeks. Pure speculation on Trump's big tech hate and boomer nostalgia.",
        "created_utc": 1596299756,
        "id": "fzzxko2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596328556.0
    },
    {
        "author": "TaxWizard69",
        "body": "IBM is just an extreme example of a fallen tech giant. They've had terrible management for decades and did every short-termists decision possible to meet EPS estimates. If Steve Ballmer was IBM's CEO I might believe he was one of their better CEOs in history. Today's big tech are just really well managed companies with CEOs/founders who are well connected with its employees and their consumer markets. They all have strong ecosystems around their products, amazing balance sheets, and a long-term approach to a lot of their projects. It's a big extreme from IBM. It comes with a lot of scrutiny since these companies have to be really cutthroat and aggressive against competitors but it's a big learning lesson from IBM.",
        "created_utc": 1596391873,
        "id": "g04jhu9",
        "score": 2,
        "subreddit": "investing",
        "created": 1596420673.0
    },
    {
        "author": "UABeeezy",
        "body": "Pretty sure tiktok is worth more than IBM. Not gonna happen",
        "created_utc": 1596299919,
        "id": "fzzxw0j",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596328719.0
    },
    {
        "author": "DefNotBartDeWever",
        "body": "People forget downfalls in Tech so quickly. IBM, nokia,... Just imagine having all your savings in those two",
        "created_utc": 1596372794,
        "id": "g039wg4",
        "score": 1,
        "subreddit": "investing",
        "created": 1596401594.0
    },
    {
        "author": "EmployerOfTheMonth",
        "body": "These companies aren't going to keep on increasing their revenue, it's impossible, don't believe me: look at the law of larger numbers. Once they reach a point where there is no more room to grow, they will turn into companies like IBM and Microsoft in the 2000's, trying to retain their past and hold on to something that doesn't exist, whilst younger and more nimble companies run ahead. The CEO's will be replaced or will eventually leave and the new guy will be worse at handling it\n\n\nThe companies will become more bureaucratic, slower and difficult to manage and they end up turning into the very thing they replaced and despised. Before being diversifed was a good thing, but not it looks like these companies are failing to do everything at once under poor management, remind you of Yahoo or GE?\n\nAnyway, my point is, that for EVERY company, their time will come.",
        "created_utc": 1596441068,
        "id": "g06ricu",
        "score": 1,
        "subreddit": "investing",
        "created": 1596469868.0
    },
    {
        "author": "CrimsonEnigma",
        "body": "&gt; The wars are for the most part over, and the winners have won.\n&gt; \n\nPeople said this exact same thing when it was Sears and IBM ruling the world.",
        "created_utc": 1596468735,
        "id": "g07tz0p",
        "score": 1,
        "subreddit": "investing",
        "created": 1596497535.0
    },
    {
        "author": "DankMemelord25",
        "body": "Looking at a long term OTM put for IBM, 90 dollar strike. It's an absolute turd of a company, accounting fraud every earnings cycle, losing sales and revenue. Cloud margins are dropping, lost tonnes of key staff to competitors this year. Once they slow buybacks or reduce the dividend it will plummet sub 100",
        "created_utc": 1596273032,
        "id": "fzywdhs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596301832.0
    },
    {
        "author": "cute-girl-in-a-dress",
        "body": "Is it *that* bad? I mean IBM stock is pretty high, it must have some redeeming qualities",
        "created_utc": 1596273741,
        "id": "fzyx13p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596302541.0
    },
    {
        "author": "TheHolyLampshade",
        "body": "NYSE listed stock trades on Nasdaq, and Nasdaq listed stock (as of a few months ago) trades on NYSE.\n\nWhat permits this is a regulation called Unlisted Trading Privileges, which as the name implies allows an exchange (or other trading system) to trade instruments it does not list.\n\nThe primary listing center is responsible for guaranteeing the listed company is complying with its conditions for listing. In this capacity they are the ultimate source for whether a stock is permitted to trade (they are the primary source for regulatory halts in trading).\n\nBesides this governance requirement, the primary listing market is also where the official opening and closing price originates through that market’s opening and closing processes. Besides the auction, trading in the stock occurs freely on all other venues.\n\nThere are industry run systems called Security Information Processors that are responsible for consolidating quotes and trades for all of the venues trading a stock. This is typically where most retail (think Google/Yahoo Finance) sites source their data, and it permits people who do not want to have to receive data from all of the venues individually a place to see what the market as a whole is doing in IBM or AAPL (or whatever) on a very high level.\n\nEach exchange will typically publish a symbol directory/universe that provides details on symbols they will permit trading in for a given day.",
        "created_utc": 1596296656,
        "id": "fzzrj8k",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1596325456.0
    },
    {
        "author": "Scribble2thefloor",
        "body": "Just like investing in IBM and Exxon was sound advice 20 years ago.",
        "created_utc": 1596361246,
        "id": "g02pw1x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596390046.0
    },
    {
        "author": "willpksl",
        "body": "Indexes rebalance and \"filter\" out underperforming companies. Something that individual investors dont efficiently do, due to lack of consistency, self-control, patience etc. \n\nIf you choose to just sit on some top stocks as Buffet often instructs, you may have beem one of the folks stuck sitting on Sears, IBM, Intel, Blackberry etc.",
        "created_utc": 1596266087,
        "id": "fzypmqq",
        "score": 1,
        "subreddit": "investing_discussion",
        "created": 1596294887.0
    },
    {
        "author": "flyingeverywhere11",
        "body": "I've been holding a lot for a long time haha. BAC is something that I always recommend and have been holding since 09, AIG is another. BAC has good financials and has remained strong. A few others, NTDOY, SNE, XOM, IBM, a share of BRK.A(parents got it for me back in 2013 for 15x or something) and a few other stocks. I literally never look at that portfolio, it's just buy, forget and reinvest divys. I add on when the opportunity arises. \n\nI look for things that are a staple product and integrated into society and the world to the extent that if they were to disappear, it would have a significant impact. A simpler way to look at it, \"too big to fail\". Obviously there are other plays I make into low vol illiquid stocks.  Day to day, I just play options for fun. \n\nATVI and ETSY are good. AMZN is something to consider holding long-term. As for HD and LOW(good plays), also consider some home builders LEN and DHI. They have been performing well Q/Q. PINS, I don't know too much about them. PTON is good because they're one of the few publicly traded fitness stocks. Another is NLS(~60 times smaller market cap than PTON) which makes good quality workout equipment(much better than  PTON in my opinion) but most people want something simple and would probably pay someone to workout for them. I think the future is also dependent on the outcome for bat soup. If people are more inclined to work from home, then it's a buy. If gyms get the green light to open up nationwide, people will dump it. This is just speculation.",
        "created_utc": 1596265269,
        "id": "fzyorv8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596294069.0
    },
    {
        "author": "Furloughedinvester",
        "body": "IBM is currently $122 a share... just sayin",
        "created_utc": 1596268828,
        "id": "fzyse2f",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596297628.0
    },
    {
        "author": "HinduHamma",
        "body": "So basically you’ll only buy after historic market crashes like in 09. You think It’s pretty much been overpriced for the past half a decade now and silly to buy to right?? When is the market allowed to go higher according to you?? Is it supposed to sit at one level until your criteria is met to go higher?? \n\nYou do realize how many MILLIONS of 401ks are automatically buying the sp500 every week or two right? Do you think any of them just stop if the market is overvalued and it waits for it to be correctly valued??? No. There is no wrong time to buy the market. If your investing horizon is decades upon decades. You can’t just go “omg the market is incorrectly priced this month I’m gonna stop funding my 401k. Ok now it’s good this week I’ll start back up oh wait shit spy just ran 8 percent up in a week we are overpriced again time to stop buying again!! “\n\nRational pricing and free market has been dead for over a decade and everyone knows its. Clinging onto some one definition of valuing the market is not gonna work in a constantly evolving game. \n\nKeep buying cheap value traps , there’s plenty of them out there. GM, ibm, Intel, banks, etc if you don’t wanna buy the overpriced market. Lot of tickers trading at recession levels \n\nReality is There’s too much $$ in the system. It’s all gonna lead to insane valuations on some tickers. But it doesn’t mean it’s going to crash and bubble pop .",
        "created_utc": 1596275407,
        "id": "fzyylbo",
        "score": 1,
        "subreddit": "investing",
        "created": 1596304207.0
    },
    {
        "author": "basic_math_doit",
        "body": "I've used more than half the services on that decadent forrester wave chart.\n\nTeradata is shit, wouldn't touch it with a 6ft pole. And if they keep IBM, Oracle and SAP for company, you know it's shit for sure.",
        "created_utc": 1596466248,
        "id": "g07o32r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596495048.0
    },
    {
        "author": "Square-Clothes",
        "body": "Ethereum and Cardano here. I was put off by Stellar’s token distribution and consensus mechanism but it could very well be a moonshot. Is IBM still working with it?",
        "created_utc": 1596439675,
        "id": "g06q4rx",
        "score": 1,
        "subreddit": "investing",
        "created": 1596468475.0
    },
    {
        "author": "adamo1139",
        "body": "Aren't there way more enterprise cloud providers that just don't sound sexy and you won't find them hosting website services? IBM, Dell, OVH. This isn't something new, IMO it's regurgitated hype shit. I would bet on someone who have an advantage in getting hardware cheaply, so a known Hardware vendor. Apple have great single core performance on their ARM cores, I bet they could figure out something if they were interested in that.",
        "created_utc": 1596369015,
        "id": "g0324vy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596397815.0
    },
    {
        "author": "team_buddha",
        "body": "A sizable portion of my portfolio is currently invested in Apple. /u/edge2528 has an excellent point, diversification isn't about amplifying returns, it's solely about risk mitigation. There's a tremendous amount of risk in holding a single company for the reasons he described, but I'm young (26), my investment timeline is long enough that I'm comfortable accepting that risk. \n\nCliche as it may sound - I do feel that Apple is different than IBM, RIM and some of the other tech Goliaths that have faded into borderline irrelevance. Apple dominates the consumer technology market. They're no longer a \"tech\" company to me, they're a consumer products company that has positioned themselves squarely at the forefront of every major consumer technology cycle in the past two decades. They're a powerhouse of innovation and ever growing market share in smart phones, tablets, streaming, and personal computing. Their consumer ecosystem is unparalleled, and extremely sticky. I have a MacBook Pro, an iPad Pro, AirPods, iPhone, HomePod, Apple Pencil, Apple TV....they all work cohesively and I don't see myself ever transitioning away. Moreover, the proliferation of IaaS/SaaS platforms for enterprise computing has made their compatibility shortcomings less relevant in the enterprise space. \n\nApple's strong cash position allows them to hold true to their innovative culture, and dive into developing markets. Their R&amp;D budget dwarves most of their industry peers. Their 3rd party app store has made the iPhone/iPad the cornerstone of most people's interactions with the outside world. Lastly, they're even making strides in the microprocessor segment increasing product performance, further vertically integrating their supply chain. \n\nLong story short, I'm long Apple.",
        "created_utc": 1596463606,
        "id": "g07ici2",
        "score": 1,
        "subreddit": "investing",
        "created": 1596492406.0
    },
    {
        "author": "ExceptionallyGreat",
        "body": "Perhaps some part of it is intentional? IBM has layers upon layers of bureaucracy and secrecy due to the way it was structured. It might even be more like a country than a company. Let's not forget they have fed many of our tech companies in the past.\n\nPersonally, I would rather focus on companies that are more about being in the limelight and public eye and benefit from those. I mean we have AMZN, MSFT, AAPL, AMD, TSLA, and so many others.",
        "created_utc": 1596276368,
        "id": "fzyzhdc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596305168.0
    },
    {
        "author": "aryalmuskan17",
        "body": "You realize IBM is a sub $55 dollar stock",
        "created_utc": 1596280529,
        "id": "fzz3ejk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596309329.0
    },
    {
        "author": "stephenfa",
        "body": "Bill Gates literally acquired the rights to MS-DOS from another programmer then sold DOS to IBM and started MS to worldwide domination.",
        "created_utc": 1596327241,
        "id": "g01dc1j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596356041.0
    },
    {
        "author": "northwestredditor",
        "body": "MSFT new IBM, yawn.",
        "created_utc": 1596340446,
        "id": "g01yllx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596369246.0
    },
    {
        "author": "lord_v0ldemort",
        "body": "I have trouble believing INTC is the next IBM bc they have their big meaty claws in quite a few industries that will be very prosperous in the future such as autonomous driving / data centers / etc",
        "created_utc": 1596422297,
        "id": "g063hv7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596451097.0
    },
    {
        "author": "jpowpump",
        "body": "Disney in collab with ibm",
        "created_utc": 1596396875,
        "id": "g04udg7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596425675.0
    },
    {
        "author": "digitalrule",
        "body": "If you asked people 20 years ago what company would still be around and huge in 2020 they would have said maybe GE or IBM. If you bought $500 of GE stock 20 years ago it would be worth $75.",
        "created_utc": 1596350113,
        "id": "g02aqjl",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1596378913.0
    },
    {
        "author": "cookingboy",
        "body": "Good luck to you.\n\nI’m extremely familiar with this industry. Engineering talent and prowess is the only fundamental that matters that I would be hesitant in investing in Intel at this point.\n\nThere is a real chance of them becoming the next IBM, or fall even faster and harder since the competitions are more direct and are improving faster.\n\nIt may go up in the short term, but there are some real concerning red flags within Intel these days.",
        "created_utc": 1596476191,
        "id": "g08dwv3",
        "score": 0,
        "subreddit": "investing",
        "created": 1596504991.0
    },
    {
        "author": "illgetitsomeday",
        "body": "Intel call gang down 60% reporting in.",
        "created_utc": 1596427615,
        "id": "g06bpbj",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1596456415.0
    },
    {
        "author": "godfearinglawabiding",
        "body": "JUST IN: intel gets covid vaccine contract, working with Tesla",
        "created_utc": 1596424607,
        "id": "g06766j",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1596453407.0
    },
    {
        "author": "TrenAndOptions",
        "body": "🤡🤡🤡\n\n\nhttps://www.barrons.com/articles/huge-pension-sold-apple-stock--microsoft-tesla-bought-intel-51596034133",
        "created_utc": 1596319357,
        "id": "g00zysx",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1596348157.0
    },
    {
        "author": "mcchicken2",
        "body": "Intc calls up 30% today!! Now only -75% overall 😍",
        "created_utc": 1596469144,
        "id": "g07uyko",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1596497944.0
    },
    {
        "author": "DankMemelord25",
        "body": "Reading about all the Investor lawsuits being filed against Intel. I love how litigious the US is. \"I bought your shares and lost, I want my money back RRRRREEEEEEEE!\"",
        "created_utc": 1596266392,
        "id": "fzypy5r",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1596295192.0
    },
    {
        "author": "caratspy",
        "body": "Bought INTC calls ATH. AMA",
        "created_utc": 1596477475,
        "id": "g08hpkg",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1596506275.0
    },
    {
        "author": "JPOWplzno",
        "body": "2-4 Week INTC calls at open if you like free money.",
        "created_utc": 1596416558,
        "id": "g05ty5q",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1596445358.0
    },
    {
        "author": "alex21turner",
        "body": "Just saw an INTC commercial, there's still hope fellas.",
        "created_utc": 1596305544,
        "id": "g009kbf",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1596334344.0
    },
    {
        "author": "nnilldroid",
        "body": "INTC gang rollcall",
        "created_utc": 1596421464,
        "id": "g06248q",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1596450264.0
    },
    {
        "author": "i_love_my_scrotum",
        "body": "INTC call gang is depressing",
        "created_utc": 1596304548,
        "id": "g0078c5",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1596333348.0
    },
    {
        "author": "CrazyAF863",
        "body": "Hey stupid bot , it is INTC $46 not AMD !",
        "created_utc": 1596413187,
        "id": "g05o9wn",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596441987.0
    },
    {
        "author": "eyerollingsex",
        "body": "INTC starting to perk up 👀",
        "created_utc": 1596468027,
        "id": "g07s6ny",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596496827.0
    },
    {
        "author": "chicken_joe11",
        "body": "is my INTC $51c 8/14 fooked",
        "created_utc": 1596409238,
        "id": "g05hiqt",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596438038.0
    },
    {
        "author": "frykobs",
        "body": "How's my INTC equity looking? Bought on Friday 🤡",
        "created_utc": 1596421915,
        "id": "g062v40",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596450715.0
    },
    {
        "author": "HeyNowNoFlipping",
        "body": "Don't sleep on KLA. ER is tomorrow. Semi manufacturing hasn't slowed down at all. It dumped when Intel dumped but has almost entirely recovered since then.",
        "created_utc": 1596421847,
        "id": "g062r2i",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596450647.0
    },
    {
        "author": "rawvi",
        "body": "Intel is so oversold on the Daily. Got 9/18 50C isn't this free $$$",
        "created_utc": 1596467383,
        "id": "g07qntl",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596496183.0
    },
    {
        "author": "JPOWplzno",
        "body": "They are. Low iv. Large volume. To top it all off the same thing happened Q2 last year and INTC jumped 30% over a month. Only people that hate free money arnt buying INTC.",
        "created_utc": 1596413615,
        "id": "g05p07p",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596442415.0
    },
    {
        "author": "Monkeybob275",
        "body": "I feel like long-dated calls on INTC are free money at this point",
        "created_utc": 1596423875,
        "id": "g0660sn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596452675.0
    },
    {
        "author": "Bxdwfl",
        "body": "where my INTC bulls?",
        "created_utc": 1596470211,
        "id": "g07xl4o",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596499011.0
    },
    {
        "author": "Vinny32295",
        "body": "Honestly I am like half a bottle of Jonny walker green label in, j love you guys. MAFT / INTC TOT GE FUCKING MOON! Oh I forgot GOOGL to &amp;2000 by end of August!",
        "created_utc": 1596325531,
        "id": "g01ahgk",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596354331.0
    },
    {
        "author": "JPOWplzno",
        "body": "Some of you really don't know how to read a companies finances and it shows. If you idiots miss out on INTC yall are dumber than I thought. Date calls 2-4 weeks if your the pansy ass type, and sit back and make some money.",
        "created_utc": 1596417684,
        "id": "g05vts2",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596446484.0
    },
    {
        "author": "us1549",
        "body": "INTC to $55 tomorrow!",
        "created_utc": 1596418810,
        "id": "g05xp3i",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596447610.0
    },
    {
        "author": "JPOWplzno",
        "body": "You are legitimately the biggest fucking autist on this planet if you think a long term  call on a behemoth like INTC won't pay out after a 25% fall in 8 days. Like really, is this your first day trading?",
        "created_utc": 1596428371,
        "id": "g06crkg",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596457171.0
    },
    {
        "author": "gratitudeisbs",
        "body": "Intel is fucked and so are you",
        "created_utc": 1596424002,
        "id": "g0667tq",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596452802.0
    },
    {
        "author": "caseoftx",
        "body": "For those expecting a Microsoft purchase of Tik-Tok US, consider this:\n\nFirst, Bytedance has been floating the idea of a sale for weeks, meaning they believe it is to their advantage to do so. Most US content platforms are banned in China, including Facebook, Twitter, Github, Google, Youtube, Reddit, Netflix; it is more than reasonable to expect trade reciprocity.\n\nDivesting sounds good, but because of Chinese laws, divesting from China is always inherently a two part process in order to be meaningful: a company has to (1) divest from the Chinese parent company AND (2) divest from the CCP's jurisdictional control. In other words, even Tik Tok is now owned by Microsoft, it would need to move its engineering out of China in order for its platform to be divested from the CCP’s jurisdictional control. Otherwise, it will face similar quandary as Zoom &amp; will  be subject to CCP's intel requests.\n\nMain downside is inconveniencing US Tik Tok users. To be clear, POTUS (regardless of who is Prez) does have exec authority to enact a suspension under the IEEPA-- this is no different than precedent on other sanctions. India did this &amp; the sky didn't fall.\n\nTLDR: Tik Tok sale good for CCP",
        "created_utc": 1596427064,
        "id": "g06awnd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596455864.0
    },
    {
        "author": "cozigang",
        "body": "intc 50c 9/18 are free money. tell me otherwise",
        "created_utc": 1596413549,
        "id": "g05ow6g",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596442349.0
    },
    {
        "author": "poop_in_my_coffee",
        "body": "Insider buys on INTC last week and it starts coming back up this week. I think more good news on the way.",
        "created_utc": 1596476920,
        "id": "g08g2dy",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596505720.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "If AAPL continues to print, I’m pulling the trigger on an iPad Pro. They deserve it for going uppies and also making INTC look dumb",
        "created_utc": 1596330398,
        "id": "g01ijdo",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596359198.0
    },
    {
        "author": "Rossoneri",
        "body": "Intel is more than just chips...",
        "created_utc": 1596397789,
        "id": "g04w5y2",
        "score": 4,
        "subreddit": "investing",
        "created": 1596426589.0
    },
    {
        "author": "yCranjisMcBasketball",
        "body": "Now that your wives are shaped like a beef Wellington you can have them back....calls on Intel",
        "created_utc": 1596400578,
        "id": "g051g3f",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596429378.0
    },
    {
        "author": "AbusiveLarry",
        "body": "Boutta liquidate all my amd and intc tomorow morning and go in purple. Fuck semis! All hail prpl!",
        "created_utc": 1596407123,
        "id": "g05dqxt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596435923.0
    },
    {
        "author": "wtfridge",
        "body": "And there it is, officially green on my 1/15/21 INTC calls lmaoooo",
        "created_utc": 1596473802,
        "id": "g087dhj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596502602.0
    },
    {
        "author": "ssbc007",
        "body": "Intel has seen 7 consecutive days of negative returns. Its longest streak of negative 1-day returns over the last 10 years is 8. \n\nWho thinks the record falls this week?",
        "created_utc": 1596394849,
        "id": "g04pydb",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596423649.0
    },
    {
        "author": "Caroso",
        "body": "I dont know anything about the other two but I think Intel is amazing. They are growing and their revenue is on track of beating 2019 in a time people think they are losing market share to AMD, not really releasing anything new and a global pandemic",
        "created_utc": 1596396334,
        "id": "g04t8aa",
        "score": 4,
        "subreddit": "investing",
        "created": 1596425134.0
    },
    {
        "author": "veryfloppydisk",
        "body": "All this fighting about AMD vs INTC makes me think everyone here will be wrong and NVDA + Arm will crush both of them.",
        "created_utc": 1596321411,
        "id": "g013inb",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596350211.0
    },
    {
        "author": "WestCoastWhiteBoy",
        "body": "I bought INTC calls when they announced the delay. I woke up half asleep in the middle of the night and saw everyone saying buy calls. Woke up later -50%",
        "created_utc": 1596306629,
        "id": "g00btty",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596335429.0
    },
    {
        "author": "Nope______________",
        "body": "Those intel leap calls are cheap af right now. Getting pretty tempted right now to jump in, but it is a shifty company",
        "created_utc": 1596401625,
        "id": "g053ez1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596430425.0
    },
    {
        "author": "RyFba",
        "body": "Now is the time to long INTC. They're priced like they're shutting down fabbing forever. AMD hasn't done their own fab since 2009. INTC uppies and AMD downies",
        "created_utc": 1596400905,
        "id": "g05223s",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596429705.0
    },
    {
        "author": "ConfessionsOverGin",
        "body": "Don’t want to jinx it, but it looks like INTC hit its low and is now on the way up. Regular volume, steady upward action. Looking good boomer boys",
        "created_utc": 1596467990,
        "id": "g07s3ht",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596496790.0
    },
    {
        "author": "jsl4f",
        "body": "INTC, back from the dead",
        "created_utc": 1596469043,
        "id": "g07uqe2",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596497843.0
    },
    {
        "author": "wtfridge",
        "body": "What the fuck I'm actually about to go green on some of my INTC LEAPs",
        "created_utc": 1596469355,
        "id": "g07vglu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596498155.0
    },
    {
        "author": "crackpk",
        "body": "If INTC can hit $52 EOW I will eat a glizzy",
        "created_utc": 1596469874,
        "id": "g07wq8q",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596498674.0
    },
    {
        "author": "rusbus720",
        "body": "Ya boy intel rising from the ashes",
        "created_utc": 1596469448,
        "id": "g07vntu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596498248.0
    },
    {
        "author": "HallaganJack",
        "body": "Cmon INTEL",
        "created_utc": 1596472343,
        "id": "g083dy0",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596501143.0
    },
    {
        "author": "SlimyMarvin",
        "body": " I got 10 INTC $60 calls 9/4\n I got 2 AAPL $420 calls 8/14 \n I got 10 MSFT $250 calls 8/21\n I got 1 TSLA $800 put 8/14 \n\n Print city? TSLA put Is alil gamble but it was cheap soo",
        "created_utc": 1596325867,
        "id": "g01b20k",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596354667.0
    },
    {
        "author": "rxpillme",
        "body": "It's INTC",
        "created_utc": 1596413976,
        "id": "g05pmct",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596442776.0
    },
    {
        "author": "bigmeatbag",
        "body": "Fuck me for thinking INTC was anything more than a runny pile of dog shit.",
        "created_utc": 1596465143,
        "id": "g07ll7q",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596493943.0
    },
    {
        "author": "illgetitsomeday",
        "body": "Ho Lee Fuk, Intel thank you for not being red 9 days in a row :)",
        "created_utc": 1596473427,
        "id": "g086clt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596502227.0
    },
    {
        "author": "WiseAce1",
        "body": "Intel still makes too much money.  I am thinking Hertz is probably going to get the next vaccine contract",
        "created_utc": 1596427373,
        "id": "g06bcyr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596456173.0
    },
    {
        "author": "NormalGap",
        "body": "I get intel is having a bad time, but what the fuck are these dirt cheap options",
        "created_utc": 1596464956,
        "id": "g07l6m2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596493756.0
    },
    {
        "author": "dtritrinh0801",
        "body": "any autists and retards willing to help us push intel to 50?",
        "created_utc": 1596473080,
        "id": "g085eyu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596501880.0
    },
    {
        "author": "FearlessTrader",
        "body": "Lads, I did something unspeakable, bought INTC shares 😬😬😬😬",
        "created_utc": 1596475688,
        "id": "g08cllp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596504488.0
    },
    {
        "author": "ObservationalHumor",
        "body": "Intel doesn't need a wizard, I'm not sure what it is lately but historically the people running companies need more experience in management within a given industry than they do something like an E.E degree.  Look at who their CTO is if you're looking for technical competence.\n\nAMD isn't doing well because Lisu Su somehow engineered a better processor on her own and by far her personal contributions to really improving the company's fundamentals were in pushing the company into the game console market, amending the wafer supply agreement and putting a much needed axe in the Bulldozer line of processors in favor of a new architecture.  I'm sure she's a great engineer too, but that's not the job she was hired for when she was appointed CEO.  She's made great decisions as a CEO, but this whole idea there's any kind of 'wizard' out there is just wrong.\n\nIntel's problem is their fabs and no 'wizard' is going to fix that.  These are extremely complex and expensive processes that take years to set up and are not easily changed or fixed.  That's a big part of why Intel has basically given up on their 10nm process at this point and is focused on their 7nm node.  If you build something that involved and complex that's fundamentally flawed you can't just turn it around and make it work.  Intel's literally been trying for years here and that more than anything else is what's contributed to AMD's meteoric rise.",
        "created_utc": 1596475611,
        "id": "g08ceqd",
        "score": 3,
        "subreddit": "investing",
        "created": 1596504411.0
    },
    {
        "author": "aipipcyborg",
        "body": "TSM long term until INTC catches up or we make friendly with China again.",
        "created_utc": 1596477280,
        "id": "g08h4q1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596506080.0
    },
    {
        "author": "Leya_Finance",
        "body": "I'd give intel a larger discount rate.",
        "created_utc": 1596398585,
        "id": "g04xocj",
        "score": 3,
        "subreddit": "investing",
        "created": 1596427385.0
    },
    {
        "author": "khasieu113",
        "body": "holyshiet look at INTC. I'm only down 70% now.",
        "created_utc": 1596469638,
        "id": "g07w3ft",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596498438.0
    },
    {
        "author": "yCranjisMcBasketball",
        "body": "Get on Intel gang retard ass haole",
        "created_utc": 1596309761,
        "id": "g00ia5s",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596338561.0
    },
    {
        "author": "Polverise",
        "body": "It will 100% catch up to intel. They already have better cpus for their price than intel. The only reason people still intel more is because of the natural tendency for inexperienced people to buy intel cpus and brand loyalty.",
        "created_utc": 1596390071,
        "id": "g04fq97",
        "score": 3,
        "subreddit": "stocks",
        "created": 1596418871.0
    },
    {
        "author": "ETisME",
        "body": "To be honest I would say it isn't as bad as others say. \n\nAPPL next few years are going to do great, with them cutting off the expensive Intel chips and new potentials going forth with their new in house chip and consolidating the OS between their phone, tablet and computer.\n\nForget about the ATH, I wouldn't be surprised if next week we have quite a big new high.\n\nIt's not even that big of a position in your total portfolio",
        "created_utc": 1596417267,
        "id": "g05v4nr",
        "score": 3,
        "subreddit": "investing",
        "created": 1596446067.0
    },
    {
        "author": "Erroric89",
        "body": "money rotating into beaten down stocks? BA and INTEL seem good for calls",
        "created_utc": 1596465921,
        "id": "g07nb5l",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596494721.0
    },
    {
        "author": "rjgnal",
        "body": "Cmon intel buddy, you go get up there :)",
        "created_utc": 1596469374,
        "id": "g07vi40",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596498174.0
    },
    {
        "author": "tsholtmanian",
        "body": "I think INTC pops up this week and then trades 50-53 for a month. Added some INTC 50c 8/7 lottos, good luck everyone else",
        "created_utc": 1596469853,
        "id": "g07wo6u",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596498653.0
    },
    {
        "author": "sola_rpi",
        "body": "any intc gang",
        "created_utc": 1596329995,
        "id": "g01hvij",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596358795.0
    },
    {
        "author": "Cadenca",
        "body": "How much should we worry about Intel? In this clown fiesta Tesla market, it seems unreal that after such a drop, Intel is not even getting a speculative Robinhood bounce. I would buy some conservative $50 calls but fuck me, how bad is it?",
        "created_utc": 1596463917,
        "id": "g07iyoi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596492717.0
    },
    {
        "author": "DankMemelord25",
        "body": "Intel :)",
        "created_utc": 1596320630,
        "id": "g012653",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596349430.0
    },
    {
        "author": "myironlung6",
        "body": "All you morons that expected intel to go back up. Their fucking core technology is fucked, doesn’t matter how much cash they have or made this quarter. They’ve lost the lead to AMD. Deal with it, move on.",
        "created_utc": 1596463689,
        "id": "g07iig3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596492489.0
    },
    {
        "author": "Kodyak",
        "body": "Don’t be a pussy intc and dip keep going",
        "created_utc": 1596469524,
        "id": "g07vtom",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596498324.0
    },
    {
        "author": "Leya_Finance",
        "body": "Can you show me how intel isnt losing market share to AMD? Two companies can grow, but if one grows faster than another, they take market share from them. They released that 7nm chips wont be out for another several months and amd already has them...",
        "created_utc": 1596396671,
        "id": "g04tz7b",
        "score": 3,
        "subreddit": "investing",
        "created": 1596425471.0
    },
    {
        "author": "bartle8ee",
        "body": "Lmao, Intel is still over twice the market cap that AMD is - do you even think or do research before blurting out bullshit?",
        "created_utc": 1596386992,
        "id": "g049g8y",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596415792.0
    },
    {
        "author": "TitanCrasher54",
        "body": "INTC\n\nThis is heavily over-sold from an investing perspective, just because they’ve delayed their chipset and lost a lead engineer does not mean an entire company will go under.  At the end of the day, Intel still holds the majority of the market and while AMD is on the rise, their new chip is still comparable to INTC’s current latest.  The sell-off was an overreaction and is due for correction soon. Just my 2¢.",
        "created_utc": 1596474083,
        "id": "g08848i",
        "score": 3,
        "subreddit": "investing",
        "created": 1596502883.0
    },
    {
        "author": "BullyMog",
        "body": "Is INTC a no brainer rn?",
        "created_utc": 1596471614,
        "id": "g081gtu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596500414.0
    },
    {
        "author": "Sejoon700",
        "body": "Ur getting downvoted, but as someone who has experience making computers, Intel has really nothing on AMD anymore. For almost any computer being built these days, AMD processors are more efficient, cheaper, and better suited for a variety of different needs. Sure intel might have other products but with zen 3 coming out this year for AMD, Intel won’t be able to reclaim their spot anymore on the chip market. I feel sorry for people going all in on Intel.",
        "created_utc": 1596471994,
        "id": "g082ftq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596500794.0
    },
    {
        "author": "wozza365",
        "body": "Intel's issues are only just beginning. They've been stuck trying to get 10nm for years now and it looks like the next node will be the same. I believe 7nm is expected 2022. I'd say 2023 given their recent track record. They have a lot of internal problems as well with company culture, management etc.\n\nMeanwhile AMD still shows little sign of stopping in terms of CPUs, cutting deep into Intel's bread and butter. I imagine Apple were probably quite a big customer numbers wise as well.\n\nIf you're looking long term, then I don't see Intel as a bad buy as they will recover eventually, but next 2-3 years, I can't see them growing very much at all.",
        "created_utc": 1596401842,
        "id": "g053tn3",
        "score": 3,
        "subreddit": "investing",
        "created": 1596430642.0
    },
    {
        "author": "AndISayChuch",
        "body": "I’ll play INTC with you if it helps",
        "created_utc": 1596418135,
        "id": "g05wktf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596446935.0
    },
    {
        "author": "rogue_roads",
        "body": "INTC great value at this price IMO, but options still seem risky. IV low tho so may be a lotto play there for calls",
        "created_utc": 1596331001,
        "id": "g01jj1q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596359801.0
    },
    {
        "author": "LegendaryForwards",
        "body": "My stupid bargain market coupon ass went retarded and bought the intel dip. Always trying to wait for a good deal instead of just jumping on the train to tendie town.",
        "created_utc": 1596388254,
        "id": "g04c4rl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596417054.0
    },
    {
        "author": "HJForsythe",
        "body": "Based on the history the other two times AMD had products people wanted to purchase what happened was AMD went back to $5/share a couple quarters after Intel started caring.",
        "created_utc": 1596414656,
        "id": "g05qrpz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596443456.0
    },
    {
        "author": "IMSOHORNYLADYBOYUWU3",
        "body": "Fellow autists, which of the following should I YOLO everything into for some big $$$:\n\n- ELY \n- PRPL\n- AAPL\n- ATVI \n- INTC\n- MSFT",
        "created_utc": 1596425484,
        "id": "g068iyc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596454284.0
    },
    {
        "author": "Reddits_For_NBA",
        "body": "INTC won't do shit for the next month.",
        "created_utc": 1596425733,
        "id": "g068wmq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596454533.0
    },
    {
        "author": "RoyalFail6",
        "body": "INTC keeps bleeding...good luck with those calls",
        "created_utc": 1596417704,
        "id": "g05vv02",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596446504.0
    },
    {
        "author": "sylphvanas",
        "body": "Nice, BA and INTC coming back from the dead",
        "created_utc": 1596465866,
        "id": "g07n6ol",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596494666.0
    },
    {
        "author": "aSingleGreyHair",
        "body": "Anyone else hop inside intel before close on Friday",
        "created_utc": 1596407048,
        "id": "g05dm14",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596435848.0
    },
    {
        "author": "dameLillardManiac",
        "body": "can we get some sector retardation into intel real quick? pls",
        "created_utc": 1596472126,
        "id": "g082sb8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596500926.0
    },
    {
        "author": "kyan-",
        "body": "cmon intc u got this..baby steps get my -40% leaps back to green",
        "created_utc": 1596473472,
        "id": "g086h0o",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596502272.0
    },
    {
        "author": "richhomie66",
        "body": "I can see Intel having these 1-2% bumps every day easy. Free money especially if you’re getting leaps",
        "created_utc": 1596473485,
        "id": "g086icn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596502285.0
    },
    {
        "author": "mrklika",
        "body": "INTC &amp; NET for sure",
        "created_utc": 1596475331,
        "id": "g08bnzo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596504131.0
    },
    {
        "author": "Caroso",
        "body": "I can not show you anything only say what I think. I think Intel will go up when things go from bad to less bad",
        "created_utc": 1596396877,
        "id": "g04udis",
        "score": 2,
        "subreddit": "investing",
        "created": 1596425677.0
    },
    {
        "author": "illgetitsomeday",
        "body": "I just wanted to tell everyone that intel actually has a green option.",
        "created_utc": 1596469303,
        "id": "g07vcaq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596498103.0
    },
    {
        "author": "repairmanjack2020",
        "body": "Taking bets on what happens first:  INTC breaks $50 or $40?",
        "created_utc": 1596306179,
        "id": "g00aw2k",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596334979.0
    },
    {
        "author": "redicalschool",
        "body": "INTC has turned my hands from paper to fucking black hole status...nothing will ever escape my grasp now, especially any possibility of profit",
        "created_utc": 1596306187,
        "id": "g00awo0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596334987.0
    },
    {
        "author": "Apps3452",
        "body": "Pay off your mortgage man other then that leaps on Intel or Microsoft.",
        "created_utc": 1596314949,
        "id": "g00s5fc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596343749.0
    },
    {
        "author": "BT519",
        "body": "Where were you when intel is kil?",
        "created_utc": 1596266055,
        "id": "fzyplk6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596294855.0
    },
    {
        "author": "-OpportunityCost",
        "body": "Dumping my entire account into INTC if it drops below 40",
        "created_utc": 1596306694,
        "id": "g00bzfe",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596335494.0
    },
    {
        "author": "SgtPrepper",
        "body": "THAT is an excellent question. I did some research and it looks like they're [diverting](https://www.tysonfoodservice.com/your-channel/k-12) the school lunches to kids in the local communities. There's no intel on where their restaurant stockpile is going, but unfortunately there's [hints](https://talkbusiness.net/2020/07/income-and-revenue-likely-lower-for-tyson-foods-in-third-quarter-report/) that the resultant low sales are going to hit the stock value.",
        "created_utc": 1596309318,
        "id": "g00hehu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596338118.0
    },
    {
        "author": "gigantoir",
        "body": "INTC DUE",
        "created_utc": 1596395035,
        "id": "g04qd66",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596423835.0
    },
    {
        "author": "the_dark_side",
        "body": "Intel?  Ew.",
        "created_utc": 1596421202,
        "id": "g061org",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596450002.0
    },
    {
        "author": "yachtking1",
        "body": "Exactly stock so fuckin undervalued the second it starts making money these losers drop its and buy intel, it’s gonna be 83 by the end of the week",
        "created_utc": 1596467449,
        "id": "g07qt90",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596496249.0
    },
    {
        "author": "zestykite",
        "body": "got them intc 8/27 50calls.  pray for me",
        "created_utc": 1596468538,
        "id": "g07tgfo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596497338.0
    },
    {
        "author": "pickbot",
        "body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**INTC**|**$60**|**BUY CALL**|**2020-09-11**|**$0.08**|**$47.73**|**0**|**45**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckddxr1su3jyr0774iwyc04wn) | [Track Record](https://www.pickmojo.com/user/Dr_H0/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**",
        "created_utc": 1596424202,
        "id": "g066iup",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596453002.0
    },
    {
        "author": "JPOWplzno",
        "body": "Intel gang here up 15% sir.",
        "created_utc": 1596428264,
        "id": "g06cm3q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596457064.0
    },
    {
        "author": "EVOSexyBeast",
        "body": "FTNT JNPR LOGM NLOK OKTA PANW SMSI TEF TLK\n\nBut they're still shitty stocks and his move is the ultimate autist move. Everyone who has the app on their device would keep it. but it's not going to get banned anyways bc he can't even ban it it's just dumb\n\n&amp;#x200B;\n\nplus Microsoft is buying it anyway",
        "created_utc": 1596298246,
        "id": "fzzur0q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596327046.0
    },
    {
        "author": "durkkaderpa",
        "body": "Forgot Skyworks, Broadcom, Juniper, Ciena",
        "created_utc": 1596303963,
        "id": "g005x81",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596332763.0
    }
]