[
    {
        "author": "willylumplumps",
        "body": "NVDA 1500 shares at $7",
        "created_utc": 1586990055,
        "id": "fnj184x",
        "permalink": "/r/stocks/comments/g1wta7/finally_sold_nflx/fnj184x/",
        "score": 221,
        "subreddit": "stocks",
        "created": 1587018855.0
    },
    {
        "author": "Hot_Pink_Unicorn",
        "body": "Google makes most of its money on advertising, now that's gone. \n\nApple can only sell so many $1.2k phones during an economic downturn. \n\nMSFT still will make butt loads of $$$ but it's azure will suffer. \n\nAmazon probably will replace most of the retail but if people can't spend money then AMZN won't be as profitable. \n\n&amp;#x200B;\n\nFB is screwed since it's all ads. \n\nNVidia - has 50% of its profits are from consumer graphics. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI'm thinking the only reason all the tech stocks are booming is because they are relatively safe in the short term, long term they will still take a hit.",
        "created_utc": 1586823426,
        "id": "fnbw05x",
        "permalink": "/r/wallstreetbets/comments/g0tdhg/why_we_wont_see_major_drops_anymore/fnbw05x/",
        "score": 143,
        "subreddit": "wallstreetbets",
        "created": 1586852226.0
    },
    {
        "author": "Freyr90",
        "body": "Goldman Sachs in 2018: Nvidia will go $283\n\nNvidia plunged to $130.\n\nBasically anything tech analysts say is as worthy as tossing coins.",
        "created_utc": 1586781739,
        "id": "fn9q9d7",
        "permalink": "/r/StockMarket/comments/g0fl4u/bloomberg_goldman_now_saying_us_equities_have/fn9q9d7/",
        "score": 96,
        "subreddit": "StockMarket",
        "created": 1586810539.0
    },
    {
        "author": "Randomness898",
        "body": "Yea that's a good question (tldr at end).  For some stocks it can be like 5+ years.  For sure, Tesla won't realize it's fundamentals until like 5+ years, and even then, it can pull a MSFT in which it goes from a blue chip to a blue chip + growth stock (with Azure), in which case, it still may not fully realize that part of it's fundamentals until we know how big cloud will be.\n\nBut when I invest, my target is always like 2+ years for all my stocks and for the stock market as a whole.  That's why I've always been buying this entire time, since even though we can definitely sell off short term back to say 240, I know long term, the stock market will be better than 280.  More importantly, I am confident the individual stocks I pick will be better than what they are currently longer term.  That's why a DCA approach is a fairly standard and safe approach.  Of course, you can adjust this DCA approach to be way more aggressive on drops and less aggressive on up moves (like buy way less on a day like today, if today was your set buying date).  I don't worry about the market going down short term for my long term investments.  Plus, if you look, so many tech stocks, like MSFT, AMZN, NVDA, NFLX, etc. are all up for the year despite this!\n\nNow, for trading, you can also trade the fundamentals in the short term - which would be months here.  If you believe the economy will be slower to return to work, if the Q1 and Q2 earnings will be bad, if the vaccine will take longer than normal, if social distincing in a way still continues even after we open up, if consumer demand is less, if the credit problem comes back, etc., or some combination of that, you can trade that.  So for example, you can buy like a 3 month 15% OTM put or something.  Perhaps you believe QQQ &gt; IWM (that's what I believe), so in that case, maybe if you are long QQQ, you can short IWM as a market hedge.  So many ways to trade that.\n\ntldr: \n\nTrading should be on either short term TECHNIALS (days - weeks) or short term FUNDAMENTALS (which will be months)\n\nInvesting should be on long term FUNDAMENTALS (which will be years).  I'm a believer in the US Economy and particularly the tech sector and a few non-tech stocks like COST, so I will always invest when I have the chance to do so, without having to always try to predict the bottom.  Predicting the bottom or the top is best used in the above trading section.",
        "created_utc": 1586916660,
        "id": "fnfw0iy",
        "permalink": "/r/investing/comments/g1imut/this_bear_market_rally_is_largely_due_to_fomo/fnfw0iy/",
        "score": 79,
        "subreddit": "investing",
        "created": 1586945460.0
    },
    {
        "author": "prollygointohell",
        "body": "8 months later (February 2020) Nvidia was at $320.",
        "created_utc": 1586786339,
        "id": "fn9wqu7",
        "permalink": "/r/StockMarket/comments/g0fl4u/bloomberg_goldman_now_saying_us_equities_have/fn9wqu7/",
        "score": 33,
        "subreddit": "StockMarket",
        "created": 1586815139.0
    },
    {
        "author": "FullTime_Autist",
        "body": "Jesus H Christ. There is so much conspiracy theory in here that it would be impossible to maintain if this was even remotely true. The fact of markets is that its driven by 80% financial institutions who are not barred from holding short positions. The market is irrational in the short term, but its never irrational long term. \n\nTake a look at the VIX, its at 42. This implies that SPY can move 12% up or down as driven by premium prices. This means that the underwriters of options (the guys you buy options from) are pricing in this movement. Now lets look at SPY's movement the last 2 weeks, gee what do you know? its moved up 12% well within the expected volatility of the market. \n\nThis means that the SPY index can swing up or down 12% within this month, and it will mean absolutely NOTHING. It would be considered random noise.\n\nNow during the last 2 weeks we've had 2 uncertainties become certain.\n\n1. PPP was activated and disbursed\n2. Fed commited to buying Equity based securities\n\nThese were the 2 big driving factors of the gains.\n\nNow if you scrutinized the winners and losers of the last 2 weeks of gains, you can notice a theme. Companies like MSFT/AMD/NVDA/Netflix are rewarded. Can you think of a rational reason why that is? Compared to say BA? This is proof the market is evaluating companies rationally corp to corp.\n\nNext, I want all the bears to understand that in the history of 100 years of equity movement, the stocks only moved down 4% of the time ( vs 96% of the time up) and in addition, bear markets only lasted 200 days on average. With the way algos reacted and the fed, you can expect this bear market to be compressed at LEAST by a factor of 2. Lets say 100 days. Now we've had market reaction for over 60 days now. this means, we are likely already halfway through this market correction statistically.\n\nKnowing the above quantifications, how many are actually brave enough to continue to short? It makes no sense logically given the above.",
        "created_utc": 1587066292,
        "id": "fnm77do",
        "permalink": "/r/wallstreetbets/comments/g2lq5k/crime_and_no_punishment_why_the_dip_wont_happen/fnm77do/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1587095092.0
    },
    {
        "author": "ahsan_shah",
        "body": "Not NVDA. Not by any stretch of the imagination",
        "created_utc": 1587600612,
        "id": "fo8ohcc",
        "permalink": "/r/stocks/comments/g6ahkz/apple_expected_to_add_up_to_100_billion_to/fo8ohcc/",
        "score": 21,
        "subreddit": "stocks",
        "created": 1587629412.0
    },
    {
        "author": "gamblingman777",
        "body": "Honestly both Nvidia and AMD are probably moving some product right now. Computer upgrades, new Xbox, and of course cloud servers. I appreciate your vibe but there might be good reason for their exception.",
        "created_utc": 1585794358,
        "id": "fm6hs7j",
        "permalink": "/r/wallstreetbets/comments/fte0pn/look_at_nvda/fm6hs7j/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1585823158.0
    },
    {
        "author": "CCC19",
        "body": "Amazing job scratching out NVDA $420c",
        "created_utc": 1586972168,
        "id": "fni113g",
        "permalink": "/r/wallstreetbets/comments/g1w8kv/silent_but_deadly_by_nok/fni113g/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1587000968.0
    },
    {
        "author": "thehenrylong",
        "body": "Since this sub has gone to shit allow me to offer some advice. \n\nPick which direction you feel like the tickers are going, buy shares for them to build out a portfolio. If you want to play oil do XOM or MRO. If you want to do tech do AMD, NVDA, MSFT, AAPL or whatever. Then buy puts against the shares so if we do go down soon you’ll have cash to buy more shares on down days. Over time you’ll be rich, alternatively buy long calls instead of shares. Always at least a month out. \n\n\nBuy the oil dip, airline dip, hotel dip. But don’t expect bug returns in the short term. \n\nFinally. Don’t listen to advice on this sub. The confirmation bias here is god tier.",
        "created_utc": 1587411685,
        "id": "fo0ekkz",
        "permalink": "/r/wallstreetbets/comments/g4q8u6/daily_discussion_thread_for_april_20_2020/fo0ekkz/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1587440485.0
    },
    {
        "author": "nighthawk24",
        "body": "AMZN 1440P\n\nNKE 69P\n\nSPY 210P\n\nMA 200P\n\nNVDA 200P\n\nAAPL 200P\n\nMSFT 140P\n\nNFLX 290P\n\nThen some TSLA, GRMN, SHOP Puts\n\nAll with April expiry",
        "created_utc": 1588091862,
        "id": "foux6ho",
        "permalink": "/r/wallstreetbets/comments/g9qg0t/they_said_should_have_gotten_out_the_day_i_was/foux6ho/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588120662.0
    },
    {
        "author": "BuyLowSellNever",
        "body": "NVDA long all the way.\n\n\nOne of the best balance sheets I’ve ever seen, they’ll be fine.",
        "created_utc": 1586795399,
        "id": "fnad4g4",
        "permalink": "/r/stocks/comments/g0mb9e/what_do_you_think_about_nvidia_long_or_short/fnad4g4/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1586824199.0
    },
    {
        "author": "mydogeatstoomuch",
        "body": "Long on Pandemic proof Apple and NVDA/AMZN",
        "created_utc": 1587598320,
        "id": "fo8khdj",
        "permalink": "/r/stocks/comments/g6ahkz/apple_expected_to_add_up_to_100_billion_to/fo8khdj/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1587627120.0
    },
    {
        "author": "SDuckworth12",
        "body": "Visa\nMasterCard\nFacebook\nMicrosoft\nApple\nStarbucks\nMcDonald’s \nAmazon \nSquare\nAMD/NVIDIA\nShopify\nDisney \nAlibaba\nGoogle",
        "created_utc": 1587067881,
        "id": "fnmadva",
        "permalink": "/r/stocks/comments/g2mids/growth_stocks/fnmadva/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1587096681.0
    },
    {
        "author": "jmeloso",
        "body": "I am long AAPL, MSFT, AMZN, GOOG, FB, NVDA, AMD, NFLX, BABA, ADBE, JPM, BA, TSLA.  Also recently purchased 12/31 270 SPY calls.\n\nI doubled down after the drop and my portfolio is doing better than ever.\n\nStop gambling and start investing and you’ll make money retards.   This was one of the best buying opportunities ever.",
        "created_utc": 1587089807,
        "id": "fnnde0g",
        "permalink": "/r/wallstreetbets/comments/g2mj65/what_are_your_moves_tomorrow_april_17_2020/fnnde0g/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1587118607.0
    },
    {
        "author": "MetalliTooL",
        "body": "So what happens to stocks that are approaching their all time highs?\n\nMSFT, AMD, NVDA, etc.\n\nAre they going to set *new* highs right now?  ...in this economy?  I don't fucking get it.",
        "created_utc": 1586886599,
        "id": "fnebvz1",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fnebvz1/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1586915399.0
    },
    {
        "author": "asianboydonli",
        "body": "Intel beat earnings...and tanks... and drags amd and nvda with it rip",
        "created_utc": 1587672900,
        "id": "foclxw3",
        "permalink": "/r/wallstreetbets/comments/g6tuin/what_are_your_moves_tomorrow_april_24_2020/foclxw3/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1587701700.0
    },
    {
        "author": "PanettoneSpumoni",
        "body": "Got NVDA calls for no fucking reason",
        "created_utc": 1586414071,
        "id": "fmvecd1",
        "permalink": "/r/wallstreetbets/comments/fxev5z/what_are_your_moves_tomorrow_april_09_2020/fmvecd1/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1586442871.0
    },
    {
        "author": "biochemguy",
        "body": "This thread is asking for tomorrow's moves.  Can we start deleting posts or temp-banning users that just post chat?  Seriously the daily discussions and this thread are nearly useless from all the BS spam.\n\nI'm long NFLX, AMZN, WMT, NVDA, and GOOG.  My hedge is SPY 260p 6/30.  Tomorrow I'm thinking about taking a gold position... I sort of hope it will hedge inflation without falling if there's another drop, but I lack confidence because gold fell in the March drop.  \n\n\nThoughts?",
        "created_utc": 1586824129,
        "id": "fnbx8bk",
        "permalink": "/r/wallstreetbets/comments/g0rmrr/what_are_your_moves_tomorrow_april_14_2020/fnbx8bk/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1586852929.0
    },
    {
        "author": "realister",
        "body": "Apple AirPods business by itself is in Fortune 500 or a 32nd Largest Company in the U.S ahead of AMD and Motorola. \n\nAirPods generate more revenue than Twitter, Uber, Square, Snap, AMD or NVIDIA!\n\nCrazy how huge AirPods are.",
        "created_utc": 1587850607,
        "id": "fokx3rs",
        "permalink": "/r/wallstreetbets/comments/g7fkq6/weekend_discussion_thread_for_the_weekend_of/fokx3rs/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1587879407.0
    },
    {
        "author": "CptTonyStark",
        "body": "Since it looks like tomorrow will be big red, I'm YOLOing everything on AMD 5/1 60c, NVDA 5/15 325c, MSFT 5/1 200c, AMZN 4/24 2500c, TSLA 4/24 1000c, NFLX 4/24 500c.",
        "created_utc": 1586937418,
        "id": "fngmsty",
        "permalink": "/r/wallstreetbets/comments/g1duq3/what_are_your_moves_tomorrow_april_15_2020/fngmsty/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1586966218.0
    },
    {
        "author": "platonicfornow",
        "body": "I will never bet against NVDA especially as I believe they have a huge space to grow especially with regards to Geforce Now, even if I am completely wrong and tanks to 180 or lower, I will definitely be buying calls for it. Missed when it was 182 or somewhere around there whenit tanked few weeks ago and not being able to do anything about it as everything I had was stuck in spy puts lol",
        "created_utc": 1585794582,
        "id": "fm6i4fl",
        "permalink": "/r/wallstreetbets/comments/fte0pn/look_at_nvda/fm6i4fl/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1585823382.0
    },
    {
        "author": "Michael12390",
        "body": "Tell me why AAPL and NVDA calls are a bad idea. They have already lost about 25% from ATH and I feel their sales will rise significantly.",
        "created_utc": 1587698393,
        "id": "foe8u4n",
        "permalink": "/r/wallstreetbets/comments/g6tuin/what_are_your_moves_tomorrow_april_24_2020/foe8u4n/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1587727193.0
    },
    {
        "author": "beefcake_123",
        "body": "You know, I don't get this fucking market but I am enjoying the high levels of volatility and selling spreads and cash covered puts on blue chip stocks that I expect to come out of this crisis stronger than ever before (i.e., WMT, NVDA, MSFT). \n\nDon't fight the Fed dudes. Make money on theta and vega. Or for Christ's sake, just buy a long dated put and sell shorter-dated puts against it for premium. It's time to be smart guys.",
        "created_utc": 1586457005,
        "id": "fmx1xaw",
        "permalink": "/r/wallstreetbets/comments/fxqidb/daily_discussion_thread_april_09_2020/fmx1xaw/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1586485805.0
    },
    {
        "author": "CptTonyStark",
        "body": "How do u create a new ETF? I wanna propose an AMD AMZN MSFT NFLX NVDA SPCE TSLA ETF, under the name YOLO",
        "created_utc": 1586963309,
        "id": "fnhj0ux",
        "permalink": "/r/wallstreetbets/comments/g1pvny/daily_discussion_thread_april_15_2020/fnhj0ux/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1586992109.0
    },
    {
        "author": "black_and_shredded",
        "body": "It’s crazy how many bears jerked off all over each other talking about how much puts were gonna print ALL weekend only for Monday to be as green as it is. I get it bears; unemployment being absurd, major banks predicting a recession. You just *know* the market has to tank any day \n\nBut at some point you have to take a step back and ask yourself if you’re following the market. The big drop is coming, but we don’t know if it’ll be tomorrow or next month. I feel like if you’re going to be playing puts, they should be close to ITM, long dated, and for God’s sake, invest $100 in FD MSFT, NVDA, or AMD calls when we have massive -5% down day so you’re not raped when we inevitably gap back up",
        "created_utc": 1586194995,
        "id": "fmlxgw7",
        "permalink": "/r/wallstreetbets/comments/fvwu06/daily_discussion_thread_april_06_2020/fmlxgw7/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1586223795.0
    },
    {
        "author": "_FundingSecured420",
        "body": "# [🦠 POLL TIME 🦠](https://www.reddit.com/r/wallstreetbets/comments/g2r27v/poll_time_friday_april_17/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) \n\nWhat a day! (Thank you NVDA &amp; AMZN).  But holyshit, tomorrow is truly going to be a glorious day! (GILD 🤯). Hope all you autists made lots of tendies today! 💰You accurately predicted the last daily poll.  What will tomorrow bring?\n\nCheers boys! 🍻",
        "created_utc": 1587082555,
        "id": "fnn1q8u",
        "permalink": "/r/wallstreetbets/comments/g2mj65/what_are_your_moves_tomorrow_april_17_2020/fnn1q8u/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1587111355.0
    },
    {
        "author": "makeammends",
        "body": "I'm going to try to wait... until the next (real) correction and maybe get back into just owning shares again: AMZN, NVDA, etc. Easier on the pysche and pocketbook.\n\nOk, I did buy some AMZN 6/19 3000C this AM, but, yeah.",
        "created_utc": 1586879399,
        "id": "fndxnkh",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fndxnkh/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1586908199.0
    },
    {
        "author": "Golfplayer69",
        "body": "I wouldn’t take advice on stocks to buy from random people on Reddit. Do your own due diligence and find out for yourself which companies are doing well. Don’t know how? Get on YouTube and learn. They’ll just tell you Microsoft, Facebook, Coke, Nvidia, Apple and probably Tesla but you still won’t know good enter and exit points and eventually lose your money. Save it and teach yourself man, that’s the best advice.",
        "created_utc": 1587511834,
        "id": "fo4v5df",
        "permalink": "/r/stocks/comments/g5q3ge/question/fo4v5df/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1587540634.0
    },
    {
        "author": "wra1th3_Ai",
        "body": "Tough list. NVDA, AMD, MU, MSFT, and QCOM I think will all be really solid going forward",
        "created_utc": 1587070284,
        "id": "fnmf3iu",
        "permalink": "/r/stocks/comments/g2n8hy/what_are_your_top_tech_stock_right_now/fnmf3iu/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1587099084.0
    },
    {
        "author": "karanrucks",
        "body": "Fuck you AMD. Im putting an Nvidia in my next pc build",
        "created_utc": 1588272476,
        "id": "fp33jrc",
        "permalink": "/r/wallstreetbets/comments/gaszeo/daily_discussion_thread_for_april_30_2020/fp33jrc/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588301276.0
    },
    {
        "author": "backtohiding",
        "body": "So NVDA in 2019 was losing market share left and right, and  only gaining in AI for automated driving, yet now when facing a massive global recession its higher from where 2019 peaked. AAPL was facing downtrend in sales and still is, but now in this environment it reached 2019s peak...  NFLX was losing subs from the massive amount of streaming services coming up and their growth was lowering and hits all time high. Makes perfect sense",
        "created_utc": 1586799781,
        "id": "fnalxl8",
        "permalink": "/r/wallstreetbets/comments/g0gvfn/daily_discussion_thread_april_13_2020/fnalxl8/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1586828581.0
    },
    {
        "author": "Mario_209",
        "body": "Just got NVidia, Microsoft, and Boeing 2021 leaps and am going to put down the phone for a week.\n\nI spend so much time looking at these lines go up and down instead of working 🤣",
        "created_utc": 1587059248,
        "id": "fnlt2x8",
        "permalink": "/r/wallstreetbets/comments/g2c9fj/daily_discussion_thread_for_april_16_2020/fnlt2x8/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1587088048.0
    },
    {
        "author": "vcarpe",
        "body": "I have GOOG, AAPL, FB, MSFT, NVDA, MTCH\n\nEqually distributed. What do you think?",
        "created_utc": 1587759025,
        "id": "foh08jv",
        "permalink": "/r/stocks/comments/g7ejz3/how_would_an_equal_weighted_googl_msft_aapl/foh08jv/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1587787825.0
    },
    {
        "author": "RMonroeski",
        "body": "Hope these PFE calls, NVDA calls, AMD calls, and SNAP puts print",
        "created_utc": 1587586558,
        "id": "fo7y5mj",
        "permalink": "/r/wallstreetbets/comments/g68cco/what_are_your_moves_tomorrow_april_23_2020/fo7y5mj/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1587615358.0
    },
    {
        "author": "anonymous_eddy",
        "body": "Sitting on TSLA $700P SNAP $16P and NVDA $280P. All expiring tomorrow. Down 50% on all. Which of these are going to be profitable ?",
        "created_utc": 1587702869,
        "id": "foeg1at",
        "permalink": "/r/wallstreetbets/comments/g6tuin/what_are_your_moves_tomorrow_april_24_2020/foeg1at/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1587731669.0
    },
    {
        "author": "r80rambler",
        "body": "IBM, some companies still making MIPS last time I checked, the Chinese manufacturer that's apparently making x86 in their domestic market, Atmel, lots of manufacturers using ARM IP including Apple and Nvidia.  In the past decade we saw at least one run off Spark in the K computer.  Xilinx and Alterra have FPGA + CPU offerings (arm IP on the copy side I believe).  Nvidia and AMD with GPGPUs (and at least Nvidia with Jetson, etc CPU cores).  Motorola. Whoever made the propellor, and PIC if they're still around in any quantity.  Six years ago you could reprogram ~$1 'wi fi adaptors' from China and run whatever you wanted on them within their capability, and there are untold numbers of folks that have general propose CPUs somewhere in the silicon inside their widgets.  Tesla has their own computers for self driving logic. Some of the cloud companies offer compute time on in house designed machine learning options. (all from memory, maybe some small errors somewhere).\n\nTons of folks make CPUs, accelerators, general propose logic, etc.  They're mostly just not relevant to the systems your random neighbor has ever heard of, or they're embedded and un-advertised.  AMD/Intel and ARM-based are the headliners and the ones you actually hear about.",
        "created_utc": 1587698464,
        "id": "foe8ybv",
        "permalink": "/r/investing/comments/g6u4uk/intel_stock_falls_after_report_says_apple_plans/foe8ybv/",
        "score": 6,
        "subreddit": "investing",
        "created": 1587727264.0
    },
    {
        "author": "RayCashIsTrashDalio",
        "body": "amd nvda tsla amzn are FREE MONEY",
        "created_utc": 1586878452,
        "id": "fndvv7q",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fndvv7q/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1586907252.0
    },
    {
        "author": "CptTonyStark",
        "body": "Can we get a meme stock ETF? AMZN AMD NVDA NFLX SPCE TSLA",
        "created_utc": 1586961382,
        "id": "fnhffpa",
        "permalink": "/r/wallstreetbets/comments/g1pvny/daily_discussion_thread_april_15_2020/fnhffpa/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1586990182.0
    },
    {
        "author": "Limboza",
        "body": "I feel sick to my stomach. I was all in on puts for tomorrow on NVDA that I couldn't sell because PDT and was up 100% on. Seriously feel sick I just lost everything since I didn't sell the strike below on some stupid wildcard event 15 minutes after close.",
        "created_utc": 1587072156,
        "id": "fnmiqrf",
        "permalink": "/r/wallstreetbets/comments/g2mj65/what_are_your_moves_tomorrow_april_17_2020/fnmiqrf/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1587100956.0
    },
    {
        "author": "Recklesslettuce",
        "body": "Nvidia is a safe bet because we need as much automation as we can get. Intel is biting their heels tho, but Intel is a bit like General Electric when it was still profitable.",
        "created_utc": 1586829951,
        "id": "fnc6z24",
        "permalink": "/r/wallstreetbets/comments/g0tdhg/why_we_wont_see_major_drops_anymore/fnc6z24/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1586858751.0
    },
    {
        "author": "Googlogi",
        "body": "Was down 2.2k at open because of shitty puts so i sold most and bought nflx, googl, nvda, and amd calls now im up 2.5k 😂😂",
        "created_utc": 1586880218,
        "id": "fndz7xq",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fndz7xq/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1586909018.0
    },
    {
        "author": "andrewo17",
        "body": "Nvda puts here 🍻",
        "created_utc": 1587682956,
        "id": "fodchrc",
        "permalink": "/r/wallstreetbets/comments/g6wybk/decided_to_buy_some_yolo_amd_puts/fodchrc/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1587711756.0
    },
    {
        "author": "altabuse",
        "body": "Down 10k today in my options account, holding SPY puts and ZM puts along with AMZN calls and NVDA calls over the weekend.",
        "created_utc": 1587177211,
        "id": "fnr1qos",
        "permalink": "/r/wallstreetbets/comments/g39g3g/weekend_discussion_thread_for_the_weekend_of/fnr1qos/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1587206011.0
    },
    {
        "author": "CptTonyStark",
        "body": "ROKU NFLX AMZN all have exactly the same graph, MSFT NVDA AMD have exactly the same graph",
        "created_utc": 1587110965,
        "id": "fno3r5t",
        "permalink": "/r/wallstreetbets/comments/g2mj65/what_are_your_moves_tomorrow_april_17_2020/fno3r5t/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1587139765.0
    },
    {
        "author": "bchm16",
        "body": "just got laid off from my job washing dishes at the local titty bar. idk about you guys, but i think i may shop around for some NVDA or AMD semiconductors!",
        "created_utc": 1587050657,
        "id": "fnlbmem",
        "permalink": "/r/wallstreetbets/comments/g2c9fj/daily_discussion_thread_for_april_16_2020/fnlbmem/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1587079457.0
    },
    {
        "author": "HyperInflation2020",
        "body": "I believe they're going to have catastrophic numbers coming up, especially NVDA. NVDA makes the big bucks in the high end cards not the low/mid end cards. COVID/the general economic collapse we are in is going to CRUSH demand for high end cards as previously high earning people feel the squeeze, and this will disproportionately hammer NVDA’s profits.\n\nAI projects have been put on ice and that is likely to be an ongoing phenomenon. AWS GPU compute instances are at the bottom end of the pricing range, reflecting the fall in AI demand. At the end of the day a lot of companies do AI work for the marketing benefit as it has been a hot topic recently.",
        "created_utc": 1586977098,
        "id": "fnibaue",
        "permalink": "/r/stocks/comments/g1y01w/thoughts_on_nvda_and_amd_during_a_recession/fnibaue/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1587005898.0
    },
    {
        "author": "levon105",
        "body": "It sucks, Intel beat on eps and earnings, but due to future uncertainty it is now down 5% AH. It is going to bring down the entire chip/semiconductor field tomorrow. NVDA and AMD already down AH in response.",
        "created_utc": 1587672671,
        "id": "focla09",
        "permalink": "/r/wallstreetbets/comments/g6k3gr/daily_discussion_thread_for_april_23_2020/focla09/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1587701471.0
    },
    {
        "author": "ZorglubDK",
        "body": "[AMD's forward PE is 42.](https://www.gurufocus.com/term/forwardPE/NAS:AMD/Forward-PE-Ratio/Advanced-Micro-Devices) Which is pretty damn decent for a company growing a crapton.  \nBut the circlejerk tends to be that AMD is overvalued or Nvidia/Intel is better. Whatever, once this crisis is fading, I'll put a lot of money on $AMD hitting $100 in 2021.",
        "created_utc": 1586557784,
        "id": "fn1a1ti",
        "permalink": "/r/stocks/comments/fyjaff/sharing_my_top_companies_with_you/fn1a1ti/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1586586584.0
    },
    {
        "author": "_FundingSecured420",
        "body": "# [🦠 POLL TIME 🦠](https://www.reddit.com/r/wallstreetbets/comments/g2r27v/poll_time_friday_april_17/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) \n\nUPDATE: 🟢81% - 19% 🔴 predictions for tomorrow!\n\nWhat a day! (Thank you NVDA &amp; AMZN).  But holyshit, tomorrow is truly going to be a glorious day! (GILD 🤯). Hope all you autists made lots of tendies today! 💰You accurately predicted the last daily poll.  What will tomorrow bring?\n\nCheers boys! 🍻",
        "created_utc": 1587084655,
        "id": "fnn56yo",
        "permalink": "/r/wallstreetbets/comments/g2mj65/what_are_your_moves_tomorrow_april_17_2020/fnn56yo/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1587113455.0
    },
    {
        "author": "thomasisnotmyname",
        "body": "Nvda 310c 4/24 \n\nNvda 320c 4/24\n\nLk 10c 1/15/21\n\nBa 200c 5/1",
        "created_utc": 1587327359,
        "id": "fnwxg6e",
        "permalink": "/r/wallstreetbets/comments/g4ega7/what_are_your_moves_tomorrow_april_20_2020/fnwxg6e/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587356159.0
    },
    {
        "author": "TrenAndOptions",
        "body": "NVDA also had its meme days, those are behind it now. AMD is in the twilight of its meme run",
        "created_utc": 1587185851,
        "id": "fnrdmtu",
        "permalink": "/r/wallstreetbets/comments/g39g3g/weekend_discussion_thread_for_the_weekend_of/fnrdmtu/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587214651.0
    },
    {
        "author": "yoouie",
        "body": "It’s most definitely going to go higher than the price right now. They are still going to crush intel for another 2 years and the console CPUs look fire. If you want to capitalize on semi conductors don’t buy AMD, buy TSM. TSM is the company that owns the factories that build AMD CPUs as well as NVIDIA graphics cards. It’s less looked at but that’s why you should buy it. When ever the graphics card giant nvidia sells a lot or amd steals market share from intel they profit big time. Their profit margins are pretty big too. It’s not mega volatile so it’s safer but you should expect TSM stock price to increase a lot in the coming years. Once 2-3 years passes go look at intel and buy their stock because they will come out with somthing amazing by then but amd is safe from intel right now. Intels prices got leaked for their new processors coming out this year they are still overpriced asf.",
        "created_utc": 1586988021,
        "id": "fnixbek",
        "permalink": "/r/stocks/comments/g1wta7/finally_sold_nflx/fnixbek/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1587016821.0
    },
    {
        "author": "Agaac1",
        "body": "TSLA is the most baffling but we talk about that on this sub every other day. \n\n\nAMD &amp; NVDA sorta make sense? They're both coming out with some competitive products in Q3 and Q4.",
        "created_utc": 1587059976,
        "id": "fnluk9d",
        "permalink": "/r/investing/comments/g2ggyx/tech_bubble/fnluk9d/",
        "score": 5,
        "subreddit": "investing",
        "created": 1587088776.0
    },
    {
        "author": "Lookslikeseen",
        "body": "So it seems selling my NVDA calls at open was a bad idea. Was up 90% but would have been like 400% now. Oh well",
        "created_utc": 1587048887,
        "id": "fnl89jd",
        "permalink": "/r/wallstreetbets/comments/g2c9fj/daily_discussion_thread_for_april_16_2020/fnl89jd/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587077687.0
    },
    {
        "author": "continuuuum",
        "body": "SPY past 3 months = -15.4%\n\nAMD past 3 months = +7.7%\n\nNVDA past 3 months = +9.9%",
        "created_utc": 1586833914,
        "id": "fncd6be",
        "permalink": "/r/wallstreetbets/comments/g0tdhg/why_we_wont_see_major_drops_anymore/fncd6be/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1586862714.0
    },
    {
        "author": "itradeoptionsandfail",
        "body": "I shorted Amd and nvda at close today.  I can’t even feel my ass getting slaughtered anymore.",
        "created_utc": 1585798887,
        "id": "fm6oe92",
        "permalink": "/r/wallstreetbets/comments/ft8n7o/what_are_your_moves_tomorrow_april_02_2020/fm6oe92/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1585827687.0
    },
    {
        "author": "asianperswayze",
        "body": "AMD have proven themselves over the past 3 years with the new Zen cpu architecture. Before that they were in serious trouble. But the architecture is exceptional, and there is alot of market share to gain in all sectors in the cpu business.  As of November 2019, they hold only about 17% market share in desktops cpus, 14% of laptops, and less than 5% in Data centers. While they will grow in the foreseeable future in desktop and laptop, the fortune to really be made is in data centers. And this is all only in the cpu side of the house. \n&gt;\n\nThe gpu side, they are far far behind Nvidia, so really there is only upside there.  I don't really think they can get worse here. They have not had a top of the line competitor in several years, so they really need a Zen like comeback in the gpu segment.  They have competitive mid level gpu products but they are unable to win any  mind share over Nvidia with the lack of top end competitiveness.",
        "created_utc": 1586983695,
        "id": "fniorg9",
        "permalink": "/r/stocks/comments/g1wta7/finally_sold_nflx/fniorg9/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1587012495.0
    },
    {
        "author": "Fujit0ra",
        "body": "Nvidia up 7% on no news. Nice. Someone who bought those thousands of 312.5C this morning knew something.",
        "created_utc": 1587581063,
        "id": "fo7mwki",
        "permalink": "/r/wallstreetbets/comments/g5yjae/daily_discussion_thread_for_april_22_2020/fo7mwki/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587609863.0
    },
    {
        "author": "CptTonyStark",
        "body": "For anyone who wants mad tendies backed by detailed DD: I listened to the TSM earnings call, YOLO into NVDA 325c 5/15, AMD 65c 5/15, MSFT 5/15 200c when NVDA is below 275, AMD 50-55, MSFT below 170 tomorrow.",
        "created_utc": 1587055237,
        "id": "fnlksfv",
        "permalink": "/r/wallstreetbets/comments/g2c9fj/daily_discussion_thread_for_april_16_2020/fnlksfv/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587084037.0
    },
    {
        "author": "axiomatix",
        "body": "To think my btich ass sold 11 nvda 300c 4/17 for 95c this morning for a measly $300 profit.. would have made 10k at open... fuck",
        "created_utc": 1587085787,
        "id": "fnn707y",
        "permalink": "/r/wallstreetbets/comments/g2mj65/what_are_your_moves_tomorrow_april_17_2020/fnn707y/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587114587.0
    },
    {
        "author": "hedekar",
        "body": "The ETF from GlobalX HERO has been doing great since its launch.  Holds nvidia, nintendo, activision, ea, netease, take-two, bilibili, nexon, sea, ubisoft, zynga,capcom, konami and ~30 others.",
        "created_utc": 1586802415,
        "id": "fnar928",
        "permalink": "/r/CanadianInvestor/comments/g0kug3/esports_the_way_ahead/fnar928/",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1586831215.0
    },
    {
        "author": "throwaway60501",
        "body": "NVDA is seriously the most dogshit stock I’ve ever seen in my life holy fuck",
        "created_utc": 1588007082,
        "id": "for6o4e",
        "permalink": "/r/wallstreetbets/comments/g8y4jt/daily_discussion_thread_for_april_27_2020/for6o4e/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588035882.0
    },
    {
        "author": "MrCreateWealth",
        "body": "Alright fellas I tried to tell you about ZM and SHOP falling off a cliff earlier this week. Some listened some didnt. NVDA is next.",
        "created_utc": 1585932990,
        "id": "fmbtmsj",
        "permalink": "/r/wallstreetbets/comments/fu6gsh/daily_discussion_thread_april_03_2020/fmbtmsj/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1585961790.0
    },
    {
        "author": "BlackSky2129",
        "body": "I’ve got AMD calls and NVDA puts for INTC earnings.\n\nCan’t go tits up",
        "created_utc": 1587590692,
        "id": "fo86cdl",
        "permalink": "/r/wallstreetbets/comments/g68cco/what_are_your_moves_tomorrow_april_23_2020/fo86cdl/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587619492.0
    },
    {
        "author": "TonguePressedAtTeeth",
        "body": "Hoping NVDA, AMD and SNAP die tomorrow.",
        "created_utc": 1587593361,
        "id": "fo8bf04",
        "permalink": "/r/wallstreetbets/comments/g68cco/what_are_your_moves_tomorrow_april_23_2020/fo8bf04/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587622161.0
    },
    {
        "author": "ronaktk",
        "body": "Had $200 buying power left 2 weeks ago, bought 1 NVDA 420C 01/2021 for the meme. It's up 420% now 😂",
        "created_utc": 1587081165,
        "id": "fnmzd22",
        "permalink": "/r/wallstreetbets/comments/g2mj65/what_are_your_moves_tomorrow_april_17_2020/fnmzd22/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587109965.0
    },
    {
        "author": "Tbones014",
        "body": "I will forever worship at the alter of NVDA if it returns my portfolio to its former glory. 🙇 6/19 370 🚀",
        "created_utc": 1587085525,
        "id": "fnn6l8n",
        "permalink": "/r/wallstreetbets/comments/g2mj65/what_are_your_moves_tomorrow_april_17_2020/fnn6l8n/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587114325.0
    },
    {
        "author": "FTWOBLIVION",
        "body": "Intel i9 9900k NViDIA 2080 Ti max OC edition signed by John Romero and Paul McCartney, 64 GB ram @ 4200 mhz, twin curved Samsung 240z 1080 p 1ms monitors with a 4k oled LG 120 hz tv display attached for movies. Oculus Rift for when the markets get really heavy and I want to just trip out on some lsd and see the pretty red colors\n\nBut I trade inputs off my modded Nintendo DS Lite",
        "created_utc": 1587339535,
        "id": "fnxiub9",
        "permalink": "/r/wallstreetbets/comments/g4hmm5/what_kind_of_pc_do_you_guys_trade_on/fnxiub9/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587368335.0
    },
    {
        "author": "CptTonyStark",
        "body": "Lol went full retard and bought NVDA 5/15 300c and AMD 5/1 54c on Friday when both dropped like 7%, sold today for 200% profit",
        "created_utc": 1586404124,
        "id": "fmv216a",
        "permalink": "/r/wallstreetbets/comments/fxev5z/what_are_your_moves_tomorrow_april_09_2020/fmv216a/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1586432924.0
    },
    {
        "author": "4121Laurel",
        "body": "No although you’re very invested in technology\nWhich isn’t a bad thing.  \n- AAPL is great, their market value will always go back to what it was even if they don’t release the new iPhone. Don’t be afraid of a drop just average costs if it drops dramatically. \n\n- Adobe should do well with this stay at home. School is requiring the use as well as businesses from home. \n\n- Amazon is essentially showing its untouchable currently. I’m large into amazon as well. \n\n- Disney is another powerhouse that you’ll never need to worry about. The lost revenues over the following 8 months could cause a dramatic drop, in this scenario don’t panic and average your cost. \n\n- Enph - energy, I’m not familiar with this company. \n\n- Facebook is another powerhouse good pick. \n\n- Google - Great pick. \n\n- MasterCard is also a good pick, hold this. Average if it comes down to although you shouldn’t have to they trade rather high. If you’re at a major loss with their recent decline. Average in the next 3 months when there’s a better understanding how financials will deal with crisis. (You shouldn’t need to) \n\n- Microsoft - I love microsoft. They are on a tear currently. Teams daily usage is up 12 million users in the last month, this is major. Their competition is “work” slack technologies who I am also Long. \n\n- Netflix has been great good pick. \n\n- Nike is a great pick. I could expand but they’ve always done well. Constant increase throughout the life of their stock. \n\n- Nvidia is a powerhouse as well. Great pick. \n\n- Starbucks is great. I haven’t followed them through the virus but they’re a strong company large capital, their profits are also great. Good pick. \n\n- Square I like square a lot. Square has major potential in different avenues. Cash app, lending (they just got approved to lend during this time). Prior to the virus square was on a tear. I’m long on this I got in early and am very big on square. \n\nIf you’re interested in diversification:\n\nAll that being said you really are big into tech, I would suggest diversification. \n\n“Oxy” - occidental petroleum is a good long term stock. They’re trading extremely low currently due to oil wars, corona virus, issues on the board and the purchase of anadarko. (This scares a lot of investors but you seem to want long term investments) it’s a steal at 15$ a share. \n\n- Johnson and Johnson is a powerhouse. \n\n- Jet blue &amp; Delta - long term great investments. Short term extremely risky. \n\n- Walmart: trading high but they’re only going to go even higher when this is over. \n\n- AT&amp;T and Verizon: AT&amp;T trades fairly low with a large dividend. GREAT LONG TERM. Verizon has been extremely strong throughout the years.  \n\n- Ford on the long term has a lot of upside trading around half of its average price. Ford pays dividend and  history has proven America will never let ford fail. \n\n- USO is an ETF that tracks United States Oil, It’s trading extremely low, no reason not to diversify with this. ( The oil war between Saudi and Russia is coming to an end, this should do well in the long term) \n\n- Have you put any though into mutual funds to also diversify ? A good managed funds typically has large returns and low risk. \n\nReach out to me if you’d like.",
        "created_utc": 1586822188,
        "id": "fnbtsxw",
        "permalink": "/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/fnbtsxw/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1586850988.0
    },
    {
        "author": "uaoleksiy",
        "body": "fucking sucks! fucked around today and am down 2400 overall. wired 25k into my account had 7700 to play with and its now down to 5200.. not going to touch the 25k so i can safely day trade but ugh... BYND fucked me today, hard. chased poots on the way down to recoup the losses but wasnt enough. also FOMOed into FB, got fucked on that although a small position and fucking NVDA too!! all 5/1 FDs... still holding NVDA, FB and the shitty BYND that's down over 80%.. what a day... what's the move tomorrow to recoup lads? trade SHOP and TSLA FDs all day?",
        "created_utc": 1588038023,
        "id": "fosu0b0",
        "permalink": "/r/wallstreetbets/comments/g98ay4/what_are_your_moves_tomorrow_april_28_2020/fosu0b0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588066823.0
    },
    {
        "author": "pelikana20",
        "body": "NVDA really taking my lunch money today",
        "created_utc": 1587496416,
        "id": "fo415df",
        "permalink": "/r/wallstreetbets/comments/g5cllb/daily_discussion_thread_for_april_21_2020/fo415df/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587525216.0
    },
    {
        "author": "zhanto",
        "body": "INTC, AMD, NVDA all drilling",
        "created_utc": 1587672554,
        "id": "fockxfh",
        "permalink": "/r/wallstreetbets/comments/g6k3gr/daily_discussion_thread_for_april_23_2020/fockxfh/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587701354.0
    },
    {
        "author": "BlackSky2129",
        "body": "Where’s the retard who laughed at my 4k in AMD puts for INTC earnings? \n\nActually I sold some of it and it’s 6k spread among QQQ, AMD, NVDA, INTC puts but still lol",
        "created_utc": 1587678688,
        "id": "fod1h0e",
        "permalink": "/r/wallstreetbets/comments/g6tuin/what_are_your_moves_tomorrow_april_24_2020/fod1h0e/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587707488.0
    },
    {
        "author": "mydogeatstoomuch",
        "body": "If you believe in a product or service and you think it will still be around and grow in ten years, buy it.. dont get hustled by pumpers with penny stocks. APPL/NVDA/PYPL/JPM/HD/JNJ/SQ/AMZN. I stick with solid tech companies and health companies and only a few bank stocks. Look into indexes after this Virus passes.",
        "created_utc": 1587770013,
        "id": "fohpakx",
        "permalink": "/r/RobinHoodPennyStocks/comments/g7htrw/week_one_small_conservative_plays/fohpakx/",
        "score": 4,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1587798813.0
    },
    {
        "author": "BillyG803",
        "body": "Fuck this market. I’m about to go long on DAL, AAPL, NVDA, and RCL",
        "created_utc": 1587753722,
        "id": "fogkigo",
        "permalink": "/r/wallstreetbets/comments/g75wz3/daily_discussion_thread_for_april_24_2020/fogkigo/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587782522.0
    },
    {
        "author": "ErrybodyCrayy",
        "body": "Need Nvidia to drop the 5% it gained today. Fucking cucks. Hoping for -8% day.",
        "created_utc": 1585862694,
        "id": "fm96lkb",
        "permalink": "/r/wallstreetbets/comments/ftujl1/what_are_your_moves_tomorrow_april_03_2020/fm96lkb/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1585891494.0
    },
    {
        "author": "iSellChildrenJustPM",
        "body": "NVDA what the fuck are you doing? You acquire a huge company for free, you own the world in microchips and cloud, what the fuck are you doing?",
        "created_utc": 1587145134,
        "id": "fnpgkji",
        "permalink": "/r/wallstreetbets/comments/g2z9p8/daily_discussion_thread_for_april_17_2020/fnpgkji/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587173934.0
    },
    {
        "author": "be_o3",
        "body": "What does next week hold for NVDA?",
        "created_utc": 1587185338,
        "id": "fnrczyu",
        "permalink": "/r/wallstreetbets/comments/g39g3g/weekend_discussion_thread_for_the_weekend_of/fnrczyu/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587214138.0
    },
    {
        "author": "Randomness898",
        "body": "Did anyone play TSM tonight?  CC Wei is always interesting.\n\nForgot to mark it down on my calendar, has some what of an effect on NVDA/AMD.",
        "created_utc": 1587003029,
        "id": "fnjnz55",
        "permalink": "/r/wallstreetbets/comments/g21xf4/what_are_your_moves_tomorrow_april_16_2020/fnjnz55/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587031829.0
    },
    {
        "author": "sylphvanas",
        "body": "Had NVDA and NFLX calls going into today. Sold NFLX at open and held NVDA. GG",
        "created_utc": 1586961075,
        "id": "fnhevt2",
        "permalink": "/r/wallstreetbets/comments/g1pvny/daily_discussion_thread_april_15_2020/fnhevt2/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586989875.0
    },
    {
        "author": "Spoonerism86",
        "body": "I was watching an interesting video the other day which was focusing on Carnival Cruise. Although the entire industry is getting raped and most of them are not getting any government bailout, still Carnival owns almost 50% of the market and financially the most stable one. Now, plenty of other similar companies will go out of business this year or next and if Carnival manages to pull this through they have the opportunity to increase their market share way above 50%. \n\nThis is a long play and not without risks and I don't like cruises so will not go for it.\n\nOther than this I believe technology stocks which provide cloud services or the infrastructure/hardware to it will remain in high demand (Amazon, Microsoft, Nvidia, Google) or companies with loyal and huge fan base (Apple) are safe bet. I also like Applied Materials, basically they're providers to semiconductor manufacturers equipment and technology wise. \n\nI'm personally also looking at Visa, Mastercard and Paypal as they still have plenty of growth potential as I see still many developed countries are relying on payment with cash.",
        "created_utc": 1586802005,
        "id": "fnaqfos",
        "permalink": "/r/investing/comments/g0ma21/investing_10_in_blue_chip_companies/fnaqfos/",
        "score": 4,
        "subreddit": "investing",
        "created": 1586830805.0
    },
    {
        "author": "Lolsmileyface13",
        "body": "this guy really comparing amd nvda to a camry driving ppl",
        "created_utc": 1586919967,
        "id": "fng191b",
        "permalink": "/r/wallstreetbets/comments/g1duq3/what_are_your_moves_tomorrow_april_15_2020/fng191b/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586948767.0
    },
    {
        "author": "CptTonyStark",
        "body": "Anybody looking to play AMD/MSFT/NVDA/TSLA earnings?",
        "created_utc": 1586851511,
        "id": "fncyb0y",
        "permalink": "/r/wallstreetbets/comments/g0rmrr/what_are_your_moves_tomorrow_april_14_2020/fncyb0y/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586880311.0
    },
    {
        "author": "jameschoy949",
        "body": "NVDA is pretty overpriced atm I think.\n\nI would much rather go with AMD (They recently got the full order from Sony for the PS5).",
        "created_utc": 1586538258,
        "id": "fn0a9c8",
        "permalink": "/r/stocks/comments/fyjaff/sharing_my_top_companies_with_you/fn0a9c8/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1586567058.0
    },
    {
        "author": "Apdvadar",
        "body": "Bought 8k worth of Msft 9/18 $180cs and Apple 10/16 $320cs at yesterday’s high.  Was worried all last night they’d get hit hard.\nWokeup late to see both of them down bigly but the volatility actually had my calls green. Thought about it and added one more Apple c, three more msft cs, and a Nvda 5/15 $260c.",
        "created_utc": 1586983690,
        "id": "fnior0y",
        "permalink": "/r/wallstreetbets/comments/g1pvny/daily_discussion_thread_april_15_2020/fnior0y/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587012490.0
    },
    {
        "author": "itsmudpit",
        "body": "shh don't give away the answers to the test. 5 years from now you'll hear .. damn I guess they weren't kidding when they said 20% compound growth y.o.y; and wait that wasn't incorporating any anticipation with nvidia market share.. shit, is it too late?",
        "created_utc": 1586546570,
        "id": "fn0q1av",
        "permalink": "/r/stocks/comments/fyjaff/sharing_my_top_companies_with_you/fn0q1av/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1586575370.0
    },
    {
        "author": "diunay_lomay",
        "body": "Hmmm, we drilling tomorrow?  Sold BA from 2.87 for 17.85 missed the 22 run\n\nGot  NVDA 255P,  SPY 260P, 265P, 270P, TSLA 520P\n\nLet's GO !!!",
        "created_utc": 1586291969,
        "id": "fmq31z4",
        "permalink": "/r/wallstreetbets/comments/fwim5b/daily_discussion_thread_april_07_2020/fmq31z4/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586320769.0
    },
    {
        "author": "jillesme",
        "body": "Fun fact: I had about 10k in NVDA calls on February 17th. Held them all the way to 0. Then I bought SPY puts at SPY 250 / 260 a week ago 🤡",
        "created_utc": 1586274442,
        "id": "fmp4sxg",
        "permalink": "/r/stocks/comments/fwkz9s/how_messed_up_is_our_financial_system_that_in_the/fmp4sxg/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1586303242.0
    },
    {
        "author": "Miker1730",
        "body": "Alright boys , bought calls on NVDA, MSFT and AMD all at end of day, what we thinking for tomorrows movement",
        "created_utc": 1587503012,
        "id": "fo4el2k",
        "permalink": "/r/wallstreetbets/comments/g5cllb/daily_discussion_thread_for_april_21_2020/fo4el2k/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587531812.0
    },
    {
        "author": "kapponen",
        "body": "Convinced my mom to buy NVDA, TSLA, AMD all within 2010-2014. Just out of luck; I was a kid and that was the tech I either used, or heard about on the internet. She recently sold all those positions as of the end of 2018. She did quite well for herself",
        "created_utc": 1587005963,
        "id": "fnjshz1",
        "permalink": "/r/stocks/comments/g1wta7/finally_sold_nflx/fnjshz1/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1587034763.0
    },
    {
        "author": "Fujit0ra",
        "body": "Open tomorrow: \n\n- MSFT 185 \n- AMZN 2250 \n- NVDA 300\n- AAPL 300\n- AMD 60\n- INTC 65\n- TSLA 999\n- ROKU 200\n- JNJ 200",
        "created_utc": 1587078803,
        "id": "fnmv80b",
        "permalink": "/r/wallstreetbets/comments/g2mj65/what_are_your_moves_tomorrow_april_17_2020/fnmv80b/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587107603.0
    },
    {
        "author": "SJ_Shark_Byte",
        "body": "I FOMO’d some AMD and NVDA calls lol. Stimulus checks hitting today and throughout the week. Bull market thru Friday",
        "created_utc": 1586880650,
        "id": "fne01lo",
        "permalink": "/r/wallstreetbets/comments/g1895k/fomo_amd/fne01lo/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586909450.0
    },
    {
        "author": "ErrybodyCrayy",
        "body": "Did nvidia really moon on news of new laptop GPUs. Who the fuck got money to buy Teslas and Laptops when they all just lost their job. Cucks. How many Tesla owners going to default.",
        "created_utc": 1585861122,
        "id": "fm93ozp",
        "permalink": "/r/wallstreetbets/comments/ftkgj6/daily_discussion_thread_april_02_2020/fm93ozp/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1585889922.0
    },
    {
        "author": "Jay87540",
        "body": "QQQ, Microsoft, Apple, Disney, Amazon, Facebook, Nike, Starbucks, MGK, VOO, VOOG, Intuitive Surgical, Tesla, AMD, NVDA, Coca Cola, BAC, VTI, VO, VB, BRK-B, LULU, VISA, Home Depot, O, WELL, NHI, STOR.  Fractional shares for some of those.",
        "created_utc": 1586396278,
        "id": "fmupst6",
        "permalink": "/r/investing/comments/fxhx2b/what_stocks_would_you_buy_with_4500_right_now/fmupst6/",
        "score": 4,
        "subreddit": "investing",
        "created": 1586425078.0
    },
    {
        "author": "CapturedSociety",
        "body": "ORBC and AMD ITM 01/21 because I’m not retarded.\n\nGonna need those sweet Christmas gains and I’m going in on NVIDIA and Intel because this Christmas will be dominated by tech.\n\nNTDOY may have room to grow if they release a Switch Pro but until then I’ll just watch.\n\nI wanna fight. Someone argue me that it’s a stupid move while every gaymer will not be able to stand the first consoles that basically destroyed your home PC build (well, not me, my 2990WX was a SOLID investment)",
        "created_utc": 1586552227,
        "id": "fn10a8p",
        "permalink": "/r/wallstreetbets/comments/fyoe1p/stocks_will_revisit_their_coronavirus_crash_low/fn10a8p/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586581027.0
    },
    {
        "author": "PsychGW",
        "body": "Honestly, both NVDA and AMD are here to stay. When one wins in the short term, the other wins too in the long run in a way that's good for both of them. They support each other as an industry, even though they're \"competitors\", in a way that you don't see elsewhere.",
        "created_utc": 1586549635,
        "id": "fn0vnp2",
        "permalink": "/r/stocks/comments/fyjaff/sharing_my_top_companies_with_you/fn0vnp2/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1586578435.0
    },
    {
        "author": "BoredMisanthrope",
        "body": "Big time long on Nvidia but looking for the right entry point. Short term hurting sales, sure. But consumer GPU sales will become a dwindling revenue stream for them. GeForce now will become a much bigger revenue stream, renting out GPU remotely will be a much more efficient use of resources and will pump up profitability. AI will experience some short term pullback but saying \"AI is nice but most companies it is not essential\" is a company saying \"the internet is nice but most companies don't need it\" back in 1999.",
        "created_utc": 1586795585,
        "id": "fnadhip",
        "permalink": "/r/stocks/comments/g0mb9e/what_do_you_think_about_nvidia_long_or_short/fnadhip/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1586824385.0
    },
    {
        "author": "RayCashIsTrashDalio",
        "body": "look at the 1 month chart for AMD TSLA NVDA NFLX AMZN. LITERALLY STRAIGHT UP. IMAGINE THE BOOMERS WHO BOUGHT THE FUCKEN DIP. amzn nflx worth more than pre-coronavirus and at ATH.",
        "created_utc": 1586880406,
        "id": "fndzkuf",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fndzkuf/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586909206.0
    },
    {
        "author": "ElectricOne55",
        "body": "Most of the growth stocks I've had in my portfolio have done worse. I think that's just cause of coronavirus though if this wouldn't have happened they probably would have done better. Like I'm down 50 percent in paycom thats cuz I bought it literally right before all this mess though. But I'm thinking if I would have done that with KO, PEP, V, JPM, Costco, HD, or any other \"safe\" undervalued stock it would have dropped just as much",
        "created_utc": 1586357756,
        "id": "fmslg1f",
        "permalink": "/r/investing/comments/fx79vr/value_vs_growth/fmslg1f/",
        "score": 1,
        "subreddit": "investing",
        "created": 1586386556.0
    },
    {
        "author": "sspianist6",
        "body": "Some interesting stocks\n\nBLDP similar to fcel and plug\n\nENPH, SEDG- high growth solar picks\n\nTTD, PAYC- high growth profitable companies in growing industries\n\nDXCM, PODD, maybe TNDM - all diabetes companies",
        "created_utc": 1585874592,
        "id": "fm9qz5e",
        "permalink": "/r/stocks/comments/fttti5/what_stock_will_investors_regret_not_buying_1020/fm9qz5e/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585903392.0
    },
    {
        "author": "Hey_Jimbo",
        "body": "**New Investor seeking judgment on portfolio!**\n\nHello everyone, I've recently compiled a watch list of some stocks, ETFs, and a mutual fund. My ultimate goal is to generate long-term growth. Please give me any thoughts or critiques you may have. Thanks a million! \n\nStocks: LULU, CPRT, MGRC, MSFT, ADBE, MA, PAYC, PFSI, NMIH | ETFs: FTEC, SCHG, SMH, SPYG | Mutual Fund: TRIRX",
        "created_utc": 1585942058,
        "id": "fmcao6y",
        "permalink": "/r/investing/comments/fu7c30/daily_advice_thread_all_basic_help_or_advice/fmcao6y/",
        "score": 1,
        "subreddit": "investing",
        "created": 1585970858.0
    },
    {
        "author": "ThePortfolio",
        "body": "I bought Disney at 96 and BA at 102. I will not be checking on them anytime soon. Also picked up Exxon, chevron, shell, XPO, SHOP, Costco, PAYC, visa, F, and two more I forgot...I don’t want to open the app to check. Just waiting for at least a year...🤞🏼",
        "created_utc": 1586719677,
        "id": "fn7g68g",
        "permalink": "/r/investing_discussion/comments/fzpdps/should_i_make_the_move_or_hold_out/fn7g68g/",
        "score": 1,
        "subreddit": "investing_discussion",
        "created": 1586748477.0
    },
    {
        "author": "xIDoZe",
        "body": "High risk high reward. Pretty interesting portfolio. Just sold Paycom and Alteryx yesterday because they jumped 12% and I don't know so much about the stocks to feal safe to hold them forever. \nDo you have more insight of them and what are your safest and  top stocks for the future?",
        "created_utc": 1586536893,
        "id": "fn07muz",
        "permalink": "/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/fn07muz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586565693.0
    },
    {
        "author": "jpoms13",
        "body": "Not to mention competitors like Paycom ($PAYC, I think) are taking business from them.\n\nFull Disclosure: I hate Paychex. I’ve moved two companies away from their payroll services.",
        "created_utc": 1586043586,
        "id": "fmg8mp1",
        "permalink": "/r/wallstreetbets/comments/fuw8ii/buy_puts_iwm_sba_screwed_small_business_owners_it/fmg8mp1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586072386.0
    },
    {
        "author": "dvdmovie1",
        "body": "I was buying new or adding some to existing in ISRG, SYK, EW, ROKU, CVNA, CDLX, SHOP, TTD, PAYC, RNG and others in March and a little bit more in the first week of April.",
        "created_utc": 1586792181,
        "id": "fna6xg0",
        "permalink": "/r/investing/comments/g0l2ci/which_companies_are_you_nibbling_on_or_going_to/fna6xg0/",
        "score": 1,
        "subreddit": "investing",
        "created": 1586820981.0
    },
    {
        "author": "LearningtoCompound",
        "body": "Fair Value Estimates For: TSLA, BYND, NFLX, ROKU, NVDA, AMD, AMZN, FB, XPEL, PAYC, SBUX, MSFT, BRK, WM, SHOP, ADBE, PTON, AAPL, COST\n\nHas anyone worked on fair value estimates for any of these companies and is open to discussing it with someone who wants to learn the art from a professional?\n\nI understand its the owners earnings that can be taken out of the business throughout its life discounted at the proper discount rate. But want to learn how different professionals are doing it so I can understand it better.\n\nThank you!",
        "created_utc": 1585935679,
        "id": "fmbyqlb",
        "permalink": "/r/investing/comments/fu7c30/daily_advice_thread_all_basic_help_or_advice/fmbyqlb/",
        "score": 1,
        "subreddit": "investing",
        "created": 1585964479.0
    },
    {
        "author": "LearningtoCompound",
        "body": "Fair Value Estimates For: TSLA, BYND, NFLX, ROKU, NVDA, AMD, AMZN, FB, XPEL, PAYC, SBUX, MSFT, BRK, WM, SHOP, ADBE, PTON, AAPL, COST\n\nHas anyone worked on fair value estimates for any of these companies and is open to discussing it with someone who wants to learn the art from a professional?\n\nI understand its the owners earnings that can be taken out of the business throughout its life discounted at the proper discount rate. But want to learn how different professionals are doing it so I can understand it better.\n\nThank you!",
        "created_utc": 1585936067,
        "id": "fmbzgvn",
        "permalink": "/r/SecurityAnalysis/comments/f8v8eq/2020_security_analysis_questions_and_discussion/fmbzgvn/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1585964867.0
    }
]