[
    {
        "author": "Draiko",
        "body": "Xilinx.\n\nThey're AMD now.",
        "created_utc": 1605585306,
        "id": "gckrxze",
        "permalink": "/r/investing/comments/jvgpip/sp_global_announced_that_tesla_will_join_the_sp/gckrxze/",
        "score": 29,
        "subreddit": "investing",
        "created": 1605614106.0
    },
    {
        "author": "F1shB0wl816",
        "body": "I haven’t been able to figure out what I think is a good buy in on pltr, I’ve got my one share I got when it ipo’d just to see what would happen. Nio thankfully I’m in, if it goes between 25-35 is when I’d buy more without thought, otherwise I’m just waiting to see where it lands and go from there. Of course I like the Tesla too. \n\nI’d seen a commercial for ally today and it made me wonder about sq. It seems like they could make for good competition with cashapp.\n\nStarlink would be an interesting one, the rest, idk. They seem trend based, tik tok just comes off like a vines type thing. I don’t really know about the others to comment, although you’ve turned me onto rtk. \n\nAmd is also one I’m liking a lot too, them buying Xilinx is a good in my opinion which helps. \n\nSpce is also one I’m curious about. Idk what to think of it, if that takes off though, that could be massive.",
        "created_utc": 1605488772,
        "id": "gcg43rl",
        "permalink": "/r/stocks/comments/juspqu/if_all_youre_looking_for_growth_stocks_then_here/gcg43rl/",
        "score": 22,
        "subreddit": "stocks",
        "created": 1605517572.0
    },
    {
        "author": "mintz41",
        "body": "I'm invested in a fund called Pictet Robotics which has performed extremely well for me. Here is the listing of holdings if anyone is interested, could be some hidden gems worth DD:  \n  \nKinaxis  \nDassault Systemes  \nInfineon Technologies  \nSiemens  \nMellanox Technologies  \nDaifuku  \nFanuc  \nKeyence  \nMitsubishi Electric  \nNidec  \nOmron  \nSMC Corp  \nYaskawa Electric  \nASML  \nNXP Semiconductors  \nElekta  \nHexagon  \nAgilent  \nAlphabet  \nAltair Engineering  \nAnsys  \nAutodesk  \nCadence Design Systems  \nCognex  \nCoherent  \nDropbox  \nIntel  \nIntuitive Surgical  \nIPG Photonics  \nIRobot  \nKLA Corp  \nMicrochip Technology  \nON Semiconductor  \nPTC  \nQualcomm  \nRingcentral  \nRockwell Automation  \nSplunk  \nSynopsys  \nTeradyne  \nTwilio  \nXilinx  \n  \nI know its just a long list of companies but might be helpful",
        "created_utc": 1605652535,
        "id": "gcnr4uw",
        "permalink": "/r/stocks/comments/jvymd8/robotics_is_the_future_aka_the_next_big_boom/gcnr4uw/",
        "score": 20,
        "subreddit": "stocks",
        "created": 1605681335.0
    },
    {
        "author": "ArtanisHero",
        "body": "It’s probably going to be one of the companies already  in process of being acquired. Why remove someone when several S&amp;P constituents are in process of getting acquired - XLNX and TIF are two that come immediately to mind",
        "created_utc": 1605578402,
        "id": "gckfc65",
        "permalink": "/r/wallstreetbets/comments/jvjtsj/were_going_to_figure_out_which_sp500_company_will/gckfc65/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1605607202.0
    },
    {
        "author": "random198611",
        "body": "Xilinx is who they are buying",
        "created_utc": 1605494304,
        "id": "gcgetml",
        "permalink": "/r/wallstreetbets/comments/juuqb2/125000_on_amd_1218_90c_last_options_play_of_the/gcgetml/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1605523104.0
    },
    {
        "author": "ArtanisHero",
        "body": "Your an idiot. That is not how finance works\n\nWhen you merge two companies in an all-stock transaction - you don't just add up their market cap. Post-transaction market cap DOES NOT equal mkt cap A + mkt cap B.\n\nAMD is still acquiring the same $ amount of revenue and earnings in the transaction. The EV / revenue and P/E multiples they are paying remain unchanged. They are then hoping the market assigns the same multiple to the combined earnings as AMD receive, therefore generating incremental value.\n\nThe math here is AMD trades at 110x PE. They are acquiring XLNX at 55x PE. It doesn't matter if XLNX value cuts by 50% and they are now trading at 25x PE. AMD is going to acquire those earnings at 55x, and hope immediately upon closing they get blended up to AMD's PE of 110x. This would be called an accretive transaction",
        "created_utc": 1605581028,
        "id": "gckk91y",
        "permalink": "/r/wallstreetbets/comments/jvjybm/million_dollar_question_who_will_tsla_replace_on/gckk91y/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1605609828.0
    },
    {
        "author": "zergUser1",
        "body": "A bit surprised AMD hasn't spiked up a bit more, AMD just got over the Xilinx acquisition dip and the vaccine dip back to back, now there is just insane upside for the rest of the year with their top of the line CPU and GPU launch as well as new server infrastructure.   \n\n\nIts complete rubbish to think its \"priced in\" nobody in their right minds expected AMD to domnate single thread over intel and therefore gaming, additionally nobody expected AMD to  come close to the nvidia 3090 and instead they beat it at a 500$ cheaper price point.  \n\n\nintel said \"server market decresing because (insert excuse)\", meanwhile AMD's was growing.",
        "created_utc": 1605610770,
        "id": "gcllgw8",
        "permalink": "/r/stocks/comments/jvp9wd/rstocks_daily_discussion_technicals_tuesday_nov/gcllgw8/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1605639570.0
    },
    {
        "author": "ArtanisHero",
        "body": "That's not how finance works. The purchase price of XLNX is already locked in (at least relative to AMD share price). The price is now solely dependent upon perceived % probability that the transaction closes (and what AMD share price does, since purchase is 100% in shares of AMD). Sure, there is downside for the passive funds that match the S&amp;P500 index as they would be forced to sell the shares, but because of merger arbitrage, funds and buyers would step in to buy those shares\n\nAt end of day, doesn't affect AMD.",
        "created_utc": 1605579389,
        "id": "gckh6ch",
        "permalink": "/r/wallstreetbets/comments/jvjybm/million_dollar_question_who_will_tsla_replace_on/gckh6ch/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1605608189.0
    },
    {
        "author": "gnocchicotti",
        "body": "Dammit, I'm in.\n\nj/k I'm not in because Su Bae decided to fuck me in the ass no lube by announcing the XLNX acquisition the same goddam day as blowout earnings that would have otherwise made my calls print.",
        "created_utc": 1605502315,
        "id": "gcgsn0y",
        "permalink": "/r/wallstreetbets/comments/juuqb2/125000_on_amd_1218_90c_last_options_play_of_the/gcgsn0y/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1605531115.0
    },
    {
        "author": "ArtanisHero",
        "body": "Well could easily be Xilinx or Tiffany’s. Both are getting acquired, although Xilinx more likely given its $30B market cap and is a tech company",
        "created_utc": 1605578211,
        "id": "gckezgy",
        "permalink": "/r/wallstreetbets/comments/jvjybm/million_dollar_question_who_will_tsla_replace_on/gckezgy/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1605607011.0
    },
    {
        "author": "hanz3n",
        "body": "I’d buy AMD. If the Xilinx sale goes through, I think there are some interesting possibilities for incorporating FPGA fabric on high core count CPUs. Where I work we are using Xilinx SoCs for digital communications processing and integrating that functionality into x86 CPUs would reduce system complexity greatly. Other benefits include flexible, upgradable high bandwidth IO, custom coprocessor deployment per workload, reconfigurable logic on the fly. \n\nNVDA is buying an instruction set while AMD is buying like infinite instruction sets.",
        "created_utc": 1605510194,
        "id": "gch2so1",
        "permalink": "/r/stocks/comments/jv1hah/amd_vs_nvidia/gch2so1/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1605538994.0
    },
    {
        "author": "Beast0045",
        "body": "Dude thats just cpu’s!\n\nHow about against NVIDIA!!! GPU’s AMD just made are incredible!  Prices are also very high and in high demand!  Nvidia cant produce enough.\n\nAnd xilinx! FPGA’s galore!  Xilinx makes bank they are like one of very few in that industry too.  Altera is the only real competitor.",
        "created_utc": 1605052458,
        "id": "gbvsvv4",
        "permalink": "/r/wallstreetbets/comments/jrvpgc/amd_to_the_moooooooonnn/gbvsvv4/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605081258.0
    },
    {
        "author": "ezekiel1525",
        "body": "Hey there,I've done an extreme amount of research about AMD and have been actively trading them for about 3 years now, so it is a quite large portion of my portfolio at the moment and it's a stock that I always advocate family &amp; friends to purchase as well. I definitely wouldn't advise you to put all your eggs in one basket, but I do believe that AMD is a very good buy in the long-term.\n\nFundamentally, they have an absurdly phenomenal management team. Since Lisa Su's inception, the company has experienced tremendous growth and even managed to steal away Intel's lead architect. Although AMD has always has great products, Lisa Su has really managed to take it to the next level and make AMD nearly a household name at this point with the rise of customized computer building.\n\nI guess to answer your question better, if you're planning on holding this for 10+ years, I have no doubts that this stock will grow especially with its acquisition of Xilinx and incredible product line. These synergies match especially well and I don't see a way that Intel could possibly topple AMD as it previously has. The semiconductor industry has been seeing a growing prevalence, especially with its intertwining of AI (i.e. NVDIA).  \n\n\nEDIT: I know that might be a pretty ambiguous answer, but I've done a few analyses and reports on AMD, so if you have any other questions regarding their financials/future outlook, feel free to reach out!",
        "created_utc": 1604689669,
        "id": "gbdirsr",
        "permalink": "/r/stocks/comments/jpb34f/buy_amd_stock/gbdirsr/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1604718469.0
    },
    {
        "author": "FEDD33",
        "body": "Agree. Buying the stock is equal to investing in the people running the company. Lisa Su is great.\n\nAMD is going to keep clawing away at Intel market share and xilinx, if I understand it correctly, will give them some diversification in their revenue streams.",
        "created_utc": 1604787504,
        "id": "gbi6a3p",
        "permalink": "/r/stocks/comments/jpqyq4/amd_baba_adi_avgo_qcomm/gbi6a3p/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1604816304.0
    },
    {
        "author": "Jpmcap",
        "body": "$AMD $90 calls Jan 15 2021.\n\nGaming is on fire this year. They are the supplier in the best position to profit from it. \n\nXilinx is a dumb value buy for them, but people will like the eps bump for the fundamentalist dummies out there. Xilinx is deadweight that is Going to slow down some of AMD’s dynamism long term. \n\nEvery time the stock drops below $80 I am buying more calls. Will be over $95 by the end of the year.",
        "created_utc": 1605219055,
        "id": "gc3cax2",
        "permalink": "/r/wallstreetbets/comments/jt38hy/what_are_your_moves_tomorrow_november_13_2020/gc3cax2/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605247855.0
    },
    {
        "author": "Afshari",
        "body": "I read it was Xilinx which AMD bought",
        "created_utc": 1605641370,
        "id": "gcn3d4j",
        "permalink": "/r/wallstreetbets/comments/jvzhpv/heres_how_teslas_sp_500_inclusion_may_play_out/gcn3d4j/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605670170.0
    },
    {
        "author": "robmafia",
        "body": "???\n\namd did purchase them.  at a bad price.  at an awful conversion rate.  at the stock's expense.\n\n($35B based on 10/8 valuation, xlnx shares will convert to amd shares at a rate of 1:1.72)\n\ngreat deal for xlnx shareholders/autists with calls.  \n\nawful assraping for amd share/callholders",
        "created_utc": 1604440456,
        "id": "gb1sq1b",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb1sq1b/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604469256.0
    },
    {
        "author": "tinderadventurees",
        "body": "XLNX getting bought out. Its price is tied to amd so it wouldnt even tank unless amd does, I think?I don't know shit tho",
        "created_utc": 1605600518,
        "id": "gclbtq4",
        "permalink": "/r/wallstreetbets/comments/jvf737/what_are_your_moves_tomorrow_november_17_2020/gclbtq4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1605629318.0
    },
    {
        "author": "michael370662",
        "body": "So this amd rumor with tsla is like the amd rumor with XLNX? It came out a week ahead. So expect massive confirmation next week?",
        "created_utc": 1604942085,
        "id": "gbqhmgn",
        "permalink": "/r/wallstreetbets/comments/jqv478/daily_discussion_thread_for_november_09_2020/gbqhmgn/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604970885.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "ZM and CRM pumped more than 25%.  \n  \nIts okay though, my QCOM leaps are happy :)  \n  \nDidn't imply QCOM would fall (I am bullish on them). But I don't think any hardware companies not named AMD can pump 25%+  \n  \nQCOM is still undervalued. Was my 5G play with XLNX and NOK (Rest In Peace)  \n  \nAn example: DOCU is a pure software play and it pumped 13% in a single day that didn't even involve earnings. Pure software plays have a lot of room for growth (DOCU, OKTA, CRWD, NET, PYPL, SQ, FB, etc)",
        "created_utc": 1604528069,
        "id": "gb5wr7d",
        "permalink": "/r/wallstreetbets/comments/jnu8gl/daily_discussion_thread_for_november_04_2020/gb5wr7d/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604556869.0
    },
    {
        "author": "Boomtown626",
        "body": "The XLNX acquisition hurt the share price, but it's a good long-term move for them. Anyone holding it now needs to commit to holding it through about the middle of 2022, to allow time for the acquisition to finalize and for a couple of earnings periods afterward to roll in. I bought the dip following the news of the merger (and sold my XLNX), and I have it in the set-and-forget category with the rest of my chipmaker stocks.",
        "created_utc": 1605060334,
        "id": "gbw75p5",
        "permalink": "/r/stocks/comments/jrh528/rstocks_daily_discussion_technicals_tuesday_nov/gbw75p5/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1605089134.0
    },
    {
        "author": "Tarek394",
        "body": "That would be amazing bro. They had a blowout earnings report, acquired Xilinx, and are partnering with IBM on top of having their tech in the new video game consoles. No reason they can't hit 100.",
        "created_utc": 1605274704,
        "id": "gc5g9fy",
        "permalink": "/r/wallstreetbets/comments/jtf81v/daily_discussion_thread_for_november_13_2020/gc5g9fy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1605303504.0
    },
    {
        "author": "BoardButcherer",
        "body": "xilinx buyout bullish as fuck. Intel's over there in the corner selling off fabs and industry arms, AMD is buying big players.",
        "created_utc": 1604345452,
        "id": "gaxe067",
        "permalink": "/r/wallstreetbets/comments/jmto48/dear_amazon/gaxe067/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604374252.0
    },
    {
        "author": "Boomtown626",
        "body": "Tech is facing some headwinds right now in terms of the broader market reevaluating the increased valuations this year, and AMD's recent purchase of XLNX diluted the shares a bit. I hadn't planned on getting in originally, but those two things together I think have amplified this dip a bit, and the XLNX purchase is a long-term win for sure. \n\nIf you can stomach the idea that it could be down 5 or 7 percent six weeks from now (no specific reason to say that, just acknowledging the possibility), and your response to that would be to buy a little more if it happens, then yeah, I think AMD has some solid long-term potential. Just make sure that you plan on sticking around until the XLNX purchase goes through (end of 2021), plus a few more months. That will be the way to maximize your value, assuming the timeline and risk profile fit your investment strategy.",
        "created_utc": 1604428739,
        "id": "gb1423y",
        "permalink": "/r/stocks/comments/jn6j76/rstocks_daily_discussion_technicals_tuesday_nov/gb1423y/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604457539.0
    },
    {
        "author": "xXShadowHawkXx",
        "body": "Get some XLNX, it will convert to 1.7 shares of AMD by the end of 2021 so its essentially buying discount AMD atm",
        "created_utc": 1605148863,
        "id": "gc019lk",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/gc019lk/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1605177663.0
    },
    {
        "author": "zergUser1",
        "body": "It feels like AMD is about to go nuts, so much positive news for the next few months, and we are over the Xilinx acquisition slump and the vaccine news brought it down a bit, gona double my position in it",
        "created_utc": 1605122177,
        "id": "gbyounp",
        "permalink": "/r/stocks/comments/js47xm/rstocks_daily_discussion_wednesday_nov_11_2020/gbyounp/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1605150977.0
    },
    {
        "author": "Charlietango2007",
        "body": "Well, after running around the house screaming like a mad idiot for hours on and pulling out my hair thinking about going out in the front yard dousing myself with gasoline and lighting my self on fire.\nI've come to the sad realization that Nokia is just a business they're doing a lot of incredible things you think it would hit the stock price through the roof or to the Moon as they say. But they're also spending a hell of a lot of money to get all this other crap done. I have January calls it'll probably expire worthless. I've come to accept that unless Microsoft or the government or somebody buys a company which unfortunately is not for sale. But then again everything has its price. Including me because I've been giving $5 blow jobs behind the Wendy's dumpster near my house just to make ends meet.\nI've already lost my half my portfolio which is about $80,000 thank you AMD for moving your earnings date without telling anyone and buying xilinx. And now dunkin' donuts is going private and I knew about it and I didn't buy any calls or puts or any goddamn thing.\nThe only advice I can give you is stay out of this for a while or buy leaps for 2022. Nokia doesn't move enough to day trade you're better off investing in Erickson or Comcast or T-Mobile. Even Qualcomm I stay away from AT&amp;T though period well good luck with your investment you can always buy Tesla. I just bought Amazon and the price went down even though earnings were through the roof. The stock market is just not stable right now it's almost as if Trump is running that also as well as the country period both are in very sad state. Put your money in the bank and leave it there for a while you're better off period again this is only my opinion or is everyone says the mad ravings of a madman Good luck Chuck. Cheers",
        "created_utc": 1604287869,
        "id": "gav2z46",
        "permalink": "/r/options/comments/jmfobx/nok_call_holders_plans/gav2z46/",
        "score": 1,
        "subreddit": "options",
        "created": 1604316669.0
    },
    {
        "author": "bmjcoding",
        "body": "My understanding is Xilinx will help the future of AMD (stocks in this case), not necessarily immediate. With the acquisition of Xilinx, AMD becomes more of a threat to its rivals (Intel &amp; NVIDIA) in the data center sector. Unlike your average consumer (AMD vs Intel vs NVIDIA), data centers will always prefer price:performance rather than simple branding. If this merge works in AMD’s favor, in time data centers will begin to adopt AMD architecture over NVIDIA (if price:performance is reasonable) thus increasing overall profit.",
        "created_utc": 1604337261,
        "id": "gawwk4l",
        "permalink": "/r/investing/comments/jmqzqr/nasdaq_amd_week_45/gawwk4l/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604366061.0
    },
    {
        "author": "TheFatality1",
        "body": "If only Xilinx didn't exist...",
        "created_utc": 1604336387,
        "id": "gawup7i",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gawup7i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604365187.0
    },
    {
        "author": "moneygardener",
        "body": "Have any of you guys listened to the podcast \"WSJ Tech News Briefing\"?\n\nA couple days ago they had a piece on mergers and aquisitions in the chipmaker industry. AMD/XLNX and MRVL/IPHI was being discussed. They also discussed Intel's production difficulties, albeit with an obvious shortcoming in the technical understanding. I was giggling at the \"expert\" responses from the reporters. How can they land a job in the \"tech space\" of Wall Street Journal, with so little actual technical insight?\n\nI don't know if this is worthy of a post on it's own? There's probably a lot of ears listening in on that show.",
        "created_utc": 1604368648,
        "id": "gayn1ym",
        "permalink": "/r/stocks/comments/jmjnqp/rstocks_daily_discussion_monday_nov_02_2020/gayn1ym/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604397448.0
    },
    {
        "author": "TFWPKY360",
        "body": "The integration of Xilinx will hurt results in the upcoming quarters after acquisition is closed since it is not immediately accretive to AMD's bottom line since Xilinx would need to double its profits to not be dilutive. It could work out in the end giving AMD a foothold in FPGAs and 5G but this is a long term play &amp; personally I think most of the momentum will be sucked out of AMD until it is proven that the Xilinx merger was accretive. Bolt on acquisitions are usually what drives stock prices higher short term.\n\nPersonally, I would wait but if you think its a steal at $75 go for it but I see a growth company adding a non-growth company in a field that they are not proficient in. I still remember the ATA acquisition by AMD and that was a disaster.",
        "created_utc": 1604409348,
        "id": "gb01xox",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb01xox/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604438148.0
    },
    {
        "author": "ahsan_shah",
        "body": "Reading the comments it looks like bears have taken control. LOL. Oh boy they were wrong when SP was at $2 and they are still wrong when SP is around $75. Remember due to Intel process woes they will continue to lag behind certainly till 2023. AMD has 10% of data center market share and around 20% in desktop and we are no way near to saturation. AMD will continue to market share at Intel expense.\n\nComing to GPUs. LOL what can I say? It just took one attempt to match or surpass NVIDIA and people were very pessimistic about GPU prospects. AMD has &lt;10% of dedicated laptop market and around 25-30% of desktop market. Coming to data center (growing rapidly) I think its fair to say its below 5% if you compare against NVIDIA. \n\nNVIDIA is going to feel the pain now. Jensen is already sweating in his leather jackets. News of NVIDIA testing and cancelling of various Ampere SKUs is all over Twitter. First 3080 20GB, then 3070 16GB then 3070Ti. NVIDIA is poised to lose big chunk of market share especially in the notebook market as Ampere perf/watt is worse than RDNA2 and with superior efficiency of Ryzen 4000 and upcoming 5000 APU, AMD Ryzen+Radeon combo will sell like hot cakes in comparison to power hog Intel Skylake and Ampere.\n\nComing to Xilinx deal, shorts have no clue. If the deal closes, AMD will become a computing powerhouse with presence in 5G, automotive, AI, IOT, networking. Coming to dilution as they always bring, this dilution will bring $3b in annual revenue and $1b in profit\n\nPessimistic can sale and shorts can short. AMD has long term growth prospects. Long AMD since 2016",
        "created_utc": 1604410106,
        "id": "gb0339p",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb0339p/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604438906.0
    },
    {
        "author": "tim48134",
        "body": "&gt;American's once again tell the coastal elites who control the media that they don't pick the president. The people do. \n\nI mean, I agree that middle America is overlooked. But you're clearly implying that coastal elites are are bad, and you seem happy that Trump won. So assuming you were a Trump supporter, I was pointing out that Trump himself is both coastal and elite to point out the hypocrisy...\n\nBut ya know what, fuck this, I'm drunk. AMD stock: post election drama, think it'll go up with the GPU and console launch? Or will the Xilinx stuff continue to drag on it? Not actually sure how the merger works, lol. I'm recently in for 1/21 85c and wanna know how retarded I am",
        "created_utc": 1604465490,
        "id": "gb31zpn",
        "permalink": "/r/wallstreetbets/comments/jnllmp/perielection_election_discussion_thread/gb31zpn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604494290.0
    },
    {
        "author": "lambda-man",
        "body": "FACT: Set the ratio too low and Xilinx won't agree to the terms.\n\nRETORT: In order to get Xilinx to agree to be aquired they wanted $143 per share of value for customers. The ratio was set to achieve that number. Any lower ratio and the deal would have fallen through.\n\nRetort count = 1",
        "created_utc": 1604524293,
        "id": "gb5osa9",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb5osa9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604553093.0
    },
    {
        "author": "lambda-man",
        "body": "The number 1.72 was agreed upon by people internal to AMD &amp; Xilinx and announced in a press release. The market reacted to that release of information. There are no external variables here.",
        "created_utc": 1604530461,
        "id": "gb61lgo",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb61lgo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604559261.0
    },
    {
        "author": "robmafia",
        "body": "*facepalm*\n\nway to evade all the actual data.  ie: math.\n\nie:  valuation of $25B then becomes $35B but the tether was based on 10/8.\n\nanalysts upgraded amd to $120... but then (after the deal) downgraded xlnx to $130. (ie:  not ~200)\n\nthe math does not add up.  this is off by such an absurd margin.  far beyond arbitrage.\n\nyou also omit amd going from 88 to 74 on the rumour/news, despite their best er in history and 2 other major catalysts.\n\nkick rocks",
        "created_utc": 1604504384,
        "id": "gb4iaf2",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb4iaf2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604533184.0
    },
    {
        "author": "Coat_Dry",
        "body": "The chart isn't just an arbitrary line. AMD+Xilinx is not the same as AMD stocks plus Xilinx stocks.\n\n&amp;#x200B;\n\nIntel bought Altera for a reason, FGPAs are the hot 16 year old high school sophomore that's going to wreck a lot of homes once they've matured. AMD+Xilinx=Intel and Nvidia killer.\n\n&amp;#x200B;\n\nIn this situation Intel is a 50 year old ex bodybuilder that wanted some eye candy, but the steroids ruined their sex drive and now all they have are fading memories and sagging bitch tits. They barely avoid jail time after picking up a 14 year old at the mall.\n\n&amp;#x200B;\n\nNvidia is a small asian man in a leather jacket that picked up a cheap hooker in Vegas (ARM) because they think that's what you're supposed to do when you're rich and powerful. They don't tell their wife because they don't want to admit they spent 4 hours watching softcore porn on cable before she took his money and left.",
        "created_utc": 1604455536,
        "id": "gb2kl81",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb2kl81/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604484336.0
    },
    {
        "author": "K1nd0fab1gdeal",
        "body": "Great picks! AMD is only going higher, they got 3 analyst upgrades in 2 days and price targets moved to 96-100 bucks or another 15% upside. They absolutely murdered earnings and the only reason they tanked last month was investor fears of share price dilution due to the xilinx deal. XLNX immediately adds benefit to the company overall and diversified them into new sectors. Big big things to come",
        "created_utc": 1604716585,
        "id": "gbeyfm1",
        "permalink": "/r/wallstreetbets/comments/jpcd33/weekend_discussion_thread_for_the_weekend_of/gbeyfm1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604745385.0
    },
    {
        "author": "xXShadowHawkXx",
        "body": "Consider XLNX, each share of XLNX will convert to 1.7 shares of AMD by end of 2021 so essentially right now  its like buying discounted AMD stock",
        "created_utc": 1605146407,
        "id": "gbzwyab",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/gbzwyab/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605175207.0
    },
    {
        "author": "Galinda20018",
        "body": "After sue bae dilutes 35 billion worth to buy xilinx",
        "created_utc": 1605182262,
        "id": "gc1cj5b",
        "permalink": "/r/wallstreetbets/comments/jssu2g/daily_discussion_thread_for_november_12_2020/gc1cj5b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605211062.0
    },
    {
        "author": "Boomtown626",
        "body": "Agreed, and the XLNX purchase that goes through at the end of next year will be huge for them. When I bought, it was with a commitment to hold thru mid-2022, to get a couple quarters with post-XLNX merger earnings in. If I'm not close to doubling my money at that point, I'll be floored.",
        "created_utc": 1605200528,
        "id": "gc27w79",
        "permalink": "/r/stocks/comments/jsqwiy/rstocks_daily_discussion_options_trading_thursday/gc27w79/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605229328.0
    },
    {
        "author": "Boomtown626",
        "body": "I'm nervous about rotations out of tech and chip makers as more vaccine news piles in between now and the end of the year. But I'm holding AMD for sure and being prepared to buy dips as they come. Hold until mid-2022, when they've had a couple of earnings reports after the XLNX merger completes. I have a feeling that if it hasn't doubled by then, it'll be close.",
        "created_utc": 1605131436,
        "id": "gbz4f06",
        "permalink": "/r/stocks/comments/js47xm/rstocks_daily_discussion_wednesday_nov_11_2020/gbz4f06/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605160236.0
    },
    {
        "author": "hanz3n",
        "body": "At least in my field, Xilinx is the FPGA vendor. I’ve never used Altera and don’t really know anyone that does.",
        "created_utc": 1605542658,
        "id": "gci7pe5",
        "permalink": "/r/stocks/comments/jv1hah/amd_vs_nvidia/gci7pe5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605571458.0
    },
    {
        "author": "ArtanisHero",
        "body": "Yes. The price is fixed. So the whole point is that selling shareholders at XLNX know exactly what they are receiving in AMD shares. There is no way for XLNX shares to drop to $50, because market participants (aka merger arb shops) would buy XLNX shares since it would be “free” money",
        "created_utc": 1605592579,
        "id": "gcl2pzf",
        "permalink": "/r/wallstreetbets/comments/jvjybm/million_dollar_question_who_will_tsla_replace_on/gcl2pzf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605621379.0
    },
    {
        "author": "xXShadowHawkXx",
        "body": "Better play is to buy XLNX, 1 share of XLNX will convert to 1.72 shares of AMD so you’ll essentially be purchasing discount AMD stock",
        "created_utc": 1605385104,
        "id": "gca9dn2",
        "permalink": "/r/stocks/comments/ju1vb4/nvidias_big_change_is_about_to_flip_back_around/gca9dn2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605413904.0
    },
    {
        "author": "xXShadowHawkXx",
        "body": "Yeah thats the only risk, if the merger falls apart XLNX will probably take a big hit but as it stands now buying into XLNX now to get AMD is still a huge bargain",
        "created_utc": 1605388674,
        "id": "gcagz2k",
        "permalink": "/r/stocks/comments/ju1vb4/nvidias_big_change_is_about_to_flip_back_around/gcagz2k/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605417474.0
    },
    {
        "author": "iDreamMatin",
        "body": "I agree. I may have to add some XLNX after selling the calls then.",
        "created_utc": 1605390020,
        "id": "gcajx1d",
        "permalink": "/r/stocks/comments/ju1vb4/nvidias_big_change_is_about_to_flip_back_around/gcajx1d/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605418820.0
    },
    {
        "author": "iwannahitthelotto",
        "body": "Intel is still in serious trouble. Amd has superior cpu, gpu ip, and now Xilinx. Apple just opened the flood gates of high performance arm laptops. All pc companies and phone companies follow Apple tech transitions.",
        "created_utc": 1605413025,
        "id": "gcc40u0",
        "permalink": "/r/SecurityAnalysis/comments/ju7tdx/intels_disruption_is_now_complete/gcc40u0/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1605441825.0
    },
    {
        "author": "bobthedestroyers",
        "body": "AMD won't hit 88 unless tech bubble expands again.... AMD's value is less with Xilinx.",
        "created_utc": 1605050139,
        "id": "gbvoirc",
        "permalink": "/r/wallstreetbets/comments/jrsf0h/what_are_your_moves_tomorrow_november_11_2020/gbvoirc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605078939.0
    },
    {
        "author": "ceskanda",
        "body": "AMD went down bc of dilution from the XLNX acquisition announcement",
        "created_utc": 1604287285,
        "id": "gav20dz",
        "permalink": "/r/wallstreetbets/comments/jlrft5/earnings_for_the_week_of_november_2/gav20dz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604316085.0
    },
    {
        "author": "rxpillme",
        "body": "Yeah Xlnx will be bought at 35 bil valuation. Every Xlnx share get 1.7 shares of AMD",
        "created_utc": 1604337180,
        "id": "gawwe0a",
        "permalink": "/r/investing/comments/jmqzqr/nasdaq_amd_week_45/gawwe0a/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604365980.0
    },
    {
        "author": "ceskanda",
        "body": "Amd was the best until they announced Xlnx concurrent with the tech dump 😫",
        "created_utc": 1604372111,
        "id": "gaytcm9",
        "permalink": "/r/wallstreetbets/comments/jmv1ax/what_are_your_moves_tomorrow_november_03_2020/gaytcm9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604400911.0
    },
    {
        "author": "no_more_Paw_patrol",
        "body": "short term no idea. long term I like the xilinx deal. \nnot a huge fan of the last 10 days, I would buy more shares if I had cash on hand. I will sit on these puppies for a few years probably. my FDs are currently in dope and renewables playing a biden win.",
        "created_utc": 1604338725,
        "id": "gawzog0",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gawzog0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604367525.0
    },
    {
        "author": "PandaGodFliesToMoon",
        "body": "xlnx nov 20 calls have 63 volume and 2.6k + open interests... any of you know what's going on?",
        "created_utc": 1604248917,
        "id": "gat0avo",
        "permalink": "/r/wallstreetbets/comments/jl45xl/weekend_discussion_thread_for_the_weekend_of/gat0avo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604277717.0
    },
    {
        "author": "ThrowawayAl2018",
        "body": "AMD with Xilinx marriage may or may not work long term (look at Intel with Altera, didn't exactly pan out). The deal won't be finalized till end of next year so lots can change by then.\n\nAs you can hold 9 months, I would wait for a bottom threshold of mid $60's to pick some up, and more on each dip. Learn how to DCA long term as stock prices is quite volatile these days",
        "created_utc": 1604259652,
        "id": "gatlob6",
        "permalink": "/r/stocks/comments/jlzk8q/hold_amd_or_dump_them_on_monday_and_reinvest_into/gatlob6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604288452.0
    },
    {
        "author": "Arrowtotheknee99",
        "body": "I wouldn’t exactly say I’ve seen a lot of hate on AMD lately. The only problem I’ve seen is that they could be acquiring Xilinx at a inflated value. But long term there’s not really much to be concerned about. \nThe share price is a bit weird but the entire market is a bit weird.",
        "created_utc": 1604408897,
        "id": "gb019v4",
        "permalink": "/r/investing/comments/jn9ksc/amd/gb019v4/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604437697.0
    },
    {
        "author": "MrMineHeads",
        "body": "Maybe, but what the market doesn't think so so far. I mean everyone already knows what your posted. Q3, Xilinx, new GPUs; you have to be expecting something that's unexpected, which really doesn't make sense.\n\nPlus, you can't just give one example. That is such a ridiculous practice in this sub. Imagine if I said smoking doesn't cause cancer because my uncle who smoked a pack a day for 40 years died of a car crash.",
        "created_utc": 1604411111,
        "id": "gb04oo1",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb04oo1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604439911.0
    },
    {
        "author": "get_MEAN_yall",
        "body": "I mean it doesn't really matter how I feel about it now. The decision to buy was based on the companies financials, products, competition, etc...   \n\nI bought in before the XLNX acquisition and before Q3 earnings.",
        "created_utc": 1604411484,
        "id": "gb05aro",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb05aro/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604440284.0
    },
    {
        "author": "convolutionx",
        "body": "Doesn't xilinx increase amd TAM though?",
        "created_utc": 1604447503,
        "id": "gb26coq",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb26coq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604476303.0
    },
    {
        "author": "lambda-man",
        "body": "_facepalm_\n\nWay to interpret this like a fast-food transaction. Give me a break.\n\n&gt; ie: valuation of $25B then becomes $35B but the tether was based on 10/8.\n\nThis isn't a Wendy's where you're buying a hamburger for the price on the menu. There's a **stiff** premium to be paid for acquiring a company that wasn't looking to be acquired. Many of those executives will lose their jobs, they need a golden parachute. Shareholders need to be compensated for their loss of control. It's **really** **fucking** **expensive**.\n\n&gt; analysts upgraded amd to $120... but then (after the deal) downgraded xlnx to $130. (ie: not ~200)\n\nAnalysts are a bunch of dum-dums. I don't care about their \"upgrades\" and \"downgrades\" Go look at Enron's \"grade\". Look at Tesla's \"grade\". It's all bullshit.\n\n &gt; the math does not add up. this is off by such an absurd margin. far beyond arbitrage.\n\nYeah, because this wasn't a hamburger at Wendy's and shouldn't be analyzed as if it were.\n\n&gt; you also omit amd going from 88 to 74 on the rumour/news, despite their best er in history and 2 other major catalysts.\n\nAcquiring a company isn't a short term cash grab, it's a long term synergistic value proposition. If you were in AMD for short term gains it made sense to exit. If you were in AMD long term, it's a reason to hold or increase your position. That played out exactly how I expected it would.",
        "created_utc": 1604516785,
        "id": "gb58s3n",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb58s3n/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604545585.0
    },
    {
        "author": "monkeyseal42",
        "body": "30 years might be extreme but I'm planning on at least 4-5 years.  Things change, look at Intel's collapse.  The timing of the Xilinx acquisition hurt the stock's performance after their most recent earnings beat.",
        "created_utc": 1605197016,
        "id": "gc20j23",
        "permalink": "/r/stocks/comments/jsqwiy/rstocks_daily_discussion_options_trading_thursday/gc20j23/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605225816.0
    },
    {
        "author": "karmabiatchwhore",
        "body": "Nope. Around AMd max value. XIlinx is gonna bring it down when merger official.",
        "created_utc": 1605123341,
        "id": "gbyr78x",
        "permalink": "/r/wallstreetbets/comments/js5m7m/daily_discussion_thread_for_november_11_2020/gbyr78x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605152141.0
    },
    {
        "author": "LePootPootJames",
        "body": "Yeah the Xilinx acq will probably pay off next ER I hope. Definitely not in the short term.\n\nPretty sure if I buy puts it will moon the fuck out.",
        "created_utc": 1605125997,
        "id": "gbywkaz",
        "permalink": "/r/wallstreetbets/comments/js5m7m/daily_discussion_thread_for_november_11_2020/gbywkaz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605154797.0
    },
    {
        "author": "itsokayimhandsome",
        "body": "Buy amd, stock is priced lower and they just acquired xilinx.",
        "created_utc": 1605329038,
        "id": "gc85mpk",
        "permalink": "/r/stocks/comments/jtvvom/nvidia_is_dipping_crazy_fast_why_and_should_i_buy/gc85mpk/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605357838.0
    },
    {
        "author": "xXShadowHawkXx",
        "body": "Not sure, with the value of XLNX being added to the company I think any stock price drop would be pretty short lived, i’m not sure if the price target takes the deal into account, but regardless AMD still has significant growth to go, but thats another reason why XLNX is such a steal at current prices",
        "created_utc": 1605389717,
        "id": "gcaj8q8",
        "permalink": "/r/stocks/comments/ju1vb4/nvidias_big_change_is_about_to_flip_back_around/gcaj8q8/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605418517.0
    },
    {
        "author": "karmabiatchwhore",
        "body": "Xilinx makes it impossible.",
        "created_utc": 1605495065,
        "id": "gcgg9pi",
        "permalink": "/r/wallstreetbets/comments/juuqb2/125000_on_amd_1218_90c_last_options_play_of_the/gcgg9pi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605523865.0
    },
    {
        "author": "Boomtown626",
        "body": "If you’re looking for safe and steady, AMD for sure. As long as you’re willing to give it a good 16-20 months. It has the XLNX acquisition to close over that time. If it doesn’t double by then, it’ll be close. \n\nThere are other risk-reward plays that can do much better, but they’re harder to predict.",
        "created_utc": 1605571832,
        "id": "gck361w",
        "permalink": "/r/stocks/comments/jv36al/rstocks_daily_discussion_monday_nov_16_2020/gck361w/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605600632.0
    },
    {
        "author": "Always_Mitochondria",
        "body": "its 100% mooning through earnings, the only reason they didnt go up by 10% this time was because of the xilinx all-stock deal. theyre completely uncontested in retail cpu, their consumer gpu's are actually competitive for once, and the new consoles use amd hardware and epyc   only keeps getting more popular. literally fucking dope ass company",
        "created_utc": 1604915993,
        "id": "gbpfap4",
        "permalink": "/r/wallstreetbets/comments/jqnd7c/free_money_tomorrow_unless_you_hate_yourself_and/gbpfap4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604944793.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  9th of November\n\n\n\n## Upcoming events for Monday, November  9th\n\n - Stock splits:\n\n    - DSE @ **1:10**\n    - WYY @ **1:10**\n\n - Expected earnings:\n\n  ABST, AC, ACB, ACTG, ADES, ADMP, AESE, AGM, AKTX, AL, ALE, ALLK, ALUS, AMBC, APEI, APPF, APTS, APYX, ARCT, ARNA, ASM, ASUR, AT, ATCO, ATCX, ATHX, ATRA, ATXI, AVD, AVDL, BATL, BCOR, BHVN, BIP, BKI, BLRX, BRMK, BTU, BXRX, BYFC, BYND, CARA, CARS, CASI, CCO, CCXI, CEPU, CGC, CLAR, CLPR, CNNE, CNSP, CNXN, CPRX, CRESY, CSTL, CTRA, CVGI, DFFN, DHT, DIOD, EBIX, EBR, EBR.B, EC, ELVT, ELY, EQX, ESTA, EVFM, FBRX, FENG, FF, FLGT, FPAY, FPI, FSK, FSKR, FTK, FTSI, FUNC, GAIA, GECC, GFN, GLT, GOGO, GPMT, GSKY, GSL, GTH, HBB, HCHC, HGBL, HGEN, HIL, HL, HMTV, HPK, HPR, HROW, HT, HWM, HYMC, ICCC, ICCH, ICMB, ICPT, IDEX, IEA, IFF, IHRT, III, IIN, INFI, INO, INUV, IPAR, IRIX, IRS, ITCI, IVR, KIN, KLR, KNDI, KOS, KRYS, LIQT, LIZI, LMNL, LNSR, LUNA, MARA, MBI, MBII, MCD, MCRB, MGNI, MPAA, MRKR, MRNS, MRSN, MTBC, MWA, MWK, MYGN, NATR, NBEV, NBIX, NCLH, NEOS, NGL, NHI, NKLA, NLS, NMRD, NNOX, NOAH, NSCO, NSPR, NSTG, NVAX, NXE, OMER, OPRX, OR, ORGO, OSH, OXBR, OXY, PAM, PDLI, PEIX, PFIE, PGEN, PHUN, PLSE, PLUG, PRCP, PROG, PROS, PRTS, PRTY, PTE, PTMN, PWFL, RAIL, RAMP, RDNT, REAL, REED, REI, REPH, RETA, RMTI, RNA, RNG, RPAY, RUBY, RVMD, RVNC, SAMA, SCOR, SCSC, SCU, SENS, SESN, SIEN, SMTS, SNCR, SND, SNDE, SOHO, SPG, SPNE, SPT, SRT, SSTI, STAY, STRS, STXS, SVC, SWAV, SYNL, TCO, TGNA, TH, TLGT, TLND, TLRY, TPTX, TRVN, TSQ, TTCF, TXMD, TYME, UNIT, URGN, VERI, VRS, VUZI, WATT, WBAI, WES, WHF, WIFI, WKHS, WPM, WPRT, WVE, XERS, XP, XPER, YALA, ZAGG, ZGNX, ZI, ZIXI\n\n - Ex-div:\n\n  AEP, AMSF, AWK, BFIN, CDR, CG, COLB, CSTR, DCF, DEA, DVD, EBTC, FBMS, FCCY, FDP, GABC, GBX, GGB, GHM, HBI, HOMB, IBM, INVH, ISBC, KMT, LARK, LSTR, MCBC, MDC, MKTX, MPB, MPX, MSM, MTG, MWA, NBN, NFBK, OLN, PAG, PCAR, PGC, PPG, PPR, PZZA, RA, RILY, ROL, SASR, SCCO, SFBC, SON, SSSS, SXI, WBK, WBS, WCN, WELL, WETF, WINA, WNEB, WST, WTBA, XLNX\n\n## Upcoming events for Tuesday, November 10th\n\n - Stock splits:\n\n    - SMLP @ **1:15**\n\n - Expected earnings:\n\n  AAME, AAP, ABEO, ADPT, AER, AFMD, AGTC, AIKI, AKRO, ALC, ALEC, ALT, AMK, AMTI, APTO, ARA, ARMP, ASH, ATHM, ATNM, AVEO, AVGR, BBDC, BBQ, BCEL, BDTX, BNTX, BOMN, BOXL, BPT, BRKS, BSY, BWL.A, CAAS, CAE, CELP, CFRX, CHFS, CHMI, CHRA, CHSCP, CLPT, CLRB, CLSD, CLSK, CNR, COCP, COGT, COHR, CPHC, CPIX, CPST, CRBP, CRIS, CRNX, CRSR, CRTX, CRWS, CTIC, CVET, CVV, CWCO, CXDO, CYAN, CYBR, DDOG, DHI, DMS, DMTK, DOX, DQ, DTIL, EGAN, ELMD, ELP, ELSE, EQ, ERJ, EVI, EVOL, EYEN, FAT, FBIO, FENC, FICO, FIXX, FLUX, FONR, FOXF, FPH, FRHC, FTEK, FUBO, FULC, FURY, FUSN, GALT, GBIO, GBLI, GEC, GEVO, GILT, GLOG, GLOP, GMDA, GO, GOSS, GRFS, GSAT, GSH, GTT, HAIN, HCAT, HOTH, HTGM, HTHT, ICON, IFS, IMOS, INSE, INTT, ISR, ITRM, JMIA, KOD, KODK, KRNT, LAC, LGL, LJPC, LOGC, LORL, LPCN, LPRO, LUMO, LUNG, LYFT, MARK, MBIO, MBRX, MCF, MDNA, MDRR, MDWD, MMX, MNDO, MODN, MOGO, MOR, MORF, MVO, MYO, NEON, NES, NEXT, NGM, NHC, NK, NOVT, NRBO, NSYS, NTIC, NTRP, NTWK, OCGN, OCN, OEG, ONCY, ONEM, ONTX, OPRT, PASG, PAYS, PBT, PECK, PFMT, PHIO, PLMR, PLRX, PMD, PNTG, POLA, PRPH, PRPL, PRSP, PRVL, PSTL, RADA, RCEL, RCMT, RDCM, RDVT, RESN, RIOT, RKT, RLGT, RMBL, ROK, RXT, SANM, SAVA, SCPH, SCYX, SHIP, SHSP, SILK, SILV, SJT, SNGX, SNMP, SNSS, SPKE, SRRK, SSKN, SSNT, STAF, STEP, STOK, STSA, SURF, SWTX, SYN, TAT, TCON, TCP, TCRR, TGTX, THCA, TIMB, TME, TRMD, TRQ, TXG, VCNX, VEC, VIE, VIR, VITL, VIV, VNRX, VSTM, VTSI, VXRT, WHLM, WILC, WISA, WMG, WSTG, XBIT, XELA, XGN, ZOM\n\n - Ex-div:\n\n  ACV, AIO, AROC, CBH, COG, DBL, DLY, DSL, EFL, EHT, ETR, EVF, FANG, GILT, GWB, HNNA, HPF, HPI, HPS, HTD, IVZ, KBH, LPLA, MATX, MSA, NCV, NCZ, NTB, OPY, PCI, PCK, PCN, PCQ, PDI, PEAK, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, POOL, PTY, PYN, PZC, RMD, SBUX, SHEN, SIMO, TBNK, VGI, VNOM, WTFC, XOM, ZION, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.765%)\n    - API Weekly Crude Oil Stock (previous: -8.010M)\n    - EIA Short-Term Energy Outlook\n    - FOMC Member Brainard Speaks\n    - IBD/TIPP Economic Optimism (previous: 55.2)\n    - JOLTs Job Openings (consensus: 5.590M, previous: 6.493M)\n    - NFIB Small Business Optimism (consensus: 102.2, previous: 104.0)\n    - Redbook (previous: 1.2%)\n    - Redbook (previous: 3.2%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, November 11th\n\n - Expected earnings:\n\n  ACER, ACIA, ACIU, ACST, ADNT, AGRO, AIRT, ALAC, ALNA, ANVS, APD, APEN, APG, APLT, ARCO, ARDS, ASND, ASTC, ATEX, ATLO, ATO, ATOS, ATTO, AWX, AXAS, BEAM, BEDU, BEST, BFRA, BKTI, BSGM, CARV, CBMG, CBPO, CCF, CCMP, CFBI, CHEK, CIB, CIH, CMCL, CMCM, CNFR, CODX, CVU, CYCC, CYD, CYRN, CZZ, DCTH, DOYU, DSSI, DYAI, EDAP, EDN, EMX, ENOB, ENS, ENSV, EPM, EPSN, ESSA, EVK, EVOL, EXPI, FOSL, FTHM, GGAL, GIB, GLAD, GOCO, GRNQ, GRWG, GSV, HI, HMG, HOLI, HUYA, HYRE, IDXG, IDYA, IGC, IMTX, IMVT, ISIG, ISNS, ITCB, JCTCF, JE, KMDA, KTRA, LINC, LINX, LMND, LND, LPL, LRMR, LYRA, MCEP, MCFT, MFC, MIRM, MIST, MLND, MLVF, MOSY, MUFG, NCNA, NEPT, NLTX, NSEC, NTN, NVEE, NVFY, NVGS, NVUS, NYMX, OFED, OM, ONCY, OPGN, OSW, PANL, PATI, PCOM, PCVX, PDSB, PEBK, PNBK, PRPO, PRQR, PTN, PTVE, PYPD, QLGN, RAVE, RDI, REYN, RHE, RLMD, RPRX, RVLV, SA, SANW, SCPE, SGRP, SIEB, SLGG, SLNO, SLP, SLRX, SMFG, SNDL, SNES, SONM, SPTN, SYNC, TCOM, TELA, TG, TGA, TGC, TRNO, TRT, TRVI, TTEK, USAS, VEL, VERX, VOC, VRCA, VRM, VYGR, WHLR, WTER, WVVI, XAIR, XELB, XPEL, ZYNE\n\n## Upcoming events for Thursday, November 12th\n\n - Stock splits:\n\n    - PDS @ **1:20**\n\n - Expected earnings:\n\n  AACG, AAU, ACHV, ACY, ADCT, ADIL, AEYE, AFIB, AGBA, AGE, AGRX, AHPI, AIHS, AIM, AKER, AKUS, ALTG, ALYA, AMAT, AMTX, AMWL, ANDA, ANY, APTX, AQN, ARL, ASLN, ATLC, AUPH, AVCO, AWH, AXLA, AXU, AYLA, AYTU, AZRX, BAK, BAM, BANX, BBI, BCOW, BHB, BIOC, BIOL, BIOX, BKYI, BLI, BLNK, BLU, BNGO, BRP, BSQR, BTAI, BTN, BW, BXG, BZH, CALT, CANG, CBLI, CBMB, CCNC, CDOR, CELH, CERC, CETX, CHCI, CJJD, CLRO, CLSN, CMPS, CNET, CREX, CRHM, CRTD, CSCO, CSSE, CTEK, CURI, CXDC, CZNC, DARE, DAVA, DDS, DESP, DGII, DGLY, DIS, DLB, DLPN, DRAD, DRIO, DTSS, DYNT, EAST, ECOR, EDRY, EFOI, ENR, EPC, ESP, ETON, EYES, FFBW, FLY, FMTX, FRD, FSEA, FSI, FSM, FTCH, GBR, GDRX, GHSI, GLG, GLMD, GLOB, GNLN, GNPX, GP, GPOR, GRVY, GSMG, GURE, GWGH, HAYN, HEPA, HFFG, HIMX, HJLI, HOOK, HQI, HRMY, HSDT, HSTO, HUSA, HYLN, IBIO, ICL, IFMK, IGIC, IGT, IMAC, IMV, INFU, INMD, INOD, INPX, INTZ, IOR, IPWR, IZEA, JAGX, JAMF, JOBS, JRSH, KB, KBNT, KFFB, KROS, LEDS, LEGH, LIFE, LMB, LMFA, LMPX, LPTX, LSF, LTRX, LWAY, MARPS, MBOT, MDLY, MEG, METX, MFG, MIC, MICT, MOTS, MPLN, MSN, MTOR, MTR, MYOV, MYSZ, NAII, NAK, NARI, NBAC, NBSE, NBY, NETE, NGVC, NICE, NNDM, NTIP, NVMI, NWGI, NYC, OBCI, OBLG, OCX, OGEN, OMEX, OPHC, OPNT, OSMT, OSS, PCSA, PDD, PFIN, PHAS, PHGE, PIH, PLAG, PLTR, PRT, PRTH, PXS, QRHC, RBCN, RDHL, REDU, REKR, RELV, RMED, RPTX, RSSS, RVP, SACH, SALM, SB, SBH, SBS, SCX, SDGR, SELF, SFT, SGBX, SHI, SINA, SJ, SLGL, SLS, SMTI, SNBP, SNCA, SNFCA, SNOA, SOLY, SONN, SPH, SRAX, SSRM, SSY, SSYS, STON, SUMR, SUNW, SVT, SWIR, SYPR, TAIT, TARA, TCDA, TCI, TDG, TENX, TGH, TGP, THMO, THRY, TIG, TK, TKAT, TKC, TMDI, TNK, TR, TRIL, TSEM, TTNP, TUFN, TYHT, U, UAMY, UAVS, UBOH, UFAB, UNAM, UONE, UONEK, USEG, USIO, VBFC, VEDL, VERB, VERY, VET, VISL, VIVE, VJET, VRME, WB, WF, WINT, WIX, WORX, WTT, XNET, XPEV, XSPA, YRD, YTEN, ZEAL, ZNTL, ZSAN\n\n - Ex-div:\n\n  ABST, ADS, AHC, ARCB, ASTE, AUB, AVK, BFST, BPRN, BRKL, BSET, BSM, BWFG, CCD, CGNX, CGO, CHI, CHW, CLCT, CPZ, CSQ, CTVA, CVCY, CVGW, CWBC, DUK, EBMT, EMR, ENB, EQNR, EVA, FCFS, FMO, FNWB, GBAB, GCBC, GDV, GGM, GHY, GLW, GNT, GOF, GRC, GSK, GUT, HON, HP, HTLF, IHIT, ISD, IVH, JBGS, JCO, JEF, JEMD, JFR, JGH, JHAA, JHB, JLS, JOE, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LAD, LGI, LLY, LPX, MMS, MSCI, MSEX, MSVB, MUSA, NAC, NAD, NAN, NBB, NCB, NDMO, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NYV, NZF, OBNK, ODC, OMP, OPP, OTTR, OXLC, OXSQ, PCSB, PFC, PFS, PGZ, RDS.A, RDS.B, RFM, RGR, RIV, RMI, RMM, RSF, RTX, SAL, SALT, SCHW, SHBI, SHW, SIGI, SJM, SJR, SMBC, SSB, SSBI, TAIT, TCF, TFC, TFX, TSBK, UPS, USA, V, VBF, VTA, VVR, WAB, WAL, WD, WEC, WRK, WTRG, XEC\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.578%)\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.085%)\n    - CPI (consensus: 0.2%, previous: 0.2%)\n    - CPI (consensus: 1.3%, previous: 1.4%)\n    - CPI Index, n.s.a. (consensus: 260.59, previous: 260.28)\n    - CPI Index, s.a (previous: 260.21)\n    - CPI, n.s.a (previous: 0.14%)\n    - Chicago Fed President Evans Speaks\n    - Cleveland CPI (previous: 0.1%)\n    - Continuing Jobless Claims (consensus: 7,200K, previous: 7,285K)\n    - Core CPI (consensus: 0.2%, previous: 0.2%)\n    - Core CPI (consensus: 1.7%, previous: 1.7%)\n    - Core CPI Index (previous: 269.26)\n    - Crude Oil Imports (previous: 0.560M)\n    - Crude Oil Inventories (previous: -7.998M)\n    - Cushing Crude Oil Inventories (previous: 0.936M)\n    - Distillate Fuel Production (previous: 0.149M)\n    - EIA Refinery Crude Runs  (previous: 0.164M)\n    - EIA Weekly Distillates Stocks (previous: -1.585M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.4%, previous: 0.7%)\n    - FOMC Member Williams Speaks\n    - Federal Budget Balance (consensus: -124.0B, previous: -125.0B)\n    - Gasoline Inventories (consensus: -0.871M, previous: 1.541M)\n    - Gasoline Production (previous: -0.023M)\n    - Heating Oil Stockpiles (previous: -0.395M)\n    - IEA Monthly Report\n    - Initial Jobless Claims (consensus: 738K, previous: 751K)\n    - Jobless Claims 4-Week Avg. (previous: 787.00K)\n    - Real Earnings (previous: 0.2%)\n\n^^^^2020-11-09",
        "created_utc": 1604919625,
        "id": "gbpii9c",
        "permalink": "/r/RobinHood/comments/jqvmzt/daily_discussion_thread_november_9th_2020/gbpii9c/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1604948425.0
    },
    {
        "author": "TheEnd187",
        "body": "I remember a week ago Xilinx said AMD wasn't buying them.  Don't trust anyone.",
        "created_utc": 1604245039,
        "id": "gast998",
        "permalink": "/r/wallstreetbets/comments/jlwv11/psth_dd_on_my_24m_bet_11_downside_now_huge_upside/gast998/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604273839.0
    },
    {
        "author": "deah12",
        "body": "Not buying AMD when I can buy XLNX and end up with AMD shares at a better price.",
        "created_utc": 1604284795,
        "id": "gauxry7",
        "permalink": "/r/wallstreetbets/comments/jli0x0/amd_is_an_absolute_steal_at_75/gauxry7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604313595.0
    },
    {
        "author": "gainbabygain",
        "body": "But is it good or bad overall? What about the seller side? Are people selling because it's a distressed company or is it a healthy merger like amd &amp; xilinx\n\nEither way, it's going to be one of those too big to fail. Less competition and the consumer get fucked.",
        "created_utc": 1604496711,
        "id": "gb443gt",
        "permalink": "/r/wallstreetbets/comments/jnsglz/ma_bankers_we_never_been_this_busy_the_overall/gb443gt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604525511.0
    },
    {
        "author": "robmafia",
        "body": "...wow.\n\nyou talk all that shit, retort nothing, crammed feet in your mouth, and actually now pretend that the xlnx deal didn't create a massive mathematical problem for amd holders.  and you somehow STILL don't even know what i'm talking about, despite doing everything but literally spelling it out for you.\n\n&gt;What really amazes me is how people can be so wrong while also being so sure they're right\n\nthis level of hypocrisy is truly impressive.  not even self-aware...",
        "created_utc": 1604526899,
        "id": "gb5uboi",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb5uboi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604555699.0
    },
    {
        "author": "ShaidarHaran2",
        "body": "If AMD is a steal at 75 dollars, I wonder, why not pick up Xilinx stock to be converted at 1.7 AMD stocks per share?",
        "created_utc": 1604439639,
        "id": "gb1r06x",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb1r06x/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604468439.0
    },
    {
        "author": "robmafia",
        "body": "&gt; The chart isn't just an arbitrary line. AMD+Xilinx is not the same as AMD stocks plus Xilinx stocks.\n\n\ni never said it was.\n\ni said xlnx is no growth.  because they are.  hence, their lack of growth in their financials and chart being dead until the rumour broke.\n\nyou omit the issues with the overpayment and worse, the 1.72 tether (and subsequent dilution).\n\nthere's a reason why amd's sp went from 88 down to 74, amidst the best ER they've ever had (with beats on eps, rev, and guidance) and 2 major catalysts (zen3 and big navi).  without the xlnx deal, it would have rocketed to 100 and probably beyond.",
        "created_utc": 1604455660,
        "id": "gb2ksz2",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb2ksz2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604484460.0
    },
    {
        "author": "frankalliance",
        "body": "Question: how does the AMD acquisition of Xilinx affect Xilinx investors? They were on my watch list a few months back.",
        "created_utc": 1604336611,
        "id": "gawv6ex",
        "permalink": "/r/investing/comments/jmqzqr/nasdaq_amd_week_45/gawv6ex/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604365411.0
    },
    {
        "author": "rxpillme",
        "body": "Yeah for Xlnx investors",
        "created_utc": 1604337323,
        "id": "gawwot6",
        "permalink": "/r/investing/comments/jmqzqr/nasdaq_amd_week_45/gawwot6/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604366123.0
    },
    {
        "author": "maxkingusa",
        "body": "The Xlnx deal is AMD.  Did you mean Mellanox or ARM?",
        "created_utc": 1604339218,
        "id": "gax0qhp",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gax0qhp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604368018.0
    },
    {
        "author": "TryingToBeUnabrasive",
        "body": "Xilinx acquisition. Top comment about tech bull run is accurate but the fact that it’s flat and not declining after an a zero-debt acquisition announcement actually *is* a sign that the company is doing well.\n\nLong term this company is gold. Just chill and be patient.",
        "created_utc": 1604333411,
        "id": "gawoend",
        "permalink": "/r/stocks/comments/jmphoa/why_is_amd_so_flat/gawoend/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604362211.0
    },
    {
        "author": "xXShadowHawkXx",
        "body": "I would buy XLNX, when the deal goes through each XLNX share will convert to 1.7 AMD shares, while when the conversion happens the AMD share value will be diluted, you still stand to make a tidy profit if the prices even stay where there at right now",
        "created_utc": 1605141692,
        "id": "gbznj9u",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/gbznj9u/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605170492.0
    },
    {
        "author": "xXShadowHawkXx",
        "body": "I’d invest in XLNX if you want more AMD on the cheap",
        "created_utc": 1605147468,
        "id": "gbzysjh",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/gbzysjh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605176268.0
    },
    {
        "author": "karmabiatchwhore",
        "body": "Not possible. Xilinx aqisition make it worth less. I see pullback tomorrow.",
        "created_utc": 1605125470,
        "id": "gbyvi5c",
        "permalink": "/r/wallstreetbets/comments/js5m7m/daily_discussion_thread_for_november_11_2020/gbyvi5c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605154270.0
    },
    {
        "author": "xXShadowHawkXx",
        "body": "Its a steal at its current price, keep in mind AMD shares will lose some value due to share dilution when it goes through but if you’re in it for the long haul its not that big of a deal, I really like AMD so i’m buying into XLNX heavy to get better value for my money \n\n“Under the deal, Xilinx shareholders will receive about 1.7 shares of AMD common stock for each share of Xilinx common stock, valuing Xilinx at $143 per share, or about 24.8% higher than its $114.55 closing price on Oct. 26”\n\nhttps://www.google.com/amp/s/www.cnbc.com/amp/2020/10/27/amd-to-buy-chip-peer-xilinx-for-35-billion-in-data-center-push.html",
        "created_utc": 1605388558,
        "id": "gcagq8l",
        "permalink": "/r/stocks/comments/ju1vb4/nvidias_big_change_is_about_to_flip_back_around/gcagq8l/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605417358.0
    },
    {
        "author": "gamefixated",
        "body": "I'm on board.  Mostly a 2 quarter blip.  Intel 10nm has higher transistor density than TSMC 7nm that AMD uses.  Get 10nm fixed in Q1 and all will be rosy.\nARM is the much bigger threat to both intel and AMD.  Getting rid of x86 bloat means faster more power efficient processors for all platforms.\nI trust intel diversification into other market segments with their much lager cash flow.  AMD is just starting to follow intel with xilinx acquisition.",
        "created_utc": 1605051859,
        "id": "gbvrr5c",
        "permalink": "/r/wallstreetbets/comments/jrous4/buy_intc_calls/gbvrr5c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605080659.0
    },
    {
        "author": "Invisofupa",
        "body": "Heyo, 21 year old college engineering student. After saving up from several internships I decided to invest part of it about a month and a half ago.\n\nStock(Percent Equity):\n\n**Tech/Industrial:**\nTSLA(13.3%)\nTXN(3.3%)\nGE(5.0%)\nJNJ(5.0%)\nAMD(7.2%)\nMTZ(4.8%)\nHON(3.3%)\nABB(0.9%)\nPG(1.7%)\nXLNX(3.3%)\nARKK(2.2%)\n\n**Travel:**\nDAL(3.3%)\nUAL(1.7%)\nLUV(1.7%)\nSAVE(1.67%)\nRCL(2.5%)\nBA(5.47%)\n\n**Renewables:**\nVWDRY(1.8%)\n\n**Gaming:**\nPENN(1.7%)\n\n**Defense:**\nRTX(3.87%)\nLHX(3.3%)\nLMT(2.4%)\nNOC(2.5%)\n\n**Software:**\nADSK(3.3%)\nSPOT(1.7%)\nCDNS(2.5%)\n\n**Medical:**\nMRNA(2.3%)\nDGX(1.7%)\nARKG(3.3%)\n\n**Cash:**\nCASH(3.7%)\n\nI was told to invest in what I know so that's exactly what I did and I've seen positive results so far but I feel like I could make my portfolio a bit more efficient and/or diverse. Any criticism is appreciated, thanks!",
        "created_utc": 1604847591,
        "id": "gbm7l6r",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/gbm7l6r/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604876391.0
    },
    {
        "author": "tinderadventurees",
        "body": "getting removed from S&amp;P usually tanks a stock decently hard. People are trying to figure out which stock will get removed to make space for tsla so they can short it and make $$$$$$$.\n\n\nedit:just realized you're op. what im saying is that XLNX is getting bought out by amd and its in the S&amp;P. that might not happen in time for when tesla enters tho.",
        "created_utc": 1605600787,
        "id": "gclc3i4",
        "permalink": "/r/wallstreetbets/comments/jvf737/what_are_your_moves_tomorrow_november_17_2020/gclc3i4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605629587.0
    },
    {
        "author": "Boomtown626",
        "body": "Same. I also had XLNX heading into the announcement, so after getting the bump from them, I liquidated and got into AMD instead. I have good feeling about how that will all play out in the end.",
        "created_utc": 1604330070,
        "id": "gawhn5n",
        "permalink": "/r/stocks/comments/jmjnqp/rstocks_daily_discussion_monday_nov_02_2020/gawhn5n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604358870.0
    },
    {
        "author": "bobthedestroyers",
        "body": "High P/E momentum stock + stock dilution with the overvalued Xilinx deal makes it temporarily worth less.",
        "created_utc": 1604332552,
        "id": "gawmnaq",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gawmnaq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604361352.0
    },
    {
        "author": "4OFourUnknown",
        "body": "The stock was doing well. Then the rumors about purchasing Xilinx came out and investors were mixed. Great earnings were shadowed by confirmation about the $35 billion all stock purchase and again, people were divided. People either sold on the good earnings or on the Xilinx deal. AMD seems to stays pretty flat on good news, but then just one day down the road, it takes off. It’s a wild ride, but YTD, it’s doing really well",
        "created_utc": 1604331467,
        "id": "gawkf05",
        "permalink": "/r/stocks/comments/jmphoa/why_is_amd_so_flat/gawkf05/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604360267.0
    },
    {
        "author": "DividendWin",
        "body": "&gt;When something like snap or zoom happens and you happen to be on the winning side of that ... it’s luck.\n\nI've been doing this for a little longer than this year and nothing I've said doesn't apply to other years. M&amp;A plays and such are all the same every year with the same results and rewards and sometimes even greater ones.\n\nI called Zoom 3 months before it happened based entirely on the Corona Virus Pandemic and it's use in my workplace going up ridiculous amounts. It wasn't luck. In fact that's the problem here; Zoom was not luck. The uncertainty didn't lie in whether it was being used but instead by how much it would profit from it's use during the pandemic. Apparently everyone was blown away with massive increase in value because in this environment it really is just that useful. \n\nThe part I am trying to get across is that it isn't luck at all. At least not in this case. If something has a strong correlation with the SP500 for instance and that is tanking it is very unlikely that any news is going to outrun the beta on the stock so it isn't really as shocking as it might seem that earnings in the past week, even on things we already knew would go up from a comparative view, were still not producing strong calls or positive prices. They simply fell with the market as a whole at the time. The same had to be true of the things that fell with their earnings in Feb / Mar into April. \n\n&gt;It is a relatively new phenom with know real rhyme or reason behind it.\n\nThis is not new. You can go back to any bubble, any bust and any memetic behavior and see the same thing over and over. This is incredibly profitable hence all the sentiment concepts and scraping of forums and such; the data is profitable for certain. If it were new and no one knew what was happening there'd be no money in it.\n\n&gt;You could argue that currently,the possibility of newbie traders stumbling upon massive gains from meme stock culture is elevated .. Id argue that the probability is still low.\n\nYou don't \"stumble\" across companies you know. That's my point. No one \"stumbles across\" Snapchat. We all know what Snapchat is. You \"stumble across\" Regeneron. You \"stumble across\" Xilinx. You don't stumble across AMD.\n\n&gt;Is it possible to hit a 5k lotto ticket .. sure But in all probability it will be a while before you have a trade that successful.\n\nAgain this strongly depends on what your cost basis is. To get a trade that hits 5k from 2.5k is ... actually really common. Very. It was before this. It will be after. It even happens on just the stocks and not even the derivatives; a lot of people think that these market moves are rare but they aren't, and instead, they are heavily spaced out and complex to track so making 100% across 9 months in a year isn't what anyone is looking for but that is exactly how it tends to work out.\n\nI personally think that your first 20k is the hardest because it's easy to get the 1 that takes you to even 10k buy 20+ in one go is very rare so you do have to actually string together trades and that lowers the probability of success substantially. This is especially true because capital sensitivity worsens as you get wealthier; the same amount of money you need to achieve a return is not the absolute value of a cashflow anymore so when you worked at Wendy's (whose earnings are this week ;) ) your making 30k was huge but if you work at your own firm or a bank or something like that your making 30k is sometimes a pittance.\n\n&gt;I think it’s dangerous to spread a narrative that suggests Snap like plays happen so consistently that all you have to do is be familiar with these types of cult companies to secure large profits.\n\nI cannot stress enough that this stuff happens all the time. It is so common in fact that there is no one talking about it. I mean the Fastly puts thing with a 392x value? *That* is rare. From 2 ~ 18 based on the contract within a year is not astronomically rare because remember it's all leverage so the bet itself doesn't move linearly like the base might presuming the basis isn't an option itself. Heh. Options on options are freaking crazy.",
        "created_utc": 1604258809,
        "id": "gatjy5p",
        "permalink": "/r/wallstreetbets/comments/jm5cvm/your_first_5k_win/gatjy5p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604287609.0
    },
    {
        "author": "stonk_street",
        "body": "yeah, also AMD all stock purchase of XLNX is a huge L to stockholders.",
        "created_utc": 1604349458,
        "id": "gaxmec5",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gaxmec5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604378258.0
    },
    {
        "author": "stonk_street",
        "body": "AMD stock buy of XLNX is a huge L. Apple moving to ARM is also a big L to them as more companies will switch from x86.",
        "created_utc": 1604352095,
        "id": "gaxrvqr",
        "permalink": "/r/wallstreetbets/comments/jmv1ax/what_are_your_moves_tomorrow_november_03_2020/gaxrvqr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604380895.0
    },
    {
        "author": "robmafia",
        "body": "yes.  but you seemed to miss the points spectacularly.\n\namd is high growth\nxlnx is no growth\n\namd is overpaying out the ass\n\nie: the shareholders are paying out the ass to be shackled to a company with no growth.  they're tying a golden anvil to their rocketship.",
        "created_utc": 1604447725,
        "id": "gb26rdi",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb26rdi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604476525.0
    },
    {
        "author": "convolutionx",
        "body": "Why is Xilinx viewed as a no growth company? Won't the acquisition allow AMD to enter new markets and continue to grow?",
        "created_utc": 1604447791,
        "id": "gb26voy",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb26voy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604476591.0
    },
    {
        "author": "robmafia",
        "body": "yeah, because their growth is constrained by the xlnx anchor they're tied to.",
        "created_utc": 1604443700,
        "id": "gb1z6z7",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb1z6z7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604472500.0
    },
    {
        "author": "rankiba",
        "body": "AMD paid 35 b to Xilinx, NVDA paid 40b for ARM is a better deal no?",
        "created_utc": 1604376769,
        "id": "gaz1b15",
        "permalink": "/r/wallstreetbets/comments/jmv1ax/what_are_your_moves_tomorrow_november_03_2020/gaz1b15/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604405569.0
    },
    {
        "author": "robmafia",
        "body": "&gt; I never said anything about safe, meager plays\n\ndude.  the xlnx deal won't close until the end of 2021.  amd's tethered to it until then.  you talked shit on short-term plays.  (on wsb!)\n\nyou fallacied/hyperboled/shit metaphored about mcwendy's.\n\nyou haven't actually retorted a single thing i said.\n\nffs, you don't even seem to comprehend why i keep mentioning a 1.72 multiplier, which is the crux of my entire argument.  you haven't even addressed it. \n\nyou just sperg'd out idiocy and fallacies without comprehending that there's a broken math equation at the heart of this.\n\nfucking retard.\n\n&gt;Your \"refutation\" amounts to \"AMD paid more than the market rate for the acquisition\"\n\nno.  $30B would have been more.  $35B was even more.  $35B while tied to a 1.72 conversion rate is INSANELY more.\n\nhence, amd's stock crashing from 88 instead of mooning off the ER/zen3/big navi.\n\nhurr durr",
        "created_utc": 1604523533,
        "id": "gb5n6fb",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb5n6fb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604552333.0
    },
    {
        "author": "Boomtown626",
        "body": "If you buy AMD, commit to holding until mid-2022 - long enough for the XLNX merger to go through and for a couple quarters of performance to come in. Make your purchase, or spread it out over the course of a day or five, and then forget it. I believe you’ll be quite happy in 19 months.",
        "created_utc": 1604710742,
        "id": "gbeod73",
        "permalink": "/r/stocks/comments/jp1aqg/rstocks_daily_discussion_fundamentals_friday_nov/gbeod73/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604739542.0
    },
    {
        "author": "lambda-man",
        "body": "Your logic here boils down to \"xilinx was a mistake, I know better than AMD's leadership what is best for their company\".\n\nNot saying you're wrong, but I would like to know why adding a no-growth company to a growth company to make a hybrid is a negative.",
        "created_utc": 1604501667,
        "id": "gb4culu",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb4culu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604530467.0
    },
    {
        "author": "lambda-man",
        "body": "I never said anything about safe, meager plays. I asked why you thought you knew better than AMD and Xilinx leadership what should have been paid for the merger. You've successfully shown that you don't understand how M&amp;A works. Your \"refutation\" amounts to \"AMD paid more than the market rate for the acquisition\". Of course they did, that's how it works. You can't acquire a company by paying an amount of money equal to their current market cap.\n\nArguing like a prick? No I was trying to understand your point. I gave up on that with my last post. Now I'm insulting you.",
        "created_utc": 1604523274,
        "id": "gb5mmch",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb5mmch/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604552074.0
    },
    {
        "author": "robmafia",
        "body": "???\n\namd did purchase them.  at a bad price.  at an awful conversion rate.  at the stock's expense.\n\n($35B based on 10/8 valuation, xlnx shares will convert to amd shares at a rate of 1:1.72)\n\ngreat deal for xlnx shareholders/autists with calls.  \n\nawful assraping for amd share/callholders",
        "created_utc": 1604440456,
        "id": "gb1sq1b",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb1sq1b/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604469256.0
    },
    {
        "author": "BoardButcherer",
        "body": "xilinx buyout bullish as fuck. Intel's over there in the corner selling off fabs and industry arms, AMD is buying big players.",
        "created_utc": 1604345452,
        "id": "gaxe067",
        "permalink": "/r/wallstreetbets/comments/jmto48/dear_amazon/gaxe067/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604374252.0
    },
    {
        "author": "Boomtown626",
        "body": "Tech is facing some headwinds right now in terms of the broader market reevaluating the increased valuations this year, and AMD's recent purchase of XLNX diluted the shares a bit. I hadn't planned on getting in originally, but those two things together I think have amplified this dip a bit, and the XLNX purchase is a long-term win for sure. \n\nIf you can stomach the idea that it could be down 5 or 7 percent six weeks from now (no specific reason to say that, just acknowledging the possibility), and your response to that would be to buy a little more if it happens, then yeah, I think AMD has some solid long-term potential. Just make sure that you plan on sticking around until the XLNX purchase goes through (end of 2021), plus a few more months. That will be the way to maximize your value, assuming the timeline and risk profile fit your investment strategy.",
        "created_utc": 1604428739,
        "id": "gb1423y",
        "permalink": "/r/stocks/comments/jn6j76/rstocks_daily_discussion_technicals_tuesday_nov/gb1423y/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604457539.0
    },
    {
        "author": "Charlietango2007",
        "body": "Well, after running around the house screaming like a mad idiot for hours on and pulling out my hair thinking about going out in the front yard dousing myself with gasoline and lighting my self on fire.\nI've come to the sad realization that Nokia is just a business they're doing a lot of incredible things you think it would hit the stock price through the roof or to the Moon as they say. But they're also spending a hell of a lot of money to get all this other crap done. I have January calls it'll probably expire worthless. I've come to accept that unless Microsoft or the government or somebody buys a company which unfortunately is not for sale. But then again everything has its price. Including me because I've been giving $5 blow jobs behind the Wendy's dumpster near my house just to make ends meet.\nI've already lost my half my portfolio which is about $80,000 thank you AMD for moving your earnings date without telling anyone and buying xilinx. And now dunkin' donuts is going private and I knew about it and I didn't buy any calls or puts or any goddamn thing.\nThe only advice I can give you is stay out of this for a while or buy leaps for 2022. Nokia doesn't move enough to day trade you're better off investing in Erickson or Comcast or T-Mobile. Even Qualcomm I stay away from AT&amp;T though period well good luck with your investment you can always buy Tesla. I just bought Amazon and the price went down even though earnings were through the roof. The stock market is just not stable right now it's almost as if Trump is running that also as well as the country period both are in very sad state. Put your money in the bank and leave it there for a while you're better off period again this is only my opinion or is everyone says the mad ravings of a madman Good luck Chuck. Cheers",
        "created_utc": 1604287869,
        "id": "gav2z46",
        "permalink": "/r/options/comments/jmfobx/nok_call_holders_plans/gav2z46/",
        "score": 1,
        "subreddit": "options",
        "created": 1604316669.0
    },
    {
        "author": "bmjcoding",
        "body": "My understanding is Xilinx will help the future of AMD (stocks in this case), not necessarily immediate. With the acquisition of Xilinx, AMD becomes more of a threat to its rivals (Intel &amp; NVIDIA) in the data center sector. Unlike your average consumer (AMD vs Intel vs NVIDIA), data centers will always prefer price:performance rather than simple branding. If this merge works in AMD’s favor, in time data centers will begin to adopt AMD architecture over NVIDIA (if price:performance is reasonable) thus increasing overall profit.",
        "created_utc": 1604337261,
        "id": "gawwk4l",
        "permalink": "/r/investing/comments/jmqzqr/nasdaq_amd_week_45/gawwk4l/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604366061.0
    },
    {
        "author": "TheFatality1",
        "body": "If only Xilinx didn't exist...",
        "created_utc": 1604336387,
        "id": "gawup7i",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gawup7i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604365187.0
    },
    {
        "author": "moneygardener",
        "body": "Have any of you guys listened to the podcast \"WSJ Tech News Briefing\"?\n\nA couple days ago they had a piece on mergers and aquisitions in the chipmaker industry. AMD/XLNX and MRVL/IPHI was being discussed. They also discussed Intel's production difficulties, albeit with an obvious shortcoming in the technical understanding. I was giggling at the \"expert\" responses from the reporters. How can they land a job in the \"tech space\" of Wall Street Journal, with so little actual technical insight?\n\nI don't know if this is worthy of a post on it's own? There's probably a lot of ears listening in on that show.",
        "created_utc": 1604368648,
        "id": "gayn1ym",
        "permalink": "/r/stocks/comments/jmjnqp/rstocks_daily_discussion_monday_nov_02_2020/gayn1ym/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604397448.0
    },
    {
        "author": "TFWPKY360",
        "body": "The integration of Xilinx will hurt results in the upcoming quarters after acquisition is closed since it is not immediately accretive to AMD's bottom line since Xilinx would need to double its profits to not be dilutive. It could work out in the end giving AMD a foothold in FPGAs and 5G but this is a long term play &amp; personally I think most of the momentum will be sucked out of AMD until it is proven that the Xilinx merger was accretive. Bolt on acquisitions are usually what drives stock prices higher short term.\n\nPersonally, I would wait but if you think its a steal at $75 go for it but I see a growth company adding a non-growth company in a field that they are not proficient in. I still remember the ATA acquisition by AMD and that was a disaster.",
        "created_utc": 1604409348,
        "id": "gb01xox",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb01xox/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604438148.0
    },
    {
        "author": "ahsan_shah",
        "body": "Reading the comments it looks like bears have taken control. LOL. Oh boy they were wrong when SP was at $2 and they are still wrong when SP is around $75. Remember due to Intel process woes they will continue to lag behind certainly till 2023. AMD has 10% of data center market share and around 20% in desktop and we are no way near to saturation. AMD will continue to market share at Intel expense.\n\nComing to GPUs. LOL what can I say? It just took one attempt to match or surpass NVIDIA and people were very pessimistic about GPU prospects. AMD has &lt;10% of dedicated laptop market and around 25-30% of desktop market. Coming to data center (growing rapidly) I think its fair to say its below 5% if you compare against NVIDIA. \n\nNVIDIA is going to feel the pain now. Jensen is already sweating in his leather jackets. News of NVIDIA testing and cancelling of various Ampere SKUs is all over Twitter. First 3080 20GB, then 3070 16GB then 3070Ti. NVIDIA is poised to lose big chunk of market share especially in the notebook market as Ampere perf/watt is worse than RDNA2 and with superior efficiency of Ryzen 4000 and upcoming 5000 APU, AMD Ryzen+Radeon combo will sell like hot cakes in comparison to power hog Intel Skylake and Ampere.\n\nComing to Xilinx deal, shorts have no clue. If the deal closes, AMD will become a computing powerhouse with presence in 5G, automotive, AI, IOT, networking. Coming to dilution as they always bring, this dilution will bring $3b in annual revenue and $1b in profit\n\nPessimistic can sale and shorts can short. AMD has long term growth prospects. Long AMD since 2016",
        "created_utc": 1604410106,
        "id": "gb0339p",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb0339p/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604438906.0
    },
    {
        "author": "tim48134",
        "body": "&gt;American's once again tell the coastal elites who control the media that they don't pick the president. The people do. \n\nI mean, I agree that middle America is overlooked. But you're clearly implying that coastal elites are are bad, and you seem happy that Trump won. So assuming you were a Trump supporter, I was pointing out that Trump himself is both coastal and elite to point out the hypocrisy...\n\nBut ya know what, fuck this, I'm drunk. AMD stock: post election drama, think it'll go up with the GPU and console launch? Or will the Xilinx stuff continue to drag on it? Not actually sure how the merger works, lol. I'm recently in for 1/21 85c and wanna know how retarded I am",
        "created_utc": 1604465490,
        "id": "gb31zpn",
        "permalink": "/r/wallstreetbets/comments/jnllmp/perielection_election_discussion_thread/gb31zpn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604494290.0
    },
    {
        "author": "robmafia",
        "body": "*facepalm*\n\nway to evade all the actual data.  ie: math.\n\nie:  valuation of $25B then becomes $35B but the tether was based on 10/8.\n\nanalysts upgraded amd to $120... but then (after the deal) downgraded xlnx to $130. (ie:  not ~200)\n\nthe math does not add up.  this is off by such an absurd margin.  far beyond arbitrage.\n\nyou also omit amd going from 88 to 74 on the rumour/news, despite their best er in history and 2 other major catalysts.\n\nkick rocks",
        "created_utc": 1604504384,
        "id": "gb4iaf2",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb4iaf2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604533184.0
    },
    {
        "author": "Coat_Dry",
        "body": "The chart isn't just an arbitrary line. AMD+Xilinx is not the same as AMD stocks plus Xilinx stocks.\n\n&amp;#x200B;\n\nIntel bought Altera for a reason, FGPAs are the hot 16 year old high school sophomore that's going to wreck a lot of homes once they've matured. AMD+Xilinx=Intel and Nvidia killer.\n\n&amp;#x200B;\n\nIn this situation Intel is a 50 year old ex bodybuilder that wanted some eye candy, but the steroids ruined their sex drive and now all they have are fading memories and sagging bitch tits. They barely avoid jail time after picking up a 14 year old at the mall.\n\n&amp;#x200B;\n\nNvidia is a small asian man in a leather jacket that picked up a cheap hooker in Vegas (ARM) because they think that's what you're supposed to do when you're rich and powerful. They don't tell their wife because they don't want to admit they spent 4 hours watching softcore porn on cable before she took his money and left.",
        "created_utc": 1604455536,
        "id": "gb2kl81",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb2kl81/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604484336.0
    },
    {
        "author": "ceskanda",
        "body": "AMD went down bc of dilution from the XLNX acquisition announcement",
        "created_utc": 1604287285,
        "id": "gav20dz",
        "permalink": "/r/wallstreetbets/comments/jlrft5/earnings_for_the_week_of_november_2/gav20dz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604316085.0
    },
    {
        "author": "rxpillme",
        "body": "Yeah Xlnx will be bought at 35 bil valuation. Every Xlnx share get 1.7 shares of AMD",
        "created_utc": 1604337180,
        "id": "gawwe0a",
        "permalink": "/r/investing/comments/jmqzqr/nasdaq_amd_week_45/gawwe0a/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604365980.0
    },
    {
        "author": "ceskanda",
        "body": "Amd was the best until they announced Xlnx concurrent with the tech dump 😫",
        "created_utc": 1604372111,
        "id": "gaytcm9",
        "permalink": "/r/wallstreetbets/comments/jmv1ax/what_are_your_moves_tomorrow_november_03_2020/gaytcm9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604400911.0
    },
    {
        "author": "no_more_Paw_patrol",
        "body": "short term no idea. long term I like the xilinx deal. \nnot a huge fan of the last 10 days, I would buy more shares if I had cash on hand. I will sit on these puppies for a few years probably. my FDs are currently in dope and renewables playing a biden win.",
        "created_utc": 1604338725,
        "id": "gawzog0",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gawzog0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604367525.0
    },
    {
        "author": "PandaGodFliesToMoon",
        "body": "xlnx nov 20 calls have 63 volume and 2.6k + open interests... any of you know what's going on?",
        "created_utc": 1604248917,
        "id": "gat0avo",
        "permalink": "/r/wallstreetbets/comments/jl45xl/weekend_discussion_thread_for_the_weekend_of/gat0avo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604277717.0
    },
    {
        "author": "ThrowawayAl2018",
        "body": "AMD with Xilinx marriage may or may not work long term (look at Intel with Altera, didn't exactly pan out). The deal won't be finalized till end of next year so lots can change by then.\n\nAs you can hold 9 months, I would wait for a bottom threshold of mid $60's to pick some up, and more on each dip. Learn how to DCA long term as stock prices is quite volatile these days",
        "created_utc": 1604259652,
        "id": "gatlob6",
        "permalink": "/r/stocks/comments/jlzk8q/hold_amd_or_dump_them_on_monday_and_reinvest_into/gatlob6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604288452.0
    },
    {
        "author": "Arrowtotheknee99",
        "body": "I wouldn’t exactly say I’ve seen a lot of hate on AMD lately. The only problem I’ve seen is that they could be acquiring Xilinx at a inflated value. But long term there’s not really much to be concerned about. \nThe share price is a bit weird but the entire market is a bit weird.",
        "created_utc": 1604408897,
        "id": "gb019v4",
        "permalink": "/r/investing/comments/jn9ksc/amd/gb019v4/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604437697.0
    },
    {
        "author": "MrMineHeads",
        "body": "Maybe, but what the market doesn't think so so far. I mean everyone already knows what your posted. Q3, Xilinx, new GPUs; you have to be expecting something that's unexpected, which really doesn't make sense.\n\nPlus, you can't just give one example. That is such a ridiculous practice in this sub. Imagine if I said smoking doesn't cause cancer because my uncle who smoked a pack a day for 40 years died of a car crash.",
        "created_utc": 1604411111,
        "id": "gb04oo1",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb04oo1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604439911.0
    },
    {
        "author": "get_MEAN_yall",
        "body": "I mean it doesn't really matter how I feel about it now. The decision to buy was based on the companies financials, products, competition, etc...   \n\nI bought in before the XLNX acquisition and before Q3 earnings.",
        "created_utc": 1604411484,
        "id": "gb05aro",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb05aro/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604440284.0
    },
    {
        "author": "convolutionx",
        "body": "Doesn't xilinx increase amd TAM though?",
        "created_utc": 1604447503,
        "id": "gb26coq",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb26coq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604476303.0
    },
    {
        "author": "lambda-man",
        "body": "_facepalm_\n\nWay to interpret this like a fast-food transaction. Give me a break.\n\n&gt; ie: valuation of $25B then becomes $35B but the tether was based on 10/8.\n\nThis isn't a Wendy's where you're buying a hamburger for the price on the menu. There's a **stiff** premium to be paid for acquiring a company that wasn't looking to be acquired. Many of those executives will lose their jobs, they need a golden parachute. Shareholders need to be compensated for their loss of control. It's **really** **fucking** **expensive**.\n\n&gt; analysts upgraded amd to $120... but then (after the deal) downgraded xlnx to $130. (ie: not ~200)\n\nAnalysts are a bunch of dum-dums. I don't care about their \"upgrades\" and \"downgrades\" Go look at Enron's \"grade\". Look at Tesla's \"grade\". It's all bullshit.\n\n &gt; the math does not add up. this is off by such an absurd margin. far beyond arbitrage.\n\nYeah, because this wasn't a hamburger at Wendy's and shouldn't be analyzed as if it were.\n\n&gt; you also omit amd going from 88 to 74 on the rumour/news, despite their best er in history and 2 other major catalysts.\n\nAcquiring a company isn't a short term cash grab, it's a long term synergistic value proposition. If you were in AMD for short term gains it made sense to exit. If you were in AMD long term, it's a reason to hold or increase your position. That played out exactly how I expected it would.",
        "created_utc": 1604516785,
        "id": "gb58s3n",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb58s3n/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604545585.0
    },
    {
        "author": "TheEnd187",
        "body": "I remember a week ago Xilinx said AMD wasn't buying them.  Don't trust anyone.",
        "created_utc": 1604245039,
        "id": "gast998",
        "permalink": "/r/wallstreetbets/comments/jlwv11/psth_dd_on_my_24m_bet_11_downside_now_huge_upside/gast998/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604273839.0
    },
    {
        "author": "deah12",
        "body": "Not buying AMD when I can buy XLNX and end up with AMD shares at a better price.",
        "created_utc": 1604284795,
        "id": "gauxry7",
        "permalink": "/r/wallstreetbets/comments/jli0x0/amd_is_an_absolute_steal_at_75/gauxry7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604313595.0
    },
    {
        "author": "gainbabygain",
        "body": "But is it good or bad overall? What about the seller side? Are people selling because it's a distressed company or is it a healthy merger like amd &amp; xilinx\n\nEither way, it's going to be one of those too big to fail. Less competition and the consumer get fucked.",
        "created_utc": 1604496711,
        "id": "gb443gt",
        "permalink": "/r/wallstreetbets/comments/jnsglz/ma_bankers_we_never_been_this_busy_the_overall/gb443gt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604525511.0
    },
    {
        "author": "ShaidarHaran2",
        "body": "If AMD is a steal at 75 dollars, I wonder, why not pick up Xilinx stock to be converted at 1.7 AMD stocks per share?",
        "created_utc": 1604439639,
        "id": "gb1r06x",
        "permalink": "/r/stocks/comments/jn7ej3/amd_is_a_steal_at_75/gb1r06x/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604468439.0
    },
    {
        "author": "robmafia",
        "body": "&gt; The chart isn't just an arbitrary line. AMD+Xilinx is not the same as AMD stocks plus Xilinx stocks.\n\n\ni never said it was.\n\ni said xlnx is no growth.  because they are.  hence, their lack of growth in their financials and chart being dead until the rumour broke.\n\nyou omit the issues with the overpayment and worse, the 1.72 tether (and subsequent dilution).\n\nthere's a reason why amd's sp went from 88 down to 74, amidst the best ER they've ever had (with beats on eps, rev, and guidance) and 2 major catalysts (zen3 and big navi).  without the xlnx deal, it would have rocketed to 100 and probably beyond.",
        "created_utc": 1604455660,
        "id": "gb2ksz2",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb2ksz2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604484460.0
    },
    {
        "author": "frankalliance",
        "body": "Question: how does the AMD acquisition of Xilinx affect Xilinx investors? They were on my watch list a few months back.",
        "created_utc": 1604336611,
        "id": "gawv6ex",
        "permalink": "/r/investing/comments/jmqzqr/nasdaq_amd_week_45/gawv6ex/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604365411.0
    },
    {
        "author": "rxpillme",
        "body": "Yeah for Xlnx investors",
        "created_utc": 1604337323,
        "id": "gawwot6",
        "permalink": "/r/investing/comments/jmqzqr/nasdaq_amd_week_45/gawwot6/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604366123.0
    },
    {
        "author": "maxkingusa",
        "body": "The Xlnx deal is AMD.  Did you mean Mellanox or ARM?",
        "created_utc": 1604339218,
        "id": "gax0qhp",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gax0qhp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604368018.0
    },
    {
        "author": "TryingToBeUnabrasive",
        "body": "Xilinx acquisition. Top comment about tech bull run is accurate but the fact that it’s flat and not declining after an a zero-debt acquisition announcement actually *is* a sign that the company is doing well.\n\nLong term this company is gold. Just chill and be patient.",
        "created_utc": 1604333411,
        "id": "gawoend",
        "permalink": "/r/stocks/comments/jmphoa/why_is_amd_so_flat/gawoend/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604362211.0
    },
    {
        "author": "Boomtown626",
        "body": "Same. I also had XLNX heading into the announcement, so after getting the bump from them, I liquidated and got into AMD instead. I have good feeling about how that will all play out in the end.",
        "created_utc": 1604330070,
        "id": "gawhn5n",
        "permalink": "/r/stocks/comments/jmjnqp/rstocks_daily_discussion_monday_nov_02_2020/gawhn5n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604358870.0
    },
    {
        "author": "bobthedestroyers",
        "body": "High P/E momentum stock + stock dilution with the overvalued Xilinx deal makes it temporarily worth less.",
        "created_utc": 1604332552,
        "id": "gawmnaq",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gawmnaq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604361352.0
    },
    {
        "author": "4OFourUnknown",
        "body": "The stock was doing well. Then the rumors about purchasing Xilinx came out and investors were mixed. Great earnings were shadowed by confirmation about the $35 billion all stock purchase and again, people were divided. People either sold on the good earnings or on the Xilinx deal. AMD seems to stays pretty flat on good news, but then just one day down the road, it takes off. It’s a wild ride, but YTD, it’s doing really well",
        "created_utc": 1604331467,
        "id": "gawkf05",
        "permalink": "/r/stocks/comments/jmphoa/why_is_amd_so_flat/gawkf05/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604360267.0
    },
    {
        "author": "DividendWin",
        "body": "&gt;When something like snap or zoom happens and you happen to be on the winning side of that ... it’s luck.\n\nI've been doing this for a little longer than this year and nothing I've said doesn't apply to other years. M&amp;A plays and such are all the same every year with the same results and rewards and sometimes even greater ones.\n\nI called Zoom 3 months before it happened based entirely on the Corona Virus Pandemic and it's use in my workplace going up ridiculous amounts. It wasn't luck. In fact that's the problem here; Zoom was not luck. The uncertainty didn't lie in whether it was being used but instead by how much it would profit from it's use during the pandemic. Apparently everyone was blown away with massive increase in value because in this environment it really is just that useful. \n\nThe part I am trying to get across is that it isn't luck at all. At least not in this case. If something has a strong correlation with the SP500 for instance and that is tanking it is very unlikely that any news is going to outrun the beta on the stock so it isn't really as shocking as it might seem that earnings in the past week, even on things we already knew would go up from a comparative view, were still not producing strong calls or positive prices. They simply fell with the market as a whole at the time. The same had to be true of the things that fell with their earnings in Feb / Mar into April. \n\n&gt;It is a relatively new phenom with know real rhyme or reason behind it.\n\nThis is not new. You can go back to any bubble, any bust and any memetic behavior and see the same thing over and over. This is incredibly profitable hence all the sentiment concepts and scraping of forums and such; the data is profitable for certain. If it were new and no one knew what was happening there'd be no money in it.\n\n&gt;You could argue that currently,the possibility of newbie traders stumbling upon massive gains from meme stock culture is elevated .. Id argue that the probability is still low.\n\nYou don't \"stumble\" across companies you know. That's my point. No one \"stumbles across\" Snapchat. We all know what Snapchat is. You \"stumble across\" Regeneron. You \"stumble across\" Xilinx. You don't stumble across AMD.\n\n&gt;Is it possible to hit a 5k lotto ticket .. sure But in all probability it will be a while before you have a trade that successful.\n\nAgain this strongly depends on what your cost basis is. To get a trade that hits 5k from 2.5k is ... actually really common. Very. It was before this. It will be after. It even happens on just the stocks and not even the derivatives; a lot of people think that these market moves are rare but they aren't, and instead, they are heavily spaced out and complex to track so making 100% across 9 months in a year isn't what anyone is looking for but that is exactly how it tends to work out.\n\nI personally think that your first 20k is the hardest because it's easy to get the 1 that takes you to even 10k buy 20+ in one go is very rare so you do have to actually string together trades and that lowers the probability of success substantially. This is especially true because capital sensitivity worsens as you get wealthier; the same amount of money you need to achieve a return is not the absolute value of a cashflow anymore so when you worked at Wendy's (whose earnings are this week ;) ) your making 30k was huge but if you work at your own firm or a bank or something like that your making 30k is sometimes a pittance.\n\n&gt;I think it’s dangerous to spread a narrative that suggests Snap like plays happen so consistently that all you have to do is be familiar with these types of cult companies to secure large profits.\n\nI cannot stress enough that this stuff happens all the time. It is so common in fact that there is no one talking about it. I mean the Fastly puts thing with a 392x value? *That* is rare. From 2 ~ 18 based on the contract within a year is not astronomically rare because remember it's all leverage so the bet itself doesn't move linearly like the base might presuming the basis isn't an option itself. Heh. Options on options are freaking crazy.",
        "created_utc": 1604258809,
        "id": "gatjy5p",
        "permalink": "/r/wallstreetbets/comments/jm5cvm/your_first_5k_win/gatjy5p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604287609.0
    },
    {
        "author": "stonk_street",
        "body": "yeah, also AMD all stock purchase of XLNX is a huge L to stockholders.",
        "created_utc": 1604349458,
        "id": "gaxmec5",
        "permalink": "/r/wallstreetbets/comments/jmkz1s/daily_discussion_thread_for_november_02_2020/gaxmec5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604378258.0
    },
    {
        "author": "stonk_street",
        "body": "AMD stock buy of XLNX is a huge L. Apple moving to ARM is also a big L to them as more companies will switch from x86.",
        "created_utc": 1604352095,
        "id": "gaxrvqr",
        "permalink": "/r/wallstreetbets/comments/jmv1ax/what_are_your_moves_tomorrow_november_03_2020/gaxrvqr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604380895.0
    },
    {
        "author": "robmafia",
        "body": "yes.  but you seemed to miss the points spectacularly.\n\namd is high growth\nxlnx is no growth\n\namd is overpaying out the ass\n\nie: the shareholders are paying out the ass to be shackled to a company with no growth.  they're tying a golden anvil to their rocketship.",
        "created_utc": 1604447725,
        "id": "gb26rdi",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb26rdi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604476525.0
    },
    {
        "author": "convolutionx",
        "body": "Why is Xilinx viewed as a no growth company? Won't the acquisition allow AMD to enter new markets and continue to grow?",
        "created_utc": 1604447791,
        "id": "gb26voy",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb26voy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604476591.0
    },
    {
        "author": "robmafia",
        "body": "yeah, because their growth is constrained by the xlnx anchor they're tied to.",
        "created_utc": 1604443700,
        "id": "gb1z6z7",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb1z6z7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604472500.0
    },
    {
        "author": "rankiba",
        "body": "AMD paid 35 b to Xilinx, NVDA paid 40b for ARM is a better deal no?",
        "created_utc": 1604376769,
        "id": "gaz1b15",
        "permalink": "/r/wallstreetbets/comments/jmv1ax/what_are_your_moves_tomorrow_november_03_2020/gaz1b15/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604405569.0
    },
    {
        "author": "lambda-man",
        "body": "Your logic here boils down to \"xilinx was a mistake, I know better than AMD's leadership what is best for their company\".\n\nNot saying you're wrong, but I would like to know why adding a no-growth company to a growth company to make a hybrid is a negative.",
        "created_utc": 1604501667,
        "id": "gb4culu",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb4culu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604530467.0
    },
    {
        "author": "robmafia",
        "body": "and it doesn't matter, since the xlnx deal will cripple amd for a year.",
        "created_utc": 1604434085,
        "id": "gb1f7nc",
        "permalink": "/r/wallstreetbets/comments/jnhhrg/amd_winning_the_cpu_and_gpu_war/gb1f7nc/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1604462885.0
    }
]