[
    {
        "author": "Sk0ly",
        "body": "Scary part with Apple is something like 70% of their revenue comes from the iPhone, they are non existent in enterprise, and they are losing ground with the creatives to Microsoft. \n\nThey have a massive cash reserve to weather most but if the iPhone all of a sudden becomes unpopular, they could be Motorola 2.0 post RAZR.",
        "created_utc": 1596501017,
        "id": "g09xgjp",
        "permalink": "/r/CanadianInvestor/comments/i35dcz/one_stock_for_the_next_20_years_what_would_you/g09xgjp/",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1596529817.0
    },
    {
        "author": "killerk14",
        "body": "If you look at big tech charts and then look at MSI does anyone see a pump to ATH coming in the next month?",
        "created_utc": 1596491241,
        "id": "g09erqw",
        "permalink": "/r/wallstreetbets/comments/i34g5h/what_are_your_moves_tomorrow_august_04_2020/g09erqw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596520041.0
    },
    {
        "author": "Shoopshopship",
        "body": "There doesn't need to be a definitive crash,  there could just be a period where they tread water because they got too ahead of themselves. \n\nAny company has individual risks. Apple is very dependent on hardware for example. What if iPhones fall out of trend for another kind of smart phone? You may think this is impossible but Nokia, Motorola and Blackberry were all in this position at one time where they were the king of cell phones. \n\nGenerally, you should mix it up. If you think tech is a great investment, then put a good chunk in that but you should also hold a few other industries because these things cycle in performance.",
        "created_utc": 1597964109,
        "id": "g29mxfp",
        "permalink": "/r/CanadianInvestor/comments/idhktf/is_there_a_tech_bubble/g29mxfp/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1597992909.0
    },
    {
        "author": "Whiteguyinbronx",
        "body": "Yeah but most companies had Slack before anyway. Small businesses either don’t need them or use walkie talkies. \n\nMSI $165c 9/18",
        "created_utc": 1598158048,
        "id": "g2jz2jr",
        "permalink": "/r/wallstreetbets/comments/iewmqm/stop_slacking_and_get_to_work_earnings_run_up/g2jz2jr/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598186848.0
    },
    {
        "author": "Sk0ly",
        "body": "All I'm saying is that, regardless of the size, companies that rely so strongly on a single product are vulnerable. There have been many before it that we didn't predict. Motorola was a great example. Nobody thought anyone could unseat them with the success of the RAZR. Or Nokia for that matter.",
        "created_utc": 1596510532,
        "id": "g0aevqf",
        "permalink": "/r/CanadianInvestor/comments/i35dcz/one_stock_for_the_next_20_years_what_would_you/g0aevqf/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1596539332.0
    },
    {
        "author": "janie_XY",
        "body": "MSI and HUYA made me money todayyyy",
        "created_utc": 1597265747,
        "id": "g19860c",
        "permalink": "/r/wallstreetbets/comments/i8l3ny/what_are_your_moves_tomorrow_august_13_2020/g19860c/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597294547.0
    },
    {
        "author": "kaennar1",
        "body": "In a semiconductor no one ever cares about the firmware or software. It’s not central to the bottom line. It’s usually considered “fluff”. \n\nHowever if you talk to customers you’ll usually find two defining factors for what they choose to build they products with: past experience and ease of use. The first comes from positive experiences and investing in universities (you ever wonder what TI puts a Delphino DSP in every EE classroom? That’s why.). The other is expensive. It requires building consistent, quality HALs and tools to complement those. \n\nFeeescale was actually the leader in that. They were Metrowerks (the semiconductor arm of Motorola) and created CodeWarrior. The only IDE to ever come close to the usage and utility of Visual Studio. That came to an end when the RF and other hardware engineers started to take over. The firmware and software engineers played second fiddle and the VPs viewed it as a luxury. Lisa Su did not. She took an active approach in pushing for advanced software that made making applications on Freescale chips easier. \n\nThat is largely considered the reason the I.MX chips took off in the automotive field as well as the networking area. It’s a classic case of saying “fuck the MBAs”.",
        "created_utc": 1597738284,
        "id": "g1yn9xx",
        "permalink": "/r/wallstreetbets/comments/ibpuv1/choose_your_tech_fighter/g1yn9xx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597767084.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  4th of August\n\n\n\n## Upcoming events for Tuesday, August  4th\n\n - Expected earnings:\n\n  ACHC, ACIA, ACLS, ACM, ACOR, AFG, AGLE, AHCO, AHH, AIZ, AJX, AKCA, ALL, ALLT, ALRN, ALSN, AMCX, AME, AMK, AMRN, ANDE, ANET, APEN, APTO, AQB, AQMS, AQST, AQUA, ARCC, ARMK, ATI, ATVI, AVLR, AVNS, BLD, BMCH, BMRN, BOOT, BP, BRY, BTAI, BXC, BYND, CBMG, CCR, CDK, CDLX, CDNA, CEQP, CERS, CGBD, CHCT, CHFS, CLPT, CLW, CMP, CNK, CNO, COHR, CORT, CPE, CPSI, CPTA, CRIS, CRNC, CSII, CTRE, CTSO, CYBR, CZNC, DCPH, DEA, DIS, DK, DKL, DNLI, DS, DVN, EC, EMR, ENLC, ENPH, ENTA, EPC, EPZM, EQH, ESI, ETH, ETON, ETRN, EVC, EVER, EVFM, EVH, EVRI, EVTC, EXC, EXK, EXPD, EXR, EYES, FARO, FI, FIS, FLGT, FMC, FNF, FOE, FOXA, FSP, FSTR, FTSI, GBL, GDOT, GLDD, GLT, GLUU, GMDA, GNMK, GORO, GPOR, GRBK, GTE, GTES, HAE, HCKT, HEES, HLNE, HNP, HSIC, HSKA, HTGM, HTZ, HVT, IAA, ICAD, ICD, ICFI, IGT, IMXI, INCY, INGN, INGR, INSP, IPGP, IPHI, IT, ITI, JAZZ, JBGS, JELD, KKR, KMDA, KOPN, KPTI, KRMD, KTOS, LC, LCII, LDOS, LEA, LGIH, LMNX, LOPE, LPSN, LPX, MCHP, MCS, MEC, MGP, MLAB, MMYT, MNK, MNR, MNST, MOD, MODN, MR, MRCY, MTCH, MUX, MYOK, MYOS, MYOV, NEWR, NEXT, NK, NKLA, NP, NPO, NPTN, NS, NUVA, NVMI, NVTA, NWPX, NXRT, OAS, OCFT, OEC, OI, OMI, OMP, ONCY, ONTO, OPCH, OPTN, ORA, ORCC, OSPN, OTIC, OXFD, PAA, PAGP, PAYC, PAYS, PEAK, PEI, PLMR, PLNT, PPD, PRIM, PRU, PSB, PUMP, PXD, QGEN, QTRX, QUOT, RCM, RCUS, RDHL, REGI, REZI, RGA, RHP, RIGL, RL, RPAI, RPT, RRR, RVI, RYAM, SAMG, SB, SBBP, SBOW, SHO, SLRC, SND, SNE, SPN, SPNE, SPNS, SPR, SRGA, STIM, SUNS, SUPN, SWX, TDG, TECH, TGI, THRM, TISI, TLC, TPTX, TREC, TREE, TRHC, TRUP, TSLX, TSQ, TTI, TWLO, UFPT, UPWK, USAC, USCR, USFD, VAPO, VIV, VMC, VNTR, VPG, VRNA, VRSK, VSH, WBT, WEC, WIFI, WK, WMC, WMG, WRK, WTTR, WU, WW, WYNN, XENT, XERS, XNCR, XOMA, Y, ZAGG, ZBH, ZYNE\n\n - Ex-div:\n\n  BBD, BBDO, BRO, COLB, EIG, HFWA, IDA, MKTX, NFBK, NTB, SFBC, WBS, WTBA\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -6.829M)\n    - Durables Excluding Defense (previous: 9.2%)\n    - Factory Orders (consensus: 5.0%, previous: 8.0%)\n    - Factory orders ex transportation (previous: 2.6%)\n    - IBD/TIPP Economic Optimism (previous: 44.0)\n    - ISM NY Business Conditions (previous: 39.5%)\n    - ISM-New York Index (previous: 806.0)\n    - Redbook (previous: -8.7%)\n    - Redbook (previous: 1.1%)\n\n## Upcoming events for Wednesday, August  5th\n\n - Expected earnings:\n\n  ABC, ACAD, ACMR, ADT, ADTN, AEIS, AEL, AFIN, AFMD, AG, AGS, AKR, ALB, ALE, ALLO, ALNA, ALRM, AMOT, AMPY, AMSC, ANSS, AOSL, APPS, ARAV, ARES, ARLO, ARNA, ARTNA, ARWR, ASM, ASTE, ATH, ATHM, ATO, ATOM, ATRA, ATSG, AUMN, AUTO, AVA, AVXL, AWK, AXAS, AXGN, AY, BAK, BBSI, BCLI, BCOR, BCSF, BDSI, BFAM, BFS, BGSF, BIP, BLDP, BMA, BNFT, BREW, BSGM, BTG, BTU, BV, BWA, BWEN, CAI, CAMT, CARA, CBAY, CBL, CCMP, CCRN, CCU, CDAY, CDW, CECE, CENT, CENTA, CENX, CF, CFMS, CHAP, CHNG, CHX, CIM, CLDT, CLDX, CLH, CLLS, CNFR, CNST, COLL, CORR, CPA, CPK, CPRI, CPRX, CRHM, CRK, CRL, CSGS, CSTE, CTL, CTVA, CUB, CVNA, CVS, CWH, CXW, DAR, DCP, DDD, DFIN, DISCA, DNOW, DNR, DOX, DSSI, DZSI, ECPG, ELF, EMKR, ENBL, ENDP, ENR, EPR, EPRT, ERJ, ET, ETSY, EVOP, EVRG, EXPI, EXTR, EYPT, EZPW, FATE, FISV, FIT, FLMN, FLXN, FNHC, FNV, FOXF, FPI, FRGI, FRT, FSCT, FSLY, FSM, FTDR, FUN, FVRR, GBDC, GBT, GCP, GDDY, GEL, GFL, GGB, GLOG, GLOP, GMED, GMRE, GNK, GNL, GOLF, GPRK, GTHX, HALL, HBB, HBIO, HCC, HCFT, HDSN, HEP, HI, HMC, HNGR, HR, HSC, HSON, HT, HUBS, HUM, HZNP, IAG, ICPT, IIPR, IMMU, INFN, INMB, INMD, INN, INSG, IO, IONS, ISEE, ITCI, IVC, IVR, JACK, JCS, KAR, KIDS, KIN, KRG, KRO, KW, KWR, KZR, LAND, LASR, LHCG, LILA, LL, LMRK, LNC, LPCN, LPI, LYRA, LYV, MATX, MAXR, MCHX, MDGL, MDU, MED, MET, MFC, MFG, MGEE, MGEN, MGTX, MIDD, MLCO, MLVF, MNKD, MOR, MRCC, MRNA, MRO, MSC, MTG, MUFG, MVIS, MWA, NE, NEPH, NESR, NEWT, NI, NKSH, NLSN, NMFC, NMIH, NRG, NSPR, NTRA, NUAN, NUS, NVAX, NVCN, NVEE, NVRO, NXST, NYMT, NYT, OBSV, OCSI, ODP, OHI, OLN, OLP, OPGN, OPRX, OR, OSUR, OSW, OTRK, OUT, OVID, PAAS, PBPB, PDCE, PE, PEIX, PERI, PFLT, PGNY, PK, PKOH, PLUS, PNNT, PRGO, PRI, PRQR, PSA, PSN, PTCT, PTGX, PTI, PTON, PVAC, PVG, QMCO, QNST, QTWO, QUIK, RAIL, RBBN, RCII, RCKT, RCMT, RE, REGN, REI, RESI, RESN, REYN, RGLD, RM, RMD, RMNI, ROCK, ROKU, RTLR, RYN, SBGI, SBLK, SBPH, SBRA, SCPH, SCYX, SENS, SGMO, SGRY, SHIP, SILK, SITM, SJI, SKT, SLNO, SLRX, SMSI, SMTX, SNSS, SONM, SONO, SPG, SPT, SPWR, SQ, SR, SRDX, SRE, SRLP, SRPT, SSYS, STAA, STKL, STN, STOR, STWD, SUN, SUP, SURF, SWM, SYNA, TA, TACT, TALO, TARA, TBIO, TCDA, TCON, TCP, TELL, TEVA, TGB, TKC, TMDX, TPCO, TPVG, TRI, TRMB, TRNO, TRVN, TRXC, TS, TTEC, TTGT, TVTY, TWNK, TWO, TX, UFAB, UFCS, UFI, UHAL, UIHC, UMH, USWS, VAR, VCEL, VERI, VMD, VNDA, VOYA, VRCA, VRT, VRTV, VSLR, VST, VTVT, W, WATT, WD, WDC, WELL, WEN, WLL, WMGI, WPG, WSR, WTI, WTRG, WWW, XAN, XEC, ZGNX, ZIXI, ZNGA\n\n - Ex-div:\n\n  AMG, AWI, BXG, DCOM, FELE, FSBW, HESM, HTBK, KBH, LSBK, MATX, NEP, NGL, NWBI, OFED, OPBK, RELL, SIMO, SXI, VBTX, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 1,500K, previous: 2,369K)\n    - Crude Oil Imports (previous: -1.013M)\n    - Crude Oil Inventories (consensus: -3.267M, previous: -10.612M)\n    - Cushing Crude Oil Inventories (previous: 1.309M)\n    - Distillate Fuel Production (previous: 0.020M)\n    - EIA Refinery Crude Runs  (previous: 0.389M)\n    - EIA Weekly Distillates Stocks (consensus: 0.757M, previous: 0.503M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: 1.6%)\n    - Exports (previous: 144.51B)\n    - FOMC Member Mester Speaks\n    - Gasoline Inventories (consensus: 0.627M, previous: 0.654M)\n    - Gasoline Production (previous: 0.079M)\n    - Heating Oil Stockpiles (previous: -0.127M)\n    - ISM Non-Manufacturing Business Activity (consensus: 60.0, previous: 66.0)\n    - ISM Non-Manufacturing Employment (previous: 43.1)\n    - ISM Non-Manufacturing New Orders (previous: 61.6)\n    - ISM Non-Manufacturing PMI (consensus: 55.0, previous: 57.1)\n    - ISM Non-Manufacturing Prices (previous: 62.4)\n    - Imports (previous: 199.12B)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: -0.8%)\n    - MBA Purchase Index (previous: 306.1)\n    - Markit Composite PMI (consensus: 50.0, previous: 50.0)\n    - Mortgage Market Index (previous: 841.9)\n    - Mortgage Refinance Index (previous: 3,955.9)\n    - Seevol Cushing Storage Report (previous: 0.426M)\n    - Services PMI (consensus: 49.6, previous: 49.6)\n    - Trade Balance (consensus: -50.10B, previous: -54.60B)\n\n## Upcoming events for Thursday, August  6th\n\n - Expected earnings:\n\n  AAOI, AAON, AAWW, AAXN, ABMD, ACEL, ACHV, ACRE, ADAP, ADMS, ADNT, AEE, AEP, AERI, AES, AGEN, AINV, AIRG, AL, ALBO, ALDX, ALEX, ALNY, ALTR, AMAG, AMH, AMN, AMPH, AMRS, AMRX, AMYT, ANIP, AP, APDN, APLE, APPN, ASPS, ASYS, AT, ATEC, ATNX, ATRS, AUTL, AVD, AVT, AXDX, AXNX, AYX, AZUL, BAP, BBDC, BBU, BCE, BCEI, BCRX, BDX, BECN, BHC, BHF, BKNG, BL, BLCM, BLFS, BLL, BLRX, BLUE, BMY, BRBR, BSIG, CABO, CAH, CAI, CAPL, CAPR, CARG, CATM, CBB, CBIO, CBT, CCEP, CCOI, CDXC, CDXS, CELH, CEMI, CFX, CHH, CHRS, CHUY, CIGI, CIO, CLDX, CLMT, CLNC, CLNE, CLPR, CLVS, CLXT, CNCE, CNDT, CNP, CNQ, COLD, COMM, CORE, CPST, CRBP, CRON, CTMX, CUBE, CUTR, CWEN, CWK, CYAD, CYTK, CZR, DBX, DDOG, DEI, DEO, DGII, DHC, DHX, DIOD, DLPH, DNB, DOC, DRH, DRNA, DSKE, DVAX, DXC, DXPE, EAF, EB, ECOL, ECOM, ED, EDIT, EDRY, EFC, EGLE, EIDX, ELOX, ELVT, ELY, ENV, EOG, EPAM, EPAY, ESTA, ESTE, EVA, EVBG, EXEL, EXLS, EYE, FDUS, FET, FFG, FGEN, FLDM, FLIR, FLO, FLR, FLT, FNKO, FOUR, FPRX, FSLR, FTNT, G, GCI, GDEN, GDYN, GEO, GERN, GH, GKOS, GLMD, GLP, GLPG, GPL, GPRO, GRPN, GSL, GTN, GTS, GWPH, GWRS, HASI, HCI, HE, HEAR, HFC, HII, HIMX, HL, HLF, HLT, HMHC, HMN, HTA, HWM, IBP, IDCC, IGMS, IHRT, ILMN, IMMR, IMRA, ING, INSM, INTT, INVE, IOVA, IRIX, IRM, IRTC, IRWD, IVR, JCAP, JLL, JYNT, KALA, KBR, KELYA, KINS, KLDO, KRP, KTB, KURA, LAMR, LAUR, LBRDA, LBRDK, LCTX, LCUT, LGF.A, LIND, LIVX, LJPC, LMRK, LNG, LNT, LQDT, LSI, LTHM, LUNA, LVGO, LXP, MAIN, MDWD, MEET, MELI, METC, MFA, MGY, MHK, MITO, MMI, MMS, MNLO, MNPR, MNTX, MR, MRAM, MSI, MTA, MTW, MUR, MYL, NBRV, NBY, NCLH, NDLS, NET, NFG, NGVC, NICE, NINE, NKTR, NLOK, NLTX, NMRK, NNBR, NOMD, NOVT, NREF, NSA, NSCO, NSIT, NTLA, NVO, NWSA, OFIX, OGE, OLED, OPNT, OPRT, ORTX, OSS, OTEX, PAE, PBA, PBH, PBYI, PCRX, PCSB, PCTI, PCTY, PDFS, PDLI, PENN, PETQ, PFNX, PFSI, PH, PLUG, PLYA, PLYM, PMT, PNW, PODD, POST, PRAA, PRAH, PRDO, PRMW, PROF, PRSC, PRSP, PRTA, PRTY, PRVB, PSNL, PTE, PTMN, PVAC, PWFL, PWR, PZG, PZZA, QSR, RBA, RC, REAL, RGNX, RLJ, RMAX, ROLL, RPD, RSG, RST, RVNC, SAIL, SEE, SEEL, SELB, SERV, SHYF, SIC, SJW, SLF, SLGL, SNDX, SP, SPH, SPRO, SRCL, SRTS, SSRM, SSTI, STAR, STFC, STMP, STNG, STXS, SVM, SVMK, SVRA, SWCH, SWI, SWIR, SWX, SYBX, SYNH, SYRS, TAST, TBPH, TCO, TCPC, TDC, TDS, TEN, TGLS, TGP, THR, THS, TLND, TMST, TMUS, TNK, TPIC, TRGP, TRIP, TRUE, TTD, TWI, TWST, TXMD, UBER, UE, UEIC, UNIT, UNVR, UPLD, USM, USPH, UTI, VCTR, VEON, VER, VG, VGR, VRRM, VRS, VSAT, VSTM, VSTO, VVI, VVNT, WCN, WIX, WLDN, WLK, WLKP, WMS, WPRT, WWD, XAIR, XENE, XLRN, XONE, XRAY, XXII, YELP, YETI, ZEUS, ZG, ZIOP, ZTS\n\n - Ex-div:\n\n  AFB, AMTD, ARCB, ARTNA, AUB, BCBP, BPFH, BRKL, CBAN, CEQP, CFFN, CIT, CMCO, CMS, CNXM, CPLP, CVCY, CXO, DHF, DKL, ET, FCBC, FCF, FE, FHI, FIBK, FRAF, FRBA, GMLP, HCC, HMST, HSII, HTLF, INTC, JBHT, JBSS, LBC, LW, MMLP, MMP, MPLX, NBLX, NS, NSC, NXST, NYCB, PCTI, PNFP, PNM, PPBI, PZN, RBNC, RIO, RUSHA, RUSHB, SBFG, SBUX, SCHW, SIRI, SMBK, SUN, UL, UN, WAFD, WFC\n\n - Economic events and announcements:\n\n    - Challenger Job Cuts (previous: 170.219K)\n    - Challenger Job Cuts (previous: 305.5%)\n    - Continuing Jobless Claims (consensus: 16,839K, previous: 16,151K)\n    - FOMC Member Kaplan Speaks\n    - Initial Jobless Claims (consensus: 1,408K, previous: 1,434K)\n    - Jobless Claims 4-Week Avg. (previous: 1,368.50K)\n    - Natural Gas Storage (previous: 26B)\n\n^^^^2020-08-04",
        "created_utc": 1596535223,
        "id": "g0b8kn5",
        "permalink": "/r/RobinHood/comments/i3gju8/daily_discussion_thread_august_4th_2020/g0b8kn5/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1596564023.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  5th of August\n\n\n\n## Upcoming events for Wednesday, August  5th\n\n - Expected earnings:\n\n  ABC, ACAD, ACMR, ADT, ADTN, AEIS, AEL, AFIN, AFMD, AG, AGS, AKR, ALB, ALE, ALLO, ALNA, ALRM, AMOT, AMPY, AMSC, ANSS, AOSL, APPS, ARES, ARLO, ARNA, ARTNA, ARWR, ASM, ASTE, ATH, ATHM, ATO, ATOM, ATRA, ATSG, AUMN, AUTO, AVA, AVXL, AWK, AXAS, AXGN, AXLA, AY, BAK, BBSI, BCLI, BCOR, BCSF, BDSI, BFAM, BFS, BGSF, BIP, BLDP, BMA, BNFT, BREW, BSGM, BTG, BTU, BV, BWA, BWEN, CAMT, CARA, CBAY, CBL, CCMP, CCRN, CCU, CDAY, CDW, CECE, CENT, CENTA, CENX, CF, CFMS, CHAP, CHNG, CHX, CIM, CLDT, CLH, CLLS, CNFR, CNST, COLL, CPA, CPK, CPRI, CRK, CRL, CSGS, CSTE, CTL, CTVA, CUB, CVNA, CVS, CWH, CXW, DAR, DCP, DDD, DFIN, DISCA, DNOW, DOX, DSSI, DZSI, ECPG, ELF, EMKR, ENBL, ENDP, ENR, ENSG, EPR, EPRT, ERJ, ET, ETSY, EVOP, EVRG, EXPI, EXTR, EYPT, EZPW, FATE, FISV, FIT, FLMN, FLXN, FNHC, FNV, FOXF, FPI, FRGI, FRT, FSCT, FSLY, FSM, FTDR, FUN, FVRR, GBDC, GBT, GCP, GDDY, GEL, GFL, GGB, GLOG, GLOP, GMED, GMRE, GNK, GNL, GOLF, GPRK, GTHX, HALL, HBB, HBIO, HCC, HCFT, HDSN, HEP, HI, HMC, HNGR, HR, HSC, HSON, HT, HUBS, HUM, HZNP, IAG, IIPR, IMMU, INFN, INMB, INMD, INN, INSG, IO, IONS, ISEE, ITCI, IVC, JACK, JCS, KAR, KIDS, KIN, KRG, KRO, KW, KWR, KZR, LAND, LASR, LHCG, LILA, LL, LNC, LPCN, LPI, LYRA, LYV, MATX, MAXR, MCHX, MDGL, MDU, MED, MET, MFC, MGEE, MGEN, MGTX, MIDD, MLCO, MLVF, MNKD, MOR, MRCC, MRNA, MRO, MSC, MTG, MUFG, MVIS, MWA, NEPH, NESR, NEWT, NI, NKSH, NLSN, NMFC, NMIH, NRG, NSPR, NTRA, NUAN, NUS, NVAX, NVCN, NVEE, NVRO, NXST, NYMT, NYT, OAS, OBSV, OCSI, ODP, OHI, OLN, OLP, OMP, OPGN, OPRX, OR, OSB, OSUR, OSW, OTRK, OUT, OVID, OYST, PAAS, PBPB, PDCE, PE, PEIX, PERI, PFLT, PGNY, PK, PKOH, PLUS, PNNT, PRGO, PRI, PRQR, PSA, PSN, PTCT, PTGX, PTI, PTON, PVG, QMCO, QNST, QTWO, QUIK, RAIL, RBBN, RCII, RCKT, RCMT, RE, REGN, REI, RESI, RESN, REYN, RGLD, RM, RMD, RMNI, ROCK, ROKU, RTLR, RYN, SBGI, SBLK, SBPH, SBRA, SCPH, SCYX, SENS, SGMO, SGRY, SHIP, SILK, SITM, SJI, SKT, SLNO, SLRX, SMSI, SMTX, SNSS, SONM, SONO, SPG, SPT, SPWR, SQ, SR, SRDX, SRE, SRLP, SRPT, SSYS, STAA, STKL, STN, STOR, STWD, SUN, SUP, SURF, SWM, SYNA, TA, TACT, TALO, TBIO, TCDA, TCON, TCP, TELL, TEVA, TGB, TKC, TMDX, TPCO, TPVG, TRI, TRMB, TRNO, TRVN, TRXC, TS, TTEC, TTGT, TVTY, TWNK, TWO, UFAB, UFCS, UFI, UHAL, UIHC, UMH, USWS, VCEL, VERI, VMD, VNDA, VOYA, VRCA, VRT, VRTV, VSLR, VST, W, WATT, WD, WDC, WELL, WEN, WLL, WPG, WSR, WTI, WTRG, WWW, XAN, XEC, ZGNX, ZIXI, ZNGA\n\n - Ex-div:\n\n  AMG, AWI, BXG, DCOM, FELE, FSBW, HESM, HTBK, KBH, LSBK, MATX, NEP, NGL, NWBI, OFED, OPBK, RELL, SIMO, SXI, VBTX, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 1,500K, previous: 2,369K)\n    - Crude Oil Imports (previous: -1.013M)\n    - Crude Oil Inventories (consensus: -3.001M, previous: -10.612M)\n    - Cushing Crude Oil Inventories (previous: 1.309M)\n    - Distillate Fuel Production (previous: 0.020M)\n    - EIA Refinery Crude Runs  (previous: 0.389M)\n    - EIA Weekly Distillates Stocks (consensus: 0.279M, previous: 0.503M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: 1.6%)\n    - Exports (previous: 144.51B)\n    - FOMC Member Mester Speaks\n    - Gasoline Inventories (consensus: -0.170M, previous: 0.654M)\n    - Gasoline Production (previous: 0.079M)\n    - Heating Oil Stockpiles (previous: -0.127M)\n    - ISM Non-Manufacturing Business Activity (consensus: 60.0, previous: 66.0)\n    - ISM Non-Manufacturing Employment (previous: 43.1)\n    - ISM Non-Manufacturing New Orders (previous: 61.6)\n    - ISM Non-Manufacturing PMI (consensus: 55.0, previous: 57.1)\n    - ISM Non-Manufacturing Prices (previous: 62.4)\n    - Imports (previous: 199.12B)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: -0.8%)\n    - MBA Purchase Index (previous: 306.1)\n    - Markit Composite PMI (consensus: 50.0, previous: 47.9)\n    - Mortgage Market Index (previous: 841.9)\n    - Mortgage Refinance Index (previous: 3,955.9)\n    - Seevol Cushing Storage Report (previous: 0.426M)\n    - Services PMI (consensus: 49.6, previous: 47.9)\n    - Trade Balance (consensus: -50.10B, previous: -54.60B)\n\n## Upcoming events for Thursday, August  6th\n\n - Expected earnings:\n\n  AAOI, AAON, AAWW, AAXN, ABMD, ACEL, ACHV, ACRE, ADAP, ADMS, ADNT, AEE, AEP, AERI, AES, AGEN, AINV, AIRG, AL, ALBO, ALDX, ALEX, ALNY, ALTR, AMAG, AMH, AMN, AMPH, AMRS, AMRX, AMYT, ANIP, AP, APDN, APLE, APPN, ASPS, ASYS, AT, ATEC, ATNX, ATRS, AUTL, AVD, AVT, AXDX, AXNX, AYX, AZUL, BAP, BBDC, BBU, BCE, BCEI, BCRX, BDX, BECN, BHC, BHF, BKNG, BL, BLCM, BLFS, BLL, BLRX, BLUE, BMY, BRBR, BSIG, CABO, CAH, CAI, CAPL, CAPR, CARG, CATM, CBB, CBIO, CBT, CCEP, CCOI, CDXC, CDXS, CELH, CEMI, CFX, CHH, CHRS, CHUY, CIGI, CIO, CLDX, CLMT, CLNC, CLNE, CLPR, CLVS, CLXT, CNCE, CNDT, CNP, CNQ, COLD, COMM, CORE, CPST, CRBP, CRON, CTMX, CUBE, CUTR, CWEN, CWK, CYAD, CYTK, CZR, DBX, DDOG, DEI, DEO, DGII, DHC, DHX, DIOD, DLPH, DNB, DOC, DRH, DRNA, DSKE, DVAX, DXC, DXPE, EAF, EB, ECOL, ECOM, ED, EDIT, EDRY, EFC, EGLE, EIDX, ELOX, ELVT, ELY, ENV, EOG, EPAM, EPAY, ESTA, ESTE, EVA, EVBG, EXEL, EXLS, EYE, FDUS, FET, FFG, FGEN, FLDM, FLIR, FLO, FLR, FLT, FNKO, FOUR, FPRX, FSLR, FTNT, G, GCI, GDEN, GDYN, GEO, GERN, GH, GKOS, GLMD, GLP, GLPG, GPL, GPRO, GRPN, GSL, GTN, GTS, GWPH, GWRS, HASI, HCI, HE, HEAR, HFC, HII, HIMX, HL, HLF, HLT, HMHC, HMN, HTA, HWM, IBP, IDCC, IGMS, IHRT, ILMN, IMMR, IMRA, ING, INSM, INTT, INVE, IOVA, IRIX, IRM, IRTC, IRWD, IVR, JCAP, JLL, JYNT, KALA, KBR, KELYA, KINS, KLDO, KRP, KTB, KURA, LAMR, LAUR, LBRDA, LBRDK, LCTX, LCUT, LGF.A, LIND, LIVX, LJPC, LMRK, LNG, LNT, LQDT, LSI, LTHM, LUNA, LVGO, LXP, MAIN, MDWD, MEET, MELI, METC, MFA, MGY, MHK, MITO, MMI, MMS, MNLO, MNPR, MNTX, MR, MRAM, MSI, MTA, MTW, MUR, MYL, NBRV, NBY, NCLH, NDLS, NET, NFG, NGVC, NICE, NINE, NKTR, NLOK, NLTX, NMRK, NNBR, NOMD, NOVT, NREF, NSA, NSCO, NSIT, NTLA, NVO, NWSA, OFIX, OGE, OLED, OPNT, OPRT, ORTX, OSS, OTEX, PAE, PBA, PBH, PBYI, PCRX, PCSB, PCTI, PCTY, PDFS, PDLI, PENN, PETQ, PFNX, PFSI, PH, PLUG, PLYA, PLYM, PMT, PNW, PODD, POST, PRAA, PRAH, PRDO, PRMW, PROF, PRSC, PRSP, PRTA, PRTY, PRVB, PSNL, PTE, PTMN, PVAC, PWFL, PWR, PZG, PZZA, QSR, RBA, RC, REAL, RGNX, RLJ, RMAX, ROLL, RPD, RSG, RST, RVNC, SAIL, SEE, SEEL, SELB, SERV, SHYF, SIC, SJW, SLF, SLGL, SNDX, SP, SPH, SPRO, SRCL, SRTS, SSRM, SSTI, STAR, STFC, STMP, STNG, STXS, SVM, SVMK, SVRA, SWCH, SWI, SWIR, SWX, SYBX, SYNH, SYRS, TAST, TBPH, TCO, TCPC, TDC, TDS, TEN, TGLS, TGP, THR, THS, TLND, TMST, TMUS, TNK, TPIC, TRGP, TRIP, TRUE, TTD, TWI, TWST, TXMD, UBER, UE, UEIC, UNIT, UNVR, UPLD, USM, USPH, UTI, VCTR, VEON, VER, VG, VGR, VRRM, VRS, VSAT, VSTM, VSTO, VVI, VVNT, WCN, WIX, WLDN, WLK, WLKP, WMS, WPRT, WWD, XAIR, XENE, XLRN, XONE, XRAY, XXII, YELP, YETI, ZEUS, ZG, ZIOP, ZTS\n\n - Ex-div:\n\n  AFB, AMTD, ARCB, ARTNA, AUB, BCBP, BPFH, BRKL, CBAN, CEQP, CFFN, CIT, CMCO, CMS, CNXM, CPLP, CVCY, CXO, DHF, DKL, ET, FCBC, FCF, FE, FHI, FIBK, FRAF, FRBA, GMLP, HCC, HMST, HSII, HTLF, INTC, JBHT, JBSS, LBC, LW, MMLP, MMP, MPLX, NBLX, NS, NSC, NXST, NYCB, PCTI, PNFP, PNM, PPBI, PZN, RBNC, RIO, RUSHA, RUSHB, SBFG, SBUX, SCHW, SIRI, SMBK, SUN, UL, UN, WAFD, WFC\n\n - Economic events and announcements:\n\n    - Challenger Job Cuts (previous: 170.219K)\n    - Challenger Job Cuts (previous: 305.5%)\n    - Continuing Jobless Claims (consensus: 16,720K, previous: 17,018K)\n    - FOMC Member Kaplan Speaks\n    - Initial Jobless Claims (consensus: 1,415K, previous: 1,434K)\n    - Jobless Claims 4-Week Avg. (previous: 1,368.50K)\n    - Natural Gas Storage (previous: 26B)\n\n## Upcoming events for Friday, August  7th\n\n - Stock splits:\n\n    - CLAR @ **100.21:100** (Payable date: 08/21/2020)\n\n - Expected earnings:\n\n  ABUS, ASRT, BRK.A, BRK.B, CCO, CIR, CLNY, CNNE, CNTY, CSIQ, CTRA, ENLV, ERF, ESNT, ETM, GNLN, GPX, GVA, HCAP, HMSY, HZN, IEP, INSW, JNCE, KIM, MGA, MRSN, NJR, NOG, NWN, OCUL, PAR, PFSW, RDN, RMR, ROAD, SABR, SCU, SDPI, SFST, SLCT, SNR, SRRK, SSP, SUNW, SVC, TILE, TM, TWIN, UFS, URG, VIRT, VIVO, VTR, YORW, ZYME\n\n - Ex-div:\n\n  AAPL, ACC, AEP, AFIN, ALTA, ALX, AMP, ARCO, AROC, BEDU, BKR, BLX, BSBR, CDR, CLAR, COF, CSV, CWT, EBR, FBMS, GABC, GLP, GSHD, GWW, HAFC, HBCP, HOPE, HTGC, IBM, IBTX, ISBC, JHG, LAZ, LSTR, MC, MPB, MPX, MRBK, MRLN, MWA, NBL, NMM, OLN, OMF, PPG, ROL, SCHN, SJW, SON, SONA, STND, SYX, VNO, WLKP, WVFC, X\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.2%, previous: 5.0%)\n    - Average Hourly Earnings (consensus: -0.5%, previous: -1.2%)\n    - Average Weekly Hours (consensus: 34.4, previous: 34.5)\n    - CFTC Aluminium speculative net positions (previous: 157.6K)\n    - CFTC Copper speculative net positions (previous: 42.5K)\n    - CFTC Corn speculative net positions (previous: -102.4K)\n    - CFTC Crude Oil speculative net positions (previous: 532.6K)\n    - CFTC Gold speculative net positions (previous: 236.8K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 24.1K)\n    - CFTC Natural Gas speculative net positions (previous: -18.7K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -39.2K)\n    - CFTC Silver speculative net positions (previous: 27.3K)\n    - CFTC Soybeans speculative net positions (previous: 113.0K)\n    - CFTC Wheat speculative net positions (previous: 16.7K)\n    - Consumer Credit (consensus: 10.00B, previous: -18.28B)\n    - Government Payrolls (previous: 33.0K)\n    - Manufacturing Payrolls (consensus: 255K, previous: 356K)\n    - Nonfarm Payrolls (consensus: 1,600K, previous: 4,800K)\n    - Participation Rate (previous: 61.5%)\n    - Private Nonfarm Payrolls (consensus: 1,485K, previous: 4,767K)\n    - U6 Unemployment Rate (previous: 18.0%)\n    - Unemployment Rate (consensus: 10.5%, previous: 11.1%)\n    - Wholesale Inventories (consensus: -2.0%, previous: -1.2%)\n    - Wholesale Trade Sales (previous: 5.4%)\n\n^^^^2020-08-05",
        "created_utc": 1596621626,
        "id": "g0ffqco",
        "permalink": "/r/RobinHood/comments/i42jka/daily_discussion_thread_august_5th_2020/g0ffqco/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1596650426.0
    },
    {
        "author": "onlymadebcofnewreddi",
        "body": "Motorola is good too - strong growth last 5 years, still below pre corona peak by quite a bit. All these companies will benefit as more western countries ban Huawei 5g",
        "created_utc": 1596466654,
        "id": "g07p281",
        "permalink": "/r/wallstreetbets/comments/i2va3v/earnings_thread_for_monday_83/g07p281/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596495454.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  6th of August\n\n\n\n## Upcoming events for Thursday, August  6th\n\n - Expected earnings:\n\n  AAOI, AAON, AAWW, AAXN, ABMD, ACEL, ACHV, ACRE, ADAP, ADMS, ADNT, AEE, AEP, AERI, AES, AGEN, AINV, AIRG, AL, ALBO, ALDX, ALEX, ALNY, ALTR, AMAG, AMC, AMH, AMN, AMPH, AMRS, AMRX, AMYT, ANIP, AP, APDN, APLE, APPN, ASPS, ASYS, AT, ATEC, ATNX, ATRS, AUTL, AVD, AVT, AXDX, AXNX, AYX, AZUL, BAP, BBDC, BBU, BCE, BCEI, BCRX, BDX, BECN, BHC, BHF, BKNG, BL, BLCM, BLFS, BLL, BLRX, BLUE, BMY, BRBR, BSIG, CABO, CAH, CAI, CAPL, CAPR, CARG, CATM, CBB, CBIO, CBL, CBT, CCEP, CCOI, CDXC, CDXS, CELH, CEMI, CFX, CHH, CHRS, CHUY, CIGI, CIO, CLDX, CLMT, CLNC, CLNE, CLVS, CLXT, CNCE, CNDT, CNP, CNQ, COLD, COMM, CORE, CPST, CRBP, CRON, CTMX, CTRE, CUBE, CUTR, CWEN, CWK, CYAD, CYRX, CYTK, CZR, DBX, DDOG, DEI, DGII, DHC, DHX, DIOD, DLPH, DNB, DOC, DRH, DRNA, DSKE, DVAX, DXC, DXPE, EAF, EB, ECOL, ECOM, ED, EDIT, EDRY, EFC, EGLE, EIDX, ELOX, ELVT, ELY, ENV, EOG, EPAM, EPAY, ESTA, ESTE, EVA, EVBG, EXEL, EXLS, EYE, FCRD, FDUS, FFG, FGEN, FLDM, FLIR, FLL, FLO, FLR, FLT, FNKO, FOUR, FPRX, FSLR, FTNT, G, GCI, GDEN, GDYN, GEO, GERN, GH, GKOS, GLMD, GLP, GLPG, GPL, GPRO, GRPN, GSL, GTN, GTS, GWPH, GWRS, HASI, HCI, HE, HEAR, HFC, HII, HIMX, HL, HLF, HLT, HMHC, HMN, HTA, HWM, IBP, IDCC, IGMS, IHRT, ILMN, IMMR, IMRA, ING, INSM, INTT, INVE, IOVA, IRIX, IRM, IRTC, IRWD, IVR, JCAP, JLL, JYNT, KALA, KBR, KELYA, KINS, KRP, KTB, KURA, LAMR, LAUR, LBRDA, LBRDK, LCTX, LCUT, LGF.A, LIVX, LJPC, LMRK, LNG, LNT, LQDT, LSI, LTHM, LUNA, LVGO, LXP, MAIN, MDWD, MEET, MELI, METC, MFA, MGY, MHK, MITO, MMI, MMS, MNLO, MNPR, MNTX, MR, MRAM, MSI, MTA, MTW, MUR, MYL, NBRV, NBY, NCLH, NDLS, NET, NFG, NGVC, NH, NICE, NINE, NKTR, NLOK, NLTX, NMRK, NNBR, NOMD, NOVT, NREF, NSA, NSCO, NSIT, NTLA, NVO, NWSA, OFIX, OGE, OLED, OPNT, OPRT, ORTX, OSS, OTEX, PAE, PBA, PBH, PBYI, PCRX, PCSB, PCTI, PCTY, PDFS, PDLI, PENN, PETQ, PFNX, PFSI, PH, PLUG, PLYA, PLYM, PMT, PNW, PODD, POST, PRAA, PRAH, PRDO, PRMW, PROF, PRSC, PRSP, PRTA, PRTY, PRVB, PSNL, PTE, PTMN, PVAC, PWFL, PWR, PZG, PZZA, QSR, RBA, RC, REAL, RGNX, RLJ, RMAX, ROLL, RPD, RSG, RST, RVNC, SAIL, SALM, SEE, SEEL, SELB, SERV, SHYF, SIC, SJW, SLF, SLGL, SNDX, SP, SPH, SPRO, SRCL, SRTS, SSRM, SSTI, STAR, STFC, STMP, STNG, STXS, SVM, SVMK, SVRA, SWCH, SWI, SWIR, SWX, SYBX, SYNH, SYRS, TAST, TBPH, TCO, TCPC, TDC, TDS, TEN, TGLS, TGP, THR, THS, TLND, TMST, TMUS, TNK, TPIC, TRGP, TRIP, TRUE, TTD, TWI, TWST, TXMD, UBER, UE, UEIC, UNIT, UNVR, UPLD, USM, USPH, UTI, VCTR, VEON, VER, VG, VGR, VRRM, VRS, VSAT, VSTM, VSTO, VVI, VVNT, WCN, WIX, WLDN, WLK, WLKP, WMS, WPRT, WWD, XAIR, XENE, XLRN, XONE, XRAY, XXII, YELP, YETI, ZEUS, ZG, ZIOP, ZTS\n\n - Ex-div:\n\n  AFB, AMTD, ARCB, ARTNA, AUB, BCBP, BPFH, BRKL, CBAN, CEQP, CFFN, CIT, CMCO, CMS, CNXM, CPLP, CVCY, CXO, DHF, DKL, ET, FCBC, FCF, FE, FHI, FIBK, FRAF, FRBA, GMLP, HCC, HMST, HSII, HTLF, INTC, JBHT, JBSS, LBC, LW, MMLP, MMP, MPLX, NBLX, NS, NSC, NXST, NYCB, PCTI, PNFP, PNM, PPBI, PZN, RBNC, RIO, RUSHA, RUSHB, SBFG, SBUX, SCHW, SIRI, SMBK, SUN, UL, UN, WAFD, WFC\n\n - Economic events and announcements:\n\n    - Challenger Job Cuts (previous: 170.219K)\n    - Challenger Job Cuts (previous: 305.5%)\n    - Continuing Jobless Claims (consensus: 16,720K, previous: 17,018K)\n    - FOMC Member Kaplan Speaks\n    - Initial Jobless Claims (consensus: 1,415K, previous: 1,434K)\n    - Jobless Claims 4-Week Avg. (previous: 1,368.50K)\n    - Natural Gas Storage (consensus: 30B, previous: 26B)\n\n## Upcoming events for Friday, August  7th\n\n - Stock splits:\n\n    - CLAR @ **100.21:100** (Payable date: 08/21/2020)\n\n - Expected earnings:\n\n  ABUS, ASRT, BRK.A, BRK.B, CCO, CIR, CLNY, CNNE, CNTY, CSIQ, CTRA, ENLV, ERF, ESNT, ETM, FET, GNLN, GPX, GVA, HCAP, HMSY, HZN, IEP, INSW, JNCE, KIM, MGA, MRSN, NJR, NOG, NWN, OCUL, PAR, PFSW, RDN, RMR, ROAD, SABR, SCU, SDPI, SFST, SLCT, SNR, SRGA, SRRK, SSP, SUNW, SVC, TILE, TM, TWIN, UFS, URG, VIRT, VIVO, VTR, YORW, ZYME\n\n - Ex-div:\n\n  AAPL, ACC, AEP, AFIN, ALTA, ALX, AMP, ARCO, AROC, BEDU, BKR, BLX, BSBR, CDR, CLAR, COF, CSV, CWT, EBR, FBMS, GABC, GLP, GSHD, GWW, HAFC, HBCP, HOPE, HTGC, IBM, IBTX, ISBC, JHG, LAZ, LSTR, MC, MPB, MPX, MRBK, MRLN, MWA, NBL, NMM, OLN, OMF, PPG, PPR, ROL, SCHN, SJW, SON, SONA, STND, SYX, VNO, WLKP, WVFC, X\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.2%, previous: 5.0%)\n    - Average Hourly Earnings (consensus: -0.5%, previous: -1.2%)\n    - Average Weekly Hours (consensus: 34.4, previous: 34.5)\n    - CFTC Aluminium speculative net positions (previous: 157.6K)\n    - CFTC Copper speculative net positions (previous: 42.5K)\n    - CFTC Corn speculative net positions (previous: -102.4K)\n    - CFTC Crude Oil speculative net positions (previous: 532.6K)\n    - CFTC Gold speculative net positions (previous: 236.8K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 24.1K)\n    - CFTC Natural Gas speculative net positions (previous: -18.7K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -39.2K)\n    - CFTC Silver speculative net positions (previous: 27.3K)\n    - CFTC Soybeans speculative net positions (previous: 113.0K)\n    - CFTC Wheat speculative net positions (previous: 16.7K)\n    - Consumer Credit (consensus: 10.00B, previous: -18.28B)\n    - Government Payrolls (previous: 33.0K)\n    - Manufacturing Payrolls (consensus: 253K, previous: 356K)\n    - Nonfarm Payrolls (consensus: 1,600K, previous: 4,800K)\n    - Participation Rate (previous: 61.5%)\n    - Private Nonfarm Payrolls (consensus: 1,474K, previous: 4,767K)\n    - U6 Unemployment Rate (previous: 18.0%)\n    - Unemployment Rate (consensus: 10.5%, previous: 11.1%)\n    - Wholesale Inventories (consensus: -2.0%, previous: -1.2%)\n    - Wholesale Trade Sales (previous: 5.4%)\n\n^^^^2020-08-06",
        "created_utc": 1596708016,
        "id": "g0jkj5m",
        "permalink": "/r/RobinHood/comments/i4oznh/daily_discussion_thread_august_6th_2020/g0jkj5m/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1596736816.0
    },
    {
        "author": "BloodMossHunter",
        "body": "MSI - does anyone know anything about them? they climbed today..actually climbing slowly all month",
        "created_utc": 1597345194,
        "id": "g1cwksb",
        "permalink": "/r/wallstreetbets/comments/i8xa70/daily_discussion_thread_for_august_13_2020/g1cwksb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597373994.0
    },
    {
        "author": "thehappyheathen",
        "body": "Me and my Motorola flip phone disagree. The future is flip phones",
        "created_utc": 1597627283,
        "id": "g1sjzup",
        "permalink": "/r/investing/comments/iaxj38/investors_are_clinging_to_an_outdated_strategy_at/g1sjzup/",
        "score": 1,
        "subreddit": "investing",
        "created": 1597656083.0
    },
    {
        "author": "SunneSonne",
        "body": "Man, just hold it, or wait for some dips in other tech stocks. Apple is not going anywhere any time soon, it’s not blackberry or Motorola or Nokia, Apple was like tsla at the start with its ideas of touchscreen phones",
        "created_utc": 1597781091,
        "id": "g20xuew",
        "permalink": "/r/wallstreetbets/comments/ibujf9/grandpa_died_and_left_me_with_7000_shares_of_aapl/g20xuew/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597809891.0
    },
    {
        "author": "1564Baxter",
        "body": "Bro you think I’m rich or sum? Looking at the 2005 Motorola rzr",
        "created_utc": 1596362844,
        "id": "g02s2hm",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g02s2hm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596391644.0
    },
    {
        "author": "flyingorange",
        "body": "Companies having earnings this week which have surpassed the expected results during the previous earnings (sorted by date).\n\n|symbol|earnings_date|curr_expected|q1_date|q1_expected|q1_actual|q2_date|q2_actual|q2_expected|q3_date|q3_actual|q3_expected|q4_date|q4_actual|q4_expected|\n:--|--:|--:|:--|--:|--:|:--|--:|--:|:--|--:|--:|:--|--:|--:|\n|TTWO|2020.08.03|1.6|2Q2019|0.02|0.27|3Q2019|1.93|1.69|4Q2019|1.63|1.75|1Q2020|1.5|0.89|\n|ESS|2020.08.03|1.08|2Q2019|1.23|1.4|3Q2019|1.51|1.34|4Q2019|1.95|1.39|1Q2020|4.76|1.51|\n|LEG|2020.08.03|0.07|2Q2019|0.64|0.64|3Q2019|0.76|0.67|4Q2019|0.68|0.66|1Q2020|0.41|0.33|\n|CLX|2020.08.03|1.99|2Q2019|1.83|1.88|3Q2019|1.59|1.54|4Q2019|1.46|1.31|1Q2020|1.89|1.67|\n|CMS|2020.08.03|0.42|2Q2019|0.36|0.33|3Q2019|0.73|0.67|4Q2019|0.68|0.69|1Q2020|0.86|0.79|\n|MPC|2020.08.03|-1.75|2Q2019|1.32|1.73|3Q2019|1.63|1.38|4Q2019|1.56|0.86|1Q2020|-0.16|-0.31|\n|NBL|2020.08.03|-0.34|2Q2019|-0.12|-0.1|3Q2019|-0.1|-0.11|4Q2019|-0.05|-0.08|1Q2020|0.18|0.03|\n|MCK|2020.08.03|2.29|2Q2019|3.01|3.31|3Q2019|3.6|3.6|4Q2019|3.81|3.56|1Q2020|4.27|4.1|\n|GPN|2020.08.03|1.2|2Q2019|1.46|1.51|3Q2019|1.7|1.67|4Q2019|1.62|1.59|1Q2020|1.58|1.53|\n|EMN|2020.08.03|1.05|2Q2019|2.09|1.99|3Q2019|1.94|1.98|4Q2019|1.42|1.33|1Q2020|2.03|1.71|\n|FANG|2020.08.03|0.01|2Q2019|1.78|1.7|3Q2019|1.47|1.74|4Q2019|1.93|1.8|1Q2020|1.45|1.29|\n|MOS|2020.08.03|-0.01|2Q2019|0.29|0.12|3Q2019|0.08|0.22|4Q2019|-0.29|-0.05|1Q2020|-0.06|-0.08|\n|KLAC|2020.08.03|2.41|2Q2019|1.73|1.78|3Q2019|2.48|2.2|4Q2019|2.66|2.58|1Q2020|2.47|2.28|\n|STE|2020.08.03|0.96|2Q2019|1.11|1.23|3Q2019|1.32|1.25|4Q2019|1.45|1.42|1Q2020|1.64|1.57|\n|J|2020.08.03|1|2Q2019|1.24|1.4|3Q2019|1.48|1.32|4Q2019|1.2|1.19|1Q2020|1.39|1.3|\n|VMC|2020.08.04|1.38|2Q2019|1.47|1.48|3Q2019|1.68|1.7|4Q2019|1.08|1.17|1Q2020|0.47|0.43|\n|EMR|2020.08.04|0.6|2Q2019|0.94|0.97|3Q2019|1.16|1.08|4Q2019|0.67|0.67|1Q2020|0.89|0.74|\n|MCHP|2020.08.04|1.43|2Q2019|1.37|1.41|3Q2019|1.43|1.43|4Q2019|1.32|1.26|1Q2020|1.46|1.35|\n|EXC|2020.08.04|0.43|2Q2019|0.61|0.6|3Q2019|0.92|0.89|4Q2019|0.83|0.73|1Q2020|0.87|0.85|\n|TDG|2020.08.04|0.94|2Q2019|4.3|4.95|3Q2019|5.62|5.31|4Q2019|4.93|4.65|1Q2020|5.1|4.36|\n|PEAK|2020.08.04|0.05|2Q2019|0.13|-0.03|3Q2019|-0.09|0.05|4Q2019|0.09|0.08|1Q2020|0.54|0.1|\n|HSIC|2020.08.04|-0.11|2Q2019|0.83|0.84|3Q2019|0.9|0.86|4Q2019|0.97|0.91|1Q2020|0.94|0.73|\n|IT|2020.08.04|0.81|2Q2019|1.18|1.45|3Q2019|0.7|0.43|4Q2019|1.18|0.81|1Q2020|1.2|0.32|\n|FOXA|2020.08.04|0.57|2Q2019|0.59|0.62|3Q2019|0.83|0.69|4Q2019|0.1|-0.02|1Q2020|0.93|0.7|\n|VRSK|2020.08.04|1.19|2Q2019|1.1|1.1|3Q2019|1.12|1.13|4Q2019|1.13|1.12|1Q2020|1.17|1.13|\n|FMC|2020.08.04|1.66|2Q2019|1.65|1.66|3Q2019|0.94|0.81|4Q2019|1.76|1.54|1Q2020|1.84|1.78|\n|EXPD|2020.08.04|0.71|2Q2019|0.81|0.88|3Q2019|0.92|0.91|4Q2019|0.79|0.85|1Q2020|0.71|0.64|\n|IPGP|2020.08.04|0.6|2Q2019|1.38|1.34|3Q2019|1.07|1.21|4Q2019|0.75|0.8|1Q2020|0.68|0.19|\n|DVN|2020.08.04|-0.25|2Q2019|0.34|0.23|3Q2019|0.29|0.16|4Q2019|0.36|0.32|1Q2020|0.13|-0.22|\n|ATVI|2020.08.04|0.68|2Q2019|0.26|0.38|3Q2019|0.32|0.23|4Q2019|1.23|1.19|1Q2020|0.58|0.38|\n|PAYC|2020.08.04|0.63|2Q2019|0.7|0.75|3Q2019|0.7|0.67|4Q2019|0.86|0.77|1Q2020|1.33|1.26|\n|ALL|2020.08.04|1.55|2Q2019|1.53|2.18|3Q2019|2.84|2.64|4Q2019|3.13|3.24|1Q2020|3.54|3.5|\n|PXD|2020.08.04|-0.32|2Q2019|1.95|2.01|3Q2019|1.99|1.99|4Q2019|2.36|2.09|1Q2020|1.15|1.11|\n|BDX|2020.08.04|2.04|2Q2019|3.05|3.08|3Q2019|3.31|3.3|4Q2019|2.65|2.63|1Q2020|2.55|2.32|\n|AME|2020.08.04|0.72|2Q2019|1.02|1.05|3Q2019|1.06|1.01|4Q2019|1.08|1.03|1Q2020|1.02|0.96|\n|PGR|2020.08.04|1.4|3Q2019|1.3|1.33|4Q2019|1.18|1.16|1Q2020|1.91|1.52|2Q2020|1.84|1.73|\n|ANET|2020.08.04|1.95|2Q2019|2.2|2.44|3Q2019|2.69|2.41|4Q2019|2.29|2.1|1Q2020|2.02|1.81|\n|ZBH|2020.08.04|-0.73|2Q2019|1.91|1.93|3Q2019|1.77|1.75|4Q2019|2.3|2.27|1Q2020|1.7|1.38|\n|WU|2020.08.04|0.34|2Q2019|0.6|0.45|3Q2019|0.49|0.46|4Q2019|0.38|0.43|1Q2020|0.44|0.41|\n|WRK|2020.08.04|0.48|2Q2019|1.01|1.11|3Q2019|1.24|1.19|4Q2019|0.58|0.59|1Q2020|0.67|0.61|\n|WEC|2020.08.04|0.68|2Q2019|0.7|0.74|3Q2019|0.74|0.71|4Q2019|0.77|0.72|1Q2020|1.43|1.32|\n|MNST|2020.08.04|0.49|2Q2019|0.56|0.53|3Q2019|0.55|0.54|4Q2019|0.47|0.47|1Q2020|0.52|0.48|\n|PRGO|2020.08.05|0.88|2Q2019|0.79|0.86|3Q2019|1.04|0.93|4Q2019|1.06|1.07|1Q2020|1.14|1.03|\n|MET|2020.08.05|0.9|2Q2019|1.34|1.38|3Q2019|1.27|1.39|4Q2019|1.98|1.37|1Q2020|1.58|1.44|\n|REGN|2020.08.05|5.98|2Q2019|5.41|6.02|3Q2019|6.67|6.36|4Q2019|7.5|6.92|1Q2020|6.6|6.13|\n|LYV|2020.08.05|-2.08|2Q2019|0.4|0.41|3Q2019|0.71|0.77|4Q2019|-0.88|-0.71|1Q2020|-0.94|-0.97|\n|RMD|2020.08.05|1.08|2Q2019|0.94|0.95|3Q2019|0.93|0.87|4Q2019|1.21|1.02|1Q2020|1.29|1.04|\n|LNC|2020.08.05|1.39|2Q2019|2.36|2.36|3Q2019|-0.25|2.41|4Q2019|2.41|2.41|1Q2020|2.24|2.21|\n|PSA|2020.08.05|1.62|2Q2019|1.83|1.76|3Q2019|1.93|1.9|4Q2019|1.87|2.01|1Q2020|1.79|1.71|\n|NRG|2020.08.05|1.39|2Q2019|0.76|0.7|3Q2019|1.88|2.1|4Q2019|0.43|0.59|1Q2020|0.53|0.49|\n|ALB|2020.08.05|0.73|2Q2019|1.44|1.55|3Q2019|1.53|1.56|4Q2019|1.73|1.74|1Q2020|1|0.83|\n|CF|2020.08.05|0.65|2Q2019|0.86|1.28|3Q2019|0.29|0.35|4Q2019|0.33|0.26|1Q2020|0.31|0.25|\n|CDW|2020.08.05|1.38|2Q2019|1.52|1.6|3Q2019|1.7|1.58|4Q2019|1.57|1.48|1Q2020|1.38|1.34|\n|BWA|2020.08.05|-0.47|2Q2019|1|1|3Q2019|0.96|0.85|4Q2019|1.17|1.03|1Q2020|0.77|0.5|\n|HUM|2020.08.05|10.27|2Q2019|5.3|6.05|3Q2019|5.03|4.58|4Q2019|2.28|2.2|1Q2020|5.4|4.68|\n|ATO|2020.08.05|0.76|2Q2019|0.68|0.68|3Q2019|0.49|0.46|4Q2019|1.47|1.49|1Q2020|1.95|1.92|\n|ANSS|2020.08.05|1.16|2Q2019|1.28|1.61|3Q2019|1.42|1.26|4Q2019|2.24|1.98|1Q2020|0.83|0.8|\n|ABC|2020.08.05|1.56|2Q2019|1.62|1.76|3Q2019|1.61|1.58|4Q2019|1.76|1.67|1Q2020|2.4|2.27|\n|AWK|2020.08.05|0.96|2Q2019|0.93|0.94|3Q2019|1.33|1.3|4Q2019|0.73|0.73|1Q2020|0.67|0.65|\n|CTL|2020.08.05|0.32|2Q2019|0.31|0.34|3Q2019|0.31|0.33|4Q2019|0.33|0.33|1Q2020|0.37|0.34|\n|WELL|2020.08.05|0.21|2Q2019|0.5|0.34|3Q2019|1.45|0.47|4Q2019|0.55|0.3|1Q2020|0.75|0.37|\n|SRE|2020.08.05|1.5|2Q2019|1.16|1.1|3Q2019|1.5|1.47|4Q2019|1.55|1.48|1Q2020|3.08|2.26|\n|DISCK|2020.08.05|0.68|2Q2019|1.06|1.61|3Q2019|0.87|0.82|4Q2019|0.98|0.89|1Q2020|0.87|0.82|\n|CTVA|2020.08.05|1.24|2Q2019|0.99|1.42|3Q2019|-0.39|-0.46|4Q2019|0.07|-0.12|1Q2020|0.59|0.4|\n|EXR|2020.08.05|0.73|2Q2019|0.75|0.77|3Q2019|0.79|0.81|4Q2019|0.82|0.79|1Q2020|0.83|0.76|\n|RE|2020.08.05|1.48|2Q2019|6.44|7.85|3Q2019|3.39|2.21|4Q2019|3.2|2.64|1Q2020|4.03|3.61|\n|CVS|2020.08.05|1.91|2Q2019|1.69|1.89|3Q2019|1.84|1.77|4Q2019|1.73|1.68|1Q2020|1.91|1.63|\n|PWR|2020.08.06|0.48|2Q2019|0.83|0.31|3Q2019|1.14|1.03|4Q2019|0.93|0.82|1Q2020|0.47|0.46|\n|TMUS|2020.08.06|0.07|2Q2019|0.97|1.09|3Q2019|1.01|0.96|4Q2019|0.87|0.83|1Q2020|1.1|1.02|\n|RSG|2020.08.06|0.58|2Q2019|0.77|0.79|3Q2019|0.91|0.85|4Q2019|0.91|0.88|1Q2020|0.77|0.76|\n|ZTS|2020.08.06|0.64|2Q2019|0.82|0.9|3Q2019|0.94|0.88|4Q2019|0.92|0.88|1Q2020|0.95|0.86|\n|SEE|2020.08.06|0.57|2Q2019|0.64|0.8|3Q2019|0.64|0.62|4Q2019|0.78|0.74|1Q2020|0.73|0.58|\n|PNW|2020.08.06|1.45|2Q2019|1.42|1.28|3Q2019|2.77|3|4Q2019|0.57|0.46|1Q2020|0.27|0.15|\n|PH|2020.08.06|1.51|2Q2019|3.11|3.31|3Q2019|2.76|2.65|4Q2019|2.54|2.27|1Q2020|2.92|2.27|\n|HFC|2020.08.06|-0.55|2Q2019|1.64|2.18|3Q2019|1.68|1.42|4Q2019|0.48|0.52|1Q2020|0.53|0.41|\n|FTNT|2020.08.06|0.65|2Q2019|0.5|0.58|3Q2019|0.67|0.56|4Q2019|0.76|0.7|1Q2020|0.6|0.51|\n|DXC|2020.08.06|0.12|2Q2019|1.7|1.74|3Q2019|1.38|1.42|4Q2019|1.25|1.09|1Q2020|1.2|0.97|\n|XRAY|2020.08.06|-0.02|2Q2019|0.63|0.66|3Q2019|0.57|0.5|4Q2019|0.73|0.75|1Q2020|0.43|0.38|\n|NET|2020.08.06|-0.06|3Q2019|-0.15|-0.15|4Q2019|-0.06|-0.07|1Q2020|-0.04|-0.06||||\n|CNP|2020.08.06|0.21|2Q2019|0.31|0.35|3Q2019|0.53|0.43|4Q2019|0.45|0.36|1Q2020|0.65|0.44|\n|CAH|2020.08.06|0.91|2Q2019|0.93|1.11|3Q2019|1.27|1.09|4Q2019|1.52|1.22|1Q2020|1.62|1.43|\n|BMY|2020.08.06|1.48|2Q2019|1.06|1.18|3Q2019|1.17|1.07|4Q2019|1.22|0.88|1Q2020|1.72|1.49|\n|HLT|2020.08.06|-0.31|2Q2019|1.01|1.06|3Q2019|1.05|1.02|4Q2019|1|0.96|1Q2020|0.74|0.55|\n|HWM|2020.08.06|0.06|2Q2019|0.5|0.58|3Q2019|0.58|0.52|4Q2019|0.53|0.54|1Q2020|0.62|0.44|\n|BLL|2020.08.06|0.56|2Q2019|0.64|0.64|3Q2019|0.7|0.72|4Q2019|0.71|0.67|1Q2020|0.61|0.6|\n|NLOK|2020.08.06|0.22|2Q2019|0.32|0.21|3Q2019|0.18|0.41|4Q2019|0.25|0.08|1Q2020|0.26|0.19|\n|NWSA|2020.08.06|-0.09|2Q2019|0.03|0.07|3Q2019|0.04|0.05|4Q2019|0.18|0.15|1Q2020|0.03|0.01|\n|MYL|2020.08.06|0.98|2Q2019|0.95|1.03|3Q2019|1.17|1.13|4Q2019|1.4|1.28|1Q2020|0.9|0.86|\n|MSI|2020.08.06|1.21|2Q2019|1.6|1.69|3Q2019|2.04|1.95|4Q2019|2.94|2.78|1Q2020|1.49|1.28|\n|FLT|2020.08.06|2.24|2Q2019|2.8|2.85|3Q2019|3.1|3.05|4Q2019|3.17|3.13|1Q2020|3|2.83|\n|IRM|2020.08.06|0.13|2Q2019|0.23|0.23|3Q2019|0.32|0.3|4Q2019|0.31|0.32|1Q2020|0.27|0.18|\n|ILMN|2020.08.06|0.67|2Q2019|1.34|1.35|3Q2019|1.93|1.4|4Q2019|1.7|1.58|1Q2020|1.64|1.25|\n|LNT|2020.08.06|0.46|2Q2019|0.44|0.4|3Q2019|0.94|0.93|4Q2019|0.46|0.43|1Q2020|0.7|0.54|\n|KIM|2020.08.07|0.07|2Q2019|0.17|0.2|3Q2019|0.14|0.17|4Q2019|0.22|0.17|1Q2020|0.19|0.18|\n|VTR|2020.08.07|0.25|2Q2019|0.32|0.58|3Q2019|0.23|0.32|4Q2019|0.03|0.27|1Q2020|1.26|0.22|",
        "created_utc": 1596310372,
        "id": "g00jfau",
        "permalink": "/r/options/comments/i1shtz/most_anticipated_earnings_releases_for_the_week/g00jfau/",
        "score": 1,
        "subreddit": "options",
        "created": 1596339172.0
    },
    {
        "author": "flyingorange",
        "body": "Companies having earnings this week which have surpassed the expected results during the previous earnings (sorted by date).\n\n|symbol|earnings_date|curr_expected|q1_date|q1_expected|q1_actual|q2_date|q2_actual|q2_expected|q3_date|q3_actual|q3_expected|q4_date|q4_actual|q4_expected|\n:--|--:|--:|:--|--:|--:|:--|--:|--:|:--|--:|--:|:--|--:|--:|\n|TTWO|2020.08.03|1.6|2Q2019|0.02|0.27|3Q2019|1.93|1.69|4Q2019|1.63|1.75|1Q2020|1.5|0.89|\n|ESS|2020.08.03|1.08|2Q2019|1.23|1.4|3Q2019|1.51|1.34|4Q2019|1.95|1.39|1Q2020|4.76|1.51|\n|LEG|2020.08.03|0.07|2Q2019|0.64|0.64|3Q2019|0.76|0.67|4Q2019|0.68|0.66|1Q2020|0.41|0.33|\n|CLX|2020.08.03|1.99|2Q2019|1.83|1.88|3Q2019|1.59|1.54|4Q2019|1.46|1.31|1Q2020|1.89|1.67|\n|CMS|2020.08.03|0.42|2Q2019|0.36|0.33|3Q2019|0.73|0.67|4Q2019|0.68|0.69|1Q2020|0.86|0.79|\n|MPC|2020.08.03|-1.75|2Q2019|1.32|1.73|3Q2019|1.63|1.38|4Q2019|1.56|0.86|1Q2020|-0.16|-0.31|\n|NBL|2020.08.03|-0.34|2Q2019|-0.12|-0.1|3Q2019|-0.1|-0.11|4Q2019|-0.05|-0.08|1Q2020|0.18|0.03|\n|MCK|2020.08.03|2.29|2Q2019|3.01|3.31|3Q2019|3.6|3.6|4Q2019|3.81|3.56|1Q2020|4.27|4.1|\n|GPN|2020.08.03|1.2|2Q2019|1.46|1.51|3Q2019|1.7|1.67|4Q2019|1.62|1.59|1Q2020|1.58|1.53|\n|EMN|2020.08.03|1.05|2Q2019|2.09|1.99|3Q2019|1.94|1.98|4Q2019|1.42|1.33|1Q2020|2.03|1.71|\n|FANG|2020.08.03|0.01|2Q2019|1.78|1.7|3Q2019|1.47|1.74|4Q2019|1.93|1.8|1Q2020|1.45|1.29|\n|MOS|2020.08.03|-0.01|2Q2019|0.29|0.12|3Q2019|0.08|0.22|4Q2019|-0.29|-0.05|1Q2020|-0.06|-0.08|\n|KLAC|2020.08.03|2.41|2Q2019|1.73|1.78|3Q2019|2.48|2.2|4Q2019|2.66|2.58|1Q2020|2.47|2.28|\n|STE|2020.08.03|0.96|2Q2019|1.11|1.23|3Q2019|1.32|1.25|4Q2019|1.45|1.42|1Q2020|1.64|1.57|\n|J|2020.08.03|1|2Q2019|1.24|1.4|3Q2019|1.48|1.32|4Q2019|1.2|1.19|1Q2020|1.39|1.3|\n|VMC|2020.08.04|1.38|2Q2019|1.47|1.48|3Q2019|1.68|1.7|4Q2019|1.08|1.17|1Q2020|0.47|0.43|\n|EMR|2020.08.04|0.6|2Q2019|0.94|0.97|3Q2019|1.16|1.08|4Q2019|0.67|0.67|1Q2020|0.89|0.74|\n|MCHP|2020.08.04|1.43|2Q2019|1.37|1.41|3Q2019|1.43|1.43|4Q2019|1.32|1.26|1Q2020|1.46|1.35|\n|EXC|2020.08.04|0.43|2Q2019|0.61|0.6|3Q2019|0.92|0.89|4Q2019|0.83|0.73|1Q2020|0.87|0.85|\n|TDG|2020.08.04|0.94|2Q2019|4.3|4.95|3Q2019|5.62|5.31|4Q2019|4.93|4.65|1Q2020|5.1|4.36|\n|PEAK|2020.08.04|0.05|2Q2019|0.13|-0.03|3Q2019|-0.09|0.05|4Q2019|0.09|0.08|1Q2020|0.54|0.1|\n|HSIC|2020.08.04|-0.11|2Q2019|0.83|0.84|3Q2019|0.9|0.86|4Q2019|0.97|0.91|1Q2020|0.94|0.73|\n|IT|2020.08.04|0.81|2Q2019|1.18|1.45|3Q2019|0.7|0.43|4Q2019|1.18|0.81|1Q2020|1.2|0.32|\n|FOXA|2020.08.04|0.57|2Q2019|0.59|0.62|3Q2019|0.83|0.69|4Q2019|0.1|-0.02|1Q2020|0.93|0.7|\n|VRSK|2020.08.04|1.19|2Q2019|1.1|1.1|3Q2019|1.12|1.13|4Q2019|1.13|1.12|1Q2020|1.17|1.13|\n|FMC|2020.08.04|1.66|2Q2019|1.65|1.66|3Q2019|0.94|0.81|4Q2019|1.76|1.54|1Q2020|1.84|1.78|\n|EXPD|2020.08.04|0.71|2Q2019|0.81|0.88|3Q2019|0.92|0.91|4Q2019|0.79|0.85|1Q2020|0.71|0.64|\n|IPGP|2020.08.04|0.6|2Q2019|1.38|1.34|3Q2019|1.07|1.21|4Q2019|0.75|0.8|1Q2020|0.68|0.19|\n|DVN|2020.08.04|-0.25|2Q2019|0.34|0.23|3Q2019|0.29|0.16|4Q2019|0.36|0.32|1Q2020|0.13|-0.22|\n|ATVI|2020.08.04|0.68|2Q2019|0.26|0.38|3Q2019|0.32|0.23|4Q2019|1.23|1.19|1Q2020|0.58|0.38|\n|PAYC|2020.08.04|0.63|2Q2019|0.7|0.75|3Q2019|0.7|0.67|4Q2019|0.86|0.77|1Q2020|1.33|1.26|\n|ALL|2020.08.04|1.55|2Q2019|1.53|2.18|3Q2019|2.84|2.64|4Q2019|3.13|3.24|1Q2020|3.54|3.5|\n|PXD|2020.08.04|-0.32|2Q2019|1.95|2.01|3Q2019|1.99|1.99|4Q2019|2.36|2.09|1Q2020|1.15|1.11|\n|BDX|2020.08.04|2.04|2Q2019|3.05|3.08|3Q2019|3.31|3.3|4Q2019|2.65|2.63|1Q2020|2.55|2.32|\n|AME|2020.08.04|0.72|2Q2019|1.02|1.05|3Q2019|1.06|1.01|4Q2019|1.08|1.03|1Q2020|1.02|0.96|\n|PGR|2020.08.04|1.4|3Q2019|1.3|1.33|4Q2019|1.18|1.16|1Q2020|1.91|1.52|2Q2020|1.84|1.73|\n|ANET|2020.08.04|1.95|2Q2019|2.2|2.44|3Q2019|2.69|2.41|4Q2019|2.29|2.1|1Q2020|2.02|1.81|\n|ZBH|2020.08.04|-0.73|2Q2019|1.91|1.93|3Q2019|1.77|1.75|4Q2019|2.3|2.27|1Q2020|1.7|1.38|\n|WU|2020.08.04|0.34|2Q2019|0.6|0.45|3Q2019|0.49|0.46|4Q2019|0.38|0.43|1Q2020|0.44|0.41|\n|WRK|2020.08.04|0.48|2Q2019|1.01|1.11|3Q2019|1.24|1.19|4Q2019|0.58|0.59|1Q2020|0.67|0.61|\n|WEC|2020.08.04|0.68|2Q2019|0.7|0.74|3Q2019|0.74|0.71|4Q2019|0.77|0.72|1Q2020|1.43|1.32|\n|MNST|2020.08.04|0.49|2Q2019|0.56|0.53|3Q2019|0.55|0.54|4Q2019|0.47|0.47|1Q2020|0.52|0.48|\n|PRGO|2020.08.05|0.88|2Q2019|0.79|0.86|3Q2019|1.04|0.93|4Q2019|1.06|1.07|1Q2020|1.14|1.03|\n|MET|2020.08.05|0.9|2Q2019|1.34|1.38|3Q2019|1.27|1.39|4Q2019|1.98|1.37|1Q2020|1.58|1.44|\n|REGN|2020.08.05|5.98|2Q2019|5.41|6.02|3Q2019|6.67|6.36|4Q2019|7.5|6.92|1Q2020|6.6|6.13|\n|LYV|2020.08.05|-2.08|2Q2019|0.4|0.41|3Q2019|0.71|0.77|4Q2019|-0.88|-0.71|1Q2020|-0.94|-0.97|\n|RMD|2020.08.05|1.08|2Q2019|0.94|0.95|3Q2019|0.93|0.87|4Q2019|1.21|1.02|1Q2020|1.29|1.04|\n|LNC|2020.08.05|1.39|2Q2019|2.36|2.36|3Q2019|-0.25|2.41|4Q2019|2.41|2.41|1Q2020|2.24|2.21|\n|PSA|2020.08.05|1.62|2Q2019|1.83|1.76|3Q2019|1.93|1.9|4Q2019|1.87|2.01|1Q2020|1.79|1.71|\n|NRG|2020.08.05|1.39|2Q2019|0.76|0.7|3Q2019|1.88|2.1|4Q2019|0.43|0.59|1Q2020|0.53|0.49|\n|ALB|2020.08.05|0.73|2Q2019|1.44|1.55|3Q2019|1.53|1.56|4Q2019|1.73|1.74|1Q2020|1|0.83|\n|CF|2020.08.05|0.65|2Q2019|0.86|1.28|3Q2019|0.29|0.35|4Q2019|0.33|0.26|1Q2020|0.31|0.25|\n|CDW|2020.08.05|1.38|2Q2019|1.52|1.6|3Q2019|1.7|1.58|4Q2019|1.57|1.48|1Q2020|1.38|1.34|\n|BWA|2020.08.05|-0.47|2Q2019|1|1|3Q2019|0.96|0.85|4Q2019|1.17|1.03|1Q2020|0.77|0.5|\n|HUM|2020.08.05|10.27|2Q2019|5.3|6.05|3Q2019|5.03|4.58|4Q2019|2.28|2.2|1Q2020|5.4|4.68|\n|ATO|2020.08.05|0.76|2Q2019|0.68|0.68|3Q2019|0.49|0.46|4Q2019|1.47|1.49|1Q2020|1.95|1.92|\n|ANSS|2020.08.05|1.16|2Q2019|1.28|1.61|3Q2019|1.42|1.26|4Q2019|2.24|1.98|1Q2020|0.83|0.8|\n|ABC|2020.08.05|1.56|2Q2019|1.62|1.76|3Q2019|1.61|1.58|4Q2019|1.76|1.67|1Q2020|2.4|2.27|\n|AWK|2020.08.05|0.96|2Q2019|0.93|0.94|3Q2019|1.33|1.3|4Q2019|0.73|0.73|1Q2020|0.67|0.65|\n|CTL|2020.08.05|0.32|2Q2019|0.31|0.34|3Q2019|0.31|0.33|4Q2019|0.33|0.33|1Q2020|0.37|0.34|\n|WELL|2020.08.05|0.21|2Q2019|0.5|0.34|3Q2019|1.45|0.47|4Q2019|0.55|0.3|1Q2020|0.75|0.37|\n|SRE|2020.08.05|1.5|2Q2019|1.16|1.1|3Q2019|1.5|1.47|4Q2019|1.55|1.48|1Q2020|3.08|2.26|\n|DISCK|2020.08.05|0.68|2Q2019|1.06|1.61|3Q2019|0.87|0.82|4Q2019|0.98|0.89|1Q2020|0.87|0.82|\n|CTVA|2020.08.05|1.24|2Q2019|0.99|1.42|3Q2019|-0.39|-0.46|4Q2019|0.07|-0.12|1Q2020|0.59|0.4|\n|EXR|2020.08.05|0.73|2Q2019|0.75|0.77|3Q2019|0.79|0.81|4Q2019|0.82|0.79|1Q2020|0.83|0.76|\n|RE|2020.08.05|1.48|2Q2019|6.44|7.85|3Q2019|3.39|2.21|4Q2019|3.2|2.64|1Q2020|4.03|3.61|\n|CVS|2020.08.05|1.91|2Q2019|1.69|1.89|3Q2019|1.84|1.77|4Q2019|1.73|1.68|1Q2020|1.91|1.63|\n|PWR|2020.08.06|0.48|2Q2019|0.83|0.31|3Q2019|1.14|1.03|4Q2019|0.93|0.82|1Q2020|0.47|0.46|\n|TMUS|2020.08.06|0.07|2Q2019|0.97|1.09|3Q2019|1.01|0.96|4Q2019|0.87|0.83|1Q2020|1.1|1.02|\n|RSG|2020.08.06|0.58|2Q2019|0.77|0.79|3Q2019|0.91|0.85|4Q2019|0.91|0.88|1Q2020|0.77|0.76|\n|ZTS|2020.08.06|0.64|2Q2019|0.82|0.9|3Q2019|0.94|0.88|4Q2019|0.92|0.88|1Q2020|0.95|0.86|\n|SEE|2020.08.06|0.57|2Q2019|0.64|0.8|3Q2019|0.64|0.62|4Q2019|0.78|0.74|1Q2020|0.73|0.58|\n|PNW|2020.08.06|1.45|2Q2019|1.42|1.28|3Q2019|2.77|3|4Q2019|0.57|0.46|1Q2020|0.27|0.15|\n|PH|2020.08.06|1.51|2Q2019|3.11|3.31|3Q2019|2.76|2.65|4Q2019|2.54|2.27|1Q2020|2.92|2.27|\n|HFC|2020.08.06|-0.55|2Q2019|1.64|2.18|3Q2019|1.68|1.42|4Q2019|0.48|0.52|1Q2020|0.53|0.41|\n|FTNT|2020.08.06|0.65|2Q2019|0.5|0.58|3Q2019|0.67|0.56|4Q2019|0.76|0.7|1Q2020|0.6|0.51|\n|DXC|2020.08.06|0.12|2Q2019|1.7|1.74|3Q2019|1.38|1.42|4Q2019|1.25|1.09|1Q2020|1.2|0.97|\n|XRAY|2020.08.06|-0.02|2Q2019|0.63|0.66|3Q2019|0.57|0.5|4Q2019|0.73|0.75|1Q2020|0.43|0.38|\n|NET|2020.08.06|-0.06|3Q2019|-0.15|-0.15|4Q2019|-0.06|-0.07|1Q2020|-0.04|-0.06||||\n|CNP|2020.08.06|0.21|2Q2019|0.31|0.35|3Q2019|0.53|0.43|4Q2019|0.45|0.36|1Q2020|0.65|0.44|\n|CAH|2020.08.06|0.91|2Q2019|0.93|1.11|3Q2019|1.27|1.09|4Q2019|1.52|1.22|1Q2020|1.62|1.43|\n|BMY|2020.08.06|1.48|2Q2019|1.06|1.18|3Q2019|1.17|1.07|4Q2019|1.22|0.88|1Q2020|1.72|1.49|\n|HLT|2020.08.06|-0.31|2Q2019|1.01|1.06|3Q2019|1.05|1.02|4Q2019|1|0.96|1Q2020|0.74|0.55|\n|HWM|2020.08.06|0.06|2Q2019|0.5|0.58|3Q2019|0.58|0.52|4Q2019|0.53|0.54|1Q2020|0.62|0.44|\n|BLL|2020.08.06|0.56|2Q2019|0.64|0.64|3Q2019|0.7|0.72|4Q2019|0.71|0.67|1Q2020|0.61|0.6|\n|NLOK|2020.08.06|0.22|2Q2019|0.32|0.21|3Q2019|0.18|0.41|4Q2019|0.25|0.08|1Q2020|0.26|0.19|\n|NWSA|2020.08.06|-0.09|2Q2019|0.03|0.07|3Q2019|0.04|0.05|4Q2019|0.18|0.15|1Q2020|0.03|0.01|\n|MYL|2020.08.06|0.98|2Q2019|0.95|1.03|3Q2019|1.17|1.13|4Q2019|1.4|1.28|1Q2020|0.9|0.86|\n|MSI|2020.08.06|1.21|2Q2019|1.6|1.69|3Q2019|2.04|1.95|4Q2019|2.94|2.78|1Q2020|1.49|1.28|\n|FLT|2020.08.06|2.24|2Q2019|2.8|2.85|3Q2019|3.1|3.05|4Q2019|3.17|3.13|1Q2020|3|2.83|\n|IRM|2020.08.06|0.13|2Q2019|0.23|0.23|3Q2019|0.32|0.3|4Q2019|0.31|0.32|1Q2020|0.27|0.18|\n|ILMN|2020.08.06|0.67|2Q2019|1.34|1.35|3Q2019|1.93|1.4|4Q2019|1.7|1.58|1Q2020|1.64|1.25|\n|LNT|2020.08.06|0.46|2Q2019|0.44|0.4|3Q2019|0.94|0.93|4Q2019|0.46|0.43|1Q2020|0.7|0.54|\n|KIM|2020.08.07|0.07|2Q2019|0.17|0.2|3Q2019|0.14|0.17|4Q2019|0.22|0.17|1Q2020|0.19|0.18|\n|VTR|2020.08.07|0.25|2Q2019|0.32|0.58|3Q2019|0.23|0.32|4Q2019|0.03|0.27|1Q2020|1.26|0.22|",
        "created_utc": 1596310340,
        "id": "g00jd74",
        "permalink": "/r/wallstreetbets/comments/i1rkto/most_anticipated_earnings_releases_for_the_week/g00jd74/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596339140.0
    },
    {
        "author": "ubersucksbigtime",
        "body": "I have an MSI.  It has a rainbow keyboard so i would buy calls",
        "created_utc": 1597345365,
        "id": "g1cwz2g",
        "permalink": "/r/wallstreetbets/comments/i8xa70/daily_discussion_thread_for_august_13_2020/g1cwz2g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597374165.0
    },
    {
        "author": "BloodMossHunter",
        "body": "they cant take my fucking tendies from me today... back from the red up a couple of msi stealth laptops mothafuckas",
        "created_utc": 1598020093,
        "id": "g2bth25",
        "permalink": "/r/wallstreetbets/comments/idu461/daily_discussion_thread_for_august_21_2020/g2bth25/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598048893.0
    },
    {
        "author": "Mr_Halo_Sin",
        "body": "No one is saying they don't sell \"quality\" products.\n\nNo one is saying the poor can't afford them.\n\nWhat I am saying, is that teenage girls/hipsters are overpaying... and now that i own stockin AAPL.... i really don't care.\n\nI sell AAPL calls on my android, that has more battery, more style, because I don't see AAPL as a status symbol.\n\nI think i should thank you. You prove my theory that iphone users care more about the image than the product.\n\nkeep buying!\n\n\nI use a motorola, and I only charge my phone once a day..,........looooooooooooool.",
        "created_utc": 1598064337,
        "id": "g2eaxfb",
        "permalink": "/r/wallstreetbets/comments/ie9w04/apple_is_already_at_2127_trillion_how_long_til_it/g2eaxfb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598093137.0
    },
    {
        "author": "tomorland",
        "body": "I've been studying this. I think I've figured it out -- at least for the people I know who are invested in TSLA. (I am not, if that matters.) \n\nBefore the iPhone, everyone had a Nokia, Motorola or Blackberry phone. No one has those anymore. MSFT tried to come out with a phone and failed. Android is the only real competition anymore, and AAPL and GOOG are both trillion dollar companies. \n\nTSLA is only worth 350 billion. It's cheap!  A lot of people see a six-bagger potential when comparing TSLA to AAPL. \n\n\"A Tesla is a computer on wheels\" I've heard said. \"It's a disruptor.\" \n\n In their minds, Toyota, VW and Chevy are like Nokia, Motorola and Blackberry. No one else matters. The future is all TSLA, just like the future of phones (in 2008) was AAPL. \n\nBut cars aren't phones. You'll never see only two brands of cars on the road. The solar panel business isn't new either. We've all seen the \"SOLAR IS COMING!\" hype and a lot of us have lost money on it. Don't get me wrong, solar is definitely worth doing and has a great future, but that doesn't mean it's a good stock play. \n\nIs TSLA more like Amazon? Remember, AMZN doesn't make much money off the retail business. Their big profit center is AWS. Maybe TSLA will license their self-driving tech and all the data from their telemetry system. I don't know. But with so few Teslas on the road compared to Ford Trucks alone (In 2019 Ford sold three F-series pickups for every Tesla sold), I don't see how they can keep that advantage for long either.  The tech is pretty much off-the-shelf. Someone could duplicate it pretty easily. \n\nBased on the exuberance of so many people, and the unfortunate comparison to AAPL and AMZN, I think TSLA will probably go to $5000 ($1000 split adjusted) before it will crash. But it will definitely crash, and crash hard. I have no doubt.",
        "created_utc": 1597981881,
        "id": "g2aiwye",
        "permalink": "/r/investing/comments/idhr6y/tesla_closes_above_2000_for_the_first_time_ever/g2aiwye/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598010681.0
    },
    {
        "author": "tomorland",
        "body": "I agree with everything you wrote in the bear-case for Tesla. \n\nI'd be on board too, except for a couple of things. \n\nI thought Nokia, Motorola and Blackberry would limit or stomp on the scope of iPhone adoption. Today apple is a $2T valuation. Nokia and Blackberry are still around, barely. \n\nI thought Barnes and Noble, later Wal-Mart would jump in and throttle Amazon. Nope. Amazon's main income isn't from its retail sales, but from AWS. Again, I thought MS or IBM or SOMEONE in the OS/networking industry would eat their lunch on cloud services. Nope. \n\nAnyone remember Flooz? The SAP/(and some other big names) attempt to unseat PayPal?\n\nOld industries like Ford, GM, VW, Toyota, etc. are too big and have too much momentum to be nimble or \"cool.\" And I think the \"cool\" factor is a lot more important than it should be. \n\nHaving said that, we'd still need 1/3 of all new vehicles on the road to contain some kind of royalty-paying Tesla tech installed. Starlink? Not likely, you say? How long did it take for Zoom to replace Skype and Facetime as the dominant media? \n\nDon't get me wrong, I DO NOT think TSLA is a good investment. I think the odds of a collapse in the stock price are more likely than not, but not by much. The stakes are too great in this gamble, and the reward is too far off in the haze of an unknown future.",
        "created_utc": 1598629793,
        "id": "g358cyv",
        "permalink": "/r/investing/comments/ihlejg/tesla_is_nearing_2200_5_days_away_from_the_stock/g358cyv/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598658593.0
    },
    {
        "author": "Nohrab",
        "body": "I’m aware sir, but I’m talking about Elon and his primary focus, as a car company it’s better for him to keep his current system running, keep in mind the same system that blew him way past ford, IMO this is like saying Apple should buy Motorola",
        "created_utc": 1598614270,
        "id": "g34hcbp",
        "permalink": "/r/wallstreetbets/comments/ii54p8/i_said_it_last_night_off_the_cuff_but_what_if/g34hcbp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598643070.0
    },
    {
        "author": "HolderofFour",
        "body": "My Motorola Razer from middle school can run the Witcher if it’s 1 frame per year.",
        "created_utc": 1598914575,
        "id": "g3iz182",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3iz182/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598943375.0
    },
    {
        "author": "everybodysaysso",
        "body": "&gt;They have a huge amount of competition on the horizon.\n\nNothing still beats the maiden 2012 Model S. \n\nToyota and Hyundai are the next Motorola, Moto G is an amazing phone, does it have any fanbois? Nope!",
        "created_utc": 1597154857,
        "id": "g13pm5c",
        "permalink": "/r/stocks/comments/i7q451/nio_8_earnings_beat/g13pm5c/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597183657.0
    },
    {
        "author": "sockalicious",
        "body": "Would require what business people call a 'turnaround'.  Intel brass have given no sign that they agree that a turnaround is necessary, let alone in progress.  \n\nIt's possible, of course, but it was also possible for Motorola, ATI, National Semiconductor, Fairchild Semiconductor, and a host of others over the years - companies that didn't make it.  It is not like operating a gravel pit; the industry does not forgive technology laggards.",
        "created_utc": 1597214363,
        "id": "g16v4e5",
        "permalink": "/r/wallstreetbets/comments/i822hx/intc_in_a_nutshell/g16v4e5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597243163.0
    },
    {
        "author": "DerTagestrinker",
        "body": "It’s not very thin and pretty heavy, but that’s to be expected with the card and a pretty good cooling system. \n\nMSI Stealths are some of the best laptops going right now. Not sure if you’d want to wait for the Ryzen version to come out or not. I think the i7 is great though, or you could go crazy and get an i9.  \n\nAlso they look great which is important to me cause don’t want to look like a dweeb in public.",
        "created_utc": 1597324818,
        "id": "g1bpfmb",
        "permalink": "/r/wallstreetbets/comments/i8xa70/daily_discussion_thread_for_august_13_2020/g1bpfmb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597353618.0
    },
    {
        "author": "RecklesslyPessmystic",
        "body": "Does Motorola ever pump?",
        "created_utc": 1596491726,
        "id": "g09fr8u",
        "permalink": "/r/wallstreetbets/comments/i34g5h/what_are_your_moves_tomorrow_august_04_2020/g09fr8u/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596520526.0
    },
    {
        "author": "free_dharma",
        "body": "Nice my dude! How do you like it? How thin is it? That’s big for me and laptops. Obviously any good gfx card will make it a bit thicker...\n\nWhat do you think about the MSI stealth? Looking at the 2070...",
        "created_utc": 1597323095,
        "id": "g1bmmfj",
        "permalink": "/r/wallstreetbets/comments/i8xa70/daily_discussion_thread_for_august_13_2020/g1bmmfj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597351895.0
    },
    {
        "author": "noodlesofdoom",
        "body": "asus/msi",
        "created_utc": 1597432524,
        "id": "g1h2yrm",
        "permalink": "/r/wallstreetbets/comments/i9jdiq/daily_discussion_thread_for_august_14_2020/g1h2yrm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597461324.0
    },
    {
        "author": "kriptonicx",
        "body": "To be fair the iPhone was (and still is to some extent) a single point of failure for Apple. In the years before we had seen companies like Nokia, Blackberry and Motorola get wiped out as soon as a competitor came out with something a little more interesting.\n\nIt's similar to how people act like it was so obvious to buy the online bookstore company, AMZN in the 90s despite the fact it was losing money for years and looked nothing like it does today.\n\nSo yeah, in hindsight those who thought Apple were doomed were wrong, but they were also probably right to not expect Apple to be trading with $2T market cap in 2020.",
        "created_utc": 1597877420,
        "id": "g25jwsu",
        "permalink": "/r/investing/comments/icp5cv/apple_becomes_first_us_company_to_reach_a_2/g25jwsu/",
        "score": 1,
        "subreddit": "investing",
        "created": 1597906220.0
    },
    {
        "author": "aqjingson",
        "body": "BS he still uses his Motorola razor when he goes out",
        "created_utc": 1597965538,
        "id": "g29pkdo",
        "permalink": "/r/wallstreetbets/comments/idhs5y/what_are_your_moves_tomorrow_august_21_2020/g29pkdo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597994338.0
    },
    {
        "author": "WSB_ThAw",
        "body": "Lenovo. They had great quarterly results and beat expactations by far. They invest heavily into R&amp;D to lower cost for everyday VR goggles and similar tech. Their phone business (Motorola) became profitable for the first time after years of investments. They own Medion, the elecronics supplier for German retail giant Aldi. Their market cap is laughable at $&lt;6bn and a P/E ratio of 9. As result of the cheap stock / low market cap their yearly dividend yields 5%-10%.",
        "created_utc": 1598010005,
        "id": "g2bdw2e",
        "permalink": "/r/stocks/comments/idpecm/heavily_discounted_recovery_stocks/g2bdw2e/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598038805.0
    },
    {
        "author": "methaddlct",
        "body": "Ok but what if msi gets to 2$\n\nMsvi whatever the fuck that is",
        "created_utc": 1597719765,
        "id": "g1xzel6",
        "permalink": "/r/wallstreetbets/comments/ibscf9/another_autistic_options_question/g1xzel6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597748565.0
    },
    {
        "author": "KillerSparta",
        "body": "OP HERE- HOW IVE MADE MY MONEY AT A YOUNG AGE\n\nThe Golden Era of Selling Swimming Pools\nMy brother and I have made roughly over 100k in sales through reselling swimming pools. Check ya walmarts for discounted msi gaming laptops/omens ;)",
        "created_utc": 1598620724,
        "id": "g34qj0j",
        "permalink": "/r/wallstreetbets/comments/ii07i4/am_i_winning_yet_18m/g34qj0j/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598649524.0
    },
    {
        "author": "Dr_Ne0n_Fleshbiscuit",
        "body": "If you ever figure out how to do that successfully let me know where you learned how to do this. I've tried buying options, but I always seem to fail because of the short timeline. The event horizon for options is usually months, so you're betting on some sort of short term trend based on news or events. It's like betting on the weather.\n\nYou can use options as insurance against a loss when a stock you are up in plummets, but again it comes to timing. AMZN has been overvalued for over 20 years now. When cometh the fall? Who TF knows, but longer trends, like Sears, JC Penny, Walmart and all the mom and pop brick-n-mortar stores were market capital for AMZN to consume. And like Apple, when I'd look at the iPhone in its early days and look at market caps for Motorola, Nokia, etc as growth food. And Apple sucked them dry and left behind husks. \n\nOptions seem to me about as bad as day trading. The sharks with their millisecond connections to the floor with automated trading algorithms make it impossible for the little guy with an online broker to do much of anything except provide the chum. This is why a lot in these kinds of threads advise not to trade very often. The long game is your friend. I've almost always lost trying to time the market.\n\nI'm sure there are some people out there that can spin options and day trading into gold, but back to my original point in this thread: if you have it, use your special knowledge to identify companies that have an edge.\n\nAnd seriously, what is going on now is insane. A market propped up by cheap liquidity is not an economy, where for months now 1/3 of renters and mortgage holders couldn't pay. I might be a fool to still be long in this period of delusional exuberance before the reckoning, but do you really want to be holding dollars? It's going to really suck when the bottom falls out deeper than Y2K and 2008. Those were character building events. Same as it ever was. Cheers.",
        "created_utc": 1598562214,
        "id": "g32cphb",
        "permalink": "/r/investing/comments/i93vg0/i_paid_1000_for_an_adam_khoo_investing_course_so/g32cphb/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598591014.0
    },
    {
        "author": "AjaxFC1900",
        "body": "MS missed mobile because they were distracted by the DOJ-EU lawsuit. They were 3 months late to the software motorola would have used in one of their phones (they used Android instead)\n\nPlus attacking mobile would have meant poking the DOJ-EU beurocrats and asking for being torn apart like Standard Oil before them",
        "created_utc": 1597878539,
        "id": "g25m0ey",
        "permalink": "/r/stocks/comments/icpgzu/apple_is_now_worth_2_trillion/g25m0ey/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1597907339.0
    },
    {
        "author": "Yoloornothing",
        "body": "Hey guys looking buying a new laptop for uni. Thoughts on this laptop and specs??? \nhttps://www.currys.co.uk/gbuk/computing/laptops/laptops/msi-stealth-gs66-15-6-gaming-laptop-intel-core-i7-rtx-2060-512-gb-ssd-10205326-pdt.html?istCompanyId=bec25c7e-cbcd-460d-81d5-a25372d2e3d7&amp;istFeedId=2f489429-2329-4fcd-941a-a6a497a10e1d&amp;istItemId=irlxmript&amp;istBid=t&amp;awc=1599_1597428621_edf028feb5056a8373a56c16836fc41c&amp;srcid=369&amp;xtor=AL-1&amp;cmpid=aff~Hatch~Lead+Generation+(Content)~155280~Hatch+BV",
        "created_utc": 1597430324,
        "id": "g1gxzqq",
        "permalink": "/r/wallstreetbets/comments/i9jdiq/daily_discussion_thread_for_august_14_2020/g1gxzqq/",
        "score": -3,
        "subreddit": "wallstreetbets",
        "created": 1597459124.0
    },
    {
        "author": "SuperNewk",
        "body": "We are becoming to aware of this.  2008.9 no one wanted to invest.  Now everyone wants to invest.  How times have changed",
        "created_utc": 1596508501,
        "id": "g0ab83x",
        "permalink": "/r/stocks/comments/i3b0c9/investing_is_no_longer_just_a_way_to_get_rich_but/g0ab83x/",
        "score": 256,
        "subreddit": "stocks",
        "created": 1596537301.0
    },
    {
        "author": "xWasx08",
        "body": "The fact his phone even wants to kill itself at the end... That's saying something.\n\nFuck bro. How are you gonna explain this to your wife's boyfriend now?",
        "created_utc": 1596843223,
        "id": "g0qi36j",
        "permalink": "/r/wallstreetbets/comments/i5nptk/dear_diary_i_lost_it_all_again/g0qi36j/",
        "score": 205,
        "subreddit": "wallstreetbets",
        "created": 1596872023.0
    },
    {
        "author": "BombSolver",
        "body": "You need to look a little deeper man.  \n\nMusk got hair plug transplants, and since then he’s become extremely powerful. That’s plug power. Or, Plug Power ($PLUG) which does hydrogen power!  \n\nDo you understand it now?!? Tesla will soon supplant battery for hydrogen power, probably to be announced on Battery Day!  \n\nThis picture was Musk signaling decades ago that he will be our pay pal, giving money to us buddies who crack the codes he leaves for us!",
        "created_utc": 1597780174,
        "id": "g20vpmz",
        "permalink": "/r/wallstreetbets/comments/ic83ar/too_late_for_tsla_dont_forget_the_first_company/g20vpmz/",
        "score": 136,
        "subreddit": "wallstreetbets",
        "created": 1597808974.0
    },
    {
        "author": "GreatisEva",
        "body": "Bruh doubling your money from march to now doesn’t make you a genius you could throw a piece of shit at a wall and it would land on a stock that doubled since march without needing options",
        "created_utc": 1597285231,
        "id": "g1aagc3",
        "permalink": "/r/wallstreetbets/comments/i8rg15/recent_genius_who_discovered_options_ama/g1aagc3/",
        "score": 129,
        "subreddit": "wallstreetbets",
        "created": 1597314031.0
    },
    {
        "author": "staybythebay",
        "body": "now THIS is the loss porn I've been waiting to see",
        "created_utc": 1596742312,
        "id": "g0libic",
        "permalink": "/r/wallstreetbets/comments/i4yf22/yolo_is_a_hell_of_a_drug_farewell_boys/g0libic/",
        "score": 128,
        "subreddit": "wallstreetbets",
        "created": 1596771112.0
    },
    {
        "author": "BigEd781",
        "body": "&gt;401k’s under perform (I still have one)\n\nMost people don't transition out of the default conservative options, that's true, but it's good enough if you start early. \n\n&gt;The one bright spot is that a lot of information is now available online and zero commission trades. This is absolutely awesome and with those tools anyone can achieve their desired wealth and dreams. My opinion anyway.\n\nThe problem with that is it's completely unrealistic. To be a _good_ investor _consistently_ over _long periods of time_ is damn near a full time job. It's not for everyone. In fact, it's not for the vast majority of people. They're better off in an index fund. \n\nI imagine we'd agree that general financial literacy would be a great thing to teach early. Most people don't have the first clue and it's a shame.",
        "created_utc": 1596508485,
        "id": "g0ab715",
        "permalink": "/r/stocks/comments/i3b0c9/investing_is_no_longer_just_a_way_to_get_rich_but/g0ab715/",
        "score": 116,
        "subreddit": "stocks",
        "created": 1596537285.0
    },
    {
        "author": "the_dark_side",
        "body": "I dunno man. Few days back I bought a grand of options as a “why not” and now I have enough to get a free mattress.  Pretty much a pyramid scheme.",
        "created_utc": 1596510800,
        "id": "g0afc9o",
        "permalink": "/r/wallstreetbets/comments/i3awti/prpl_rain/g0afc9o/",
        "score": 111,
        "subreddit": "wallstreetbets",
        "created": 1596539600.0
    },
    {
        "author": "dhsmatt2",
        "body": "Well I hope tomorrow is green. Ladies and gents it’s been fun. My asshole is now prpl.",
        "created_utc": 1597356605,
        "id": "g1dl5xo",
        "permalink": "/r/wallstreetbets/comments/i91ots/prpl_roll_call_my_positions_baby_ride_or_die_4m/g1dl5xo/",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1597385405.0
    },
    {
        "author": "rocketboy2319",
        "body": "WSBers now gonna be doin' DD on Elon tweets like  Nicolas Cage reading that crack pipe in National Treasure.",
        "created_utc": 1597677915,
        "id": "g1vbl3z",
        "permalink": "/r/wallstreetbets/comments/ibfipq/musk_is_genius/g1vbl3z/",
        "score": 102,
        "subreddit": "wallstreetbets",
        "created": 1597706715.0
    },
    {
        "author": "Recoil42",
        "body": "Eh, I hear you, but this isn't an honest accounting of it.\n\nTesla's pulling some strings with accounting, but it's not like they can't pull the strings the other way, and they have plenty of time to do so. They're going through rapid, rapid expansion right now, and the potential for them from pivots is very real.\n\n\\- Their battery tech is way ahead. Right now they're supply constrained, but ramping up quickly. I would fully expect them to make an almost 1:1 switch from revenue from green credits to being a battery *supplier* as other car manufacturers get into EVs.\n\n\\- They already operate the largest public charging network in the world. This actually *benefits* them as other manufacturers move into EV.\n\n\\- They also benefit from [the Starbucks effect](https://aipcommercialrealestate.com/the-starbucks-effect) as other companies move into the EV market and drive EV acceptance.\n\n\\- They're making a heavy, heavy bet on autonomous driving. Right now, I put them behind Waymo, but ahead of most other players in the market. And they're absolutely 100% ahead when it comes to eventually building fleet-scale autonomous, and financially way, way ahead as they pursue doing it with lease returns. (Waymo will get to an autonomous fleet quicker, but Tesla will do it cheaper.)\n\nAll of this means you can't evaluate Tesla as if it's an automaker running in the red. It's an automaker, *plus* a battery supplier, *plus* a fueling station operator, *plus* a potential rideshare operator. Plus like five other things.\n\nMeanwhile, car revenue for them is constrained from the supply side, not the demand side. They have **four** factories under construction at this very moment— Nevada, Shanghai, Berlin, and Austin — with yet another one on the way. \n\nAnd those green credits? Cadillac isn't even coming out with the Lyriq until 2022. Volkswagen is having production issues and hasn't delivered a single ID3 yet, despite promising 100,000 this year. That's how far behind everyone else is.\n\nYes, everything you've said is completely valid. But it's an incomplete picture.\n\nThat said, are they still overvalued? Yes, absolutely.",
        "created_utc": 1597968092,
        "id": "g29u7tx",
        "permalink": "/r/investing/comments/idhr6y/tesla_closes_above_2000_for_the_first_time_ever/g29u7tx/",
        "score": 96,
        "subreddit": "investing",
        "created": 1597996892.0
    },
    {
        "author": "Kabrosif",
        "body": "Imagine thinking Tesla would hit $1840 by now back in March....I mean seriously we’re you like ah fuck it it’s only a thousand bucks and all I can afford....or what? Lol Like how does shit like this even enter someones brain and go yeah this is a good play....",
        "created_utc": 1597790280,
        "id": "g21gvwg",
        "permalink": "/r/wallstreetbets/comments/ic91dx/thank_you_elon_dont_want_to_be_anymore_greedy/g21gvwg/",
        "score": 92,
        "subreddit": "wallstreetbets",
        "created": 1597819080.0
    },
    {
        "author": "The_estimator_is_in",
        "body": "&gt; But what's my next move.\n\nYou're not going to listen to me because the \"first one is free\".\n\nMaking this much in your first week is bad. I mean, *really really bad*. It's a fluke. In 60 days or (probably much less), your going to go broke.\n\nI'm not kidding, not fucking around. Sell at open tomorrow. Take your $30k and buy lots of 100 shares of shit that's between $30 - $50 per share and sell covered calls!\n\nYou'll have shares and some income. Reinvest the income.\n\nIf this plan or any part of it does not make sense sell and think of it this way: You now pretty much have a new tesla. Would you throw your keys to that brand new car in the pot of a game that your a rank amature at? Probably not.\n\nPlease play it safe.\n\nLove, an older version of you.",
        "created_utc": 1597969434,
        "id": "g29wlxl",
        "permalink": "/r/wallstreetbets/comments/idlw7n/great_first_week_trading_i_got_it_all_figured_out/g29wlxl/",
        "score": 85,
        "subreddit": "wallstreetbets",
        "created": 1597998234.0
    },
    {
        "author": "thuglyfeyo",
        "body": "Imagine being so fucking stupid to think there’s an invisible line on a graph that says stocks aren’t allowed to pass it.\n\nNow imagine how fucking retarded you’d have to be to think you can draw a line on a graph and say “this is the one, this is it. My line is special”",
        "created_utc": 1597786747,
        "id": "g219ti0",
        "permalink": "/r/wallstreetbets/comments/ica9cd/the_stock_market_collapse_starts_tomorrow/g219ti0/",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1597815547.0
    },
    {
        "author": "Griffinhunters",
        "body": "Sure, I made mistakes when I was younger. But now that I'm older I've learned to make different, often far more serious mistakes.",
        "created_utc": 1596658009,
        "id": "g0hdfs6",
        "permalink": "/r/wallstreetbets/comments/i4cr27/what_are_your_moves_tomorrow_august_06_2020/g0hdfs6/",
        "score": 77,
        "subreddit": "wallstreetbets",
        "created": 1596686809.0
    },
    {
        "author": "brrrrrrrrrrrrrfuk",
        "body": "If 4k is 2 years savings this man needs to lower his risk now",
        "created_utc": 1597176225,
        "id": "g14xihg",
        "permalink": "/r/wallstreetbets/comments/i7y3dy/lost_2_years_of_savings_in_20_minutes_life_is_good/g14xihg/",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1597205025.0
    },
    {
        "author": "EatsRats",
        "body": "I've already shit my pants in anticipation.\n\nEdit: Now we get to see if PRPL will...*shit the bed!*\n\nDouble-edit: It shit the bed.",
        "created_utc": 1597348829,
        "id": "g1d4mxw",
        "permalink": "/r/wallstreetbets/comments/i972lf/come_one_come_all_prpl_330pm_cst_earnings_call/g1d4mxw/",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1597377629.0
    },
    {
        "author": "SEN1LE",
        "body": "\"congratulations on you ascention, we will now allow you to expose yourself to near unlimited risk for minimal reward\"",
        "created_utc": 1597277818,
        "id": "g19wkda",
        "permalink": "/r/wallstreetbets/comments/i8mll1/wsb_it_dont_go_down_market_it_do_go_down/g19wkda/",
        "score": 71,
        "subreddit": "wallstreetbets",
        "created": 1597306618.0
    },
    {
        "author": "The_estimator_is_in",
        "body": "This.\n\nOr covered poots. \n\nThat's 70 covered calls.... $3.90 x 7000 at $465C strike for Friday.\n\nThat's like a free $26,000 a week. \n\nEdit: AND if he gets called, that's 3.25M$ more.\n\nEdit 2: WTF are you asking us for? You need a financial advisor and a tax guy. NOW.",
        "created_utc": 1597726358,
        "id": "g1y9sbx",
        "permalink": "/r/wallstreetbets/comments/ibujf9/grandpa_died_and_left_me_with_7000_shares_of_aapl/g1y9sbx/",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1597755158.0
    },
    {
        "author": "UnforgivingSentience",
        "body": "Almost responded to an email with “thanks, retard” because 50% of my social interaction is now through this sub",
        "created_utc": 1597273630,
        "id": "g19oehl",
        "permalink": "/r/wallstreetbets/comments/i8l3ny/what_are_your_moves_tomorrow_august_13_2020/g19oehl/",
        "score": 67,
        "subreddit": "wallstreetbets",
        "created": 1597302430.0
    },
    {
        "author": "Swaggerhax",
        "body": "You ever just look at all the money you lost and just say \"Wow, if I never touched options I could have that money in my pocket right now when I need it most\"?... Cause if you do, lmfao what a fucking nerd, you're bad and should feel bad",
        "created_utc": 1596488162,
        "id": "g098a5p",
        "permalink": "/r/wallstreetbets/comments/i34g5h/what_are_your_moves_tomorrow_august_04_2020/g098a5p/",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1596516962.0
    },
    {
        "author": "mannequit",
        "body": "[loss porn](https://i.imgur.com/Sx8j4Dl.jpg)\n\nBoys I'm in a fuck ton of pain right now. \n\nThis is the THIRD time I've blown up my account and it's really shown how dangerous feeling numb to losing (to me) a fuck ton of money is. \n\nPros: I'm 24 with a great job and no debt. \n\nCons: this is a little over half my net worth. \n\nNot sure if I'll survive to tell the tale again. If I do I'm pulling out enough to max my Roth IRA and putting the rest in shares to never look at. \n\nPuts on my intelligence",
        "created_utc": 1597176444,
        "id": "g14xzdf",
        "permalink": "/r/wallstreetbets/comments/i7z0pb/what_are_your_moves_tomorrow_august_12_2020/g14xzdf/",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1597205244.0
    },
    {
        "author": "EdgyAlien",
        "body": "If anything bro sell now and take profit and if it dips buy back in for the news ur waiting for, u were bag holding for a year don’t let this go to waste",
        "created_utc": 1597272704,
        "id": "g19mkqj",
        "permalink": "/r/pennystocks/comments/i8o3pi/been_holding_this_bag_for_almost_a_year/g19mkqj/",
        "score": 62,
        "subreddit": "pennystocks",
        "created": 1597301504.0
    },
    {
        "author": "IceOmen",
        "body": "Whenever I see stuff like this, I imagine humans thousands of years from now finding it and trying to make sense of why the fuck it was created. Like some sort of profound artifact.",
        "created_utc": 1597182472,
        "id": "g15bhh0",
        "permalink": "/r/wallstreetbets/comments/i7ys9z/bears_rn/g15bhh0/",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1597211272.0
    },
    {
        "author": "IVCrushingUrTendies",
        "body": "Seriously... look at me guys I was given 300k at 18yr old and it's now worth 800K! Go fuck yourself",
        "created_utc": 1597782800,
        "id": "g211ozg",
        "permalink": "/r/wallstreetbets/comments/ic746c/stonks_aint_too_bad_500k_tendies/g211ozg/",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1597811600.0
    },
    {
        "author": "Tony_Plow",
        "body": "So it’s $500 after spilt, $1000 shortly after split. Sounds like this has no downside.  🚀🚀 I cant afford $500 right now, but I also can’t afford to miss out on doubling my investment. Should I skip paying my mortgage next month so I can YOLO on Tesla?",
        "created_utc": 1597690592,
        "id": "g1w70cv",
        "permalink": "/r/wallstreetbets/comments/ibk9vh/at_this_rate_tesla_will_still_be_too_expensive/g1w70cv/",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1597719392.0
    },
    {
        "author": "happyjackss48",
        "body": "why not $100?\n\ni demand $100.\n\n*get me the stock market on the phone, now!*",
        "created_utc": 1597105891,
        "id": "g11vx75",
        "permalink": "/r/wallstreetbets/comments/i7hc5o/what_happened_to_rkt/g11vx75/",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1597134691.0
    },
    {
        "author": "jpowprints",
        "body": "i regreted not going into tsla at 100\n\ni regreted not going into tsla at 500\n\ni regreted not going into tsla at 1000\n\ni regreted not going into tsla at 1500\n\nnow at nearly 2000, i listen to any [tsla call](https://unusualwhales.com/alerts/0905af98-feb8-47f6-9b97-83e6be5b81b4) with glee",
        "created_utc": 1597946184,
        "id": "g28ikrd",
        "permalink": "/r/pennystocks/comments/idc5fl/ive_made_more_money_in_the_past_2_minutes_with/g28ikrd/",
        "score": 57,
        "subreddit": "pennystocks",
        "created": 1597974984.0
    },
    {
        "author": "jdubb1500",
        "body": "I got in at $350 and older investors told me it was too high. That was in 2011.  In 2014 it did a 7-1 stock split. My $350/share is now worth $3150/share adjusted for the split. Get in.",
        "created_utc": 1596736226,
        "id": "g0l3wmw",
        "permalink": "/r/StockMarket/comments/i4vxi6/aapl_miss_the_boat_or_is_it_not_too_late/g0l3wmw/",
        "score": 57,
        "subreddit": "StockMarket",
        "created": 1596765026.0
    },
    {
        "author": "desmedt29",
        "body": "I turned 60 bucks into 10g on GE puts in March.\n\nDon't ask how I'm doing now it's not important",
        "created_utc": 1597081562,
        "id": "g10j5s3",
        "permalink": "/r/wallstreetbets/comments/i776oj/how_the_hell_do_you_lunatics_do_this_options_shit/g10j5s3/",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1597110362.0
    },
    {
        "author": "Swissschiess",
        "body": "Boys i know this isn’t appropriate here but i love all of y’all, unfortunately my dad has a blood infection and he’s fully blinded in one eye and probably losing his second now, if you could send your energy to him to instead of our regular losing positions i would appreciate it. \n\nThe second eye still has a chance to be saved by its likely a weekly position please buy calls on his eye and don’t be an inverse WSB position.\n\nMuch love\n\nEdit: i just wanted to let you know to not take your health or loved ones health for granted, when you see a wholesome post on here to drink water, correct posture and get a workout in do it!\n\nThanks for the support everybody",
        "created_utc": 1597557778,
        "id": "g1pngd6",
        "permalink": "/r/wallstreetbets/comments/i9t8hn/weekend_discussion_thread_for_the_weekend_of/g1pngd6/",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1597586578.0
    },
    {
        "author": "avelak",
        "body": "Alrighty, think I've got most of the stupid gangs from the past 6 months or so.  I was personally sucked into 5 or 6 of these, shameful.\n\n* dIaMonD hAnDs SPY 200p\n\n* Tanker Gang\n\n* PRPL gang\n\n* Team RKT\n\n* Corn Gang\n\n* That ULTA DD motherfucker\n\n* ATVI\n\n* SNAP puts\n\n* SPCE Soldiers\n\n* Metals gang (SLV Surfers)\n\n* Quad Witching\n\n* MSFT 200\n\n* MGM\n\n* KODK bagholders anonymous\n\n* Kang Gang\n\n* DKNG DKNG DKNG DKNG\n\n* VBIV dude (he'd be happy now if he wasn't banned)\n\n* JNUGgalos\n\n* AZN Fever\n\n* AMD puts\n\n* REITs\n\n* Gun riots\n\n* NKLA\n\n* The many fallen in service of TSLA gang on the uppies and downies\n\n* PG&amp;E (AKA the easiest fReE mOnEy)\n\n* MU 90c\n\n* ZM puts\n\n* DGLY\n\n* LL \n\n* Luckin Coffee\n\n* HTZ bankruptcy moonshot",
        "created_utc": 1597354306,
        "id": "g1dgbsp",
        "permalink": "/r/wallstreetbets/comments/i977qn/what_are_your_moves_tomorrow_august_14_2020/g1dgbsp/",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1597383106.0
    },
    {
        "author": "Galaxy_Bucket",
        "body": "The ignorance of this statement is next level. \n\n\nShould corporations be allowed to control policy because they provide shitty minimum wage jobs?\n\n\nRideshare bookings are down ~95% right now. Yeah, somehow I dont think there will really be that many lost jobs. 1099 workers also qualify for PUA.",
        "created_utc": 1597118773,
        "id": "g12i0cp",
        "permalink": "/r/investing/comments/i7e245/breaking_news_california_judge_granted_a/g12i0cp/",
        "score": 53,
        "subreddit": "investing",
        "created": 1597147573.0
    },
    {
        "author": "asif8147",
        "body": "Don't yolo it!! Use the money for transportation to and from interviews, feeding your family, and keeping a shelter over your head.\n\nWhat type of vehicle do you have? Are you able to use it for driving rideshare while you get back on your feet? Only YOLO yourself, meaning go all in and do what you have to do TO PROVIDE FOR YOUR FAMILY. You yolo this 3k in now and that's it, it's over. But if you can just dig deep down now and keep that in (I know it hurts and it stings losing your job right now) but this is the ultimate test you're going through. You use that as long as you can to last out until you get a 30k, 50k, 70k or more paying job. \n\nI believe in you. \n\n2 years from now when you're on your feet and in a better position, you will pass this forward to someone else.",
        "created_utc": 1596675888,
        "id": "g0id2nd",
        "permalink": "/r/wallstreetbets/comments/i4hsnc/just_lost_my_job_and_i_have_3k_to_my_name_need/g0id2nd/",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1596704688.0
    },
    {
        "author": "LavenderAutist",
        "body": "It's like the guy who keeps coming up with random reasons why the hot girl in marketing is going to ask him out any day now.",
        "created_utc": 1596566422,
        "id": "g0cwlso",
        "permalink": "/r/wallstreetbets/comments/i3ozim/explosion_in_beirut_calls_on_gld/g0cwlso/",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1596595222.0
    },
    {
        "author": "lurkingsince2006",
        "body": "This is exactly what the person who triggered your stop loss wanted.\n\n\nThis happened last week as well.  It is called stop loss fishing.  They short the stock all at once and trigger everyone’s tight trailing stop loss, then that causes further selling which they buy into.\n\nThe only reason it didn’t fully recover YET as of this comment is because there are so many Robintards in this now and they are spooked.",
        "created_utc": 1596558918,
        "id": "g0ccqmo",
        "permalink": "/r/wallstreetbets/comments/i3mk8m/purple_and_lesson_of_stop_limit_sell/g0ccqmo/",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1596587718.0
    },
    {
        "author": "cutiesarustimes2",
        "body": "Always two sides of every trade. Someone somewhere (likely a bank) is now up $38k.",
        "created_utc": 1597548292,
        "id": "g1paaz5",
        "permalink": "/r/wallstreetbets/comments/ial815/loss_porn_38k_10k_40k_80_19yo_that_needs_rope_now/g1paaz5/",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1597577092.0
    },
    {
        "author": "HeavyG_93",
        "body": "In America if you ever do anything to save a corporation money, we call it “creating jobs”\n\nNow, most non retards know that, just cause a business saves some money doesn’t mean they’ll create jobs. See the record amount of stock buybacks the last 3 years. \n\nBut you know, most of our population is undereducated dumb dumbs because not everyone has 50k to get educated so, people actually believe the shit that politicians say. The even dumber dumb dumbs believe what Donald Trump says",
        "created_utc": 1597168710,
        "id": "g14hbxc",
        "permalink": "/r/stocks/comments/i7u2dl/trump_says_hes_seriously_mulling_a_capital_gains/g14hbxc/",
        "score": 50,
        "subreddit": "stocks",
        "created": 1597197510.0
    },
    {
        "author": "-Kers",
        "body": "I'll quit my job right now and work for you",
        "created_utc": 1596574969,
        "id": "g0diw4k",
        "permalink": "/r/wallstreetbets/comments/i3ov55/prpl_nrpl_hands_you_asked_you_received_still/g0diw4k/",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1596603769.0
    },
    {
        "author": "PepeSilviaFTW",
        "body": "#Effective as of 8/17/2020: \n\nRed days now a felony. \nPunishable by up to 10 years in Federal pound you in the ass prison and lifetime ban on the purchase of put options.",
        "created_utc": 1597696017,
        "id": "g1wlvlu",
        "permalink": "/r/wallstreetbets/comments/iblrnn/what_are_your_moves_tomorrow_august_18_2020/g1wlvlu/",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1597724817.0
    },
    {
        "author": "PrefersDigg",
        "body": "Holding inverse leveraged ETF overnight against hottest of the hot stock sector .... Do you have a vow of poverty to meet or something?\n\n---\n\nOP edited so I hope this serves as a PSA so other people don't do something so foolish.\n\n&gt; ...buying the ETF this low (5.44) and holding, setting an alert for a specific price point and waiting.... what is the worse that could happen, really?\n\nTotal lack of understanding about how leveraged ETFs work. \n\nUnlike a regular ETF whose value is based on the bundle of stocks bonds etc within it, a leveraged ETF is just a pile of derivatives intended to track 3x the value of a certain index each day...\n\nWhen you buy and hold SQQQ -- if NASDAQ goes up 33%, the inverse ETF causes SQQQ to go down 99% and your investment is now worth nothing. This happens occasionally, which is why reverse stock splits have to happen, so there is still some share value for people to buy into.\n\nHolding SQQQ long-term is not an investment, or even a speculation, because the longer you hold it the nearer to certain it will be that you lose everything. Holding this position overnight, or god forbid for several days, is basically the same as lighting your money on fire.",
        "created_utc": 1597791450,
        "id": "g21j5cb",
        "permalink": "/r/investing/comments/icbox9/sqqq_does_a_51_reverse_split/g21j5cb/",
        "score": 48,
        "subreddit": "investing",
        "created": 1597820250.0
    },
    {
        "author": "dameLillardManiac",
        "body": "HOLY FUCK RUG PULL INCOMING\n\nnow that i have the bears’ attention, fuck all of you",
        "created_utc": 1596525415,
        "id": "g0ayqza",
        "permalink": "/r/wallstreetbets/comments/i34g5h/what_are_your_moves_tomorrow_august_04_2020/g0ayqza/",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1596554215.0
    },
    {
        "author": "ThePlugJumbo",
        "body": "At least you didn’t gamble on a mattress stock at its all time high! 40k you just paid for your finance degree, now take what you just learned and make the milly whenever you can afford spy call debit spread weeklys💰",
        "created_utc": 1597548292,
        "id": "g1paazu",
        "permalink": "/r/wallstreetbets/comments/ial815/loss_porn_38k_10k_40k_80_19yo_that_needs_rope_now/g1paazu/",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1597577092.0
    },
    {
        "author": "bobbyslapps",
        "body": "Back when I had the pixel and tried to talk to girls, they wouldn't respond after texting me and founding out its android lol. Swear to god girls text back now and its the dumbest shit ever...\n\nFunny story I left Android because of that reason. Was It the right choice? damn straight.",
        "created_utc": 1597712185,
        "id": "g1xljsi",
        "permalink": "/r/wallstreetbets/comments/ibpuv1/choose_your_tech_fighter/g1xljsi/",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1597740985.0
    },
    {
        "author": "BucsLegend_TomBrady",
        "body": "Holy shit 40 mil... per day. Goddamn I know the dude is rich but I feel especially poor right now lol",
        "created_utc": 1597374095,
        "id": "g1ehzag",
        "permalink": "/r/stocks/comments/i9avyi/amd_ceo_sold_159_millions_worth_of_amd_stock/g1ehzag/",
        "score": 46,
        "subreddit": "stocks",
        "created": 1597402895.0
    },
    {
        "author": "cookingboy",
        "body": "&gt;Google and FB are not allowed in China. Even services like Dropbox and Box don't work in China.\n\nThat's because the Chinese government has some crazy draconian laws that applies to *all* companies, foreign and domestic. FB/Google/Twitter decided they don't want to comply (for good reasons), but companies like Microsoft and Apple do. The CCP doesn't specifically target any American companies.\n\n&gt;We should reciprocate.\n\nShould we copy their Great Firewall as well and ban any apps that doesn't allow government backdoor for data access? Winnie the Pooh can unilaterally ban any site/app he doesn't like, and that's what makes their government terrible, do we really want our President to have *exactly* the same type of power?\n\nIf there are privacy/national security concerns, then legislate through Congress and punish all apps/software that doesn't abide by the law, be it Facebook or WeChat. \n\nHowever I feel extremely uncomfortable that \"national security concern\" is now just the magic keyword that gives the President unlimited power to do whatever he wants. What's next, banning CNN and MSNBC because the FBI \"uncovered\" some connection between the networks and some foreign government?\n\nFurthermore speaking from personal experience, WeChat is used by millions of Chinese Americans as a chat app, very often with friends/relatives back in China. It's very similar to Line and WhatsApp in that regard. Using this logic Trump can ban all phone calls or emails or texts to China because there is a risk of the CCP government monitoring on their side.",
        "created_utc": 1596776377,
        "id": "g0n7za4",
        "permalink": "/r/investing/comments/i56798/president_trump_signs_executive_order_banning/g0n7za4/",
        "score": 45,
        "subreddit": "investing",
        "created": 1596805177.0
    },
    {
        "author": "KeepenItReel",
        "body": "Ya we can actually trade options on Tsla now without risking our entire account lol.",
        "created_utc": 1597185999,
        "id": "g15izsi",
        "permalink": "/r/options/comments/i808na/tesla_announces_a_fiveforone_stock_split/g15izsi/",
        "score": 45,
        "subreddit": "options",
        "created": 1597214799.0
    },
    {
        "author": "UABeeezy",
        "body": "This is a ginormous stretch. Kroger is Kroger. Making a move now in e-commerce is 20 years too late. \n\nInstacart would be very interesting if they choose to IPO although I’m sure they’re operating at a big loss for now.",
        "created_utc": 1597535039,
        "id": "g1oeeum",
        "permalink": "/r/investing/comments/iagsgf/buffett_thinks_kroger_is_the_next_amazon/g1oeeum/",
        "score": 45,
        "subreddit": "investing",
        "created": 1597563839.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "FUCK GOT ASSIGNED 🌽 CORN FUTURES \nNow I got 15 semi trucks 🚛 outside my house with 10,000 pounds of corn \n\nI live in a condo wtf im gonna do \n\nYikes 😳",
        "created_utc": 1597077541,
        "id": "g10au40",
        "permalink": "/r/wallstreetbets/comments/i751vc/daily_discussion_thread_for_august_10_2020/g10au40/",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1597106341.0
    },
    {
        "author": "watchmaking",
        "body": "It's like people can't read or comprehend anything anymore. TSLA is worth like 2x the marketcap of fucking Toyota right now but wait TSLA stock is only like $400 next month they must have put it on sale lets buy guys!!!!!",
        "created_utc": 1597694601,
        "id": "g1whqib",
        "permalink": "/r/wallstreetbets/comments/ibk9vh/at_this_rate_tesla_will_still_be_too_expensive/g1whqib/",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1597723401.0
    },
    {
        "author": "BuffDaddyChiz",
        "body": "THAT WAS THEN, THIS IS NOW",
        "created_utc": 1597190906,
        "id": "g15svpf",
        "permalink": "/r/StockMarket/comments/i80pce/tesla_jumps_on_the_bandwagon_announces_5_for_1/g15svpf/",
        "score": 43,
        "subreddit": "StockMarket",
        "created": 1597219706.0
    },
    {
        "author": "e30jawn",
        "body": "We are now in the \"Fomo in and lose huge everyday to theta\" part of the TSLA WSB cycle.",
        "created_utc": 1597782284,
        "id": "g210jdi",
        "permalink": "/r/wallstreetbets/comments/ic8lf0/what_are_your_moves_tomorrow_august_19_2020/g210jdi/",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1597811084.0
    },
    {
        "author": "bockscar89",
        "body": "Remember when the price tanked this morning and thousands of buttholes clenched simultaneously?  That seems like ages ago now.  Good times.",
        "created_utc": 1596829058,
        "id": "g0pptbf",
        "permalink": "/r/pennystocks/comments/i50r9y/trvn_daily_megathread/g0pptbf/",
        "score": 41,
        "subreddit": "pennystocks",
        "created": 1596857858.0
    },
    {
        "author": "lestuckingemcity",
        "body": "Shut up dad warren loves gold now. Please buy my precious metals.",
        "created_utc": 1597449956,
        "id": "g1i2klz",
        "permalink": "/r/investing/comments/i9u4du/berkshire_hathaway_snapped_up_approximately_209/g1i2klz/",
        "score": 41,
        "subreddit": "investing",
        "created": 1597478756.0
    },
    {
        "author": "TehranBro",
        "body": "Tesla now has a higher market cap than Walmart.\n\nEdit: next up to pass would be Johnson &amp; Johnson, Taiwan semiconductor and Visa.",
        "created_utc": 1597955875,
        "id": "g295iuk",
        "permalink": "/r/investing/comments/idhr6y/tesla_closes_above_2000_for_the_first_time_ever/g295iuk/",
        "score": 41,
        "subreddit": "investing",
        "created": 1597984675.0
    },
    {
        "author": "jhoosi",
        "body": "So he's got a 361k now.\n\n\n\n\n\nI'll see myself out.",
        "created_utc": 1597809822,
        "id": "g22gjmq",
        "permalink": "/r/investing/comments/icacew/the_2020_bull_market/g22gjmq/",
        "score": 41,
        "subreddit": "investing",
        "created": 1597838622.0
    },
    {
        "author": "kromemwl2",
        "body": "That dudes DD was legit AF. \n\nWhat an idiot, he wasted all that time and money pandering to you assholes. \n\nBut here's the plot twist.. That sob needed a large enough audience to dump his shares on. He probably dumped it at all time highs and is now chillen poolside on his boat. On the phone with all your moms... cuz they coming over tonight.",
        "created_utc": 1597358599,
        "id": "g1dp97j",
        "permalink": "/r/wallstreetbets/comments/i99pc9/this_is_why_no_one_does_dd_anymore/g1dp97j/",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1597387399.0
    },
    {
        "author": "iLeefull",
        "body": "Buy 3 get 3 free at Publix right now.",
        "created_utc": 1597702709,
        "id": "g1x3s15",
        "permalink": "/r/wallstreetbets/comments/ibmnwm/ggs_boys/g1x3s15/",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1597731509.0
    },
    {
        "author": "Penny_Tosser",
        "body": "I've been doing the same thing. I used to wait weeks and months for 20 to 30% gains, but now I almost cash out each day for 3% to 7% and have been doing much better over time...",
        "created_utc": 1597719324,
        "id": "g1xymah",
        "permalink": "/r/pennystocks/comments/ibsr0l/this_last_month_i_started_to_take_56_gains/g1xymah/",
        "score": 41,
        "subreddit": "pennystocks",
        "created": 1597748124.0
    },
    {
        "author": "Ad_Astra117",
        "body": "Calls on temporary crippling depression, $ROPE \n\nGirl that I've been friends with for the better part of the last decade decided to catch feelings for me right before I move across the country. She's kinda giving me an ultimatum, relationship or lose her forever. Sucks because if life had worked out in a different way that placed us in the same city for an extended period of time, I could probably see myself marrying this girl. But it's not meant to be right now, I guess, a relationship isn't going to happen. My way of life + career choice + the distance just isn't compatible the way I see it. She wants to talk tonight and I don't think it's going to go well. I'm not great at handling goodbyes. \n\nI dunno why I'm posting this here but thanks for being hilarious, guys. Reading this sub helps keep my mind off of things. Although I'd probably rather stomach the losses some of you take than this one. Financial scars hear, emotional trauma is forever",
        "created_utc": 1597782945,
        "id": "g2120lr",
        "permalink": "/r/wallstreetbets/comments/ic8lf0/what_are_your_moves_tomorrow_august_19_2020/g2120lr/",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1597811745.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "If you bought $100 worth of AAPL shares in 1891, you would have $672 billion dollars right now.",
        "created_utc": 1597974119,
        "id": "g2a58wb",
        "permalink": "/r/wallstreetbets/comments/idhs5y/what_are_your_moves_tomorrow_august_21_2020/g2a58wb/",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1598002919.0
    },
    {
        "author": "ourlastinvention",
        "body": "You see the dark pool selling means that hedge funds are now negative gamma. This correlates with heavy after-hours action on GEX. Now, normally this would just be the cyclical nature of markets. However, with the quadruple witching date arriving soon, combined with the Ichimoku cloud death cross, this signals that I have no idea what I’m fucking saying.",
        "created_utc": 1597787571,
        "id": "g21bgkl",
        "permalink": "/r/wallstreetbets/comments/ic8lf0/what_are_your_moves_tomorrow_august_19_2020/g21bgkl/",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1597816371.0
    },
    {
        "author": "magicbook",
        "body": "Ha! I used my brain, and now regretting not buying it. Applying brain sucks.",
        "created_utc": 1598049673,
        "id": "g2direv",
        "permalink": "/r/investing/comments/ie3yr4/tesla_has_soared_50_since_announcing_its_stock/g2direv/",
        "score": 39,
        "subreddit": "investing",
        "created": 1598078473.0
    },
    {
        "author": "pervsensei11",
        "body": "Bro one thing led to another \n\nAnd now I have 18 positions open \n\nBad plays wiped out my profits and I only made 68 cents today\n\n🤢🤢🤢",
        "created_utc": 1597694920,
        "id": "g1wio9g",
        "permalink": "/r/wallstreetbets/comments/iblrnn/what_are_your_moves_tomorrow_august_18_2020/g1wio9g/",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1597723720.0
    },
    {
        "author": "Blueberry_Yum_Yum",
        "body": "Wrong. ByteDance isn't selling the entire TikTok app to Microsoft, just the U.S branch. There will be 2 different apps now, one for the international market (spyware version) and one for the U.S (medium-light spyware version) market. It will still be banned in India.",
        "created_utc": 1596414632,
        "id": "g05qqae",
        "permalink": "/r/wallstreetbets/comments/i2mdmw/msft_confirms_talks_to_buy_ticktock_time_to_load/g05qqae/",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1596443432.0
    },
    {
        "author": "uchiha_boy009",
        "body": "You’re serious or just making a joke?! Tell me cause I’m putting money on Chewy now!",
        "created_utc": 1597723033,
        "id": "g1y4wad",
        "permalink": "/r/wallstreetbets/comments/ibpuv1/choose_your_tech_fighter/g1y4wad/",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1597751833.0
    },
    {
        "author": "SugarAdamAli",
        "body": "Yes, I average 17%  annualized over the past 20+ years. Beat the s&amp;p every year. key is to buy good companies when shit hits the fan..  I bought a lot in March/April/May, bought a lot in November 2018, bought a lot in 2015, same with January 2009, 20-04, when things are going good I’ll just DCA into indexes, or build into undervalued stocks.\n\nDon’t sell unless the company drastically changes..  main positions are\n\nAmazon\n\nMsft\n\nApple\n\nBaba\n\nPayPal \n\nDisney\n\nJpm\n\nCat\n\nBAC\n\nO\n\nStag\n\nBam\n\nCqqq\n\nSchd\n\nVig \n\nVigi\n\nMy Roth is filled with Amazon, msft, dis, plus a bunch of reits like O, Stag, BPYU, MPW\n\n\n\nRight now I think schwab is severely undervalued long term and building a position. Also adding to all my REIT positions except stag. Eyeing baba and tencent if China gets a big pullback. Adding some to JPM when it was mid 90s\n\n\nKey is price you pay, valuation, that ultimately determines gains.  I love tech, but I ain’t buying any of this right now, and haven’t bought any since late 2018, just enjoying my gains and piling into undervalued stocks like reits and schwab.\n\nBe patient, the market is going to be there everyday for the rest of your life and recessions gonna happen, don’t rush your buys and don’t panic when shit hits the fan..\n\nI’ve held thru tech bubble, 2008, covid.   Buy good shit that will last thru the tough times, always drip, dividend growth beats high dividends over the long term.  Never believe the analysts, it’s educated guesses at best.  Understand the businesses and what the future holds and not what the next 6 months hold.\n\nDon’t panic sell, don’t fomo buy",
        "created_utc": 1596855055,
        "id": "g0r33l6",
        "permalink": "/r/stocks/comments/i5r9ro/has_anyone_here_consistently_beat_the_sp500/g0r33l6/",
        "score": 39,
        "subreddit": "stocks",
        "created": 1596883855.0
    },
    {
        "author": "rahul4122",
        "body": "Of course I’m sad.. but now it’s a weird kind of freedom from all the stress",
        "created_utc": 1596840925,
        "id": "g0qdudg",
        "permalink": "/r/wallstreetbets/comments/i5nptk/dear_diary_i_lost_it_all_again/g0qdudg/",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1596869725.0
    },
    {
        "author": "UBERto100",
        "body": "I wanna be a millionaire so freaking bad. Bought spy puts with all I had... 🌈🐻\n\nI wanna be on the cover of forbs magazine. But Powell printing left me homless with no green 💸💸\n\nNow Everytime I close my eyes.... I see the shiny red market breakers lights... Oh yeah.... But every single fucking time oh my I swear. It's green when I'm least prepared... I'll never be a millionaire 🌈🐻😭",
        "created_utc": 1597300449,
        "id": "g1awwse",
        "permalink": "/r/wallstreetbets/comments/i8l3ny/what_are_your_moves_tomorrow_august_13_2020/g1awwse/",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1597329249.0
    },
    {
        "author": "Gatorm8",
        "body": "Now that you’ve sold you can finally buy a wheelbarrow big enough to haul around your *massive testicles*",
        "created_utc": 1597783546,
        "id": "g213bbz",
        "permalink": "/r/wallstreetbets/comments/ic91dx/thank_you_elon_dont_want_to_be_anymore_greedy/g213bbz/",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1597812346.0
    },
    {
        "author": "JustOneMoreTrade",
        "body": "I’ve been down 60k all time for months and it’s been hanging over my head making me sad every day. Well yesterday I bought TSLA calls and sold this morning. I’m now up 30k all time and the rain clouds have disappeared 🤠🤠🎉🎉",
        "created_utc": 1597794109,
        "id": "g21o4lj",
        "permalink": "/r/wallstreetbets/comments/ic8lf0/what_are_your_moves_tomorrow_august_19_2020/g21o4lj/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1597822909.0
    },
    {
        "author": "KuhioNahua",
        "body": "We no care about tech now.",
        "created_utc": 1597203187,
        "id": "g16ftri",
        "permalink": "/r/wallstreetbets/comments/i86ft9/why_is_no_one_talking_about_nvidia/g16ftri/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1597231987.0
    },
    {
        "author": "626reppin",
        "body": "This thread is so slow now that it feels like I’m talking to myself sometimes. I’d catch myself reading a comment and be like “what an idiot” then “oh wait that’s me”.",
        "created_utc": 1596659592,
        "id": "g0hgzwk",
        "permalink": "/r/wallstreetbets/comments/i4cr27/what_are_your_moves_tomorrow_august_06_2020/g0hgzwk/",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1596688392.0
    },
    {
        "author": "Iskippedfaceday",
        "body": "Remember when you asked me privately to post DD on one of your groups' stocks and I didn't? Remember when you asked privately to join you as a mod in your new pennystock subreddit because you hated this one? Since I didn't accept, now you're out to get me. Maybe you should tell people about that.\n\nYou act like I can control the stock market and these companies' businesses. Are your expectations of me so high now after the CLSK call? You act like I can dictate the movement of low float pennystocks and I must keep them up while people take profits. These are garbage companies and people want to gtfo. Of course they're going to come crashing back down, especially if things blow up. because that's what pennystocks do.\n\nBy the way, I notice when you're friendly to me. You support my posts and hype them up when you have a position. If you miss out, you shit on me. Nice job.",
        "created_utc": 1597097380,
        "id": "g11fwr7",
        "permalink": "/r/pennystocks/comments/i7ehu8/my_man_said_likely_to_beat_earnings/g11fwr7/",
        "score": 36,
        "subreddit": "pennystocks",
        "created": 1597126180.0
    },
    {
        "author": "doublemctwist1260",
        "body": "I’m taking a dump right now",
        "created_utc": 1597173764,
        "id": "g14s4pk",
        "permalink": "/r/wallstreetbets/comments/i7y6jh/is_everything_dumping/g14s4pk/",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1597202564.0
    },
    {
        "author": "Mdalkirk",
        "body": "Was feeling down, lifted some weights and now I feel great. Exercise is magic yo",
        "created_utc": 1597111950,
        "id": "g126qbq",
        "permalink": "/r/wallstreetbets/comments/i7cgi4/what_are_your_moves_tomorrow_august_11_2020/g126qbq/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1597140750.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "market cap to GDP is now 176%. The Fed has created a monster bubble. Let’s see if we can take it up to 200% of GDP.\n\nEdit: Japan had 361% market cap to GDP in 1989. Switzerland hit 397% in 1998. Let’s beat those fuckers and take this joint to 400%.",
        "created_utc": 1596846851,
        "id": "g0qopc1",
        "permalink": "/r/wallstreetbets/comments/i5l1m1/weekend_discussion_thread_for_the_weekend_of/g0qopc1/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1596875651.0
    },
    {
        "author": "doglessinseattle",
        "body": "I literally bought 1 share when it was under $200 bc someone told me it was the next big thing and buying one share was a stretch for me. Now I can't sell it because it's seeing that gain in my portfolio is like a trophy on the wall. lol",
        "created_utc": 1597966721,
        "id": "g29rqfc",
        "permalink": "/r/investing/comments/idhr6y/tesla_closes_above_2000_for_the_first_time_ever/g29rqfc/",
        "score": 35,
        "subreddit": "investing",
        "created": 1597995521.0
    },
    {
        "author": "RetardsWithAIDS",
        "body": "The best time to buy was yesterday, the second best time to buy is now.",
        "created_utc": 1596563927,
        "id": "g0cq4uz",
        "permalink": "/r/wallstreetbets/comments/i3l0qa/slv_gain_porn/g0cq4uz/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1596592727.0
    },
    {
        "author": "rom92293",
        "body": "I'm only a few months into my stock market journey and i'm going to spill a little secret cause i want other newbies to do well also. \n\nIf you use Webull and you wake up early.. 4am EST. I usually wake up about 2:30am.\n\nThere is a section called Top Gainers. You can choose categories such as Pre Market, After hours, 5 Minutes, 1 Day, 5 Days, 1 Month, 3 Months, 52 Weeks.\n\nWhen i wake up i go through the Pre Market and 1 Day category. The 1 Day lets you know what was running the day before and the Pre Market will let you know whats starting to run that day after WB hours start up. If i see the same stock on the 1 day and the PM slots i write it down and pull up the chart on WB. You can choose to include PM and After hours on the charts. The same stock on the 1 day and the PM chart is a strong indicator that this stock still has some gas in it. Sometimes just the top 3-4 on the PM movers are good targets to follow.\n\nI'll pick 2-4 of the stocks that i like for the day and in the first 5-10 minutes after WB opens you can see which ones are starting to run. If i feel good about i will buy about 5 of it and watch it for a few more minutes to see if it keeps climbing while i watch the charts. \n\nIf it keeps trending up ill buy more and then set a stop loss about 7% below my entry. If it bombs out right away i walk away. You have to learn to let it go if it drops. If it keeps climbing i adjust my stop loss along with it.\n\nThis strategy has served me pretty well so far. I know that the motto is \"dont chase.\" and while i normally agree with it the condition of the market right now is that we have multiple +50% daily runners so getting a piece of that action is totally doable. You dont need to catch the entire ride up but you can easily 10-20% of a run. A few months from now it wont be the same... but for now the getting is good so why not. \n\n&amp;#x200B;\n\nHope this information helps some people out. I started out with 3k back in June and have more than tripled that. I know its not lambo money but hey im still new and learning haha",
        "created_utc": 1597777926,
        "id": "g20q169",
        "permalink": "/r/pennystocks/comments/ic4yuk/emptied_my_account_and_left_in_095_i_figured_i/g20q169/",
        "score": 35,
        "subreddit": "pennystocks",
        "created": 1597806726.0
    },
    {
        "author": "TheAserghui",
        "body": "I see my mistake now: I've been trading in dollars, instead of euros.",
        "created_utc": 1597677960,
        "id": "g1vbq01",
        "permalink": "/r/wallstreetbets/comments/ibf6ri/noice/g1vbq01/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1597706760.0
    },
    {
        "author": "VacationLover1",
        "body": "This sub is worse than stocktwits now with all this BA nonsense \n\nWe need another purge.. either paper trading or -5% day to wipe 75% of you howler monkeys out",
        "created_utc": 1597790340,
        "id": "g21h081",
        "permalink": "/r/wallstreetbets/comments/ic8lf0/what_are_your_moves_tomorrow_august_19_2020/g21h081/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1597819140.0
    },
    {
        "author": "BSFirstOfHisName",
        "body": "I was only 32 years old. I loved Trump so much, I had all the MAGA hats and Apprentice shows. I pray to Trump every night, thanking him for the life I’ve been given. “Trump is love” I say, “Trump is life.\" My wife’s boyfriend hears me and calls me a gay bear. I knew he was just jealous of my devotion to Trump. I called him a cunt. He hits me and sends me to sleep. I'm crying now and my Positions hurt. I lay in bed, really cold. I feel something warm... It's Trump I was so happy.\n\nHe whispers in my ear \"This is my market.\" He grabs me with his orange hands, and puts me on my hands and knees. I'm ready. I spread my ass cheeks for Trump. He penetrates my butthole. It hurts so much, but I do it for Trump. I can feel my butt tearing and eyes watering. I want to please Trump. He roars a MAGA roar as he fills my butt with his love. My wife’s boyfriend walks in. Trump looks him straight in the eye and says, \"It's all calls now”. Trump leaves through my window. Trump is love. Trump is life.",
        "created_utc": 1597275897,
        "id": "g19ssmh",
        "permalink": "/r/wallstreetbets/comments/i8oycz/vshaped_recovery_boys_donnie_pump_deems_it_so/g19ssmh/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1597304697.0
    },
    {
        "author": "foo-jitsoo",
        "body": "Seriously. I have had to work my usual shift, plus extra tasks, since March with no extra pay as an \"essential frontline worker\". Meanwhile people I know in the same district get laid off and have been making considerably more than me for the past 5 months now. This is FUCKED UP. Where is the money for people that have been forced to work through all this? Oh, it doesn't exist.",
        "created_utc": 1596927768,
        "id": "g0u3y8s",
        "permalink": "/r/stocks/comments/i6736x/trump_signs_executive_order_for_400_perweek/g0u3y8s/",
        "score": 34,
        "subreddit": "stocks",
        "created": 1596956568.0
    },
    {
        "author": "dirtyrango",
        "body": "Warren can literally move any market by just saying a fucking word. \n\nDo you think they're stupid? He says \"buy gold\" they already made their money and dumb cocksmokes chase after.\n\nEdit: I'm retard drunk right now so if words don't make sense it's your fault. Shut up. Stupid bitch.",
        "created_utc": 1597468121,
        "id": "g1j209u",
        "permalink": "/r/wallstreetbets/comments/ia0s4l/buffett_fires_a_warning_shot/g1j209u/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1597496921.0
    },
    {
        "author": "PornstarVirgin",
        "body": "Actually people who live in the same household/sleep with your wife are also not allowed to trade.\n\nIn other news all of us have to stop trading now.",
        "created_utc": 1597807590,
        "id": "g22cnml",
        "permalink": "/r/wallstreetbets/comments/icfgaz/today_is_my_forced_retirement/g22cnml/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1597836390.0
    },
    {
        "author": "woodenpencilknight",
        "body": "Started with 50k now on my way to 300k",
        "created_utc": 1596511515,
        "id": "g0agjv0",
        "permalink": "/r/wallstreetbets/comments/i3bqe8/serious_portfolio_size/g0agjv0/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1596540315.0
    },
    {
        "author": "grizzly_intel",
        "body": "Ha now it’ll be an American company spying and that’s just fine.",
        "created_utc": 1596475493,
        "id": "g08c4du",
        "permalink": "/r/investing/comments/i2yx70/with_looming_tiktok_deal_estimated_at_50b_msft/g08c4du/",
        "score": 34,
        "subreddit": "investing",
        "created": 1596504293.0
    },
    {
        "author": "skykitty89",
        "body": "\"So, shots fired moments ago. NOW BACK TO THE STONK MARKET!\" \n\nONE OF US ONE OF US",
        "created_utc": 1597097219,
        "id": "g11flcy",
        "permalink": "/r/wallstreetbets/comments/i7cgi4/what_are_your_moves_tomorrow_august_11_2020/g11flcy/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1597126019.0
    },
    {
        "author": "LavenderAutist",
        "body": "Could you imagine how much loss porn we would be seeing right now if the market went the other way?",
        "created_utc": 1597705579,
        "id": "g1x9iah",
        "permalink": "/r/wallstreetbets/comments/ibp5f8/papi_musk_bringing_home_52k/g1x9iah/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1597734379.0
    },
    {
        "author": "Prodo45",
        "body": "Called I just built a factory and china now has all my IP. Please let me establish a market share before they make a clone in 6-12 months from now.",
        "created_utc": 1596421394,
        "id": "g06202w",
        "permalink": "/r/wallstreetbets/comments/i2mo4h/how_to_make_sure_your_company_doesnt_get_banned/g06202w/",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1596450194.0
    },
    {
        "author": "Ziberian",
        "body": "The craziest part is how cheap that contract is.\n\nYou bought it on March and sold on August (5 months). Five months from now will be new years.\n\nThe most OTM call on 1/15/2021 is 3500c and it is 69.00$ per. \n\ntl;dr: I am a broke college student and don't have the stacks to play Tesla :(",
        "created_utc": 1597789845,
        "id": "g21g0ly",
        "permalink": "/r/wallstreetbets/comments/ic91dx/thank_you_elon_dont_want_to_be_anymore_greedy/g21g0ly/",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1597818645.0
    },
    {
        "author": "Blackshadowzx",
        "body": "I feel stupid right now watching it go green for two weeks kept telling my self dont FOMO into it but fuck it im opening at lest one position tomorrow .",
        "created_utc": 1596491661,
        "id": "g09fmep",
        "permalink": "/r/wallstreetbets/comments/i35rx6/dedicated_to_prpl_gang_that_is_riding_flying_it/g09fmep/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1596520461.0
    },
    {
        "author": "626reppin",
        "body": "Before covid, the market actually seemed like it made sense thus making it fun to “research” about companies, earnings actually made sense, etc, but now that we all know this shit is algos vs algos, big money manipulation, I kind of lost interest in the market. Does anyone else feel the same?",
        "created_utc": 1597870961,
        "id": "g257807",
        "permalink": "/r/wallstreetbets/comments/icv9yx/what_are_your_moves_tomorrow_august_20_2020/g257807/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1597899761.0
    },
    {
        "author": "FengTsu",
        "body": "I had the first 4 iPhones and they were great. Now the new iPhone just seems like a status symbol and no one cares about the tech they are dropping 1k on.",
        "created_utc": 1597865712,
        "id": "g24w48p",
        "permalink": "/r/investing/comments/icp5cv/apple_becomes_first_us_company_to_reach_a_2/g24w48p/",
        "score": 32,
        "subreddit": "investing",
        "created": 1597894512.0
    },
    {
        "author": "kenypowa",
        "body": "I've heard competition is coming since 2010. \n\nAny time now...",
        "created_utc": 1597686136,
        "id": "g1vx3jg",
        "permalink": "/r/stocks/comments/ibhelh/tsla_broke_52week_ath_today/g1vx3jg/",
        "score": 32,
        "subreddit": "stocks",
        "created": 1597714936.0
    },
    {
        "author": "riffdex",
        "body": "Wow you can probably afford like 4 tendies by now",
        "created_utc": 1596567481,
        "id": "g0czekm",
        "permalink": "/r/wallstreetbets/comments/i3ne0h/sec_launches_investigation_of_trading_in_kodak/g0czekm/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1596596281.0
    },
    {
        "author": "activatedmilk",
        "body": "Im up a cool 2.76% today. Shopping for lambos now 😎",
        "created_utc": 1597695370,
        "id": "g1wjzgl",
        "permalink": "/r/wallstreetbets/comments/iblrnn/what_are_your_moves_tomorrow_august_18_2020/g1wjzgl/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1597724170.0
    },
    {
        "author": "Lafali",
        "body": "* Rothschilds bow to Bogdanoffs\n\n* In contact with aliens\n \n* Possess psychic-like abilities\n \n* Control france with an iron but fair fist\n \n* Own castles &amp; banks globally\n \n* Direct descendants of the ancient royal blood line\n \n* Will bankroll the first cities on Mars (Bogdangrad will be be the first city)\n \n* Own 99% of DNA editing research facilities on Earth\n \n* First designer babies will in all likelihood be Bogdanoff babies\n \n* both brothers said to have 215+ IQ, such intelligence on Earth has only existed deep in Tibetan monasteries &amp; Area 51\n \n* Ancient Indian scriptures tell of two angels who will descend upon Earth and will bring an era of enlightenment and unprecedented technological progress with them\n \n* They own Nanobot R&amp;D labs around the world\n \n* You likely have Bogdabots inside you right now\n \n* The Bogdanoffs are in regular communication with the Archangels Michael and Gabriel, forwarding the word of God to the Orthodox Church. Who do you think set up the meeting between the pope &amp; the Orthodox high command (First meeting between the two organisations in over 1000 years) and arranged the Orthodox leader's first trip to Antarctica in history literally a few days later to the Bogdanoff bunker in Wilkes land?\n \n* They learned fluent French in under a week\n \n* Nation states entrust their gold reserves with the twins. There's no gold in Ft. Knox, only Ft. Bogdanoff\n \n* The twins are about 7 decades old, from the space-time reference point of the base human currently accepted by our society\n \n* In reality, they are timeless beings existing in all points of time and space from the big bang to the end of the universe. We don't know their ultimate plans yet. We hope they're benevolent beings.﻿",
        "created_utc": 1596487178,
        "id": "g0969gj",
        "permalink": "/r/wallstreetbets/comments/i2vv5h/so_you_finally_decided_to_go_into_kodak_after_a/g0969gj/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1596515978.0
    },
    {
        "author": "Spyu",
        "body": "KR:  Look at me, I'm the AMZN now.",
        "created_utc": 1597535777,
        "id": "g1ogxqz",
        "permalink": "/r/investing/comments/iagsgf/buffett_thinks_kroger_is_the_next_amazon/g1ogxqz/",
        "score": 32,
        "subreddit": "investing",
        "created": 1597564577.0
    },
    {
        "author": "mandingob",
        "body": "You want a penny stock with huge upside potential with very little downside.  Does that make you horny? The name of the company, Aerotyne International. It is a cutting edge high-tech firm out of the Midwest awaiting imminent patent approval on the next generation of radar detectors that have both huge military and civilian applications now. Right now, the stock trades over-the-counter at 10 cents a share. And by the way, Datboi0013 , our analysts indicate it could go a heck of a lot higher than that. Your profit on a mere $6,000 investment would be upwards of $60,000!”",
        "created_utc": 1597184483,
        "id": "g15fthl",
        "permalink": "/r/pennystocks/comments/i81ghl/how_do_i_know_what_stock_to_buy/g15fthl/",
        "score": 32,
        "subreddit": "pennystocks",
        "created": 1597213283.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "**Brambles &amp; Shambles Report 8/6:**\n\n**In Brambles:**\n\n* TSM Callholders\n* DOCU Callholders\n* FSLY Dip-buyers (lmao)\n* QCOM Callholders\n* BA Callholders\n* Airline Panic-Sellers\n\n**In Shambles:**\n\n* SPY Putholders\n* AAPL Putholders\n* FB Putholders\n* MSFT Putholders\n* basically just bears\n* ZM Callholders\n* ATVI NAYSAYERS HAHAHAHAHA\n\n**\"In Shambles\" User of the Day:** u/TH3PhilipJFry for selling his AAPL calls and buying MGM puts, and \"limiting his upside by making a spread\" (fuckin nerd) also bought SPY and QQQ puts before close because he likes shambles.\n\n**Most Improved Shambles:** ATVI CALLHOLDERS BABY, WE OUT THE SHAMBLES\n\nShrimpie out ✌ Feel free to suggest any stonks I missed. Be back tomorrow.",
        "created_utc": 1596748294,
        "id": "g0lv79b",
        "permalink": "/r/wallstreetbets/comments/i4z4q7/what_are_your_moves_tomorrow_august_07_2020/g0lv79b/",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1596777094.0
    },
    {
        "author": "giveashite",
        "body": "Sure got quiet in here about RKT.  How much does it cost to hire a hype team?  I need some help boosting QCOM.",
        "created_utc": 1596743110,
        "id": "g0lk5dt",
        "permalink": "/r/wallstreetbets/comments/i4p4at/daily_discussion_thread_for_august_06_2020/g0lk5dt/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1596771910.0
    },
    {
        "author": "winter32842",
        "body": "QCOM. They invented the 5g.",
        "created_utc": 1597100238,
        "id": "g11lkk1",
        "permalink": "/r/stocks/comments/i7f7nw/5g_stocks/g11lkk1/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1597129038.0
    },
    {
        "author": "caesar_7",
        "body": "From investors point of view, Intel:\n\n* Missed mobile and wasn't able to catch up;\n* Failed to compete with Qualcomm in modems;\n* Failed to compete with NVIDIA in parallel computing aka GPUs;\n* Lost Apple as a client for both mobile modems and desktop CPUs;\n* Shrinking PC market is not lucrative enough;\n* Hi-End gaming rigs are mostly AMD-based;\n* Amazon uses their own Graviton CPU with better cost-performance ratios than Intel;\n* Google has its own TPU.\n\nSo it's on the same level as some white goods manufacturer, like Whirlpool or Ariston. Yeah, they produce stuff that businesses and people buy, no it's not lucrative nor growing anymore.",
        "created_utc": 1596685276,
        "id": "g0ituqe",
        "permalink": "/r/StockMarket/comments/i4e68c/take_advantage_of_the_overreaction/g0ituqe/",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1596714076.0
    },
    {
        "author": "Donttouchmydorritos",
        "body": "Calls on Apple 100%.\n\nQualcomm Snapdragon flaw is 100% not priced in! Apple has never had a flaw this severe, all that touting of security is going to start paying off bigly!",
        "created_utc": 1597026373,
        "id": "g0ydvh9",
        "permalink": "/r/wallstreetbets/comments/i6q5au/what_are_your_moves_tomorrow_august_10_2020/g0ydvh9/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1597055173.0
    },
    {
        "author": "ghostbearinforest",
        "body": "Tsmc Qualcomm and amd are gonna own 2020-2025",
        "created_utc": 1596684695,
        "id": "g0iswy9",
        "permalink": "/r/stocks/comments/i4jda2/tsm_tsmc_potential_break_out/g0iswy9/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1596713495.0
    },
    {
        "author": "TheIndulgery",
        "body": "Right now are good times to buy long term holds. Really bad time for options and sells. If you're losing right now, close RH and come back to it next week. I'm willing to bet you're losing money because you're buying penny stocks suggested by Reddit and Twitter \"experts\". Don't try to get rich quick, buy the stuff that's on sale right now (BA, KSS, AAL, NOK, NCLH), or if you want a little safe speculation go with ERIC, GSK, JNJ, or QCOM\n\n&amp;#x200B;\n\nDon't try to get rich quick, try to invest. As the saying goes, money is not made in the buying and selling, it's made in the waiting.",
        "created_utc": 1596731113,
        "id": "g0ksi6x",
        "permalink": "/r/RobinHood/comments/i4tasu/anyone_else_in_a_losing_slump/g0ksi6x/",
        "score": 4,
        "subreddit": "RobinHood",
        "created": 1596759913.0
    },
    {
        "author": "hkfreeze21",
        "body": "QCOM TO TENDIE TOWN",
        "created_utc": 1597163183,
        "id": "g145dn7",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g145dn7/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1597191983.0
    },
    {
        "author": "_metoo_x_x",
        "body": "Watch the market everyday throughout the day.\n\nIf you’re testing out the market and afraid Buy the stock outright. Assuming you believe in the underlying potential of the company.\n\nThen buy a call option that supports your optimism about a stock that you’ve “researched”.\n\nI use the term research very loosely.\n\nRide the hype. But you only catch the beginning of the hype if you stay plugged into the meme cycle/news.\n\nGood luck. Im mostly here for lulz but I’ve made some money on options. Most recent from QCOM.\n\nGet some ERIC 2021/2022 $12 calls for a safe bet. Try to wait for a red day if you want to be cheap.\n5G is coming whether people want it or not.\n\nPersonally, I buy the dip in big names stocks (calls that is)\n\nEdit: comparing yourself to others will only give you unrealistic expectations. FOMO is a portfolio killer",
        "created_utc": 1596518953,
        "id": "g0arbt4",
        "permalink": "/r/wallstreetbets/comments/i3bqe8/serious_portfolio_size/g0arbt4/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596547753.0
    },
    {
        "author": "Killerslug",
        "body": "Woah Qualcomm, massive hulk dick",
        "created_utc": 1597162578,
        "id": "g1441tb",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g1441tb/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1597191378.0
    },
    {
        "author": "Ankel88",
        "body": "i know microchip... who doesnt?!\n\nthey mostly do fpga and other micro controllers for industrial applications, it's a different kind of animals than AMD o Qualcomm...\n\nbut dont listen to me, I'm an idiot. \n\nBULL CALL ON MICROCHIP",
        "created_utc": 1596393662,
        "id": "g04nd60",
        "permalink": "/r/wallstreetbets/comments/i2fue2/mchp_is_the_next_qcom_300_gain_potential_after/g04nd60/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596422462.0
    },
    {
        "author": "griswalt7",
        "body": "$QCOM, popping chips",
        "created_utc": 1597163143,
        "id": "g145ae2",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g145ae2/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597191943.0
    },
    {
        "author": "ElonTaxiDriver",
        "body": "QCOM mooning",
        "created_utc": 1597165040,
        "id": "g149k91",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g149k91/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597193840.0
    },
    {
        "author": "winnning007",
        "body": "#$QCOM 🚀",
        "created_utc": 1597163715,
        "id": "g146lev",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g146lev/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597192515.0
    },
    {
        "author": "TAWS",
        "body": "QCOM is free money right now",
        "created_utc": 1597165980,
        "id": "g14bj22",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g14bj22/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597194780.0
    },
    {
        "author": "undecidedmarketmaker",
        "body": " [https://www.wsj.com/articles/ford-should-go-private-to-have-a-shot-at-lapping-tesla-11596813153?mod=hp\\_lista\\_pos3](https://www.wsj.com/articles/ford-should-go-private-to-have-a-shot-at-lapping-tesla-11596813153?mod=hp_lista_pos3) \n\nThis means that someone big (probably Ford himself) reached out to a reporter to get this story out and gauge reactions. Personally, I'm *extremely* doubtful this is going to happen, the least reason being that I've met Ford several times and who did he remind me of? Paul Jacobs and XCOM. Long story short, few years ago Jacobs came up with a harebrained idea to take QCOM private. He was basically laughed out and ejected from his chairman spot. \n\nThis is the *exact* same setup - family scion thinks he can pull off the heist of the decade while actual investors laugh their asses off.\n\ntl;dr F $4P Jan 2021",
        "created_utc": 1596853962,
        "id": "g0r17hw",
        "permalink": "/r/wallstreetbets/comments/i5l1m1/weekend_discussion_thread_for_the_weekend_of/g0r17hw/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596882762.0
    },
    {
        "author": "winnning007",
        "body": "$AMD $TSM $QCOM $BAC $NOK 1/21s. Train will be leaving soon",
        "created_utc": 1596637393,
        "id": "g0g496j",
        "permalink": "/r/wallstreetbets/comments/i42orx/daily_discussion_thread_for_august_05_2020/g0g496j/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596666193.0
    },
    {
        "author": "FreeSpiritRunning",
        "body": "The dotcom crash didn't happen in a day...it took a year and if you were just riding the wave and DCA'ing through 2000 you would have been down 20-30% on one year of investment before you said \"Yeah fuck this I'm gonna bail to gold/real estate/cash\" at the end of 2000. \n\nCompare that to the 5 year 300%+ run-up of the NASDAQ from 1995-2000 (which you would have kept if you had bailed in 2000) and you can see why trying to time the bubble is a bad idea. There could potentially be a lot more runup if/when it goes pop.\n\nAlso, I was in the market back then...there was A TON of warning from the FED. They seriously gave like a 2 month lead to the intrest rate hike...so its not like everyone just woke up on Monday and blew their coffee into the morning newspaper.\n\nWas there FOMO? Hell yes, and a ton of denial. But people who were playing the market did fine...the guys that lost there asses were the dudes that YOLO'd their live savings into Pets.com and then took out a third mortgage on their house to get a little QCOM on the side.\n\nAs long as you aren't doing something like that right now I honestly wouldn't sweat it yet, theres zero indication that anything is going to turn the market. FAAMG just smashed earning in a quarter where the entire globe was shut down. Microsoft is trying to buy TikTok, Facebook just partnered with SHOP, SHOP just partnered with Walmart, Google just bought a stake in ADT, Amazon probably absorbed 15 more companies on the downlow between breakfast and lunch. Does this look like a struggling sector to you?",
        "created_utc": 1596510373,
        "id": "g0aem0x",
        "permalink": "/r/investing/comments/i38pnu/is_nasdaq_heading_towards_another_tech_bubble/g0aem0x/",
        "score": 3,
        "subreddit": "investing",
        "created": 1596539173.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "All you had to do on Friday was buy calls on a random tech stock. Wow, FSLY, ZM, NVDA, QCOM, etc. all went offffff",
        "created_utc": 1596464067,
        "id": "g07jaq9",
        "permalink": "/r/wallstreetbets/comments/i2upp0/daily_discussion_thread_for_august_03_2020/g07jaq9/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596492867.0
    },
    {
        "author": "harryburton420",
        "body": "qcom going back down to 100 eow. buy puts @ open tomorrow so ez",
        "created_utc": 1596392960,
        "id": "g04ltfi",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g04ltfi/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596421760.0
    },
    {
        "author": "ErziRafael",
        "body": "But don't listen to ppl on the internet. I sold AMD, PYPL and QCOM early after the first spike and missed out on a lot of money.",
        "created_utc": 1596651848,
        "id": "g0gzt4g",
        "permalink": "/r/stocks/comments/i4agc5/whats_going_on_with_bfra/g0gzt4g/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1596680648.0
    },
    {
        "author": "Killerslug",
        "body": "Holy fuck what is this QCOM run",
        "created_utc": 1597162866,
        "id": "g144o1t",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g144o1t/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597191666.0
    },
    {
        "author": "yoshizzles",
        "body": "holy shit, was anyone in QCOM??",
        "created_utc": 1597163285,
        "id": "g145m3c",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g145m3c/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597192085.0
    },
    {
        "author": "Dicknition",
        "body": "QCOM is fuk",
        "created_utc": 1596997093,
        "id": "g0wwqbh",
        "permalink": "/r/wallstreetbets/comments/i5l1m1/weekend_discussion_thread_for_the_weekend_of/g0wwqbh/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597025893.0
    },
    {
        "author": "Rhaximus",
        "body": "NVDA is far less overextended than QCOM, but waiting on a red day for both",
        "created_utc": 1596646750,
        "id": "g0gowmo",
        "permalink": "/r/wallstreetbets/comments/i42orx/daily_discussion_thread_for_august_05_2020/g0gowmo/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596675550.0
    },
    {
        "author": "harryburton420",
        "body": "qcom 100p",
        "created_utc": 1596400152,
        "id": "g050n6n",
        "permalink": "/r/wallstreetbets/comments/i2iqcm/what_are_your_moves_tomorrow_august_03_2020/g050n6n/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596428952.0
    },
    {
        "author": "smashingguy81",
        "body": "Here is mine - 38 yrs !! Been holding a lot of these for a longer time now and some thrown into the mix this year !! Long list !! But, I've been trying to diversify into non tech too and although not the best, I've gotten better !! \n\n&amp;#x200B;\n\n|AMZN|15.14|\n|:-|:-|\n|AAPL|14.78|\n|TSLA|8.53|\n|MSFT|5.44|\n|FB|4.29|\n|CRM|4.14|\n|JPM|3.72|\n|V|3.51|\n|GOOG|2.82|\n|UBER|2.54|\n|PYPL|2.51|\n|NOW|2.23|\n|VRTX|2.09|\n|ISRG|1.87|\n|NXPI|1.53|\n|MCD|1.53|\n|COST|1.52|\n|SPLK|1.39|\n|ATVI|1.35|\n|NFLX|1.28|\n|AVGO|1.26|\n|ILMN|1.19|\n|QCOM|1.17|\n|HON|1.16|\n|NVDA|1.30|\n|BA|1.11|\n|HD|1.15|\n|PLD|1.07|\n|AMGN|0.92|\n|NEE|0.91|\n|DIS|0.81|\n|STZ|0.78|\n|DOCU|0.72|\n|PANW|0.67|\n|MASI|0.57|\n|VMW|0.56|\n|FRT|0.49|\n|EPD|0.45|\n|DAL|0.44|\n|ZTS|0.40|\n|WORK|0.38|\n|ABBV|0.24|\n|||",
        "created_utc": 1596691300,
        "id": "g0j2mxq",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/g0j2mxq/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1596720100.0
    },
    {
        "author": "heartstesler",
        "body": "China will target all Semiconductor companies Qualcomm and Apple and Microsoft and google\n\nFacebook and amazon no exposure to China",
        "created_utc": 1596773048,
        "id": "g0n32iy",
        "permalink": "/r/wallstreetbets/comments/i4z4q7/what_are_your_moves_tomorrow_august_07_2020/g0n32iy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596801848.0
    },
    {
        "author": "VValrus54",
        "body": "Company name\tDeclared 5G families\tFiled at USPTO, EPO or PCT\tGranted in one office\n\n\nHuawei Technologies (CN)\t3,325\t2,379\t1,337\n\n\nSamsung Electronics (KR)\t2,846\t2,542\t1,746\n\n\nLG Electronics (KR)\t2,463\t2,296\t1,548\n\n\nNokia (including Alcatel-Lucent) (FI)\t2,308\t2,098\t1,683\n\n\nZTE Corporation (CN)\t2,204\t1,654\t596\n\n\nEricsson (SE)\t1,423\t1,295\t765\n\n\nQUALCOMM (US)\t1,330\t1,121\t866\n\n\nIntel Corporation (US)\t934\t885\t171\n\n\nSharp Corporation (JP)\t808\t677\t444",
        "created_utc": 1596742389,
        "id": "g0lihsl",
        "permalink": "/r/wallstreetbets/comments/i4ygeq/in_the_5g_race_who_are_you_betting_on/g0lihsl/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596771189.0
    },
    {
        "author": "matthias_lee",
        "body": "QCOM going up?  or priced in?",
        "created_utc": 1597181242,
        "id": "g158roj",
        "permalink": "/r/wallstreetbets/comments/i7z0pb/what_are_your_moves_tomorrow_august_12_2020/g158roj/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597210042.0
    },
    {
        "author": "swab148",
        "body": "Hence the LEAP, I also have ERIC. Huawei seems cornered, even though it is a large market, I think that'll be cut off in pieces. Long-term, I believe in 5G. Qcom is like a pipeline play in the oil biz, probably worth it but not as profitable. Take any gainz you can, though!",
        "created_utc": 1596685583,
        "id": "g0iucls",
        "permalink": "/r/options/comments/i48ax8/do_you_have_a_rule_for_cutting_lossestaking_gains/g0iucls/",
        "score": 2,
        "subreddit": "options",
        "created": 1596714383.0
    },
    {
        "author": "Donttouchmydorritos",
        "body": "That paired with the Qualcomm news, stock split, increased growth in services, etc, it’s going to be another big couple weeks for apple",
        "created_utc": 1597018219,
        "id": "g0y06mz",
        "permalink": "/r/wallstreetbets/comments/i6q5au/what_are_your_moves_tomorrow_august_10_2020/g0y06mz/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597047019.0
    },
    {
        "author": "uaoleksiy",
        "body": "anything out there to buy? sitting on 10k cash.. Apple/FB is a no, premiums too high. Covid stocks meh, OSTK, QCOM, SQ, PYPL - already made money on this week not gonna play. SPY puts- holding, cheap insurance and not buying calls right now.. SLV already in IRA, Jan 25 calls. What else? not gonna buy RKT. PRPL or KODK either",
        "created_utc": 1596823617,
        "id": "g0pecnl",
        "permalink": "/r/wallstreetbets/comments/i5b9o9/daily_discussion_thread_for_august_07_2020/g0pecnl/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596852417.0
    },
    {
        "author": "LanN00B",
        "body": "Is Nokia dropping fr the Qualcomm issues?",
        "created_utc": 1597072886,
        "id": "g101ieu",
        "permalink": "/r/wallstreetbets/comments/i751vc/daily_discussion_thread_for_august_10_2020/g101ieu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597101686.0
    },
    {
        "author": "Remote_Stage",
        "body": "QCOM popping",
        "created_utc": 1597163348,
        "id": "g145rc5",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g145rc5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597192148.0
    },
    {
        "author": "uaoleksiy",
        "body": "wow.. got some tweet about QCOM news and immediately bought 8/21 111 calls.. up 58% in less than 10 seconds.. burning a day trade on this today fuck it",
        "created_utc": 1597163079,
        "id": "g14559w",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g14559w/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597191879.0
    },
    {
        "author": "nightguard83",
        "body": "AVGO gapping up QCOM style. I remember being attacked for calling out QCOM when it was at 78 lmao",
        "created_utc": 1597163519,
        "id": "g1465dl",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g1465dl/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597192319.0
    },
    {
        "author": "AnujSaharan",
        "body": "Was deciding between QCOM, SPOT, and SBUX calls in the morning. Got SBUX. Inverse me.",
        "created_utc": 1597163909,
        "id": "g147148",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g147148/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597192709.0
    },
    {
        "author": "radarbot",
        "body": "The only thing that makes me wary is that QCOM historical performance over the past 5 years has been really middling. Its almost as if its a swing stock, not an all-time-winner.\n\nIts hard to judge if QCOM has it to be a real long term winner. Investing in it 5 years ago, or even 10 years ago, in a set and forget style strategy would have yielded very middling returns.\n\nBut if you look at the recent spread, it had a golden cross on June 25, which is not too long ago. So you have time to still catch the wave before it starts to tip back down.",
        "created_utc": 1596672580,
        "id": "g0i6y9s",
        "permalink": "/r/stocks/comments/i4gq85/qcom_comes_to_deal_with_huawei_over_patent/g0i6y9s/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1596701380.0
    },
    {
        "author": "way2lazy4u",
        "body": "consider RTX and QCOM",
        "created_utc": 1596555000,
        "id": "g0c3e1i",
        "permalink": "/r/stocks/comments/i3ktgl/favourite_growth_stock/g0c3e1i/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1596583800.0
    },
    {
        "author": "pajumajo",
        "body": "$QCOM",
        "created_utc": 1596403265,
        "id": "g056hhb",
        "permalink": "/r/wallstreetbets/comments/i2iqcm/what_are_your_moves_tomorrow_august_03_2020/g056hhb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596432065.0
    },
    {
        "author": "brownbrandon",
        "body": "that happened to me with QCOM, INTC and FB.\n\nThis week I bought ATVI, PRPL, and CVS.\n\nthat's just the way she goes",
        "created_utc": 1596662671,
        "id": "g0hni9t",
        "permalink": "/r/wallstreetbets/comments/i4cr27/what_are_your_moves_tomorrow_august_06_2020/g0hni9t/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596691471.0
    },
    {
        "author": "bagel_maker974",
        "body": "Risk/Time Profile?\n\nI've got money in AVGO &amp; QCOM, V is a good buy and hold; due for a good pop to 210 eventually, AMZN and SHOP are always fun choices. iPay for the ETF Fans. SE has been a fun ride, probably not the right buy for someone to buy and forget about but if you still wanna check back daily thats a good one.",
        "created_utc": 1596732609,
        "id": "g0kvvm6",
        "permalink": "/r/wallstreetbets/comments/i4p4at/daily_discussion_thread_for_august_06_2020/g0kvvm6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596761409.0
    },
    {
        "author": "Have_A_Nice_Fall",
        "body": "I probably just bought the top of QCOM but I really don't care. Once 5g gets rolling this shit will be printing.\n\nJust adding to what I already have.",
        "created_utc": 1597163534,
        "id": "g1466m0",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g1466m0/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597192334.0
    },
    {
        "author": "jddigitalchaos",
        "body": "You guys obviously don't understand Intel's 5G business. 5G isn't only about cellular modems. As you said, Intel sold their modem business, where Intel plans to be involved in 5G in the base station chips and other areas. QCOM has just too much of a monopoly on the modem business.",
        "created_utc": 1596690644,
        "id": "g0j1r8r",
        "permalink": "/r/StockMarket/comments/i4e68c/take_advantage_of_the_overreaction/g0j1r8r/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1596719444.0
    },
    {
        "author": "FreeSpiritRunning",
        "body": "I started investing when I was 18 pretty much the same way these posts state..through my father.\n\nNote: I turned 18 in 1999, the top was definitly in back then. QCOM and CSCO were among some of my best performers while I just blindly rammed all my Pizza Hut tip money into the market...I remember buying a mansion in my head by the time I was 19 then motherfuckin Alan Greenspan gave me the keys to my mobile home lol. \n\nAlso I bagheld 100 shares MSFT at a cost average in the low 40 till 2010 when I cut my losses and slammed them into SPY instead. Bird up.",
        "created_utc": 1596377731,
        "id": "g03may3",
        "permalink": "/r/stocks/comments/i2bznd/how_many_im_a_teenager_posts_do_we_think_are/g03may3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596406531.0
    },
    {
        "author": "cyberpimp2",
        "body": "Huawei is a couples years ahead in terms of technology... this is reminiscent of the USSR forcing Warsaw Pact countries into using their defective technology except now the tables have turned... it’s now the west forcing us to use Qualcomm, Nokia and Ericsson tech which is behind. There may be short term gains in NOK but I think as the more and more news comes out detailing how far behind we are in the tech and seeing emerging market pick The Huawei stack, these companies may not survive. Or like USSR they’ll survive as companies propped up by the state for show.",
        "created_utc": 1596376301,
        "id": "g03iki8",
        "permalink": "/r/stocks/comments/i252f9/nok/g03iki8/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596405101.0
    },
    {
        "author": "be_o3",
        "body": "&gt;qcom \n\nwhy?",
        "created_utc": 1596338884,
        "id": "g01w9np",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g01w9np/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596367684.0
    },
    {
        "author": "Tetkobear",
        "body": "I'm planning to get some more nvda. So you get qcom?",
        "created_utc": 1596646767,
        "id": "g0goy1a",
        "permalink": "/r/wallstreetbets/comments/i42orx/daily_discussion_thread_for_august_05_2020/g0goy1a/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596675567.0
    },
    {
        "author": "OdaNobunagah",
        "body": "INTC LEAPs, QCOM calls, and WFC calls if you want a yolo. You could also easily trade the momentum on V/MA, just look at the rectangle/channel they both have going on.",
        "created_utc": 1596407631,
        "id": "g05entd",
        "permalink": "/r/wallstreetbets/comments/i2iqcm/what_are_your_moves_tomorrow_august_03_2020/g05entd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596436431.0
    },
    {
        "author": "frrealz",
        "body": "Qualcomm is not behind in the modem space, in fact, I would argue they are pioneering or leading. However on the infrastructure side, Ericsson and Nokia are definitely at least a year behind Huawei and ZTE.",
        "created_utc": 1596397071,
        "id": "g04ut5h",
        "permalink": "/r/stocks/comments/i252f9/nok/g04ut5h/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596425871.0
    },
    {
        "author": "c10cooper",
        "body": "That’s exactly what I was think. AMD and QCOM popped liked crazy too. Even though they are huge compared to CRUS I can still see a huge upward movement after earnings.",
        "created_utc": 1596415417,
        "id": "g05s1ej",
        "permalink": "/r/wallstreetbets/comments/i2iqcm/what_are_your_moves_tomorrow_august_03_2020/g05s1ej/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596444217.0
    },
    {
        "author": "Dr__Lazy",
        "body": "i made 770% on QCOM, flipped into 27c PINS and hit 1,110%. put that into CLX for earnings monday. and then will put those tendies into FSLY and ROKY 8/7 FDs.",
        "created_utc": 1596404643,
        "id": "g05933u",
        "permalink": "/r/wallstreetbets/comments/i23b2k/the_rare_triple_earnings_play_1k_10k_this_week/g05933u/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596433443.0
    },
    {
        "author": "crackercider",
        "body": "That is my bet, both GOP and Dem infrastructure plan wants to build up 5G and QCOM is domestic, so first in line for subsidies.",
        "created_utc": 1596317242,
        "id": "g00w8g8",
        "permalink": "/r/wallstreetbets/comments/i1u4uu/nokia_calls_next_kodak/g00w8g8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596346042.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "QCOM is the ultimate 5G play but it already pumped hella",
        "created_utc": 1596317506,
        "id": "g00woq1",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g00woq1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596346306.0
    },
    {
        "author": "AnujSaharan",
        "body": "QCOM is horseshit",
        "created_utc": 1596727991,
        "id": "g0kla0n",
        "permalink": "/r/wallstreetbets/comments/i4p4at/daily_discussion_thread_for_august_06_2020/g0kla0n/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596756791.0
    },
    {
        "author": "kutuzovgambit",
        "body": "https://www.gizmochina.com/2020/08/05/samsung-lost-qualcomm-5nm-orders-tsmc/",
        "created_utc": 1596756998,
        "id": "g0mbvr5",
        "permalink": "/r/wallstreetbets/comments/i4z4q7/what_are_your_moves_tomorrow_august_07_2020/g0mbvr5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596785798.0
    },
    {
        "author": "giveashite",
        "body": "QCOM gang ain't doin' so hot either.",
        "created_utc": 1596815194,
        "id": "g0ow000",
        "permalink": "/r/wallstreetbets/comments/i5b9o9/daily_discussion_thread_for_august_07_2020/g0ow000/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596843994.0
    },
    {
        "author": "rp_ush",
        "body": "What do you guys think of QCOM and KLR? My take on KLR is that it would be a great growth stock, since it’s in a rapidly growing industry, that they are close to the front in. QCOM might dip due to security on their chips, so I’m gonna pick some up, since they are basically the main chipmaker for smartphones, a huge market. They have a lot of opportunities for clients.",
        "created_utc": 1596829318,
        "id": "g0pqd20",
        "permalink": "/r/stocks/comments/i59w90/rstocks_daily_discussion_fundamentals_friday_aug/g0pqd20/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596858118.0
    },
    {
        "author": "Donttouchmydorritos",
        "body": "Because AAPL &gt; MSFT, also AAPL is going to benefit from the Qualcomm flaw significantly.",
        "created_utc": 1597061536,
        "id": "g0zitaw",
        "permalink": "/r/wallstreetbets/comments/i6q5au/what_are_your_moves_tomorrow_august_10_2020/g0zitaw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597090336.0
    },
    {
        "author": "frodobomber",
        "body": "How is QCOM not tanking?",
        "created_utc": 1597079269,
        "id": "g10edb5",
        "permalink": "/r/wallstreetbets/comments/i751vc/daily_discussion_thread_for_august_10_2020/g10edb5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597108069.0
    },
    {
        "author": "LIaVIseN",
        "body": "I have my money on Qualcomm and FIVG. Apple is another one, when they finally transition from 4G to 5G modems.",
        "created_utc": 1597103200,
        "id": "g11r3jp",
        "permalink": "/r/stocks/comments/i7f7nw/5g_stocks/g11r3jp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597132000.0
    },
    {
        "author": "giveashite",
        "body": "QCOM?  Interesting...",
        "created_utc": 1597162698,
        "id": "g144b07",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g144b07/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597191498.0
    },
    {
        "author": "philltastic1",
        "body": "Anyone know why QCOM is rising right now. It's hanging around 4% at the moment for me.",
        "created_utc": 1597163040,
        "id": "g14523s",
        "permalink": "/r/stocks/comments/i7nsh7/rstocks_daily_discussion_technicals_tuesday_aug/g14523s/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597191840.0
    },
    {
        "author": "yoshizzles",
        "body": "damnnn, just saw it on CNBC\n\nhttps://www.marketscreener.com/QUALCOMM-INC-4897/news/US-NINTH-CIRCUIT-COURT-OF-APPEALS-REVERSES-RULING-AGAINST-QUALCOMM-INC-IN-U-S-FEDERAL-TRADE-COMMISS-31100225/",
        "created_utc": 1597163549,
        "id": "g1467up",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g1467up/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597192349.0
    },
    {
        "author": "DregGunaway",
        "body": "apparently qcom won its FTC appeal",
        "created_utc": 1597162983,
        "id": "g144xjf",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g144xjf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597191783.0
    },
    {
        "author": "FuzzyWuzzyWasntABear",
        "body": "V, QCOM, DIS, JPM, BA quite a lot actually",
        "created_utc": 1597172680,
        "id": "g14prpb",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g14prpb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597201480.0
    },
    {
        "author": "Never_Do_Ordinary",
        "body": "I've heard they're looking to diversify into different areas for revenue with their TV's and 5g contacts B2B in Taiwan.  They've got a long road back but hey maybe Qualcomm buys em out to run their 5g sector to capture 5g networks for the Western hemispheres 🤞",
        "created_utc": 1597080472,
        "id": "g10gvup",
        "permalink": "/r/stocks/comments/i762q1/400_dollars_wth_is_a_good_sector_to_invest_in/g10gvup/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597109272.0
    },
    {
        "author": "HTleo",
        "body": "QCOM snapdragon flaw is huge news. May send stock down 10% this week.",
        "created_utc": 1596978462,
        "id": "g0vzrts",
        "permalink": "/r/wallstreetbets/comments/i5l1m1/weekend_discussion_thread_for_the_weekend_of/g0vzrts/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597007262.0
    },
    {
        "author": "Mr-Big-Baguette",
        "body": "Poots on Qualcomm",
        "created_utc": 1597018170,
        "id": "g0y03k9",
        "permalink": "/r/wallstreetbets/comments/i6q5au/what_are_your_moves_tomorrow_august_10_2020/g0y03k9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597046970.0
    },
    {
        "author": "bitflag",
        "body": "&gt; they just didn't end up having compelling products for a variety of reasons\n\nIn other words, they couldn't be bothered to invest enough to have competitive products. Intel has had virtually unlimited supply of money to invest if they wanted to. But they didn't, because improving the next quarter's bottom line took priority over long term development into new markets.\n\nAtom is a perfect example : it failed first because Intel sold their ARM division (they thought it was not profitable enough - first big mistake), and then they made an half-assed effort by scaling down their x86 stuff which was cheaper than getting back into ARM (again being too obsessed with cost and margins rather than taking a long term view and putting in the work). To the surprise of nobody, it failed while Qualcomm thrived.\n\nBy comparison the FAANG invest in pretty much any emerging idea that shows up. Facebook acquires or imitates any new trend. Google puts money in a zillion different ideas (most end up killed, but at least they make sure they get their foot in the door if it goes big), etc. They know there will be new big hot markets and they don't want to be left out, and they are willing to lose the money on failed projects just to be sure they won't miss the boat on tomorrow's next big thing. Had Intel done that, they'd be the king of mobile and GPU now.",
        "created_utc": 1597029035,
        "id": "g0yi78k",
        "permalink": "/r/investing/comments/i62pil/intel_ceo_bought_400k_of_intel_stock_upcoming/g0yi78k/",
        "score": 1,
        "subreddit": "investing",
        "created": 1597057835.0
    },
    {
        "author": "curvedbymykind",
        "body": "Just curious - Why does everybody talk only about these 2 (NOK and ERIC) when it comes to 5G companies? What about Qualcomm, Verizon, AT&amp;T which are much bigger names?",
        "created_utc": 1597011960,
        "id": "g0xp5qv",
        "permalink": "/r/investing/comments/i2thge/the_underrated_stock_survey_submit_your_picks_for/g0xp5qv/",
        "score": 1,
        "subreddit": "investing",
        "created": 1597040760.0
    },
    {
        "author": "marumaruuu",
        "body": "Okay so not only do Qualcomm chips have this issue, but due to the nature of Android (that has more lax regulations on what apps go into the play store and third party apps being downloadable through sources outside play store), which are the devices that primarily use these chips, it makes the problem worse?\n\nLol apple anytime",
        "created_utc": 1596970610,
        "id": "g0vqgk4",
        "permalink": "/r/wallstreetbets/comments/i5l1m1/weekend_discussion_thread_for_the_weekend_of/g0vqgk4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596999410.0
    },
    {
        "author": "dickwheelies",
        "body": "QCOM fucked? \n\nhttps://arstechnica.com/information-technology/2020/08/snapdragon-chip-flaws-put-1-billion-android-phones-at-risk-of-data-theft/",
        "created_utc": 1596966280,
        "id": "g0vmagy",
        "permalink": "/r/wallstreetbets/comments/i5l1m1/weekend_discussion_thread_for_the_weekend_of/g0vmagy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596995080.0
    },
    {
        "author": "AnujSaharan",
        "body": "Sold QCOM calls for 50% profit. They're currently up 300. AMA.",
        "created_utc": 1596462874,
        "id": "g07gxpj",
        "permalink": "/r/wallstreetbets/comments/i2upp0/daily_discussion_thread_for_august_03_2020/g07gxpj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596491674.0
    },
    {
        "author": "AnujSaharan",
        "body": "I am a fucking moron for selling my Qualcomm calls at open",
        "created_utc": 1596461861,
        "id": "g07f3it",
        "permalink": "/r/wallstreetbets/comments/i2upp0/daily_discussion_thread_for_august_03_2020/g07f3it/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596490661.0
    },
    {
        "author": "Myusernamegoesup",
        "body": "Man qcom was the move 🎉🎉",
        "created_utc": 1596462132,
        "id": "g07fj4f",
        "permalink": "/r/wallstreetbets/comments/i2upp0/daily_discussion_thread_for_august_03_2020/g07fj4f/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596490932.0
    },
    {
        "author": "memes_in_my_but",
        "body": "Qualcomm announced their new Snapdragon 875 chipset to be at least 25% more expensive than previous generation. That is $250 per phone manufactures have to pay. \n\n\nSo ure saying that the chip costs about 1k ?",
        "created_utc": 1596390223,
        "id": "g04g16h",
        "permalink": "/r/wallstreetbets/comments/i266ax/long_amd_new_exynos_1000_chipset_will_take_amd/g04g16h/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596419023.0
    },
    {
        "author": "grumpkin17",
        "body": "They’ve been innovating for years. It’s just not as flashy as you think/hope they should be doing.\n\nI think Apple designing their in-house processing chips are huge to stop being dependent on other semiconductor manufacturers. So don’t be surprised in the next year or so that they’ll announce that they designed their own modem to get away from paying exuberant licensing fees (and spent billions of lawsuits) to Qualcomm.",
        "created_utc": 1596470586,
        "id": "g07ymfx",
        "permalink": "/r/stocks/comments/i2y643/when_will_aapl_be_innovative_again_will_it_need_to/g07ymfx/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596499386.0
    },
    {
        "author": "-R47-",
        "body": "Two completely different things here. AMD sold off Radeon licensing to Qualcomm long ago, and they've been using that technology to design their own GPUs for years. Now AMD is working with Samsung to develop RDNA GPUs into Exynos chipsets. Imo not that big of news, since Exynos chipsets are got garbage due to the power inneficent CPU cores, noone seemed to care that much about the GPU.",
        "created_utc": 1596395062,
        "id": "g04qf7y",
        "permalink": "/r/wallstreetbets/comments/i266ax/long_amd_new_exynos_1000_chipset_will_take_amd/g04qf7y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596423862.0
    },
    {
        "author": "HJForsythe",
        "body": "Broadcom and Qualcomm are definitely thinking about buying INTC right now",
        "created_utc": 1596383933,
        "id": "g0425h5",
        "permalink": "/r/wallstreetbets/comments/i24nv8/positions_ill_take_monday_at_open/g0425h5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596412733.0
    },
    {
        "author": "MrDopple68",
        "body": "Skyworks is another to consider in the 5G space.\n\nQualcomm is my fav though, and pays a good dividend.",
        "created_utc": 1596367434,
        "id": "g02zeah",
        "permalink": "/r/stocks/comments/i252f9/nok/g02zeah/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596396234.0
    },
    {
        "author": "AnujSaharan",
        "body": "sell QCOM 8/7 108c at open or nah?",
        "created_utc": 1596458976,
        "id": "g07aijl",
        "permalink": "/r/wallstreetbets/comments/i2upp0/daily_discussion_thread_for_august_03_2020/g07aijl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596487776.0
    },
    {
        "author": "bmexgainporntaway",
        "body": "I think of ADI much close to TXI rather than AMD or QCOM. They just had their earnings, you can see it didn't move much. I wouldn't expect much either. Also much more industry facing/boring/less hype.",
        "created_utc": 1596571236,
        "id": "g0d9pgk",
        "permalink": "/r/wallstreetbets/comments/i3gpgo/daily_discussion_thread_for_august_04_2020/g0d9pgk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596600036.0
    },
    {
        "author": "BobioliCommentoli",
        "body": "If anything Qualcomm is the play",
        "created_utc": 1596300773,
        "id": "fzzzjic",
        "permalink": "/r/wallstreetbets/comments/i1u4uu/nokia_calls_next_kodak/fzzzjic/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596329573.0
    },
    {
        "author": "iredditacc",
        "body": "Thursday: FOMOd into QCOM\n\nFriday: FOMOd into AAPL\n\nMonday: FOMO into MSFT?",
        "created_utc": 1596293081,
        "id": "fzzkbc3",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzzkbc3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596321881.0
    },
    {
        "author": "csklmf",
        "body": "The fact that they are a good dividend stock limits itself from growing and thus stock price has been stagnant period. \n\nOh 5g? QCOM!",
        "created_utc": 1597046024,
        "id": "g0z343x",
        "permalink": "/r/stocks/comments/i6y9bh/lets_talk_t_what_happened/g0z343x/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597074824.0
    },
    {
        "author": "SHFisTrash",
        "body": "Qualcomm puts🍆",
        "created_utc": 1597051564,
        "id": "g0z8d7h",
        "permalink": "/r/wallstreetbets/comments/i6q5au/what_are_your_moves_tomorrow_august_10_2020/g0z8d7h/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597080364.0
    },
    {
        "author": "PorscheBoxsterS",
        "body": "For the sake of American supremacy Intel needs to hard no on another Taiwanese semiconductor outfit. They are better than China, but they also don't play by the rules that Intel or AMD or Qualcomm do and will only beat us if we give them a chance.",
        "created_utc": 1597050270,
        "id": "g0z74u3",
        "permalink": "/r/investing/comments/i6xjq8/mediatek_and_intel_working_together_on_5g/g0z74u3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1597079070.0
    },
    {
        "author": "Donttouchmydorritos",
        "body": "Qualcomm has been making faulty snapdragon chips for a billion devices. Which means more iPhone sales during the super cycle 🤗🤗🤗",
        "created_utc": 1597028823,
        "id": "g0yhvji",
        "permalink": "/r/wallstreetbets/comments/i6q5au/what_are_your_moves_tomorrow_august_10_2020/g0yhvji/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597057623.0
    },
    {
        "author": "HTleo",
        "body": "Buy QCOM on the dip? Major snapdragon flaw might trigger good entry point.",
        "created_utc": 1597005141,
        "id": "g0xcasz",
        "permalink": "/r/wallstreetbets/comments/i6q5au/what_are_your_moves_tomorrow_august_10_2020/g0xcasz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597033941.0
    },
    {
        "author": "bitflag",
        "body": "Mediatek is pretty much the only decent competition to Qualcomm though. Their CPU are now decent and they can do the modems too. Samsung completely dropped the ball with their Exynos lately.",
        "created_utc": 1597039496,
        "id": "g0ywexv",
        "permalink": "/r/investing/comments/i6xjq8/mediatek_and_intel_working_together_on_5g/g0ywexv/",
        "score": 1,
        "subreddit": "investing",
        "created": 1597068296.0
    },
    {
        "author": "crackercider",
        "body": "My QCOM longs are doing very good",
        "created_utc": 1597172296,
        "id": "g14oy26",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g14oy26/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597201096.0
    },
    {
        "author": "Rhaximus",
        "body": "QCOM is undervalued under $120. Sector rotation meme only lasts so long before someone pulls the trigger.",
        "created_utc": 1597162931,
        "id": "g144tbu",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g144tbu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597191731.0
    },
    {
        "author": "Investinwaffl3s",
        "body": "Man fuck, I missed the QCOM news and now it is already gone...",
        "created_utc": 1597164273,
        "id": "g147usu",
        "permalink": "/r/wallstreetbets/comments/i7p679/daily_discussion_thread_for_august_11_2020/g147usu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597193073.0
    },
    {
        "author": "HTleo",
        "body": "QCOM snapdragon now has a major security flaw. See Arstechnica website. Are you going to short QCOM?",
        "created_utc": 1596977328,
        "id": "g0vy1zn",
        "permalink": "/r/wallstreetbets/comments/i5kd5n/intel_confendencial_leaks_intel_puts/g0vy1zn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597006128.0
    },
    {
        "author": "giveashite",
        "body": "Why is QCOM shitting itself so hard?  Hurts me.",
        "created_utc": 1596823126,
        "id": "g0pdakp",
        "permalink": "/r/wallstreetbets/comments/i5b9o9/daily_discussion_thread_for_august_07_2020/g0pdakp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596851926.0
    },
    {
        "author": "philsstiens",
        "body": "Well played. I swung qcom into amd and tsm into aapl before earnings, now swinging rtx and Intel. Small cap may be parabolic but large cap is predictable. Hope you had a huge position.",
        "created_utc": 1596758517,
        "id": "g0mehg5",
        "permalink": "/r/stocks/comments/hyzxt8/investing_strategy/g0mehg5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596787317.0
    },
    {
        "author": "Myusernamegoesup",
        "body": "Im long both qcom and rkt! Qcom 140 eoy!!!",
        "created_utc": 1596743402,
        "id": "g0lkrsb",
        "permalink": "/r/wallstreetbets/comments/i4p4at/daily_discussion_thread_for_august_06_2020/g0lkrsb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596772202.0
    },
    {
        "author": "poofscoot",
        "body": "How is TSM or QCOM in brambles?",
        "created_utc": 1596748649,
        "id": "g0lvxuz",
        "permalink": "/r/wallstreetbets/comments/i4z4q7/what_are_your_moves_tomorrow_august_07_2020/g0lvxuz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596777449.0
    },
    {
        "author": "CharlieBrown364",
        "body": "That is true, but he doesn’t own many tech companies. I would much rather own an ETF like ARKK, because they understand technology and innovation.\n\nAlso, I said the Apple was BRK.B’s only tech stock in the top 10 holdings. While it is true that BRK.B does own parts of amazon, verisign, and SiriusXM, he doesn’t own much in any of those companies, especially compared to the amount of Apple stock he owns.",
        "created_utc": 1596326241,
        "id": "g01boba",
        "permalink": "/r/stocks/comments/i195ah/brkb_whats_your_take/g01boba/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596355041.0
    },
    {
        "author": "SteamedHamSalad",
        "body": "I still don't see why someone would necessarily need to invest in tech companies directly to succeed in investing moving forward. Like you said tech is becoming more and more a part of our daily lives so you can benefit as an investor from tech without investing directly in tech companies. \n\nRegarding your second point, it actually depends on how you measure largest holdings. You're right that they are outside the top ten in terms of dollar value but they aren't that far out. By your own measure tech companies take up around 50% of his portfolio. It just happens to be concentrated in one stock. But you could also look it from the point of view of the percentage of each company owned. You could argue that this is in some ways a better measure of which companies he believes in the most. By this measure both Sirius and VeriSign are in his top ten. So by both measures he puts a good amount of importance in tech companies. At the very least he puts more importance in them than what is portrayed by the popular media.\n\nAs a sidenote, a lot of people would argue that both Visa and MasterCard are basically tech companies.",
        "created_utc": 1596328689,
        "id": "g01fpg2",
        "permalink": "/r/stocks/comments/i195ah/brkb_whats_your_take/g01fpg2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596357489.0
    },
    {
        "author": "SteamedHamSalad",
        "body": "You are right that tech is becoming more and more a part of our lives. But that doesn't mean that straight tech companies are the only way to profit in that situation. Tech permeates all aspects of society. Many of the companies he invests in are on the cutting edge of tech in their industry. In addition, it isn't true that Apple is the only tech company he owns. He also owns stakes in Amazon, VeriSign, and SiriusXM.",
        "created_utc": 1596315674,
        "id": "g00thux",
        "permalink": "/r/stocks/comments/i195ah/brkb_whats_your_take/g00thux/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596344474.0
    },
    {
        "author": "-BetoIsAFurry-",
        "body": "$WDC 8/21 50C. Darvas box since mid March, ready for breakout.",
        "created_utc": 1596290520,
        "id": "fzzfw48",
        "permalink": "/r/wallstreetbets/comments/i1rkto/most_anticipated_earnings_releases_for_the_week/fzzfw48/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596319320.0
    }
]