[
    {
        "author": "InquisitorCOC",
        "body": "[This link](https://www.dogsofthedow.com/djdelete.htm) has all the Dow changes. It does have a habit of sell low and buy high though, some examples: \n\n- Microsoft replaced Chevron in November 1999. Over the next 5 years, $MSFT was down 50% and $CVX up 25%. Microsoft eventually redeemed itself, but not after putting its shareholders underwater for 13 years.\n- Chevron reentered Dow on Feb 19 2008, 120% higher than November 1999, replacing **Honeywell**. Since then, $CVX is up ~50%, dividends included; $HON 300% higher. **Honeywell reentered Dow today.**\n- Also on Feb 19 2008, Dow replaced Altria with Bank of America. You should all know what happened to $BAC over the next year. $MO is up 300% after being booted from the Dow.\n- AIG replaced International Paper in April 2004. $IP is a lousy company indeed and has only gained about 60% since then, but $AIG got obliterated during the GFC and was booted from Dow on September 22 2008 after suffering 95% loss.\n\n------------\n\nDow has also done many things very right, such as:\n\n- Replace Woolworth with Wal-Mart in 1997\n- Replace Sears with Home Depot in 1999, although $HD actually underperformed Sears until at least 2008 \n- Replace Kodak with Pfizer in 2004, Kodak went bankrupt in 2012\n- Replace Kraft with UnitedHealthcare in 2012\n- Replace Alcoa with Nike and Hewlett-Packard with Visa in 2013\n- Replace AT&amp;T with Apple in 2015",
        "created_utc": 1598311358,
        "id": "g2qtg84",
        "score": 12,
        "subreddit": "investing",
        "created": 1598340158.0
    },
    {
        "author": "seattle_exile",
        "body": "\"Theta Gang\" (if I can call myself that anymore) checking in, and checking out from the market early today.\n\nWednesday saw 4 massive earnings blowouts (DKS, CRM, PLAN and URBN) that ended up costing 40% of my account value in one day, and over a month's worth of gains were lost. \n\nOn tilt, I bought a TSLA FD yesterday to see if I could scalp a quick profit, watched it immediately drop into \"diamond hands\" territory, held it until today and managed to sell it for a small (but incredibly stressful) profit. Ironically, buying that option blew out my buying power for the day, or I would have short-strangled ULTA and gotten my ass handed to me yet again this morning.\n\nI also dabbled in a few other longs: SLV 26c, HPE 9p and TNA 9/4 36. None of that shit is working out. The TSLA 2300c FD made a profit simply because I saw it went green and took my money back; if I held ten minutes more, I would have taken a loss.  \n\nI don't know what it is, but every long position I have ever taken since I started dabbling in 2005 has turned to shit. This serves as yet another a reminder to stick with what works for me, even when I have to take a big fat L.\n\nI am become Theta, destroyer of profits.\n\nEnding the week, I am down 22% of my account value. It puts me at 60% up for the year, and a little over 100% since abandoning bear ways in April.\n\nI need a drink.",
        "created_utc": 1598629325,
        "id": "g357dz2",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1598658125.0
    },
    {
        "author": "spacegrab",
        "body": "Short HPQ (not HPE). I told ya'll cucks to short last time and got called a retard, and the ER tanked because they're missing like $1b/qtr on printing (who the fuck is still printing with Docusign and RKT going on nowadays).\n\ntempted to load up on splunk, but otherwise nothing too interesting.\n\nRKT CALLS IT IS",
        "created_utc": 1598296829,
        "id": "g2q0hb7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1598325629.0
    },
    {
        "author": "9181111",
        "body": "MSFT, CSCO, TFC, HPE and HFC",
        "created_utc": 1597370491,
        "id": "g1ebe8w",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597399291.0
    },
    {
        "author": "myNameIsPDT",
        "body": "I did, and this holds up. HP just posted a good outlook: [https://finance.yahoo.com/news/hewlett-packard-enterprise-surprises-positive-210935989.html](https://finance.yahoo.com/news/hewlett-packard-enterprise-surprises-positive-210935989.html)\n\nAs a lot of industries move on line and take advanatge of the cloud, companies like Dell stand to profit the most because they offer great discounts for bulk purchases of cheap hardware. Think of items like 1000 laptops with MSFT excel/word/outlook so folks can work from home and access the cloud. These discounts are something most other providers cannot do like AAPL.",
        "created_utc": 1598406371,
        "id": "g2v7u8v",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598435171.0
    },
    {
        "author": "thoughtIhadOne",
        "body": "HPE and Radioshack come to mind",
        "created_utc": 1598833679,
        "id": "g3f0r4j",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1598862479.0
    },
    {
        "author": "Danksley",
        "body": "Just trade as an industry insider. It's completely legal and you can eat boomers' lunch.\n\nI do IT and when Dell, HPE, Lenovo, SuperMicro finally started pushing AMD servers really hard in their channel marketing I went in on AMD. Sadly I sold from $20 at $40 and not $80.\n\nThat information is all technically public because anyone can sign up for it on [dell.com](https://dell.com) for example so its not against the law, you are just unlikely to receive that marketing unless you're an IT pro or doing ear-to-the-ground stonk research.\n\nThe only time you can't trade is when its literally privileged information you'd likely be sued for sharing, for example, you are a youtuber and get to see the new iphone 2 weeks early to make your review and it fucking sucks so you dump all your Apple shares, that's super illegal.",
        "created_utc": 1596851402,
        "id": "g0qwpxf",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1596880202.0
    },
    {
        "author": "DonCorleone47",
        "body": "Kodak, Cisco, intel, MFA, NCLH, HPE",
        "created_utc": 1598226508,
        "id": "g2n0bto",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598255308.0
    },
    {
        "author": "ben14034",
        "body": "Anyone have thoughts on Hewlett-Packard",
        "created_utc": 1598373587,
        "id": "g2tf2ud",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598402387.0
    },
    {
        "author": "reddituserzerosix",
        "body": "Grats HPE did well too but already fading",
        "created_utc": 1598387208,
        "id": "g2u7yad",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598416008.0
    },
    {
        "author": "TomSellecksMustache3",
        "body": "The bottom line is this: if you are buying servers right now, and not at least pricing out AMD EPYC 7002 series CPUs, whether that is the EPYC 7742 or another lower-end SKU, then you are effectively wasting money for your organization. If you have employees who are not bringing you competitive AMD EPYC 7002 quotes along with Xeon quotes, then they are not doing their jobs getting competitive bids. In a world where AMD only has a 0-20% performance edge, that would not be the case. Instead, AMD’s price and performance is closer to 2x. Even for many corporate contracts with large IT vendors like Dell and HPE where putting volume against certain SKUs yields discounts, the AMD EPYC 7742 can have a big enough impact that renders those discounts not attractive. This is especially so with use-cases such as general virtualization platforms where AMD can consolidate multiple mainstream Xeon sockets into each EPYC 7742 socket. If Intel is competing on price and selling what it has, great. If you are not evaluating EPYC 7742 or other SKUs in their stack, then you are not doing your organization justice.",
        "created_utc": 1596553302,
        "id": "g0bznln",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596582102.0
    },
    {
        "author": "churn_after_reading",
        "body": "It depends, I’d recommend the blue chips. I have a good idea of what a lot of companies in the space do, their current reputation in the industry. That I think helps predict long-term potential, but not very helpful for short term options. \n\nOn-prem/hybrid cloud stuff earnings is coming up. VMW, NTNX, PSTG, DELL and HPE have earnings coming up within 2-4 weeks. I can tell you that I think NTNX and VMW are undervalued long term, that doesn’t really say anything about how their earnings will pan out. There is also SaaS companies, TEAM, DOCU, WORK, DDOG. I am bullish on CTXS.\n\nThe way I see it, much better idea to ignore all that and go into APPL, AMZN, FB, MSFT and GOOG. I think INTC is undervalued right now, but they need to change their perception in among the general public. Probably sinking a lot of money into marketing is the way to go.",
        "created_utc": 1597269174,
        "id": "g19fdyb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597297974.0
    },
    {
        "author": "jpowpump",
        "body": "HPQ already priced in. HPE is kinda dead but it is cheap for a long term hold. HP's money maker has and will always be those overpriced toners. No one needs printer ink WFH.",
        "created_utc": 1596428368,
        "id": "g06crdq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596457168.0
    },
    {
        "author": "p_a_schal",
        "body": "Just hoping to get out of some plays and have some money to make (hopefully) wiser plays next week. \n\nOh but hey I have 2 free shares of HPE coming my way on webull🤑",
        "created_utc": 1596766928,
        "id": "g0msz6m",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596795728.0
    },
    {
        "author": "T_T_TheTree",
        "body": "HPE: enterprise stuff (IT, Server, ...)\n\nHP Inc: printers and pc \n\nThey used to be combined but they are now separate companies.",
        "created_utc": 1596658319,
        "id": "g0he5gr",
        "score": 2,
        "subreddit": "investing",
        "created": 1596687119.0
    },
    {
        "author": "TerrestrialPlanet",
        "body": "Some low-price symbols you may consider: GE, F, PCG, NLY,  DB, HPE, TEVA",
        "created_utc": 1598129169,
        "id": "g2immat",
        "score": 2,
        "subreddit": "options",
        "created": 1598157969.0
    },
    {
        "author": "TSLA1000",
        "body": "HPE calls printing 😛",
        "created_utc": 1598387266,
        "id": "g2u82kf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598416066.0
    },
    {
        "author": "44MAGNUm12",
        "body": "Im talking HPE",
        "created_utc": 1596428595,
        "id": "g06d2oj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596457395.0
    },
    {
        "author": "MinuteStop",
        "body": "You can always invest directly in high-yielding dividend stocks. \n\nI use a tool called [Simplivest](https://www.simplivest.com/) to help me figure out what to buy.  They have a Portfolio Builder tool that might be helpful for you. \n\nI just ran it for a $50k portfolio and 15 stocks (you can put in your values).  Here are the suggested stocks\n\nT, ABBV, MO, CSCO, CFG, D, HBI, HPE, KEY, NTAP, OKE, PFE, PM, SPG, TDG",
        "created_utc": 1597967944,
        "id": "g29ty9q",
        "score": 2,
        "subreddit": "investing",
        "created": 1597996744.0
    },
    {
        "author": "Azorian4138",
        "body": "Aruba is $HPE",
        "created_utc": 1597421406,
        "id": "g1gdmr4",
        "score": 2,
        "subreddit": "stocks",
        "created": 1597450206.0
    },
    {
        "author": "scrimshaw_",
        "body": "Been looking at **PANW, MDT, CRM, ADSK, and HPE** Put Credit Spreads. [Here's my spreadsheet for this week](https://docs.google.com/spreadsheets/d/1mIuiipc_oIAzFcOmv104YhMb9GHOE4D5aHGiqE_yADI/edit?usp=sharing). Added a column for the 20-day Historical Volatility. Anyone know a good source for scraping the IV? I've tried Barchart and MarketChameleon, but they have anti-scraping unfortunately. Thanks for the comments and love.",
        "created_utc": 1598127373,
        "id": "g2iivt5",
        "score": 2,
        "subreddit": "options",
        "created": 1598156173.0
    },
    {
        "author": "gr8tale",
        "body": "On their earnings calls, CEOs of Dell and HPE said demand for PCs is sky high for Q3 due to due remote learning and WFH. Their concern is getting enough chips for all the computers they can sell. \n\nDemand for Chromebooks also sky high and orders backlogged. \n\nWho makes chips? Lays, of course, but we’re not talking potatoes here. \n\nHuge Q3 for TSM? Kinda looking that way. \n\nSide note, that moribund HPE stock sitting below $10... in addition to ravenous PC demand, they’re also moving into the cloud space, and if they can carve out a niche there, it won’t be $10 for long. Just something to keep an eye on.",
        "created_utc": 1598749764,
        "id": "g3b20sn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598778564.0
    },
    {
        "author": "stone3pole8holly2",
        "body": "IMO, HPE is a poorly managed operation, with confused goals/focus, and with a perpetually contracting market and shrinking workforce. Don't expect much in the future without major management and strategy changes.",
        "created_utc": 1596655583,
        "id": "g0h7w6j",
        "score": 1,
        "subreddit": "investing",
        "created": 1596684383.0
    },
    {
        "author": "kde873kd84",
        "body": "Yup. No rhyme or reason: $MSFT $HPE $EXPE $DBX $ROKU $PINS $BILI",
        "created_utc": 1596446814,
        "id": "g06x2gr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596475614.0
    },
    {
        "author": "glochrizz11",
        "body": "HPE getting some unusual call activity, mostly bullish",
        "created_utc": 1596726443,
        "id": "g0khmgm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596755243.0
    },
    {
        "author": "Horny_Cat_The_Legend",
        "body": "Well I bought some calls on hpe thinking it would break 10.5 but it didn’t now I’m down. I bought Gevo and it’s down. I’m okay with losing money as long as I leant and make it back.",
        "created_utc": 1598497457,
        "id": "g2zft8j",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1598526257.0
    },
    {
        "author": "migity79",
        "body": "Thoughts on HPE?",
        "created_utc": 1598449630,
        "id": "g2wqtb4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598478430.0
    },
    {
        "author": "Stonk_Wizard",
        "body": "Trash. Worked here for 5 years, the physical server space is dying man. AWS, Azure, Rackspace all these companies have dipped into HPEs pockets. Even more so with how cost effective it is to just push everything through AWS. This stock isn’t going to do much and their server business has been on rapid decline. They took production out of Houston and moved to Mexico to cut costs but it’s still not going to help them much. \n\nYes they are turning to IT solutions but their solutions and support is god awful. \n\nI was at this company through the split when it went from HP to HPE and HPQ. HPEs CEO has no clue what he’s doing. I may sound biased but I’ve owned this stock for almost 10 years now pre and after split. Money can be made elsewhere. They simply just can’t keep up with AWS and Azure. 🤷🏻‍♂️",
        "created_utc": 1598454098,
        "id": "g2wznge",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598482898.0
    },
    {
        "author": "mrcet007",
        "body": "What is the moat of HPE Greenlake compared to similar offering from AWS, Azure and GCP? \n\nI don't see significantly additional value offered by HPE. The other big companies can easily compete (now and in future)with hpe offering with the advantage of providing cloud iaas as well.",
        "created_utc": 1598469054,
        "id": "g2xvvjj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598497854.0
    },
    {
        "author": "Horny_Cat_The_Legend",
        "body": "I just read they might win there cases against that Britain wire fraud. Husain or something. Some like 6 billion pay out. It’s on the robinhood news for hpe",
        "created_utc": 1598471697,
        "id": "g2y1lvq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598500497.0
    },
    {
        "author": "PM_me_ur_bag_of_weed",
        "body": "37.96% AAPL  \n31.38% FB  \n3.26%   FSLR  \n3.06%   CRM  \n2.75%   HZNP  \n2.48%   BUD  \n2.08%   MGM  \n1.86%   DAL  \n1.76%   DKGN  \n1.68%   CRSP  \n1.67%   MSFT  \n1.63%   BA  \n1.16%   AAL  \n1.10%   MAR  \n0.97%   UAL  \n0.94%   INTC  \n0.91%   HPE  \n0.89%   RKT  \n0.66%   NIO  \n0.66%   SPCE  \n0.40%   MRVL  \n0.36%   BEP  \n0.30%   SE  \n0.06%   UBER",
        "created_utc": 1598471195,
        "id": "g2y0i2k",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598499995.0
    },
    {
        "author": "Horny_Cat_The_Legend",
        "body": "Yes seeing this too. Just thought I made a bad call. Idk much about options. Like hpe was going way up this morning but the call price were tanking.",
        "created_utc": 1598462127,
        "id": "g2xgk0d",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1598490927.0
    },
    {
        "author": "rek-lama",
        "body": "Disappointing how it hardly moved after great earnings. It was around $15 this year pre-covid, most tech stocks recovered, HPE hasn't one bit.",
        "created_utc": 1598476680,
        "id": "g2ychsp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598505480.0
    },
    {
        "author": "nobodyhereisthere",
        "body": "Have you ever worked with them? They are desperate for business. I would never recommend HPE.",
        "created_utc": 1598394774,
        "id": "g2umrxi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598423574.0
    },
    {
        "author": "DownvoteTheHardTruth",
        "body": "At least HPE got some media attention, it's pretty much a dead stock in terms of volume.   \n\n\nI have some hope we will see $13 within a month. Everyone is too busy investing in Tesla, I wait and see what happens after the split.",
        "created_utc": 1598465249,
        "id": "g2xnaju",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598494049.0
    },
    {
        "author": "Willthrowaway2445",
        "body": "Thats HPE, not HPQ which would be comparable to Dell and has earnings on thurs.",
        "created_utc": 1598416595,
        "id": "g2vp4pi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598445395.0
    },
    {
        "author": "Danksley",
        "body": "[https://www.delltechnologies.com/en-us/servers/index.htm?\\~ck=mn](https://www.delltechnologies.com/en-us/servers/index.htm?~ck=mn)\n\nDo contact us, tell them you are planning some things out, ask about what Dell is planning for the near/mid future in servers. You'll be hearing from them for the rest of your life. You can leave a similar message with HPE, Lenovo on their servers marketing / ordering pages.\n\nNone of what they send you is going to be privileged info. IT depts at massive companies like MSFT, AMZN \\*will\\* get glimpses of NDA hardware that won't be shown publicly for a year, however, and trading on that is illegal.\n\nI just paid attention to them pushing AMD servers towards the top when Intel has always been in bed with Dell (and still is, with Dell keeping AMD out of their premium laptops despite FAR better performance, heat, and power use). When a company that's famously in bed with Intel to the point that it was part of Intel's antitrust a long time ago pushes AMD, its a sign of bad things coming for Intel.",
        "created_utc": 1596857064,
        "id": "g0r6h0y",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1596885864.0
    },
    {
        "author": "Mars_N_Cali",
        "body": "For example ask me about my HPE 16 or X 12...",
        "created_utc": 1597344722,
        "id": "g1cvjag",
        "score": 1,
        "subreddit": "options",
        "created": 1597373522.0
    },
    {
        "author": "SpliTTMark",
        "body": "Hpe might be better.",
        "created_utc": 1597593712,
        "id": "g1qug1w",
        "score": 1,
        "subreddit": "investing",
        "created": 1597622512.0
    },
    {
        "author": "karmalizing",
        "body": "do HPE $10.50c 8/28 pls",
        "created_utc": 1597611115,
        "id": "g1rrsnh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597639915.0
    },
    {
        "author": "karmalizing",
        "body": "HPE calls",
        "created_utc": 1597156868,
        "id": "g13t8rz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597185668.0
    },
    {
        "author": "Barracuda_Blue",
        "body": "IBM and HPE are inverse tech stocks. lol",
        "created_utc": 1597071325,
        "id": "g0zyhwz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597100125.0
    },
    {
        "author": "wicksdontlie94",
        "body": "Im buying HPQ buddy not HPE",
        "created_utc": 1598146683,
        "id": "g2jhsoz",
        "score": 1,
        "subreddit": "options",
        "created": 1598175483.0
    },
    {
        "author": "spacegrab",
        "body": "Maybe, but IT/Business consulting isnt my mainstay. HPE did okay last quarter while HPQ (printing + consumer devices) underperformed as I predicted.",
        "created_utc": 1598312944,
        "id": "g2qwho2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598341744.0
    },
    {
        "author": "PreparedToDisappoint",
        "body": "HP and HPE split a while back. HP sells computers. HPE sells servers. The earnings for HpE are Tuesday. It going to be bad",
        "created_utc": 1598273266,
        "id": "g2opqbm",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1598302066.0
    },
    {
        "author": "jpowpump",
        "body": "I sold hpe puts. Will I get assigned?",
        "created_utc": 1598379942,
        "id": "g2tsrfw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598408742.0
    },
    {
        "author": "Chilleeen",
        "body": "Thank u Hpe",
        "created_utc": 1598386219,
        "id": "g2u5wrr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598415019.0
    },
    {
        "author": "44MAGNUm12",
        "body": "Hewlett Packard is my sneaky play.",
        "created_utc": 1596428079,
        "id": "g06ccy9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596456879.0
    },
    {
        "author": "44MAGNUm12",
        "body": "HPE is a great value play, bottom line. Going to be hard to find many other value plays with this much upside in a pandemic.",
        "created_utc": 1596429273,
        "id": "g06dzqe",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596458073.0
    },
    {
        "author": "Neo1331",
        "body": "HPE is going to be another DELL on 8/25",
        "created_utc": 1596496175,
        "id": "g09ogxu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596524975.0
    },
    {
        "author": "rs3eu452",
        "body": "I just started a few days ago, made 15 on Juniper Networks and lost 15 on Hewlett Packard today. Do you recommend buying calls late in the day and hoping they rocket open up when the market opens or something else for a beginning options trader?",
        "created_utc": 1597254937,
        "id": "g18k7np",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1597283737.0
    },
    {
        "author": "wives_boyfriend",
        "body": "its amazing of all people that are still alive HPE still is. Howard says that everytime a famous person dies.",
        "created_utc": 1597821967,
        "id": "g22vm2a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597850767.0
    },
    {
        "author": "zacknh",
        "body": "Come on my man. Hewlett Packard Enterprise cut salaries. Not only is it a totally different division of the company...it trades under a different stock symbol (HPE) spun off 5 years ago, just before my wife started dating your boyfriend.    \n\n\nThis is for **HPQ** aka where people buy printers and computers.",
        "created_utc": 1598035102,
        "id": "g2cprsq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598063902.0
    },
    {
        "author": "JayBird9540",
        "body": "HPE doesn’t sell printers, they sell enterprise software",
        "created_utc": 1598140730,
        "id": "g2j7m1z",
        "score": 1,
        "subreddit": "options",
        "created": 1598169530.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 24th of August\n\n\n\n## Upcoming events for Monday, August 24th\n\n - Stock splits:\n\n    - HX @ **1:3**\n\n - Expected earnings:\n\n  AKTS, BITA, CANG, CNF, DADA, FANH, ICLK, IMTX, JT, NOAH, PANW, QFIN, SINA, SXI, VIOT, WB\n\n - Ex-div:\n\n  BC, CDW, CRAI, CRS, EFX, FLMN, GER, GMZ, HFRO, HGLB, JNJ, NDSN, NHF, PBA, RHI, SBAC, SPB, STAY, WLK, WMG\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.105%)\n    - 6-Month Bill Auction (previous: 0.120%)\n    - Chicago Fed National Activity (previous: 4.11)\n    - Investing.com Gold Index (actual: 54.8%, previous: 52.5%)\n    - Investing.com S&amp;P 500 Index (actual: 33.3%, previous: 31.7%)\n\n## Upcoming events for Tuesday, August 25th\n\n - Expected earnings:\n\n  ACH, ADSK, AMWD, ATHM, AZRX, BBAR, BBY, BMO, BNS, CRM, EH, ELMD, FINV, FRO, HAIN, HEI, HMY, HPE, HRL, IDXG, INTU, ITRN, JILL, MDT, NOVN, NVUS, OOMA, PINC, PLCE, PSEC, PSTG, RGS, RYB, SCSC, SJM, TOL, URBN, UTSI, VEEV, YJ\n\n - Ex-div:\n\n  ACCO, DHT, NMRK, PRSP, RBA, SLF, SPGI, YUM\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.155%)\n    - API Weekly Crude Oil Stock (previous: -4.264M)\n    - CB Consumer Confidence (consensus: 93.0, previous: 92.6)\n    - FOMC Member Daly Speaks\n    - House Price Index (previous: -0.3%)\n    - House Price Index (previous: 287.3)\n    - House Price Index (previous: 4.9%)\n    - New Home Sales (consensus: 1.3%, previous: 13.8%)\n    - New Home Sales (consensus: 786K, previous: 776K)\n    - Redbook (previous: -2.8%)\n    - Redbook (previous: 2.8%)\n    - Richmond Manufacturing Index (previous: 10)\n    - Richmond Manufacturing Shipments (previous: 23)\n    - Richmond Services Index (previous: -14)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 3.6%, previous: 3.7%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.4%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 0.1%)\n\n## Upcoming events for Wednesday, August 26th\n\n - Stock splits:\n\n    - ARMZF @ **15:1** (Payable date: 08/25/2020)\n\n - Expected earnings:\n\n  AMSWA, BF.B, BILI, BMA, BOX, BROG, CEPU, CHS, CTXR, DKS, DL, DY, EDAP, ESTC, EV, EXPR, GEF, GES, GGAL, HOTH, KEP, LAIX, LCI, MBOT, MEIP, NTAP, OBSV, PAHC, PLAN, QADA, REX, RY, SMTC, SNP, SPLK, TIF, WSM, ZNH\n\n - Ex-div:\n\n  B, CHL, FBP, LMAT, MGIC, MNRL, MXIM, NTES, PHX, RGP, SMG, STE, TRMD, WPM, XYL\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.288%)\n    - Core Durable Goods Orders (consensus: 2.1%, previous: 3.6%)\n    - Crude Oil Imports (previous: 1.115M)\n    - Crude Oil Inventories (previous: -1.632M)\n    - Cushing Crude Oil Inventories (previous: -0.607M)\n    - Distillate Fuel Production (previous: -0.047M)\n    - Durable Goods Orders (consensus: 4.3%, previous: 7.6%)\n    - Durables Excluding Defense (previous: 9.5%)\n    - EIA Refinery Crude Runs  (previous: -0.171M)\n    - EIA Weekly Distillates Stocks (previous: 0.152M)\n    - EIA Weekly Refinery Utilization Rates (previous: -0.1%)\n    - Gasoline Inventories (previous: -3.322M)\n    - Gasoline Production (previous: -0.200M)\n    - Goods Orders Non Defense Ex Air (consensus: 1.9%, previous: 3.4%)\n    - Heating Oil Stockpiles (previous: -0.255M)\n    - MBA 30-Year Mortgage Rate (previous: 3.13%)\n    - MBA Mortgage Applications (previous: -3.3%)\n    - MBA Purchase Index (previous: 308.9)\n    - Mortgage Market Index (previous: 824.5)\n    - Mortgage Refinance Index (previous: 3,809.7)\n\n## Upcoming events for Thursday, August 27th\n\n - Expected earnings:\n\n  AFYA, ANF, ASND, AVAL, AVNW, BILL, BURL, CANF, CM, COTY, DELL, DG, DLTR, FLR, FLWS, GPS, GTT, HHR, HPQ, LFC, LOV, MBUU, MOV, MRVL, MTA, OKTA, OLLI, PAGS, PLAB, PZG, QH, RAVN, SAFM, SEEL, SOL, TD, TITN, ULTA, VMW, WDAY, YRD\n\n - Ex-div:\n\n  ADI, ALL, ARGO, BMI, CBT, EVR, FBHS, FLO, FTV, GLW, HEES, HII, HQH, KHC, NAT, NBHC, NEE, NUS, PDM, PH, PIPR, PRGO, SOR, USLM, WEYS, WHR, WING\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 7-Year Note Auction (previous: 0.446%)\n    - 8-Week Bill Auction (previous: 0.090%)\n    - Continuing Jobless Claims (consensus: 15,000K, previous: 14,844K)\n    - Core PCE Prices (consensus: 1.80%, previous: -1.10%)\n    - Corporate Profits (previous: -11.0%)\n    - Fed Chair Powell Speaks\n    - GDP (consensus: -32.6%, previous: -32.9%)\n    - GDP Price Index (consensus: 1.4%, previous: 1.6%)\n    - GDP Sales (previous: -29.3%)\n    - Initial Jobless Claims (consensus: 1,000K, previous: 1,106K)\n    - Jackson Hole Symposium\n    - Jobless Claims 4-Week Avg. (previous: 1,175.75K)\n    - KC Fed Composite Index (previous: 3)\n    - KC Fed Manufacturing Index (previous: 7)\n    - Natural Gas Storage (consensus: 43B, previous: 43B)\n    - PCE Prices (consensus: 1.3%, previous: -1.9%)\n    - Pending Home Sales (consensus: 4.5%, previous: 16.6%)\n    - Pending Home Sales Index (previous: 116.1)\n    - Real Consumer Spending (previous: -34.6%)\n\n^^^^2020-08-24",
        "created_utc": 1598263213,
        "id": "g2oe1m7",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1598292013.0
    },
    {
        "author": "karmalizing",
        "body": "HPE $10.50c Aug 28th",
        "created_utc": 1597558338,
        "id": "g1po3bj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597587138.0
    },
    {
        "author": "BROWNSSUKSOBAD",
        "body": "I work in the industry and Nutanix has been ruining their reputation the past few years. Bad support leads to no enterprise level customers trusting you. They have been ripped out of a lot of their biggest customers and I see that trend continuing. \n\nWith that said, I could see them being bought out by HPE, Netapp, or IBM.",
        "created_utc": 1598619368,
        "id": "g34oby8",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1598648168.0
    },
    {
        "author": "netflixnchill050",
        "body": "True, he could have been right. We just couldnt imagine Jpow gettin a brand new Hewlett Packard",
        "created_utc": 1598619561,
        "id": "g34on2c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598648361.0
    },
    {
        "author": "karmalizing",
        "body": "A lot of my stuff was getting sold off today for no real reason... weird day on the markets.  Oil, HPE, Spacs",
        "created_utc": 1598476261,
        "id": "g2yblzh",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1598505061.0
    },
    {
        "author": "spacegrab",
        "body": "Printing is all HPQ. HPE is their business consulting division.",
        "created_utc": 1598313275,
        "id": "g2qx346",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598342075.0
    },
    {
        "author": "fozters",
        "body": "Also probably almost never seen a corsair \"branded\" memory in any servers. Mostly hynix, samsung, micron, nanya, kingston..\n\nThey might have market share for home lab, customer self order without mfg part number from any online store type of thing going on. But that's not what oem's use and \"brand\" with their own logo and pn. Eg. Dell, HPE, Lenovo etc the majority of the stuff in the DC.Also probably almost never seen a corsair \"branded\" memory in any servers. Mostly hynix, samsung, micron, nanya, kingston..\n\nThey might have market share for home lab, customer self order without mfg part number from any online store type of thing going on. But that's not what oem's use and \"brand\" with their own logo and pn. Eg. Dell, HPE, Lenovo etc the majority of the stuff in the DC.\n\nE. Not to bash Corsairs brand, but to clarify as the DC is were probably where majority of the chips are going including hand helds.\nCorsair itself seems to have good quality and no wonder if they eg. Use seasonic PSU's etc which I learned from comments on this post.\n\nAny idea if so-dimms are out of the spec or where the reference for mobile/laptop by OP only about soldered mems? As if it includes so-dimms then they ofc have a bit more market share there too..",
        "created_utc": 1598321040,
        "id": "g2rbapj",
        "score": 1,
        "subreddit": "investing",
        "created": 1598349840.0
    },
    {
        "author": "ThatsBushLeague",
        "body": "Every time I see HPQ and HPE mentioned on this sub there are a shit load of people commenting about how it's a bad idea. \n\nSo I know my calls are safe as fuck.",
        "created_utc": 1598347309,
        "id": "g2s88hd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598376109.0
    },
    {
        "author": "Horny_Cat_The_Legend",
        "body": "No I paid 10 dollars for the call it was way out the money. And it spiked to 45 dollars after I bought and slowly went down over about an hour to even.  This is hpe I’m talking about to btw. Says my break even is 10.60 but that means at expiration. If I sell it early I can profit with out hitting break even point",
        "created_utc": 1598392192,
        "id": "g2uhvb0",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1598420992.0
    },
    {
        "author": "Dawgs0nTop",
        "body": "What’s wrong wit Hewlett-Packard 2day",
        "created_utc": 1598382542,
        "id": "g2ty79v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598411342.0
    },
    {
        "author": "spacegrab",
        "body": "HPQ (not HPE) is gonna die. It was trading like $18+ last ER and ate shit. I made a killing on shorts; warned people here but got called retarded.\n\nI don't see their guidance improving - this quarter will be worse than last.\n\nBut their stock is higher than last ER.\n\nI have 17p 8/28 and 9/18",
        "created_utc": 1598297010,
        "id": "g2q0v3o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598325810.0
    },
    {
        "author": "SugarAdamAli",
        "body": "Just realize dips and corrections gonna happen. I don’t use stop loss, I let the market fall where it may. My outlook is in decades not years, so he pullbacks or crashes that happen every few years don’t bother me.  Anytime I might sell it would be something I’m not 100% sure what the next 10-15 years holds.  I was long time HPQ holder, but that printing market is shrinking and the ink that was their main cash cow is facing strong competition from cheap alternatives, so shortly after thy spun off HPE, I sold both for decent gains",
        "created_utc": 1596984249,
        "id": "g0w8zuz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597013049.0
    },
    {
        "author": "viperabyss",
        "body": "I'm not talking about whether it's a good idea for NVIDIA to buy Arm Holding, but rather the article OP linked does a really poor job explaining why. \n\nAnd I see where Hermann is coming from, although it's not like there isn't a precedent. Dell owns VMWare, yet companies like HPE, Lenovo, and Supermicro also pushes their product. Hermann also wants Arm to be purchased partially by the GB government (to keep it in the UK) to go public, which isn't likely at all.\n\nI think the best argument against the acquisition would be government approvals, which could be a real issue, as NVIDIA is an US company, and many Chinese companies use Arm design.",
        "created_utc": 1596575637,
        "id": "g0dkg8u",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1596604437.0
    },
    {
        "author": "CokeRobot",
        "body": "This deal is so odd to me. TikTok is a social media platform that is shrowd with controversy (Microsoft isn't keen on such) with it being banned in some countries, government agencies and companies demanding it be removed immediately off work devices and also flogged as Chinese spyware. So it's a murky deal going in but a popular app nonetheless.\n\nThis would have made SOME sense if we were in 2014 with Windows Phone. Microsoft since 2015 has shed itself from their previous consumer offerings such as Groove Music, W10M and Phones, MSN Health+Fitness and HealthVault, as well as canning almost all of the physical retail stores that were recently oriented towards (very) SMB customers as that was actually where a chunk of sales were legit coming from. \n\nMicrosoft's growth the past few years and ESPECIALLY recently has been dominant with the enterprise and SMB sectors. Consumer products and services aren't where Satya is focused on much at all. Like, Surface nearly was on the chopping block in 2014 if it wasn't a knock out it turned out to be. And to this day, they're focusing on doing what Dell and HPE do with enterprise oriented hardware sales as again, larger revenue streams than consumer.\n\nXbox is obviously their main consumer product and service that is a bright spot here. LinkedIn is more or less a service internally at Microsoft we don't know how money is made off the platform (and also doubles as our job listings board internally that we didn't need to build up from scratch). Not a social media platform really though. Microsoft has dabbled in projects like SoCl before where it was a Pinterest style platform.\n\nThis buyout, I don't unterstand where the tie in could be. As we did with Skype, it got rebranded as Lync for many years and Skype still is around for consumers but included with Office 365. I just don't see where they can realistically add this into an existing service or product to enhance an offering. It very much makes me think this is a foreray into social media, which...ok? If they are doing that, what a weird time to that. Microsoft has a stance of privacy focus and if this gets used for marketing and advertising, that negates a bit of that perceived trust people have with Microsoft. We really don't have a good advertising platform in part due to us not going so hardcore with connecting user data dots across people's devices like Google and Facebook do.\n\nI'm also wondering if Microsoft is trying to play the savior role and being the reason it's not banned in the US, I guess it'll score them brownie points. It'll possibly outshine Snap with SnapChat and stick it to them for being the reason in part Windows Phone failed to grow as Snap refused to even bother with Microsoft. It'll also possibly demonstrate to the tech industry that YES, you can have a social media site that people trust as it's not invading every God damn aspect of that user's life and still monetize it well. They like looking like the noble red herrings PR wise.",
        "created_utc": 1596479606,
        "id": "g08nsx4",
        "score": 1,
        "subreddit": "investing",
        "created": 1596508406.0
    },
    {
        "author": "tooslooow",
        "body": "Well also the fact that there is little offerings for amd frim hpe, dell, ibm, cisco in the datacenter. Id love to get some amd blades, but they don't really exist.  Plus in an enterprise, the software vendors also must certify the chips.  Its not all about desktop/gaming chips",
        "created_utc": 1596629717,
        "id": "g0fpo3b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596658517.0
    },
    {
        "author": "nealosis",
        "body": "I worked as an engineer for Hewlett-Packard for 9 years and I took great pride in my work, the products I developed, and the company itself. Then Meg Whitman came in and destroyed the company by splitting it into 2 separate companies (HPE/HPQ) and then merging HPE with CSC to create DXC.  Today all the smaller companies that used to be HP are insignificant, impotent companies that exist in name alone. HP is dead.",
        "created_utc": 1597636079,
        "id": "g1sxqmz",
        "score": 1,
        "subreddit": "investing",
        "created": 1597664879.0
    },
    {
        "author": "scrimshaw_",
        "body": "Been looking at **PANW, MDT, CRM, ADSK, and HPE** Put Credit Spreads. [Here's my spreadsheet for this week](https://docs.google.com/spreadsheets/d/1mIuiipc_oIAzFcOmv104YhMb9GHOE4D5aHGiqE_yADI/edit?usp=sharing). Added a column for the 20-day Historical Volatility. Anyone know a good source for scraping the IV? Tried Barchart and MarketChameleon, but they have anti-scraping unfortunately. Thanks for the comments and love.",
        "created_utc": 1598127259,
        "id": "g2iiolf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598156059.0
    },
    {
        "author": "karmalizing",
        "body": "I'm down 80% on HPE $10.50 calls right now   ;(",
        "created_utc": 1597742543,
        "id": "g1yraai",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597771343.0
    },
    {
        "author": "ThatsBushLeague",
        "body": "Any of you idiots ever play HPQ or HPE?",
        "created_utc": 1597919661,
        "id": "g277ke3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597948461.0
    },
    {
        "author": "TryOnlyonce420",
        "body": "I'm long on HPE for a number of reason but I picked up a 8/28 9.5p this morning.",
        "created_utc": 1598310891,
        "id": "g2qsibl",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598339691.0
    },
    {
        "author": "Hapaaer",
        "body": "Why not HPE? With all the WFH, wouldn’t it be the enterprise printing that takes the bigger hit ?",
        "created_utc": 1598312237,
        "id": "g2qv7xv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598341037.0
    },
    {
        "author": "ThatsBushLeague",
        "body": "HPE calls going to print today. HPQ gonna print Thursday. I know this. Because every time I see them mentioned on this sub. Everyone talks about how shitty of an idea buying calls on them is.",
        "created_utc": 1598350700,
        "id": "g2sbclw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598379500.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 25th of August\n\n\n\n## Upcoming events for Tuesday, August 25th\n\n - Stock splits:\n\n    - GBLEF @ **1:10**\n    - WTCRF @ **1:3**\n\n - Expected earnings:\n\n  ACH, ADSK, AMWD, ATHM, AZRX, BBAR, BBY, BMO, BNS, CRM, EH, ELMD, FINV, FRO, HAIN, HEI, HMY, HPE, HRL, IDXG, INTU, ITRN, JILL, MDT, NOVN, NVUS, OOMA, PINC, PLCE, PSEC, PSTG, RGS, SCSC, SJM, TOL, URBN, UTSI, VEEV, YJ\n\n - Ex-div:\n\n  ACCO, DHT, NMRK, PRSP, RBA, SLF, SPGI, YUM\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.155%)\n    - API Weekly Crude Oil Stock (previous: -4.264M)\n    - CB Consumer Confidence (consensus: 93.0, previous: 92.6)\n    - FOMC Member Daly Speaks\n    - House Price Index (previous: -0.3%)\n    - House Price Index (previous: 287.3)\n    - House Price Index (previous: 4.9%)\n    - New Home Sales (consensus: 1.3%, previous: 13.8%)\n    - New Home Sales (consensus: 785K, previous: 776K)\n    - Redbook (previous: -2.8%)\n    - Redbook (previous: 2.8%)\n    - Richmond Manufacturing Index (previous: 10)\n    - Richmond Manufacturing Shipments (previous: 23)\n    - Richmond Services Index (previous: -14)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 3.8%, previous: 3.7%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.4%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 0.1%)\n\n## Upcoming events for Wednesday, August 26th\n\n - Stock splits:\n\n    - ARMZF @ **15:1** (Payable date: 08/25/2020)\n    - LSANF @ **1:10**\n    - PLM @ **1:10**\n\n - Expected earnings:\n\n  AMSWA, BILI, BMA, BOX, BROG, CEPU, CHS, CTXR, DKS, DL, DY, EDAP, ESTC, EV, EXPR, GEF, GES, GGAL, HOTH, HTHT, JWN, KEP, LAIX, LCI, MBOT, MEIP, NTAP, OBSV, PAHC, PLAN, QADA, REX, RY, SHI, SMTC, SNP, SPLK, TIF, WSM, WUBA, ZNH\n\n - Ex-div:\n\n  B, CHL, FBP, LMAT, MGIC, MNRL, MXIM, NTES, PHX, RGP, SMG, STE, TRMD, WPM, XYL\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.288%)\n    - Core Durable Goods Orders (consensus: 2.0%, previous: 3.6%)\n    - Crude Oil Imports (previous: 1.115M)\n    - Crude Oil Inventories (consensus: -3.833M, previous: -1.632M)\n    - Cushing Crude Oil Inventories (previous: -0.607M)\n    - Distillate Fuel Production (previous: -0.047M)\n    - Durable Goods Orders (consensus: 4.3%, previous: 7.6%)\n    - Durables Excluding Defense (previous: 9.5%)\n    - EIA Refinery Crude Runs  (previous: -0.171M)\n    - EIA Weekly Distillates Stocks (consensus: -1.018M, previous: 0.152M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.1%, previous: -0.1%)\n    - Gasoline Inventories (consensus: -1.667M, previous: -3.322M)\n    - Gasoline Production (previous: -0.200M)\n    - Goods Orders Non Defense Ex Air (consensus: 1.9%, previous: 3.4%)\n    - Heating Oil Stockpiles (previous: -0.255M)\n    - MBA 30-Year Mortgage Rate (previous: 3.13%)\n    - MBA Mortgage Applications (previous: -3.3%)\n    - MBA Purchase Index (previous: 308.9)\n    - Mortgage Market Index (previous: 824.5)\n    - Mortgage Refinance Index (previous: 3,809.7)\n\n## Upcoming events for Thursday, August 27th\n\n - Expected earnings:\n\n  AFYA, ANF, ASND, AVAL, AVNW, BILL, BURL, CANF, CM, COTY, DELL, DG, DLTR, FLR, FLWS, GPS, GTT, HHR, HPQ, LFC, LOV, MBUU, MOV, MRVL, OKTA, OLLI, PAGS, PLAB, PZG, QH, RAVN, RYB, SAFM, SEEL, SOL, TD, TIG, TITN, ULTA, VMW, WDAY, YRD\n\n - Ex-div:\n\n  ADI, ALL, ARGO, BMI, CBT, EVR, FBHS, FLO, FTV, GLW, HEES, HII, HQH, KHC, NAT, NBHC, NEE, NUS, PDM, PH, PIPR, PRGO, SOR, USLM, WEYS, WHR, WING\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 7-Year Note Auction (previous: 0.446%)\n    - 8-Week Bill Auction (previous: 0.090%)\n    - Continuing Jobless Claims (consensus: 14,450K, previous: 14,844K)\n    - Core PCE Prices (consensus: -1.10%, previous: -1.10%)\n    - Corporate Profits (previous: -11.0%)\n    - Fed Chair Powell Speaks\n    - GDP (consensus: -32.5%, previous: -32.9%)\n    - GDP Price Index (consensus: -2.0%, previous: -2.1%)\n    - GDP Sales (previous: -29.3%)\n    - Initial Jobless Claims (consensus: 1,000K, previous: 1,106K)\n    - Jackson Hole Symposium\n    - Jobless Claims 4-Week Avg. (previous: 1,175.75K)\n    - KC Fed Composite Index (previous: 3)\n    - KC Fed Manufacturing Index (previous: 7)\n    - Natural Gas Storage (consensus: 43B, previous: 43B)\n    - PCE Prices (consensus: 1.3%, previous: -1.9%)\n    - Pending Home Sales (consensus: 3.0%, previous: 16.6%)\n    - Pending Home Sales Index (previous: 116.1)\n    - Real Consumer Spending (previous: -34.6%)\n\n## Upcoming events for Friday, August 28th\n\n - Stock splits:\n\n    - MUTE @ **1:10**\n    - PASS @ **1:10**\n    - WEBS @ **1:10**\n    - LABD @ **1:20**\n    - DRIP @ **1:10**\n    - SOXS @ **1:12**\n\n - Expected earnings:\n\n  ATNM, BIG, GVA, HIBB\n\n - Ex-div:\n\n  ABTX, ACNB, AEM, AGNC, AIZ, AVAL, AY, BAM, BAX, BBU, BEP, BEPC, BIP, BIPC, BOH, BPY, BPYU, BRMK, CFR, CPF, CR, CRT, CSX, CTL, CTT, CUB, DNP, DOV, DOW, EAF, EFC, EL, ERF, ESNT, FMS, GECC, GRP.U, HUBB, KINS, KNSL, LYB, LYTS, MARPS, MLAB, NGVC, NKE, NOA, NOC, NWL, ORC, PACW, PATK, PBT, PCB, PFIS, POWI, PSEC, SCHL, SCL, SLG, STAG, TNC, TPVG, UBOH, UI, UNP, VOYA, VVV, WHD, XPER\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 196.9K)\n    - CFTC Copper speculative net positions (previous: 43.5K)\n    - CFTC Corn speculative net positions (previous: -77.2K)\n    - CFTC Crude Oil speculative net positions (previous: 510.7K)\n    - CFTC Gold speculative net positions (previous: 223.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 21.2K)\n    - CFTC Natural Gas speculative net positions (previous: 8.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -64.8K)\n    - CFTC Silver speculative net positions (previous: 26.6K)\n    - CFTC Soybeans speculative net positions (previous: 138.6K)\n    - CFTC Wheat speculative net positions (previous: 5.1K)\n    - Chicago PMI (consensus: 52.0, previous: 51.9)\n    - Core PCE Price Index (consensus: 0.5%, previous: 0.2%)\n    - Core PCE Price Index (consensus: 1.2%, previous: 0.9%)\n    - Dallas Fed PCE (previous: 1.70%)\n    - Goods Trade Balance (previous: -70.99B)\n    - Jackson Hole Symposium\n    - Michigan 5-Year Inflation Expectations (consensus: 2.70%, previous: 2.60%)\n    - Michigan Consumer Expectations (consensus: 66.5, previous: 65.9)\n    - Michigan Consumer Sentiment (consensus: 72.8, previous: 72.5)\n    - Michigan Current Conditions (consensus: 82.5, previous: 82.8)\n    - Michigan Inflation Expectations (consensus: 3.0%, previous: 3.0%)\n    - PCE Price index (previous: 0.8)\n    - PCE price index (previous: 0.4%)\n    - Personal Income (consensus: -0.2%, previous: -1.1%)\n    - Personal Spending (consensus: 1.5%, previous: 5.6%)\n    - Real Personal Consumption (previous: 5.2%)\n    - Retail Inventories Ex Auto (previous: -0.8%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 183)\n    - U.S. Baker Hughes Total Rig Count (previous: 254)\n    - Wholesale Inventories (previous: -1.4%)\n\n^^^^2020-08-25",
        "created_utc": 1598349618,
        "id": "g2sacdh",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1598378418.0
    },
    {
        "author": "ThatsBushLeague",
        "body": "HPE calls going to print today. HPQ gonna print Thursday. I know this. Because every time I see them mentioned on this sub. Everyone talks about how shitty of an idea buying calls on them is.",
        "created_utc": 1598350630,
        "id": "g2sba7b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598379430.0
    },
    {
        "author": "quickquestionhalp",
        "body": "&gt;GE, F, NOK, DB, NLY, PCG, HPE, TEVA, RF, KEY, MGM, SLV, WFC, XLF.\n\nthanks",
        "created_utc": 1598352698,
        "id": "g2sdary",
        "score": 1,
        "subreddit": "options",
        "created": 1598381498.0
    },
    {
        "author": "TerrestrialPlanet",
        "body": "You may want to consider these symbols:  \nGE, F, NOK, DB, NLY, PCG, HPE, TEVA, RF, KEY, MGM, SLV, WFC, XLF.",
        "created_utc": 1598321255,
        "id": "g2rbotr",
        "score": 1,
        "subreddit": "options",
        "created": 1598350055.0
    },
    {
        "author": "I_knowthe_truth",
        "body": "HPE, UPS, ABT, WMT",
        "created_utc": 1598640885,
        "id": "g35vt9f",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1598669685.0
    },
    {
        "author": "TURNIPtheB33T",
        "body": "&gt; Lost 6k on HPE earnings play\n\nNo, just no. Stop trying to be smart.\n\nI don’t know why people don’t just buy weekly barely otm QQQ calls Monday sell Friday free tendiez been doing it for months",
        "created_utc": 1598718576,
        "id": "g395kt8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598747376.0
    },
    {
        "author": "reddituserzerosix",
        "body": "F HPE",
        "created_utc": 1598367052,
        "id": "g2szm0y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598395852.0
    },
    {
        "author": "Space_Lord_MF",
        "body": "Any of the big S&amp;P 500 etfs. The average person wont beat them picking individual stocks. While there is risk as with anything, these move in tandem with the market, so if these go down, everything is probably down.\n\nThe big 3 while similar have different things. VOO is the safest, lowest risk, and lowest expense ratio (though all 3 have extremely low expense ratios) SPY is the most actively traded so its more volatile which some people like.\n\nIf you invested 10,000 in 2010 in VOO, youd have 35,000 today.\n\nWith going all in on one company, there is always a risk. I pointed out some of the flaws of Intel that they are at the top and several huge competitors are going to take massive chunks out of their market share. Also their CEO isnt an engineer, hes a financials guy. If I yold you he was CEO of GE and CFO of HPE, youd have every reason to not be so hopeful at Intels future \n\nIntel could very well be like IBM, they still make mpney but it wont transkate to their stock moving. \n\nIf someone told me I had to pick one company to put all my money and retirement into, Id do it for Apple even thoygh I never buy Apple products. You cant argue with how well they run their business and innovate and they turn custoners into loyal customers.\n\n\nAlso, watch out for pump and dumps that happen on reddit. Half the people telling you a stock is great might be hyping it becayse they are stuck with something that hadnt gone up in ages and has a dim future so they try to get other people intereredted and as soon as the company goes up a $1.50 a share they sell all their sharesm",
        "created_utc": 1598376679,
        "id": "g2tlvzh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598405479.0
    },
    {
        "author": "44MAGNUm12",
        "body": "Its a great Value Play. Lots of people WFHing and using corporate laptops, its trading pretty damn close to its 52 week low, and is one of the few companies that has been in the green one the past couple days. Id buy some HPE now rather than wait. Not to mention its super cheap, so load up lol.",
        "created_utc": 1596515185,
        "id": "g0amai6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596543985.0
    },
    {
        "author": "PreparedToDisappoint",
        "body": "BEAR HPE",
        "created_utc": 1598107665,
        "id": "g2h4mb8",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1598136465.0
    },
    {
        "author": "JayBird9540",
        "body": "Why HPE?\n\nI guess business did have to move online but they don’t really own much of their sector’s market share.",
        "created_utc": 1598127392,
        "id": "g2iix2q",
        "score": 1,
        "subreddit": "options",
        "created": 1598156192.0
    },
    {
        "author": "dwdsquared2",
        "body": "Sorry, apparently the Germany DAX is close to a c r y p t 0 ticker and it blocked my post then my second post for saying  c r y p t 0 \n\n**Events in the US Today (EDT):**\n\n* 8:55am - Redbook (MoM&amp;YoY) \\[1/3 Volatility\\]\n* 9:00am - House Price Index (MoM&amp;YoY-Jun) \\[1/3 Volatility\\]\n   * S&amp;P/CS HPI Composite (MoM&amp;YoY-Jun) \\[2/3 Volatility\\]\n* 10:00am - CB Consumer Confidence (Aug) \\[3/3 Volatility\\]\n   * New Home Sales (Jul) \\[3/3 Volatility\\]\n   * Richmond Manuf., Shipments, Services Index (Aug) \\[1/3 Volatility\\]\n   * The House convenes for a pro forma session\n* 1:00pm - 2-Year Note Auction \\[1/3 Volatility\\]\n* 2:30pm - The Senate meets for a pro forma session. The full Senate is scheduled to meet on Sept. 8.\n* 3:25pm - FOMC Member Daly Speaks \\[2/3 Volatility\\]\n* 4:30pm - API Weekly Crude Oil Stock \\[2/3 Volatility\\]\n* 10:30pm - POTUS attends the First Lady’s Remarks to the 2020 RNC\n   * The Rose Garden\n* **Fed Chairman Jerome Powell will speak Thursday during a virtual version of the Fed’s annual Jackson Hole, Wyoming, conference.**\n   * **Powell is set to deliver ‘profoundly consequential’ speech, changing how the Fed views inflation**\n   * **He is expected to outline what could be the central bank’s most active efforts ever to spur inflation back to a healthy level.**\n   * **“Average inflation” targeting means the Fed will allow inflation to run higher than normal for a period of time.**\n   * **The effort will be the reverse of former Fed Chairman Paul Volcker’s rate hikes instituted to quash inflation in the 1980s.**\n* In the biggest reshuffling in 7 years, Exxon Mobil, Pfizer and Raytheon Technologies were kicked out of the Dow Jones, making way for Salesforce, Amgen, and Honeywell to enter the 124-yr old equity gauge Aug 31st. The actions were prompted when Apple -- currently 12% of the 30-stock index -- announced a stock split that reduced the sway of computer and software companies in the price-weighted average.\n* U.S. and Chinese trade negotiators held a phone call Tuesday morning Beijing time about implementing the phase one agreement between the two countries.\n* The EPA approved use by American Airlines of a surface coating designed to fight COVID-19 for up to a week as a transmission risk through human contact in public spaces.\n* The Miami Dolphins and the University of Miami’s football program announced on Monday plans to allow 13,000 spectators to attend the first games of the season in September.\n\n**Events in the World Today (EDT):**\n\n* 2:00am - Germany GDP (QoQ&amp;YoY-Q2) \\[3/3 Volatility\\]\n   * Norway GDP QoQ-Q2) \\[2/3 Volatility\\]\n* 2:30am - Switzerland Employment Level (Q2) \\[2/3 Volatility\\]\n* 4:00am - Germany Ifo Business Climate Index (Aug) \\[3/3 Volatility\\]\n   * Germany Current Assessment (Aug) \\[2/3 Volatility\\]\n   * Germany Business Expectations (Aug) \\[2/3 Volatility\\]\n* 1:30pm - Canada BoC Gov Council Member Schembri Speaks \\[2/3 Volatility\\]\n* 6:45pm - New Zealand Trade Balance (MoM&amp;YoY-Jul) \\[2/3 Volatility\\]\n* 9:30pm - Australia Construction Work Done (QoQ-Q2) \\[2/3 Volatility\\]\n* Global markets got a boost as top U.S. and Chinese trade officials reaffirmed their commitment to the Phase 1 trade deal despite diplomatic rifts between the two countries.\n* The trade-sensitive German DAX rose 0.6% after data showed Europe's largest economy contracted by a record 9.7% in the second quarter, but marked a minor upward revision from an earlier estimate of -10.1%.\n* Hong Kong University on Monday reported the first apparent confirmed case of a patient who contracted COVID-19 twice, raising questions about the durability of antibodies and the immune response.\n\n**Earnings Before Open:**\n\n* Best Buy, Medtronic, Smucker's, Hormel Foods, Scotiabank, Bank of Montreal, The Children's Place, Autohome, Inc., Hain Celestial, Premier\n\n**Earnings After Close:**\n\n* Salesforce, Intuit, Autodesk, Toll Brothers, Hewlett Packard Enterprise, Urban Outfitters, Nordstrom, Pure Storage, Heico, Scansource\n\n[Earnings This Week](https://i.redd.it/tauasgvfrki51.jpg)",
        "created_utc": 1598354570,
        "id": "g2sfa80",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598383370.0
    },
    {
        "author": "SmallParade",
        "body": "I don’t think this is the Sears of defense and aerospace we’re talking about here. More like the Hewlett-Packard of defense and aerospace. HP is still an OK investment.",
        "created_utc": 1598360685,
        "id": "g2snfsk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598389485.0
    },
    {
        "author": "reddituserzerosix",
        "body": "HPE jumped AH too? Thought about run-up \n\nAnyone looking at PLAN?",
        "created_utc": 1598357730,
        "id": "g2sj5h7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598386530.0
    },
    {
        "author": "karmalizing",
        "body": "I just lost $6k on a HPE earnings play.... they nailed earnings and barely went up at all.\n\nIt’s not that hard",
        "created_utc": 1598717361,
        "id": "g392phy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598746161.0
    },
    {
        "author": "Psychological_Bike52",
        "body": "Started 2 weeks ago, up 10%\n\nI bought equal shares of NIO, NKLA, HPE and OSS. \n\nOSS went up 20% today and dragged down. I bought NIO at $13.77 and it’s currently at $20.40. \n\nI am gonna say it... I GOT LUCKY!!! My mum rly sold me NIO’s future and I bought it, she also sold me NKLA and that’s down 12%. \n\nI am currently learning to value stocks and look for undervalued stocks (NIO). I’m not good at all. \n\nI’m long term bullish on LYFT,  Intel, NVIDIA and I’m a fan of BAOZUN. \n\nMy advice to anyone. Look at $OSS, it’s got a bad record with missing quarterly earnings expectations but a new management team that I think can bring investor confidence back. They did beat their most recent ER expectations",
        "created_utc": 1598481541,
        "id": "g2ymgd9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598510341.0
    },
    {
        "author": "grego45",
        "body": "Need HPE to 🚀🚀. They beat earnings but are continuing to cocktease me and my calls. (I know it's a boomer stock)\n\nHPE 11c 9/18",
        "created_utc": 1598449930,
        "id": "g2wrcop",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598478730.0
    },
    {
        "author": "reddituserzerosix",
        "body": "Good thing I stayed out of hpe",
        "created_utc": 1598377684,
        "id": "g2to0dt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598406484.0
    },
    {
        "author": "bumblebear3012",
        "body": "While AWS and Azure offer the same on-premise tools and capabilities that customers can use for hybrid cloud - like ML, containers, VMs, etc - neither company (or Google) specializes in the actual hardware for computer, networking, and storage that is required for an on-premise solution. Yes, AWS Outposts is dipping their toe into the water on hardware. But they won’t be offering the full range of hardware products that a Dell or HPE can. As much as people talk about convergence to the “cloud”, this is often very over-simplified as computing/storage needs are not monolithic and are totally dependent on the customer and workloads. \n\nIn most scenarios in which you choose AWS or Azure Stack for example, you still need a Dell or HPE frame, box, etc. to run your private cloud. HPE GreenLake runs on top of both AWS and Azure, so they aren’t necessarily mutually exclusive anyway. GreenLake is a force multiplying service in that it also offloads management of the hybrid cloud estate to HPE. Companies continue to struggle with hybrid cloud requirements, I.e. using similar tools across different environments or understanding how to provision workloads most efficiently. HPE shows GreenLake customers the best way to do this based on cost, governance, performance, security, and other factors. That saves customers money and computing resources. Sure, Azure is subscription-based and pay-per-use as well. But if the customer doesn’t know how to efficiently provision on-premise resources given those factors above they won’t realize the cost-savings. \n\nEven more, over 80% of public cloud users are using a multicloud strategy (according to Gartner). GreenLake provides multicloud customers a singularly unified management interface to integrate data and workloads across multiple cloud environments (AWS and Azure) which is not something that Amazon or Microsoft can offer. We tend to think of the cloud as this thing that just runs in the background and makes data storage and application performance better. But there are huge IT staffing and CAPEX costs associated with managing these resources and getting the most out of them. And for companies needing to scale compute resources up or down on a regular basis, GreenLake can de-risk these decisions while also freeing up IT resources for other requirements. \n\nThe ability of HPE to bundle hardware, management, and services brings overall cost down and customers can end up getting more than they would with just AWS or Azure for a competitive price (and 20-30% lower compared to the public cloud offerings). Additionally, applications and data consumption is moving away from centralized compute (public cloud) and to the edge. Increasingly companies will be bundling edge networking and management services into their GreenLake subscription alongside the private cloud requirements. And again, this is not something that is offered by Amazon or Microsoft. They are in edge computing through AWS Lamda and Azure Edge but that’s not a direct competitor. \n\nWhen you look at the fact that GreenLake has over 700 customers and a 99% retention rate, in addition to order growth of 82% year-over-year, I think the evidence is pretty strong that there is a unique value proposition and demand. If standalone hybrid offerings from AWS, Azure, and Google Cloud were already eliminating the need for this service, I don’t think we would be seeing that level of growth and retention.",
        "created_utc": 1598472909,
        "id": "g2y4900",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598501709.0
    },
    {
        "author": "Danksley",
        "body": "Intel chips on 7nm TSMC would slap hard and regain confidence from enthusiast market and enterprise partners. Companies like Dell, HPE, etc got burned on their commitment to Intel in the face of Ryzen / Epyc which allowd SMCI to move in as a larger player, and almost directly caused providers like AWS / Azure to completely abandon them and go completely Epyc whitebox.",
        "created_utc": 1597699671,
        "id": "g1wxgej",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1597728471.0
    },
    {
        "author": "Horny_Cat_The_Legend",
        "body": "Ask It if my HPE calls are going to make money too if you would. Thanks.",
        "created_utc": 1598401662,
        "id": "g2uzaj2",
        "score": 0,
        "subreddit": "stocks",
        "created": 1598430462.0
    },
    {
        "author": "44MAGNUm12",
        "body": "Hewlett Packard is my sneaky play. Currently trading around 52 week low, and was actually in the green on close Friday. Resilient company through the pandemic with lots of people WFH and sales steady. Id buy and wait to ring the register....",
        "created_utc": 1596428119,
        "id": "g06cezm",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1596456919.0
    }
]