[
    {
        "author": "ixamnis",
        "body": "I see several people on here suggesting VOO.  I have no problem with VOO, but be aware that the top six holdings in VOO are:  AAPL, MSFT, AMZN, FB, GOOGL and GOOG.  I like VOO, but if you want to diversify outside of tech you may want to consider some value stocks and buy individual stocks instead of an ETF, or buy sector ETFs.  \n\nValue stocks that I'd recommend:  ABBV, ACN, AES, CLX, DIS, IBM, JNJ, JPM, KHC, KO, KR, LOW, MA, MAR, MCD, NVS, O, PEP, PFE, PLAY, SBUX, T, TD, TGT, TROW, VZ, WBA, WMT, WSM. I think you could easily pick any three to five of these and have a nicely balanced portfolio given the amount of money you are investing.\n\nSector ETFs that I like include:\n\nICLN, TAN or PBW - Clean energy/renewable energy\n\nFHLC, XLV - Health Care\n\nIDNA, ARKG - Genomic Research and DNA technology\n\nPRNT - 3D printing\n\nARKQ, THNK, ROBO - artificial intelligence and robotics (However, this is \"tech\")\n\nVFH, FNCL, XLF, IEFN - financial sector ETFs\n\nI'm not a financial advisor and have no business giving financial advice. That said, a nice balanced portfolio might look something like this:\n\n33% tech stocks and ETFs  (This is what you already have)\n\n33% value stocks (from the list above)\n\n33% sector ETFs:  10% ICLN, 10% ARKG, 10% XLV\n\nBest of luck to you.",
        "created_utc": 1600262071,
        "id": "g5gum66",
        "score": 9,
        "subreddit": "stocks",
        "created": 1600290871.0
    },
    {
        "author": "fwifo",
        "body": "Bought 2 shares of Accenture to test how people were feeling pre-earnings, promptly sold as the feelings were clearly not great, [then promptly bought a 100 share SUNW lottery ticket at the literal fucking top and had the balls to hold through the trade halt just in case.](https://i.imgur.com/KnCQ0Gk.png)\n\nThanks for whoever posted about SUNW earlier!",
        "created_utc": 1600892477,
        "id": "g6cqj6o",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600921277.0
    },
    {
        "author": "JackOfAllTradezs",
        "body": "The chart on ACN is beautiful. Never heard of it before last week but I’m definitely going to open a debit spread and hold through earnings",
        "created_utc": 1600646617,
        "id": "g61qkyz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600675417.0
    },
    {
        "author": "SnooHedgehogs6477",
        "body": " guys buy factset, solid business could jump massively and accenture too",
        "created_utc": 1600534945,
        "id": "g5u0xk8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600563745.0
    },
    {
        "author": "learningtosail",
        "body": "ACN.  \nGet paid both ways.  \nEdit: look at that performance it makes no fucking sense",
        "created_utc": 1598984434,
        "id": "g3mdsls",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599013234.0
    },
    {
        "author": "totsnotbiased",
        "body": "So what I would do with your Lowe’s stock is sell out of about 5% of it per year as long as it’s looking well rated, and take that money along with the dividends and buy into growth industries un-correlated with Lowe’s (like heathcare, Tech etc)\n\nThis way if it’s growing more than 5% a year, your principal isn’t shrinking, but you are less reliant on Lowe’s alone.\n\nMy opinion on the AMC/INTC/NVDA wars is they will all go up, and buy all three so you don’t miss a breakout! So I’d buy in NVDA a little bit, as it also Wall Street’s favorite out of the three\n\nAccenture is a good investment, I like that quite a bit\n\nAlso can’t go wrong with buying in VOO and QQQ, and for younger investor’s ARKK is personally where it’s at too.\n\nAmazon is a decent hedge against Lowe’s too that I’d think about",
        "created_utc": 1600235336,
        "id": "g5g2jkj",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600264136.0
    },
    {
        "author": "ChristmasAllYear",
        "body": "Entered today - with tight stops\n\n$C calls\n\n$CNC calls\n\n$AMD calls\n\nThe way $USD is going, may do a cheeky short on gold.\n\nLooking at $RKT again for potential calls\n\nIf tmr opens green, I personally would consider it a potentially flip from bearish to bullish.\n\nMade stacks on $TSLA calls, which I closed yesterday, my stock are hurting but at least it isn't calls lmao.\n\nClosed of $ACN calls and $PTON puts I was mentioning yesterday at a proper profit",
        "created_utc": 1600829917,
        "id": "g6a6dla",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600858717.0
    },
    {
        "author": "BunkyL",
        "body": "WFC 23C 9/25 bought right at close\n\nIBM 120C 9/25 bought right at close\n\nFDS 350C (earnings) \n\nHon 162.5C 10/16 bought at noon...\n\nACN 237.5C 10/16 bought at noon...  (earnings)",
        "created_utc": 1600894896,
        "id": "g6cv4ex",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600923696.0
    },
    {
        "author": "Hannibals_Elephants",
        "body": "Any help appreciated! About to turn 23, starting a job in March with base salary of 70k, so looking for current advice as well as where to put some future savings. \n\nCurrent portfolio: ~40k  \nLOW: 42%  \nFLCSX (Fidelity Large Cap): 15% (Currently selling some off)  \nTravel Stocks (Airlines and Cruise ships): 13%  \nCASH: 7%  \nMFST: 6%  \nAPPL: 6%  \nACN: 6%  \nAMD: 4%  \nINTC: 2%  \n\nWith a smattering of other things. The reason I’m so heavy in LOW is because I invested in 100 shares 10 years ago and it’s been performing so I’ve seen no reason to sell it and take the capital gains hit. Curious if this reasoning is sound. \n\nThanks in advance!",
        "created_utc": 1600191762,
        "id": "g5dod0m",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600220562.0
    },
    {
        "author": "DaRepo",
        "body": "I'm playing FDX, COST, ADBE this month, ACN next month. Still got plenty of run up potential on all of them",
        "created_utc": 1599035408,
        "id": "g3p37pw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599064208.0
    },
    {
        "author": "SnooHedgehogs6477",
        "body": "lol no better plays like costco ACN or FDS",
        "created_utc": 1600434782,
        "id": "g5p5tlx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600463582.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 23rd of September\n\n\n\n## Upcoming events for Wednesday, September 23rd\n\n - Expected earnings:\n\n  AKER, AMRH, APWC, ATLC, BCOW, BROG, CBLI, CEI, CNTG, CTAS, CTXR, CVU, DEN, ELLO, FMCI, FUL, GIS, HMG, HOTH, HX, JKS, KOR, LMFA, OBSV, PSV, SANW, TDAC, TNP, WEI, WOR, WORX, YGYI, ZNH\n\n - Ex-div:\n\n  DX, GMRE, GTY, IFF, LMNX, NYMT, PM, PPT, PRA, SUNS, TOT\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.298%)\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: -0.066M)\n    - Crude Oil Inventories (consensus: -2.325M, previous: -4.389M)\n    - Cushing Crude Oil Inventories (previous: -0.074M)\n    - Distillate Fuel Production (previous: 0.005M)\n    - EIA Refinery Crude Runs  (previous: 0.709M)\n    - EIA Weekly Distillates Stocks (consensus: 1.020M, previous: 3.461M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.5%, previous: 4.0%)\n    - FOMC Member Mester Speaks\n    - FOMC Member Quarles Speaks\n    - Fed Chair Powell Testifies\n    - Gasoline Inventories (consensus: -0.648M, previous: -0.381M)\n    - Gasoline Production (previous: -0.111M)\n    - Heating Oil Stockpiles (previous: 0.495M)\n    - House Price Index (previous: 0.9%)\n    - House Price Index (previous: 289.9)\n    - House Price Index (previous: 5.7%)\n    - MBA 30-Year Mortgage Rate (previous: 3.07%)\n    - MBA Mortgage Applications (previous: -2.5%)\n    - MBA Purchase Index (previous: 316.2)\n    - Manufacturing PMI (consensus: 53.1, previous: 53.1)\n    - Markit Composite PMI (previous: 54.6)\n    - Mortgage Market Index (previous: 757.2)\n    - Mortgage Refinance Index (previous: 3,289.4)\n    - Seevol Cushing Storage Report (previous: 2.242M)\n    - Services PMI (consensus: 54.7, previous: 55.0)\n\n## Upcoming events for Thursday, September 24th\n\n - Stock splits:\n\n    - PCRCF @ **2:13**\n\n - Expected earnings:\n\n  ACN, AEHR, AIM, AIR, AYTU, BB, BNTC, CAMP, CCL, CKX, CLUB, COST, CUK, DRI, DSWL, DYNT, FDS, FFBW, FLR, FLUX, GTT, IBEX, INTG, JBL, JEF, JRJC, KERN, KMX, MTN, NTWK, PDEX, PRGS, PTN, PZG, RAD, RLGT, RSSS, SCHL, SCX, TAYD, TCOM, VEDL, WVFC\n\n - Ex-div:\n\n  ADC, ALCO, BANX, BRT, CERN, CONE, CP, CTS, DRD, ELS, EQR, FMBI, GBLI, HCKT, ICMB, INT, IROQ, KBAL, KFY, KLIC, MDT, PBA, POR, RBC, RPAI, SRE, TRTX, VMI, XRAY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 7-Year Note Auction (previous: 0.519%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Continuing Jobless Claims (consensus: 12,339K, previous: 12,628K)\n    - Continuing Jobless Claims (previous: 12,628K)\n    - Fed Chair Powell Testifies\n    - Initial Jobless Claims (consensus: 843K, previous: 860K)\n    - Jobless Claims 4-Week Avg. (previous: 912.00K)\n    - KC Fed Composite Index (previous: 14)\n    - KC Fed Manufacturing Index (previous: 23)\n    - Natural Gas Storage (previous: 89B)\n    - New Home Sales (consensus: -1.0%, previous: 13.9%)\n    - New Home Sales (consensus: 890K, previous: 901K)\n    - Treasury Secretary Mnuchin Speaks\n\n## Upcoming events for Friday, September 25th\n\n - Expected earnings:\n\n  AHPI, AIH, ATHE, ATNM, BIMI, CNNB, CRTD, ENOB, FONR, GLBS, GMHI, GVA, IBIO, IRCP, JFU, LFAC, MARPS, NFIN, NNVC, NTZ, RCON, SSY, TYHT, UTZ, YIN\n\n - Ex-div:\n\n  AMT, CM, CVA, DHR, GE, GNTY, GSBC, HIHO, INDB, JCI, PTRS, RUSHA, RUSHB, TTC\n\n - Economic events and announcements:\n\n    - Core Durable Goods Orders (consensus: 1.2%, previous: 2.6%)\n    - Durable Goods Orders (consensus: 1.5%, previous: 11.4%)\n    - Durables Excluding Defense (previous: 10.1%)\n    - FOMC Member Williams Speaks\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 1.9%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 179)\n    - U.S. Baker Hughes Total Rig Count (previous: 255)\n\n^^^^2020-09-23",
        "created_utc": 1600855222,
        "id": "g6ayki5",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1600884022.0
    },
    {
        "author": "DaRepo",
        "body": "Anybody else playing Accenture earnings? Looks to be some big upside potential and they almost always beat",
        "created_utc": 1600833356,
        "id": "g6abwd6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600862156.0
    },
    {
        "author": "styledliving",
        "body": "A good example is COVID-19 tracking in the UK and US. \n\nThe recent reports that people had underlying causes that contributed to increased fatality was directly attributed by using the Palantir platform because it was able to not only ingest data from multiple disparate sources (apparently the CDC had a previous system to track pandemic indicators for flu and stuff, but they didn't track all the patient data you needed.  \n\nFrom previous sales material on how Palantir ingests data from like business cards to table napkins with technical drawings.  I think the way they did it was all the hospital forms and documents, they used their Image recognition module to scan all the paper forms that were faxed over from all the hospitals.  They were also flexible in ingesting data from various database schemas. \n\nLike if you think about big data in terms of health care, nobody has the same way of storing data in a database.  Some databases are literally just f\\*cking file cabinets.  Other places have a form that has maybe 15 cells for name, dob, blood type, pre-existing conditions, are they missing limbs, that sorta thing.  Other hospitals/healthcare providers will be voracious in their patient history and note taking even down to what bed they stayed in and how many times their sheets were changed in an inpatient visit.\n\nThis is the problem w/ data and an even bigger problem w/ big data.  Trying to sift through the information that's relevant and also providing correlating links to data that \\*shoudn't\\* be relevant but ends up being relevant.  Researchers are able to do research and ask questions and get answers (in the form of data) from whatever analysis tool.  The difference is (as mentioned above) how long support requests take place.  Like when you're writing a book, you immediately do research to find out something so you can keep your creative momentum.  \n\nResearchers operate much in the same way where if it takes too long from a vendor to complete an ask, the creative momentum is crushed.\n\nI think we should be clear here, Palantir has shown it can scale within its confines and it's successful at helping people. \n\nThe actual question that we should be asking is:\n\nWith another 4.5-9 billion in additional cash, can it increase adoption?  \n\nIf the answer is a linear progression or even algebraic, it can beat out Accenture, Gartner, IBM, PWC, and etc.  I'd say continued long-term increase.  I'd liken Palantir to Tesla's Battery day.  Not right now, but 2022 look for a moonshot if you can HODL.",
        "created_utc": 1601052806,
        "id": "g6juefp",
        "score": 1,
        "subreddit": "investing",
        "created": 1601081606.0
    },
    {
        "author": "SacRyder",
        "body": "I'm in FedEx but gonna dump tomorrow. Looking at next earnings play:\n\nBed bath beyond is on my short list, stock is under $15. Seems like a lot of department stores such as macy's and nordstrom had decent earnings and saw a nice dump within 5 days prior to earnings and a nice pump post ER. \n\nAccenture. Business/tech consulting firm. Sept 24 ER. This is a pricey stock(for me), around $238. Would love to buy an option but have too much cash tied up in other investments. Might buy a couple shares.\n\nAny upcoming ER plays you guys are eyeing?",
        "created_utc": 1600138561,
        "id": "g5bh6mj",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1600167361.0
    },
    {
        "author": "PapiC0Vi",
        "body": "Will look into BBBY and ACN. Accenture looks promising tho",
        "created_utc": 1600148061,
        "id": "g5bvgwd",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1600176861.0
    },
    {
        "author": "erudism",
        "body": "I think Accenture is pretty  strong.",
        "created_utc": 1600285054,
        "id": "g5i438g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600313854.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "SnooHedgehogs6477",
        "body": "how about you check these 3 stocks SE ACN and ETSY lol",
        "created_utc": 1600448982,
        "id": "g5pyb4z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600477782.0
    },
    {
        "author": "PoopKing5",
        "body": "Since you’re talking very long term, not quite sure I agree with CRWD, DDOG, TDOC, ROKU and potentially Intel. It feels those could potentially be more of a 3-5 year buy at this point and if you’re not really planning on actively trading it, just feel that those companies are not as high probability like a more blue chip portfolio. You could argue intel could stay in. \n\nI’d maybe add Adobe, Abbott, Intuit, CRM, Accenture. \n\nIf you’re more trading the account then sure, maybe those other names could be a benefit but if you’re just looking for low turnover buy and hold, I’d maybe stick to some “higher quality.”",
        "created_utc": 1599530231,
        "id": "g4egqsn",
        "score": 1,
        "subreddit": "investing",
        "created": 1599559031.0
    },
    {
        "author": "styledliving",
        "body": "I think the difference is intimate knowledge of the product.  Other firms who wrangle data are usually on the consultant space like Accenture.  They take some COTS platform and build from scratch the ontologies and tooling to go with it.  Customization takes as much billable hours in stupid meetings as possible so they can justify recruiting whole teams and keep their hiring engine positive.  Palantir saves money in the long run despite what analysts call expensive customizations because it's those gov't agencies' first foray into big data because other consulting agencies have many times been just too frickin' expensive.\n\nSee Center for Public Integrity's brief mention: [https://publicintegrity.org/health/coronavirus-and-inequality/secretive-data-system-shaping-pandemic-response-hhs-protect/](https://publicintegrity.org/health/coronavirus-and-inequality/secretive-data-system-shaping-pandemic-response-hhs-protect/)\n\nAnother place that I see Palantir make sense is that they're agile in terms of being able to make customer optimizations since they own the platform and the customer consultancy vertical.  Intimate knowledge of the customer, intimate knowledge of the platform, and belief in the customer's mission (the palantirians sound like a cult for social change). Maybe good, maybe bad, but at least it means that your vendor has your back .. that's a pretty rare thing.  I don't see Amazon having my back on the AWS side or on the Employee (think warehouse and covid19) side.\n\nIt appears to me if there're sufficiently technically savvy customers, customers can use their own analysts to make their own customizations, those deployments would likely make more money for the company as adoption increases, I think that was the cases in one of the energy industry implementations in their investor day video.\n\nTechnology, the product might not be as sophisticated as the computer on the Starship Enterprise making up Moriarti's, but they're using the sh\\*t out of it and making it work.\n\nEnter Scuderia Ferrari:\n\n[https://www.youtube.com/watch?v=k80R6fgf2ME](https://www.youtube.com/watch?v=k80R6fgf2ME)",
        "created_utc": 1601048433,
        "id": "g6jlnwx",
        "score": 1,
        "subreddit": "investing",
        "created": 1601077233.0
    },
    {
        "author": "YoshikageHands",
        "body": "Brother buy acn earnings and you’re back",
        "created_utc": 1600819957,
        "id": "g69pgsj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600848757.0
    },
    {
        "author": "YoshikageHands",
        "body": "Bro check out kmx and acn earnings Thursday. Kmx has higher web traffic than Cvna and actual dealerships. Acn cloud business has been growing all year.",
        "created_utc": 1600825668,
        "id": "g69z9pu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600854468.0
    },
    {
        "author": "styledliving",
        "body": "They might be different, in a different thread last week, someone compared them with other gov't contractors.  Response time was days vs weeks at implementing new features.\n\nLet me say that again **IMPLEMENTING NEW FEATURES**. \n\nThose that work in gov't *know how big this* is because contracts are usually set in stone and once folks like Accenture, PWC, Gartner, etc get their contracts signed, they send in interns to do the dirty work.  PTLR apparently still sends in their best guys after the initial implementation.  \n\nSo for IPO, I'm not sure how this affects them, probably not a whole lot, but long term, Palantir will either bring about a new standard within the tech consulting industry et al, or *they will be the new standard*.",
        "created_utc": 1601403032,
        "id": "g7367ny",
        "score": 1,
        "subreddit": "investing",
        "created": 1601431832.0
    },
    {
        "author": "cutiesarustimes2",
        "body": "Lol per layoff.com 126 ppl got laid off at Accenture.",
        "created_utc": 1600876842,
        "id": "g6buoby",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600905642.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the 24th of September\n\n\n\n## Upcoming events for Thursday, September 24th\n\n - Stock splits:\n\n    - PCRCF @ **2:13**\n\n - Expected earnings:\n\n  ACN, AEHR, AIM, AIR, AYTU, BB, BNTC, CAMP, CCL, CKX, CLUB, COST, CUK, DRI, DSWL, DYNT, FDS, FFBW, FLR, FLUX, GTT, IBEX, INTG, JBL, JEF, JRJC, KERN, KMX, MTN, NTWK, PBIO, PDEX, PTN, PZG, RAD, RLGT, RSSS, SCHL, SCX, TAYD, TCOM, VEDL, WVFC\n\n - Ex-div:\n\n  ADC, ALCO, BANX, BRT, CERN, CONE, CP, CTS, DRD, ELS, EQR, FMBI, GBLI, HCKT, ICMB, INT, IROQ, KBAL, KFY, KLIC, MDT, PBA, POR, RBC, RPAI, SRE, TRTX, VMI, XRAY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 7-Year Note Auction (previous: 0.519%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Chicago Fed President Evans Speaks\n    - Continuing Jobless Claims (consensus: 12,300K, previous: 12,628K)\n    - FOMC Member Williams Speaks\n    - Fed Chair Powell Testifies\n    - Initial Jobless Claims (consensus: 840K, previous: 860K)\n    - Jobless Claims 4-Week Avg. (previous: 912.00K)\n    - KC Fed Composite Index (previous: 14)\n    - KC Fed Manufacturing Index (previous: 23)\n    - Natural Gas Storage (consensus: 78B, previous: 89B)\n    - New Home Sales (consensus: -0.1%, previous: 13.9%)\n    - New Home Sales (consensus: 895K, previous: 901K)\n    - Treasury Secretary Mnuchin Speaks\n\n## Upcoming events for Friday, September 25th\n\n - Expected earnings:\n\n  AHPI, AIH, ATHE, ATNM, BIMI, CNNB, CRTD, ENOB, FONR, GLBS, GMHI, GVA, IBIO, IRCP, JFU, LFAC, MARPS, NFIN, NNVC, NTZ, RCON, SSY, TYHT, UTZ, YIN\n\n - Ex-div:\n\n  AMT, CM, CVA, DHR, GE, GNTY, GSBC, HIHO, INDB, JCI, PTRS, RUSHA, RUSHB, TTC\n\n - Economic events and announcements:\n\n    - Core Durable Goods Orders (consensus: 1.2%, previous: 2.6%)\n    - Durable Goods Orders (consensus: 1.5%, previous: 11.4%)\n    - Durables Excluding Defense (previous: 10.1%)\n    - FOMC Member Williams Speaks\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 1.9%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 179)\n    - U.S. Baker Hughes Total Rig Count (previous: 255)\n\n^^^^2020-09-24",
        "created_utc": 1600941618,
        "id": "g6eq4jh",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1600970418.0
    },
    {
        "author": "dwdsquared2",
        "body": " **Events in the US Today (EDT):**\n\n* 8:30am - Initial Jobless Claims \\[3/3 Volatility\\]\n* 9:00am - The House meets\n* 10:00am - Fed Chair Powell Testifies \\[3/3 Volatility\\]\n* Treasury Secretary Mnuchin Speaks \\[2/3 Volatility\\]\n* New Home Sales (Aug) \\[3/3 Volatility\\]\n* 10:45am - Nancy Pelosi holds her weekly press conference\n* 11:00am - KC Fed Composite &amp; Manuf. Indexes \\[1/3 Volatility\\]\n* The House begins legislative business\n* 11:30am - 4&amp;8 Week Bill Auctions \\[1/3 Volatility\\]\n* 1:00pm - Chicago Fed Pres. Evans Speaks \\[1/3 Volatility\\]\n* 7-Year Note Auction \\[1/3 Volatility\\]\n* 2:00pm - FOMC Member Williams Speaks \\[3/3 Volatility\\]\n* 4:30pm - POTUS delivers remarks on the America First Healthcare Vision\n* Charlotte, NC\n* Comments from President Donald Trump that he would not commit to a peaceful transfer of power should he lose the election appeared to hit sentiment. Investors are concerned about a drawn-out election result.\n* On Wednesday Chair Powell reiterated that further fiscal stimulus is needed if the U.S. economic recovery is to continue.\n* Disney said it plans to move the release of a number of its coming slate of movies into late 2020 and 2021 as Americans continue to shun indoor movie theaters amid the pandemic.\n* Disney pushed the release of the much-anticipated Marvel blockbuster “Black Widow” back by 6 months to May 2021. The studio also postponed for a full year the release for the remake of “West Side Story” to Dec 2021 from its previous Dec 2020 date.\n* Johnson &amp; Johnson on Wednesday began an enormous late-stage human trial in the United States and in other countries to test the effectiveness and safety of a single-dose vaccine to ward off COVID-19 infection. \n\n**Events in the World Today (EDT):**\n\n* DAY - South Africa Heritage Day Holiday\n* 3:30am - Switzerland SNB Interest Rate Decision \\[3/3 Volatility\\]\n* Switzerland Monetary Policy Assessment \\[3/3 Volatility\\]\n* 4:00am - Germany Ifo Business Climate Index (Sep) \\[3/3 Volatility\\]\n* Germany Business Expectations (Sep) \\[2/3 Volatility\\]\n* Germany Current Assessment (Sep) \\[2/3 Volatility\\]\n* Norway Interest Rate Decision \\[2/3 Volatility\\]\n* Euro Zone ECB Economic Bulletin \\[2/3 Volatility\\]\n* 5:30am - Euro Zone ECB LTRO \\[2/3 Volatility\\]\n* 10:00am - UK BoE Gov Bailey Speaks \\[3/3 Volatility\\]\n* 11:00am - Germany Buba Wuermeling Speaks \\[2/3 Volatility\\]\n* 2:00pm - Mexico Interest Rate Decision (Sep) \\[2/3 Volatility\\]\n* European stocks fell on concern the economic recovery is flagging amid a resurgence of coronavirus and fears of tighter measure to contain it. \n\n**Earnings Before Open:**\n\n* Rite Aid, Carmax, Factset, Darden, Accenture, BlackBerry, Jabil\n\n**Earnings After Close:**\n\n* Costco, Aytu, Trip.com, Vail Resorts, CalAmp, AAR, Scholastic\n\n[Earnings This Week](https://i.imgur.com/It9kGgQ.png)",
        "created_utc": 1600948653,
        "id": "g6eyd1k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600977453.0
    },
    {
        "author": "miticax",
        "body": "Bought Costco last week in anticipation.\n\nAccenture I dunno hard to predict IT",
        "created_utc": 1600971438,
        "id": "g6g71be",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601000238.0
    },
    {
        "author": "BYE_HI_SELL_LOW",
        "body": "I used a bad news source haha bad CNBC and a few other news outlets reference this : https://www.google.com/amp/s/www.cnbc.com/amp/2020/09/24/stocks-making-the-biggest-moves-in-the-premarket-accenture-darden-restaurants-blackberry-more.html",
        "created_utc": 1600951645,
        "id": "g6f31p0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600980445.0
    },
    {
        "author": "ixamnis",
        "body": "Here are some that I like. By no means an exhaustive list:\n\n**QQQ** \\- This one uses the NASDAQ 100 as its benchmark. Obviously it's an Indexed, non-managed ETF. XTF used to rate this one as a perfect 10.0 out of 10 rating, but recently dropped it to 9.9 out of 10. It has one of the highest rates of return over the past 10 years of any ETF. It does tend to be tech-heavy, especially with the FAANG +M stocks.  (Facebook, Apple, Amazon, Netflix, Google and Microsoft).  Other top holdings include TSLA, NVDA and ADBE.  (The rating dropped recently when the portfolio of the NASDAQ 100 was re-balanced).\n\n**VXUS** \\- Vanguard Total International Index Fund ETF - top holdings include BABA, Tencent, Samsung, Taiwan Semiconductors, Novartis, Toyota. This is a broad market fund investing only in companies overseas.  I'm not generally bullish on foreign markets, but this one is a very solid ETF with some companies that are likely to do extremely well for the foreseeable future.  XTF rates this one a perfect 10.0 out of 10.\n\n**VOO**/**SPY** \\- **VOO** and **SPY** are non-managed funds indexed to the S&amp;P 500 Index. These funds are very popular on this subreddit, for good reason. They are well diversified, broad market funds investing in mostly US stocks. XTF rates these funds at 9.6 out of 10 because their return on investment over the long term is somewhat tempered by some of the blue chip stocks in the funds. But those stocks also help reduce volatility relative to some other ETFs. These are solid investments, but keep in mind that in the top 10 holdings there will be a lot of crossover between these funds and other broad market funds that hold US stocks like **QQQ**, **VTI**, **VTG**, **VOOG** and **SPYG**.  There are differences, of course, as well, but you always want to know where those duplications exist.\n\n**IWF** \\- This is a Russell 1000 indexed fund. It is one of my favorites that doesn't get talked about much. It does have a lot of crossover with the other funds mentioned above, but the mix is slightly different.  I would describe this fund as more aggressive than **VOO/SPY**, less volatile than **QQQ**.\n\n**IWM** \\- for someone looking to diversify a little bit, this is a great fund to look into. This fund is a non-managed, indexed fund that uses the Russell 2000 index as its benchmark. The big difference between the Russell 2000 index and many of the the other indexes is that the Russell 2000 index looks at small and mid-cap companies, rather than large-cap companies.  Thus, there is zero crossover between this one and the funds mentioned above. While this fund will move up and down with the market, it is often less volatile than the market overall. If you look at the charts, this fund has under-performed some of the other funds over the past few months while the market has been very volatile in an upward direction, but in a crash, this fund would probably outperform the rest of the market.  It has a 9.0/10 XTF rating.\n\nThere are also some sector funds you may want to look at:\n\n&amp;#x200B;\n\n**ICLN**/**TAN/FAN** \\- These funds are clean/renewable energy ETFs. ICLN is more broad while TAN focuses more specifically on solar energy and FAN specifically on wind generated energy. I think renewable energy companies are the future. There is no crossover in the top holdings of this fund with the top holdings of QQQ and most of the other broad market funds. Also, these are global, not just US based companies.  QCLN and PBW are also renewable energy funds, but they also contain a lot of TSLA, NIO and W.K. H.S. in their top holdings making them \"electric vehicle\" funds, as well.  No problem if you want to add that, but you'll find a lot of Tesla in some of the funds mentioned above.\n\n**ARK** group of funds: **ARKG**, **ARKF**, **ARKK ARKW**, **ARKQ**, **PRNT** and **IZRL**. These are managed funds investing in companies that invest in disruptive companies in their respective industries. Most posters on this subreddit are bullish on these funds. They are aggressive growth ETFs, but should be considered somewhat risky and volatile.\n\n* ARKG - Genomic Revolution\n* ARKF - Fintech\n* ARKK - Disruptive Companies (broader market)\n* ARKW - Internet/computer/technology  (Telsa is a top holding)\n* ARKQ - Robotics and artificial intelligence\n* PRNT - 3D printing technology\n* IZRL - disruptive companies based in Israel\n\nXL series of funds.  Similar to the ARK series, these tend to be more aggressive growth funds, however these are passively managed indexed funds with various benchmarks that usually are overloaded in the better companies within a sector:\n\n* **XLV** \\- Health Care\n* **XLK** \\- Technology\n* **XLY** \\- Consumer Discretionary\n* **XLF** \\- Financial\n* **XLU** \\- Utilities\n\n***A nice portfolio might look something like this:***\n\n20% - Broad market US fund such as QQQ, VOO or IWF\n\n20% - VXUS - International\n\n20% - IWM - Small/Mid-cap broad market fund\n\n10% each in four sector funds of your choice\n\nHope this helps.\n\n&amp;#x200B;\n\n*I'm not a financial expert or advisor and this is not financial advice, just an opinion from a random internet person.  I do own shares in several, but not all of the funds listed above, including QQQ, IWF, some ARK funds, ICLN, VXUS, etc.*\n\n&amp;#x200B;\n\n**EDIT:**  WOW! Thanks for the awards and the positive comments.  I appreciate the feedback.  I hope this advice really helps some people.",
        "created_utc": 1600359568,
        "id": "g5llmdf",
        "score": 417,
        "subreddit": "stocks",
        "created": 1600388368.0
    },
    {
        "author": "WhiteWhenWrong",
        "body": "Just wait until Adobe lawsuit once the SEC finds out nkla is using a free trial of creative cloud",
        "created_utc": 1600120496,
        "id": "g5ai68j",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1600149296.0
    },
    {
        "author": "Blacksmith-Whole",
        "body": "Adobe nvda mainly",
        "created_utc": 1600665386,
        "id": "g62k0hl",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1600694186.0
    },
    {
        "author": "Drew1904",
        "body": "Yes. He was like “fuck adobe, all my homies hate adobie” and by homies he meant money.",
        "created_utc": 1600213167,
        "id": "g5f11qu",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1600241967.0
    },
    {
        "author": "dwdsquared2",
        "body": "**Events in the US Today (EDT):**\n\n* **DAY - 19th Anniversary of the Sept. 11th Attacks**\n   * **WTC, Flight 11, &amp; Flight 175**\n      * 2,753 lives lost; 343 NY Fire, 23 NY Police, 37 Port Authority\n   * **Pentagon, Flight 77:** 184 lives lost\n   * **Pennsylvania, Flight 93:** 93 lives lost\n   * **Post 9/11 Due to Resulting Illness**\n      * 1st Responders: \\~2,000 lives lost; NY Fire: 170, NY Police: 221\n   * **GWOT &amp; OCO**\n      * US Military Lives lost: At least \\~6,967; Wounded: At least \\~52,802\n   * **Op. Iraqi Freedom, Op. Inherent Resolve, Op. New Dawn**\n      * \\~62% (\\~36,885) of all related casualties\n   * **Op. Enduring Freedom, Op. Freedom’s Sentinel**\n      * \\~38% (\\~22,884) the remainder of casualties from above\n   * **If you served as a result of, or for any reason:**\n      * Please know you are loved and valued. Please use the many resources available for [PTSD](https://www.ptsd.va.gov/), [Homelessness](https://www.va.gov/homeless/), [Mental Health](https://www.mentalhealth.va.gov/), [Mental Support &amp; Harm Prevention](https://www.22kill.com/), [Employment](https://www.benefits.va.gov/vocrehab/index.asp).  r/Veterans and related subs are also available :)\n      * Reach out if you have been stuck in a rut during or since service.  **\\*You are worth helping and fighting for, I promise. You are not alone or forgotten.\\***\n      * If you know someone that has, make sure they are loved. :)\n* 8:30am - Core CPI (MoM-Aug) \\[3/3 Volatility\\]\n* 11:00am - Cleveland CPI (MoM-Aug) \\[1/3 Volatility\\]\n* 12:00pm - WASDE Report \\[2/3 Volatility\\]\n   * (United States Department of Agriculture)\n* 1:00pm - Federal Budget Balance (Aug) \\[2/3 Volatility\\]\n   * US Baker Hughes Oil &amp; Total Rig Count \\[2/3 Volatility\\]\n\n**Events in the World Today (EDT):**\n\n* 2:00am - UK GDP (MoM) \\[3/3 Volatility\\]\n   * UK Monthly GDP 3M/3M Change \\[3/3 Volatility\\]\n   * UK Manufacturing Production (MoM-Jul) \\[3/3 Volatility\\]\n   * UK Trade Balance (Jul) \\[2/3 Volatility\\]\n   * Germany CPI (MoM-Aug) \\[2/3 Volatility\\]\n* 3:00am - Spain CPI (YoY-Aug) \\[2/3 Volatility\\]\n   * Spain HICP (YoY-Aug) \\[2/3 Volatility\\]\n* 4:00am - China New Loans (Aug) \\[2/3 Volatility\\]\n* 4:50am - Euro Zone ECB's Schnabel Speaks \\[2/3 Volatility\\]\n* 5:00am - Germany Buba President Weidmann Speaks \\[2/3 Volatility\\]\n* 5:30am - Euro Zone ECB President Lagarde Speaks \\[3/3 Volatility\\]\n   * Euro Zone ECB's Mersch Speaks \\[2/3 Volatility\\]\n* 6:00am - Euro Zone Eurogroup Meetings \\[2/3 Volatility\\]\n* 8:00am - Euro Zone ECB's Lane Speaks \\[2/3 Volatility\\]\n* 9:00am - UK NIESR GDP Estimate \\[2/3 Volatility\\]\n\n**Earnings Before Open:**\n\n* Kroger\n\n**Earnings Next Week:**\n\n* Tue: Adobe, Fedex",
        "created_utc": 1599828716,
        "id": "g4thpda",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1599857516.0
    },
    {
        "author": "bluejacket57",
        "body": "I'm long-term bullish on Unity due to the potential of it being the next Adobe, AutoDesk, etc and the fact that the market is definitely a lot bigger for there to be a player outside of Epic Games (especially with most of Unity's revenue coming from ads/e-commerce rather than licensing like Epic)\n\nBut short-term, I expect this price to come down. It's extremely odd to say the least that Unity and Snowflake are rocketing up while the rest of tech is coming down...it points to the fact that growth/tech investors are parking their money here and will be shorted later. So I believe in unity long term, but I'm going to wait to jump in.",
        "created_utc": 1600458865,
        "id": "g5qhy6j",
        "score": 36,
        "subreddit": "investing",
        "created": 1600487665.0
    },
    {
        "author": "PegBundysBonBons",
        "body": "Yea, I know its overpriced.\n\nHere's the thing tho: Shit always works\n\nI had a macbook pro that lasted about 8 years of solid use. It started to act up near the end of its life but otherwise had a good track record.\n\nThen because I was cheap I replaced it with a Lenovo Thinkpad running windows. I was immediately reminded of the bullshit I used to have to deal with almost instantaneously.\n\nGo to print- must install drivers- great\n\nGet drivers installed- then it prints it out in super small script for ants\n\nCan't get the print size to change so I have to save as a pdf and install Adobe\n\nAlways a fuckin hassle working on windows I dont care what anybody says.\n\nPull out my old macbook, prints right away, no issue.",
        "created_utc": 1600185922,
        "id": "g5da4fp",
        "score": 36,
        "subreddit": "stocks",
        "created": 1600214722.0
    },
    {
        "author": "electromojo",
        "body": "Nikola dropping not good for Adobe imo",
        "created_utc": 1600117020,
        "id": "g5a98d8",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1600145820.0
    },
    {
        "author": "kush_empire",
        "body": "Adobe 🚀🚀",
        "created_utc": 1600091662,
        "id": "g58ad3d",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1600120462.0
    },
    {
        "author": "birdcity602",
        "body": "Adobe is up almost 3% after hours following earnings. RIP.",
        "created_utc": 1600203036,
        "id": "g5eg5x0",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1600231836.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Apple, Microsoft, Adobe, PayPal, Nvidia.",
        "created_utc": 1600132336,
        "id": "g5b673d",
        "score": 24,
        "subreddit": "stocks",
        "created": 1600161136.0
    },
    {
        "author": "VirtuousGallantry",
        "body": "[Barron’s covers it well](https://www.barrons.com/articles/what-is-going-on-with-the-stock-market-heres-one-answer-51599241222): \n\n“Barron’s previously reported that Softbank had started making big bets on tech stocks, including Amazon, Alphabet, and Adobe (ADBE), during the June quarter.\n\nWhether it was all SoftBank or not is moot. Bullish call-option buying has exploded. Over the past month, traders have bought almost 15 times the number of call options expiring in November of those FAANG stocks, plus Microsoft and Tesla, than the equivalent number of put options.\n\n....\n\n\nWhen call-option buying spikes, it drives call sellers to buy underlying stock, sending shares higher. When brokers sell options contracts, they don’t want to take the risk of what happens to the underlying stock. Brokers only want to earn a commission selling—and trading—the options. Often times, brokers buy underlying stock to hedge their book of business. That way, any gains or losses on options positions are offset by corresponding gains in the underlying stock prices.\n\nSo any explosion in call-option buying generates stock buying on the Street. That’s one way to explain the 20% rise of those tech stocks since July.\n\nIt’s also a way to explain the recent two day collapse. Call-option trading volume Thursday in those tech stocks was down by roughly two-thirds compared with recent highs.”",
        "created_utc": 1599244124,
        "id": "g40ro7v",
        "score": 20,
        "subreddit": "SecurityAnalysis",
        "created": 1599272924.0
    },
    {
        "author": "somanychins",
        "body": "Someone call a 🚒 because futures are gonna be 🔥🔥🔥. First really bullish close in ages, FDX and ADBE crushing, MSFT announcing they are giving out more tendies, AAPL gonna get *all* the analyst upgrades with services launches and Apple Watch Series COVID-19, and JPow soothing the market with his digital printer.",
        "created_utc": 1600206183,
        "id": "g5end3d",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1600234983.0
    },
    {
        "author": "voteronly12",
        "body": "ADBE has earnings and revenue beat, stock is down.\n\nNKLA has serious charges of fraud against it, SEC investigating it, DOJ investigating it. Stock is up\n\nStonks",
        "created_utc": 1600268383,
        "id": "g5h5xcn",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1600297183.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "NKLA would not be where they are without ADBE (Photoshop, Lightroom, Premier, etc)  \n  \n**NKLA**: Up 47%  \n**ADBE**: Down 4%",
        "created_utc": 1599586333,
        "id": "g4gkthk",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1599615133.0
    },
    {
        "author": "aaiwani",
        "body": "Clown response.... I see absolutely zero wrong with any of these selections / the mix.\n \nApple: technically it’s a consumer discretionary, technology, and future health care giant all in \none.\n\nMicrosoft:  cloud + enterprise software + gaming + LinkedIn all in one\n\nAdobe:  king of creative cloud + enterprise solutions \n\nPayPal:  Fintech \n\nNvdia:  exposure to gaming, internet of things, cloud , 5g , computer \n\nWhat’s your proposed “diversified risk mix”?",
        "created_utc": 1600138763,
        "id": "g5bhj5t",
        "score": 18,
        "subreddit": "stocks",
        "created": 1600167563.0
    },
    {
        "author": "Nawtreallyme",
        "body": "ORCL, BABA, CRM, PYPL, ADBE, NVDA, CSCO, PD, DDOG, NET, FB, AMZN, AAPL, MSFT, CLOU, AMD, FSLY, NFLX, SKYY, XLK",
        "created_utc": 1600222901,
        "id": "g5fitjz",
        "score": 17,
        "subreddit": "stocks",
        "created": 1600251701.0
    },
    {
        "author": "TastyCuttlefish",
        "body": "Apple sold its Adobe position in *1989*. The top holder of ADBE is Vanguard Group, at 7.75%, followed by Fidelity and Blackrock. It’s not that hard to research this. \n\nPTON fell because the entire market fell. It was up 12% at points. I was holding 15,000 shares of it and sold at $98.15. I was watching it and continued throughout the trading day. \n\nYour analysis is based on really false information and across the board incorrect. I don’t think you should be giving advice.",
        "created_utc": 1599969618,
        "id": "g51cm2m",
        "score": 15,
        "subreddit": "options",
        "created": 1599998418.0
    },
    {
        "author": "electromojo",
        "body": "If Nikola goes back up its bullish for Adobe",
        "created_utc": 1600077820,
        "id": "g57thhp",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1600106620.0
    },
    {
        "author": "ImitationChad",
        "body": "Dude, Apple doesn't have a 15% stake in Adobe. That was in 1983, as the article you linked yourself states. You can see institutional ownership yourself from a quick search.\n\nIt's hilarious how you talk about this in your video, \"by doing a quick Internet search, by taking the extra time, by not being lazy and figuring this out\", but you quote an irrelevant fact about Adobe when it was founded 40 years ago.",
        "created_utc": 1599965984,
        "id": "g513sll",
        "score": 14,
        "subreddit": "options",
        "created": 1599994784.0
    },
    {
        "author": "Summebride",
        "body": "It's frustrating to see this.  Snowflake is losing a million dollars per day, and, according to 99% of the data experts I talk to, it's a mediocre product that's not really needed.  The company badly fails a rule of 40 test.\n\nYet I can also tell that rabid buyers will buy and bid this.  Do I put my brain in park and step in for some some ill gotten pump gains?  Or respect logic and stay away?\n\nWhat sucks too is that ADBE reports Tuesday, and I could see people taking money *out* of that true juggernaught Adobe to put it into the cash burning furnace that is Snowflake.",
        "created_utc": 1600038981,
        "id": "g56e9at",
        "score": 14,
        "subreddit": "stocks",
        "created": 1600067781.0
    },
    {
        "author": "MrOaiki",
        "body": "Imagine if TikTok becomes to Oracle what Photoshop became to Adobe. Adobe was a company of declining revenue from PDF licenses and nobody cared about them. They tried several things and then all of a sudden Photoshop becomes a hit.\n\nEdit: It was PostScript rather than PDF. PostScript &gt; Photoshop &gt; PDF.",
        "created_utc": 1600064480,
        "id": "g57hjov",
        "score": 14,
        "subreddit": "stocks",
        "created": 1600093280.0
    },
    {
        "author": "color_shot",
        "body": "Wait until 10:00EST 9/04 to see if the sell off continues. If not, buy 5 OTM Adobe calls for 09/11, make sure they are around 1000$ each. Sell some time before expiration. If the price of adobe goes anywhere past 526-536, increasing as next week progresses, sell immediately. This is your resistance. Adobe earnings are at 9/15. Don't gamble on earnings, play to scalp FOMO traders. Also Sell if you have a negative day past .50% and watch Nvidia instead, or simply wait for the dip to bottom.\n\n  Adobe has consistent growth and is a brand name tech stock. It also almost never has headlines that screw up technicals. Their CEO a few weeks ago said on CNBC that their income has increased because of Covid. Be very careful about today's panic, and good luck.",
        "created_utc": 1599172515,
        "id": "g3wxony",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1599201315.0
    },
    {
        "author": "walletsr",
        "body": "Am I missing something, I don't see apple as a large shareholder https://money.cnn.com/quote/shareholders/shareholders.html?symb=ADBE&amp;subView=institutional",
        "created_utc": 1599961718,
        "id": "g50q7jz",
        "score": 13,
        "subreddit": "options",
        "created": 1599990518.0
    },
    {
        "author": "davhngo",
        "body": "Apple owns 20% of Adobe.  Adobe earnings should be good tomorrow so that should be good for APPL",
        "created_utc": 1600089507,
        "id": "g586wpa",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1600118307.0
    },
    {
        "author": "Furankuri",
        "body": "FedEx and Adobe are going to kill it!",
        "created_utc": 1600092806,
        "id": "g58cfaa",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1600121606.0
    },
    {
        "author": "Ballroo",
        "body": "Read his other comments, he is just a lousy person, don’t take it to heart. Gatekeeping grape sucker. Some people don’t like people asking where to YOLO their money as if this sub wasn’t literally called “WallStreetBets”. \n\nMy advice (which is shit) buy a couple mild LEAPS on one of these tech dips. Or $ADBE October call(s) one point in the money. \n\nAlso I wouldn’t want to risk talking shit behind someone’s back so—fuck you u/OswaldPatterson1 quit hiding behind a faux mean persona. Shit is not funny and totally not nice.",
        "created_utc": 1600083202,
        "id": "g57ymfj",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1600112002.0
    },
    {
        "author": "HatchCannon",
        "body": "Physical media is nice for the following reasons:\n\nFirst, 20 years down the line,you can pop in the disc in and play it. With downloaded, if the drive fails and you are outside of that supported systems life its too bad for you. Take care of your stuff, as you would with anything else, and it will be fine.\n\nSecond, you are dependent on that service to obtain games, as soon as it goes away, you have to repurchase it on whatever the new manner is. I have already, within my lifetime, seen numerous digital services go out of service or move to a new platform where you are told to pound sand on previous purchases, same will be the case for your game. 70 now, 30 on the next platform, 10 on the next one when they bring it back as some \"retro\" feature so you can buy it a third time. \n\nthird, no inherent value to it. Now you are buying a game that is 60+ dollars, they can remove from your system if they want, the console can fail like with above, if they no longer support it its too bad for you. I have had older console games appreciate substantially from the nostalgia alone and that is gone now.\n\n&amp;#x200B;\n\nOptical media sucks but I think it should be a staple of gaming, once they fully move off optical media its really going to sting. Can't wait for them to move to a pay per month service just to have the console (not to just play online) kind of like Adobe did with their product line or Microsoft with office suite /s. Won't support em.",
        "created_utc": 1600379944,
        "id": "g5n11hq",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1600408744.0
    },
    {
        "author": "arichnader",
        "body": "Fucking Boeing you're useless\n\nAlso I played adobe instead of fedex...",
        "created_utc": 1600203807,
        "id": "g5ei0uz",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600232607.0
    },
    {
        "author": "electromojo",
        "body": "This NKLA pump is bullish for Adobe",
        "created_utc": 1600083106,
        "id": "g57yil7",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600111906.0
    },
    {
        "author": "YungKiyan",
        "body": "Yeah, I'm tempted to buy ADBE, PYPL, SQ and some others because of these 5-10% dips, but they're just like at the same levels where they were like 2-3 weeks ago",
        "created_utc": 1599233607,
        "id": "g3zw8x9",
        "score": 11,
        "subreddit": "stocks",
        "created": 1599262407.0
    },
    {
        "author": "swaggymedia",
        "body": "Todays WSB Sentiment, Presented by Swaggy\n\nTotal Comments Parsed Last 24hrs: 40,155\n\nTicker | Comments | Bullish %\n:--|:--:|:--:\nAAPL|3334|81%\nTSLA|3026|83%\nNKLA|1502|47%\nFDX|518|84%\nPTON|344|67%\nAMZN|293|79%\nAMD|229|86%\nFB|196|76%\nNVDA|183|75%\nGM|178|45%\nDKNG|150|65%\nADBE|134|89%\nUPS|127|91%\nTSM|125|84%\nMSFT|118|91%\nWMT|115|82%\nQQQ|110|68%\nSLV|108|89%\nRKT|104|72%\nSQ|101|90%\nGLD|90|68%\nZM|84|40%\nNIO|81|96%\nSAVE|73|68%\nORCL|67|64%",
        "created_utc": 1600203005,
        "id": "g5eg34u",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600231805.0
    },
    {
        "author": "abaggins",
        "body": "ADOBE and FedEx release earnings after hours tuesday. Thoughts on movement?",
        "created_utc": 1600087778,
        "id": "g584c83",
        "score": 10,
        "subreddit": "stocks",
        "created": 1600116578.0
    },
    {
        "author": "rollickinggoodtime",
        "body": "Your Brittanica article makes reference to Apple threatening to sell its stake in Adobe in 1989, consistent with this [NYT article](https://www.nytimes.com/1989/07/07/business/apple-selling-adobe-stake-two-could-become-rivals.html), but I don't see anywhere that they ever effectuated that sale. Nevertheless, I think they must have, because the largest shareholders of ADBE are now Vanguard, Fidelity, Blackrock, SSGA, etc.",
        "created_utc": 1599965718,
        "id": "g5133ww",
        "score": 8,
        "subreddit": "options",
        "created": 1599994518.0
    },
    {
        "author": "18845683",
        "body": "earnings are tomorrow afternoon bud\n\nIt's also already sold off a parabolic run last few weeks which was based on nothing, it could go higher on good earnings.\n\nThis market loves tech monopolists posting good earnings, which is what Adobe is",
        "created_utc": 1600116766,
        "id": "g5a8izh",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600145566.0
    },
    {
        "author": "moaimaea",
        "body": "Adobe up 3% after hours and earnings",
        "created_utc": 1600209510,
        "id": "g5eudst",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600238310.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "@nikolatrevor  \n*I've been more quiet lately but it's because I've been slammed working with zero extra minutes these last few days. Some weeks are like that due to workload and deals! I'll update soon and I'm Proud of all you supporting Nikola.*  \n  \nMaking full use of that Adobe subscription...",
        "created_utc": 1599070900,
        "id": "g3qznms",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599099700.0
    },
    {
        "author": "bigkev2569",
        "body": "Get on the Adobe train before it’s too late",
        "created_utc": 1599001746,
        "id": "g3nkkqi",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599030546.0
    },
    {
        "author": "MoDanMitsDI",
        "body": "Anyone playing ADBE?",
        "created_utc": 1599028891,
        "id": "g3ov8ww",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599057691.0
    },
    {
        "author": "Nobody07011",
        "body": "Calls on Apple. Tesla , Adobe ,, at open",
        "created_utc": 1600600954,
        "id": "g5yp0tu",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600629754.0
    },
    {
        "author": "anachronofspace",
        "body": "ADBE",
        "created_utc": 1599961471,
        "id": "g50phwd",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599990271.0
    },
    {
        "author": "atlfirsttimer",
        "body": "Damn, you must have bought at the top lol. Adobe got fucked over by the tech crash",
        "created_utc": 1600096037,
        "id": "g58kczj",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600124837.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "Fuckin everyone is, why do people always comment this shit\n\n\nLiterally all last week was FDX FDX FDX FDX ADBE ADBE FDX\n\n\nif it’s a big company with earnings, we’re all talking about it.",
        "created_utc": 1600030549,
        "id": "g55tqm4",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600059349.0
    },
    {
        "author": "tsla-too-low-imo",
        "body": "Just deployed 150k on AMZN, MELI, SHOP, ADBE, TTD, and WORK today. All March 2021 expiration. $$$$",
        "created_utc": 1599160871,
        "id": "g3w0ogc",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599189671.0
    },
    {
        "author": "toasted_t_rav",
        "body": "I will never buy another low volume option. Fuck ADBE",
        "created_utc": 1599663576,
        "id": "g4jvdkz",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599692376.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "How to fix your **Nikola Badger**:  \n  \nStep 1: Add A New Blank Layer.  \nStep 2: Select The Spot Healing Brush.  \nStep 3: Select The \"Sample All Layers\" Option.  \nStep 4: Select \"Content-Aware\"  \nStep 5: Click On The Blemishes To Heal Them  \n  \nWarning: Your insurance might not cover the cost of your Adobe Creative Cloud subscription.",
        "created_utc": 1599611332,
        "id": "g4hykvz",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599640132.0
    },
    {
        "author": "obi1013",
        "body": "bro i sold at the bottom, im so retarded... i bought back in on the tiny pump and my pp is tiny. God i love this game but i fucking suck... im just gonna buy adobe long calls on the next dip and go play fortnite",
        "created_utc": 1599757990,
        "id": "g4pkt6w",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599786790.0
    },
    {
        "author": "captainlvsac",
        "body": "Adobe crushed earnings, that means that the stock is going to tank now, right?",
        "created_utc": 1600201291,
        "id": "g5ec0sn",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600230091.0
    },
    {
        "author": "BeernerdoMazzeroli",
        "body": "$ADBE crushes earnings and gets mauled. Buffet meme stock goes up 150%. \n\nFuck this market. Fuck Warrem bufett.",
        "created_utc": 1600276401,
        "id": "g5hmc21",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600305201.0
    },
    {
        "author": "toeofcamell",
        "body": "Adobe and FedEx look like they have time and room to run before earnings \n\nWhat say you?",
        "created_utc": 1598998302,
        "id": "g3ndijc",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599027102.0
    },
    {
        "author": "EatsRats",
        "body": "I like Adobe. Gotta sell before earnings though, man. I've been burned too many times with tech earnings. woof.",
        "created_utc": 1598999069,
        "id": "g3nf7gt",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599027869.0
    },
    {
        "author": "evenkeel08",
        "body": "Thoughts on Adobe earnings next week?",
        "created_utc": 1598979452,
        "id": "g3lzxe3",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599008252.0
    },
    {
        "author": "ArcaneElementz",
        "body": "Think I'm down about 70% rn. Was down 50% at close. Not opening my portfolio because if I can't see the numbers they aren't there. \n\nAapl 137.5 9/11 went from +100% to -50 in 2 days but DiAmOnD HanDs so I didn't sell yesterday (this also applies to the following)\n\nADBE 550 9/18 dead\n\nPTON 100 9/18 dead\n\nAMD 90 9/11 extra dead\n\nINTC 50c 1/15 leaps is the only shit floating in my sea of red.\n\nBecause fuck portfolio diversity amirite\n\nIf there isn't a recovery on Tuesday ill be surprised though. Because clearly my intention is impeccable",
        "created_utc": 1599175299,
        "id": "g3x5v1b",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599204099.0
    },
    {
        "author": "acoupleoftravels",
        "body": "For every 100 million Tesla trades in this sub, someone else trades adobe or something",
        "created_utc": 1600637125,
        "id": "g615siz",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600665925.0
    },
    {
        "author": "GeneralKibbles",
        "body": "I took up positions in both FDX and Adobe a few weeks ago. Both are barely breaking even. Should I hold through ?",
        "created_utc": 1600095355,
        "id": "g58imm8",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600124155.0
    },
    {
        "author": "yahyeetohmygod",
        "body": "Nkla may run with Adobe tommorow",
        "created_utc": 1600217074,
        "id": "g5f83ii",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600245874.0
    },
    {
        "author": "fuddermuffin777",
        "body": "APPLE, FEDEX, ADOBE\n\nALL IN BITCHES\n\nGIVE ME TENDIES OR GIVE ME FOOD STAMPS",
        "created_utc": 1600105791,
        "id": "g59b10x",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600134591.0
    },
    {
        "author": "freethinker1111",
        "body": "Wish me luck in Adobe calls",
        "created_utc": 1600199750,
        "id": "g5e81gw",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600228550.0
    },
    {
        "author": "iseebrucewillis",
        "body": "ADBE, FDX will pump tech and SPY",
        "created_utc": 1600200579,
        "id": "g5ea5f2",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600229379.0
    },
    {
        "author": "noentic",
        "body": "Today's Market and Options Summary - \n\n## Daily Synopsis \n\n* The S&amp;P 500 declined 0.5% on Wednesday due to weakness in the mega-cap stocks, while the Fed signaled rates will remain near zero through 2023 as inflation is expected to remain muted. \n* The S&amp;P 500 rose to session highs (+0.8%) following the statement, but then turned negative during Fed Chair Powell's press conference. Some criticized the Fed chair for not clearly explaining his thinking on future monetary policy, but one shouldn't attribute the intraday weakness to Mr. Powell.\n* Mega-cap stocks were weak all day.\n* Shares of Facebook (FB 263.52, -8.90, -3.3%) fell 3% amid reports that the FTC is preparing a possible antitrust suit against the company. Adobe (ADBE 476.00, -21.67, -4.4%) fell 4% despite beating top and bottom-line quarterly estimates.\n* Snowflake (SNOW 253.93, +133.93, +111.6%) surged 100% in the largest software IPO in history..\n* President Trump tweeted that Republicans should \"go for the much higher numbers\" on stimulus. \n\nLooking ahead, investors will receive weekly Initial and Continuing claims, Housing Starts and Building Permits for August, and the Philadelphia Fed Index for September on Thursday.\n\n## Index Summary\n\n**S&amp;P 500 :** (-0.4%);  **NasDaq :** (-1.67%);  \n**Russell 2000 :**(+0.95%);  **Dow :**(+0.16%);  \n**Vix :**25.59 (+1.76%); \\[-9.61%\\]; {-1.99%}\n\n## Sector Summary -\n\n*Three highest sectors for today were -*  \n**Energy:** (+4.01%); **Financials:** (+1.13%); **Industrials:** (+1.02%)  \n*Three lowest sectors for today were -*  \n**Information Technology:** (-1.54%); **Communication Services:** (-1.08%); **Consumer Discretionary:** (-0.56%)  \n\n\n## Commodities/Futures\n\n(1-day %), \\[5-day %\\], {10-day %}\n\n***Currency -***  \n**USD Index :**93.085 (+0.06%); \\[-0.19%\\]; {+0.45%}  \n**BC :**11015 (+0.41%); \\[+6.96%\\]; {+4.14%}\n\n***Precious Metals -***  \n**Gold :**1970.5 (-0.2%); \\[+1.49%\\]; {+2.22%}  \n**Silver :**27.476 (-0.53%); \\[+2.21%\\]; {+2.82%}\n\n***Farming -***  \n**Soybeans :**1011.25 (+0.02%); \\[+0.6%\\]; {+4.33%}  \n**Corn :**371.75 (0.0%); \\[+1.85%\\]; {+7.06%}  \n**Coffee :**121.8 (-1.77%); \\[-10.27%\\]; {-11.24%}\n\n***Industrials -***  \n**Crude :**40.16 (+0.25%); \\[+7.85%\\]; {+1.23%}  \n**Nat Gas :**2.267 (-0.49%); \\[-0.57%\\]; {-12.83%}  \n**Copper :**3.061 (+0.25%); \\[+1.14%\\]; {+0.72%}\n\n## Options Fast Facts\n\n***CBOE Put/Call Ratio - 0.51***  \n***Highest Multiple Over Daily Average -*** ARWR with 19x the ADV of 1326. There were 18262 calls and 6510 puts.  \n***Ticker with Most Contracts -***GE with 695598 contracts traded today with an AVD of 155091. There were 547849 calls and 147749 puts.  \n***Largest Put / Call Ratio -*** MAT with a 8 P/C ratio. There were 13155puts and 1558 calls.  \n***Largest Call / Put Ratio -*** BKLN with a188 C/P ratio. There were 11266 calls and 60 puts.  \n\n\n\\*Stocks must be &gt;$6, Highest Multiple must have &gt;1k ADV, Largest ratios must have an option volume &gt;10k",
        "created_utc": 1600300868,
        "id": "g5j2jbz",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600329668.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "Insane how sell-side equity analysts do almost no DD. \n\nAdobe literally showed with hard data (released 9/2) that e-commerce sales are dropping and they’re out here raising price targets as if the whole reason these stocks were up wasn’t because there was a belief that growth would be sustained. \n\nOr how NVDA’s PT was being raised to $700 on the ARM deal when NVDA is diluting stock to pay for the deal. Apparently it was too hard to do maths on that one.",
        "created_utc": 1600470828,
        "id": "g5r7htl",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600499628.0
    },
    {
        "author": "Lovetrading99",
        "body": "Congrats to all ADOBE and FedEx people!! and Tesla today for sure!!! 💚🚀",
        "created_utc": 1600200353,
        "id": "g5e9m3c",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600229153.0
    },
    {
        "author": "evenkeel08",
        "body": "Buy into Adobe for earnings next week?",
        "created_utc": 1599000336,
        "id": "g3nhkvy",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599029136.0
    },
    {
        "author": "hutch281",
        "body": "What are some stocks that will have an earnings run up? I’ve got adobe and Carmax call options right now.",
        "created_utc": 1599095063,
        "id": "g3skpjg",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599123863.0
    },
    {
        "author": "cjokeefe",
        "body": "Adobe sounds like a good one",
        "created_utc": 1599097911,
        "id": "g3sq4j2",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599126711.0
    },
    {
        "author": "Furankuri",
        "body": "Adobe got another price increased. Earning is going to be lit! \n\n$500 9/18 free tendies",
        "created_utc": 1599854009,
        "id": "g4uvx5y",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599882809.0
    },
    {
        "author": "Furankuri",
        "body": "Now that people are scared and not pay attention to upcoming earning plays, take advantage and set up your position.\n\nFedEx, chewy, pton, Adobe.",
        "created_utc": 1599236781,
        "id": "g405d87",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599265581.0
    },
    {
        "author": "Lovetrading99",
        "body": "Adobe 550$ eod! you heard it here first!! :)",
        "created_utc": 1600183364,
        "id": "g5d3whk",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600212164.0
    },
    {
        "author": "GromGrommeta",
        "body": "&gt;potential of it being the next Adobe\n\nI believe that's the promise of Unity. It's well-established in gaming, and sure that'll continue. But the promise is that they will become a software juggernaut serving a multitude of industries.\n\nTo quote the company's website, its software has applications to \"Animation, Film, Automotive, Transportation, Architecture, Engineering, Manufacturing &amp; Construction.\"\n\nThat's a pretty large TAM right there if they can establish themselves as a major player in just a few of those industries.\n\nTook a small position, will wait for dips/consolidation before considering making it bigger. I also don't think it's a bad idea to wait for them to really get a foothold in some of these areas of lateral expansion before buying (even if by then it's at a higher price).",
        "created_utc": 1600459893,
        "id": "g5qkbqj",
        "score": 5,
        "subreddit": "investing",
        "created": 1600488693.0
    },
    {
        "author": "solidmussel",
        "body": "Amzn tracks retail sales as revenue so its p/s being lower makes sense to me.  WMT for example has a P/S of less than 1, and that's because retail is low margin.\n\nSHOP is more a subscription service so I do believe it also needs to be compared to stocks like Adobe, the portion of Amazon's valuation that is attributed to cloud (which is valued around 15 P/S) or salesforce.",
        "created_utc": 1600464485,
        "id": "g5qul6d",
        "score": 5,
        "subreddit": "investing",
        "created": 1600493285.0
    },
    {
        "author": "xxxsur",
        "body": "Adobe might have increased revenue due to WFH. But in the long term it is a company waiting to die given its so many sectors being eroded/eaten up by alternatives.",
        "created_utc": 1600098786,
        "id": "g58rsw5",
        "score": 5,
        "subreddit": "stocks",
        "created": 1600127586.0
    },
    {
        "author": "5kevin",
        "body": "Adobe fedex calls nkla puts and do a draftking weekly your welcome",
        "created_utc": 1600091743,
        "id": "g58ai1a",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600120543.0
    },
    {
        "author": "sweatyturds",
        "body": "Fellow FDX and ADBE fd holders how we feeling?",
        "created_utc": 1600114345,
        "id": "g5a0ug3",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600143145.0
    },
    {
        "author": "MarketOracle",
        "body": "When Adobe reports after hours, investors will remember again that tech is dominant.",
        "created_utc": 1600198606,
        "id": "g5e52vy",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600227406.0
    },
    {
        "author": "PutsTookMyMoney",
        "body": "Everyone has ADBE calls and FedEx calls",
        "created_utc": 1600200122,
        "id": "g5e90sp",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600228922.0
    },
    {
        "author": "Myusernamegoesup",
        "body": "ADBE will beat and drop.",
        "created_utc": 1600199783,
        "id": "g5e84hr",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600228583.0
    },
    {
        "author": "somanychins",
        "body": "At some point it’s going to register that AAPL market cap swung down $135B intraday. That’s not like “oh shucks.” If there’s that kind of uncertainty in the value of one of the most well characterized and followed stonks on earth, what could happen to CRM? ADBE? PTON? Anything with a multiple over 30.... \n\nYou should be afraid",
        "created_utc": 1599112421,
        "id": "g3tcw7u",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599141221.0
    },
    {
        "author": "cutiesarustimes2",
        "body": "If you're looking realistically at DocuSign what's preventing say Adobe from integrating in a similar service for free to get people in as a loss leader?\n\nI know they already have their esign process but how is  docu not a 2020 pets.com.",
        "created_utc": 1599158689,
        "id": "g3vumnd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599187489.0
    },
    {
        "author": "OppaGamerStyle",
        "body": "i've been using pirated adobe suite since 09\n\nalso that bid-ask is wider than the bears' assholes on march 23rd\n\nno thanks",
        "created_utc": 1599696059,
        "id": "g4lood1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599724859.0
    },
    {
        "author": "Kramnet",
        "body": "Adbe/fdx/tsla calls 9/18\n\n\nI NEED THIS PLZZZZZZZ",
        "created_utc": 1599854501,
        "id": "g4ux4f9",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599883301.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "ADBE gonna run tomorrow. Don’t forget they got earnings and got unnecessarily beat up with the tech correction",
        "created_utc": 1600071438,
        "id": "g57o7et",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600100238.0
    },
    {
        "author": "infinitelimits00",
        "body": "The hedges are pretty much done being unwound. Apple skew looks more normal now. All the stay at home stocks got bid up into the close (Zoom, Docusign, Adobe, ZS). That's bullish actually.\n\nThe only stock with a messed up skew is still Tesla and that's for a different post. Tesla as a result is probably the best long in general.",
        "created_utc": 1600467039,
        "id": "g5r07zq",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600495839.0
    },
    {
        "author": "somanychins",
        "body": "The hourly chart is more bullish than 🍉. QQQ heading to ATH ASAP. JPow gonna fuck yo puts, AAPL gonna fuck yo wife, FDX gonna deliver overnight, and ADBE gonna photoshop the economy.",
        "created_utc": 1600236529,
        "id": "g5g3xav",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600265329.0
    },
    {
        "author": "callsnputsallday",
        "body": "wth Adobe lmao. I look down $507, grab my Dunkin’ coffee and boom 502 in a blink. Lmaooo",
        "created_utc": 1600262629,
        "id": "g5gviib",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600291429.0
    },
    {
        "author": "dreamchaser90",
        "body": "If DOCU explodes on Earnings, I'm thinking ADBE will follow",
        "created_utc": 1598979441,
        "id": "g3lzw6b",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599008241.0
    },
    {
        "author": "JabootieeIsGroovy",
        "body": "good tech dip buys? i’m thinkin googl, nvda, adobe, and amzn",
        "created_utc": 1599238886,
        "id": "g40bhs6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599267686.0
    },
    {
        "author": "CreepyJaypes",
        "body": "Adobe needs to chill",
        "created_utc": 1599747138,
        "id": "g4okiy3",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599775938.0
    },
    {
        "author": "technocrat_landlord",
        "body": "I'm skeptical about Adobe and curious about NVidia\n\nAdobe has already capitalized on moving to the recurring revenue model, so what's the next thing that will help drive growth for them? It seems like the best days for the stock were in the last 5 years as they transitioned to the rundle model. Like how much larger is their addressable market? How much can they really grow revenues moving forward to justify current valuation?\n\nNvidia I'm more bullshit, if a bit hesitant on given their recent massive run, I'd like to know why you like them so much",
        "created_utc": 1600055360,
        "id": "g5761wj",
        "score": 4,
        "subreddit": "investing",
        "created": 1600084160.0
    },
    {
        "author": "Daosim",
        "body": "Adobe gonna beat earnings for sure",
        "created_utc": 1600099434,
        "id": "g58th7s",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600128234.0
    },
    {
        "author": "IVCrushingUrTendies",
        "body": "Of FAANGM, FB, AMZN, NFLX, GOOGL, MSFT all broke 50 dMA and are making lower lows heading for 200. AAPL is the only one hanging on. TSLA NVDA ADBE and a couple others are the only components propping up NDX from a blowout",
        "created_utc": 1600371407,
        "id": "g5meqw9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600400207.0
    },
    {
        "author": "BeernerdoMazzeroli",
        "body": "I'm holding AMD LEAP options. Just waiting for a confirmation of continuing bull market before I jump in on NVDA, will probably hold off until they reach new highs. It's an easy play, the growth is exceptional in both these companies. AMD has an EPS growth rate of 159% and NVDA 38%. These stonks aren't overvalued.\n\nLong $AMD\n\nLong $ADBE\n\nLong $PYPL\n\nLong $TSM\n\nLong $MSFT\n\n\nShort $SLV\n\nShort $SCS\n\nShort\t$NNOX",
        "created_utc": 1600242007,
        "id": "g5g9ksg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600270807.0
    },
    {
        "author": "prplput",
        "body": "Adobe is truly an example of what a scam subscription software is and how much that’s contributed to tech valuations in last 10 years\n\nthey use to sell Photoshop outright for like $60 or whatever \n\nnow you have to pay $21 a month forever \n\nwhat a hilarious scam we’ve all bought into 😆\n\nsame goes for Microsoft",
        "created_utc": 1600201664,
        "id": "g5ecxto",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600230464.0
    },
    {
        "author": "Buildingdetroit",
        "body": "Thoughts on today? Theta for most of the market.  \n\n$TSLA to 450, then it slips into Theta. Would take pure retard retail to get to 500 today. But 500 is defiantly still on the table. The investor/tute/algo money will get it to 450. The rest up to the Knights of Elon.  \n\n$AAPL. Retail pile in for the event. Hold. If Canoo deal announced. Valhalla will come real. I will allow another 10 bear wives to join me.  \n\nER: Runup to $COST, keep and eye on $ADBE  \n\nDon't expect much today and tomorrow. Research which companies will go up and down for quad witching on Friday. Option Sweeps have been my friend lately. Remember VIX/VXX does not always mean we go down.",
        "created_utc": 1600168024,
        "id": "g5cekf9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600196824.0
    },
    {
        "author": "Summebride",
        "body": "I think Adobe continues to have no competition and has actually benefited from pandemic.  \n\nThe con is that they have apparently transitioned 90% to subscription, which of course is less exciting than when they were just beginning that transition.  Is their high P/E as justifiable now that a lot of that growth transition has been achieved?\n\nIt's a worry that can solve itself if the earnings denominator shoots up.  \n\nBut if not, fickle investors could decide to take profits.  I did, high 300's, just before COVID, hoping to rebuy it lower, like under $300.  Missed my chance so I had to rebuy in the $400's, current exit target of $600.  I also have a long shot hope of it, and/or Google doing a split.\n\nThe counter is that as Adobe has owned the creative and content and document clouds, they are starting to dip into ecommerce.  If that shows promise, it could attract more longs.",
        "created_utc": 1600121475,
        "id": "g5akpa7",
        "score": 4,
        "subreddit": "stocks",
        "created": 1600150275.0
    },
    {
        "author": "infinitelimits00",
        "body": "ADBE with an underrated earnings report next week. They are in that second tier with names like CRM but they can help tech like CRM’s earnings did.",
        "created_utc": 1599888057,
        "id": "g4wk2sr",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599916857.0
    },
    {
        "author": "angelus97",
        "body": "ADBE since March of 2017.\n\nSQ was April of 2017.\n\nI also bought AMZN in July of 2017 at $960 per share.\n\nSo it hasn't been THAT long, but the returns on these 3 have been incredible for me. I believe they are my longest holdings.",
        "created_utc": 1599790537,
        "id": "g4s7rff",
        "score": 4,
        "subreddit": "stocks",
        "created": 1599819337.0
    },
    {
        "author": "cnarberry",
        "body": "Thanks for the extended calendar   [/u/isitarockoramineral](https://www.reddit.com/u/isitarockoramineral/) !\n\nWhats the WSB consensus for &amp;ADBE ? Adobe ER Sept 15 AMC",
        "created_utc": 1598992243,
        "id": "g3mz2nv",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599021043.0
    },
    {
        "author": "HarveyZoolander",
        "body": "Sold my PTON, CRWD, and CLDR calls at open bought TSLA calls and doubled down on SFIX calls. Holding COST, ADBE calls.",
        "created_utc": 1599062518,
        "id": "g3qe6ra",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599091318.0
    },
    {
        "author": "jonny2shoez",
        "body": "CRM, DOCU, ADBE, WORK, CRWD, CHWY, WDAY, SQ, TSLA, RKT\n\nLet’s fucking gooooo",
        "created_utc": 1598982323,
        "id": "g3m7zzp",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599011123.0
    },
    {
        "author": "ouchPotato",
        "body": "ADBE calls.  Sell half day of earnings before the bell.  Cannot go tits up.\n\nEdit: just re-read.  You only have $1,000.  You need a fucking job Jesus Christ what is with all the broke asses in wsb lately.",
        "created_utc": 1599014246,
        "id": "g3oankt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599043046.0
    },
    {
        "author": "bigkev2569",
        "body": "Get on the Adobe train before it’s too late",
        "created_utc": 1599001746,
        "id": "g3nkkqi",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599030546.0
    },
    {
        "author": "toeofcamell",
        "body": "Adobe and FedEx look like they have time and room to run before earnings \n\nWhat say you?",
        "created_utc": 1598998302,
        "id": "g3ndijc",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599027102.0
    },
    {
        "author": "EatsRats",
        "body": "I like Adobe. Gotta sell before earnings though, man. I've been burned too many times with tech earnings. woof.",
        "created_utc": 1598999069,
        "id": "g3nf7gt",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599027869.0
    },
    {
        "author": "evenkeel08",
        "body": "Thoughts on Adobe earnings next week?",
        "created_utc": 1598979452,
        "id": "g3lzxe3",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599008252.0
    },
    {
        "author": "evenkeel08",
        "body": "Buy into Adobe for earnings next week?",
        "created_utc": 1599000336,
        "id": "g3nhkvy",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599029136.0
    },
    {
        "author": "dreamchaser90",
        "body": "If DOCU explodes on Earnings, I'm thinking ADBE will follow",
        "created_utc": 1598979441,
        "id": "g3lzw6b",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599008241.0
    },
    {
        "author": "cnarberry",
        "body": "Thanks for the extended calendar   [/u/isitarockoramineral](https://www.reddit.com/u/isitarockoramineral/) !\n\nWhats the WSB consensus for &amp;ADBE ? Adobe ER Sept 15 AMC",
        "created_utc": 1598992243,
        "id": "g3mz2nv",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599021043.0
    },
    {
        "author": "jonny2shoez",
        "body": "CRM, DOCU, ADBE, WORK, CRWD, CHWY, WDAY, SQ, TSLA, RKT\n\nLet’s fucking gooooo",
        "created_utc": 1598982323,
        "id": "g3m7zzp",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599011123.0
    },
    {
        "author": "NYMets18",
        "body": "FDX and ADBE",
        "created_utc": 1598998045,
        "id": "g3ncupw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599026845.0
    },
    {
        "author": "pk3maross",
        "body": "Adobe pe is only 69 we’ll take that to ZM levels",
        "created_utc": 1598998931,
        "id": "g3nexx3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599027731.0
    },
    {
        "author": "AnonZeit",
        "body": "Its all hype, adobe e signature software is more widely used",
        "created_utc": 1599000427,
        "id": "g3nhqzy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599029227.0
    },
    {
        "author": "gibmekarmababe",
        "body": "Aight, who here thinks ADBE will go above 600 on earnings?",
        "created_utc": 1598976405,
        "id": "g3lr9ha",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599005205.0
    },
    {
        "author": "Shaolin718",
        "body": "Fedex and adobe two weeks from today",
        "created_utc": 1598988872,
        "id": "g3mpr4d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599017672.0
    },
    {
        "author": "ali142",
        "body": "Adobe gang where we at? Earnings run up going to be good",
        "created_utc": 1598990586,
        "id": "g3muiff",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599019386.0
    },
    {
        "author": "ourobboros",
        "body": "What are your thoughts on Adobe?",
        "created_utc": 1598996152,
        "id": "g3n8szi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599024952.0
    },
    {
        "author": "UrbanOutfisters",
        "body": "ADBE is just an unstoppable train",
        "created_utc": 1598969707,
        "id": "g3l9hll",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598998507.0
    },
    {
        "author": "MrRapCap",
        "body": "ADBE will crush earnings.",
        "created_utc": 1598976453,
        "id": "g3lre06",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599005253.0
    },
    {
        "author": "ali142",
        "body": "Sell that get adobe",
        "created_utc": 1598979122,
        "id": "g3lyxtz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599007922.0
    },
    {
        "author": "RealmHatch",
        "body": "I’d always bet on Adobe 🔥",
        "created_utc": 1598970893,
        "id": "g3lcmvq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598999693.0
    },
    {
        "author": "slimkay",
        "body": "What about ADBE? Earnings in 2 weeks, and IV seems quite low (c. 50%). Worth a YOLO?",
        "created_utc": 1598970864,
        "id": "g3lckgj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598999664.0
    },
    {
        "author": "gamechump",
        "body": "Fedex had been solid run up so far. Gonna get into Adobe tomorrow",
        "created_utc": 1598989073,
        "id": "g3mq9aq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599017873.0
    },
    {
        "author": "SharksFan1",
        "body": "I agree. It amazes me Adobe or Microsoft has bought them yet.",
        "created_utc": 1598995893,
        "id": "g3n889e",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599024693.0
    },
    {
        "author": "fazawood81",
        "body": "why is ADBE Mooning?  and i read a article that it could go to $800? any real TA and thoughts why it would be so bullish?",
        "created_utc": 1599005780,
        "id": "g3ntppk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599034580.0
    },
    {
        "author": "ali142",
        "body": "Adobe will 10 bang",
        "created_utc": 1598976263,
        "id": "g3lqwsh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599005063.0
    },
    {
        "author": "gibmekarmababe",
        "body": "Yeah, i have FOMO'ed into ADBE after looking at the Zoom earnings.",
        "created_utc": 1598976764,
        "id": "g3ls91s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599005564.0
    },
    {
        "author": "Steelmax6",
        "body": "Remember I told yall ADBE was going up today for absolutely no reason at all? Up 100% on my callsss :)",
        "created_utc": 1598969216,
        "id": "g3l87gj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998016.0
    },
    {
        "author": "kaplanj23",
        "body": "LULU and ADBE into DOCU and SQ",
        "created_utc": 1598999677,
        "id": "g3ngckq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599028477.0
    },
    {
        "author": "Shaun8030",
        "body": "Bought measly  25 shares of Tsla at 475 today fomo got the best of me I am.guilty .\nPortfolio now\nApple \nMSFT \nGOOG\nAmzn \nSq \nMa \nV \nTsla \nTSM \nNvidia \nBaba \nFB \nAmd (caved as well month ago ) \nPypl \nAdbe \nVgt \nQQQ\nWcld \nXntk \nArkw \nIgv \nFdn \n\nThinking of adding NFLX as analysts have upgraded the target price . Am I missing anything",
        "created_utc": 1599001420,
        "id": "g3nju4e",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599030220.0
    },
    {
        "author": "CardiacJacc",
        "body": "Nobody has ever lost money on ADBE",
        "created_utc": 1598970182,
        "id": "g3laqbp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998982.0
    },
    {
        "author": "AccidentalBirth",
        "body": "Are we buying adobe or fedex for the 09/15 earnings date",
        "created_utc": 1598998850,
        "id": "g3nesdl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599027650.0
    },
    {
        "author": "Summebride",
        "body": "Well I've had lots of such analysis in my coverage universe, but I should just tell you often it ends up not being investable information.  \n\nEverything above about Netflix was knowable a year ago, but if you saw it and decided not to buy Netflix, you'd have missed gains.  \n\nSometimes it works out beautifully.  I recently knew of a pharma situation where one company had exclusive patent and proven therapy for peanut allergies, approvals rolling in worldwide, patients being quietly and successfully treated.  The company was backstopped by a big multinational, so the risk of BK was non-existent.  It was easy to imagine parents would certainly pay handsomely to protect their affected children against this common problem.  The stock was being heavily shorted down during pandemic but it always seemed like someday it would emerge from that or get bought.  It did, and AIMT ripped +175% on the buy-out.  But as I say, it doesn't usually work like that.  I've had similar situations where the buy-out happens closer to the shorted down cap, so having the correct thesis and taking the risk doesn't even pay off.  \n\nI guess the most macro view is more of wishful thinking: that democrat victory will then lead to a realistic infrastructure stimulus and we'll see a huge rotation out of ultra high P/E tech and into some things that have been moribund for years.  I'm already starting to swap things like Adobe and Semis for materials and oil and banks.",
        "created_utc": 1598988954,
        "id": "g3mpycp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599017754.0
    },
    {
        "author": "gibmekarmababe",
        "body": "ADBE 550$ EOW!!!",
        "created_utc": 1598990303,
        "id": "g3mtq07",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599019103.0
    },
    {
        "author": "infinitelimits00",
        "body": "DOCU needs to get it ass down tomrorow. Besides I use Adobe since I wanna be like a boomer.",
        "created_utc": 1598992996,
        "id": "g3n13n1",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1599021796.0
    }
]