[
    {
        "author": "capnwally14",
        "body": "In super simple terms:   \nA short sell means borrowing a stock in order to sell it - promising the original owner you'll pay them back the original stock at a future date. Imagine Joey thinks Company A's stock is too high at $100. If he wants to short sell the Company A's stock, he could go to a broker and borrow someone else's share (in this case he could borrow Jimmy's stock) and sell it at $100 - promising to give Jimmy back his share in the future. If Joey is right, and the stock drops to $80, then he can buy back Company A's share at $80 (and give it to Jimmy) and keep $20 for himself. If on the other hand Company A's share goes up to $120, Joey is out of luck and will have to pay $120 to give back the share to Jimmy - thereby losing $20. You can see why short selling is dangerous - in this situation, Jimmy at most could have gained $100 (if Company A's price had collapsed to zero), but at most could have lost an infinite amount of money.   \n\n\nSo what do you do if you want to bet against a company, but don't want to short sell? You might instead consider a put option. A put option is buying the right to sell a company's stock (for a premium) at a specific price (known as the strike) on a specific date\\*. So instead of short selling, maybe Joey will buy a put option that says for $1 he can buy the right to sell Company's stock for $100 in one year. If in a year the price of the stock is above $100, then the option will expire worthless - as anyone would rather sell at a higher price than at $100. If the price is below $100 in a year, then Joey will be able to exercise his option and take his earnings. Unlike selling short, now Joey is at most only losing the premium of the option, and at best earning $100.   \n\n\nA call option is the opposite of a put option. A call option is buying the right to buy a stock at a given price on a future date. For $1 Joey might be able to buy the right to buy a shares of Company A for $100 in 1 year. If the shares are above $100 in a year, he'll make money, if they're below his options will expire worthless.   \n\n\nOptions are slightly tricky in that their value is not just comprised of the difference between share price and the exercise price, but also volatility and time value. You can read more about Black Scholes which is how options are priced elsewhere. You can also read about strategies about combining patterns of options to construct more sophisticated trades (like iron condors).\n\n  \n\\* Note - European and American options are different here.",
        "created_utc": 1578115527,
        "id": "fd0990s",
        "score": 354,
        "subreddit": "investing",
        "created": 1578144327.0
    },
    {
        "author": "vishtratwork",
        "body": "Best time is years ago. Second best is now. Third best is the future. \n\nYou do not, nor does anyone else, know when the next recession will come. May be 10 years off. The recession talk has existed since the last recession, it is nothing new, and they don't know better than you.",
        "created_utc": 1578316670,
        "id": "fddlcty",
        "score": 352,
        "subreddit": "StockMarket",
        "created": 1578345470.0
    },
    {
        "author": "WallStreetBitch",
        "body": "Had he taken out $100k loan for this move, he’d be retired by now. What an idiot.",
        "created_utc": 1578764127,
        "id": "fdx0m5f",
        "score": 317,
        "subreddit": "wallstreetbets",
        "created": 1578792927.0
    },
    {
        "author": "Oscur925",
        "body": "Some intern at Homeland Security is getting a notification to look into this post right now.",
        "created_utc": 1578156860,
        "id": "fd3cbs6",
        "score": 263,
        "subreddit": "wallstreetbets",
        "created": 1578185660.0
    },
    {
        "author": "RLaG69",
        "body": "I would clap if I wasn’t so hard right now",
        "created_utc": 1578273354,
        "id": "fdcf46g",
        "score": 209,
        "subreddit": "wallstreetbets",
        "created": 1578302154.0
    },
    {
        "author": "TheWizardOfFrobozz",
        "body": "In the example you gave, there are two taxable events, both of which should be reported to the IRS:\n\n1) Receiving the free stock. This counts are ordinary income for the market value of the stock on the day you receive it.\n2) Selling the stock for a profit. This counts as a short-term or long-term capital gain (depending on how long you held it) of the amount its price increased by.\n\nFor example, suppose you received a free share of AAPL on July 30, 2019. AAPL closed at $213.04 that day, so you would report $213.04 as income. Now suppose you sold it on December 31, 2019 for $291.52. Your short-term capital gain is $291.52 - $213.04 = $78.48. Whether either of these events increases the taxes you have to pay depends on your other income, your filing status, other gains/losses, etc.\n\nI'm thinking of writing a tax primer for Robinhood users and posting it here sometime during the next few days since there seem to be so many questions.",
        "created_utc": 1578261783,
        "id": "fdbtgbm",
        "score": 187,
        "subreddit": "RobinHood",
        "created": 1578290583.0
    },
    {
        "author": "Cchel4243",
        "body": "Can’t wait for AMD to announce that their new CBD drink is going to be carried on every 737 from now on.",
        "created_utc": 1578347081,
        "id": "fdeuuww",
        "score": 187,
        "subreddit": "wallstreetbets",
        "created": 1578375881.0
    },
    {
        "author": "BayesianProtoss",
        "body": "now you see why its worth a ferrarri despite the executive average age &gt;90",
        "created_utc": 1578323488,
        "id": "fddtdr5",
        "score": 169,
        "subreddit": "wallstreetbets",
        "created": 1578352288.0
    },
    {
        "author": "Mods_sofa_king_gay",
        "body": "Trump's tweet makes sense now..\n\nhttps://twitter.com/realDonaldTrump/status/1187861209942495234?s=19",
        "created_utc": 1578154538,
        "id": "fd33zq5",
        "score": 142,
        "subreddit": "wallstreetbets",
        "created": 1578183338.0
    },
    {
        "author": "kahoks1235",
        "body": "My investment plan for the next major market decline is to invest more than I am now",
        "created_utc": 1578365820,
        "id": "fdfnk0i",
        "score": 139,
        "subreddit": "StockMarket",
        "created": 1578394620.0
    },
    {
        "author": "dunkaroojk",
        "body": "13 more houses in Detroit now. Nice",
        "created_utc": 1578959521,
        "id": "febjnpp",
        "score": 115,
        "subreddit": "wallstreetbets",
        "created": 1578988321.0
    },
    {
        "author": "TheChadUsername",
        "body": "I remember my first phone interview with Schwab to get margin approved. \n\nMe: “I’m looking for level 2 options approval, I’m trying to focus primarily on credit spreads for the coming months.”\n\nSchwab guy: “I see. Could you tell me a little more about your trading experience and what strategies you’ve focused on in the past”\n\nMe: “...Well I focus mostly on blue chips. Medium to long term expiry usually at the money. My strategy lies in trying to determine when IV is the lowest so I can get in before I feel a run up blah blah blah technical shit flexing that I know more than a 4th grader about options”\n\nSchwab: “uh huh......well as of now in your cash account I see a long history of very short dated call and puts options on SPY”\n\nMe:  “Oh...yeah I did that too”",
        "created_utc": 1578089325,
        "id": "fcyxmfx",
        "score": 106,
        "subreddit": "wallstreetbets",
        "created": 1578118125.0
    },
    {
        "author": "stormwillpass",
        "body": "&gt; \"I need you to tank TSLA, right now!\"\n\n&gt; \"Shit, I need TSLA to plummet!\"\n\nNice work!\n\nLong story short, I'd rather them not tank anymore and need them to moon now since I sold a lot of naked puts. Past two weeks I closed some naked calls that would've ended up profitable. Last week I opened up some puts and the $520 strike ended up losing 3x initial credit.\n\nGetting fucked both ways it seems.",
        "created_utc": 1579478337,
        "id": "ff1eyuq",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1579507137.0
    },
    {
        "author": "Logan_Maransy",
        "body": "I'll help you out in a non ironic way, because options are actually really simple but can seem confusing if you are looking at this screenshot with ignorance. \n\nOP bought 30 call contracts (+30) for $77K (equity in screen shot of $87K - the gain of $10K experienced since he bought at $77K), at an average cost of $25.78 per share (1 contract = 100 shares, so 30 contracts = 3000 shares, so the $77K checks out.)\n\nThe \"Breakeven Price\" is listed at $1905.78. If we subtract the cost OP spent on each contract, we find the strike price of the calls is $1880. The EXP Date (expiration date) is 1/31, or tomorrow at close. Finally, the current price ($29.23) is the \"current\" price of the contracts. Because option markets are open only during normal trading hours, this cost represents the last price at close and are not updated to reflect after-hours market movement. \n\nIn summary, OP walked up to a roulette table and slapped 77 grand in cash on the \"AMZN stock will be above 1905 by the end of day tomorrow\". Note that is closed at 1870 today. If it's above 1905 by tomorrow, he will gain money overall. And if it's below 1905 he will lose money. If it's below 1880, he will lose ALL 77K.\n\nAMZN absolutely fucking killed earnings, released after hours today. Straight up Trogdor Burninating the peasants type of slaughter. In after hours trading AMZN is now at 2074. OPs call options are now \"in the money\" which means they have intrinsic value, because they allow the owner of the contract (currently OP) to buy 3000 shares of AMZN from someone at a price of $1880, when it's clearly market valued at $2074. What a deal right?! That intrinsic value is the difference between the strike price (1880) and the market price (2074), which is $194. \n\nLet's say OP doesn't have the capital to buy 3000 fucking shares of AMZN ($6 mill+ now) in order to then immediately sell it for a profit. Well, that's fine, because somebody in the market absolutely does, and will buy his contracts off him for at least $194. \n\nThus OP bought 30 contracts, each at a cost of $2,578 ($77K initial cost) and is going to be able to sell them tomorrow for at least $19,400 each ($582K final result). So 582K-77K initial cost = 500K+ profit, as OP stated in title. Another way to look at it is: 194/25.78 = 7.53x multiplier in one night, on a 77K bet.",
        "created_utc": 1580424958,
        "id": "fg1d1h0",
        "score": 102,
        "subreddit": "wallstreetbets",
        "created": 1580453758.0
    },
    {
        "author": "veritasinvestments",
        "body": "Iran and the US probably made a deal where Iran had to give up its power in the region in exchange for easing the sanctions. The price? Iran has to give up its Quds leader. In one move, Khamenei has also consolidated his own power by taking out someone who, in the past, has threatened military coups in the event of left-wing movements and relations with the US. By doing this, he has severely reduced Sepah’s power while simultaneously allowing for sanctions to be gradually eased. Most people don’t understand this, but IRGC is getting so powerful that it is actually threatening the very existence of the Iranian government as it is. Soleimani was essentially its key leader, and by giving him up, Khamenei has consolidated his power. This is what most likely has occurred. Otherwise, why did it take so long for the US to kill this guy? He’s been active in Iraq and Syria for the past decade.\n\nAlso, some IRGC hardliners wanted Soleimani to run for president. There’s an internal war between the clerics and the IRGC for power in Iran. While someone like Rouhani or Ahmadinejad could just be puppets for Khamenei, Soleimani would actually not be a puppet president. Given that Rouhani is also in his last term, if Soleimani ran, he could present as a viable candidate. The only way that Khamenei could consolidate power for the clerics was to take him out. Again, if you were in Iran right now or know about how the Iranian government works, this scenario would probably be what you would be thinking right now as well.",
        "created_utc": 1578026775,
        "id": "fcwitom",
        "score": 99,
        "subreddit": "wallstreetbets",
        "created": 1578055575.0
    },
    {
        "author": "olmn20",
        "body": "If everyone looked at a log scale of the S&amp;P 500‘s performance instead of the regular chart, we would have half as many people worried that the market is overvalued right now.",
        "created_utc": 1578335053,
        "id": "fdeay9c",
        "score": 94,
        "subreddit": "investing",
        "created": 1578363853.0
    },
    {
        "author": "CRE_Finance_CPA",
        "body": "Probably getting divorced because he hasn't been taking her to Red Lobster. She was eating Red Lobster 4 times a week last year. And now no more Red Lobster.",
        "created_utc": 1578417560,
        "id": "fdh8byv",
        "score": 92,
        "subreddit": "wallstreetbets",
        "created": 1578446360.0
    },
    {
        "author": "PeterMichaelPaints",
        "body": "Now this is how you do it people - spend someone else's money. I respect this man.",
        "created_utc": 1578443086,
        "id": "fdihl1q",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1578471886.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "WSB: this is definitely the top. *buy puts*\n\ntwo weeks later...\n\nWSB: no seriously, this is definitely the top now. *buy puts*",
        "created_utc": 1578006569,
        "id": "fcvojf2",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1578035369.0
    },
    {
        "author": "kwondj",
        "body": "In 2007 i said buy amd, all the fucking pc gamer nerds laffed me out the room\n\nGuess whos laffing now i own zero amd shares and boy wish I listened to myself.\n\nEven a broken person is right twice",
        "created_utc": 1578341896,
        "id": "fdem2iu",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1578370696.0
    },
    {
        "author": "elosorojo4",
        "body": "Kicking myself. I had sold at $340. Average buy in in of $280. Happy to have made a profit but obviously wishing I had held on. Would like to get back in at some point. It’s been such a wild ride up and down my instinct is to wait for a big drop to get back in but am now thinking it probably won’t reach those levels again anytime soon.",
        "created_utc": 1578063719,
        "id": "fcxifd7",
        "score": 75,
        "subreddit": "stocks",
        "created": 1578092519.0
    },
    {
        "author": "satago",
        "body": "You get one of the big boys to underwrite your IPO. They push their hot startup to a fund manager who handles everyone in americas 401k. The underwriter gets a huge cut based on the IPO price and the owners of casper get instant wealth because their shares are immediately valued in nose bleed territory, the price set by the underwriter.  Underwriter and owners cash out and Everyone's 401k absorbs this new public company that ain't worth shit!  But overall this company is a pretty small percentage of everyone's 401k and you'll never know how much you lost 30 years from now when you take your minimum distribution at 70.5 years old.  \n\nYou'll probably never touch your 401k money and everyones 401k will own \"trillions\" in these companies that are effectively worthless. \n\nEventually the entire market will collapse. The only people left with money will be the underwriters, berkshire hathaway, and a couple others that actually hold companies that make money. \n\nThat is how Casper could be \"worth\" $1B.",
        "created_utc": 1578888509,
        "id": "fe6ehhe",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1578917309.0
    },
    {
        "author": "stormwillpass",
        "body": "LOL\n\nedit:\n\nokay so I started watching the vid, saw my name, paused it, reserved a comment spot, gave you a gold prematurely, resumed watching, and now here I am.\n\nWow that was fucking hilarious. When you said you were gonna meme the whole thing, I did not expect it to be this good. Great scene choice. Thanks for making my weekend a whole lot better &lt;3\n\nedit2:\n\nNew phrase for 2020: tag u/haupt91 and say \"HAUPT the memeloaf!\" whenever you see something meme-able.\n\nedit3: Awards don't show up in gilded, so I will give you a gold so that it does. Also, each time you give a post an award, the link disappears and you have to refresh to give another one.",
        "created_utc": 1578765034,
        "id": "fdx3vse",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1578793834.0
    },
    {
        "author": "brutalpancake",
        "body": "Ok NOW it’s priced in",
        "created_utc": 1578015933,
        "id": "fcw2yi4",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1578044733.0
    },
    {
        "author": "tht_pod",
        "body": "Hard to say. This stock is unpredictable. In my opinion it’s a good buy but right now it’s in blue sky break out mode. You’ll probably find a better buying opportunity if you wait but if you think it’s going to keep riding then who am I to tell you no. Just remember this stock was at 170 like 6 months ago. I sold my position when it hit 410 and sure I’m a little pissed it’s gone higher but nothing wrong with taking profit. Wait for a pull back.",
        "created_utc": 1578410358,
        "id": "fdgwxqr",
        "score": 66,
        "subreddit": "StockMarket",
        "created": 1578439158.0
    },
    {
        "author": "InferiousX",
        "body": "Iran could fire a nuke at the US right now and my AAPL puts would still expire worthless.",
        "created_utc": 1578051125,
        "id": "fcx4pv8",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1578079925.0
    },
    {
        "author": "Bleak_Midwinters",
        "body": "I think there is a better answer than \"luck\" that you will commonly hear. Typically you want to learn the stages of the business/economic cycle for what you are talking about. During a recession certain sectors or industries perform better, these are typically tied to what is viewed as a necessity to the consumer. An example would be utilities. \n\nNow, if you are asking who will survive recessions, a good indicator is the leverage ratio. How much is funded with debt compared to equity? This helps assess financial health of a company. You can look at days cash as well. This answers how many days of operations can the company fund purely off the cash on it's balance sheet. Total assets turnover or TAT can show how well the companies assets are used to produce sales. There are several others, but I think this is sufficient to send you on your path. \n\nDuring a recession you may find it easier to just pick ETFs that track underlying growth indexes and buy them at a cheap entry. Check out the performance of the Nasdaq 100 from 2009 to now. Looks tasty right? Not to say those market conditions will be replicated, but a similar strategy may be easier with lower risk than picking individual stocks. Good luck!",
        "created_utc": 1578243413,
        "id": "fda9tp7",
        "score": 65,
        "subreddit": "investing",
        "created": 1578272213.0
    },
    {
        "author": "SaltRecording9",
        "body": "This is it. I've finally found the most retarded comment on this sub. I don't know what to do now. I guess I can finally rest.",
        "created_utc": 1578071047,
        "id": "fcxvf3j",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1578099847.0
    },
    {
        "author": "ConfidentMushroom",
        "body": "OP is busy photoshopping those right now, leave him alone!",
        "created_utc": 1578769136,
        "id": "fdxitn4",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1578797936.0
    },
    {
        "author": "TEZLAGREEN",
        "body": "#The 🐻 must PREPARE for trouble! Make the stonk double! To protect the world from devastation! To unite all 🅰️utists within our nation! To denounce the evils of truth and love! To extend our reach to the stars above! ....👽👽.... Jessie.....Jaaaaames🚀Team Tesla 🚀blast off at the speed of light! Surrender now or PREPARE to fight! 😻Musk! That’s Rrrright! https://youtu.be/vYAHFpclnYc",
        "created_utc": 1580091699,
        "id": "ffpcmdu",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1580120499.0
    },
    {
        "author": "SirGlass",
        "body": "I have used schwab for years as my main bank , and brokerage.  I initially choose it to be a bank and save on ATM fees and Travel fees (I like to travel outside the USA) then rolled over my IRA from a shitty Amerprise account (oritionally opened by my parents) and an old 401k\n\nNow I have almost consolidated everything with schwab.",
        "created_utc": 1578143515,
        "id": "fd28vo0",
        "score": 60,
        "subreddit": "investing",
        "created": 1578172315.0
    },
    {
        "author": "zsd99",
        "body": "In your own link you posted:\n\n&gt; It is a significant moment actually. The flag is only raised for Imam Hussian, the most pivotal figure of Shia Islam. The flag is now being raised for Soliemani, if that does not spell significance then nothing ever does. It doesn't matter the that it's done yearly, it matter that it is not being raised for the most holy figure of Shia Islam, but for a Man in 2020.",
        "created_utc": 1578220642,
        "id": "fd8nsyy",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1578249442.0
    },
    {
        "author": "ShawnHans007",
        "body": "this guy fucks. \n\ni tell you what. you show me your paystubs and send me your whatsapp and i quit my job right now and i work for you",
        "created_utc": 1580425775,
        "id": "fg1epet",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1580454575.0
    },
    {
        "author": "CarlCarbonite",
        "body": "You can order drone strikes on your iPad now.",
        "created_utc": 1578018291,
        "id": "fcw6j5r",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1578047091.0
    },
    {
        "author": "RaoulDuke209",
        "body": "Teslas are visibly filling the streets in my city. 4 years ago there was maybe 2 or 3 id see and then some families had multiples and now theyre all over.",
        "created_utc": 1578429696,
        "id": "fdht5z1",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1578458496.0
    },
    {
        "author": "meetballin25",
        "body": "same. i am debating to cut out robinhood now. fuck this",
        "created_utc": 1578321740,
        "id": "fddr2nr",
        "score": 53,
        "subreddit": "RobinHood",
        "created": 1578350540.0
    },
    {
        "author": "Skeptophile",
        "body": "Still got [the dough](https://www.google.com/search?q=star+wars+box+office&amp;oq=star+wars) and now baby Yoda's merch dough.",
        "created_utc": 1578349643,
        "id": "fdez1sf",
        "score": 52,
        "subreddit": "stocks",
        "created": 1578378443.0
    },
    {
        "author": "TNGBO",
        "body": "You definitely don’t have kids, I don’t and never even bothered with it. But my sister and brother can’t live without it now, 2 kids each",
        "created_utc": 1578259987,
        "id": "fdbpse5",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1578288787.0
    },
    {
        "author": "Hadron90",
        "body": "Yep, its experiencing outages right now. My GD position is up 260% and I can't fucking sell.",
        "created_utc": 1578321516,
        "id": "fddqsje",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1578350316.0
    },
    {
        "author": "MasterCookSwag",
        "body": "I feel like I need to qualify that I'm pro EV so nobody loses their shit but the base of your post doesn't make sense.  The US is a net exporter of crude and refined petroleum.  The economics you speak of haven't been a thing for some time now.",
        "created_utc": 1578071560,
        "id": "fcxwo1q",
        "score": 50,
        "subreddit": "investing",
        "created": 1578100360.0
    },
    {
        "author": "bfreis",
        "body": "tl;dr - more info such as the trade price and contract expiration could be very helpful, the info you gave means that you're at a loss of -0.126% rather than the profit you calculated, and the strategy seems way too risky, especially for the \"goals\" you mentioned.\n\nA few comments.\n\nI'm assuming that (1) you opened the account with initially 5k usd deposit, and (2) you opened those 2 trades you listed, they are still open, and you did absolutely nothing else. Are these assumptions right? Assuming they are correct... \n\n- First thing, it might be more helpful if you include a more precise specification of the contracts you're trading, especially when you report about past trades.\n\nEg, today there's no F options with 16 DTE. Someone looking at this in 1 month might be confused. In this case, it seems that you're talking about Jan 17th expiration. Same for GPRO. \n\nAlso, it's useful to mention the trade price. In this case I can't really know how much you bought the options for.\n\n- Second thing, you seem to be calculating the return wrong. \n\nIt seems like you calculated return as how much the cash balance changed on that week. This is not how it's done.\n\nYou have to compare account values, which is not the same as cash balance. The reason for this is that while you do have the assets in form of cash, you also have liabilities (the short options). \n\nYour \"week one starting account value\" is 5k.\n\nYour \"week one ending account value\" is equal to your ending cash balance *minus how much those options are worth now*.\n\nYour F option closed Friday at 0.09 so the position is worth -9 USD. Your GPRO option closed at 0.07 so the position is worth -7 USD. Your cash balance is 5000 + 5.85 + 3.85 = 5009.70 USD. Adding it all together, you find the ending value.\n\nThe ending value is 4993.70 USD. This is a P/L (or loss) of 6.30 USD. \n\n**Week one return is then a loss of -0.126%.**\n\n- Third, in regards to the strategy itself.\n\nThe amount you're collecting in premium seems incredibly low. This is because (1) the underlyings are super low priced, and (2) your options are very close to expiration. \n\nThis leads to a situation where you're collecting almost no premium, a significant percentage of which is being spent on fees, and you have pretty significant risk due to a lot of Gamma. \n\nOne way to improve that is to sell options with more DTE, for example. You'll collect more premium, the percentage of premium you spend is fees is significantly reduced, and so is your gamma risk.",
        "created_utc": 1578287512,
        "id": "fdcxu6p",
        "score": 49,
        "subreddit": "options",
        "created": 1578316312.0
    },
    {
        "author": "CaezarVII",
        "body": "Strictly as a broker:\n\n1. Fidelity is the best all round broker by a small margin because you get cash on your sweep account without having to manually move into money market. Vanguard also pays cash (more than Fidelity) on their sweep accounts but Vanguard is lacking in the technology department as far as their app and web platform so I prefer Fidelity.\n2. Most of the other brokers don't really have enough differentiating factors in my opinion to say one is \"better\" than another. Vanguard is great, but their technology is lacking. Between the others, they all have easy to use apps and websites. Etrade, Schwab, and Ally tend to have the better website platforms and highly rated Android and iPhone apps. IBKR and possibly TD Ameritrade are good for advanced traders. If you don't go with fidelity, I would literally just choose based on which app or web platform you like the most.\n\nBroker plus other banking services:\n\n* The Fidelity rewards 2% cashback credit card is good enough to serve as a primary credit card. For this reason, combining your broker and credit card platform both at Fidelity for simplicity is a good option. Fidelity also offers a checking account with fee free/reimbursed ATM usage but their checking account platform is not as good as Schwab or BoA.\n* Schwab is a great all round broker. Although they do not pay cash on sweep accounts, their easy to use and fee free/reimbursed checking accounts make up for it. I personally use Schwab for brokerage and checking (and an Amex credit card).\n* Ally Invest should be way more popular than it is. Their saving account rates speak for themselves so combining Ally savings/checking/brokerage accounts is a win win win situation. Their web platform for brokerage is also excellent and might be my favorite overall. They also have a large ATM network and will reimburse up to $10 in ATM fees per month.\n* Etrade offers a checking account with unlimited free ATM usage and fee reimbursement and a competitive rate Savings account. Etrade's offerings are very similar to Ally Invest in my opinion. I don't know how one would choose between the two except that I like Ally's website and app more. With things changing so quickly at brokers right now, I'm not sure that Ally Invest, or especially Etrade, are sustainable. I could see Etrade being acquired very soon. This is another reason why I stick with Schwab.\n* Merrill Edge combined with their Preferred Rewards program is excellent and if you have enough assets with them you get up to 5.25% cash back on a no annual fee credit card for a category of your choice, 3.5% cash back on groceries, and 1.75% cashback on everything else. You really can't beat this. If you have enough assets with BoA/Merrile Edge, you also get unlimited ATM fee free/reimbursed.\n* Chase YouInvest is a decent platform but it feels really new and not fully fleshed out. They only added options trading a few months ago I believe and they definitely have the most basic platform being only a couple notches above Robinhood as far as features which can be a good and bad thing since it is pretty simple to use. Now that they have options trading, I would recommend Chase YouInvest, especially if you are going to combine your assets at Chase. Like BoA Merrill Edge, you have to have a certain amount of assets with Chase to get fee free ATM usage with reimbursement.\n* TD Ameritrade is a great brokers with nothing much to offer by way of banking features or their own investment products. Because of this I am not surprised that TD was acquired. They have an advanced trading platform but I'm not sure that it's worth it since they have below average app reviews on Android. I basically use my phone for everything and so the app is really important to me. For these reasons TD Ameritrade didn't really stand out to me.\n\n\\*\\*One other caveat....if you trade inverse and leveraged ETFs such as UVXY or TQQQ, respectively, certain brokers do not allow trading of these securities. Vanguard and Chase do not allow trading of either. Merrill Edge does not allow trading of inverse ETFs. If not for this I would probably be with Merrill Edge in order to get the 5.25% cashback credit card or Chase to utilize their credit cards and checking account. I know Fidelity and Schwab allow trading of either leveraged or inverse ETFs, but I am not sure about the other brokers.\n\n\\*\\*\\*I have personally used Vanguard, Fidelity, Schwab, and Chase YouInvest extensively. I have experimented with Merrill Edge, Ally Invest, and Etrade.",
        "created_utc": 1578168250,
        "id": "fd4k6ob",
        "score": 49,
        "subreddit": "investing",
        "created": 1578197050.0
    },
    {
        "author": "TravelingArthur",
        "body": "I get it. It’s cool. Your money. Do you.\n\nIf however instead of liquidating everything right now at once, can I offer some advice and put a rolling stop loss on your stocks? Or manually close the  a particular stock drops 3-5%? \n\nThat way you don’t miss out on any gains and you don’t get screwed on your losses",
        "created_utc": 1578365650,
        "id": "fdfnarl",
        "score": 49,
        "subreddit": "stocks",
        "created": 1578394450.0
    },
    {
        "author": "aurora_jaeger",
        "body": "I believe we are in a highly fraudulent environment, and stock prices have decoupled from reality completely. If anything, I would short the markets now...  \n\n\n\\*Edit: Teenagers on Robinhood buying Options with 25x leverage like it is a video game is a good indicator we are at the very peak\\*",
        "created_utc": 1577999413,
        "id": "fcvctkt",
        "score": 49,
        "subreddit": "stocks",
        "created": 1578028213.0
    },
    {
        "author": "Chols001",
        "body": "I’m of the opinion that if you don’t have something better to put your money into, then you should never wait for a stock to drop before buying it.\nIf I find a good stock I like to buy a position I’m comfortable with, and then average down if the stock drops. In my opinion you should never be all in cash, and if you do hold cash it should only be because you are without a stable income, so that you can’t average down if something drops, and you need that reserve cash.\nThat’s just how a I like it.\n\nIronically with the new earnings projections the stock is actually cheaper, compared to it’s expected cash flow, then it was 3 months ago. So from a fundamental standpoint you are better of buying the stock now, then you were 3 months ago.\nAlthough if you ask me, then I think cash flow estimates are a bit too optimistic looking 5-10 years out.",
        "created_utc": 1578401616,
        "id": "fdglsbe",
        "score": 48,
        "subreddit": "StockMarket",
        "created": 1578430416.0
    },
    {
        "author": "blackicebaby",
        "body": "stroll in the park. V is king now.",
        "created_utc": 1578959968,
        "id": "febl3pj",
        "score": 47,
        "subreddit": "StockMarket",
        "created": 1578988768.0
    },
    {
        "author": "WeeklysOnly",
        "body": "PRICED IN. Iran crisis is the busdriver now",
        "created_utc": 1578250119,
        "id": "fdatybv",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1578278919.0
    },
    {
        "author": "Malverde116",
        "body": "What do you tell your uncle now?",
        "created_utc": 1578004412,
        "id": "fcvl3kk",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1578033212.0
    },
    {
        "author": "Studentofsorts",
        "body": "This is trump. Calling it now",
        "created_utc": 1578098752,
        "id": "fczdhp4",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1578127552.0
    },
    {
        "author": "jcrice88",
        "body": "There are thousands of DUCs (drilled but uncompleted wells). These wells are ready to be hydraulically fractured bringing production online.   \n\nRig count can drop and service companies can take price concessions but wells are still being completed contributing to production.\n\nShale companies go out of business only to be bought by other oil companies. The wells don’t get shut in they just get acquired by a bigger fish.\n\nDUC count by area. \nhttps://www.eia.gov/petroleum/drilling/\n\nRigs are down 25% in the last 12 months for US onshore. But remember rig efficiencies are increasing too. In a few places i have worked 7 years ago a well took 20 days to drill and now it takes 4. Same thing with frac crews. Good frac crews pump 20+ hours a day. 5 years ago it was 8 hours a day. \n\nEdit: added some comments.",
        "created_utc": 1578278733,
        "id": "fdcmpcw",
        "score": 44,
        "subreddit": "investing",
        "created": 1578307533.0
    },
    {
        "author": "Patrick8383",
        "body": "Son of a bitch. I placed a order this morning and it  said it didn't go through so I placed it again. Then it showed  both got placed and  it didn't let me cancel. Now they both filled. Not what I needed.",
        "created_utc": 1578321974,
        "id": "fddrddu",
        "score": 44,
        "subreddit": "RobinHood",
        "created": 1578350774.0
    },
    {
        "author": "moroniccow",
        "body": "People did complain about him having an iPhone, now we know why",
        "created_utc": 1578159625,
        "id": "fd3lzze",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1578188425.0
    },
    {
        "author": "Mint_Juul",
        "body": "Saw a homeless person get arrested on a bike near my house, well now I have a new bike. Short Peloton",
        "created_utc": 1578400718,
        "id": "fdgkuu3",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1578429518.0
    },
    {
        "author": "GoldenKaze",
        "body": "Time for the Saudi oil company to make it's IPO now",
        "created_utc": 1578061959,
        "id": "fcxg0ak",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1578090759.0
    },
    {
        "author": "terran42069",
        "body": "Caring about it isn't gonna make me money now is it?",
        "created_utc": 1578082555,
        "id": "fcym4qe",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1578111355.0
    },
    {
        "author": "Colorshake",
        "body": "I’m from the Middle East and moved to America while I was in elementary school. \n\nAs a child, I was on the receiving end of those bombs. Now, thanks to my LMT calls, every time some kid in Syria gets droned I get a nickel. \n\nThat is the American fucking dream, and I’d appreciate it if you wouldn’t take that away from me with your bullshit moral posts.",
        "created_utc": 1578459946,
        "id": "fdj6nuk",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1578488746.0
    },
    {
        "author": "CarlCarbonite",
        "body": "SPX 3240 Calls at open expiring RIGHT FUCKING NOW! (Or at least end of day)\n\nUpdate: Sold the calls for $700. Going to bed now. This money will be used for Starbucks and redbull and whatever 7-11 gives me. Maybe a pizza.",
        "created_utc": 1578060215,
        "id": "fcxdr74",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1578089015.0
    },
    {
        "author": "WrongCheck",
        "body": "I’m sure you’ll get a lot of people who will have better advice, but what I’ve learned from here over and over is “time in the market bests timing the market.” If you Google it or search here people have feared a recession for the last couple years. So people who had those fears at this time last year would have missed a year of great growth.\n\nI first started investing a couple years ago right before that big dip. I thought I was an idiot because if I waited a month I would have made a lot more money. But now I’ve made a lot of money off my very basic investments. I would say if you have doubts then hold some of your money out, but I think you’re going to find most people say don’t try to time the market.",
        "created_utc": 1578316644,
        "id": "fddlbwt",
        "score": 40,
        "subreddit": "StockMarket",
        "created": 1578345444.0
    },
    {
        "author": "DadGoneGamer",
        "body": "I just have to say, I have never been more embarrassed to serve in my capacity as Bear Gang Colonel as I am right now. \n \nI understand that this market is way overextended and propped up by Fed pumps, but, wishing for the deaths of US and coalition troops and even Iranians to save your short positions is beyond the pale. I want this market to come back down to earth just like everyone else who is short US equities but not at the expense of human life.",
        "created_utc": 1578451959,
        "id": "fdivhh2",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1578480759.0
    },
    {
        "author": "simplevalue",
        "body": "This is not a good conclusion. A lot of investing is having the gut to invest when a company has negative profits, tons of cash burn, after the 2000 dot com bust, etc etc etc. Hindsight yes amazon was a great investment, now realize how many seemed just as good but failed.",
        "created_utc": 1578205882,
        "id": "fd7kfna",
        "score": 40,
        "subreddit": "investing",
        "created": 1578234682.0
    },
    {
        "author": "blaked_baller",
        "body": "It's been a couple minutes, you can clap now",
        "created_utc": 1578273618,
        "id": "fdcfhul",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1578302418.0
    },
    {
        "author": "analyzethis2018",
        "body": "I watched Mando and liked it for what it was.\n\nOver Christmas, we watched 'Home Alone', 'Noelle', 'A Christmas Carol' ... maybe another Christmas something I don't recall.\n\nLooked for something to watch last night and there is literally *nothing* else I want to see.\n\nLooked again just now for something to watch ... nada.  \n\nDecided to cancel before I forget and get billed another month.",
        "created_utc": 1578259473,
        "id": "fdbodb0",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1578288273.0
    },
    {
        "author": "omfgcjcj",
        "body": "I was listening to warren &amp; munger answering a question about that at a recent event. An old lady had brought some figures with her and said you always preach index funds, so why does Berkshire sit on so much cash when if it had been parked in an index fund since (whenever) then that would have amounted to being (bigger amount) now.\n\nIf I remember right their answer was along the lines of;\nA) great question, yes it would have made more money in an index fund\nB) we like having cash-on-hand so we can move very quickly on good opportunities \nC) cash on hand keeps things low-stress for our investors\nD) the sheer size of BRK means that any positions they make or withdraw has big ripple effects on markets as a whole",
        "created_utc": 1577993296,
        "id": "fcv2ifa",
        "score": 37,
        "subreddit": "stocks",
        "created": 1578022096.0
    },
    {
        "author": "mylons",
        "body": "it’s priced in now. Iran isn’t going to do shit for weeks. We’re back in the green next week. BULL GANG",
        "created_utc": 1578050119,
        "id": "fcx3wo5",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1578078919.0
    },
    {
        "author": "sbarrettm",
        "body": "WW3 Memes are HOT. Invest now.",
        "created_utc": 1578078058,
        "id": "fcycl5c",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1578106858.0
    },
    {
        "author": "gegege_69",
        "body": "All of this seems pretty nonsense to say the least. Please seek professional help now",
        "created_utc": 1578694115,
        "id": "fds4f5n",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1578722915.0
    },
    {
        "author": "lonewolf420",
        "body": "He is like the ol' grandpa that you know was once really smart but is starting to fall for the fishing email scams by some Chinese guy and will only sing praises of how the Chinese are so much better and how he loves the Yuan now. You just know he is going to start losing it in 5 years but you can't help/talk to him because you still want a piece of his estate and don't want to be written out of the will.",
        "created_utc": 1578347038,
        "id": "fdeus9g",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1578375838.0
    },
    {
        "author": "tacotruck7",
        "body": "Yeah, I don't think the tech bubble of 20ish years ago had anything to do with y2k. Is someone making that claim now? Or is OP just conflating to two events?",
        "created_utc": 1579378295,
        "id": "fetq7jq",
        "score": 36,
        "subreddit": "investing",
        "created": 1579407095.0
    },
    {
        "author": "stellarfury",
        "body": "Maybe you're right. Maybe you're not. Personally, I wouldn't bet actual money on this sort of... *intensely* reductive analysis of incredibly complex systems like national/global economies.\n\nMy point is, people have been saying this for years - what's different now? To me, this sort of doomsaying is just as credible as WSB's \"STONKS ALWAYS GO UP\" line.",
        "created_utc": 1578009082,
        "id": "fcvsgmk",
        "score": 35,
        "subreddit": "investing",
        "created": 1578037882.0
    },
    {
        "author": "EHobby23",
        "body": "The magic will happen at 27 PE, or based on Papa John's satanic ritual roughly 30 days from now.  I heard near spx 3300.  All in puts after Tesla hits 450 and Acb goes to $1.",
        "created_utc": 1578007680,
        "id": "fcvqah1",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1578036480.0
    },
    {
        "author": "mavman97",
        "body": "Okay now I’m DEFINITELY shorting it.",
        "created_utc": 1578095752,
        "id": "fcz8ei0",
        "score": 34,
        "subreddit": "stocks",
        "created": 1578124552.0
    },
    {
        "author": "desquibnt",
        "body": "I hate technical analysis. It see boogeymen in every chart. 8 months ago, all the technical analysts were proclaiming doom because of an inverted yield curve and look where we are now.\n\nBut hey, if you say there's a recession coming long enough, you'll eventually be right",
        "created_utc": 1579473599,
        "id": "ff0yr88",
        "score": 34,
        "subreddit": "investing",
        "created": 1579502399.0
    },
    {
        "author": "Mocker-Nicholas",
        "body": "The one I recommend most is “I will teach you to be rich”. At that point in my life I had started making money but didn’t really know what to do with it so I just it into something I thought would be a sure thing. I’m much more regimented with how I handle finances now. That’s more of a personal finance book than investing, but personal finance was definitely something I needed to get down before I started pumping money into my brokerage all willy nilly.",
        "created_utc": 1578183680,
        "id": "fd602yj",
        "score": 34,
        "subreddit": "investing",
        "created": 1578212480.0
    },
    {
        "author": "WorstEpEver",
        "body": "Turn back now",
        "created_utc": 1578008455,
        "id": "fcvri1a",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1578037255.0
    },
    {
        "author": "RLaG69",
        "body": "Elon musk is having a kid and danced, and that makes TSLA undervalued. Those moves are at least in the 1000’s. he knows something we don’t. \n\nReal talk, memes control the market. Economist are fuming right now.",
        "created_utc": 1578964268,
        "id": "febye91",
        "score": 33,
        "subreddit": "investing",
        "created": 1578993068.0
    },
    {
        "author": "IRPhysicist",
        "body": "2020 fire sale going on now. Except for AAPL, that thing has retard strength.",
        "created_utc": 1578051675,
        "id": "fcx563y",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1578080475.0
    },
    {
        "author": "eskimoboob",
        "body": "Ok. If you're going to play vix options, there's something everyone needs to understand.  The options are not based on the spot VIX. They are essentially based on vix futures for the corresponding month. \n\n That makes buying calls doubly expensive. Because let's say for example, you want to buy the April 15 call.  The April future is at 17.1 right now. So calls on that 15 strike are already ITM, and you're going to pay $3.20 for them. But as expiration gets closer,  the futures also converge to the spot price. Meaning if vix stays under 15 the future price is going to gradually decay and you lose money on not just the option price due to theta,  but also on the fact that the underlying future is decaying.  \n\nSo if you're going to do this,  I would highly recommend spreading it. If you buy a 15C, at least sell a higher strike. Maybe a 22C. Sure you cap your upside,  but you also save a dollar on premium. \n\nTLDR: VIX options are a bitch if you don't understand them",
        "created_utc": 1577989044,
        "id": "fcuuxr0",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1578017844.0
    },
    {
        "author": "jsally17",
        "body": "Now this is damn good advice.",
        "created_utc": 1580270597,
        "id": "ffvqpcy",
        "score": 33,
        "subreddit": "options",
        "created": 1580299397.0
    },
    {
        "author": "stormwillpass",
        "body": "Quit bitching about the thread not being pinned because reddit is bugged about it right now. Whenever I pin it, another one replaces it even though there is only one pin. It's as if there's an invisible first pin, so only one thread is pinned at a time instead of the usual two.",
        "created_utc": 1578101997,
        "id": "fcziisu",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1578130797.0
    },
    {
        "author": "MUnitedRelegated2020",
        "body": "If we are being honest, it’s even less threatening than that. Iran kept fucking in the USA’s business, they got whacked, and they are now showing the world they are giant cowards.   \nThis is the same place where “death to America” chants frequently break out in their literal fucking government, and during their prayer ceremonies. This has been occurring for FORTY YEARS.   \nColor me shocked that their bravest actions yet have pussy pirates boarding civilian ships in the Strait.",
        "created_utc": 1578324826,
        "id": "fddv9e7",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1578353626.0
    },
    {
        "author": "Winkerisfat",
        "body": "If you didn't make money today that's fine but WHAT THE FUCKING FUCK ARE YOU FUCKING DOING HOLY SHIT ARE YOU RETARDEF THEYRE PRATICALLY GIVING AWAY TENDIES RIGHT NOW GET YOUR HEAD IN THE GAME",
        "created_utc": 1578952609,
        "id": "feavklz",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1578981409.0
    },
    {
        "author": "Reacher-Said-Nothing",
        "body": "&gt; Dude's 73 and still rocking that big dick energy\n\nNow that I think of it I haven't actually seen him do anything \"energetic\".  Like he doesn't even yell in his firey speeches, he just talks.",
        "created_utc": 1578176999,
        "id": "fd5f2wn",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1578205799.0
    },
    {
        "author": "Cocaine_Addiction",
        "body": "I have been considering rehab for awhile now. Would you recommend it?",
        "created_utc": 1578254858,
        "id": "fdb8efw",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1578283658.0
    },
    {
        "author": "urmommasman",
        "body": "Showed my new WSB shirt to my gf, she asked why I had a shirt with Trump on it... she’s a raging liberal so I let her think I have a Trump t-shirt now.",
        "created_utc": 1578260145,
        "id": "fdbpz7n",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1578288945.0
    },
    {
        "author": "Veliladon",
        "body": "tl;dr: \n\n* buying options is lottery tickets\n* selling options is being a casino\n\nlong answer:\n\nhomeboy OP bought a lottery ticket that the SPY would crash down to $323.50. Since stonks only go up homeboy's lottery ticket is worth about the same as a real lottery ticket. He decided to sell his shitty lottery ticket and take a massive 35 grand loss.\n\nNow, instead, if homeboy sold someone else a second shitty lottery ticket that was almost sure to lose, he would be able to make most of the money back and turn his 35 grand loss into a 5 grand loss thereby saving said homeboy 30 fucking grand.",
        "created_utc": 1578693175,
        "id": "fds246i",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1578721975.0
    },
    {
        "author": "useful",
        "body": "The current price is $100 per share. I give you $20 for the right to buy the share for $180 in 1 year. You are like, 20% right now? Yes please. So you pocket $20 and you hold the shares for a year.\n\nIn a year, the sock shoots up to $400. Now I buy the share from you for $180. You made $100 counting my $20 I gave you for a contract! I pocket $200 when I sell the sock after exercising the contract to sell for $400. We each had a 100% gain but you are kicking yourself because you could have made $300 instead of $100.",
        "created_utc": 1578075829,
        "id": "fcy790e",
        "score": 30,
        "subreddit": "stocks",
        "created": 1578104629.0
    },
    {
        "author": "ohbabyspence",
        "body": "$INPX to hit 1bil USD a share on 4/20. Buy now to maximize tendies",
        "created_utc": 1578252978,
        "id": "fdb2eko",
        "score": 29,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1578281778.0
    },
    {
        "author": "bbq-ribs",
        "body": "Yeah, but at the time there were like 4 World Powers (England, France, Germany, and Russia) Now there is just one 1, and war get really boring after you nuke everything ( or better  like japan, they went from a war race to a people fascinated by dick girls)",
        "created_utc": 1578350763,
        "id": "fdf0ua1",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1578379563.0
    },
    {
        "author": "bfreis",
        "body": "Let's try.\n\nWhen you buy options, you get positive gamma. When you sell options, you get negative gamma. When you have multiple options positions, some long, some short, you have a combination of positive and negative gamma.\n\nThe gamma of an option has the most \"influence\" on your portfolio when the price of the underlying is right at the strike of the option. The further away the price is from the strike, the less influence it has.\n\nA very common practice for hedging very large long equity portfolios is to buy slightly OTM put options on an index such as the SP500. To help finance the cost of those puts, it's also a very common practice to sell slightly OTM calls. Eg, SP500 has been in the 3230 area for a while now. It's reasonable to assume many managers have bought puts below that (eg, maybe between 3150-3200), and they have sold calls above that (maybe between 3270-3290). This is called a collar.\n\nWho did they sell those calls to? Who did they buy those puts from? In general, ultimately there's an options Market Maker on the other side.\n\nFor that reason, ***the MM ends up have a lot of short puts below the market, and a lot of long calls above the market.***\n\nNow, if the market goes down strongly enough, the index will be much closer to the levels where market makers are short puts than the levels where market makers are long calls. Remember the the \"influence\" of gamma of options is stronger the closer price is to the strike. This means that there's this region where the influence of the MMs short puts will be much bigger than the influence of their long calls.\n\n***When that happens, the overall gamma of the Market Maker becomes negative.***\n\nOnce that first part is clear, the rest is probably easier.\n\nWhat happens when gamma is negative?\n\nWhen gamma is negative, what happens is that the directional exposure increases against the portfolio. That is, the more the market falls, the more long the portfolio gets. So as the market falls, the portfolio loses money, each time at an increased speed.\n\nHow does the MM hedge against it? He can't hope to do it by buying options — after all, he's the MM! So he hedges by shorting the underlying. How do they do it? They sell the ES.\n\nSo, what happens is that the ES is falling very strongly, which \"flips\" the gamma of market makers into negative territory, so they have to sell the underlying to hedge their increasing long exposure, forcing the market further down!\n\nPhew, hope this was clear enough!",
        "created_utc": 1578461586,
        "id": "fdj8m5k",
        "score": 29,
        "subreddit": "options",
        "created": 1578490386.0
    },
    {
        "author": "solidsnook88",
        "body": "“I tried to use a bike to fly to the moon and it didn’t work and now I’m mad!”",
        "created_utc": 1578064809,
        "id": "fcxk00y",
        "score": 29,
        "subreddit": "RobinHood",
        "created": 1578093609.0
    },
    {
        "author": "r_silver1",
        "body": "Im a big believer in its a \"market of stocks\", so I dont believe in making broad statements about the valuation of the market. Its harder to find stocks at investable valuations, according to the DCFs ive done on my own (maybe im being too conservative). I have found in this market, when all valuations are elevated, the more expensive stocks actually offer a better risk-reward because slow growers with low ROICs are almost completely worthless to invest in above a rougly 20 P/E ratio. Investing in this market requires a longer time horizon (10 years) and definitely dont bottom fish - anything cheap now appears to be bc its just junk",
        "created_utc": 1578338485,
        "id": "fdegg3k",
        "score": 29,
        "subreddit": "investing",
        "created": 1578367285.0
    },
    {
        "author": "garthybooks22",
        "body": "Ah yes, correct, Now I agree, Ban him.",
        "created_utc": 1578386989,
        "id": "fdgaco5",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1578415789.0
    },
    {
        "author": "spoobydoo",
        "body": "In their attempts to \"retaliate\" against the U.S. they've ended up killing 60 Canadians and roughly a dozen Europeans in that aircraft, in addition to the 80 or so Iranians on the flight.\n\nStill 0 Americans harmed as far as we know.\n\nNow the Supreme Leader is threatening more retaliation because last night \"wasn't enough\". Gee, I wonder why - there must be a lot of egg on the face for the regime.",
        "created_utc": 1578492769,
        "id": "fdk07dt",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1578521569.0
    },
    {
        "author": "shortgamegolfer",
        "body": "This time last year I was balls deep in the AMD game, and now I’ve missed out on some of the sweetest gainz I’ve ever seen. Hate being a mere spectator, but wishing you all luck! (*quietly buys AMD puts*)",
        "created_utc": 1578331551,
        "id": "fde5dxx",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1578360351.0
    },
    {
        "author": "TheCouchSitter",
        "body": "A lot of you sound like pussies right now. \"I'm scared, this is a bubble\"\n\nOf course it's a bubble retard make some money",
        "created_utc": 1578971576,
        "id": "fecdv7u",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1579000376.0
    },
    {
        "author": "gizamo",
        "body": "Claim to be Nomrom and write everything the opposite of Mormonism. Then, we can also buy all of the real estate in an area and hand it over to our for-profit real estate arm after sitting on it tax free for however long we want.     \n      \nEdit: this is an evolution of the \"Buy Detroit\" plan. Now it's, the \"Join Nomrom in Owning Detroit\" plan.",
        "created_utc": 1579478798,
        "id": "ff1gdaf",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1579507598.0
    },
    {
        "author": "Deadlyshock",
        "body": "You can now buy 294 houses in Detroit",
        "created_utc": 1578990311,
        "id": "fecyu3y",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1579019111.0
    },
    {
        "author": "Killerslug",
        "body": "I just made 45k off Amazon and WDC in 1 hour, I'm legit shaking right now.",
        "created_utc": 1580421808,
        "id": "fg16pbe",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1580450608.0
    },
    {
        "author": "takatu_topi",
        "body": "World war? Almost certainly not.\n\nWorst case scenario is a major regional conflict stretching from the Mediterranean to Afghanistan. Hezbollah vs. Israel, attacks on US forces in Syria, Iraq battleground between US, Iran, and their allied locals, US bombing the shit out of everything while Iran launches its missiles at US forces in the Gulf, Iraq, and Afghanistan, Iran blocking the Strait of Hormuz, an alliance of convenience between Iran and the Taliban against the US in Afghanistan, oil prices quadrupling, global economic depression, and Russia resupplying Iran via the Caspian Sea with more missiles to hurt the US and keep the Hormuz blocked because Russia can still export its now very expensive fossil fuels.\n\nBut probably not a world war.",
        "created_utc": 1578021345,
        "id": "fcwb5ti",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1578050145.0
    },
    {
        "author": "realister",
        "body": "Fun fact: Nancy Pelosi bought 100 AAPL leap calls right before that big correction in 2018 and even after the dip she still walked away with like $300k in profits. (after it recovered) She later exercised some of those options so she is up even more now.\n\nhttps://www.zerohedge.com/news/2018-11-26/why-was-nancy-pelosi-buying-fking-dip-amzn-aapl-fb-shares",
        "created_utc": 1578876697,
        "id": "fe5wstc",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1578905497.0
    },
    {
        "author": "t35t0r",
        "body": "I hold ~30% of these at any given time, but frequently by in and out of all of them :\n\naig\nbac\nbmy\nbynd\ncsco\neem\nefx\nfitb\nflgt\nfmc\nfxi\ngild\nhd\nhtht\nipar\nkbh\nlevi\nlh\nlly\nlscc\nluv\nmcd\nmrvl\npanw\npayc\nqcom\nroku\nspot\ntm\nttgt\nvtr\nzbra\n\nabbv\nabt\nacn\nadbe\nadsk\naltr\nathm\nazo\nbaba\nbax\nbrk.b\nburl\nc\ncdlx\ncmg\ncrm\ncsii\nctas\ndhr\ndpz\ndva\nenph\netsy\new\nfive\nfiw\nfn\ngpn\ngs\nhi\nhii\nhum\nhuya\nilmn\nintc\niq\nirmd\nisrg\nitgr\njbht\njd\nklac\nlk\nlow\nlrcx\nmdt\nmmm\nmnst\nmoh\nmsci\nmsft\nmt\nmtch\nmu\nneo\nnke\nnoc\nosk\npall\nqqq\nrace\nregn\nrost\nrrgb\nschb\nsea\nsedg\nshop\nskyw\nspgi\nstaa\nstm\ntgh\ntgt\ntsla\ntsm\nttd\ntxn\nuctt\nUI\nUL\nunh\nvar\nvrtx\nvti\nwfc\nwing\nxpo\nzbh\n\naap\naapl\nadi\nakam\namat\namd\namgn\namt\namzn\navgo\nba\nbax\nbeat\nbidu\nbzun\ncdxs\ncma\ncrsp\ndgx\ndhi\nemn\nens\netfc\nfpay\ngasx\nglw\nhon\nimgn\nintu\nkeys\nlhx\nlmt\nlrcx\nlyft\nma\nmdb\nmsft\nnflx\nnio\nnow\nntnx\nnvta\norcl\npdd\npfe\nphm\nptc\nrdfn\nrtn\nsbac\nsbux\nsdc\nsina\nteva\ntmo\ntol\ntri\ntsn\nual\nutx\nv\nvar\nvrsn\nvslr\nwb\nyum\nzg\nzs\n\nazn\nbdry\ngis\nmrk\nnvs\npgre\nshw\ntndm\nuaa\nveon\n\nlit\nendp\n\n\ntdg\nrtn\nutx\n\nosk\n\ngd\nldos\nhxl",
        "created_utc": 1578802764,
        "id": "fe04d2b",
        "score": 0,
        "subreddit": "RobinHood",
        "created": 1578831564.0
    }
]