[
    {
        "author": "GlideOutside",
        "body": "Robinhood is my YOLO account. I'm about to 100% rollover my 401K into another big play.  Time for Fidelity to start earning me money.",
        "created_utc": 1600296862,
        "id": "g5ivdqu",
        "permalink": "/r/wallstreetbets/comments/iu6dr1/my_12_month_journey_from_500k_to_27m_with/g5ivdqu/",
        "score": 379,
        "subreddit": "wallstreetbets",
        "created": 1600325662.0
    },
    {
        "author": "Kannoj0",
        "body": "She should sell her buthole for 2g. Make money, keep fidelity, stonks go up (sometimes)",
        "created_utc": 1599960131,
        "id": "g50l015",
        "permalink": "/r/wallstreetbets/comments/irnz5h/wants_anal/g50l015/",
        "score": 260,
        "subreddit": "wallstreetbets",
        "created": 1599988931.0
    },
    {
        "author": "yogaflame1337",
        "body": "Fidelity investments  \n\n\nEdit: My first-ever gold in my whole life THANK YOU SO MUCH!",
        "created_utc": 1599971573,
        "id": "g51je13",
        "permalink": "/r/wallstreetbets/comments/irnz5h/wants_anal/g51je13/",
        "score": 154,
        "subreddit": "wallstreetbets",
        "created": 1600000373.0
    },
    {
        "author": "c1utch10",
        "body": "It’s the latter. Direct investments by connecting buyers and sellers, but they are occasionally placed into mutual funds (a few Fidelity mutual funds own shares of SpaceX). Pre-IPO share exchanges is already a crowded market, but it’s a wise move by JPM due to tightening spreads for public equities (read: lower margins) and private companies continuing to delay going public.",
        "created_utc": 1599973272,
        "id": "g51p5ms",
        "permalink": "/r/investing/comments/irqgrk/jpmorgan_creates_new_team_to_trade_shares_of/g51p5ms/",
        "score": 64,
        "subreddit": "investing",
        "created": 1600002072.0
    },
    {
        "author": "wonderbrah419",
        "body": "I don't know about Fidelity but the Baron fund BPTRX currently has a 3.5% holding of SpaceX and a 44.2% in Tesla. [https://www.baronfunds.com/product-detail/baron-partners-fund-bptrx](https://www.baronfunds.com/product-detail/baron-partners-fund-bptrx)\n\nFund is still up 56% YTD even after the Tesla pullback.\n\n2% fee though. And I know it uses leverage.",
        "created_utc": 1599998735,
        "id": "g53g39v",
        "permalink": "/r/investing/comments/irqgrk/jpmorgan_creates_new_team_to_trade_shares_of/g53g39v/",
        "score": 38,
        "subreddit": "investing",
        "created": 1600027535.0
    },
    {
        "author": "chipsomb",
        "body": "What Fidelity mutual fund has SpaceX? I wouldn't mind getting some of that. Thanks.",
        "created_utc": 1599984929,
        "id": "g52ils7",
        "permalink": "/r/investing/comments/irqgrk/jpmorgan_creates_new_team_to_trade_shares_of/g52ils7/",
        "score": 31,
        "subreddit": "investing",
        "created": 1600013729.0
    },
    {
        "author": "mountainmonkey2",
        "body": "Fidelity needs to dump a ton of money into the people designing the UI for the mobile app",
        "created_utc": 1600313057,
        "id": "g5jqctk",
        "permalink": "/r/wallstreetbets/comments/iu6dr1/my_12_month_journey_from_500k_to_27m_with/g5jqctk/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1600341857.0
    },
    {
        "author": "x2c3v4b5",
        "body": "**Fidelity says we're in an early cycle bull market.** Predictions from anyone are pure garbage and I don't care if they are \"professionals\" (whatever that means). I state this with full disrespect. Anyone's opinions in agreeing or disagreeing is also bullshit because no one knows what the future holds. That's it, that's all. Discuss all you want, link your articles for back-up, but in the end, it is all bullshit. 😴",
        "created_utc": 1599260236,
        "id": "g422lau",
        "permalink": "/r/investing/comments/impi1l/fidelity_says_were_in_an_early_cycle_bull_market/g422lau/",
        "score": 25,
        "subreddit": "investing",
        "created": 1599289036.0
    },
    {
        "author": "DLAV8R",
        "body": "You can.  I had the chance to.  Fidelity requirements were minimum 500k in account.  I’m still waiting for the IPO bubble to pop before getting in.",
        "created_utc": 1600280940,
        "id": "g5hvr9k",
        "permalink": "/r/investing/comments/itzdp2/snowflake_opens_at_245_per_share_in_market_debut/g5hvr9k/",
        "score": 24,
        "subreddit": "investing",
        "created": 1600309740.0
    },
    {
        "author": "GaylrdFocker",
        "body": "No brokerage portfolios are FDIC insured, that's banking type accounts (savings, checking, CDs).  Brokerage usually have SIPC insurance, but most large brokers have private insurance that covers above the SIPC limit.\n\n[Here](https://www.fidelity.com/why-fidelity/safeguarding-your-accounts#:~:text=All%20Fidelity%20brokerage%20accounts%20are,since%20they%20are%20considered%20securities) is Fidelity's overview on it..",
        "created_utc": 1600404339,
        "id": "g5o8o7j",
        "permalink": "/r/investing/comments/iuyj0r/ipo_offers_from_fidelity/g5o8o7j/",
        "score": 23,
        "subreddit": "investing",
        "created": 1600433139.0
    },
    {
        "author": "dvdmovie1",
        "body": "\"Due to those losses, I stopped investing for a couple of months exactly when the prices were at minimum of the year.\"\n\nI think a broad issue with this sub that I've seen over the years is that people buy when things are good (eventually - this happens after a couple of months of half a dozen \"WHY IS THE MARKET GOING UP?\" threads every day), but when the market has a correction - something that used to be viewed as normal - it's viewed as almost apocalyptic. I saw a post the other day about Amazon being down 10% as a \"massive decline\" - if you cannot tolerate a 10% decline in Amazon don't own it, because there are times where that's the initial reaction to earnings. If a 10% decline throws your view of owning a company into question, then your thesis on why you bought it in the first place probably wasn't that strong. If something goes down 10% and you look at it in your portfolio and if your first instinct is to dump it, then that tells you exactly how strong you really feel about the company.  Growth stock investing is not going to be trees grow to the moon or years like this where Ark funds are up 70% or whatever they were; there's going to be periods that are highly volatile and far more volatile than the last month - look at growth names at the end of 2018.  This year with growth is not normal; it's a situation where things came together that benefited a lot of growth companies tremendously.\n\n1) I think people have to view a March when the VIX is 80 and the CNN Fear and Greed is 2 and yadda yadda as the time to really lean in. That's the time when if you have an even somewhat longer-term view you're getting opportunities. By the time this sub has warmed up to the market is not the time to lean in.\n\n2) People have to have a longer-term view and not this \"one foot out the door\" mentality where every bit of market volatility and events that might cause volatility is something to flee from. There's been way more threads in the last year where people talk about \"selling everything\" - not a decision that should be easy and a decision you should make very, very rarely - if ever. Volatility creates opportunities, you just have to think in months and years with purchases, not \"OMG WHAT IS THE MARKET GONNA DO TOMORROW?\"  \n\n\" I want to know how can I feel less sad about this.\"\n\nIt's a bummer and I'm sorry that you're dismayed at what happened but you're going to miss opportunities. Everyone does. I owned VFF when it was around $1 and sold not long before it went to $6 and then eventually the high teens. There's plenty of other instances over the years. I think what I'm looking for in terms of individual names has become specific enough that there are things that do well where I know I wouldn't have bought it any way, but with that it's not being bummed as much as trying to understand why it did well and any takeaways - could I have looked at it differently? Etc. If I missed something there's always going to be a bit of dismay, but I've gradually tried to be far more automated about it - is there is a lesson/takeaway from this? y/n? then move on.\n\nThere is going to be a lot of \"could haves\" throughout your time in investing. The issue I think becomes that was before and today is a new day - literally. Chasing now after what you could have done is not always going to be the best idea - have to look at it with a fresh perspective and consider what is the best long-term strategy to build on right now.\n\n\"When I backtested my ETF purchase across my deposit intervals, I found that I could have made 37.9% in returns\"\n\nCould have. I wouldn't base decision making on what things have done, the question becomes what is the potential going forward for the next 3-5 years. I look at my portfolio all the time with the thought of - if I was stuck with this portfolio tomorrow and couldn't sell it for 5 years, would I be okay with that? If something is a no, then changes need to be made. Things are bought with the intent of owning long-term and bought with the view of potential over the coming years. I have no idea what the market will do tomorrow or next week.\n\n\"When I want to invest smaller amounts of money, I have to rely on fractional shares and my brokerage doesn't provide that, so I have to shift to Robinhood or other trading platform.\"\n\nIf you want fractional shares, I'd much rather suggest Fidelity than RH. I don't see the appeal of RH at this point.\n\n\"AAPL 20%, MSFT 15%, AMZN 15%, \"\n\nSo half your portfolio is the household names everyone already knows, likes and probably owns. These are not bad companies and I think they will continue to do well in the future, but I also do think that it's at a point where people have to devote more if they're going to be in tech to finding growth beyond FANG names.",
        "created_utc": 1600518277,
        "id": "g5t2609",
        "permalink": "/r/investing/comments/ivoxva/story_of_how_i_tried_to_beat_the_market_and_failed/g5t2609/",
        "score": 22,
        "subreddit": "investing",
        "created": 1600547077.0
    },
    {
        "author": "dvdmovie1",
        "body": "\"But at some point valuations might be over-stretched, future growth priced in and no greater fool showing up to pass the hot potato.\"\n\nThe issue with this is that I've read \"DOT COM!\" \"BUBBLE!\" on here for 5 years. There have absolutely been major rotations out of tech at times over the last 5 years but if you regarded those as confirmation of your bias that everything is a bubble rather than as a buying opportunity then you've missed out. Buying what \"appeared cheap\" and/or was \"impacted\" earlier this year when markets were cratering has not turned out nearly as well as buying what this sub has continually complained about as being \"too expensive.\"\n\nWill that change? Quite possibly.  When? Nobody on here has any idea. But the issue I think becomes sort of like the people who said for the last 10 years that \"value has gotta make a comeback, right?\" Just because something is cheap does not mean it can't get cheaper, just because something seems expensive does not mean it cannot get moreso. Just because something has underperformed for 5 years does not mean that it can't continue to underperform for another 5.  Without a very distinct catalyst in mind, incessant top calling (and you've seen it on this sub for years) is often an error.  Without a catalyst in mind, calling something cheap can often wind up waiting while watching what's working continue to do so. This sub has talked up big oil this year a lot because of being impacted (this, after big oil names have largely disappointed for 5+ years before this) and when BP literally came out and predicted that \"oil demand growth may have peaked\" and a lot of the responses on here were basically: \"well, what do they know?\" Buffett sold airlines: \"well, what does he know?\"\n\nThere is an eagerness to dismiss tech and growth and embrace what is viewed as cheap but when what is viewed as cheap isn't working, people keep trying to will the trade into working. There was a great interview with Fidelity Contrafund manager Will Danoff the other day and I liked this particular part:\n\n\"So, I'd say it's a very healthy give-and-take and dialogue. And I would say, often because Joel and I and all the other fund managers started as Fidelity research analysts, when a new analyst arrives, they usually show up at my office with a list, and say “I'm the new railroad analyst. Here are my names, and I like XYZ railroad because the group's trading at 14 times earnings, and this ones trading at 11 times earnings.” And I might say, “Wow, that's interesting. Why is that one trading at such a discount to the group?” *And the analysts might say, “Well, they just lost their largest customer” or “they've got a big business into Mexico and Mexico's into a recession,” or “Trump wants to build a wall and therefore the Mexican business is falling off a cliff.” And I usually say, “That's not the type of company I'm interested in*. **I'm interested in companies that are doing well, where the earnings outlook is positive, where earnings per share is growing. Maybe it's growing faster than people think. What do you have on your list that would fit that bill even if it's more expensive than the average company in your group?”** So, it's that's sort of give-and-take. And I might encourage an analyst to reorient their priority list to help me look for stocks that fit my ideal pattern.\" I think this sub is often looking for the impacted, but maybe - just maybe - consider more the Danoff perspective. (https://www.morningstar.com/podcasts/the-long-view/40)\n\nAs for tech, there are things that are absolutely ahead (or well ahead) of themselves, but I wouldn't paint everything in tech with one broad brush or would I be a tech fund either (tech and healthcare are about 65%ish of my portfolio, with the latter making up a large chunk of that.) There's a lot of innovation going on beyond tech. \n\nIf you think that tech is overheated, that doesn't mean that looking into what's been the most impacted is the correct answer, either. What's somewhere in the middle? Something that isn't \"hot\", but also hasn't been obliterated and where you can make a good fundamental case (not just \"it's down a lot!\") for the company in the coming years?",
        "created_utc": 1600609097,
        "id": "g5z78v5",
        "permalink": "/r/investing/comments/iw9748/tech_tina_alternatives/g5z78v5/",
        "score": 20,
        "subreddit": "investing",
        "created": 1600637897.0
    },
    {
        "author": "DrKolagani",
        "body": "“Hey son are you investing in stocks now? Let me show you something”\n\nMy dad called me over to his laptop and opened his fidelity. This dude has 960k and needs +4% from the market to become a stock millionaire.\n\n18 years and he never told me he was this rich smh, guess that’s why he was so smug\n\nHe also right then and there liquidated 2k worth of  garbage and put it into tech because I said so\n\n\nEdit: He has about 650k of leveraged tech ETFs so just do that and it should work out alright",
        "created_utc": 1599010637,
        "id": "g3o45da",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3o45da/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1599039437.0
    },
    {
        "author": "Why_Hello_Reddit",
        "body": "Yeah and the banner humor is more original than 99% of the comments here. It's just getting stale is all.\n\nAnd solid derivatives advice isn't r/investing tier. Those pussies are too afraid to even learn how options work, even safe shit like covered calls, a strategy so fucking safe Fidelity advertises it to seniors to generate passive income on their stock holdings.",
        "created_utc": 1600275536,
        "id": "g5hkiog",
        "permalink": "/r/wallstreetbets/comments/itorj7/bet_the_majority_of_my_portfolio_on_aapl_calls/g5hkiog/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1600304336.0
    },
    {
        "author": "2-leet-2-compete",
        "body": "I finally started using RH this week. Option gambling on Fidelity feels dirty, like you're eating a greasy hotdog at a 3 star Michelin restaurant. \n\nBut on RH it feels encouraged. They dumb it down and make it easy to buy super shitty options. Im loving it so far.\n\ndO yoU tHiNk uPPie??? \n\nOk! Try this! Some risk, low chance of reward: AAPL 10/16 150C",
        "created_utc": 1601416202,
        "id": "g73z39u",
        "permalink": "/r/wallstreetbets/comments/j272rv/what_are_your_moves_tomorrow_september_30_2020/g73z39u/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1601445002.0
    },
    {
        "author": "ben51959",
        "body": "You can't for popular IPOs. I put in for shares on Fidelity but got zero SNOW. They only give it to you if they have allocation.",
        "created_utc": 1600291955,
        "id": "g5iktmd",
        "permalink": "/r/investing/comments/itzdp2/snowflake_opens_at_245_per_share_in_market_debut/g5iktmd/",
        "score": 15,
        "subreddit": "investing",
        "created": 1600320755.0
    },
    {
        "author": "TastyCuttlefish",
        "body": "Apple sold its Adobe position in *1989*. The top holder of ADBE is Vanguard Group, at 7.75%, followed by Fidelity and Blackrock. It’s not that hard to research this. \n\nPTON fell because the entire market fell. It was up 12% at points. I was holding 15,000 shares of it and sold at $98.15. I was watching it and continued throughout the trading day. \n\nYour analysis is based on really false information and across the board incorrect. I don’t think you should be giving advice.",
        "created_utc": 1599969618,
        "id": "g51cm2m",
        "permalink": "/r/options/comments/irnz8n/most_important_earnings_to_keep_track_of_this/g51cm2m/",
        "score": 15,
        "subreddit": "options",
        "created": 1599998418.0
    },
    {
        "author": "Myusernamegoesup",
        "body": "Confession: i had my wife change my pw on fidelity/RH to not panic sell long calls. Out of boredom Then i opened a webull account sold the shares($20) they gave me, bought tsm call made $100 on it and yoloed that into vale calls up 100% on those.🤷‍♂️",
        "created_utc": 1600389390,
        "id": "g5nioy9",
        "permalink": "/r/wallstreetbets/comments/iur9s9/what_are_your_moves_tomorrow_september_18_2020/g5nioy9/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1600418190.0
    },
    {
        "author": "DataWeenie",
        "body": "Newbies don't get access to IPOs.  At fidelity you have to have $100k in assets  to be eligible.\n\nYou can buy after it opens.",
        "created_utc": 1599768942,
        "id": "g4qomog",
        "permalink": "/r/investing/comments/iqb8my/new_to_investing_want_to_buy_snowflakes_ipo_but/g4qomog/",
        "score": 13,
        "subreddit": "investing",
        "created": 1599797742.0
    },
    {
        "author": "FantasyLandJester",
        "body": "Fidelity did, which is absurd compared to how fucking conservative they typically are.",
        "created_utc": 1600284857,
        "id": "g5i3omb",
        "permalink": "/r/wallstreetbets/comments/itzf8d/snow_319/g5i3omb/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1600313657.0
    },
    {
        "author": "pikindaguy",
        "body": "**Our Conclusion: Nikola is a Massive Fraud Constructed on Dozens of Lies\nSometimes people misspeak by accident. No one has a perfect memory, and we all occasionally get things wrong.**\n\nBut what we have witnessed at Nikola, and specifically from Trevor Milton, is a pattern of well-planned and deliberate acts of deception ranging from (a) the staging of non-working products as if fully functional, wrapped in numerous lies about capabilities that don’t exist; (b) the staging of misleading videos, which require extensive premeditation, planning and execution; (c) material lies about capabilities, partnerships and products that simply do not exist at all, on video and often in front of entire rooms full of people; and (d) a culture of secrecy and intimidation that to this point has largely kept it all under wraps.\n\n\n*We think Trevor Milton is incapable of telling the truth. We believe he lies like most people breathe. It is natural for him, and our extensive review of his history suggests it has been this way throughout his entire business career.*\n\nEvery now and then a story comes around that exposes how little the “experts” really know. Theranos had inked partnerships with Walgreens, Safeway, and Cleveland Clinic and had staffed its board with luminaries. Madoff raised billions in capital from sophisticated investors across the globe.\n\n*The remarkable thing about Nikola’s story is not that someone like Trevor Milton exists, but that he has managed to parlay his stories and lies into deals with some of the best manufacturers and partners in the world by claiming to own vast proprietary technology and having successfully built revolutionary products that simply didn’t exist.*\n\nHe transformed these deceptions and false promises into an empire that at one point was valued at $34 billion, larger than Ford and Fiat Chrysler. He’s signed deals with GM, Anheuser Busch, Bosch, Worthington, and a slew of significant automotive players. He received investment from Fidelity and ValueAct, among other name-brand institutions.\n\nWe truly think Nikola is both a sign of the times and a story for the ages.",
        "created_utc": 1599746892,
        "id": "g4ojh8s",
        "permalink": "/r/investing/comments/iq2sye/short_seller_hindenburg_alleges_that_electric/g4ojh8s/",
        "score": 12,
        "subreddit": "investing",
        "created": 1599775692.0
    },
    {
        "author": "FearlessTumbleweed",
        "body": "Fidelity certainly doesnt need Ackman to go public. C'mon guys",
        "created_utc": 1600468271,
        "id": "g5r2sz1",
        "permalink": "/r/SPACs/comments/iveeaj/guess_psth_target_based_on_bill_ackmans_interview/g5r2sz1/",
        "score": 12,
        "subreddit": "SPACs",
        "created": 1600497071.0
    },
    {
        "author": "Gorndog92",
        "body": "I use Fidelity, WebBull and RH. RH is my primary. \n\n\nWhy might you ask do I favor RH? The simplicity of it. So easy a 3rd grader could trade on it. In terms of research though, RH lacks immensely. \n\nI hate the options layout for WebBull. \n\nFidelity is solid, but I just find RH to be more user friendly.",
        "created_utc": 1601431782,
        "id": "g74qu3x",
        "permalink": "/r/pennystocks/comments/j2d7n6/why_is_robinhood_still_so_popular/g74qu3x/",
        "score": 12,
        "subreddit": "pennystocks",
        "created": 1601460582.0
    },
    {
        "author": "ChronicCSD",
        "body": "Wake up late, take a dump, login onto fidelity, have a slight heart attack, hold my fucking calls.",
        "created_utc": 1599181950,
        "id": "g3xl87t",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xl87t/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599210750.0
    },
    {
        "author": "khdo1992",
        "body": "Dude time to open fidelity account",
        "created_utc": 1600629434,
        "id": "g60mbvz",
        "permalink": "/r/wallstreetbets/comments/iwjhmq/was_assigned_wrong_strike_price_on_rh/g60mbvz/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600658234.0
    },
    {
        "author": "Dontlovemoney",
        "body": "Lol looked up on my fidelity account and I had bought shares of TSLA at $80, and sold at like $180 back when their battery’s we’re catching on fire for minute there...imagine I held that 6 more years 😂",
        "created_utc": 1599669041,
        "id": "g4k69pw",
        "permalink": "/r/wallstreetbets/comments/ipd82q/daily_discussion_thread_for_september_09_2020/g4k69pw/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599697841.0
    },
    {
        "author": "SagaStrider",
        "body": "I was disappointed to see how small the Fidelity SpaceX holdings are.",
        "created_utc": 1599984895,
        "id": "g52iivl",
        "permalink": "/r/investing/comments/irqgrk/jpmorgan_creates_new_team_to_trade_shares_of/g52iivl/",
        "score": 10,
        "subreddit": "investing",
        "created": 1600013695.0
    },
    {
        "author": "kidseal",
        "body": "I would think Ackman would pick a company with very broad investor name recognition.  One vote for Fidelity Investments.",
        "created_utc": 1600463294,
        "id": "g5qryjp",
        "permalink": "/r/SPACs/comments/iveeaj/guess_psth_target_based_on_bill_ackmans_interview/g5qryjp/",
        "score": 10,
        "subreddit": "SPACs",
        "created": 1600492094.0
    },
    {
        "author": "thalassamikra",
        "body": "If TSLA with 900 PE is insane (and it is) then what explains the lunacy of Fidelity with 1800 PE? Flies under the radar because CEO isn't shitposting on Twitter.",
        "created_utc": 1599612304,
        "id": "g4i0asr",
        "permalink": "/r/wallstreetbets/comments/ip118i/what_are_your_moves_tomorrow_september_09_2020/g4i0asr/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599641104.0
    },
    {
        "author": "Bweeze086",
        "body": "Fidelity.....",
        "created_utc": 1599079732,
        "id": "g3rnlse",
        "permalink": "/r/wallstreetbets/comments/ilfa94/mobile_trading/g3rnlse/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599108532.0
    },
    {
        "author": "AnnualClient2",
        "body": "lol op is netting only 5% on fidelity after 1.5yrs. he’s making poor choices on any broker",
        "created_utc": 1600805432,
        "id": "g68yic8",
        "permalink": "/r/wallstreetbets/comments/ixv3zg/why_robinhood_may_cause_you_to_lose_money/g68yic8/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600834232.0
    },
    {
        "author": "LSatou",
        "body": "Doubt it. Fidelity customer service rep was probably just inexperienced or made an error.",
        "created_utc": 1599932810,
        "id": "g4yblqy",
        "permalink": "/r/SPACs/comments/ireyk4/shll_corp_voluntary_action_to_redeem/g4yblqy/",
        "score": 10,
        "subreddit": "SPACs",
        "created": 1599961610.0
    },
    {
        "author": "dvdmovie1",
        "body": "This, to some degree: \"Train conceded value will become so unloved it will have to make a comeback, but warned that some of value investors’ most compelling opportunities will be revealed to be ruinous value traps, due to digital disruption.\" (https://portfolio-adviser.com/nick-train-value-was-a-20th-century-phenomenon/)\n\nVarious thoughts:\n\n1. I think actual compelling value ideas are difficult and few-and-far-between. There is this perception that everything that is big and known and down a lot is a compelling value when much of these are not and/or are value traps. Somewhat related, I really agree with this discussion by Fidelity Contrafund manager Will Danoff: https://pbs.twimg.com/media/EiEOiBRWoAQaPdZ?format=jpg&amp;name=medium on focusing on what is doing well.\n\n2. You have a time period where the new economy names are the focus and there has been significant growth pulled forward. I don't think that this current crisis \"changes everything\", but it has pulled forward growth in the winners and there are themes and behaviors that I think will carry forward for years after this is over. While many on here still seem to disagree with this, there have clearly been winners throughout this that have benefited, some significantly.\n\n3. The problem with that is that you basically have a crowding (this year it's been a stampede) into new economy names and people ignoring old economy names (and that does play to Train's discussion in that 2018 article: \"“In 2018 it looks as though working out which companies are advantaged and which challenged by digital disruption may deliver better returns than establishing what is currently ‘cheap’ or ‘dear’ or whether macro-economic trends favour ‘cyclical value’ or ‘quality growth’,” he said.\") A funny bit but I think this is very true this year - \"even when the market is in \"rotation\" mode, you can feel that moment intraday when people are like wtf am I doing, give me a hit of that sweet sweet digital transformation (https://twitter.com/modestproposal1/status/1293211807709003776) The problem with that is that you now have a lot of people focused on/crowding into one part of the market and it gets ahead of itself (and some niches way ahead of themselves.) There's no gradual cool off of what's done well, the rotations are total \"escalator up\" for months followed by these \"elevator down\" movements.\n\n4.  There will probably be a more sustained rotation if there was a real solution to this crisis, but even then I think my question becomes how \"sticky\" are people in various \"value\" sectors. A rotation out of the winners into losers doesn't fix the pre-existing issues of poorly run retailers but I think people confuse price increase with the idea that everything is a-okay now. I think a lot of impacted sectors are going to be to some degree impacted even after this is over. So I think ultimately the rotation out of winners into losers is more an opportunity to buy the winners and with the losers, you have to be selective.  I've talked up medical devices (SYK) as a sector given the procedure delays, but those are well off the lows. People just think everything impacted by this is a value and is going to be okay again after, I just don't feel that way - especially if this takes another year to before it's really solved.\n\n5. It's pretty telling that for all the outperformance of growth over the last decade that even in the midst of a pandemic, value still underperformed in the decline in March and then proceeded to spectacularly outperform post March low.  I do think that value will make a comeback, but it will probably be brief and I think people are going to have to be selective.",
        "created_utc": 1600424064,
        "id": "g5osy4l",
        "permalink": "/r/investing/comments/iv345y/what_do_you_think_of_the_long_term_prospects_for/g5osy4l/",
        "score": 10,
        "subreddit": "investing",
        "created": 1600452864.0
    },
    {
        "author": "SolitaryEgg",
        "body": "Imagine using fidelity as a brokerage lol\n\nThat's a retirement company bro",
        "created_utc": 1599020757,
        "id": "g3ol906",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3ol906/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599049557.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "I called Fidelity yesterday to complain that my transferred cash hadn’t settled and I wanted to buy shit. \n\nNow my second born child shall be named Fidelity.",
        "created_utc": 1599146911,
        "id": "g3uw9qs",
        "permalink": "/r/wallstreetbets/comments/ilqp2l/daily_discussion_thread_for_september_03_2020/g3uw9qs/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599175711.0
    },
    {
        "author": "aerrreaa",
        "body": "Can't believe I had to get up and login to Fidelity's pro platform to check futures. They're fine. Investing.com is just being a bitch and crashed. Fidelity is showing updates as of 1 min ago",
        "created_utc": 1599024278,
        "id": "g3opzcl",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3opzcl/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599053078.0
    },
    {
        "author": "BassilsBest",
        "body": "[fidelity stats](https://imgur.com/a/ldbPWmQ)",
        "created_utc": 1600447616,
        "id": "g5pv779",
        "permalink": "/r/stocks/comments/iv9i0r/msft_or_aapl_on_the_dip/g5pv779/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1600476416.0
    },
    {
        "author": "theta_eta_my_beta",
        "body": "Congratulations retards.\n\n[Manager Of $139BN Fidelity Fund Blames Robinhood For Exodus Of Client Money](https://tradeforprofit.net/2020/09/manager-of-139bn-fidelity-fund-blames-robinhood-for-exodus-of-client-money/)",
        "created_utc": 1600805888,
        "id": "g68zf3m",
        "permalink": "/r/wallstreetbets/comments/ixv5mz/what_are_your_moves_tomorrow_september_23_2020/g68zf3m/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1600834688.0
    },
    {
        "author": "lobster_johnson",
        "body": "Many mutual funds *are* index funds or hold REITs, and have very low fees, so this is misinformation at best.\n\nFor example, a popular mutual fund, VTSAX, has an annualized fee of 0.04% and tracks a total US stock market index. Vanguard, Schwab, Fidelity, BlackRock, etc. all have excellent, low-cost mutual funds.\n\nIf you want to rail against _actively managed_ mutual funds, that's a whole other kettle of fish, and I agree that one should generally avoid them.",
        "created_utc": 1599930075,
        "id": "g4y4rbq",
        "permalink": "/r/investing/comments/irbj4n/has_anyone_had_success_investing_in_private_real/g4y4rbq/",
        "score": 9,
        "subreddit": "investing",
        "created": 1599958875.0
    },
    {
        "author": "HolderofFour",
        "body": "Robinhood started the systemic ploy to get millennials and gen z who have been accustomed to instant gratification to dump their money into the market for when boomers die off. Toppled with student debt and bad money management, it is a perfect scenario for the big boys. Heck, firms like Fidelity even have these funds with buzzwords and ridiculous expense ratios to attract young people. Like what the fuck is a women’s and diversity fund?",
        "created_utc": 1600539734,
        "id": "g5ucld5",
        "permalink": "/r/wallstreetbets/comments/ivdifw/weekend_discussion_thread_for_the_weekend_of/g5ucld5/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1600568534.0
    },
    {
        "author": "Thisismyfinalstand",
        "body": "I'm lucky that I'm too dumb to buy options.\n\nOr too poor, Fidelity didn't exactly say which it was...",
        "created_utc": 1599152302,
        "id": "g3vbklc",
        "permalink": "/r/wallstreetbets/comments/ilsr15/tsla_call_holders_right_now/g3vbklc/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599181102.0
    },
    {
        "author": "Sane_Wicked",
        "body": "I'm looking at the bid/ask on Fidelity, it's up to $230 now.",
        "created_utc": 1600270056,
        "id": "g5h98t9",
        "permalink": "/r/stocks/comments/itx104/snowflake_at_80_two_days_ago_now_expected_to_be/g5h98t9/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1600298856.0
    },
    {
        "author": "numba20",
        "body": "On Fidelity it is SNPRU to buy not SNPR/U, manually hit the delete button to take out slash before U to purchase the stock if it gives you an error of ticker symbol not found.",
        "created_utc": 1600009162,
        "id": "g54afgp",
        "permalink": "/r/SPACs/comments/irzgy4/how_to_buy_snpr_units/g54afgp/",
        "score": 8,
        "subreddit": "SPACs",
        "created": 1600037962.0
    },
    {
        "author": "WrongWeekToQuit",
        "body": "That's for KKR underwritten offerings which aren't the \"big ones\".  If you want Credit Suisse underwritten IPOs, you need $500K.  For example, of the 6 IPOs offered by Fidelity right now, all are CS and none are KKR.",
        "created_utc": 1600431770,
        "id": "g5p1dnt",
        "permalink": "/r/investing/comments/iuyj0r/ipo_offers_from_fidelity/g5p1dnt/",
        "score": 8,
        "subreddit": "investing",
        "created": 1600460570.0
    },
    {
        "author": "rollickinggoodtime",
        "body": "Your Brittanica article makes reference to Apple threatening to sell its stake in Adobe in 1989, consistent with this [NYT article](https://www.nytimes.com/1989/07/07/business/apple-selling-adobe-stake-two-could-become-rivals.html), but I don't see anywhere that they ever effectuated that sale. Nevertheless, I think they must have, because the largest shareholders of ADBE are now Vanguard, Fidelity, Blackrock, SSGA, etc.",
        "created_utc": 1599965718,
        "id": "g5133ww",
        "permalink": "/r/options/comments/irnz8n/most_important_earnings_to_keep_track_of_this/g5133ww/",
        "score": 8,
        "subreddit": "options",
        "created": 1599994518.0
    },
    {
        "author": "escootme",
        "body": "It's pretty vaguely worded, but $100k \"in certain assets\" is the minimum.\n\n&gt;[Who is eligible to participate in an IPO at Fidelity Investments?  ](https://www.fidelity.com/stock-trading/faqs-ipos#)    \n&gt;  \n&gt;Eligibility for participation in traditional IPOs led by  Kohlberg Kravis Roberts &amp; Co. (KKR) is reserved for brokerage  customers with a minimum of $100,000 in certain assets at Fidelity.  Other providers of traditional IPOs, and other equity public offerings  made through Fidelity may be reserved for brokerage customers with a  minimum of $100,000 or $500,000 in certain assets at Fidelity. Members  of Premium Services are also eligible.  \n&gt;  \n&gt;The $500,000 or $100,000 requirement will be determined weekly by  aggregating all assets and trades in retail accounts which list the same  name and Social Security number and are maintained by Fidelity Service  Company, Inc. or Fidelity Brokerage Services LLC (excluding assets or  trades maintained on behalf of any divisions of Fidelity Investments  Institutional Services Company, such as 401(k) or 403(b) plan assets).  Other assets may be included in the calculation at our discretion. In  addition, an account in which an indication of interest is entered must  have at least $2,000 in cash or fully paid securities.",
        "created_utc": 1600409223,
        "id": "g5oevka",
        "permalink": "/r/investing/comments/iuyj0r/ipo_offers_from_fidelity/g5oevka/",
        "score": 8,
        "subreddit": "investing",
        "created": 1600438023.0
    },
    {
        "author": "estoy_al_pedo",
        "body": "It is not a lotto. Fidelity specifically states they rank you based on the amount of assets you have with Fidelity excluding 401k and the amount of “revenue” you generate:\n\nhttps://www.fidelity.com/stock-trading/faqs-ipos\n\nI imagine you need multimillion dollar portfolios to get shares in hot tickers.",
        "created_utc": 1600435046,
        "id": "g5p68uy",
        "permalink": "/r/investing/comments/iuyj0r/ipo_offers_from_fidelity/g5p68uy/",
        "score": 8,
        "subreddit": "investing",
        "created": 1600463846.0
    },
    {
        "author": "LMY723",
        "body": "Two PE Firm recruiters and Goldman Sachs recruiter added me on LinkedIn yesterday. I sent in those applications two weeks ago and been hustling with those companies for a couple months. Was kinda blue but then BAM. Hoping to schedule some interviews. \n\nJust got an email telling me I’m in second round of fidelity, and third round with a VC group in Zurich. \n\nKeep hustling boys, it may work out after all. 🌽",
        "created_utc": 1600545180,
        "id": "g5urc6z",
        "permalink": "/r/wallstreetbets/comments/ivdifw/weekend_discussion_thread_for_the_weekend_of/g5urc6z/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600573980.0
    },
    {
        "author": "3ebfan",
        "body": "Fidelity",
        "created_utc": 1600572718,
        "id": "g5x4bc0",
        "permalink": "/r/stocks/comments/iw3wmp/which_brokerage_account_for_a_young_investor/g5x4bc0/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1600601518.0
    },
    {
        "author": "----The_Truth-----",
        "body": "Must be your shitty positions because I trade with Fidelity and I guess they're cool with my shitty positions because they haven't reached out to me.",
        "created_utc": 1600266402,
        "id": "g5h23tj",
        "permalink": "/r/wallstreetbets/comments/itwbm3/fidelity_called_theyre_scared/g5h23tj/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600295202.0
    },
    {
        "author": "dannymcgee",
        "body": "FWIW, I'm a (hobbyist) Unity dev, and there are definitely some recent trends that are frustrating, but it really boils down to growing pains.\n\nFor a long time Unity was the cute little free engine for making dime-a-dozen mobile games and lightweight, browser-based knockoffs of bigger franchises. You *could* use it to target platforms like PC and consoles, but Unity games couldn't yield the quality and performance that something like Unreal could.\n\nSince John Riccitiello signed on, there's been a big push to make it a grown-up, do-everything, AAA-quality game engine that can compete on Unreal's level. There's been an absolute crap-ton of resources dumped into R&amp;D and engineering to improve the core engine at a pretty breakneck pace, and those improvements have consistently been really impressive.\n\nUnfortunately, what that means for Unity developers *right now* is that we're in this awkward limbo between the old legacy good-enough-for-prototyping systems and the new grown-up good-enough-for-AAA systems. A lot of the new systems are in beta, and are *really* enticing to start using now because the improvement over the old systems is like night and day, but they're also kind of a huge headache to work with because they're under active development, so the APIs are constantly changing, the UX is a little rough around the edges, and there are some missing features and the occasional bug that can be frustrating to work around.\n\nBut I've been around long enough to see at least a few of those systems go from unusable nightmare beta status to production-ready releases, and it's frankly amazing how fast it's happened and what a boon those new systems have been. For a couple examples:\n\n* The scriptable render pipelines bring an unprecedented level of flexibility (for a closed-source engine) to engineers who need more low-level control over rendering, and the two pre-packaged SRPs (URP and HDRP) bring an absolutely massive improvement in graphical fidelity and performance over the built-in renderer.\n* The new DOTS/ECS system is one of the single most exciting developments in gaming tech I've ever seen, and none of their competitors (even the smaller players like CryEngine and Godot) have anything close. I won't delve into the technical details here, but Unity's ECS system was *super* janky to work with as recently as a year ago, but I just gave it another test run the other weekend because I was curious to see how it's coming along, and was really impressed by how intuitive it was to work with and how fully-featured it is now. If you're willing to get your hands a little dirty, it's viable to build an entire Unity game with ECS today. If you wanted to do that with any other off-the-shelf engine, you would literally have to rewrite all of the core systems from scratch.\n\nAnyway, this comment is long enough, but to summarize: Yes, it can be annoying to work with right now, but there are good reasons for that. Unity is getting way better and way more capable than it's ever been, and it's doing it really, really fast.",
        "created_utc": 1600401215,
        "id": "g5o44w4",
        "permalink": "/r/investing/comments/iulv2q/unity_ipo/g5o44w4/",
        "score": 7,
        "subreddit": "investing",
        "created": 1600430015.0
    },
    {
        "author": "McPoyal",
        "body": "Trade on Fidelity or something and put on a trailing stop loss  maybe.  That's what I'm gonna start doing. I keep hittin sweet percentages and then get greedy or stupid and it usually doesn't work out...I'm often right, just not for that long.  So far anyway.  Onward and upward I suppose.",
        "created_utc": 1601349441,
        "id": "g70xa88",
        "permalink": "/r/wallstreetbets/comments/j1r5z1/well_that_was_fast_just_learned_about_debit/g70xa88/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1601378241.0
    },
    {
        "author": "SloviXxX",
        "body": "I picked a good time to transfer half my Fidelity account over to TW so I can’t trade with that money for a week",
        "created_utc": 1601442667,
        "id": "g758pu2",
        "permalink": "/r/wallstreetbets/comments/j272rv/what_are_your_moves_tomorrow_september_30_2020/g758pu2/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1601471467.0
    },
    {
        "author": "xCHETx",
        "body": "Be careful when you talk to them, they blocked my trading account saying I was rude. Pathetic company. Fidelity and TD are much better",
        "created_utc": 1600620546,
        "id": "g5zxzhc",
        "permalink": "/r/options/comments/iwgix3/etrade_margin_question/g5zxzhc/",
        "score": 7,
        "subreddit": "options",
        "created": 1600649346.0
    },
    {
        "author": "clairec295",
        "body": "It wasn't a ploy to get people to buy their stock, they've been doing really well recently with COVID-19 causing the demand of oil to go down and people need to store it.\n\nFidelity recently purchased a large stake in it (June) if that makes you feel any better. If it's a large % of your portfolio and you're not comfortable with it, I would trim some anyway.",
        "created_utc": 1600104172,
        "id": "g5968b0",
        "permalink": "/r/investing/comments/isp0vz/how_bad_of_an_investment_is_dht/g5968b0/",
        "score": 7,
        "subreddit": "investing",
        "created": 1600132972.0
    },
    {
        "author": "mrmoneyguesser",
        "body": "Not sure I can on fidelity I only see buy stocks not even options even tho I applied. Fidelity is wack sometimes",
        "created_utc": 1600033561,
        "id": "g5606vh",
        "permalink": "/r/StockMarket/comments/is52bx/wallstreetbets_now_controls_the_stock_market_the/g5606vh/",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1600062361.0
    },
    {
        "author": "fourjnk3",
        "body": "I can confirm that Fidelity does not charge fees for any of the items listed",
        "created_utc": 1599865047,
        "id": "g4vjf09",
        "permalink": "/r/SPACs/comments/ir11lr/very_high_spac_fees_from_broker_tda/g4vjf09/",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1599893847.0
    },
    {
        "author": "ts23_",
        "body": "Sitting here working my 9-5, drinking a black coffee, refreshing my boomer ass Fidelity account watching my hard earned money disappear. Is this what it’s like to be an adult?",
        "created_utc": 1599228881,
        "id": "g3ziueo",
        "permalink": "/r/wallstreetbets/comments/imddo3/daily_discussion_thread_for_september_04_2020/g3ziueo/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599257681.0
    },
    {
        "author": "DKNG-STONK",
        "body": "From my understanding, everywhere except RH and webull.\n\nI use fidelity. No commissions for buying and selling stocks/warrants, no minimums.",
        "created_utc": 1601414155,
        "id": "g73v3tk",
        "permalink": "/r/SPACs/comments/j1gmcd/shll_graf_merger_week_megathread/g73v3tk/",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1601442955.0
    },
    {
        "author": "visionridge",
        "body": "I use Fidelity. All things considered I'm pretty happy with them.",
        "created_utc": 1600454550,
        "id": "g5q9nm6",
        "permalink": "/r/SPACs/comments/ivbvre/schwab_reorganization_fee/g5q9nm6/",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1600483350.0
    },
    {
        "author": "oleosmirf",
        "body": "Fidelity takes 48 hours with no fee applied.",
        "created_utc": 1600535442,
        "id": "g5u1uab",
        "permalink": "/r/SPACs/comments/ivwbz4/how_long_does_your_broker_take_to_split_units/g5u1uab/",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1600564242.0
    },
    {
        "author": "wayyyv",
        "body": "Sitting on a load of bullish spreads and my account closed at $10,050 today. If we don’t open big green tomorrow fidelity is going to liquidate my account. Feeling like I might puke 🤢",
        "created_utc": 1600825372,
        "id": "g69yri7",
        "permalink": "/r/wallstreetbets/comments/ixv5mz/what_are_your_moves_tomorrow_september_23_2020/g69yri7/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600854172.0
    },
    {
        "author": "raiderkev",
        "body": "Fidelity just sold of my 0dtes, so I'm sure it'll pump now",
        "created_utc": 1599851161,
        "id": "g4uplau",
        "permalink": "/r/wallstreetbets/comments/iqnsjz/daily_discussion_thread_for_september_11_2020/g4uplau/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599879961.0
    },
    {
        "author": "lovelosingmoney",
        "body": "Trust me don’t listen to fidelity. Do you own research. The guy I called had no idea about warrants or SPACs it was really bad. I hold a lot of warrants, I’m questioning their ability to exercise them for me now",
        "created_utc": 1599932362,
        "id": "g4ya5rz",
        "permalink": "/r/SPACs/comments/ireyk4/shll_corp_voluntary_action_to_redeem/g4ya5rz/",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1599961162.0
    },
    {
        "author": "Slachi",
        "body": "I do everything in Excel but hit the buy button. Fidelity for the final steps.\n\nLazy 4-fund portfolio so no research needed, tho I watch investing.com for the pretty lights and memes.",
        "created_utc": 1599936415,
        "id": "g4yl71f",
        "permalink": "/r/investing/comments/irh7zu/whats_your_investment_setup_like_toolsappsnews/g4yl71f/",
        "score": 6,
        "subreddit": "investing",
        "created": 1599965215.0
    },
    {
        "author": "voxtrion",
        "body": "A mix of short term gambling and long term gambling. I use fidelity for that investing stuff. \n\nReally no difference other than mental accounting.",
        "created_utc": 1600539023,
        "id": "g5uafz1",
        "permalink": "/r/RobinHood/comments/ivwmqi/do_you_use_rh_for_short_term_or_long_term/g5uafz1/",
        "score": 6,
        "subreddit": "RobinHood",
        "created": 1600567823.0
    },
    {
        "author": "citroen6222",
        "body": "Schwab, fidelity, TD Ameritrade pretty sure they all do OTC",
        "created_utc": 1600098091,
        "id": "g58pwav",
        "permalink": "/r/pennystocks/comments/isia18/qutr_open_discussion/g58pwav/",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1600126891.0
    },
    {
        "author": "hightyde992",
        "body": "This. One sweet old lady at Fidelity has learned many new phrases over me not being thrilled with my fills.",
        "created_utc": 1600911273,
        "id": "g6dke5w",
        "permalink": "/r/wallstreetbets/comments/iynash/why_the_fuck_did_robinhood_sell_my_shares_at_22/g6dke5w/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600940073.0
    },
    {
        "author": "n-cend",
        "body": "Fidelity you bitch settle my cash already",
        "created_utc": 1598977219,
        "id": "g3ltgd3",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ltgd3/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599006019.0
    },
    {
        "author": "SloviXxX",
        "body": "Try being -378% on your naked puts. Margin call me Fidelity you fucking punk bitch\n\n&amp;#x200B;\n\n^((Im so scared))",
        "created_utc": 1599292310,
        "id": "g43h84e",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g43h84e/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599321110.0
    },
    {
        "author": "EithneDraoct",
        "body": "XOM is probably the best value play. I’ve started averaging in on some FENY, which is a fidelity energy index.\n\nIt’s down around 60% from its high and has exposure to all major oil companies.\n\nAlso, no wars. 🥳 I fuckin hate war.",
        "created_utc": 1599789501,
        "id": "g4s5u37",
        "permalink": "/r/stocks/comments/iqh1t5/blood_is_in_the_streets_for_oil_buy_now/g4s5u37/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1599818301.0
    },
    {
        "author": "spyaintnobitch",
        "body": "My Fidelity account got margin called and restricted. I had no idea I was in a margin call because the app doesn't show it, only the website does.\n\n Why I keep using these boomer apps I have no idea.",
        "created_utc": 1599108798,
        "id": "g3t8a7t",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3t8a7t/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599137598.0
    },
    {
        "author": "areyoume29",
        "body": "Enterprise Bechtel cox loves or fidelity each would work. My favorite would be enterprise.",
        "created_utc": 1600463017,
        "id": "g5qrcoj",
        "permalink": "/r/SPACs/comments/iveeaj/guess_psth_target_based_on_bill_ackmans_interview/g5qrcoj/",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1600491817.0
    },
    {
        "author": "mayor_of_tendie_town",
        "body": "Would prefer SpaceX or Starlink but would like Wawa, Chick-Fil-A, Bloomberg, or Fidelity also.",
        "created_utc": 1600469714,
        "id": "g5r5kad",
        "permalink": "/r/SPACs/comments/iveeaj/guess_psth_target_based_on_bill_ackmans_interview/g5r5kad/",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1600498514.0
    },
    {
        "author": "No_Strawberry1890",
        "body": "Fidelity.",
        "created_utc": 1600552678,
        "id": "g5vd35m",
        "permalink": "/r/SPACs/comments/iw0sw8/opinions_on_best_trading_apps/g5vd35m/",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1600581478.0
    },
    {
        "author": "Nosefuroughtto",
        "body": "~~Someone just bought 3.5 Million NKLA at \\~33.50. Hot damn.~~\n\n&amp;#x200B;\n\nFucking Fidelity Trader Pro corrected the volume. Nvm.",
        "created_utc": 1600186689,
        "id": "g5dbw8f",
        "permalink": "/r/wallstreetbets/comments/it5xpg/daily_discussion_thread_for_september_15_2020/g5dbw8f/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600215489.0
    },
    {
        "author": "WrongWeekToQuit",
        "body": "Not retail investors... just the officers and investment bankers.\n\nNow, Fidelity, if you sell IPO shares in under 30 days, they reserve the right to not let you participate in future IPOs.",
        "created_utc": 1600131100,
        "id": "g5b3za1",
        "permalink": "/r/investing/comments/isy3b3/snowflake_lockup_period_for_retail_investors_91/g5b3za1/",
        "score": 6,
        "subreddit": "investing",
        "created": 1600159900.0
    },
    {
        "author": "somanychins",
        "body": "Damn, you literally cannot short sell NKLA at least via fidelity, no shares available to borrow.",
        "created_utc": 1600097532,
        "id": "g58ocqf",
        "permalink": "/r/wallstreetbets/comments/isi7v8/daily_discussion_thread_for_september_14_2020/g58ocqf/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600126332.0
    },
    {
        "author": "mrzane24",
        "body": "Maybe I'm just an old guy, but I have brokerage with fidelity.",
        "created_utc": 1600564001,
        "id": "g5wclt0",
        "permalink": "/r/stocks/comments/iw3wmp/which_brokerage_account_for_a_young_investor/g5wclt0/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1600592801.0
    },
    {
        "author": "LSatou",
        "body": "&gt;I’m a noob I have no clue what that means.\n\nOTC stocks that don't report to otcmarkets.com are considered \"dark.\" When they report their financials they regain \"current\" status.\n\nFidelity is an example of a broker that doesn't allow trading of dark securities. Aside from that, if a company has no released financial data it's quite difficult for investors to actually valuate the company.\n\nGoing current should explain the run up from today, but I know literally nothing about this company so can't comment on what to expect in the future. \n\n&gt;Green or red tmrw?\n\nProbably just... Never type this again. Especially in reference to something that ran 300% in a day lol. Nobody knows the future and you shouldn't be making your trading decisions based on predictions of others. Use the information that others have to make your own conclusions.",
        "created_utc": 1600217681,
        "id": "g5f9787",
        "permalink": "/r/pennystocks/comments/itktpe/confused/g5f9787/",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1600246481.0
    },
    {
        "author": "dante21oliva",
        "body": "Dam this interesting, I’m 85% 15% on fidelity and robinhood and I’ve definitely felt myself being more likely to lose my robinhood money making decisions off emotion compared to fidelity.",
        "created_utc": 1600805196,
        "id": "g68y15o",
        "permalink": "/r/wallstreetbets/comments/ixv3zg/why_robinhood_may_cause_you_to_lose_money/g68y15o/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600833996.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Is fidelity the most boomer broker out there.",
        "created_utc": 1600121621,
        "id": "g5akzts",
        "permalink": "/r/wallstreetbets/comments/issvr0/what_are_your_moves_tomorrow_september_15_2020/g5akzts/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600150421.0
    },
    {
        "author": "HolderofFour",
        "body": "Imagine some kid got on daddy’s Fidelity account and sold all his assets and bought Tesla at the top today. 🐻🏳️‍🌈",
        "created_utc": 1599069652,
        "id": "g3qwjep",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qwjep/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599098452.0
    },
    {
        "author": "alwayslookingout",
        "body": "According to Fidelity you should have 3x your income by 40. If you count both your retirement and house equity you guys are behind. Of course this isn’t an absolute rule by any means but what Fidelity’s research shows.\n\nIf you go by the 4% rule you’ll need 25x your expected annual expenses in your retirement to never run out of money. Going with $40K/year would mean you’ll need $1M, which is very doable given you still have 15-20 years of peak income earning potential. Not to mention that most people who retire will still earn some type of supplement income (e.g. your pension) and collect some sort of social security.",
        "created_utc": 1599934191,
        "id": "g4yfa06",
        "permalink": "/r/investing/comments/irggof/are_we_doing_enough/g4yfa06/",
        "score": 5,
        "subreddit": "investing",
        "created": 1599962991.0
    },
    {
        "author": "Ophienicus",
        "body": "I wouldn’t be opposed to a fidelity my bookie situation.",
        "created_utc": 1600605337,
        "id": "g5yy8dc",
        "permalink": "/r/wallstreetbets/comments/ivdifw/weekend_discussion_thread_for_the_weekend_of/g5yy8dc/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600634137.0
    },
    {
        "author": "MaksG",
        "body": "Opened fidelity account and the mobile version sucks, I can do a trade on thinkorswim in few clicks and fidelity seems to be a clusterfuck",
        "created_utc": 1600649919,
        "id": "g61wajv",
        "permalink": "/r/wallstreetbets/comments/iwl5kb/what_are_your_moves_tomorrow_september_21_2020/g61wajv/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600678719.0
    },
    {
        "author": "mikedpoisson",
        "body": "No fee on Fidelity.",
        "created_utc": 1600117118,
        "id": "g5a9io2",
        "permalink": "/r/SPACs/comments/ismg3t/weekly_discussion_september_14th_september_20th/g5a9io2/",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1600145918.0
    },
    {
        "author": "Berrymore13",
        "body": "Man the beginners luck is real lmao. I have a buddy that actually works for Fidelity, but he finally just started fucking with options for the first time last Wednesday. Went in hot and threw down $3k EACH on TSLA and SPY as his first two and only plays so far. Two of the most volatile tickers where you can lose it all almost instantly. He’s up $5k in less than a week of ever trading options, and here I am down $5.5k after doing this for months and months 😅",
        "created_utc": 1601346758,
        "id": "g70sm5x",
        "permalink": "/r/wallstreetbets/comments/j1jqk5/what_are_your_moves_tomorrow_september_29_2020/g70sm5x/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1601375558.0
    },
    {
        "author": "bigcansguy",
        "body": "Use fidelity",
        "created_utc": 1599854408,
        "id": "g4uwwrv",
        "permalink": "/r/RobinHood/comments/iqub5l/how_do_i_get_robinhood_to_add_a_stock_that_isnt/g4uwwrv/",
        "score": 5,
        "subreddit": "RobinHood",
        "created": 1599883208.0
    },
    {
        "author": "Gaston44",
        "body": "How is AAPL down if on Fidelity 80% of the orders have been buys for it",
        "created_utc": 1599155692,
        "id": "g3vl53m",
        "permalink": "/r/wallstreetbets/comments/ilqp2l/daily_discussion_thread_for_september_03_2020/g3vl53m/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599184492.0
    },
    {
        "author": "chucktownhorn",
        "body": "For Fidelity, you need 100k in a brokerage account for KKG underwriting the IPO and 500k for everyone else. SNOW was Goldman Sachs and JPMorgan(i think) so you would need 500k in a single brokerage account to get a shot.\n\nEdit: Nvm, should have read a little lower.",
        "created_utc": 1600292566,
        "id": "g5im7o4",
        "permalink": "/r/investing/comments/itzdp2/snowflake_opens_at_245_per_share_in_market_debut/g5im7o4/",
        "score": 5,
        "subreddit": "investing",
        "created": 1600321366.0
    },
    {
        "author": "Napalm32",
        "body": "Fidelity",
        "created_utc": 1600204167,
        "id": "g5eivuq",
        "permalink": "/r/stocks/comments/ithorx/need_help_investing_in_tesla/g5eivuq/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1600232967.0
    },
    {
        "author": "WeakPressure1",
        "body": "good luck to everyone! No way im touching this but im having fun watching\n\nedit: fidelity ask shows $195",
        "created_utc": 1600268138,
        "id": "g5h5g1g",
        "permalink": "/r/stocks/comments/itwew0/snowflake_is_now_indicating_at_160_per_share/g5h5g1g/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1600296938.0
    },
    {
        "author": "LSatou",
        "body": "Perfect OTC broker. Hours don't matter because no extended hours for OTC. Interface sucks but whatever. \n\nSlightly better than fidelity because you can trade dark pink sheets if that's your thing.",
        "created_utc": 1600470886,
        "id": "g5r7ldo",
        "permalink": "/r/pennystocks/comments/ivgg06/charles_schwab/g5r7ldo/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1600499686.0
    },
    {
        "author": "cyzenl",
        "body": "Months of unrest with Global pandemic in an election year with Trump?\nI use Fidelity but ignore their analysis",
        "created_utc": 1599262918,
        "id": "g42830u",
        "permalink": "/r/investing/comments/impi1l/fidelity_says_were_in_an_early_cycle_bull_market/g42830u/",
        "score": 5,
        "subreddit": "investing",
        "created": 1599291718.0
    },
    {
        "author": "JefBezosExWifesNewBF",
        "body": "Can fidelity set up a sportsbook so i can gamble with my ira",
        "created_utc": 1600605226,
        "id": "g5yxy57",
        "permalink": "/r/wallstreetbets/comments/ivdifw/weekend_discussion_thread_for_the_weekend_of/g5yxy57/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600634026.0
    },
    {
        "author": "JayAreOhhh",
        "body": "Negative, jump on Fidelity. If I were loading up from the beginning I would have been on there. Free OTC trades while us other get probed by commission fees.",
        "created_utc": 1601247314,
        "id": "g6wbumz",
        "permalink": "/r/pennystocks/comments/j10fv6/clis_dd_a_fresh_look_at_the_pennystock_that/g6wbumz/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1601276114.0
    },
    {
        "author": "Trottingslug",
        "body": "Just fyi: the major catalyst isn't until Wednesday (app launch) and this stock is also going to be a solid growth mid to long-term play, so you still have time to set up an account in Fidelity, TDA, etc. and buy shares before then.",
        "created_utc": 1601254329,
        "id": "g6wo7o6",
        "permalink": "/r/pennystocks/comments/j10fv6/clis_dd_a_fresh_look_at_the_pennystock_that/g6wo7o6/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1601283129.0
    },
    {
        "author": "ridinderty",
        "body": "I concur, Fidelity customer service is only second to Tings imo. Both outstanding everytime I've called.",
        "created_utc": 1599873259,
        "id": "g4vx9g6",
        "permalink": "/r/SPACs/comments/ir11lr/very_high_spac_fees_from_broker_tda/g4vx9g6/",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1599902059.0
    },
    {
        "author": "Slachi",
        "body": "wow...Fidelity actually transferred cash in less than 24 hours. That's never happened before. They must want me to lose more money.\n\nBuying the BND dip lul",
        "created_utc": 1599243895,
        "id": "g40qziw",
        "permalink": "/r/wallstreetbets/comments/imddo3/daily_discussion_thread_for_september_04_2020/g40qziw/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599272695.0
    },
    {
        "author": "Stonkbull13",
        "body": "24 yr old. Investing for 10 years now, planning to let it sit for another 10 years hopefully, thoughts?  \n\n450 shares QQQ \n\n430 shares SPY \n\n100 shares BAC \n\n25 shares JPM \n\n115 shares IWM \n\n10 shares DOCU \n\n15 shares Visa \n\n25 shares MRK \n\n40 shares INTC \n\n29 shares GPN \n\n6 shares GOOGL \n\n 7 shares FB \n\n15 shares DIS \n\n25 shares BABA \n\n1 share AMZN \n\n5 shares PTON \n\nCalls on \nMRK \nGOOGL \nBABA \nTQQQ \nAAPL \nPFE \nWORK",
        "created_utc": 1599324903,
        "id": "g454ffn",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g454ffn/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599353703.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  8th of September\n\n\n\n## Upcoming events for Tuesday, September  8th\n\n - Stock splits:\n\n    - BIOC @ **1:10**\n    - PRGCF @ **1:10**\n\n - Expected earnings:\n\n  ABM, ANAT, ASFI, AZRX, BWL.A, CASY, CIG, COE, COUP, CVGW, CVV, DRD, GEC, HMY, HQY, IDXG, KBSF, KEQU, KTRA, LULU, METX, MFAC, NSSC, PHR, PPIH, SCPE, SEAC, TC, TEUM, UEC, UTSI, UXIN, WKEY, WORK\n\n - Ex-div:\n\n  AEE, AVT, BBDC, BDX, CNI, HPE, HPQ, INSW, JKHY, LANC, LHX, OBCI, PEG, RCI, STNG, TFSL\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.115%)\n    - 3-Year Note Auction (previous: 0.179%)\n    - 52-Week Bill Auction (previous: 0.140%)\n    - 6-Month Bill Auction (previous: 0.105%)\n    - CB Employment Trends Index (previous: 50.89)\n    - Consumer Credit (consensus: 13.50B, previous: 8.95B)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - NFIB Small Business Optimism (previous: 98.8)\n\n## Upcoming events for Wednesday, September  9th\n\n - Stock splits:\n\n    - ALEDY @ **16:5**\n\n - Expected earnings:\n\n  ACB, AEO, AKER, ALOT, AMRH, APWC, ATLC, AVAV, AXR, BBCP, BCOW, BIGC, BROG, CBLI, CEI, CTXR, CVU, DSGX, EPM, FMCI, GFN, GIII, GME, HDS, HMG, HOTH, HTHT, HUSA, KEP, KFFB, LAKE, LMFA, LMNR, LOVE, MCFT, MEIP, NAV, OBSV, PRCP, PSV, QTT, REVG, RH, SCWX, SGMA, SLQT, STRM, TDAC, VERX, VRNT, WORX, WUBA, YGYI, YTRA, ZNH, ZS\n\n - Ex-div:\n\n  AAT, ANTM, CASH, CME, DHF, FNV, GPN, HOG, KIM, LADR, MDU, MGM, MPW, NEM, NRIM, PPL, PPR, SJI, TRTN, TRV, TU, UBCP, UMBF, VCTR, VFC\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.660%)\n    - API Weekly Crude Oil Stock (previous: -6.360M)\n    - Cushing Crude Oil Inventories (previous: 0.110M)\n    - EIA Short-Term Energy Outlook\n    - JOLTs Job Openings (consensus: 6.000M, previous: 5.889M)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -2.0%)\n    - MBA Purchase Index (previous: 309.6)\n    - Mortgage Market Index (previous: 755.1)\n    - Mortgage Refinance Index (previous: 3,316.2)\n    - Redbook (previous: 4.6%)\n    - Redbook (previous: 5.8%)\n    - Seevol Cushing Storage Report (previous: -1.368M)\n    - Thomson Reuters IPSOS PCSI (previous: 47.05)\n\n## Upcoming events for Thursday, September 10th\n\n - Stock splits:\n\n    - ALEDY @ **16:5** (Payable date: 09/09/2020)\n\n - Expected earnings:\n\n  AIM, AMRK, ANPC, BIOX, CHWY, CKX, CLUB, CPAH, DSWL, FARM, FCEL, FFBW, FLR, FLUX, GRNQ, GTT, JG, LPTH, LTRX, ORCL, PBIO, PCYG, PLAY, PTN, PTON, PZG, RFIL, RLGT, SCX, UEPS, VEDL, VITL, VNCE, VOLT, WVFC, ZUMZ\n\n - Ex-div:\n\n  ACV, ADP, AIO, AL, AMSF, BIG, BSIG, BTO, CAI, CAL, CBH, CRWS, CTXS, DCF, DKS, ECC, EFL, EHT, EIC, ENS, EVF, EXPO, FDUS, FFIC, FHN, FIS, FISI, FMNB, FRO, FUSB, G, GARS, GFI, GHY, HEQ, HPF, HPI, HPS, HRB, HTD, HTY, ICFI, IIIN, ISD, ITT, JHI, JHS, KFRC, KIO, LGI, MANT, NCV, NCZ, NDAQ, NRGX, NSP, NTRS, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RVT, SAMG, SNDR, SPTN, SR, TCBK, THG, TXT, UBSI, UNTY, VGI, VSH, WMB, WSBC, ZTR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.406%)\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 12,900K, previous: 13,254K)\n    - Core PPI (consensus: 0.2%, previous: 0.5%)\n    - Core PPI (consensus: 0.3%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.655M)\n    - Crude Oil Inventories (consensus: -1.887M, previous: -9.362M)\n    - Distillate Fuel Production (previous: -0.343M)\n    - EIA Refinery Crude Runs  (previous: -0.844M)\n    - EIA Weekly Distillates Stocks (consensus: -1.357M, previous: -1.676M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -5.2%, previous: -5.3%)\n    - Gasoline Inventories (consensus: -3.036M, previous: -4.320M)\n    - Gasoline Production (previous: 0.016M)\n    - Heating Oil Stockpiles (previous: 0.280M)\n    - Initial Jobless Claims (consensus: 846K, previous: 881K)\n    - Jobless Claims 4-Week Avg. (previous: 991.75K)\n    - Natural Gas Storage (consensus: 34B, previous: 35B)\n    - PPI (consensus: -0.3%, previous: -0.4%)\n    - PPI (consensus: 0.2%, previous: 0.6%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -1.4%)\n    - Wholesale Trade Sales (consensus: 4.9%, previous: 8.8%)\n\n## Upcoming events for Friday, September 11th\n\n - Expected earnings:\n\n  ATNM, CNNB, EVI, FONR, FSEA, GMHI, GROW, GVA, IBIO, JVA, KR, LFAC, MARPS, NFIN, NNVC, UTZ, VALU, VIRC\n\n - Ex-div:\n\n  AME, CCBG, CCD, CGO, CHI, CHW, CMCT, CPZ, CSQ, CWH, DVN, EDF, EDI, EOD, ESCA, FCNCA, GROW, JRVR, PTR, RRBI, SPR, UNH\n\n - Economic events and announcements:\n\n    - CPI (consensus: 0.3%, previous: 0.6%)\n    - CPI (consensus: 1.2%, previous: 1.0%)\n    - CPI Index, n.s.a. (consensus: 259.51, previous: 259.10)\n    - CPI Index, s.a (previous: 258.72)\n    - CPI, n.s.a (previous: 0.51%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.2%, previous: 0.6%)\n    - Core CPI (consensus: 1.6%, previous: 1.6%)\n    - Core CPI Index (previous: 267.72)\n    - Federal Budget Balance (consensus: -240.0B, previous: -63.0B)\n    - Real Earnings (previous: -0.6%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 181)\n    - U.S. Baker Hughes Total Rig Count (previous: 254)\n    - WASDE Report\n\n^^^^2020-09-08",
        "created_utc": 1599559215,
        "id": "g4femna",
        "permalink": "/r/RobinHood/comments/ioquxd/daily_discussion_thread_september_8th_2020/g4femna/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1599588015.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  9th of September\n\n\n\n## Upcoming events for Wednesday, September  9th\n\n - Stock splits:\n\n    - ALEDY @ **16:5**\n\n - Expected earnings:\n\n  ACB, AEO, AKER, ALOT, AMRH, APWC, ATLC, AVAV, AXR, BBCP, BCOW, BIGC, BROG, CBLI, CEI, CTXR, CVU, DSGX, EPM, FMCI, GFN, GIII, GME, HDS, HMG, HOTH, HTHT, HUSA, KEP, KFFB, LAKE, LMFA, LMNR, LOVE, MCFT, MEIP, NAV, OBSV, PRCP, PSV, QTT, REVG, RH, SCWX, SGMA, SLQT, STRM, TDAC, VERX, VRNT, WORX, WUBA, YGYI, YTRA, ZNH, ZS\n\n - Ex-div:\n\n  AAT, ANTM, CASH, CME, DHF, FNV, GPN, HOG, KIM, LADR, MDU, MGM, MPW, NEM, NRIM, PPL, PPR, SJI, TRTN, TRV, TU, UBCP, UMBF, VCTR, VFC\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.660%)\n    - API Weekly Crude Oil Stock (previous: -6.360M)\n    - Cushing Crude Oil Inventories (previous: 0.110M)\n    - EIA Short-Term Energy Outlook\n    - JOLTs Job Openings (consensus: 6.000M, previous: 5.889M)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -2.0%)\n    - MBA Purchase Index (previous: 309.6)\n    - Mortgage Market Index (previous: 755.1)\n    - Mortgage Refinance Index (previous: 3,316.2)\n    - Redbook (previous: 4.6%)\n    - Redbook (previous: 5.8%)\n    - Seevol Cushing Storage Report (previous: -1.368M)\n    - Thomson Reuters IPSOS PCSI (previous: 47.05)\n\n## Upcoming events for Thursday, September 10th\n\n - Stock splits:\n\n    - ALEDY @ **16:5** (Payable date: 09/09/2020)\n\n - Expected earnings:\n\n  AIM, AMRK, ANPC, BIOX, BNTC, CHWY, CKX, CLUB, CPAH, DSWL, FARM, FCEL, FFBW, FIZZ, FLR, FLUX, GRNQ, GTT, JG, KZIA, LPTH, LTRX, ORCL, PBIO, PCYG, PDEX, PLAY, PTN, PTON, PZG, RFIL, RLGT, SCX, SHLO, UBA, UBP, UEPS, VEDL, VITL, VNCE, VOLT, WVFC, ZUMZ\n\n - Ex-div:\n\n  ACV, ADP, AIO, AL, AMSF, BIG, BSIG, BTO, CAI, CAL, CBH, CRWS, CTXS, DCF, DKS, ECC, EFL, EHT, EIC, ENS, EVF, EXPO, FDUS, FFIC, FHN, FIS, FISI, FMNB, FRO, FUSB, G, GARS, GFI, GHY, HEQ, HPF, HPI, HPS, HRB, HTD, HTY, ICFI, IIIN, ISD, ITT, JHI, JHS, KFRC, KIO, LGI, MANT, NCV, NCZ, NDAQ, NRGX, NSP, NTRS, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RVT, SAMG, SNDR, SPTN, SR, TCBK, THG, TXT, UBSI, UNTY, VGI, VSH, WMB, WSBC, ZTR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.406%)\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 12,925K, previous: 13,254K)\n    - Core PPI (consensus: 0.2%, previous: 0.5%)\n    - Core PPI (consensus: 0.3%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.655M)\n    - Crude Oil Inventories (consensus: -1.075M, previous: -9.362M)\n    - Distillate Fuel Production (previous: -0.343M)\n    - EIA Refinery Crude Runs  (previous: -0.844M)\n    - EIA Weekly Distillates Stocks (consensus: -0.250M, previous: -1.676M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.1%, previous: -5.3%)\n    - Gasoline Inventories (consensus: -2.225M, previous: -4.320M)\n    - Gasoline Production (previous: 0.016M)\n    - Heating Oil Stockpiles (previous: 0.280M)\n    - Initial Jobless Claims (consensus: 846K, previous: 881K)\n    - Jobless Claims 4-Week Avg. (previous: 991.75K)\n    - Natural Gas Storage (consensus: 34B, previous: 35B)\n    - PPI (consensus: -0.3%, previous: -0.4%)\n    - PPI (consensus: 0.2%, previous: 0.6%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -1.4%)\n    - Wholesale Trade Sales (consensus: 2.8%, previous: 8.8%)\n\n## Upcoming events for Friday, September 11th\n\n - Expected earnings:\n\n  ANIX, ATHE, ATNM, BRC, CNNB, EVI, FONR, FSEA, GMHI, GROW, GVA, IBIO, IMRN, IRCP, JVA, KR, LFAC, MARPS, MSB, NFIN, NNVC, PKX, UTZ, VALU, VIRC, YIN\n\n - Ex-div:\n\n  AME, CCBG, CCD, CGO, CHI, CHW, CMCT, CPZ, CSQ, CWH, DVN, EDF, EDI, EOD, ESCA, FCNCA, GROW, JRVR, NFJ, NIE, PTR, RRBI, SPR, UNH\n\n - Economic events and announcements:\n\n    - CPI (consensus: 0.3%, previous: 0.6%)\n    - CPI (consensus: 1.2%, previous: 1.0%)\n    - CPI Index, n.s.a. (consensus: 259.52, previous: 259.10)\n    - CPI Index, s.a (previous: 258.72)\n    - CPI, n.s.a (previous: 0.51%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.2%, previous: 0.6%)\n    - Core CPI (consensus: 1.6%, previous: 1.6%)\n    - Core CPI Index (previous: 267.72)\n    - Federal Budget Balance (consensus: -245.0B, previous: -63.0B)\n    - Real Earnings (previous: -0.6%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 181)\n    - U.S. Baker Hughes Total Rig Count (previous: 254)\n    - WASDE Report\n\n^^^^2020-09-09",
        "created_utc": 1599645613,
        "id": "g4j6rx2",
        "permalink": "/r/RobinHood/comments/ipd2f1/daily_discussion_thread_september_9th_2020/g4j6rx2/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1599674413.0
    },
    {
        "author": "cclem0013",
        "body": "GPN",
        "created_utc": 1599050250,
        "id": "g3plxfe",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3plxfe/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599079050.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  7th of September\n\n\n\n## Upcoming events for Monday, September  7th\n\n - Expected earnings:\n\n  CBAT, EBR, EBR.B, GRAF, HCAC, HJLI, HPK, JT, PLAG, QD, SAMA, SINA, THCA, THCB, WB\n\n - Economic events and announcements:\n\n    - Investing.com Gold Index (actual: 56.3%, previous: 54.7%)\n    - Investing.com S&amp;P 500 Index (actual: 34.5%, previous: 28.6%)\n    - United States - Labor Day\n\n## Upcoming events for Tuesday, September  8th\n\n - Stock splits:\n\n    - PRGCF @ **1:10**\n\n - Expected earnings:\n\n  ABM, ANAT, ASFI, AZRX, BWL.A, CASY, CIG, COE, COUP, CVGW, CVV, DRD, GEC, HMY, HQY, IDXG, KBSF, KEQU, KTRA, LULU, METX, MFAC, NSSC, PHR, PPIH, SCPE, SEAC, TC, TEUM, UEC, UTSI, UXIN, WORK\n\n - Ex-div:\n\n  AEE, AVT, BBDC, BDX, CNI, HPE, HPQ, INSW, JKHY, LANC, LHX, OBCI, PEG, RCI, STNG, TFSL\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.115%)\n    - 3-Year Note Auction (previous: 0.179%)\n    - 52-Week Bill Auction (previous: 0.140%)\n    - 6-Month Bill Auction (previous: 0.105%)\n    - CB Employment Trends Index (previous: 50.89)\n    - Consumer Credit (consensus: 13.75B, previous: 8.95B)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - NFIB Small Business Optimism (previous: 98.8)\n\n## Upcoming events for Wednesday, September  9th\n\n - Stock splits:\n\n    - ALEDY @ **16:5**\n\n - Expected earnings:\n\n  ACB, AEO, AKER, ALOT, AMRH, APWC, ATLC, AVAV, AXR, BBCP, BCOW, BIGC, BROG, CBLI, CEI, CTXR, CVU, DSGX, EPM, FMCI, GFN, GIII, GME, HDS, HMG, HOTH, HTHT, HUSA, KEP, KFFB, LAKE, LMFA, LMNR, LOVE, MCFT, MEIP, NAV, OBSV, ORCL, REVG, RH, SCWX, SGMA, SLQT, STRM, TDAC, VERX, VRNT, WORX, WUBA, YGYI, ZNH, ZS\n\n - Ex-div:\n\n  AAT, ANTM, CASH, CME, DHF, FNV, GPN, HOG, KIM, LADR, MDU, MGM, MPW, NEM, NRIM, PPL, PPR, SJI, TRTN, TRV, TU, UBCP, UMBF, VCTR, VFC\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.660%)\n    - API Weekly Crude Oil Stock (previous: -6.360M)\n    - Cushing Crude Oil Inventories (previous: 0.110M)\n    - EIA Short-Term Energy Outlook\n    - JOLTs Job Openings (consensus: 6.000M, previous: 5.889M)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -2.0%)\n    - MBA Purchase Index (previous: 309.6)\n    - Mortgage Market Index (previous: 755.1)\n    - Mortgage Refinance Index (previous: 3,316.2)\n    - Redbook (previous: 4.6%)\n    - Redbook (previous: 5.8%)\n    - Seevol Cushing Storage Report (previous: -1.368M)\n    - Thomson Reuters IPSOS PCSI (previous: 47.05)\n\n## Upcoming events for Thursday, September 10th\n\n - Stock splits:\n\n    - ALEDY @ **16:5** (Payable date: 09/09/2020)\n\n - Expected earnings:\n\n  AIM, AMRK, ANPC, BIOX, CHWY, CKX, CLUB, CPAH, DSWL, FARM, FFBW, FLR, FLUX, GRNQ, GTT, JG, LPTH, LTRX, PBIO, PCYG, PLAY, PTN, PTON, PZG, RFIL, RLGT, SCX, UEPS, VEDL, VITL, VNCE, VOLT, WVFC, ZUMZ\n\n - Ex-div:\n\n  ACV, ADP, AIO, AL, AMSF, BIG, BSIG, BTO, CAI, CAL, CBH, CRWS, CTXS, DCF, DKS, ECC, EFL, EHT, EIC, ENS, EVF, EXPO, FDUS, FFIC, FHN, FIS, FISI, FMNB, FRO, FUSB, G, GARS, GFI, GHY, HEQ, HPF, HPI, HPS, HRB, HTD, HTY, ICFI, IIIN, ISD, ITT, JHI, JHS, KFRC, KIO, LGI, MANT, NCV, NCZ, NDAQ, NRGX, NSP, NTRS, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RVT, SAMG, SNDR, SPTN, SR, TCBK, THG, TXT, UBSI, UNTY, VGI, VSH, WMB, WSBC, ZTR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.406%)\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 14,000K, previous: 13,254K)\n    - Core PPI (consensus: 0.2%, previous: 0.5%)\n    - Core PPI (consensus: 0.3%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.655M)\n    - Crude Oil Inventories (consensus: -1.887M, previous: -9.362M)\n    - Distillate Fuel Production (previous: -0.343M)\n    - EIA Refinery Crude Runs  (previous: -0.844M)\n    - EIA Weekly Distillates Stocks (consensus: -1.357M, previous: -1.676M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -5.2%, previous: -5.3%)\n    - Gasoline Inventories (consensus: -3.036M, previous: -4.320M)\n    - Gasoline Production (previous: 0.016M)\n    - Heating Oil Stockpiles (previous: 0.280M)\n    - Initial Jobless Claims (consensus: 838K, previous: 881K)\n    - Jobless Claims 4-Week Avg. (previous: 991.75K)\n    - Natural Gas Storage (consensus: 34B, previous: 35B)\n    - PPI (consensus: -0.3%, previous: -0.4%)\n    - PPI (consensus: 0.2%, previous: 0.6%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -1.4%)\n    - Wholesale Trade Sales (consensus: 4.9%, previous: 8.8%)\n\n^^^^2020-09-07",
        "created_utc": 1599472813,
        "id": "g4bg86y",
        "permalink": "/r/RobinHood/comments/io4rkt/daily_discussion_thread_september_7th_2020/g4bg86y/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1599501613.0
    },
    {
        "author": "AnonymousAstro",
        "body": "I sold a naked 9/4 $410c at close as a part of a strangle because an “$85 move up in a day is impossible”. I sold it for $70 and ate a $2800 loss this morning.\n\n**One big lesson learned:** people will buy up everything and try to make it the new TSLA. ZM has EPS of $.92 and a current P/E ratio of $1700ish. It’s now worth more than IBM.\n\nAs long as “stonks go up”, I’ll stick to selling puts only.",
        "created_utc": 1598993396,
        "id": "g3n27ob",
        "permalink": "/r/options/comments/iknpp2/zm_5246_up/g3n27ob/",
        "score": 26,
        "subreddit": "options",
        "created": 1599022196.0
    },
    {
        "author": "teegolf1",
        "body": "Zoom is way overpriced as well. Here’s a quote from BARRON’S today.............  “Zoom Video Communications (ZM) jumped 41% after reporting earnings that were more than twice what analysts had been expecting. It’s now worth $129.1 billion, more than International Business Machines’ (IBM) $109.9 billion. Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.”",
        "created_utc": 1599003033,
        "id": "g3nnczg",
        "permalink": "/r/stocks/comments/ikqq4q/tesla_hype_is_fun_until_its_not/g3nnczg/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1599031833.0
    },
    {
        "author": "sandpipa78",
        "body": "Same, can’t believe this shit. How in the hell ZM is worth more than IBM?",
        "created_utc": 1599001380,
        "id": "g3njqwz",
        "permalink": "/r/wallstreetbets/comments/ikt5rw/zoom_porn/g3njqwz/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599030180.0
    },
    {
        "author": "wildcat990",
        "body": "Everyone is on TSLA S&amp;P watch -  what about ZM?  It’s eligible now -  https://www.barrons.com/articles/zoom-is-now-worth-more-than-ibm-next-stop-the-s-p-500-51598966331",
        "created_utc": 1598993925,
        "id": "g3n3og7",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3n3og7/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599022725.0
    },
    {
        "author": "LePootPootJames",
        "body": "ZM larger market cap than IBM lol",
        "created_utc": 1598971566,
        "id": "g3ledwt",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ledwt/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599000366.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If IBM changes their name to International Blockchain Machines they’d probably double in value.",
        "created_utc": 1599001219,
        "id": "g3nje0s",
        "permalink": "/r/investing/comments/iks7c7/7_million_worthington_nkla_shares_unlocking/g3nje0s/",
        "score": 2,
        "subreddit": "investing",
        "created": 1599030019.0
    },
    {
        "author": "RedVermont12",
        "body": "Just like IBM has continued to be an amazing investment.",
        "created_utc": 1598979107,
        "id": "g3lywa3",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3lywa3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599007907.0
    },
    {
        "author": "Kangaroos2020",
        "body": "Rumors of IBM acquiring Cloudera have been around for awhile, CLDR would go to moon if so",
        "created_utc": 1598987982,
        "id": "g3mnl0k",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3mnl0k/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599016782.0
    },
    {
        "author": "Smooothoperat0r",
        "body": "Just a sticking point here: GE and IBM had huge cash flows for decades that led to a sharp decline in stock price because they were cash rich but growth poor. Today both are miniature versions of their former behemoth selves.",
        "created_utc": 1599014965,
        "id": "g3obwlf",
        "permalink": "/r/wallstreetbets/comments/ikrq8w/gme_yolo_monthstart_update_sep_1_2020/g3obwlf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599043765.0
    },
    {
        "author": "khizoa",
        "body": "not to be an ass, but no relevance whatsoever. esp since OP asked about EXPLOSIVE GAINS, in the next FEW YEARS. they're not even relevant RIGHT NOW\n\noil companies will eat shit\n\nsears is already eating shit\n\nibm is pretty stagnant unless they innovate to keep up with tech\n\ngoodyear, i guess they can keep making tires or whatever they do, as there will always be cars. but the only explosive gains will be the random trump pump that theyre being treated unfairly",
        "created_utc": 1598980418,
        "id": "g3m2qqb",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3m2qqb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599009218.0
    },
    {
        "author": "redroverster",
        "body": "IBM, Mobil, Exxon, Sears, Goodyear",
        "created_utc": 1598961371,
        "id": "g3krlu3",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krlu3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990171.0
    },
    {
        "author": "Furloughedinvester",
        "body": "IBM?",
        "created_utc": 1598959320,
        "id": "g3kotnr",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kotnr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598988120.0
    },
    {
        "author": "hidden-carrot",
        "body": "ARKK\nBABA\nBUD\nCARR\nCZR\nIBM\nMJ\nMSFT\nNFLX\nPlanet 13\nSE\nTSM\nVGT\nVTI\nWMT\nXLY",
        "created_utc": 1598979893,
        "id": "g3m17ni",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g3m17ni/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599008693.0
    },
    {
        "author": "a_nobody_really_99",
        "body": "Well, I’d have to say Cisco is doing much better than IBM and continues to do so.",
        "created_utc": 1598969356,
        "id": "g3l8l0d",
        "permalink": "/r/investing/comments/ijzxrp/tesla_opens_up_at_440_post_split_and_soars_12_to/g3l8l0d/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598998156.0
    },
    {
        "author": "r3dd1t0rxzxzx",
        "body": "Saying “they all have software” shows how little understanding you have of each automakers level of capability and focus. It’s like saying Microsoft and IBM both do software so whatever - pretty crazy conclusion.",
        "created_utc": 1598997594,
        "id": "g3nbu81",
        "permalink": "/r/investing/comments/ik4ehw/tsla_is_now_the_tenthlargest_company_via_market/g3nbu81/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599026394.0
    },
    {
        "author": "sc0tt_1990",
        "body": "Their new chip is a redux of the AMD FX series.  It's hilarious how things have come full circle.  Wonder if you can cook an egg on it.\n\nIntel is a shit company now.  IBM 2.0 until proven otherwise.  They don't spend on R and D, look it up, don't just listen to me.  Or hell, look at how AMD is going to eat their lunch 6 months from now when Ryzen 4 is out.",
        "created_utc": 1598998457,
        "id": "g3ndvjo",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3ndvjo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599027257.0
    },
    {
        "author": "Wearahat02",
        "body": "Not sure but the market thinks it will\nThey did quadruple their revenues YoY and double their revenues QoQ.\n\nIf they can maintain this rate of growth for just one year, their revenues will be 7.5billion next FY\n\nTheir operating expenses are ridiculously low I guess it doesn't take much to run a video conference app\n\nThat means 3 billion net income in 2 years\n\nGrowth can't be that easy can it? \n\nLiterally a company that earned 5 million last comparative quarter, earns 186mil this quarter and at this rate possibly almost 1 billion next years quarter.\n\nAlso I'm amazed that companies that have been around for a long time like Boeing, IBM, Starbucks, Lockheed, 3M, American Express, Citigroup are smaller than a video conferencing company that was worth just 17bn last year.",
        "created_utc": 1598970260,
        "id": "g3laybc",
        "permalink": "/r/stocks/comments/ikgc75/rstocks_daily_discussion_technicals_tuesday_sep/g3laybc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598999060.0
    },
    {
        "author": "GothamByNight",
        "body": "I mean i guess we live in a world where zoom is worth more than ibm now",
        "created_utc": 1598968485,
        "id": "g3l6da2",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l6da2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598997285.0
    },
    {
        "author": "CitrusGator",
        "body": "$ZM market cap &gt; $IBM\n\nMakes sense!",
        "created_utc": 1598963450,
        "id": "g3kvb3p",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kvb3p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598992250.0
    },
    {
        "author": "AnonymousAstro",
        "body": "I sold a naked 9/4 $410c at close as a part of a strangle because an “$85 move up in a day is impossible”. I sold it for $70 and ate a $2800 loss this morning.\n\n**One big lesson learned:** people will buy up everything and try to make it the new TSLA. ZM has EPS of $.92 and a current P/E ratio of $1700ish. It’s now worth more than IBM.\n\nAs long as “stonks go up”, I’ll stick to selling puts only.",
        "created_utc": 1598993396,
        "id": "g3n27ob",
        "permalink": "/r/options/comments/iknpp2/zm_5246_up/g3n27ob/",
        "score": 26,
        "subreddit": "options",
        "created": 1599022196.0
    },
    {
        "author": "teegolf1",
        "body": "Zoom is way overpriced as well. Here’s a quote from BARRON’S today.............  “Zoom Video Communications (ZM) jumped 41% after reporting earnings that were more than twice what analysts had been expecting. It’s now worth $129.1 billion, more than International Business Machines’ (IBM) $109.9 billion. Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.”",
        "created_utc": 1599003033,
        "id": "g3nnczg",
        "permalink": "/r/stocks/comments/ikqq4q/tesla_hype_is_fun_until_its_not/g3nnczg/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1599031833.0
    },
    {
        "author": "WeberStateWildcat",
        "body": "I'd certainly rather have Apple over IBM, but if I had 100+ shares of IBM, I'd investigate selling covered calls and collect some premium on the sale. And maybe premiums plural if it takes a few times for the buyers of said calls to succeed in hitting the strike price and exercising the option.",
        "created_utc": 1599280285,
        "id": "g42zuds",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g42zuds/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1599309085.0
    },
    {
        "author": "TrenAndOptions",
        "body": "You’re an idiot if you think IBM is dying. They’re leading the charge with quantum computing, even more than google",
        "created_utc": 1599023464,
        "id": "g3ooxye",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3ooxye/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599052264.0
    },
    {
        "author": "CptTonyStark",
        "body": "ppl who invest in cryp-to as a hyperinflation hedge in case dollar goes bust don't even realize that almost all cry-pto-currencies like shitcoin and airer are based on elliptic curve digital signature algorithm cryp-to-graphy, which is not quantum secure. The day quantum computers become powerful enough, which will happen in maybe a decade thanks to google, IBM, and MSFT, all coins will become worthless overnight. Imagine investing in something thinking that its' like gold and will keep value even in an apocalypse, not knowing that it's not even future proof just 1 decade from now. \n\n&amp;#x200B;\n\nNow, quantum secure cryp-to-graphy algorithms do exist but it's impossible to change the underlying block-chains and the algos driving them, by design. Quantum computers breaking encryption won't be a big problem to systems with central authority because they can just overhaul the encryption infrastructure. Not so much with coins, because the whole purpose of making them was to make sure no one tampers with the underlying block-chain and any algos driving it once it's up and running.",
        "created_utc": 1599336577,
        "id": "g45s0vr",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g45s0vr/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599365377.0
    },
    {
        "author": "TrenAndOptions",
        "body": "“Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.“",
        "created_utc": 1599023318,
        "id": "g3oor4k",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3oor4k/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599052118.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Imagine all the dumb fuck analysts who said Amazon was not a buy back in the 90s and recommended IBM, CSCO, and INTC instead. \n\nThat's how I feel about all the analysts with bearish targets on TSLA",
        "created_utc": 1599285296,
        "id": "g4372xo",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g4372xo/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599314096.0
    },
    {
        "author": "MeteorMash101",
        "body": "IBM",
        "created_utc": 1599173113,
        "id": "g3wzbe6",
        "permalink": "/r/stocks/comments/ilwoqa/careful_with_thinking_this_is_the_only_dip/g3wzbe6/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1599201913.0
    },
    {
        "author": "DankMemelord25",
        "body": "Intel is the new IBM, change my mind 🤔🤔🤔",
        "created_utc": 1599024513,
        "id": "g3oq9t6",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3oq9t6/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599053313.0
    },
    {
        "author": "infinitelimits00",
        "body": "I just noticed the Boomer Index actually crushed today. \n\nKO, IBM, INTC all massively outperforming today. KO back to its post-COVID highs (since March 23). CSCO, DIS, BA, RTX, T also all up. And XLU was up 3%, which is a lot for a defensive utilities sector.",
        "created_utc": 1599091636,
        "id": "g3seg2j",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3seg2j/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599120436.0
    },
    {
        "author": "sandpipa78",
        "body": "Same, can’t believe this shit. How in the hell ZM is worth more than IBM?",
        "created_utc": 1599001380,
        "id": "g3njqwz",
        "permalink": "/r/wallstreetbets/comments/ikt5rw/zoom_porn/g3njqwz/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599030180.0
    },
    {
        "author": "dryu12",
        "body": "Zoom is valued more than IBM. Let that sink into your retarded brain.",
        "created_utc": 1599055486,
        "id": "g3px4uq",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3px4uq/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599084286.0
    },
    {
        "author": "Cwc123",
        "body": "ardes Michel11 hours ago\nYes....But.....Debt is huge for IBM......And they are not alone...Competition is also huge for IBM......Then a growth company is always richly priced......The world is the limit for ZM........No frontiers.......Sky is the limit.....ZM will reach 1000 usd if they continue to beat....\n\nWhy the f did i buy puts on this with ppl like this on the other side",
        "created_utc": 1599093636,
        "id": "g3si419",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3si419/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599122436.0
    },
    {
        "author": "infinitelimits00",
        "body": "Lol if you guys love the DOW, may I introduce you to the Boomer Index. \n\nKO, T, JNJ, BA, NKE, MCD, INTC, IBM, and CSCO (although INTC is catching on here...and the last three technically are correlated with tech).\n\nI like never see anyone trade NKE calls but it's actually a good company.",
        "created_utc": 1599182161,
        "id": "g3xln4y",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xln4y/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599210961.0
    },
    {
        "author": "sc0tt_1990",
        "body": "lol at Intel.  the new IBM.",
        "created_utc": 1599063974,
        "id": "g3qhsh2",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qhsh2/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599092774.0
    },
    {
        "author": "wildcat990",
        "body": "Everyone is on TSLA S&amp;P watch -  what about ZM?  It’s eligible now -  https://www.barrons.com/articles/zoom-is-now-worth-more-than-ibm-next-stop-the-s-p-500-51598966331",
        "created_utc": 1598993925,
        "id": "g3n3og7",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3n3og7/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599022725.0
    },
    {
        "author": "ReflectAA",
        "body": "The first and most important thing you have to learn about the stock market is that the overwhelming majority of people have no clue what they’re talking about. \n\nPeople said Tesla was inflated when it had a market cap of 1 billion. And they were probably telling you to sell it and buy GE or IBM instead.",
        "created_utc": 1599266934,
        "id": "g42er4l",
        "permalink": "/r/stocks/comments/imruf3/apple_and_pe_ratio/g42er4l/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599295734.0
    },
    {
        "author": "pelikana20",
        "body": "Damn I slept on IBM's unusual options activity. It's up 3.8% today but who's even in IBM??",
        "created_utc": 1599081666,
        "id": "g3rskmk",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3rskmk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599110466.0
    },
    {
        "author": "guyfawkes202",
        "body": "I have 30 shares of international business machines stock that I’ve been holding since 1979... in fact I set up one of the original COBOLT servers for IBM back in the day.",
        "created_utc": 1599104516,
        "id": "g3t1mit",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3t1mit/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599133316.0
    },
    {
        "author": "barnett9",
        "body": "NVDA has been working on architecture to do compute without CPU's for a while. If they pull it off then they will redefine how computers work at a fundamental level. They are stupidly overbought right now, but long timeline I'd take that gamble.\n\nIBM is also trying to not be a dinosaur and is investing fairly heavily into quantum computing, maybe that.",
        "created_utc": 1599156838,
        "id": "g3voret",
        "permalink": "/r/wallstreetbets/comments/ilygri/30_year_timeline_10k_bet/g3voret/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599185638.0
    },
    {
        "author": "CritSC",
        "body": "I’ve been thinking about buying IBM for weeks because it is the only tech stock with a price less than its IV. I just haven’t had time to do a full DCF and read the 10-K yet.",
        "created_utc": 1599100898,
        "id": "g3svfg2",
        "permalink": "/r/ValueInvesting/comments/ill0c5/ibm_good_investment_or_value_trap/g3svfg2/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1599129698.0
    },
    {
        "author": "LineReact0r1",
        "body": "Ahh the Redhat deal. Yeah i remember reading about that. Probably the best thing they have done in 20 years. Not for Redhat but def for IBM.",
        "created_utc": 1599026152,
        "id": "g3os8ad",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3os8ad/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599054952.0
    },
    {
        "author": "CallinCthulhu",
        "body": "People still use yahoo everyday. It’s the 10th most visited site in the world.\n\nIt takes more than a cornerstone product to grow. Microsoft was weighed down by a continuous stream of awful products, poor acquisitions, botched acquisitions, and no ability to look forward. They were very slowly but surely dying. They were losing market share everywhere.\n\nSatiya changed that and they really embraced cloud, and managed some fantastic acquisitions that they didn’t fuck up after. Without him and the changes they made, they’d be IBM. Flat as fuck",
        "created_utc": 1599280313,
        "id": "g42zvn2",
        "permalink": "/r/stocks/comments/imqb50/selling_my_tesla_stock_yes_im_an_idiot/g42zvn2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599309113.0
    },
    {
        "author": "AvodLooksee",
        "body": "mPulse is the patented leading microgrid managing software, and mVSO is their optimization program that then feeds info to their mPulse software. Not 100% sure if mVSO is patented but their main product mPulse definitely is.\n\nIBM said they're on the leading edge of the cutting edge in a white paper, and seeing as though tesla partnered with them on a microgrid battery I think it's more set in stone than up in the air. 1m in backlogged contracts, and more projected after the acquisition of gridfabric and its clients.",
        "created_utc": 1599164057,
        "id": "g3wadzt",
        "permalink": "/r/stocks/comments/ilz5hw/clsk_on_super_sale_before_the_conference/g3wadzt/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599192857.0
    },
    {
        "author": "Thanks-Feeling",
        "body": "Why don't you just reinvest the dividend from your IBM stock into shares of Apple stock?",
        "created_utc": 1599285445,
        "id": "g437an8",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g437an8/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599314245.0
    },
    {
        "author": "Trumpowell",
        "body": "Anyone see that huge order  on $IBM contracts 6049 traded 130C 8/4\n\nIs $IBM buying tikthot ?",
        "created_utc": 1599102275,
        "id": "g3sxtee",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3sxtee/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599131075.0
    },
    {
        "author": "LePootPootJames",
        "body": "ZM larger market cap than IBM lol",
        "created_utc": 1598971566,
        "id": "g3ledwt",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ledwt/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599000366.0
    },
    {
        "author": "TrudeausMakeupArtist",
        "body": "Me: I think IBM is making a pivot to cloud services, but the results are yet to be seen. I'll buy in at $115-118.\n\nMarket: Fuck your plan.",
        "created_utc": 1599063232,
        "id": "g3qfuxm",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qfuxm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599092032.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If IBM changes their name to International Blockchain Machines they’d probably double in value.",
        "created_utc": 1599001219,
        "id": "g3nje0s",
        "permalink": "/r/investing/comments/iks7c7/7_million_worthington_nkla_shares_unlocking/g3nje0s/",
        "score": 2,
        "subreddit": "investing",
        "created": 1599030019.0
    },
    {
        "author": "Furloughedinvester",
        "body": "I also understand that ZM is currently valued higher than IBM. We may not be in a bubble but we are definitely in something.  Maybe the Twilight Zone?",
        "created_utc": 1599100543,
        "id": "g3suslr",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3suslr/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599129343.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If ibm traded at a pe of .00001 I would buy every share and collect millions in dividends for a few thousand dollars. Value absolutely does matter.",
        "created_utc": 1599030192,
        "id": "g3owlhc",
        "permalink": "/r/investing/comments/il13pb/cmv_fundamentals_and_pe_ratio_do_not_and_have/g3owlhc/",
        "score": 2,
        "subreddit": "investing",
        "created": 1599058992.0
    },
    {
        "author": "radioref",
        "body": "IBM, Honeywell, Ford, GE, Kellogg, Exxon, Phillip Morris.",
        "created_utc": 1599415173,
        "id": "g494fcs",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g494fcs/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599443973.0
    },
    {
        "author": "doublejay1999",
        "body": "dont understand your downvotes.  this is pretty much where we are right now.\n\nin different times, they would have already have broken them up.  They were very close to breaking up IBM in the 90's and they were no where near the level of dominance of Google &amp; Amazon.\n\nI think they are surviving because they are vital to the economy right at the moment, in the US at least.  But things are changing elsewhere.  Rupert Murdoch has his ass in his hands about content theft by Facebook &amp; Google, and the EU are sniffing round amazon for sharp practice and tax policies.\n\ni still dont believe anyone has the balls or brains to make the case that our economies would be better balanced &amp; stronger without these guys  sucking everything up.",
        "created_utc": 1599046348,
        "id": "g3pezzc",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3pezzc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599075148.0
    },
    {
        "author": "mbr902000",
        "body": "Someone gonna scoop em up, maybe ibm",
        "created_utc": 1599045958,
        "id": "g3pehq4",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3pehq4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599074758.0
    },
    {
        "author": "EithneDraoct",
        "body": "There was probably some repositioning out of Apple and Tesla in to some value plays, but tech will continue to dominate this K, imo. A lot of those value stocks are tech anyway. Look at IBM and INTC.",
        "created_utc": 1599068711,
        "id": "g3qu4ij",
        "permalink": "/r/stocks/comments/il7ojn/rotation_from_tech/g3qu4ij/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599097511.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM, DD, HEALTHCARE, INDUSTRIALS",
        "created_utc": 1599075387,
        "id": "g3rbl88",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3rbl88/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599104187.0
    },
    {
        "author": "GamblingMikkee",
        "body": "Shift to CVS, IBM, MO",
        "created_utc": 1599055092,
        "id": "g3pw7eh",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3pw7eh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599083892.0
    },
    {
        "author": "scot-t-ophile216",
        "body": "I hear a lot about breaking AMZN, but I don't think it'll happen. There are so many competing against AMZN and holds their own against them, like Microsoft, Google, Oracle, Salesforce, IBM, Walmart, Target, etc.",
        "created_utc": 1599016674,
        "id": "g3oew62",
        "permalink": "/r/StockMarket/comments/ikpu4w/walmart_vs_amazon_the_next_big_online_retailer/g3oew62/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599045474.0
    },
    {
        "author": "LineReact0r1",
        "body": "For real what does IBM even do anymore? Havent heard of anything made by them in forever?",
        "created_utc": 1599023834,
        "id": "g3opf7m",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3opf7m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599052634.0
    },
    {
        "author": "Longboarding-Is-Life",
        "body": "I image most established tech companies were. Apple, Microsoft, IBM, etc.",
        "created_utc": 1599099843,
        "id": "g3stk0a",
        "permalink": "/r/investing/comments/ilkw0n/werent_plenty_of_tech_firms_profitable_before_the/g3stk0a/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599128643.0
    },
    {
        "author": "JmotD",
        "body": "In terms of P/S ratio, this time is crazier than  Dot.com bubble.  \n\n Zoom Video Communications (ZM) jumped 41% after reporting earnings that were more than twice what analysts had been expecting. It's now worth $129.1 billion, more than International Business Machines' (IBM) $109.9 billion. Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.",
        "created_utc": 1599046924,
        "id": "g3pfxsm",
        "permalink": "/r/stocks/comments/iks9cg/zooms_market_cap_dashes_past_lowes_phillip_morris/g3pfxsm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599075724.0
    },
    {
        "author": "shadowgyro",
        "body": "I am seeing a lot of posts commenting about AWS  \"subsidizing\" Amazon retail. That idea doesn't look that fleshed out to me. How exactly are people arriving at that conclusion? By looking at the overall profitability? Sure, AWS has a much higher profit margin but that doesn't say anything about whether or not they are subsidizing products on retail. Amazon e-commerce, by design, is reinvesting all the cash back into the business for top-line growth. E-commerce divison itself has so many other businesses within it - profits from TV could be subsidizing shoes or phone cables. We only see the overall profits of the _entire_ e-commerce divison.  Also, the marketplace division is significant chunk of the e-commerce revenue (Amazon only counts the fees they charge 3rd parties as revenue). Profit margins for those will be a lot better than that of the first-party retail business as Amazon doesn't have to carry inventory at all. Also, advertising is another fast growing segment with higher profit-margins.I am not sure if we have enough data to make any comment regarding who is subsidizing what.\n\nAlso, AWS itself faces very serious competition from Azure, GCP, IBM, Oracle etc They are releasing a tonne of new features every year. Why will they not want use the cash from AWS for growing AWS but subsidize toilet-paper? Seems odd to me.\n\nFrom what I understand the profitability of AWS is providing a cover for Amazon from a Wall Street standpoint - \"Here have some profits, let us concentrate on growth.\"\n\nI also don't see how breaking up Amazon into AWS and E-commerce creates room for additional innovation. There is very serious competition for both the businesses.",
        "created_utc": 1599107033,
        "id": "g3t5qqk",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3t5qqk/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599135833.0
    },
    {
        "author": "RedVermont12",
        "body": "Just like IBM has continued to be an amazing investment.",
        "created_utc": 1598979107,
        "id": "g3lywa3",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3lywa3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599007907.0
    },
    {
        "author": "ampatton",
        "body": "It’s typically someone that’s seen as someone that has a financial/business background and “counts beans” by putting a bigger importance on the short term profitability of the company rather than the core engineering principles and/or the long term growth of the company.\n\nOne example of this could be seen from IBM and its past leadership (Louis Gerstner, Sam Palmisano, and Ginni Rometty) which, in my opinion, significantly contributed to IBMs decline. This could also probably apply this to other companies as well, but this is the one that sticks out most in my mind.",
        "created_utc": 1599449051,
        "id": "g4apv31",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4apv31/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599477851.0
    },
    {
        "author": "Ironleg01",
        "body": "Absolutely brilliant write up. Tech equities became really expensive and I was looking for some value alternatives in tech sector as well. HPE definitely stood out but initially I was quite skeptical as I thought this would be company that sells servers or networking equipment. Upon investigating it I'm super intrigued and will open position next week.  \n\nI love that they detached from legacy PC and printers business, I love that early on they spun off their services &amp; consulting business, I love that they offloaded their legacy software business to Micro Focus (poor guys are struggling to sell it now) and I love that they are not competing with Azure or AWS but instead specialise in their own niche. I think that HPE's hybrid cloud solution is probably the best offering in industry right now. IBM, AWS and Google Cloud offer hybrid solutions but it looks like they are very nascent offerings compared to HPE's.\n\nI also love acquisitions they been making. Like you mentioned Silver Peak and Cray (which were very smart acquisitions) but also BlueData (AI &amp; big data analysis), Plexxi (hybrid networking) and others.\n\nAlso, their focus on the edge and hybrid seems to be very well timed. Edge computing is still in its early stages but will undoubtedly expand in the future. A lot of people talk about hybrid as stepping stone for legacy infrastructures which is true. However, with data privacy and data security regulations becoming stricter hybrid will become way more than just stepping stone to full cloud. In Europe it already matters great deal where are you servers located and who can access them.\n\nFinally, HPE feels like it could be story similar to Microsoft. That is, Microsoft was perceived as this legacy, stagnant organization and it was trading at price reflecting that sentiment. Until their cloud offering changed everything. If all goes well with HPE it could be very similar story and brilliant entry point right now.\n\nP.S.\n\nSpeaking of undervalued tech equities. Do you have any thoughts on Seagate? They are trading at quite low multiples and with growing cloud, data storage will have to grow too. On the  other hand HDDs are legacy hardware and they are not very strong at making SSDs yet.",
        "created_utc": 1599389585,
        "id": "g47ynni",
        "permalink": "/r/stocks/comments/igib2a/hpe_transition_to_asaservice_and_path_to_alltime/g47ynni/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599418385.0
    },
    {
        "author": "dreamvilliannm",
        "body": "What price did you buy ibm?",
        "created_utc": 1599279975,
        "id": "g42zfmo",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g42zfmo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599308775.0
    },
    {
        "author": "woahwoahwoahokay",
        "body": "Yeah intel may turn into an ibm. I’m fully aware of that and can always keep an eye out for that. But they still have a lot of potential for short term increases and a lot of enterprises hardware still runs on intel because that’s superior.\n\nTrust me. I live here in Silicon Valley so I know that intel is on the down turn but they can still change things up and come out ahead. I’ve seen bigger comebacks. Who knows. It’s just a small percentage meant to hedge bets. We’ll see. Hopefully it’s just an ibm and not a yahoo that intel ends up turning into.",
        "created_utc": 1599260187,
        "id": "g422hqf",
        "permalink": "/r/wallstreetbets/comments/imoict/stock_on_sale_or_bull_trap/g422hqf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288987.0
    },
    {
        "author": "_Floriduh_",
        "body": "Agree on ARM and Intel. Huge acquisition that could truly make them a giant if things really do break away from x86. And Intel will be stag-tech case study much like the IBM we know.",
        "created_utc": 1599310974,
        "id": "g44a9yb",
        "permalink": "/r/wallstreetbets/comments/imxoeh/nvidia_will_be_the_first_1_trillion_semiconductor/g44a9yb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599339774.0
    },
    {
        "author": "Spenraw",
        "body": "If I had more cash flow I would put a safe chunk in to this. Part of me thinks Apple and IBM will see a huge jump with 5g and pay good dividends too. Cien seems like a great grab right now, but the dividends could help me grab more 5g stuff in the next year before it really booms",
        "created_utc": 1599162931,
        "id": "g3w70rf",
        "permalink": "/r/CanadianInvestor/comments/ilyhy3/what_5g_companys_that_have_low_prices_should_i_be/g3w70rf/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599191731.0
    },
    {
        "author": "CallsCallsCallsCalls",
        "body": "\"blue chip\"  tech is going to do well right now. IBM for example. Stuff with dividends that has been hit but with growth still.",
        "created_utc": 1599140855,
        "id": "g3uenb1",
        "permalink": "/r/wallstreetbets/comments/ilqp2l/daily_discussion_thread_for_september_03_2020/g3uenb1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599169655.0
    },
    {
        "author": "CallsCallsCallsCalls",
        "body": "I've been waiting for a correction, and at the end of today I was thinking we definitely bleed tomorrow too. Now AH was so bad I think the pendulum has to swing back already to some degree, on some stocks.\n\nGood \"blue chip\" stuff and more mature tech stocks with dividends have been waiting to explode up. Every time the bubble stuff reverses a bit, stocks like IBM and INTC have had huge moves up relative to their normal betas/IV (options on IBM for $1 OTM have gone up 700%+ multiple times intraday for relatively small moves).\n\nThose type of stocks haven't gone up during the pandemic at all despite positive earnings/outlook and minimal disruption. Money has a lot to flow into tomorrow, it just won't be the usual stuff.",
        "created_utc": 1599178233,
        "id": "g3xe6vz",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xe6vz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599207033.0
    },
    {
        "author": "Kangaroos2020",
        "body": "Rumors of IBM acquiring Cloudera have been around for awhile, CLDR would go to moon if so",
        "created_utc": 1598987982,
        "id": "g3mnl0k",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3mnl0k/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599016782.0
    },
    {
        "author": "Smooothoperat0r",
        "body": "Just a sticking point here: GE and IBM had huge cash flows for decades that led to a sharp decline in stock price because they were cash rich but growth poor. Today both are miniature versions of their former behemoth selves.",
        "created_utc": 1599014965,
        "id": "g3obwlf",
        "permalink": "/r/wallstreetbets/comments/ikrq8w/gme_yolo_monthstart_update_sep_1_2020/g3obwlf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599043765.0
    },
    {
        "author": "khizoa",
        "body": "not to be an ass, but no relevance whatsoever. esp since OP asked about EXPLOSIVE GAINS, in the next FEW YEARS. they're not even relevant RIGHT NOW\n\noil companies will eat shit\n\nsears is already eating shit\n\nibm is pretty stagnant unless they innovate to keep up with tech\n\ngoodyear, i guess they can keep making tires or whatever they do, as there will always be cars. but the only explosive gains will be the random trump pump that theyre being treated unfairly",
        "created_utc": 1598980418,
        "id": "g3m2qqb",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3m2qqb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599009218.0
    },
    {
        "author": "redroverster",
        "body": "IBM, Mobil, Exxon, Sears, Goodyear",
        "created_utc": 1598961371,
        "id": "g3krlu3",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krlu3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990171.0
    },
    {
        "author": "Itsawhazzyitsawhoozy",
        "body": "I bought some stock on June 1st, not the best day price wise but it’s the stock I plan to hold the longest out of my whole portfolio, except for MSFT maybe. I made a DD for myself and made a brief summary around April. Most of it is based on their 10-K last year and their first 10-Q of the year. The key here is that this has been seen as a dinosaur for the past decade, due to lack of innovation, terrible management decisions (crazy high EPS and a buyback program that should have been cut long ago), and recruiting issues. A new CEO (Arvind Krishna) and a switch to the cloud (and quantum computing for the 2030s at least) are the key changes that could drive change. Sorry if it’s a bit messy, was not meant to be posted when I wrote it : \n\nIBM : New CEO Arvid Krishna has my trust, hope he will change top and mid tier management (which did weird accounting tricks like the pseudo Lenovo « sale/buy », laid off workforce for no reason, did not R&amp;D enough, focused on business services and consulting too much, had the crazy 20$ EPS goal, etc…). Krishna pushed Red Hat acquisition (open source enterprise software, will allow them to become hybrid cloud providers, hybrid cloud is interoperable (BFF example), scalable (ERP switch to 3rd parties), portable, and secure (user data still in private cloud)). Krishna was senior VP for cloud and cognitive software. \nIBM has switched industries several times throughout its life : time clocks, then tabulating machine, then typewriter, then mainframe (good changes), then personal computers (good initially but then poor because used competitors’ chips), etc… Cloud/AI could be their next successful switch (1/3rd of revenue in 2019, still increasing). Quantum Computing too, as they’ve strongly positioned themselves as industry leaders, but that’s in the very, very long run.\nWhile not the most important aspect, company is a dividend aristocrat (increasing div payout for 25 years), but what matters is that div payment was never removed, even though I think it should have been decreased during the struggles of the 2010s and instead reinvested in R&amp;D, they should have also paused their share buyback program. Financials : P/E around 10 (very good for a tech company), P/BV is 5.5 (good for a tech company, especially one transitioning to less tangible assets), net income slowly increasing, current ratio of nearly 1 at end of 03/31 which is decent given Red Hat acquisition and coronavirus, D/E is 2.62 (that one is indeed bad, but they got cash I guess, still not great).",
        "created_utc": 1599125472,
        "id": "g3tpsfi",
        "permalink": "/r/ValueInvesting/comments/ill0c5/ibm_good_investment_or_value_trap/g3tpsfi/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1599154272.0
    },
    {
        "author": "FireEraser",
        "body": "Why would any of those companies want to buy IBM?",
        "created_utc": 1599070284,
        "id": "g3qy3t7",
        "permalink": "/r/stocks/comments/ilby5h/ibm_as_takeover_target/g3qy3t7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599099084.0
    },
    {
        "author": "shatterkneesinc",
        "body": "cmon cscso even ibm mooned today",
        "created_utc": 1599069693,
        "id": "g3qwn2w",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qwn2w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599098493.0
    },
    {
        "author": "Lambotherambo",
        "body": "You said it could never get to the size of google fairly explicitly. Google is already a dinosaur and in 10 years time will be viewed as an IBM of sorts. AWS is not blocked from being the next current “Google” at all",
        "created_utc": 1599074446,
        "id": "g3r8zn3",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3r8zn3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599103246.0
    },
    {
        "author": "Jarlaxle_rigged_it",
        "body": "NFLX was starting a great run before this fing shit. even managed to try to break up yesterday while everything was crashing. dd plz on that solid stock&lt;3\n\nINTC ofc (all that insider buying) \n\nSomehow AVGO/IBM barely felt this thing, might be good tech+cyclical trades..",
        "created_utc": 1599250717,
        "id": "g41b97v",
        "permalink": "/r/wallstreetbets/comments/imddo3/daily_discussion_thread_for_september_04_2020/g41b97v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599279517.0
    },
    {
        "author": "sirajgb",
        "body": "Airbus, ibm (people make fun of it but they are one of the leaders on developing quantum computing, including the prog language), Ericsson (5g play) Eon",
        "created_utc": 1599241794,
        "id": "g40k92i",
        "permalink": "/r/wallstreetbets/comments/imddo3/daily_discussion_thread_for_september_04_2020/g40k92i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599270594.0
    },
    {
        "author": "soupmonster40",
        "body": "lol yeah. I inverse WSB.\n\n\"intel is the next IBM\" --&gt; buy intel &amp; Micron\n\n\"oil is dead\"--&gt; buy oil\n\n\"NET sucks it's a meme stock\" --&gt; buy NET",
        "created_utc": 1599261430,
        "id": "g4256lr",
        "permalink": "/r/wallstreetbets/comments/imp0dz/insights_on_my_portfolio_please/g4256lr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599290230.0
    },
    {
        "author": "Kramer-Melanosky",
        "body": "Your comparison is absurd. Microsoft would have become another IBM if not for Sathya Nadela. \n\nIntel is lagging in technology for quite a while. Without any positive news in near future, it's a gamble. It can be become next Microsoft or IBM.\n\nMobile Eye I good, but with chances of their major revenue going down and gap between ADM widening over next few years. I don't feel it's worth it.",
        "created_utc": 1599424001,
        "id": "g49kgv5",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g49kgv5/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599452801.0
    },
    {
        "author": "bitflag",
        "body": "I think Intel is already close to being IBM. They consistently gave up on new markets (ie mobile, high end GPU, modems) because it is initially small and expensive, which let the competition take those juicy new trends while Intel got stuck the same old x86 chips it's been doing for 4 decades.\n\nManufacturing problems is only salt on the wound. It's accelerating the decline because it was Intel moat in it's core business.",
        "created_utc": 1599448655,
        "id": "g4apa51",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4apa51/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599477455.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "Bit of a personal anecdote here:\n\nSo I have a degree in IT with a focus on Computer Networking.\n\nI once interviewed for IBM because they had positions open for Network Admins.  Unfortunately, when I sat down and looked over their list of jobs I discovered that they were only looking for senior level positions (something they did not mention in the email they sent to my university).\n\nI decided to interview anyway because I was already there in suit and tie so I wasn't about to get all dressed up for nothing.\n\nThe interview went well, but the guy told me he just didn't have anything for me at the time.\n\nI decided to walk around afterwards and saw a guy interviewing for entry level programmers.  My campus did not offer a Software degree (they offered it at a different campus), but I did have to take 9 credits in basic programming which was Java, C++, and HTML.  I had already taken the Java and C++ classes.\n\nI sit down with the guy and we get to talking.\n\nHe asks my background in coding.  I tell him one intro in Java and C++ so far.\n\nHe asks why am I interviewing if my degree is not focused on coding.  I tell him because those two classes opened my eyes to something that I didn't even know I wanted before.  I love creating stuff with code, I find it cathartic to sit and stare at code, getting lost in it while trying to figure out where my errors are, the absolute joy of finally getting it to compile and run.  I even started to make some basic programs at home in my free time.\n\nHe asks me if I have any of my work to show him.  I did not bring any copies of my code because I wasn't even thinking about the possibility of interviewing for any other positions (let this be a lesson to anyone who's still getting their degree, bring everything!).\n\nI tell him I did have it on a thumb drive that I carry around in my briefcase, but of course he waves his hand and says that's a security issue (totally agreed).\n\nHe asks me what a function is.  I draw a blank.  I ended up stammering out something like, \"it's the part of the code that does stuff\".  Not necessarily wrong, but more of an ELI5 definition.\n\nHe shows me some code and asks what I can decipher from it.  It's a function that takes a variable, runs it through a formula, returns a variable, and then loops 4 more times using the new return variable each time, and finally shows a set of the return variables at the print out.  He confirmed that I was right.\n\nHe asks me what that sets of numbers is called.  Obviously it's an array, and I had heard the term before, but again I did not know at the time.  He frowns and says something along the lines of, \"You really don't know basic terminology.  You should work on that.\"\n\nWe shook hands and parted ways, never got a call back.  Now, I know I messed up by not having some of my work printed out, and not being up on the terminology.  But it really rubbed me raw that this guy was so hung up on terminology, knowing that coding was like 5% of my entire degree, and yet I still had a basic working knowledge of programming to at least be able to read and understand what was going on, and that I was passionate enough about it to go home and write some basic programs of my own.\n\nNow I don't know that the lack of terminology was the ultimate reason I was turned down.  I do know that they were looking to start up a class that would take about 3 years to go through, and they were going to teach a proprietary language that was similar to Java.  Obviously, the terminology would have been brought up again multiple times in that 3 year program.  The only clue I had for why I was turned down was the lack of lingo.\n\nI am now a manager at a FinTech company, and I don't ask \"lingo\" questions of interviewees.  I want to know if they understand the meat and potatoes of what the job entails because, to me, that means so much more.  Lingo will happen over time as they do the job.\n\nI'm not saying that is all the OP was concerned about in their interviews, but they certainly seem to think it's a flaw in an interviewee that makes them unsuitable for hiring.",
        "created_utc": 1599457511,
        "id": "g4b12z3",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4b12z3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599486311.0
    },
    {
        "author": "Lazybumm1",
        "body": "I'm very bullish on NVIDIA but I think you are overestimating some of its competitive advantages. Raytracing will probably become industry standard sooner or later and supported across either platform. DLSS is something AMD or any other company with a bunch of ML engineers and money can replicate given some time. \n\nIt's not impossible for other companies to replicate or immitate or substitute some of those technologies / products. AMD is certainly catching up and will carve off some fractions of the market in the AI/ML &amp; datacenter businesses.\n\nThe ARM acquisition, if it happens, will confer a competitive advantage like no other. As an NVDA stockholder I wish this happens. As a Brit working in and loving tech, I am slowly dying on the inside... \n\nSomething to remember is that this is a fast expanding market and not a saturated one, there's room for multiple players to grow and win at the same time. \n\nThat being said, I still think Intel will likely be the next IBM. Is it gonna tank overnight? No, and there will probably be plenty of rallies to make money off, but long term I wouldn't look to hold.",
        "created_utc": 1599305308,
        "id": "g440s54",
        "permalink": "/r/wallstreetbets/comments/imxoeh/nvidia_will_be_the_first_1_trillion_semiconductor/g440s54/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599334108.0
    },
    {
        "author": "ThemChecks",
        "body": "This seems pretty fair honestly. IBM isn't a bad dividend stock for what it's worth.",
        "created_utc": 1599308082,
        "id": "g445t5l",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g445t5l/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599336882.0
    },
    {
        "author": "Art0002",
        "body": "You asked a decent question so I thought you deserved a thoughtful response. \n\nDo old companies like IBM and newer companies and companies that are in focus now. \n\nI read a post by someone trying to put a valuation on SPCE. He had to make assumptions and he pointed them out. It was a good read. I’m not sure what he ultimately concluded but I dabble with SPCE options and I’ve made a few bucks. \n\nI think your endeavor will improve your future trading results. There is no downside. \n\nAnother thought is adding a layer of technical analysis to add even more signals as to when to buy or sell. There is analysis paralysis but when fundamental and technical analysis lines up ...\n\nI don’t want to ramble but I trade differently than you. You are young and I am retired. What made early retirement possible was increasing my dollar cost averaging (DCA) into the 08/09 crash. I cut spending and DCA’ed into it. It was brutal. I was fully invested. I raised my 401k contributions. \n\nIt paid off and took me over the hump. Don’t underestimate DCA.",
        "created_utc": 1599176554,
        "id": "g3x9m49",
        "permalink": "/r/investing/comments/im2uuw/learning_valuation/g3x9m49/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599205354.0
    },
    {
        "author": "Spenraw",
        "body": "very good to know, I already own telus so maybe time to put it in apple, but IBM AI will use 5g alot",
        "created_utc": 1599186866,
        "id": "g3xu28l",
        "permalink": "/r/CanadianInvestor/comments/ilyhy3/what_5g_companys_that_have_low_prices_should_i_be/g3xu28l/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599215666.0
    },
    {
        "author": "ThreeEyeJedi",
        "body": "Exactly they never used the products they're talking about. What tech company you know uses Teams? Maybe some corporate giant like IBM but no one is actually using Teams",
        "created_utc": 1599065571,
        "id": "g3qlx8h",
        "permalink": "/r/wallstreetbets/comments/ijpbec/slack_work_discord_for_grownups_and_why_this_saas/g3qlx8h/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599094371.0
    },
    {
        "author": "chawpyx5",
        "body": "Right there with ya. I also have IBM 131 9/11s that were up 390%. They are literally break even at 0% right now.",
        "created_utc": 1599213567,
        "id": "g3yqndt",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3yqndt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599242367.0
    },
    {
        "author": "RumLovingPirate",
        "body": "Retail investors *used* to not have an affect on the market up until the past year or so. I mean, being a retail investors used to me call your local stock broker and asking for a few shares of that hot new stock called ibm. Mainframes are the future!\n\nThen came online trading and even then, most people who had been investing saw little reason to leave their stock broker and fees started at like $30 a trade and we're executed slowly.\n\nEven with *super low*  $10 trades making 30 trades a day was expensive and people didn't focus on in.\n\nIn comes gen z who are the side hustle generation, $0 fast trades, tons of youtube and tiktok vids on how to trade and make $1k a day, and we're seeing the long tail effect of a lot of people with low volume adding up to a lot of the overall trade volume. \n\nRetail investors absolutely affect things now, and they absolutely need to realize what it's like to get burned.",
        "created_utc": 1599222872,
        "id": "g3z49ks",
        "permalink": "/r/investing/comments/imeakd/cnbc_robinhood_traders_need_to_get_burned_a_bit/g3z49ks/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599251672.0
    },
    {
        "author": "trader9899",
        "body": "TSLA is the most watched stock from retail along with Apple. They can make a business selling their own stock and would bring in 2 billion a year for the next 100 year. I don’t understand what is the allure of having to short Tesla when there are a bunch of legacy boomer stock you can short. IBM/XOM/mall stock for easy money",
        "created_utc": 1599270249,
        "id": "g42kch8",
        "permalink": "/r/investing/comments/imp0rv/tesla_stock_could_tumble_over_90_says_analyst/g42kch8/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599299049.0
    },
    {
        "author": "Lazybumm1",
        "body": "Yes not talking short term, the IBM example is a good one. That's what I meant.\n\nThey can pump prices with buybacks anytime too.",
        "created_utc": 1599260058,
        "id": "g422645",
        "permalink": "/r/wallstreetbets/comments/imoict/stock_on_sale_or_bull_trap/g422645/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288858.0
    },
    {
        "author": "DankMemelord25",
        "body": "Intel is the next IBM",
        "created_utc": 1599090971,
        "id": "g3scxzu",
        "permalink": "/r/wallstreetbets/comments/ilb2rx/need_more_shit_tech/g3scxzu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599119771.0
    },
    {
        "author": "roox911",
        "body": "yeah, tough to say - i'm bullish enough on it that i think it'll be up 10% from here before the end of the year, assuming the market doesn't keep black swanning from here of course...\n\nI have IBM in my sights as well - just waiting to see if there is a better entry in the coming days :)",
        "created_utc": 1599163120,
        "id": "g3w7l7x",
        "permalink": "/r/CanadianInvestor/comments/ilyhy3/what_5g_companys_that_have_low_prices_should_i_be/g3w7l7x/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599191920.0
    },
    {
        "author": "nicename09",
        "body": "Intel ruined itself by hiring mediocre tech talent. Maintenance engineers who think they're innovators. What a joke. Years of onboarding average employees gets you average results. Shocking! Gotta squeeze those margins from somewhere I guess. Now its a perpetual cycle of complacency and ineptitude. At this point you could hand intel the market leading product in self driving tech and they'd blow that lead within 16 months. They want to be IBM. No amount of wishful thinking from the outside can change that.",
        "created_utc": 1599459847,
        "id": "g4b3tjt",
        "permalink": "/r/wallstreetbets/comments/inrj01/intel_the_big_picture_and_why_im_bullish_on_it/g4b3tjt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599488647.0
    },
    {
        "author": "Ironleg01",
        "body": "Unless Intel gets new CEO they are going to do just as well as IBM did. They also were massive company once.",
        "created_utc": 1599468540,
        "id": "g4bch3b",
        "permalink": "/r/wallstreetbets/comments/io1van/amd_will_because_of_intels_presentation/g4bch3b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599497340.0
    },
    {
        "author": "Furloughedinvester",
        "body": "IBM?",
        "created_utc": 1598959320,
        "id": "g3kotnr",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kotnr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598988120.0
    },
    {
        "author": "Immediate_Student_92",
        "body": "ah okay, but why is that. Both azure and aws are better than the competition, which is google baba IBM etc, all the giant techs. And cloud is still in its infancy. What makes you think theyll be replaced, at least in that industry.",
        "created_utc": 1599187582,
        "id": "g3xv9yt",
        "permalink": "/r/stocks/comments/iltt53/are_we_in_a_covidtech_bubble_heres_how_to_tell_my/g3xv9yt/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599216382.0
    },
    {
        "author": "MattSurprise",
        "body": "IBM",
        "created_utc": 1599354481,
        "id": "g46sq5w",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g46sq5w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599383281.0
    },
    {
        "author": "woahwoahwoahokay",
        "body": "No trust me. I agree. I think AMD is the superior product at this point and my stocks reflect that. But intel is undervalued in the short term based on reactionary sell offs due to bad news. It’s undervalued. They have a lot of talent. I live close to intel. I know a lot of people who work there. They’re not going to go under overnight and they don’t ONLY sell chips. They’ll pivot and react accordingly. If I’m wrong then I only lose a small percentage of money, if I’m right, then I make serious gains. It’s meant to mitigate risk. Buying into intel is meant to help diversify my portfolio and I honestly feel they are undervalued at this point. Should it have dipped? Yes. By that much? No. Intel is still fucking intel. They will continue to do well for the coming years.\n\nCould they turn into an ibm? Yeah maybe. But by then I’ll be out of the stock. But the revamped logo and some updates to hardware is enough to push the needle.",
        "created_utc": 1599259754,
        "id": "g4215i2",
        "permalink": "/r/wallstreetbets/comments/imoict/stock_on_sale_or_bull_trap/g4215i2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288554.0
    },
    {
        "author": "sk169",
        "body": "Yes. My whole thesis is based on Intel becoming Microsoft rather than IBM. \n\nI don't have a crystal ball and neither do you. I'm betting on Intel becoming Microsoft rather than IBM.",
        "created_utc": 1599424176,
        "id": "g49ks6f",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g49ks6f/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599452976.0
    },
    {
        "author": "ATLiving",
        "body": "Intel is like IBM. Maybe in 10 years it’s great again or maybe in 10 years it’s dead.",
        "created_utc": 1599432597,
        "id": "g49zlvb",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g49zlvb/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599461397.0
    },
    {
        "author": "undecidedmarketmaker",
        "body": "I agree with all your points, except \n\n&gt;The kind of employees has not really mattered about how the company as a whole does\n\nIt matters a lot when it comes to the bread and butter of processors. No innovation means death in this industry. While poorly run companies can limp (and limp well) for years - see Oracle, IBM, etc - is Oracle really going to be a company you want to put your money in? \n\nGiven what I know about INTC, I don't think INTC is going to be around in 20 years. Not in its current form, at least. The part I'm keeping a close eye on is Intel Capital, which they use to squelch and/or gobble up competition - that might keep them alive forever as a business model, but I don't like it. I guess I'll be proven wrong when I'm an old man lol but that's my two cents.",
        "created_utc": 1599442054,
        "id": "g4aeq16",
        "permalink": "/r/wallstreetbets/comments/inrj01/intel_the_big_picture_and_why_im_bullish_on_it/g4aeq16/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599470854.0
    },
    {
        "author": "upvotemeok",
        "body": "Can ibm pull a msft over next decade and but 1t?",
        "created_utc": 1599428820,
        "id": "g49t0i5",
        "permalink": "/r/stocks/comments/imfn3y/down_dayselloffpanicdont_panicwhat_are_you_buying/g49t0i5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599457620.0
    },
    {
        "author": "MaximusHippocratus",
        "body": "IBM",
        "created_utc": 1599123215,
        "id": "g3tnqz9",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3tnqz9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599152015.0
    },
    {
        "author": "dmitsuki",
        "body": "IBM can make good RISC CPU'S, PPC is still an option though devs prefer completely off the shelf nowadays.",
        "created_utc": 1599124590,
        "id": "g3tozi5",
        "permalink": "/r/wallstreetbets/comments/ilfn28/any_plays_for_nvidia/g3tozi5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599153390.0
    },
    {
        "author": "wearsgreensometimes",
        "body": "I sold 40 of those 0.80 contracts. doubled my money from that morning based off a tip here (should have tripled, but missed a good buy). basically rode the Tiger Lake chipset talk hype, sold before they dipped back down (but were still up 50%). \n\nI hope yall do well but used to work at a company in that industry and I don’t know how much it will actually rise beyond that based off what I remember. Intel is a boomer tech stock like IBM, Cisco, and Lenovo...of course they could always pull off an MSFT type revival but who knows",
        "created_utc": 1599132779,
        "id": "g3ty85v",
        "permalink": "/r/wallstreetbets/comments/ilcywi/intc_gang_wya_intc_918_50c_56c/g3ty85v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599161579.0
    },
    {
        "author": "neekogo",
        "body": "I hear ya. My strategy lately has been similar to you. Well known companies (MFST, WM, DIS). A few companies I expect to be making strides in the coming years (IBM, CSCO, CVS). A few risk shots (F, AFL,T). And a couple of solid ETFs to round it out. Yesterday I was 16% up. Right now I'm still 8% 😄",
        "created_utc": 1599147602,
        "id": "g3uyesm",
        "permalink": "/r/investing/comments/ilgy50/finally_got_a_stake_in_aapl/g3uyesm/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599176402.0
    },
    {
        "author": "MaximusHippocratus",
        "body": "IBM boys. It just pumped after a bull flag forming for weeks. IV is still low. Get in while you can. Before the COVID crash it was pumping. Hasn't cut dividend through the pandemic.",
        "created_utc": 1599075222,
        "id": "g3rb57y",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3rb57y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599104022.0
    },
    {
        "author": "Flaky-Bad9954",
        "body": "Oh I didn't make it clear. I am not saying only MSFT will be replaced. I think all the giant tech you see today will be replaced... Like how IBM was being replaced...",
        "created_utc": 1599177459,
        "id": "g3xcd8q",
        "permalink": "/r/stocks/comments/iltt53/are_we_in_a_covidtech_bubble_heres_how_to_tell_my/g3xcd8q/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599206259.0
    },
    {
        "author": "Turtlesaur",
        "body": "Lol by who, IBM?",
        "created_utc": 1599078818,
        "id": "g3rl5zb",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3rl5zb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599107618.0
    },
    {
        "author": "hidden-carrot",
        "body": "ARKK\nBABA\nBUD\nCARR\nCZR\nIBM\nMJ\nMSFT\nNFLX\nPlanet 13\nSE\nTSM\nVGT\nVTI\nWMT\nXLY",
        "created_utc": 1598979893,
        "id": "g3m17ni",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g3m17ni/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599008693.0
    },
    {
        "author": "a_nobody_really_99",
        "body": "Well, I’d have to say Cisco is doing much better than IBM and continues to do so.",
        "created_utc": 1598969356,
        "id": "g3l8l0d",
        "permalink": "/r/investing/comments/ijzxrp/tesla_opens_up_at_440_post_split_and_soars_12_to/g3l8l0d/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598998156.0
    },
    {
        "author": "r3dd1t0rxzxzx",
        "body": "Saying “they all have software” shows how little understanding you have of each automakers level of capability and focus. It’s like saying Microsoft and IBM both do software so whatever - pretty crazy conclusion.",
        "created_utc": 1598997594,
        "id": "g3nbu81",
        "permalink": "/r/investing/comments/ik4ehw/tsla_is_now_the_tenthlargest_company_via_market/g3nbu81/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599026394.0
    },
    {
        "author": "sc0tt_1990",
        "body": "Their new chip is a redux of the AMD FX series.  It's hilarious how things have come full circle.  Wonder if you can cook an egg on it.\n\nIntel is a shit company now.  IBM 2.0 until proven otherwise.  They don't spend on R and D, look it up, don't just listen to me.  Or hell, look at how AMD is going to eat their lunch 6 months from now when Ryzen 4 is out.",
        "created_utc": 1598998457,
        "id": "g3ndvjo",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3ndvjo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599027257.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Look up IBM quantum computing, Redhat acquisition, cloud, software business transition from their legacy hardware business",
        "created_utc": 1599025859,
        "id": "g3orvyc",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3orvyc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599054659.0
    },
    {
        "author": "Troll_Sauce",
        "body": "Buy them out a ways so you have some flexibility. Er is a huge wildcard. I still think it's primed for an IBM acquisition sooner or later.",
        "created_utc": 1599026970,
        "id": "g3ot5xn",
        "permalink": "/r/wallstreetbets/comments/ikm425/techcalls_are_easy_gains/g3ot5xn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599055770.0
    },
    {
        "author": "Wearahat02",
        "body": "Not sure but the market thinks it will\nThey did quadruple their revenues YoY and double their revenues QoQ.\n\nIf they can maintain this rate of growth for just one year, their revenues will be 7.5billion next FY\n\nTheir operating expenses are ridiculously low I guess it doesn't take much to run a video conference app\n\nThat means 3 billion net income in 2 years\n\nGrowth can't be that easy can it? \n\nLiterally a company that earned 5 million last comparative quarter, earns 186mil this quarter and at this rate possibly almost 1 billion next years quarter.\n\nAlso I'm amazed that companies that have been around for a long time like Boeing, IBM, Starbucks, Lockheed, 3M, American Express, Citigroup are smaller than a video conferencing company that was worth just 17bn last year.",
        "created_utc": 1598970260,
        "id": "g3laybc",
        "permalink": "/r/stocks/comments/ikgc75/rstocks_daily_discussion_technicals_tuesday_sep/g3laybc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598999060.0
    },
    {
        "author": "laken906",
        "body": "FSLY, MSFT, RKT, SOXL, SPY, SE, IAU, INTC, VXX calls\n\nUUP puts\n\n10 for 10 premarket. Should prolly simplify the portfolio while I'm ahead this morning...",
        "created_utc": 1598962618,
        "id": "g3ktsg0",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ktsg0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598991418.0
    },
    {
        "author": "pervsensei11",
        "body": "Have TSLA, NVDA, PINS, NFLX, WORK, ZM, INTC calls and spreads\n\nCan’t wait for premarket",
        "created_utc": 1598945876,
        "id": "g3kc8l7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kc8l7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598974676.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing like a rebranding thing",
        "created_utc": 1598952960,
        "id": "g3kim3q",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kim3q/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598981760.0
    },
    {
        "author": "REDmonster333",
        "body": "Intel. Even though it looks bleak short term. But long term they will still pull through. They have 10+ years of dominance, I doubt they wont catch up.",
        "created_utc": 1598952851,
        "id": "g3kiik2",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kiik2/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1598981651.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "It’s not gonna happen but if INTC gaps up to $60 I get the WSB logo tattooed. This isn’t even a bet. This is a goal.",
        "created_utc": 1598954092,
        "id": "g3kjn5f",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjn5f/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982892.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC is up to $51.30 for +0.69% rn",
        "created_utc": 1598953629,
        "id": "g3kj7z9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kj7z9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982429.0
    },
    {
        "author": "ProPenguin800",
        "body": "Who else is playing Intel?",
        "created_utc": 1598946830,
        "id": "g3kd4xs",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd4xs/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598975630.0
    },
    {
        "author": "august_thecow",
        "body": "INTC is severely underbought... might buy more calls at open before the announcement",
        "created_utc": 1598960784,
        "id": "g3kqmuf",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kqmuf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598989584.0
    },
    {
        "author": "Davidkanye",
        "body": "I mean, I’ve been watching past earnings plays and there’s still time Imo. \n\nAdditionally eyeing INTC. \n\nCurrent play are post earnings: ESTC, INTU, AMGN",
        "created_utc": 1598947233,
        "id": "g3kdic9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdic9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598976033.0
    },
    {
        "author": "Infernal-Affairs",
        "body": "if INTC hits $60 before eow\n\nI'll just sell my calls or something idk",
        "created_utc": 1598954353,
        "id": "g3kjvtu",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjvtu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598983153.0
    },
    {
        "author": "GamblingMikkee",
        "body": "JPM, CVS, INTC, MO, WBA. Almost all single digits",
        "created_utc": 1598957426,
        "id": "g3kmu1x",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kmu1x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598986226.0
    },
    {
        "author": "sven2123",
        "body": "I agree. Intel is cheap right now and will go back up once they smoothe out operations",
        "created_utc": 1598958975,
        "id": "g3kog5j",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kog5j/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598987775.0
    },
    {
        "author": "therealsparticus",
        "body": "AMD has already priced in half the growth of intel. Intel is their competition and is not a wimp.",
        "created_utc": 1598964236,
        "id": "g3kws71",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kws71/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993036.0
    },
    {
        "author": "DukeOfEarle88",
        "body": "AMD is going to get Intel this year- &amp; then quantum computers ftw.",
        "created_utc": 1598965074,
        "id": "g3kyeyx",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kyeyx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993874.0
    },
    {
        "author": "DerTagestrinker",
        "body": "AMD will more than double within a year. It’s cap is only ~$100b and they are at this point at least two years ahead of Intels processor tech, especially for laptops. Intel has ~70% share so there is massive share for AMD to steal.",
        "created_utc": 1598966380,
        "id": "g3l13s5",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l13s5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598995180.0
    },
    {
        "author": "PattayaGuy",
        "body": "AMD def has a ton of market share to eat away at. They're being aggressive in their road map and pushing forward while intel is jerking off in the corner. If AMD could deliver a beast GPU to match its Ryzen CPU's, they'd shoot straight up. NVidia isn't as lazy as intel though.",
        "created_utc": 1598963942,
        "id": "g3kw8b6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kw8b6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992742.0
    },
    {
        "author": "Cygopat",
        "body": "The only thing fundamentals do for you in this market is limit downside. There are very little plays for that available. Two weeks ago I bought INTC at $49. Buffett should have gotten into that but I guess it's not within his CoC.",
        "created_utc": 1598964026,
        "id": "g3kwe2p",
        "permalink": "/r/investing/comments/ikj975/warren_buffett_bubbles_can_last_for_a_long_time/g3kwe2p/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598992826.0
    },
    {
        "author": "Billionairess",
        "body": "Intel",
        "created_utc": 1598949028,
        "id": "g3kf4vt",
        "permalink": "/r/StockMarket/comments/ik3l3n/which_stocks_are_still_under_valued/g3kf4vt/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598977828.0
    },
    {
        "author": "R4N7",
        "body": "Oh I guess you’re diversified enough to not worrry. If RDSB is more then 5% of your portfolio you might sell half just to lower the risks and then buy again when you will see stock starting rebound. Actually I am in similar position with INTC (currently -9%) I am not buying more and not selling I am just holding without any actions. Time will show.",
        "created_utc": 1598960919,
        "id": "g3kquq2",
        "permalink": "/r/stocks/comments/ikhmdd/rdsb_shell_what_is_happening_to_the_price/g3kquq2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598989719.0
    },
    {
        "author": "Johnnyrocket47",
        "body": "Intc 50c 11/20",
        "created_utc": 1598946920,
        "id": "g3kd7wf",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd7wf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975720.0
    },
    {
        "author": "coachellathrowaway42",
        "body": "Intel 9/28 $50.5 C",
        "created_utc": 1598947689,
        "id": "g3kdxi7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdxi7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598976489.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC 1/15/21 $50c",
        "created_utc": 1598947104,
        "id": "g3kde04",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kde04/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975904.0
    },
    {
        "author": "Duke_of_Scotty",
        "body": "Did you see the part about Intel options. He's on track to learn that the first one is always free",
        "created_utc": 1598963542,
        "id": "g3kvh7d",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kvh7d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598992342.0
    },
    {
        "author": "Bellweirboy",
        "body": "Anyone bagholding Intel?",
        "created_utc": 1598963153,
        "id": "g3kur97",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kur97/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991953.0
    },
    {
        "author": "F1shB0wl816",
        "body": "Nio is one I’m hoping to explode but I figured there’s a lot of potential in the arkks too, a lot of that has a future and is still in complete infancy, it’s just a matter of what. Picking something that explodes like that will be a lucky pick though, some of it’s not even rational right now. \n\nI still think tsla, amd, and nvda have places to go though. Musk is just full of ideas, if 1 pans out for every 100, that could shake up the world as we know it. Amd will take over intels market eventually, they’re a head of the game, younger, fresher, intel just seems dated to me, lacking, it got high off its success and hasn’t thought straight since. Nvda is still making moves and growing fast and they have a handful of nice deals coming in the next few years.",
        "created_utc": 1598961463,
        "id": "g3krrgy",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krrgy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990263.0
    },
    {
        "author": "Berrymore13",
        "body": "Well my open is shaping up to be good. Holding NVDA, WORK, PINS, and INTC calls 🥰🤑",
        "created_utc": 1598964699,
        "id": "g3kxo8g",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kxo8g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993499.0
    },
    {
        "author": "Spaceseeds",
        "body": "Anybody who asks why intel has never looked at the fact that intel dominates the enterprise market and none of them are going to switch to AMD. The numbers are staggering. Intel has like over 80% of the market. They could outsource their chips and still be more successful than AMD. This doesn't even get into the rest of their business. I feel like Intel is a buy right now.",
        "created_utc": 1598964626,
        "id": "g3kxj41",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kxj41/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993426.0
    },
    {
        "author": "candidly1",
        "body": "AMD R&amp;D budget 1.5B\n\n\nINTC R&amp;D Budget  $13.3B\n\n\n\"jerking off\"",
        "created_utc": 1598965740,
        "id": "g3kzr0n",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kzr0n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598994540.0
    },
    {
        "author": "HBK05",
        "body": "uh..buy low sell high? Intel has been in charge of a lot of their market for the past 10+ years, they are only lacking behind for the past couple of years. I fully believe in their ability to bounce back eventually and compete with amd, hopefully pushing innovation and price/performance for consumer computers to the moon, but for now it's time to wait and see if they can pull it.",
        "created_utc": 1598963603,
        "id": "g3kvl5a",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kvl5a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992403.0
    },
    {
        "author": "therealsparticus",
        "body": "Anyone who has to deal with bare level cpu will tell you how good their engineering support is. Intel runs on ecosystem fuel. It’s their most.",
        "created_utc": 1598964055,
        "id": "g3kwfy6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kwfy6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992855.0
    },
    {
        "author": "sleepyguy007",
        "body": "intel, cisco, qualcomm, juniper etc were all huge bubble stocks in the tech bubble and were making tons of money.  \n\n\nThis tech bubble is just as bad and the same sort of mix of unprofitable companies, profitable overvalued companies, and now people just trying to cash out as fast as possible via SPACs and IPOs as there was then.  It might not be quite as steep a bubble yet, but its definitely getting there.  it took 4 years to go from 1200 -&gt; 5000 in 2000.   4 years ago the nasdaq was 5000 or so, so I could see it gettingto even 15000 and then crashing.  maybe not quite as big, but still as someone above mentioned economic conditions are far far worse now and we have much more debt than we did in 2000 as a nation",
        "created_utc": 1598955614,
        "id": "g3kl2if",
        "permalink": "/r/stocks/comments/ik5vev/why_the_stock_market_is_disconnected_from_the/g3kl2if/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598984414.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing  like a rebranding thing",
        "created_utc": 1598953918,
        "id": "g3kjhgx",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjhgx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598982718.0
    },
    {
        "author": "Started-Late",
        "body": "I’m calling it boys, $60 on Intel by 9/18",
        "created_utc": 1598963125,
        "id": "g3kupgv",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kupgv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991925.0
    },
    {
        "author": "DWINGMAN97",
        "body": "Very nice! I got in INTC yesterday after doing some TA and it looks really solid for continuation over the next month or so!",
        "created_utc": 1598965880,
        "id": "g3l014e",
        "permalink": "/r/StockMarket/comments/ikjue5/analysis_paralysis_hour_daily_market_insights/g3l014e/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598994680.0
    },
    {
        "author": "needcshelp1234",
        "body": "Buy amd options. Ever since Amd was more expensive than intc people have been saying buy intel",
        "created_utc": 1598965827,
        "id": "g3kzx89",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kzx89/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598994627.0
    },
    {
        "author": "laken906",
        "body": "FSLY, MSFT, RKT, SOXL, SPY, SE, IAU, INTC, VXX calls\n\nUUP puts\n\n10 for 10 premarket. Should prolly simplify the portfolio while I'm ahead this morning...",
        "created_utc": 1598962618,
        "id": "g3ktsg0",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ktsg0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598991418.0
    },
    {
        "author": "pervsensei11",
        "body": "Have TSLA, NVDA, PINS, NFLX, WORK, ZM, INTC calls and spreads\n\nCan’t wait for premarket",
        "created_utc": 1598945876,
        "id": "g3kc8l7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kc8l7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598974676.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing like a rebranding thing",
        "created_utc": 1598952960,
        "id": "g3kim3q",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kim3q/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598981760.0
    },
    {
        "author": "REDmonster333",
        "body": "Intel. Even though it looks bleak short term. But long term they will still pull through. They have 10+ years of dominance, I doubt they wont catch up.",
        "created_utc": 1598952851,
        "id": "g3kiik2",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kiik2/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1598981651.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "It’s not gonna happen but if INTC gaps up to $60 I get the WSB logo tattooed. This isn’t even a bet. This is a goal.",
        "created_utc": 1598954092,
        "id": "g3kjn5f",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjn5f/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982892.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC is up to $51.30 for +0.69% rn",
        "created_utc": 1598953629,
        "id": "g3kj7z9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kj7z9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982429.0
    },
    {
        "author": "HinduHamma",
        "body": "Thank god I ignored all you intel pumping clowns and bought nvda instead.",
        "created_utc": 1598968574,
        "id": "g3l6lsd",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l6lsd/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598997374.0
    },
    {
        "author": "ProPenguin800",
        "body": "Who else is playing Intel?",
        "created_utc": 1598946830,
        "id": "g3kd4xs",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd4xs/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598975630.0
    },
    {
        "author": "_ddeeezzzz",
        "body": "Truly hope some of you jumped on this NVDA train, shit is going to the next solar system, fuck the moon. Not too late they have a press event at 12est will probably spike on that as well... my earlier hope was 550 eow, now I have to roll up and out to maybe 600. \n\nAlso, I’d buy intel 50$ weekly calls on this slight AM dip, thank me later. \nBig options activity, new processor release wed, tech hype.",
        "created_utc": 1598969394,
        "id": "g3l8oln",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l8oln/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598998194.0
    },
    {
        "author": "Bellweirboy",
        "body": "EVERYTHING is up except Intel and Tesla. Everything. What am  I holding.......",
        "created_utc": 1598968894,
        "id": "g3l7f7v",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l7f7v/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598997694.0
    },
    {
        "author": "ztw2002",
        "body": "oooooof Intel is fucked again",
        "created_utc": 1598967402,
        "id": "g3l3kpa",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3kpa/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598996202.0
    },
    {
        "author": "ODNI_NSA_FBI_CIA_DIA",
        "body": "This AMD cuck is big mad NVDA GPU cards are better than AMDs. Stick with your CPU cuck , just because they beat boomer intel doesn't mean they can beat Leatherman.",
        "created_utc": 1598969547,
        "id": "g3l92k3",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l92k3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598998347.0
    },
    {
        "author": "pg209",
        "body": "Nice dip in most tech stocks\n\nGoing in on INTC, FTNT, MU, AMD\n\nAlso thinking of calls on WORK, they have earnings release next week, should be a good run-up",
        "created_utc": 1598967669,
        "id": "g3l49nk",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l49nk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598996469.0
    },
    {
        "author": "august_thecow",
        "body": "INTC is severely underbought... might buy more calls at open before the announcement",
        "created_utc": 1598960784,
        "id": "g3kqmuf",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kqmuf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598989584.0
    },
    {
        "author": "Davidkanye",
        "body": "I mean, I’ve been watching past earnings plays and there’s still time Imo. \n\nAdditionally eyeing INTC. \n\nCurrent play are post earnings: ESTC, INTU, AMGN",
        "created_utc": 1598947233,
        "id": "g3kdic9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdic9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598976033.0
    },
    {
        "author": "NervousTumbleweed",
        "body": " Ha ha wow Intel that was so funny, you sure had me going there with that dip. Probably should get back to going up though, right? haha.",
        "created_utc": 1598967875,
        "id": "g3l4sec",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l4sec/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598996675.0
    },
    {
        "author": "Infernal-Affairs",
        "body": "if INTC hits $60 before eow\n\nI'll just sell my calls or something idk",
        "created_utc": 1598954353,
        "id": "g3kjvtu",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjvtu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598983153.0
    },
    {
        "author": "GamblingMikkee",
        "body": "JPM, CVS, INTC, MO, WBA. Almost all single digits",
        "created_utc": 1598957426,
        "id": "g3kmu1x",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kmu1x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598986226.0
    },
    {
        "author": "sven2123",
        "body": "I agree. Intel is cheap right now and will go back up once they smoothe out operations",
        "created_utc": 1598958975,
        "id": "g3kog5j",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kog5j/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598987775.0
    },
    {
        "author": "lord_v0ldemort",
        "body": "Gj buying fucking intel and somehow thinking ur better at tech than Buffett while he rakes in  mounds of cash from his Apple stake\n\nUr up like 2% and he’s up like 400% but somehow you shit on him lol u clown",
        "created_utc": 1598968132,
        "id": "g3l5gbk",
        "permalink": "/r/investing/comments/ikj975/warren_buffett_bubbles_can_last_for_a_long_time/g3l5gbk/",
        "score": 2,
        "subreddit": "investing",
        "created": 1598996932.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Ffs lord please just have INTC pop like it did the week of May 12th",
        "created_utc": 1598969177,
        "id": "g3l83vu",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l83vu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598997977.0
    },
    {
        "author": "therealsparticus",
        "body": "AMD has already priced in half the growth of intel. Intel is their competition and is not a wimp.",
        "created_utc": 1598964236,
        "id": "g3kws71",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kws71/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993036.0
    },
    {
        "author": "DukeOfEarle88",
        "body": "AMD is going to get Intel this year- &amp; then quantum computers ftw.",
        "created_utc": 1598965074,
        "id": "g3kyeyx",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kyeyx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993874.0
    },
    {
        "author": "DerTagestrinker",
        "body": "AMD will more than double within a year. It’s cap is only ~$100b and they are at this point at least two years ahead of Intels processor tech, especially for laptops. Intel has ~70% share so there is massive share for AMD to steal.",
        "created_utc": 1598966380,
        "id": "g3l13s5",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l13s5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598995180.0
    },
    {
        "author": "Krakusmaximus",
        "body": "intel is trying to kill itself",
        "created_utc": 1598967466,
        "id": "g3l3qj1",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3qj1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996266.0
    },
    {
        "author": "therealsparticus",
        "body": "All AV companies including the one I work at use Intel. All of the software runs with less bugs on intel, board design support including pretty complex stuff like EM interference is way better from Intel. Intel has the best ecosystem despite their failures to catch TSMC on the fab side.\n\nTesla has their own asic instead of a GPU but even they run an intel processor.",
        "created_utc": 1598968656,
        "id": "g3l6tbk",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l6tbk/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598997456.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "I dropped another grand into Intel calls.",
        "created_utc": 1598969032,
        "id": "g3l7rem",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l7rem/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598997832.0
    },
    {
        "author": "learningtosail",
        "body": "We here at the intel shareholders club thank you for buying our shit from us so we can finally leave this stupid club.  \n\nYou can foot the bill for our class action now :)",
        "created_utc": 1598968025,
        "id": "g3l56kg",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l56kg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996825.0
    },
    {
        "author": "PattayaGuy",
        "body": "AMD def has a ton of market share to eat away at. They're being aggressive in their road map and pushing forward while intel is jerking off in the corner. If AMD could deliver a beast GPU to match its Ryzen CPU's, they'd shoot straight up. NVidia isn't as lazy as intel though.",
        "created_utc": 1598963942,
        "id": "g3kw8b6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kw8b6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992742.0
    },
    {
        "author": "Cygopat",
        "body": "The only thing fundamentals do for you in this market is limit downside. There are very little plays for that available. Two weeks ago I bought INTC at $49. Buffett should have gotten into that but I guess it's not within his CoC.",
        "created_utc": 1598964026,
        "id": "g3kwe2p",
        "permalink": "/r/investing/comments/ikj975/warren_buffett_bubbles_can_last_for_a_long_time/g3kwe2p/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598992826.0
    },
    {
        "author": "Billionairess",
        "body": "Intel",
        "created_utc": 1598949028,
        "id": "g3kf4vt",
        "permalink": "/r/StockMarket/comments/ik3l3n/which_stocks_are_still_under_valued/g3kf4vt/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598977828.0
    },
    {
        "author": "R4N7",
        "body": "Oh I guess you’re diversified enough to not worrry. If RDSB is more then 5% of your portfolio you might sell half just to lower the risks and then buy again when you will see stock starting rebound. Actually I am in similar position with INTC (currently -9%) I am not buying more and not selling I am just holding without any actions. Time will show.",
        "created_utc": 1598960919,
        "id": "g3kquq2",
        "permalink": "/r/stocks/comments/ikhmdd/rdsb_shell_what_is_happening_to_the_price/g3kquq2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598989719.0
    },
    {
        "author": "Johnnyrocket47",
        "body": "Intc 50c 11/20",
        "created_utc": 1598946920,
        "id": "g3kd7wf",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd7wf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975720.0
    },
    {
        "author": "coachellathrowaway42",
        "body": "Intel 9/28 $50.5 C",
        "created_utc": 1598947689,
        "id": "g3kdxi7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdxi7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598976489.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC 1/15/21 $50c",
        "created_utc": 1598947104,
        "id": "g3kde04",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kde04/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975904.0
    },
    {
        "author": "Duke_of_Scotty",
        "body": "Did you see the part about Intel options. He's on track to learn that the first one is always free",
        "created_utc": 1598963542,
        "id": "g3kvh7d",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kvh7d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598992342.0
    },
    {
        "author": "Bellweirboy",
        "body": "Anyone bagholding Intel?",
        "created_utc": 1598963153,
        "id": "g3kur97",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kur97/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991953.0
    },
    {
        "author": "imsoepicxd",
        "body": "Bleeding a bit on my INTC 55c 10/16 gamble. Hope my RKT calls print. Thinking of opening a position for DOCU but not sure yet.",
        "created_utc": 1598969342,
        "id": "g3l8jqi",
        "permalink": "/r/smallstreetbets/comments/ikil53/daily_market_discussion_thread_tuesday_september/g3l8jqi/",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1598998142.0
    },
    {
        "author": "WoodWoodClepper",
        "body": "Fuck off INTC",
        "created_utc": 1598970094,
        "id": "g3lahyr",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3lahyr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998894.0
    },
    {
        "author": "F1shB0wl816",
        "body": "Nio is one I’m hoping to explode but I figured there’s a lot of potential in the arkks too, a lot of that has a future and is still in complete infancy, it’s just a matter of what. Picking something that explodes like that will be a lucky pick though, some of it’s not even rational right now. \n\nI still think tsla, amd, and nvda have places to go though. Musk is just full of ideas, if 1 pans out for every 100, that could shake up the world as we know it. Amd will take over intels market eventually, they’re a head of the game, younger, fresher, intel just seems dated to me, lacking, it got high off its success and hasn’t thought straight since. Nvda is still making moves and growing fast and they have a handful of nice deals coming in the next few years.",
        "created_utc": 1598961463,
        "id": "g3krrgy",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krrgy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990263.0
    },
    {
        "author": "Berrymore13",
        "body": "Well my open is shaping up to be good. Holding NVDA, WORK, PINS, and INTC calls 🥰🤑",
        "created_utc": 1598964699,
        "id": "g3kxo8g",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kxo8g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993499.0
    },
    {
        "author": "Spaceseeds",
        "body": "Anybody who asks why intel has never looked at the fact that intel dominates the enterprise market and none of them are going to switch to AMD. The numbers are staggering. Intel has like over 80% of the market. They could outsource their chips and still be more successful than AMD. This doesn't even get into the rest of their business. I feel like Intel is a buy right now.",
        "created_utc": 1598964626,
        "id": "g3kxj41",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kxj41/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993426.0
    },
    {
        "author": "candidly1",
        "body": "AMD R&amp;D budget 1.5B\n\n\nINTC R&amp;D Budget  $13.3B\n\n\n\"jerking off\"",
        "created_utc": 1598965740,
        "id": "g3kzr0n",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kzr0n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598994540.0
    },
    {
        "author": "HBK05",
        "body": "uh..buy low sell high? Intel has been in charge of a lot of their market for the past 10+ years, they are only lacking behind for the past couple of years. I fully believe in their ability to bounce back eventually and compete with amd, hopefully pushing innovation and price/performance for consumer computers to the moon, but for now it's time to wait and see if they can pull it.",
        "created_utc": 1598963603,
        "id": "g3kvl5a",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kvl5a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992403.0
    },
    {
        "author": "FattySquirrelDaddy",
        "body": "What’s going on with INTC?",
        "created_utc": 1598967192,
        "id": "g3l3129",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3129/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598995992.0
    },
    {
        "author": "bicameral_mind",
        "body": "INTC just can't take two steps forward without another step back.",
        "created_utc": 1598967875,
        "id": "g3l4sdx",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l4sdx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996675.0
    },
    {
        "author": "WagieInTheCagie",
        "body": "INTC crying in the corner while all the other stonks are having an orgy. FeelsBadMan",
        "created_utc": 1598969401,
        "id": "g3l8pbc",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l8pbc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998201.0
    },
    {
        "author": "therealsparticus",
        "body": "Anyone who has to deal with bare level cpu will tell you how good their engineering support is. Intel runs on ecosystem fuel. It’s their most.",
        "created_utc": 1598964055,
        "id": "g3kwfy6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kwfy6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992855.0
    },
    {
        "author": "v0lati1e",
        "body": "Intc wtf",
        "created_utc": 1598967378,
        "id": "g3l3ijw",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3ijw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996178.0
    },
    {
        "author": "FindtheTruth5",
        "body": "Any chance for Intel to actually have a good day?",
        "created_utc": 1598969853,
        "id": "g3l9vov",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l9vov/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998653.0
    },
    {
        "author": "Zouk11",
        "body": "To add to this, i may be wrong but, I've seen many articles about Apple wanting to switch over their Mac CPUs from Intel to AMD, which makes sense for AMD to continue rising if a deal gets put into place with AMD and Apple.",
        "created_utc": 1598969863,
        "id": "g3l9wlb",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l9wlb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598998663.0
    },
    {
        "author": "SealCub-ClubbingClub",
        "body": "They still have massive market shares in sectors that they will be behind on for at least 2 years.\n\nIf that market share is significantly eroded before they get 7nm (with actual decent yields) then I think they could dip significantly.\n\nI think Intel is actually quite expensive right now. Their share price is around 2018, 2019 levels but their outlook for the next year or 2 is significantly worse than it was then. Maybe that's confidence in the 3+ year vision or maybe it's the market not discounting properly.",
        "created_utc": 1598968206,
        "id": "g3l5nar",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l5nar/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598997006.0
    },
    {
        "author": "arcarsen",
        "body": "INTC tiger lake release... will it release the tendies too?",
        "created_utc": 1598969126,
        "id": "g3l7yra",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l7yra/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598997926.0
    },
    {
        "author": "sleepyguy007",
        "body": "intel, cisco, qualcomm, juniper etc were all huge bubble stocks in the tech bubble and were making tons of money.  \n\n\nThis tech bubble is just as bad and the same sort of mix of unprofitable companies, profitable overvalued companies, and now people just trying to cash out as fast as possible via SPACs and IPOs as there was then.  It might not be quite as steep a bubble yet, but its definitely getting there.  it took 4 years to go from 1200 -&gt; 5000 in 2000.   4 years ago the nasdaq was 5000 or so, so I could see it gettingto even 15000 and then crashing.  maybe not quite as big, but still as someone above mentioned economic conditions are far far worse now and we have much more debt than we did in 2000 as a nation",
        "created_utc": 1598955614,
        "id": "g3kl2if",
        "permalink": "/r/stocks/comments/ik5vev/why_the_stock_market_is_disconnected_from_the/g3kl2if/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598984414.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing  like a rebranding thing",
        "created_utc": 1598953918,
        "id": "g3kjhgx",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjhgx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598982718.0
    },
    {
        "author": "Started-Late",
        "body": "I’m calling it boys, $60 on Intel by 9/18",
        "created_utc": 1598963125,
        "id": "g3kupgv",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kupgv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991925.0
    },
    {
        "author": "ShankThatSnitch",
        "body": "Yeah, but you also aren't responsible for other peoples money, and got lucky. What if NVDA pulled an INTC and ate shit over night?",
        "created_utc": 1598967155,
        "id": "g3l2xrg",
        "permalink": "/r/wallstreetbets/comments/ik2vki/rip_to_the_guy_who_took_out_a_15k_loan_for_30k_in/g3l2xrg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598995955.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Intel gonna absolutely fuck me 🥺",
        "created_utc": 1598967217,
        "id": "g3l33gz",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l33gz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996017.0
    },
    {
        "author": "DWINGMAN97",
        "body": "Very nice! I got in INTC yesterday after doing some TA and it looks really solid for continuation over the next month or so!",
        "created_utc": 1598965880,
        "id": "g3l014e",
        "permalink": "/r/StockMarket/comments/ikjue5/analysis_paralysis_hour_daily_market_insights/g3l014e/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598994680.0
    },
    {
        "author": "needcshelp1234",
        "body": "Buy amd options. Ever since Amd was more expensive than intc people have been saying buy intel",
        "created_utc": 1598965827,
        "id": "g3kzx89",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kzx89/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598994627.0
    },
    {
        "author": "almostmicrochip",
        "body": "INTEL entry point LOCATED\n\n\n\nENGAGE",
        "created_utc": 1598967498,
        "id": "g3l3thl",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3thl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996298.0
    },
    {
        "author": "enricosusatyo",
        "body": "Seriously, I’ve been an Intel shareholder for 5 years, and to be honest it’s not looking good for the company right now. \n\nIt’s cheap, I agree. But they gonna have to work hard to catch up to competitors.",
        "created_utc": 1598966807,
        "id": "g3l24hv",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l24hv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598995607.0
    },
    {
        "author": "StonkGoUp",
        "body": "Annnnddd I’m down 25% on INTC already",
        "created_utc": 1598967259,
        "id": "g3l37fd",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l37fd/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1598996059.0
    }
]