[
    {
        "author": "Iskippedfaceday",
        "body": "I mean... it’s hard to tell, but that’s a big incentive...\n\nTheir CEO actually led two companies in the same industry to record revenues and one was bought out by Broadcom. So I mean, maybe a buyout could happen in the future? Not sure as of now.",
        "created_utc": 1594819376,
        "id": "fy53tli",
        "permalink": "/r/pennystocks/comments/hrnakk/oss_small_supplemental_dd_shares_purchased_and/fy53tli/",
        "score": 13,
        "subreddit": "pennystocks",
        "created": 1594848176.0
    },
    {
        "author": "marksizzle",
        "body": "Great question! Two part answer. To be honest, usually these goals are just that. Goals. Typically set a little bit out of reach to motivate you to put in the extra work. So perhaps they believe $4.50 (just an example) is realistic, and $5.50 could only happen if he was really kicking ass. That being said, it gives him a target and you know the saying “shoot for the moon and you’ll land among the stars”.\n\nAdditionally, the CEO has a pretty solid background in which he led another PCIe tech company to success and an acquisition. They were purchased by Broadcom (a very large chip manufacturer of processors, SoCs, and connectivity chips). So yes, I believe that down the road there could be an acquisition in play, especially nvidia so heavily involved. Only time will tell on that part though.\n\nThanks for the questions.",
        "created_utc": 1594819517,
        "id": "fy541xp",
        "permalink": "/r/pennystocks/comments/hrnakk/oss_small_supplemental_dd_shares_purchased_and/fy541xp/",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1594848317.0
    },
    {
        "author": "couscous_nouvel",
        "body": "apple beats earnings?? eps is less than half of pre covid and people aint buying more phones or watches.\nin fact broadcom warned apple not to launch new product due to low demand and supply chain shock.\n\nim not a bear or a bull, i just have bullshit allergy",
        "created_utc": 1596236577,
        "id": "fzxfxxl",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzxfxxl/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1596265377.0
    },
    {
        "author": "souptrades",
        "body": "I would make your portfolio some split of individual stocks and ETFs. Personally if I had 60k ready to go I’d do something like 10k in ETFs and 50k in stocks. I know that’s maybe an unpopular pick but a lot of the ETFs will have crossover with each other and the stocks I’d buy \nYou really need to make the call yourself but again if it were ME I would go hard into the aforementioned ETFs. They all have room to run. (Maybe 10-20%) \nI’d put a gigantic sum into MSFT (like 15-20% of my portfolio) and then throw the rest into runners. \n\nReddit darlings are: SPOT, PYPL, ADBE, SE, NET, FSLY, LVGO, DDOG, BABA, MU, AMD, CRWD, V, M, JPM, INTC, NVDA, SPLK (splunk idr the exact callsign), AVGO, MELI, CRM, TTD, DOCU, SHOP, etc. all pretty pricy shares but I believe in all of those companies. AMZN is a near must buy but it’s something like $3000 now lol. \n\nSome smaller cap stocks I’m bullish on are DKNG, AVCT, APPS, KLR, maybe get yourself an EV they’re all the rage now idk \n\nAlso look into a REIT possibly. \n\nThat’s if you want to be active investing \nIf you want to be passive just go 60/40 ETF/Stock and throw it all into an array of ETFs and then MSFT or whatever",
        "created_utc": 1594499688,
        "id": "fxqtfkh",
        "permalink": "/r/stocks/comments/hpft03/advice_for_high_risk_etf_portfolio/fxqtfkh/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1594528488.0
    },
    {
        "author": "landob",
        "body": "&amp;#x200B;\n\nSYF, ELF, WDC, AMD, AVGO, QCOM, LOGI, WTRG are my main players",
        "created_utc": 1595544477,
        "id": "fz14dbx",
        "permalink": "/r/pennystocks/comments/hwkw80/attention_dont_panic_sell_right_now_the_entire/fz14dbx/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1595573277.0
    },
    {
        "author": "Japples123",
        "body": "AVGO can suck dick. That is all. Who pumped it? WHO I SAY!?!?",
        "created_utc": 1595369359,
        "id": "fyt8jdp",
        "permalink": "/r/wallstreetbets/comments/hveqed/what_are_your_moves_tomorrow_july_22_2020/fyt8jdp/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595398159.0
    },
    {
        "author": "rfgrunt",
        "body": "Uh, Qualcomm blocked/fought the Broadcom merger. Qualcomm blocked from buying NXP is more applicable.",
        "created_utc": 1596220980,
        "id": "fzwbxyj",
        "permalink": "/r/investing/comments/i17f96/nvidia_in_advanced_talks_to_buy_softbanks_chip/fzwbxyj/",
        "score": 3,
        "subreddit": "investing",
        "created": 1596249780.0
    },
    {
        "author": "flyingeverywhere11",
        "body": "I believe that news was already \"priced in\", NOK knows they will be moving forward with more expensive chips.\n\nOld news, but it was already mentioned:\nhttps://www.gsmarena.com/nokia_signs_a_contract_with_broadcom_for_delivering_5g_chips-news-43783.php#:~:text=Broadcom%20has%20signed%20a%20contract,delivering%20custom%2Dmade%205G%20chipsets.&amp;text=This%20contract%20will%20help%20the,by%20the%20end%20of%202020.",
        "created_utc": 1594507876,
        "id": "fxrnnay",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxrnnay/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594536676.0
    },
    {
        "author": "HammyHamDog",
        "body": "The trick is to find a company with growth that also pays a dividend... take a look at the 5 year chart of AVGO (Broadcom). They pay a 4% dividend, and have gone up from 130 (5 years ago) to 300+",
        "created_utc": 1594947916,
        "id": "fybb1vh",
        "permalink": "/r/stocks/comments/hshm8r/cef_with_monthly_dividends_what_am_i_missing/fybb1vh/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594976716.0
    },
    {
        "author": "swolking",
        "body": "I basically view T as a savings account. It’s well of its high and hardly moves, but the cash flow to cover the 7% yield is there. \n\nOther stocks I love for yield and growth: RTX, AVGO, ABBV, JPM.",
        "created_utc": 1594252324,
        "id": "fxdb5yt",
        "permalink": "/r/stocks/comments/hngng2/apy_on_ally_savings_just_dropped_to_1_whats_1/fxdb5yt/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594281124.0
    },
    {
        "author": "cambeiu",
        "body": "AMD, Nvidia, Google, Broadcom, Qualcomm, Samsung, Marvell are some that come to mind.",
        "created_utc": 1595814551,
        "id": "fzd1h4r",
        "permalink": "/r/StockMarket/comments/hxexbs/intel_stock_savaged_as_nextgen_chip_delay/fzd1h4r/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1595843351.0
    },
    {
        "author": "Treylw13",
        "body": "Being an older person, I don’t see any reason to own SPCE, FSLY or PTON at these levels.  PTON is niche and i don’t see it being a longer term winner.  Look at QQQ for broader tech exposure and its safer then just buying 1-2 large cap tech outright.  Some of the ARK ETFs are cool and actively managed, so it takes less risks off of you and puts more trust in their management team.\n\nI like paypal, visa and MasterCard all in the cashless bucket.\n\nNEE is a solid utility that also has renewable energy (good for old folks and look at the chart, it’s straight up and to the right)\nAMT or CCI would be better than Nokia for 5G - pays a dividend, steady growth and it’s not bottom fishing.\nAVGO would be a solid compliment to AMD, AVGO pays a nice dividend and has multiple revenue streams.\n\nYou seem to be picking a lot of stocks that have already had huge moves.  Your dad seems to already have a decent amount of capital to invest, so he’s no dummy.  He’ll probably take your recommendations, do his own research and put some money to work.  I think it would be a good lesson for both of you and i do the same with my daughter.\n\nBuy in tranches, don’t just put it all to work at once.",
        "created_utc": 1596059829,
        "id": "fznz80c",
        "permalink": "/r/stocks/comments/i06naw/stock_recommendations_for_my_dad/fznz80c/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1596088629.0
    },
    {
        "author": "SuspiciousStuff3",
        "body": "Cramer just shit on mu for avgo does that mean it's time for mu 90 calls?",
        "created_utc": 1596062120,
        "id": "fzo3q0j",
        "permalink": "/r/wallstreetbets/comments/i07nqx/what_are_your_moves_tomorrow_july_30_2020/fzo3q0j/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596090920.0
    },
    {
        "author": "jiunit",
        "body": "ABBV AVGO ADI\n\nTriple A fucking cancers",
        "created_utc": 1595893466,
        "id": "fzgjqsy",
        "permalink": "/r/wallstreetbets/comments/hyzs0g/what_are_your_moves_tomorrow_july_28_2020/fzgjqsy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595922266.0
    },
    {
        "author": "ragerokit",
        "body": "If you look at the stocks in funds then you can just pick the stocks in industry sectors that you fancy and buy those directly. you’ll probably out do the fund and in the long term you can save a lot in fees but even more in mediocre performance. Remember funds are investing billions on behalf of many people which means they over diversify to reduce their risk. They also have a highly paid and hugely motivated workforce selling “ the dangers of investing yourself”. \n\nSure you need to diversify somewhat. But that’s going to happen anyway through a sensible investment process.\n\nRight now I have about 260k which was 200k before corona.\n\nI’m keeping 150k in cash for the upcoming correction in the next 3-6 months\n\nI have about 50k in undervalued high div yield stocks aviva, m&amp;g, l&amp;g if they don’t come back up I’ll get the divs and if they do I’ll get a double win.\n\n25k in tech stocks that seem cast iron like google, Broadcom, skyworks, quorvo\n\n30k in synairgy who have just made a drug that sends 79 out of 100 sick corona patients home early - no way that’s not going to the moon shortly, someone just needs to let Trump know and he’ll be trying to buy the company. Yes it’s a speculative play to some particularly as it’s gone up 450% already but what else can do that right now and where is all the worlds attention right now? Besides it’s dipped and it’s on its next surge now or I’ll eat my iPad. \n\nAbout 20k in some volatile speculations cineworld, afc, itm \n\nWhen I buy back in with the cash it will be split between:\n\nAutonomous vehicle\nAi\nCloud\nOnline services\n5g\nGreen energy\n\nIf there isn’t a correction i’ll buy back in when corona is just another vaccine appointment rather than risk a massive hit right now. Mind you I lived through the .com bubble and so maybe I’m over sensitive about market corrections :)\n\nMy target is 20% capital growth per annum.  I want to retire early and every 50k I can generate is going to bring in 5-10k a year extra.\n\nMotley fool do a very good book on why you shouldn’t trust the financial services industry with your money. \n\nMy biggest regret in life is not fully realising how easy it is to invest yourself and that the key is not trying to pick the next big winner which is not impossible but too risky as a growth strategy, but picking the very obvious and staring you in the face next big winning sectors, then getting a sensible basket of successful and profitable stocks within a few of those industries and you will succeed. \n \nMy last point would be that most of us when young do not realise how little we need to invest when we have a very long life ahead. I could have bought amazon, Microsoft, google etc after the .com bubble and done very well on some very small investments, doing so would probably have led me to Netflix and maybe even Tesla but I didn’t because the big crash gave me such a financial hammering I turned away from stocks.",
        "created_utc": 1595678962,
        "id": "fz6uhj2",
        "permalink": "/r/stocks/comments/hxibos/would_it_be_better_to_play_it_risky_and_try_to/fz6uhj2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595707762.0
    },
    {
        "author": "kswissreject",
        "body": "AVGO - yahoo finance shows it slightly flat premarket but Schwab shows it down 20%, anyone know what's going on?  Quick search doesn't reveal any news.",
        "created_utc": 1595420130,
        "id": "fyv5gqn",
        "permalink": "/r/wallstreetbets/comments/hvr7i6/daily_discussion_thread_for_july_22_2020/fyv5gqn/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595448930.0
    },
    {
        "author": "HammyHamDog",
        "body": "Pfizer, Broadcom, Verizon.... with 200 dollars to start, buy Pfizer... they pay a good dividend, plus it has to potential to Moon because they are a good vaccine play for COVID 🚀🚀🚀🌙",
        "created_utc": 1595362332,
        "id": "fystzso",
        "permalink": "/r/stocks/comments/hvcz6n/looking_for_good_stock_that_is_consistent_anf/fystzso/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595391132.0
    },
    {
        "author": "CheapAlternative",
        "body": "\nStonk | Shares\n-----|------\nGOOG | 70\nSNPS | 200\nSNE | 300\nTSM | 300\nVICR | 200\nABB | 600\nAMAT | 200\nAMD | 200\nCDNS | 100\nFLR | 700\n\nProbably going to load up on KTOS, AVGO, LMT, and LCRX next, maybe also more SNE",
        "created_utc": 1595326380,
        "id": "fyr394z",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fyr394z/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595355180.0
    },
    {
        "author": "ritholtz76",
        "body": "I think, AVGO price is relatively cheaper compared to others. It is a big entity with decent growth expectations and good dividend.  Management seems to have good eye for buying tech companies and keep growing in size.",
        "created_utc": 1594525687,
        "id": "fxsnkw0",
        "permalink": "/r/stocks/comments/hpmiys/5g_stocks/fxsnkw0/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594554487.0
    },
    {
        "author": "nascentmind",
        "body": "This is true very much true in India. Most of these \"product\" companies are heavily filled with contractors and their numbers are almost equal to greater than the permanent employees. There are multiple contractors which are basically outsourcing companies with their employees working onsite at Intel, Cisco etc.\n\nMany a times I see that these contractors are employed to do the death march for failing products or if the company is failing, to keep them afloat. I have seen this with Renesas mobile which had their modem come from Nokia acquisition which had completely failed in the market. They then was brought by Broadcom and everyone was laid off and was again resold to some Chinese company.",
        "created_utc": 1595823118,
        "id": "fzdeta7",
        "permalink": "/r/investing/comments/hy3mgo/why_is_intel_losing_to_amd_people_just_realized/fzdeta7/",
        "score": 2,
        "subreddit": "investing",
        "created": 1595851918.0
    },
    {
        "author": "Myweedalt",
        "body": "Not soon but broadcom(September) still has some cheap 9/18s you can get now and hold.",
        "created_utc": 1596062667,
        "id": "fzo4rly",
        "permalink": "/r/wallstreetbets/comments/i07nqx/what_are_your_moves_tomorrow_july_30_2020/fzo4rly/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596091467.0
    },
    {
        "author": "PM_ME_DANK",
        "body": "Come on over to r/dividends! We'd be happy to help you out. A search of the subreddit for 'dividend growth stocks' should get you started on the right path. Also can take a look at some of the top holdings of VIG and VIGI. Personally I love $AVGO, $LMT, $UNH, $MDT, $HD, $MA, etc",
        "created_utc": 1594572666,
        "id": "fxud5e5",
        "permalink": "/r/investing/comments/hpwx3f/what_are_the_best_growth_dividend_stock/fxud5e5/",
        "score": 2,
        "subreddit": "investing",
        "created": 1594601466.0
    },
    {
        "author": "bluemagic_112",
        "body": "What are your thoughts on AVGO? Seems it still has more room to run and IV is decent.",
        "created_utc": 1594781387,
        "id": "fy3thy7",
        "permalink": "/r/wallstreetbets/comments/hr8uhb/what_are_your_moves_tomorrow_july_15_2020/fy3thy7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594810187.0
    },
    {
        "author": "GreasyGuido13",
        "body": "From CEO David Raun's LinkedIn profile:\n\n- $100M Product Line Growth (from zero)\n- 14 LIQUIDITY and/or FUNDING Events (M&amp;A/Great Shareholder Exits, IPO, Equity, Debt, Raised $75M)\n- 2 BUSINESS TURNAROUNDs (Record Revenues &amp; Profits…and Exit)\n- &gt;70% Dominant Share, Wins at all top 15 customers\n- SaaS/Software, Internet/Cloud, Semiconductors, Edge Computing, IP, B2B, B2C, Technology Based Real Estate, Vacation Rentals\n- $40M - $10B+ Revenues (Public Companies)\n- Startups, $5M - $40M (Private Companies)\n\nC-LEVEL &amp; SENIOR MANAGEMENT\n- CEO, COO, CFO, President, Founder (PLX, ASSIA, Actovate, Home Bay, One Stop Systems, DKR)\n- GM/VP (Broadcom/Avago, WSI)\n- Marketing (VP/EVP/CMO) (Pericom, PLX, WSI, ASSIA)\n- Business &amp; Corporate Development (EVP) (PLX)\n- Sales (VP) (WSI, ASSIA)\n\nBOARD OF DIRECTORS and ADVISORY BOARDS\n- Public Companies (OSS, PLX)\n- Private Companies (Kilopass, Simblee, ASSIA, Magma, Actovate)\n- Chairman, Audit Chair, Governance/Nominating Chair\n\nOTHER EXPERIENCE/INTEREST (when not in full time C-Level Role):\n- Top 3 Grossing Vacations Rentals on Shasta Lake www.shastalakeshoreretreat.com\n- Vacations 4 Rent (Vacation Rental Property Management &amp; Advising)\nwww.shastavacations4rent.com and www.vacations4rent.com",
        "created_utc": 1594699472,
        "id": "fy05kkj",
        "permalink": "/r/pennystocks/comments/hqm2v8/oss_detailed_dd_on_the_pcie_backbone_of_nvidia/fy05kkj/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594728272.0
    },
    {
        "author": "71109",
        "body": "Skyworks and Broadcom",
        "created_utc": 1593688172,
        "id": "fwomavl",
        "permalink": "/r/stocks/comments/hjuzg8/semiconductors/fwomavl/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593716972.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Broadcom over QCOM?",
        "created_utc": 1593688882,
        "id": "fwon4ba",
        "permalink": "/r/stocks/comments/hjuzg8/semiconductors/fwon4ba/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593717682.0
    },
    {
        "author": "barelyreadsenglish",
        "body": "Is avgo the next meme stock? Still room to pump before it dumps?",
        "created_utc": 1594206878,
        "id": "fxavvud",
        "permalink": "/r/wallstreetbets/comments/hnegmj/daily_discussion_thread_for_july_08_2020/fxavvud/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594235678.0
    },
    {
        "author": "automax",
        "body": "Well here you go:  \n[https://www.tipranks.com/analysts/stacy-rasgon](https://www.tipranks.com/analysts/stacy-rasgon)\n\n\\- Average Return --&gt; +2.6% Average return per rating\n\n4,380 out of 14,317 overall experts)  \n\n\nand he is the analyst for:\n\n  \nIntel\n\nTexas Instruments\n\nNvidia\n\nBroadcom\n\nAnalog Devices\n\nQualcomm\n\nAdvanced Micro Devices\n\nNXP Semiconductors\n\nApple\n\nMicrosoft\n\n&amp;#x200B;\n\nSurprisingly Toni Sacconaghi is alot better, but totally wrong about Netflix.\n\nAverage Return +21.7%\n\n[https://www.tipranks.com/analysts/toni-sacconaghi](https://www.tipranks.com/analysts/toni-sacconaghi)\n\nRanked #306 out of 6,817 Analysts on TipRanks (#376 out of 14,317 overall experts)",
        "created_utc": 1596070063,
        "id": "fzoih4r",
        "permalink": "/r/investing/comments/i0buek/bernstein_research_gets_it_soo_wrong_are_they/fzoih4r/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596098863.0
    },
    {
        "author": "ScroogeMcThrowaway",
        "body": "Anyone trade AVGO options here? Is it just a tech boomer stock that gives good dividends but is boring AF? Any insights. Despite being an AAPL supplier, it def doesn't move like AAPL.",
        "created_utc": 1595910207,
        "id": "fzhbzio",
        "permalink": "/r/wallstreetbets/comments/hyzs0g/what_are_your_moves_tomorrow_july_28_2020/fzhbzio/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595939007.0
    },
    {
        "author": "Recoil42",
        "body": "Both of those things are already integrated into the SOCs made by WCOM and AAPL.\n\nYeah, they'll get CSCO and maybe HPQ. But not iPhones or server hardware. They're competing against Broadcom and Qualcomm for desktop motherboards though, and I guess the question you want to ask yourself is: What advantage do they have over Broadcom / Qualcomm?\n\nI honestly don't know, but that's the first question I would ask. I don't know their product offering well enough, but it's a tough market to be an upstart in.",
        "created_utc": 1596134506,
        "id": "fzrbbv4",
        "permalink": "/r/wallstreetbets/comments/i0ji8h/daily_discussion_thread_for_july_30_2020/fzrbbv4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596163306.0
    },
    {
        "author": "ReThinkingForMyself",
        "body": "There are still some decent buys in second tier tech like AVGO.",
        "created_utc": 1593967277,
        "id": "fx0fc0f",
        "permalink": "/r/StockMarket/comments/hll5ga/should_i_invest_in_tech_now_or_wait_until_things/fx0fc0f/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593996077.0
    },
    {
        "author": "Take_Notice_Walk",
        "body": "I own TSM, Nvidia, LAM research, ABVO\n\nFor me TSM. Pretty steady and decent value\n\nNVDA. Overvalued but basically betting on the future being AI and blockchain \n\nLAM research for semis materials. Still room for growth. Pretty volatile so there might be more buying opportunities. \n\nBroadcom. A good dividend semi conductor. but i might consider dropping them for Qualcomm  \n\nI dropped Skyworks because I felt they relied mostly on Apple. Probably a dumb move since I need semi geared toward 5G",
        "created_utc": 1593923148,
        "id": "fwyx18i",
        "permalink": "/r/stocks/comments/hl5bts/whats_your_favorite_semi_conductor_investment/fwyx18i/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593951948.0
    },
    {
        "author": "Iskippedfaceday",
        "body": "They have the only PCIe 4.0 product compatible with Nvidia’s A-100 GPUs.\n\nTheir revenue has increased by 57% YoY and is currently double their market cap.\n\nTheir CEO has led two companies in the exact same industry to success and one was bought out by Broadcom. \n\nThe idea is not that they’re going to be a tech giant, but that trading at 100,000k average volume does not align with the the types of contracts they land and the types of companies they do business with. My argument was that they don’t deserve to be a giant yet, but trading at $3-4 would make much more sense than trading at $2 when considering their resume.",
        "created_utc": 1594704495,
        "id": "fy0cba6",
        "permalink": "/r/pennystocks/comments/hqm2v8/oss_detailed_dd_on_the_pcie_backbone_of_nvidia/fy0cba6/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594733295.0
    },
    {
        "author": "CharlieBrown364",
        "body": "I think QCOM has more potential than INTC, but is also riskier.\n\nI do think that TSM, AVGO, and NVDA are better than all the other semiconductor stocks. I would definitely buy these over QCOM or INTC. \n\nIf you want more growth (and therefore risk), you can go with AMD, MU, QRVO, or SWKS. Though do keep in mind that NVDA is growing very quickly. \n\nAlso, AVGO has a nice dividend.\n\nMy top semiconductor stock is NVDA. I want to buy in, but it’s pretty overvalued. But it also keeps going up.",
        "created_utc": 1594454308,
        "id": "fxmr102",
        "permalink": "/r/stocks/comments/hp5vze/qcom_or_intc/fxmr102/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594483108.0
    },
    {
        "author": "bagel_maker974",
        "body": "MSFT, SHOP, AMZN, AVGO, AMT, CCI are all holdings I would buy and hold without looking at for 15 years without worries",
        "created_utc": 1594240580,
        "id": "fxcnzby",
        "permalink": "/r/stocks/comments/hnomg6/what_stock_shows_promising_signs_to_buy_now_and/fxcnzby/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594269380.0
    },
    {
        "author": "ritholtz76",
        "body": "That is a big negative news. Samething with lots of small FOMO cloud stocks here (NET and LLNW). Employers are dumping into this rally. \n\nI think AVGO is not bad in terms of valuations. But it is a big company.  It is a collections of Semi companies.  mgmt seems to be thriving with this business model. Good dividend as well. They can pull close to $25 EPS next year. It went all the way to $150 during sell off and doubled in to the rally. I bought some at current price.",
        "created_utc": 1595083917,
        "id": "fygswdn",
        "permalink": "/r/stocks/comments/ht84wx/qualcomm_as_a_long_term_investment/fygswdn/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595112717.0
    },
    {
        "author": "ritholtz76",
        "body": "They have 13B long term debt with and 100B market cap.  Not sure if it is a bad thing. AVGO has a bigger debt. That is how they seem to roll with by buying companies.",
        "created_utc": 1595090326,
        "id": "fyh435a",
        "permalink": "/r/StockMarket/comments/ht85ik/qualcomm_as_a_long_term_investment/fyh435a/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1595119126.0
    },
    {
        "author": "Interesting_Material",
        "body": "MSFT, V, PKG, NET, TER, KL, AVGO are the main ones I've been putting money in.",
        "created_utc": 1596223631,
        "id": "fzwiouu",
        "permalink": "/r/stocks/comments/i1alut/what_stocks_are_your_long_term_holds/fzwiouu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596252431.0
    },
    {
        "author": "isospeedrix",
        "body": "Ugh my AVGO call placed at bottom didn’t filll",
        "created_utc": 1596209644,
        "id": "fzvhgyc",
        "permalink": "/r/wallstreetbets/comments/i15376/daily_discussion_thread_for_july_31_2020/fzvhgyc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596238444.0
    },
    {
        "author": "ThisPomelo4",
        "body": "That's a really interesting observation. The stock has consolidated around this level three times in the past 15 months or so. Kind of makes me wonder what could carry it across the threshold. Broadcom is involved in a variety of businesses, which makes it hard to trade the stock around individual headlines or events related to 5G, China, slowing handset demand, datacenters, cloud....\n\nAlso, what's up with the discrepancy between their EPS figures? The non-GAAP figure is always several times the GAAP figure, and the explanation they offer is extremely vague.\n\nAre you thinking it could break out up, or down? Seems like spot has been poking at that $320 ceiling from time to time. It wants to break through.",
        "created_utc": 1596085333,
        "id": "fzp7hmv",
        "permalink": "/r/options/comments/i0dzvz/avgo_doesnt_go/fzp7hmv/",
        "score": 1,
        "subreddit": "options",
        "created": 1596114133.0
    },
    {
        "author": "Parallelism09191989",
        "body": "AVGO\n\nIt’s a slow boring stock that’s increased dividends 6x \n\nIt’s legit",
        "created_utc": 1593885631,
        "id": "fwx9cxq",
        "permalink": "/r/stocks/comments/hl5bts/whats_your_favorite_semi_conductor_investment/fwx9cxq/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593914431.0
    },
    {
        "author": "Crazycracker24",
        "body": "If u wanted to do this, why not buy hood stock like AT&amp;T,broadcom,atria,  and get 1000 dollars in dividends a year and use the dividends to buy into pennies, that way you're playing with positive money.",
        "created_utc": 1594012782,
        "id": "fx2lhnx",
        "permalink": "/r/RobinHoodPennyStocks/comments/hlto70/lets_get_some_gains_tomorrow_please_i_wanna_be/fx2lhnx/",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1594041582.0
    },
    {
        "author": "Mausteidenmies",
        "body": "Nokia uses broadcom processors (that weird ReefShark thingy) for their base stations and Ericsson uses Intel surprisingly.\n\nI wouldn't touch Huawei with a stick.",
        "created_utc": 1593697859,
        "id": "fwp2auc",
        "permalink": "/r/stocks/comments/hjuzg8/semiconductors/fwp2auc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593726659.0
    },
    {
        "author": "kalavoycekala",
        "body": "For every one example you give that supports your argument there are 10 I can give to support mine. Look at Amazon, Netflix, Broadcom, Alibaba, Google, Nvidia, veeva, Facebook, etc. What does doing this achieve? It's the very definition of a confirmation bias.",
        "created_utc": 1594660799,
        "id": "fxy4jpf",
        "permalink": "/r/stocks/comments/hp7jjz/tesla_shortsellers_have_lost_18_billion_this_year/fxy4jpf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594689599.0
    },
    {
        "author": "type_error",
        "body": "AVGO?",
        "created_utc": 1594332205,
        "id": "fxgwb3j",
        "permalink": "/r/wallstreetbets/comments/hoa9dp/what_are_your_moves_tomorrow_july_10_2020/fxgwb3j/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594361005.0
    },
    {
        "author": "GooseRage",
        "body": "I’m personally a fan of dividend paying tech stocks AVGO, TXN, and IBM all pump out a pretty good dividend while also having growth potential.",
        "created_utc": 1594213105,
        "id": "fxb46r8",
        "permalink": "/r/stocks/comments/hn9c7h/dividends_stocks/fxb46r8/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594241905.0
    },
    {
        "author": "SpaceBollzz",
        "body": "I just trickled some fractional shares with microsoft and canadian solar, broadcom. Waiting for more red days... and deeper red days",
        "created_utc": 1595542360,
        "id": "fz107gu",
        "permalink": "/r/stocks/comments/hwkt5r/what_did_you_buy_on_this_bloody_thursday/fz107gu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595571160.0
    },
    {
        "author": "CheapAlternative",
        "body": "No. They're a shitty company with no technical excellence that nickels and dimes you on literally everything internally. Fundamentally intel will not be as successful as say AMD/Nvidia/Apple/Google/Broadcom for the simple reason that no self respecting engineer will want to work for them vs competitors elsewhere. They've been poached to the bone over the last 4 years and never even tried fighting back.",
        "created_utc": 1595623333,
        "id": "fz4o9fg",
        "permalink": "/r/stocks/comments/hx285e/would_now_be_a_good_time_to_buy_intel/fz4o9fg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595652133.0
    },
    {
        "author": "dameLillardManiac",
        "body": "yup. im tits deep in uvxy calls and avgo puts.",
        "created_utc": 1595372359,
        "id": "fyte1pa",
        "permalink": "/r/wallstreetbets/comments/hveqed/what_are_your_moves_tomorrow_july_22_2020/fyte1pa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595401159.0
    },
    {
        "author": "frrealz",
        "body": "Sorry, still don't understand your point. \n\n1. Qualcomm does not have any dealings with Huawei at the moment. They might START supplying Huawei with SoCs and modems, so Qualcomm will be gaining market share in China. Additionally, this would mean the QCOM-Huawei patent dispute would be resolved, with the chips in QCOM's favor.\n2. Qualcomm has a large involvement with the US government. There is a reason the Broadcom takeover was blocked and that the Feds strongly recommended FCC to revoke their ruling.",
        "created_utc": 1595017941,
        "id": "fyeak4g",
        "permalink": "/r/investing/comments/hstg5y/5g_long_term_play_in_ericsson_and_nokia/fyeak4g/",
        "score": 1,
        "subreddit": "investing",
        "created": 1595046741.0
    },
    {
        "author": "ritholtz76",
        "body": "Earning suppose to go up during next 5g cycle. Trading at reasonable valuations. Similarly with Broadcom. These are pretty big market cap companies. We are not going to see big returns. QCOM is a defianation of company with big moat technology. Management bought back 25% of the shares in last few years. I am really not sure how to evaluate these tech stocks with every reporter giving price targets at 30 to 40 PE future multiples with some TAM justification. I got little but of these two.",
        "created_utc": 1595040000,
        "id": "fyfdexm",
        "permalink": "/r/stocks/comments/ht84wx/qualcomm_as_a_long_term_investment/fyfdexm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595068800.0
    },
    {
        "author": "snake250",
        "body": "Oh sorry, I missed that you had AVGO already. Good choice.",
        "created_utc": 1594999253,
        "id": "fyd8873",
        "permalink": "/r/stocks/comments/hsv55w/critique_my_dividend_portfolio/fyd8873/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595028053.0
    },
    {
        "author": "HJForsythe",
        "body": "Fuckkkkkkkkkkkkkkkkk. Maybe if broadcom or qualcomm announces a acquisition. Without that they're fucked for a year.",
        "created_utc": 1596201952,
        "id": "fzuxzy3",
        "permalink": "/r/wallstreetbets/comments/i15376/daily_discussion_thread_for_july_31_2020/fzuxzy3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596230752.0
    },
    {
        "author": "svgscrewball",
        "body": "Seems pretty good for a start. On the DIP I would add\nMA, V, QQQ, ARKW.\n\nIf you have a very long time horizon (and are risk tolerant) you might want to consider\nMELI, FSLY, NOW, SHOP, AVGO",
        "created_utc": 1593852398,
        "id": "fwvyoz3",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fwvyoz3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593881198.0
    },
    {
        "author": "IndependentElevator2",
        "body": "23 y/o heading to law school next month.\n\nTaxable Brokerage:\n\n3 AVGO, 1 BLK, 20 BRK.B, 16 CRM, 11 CRSP, 5 DIS, 5 GS, 3 IXC, 100 JPM, 44 MSFT, 1 NRZ, 35 O, 4 SPG, 6 SQ, 2 T, 7 TWLO, and 1 WFC\n\nRoth IRA:\n\n20 BRK.B, 10 MSFT, 1 O, 6 VGT, 50 VNQ, and 43 VTI\n\n401K:\n\n$19460 in short term bonds to be transferred to Roth IRA",
        "created_utc": 1594015561,
        "id": "fx2oudw",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fx2oudw/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594044361.0
    },
    {
        "author": "Furloughedinvester",
        "body": "Broadcom apparently has a very nice dividend as well as the potential for great future growth.\n\nI've been eyeing them for a while but I'm already so damn heavy in the tech sector I hesitate to add more. However, once I've balanced my portfolio a bit with some consumer staples I'm going to add them for sure.",
        "created_utc": 1594277698,
        "id": "fxee09d",
        "permalink": "/r/stocks/comments/hnw24p/best_dividend_paying_stock/fxee09d/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594306498.0
    },
    {
        "author": "TrudeausMakeupArtist",
        "body": "MU or AVGO for the \"value\" chip play? Looking for a 20% price upside when the dust settles.",
        "created_utc": 1594691394,
        "id": "fxzsj8e",
        "permalink": "/r/wallstreetbets/comments/hqmoth/what_are_your_moves_tomorrow_july_14_2020/fxzsj8e/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594720194.0
    },
    {
        "author": "Vanmenton",
        "body": "I have a 220k+ portfolio and I only have 20k in tech (Broadcom). All other tech companies are valued based on future earnings and I don't play that game. Yes, over the past 5-6 years (when I started in my mid 20s) I could have made a killing, but I'm still not comfortable investing in a business that makes no money. \n\nApple makes money but I simply hate it with a passion so I won't invest in it. Google and Microsoft are overvalued. The rest are all junky meme stocks for the most part.",
        "created_utc": 1594767519,
        "id": "fy35rog",
        "permalink": "/r/CanadianInvestor/comments/hr28jj/23_years_old_loving_stocks_since_im_16_everyone/fy35rog/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1594796319.0
    },
    {
        "author": "Shaun8030",
        "body": "No amzn ? Long term Nvidia  &gt;&gt; Broadcom due to superior growth potential imo",
        "created_utc": 1594768554,
        "id": "fy37nli",
        "permalink": "/r/CanadianInvestor/comments/hr28jj/23_years_old_loving_stocks_since_im_16_everyone/fy37nli/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1594797354.0
    },
    {
        "author": "HammyHamDog",
        "body": "It doesn’t go with the theme of my portfolio... but I think it is a good company to invest in for the future... I believe in the CEO, and I believe in the company.... \n\nI personally like dividend paying value stocks with growth potential.... VZ, PFE, CSCO, AVGO, IBM, with a little something for super inflation like GOLD..\n\nBut the reason I suggested to you camping world was because you asked about fishing... and that is the company I believe to have an amazing CEO",
        "created_utc": 1594780808,
        "id": "fy3sj8i",
        "permalink": "/r/stocks/comments/hrb4l9/investing_in_fishing_stocks/fy3sj8i/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594809608.0
    },
    {
        "author": "Chem3580ThrowAway",
        "body": "Yeah I hold AVGO in my portfolio because it seems like a more stable business (will always needs semiconductors regardless of what tech company seems to be \"hot\" in the moment)",
        "created_utc": 1594994947,
        "id": "fyczpcc",
        "permalink": "/r/stocks/comments/hsv55w/critique_my_dividend_portfolio/fyczpcc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595023747.0
    },
    {
        "author": "snake250",
        "body": "Nice portfolio, I hold CVS, BMY, PFE and MO as well.\n\n&gt;&gt;No exposure to telecoms\n\nTake a look however at AVGO, TXN and QCOM. Dividend yields are comparable to PFE or JNJ. These are not \"hot\" tech stocks such as AAPL, but they are semiconductor manufacturers with durable businesses and if you think that tech will continue to \"grow and boom\", then semiconductor demand is going to continue to go up as well.",
        "created_utc": 1594993498,
        "id": "fycx3ab",
        "permalink": "/r/stocks/comments/hsv55w/critique_my_dividend_portfolio/fycx3ab/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595022298.0
    },
    {
        "author": "CharlieBrown364",
        "body": "I would recommend that you DCA (dollar cost average) into a mix of market ETFs (SPY, VOO), blue chip stocks (FAANG, MSFT, WMT to name a few), dividend stocks (not sure, maybe JNJ, PEP, AVGO, MO, O), growth stocks (PYPL, ADBE, TTD, TSLA, SQ, NVDA), and growth ETFs (WCLD, QCLD, ARKK).\n\nGenerally, having about 20-30 stocks is “diversified enough”. \n\nIf you want to be a little risky, you could put some of your money in Bitcoin. It’s INCREDIBLY risky, but has The potential to be huge. Just don’t put more than 10% of your money into it.\n\nIf you want to have some fun, and also be risky, you could put 5k aside for swing trading and day trading. This could be playing earnings season, news articles, penny stocks, or SPACs. You should only do this if you enjoy doing it, and beware of this risk involved.\n\nI am not a financial advisor, so don’t take my advice without doing your own DD (due diligence). I’m just a 15 year old kid with too much free time and an interest in stocks. \n\nAlso, I’m more interested in tech stocks, so the examples I gave above are all related to tech (other than the dividend stocks and QCLN). Keep this in mind.\n\nAlso, to the rest of you, what do you think about my strategy, and what do you think about my stock picks? Anything else you think OP should know?",
        "created_utc": 1594455347,
        "id": "fxmuazz",
        "permalink": "/r/stocks/comments/hoxp4g/stock_diversification_question/fxmuazz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594484147.0
    },
    {
        "author": "eskimohazz",
        "body": "CrowdStrike - they have the best and simplest EPP/EDR solution on the market, and the enterprise endpoint security market is collapsing and it’s not looking good for incumbents like Symantec/Broadcom or McAfee.",
        "created_utc": 1594430242,
        "id": "fxlavst",
        "permalink": "/r/investing/comments/hoslq1/what_tech_stocks_would_you_invest_in_today_with/fxlavst/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594459042.0
    },
    {
        "author": "landob",
        "body": "Thats really odd. I literally took the first advice I found \"invest in what you know\" and have had nothing but profit. Barely looked at any financial sheets. I work in IT, so most of what I grabbed is stuff I really know.\n\nWDC, AMD, QCOM, AVGO, LOGI - every single one of them is up for me.\n\nThen a couple randoms\n\nSYF - I owe them money on multiple cards. I like the 0 interest financing\n\nELF - I asked my wife what she would invest in, she chose this. I actually did look into its financials, board of directors, CEO etc and liked what I saw.\n\nWEN - I love their food, bought in when they announced breakfast\n\nWTRG - bought soley just to add to some diversification. Like I just brought up a list of dividend stocks and said to myself \"hmmm we always going to need water. Ill buy this\"\n\nYou could get a monkey to pick some random stocks and hold them and you will make money in this market it seems to me. Only things I've lost money on is random pennystocks I've derped with. Oh and Carnival, I was holding some of that before this Covid mess &gt;.&lt;",
        "created_utc": 1595545490,
        "id": "fz16axd",
        "permalink": "/r/StockMarket/comments/hwkond/every_single_stock_purchase_ive_made_this_year/fz16axd/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1595574290.0
    },
    {
        "author": "sayjota",
        "body": "You can use M1Finance to create fee-free \"etfs\" of your own. I have a pie holding 11 semi stocks in equal weights (TSM, NVDA, QCOMM, AVGO, AMD, etc) and it's 100% free.",
        "created_utc": 1596055670,
        "id": "fznquao",
        "permalink": "/r/investing/comments/i061w4/is_tsmc_still_a_good_buy_after_the_recent_price/fznquao/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596084470.0
    },
    {
        "author": "ritholtz76",
        "body": "I think every Tech stock is at 25+ future price for bottom line multiples. Most of the cloud stocks doesn't make money. They are going for 25+ future price per top line multiples. QCOM and AVGO are the ones going for relatively reasonable level. Market is blindly chasing for  next FAANG stock. Most of them are going to end up like Sears instead of walmart.",
        "created_utc": 1594521368,
        "id": "fxsdygv",
        "permalink": "/r/stocks/comments/hpmiys/5g_stocks/fxsdygv/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1594550168.0
    },
    {
        "author": "xorasun",
        "body": "Isn’t ticker symbol $HPQ for Hewlett Packard? $HPE is Hewlett Packard Enterprise Co. which is legally separate company.",
        "created_utc": 1594660053,
        "id": "fxy2zea",
        "permalink": "/r/wallstreetbets/comments/hqj3jx/dd_buy_hpe_like_right_now_today_tendies_print/fxy2zea/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594688853.0
    },
    {
        "author": "101emptyfireplaces",
        "body": "Yeah I like 8-12.\nGot my long term holders: MSFT, V, DIS, MCD\nGot my ETFS: VTI, ARKG, ARKW\nGot my short term plays: HPQ, NKE, NLCH\nAnd got my gambles: DKNG, SPCE",
        "created_utc": 1594408919,
        "id": "fxk7uex",
        "permalink": "/r/stocks/comments/horqot/how_many_stocks_is_appropriate_for_a_portfolio/fxk7uex/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594437719.0
    },
    {
        "author": "bgalli",
        "body": "There’s a few older posts holding some DD if anyone feels like searching. Still hold true.  Client A represents about 1.5b in sales and recurring maintenance. Contracts to be determined and signed end of august.\n\nThere’s an unknown B &amp; C, B is modeling torches, C is entering negotiations to just buy.\n\nPlasma induration torches represent a large reduction in GHG over traditional burning methods.\n\nThere are multiple lines: they sell waste destruction furnaces to the us military\n\nThey sell Drosrite, which extracts aluminum from aluminum waste without the use of salts\n\nOwn a 10% stake and supplying technology to HPQ, refining silicone at a much cheaper price than can be currently done (25% of the cost roughly), and of a purity good enough for solar use (99.999)\n\nModeling contract with a boring company to drill holes\n\nRecycling titanium powders for implant use\n\n\nGE uses their old tech for titanium powders and was once the standard",
        "created_utc": 1593788224,
        "id": "fwt65dv",
        "permalink": "/r/pennystocks/comments/hk6cf2/pyrogenesis_ramping_up_for_another_run_on_news_of/fwt65dv/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593817024.0
    },
    {
        "author": "jackneefus",
        "body": "Now that you mention it, XRX does seem to be overlooked and undervalued. They have negative growth, which kills stock valuation.  Other than that, XRX may have potential.  \n\nThe price has been fairly stable before and after March, and during their attempt to acquire Hewlett-Packard .    Since calls are getting squashed the last few weeks, maybe this is a better stock than an option.",
        "created_utc": 1594390553,
        "id": "fxj6n43",
        "permalink": "/r/wallstreetbets/comments/homrji/xrx_inhale_the_crotch_fumes/fxj6n43/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594419353.0
    },
    {
        "author": "spacegrab",
        "body": "short the obvious ERs.\n\nPuts on GRPN, BBBY, HPQ, all printed pretty heavily around ER time. The reckoning of failed quarterly reports is nigh.\n\nI haven't done my research on ERs next week yet.",
        "created_utc": 1595046077,
        "id": "fyfmag0",
        "permalink": "/r/wallstreetbets/comments/ht2v2k/weekend_discussion_thread_for_the_weekend_of_july/fyfmag0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595074877.0
    },
    {
        "author": "BanffandBoujee",
        "body": "HPQ and PYR are definitely hold for the next 2 months. I personally own 1900 shares of PYR!",
        "created_utc": 1593944716,
        "id": "fwzjjbx",
        "permalink": "/r/pennystocks/comments/hlidn1/hpq_silicon_hpqtsxv_investors_starting_to_figure/fwzjjbx/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593973516.0
    },
    {
        "author": "bgalli",
        "body": "The million mile battery has to do with using a silicon graphite anode and nickel cathode, not the actual lithium. Currently the hold backs are the 30k$/kg refining cost of silicon of the right purity, and the particle size.\n\nLook up HPQ silicon on the tsx-v if you want to read about it. They have signed NDAs for their battery tech, but they have the refining process using PUREVAP technology. Can refine to 99.99999% pure silicon and in the micron particle size for a fraction of the cost.\n\nIf their tech is proven, we could see 4000mile batteries with it. Lots of competition in this space tho, so who knows how it’ll all flesh out.",
        "created_utc": 1594186907,
        "id": "fxaauzr",
        "permalink": "/r/pennystocks/comments/hnb0z9/speculative_lithium_play_pev/fxaauzr/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594215707.0
    },
    {
        "author": "connmattwhite",
        "body": "HPQ 🚀 it will go to the moon baby! THE MOON! I will finally be able to afford the new Ford bronco for my wife’s second boyfriend",
        "created_utc": 1594981739,
        "id": "fychiv3",
        "permalink": "/r/wallstreetbets/comments/hsha5a/what_are_your_moves_tomorrow_july_17_2020/fychiv3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595010539.0
    },
    {
        "author": "TheOstrichThing",
        "body": "HP inc or HPQ siliconces inc?",
        "created_utc": 1594985441,
        "id": "fyclhbt",
        "permalink": "/r/wallstreetbets/comments/hsha5a/what_are_your_moves_tomorrow_july_17_2020/fyclhbt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595014241.0
    },
    {
        "author": "19wekamper",
        "body": "I leave for basic next week so I would like advice before I go \nBoeing 24% \nMsft 20%\nInseego 10%\nVivent solar 10%\nHPQ 10%\nPH 8% \nSCHD 8% \nMEI 5% \nCarnival MetLife and Altria are like 1-3% for the rest",
        "created_utc": 1593735717,
        "id": "fwr85dh",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fwr85dh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593764517.0
    },
    {
        "author": "devtendo",
        "body": "Long Vmw\nShort HPQ\nShort INTL\nLong NVDA\n\nUse options to make it as risky as you want",
        "created_utc": 1594832812,
        "id": "fy5u9ok",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy5u9ok/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594861612.0
    },
    {
        "author": "tmssqtch",
        "body": "Also, after the failed HPQ offer, wouldn’t HP be better positioned for the possible WFH future?",
        "created_utc": 1594905823,
        "id": "fy90sqp",
        "permalink": "/r/ValueInvesting/comments/hs6ck9/xerox_xrx/fy90sqp/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1594934623.0
    },
    {
        "author": "highlyordinary",
        "body": "HPQ GO BR \n\nEven split of incredibly risky short term calls expiring on the same day. \n\nPrinter go brrrrrr let’s goooooooooooooooo",
        "created_utc": 1594838659,
        "id": "fy66sco",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy66sco/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594867459.0
    },
    {
        "author": "Blacksin01",
        "body": "They make apple’s ARM lineup currently. With Apple moving away from Intel, they will likely be utilizing TSMC 7nm or 5nm process to make their new chips.",
        "created_utc": 1593730343,
        "id": "fwqyr97",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqyr97/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593759143.0
    },
    {
        "author": "gratitudeisbs",
        "body": "Swap INTC for AMD",
        "created_utc": 1593648212,
        "id": "fwn52jg",
        "permalink": "/r/wallstreetbets/comments/hjmaiy/soon_to_be_18_year_old_looking_for_advice/fwn52jg/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593677012.0
    },
    {
        "author": "SchpartyOn",
        "body": "If you actually had insider information and were trading on it, you'd be committing a felony. Additionally, if others were trading on that information, you'd be committing a felony.\n\nWhile you may coincidentally be right about the price, I think you're full of shit. No one with real intel would advertise it because they know how stupid that would be.",
        "created_utc": 1593709709,
        "id": "fwpsgy4",
        "permalink": "/r/pennystocks/comments/hk0mvr/gnus_final_update/fwpsgy4/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1593738509.0
    },
    {
        "author": "AxeLond",
        "body": "They have a lot of shit all about to drop soon, consoles, Big navi, Zen 3. \n\nIf initial console sales are strong then AMD will rally. \n\nGraphics is kinda meh, mostly just for enthusiast gamers, Nvidia makes way better shit overall. \n\nZen 3 could be strong, Intel is about self conflagrate from all the overclocking their doing on 14+++ nm CPUs. Zen 3 moving to 7 nm to 7 nm EuV is a relatively big step that should bring 10% performance, they're talking another +15% in architecture so it could solidify AMD at the top. AMD keep saying Q3, I have no idea how they will pull that off, that's like now. \n\nZen 4 will be total market dominance in CPU (if not from Zen 3), Huawei got banned from TSMC and AMD joinked their reserved wafers on 5 nm. The smartphone guys usually launch on the new node in like March, AMD will probably need longer, but not that much longer. There's another 7-10% performance or 15% power reduction at 5 nm and I think Intel is targeting their first 10 nm desktop processors Q4 2021 on 10 nm++ (no joke, that's their name). \n\nAMD's advantage fighting TSMC's 5nm vs Intel's 14 nm++++ for most of 2021 will absolutely crush Intel.",
        "created_utc": 1593730866,
        "id": "fwqzpao",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqzpao/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1593759666.0
    },
    {
        "author": "PassiveF1st",
        "body": "I don't understand why AMD stock has been so stagnant other than experts keeping it with Intel when as a company they are surpassing Intel every step of the way.",
        "created_utc": 1593721061,
        "id": "fwqgdak",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwqgdak/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593749861.0
    },
    {
        "author": "FATTEST_CAT",
        "body": "Intel uses its own foundries, Apple doesn't.  So if Apple stops using Intel, it means other foundries like TSMC will see increased business making chips Apple would have previously sourced from Intel foundries.",
        "created_utc": 1593730230,
        "id": "fwqyjqx",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqyjqx/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593759030.0
    },
    {
        "author": "Glassiftrue",
        "body": "If AMD doesn't hit 53 by tomorrow I'm ripping out my GPU and CPU and replacing with Intel and Nvidia out of spite",
        "created_utc": 1593618721,
        "id": "fwlduj6",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlduj6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593647521.0
    },
    {
        "author": "1st_Amendment_EndRun",
        "body": "Looking at the three year graph, all I see is s slide from $10 down to 0.75.\n\nSome news hit the street on 6/19 that caused their stock to jump and get wildly volatile after hours (Intel trying to get out of their losing position?)  There was a similar event that happened back on 5/7.  Research those and report back.",
        "created_utc": 1593646865,
        "id": "fwn2mld",
        "permalink": "/r/stocks/comments/hjlel1/vuzi_ar_play/fwn2mld/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593675665.0
    },
    {
        "author": "Bhawks489",
        "body": "So your “actual intel” is you seeing other penny stocks dip in the afternoon. \n\nStop spreading misinformation.",
        "created_utc": 1593711042,
        "id": "fwpv9ys",
        "permalink": "/r/pennystocks/comments/hk0mvr/gnus_final_update/fwpv9ys/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1593739842.0
    },
    {
        "author": "YouDoNotKnowMeSir",
        "body": "Ahhh I didn’t know that Apple was gonna use TSMC for their arm chips. I just knew intel made their own and that AMD uses TSMC as well.",
        "created_utc": 1593730388,
        "id": "fwqyu5u",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqyu5u/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593759188.0
    },
    {
        "author": "FATTEST_CAT",
        "body": "Yeah I had considered buying TSMC but I just bought some right now.  I think the crazy thing too is they haven't gotten stuck on nodes and their yields on 7nm are strong already.  Supposedly 5nm is doing well too in preproduction.  I don't know who will be able to compete with them on high end at that point.\n\nAnd it's kind of a snowball effect where they will get more money to develop better nodes and then of course more orders since power efficiency will be the best.  Just so long as they don't get stuck like Intel.",
        "created_utc": 1593732224,
        "id": "fwr25mh",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwr25mh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593761024.0
    },
    {
        "author": "KingBadford",
        "body": "Fuck AMD I'm buying an Intel cpu.  Oh wait I can't because I'm fucking broke.",
        "created_utc": 1593611757,
        "id": "fwl0fxi",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0fxi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640557.0
    },
    {
        "author": "boomdynasty",
        "body": "how is INTC looking to everyone? is it a good long term hold?",
        "created_utc": 1593598661,
        "id": "fwkj39f",
        "permalink": "/r/stocks/comments/hj63kf/rstocks_daily_discussion_wednesday_jul_01_2020/fwkj39f/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627461.0
    },
    {
        "author": "somanychins",
        "body": "Why is INTC dumping?",
        "created_utc": 1593632695,
        "id": "fwm8e8e",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwm8e8e/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593661495.0
    },
    {
        "author": "TT_Productions",
        "body": "I feel like everyone's been very optimistic heading into Independence Day thinking \"We're 'murica, there's no way the market doesn't kick ass through Independence Day!\" But as the covid numbers just continued to climb (and will continue to as they always do on Wednesdays, Thursdays, and Fridays, after catching up from the weekend delays) and broke 50,000, government officials realized they're going to have a massive shitstorm on their hands if they allow large gathering 4th of July firework celebrations and bars remaining opened etc, and started shutting stuff down. For some officials to say, \"we will not go back into lockdown or close businesses\" and then a couple days later close down businesses, they must be receiving enough intel/pressure to know they're going to lose far more tax revenue in the long run if they try and keep everything open through a huge holiday weekend and just shut everything down on Monday 7/6. I think we're heading down until another stimulus bill is passed.",
        "created_utc": 1593665773,
        "id": "fwnxl58",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwnxl58/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593694573.0
    },
    {
        "author": "RogueShroom",
        "body": "‘No one was ever upset buying intel’",
        "created_utc": 1593674858,
        "id": "fwo8ilw",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwo8ilw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593703658.0
    },
    {
        "author": "xWinnfield",
        "body": "First was INTC cancelling one of their projects, second was based on bad cashflow. That’s my understanding of the two drops",
        "created_utc": 1593699310,
        "id": "fwp5d3q",
        "permalink": "/r/stocks/comments/hjlel1/vuzi_ar_play/fwp5d3q/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593728110.0
    },
    {
        "author": "GoatTrade",
        "body": "Large volume and O/I on INTC 65c for AUG 21 (\\~50K combined)",
        "created_utc": 1593699462,
        "id": "fwp5own",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwp5own/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593728262.0
    },
    {
        "author": "awxomexd",
        "body": "Now might be a good time to buy. They've just dropped Intel completely from their base model products.",
        "created_utc": 1593594850,
        "id": "fwkfdav",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkfdav/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593623650.0
    },
    {
        "author": "crackercider",
        "body": "Intel is currently run by retards with a $250B market cap, AMD's got a $61B market cap with a ton of innovation across all market pricing segments, stomping Intel in the dick. We'll see how they stack up to Nvidia's new GPU's later this year.",
        "created_utc": 1593725527,
        "id": "fwqphyi",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwqphyi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593754327.0
    },
    {
        "author": "thatLifeVibe",
        "body": "I bought Intel today lol",
        "created_utc": 1593738778,
        "id": "fwrd6wm",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwrd6wm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593767578.0
    },
    {
        "author": "iCHAIT",
        "body": "Good time to buy Intel?",
        "created_utc": 1593688136,
        "id": "fwom9b7",
        "permalink": "/r/stocks/comments/hjt0ej/rstocks_daily_discussion_options_trading_thursday/fwom9b7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593716936.0
    },
    {
        "author": "elsinore11",
        "body": "Think the NASDAQ was 5k in 2000. Companies like intel and CSCO still aren’t as high as they were then.",
        "created_utc": 1593658414,
        "id": "fwnmj5z",
        "permalink": "/r/investing/comments/hi5sme/my_outlook_and_where_i_would_put_my_money_tell_me/fwnmj5z/",
        "score": 1,
        "subreddit": "investing",
        "created": 1593687214.0
    },
    {
        "author": "WOWzival",
        "body": "Speaking of aMd how is their competition going with Intel ??",
        "created_utc": 1593704079,
        "id": "fwpg5ai",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwpg5ai/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593732879.0
    },
    {
        "author": "Vcize",
        "body": "Great intel from a guy that doesn't even know what selling puts is, and also thinks nearly thrice bankrupt AAL is an example of a company we should be holding standards against.",
        "created_utc": 1593725954,
        "id": "fwqqcpb",
        "permalink": "/r/options/comments/hk0du9/nkla_looks_like_its_gonna_duummmmppppppppppppppppp/fwqqcpb/",
        "score": 1,
        "subreddit": "options",
        "created": 1593754754.0
    },
    {
        "author": "IamNaNIam",
        "body": "&gt;amd is more a hardware company than a software company, though\n\nUnfortunately. They are smoking Intel on hardware, but the future is AI",
        "created_utc": 1593734396,
        "id": "fwr5x2x",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwr5x2x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593763196.0
    },
    {
        "author": "sirvapedalot",
        "body": "Sounds like this article has the most up to date info. It doesn’t 100% convince me. It could be bad intel or it could be what Postmates’ bankers are saying so Uber or CCXX pays a bit more to get the deal done (very relevant after Uber lost the Grubhub deal)\n\nI guess I’d give it a 25% chance at best of it being CCXX but it shows he’s trying to land a big fish. Some people here don’t love Postmates anyway (they weren’t doing as well  before corona) so it could be a blessing in disguise. I think Postmates would do well on hype right now for sure but there are many other candidates if the bidding gets too high",
        "created_utc": 1593729558,
        "id": "fwqxbsr",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwqxbsr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593758358.0
    },
    {
        "author": "Captaincadet",
        "body": "You mean they dropped intel from ALL computers and taking their computers to in house ARM processors in the next 2 years.\n\nIt looks promising from the developer kit so maybe now’s the time to buy as they won’t have to pay intel which should make their computers more profitable going forward",
        "created_utc": 1593599027,
        "id": "fwkjgi4",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkjgi4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627827.0
    },
    {
        "author": "Captaincadet",
        "body": "They are going fully ARM\n\n\nhttps://www.theguardian.com/technology/2020/jun/22/apple-ditches-intel-for-arm-processors-in-big-sur-computers",
        "created_utc": 1593606057,
        "id": "fwkri7a",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkri7a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593634857.0
    },
    {
        "author": "p_giggles",
        "body": "A range of 1,500-15,000 is also a good way for a company to say \"we have no fuckin idea and want to hype up the stock\" \n\nYou don't see analysts covering Intel with a price range of $20-$200",
        "created_utc": 1593611047,
        "id": "fwkz7pe",
        "permalink": "/r/stocks/comments/hj5rzv/arkk_and_arkw_overpriced/fwkz7pe/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593639847.0
    },
    {
        "author": "DaPurpleMage",
        "body": "INTC down just as much",
        "created_utc": 1593611840,
        "id": "fwl0l4b",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0l4b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640640.0
    },
    {
        "author": "namrock23",
        "body": "I dunno, she's somebody's intel operative. I think she was probably the brains behind the operation too. More likely that she gets three months in a country club prison and then goes about her business, whatever that is these days",
        "created_utc": 1593729536,
        "id": "fwqxaad",
        "permalink": "/r/wallstreetbets/comments/hk6a4p/if_maxwell_isnt_murdered_before_testifying_which/fwqxaad/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593758336.0
    },
    {
        "author": "midasTch",
        "body": "QCOM — Apple,AMD,intel will buying chips from them.",
        "created_utc": 1593706381,
        "id": "fwpli2d",
        "permalink": "/r/stocks/comments/hjuzg8/semiconductors/fwpli2d/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593735181.0
    },
    {
        "author": "Crackbot420-69",
        "body": "It's mostly a graveyard of things I never sold from the last run up, so survivorship bias.\n\nGot some leaps on MO, JPM,  INTC. Other calls on KO, MGM.\n\nIts a grab bag of shit.",
        "created_utc": 1593709808,
        "id": "fwpsofx",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwpsofx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593738608.0
    },
    {
        "author": "DangerousLiberal",
        "body": "Check the share price of the two. Check Intel. Have you ever heard of dilution?",
        "created_utc": 1593623013,
        "id": "fwlmwrk",
        "permalink": "/r/wallstreetbets/comments/hj4tqj/the_tech_bubble_is_a_gay_bear_fantasy/fwlmwrk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593651813.0
    },
    {
        "author": "moltch",
        "body": "Are we getting jebaited, why is amd/micron/intel the only sector down??",
        "created_utc": 1593611913,
        "id": "fwl0ppa",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0ppa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640713.0
    },
    {
        "author": "ayyopapi",
        "body": "Intel fans",
        "created_utc": 1593624266,
        "id": "fwlplia",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlplia/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593653066.0
    },
    {
        "author": "RogueJello",
        "body": "I mostly agree, except with the claim \"equally\" since Intel is the default on everything oem site I've checked.",
        "created_utc": 1593647438,
        "id": "fwn3o1b",
        "permalink": "/r/SecurityAnalysis/comments/hil7s1/how_a_handful_of_chip_companies_came_to_control/fwn3o1b/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1593676238.0
    },
    {
        "author": "sp3xl",
        "body": "It’s going to be 200B-ish market cap in case intel dies completely. That puts it at 3x growth potential from what we have now.",
        "created_utc": 1593604556,
        "id": "fwkpk13",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkpk13/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593633356.0
    },
    {
        "author": "madnutbutter",
        "body": "US needs curfew and mandatory masks. Too many white woke kids colonized the BLM like their great grandparents colonized Africa. They don't understand they are manipulated by foreign intel and corporate interests to do rioting, attack police, attack cars and spread the rona.\n\nMarket will stay volatile with many crashes and pumps. I think we can say finally that the mouse is fuk.",
        "created_utc": 1593602547,
        "id": "fwkn5wd",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkn5wd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593631347.0
    },
    {
        "author": "rankiba",
        "body": "Doubt intel will die",
        "created_utc": 1593604621,
        "id": "fwkpmxx",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkpmxx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593633421.0
    },
    {
        "author": "Ehralur",
        "body": "That's because Intel doesn't operate in 3 of the world's biggest industries while pushing completely new technology that will change all of these. A bear case of 1,500 in case they stay just a car company compared to 15,000 if they dominate automotive energy and autonomous driving industries makes perfect sense.\n\nSo no, it has nothing to do with them being clueless, but it's just that you can't predict whether disruptions this big will succeed.",
        "created_utc": 1593618474,
        "id": "fwldcci",
        "permalink": "/r/stocks/comments/hj5rzv/arkk_and_arkw_overpriced/fwldcci/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593647274.0
    },
    {
        "author": "altaro22",
        "body": "Checked the holdings for that etf, i dont see any of the big players frol the junteenth movement on there? A lot of big corporations like MCD, INTEL etc.",
        "created_utc": 1593629567,
        "id": "fwm1f28",
        "permalink": "/r/pennystocks/comments/hjerel/beware_of_july_7th_blackout_day/fwm1f28/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593658367.0
    },
    {
        "author": "Mausteidenmies",
        "body": "Nokia uses broadcom processors (that weird ReefShark thingy) for their base stations and Ericsson uses Intel surprisingly.\n\nI wouldn't touch Huawei with a stick.",
        "created_utc": 1593697859,
        "id": "fwp2auc",
        "permalink": "/r/stocks/comments/hjuzg8/semiconductors/fwp2auc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593726659.0
    },
    {
        "author": "modulusshift",
        "body": "No joke, if Intel can’t sort their damn process out fast, AMD and Apple are going to eat their lunch. I think people don’t realize how dominant the first few Apple Silicon Macs are gonna be. Be glued to that Apple Q1 earnings report for the first rumblings. \n\nMan I remember back when it was just assumed Intel was going to be the dominant chip fab forever.",
        "created_utc": 1593738366,
        "id": "fwrciw5",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwrciw5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593767166.0
    },
    {
        "author": "IgnitedSpade",
        "body": "Intel is so shit they got dumped by apple and amd keeps pumping out the best workstation/server chips on the market. If the ceo of amd shitposted on twitter as much as elon does they'd be mooning rn.",
        "created_utc": 1593726594,
        "id": "fwqrmxo",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwqrmxo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593755394.0
    },
    {
        "author": "ob-j",
        "body": "I hopped on the AMD train when people were shitting all over them still and they were trading $14 a share. Like, who the fuck else competes with Intel (in the eyes of the dumb public) other than AMD? Why wouldn’t you invest? SMH",
        "created_utc": 1593715894,
        "id": "fwq5ljb",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwq5ljb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593744694.0
    },
    {
        "author": "reaper527",
        "body": "&gt; Now might be a good time to buy. They've just dropped Intel completely from their base model products.\n\nthat seems like the opposite of a good time to buy. are you old enough to remember how obscure and irrelevant apple was in the computer market in the 90's/early 2000's prior to them switching from ppc to intel x86-64?\n\nthey were a niche product.",
        "created_utc": 1593618073,
        "id": "fwlcj65",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwlcj65/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593646873.0
    },
    {
        "author": "AngelaQQ",
        "body": "Why would you \"bet\" against the best foundry in the world?\n\nLike, they're objectively the best. No one else touches them from a tech perspective. Samsung is probably the second best in the world, and they're a good 3 years behind TSMC's current node.\n\nTSMC manufactures chips for companies like Apple, AMD and Tesla. This is how good their reputation is. They're the best.\n\nBet against shit companies. Not the Rolls Royces of the industrial world.\n\nIf you're gonna bet against a foundry, bet against UMC or something. If Intel were just a foundry, I'd bet against them, because their foundry side has been floundering for years now. But I would never bet against Intel's sales and marketing....",
        "created_utc": 1593617063,
        "id": "fwlaidm",
        "permalink": "/r/stocks/comments/hjaa6i/bear_case_against_taiwan_semi_for_the_long_term/fwlaidm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593645863.0
    },
    {
        "author": "urmyheartBeatStopR",
        "body": "There ain't no way TSM is going to be bought.\n\nBuying a fab company is a shit move.\n\nAMD spun off it's fab factory.\n\nIntel is getting fucked with its own fab factory.\n\n---\n\nThat's because buying a big companies you inherit a lot of bullshit. Debt and the responsibility to integrate it with your current company (technology stack, etc..).\n\nMost tech company do aqcui hire on smaller companies.",
        "created_utc": 1593620227,
        "id": "fwlgynu",
        "permalink": "/r/stocks/comments/hj8zv0/apples_next_5g_company/fwlgynu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593649027.0
    },
    {
        "author": "uhhhhhuhhhhh",
        "body": "&gt;Intel has (or had) a very strong moat in terms of agreements with the various large scale OEM manufacturers for PCs. This has started to decay a bit in recent years, but the last time AMD had the better CPUs in the processor space (a couple of decades ago) you still could not buy a PC with an AMD processor because of various contracts Intel had with the PC manufacturers.\n\nThis is no longer an accurate description of the market. AMD and Intel are both widely available in basically every single OEM's product lineups. I'm sure there's a few random OEMs out there that only use one chip manufacturer for accidental reasons - they got a good wholesale deal, or they have a limited lineup of models and it was easier to use a single chipset - but in general AMD is equally available from all the big OEMs.",
        "created_utc": 1593641160,
        "id": "fwmr7mh",
        "permalink": "/r/SecurityAnalysis/comments/hil7s1/how_a_handful_of_chip_companies_came_to_control/fwmr7mh/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1593669960.0
    },
    {
        "author": "PassiveF1st",
        "body": "Hard to say... Honestly I'd go to AMD.. They are going to take a large amount of marketshare from Intel and NVidia.",
        "created_utc": 1593711219,
        "id": "fwpvnre",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwpvnre/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593740019.0
    },
    {
        "author": "Limewire-",
        "body": "AMD make excellent value products. Their CPUs are currently smashing Intel in terms of price to performance, and thir GPUs are significantly cheaper than Nvidias, alebeit with less performance.\n\nNvidia is the market leader in terms of GPUs, have just signed a deal with Mercedes and their next generation of GPU is said to be coming out later this year. With a significant performance increase, you'll be able to get a 2nd tier GPU from the new generation, which will outperform the 1st tier from the previous generation, giving them an even more sizable lead over AMD.\n\nSomeone mentioned in a post here that the future could be APUs - essentially you wouldn't need a GPU becuase the computer's CPU is so powerful it runs all the graphics requirements. And at the moment AMD and Intel do offer some APUs, but right now they are no match for having a dedicated GPU. We're probably 10 years or so away from APUs taking over, if they do.\n\nI personally hold a position in Nvidia.",
        "created_utc": 1593691102,
        "id": "fwopv9y",
        "permalink": "/r/stocks/comments/hjvaht/thoughts_on_amd/fwopv9y/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593719902.0
    },
    {
        "author": "Rick_Perrys_Asshole",
        "body": "INTC was up, I sold out 60% of my position, now I am BE\n\nAapl I sold out 50% of my position, will hold on the rest\n\nAMZN killed me today ... \n\nMSFT I was up 50%, sold off, and kept the rest\n\nMost of these are oct expirations, so I'm not worried",
        "created_utc": 1593631737,
        "id": "fwm69kc",
        "permalink": "/r/wallstreetbets/comments/hc9zjn/im_out_autists_dont_fight_the_future_if_you_suck/fwm69kc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593660537.0
    },
    {
        "author": "Agent_Simmons",
        "body": "No, that's just common sense. The actual Intel was that millions of dollars in shares we're gonna be dumped at 3.3. and what do you fucking know, turns out it was true.",
        "created_utc": 1593711405,
        "id": "fwpw26q",
        "permalink": "/r/pennystocks/comments/hk0mvr/gnus_final_update/fwpw26q/",
        "score": 0,
        "subreddit": "pennystocks",
        "created": 1593740205.0
    },
    {
        "author": "EndFCC230forReddit",
        "body": "So then what's the point of this megathread? To redirect people just to search for DD? 🤔 or is it just to post more rocketships to convince more passing fools to become bag holders?\n\nCome then, lay out the intel",
        "created_utc": 1593654479,
        "id": "fwng0re",
        "permalink": "/r/pennystocks/comments/hjnvmn/sfet_megathread_72/fwng0re/",
        "score": -2,
        "subreddit": "pennystocks",
        "created": 1593683279.0
    },
    {
        "author": "Agent_Simmons",
        "body": "I have actual Intel that it's gonna get fucking shit on at 3.3. also, look at the candlesticks. No bearish patterns yet. Look at the graph. Patterns consistent with previous daily climb patterns. The news isn't shit, CEO making an announcement Monday. \n\nThat being said, DO NOT HOLD TILL MONDAY. THATS HOW YOU LOSE",
        "created_utc": 1593709293,
        "id": "fwprlhv",
        "permalink": "/r/pennystocks/comments/hk0mvr/gnus_final_update/fwprlhv/",
        "score": -3,
        "subreddit": "pennystocks",
        "created": 1593738093.0
    },
    {
        "author": "gratitudeisbs",
        "body": "Swap INTC for AMD",
        "created_utc": 1593648212,
        "id": "fwn52jg",
        "permalink": "/r/wallstreetbets/comments/hjmaiy/soon_to_be_18_year_old_looking_for_advice/fwn52jg/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593677012.0
    },
    {
        "author": "Glassiftrue",
        "body": "If AMD doesn't hit 53 by tomorrow I'm ripping out my GPU and CPU and replacing with Intel and Nvidia out of spite",
        "created_utc": 1593618721,
        "id": "fwlduj6",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlduj6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593647521.0
    },
    {
        "author": "1st_Amendment_EndRun",
        "body": "Looking at the three year graph, all I see is s slide from $10 down to 0.75.\n\nSome news hit the street on 6/19 that caused their stock to jump and get wildly volatile after hours (Intel trying to get out of their losing position?)  There was a similar event that happened back on 5/7.  Research those and report back.",
        "created_utc": 1593646865,
        "id": "fwn2mld",
        "permalink": "/r/stocks/comments/hjlel1/vuzi_ar_play/fwn2mld/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593675665.0
    },
    {
        "author": "KingBadford",
        "body": "Fuck AMD I'm buying an Intel cpu.  Oh wait I can't because I'm fucking broke.",
        "created_utc": 1593611757,
        "id": "fwl0fxi",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0fxi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640557.0
    },
    {
        "author": "boomdynasty",
        "body": "how is INTC looking to everyone? is it a good long term hold?",
        "created_utc": 1593598661,
        "id": "fwkj39f",
        "permalink": "/r/stocks/comments/hj63kf/rstocks_daily_discussion_wednesday_jul_01_2020/fwkj39f/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627461.0
    },
    {
        "author": "somanychins",
        "body": "Why is INTC dumping?",
        "created_utc": 1593632695,
        "id": "fwm8e8e",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwm8e8e/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593661495.0
    },
    {
        "author": "TT_Productions",
        "body": "I feel like everyone's been very optimistic heading into Independence Day thinking \"We're 'murica, there's no way the market doesn't kick ass through Independence Day!\" But as the covid numbers just continued to climb (and will continue to as they always do on Wednesdays, Thursdays, and Fridays, after catching up from the weekend delays) and broke 50,000, government officials realized they're going to have a massive shitstorm on their hands if they allow large gathering 4th of July firework celebrations and bars remaining opened etc, and started shutting stuff down. For some officials to say, \"we will not go back into lockdown or close businesses\" and then a couple days later close down businesses, they must be receiving enough intel/pressure to know they're going to lose far more tax revenue in the long run if they try and keep everything open through a huge holiday weekend and just shut everything down on Monday 7/6. I think we're heading down until another stimulus bill is passed.",
        "created_utc": 1593665773,
        "id": "fwnxl58",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwnxl58/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593694573.0
    },
    {
        "author": "RogueShroom",
        "body": "‘No one was ever upset buying intel’",
        "created_utc": 1593674858,
        "id": "fwo8ilw",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwo8ilw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593703658.0
    },
    {
        "author": "xWinnfield",
        "body": "First was INTC cancelling one of their projects, second was based on bad cashflow. That’s my understanding of the two drops",
        "created_utc": 1593699310,
        "id": "fwp5d3q",
        "permalink": "/r/stocks/comments/hjlel1/vuzi_ar_play/fwp5d3q/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593728110.0
    },
    {
        "author": "GoatTrade",
        "body": "Large volume and O/I on INTC 65c for AUG 21 (\\~50K combined)",
        "created_utc": 1593699462,
        "id": "fwp5own",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwp5own/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593728262.0
    },
    {
        "author": "awxomexd",
        "body": "Now might be a good time to buy. They've just dropped Intel completely from their base model products.",
        "created_utc": 1593594850,
        "id": "fwkfdav",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkfdav/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593623650.0
    },
    {
        "author": "iCHAIT",
        "body": "Good time to buy Intel?",
        "created_utc": 1593688136,
        "id": "fwom9b7",
        "permalink": "/r/stocks/comments/hjt0ej/rstocks_daily_discussion_options_trading_thursday/fwom9b7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593716936.0
    },
    {
        "author": "elsinore11",
        "body": "Think the NASDAQ was 5k in 2000. Companies like intel and CSCO still aren’t as high as they were then.",
        "created_utc": 1593658414,
        "id": "fwnmj5z",
        "permalink": "/r/investing/comments/hi5sme/my_outlook_and_where_i_would_put_my_money_tell_me/fwnmj5z/",
        "score": 1,
        "subreddit": "investing",
        "created": 1593687214.0
    },
    {
        "author": "WOWzival",
        "body": "Speaking of aMd how is their competition going with Intel ??",
        "created_utc": 1593704079,
        "id": "fwpg5ai",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwpg5ai/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593732879.0
    },
    {
        "author": "Captaincadet",
        "body": "You mean they dropped intel from ALL computers and taking their computers to in house ARM processors in the next 2 years.\n\nIt looks promising from the developer kit so maybe now’s the time to buy as they won’t have to pay intel which should make their computers more profitable going forward",
        "created_utc": 1593599027,
        "id": "fwkjgi4",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkjgi4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627827.0
    },
    {
        "author": "Captaincadet",
        "body": "They are going fully ARM\n\n\nhttps://www.theguardian.com/technology/2020/jun/22/apple-ditches-intel-for-arm-processors-in-big-sur-computers",
        "created_utc": 1593606057,
        "id": "fwkri7a",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkri7a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593634857.0
    },
    {
        "author": "p_giggles",
        "body": "A range of 1,500-15,000 is also a good way for a company to say \"we have no fuckin idea and want to hype up the stock\" \n\nYou don't see analysts covering Intel with a price range of $20-$200",
        "created_utc": 1593611047,
        "id": "fwkz7pe",
        "permalink": "/r/stocks/comments/hj5rzv/arkk_and_arkw_overpriced/fwkz7pe/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593639847.0
    },
    {
        "author": "DaPurpleMage",
        "body": "INTC down just as much",
        "created_utc": 1593611840,
        "id": "fwl0l4b",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0l4b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640640.0
    },
    {
        "author": "midasTch",
        "body": "QCOM — Apple,AMD,intel will buying chips from them.",
        "created_utc": 1593706381,
        "id": "fwpli2d",
        "permalink": "/r/stocks/comments/hjuzg8/semiconductors/fwpli2d/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593735181.0
    },
    {
        "author": "DangerousLiberal",
        "body": "Check the share price of the two. Check Intel. Have you ever heard of dilution?",
        "created_utc": 1593623013,
        "id": "fwlmwrk",
        "permalink": "/r/wallstreetbets/comments/hj4tqj/the_tech_bubble_is_a_gay_bear_fantasy/fwlmwrk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593651813.0
    },
    {
        "author": "moltch",
        "body": "Are we getting jebaited, why is amd/micron/intel the only sector down??",
        "created_utc": 1593611913,
        "id": "fwl0ppa",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0ppa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640713.0
    },
    {
        "author": "ayyopapi",
        "body": "Intel fans",
        "created_utc": 1593624266,
        "id": "fwlplia",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlplia/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593653066.0
    },
    {
        "author": "RogueJello",
        "body": "I mostly agree, except with the claim \"equally\" since Intel is the default on everything oem site I've checked.",
        "created_utc": 1593647438,
        "id": "fwn3o1b",
        "permalink": "/r/SecurityAnalysis/comments/hil7s1/how_a_handful_of_chip_companies_came_to_control/fwn3o1b/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1593676238.0
    },
    {
        "author": "sp3xl",
        "body": "It’s going to be 200B-ish market cap in case intel dies completely. That puts it at 3x growth potential from what we have now.",
        "created_utc": 1593604556,
        "id": "fwkpk13",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkpk13/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593633356.0
    },
    {
        "author": "madnutbutter",
        "body": "US needs curfew and mandatory masks. Too many white woke kids colonized the BLM like their great grandparents colonized Africa. They don't understand they are manipulated by foreign intel and corporate interests to do rioting, attack police, attack cars and spread the rona.\n\nMarket will stay volatile with many crashes and pumps. I think we can say finally that the mouse is fuk.",
        "created_utc": 1593602547,
        "id": "fwkn5wd",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkn5wd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593631347.0
    },
    {
        "author": "rankiba",
        "body": "Doubt intel will die",
        "created_utc": 1593604621,
        "id": "fwkpmxx",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkpmxx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593633421.0
    },
    {
        "author": "Ehralur",
        "body": "That's because Intel doesn't operate in 3 of the world's biggest industries while pushing completely new technology that will change all of these. A bear case of 1,500 in case they stay just a car company compared to 15,000 if they dominate automotive energy and autonomous driving industries makes perfect sense.\n\nSo no, it has nothing to do with them being clueless, but it's just that you can't predict whether disruptions this big will succeed.",
        "created_utc": 1593618474,
        "id": "fwldcci",
        "permalink": "/r/stocks/comments/hj5rzv/arkk_and_arkw_overpriced/fwldcci/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593647274.0
    },
    {
        "author": "altaro22",
        "body": "Checked the holdings for that etf, i dont see any of the big players frol the junteenth movement on there? A lot of big corporations like MCD, INTEL etc.",
        "created_utc": 1593629567,
        "id": "fwm1f28",
        "permalink": "/r/pennystocks/comments/hjerel/beware_of_july_7th_blackout_day/fwm1f28/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593658367.0
    },
    {
        "author": "Mausteidenmies",
        "body": "Nokia uses broadcom processors (that weird ReefShark thingy) for their base stations and Ericsson uses Intel surprisingly.\n\nI wouldn't touch Huawei with a stick.",
        "created_utc": 1593697859,
        "id": "fwp2auc",
        "permalink": "/r/stocks/comments/hjuzg8/semiconductors/fwp2auc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593726659.0
    },
    {
        "author": "reaper527",
        "body": "&gt; Now might be a good time to buy. They've just dropped Intel completely from their base model products.\n\nthat seems like the opposite of a good time to buy. are you old enough to remember how obscure and irrelevant apple was in the computer market in the 90's/early 2000's prior to them switching from ppc to intel x86-64?\n\nthey were a niche product.",
        "created_utc": 1593618073,
        "id": "fwlcj65",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwlcj65/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593646873.0
    },
    {
        "author": "AngelaQQ",
        "body": "Why would you \"bet\" against the best foundry in the world?\n\nLike, they're objectively the best. No one else touches them from a tech perspective. Samsung is probably the second best in the world, and they're a good 3 years behind TSMC's current node.\n\nTSMC manufactures chips for companies like Apple, AMD and Tesla. This is how good their reputation is. They're the best.\n\nBet against shit companies. Not the Rolls Royces of the industrial world.\n\nIf you're gonna bet against a foundry, bet against UMC or something. If Intel were just a foundry, I'd bet against them, because their foundry side has been floundering for years now. But I would never bet against Intel's sales and marketing....",
        "created_utc": 1593617063,
        "id": "fwlaidm",
        "permalink": "/r/stocks/comments/hjaa6i/bear_case_against_taiwan_semi_for_the_long_term/fwlaidm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593645863.0
    },
    {
        "author": "urmyheartBeatStopR",
        "body": "There ain't no way TSM is going to be bought.\n\nBuying a fab company is a shit move.\n\nAMD spun off it's fab factory.\n\nIntel is getting fucked with its own fab factory.\n\n---\n\nThat's because buying a big companies you inherit a lot of bullshit. Debt and the responsibility to integrate it with your current company (technology stack, etc..).\n\nMost tech company do aqcui hire on smaller companies.",
        "created_utc": 1593620227,
        "id": "fwlgynu",
        "permalink": "/r/stocks/comments/hj8zv0/apples_next_5g_company/fwlgynu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593649027.0
    },
    {
        "author": "uhhhhhuhhhhh",
        "body": "&gt;Intel has (or had) a very strong moat in terms of agreements with the various large scale OEM manufacturers for PCs. This has started to decay a bit in recent years, but the last time AMD had the better CPUs in the processor space (a couple of decades ago) you still could not buy a PC with an AMD processor because of various contracts Intel had with the PC manufacturers.\n\nThis is no longer an accurate description of the market. AMD and Intel are both widely available in basically every single OEM's product lineups. I'm sure there's a few random OEMs out there that only use one chip manufacturer for accidental reasons - they got a good wholesale deal, or they have a limited lineup of models and it was easier to use a single chipset - but in general AMD is equally available from all the big OEMs.",
        "created_utc": 1593641160,
        "id": "fwmr7mh",
        "permalink": "/r/SecurityAnalysis/comments/hil7s1/how_a_handful_of_chip_companies_came_to_control/fwmr7mh/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1593669960.0
    },
    {
        "author": "Limewire-",
        "body": "AMD make excellent value products. Their CPUs are currently smashing Intel in terms of price to performance, and thir GPUs are significantly cheaper than Nvidias, alebeit with less performance.\n\nNvidia is the market leader in terms of GPUs, have just signed a deal with Mercedes and their next generation of GPU is said to be coming out later this year. With a significant performance increase, you'll be able to get a 2nd tier GPU from the new generation, which will outperform the 1st tier from the previous generation, giving them an even more sizable lead over AMD.\n\nSomeone mentioned in a post here that the future could be APUs - essentially you wouldn't need a GPU becuase the computer's CPU is so powerful it runs all the graphics requirements. And at the moment AMD and Intel do offer some APUs, but right now they are no match for having a dedicated GPU. We're probably 10 years or so away from APUs taking over, if they do.\n\nI personally hold a position in Nvidia.",
        "created_utc": 1593691102,
        "id": "fwopv9y",
        "permalink": "/r/stocks/comments/hjvaht/thoughts_on_amd/fwopv9y/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593719902.0
    },
    {
        "author": "Rick_Perrys_Asshole",
        "body": "INTC was up, I sold out 60% of my position, now I am BE\n\nAapl I sold out 50% of my position, will hold on the rest\n\nAMZN killed me today ... \n\nMSFT I was up 50%, sold off, and kept the rest\n\nMost of these are oct expirations, so I'm not worried",
        "created_utc": 1593631737,
        "id": "fwm69kc",
        "permalink": "/r/wallstreetbets/comments/hc9zjn/im_out_autists_dont_fight_the_future_if_you_suck/fwm69kc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593660537.0
    },
    {
        "author": "EndFCC230forReddit",
        "body": "So then what's the point of this megathread? To redirect people just to search for DD? 🤔 or is it just to post more rocketships to convince more passing fools to become bag holders?\n\nCome then, lay out the intel",
        "created_utc": 1593654479,
        "id": "fwng0re",
        "permalink": "/r/pennystocks/comments/hjnvmn/sfet_megathread_72/fwng0re/",
        "score": -2,
        "subreddit": "pennystocks",
        "created": 1593683279.0
    },
    {
        "author": "Blacksin01",
        "body": "They make apple’s ARM lineup currently. With Apple moving away from Intel, they will likely be utilizing TSMC 7nm or 5nm process to make their new chips.",
        "created_utc": 1593730343,
        "id": "fwqyr97",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqyr97/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593759143.0
    },
    {
        "author": "gratitudeisbs",
        "body": "Swap INTC for AMD",
        "created_utc": 1593648212,
        "id": "fwn52jg",
        "permalink": "/r/wallstreetbets/comments/hjmaiy/soon_to_be_18_year_old_looking_for_advice/fwn52jg/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593677012.0
    },
    {
        "author": "SchpartyOn",
        "body": "If you actually had insider information and were trading on it, you'd be committing a felony. Additionally, if others were trading on that information, you'd be committing a felony.\n\nWhile you may coincidentally be right about the price, I think you're full of shit. No one with real intel would advertise it because they know how stupid that would be.",
        "created_utc": 1593709709,
        "id": "fwpsgy4",
        "permalink": "/r/pennystocks/comments/hk0mvr/gnus_final_update/fwpsgy4/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1593738509.0
    },
    {
        "author": "AxeLond",
        "body": "They have a lot of shit all about to drop soon, consoles, Big navi, Zen 3. \n\nIf initial console sales are strong then AMD will rally. \n\nGraphics is kinda meh, mostly just for enthusiast gamers, Nvidia makes way better shit overall. \n\nZen 3 could be strong, Intel is about self conflagrate from all the overclocking their doing on 14+++ nm CPUs. Zen 3 moving to 7 nm to 7 nm EuV is a relatively big step that should bring 10% performance, they're talking another +15% in architecture so it could solidify AMD at the top. AMD keep saying Q3, I have no idea how they will pull that off, that's like now. \n\nZen 4 will be total market dominance in CPU (if not from Zen 3), Huawei got banned from TSMC and AMD joinked their reserved wafers on 5 nm. The smartphone guys usually launch on the new node in like March, AMD will probably need longer, but not that much longer. There's another 7-10% performance or 15% power reduction at 5 nm and I think Intel is targeting their first 10 nm desktop processors Q4 2021 on 10 nm++ (no joke, that's their name). \n\nAMD's advantage fighting TSMC's 5nm vs Intel's 14 nm++++ for most of 2021 will absolutely crush Intel.",
        "created_utc": 1593730866,
        "id": "fwqzpao",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqzpao/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1593759666.0
    },
    {
        "author": "PassiveF1st",
        "body": "I don't understand why AMD stock has been so stagnant other than experts keeping it with Intel when as a company they are surpassing Intel every step of the way.",
        "created_utc": 1593721061,
        "id": "fwqgdak",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwqgdak/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593749861.0
    },
    {
        "author": "FATTEST_CAT",
        "body": "Intel uses its own foundries, Apple doesn't.  So if Apple stops using Intel, it means other foundries like TSMC will see increased business making chips Apple would have previously sourced from Intel foundries.",
        "created_utc": 1593730230,
        "id": "fwqyjqx",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqyjqx/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593759030.0
    },
    {
        "author": "Glassiftrue",
        "body": "If AMD doesn't hit 53 by tomorrow I'm ripping out my GPU and CPU and replacing with Intel and Nvidia out of spite",
        "created_utc": 1593618721,
        "id": "fwlduj6",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlduj6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593647521.0
    },
    {
        "author": "1st_Amendment_EndRun",
        "body": "Looking at the three year graph, all I see is s slide from $10 down to 0.75.\n\nSome news hit the street on 6/19 that caused their stock to jump and get wildly volatile after hours (Intel trying to get out of their losing position?)  There was a similar event that happened back on 5/7.  Research those and report back.",
        "created_utc": 1593646865,
        "id": "fwn2mld",
        "permalink": "/r/stocks/comments/hjlel1/vuzi_ar_play/fwn2mld/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593675665.0
    },
    {
        "author": "Bhawks489",
        "body": "So your “actual intel” is you seeing other penny stocks dip in the afternoon. \n\nStop spreading misinformation.",
        "created_utc": 1593711042,
        "id": "fwpv9ys",
        "permalink": "/r/pennystocks/comments/hk0mvr/gnus_final_update/fwpv9ys/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1593739842.0
    },
    {
        "author": "YouDoNotKnowMeSir",
        "body": "Ahhh I didn’t know that Apple was gonna use TSMC for their arm chips. I just knew intel made their own and that AMD uses TSMC as well.",
        "created_utc": 1593730388,
        "id": "fwqyu5u",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqyu5u/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593759188.0
    },
    {
        "author": "LurksForTendies",
        "body": "Because MU and AMD are getting squeezed by INTC on the high end and ARMArm on the low end.",
        "created_utc": 1593741872,
        "id": "fwri5tp",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwri5tp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593770672.0
    },
    {
        "author": "FATTEST_CAT",
        "body": "Yeah I had considered buying TSMC but I just bought some right now.  I think the crazy thing too is they haven't gotten stuck on nodes and their yields on 7nm are strong already.  Supposedly 5nm is doing well too in preproduction.  I don't know who will be able to compete with them on high end at that point.\n\nAnd it's kind of a snowball effect where they will get more money to develop better nodes and then of course more orders since power efficiency will be the best.  Just so long as they don't get stuck like Intel.",
        "created_utc": 1593732224,
        "id": "fwr25mh",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwr25mh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593761024.0
    },
    {
        "author": "KingBadford",
        "body": "Fuck AMD I'm buying an Intel cpu.  Oh wait I can't because I'm fucking broke.",
        "created_utc": 1593611757,
        "id": "fwl0fxi",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0fxi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640557.0
    },
    {
        "author": "boomdynasty",
        "body": "how is INTC looking to everyone? is it a good long term hold?",
        "created_utc": 1593598661,
        "id": "fwkj39f",
        "permalink": "/r/stocks/comments/hj63kf/rstocks_daily_discussion_wednesday_jul_01_2020/fwkj39f/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627461.0
    },
    {
        "author": "somanychins",
        "body": "Why is INTC dumping?",
        "created_utc": 1593632695,
        "id": "fwm8e8e",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwm8e8e/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593661495.0
    },
    {
        "author": "TT_Productions",
        "body": "I feel like everyone's been very optimistic heading into Independence Day thinking \"We're 'murica, there's no way the market doesn't kick ass through Independence Day!\" But as the covid numbers just continued to climb (and will continue to as they always do on Wednesdays, Thursdays, and Fridays, after catching up from the weekend delays) and broke 50,000, government officials realized they're going to have a massive shitstorm on their hands if they allow large gathering 4th of July firework celebrations and bars remaining opened etc, and started shutting stuff down. For some officials to say, \"we will not go back into lockdown or close businesses\" and then a couple days later close down businesses, they must be receiving enough intel/pressure to know they're going to lose far more tax revenue in the long run if they try and keep everything open through a huge holiday weekend and just shut everything down on Monday 7/6. I think we're heading down until another stimulus bill is passed.",
        "created_utc": 1593665773,
        "id": "fwnxl58",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwnxl58/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593694573.0
    },
    {
        "author": "RogueShroom",
        "body": "‘No one was ever upset buying intel’",
        "created_utc": 1593674858,
        "id": "fwo8ilw",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwo8ilw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593703658.0
    },
    {
        "author": "xWinnfield",
        "body": "First was INTC cancelling one of their projects, second was based on bad cashflow. That’s my understanding of the two drops",
        "created_utc": 1593699310,
        "id": "fwp5d3q",
        "permalink": "/r/stocks/comments/hjlel1/vuzi_ar_play/fwp5d3q/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593728110.0
    },
    {
        "author": "GoatTrade",
        "body": "Large volume and O/I on INTC 65c for AUG 21 (\\~50K combined)",
        "created_utc": 1593699462,
        "id": "fwp5own",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwp5own/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593728262.0
    },
    {
        "author": "awxomexd",
        "body": "Now might be a good time to buy. They've just dropped Intel completely from their base model products.",
        "created_utc": 1593594850,
        "id": "fwkfdav",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkfdav/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593623650.0
    },
    {
        "author": "urmyheartBeatStopR",
        "body": "For main AMD is better position right now imo to eat away at NVDA and/or INTC. Intel ain't going to be anywhere near any shit soon for fab tech. Their gambling of buying up AI companies is going no where imo. I went to their shin dig AI fest. It's all smoke and screen, at least their food were nice. I think NVDA will hit saturation unless they show a real compelling reason for their ARM product.\n\nFor manufacturer I only know TSM. AMD is going to eventually use TSM once their global foundaries contract ends. MU seems like a stable stock to hoard dividends. I would probably do TSM because I know a bit about em. \n\nJust my opinion.",
        "created_utc": 1593892377,
        "id": "fwxlp7p",
        "permalink": "/r/stocks/comments/hl5bts/whats_your_favorite_semi_conductor_investment/fwxlp7p/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593921177.0
    },
    {
        "author": "bap1331",
        "body": "WHOs job is to find the worst possible scenario to scare the public into listening and follow the rules so we can save the most vulnerable people (aka old people and people with weak immune systems). Scaring people makes them more prone to stress and lowers their immune system. That is not the proper way to tell people since we are in a pandemic. It will lead to more infections. \n\nThis is exactly the reason why governments keep intel secret to prevent that stress on people and chaos.",
        "created_utc": 1593924948,
        "id": "fwyz9yv",
        "permalink": "/r/stocks/comments/hlayic/who_predicts_covid19_could_last_35_years_fauci/fwyz9yv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593953748.0
    },
    {
        "author": "crys0706",
        "body": "I personally own shares of AMD. But if was going to rank them, itll be NVDA &gt; AMD &gt; INTC. NVDA is basically a monopoly and wont have competition in years to come. Will get into NVDA when it dips a bit.",
        "created_utc": 1593878555,
        "id": "fwwvwis",
        "permalink": "/r/stocks/comments/hl5bts/whats_your_favorite_semi_conductor_investment/fwwvwis/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593907355.0
    },
    {
        "author": "pseddit",
        "body": "The answer is simple. In India, political influence can make or break companies, even big companies. The Ambani family which controls Reliance is THE most politically connected in India - to the extent they can dictate ministers (secretaries to Americans) to the government. They just need to ask and policies turn on a dime to their advantage.\n\nThe mobile phone services in India were dominated by two companies - Vodafone and Airtel. The moment Reliance launched Jio, things went south for those two. Telecom regulations suddenly changed to the exclusive benefit of Jio and to the detriment of others. A new tax law came into being and Vodafone was assessed massive taxes with retroactive effect. They were ultimately hounded out by the government.\n\nSo, the core competencies of Reliance are massive government influence and the ability to get big investors onboard. They do not have technical know-how and this is where companies like FB and INTC come in. Bring the knowledge and get a piece of exclusive action in a vast market.",
        "created_utc": 1593867698,
        "id": "fwwe85u",
        "permalink": "/r/stocks/comments/hkxyjk/why_are_major_companies_investing_in_reliance_jio/fwwe85u/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593896498.0
    },
    {
        "author": "WhoWasBlowjob",
        "body": "Where did I say that I want China to \"wire all of my Intel\"",
        "created_utc": 1593869600,
        "id": "fwwgtm9",
        "permalink": "/r/wallstreetbets/comments/hkpyve/weekend_discussion_thread_for_the_weekend_of_july/fwwgtm9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593898400.0
    },
    {
        "author": "crazytile",
        "body": "Sometimes I think INTC has lost their edge. In terms of price yes they are good. Issue is are they too into their comfort zone too long now. Like Apple.. the keep hitting on the i7 series of chips. AMD also has improved quite a bit on their processing tech, cores, etc.  I think long run if AMD has a great CEO (not just the technical side) they might exceed Intel for sure... tech now maybe they are nearly improving by leaps and bounds now. I also like Intel. With Apple not using their chips is also a negative factor",
        "created_utc": 1593962208,
        "id": "fx066e4",
        "permalink": "/r/CanadianInvestor/comments/gpdg1g/thoughts_on_amd_nvda_intc/fx066e4/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1593991008.0
    },
    {
        "author": "WouldYouLikeToTouch",
        "body": "isn't intel losing traction to amd and nvidia?",
        "created_utc": 1593970409,
        "id": "fx0l9fq",
        "permalink": "/r/stocks/comments/hlqgnv/my_stock_portfolio_at_22_years_old/fx0l9fq/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593999209.0
    },
    {
        "author": "ClappingCheeks123",
        "body": "Yeah I would’ve add Nvidia over Intel hahah 100%",
        "created_utc": 1593971495,
        "id": "fx0nc8f",
        "permalink": "/r/stocks/comments/hlqgnv/my_stock_portfolio_at_22_years_old/fx0nc8f/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594000295.0
    },
    {
        "author": "username--_--",
        "body": "tesla can easily move either direction to that tune in a day. I look at any of the popular semis/. MU, AMD, INTC (not a fan of NVDA because of it's current volatility and high /share price).\n\nPersonally, i can't afford to hold unto 100 TSLA shares, but doing the math, you $30 out doesn't even put you outside 1EM. and the $20 rn amount to about 1.5% of share price for less than a 80% POP.\n\nWhereas, taking AMD for example - who i consider the TSLA of semis - a less than 1EM written put nets you $0.60 or 1.25% of the share price, but is much more range bound and less likely to drop out of the sky.\n\nIDK, i'm sure you have your tactics, but it seems so risky when there are plenty of stocks with little less returns and much less risk available",
        "created_utc": 1593971632,
        "id": "fx0nlll",
        "permalink": "/r/investing/comments/hkjrcc/650000_tesla_cybertruck_preorders_apparently/fx0nlll/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594000432.0
    },
    {
        "author": "The_Nascar",
        "body": "Stocks in general are currently the “most expensive” they’ve been in years in relation to \nP/E ratio etc.. You can do a quick google of search of that term, and read up some on CNBC. \n\nNow. All the stocks you have just mentioned have had historical runs, a 50% return over the next two years will be difficult, but I see as easily attainable. I would personally put the 10k into an index fund $QQQ this index is a cap-weighted index of the Nasdaq. It’s main holdings are Apple, Google, Amazon, Facebook, Intel, Cisco, and Facebook. It’s up 35% in the past year. \n\nIf, “big if” stocks continue the trend of the last 8 years, these stocks will give you a ~50% return.\nThis is based on the assumption that easy money continues to enter the market, and the economy reopens quickly. Multiple things could affect this. But in my opinion this is your best bet. \n\nAlso, don’t get greedy and chase “hype” companies like NIO, their are 20 NIO’s for every one Tesla.",
        "created_utc": 1593976867,
        "id": "fx0xhn6",
        "permalink": "/r/investing/comments/hls770/invsting_10k_on_a_12_year_trade_basis/fx0xhn6/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594005667.0
    },
    {
        "author": "midasTch",
        "body": "AMD has to do lot of right things to get there\n1. PC market is very limited -- it can only reach to a certain level.  The day Intel chips show promise, you'll see that share going down.  So what are they doing to keep that number going high? AMD lacks focused strategy.\n2. Semi-custom is not a big market -- PS5/XBOX can only give you few dollars.  But their cycle is 2yrs.. year end you will see this number go up because of their release.\n3. Only possibe domain it can grow is Server.  It currently has 8% market share but Intel has 90%.  If AMD valuation needs to go high, this is the place they need to make money. AMD recently made a huge deal with CRAY -- this is AWESOME.  If they develop integrated solutions on top of which you can run 3rd party software -- you've a winning product!  Imagine running all CUDA on top of AMD servers.\n\nSo it's possible but there are several roadblocks.  I missed on the graphics market, but it has similar problems.  So for every quarterly earnings, look at the following and be the judge: \n1. Inventory\n2. Revenue of each segment\n3. Operating margin\n4. Cash\n5. EBIT",
        "created_utc": 1593912869,
        "id": "fwyiy5n",
        "permalink": "/r/stocks/comments/hl5bts/whats_your_favorite_semi_conductor_investment/fwyiy5n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593941669.0
    },
    {
        "author": "Staygangponyboy",
        "body": "IF you were the president, who's intel would you use?\nin-house or an enemies?",
        "created_utc": 1593871022,
        "id": "fwwixwn",
        "permalink": "/r/wallstreetbets/comments/hkpyve/weekend_discussion_thread_for_the_weekend_of_july/fwwixwn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593899822.0
    },
    {
        "author": "Retard069",
        "body": "Lol, Tesla fanboy detected. Have you heard people bitching about Microsoft, Amazon, FB, Google, Intel or other blue chip companies? Get your pants down from your head and start using your brain.",
        "created_utc": 1593902371,
        "id": "fwy2t14",
        "permalink": "/r/wallstreetbets/comments/hlbvya/guys_i_found_out_why_tesla_jumped_so_much/fwy2t14/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593931171.0
    },
    {
        "author": "Goes1nsane",
        "body": "There are litterally 50 other identical posts today, you could gather some intel there instead of asking once more time",
        "created_utc": 1593988729,
        "id": "fx1jjrn",
        "permalink": "/r/pennystocks/comments/hlvqh5/is_it_too_late_to_get_into_byfc/fx1jjrn/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594017529.0
    },
    {
        "author": "crackercider",
        "body": "Intel is currently run by retards with a $250B market cap, AMD's got a $61B market cap with a ton of innovation across all market pricing segments, stomping Intel in the dick. We'll see how they stack up to Nvidia's new GPU's later this year.",
        "created_utc": 1593725527,
        "id": "fwqphyi",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwqphyi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593754327.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Didn’t intel just get dumped by Apple. Aren’t MU and AMD the new bouncier shinier darlings of chip makers.",
        "created_utc": 1593742490,
        "id": "fwrj5iv",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwrj5iv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593771290.0
    },
    {
        "author": "amoctar",
        "body": "I think people are sleeping on Intel. I'm waiting for a dip before buying. They'll beat earnings imo",
        "created_utc": 1593782970,
        "id": "fwsx9w6",
        "permalink": "/r/wallstreetbets/comments/hkgjy6/daily_discussion_thread_for_july_03_2020/fwsx9w6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593811770.0
    },
    {
        "author": "Marcheesio",
        "body": "Intel. I know it’s not as hot as NVDA or AMD but they still make a shit ton of money, they pay a solid dividend, and it’s at a good valuation.",
        "created_utc": 1593815311,
        "id": "fwukcpe",
        "permalink": "/r/stocks/comments/hks083/steady_slow_rise_stocks/fwukcpe/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593844111.0
    },
    {
        "author": "thatLifeVibe",
        "body": "I bought Intel today lol",
        "created_utc": 1593738778,
        "id": "fwrd6wm",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwrd6wm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593767578.0
    },
    {
        "author": "JackRadcliffe",
        "body": "If it's specifically a few stocks you want,  you can just buy them individually. Otherwise the etf is probably better to get exposure to a much broader spectrum of tech companies. Personally i hold Aplle and Intel shares but also own VGT and TEC as my main technology holdings as I happen to like the top 10 holdings as well as additional tech companies but don't have wnough capital to justify the cost of commission of owning a lot of different companies individually",
        "created_utc": 1593787192,
        "id": "fwt4bkz",
        "permalink": "/r/CanadianInvestor/comments/hk5xcv/currently_holding_vfv_but_would_like_more/fwt4bkz/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1593815992.0
    },
    {
        "author": "Run_Turtle_Run",
        "body": "Questionable. The financials don't match the price. It's got good growth potential, but it really needs to be perfect for the next few years. If they hit any snags along the way, it could spell disaster for the company. They don't have the capital that Intel or Nvidia has to weather any storm, so to speak.\n\nIt's very much a high risk, high reward stock at the value its being traded right now.\n\nI'd personally would wait and see until the stock starts trading nearer to the worth of its company.",
        "created_utc": 1593788833,
        "id": "fwt78fb",
        "permalink": "/r/stocks/comments/hkarm3/amazon_vs_apple_vs_microsoft_vs_google/fwt78fb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593817633.0
    },
    {
        "author": "AxeLond",
        "body": "The difference in price and margins would be huge yeah, buying the silicon from TSMC would probably be around $30 per chip + Apple's development costs. \n\nI saw rumors about them having double the cores of the iPhone SoC, which would help multi-thread, but single thread will always be the most important thing for basic workloads, ie what you would do on a laptop. It wouldn't even need good multi-thread, the current low spec MacBooks are dual-cores. With that single thread performance and 11 other fast/power efficient cores it will just end up being crazy good for laptops. \n\nI don't really care that much about GPU, the big thing about switching to Arm is freeing yourself from Intel and AMD's patent duopoly on x86 processors, which powers all desktop/servers in the world. For Arm processors anyone can just buy a license to use them, same thing with GPUs, anyone can make a GPU. Being free from x86 you have full control of the silicon so you can just licence or create whatever GPU you want and add it to the same silicon as the CPU. AMD just licensed out their GPU IP to Samsung for mobile SoC.\n\nBuying a x86 processor from Intel They own the silicon, they send you a finished chip and you get to connect whatever your shit is to it. With Arm you can get all your shit together and just put it all on one chip. AMD isn't as protective of their GPU stuff so if you license it they just give you their design and you get to copy paste the transistor layout over onto your chip, you also have the option of just picking how many of AMD's compute units you want in your design. The cost will also be way lower, because AMD would just be giving you the design, you would be responsible for shipping the design to TSMC to have it fabricated. \n\nMac Pro and server? I don't think it will ever happen, x86 is just too entrenched for professional use. Windows only runs on x86, plus everything Nvidia/Intel/AMD really cares about is server, they wouldn't let it slip. The one way in would be like through Amazon AWS you can offer Arm server for cheaper to anyone who doesn't care about x86. The thing everyone can make Arm, Amazon is already doing that with their own developed Arm processors, and nobody cares about them. A lot would have to change. \n\n [https://www.toptal.com/back-end/arm-servers-armv8-for-datacentres](https://www.toptal.com/back-end/arm-servers-armv8-for-datacentres) \n\nThis was written 4 years ago, zero progress.",
        "created_utc": 1593791836,
        "id": "fwtcspg",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwtcspg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593820636.0
    },
    {
        "author": "modulusshift",
        "body": "Apple has already said, this transition will complete within two years, which can only mean no more Intel Macs in two years. Even if you interpret them as saying “two years after it starts” which will be at the end of this year, that’s only like 30 months. So Apple thinks they can replace the Mac Pro within 30 months with an ARM based alternative. And at that point, well the Mac Pro already comes in a rack mount variant. If they want to really play the game though, they’ll be very well positioned to.",
        "created_utc": 1593792603,
        "id": "fwte9oe",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwte9oe/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593821403.0
    },
    {
        "author": "Limewire-",
        "body": "AMD is a good investment, but not necessarily becuase of upcoming consoles. It will have helped to increase the stock price over time, but there won't be a huge jump when the PS5 and Xbox Series X One X Series Boxx comes out.\n\nOne of the reasons AMD is strong, and will become increasingly stronger, is that they produce excellent price to performance ratio CPUs and GPUs. They are smashing Intel at the moment. Sure Intel produce the ultimate best performance CPUs out there, but generally gamers right now are buying AMD in their droves becuase they can get almost as much power for significantly less cost. If you look at the gaming market as a whole, it's not dominated by super rich gamers who are dropping $2k on their rigs, it's full of lower end custom builders who are looking for the best price to performance ratio.\n\nIn some cases the AMD CPUs outperform Intel counterparts for a lot less money. Intel is really dragging it's heels at the moment. And in the top tier CPUs, AMD currently offer a Ryzen 3390x CPU, which is a mind blowing 64 core, for just $4,000. The Intel equivlent costs $20,000 and doesn't even have as many cores!\n\nAlso the APU market is still in very early days, and something AMD can capitalise on in the future - some say that APUs are the future, and AMD could even de-throne Nvidia if they made APUs powerful enough.",
        "created_utc": 1593858434,
        "id": "fww4bfj",
        "permalink": "/r/stocks/comments/hkw5r8/next_gen_consoles_a_boost_for_amd/fww4bfj/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593887234.0
    },
    {
        "author": "scopolamine",
        "body": "My Q2 earnings winners prediction:\n\nPYPL, NVDA, PG, PFE, BLK, CME, AMGN, CSCO, GILD, INTC, IBM, MDT, TMUS, SQ and AGN",
        "created_utc": 1593978952,
        "id": "fx11d2v",
        "permalink": "/r/wallstreetbets/comments/hkpyve/weekend_discussion_thread_for_the_weekend_of_july/fx11d2v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594007752.0
    },
    {
        "author": "tmehta8",
        "body": "It’s the future bruh, obvi it won’t happen on the first try but the tech that elon has, with the visualization and detection is insane. I see ur view but disagree, no company can reach what Tesla has in the next 5-6 years. The announcements of battery day and in house battery production will only help reduce margins (like Apple shifting away from intel chips).",
        "created_utc": 1593964052,
        "id": "fx09efu",
        "permalink": "/r/wallstreetbets/comments/hkpyve/weekend_discussion_thread_for_the_weekend_of_july/fx09efu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593992852.0
    },
    {
        "author": "WouldYouLikeToTouch",
        "body": "same here. I have AMD, will add nvidia later, but I just don't understand why some would buy shares of Intel.",
        "created_utc": 1593971663,
        "id": "fx0nnqs",
        "permalink": "/r/stocks/comments/hlqgnv/my_stock_portfolio_at_22_years_old/fx0nnqs/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594000463.0
    },
    {
        "author": "HeAbides",
        "body": "CPU: Intel i5-4970k\nMOBO: Asus z97 pro\nRAM: Corsair 64GB ddr4\nGFX: MSI GTX 1080 12gb\nInstalling to a few month old Samsung EVO 860",
        "created_utc": 1593994718,
        "id": "fx1tzr2",
        "permalink": "/r/wallstreetbets/comments/hlt7rc/what_are_your_moves_tomorrow_july_06_2020/fx1tzr2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594023518.0
    },
    {
        "author": "iCHAIT",
        "body": "Good time to buy Intel?",
        "created_utc": 1593688136,
        "id": "fwom9b7",
        "permalink": "/r/stocks/comments/hjt0ej/rstocks_daily_discussion_options_trading_thursday/fwom9b7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593716936.0
    },
    {
        "author": "elsinore11",
        "body": "Think the NASDAQ was 5k in 2000. Companies like intel and CSCO still aren’t as high as they were then.",
        "created_utc": 1593658414,
        "id": "fwnmj5z",
        "permalink": "/r/investing/comments/hi5sme/my_outlook_and_where_i_would_put_my_money_tell_me/fwnmj5z/",
        "score": 1,
        "subreddit": "investing",
        "created": 1593687214.0
    },
    {
        "author": "WOWzival",
        "body": "Speaking of aMd how is their competition going with Intel ??",
        "created_utc": 1593704079,
        "id": "fwpg5ai",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwpg5ai/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593732879.0
    },
    {
        "author": "Vcize",
        "body": "Great intel from a guy that doesn't even know what selling puts is, and also thinks nearly thrice bankrupt AAL is an example of a company we should be holding standards against.",
        "created_utc": 1593725954,
        "id": "fwqqcpb",
        "permalink": "/r/options/comments/hk0du9/nkla_looks_like_its_gonna_duummmmppppppppppppppppp/fwqqcpb/",
        "score": 1,
        "subreddit": "options",
        "created": 1593754754.0
    },
    {
        "author": "IamNaNIam",
        "body": "&gt;amd is more a hardware company than a software company, though\n\nUnfortunately. They are smoking Intel on hardware, but the future is AI",
        "created_utc": 1593734396,
        "id": "fwr5x2x",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwr5x2x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593763196.0
    },
    {
        "author": "sirvapedalot",
        "body": "Sounds like this article has the most up to date info. It doesn’t 100% convince me. It could be bad intel or it could be what Postmates’ bankers are saying so Uber or CCXX pays a bit more to get the deal done (very relevant after Uber lost the Grubhub deal)\n\nI guess I’d give it a 25% chance at best of it being CCXX but it shows he’s trying to land a big fish. Some people here don’t love Postmates anyway (they weren’t doing as well  before corona) so it could be a blessing in disguise. I think Postmates would do well on hype right now for sure but there are many other candidates if the bidding gets too high",
        "created_utc": 1593729558,
        "id": "fwqxbsr",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwqxbsr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593758358.0
    },
    {
        "author": "Captaincadet",
        "body": "You mean they dropped intel from ALL computers and taking their computers to in house ARM processors in the next 2 years.\n\nIt looks promising from the developer kit so maybe now’s the time to buy as they won’t have to pay intel which should make their computers more profitable going forward",
        "created_utc": 1593599027,
        "id": "fwkjgi4",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkjgi4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627827.0
    },
    {
        "author": "Captaincadet",
        "body": "They are going fully ARM\n\n\nhttps://www.theguardian.com/technology/2020/jun/22/apple-ditches-intel-for-arm-processors-in-big-sur-computers",
        "created_utc": 1593606057,
        "id": "fwkri7a",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkri7a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593634857.0
    },
    {
        "author": "p_giggles",
        "body": "A range of 1,500-15,000 is also a good way for a company to say \"we have no fuckin idea and want to hype up the stock\" \n\nYou don't see analysts covering Intel with a price range of $20-$200",
        "created_utc": 1593611047,
        "id": "fwkz7pe",
        "permalink": "/r/stocks/comments/hj5rzv/arkk_and_arkw_overpriced/fwkz7pe/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593639847.0
    },
    {
        "author": "DaPurpleMage",
        "body": "INTC down just as much",
        "created_utc": 1593611840,
        "id": "fwl0l4b",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0l4b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640640.0
    },
    {
        "author": "Rodders88",
        "body": "AAPL\nAMGN\nBAC\nBKNG\nBLK\nCL\nCSCO\nEA\nFB\nHD\nINTC\nIRBT\nJNJ\nMA\nMDLZ\nMSFT\nMU\nNKE\nTXN\nUNH\nUPS\nV\nWFC\nWWE\nYUMC\n\nOut of that list the top ones would be \nWFC\nUNH\nBKNG\nBAC\nAMGN\nEA\nAAPL\nCSCO\nFB\nINTC\nMSFT",
        "created_utc": 1593940156,
        "id": "fwzfar8",
        "permalink": "/r/options/comments/hkv4cr/divergence_between_markets_and_economy_sp_25_gdp/fwzfar8/",
        "score": 1,
        "subreddit": "options",
        "created": 1593968956.0
    },
    {
        "author": "Staygangponyboy",
        "body": "why would you want a communist country to wire all your intel?\n\nThat's like building a tree fort and asking the neighboorhood assholes down the street to nail it together for you.",
        "created_utc": 1593869032,
        "id": "fwwg0va",
        "permalink": "/r/wallstreetbets/comments/hkpyve/weekend_discussion_thread_for_the_weekend_of_july/fwwg0va/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593897832.0
    },
    {
        "author": "WellEyeGuess",
        "body": "Imagine buying AMD at the end of the age of x86 when even Intel got out of the race because they saw the ARM writing on the wall lololol shit man (yeah I work in advanced electronics mfg)",
        "created_utc": 1593790132,
        "id": "fwt9ltm",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwt9ltm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593818932.0
    },
    {
        "author": "Limewire-",
        "body": "I hold Nvidia. They make great products (their GPUs are hands down the best if you can afford them), they are the market leader. With the new 30xx series GPUs coming out soon, and their partnership with Mercedes announced recently, it’s a strong stock than I think will only rise in price.\n\nPersonally wouldn’t invest in Intel right now - they are getting trashed by AMD regarding CPUs, and Apple will phase them out in coming years. Naturally they aren’t the only revenue streams for Intel, but I feel it will have some effect.\n\nI also hold AMD, it’s down a bit at the moment but they are really showing promise with CPUs, providing excellent price to performance ratio. Their GPUs are good too, being a lot more affordable than Nvidia, and are very popular with gamers.",
        "created_utc": 1593877865,
        "id": "fwwumpo",
        "permalink": "/r/stocks/comments/hl5bts/whats_your_favorite_semi_conductor_investment/fwwumpo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593906665.0
    },
    {
        "author": "Limewire-",
        "body": "Yeah same I’ve built PCs too and am a keen gamer so invest in sectors I like and understand. \n\nI think Intel will get back on top, but they need to up their game for sure. Right now it’s hard to ignore AMD. \n\nBut I don’t think I’d ever go to AMD for my GPU, love the Nvidia ones and super excited for the 30xx series. Apparently the 3080 outperforms the 2080Ti in early benchmarks. \n\nAlso check out the VanEck Vectors Gaming and eSports ETF. It’s a really good fund that contains all the major hardware manufacturers, as well as loads of gaming developers such as EA, Take Two, CD Project Red and more. +40% in the last 3 months!",
        "created_utc": 1593878974,
        "id": "fwwwoy7",
        "permalink": "/r/stocks/comments/hl5bts/whats_your_favorite_semi_conductor_investment/fwwwoy7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593907774.0
    },
    {
        "author": "namrock23",
        "body": "I dunno, she's somebody's intel operative. I think she was probably the brains behind the operation too. More likely that she gets three months in a country club prison and then goes about her business, whatever that is these days",
        "created_utc": 1593729536,
        "id": "fwqxaad",
        "permalink": "/r/wallstreetbets/comments/hk6a4p/if_maxwell_isnt_murdered_before_testifying_which/fwqxaad/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593758336.0
    },
    {
        "author": "midasTch",
        "body": "QCOM — Apple,AMD,intel will buying chips from them.",
        "created_utc": 1593706381,
        "id": "fwpli2d",
        "permalink": "/r/stocks/comments/hjuzg8/semiconductors/fwpli2d/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593735181.0
    },
    {
        "author": "Crackbot420-69",
        "body": "It's mostly a graveyard of things I never sold from the last run up, so survivorship bias.\n\nGot some leaps on MO, JPM,  INTC. Other calls on KO, MGM.\n\nIts a grab bag of shit.",
        "created_utc": 1593709808,
        "id": "fwpsofx",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwpsofx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593738608.0
    },
    {
        "author": "clicknbait",
        "body": "\n\nI will tell you a little secret. If there is a stock that I think can be a multibagger, it is AMD. In terms of performance, they match NVDA. Intel is nowhere even close to the game. Do not be fooled by the fact that AMD has cooled down in growth. Patience is the key here. Give it at least 1 year from here to make a judgement about whether they have really cooled down. I do not have a price point (haven't done DCF on this yet) but planning to do it soon! I had AMD until  very recently but will add it to my portfolio very soon if the big boys (hedge funds) start giving me a signal.",
        "created_utc": 1593925968,
        "id": "fwz0iip",
        "permalink": "/r/stocks/comments/hjjrhw/what_is_your_favorite_growth_stock/fwz0iip/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593954768.0
    },
    {
        "author": "Marcheesio",
        "body": "Yeah, but Intel still makes waaaaay more money at the moment.",
        "created_utc": 1593978027,
        "id": "fx0zn5t",
        "permalink": "/r/stocks/comments/hlqgnv/my_stock_portfolio_at_22_years_old/fx0zn5t/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594006827.0
    },
    {
        "author": "PussySmith",
        "body": "Bruh I picked apple to moon when they switched to intel as a highschooler playing with paper money. Then, again, with real money when they started selling digital content. Then, again, when they started to move to digital subscriptions a few years ago. \n\nI understand tech, but Tesla has some serious hardware issues with autonomy before we can even talk about how it’s supposed to start becoming an actual tech growth asset. Then you have the legal hoops to clear for approval in all 50 states. \n\nThen you have the real risk that boomer shareholders don’t understand the memes and demand the SEC actually act on his shenanigans. Without musk Tesla burns to the ground. \n\nThere’s so much headwind and while papa musk has some big ass lungs, I’m not betting on them going to 5k a share this decade.",
        "created_utc": 1593932735,
        "id": "fwz82eg",
        "permalink": "/r/wallstreetbets/comments/hlhaov/tesla_1_trillion_market_cap/fwz82eg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593961535.0
    },
    {
        "author": "Blasprilla3",
        "body": "NIO Autonomous driving product laughable? That comment is laughable. Their autonomous driving capabilities are far superior to Tesla ALREADY. Far superior tech with big project being born from it.  Check out their Mobil eye project with intel. Tell me that’s laughable.",
        "created_utc": 1593903002,
        "id": "fwy3v15",
        "permalink": "/r/stocks/comments/hkssoi/nio_hype_or_legit_longterm_play_or_swing/fwy3v15/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593931802.0
    },
    {
        "author": "DangerousLiberal",
        "body": "Check the share price of the two. Check Intel. Have you ever heard of dilution?",
        "created_utc": 1593623013,
        "id": "fwlmwrk",
        "permalink": "/r/wallstreetbets/comments/hj4tqj/the_tech_bubble_is_a_gay_bear_fantasy/fwlmwrk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593651813.0
    },
    {
        "author": "moltch",
        "body": "Are we getting jebaited, why is amd/micron/intel the only sector down??",
        "created_utc": 1593611913,
        "id": "fwl0ppa",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0ppa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640713.0
    },
    {
        "author": "ayyopapi",
        "body": "Intel fans",
        "created_utc": 1593624266,
        "id": "fwlplia",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlplia/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593653066.0
    },
    {
        "author": "RogueJello",
        "body": "I mostly agree, except with the claim \"equally\" since Intel is the default on everything oem site I've checked.",
        "created_utc": 1593647438,
        "id": "fwn3o1b",
        "permalink": "/r/SecurityAnalysis/comments/hil7s1/how_a_handful_of_chip_companies_came_to_control/fwn3o1b/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1593676238.0
    },
    {
        "author": "sp3xl",
        "body": "It’s going to be 200B-ish market cap in case intel dies completely. That puts it at 3x growth potential from what we have now.",
        "created_utc": 1593604556,
        "id": "fwkpk13",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkpk13/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593633356.0
    },
    {
        "author": "madnutbutter",
        "body": "US needs curfew and mandatory masks. Too many white woke kids colonized the BLM like their great grandparents colonized Africa. They don't understand they are manipulated by foreign intel and corporate interests to do rioting, attack police, attack cars and spread the rona.\n\nMarket will stay volatile with many crashes and pumps. I think we can say finally that the mouse is fuk.",
        "created_utc": 1593602547,
        "id": "fwkn5wd",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkn5wd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593631347.0
    },
    {
        "author": "rankiba",
        "body": "Doubt intel will die",
        "created_utc": 1593604621,
        "id": "fwkpmxx",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkpmxx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593633421.0
    },
    {
        "author": "Ehralur",
        "body": "That's because Intel doesn't operate in 3 of the world's biggest industries while pushing completely new technology that will change all of these. A bear case of 1,500 in case they stay just a car company compared to 15,000 if they dominate automotive energy and autonomous driving industries makes perfect sense.\n\nSo no, it has nothing to do with them being clueless, but it's just that you can't predict whether disruptions this big will succeed.",
        "created_utc": 1593618474,
        "id": "fwldcci",
        "permalink": "/r/stocks/comments/hj5rzv/arkk_and_arkw_overpriced/fwldcci/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593647274.0
    },
    {
        "author": "altaro22",
        "body": "Checked the holdings for that etf, i dont see any of the big players frol the junteenth movement on there? A lot of big corporations like MCD, INTEL etc.",
        "created_utc": 1593629567,
        "id": "fwm1f28",
        "permalink": "/r/pennystocks/comments/hjerel/beware_of_july_7th_blackout_day/fwm1f28/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593658367.0
    },
    {
        "author": "Mausteidenmies",
        "body": "Nokia uses broadcom processors (that weird ReefShark thingy) for their base stations and Ericsson uses Intel surprisingly.\n\nI wouldn't touch Huawei with a stick.",
        "created_utc": 1593697859,
        "id": "fwp2auc",
        "permalink": "/r/stocks/comments/hjuzg8/semiconductors/fwp2auc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593726659.0
    },
    {
        "author": "1080ti_Kingpin",
        "body": "For what its worth, ive been an Intel fan boy for the past decade. Ill be building 2 AMD based computers in the next month. Their CPU's are unstoppable at this point.",
        "created_utc": 1593819682,
        "id": "fwursgt",
        "permalink": "/r/wallstreetbets/comments/hkrnjz/20_year_old_with_more_money_than_sense_should_i/fwursgt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593848482.0
    },
    {
        "author": "I_Pump_N_Dump",
        "body": "Fucking intel",
        "created_utc": 1593807017,
        "id": "fwu5jqz",
        "permalink": "/r/pennystocks/comments/hkp8h8/israelidesigned_instant_coronavirus_breathalyzer/fwu5jqz/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593835817.0
    },
    {
        "author": "LurksForTendies",
        "body": "AAPL didn't replace INTC with MU or AMD. It was the new darlings ARM. Also, ARM is getting a lot of love in data-centers",
        "created_utc": 1593743599,
        "id": "fwrkxr0",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwrkxr0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593772399.0
    },
    {
        "author": "somanychins",
        "body": "INTC. Couldn't possibly drop lower, and if it goes up, it will be steady.",
        "created_utc": 1593761726,
        "id": "fws9aau",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fws9aau/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593790526.0
    },
    {
        "author": "AxeLond",
        "body": "I hadn't really thought about that, just saw Apple moving away from Intel and potential loss of a customer for AMD, but yeah they could make some real good shit. \n\nApple Silicon is like the strongest part of Apple, they've been dominant in smartphone SoC for a long time and always first to jump to new nodes. \n\nIn September Apple move nodes, next year android people follow in March/May and desktop is like 1 year after Apple. \n\nGoing in so early is expensive af and yields are bad, that's why desktop can't move too quickly too new nodes with such big chips. Apple only has a limited amount of devices it needs chips for and they have plenty of margin to cover the cost so they're fine. \n\nSwitching from x86 to arm, it should be a performance loss, but arm chips are like real good now. The chip in the latest iPhone gets 1327 points single thread in Geekbench. Your full on \"best gaming\" processor is like 1,720 points. Multi-thread can be a lot worse, but what kinda of big simulation will you be running on a MacBook?\n\nMeanwhile the Apple's chip uses 6 Watt, while the desktop part uses 105 Watt. Battery life will be insanely good for laptops and that's so important in mobile, should be a killer product.",
        "created_utc": 1593766878,
        "id": "fwsejnj",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwsejnj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593795678.0
    },
    {
        "author": "modulusshift",
        "body": "And that’s not even getting into price. Apple apparently can make a profit shipping their fastest phone chip in the $399 iPhone SE. And as you pointed out, the Geekbench single core score is 1327. If we keep apples to apples and go with the fastest mobile processor Apple uses, the i9-9880H in the 16” MacBook Pro, it scores 1265 single core on Geekbench. [And for the coup de grace, Intel sells it to OEMs for $556.](https://ark.intel.com/content/www/us/en/ark/products/192987/intel-core-i9-9880h-processor-16m-cache-up-to-4-80-ghz.html) Get the leading processor in mobile single core performance for $399, get the screen, battery, cellular modem, software, and profit margin all for free. Or pay $556 for a slower chip and still have to build the rest of the computer around it. \n\nNow obviously the i9 doubles the multi core performance, but on the other hand, only doubles? For that much of a price difference? And the GPU built into the i9 nearly quintuples the GPU built into the phone. But these aren’t traditional strengths for Intel. Right now if you want multi core or GPU, you go to AMD. Intel stakes it’s claim in the industry on being *the* fastest single core performance, for the smoothest gaming/microfinancial trading/what have you. And Apple is catching up in a phone for a fraction of the price. It feels like a steamboat being outpaced by a rowboat. \n\nAnother note on GPU, if you want more GPU performance, it scales really nicely with area. You just make a bigger chip. Now it’s harder to cool and more expensive, but those are two of Apple’s greatest strengths here already. Obviously the same is true of multicore. Apple just needs to make it bigger. I know their chip design people know that. The processors coming in Apple Silicon Macs are coming to dominate. Within two years they expect to have a chip that’s a replacement for the freaking Mac Pro. From there? What if they bring back Xserve and make another go at the server market? At that point it’s a matter of interest, not a question of capability.",
        "created_utc": 1593782297,
        "id": "fwsw8c7",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwsw8c7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593811097.0
    },
    {
        "author": "WhoWasBlowjob",
        "body": "How is that relevant to what I was talking about? Of course the president of the USA should use American intel if that's what you're asking.",
        "created_utc": 1593871219,
        "id": "fwwj8pw",
        "permalink": "/r/wallstreetbets/comments/hkpyve/weekend_discussion_thread_for_the_weekend_of_july/fwwj8pw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593900019.0
    },
    {
        "author": "EithneDraoct",
        "body": "Yeah I’m a long time gamer who builds his own PCs. I personally always bought Intel/Nvidia, but the stuff AMD has now has had me considering building a full AMD machine. Their products are such a good value now. \n\nI think that’s what draws me to the sector. I’m not looking at Intel as an innovator in CPUs as much as a TaaS company after they acquired Mobile Eye and Moovit. I’m wondering if they’re going to pivot and I don’t want to miss the opportunity.",
        "created_utc": 1593878721,
        "id": "fwww7pv",
        "permalink": "/r/stocks/comments/hl5bts/whats_your_favorite_semi_conductor_investment/fwww7pv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593907521.0
    },
    {
        "author": "modulusshift",
        "body": "No joke, if Intel can’t sort their damn process out fast, AMD and Apple are going to eat their lunch. I think people don’t realize how dominant the first few Apple Silicon Macs are gonna be. Be glued to that Apple Q1 earnings report for the first rumblings. \n\nMan I remember back when it was just assumed Intel was going to be the dominant chip fab forever.",
        "created_utc": 1593738366,
        "id": "fwrciw5",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwrciw5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593767166.0
    },
    {
        "author": "IgnitedSpade",
        "body": "Intel is so shit they got dumped by apple and amd keeps pumping out the best workstation/server chips on the market. If the ceo of amd shitposted on twitter as much as elon does they'd be mooning rn.",
        "created_utc": 1593726594,
        "id": "fwqrmxo",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwqrmxo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593755394.0
    },
    {
        "author": "Sayter",
        "body": "got specialization in civilization scale existential risk modelling.\n\nthat's a rare skill.\n\ntrust me you'd want me in intel not infantry dude.",
        "created_utc": 1593789853,
        "id": "fwt93e6",
        "permalink": "/r/wallstreetbets/comments/hkgjy6/daily_discussion_thread_for_july_03_2020/fwt93e6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593818653.0
    },
    {
        "author": "scbtl",
        "body": "AMD and Intel tend to go in waves of who is on top. They were a good investment between $10-40. I roll CSPs on them to collect premium as I wouldn’t be opposed to owning them but they appear pretty range bound in the near term. \n\nDo your own DD. Look around your life and your friends life. If there is a repeating pattern, take a look at the stock. Investing is done on fundamentals, so pull 10k’s.\n\nIf you are wanting something funkier and more growing, look at some of the SPACs and recent IPO’s.",
        "created_utc": 1593820568,
        "id": "fwut8bv",
        "permalink": "/r/wallstreetbets/comments/hkrnjz/20_year_old_with_more_money_than_sense_should_i/fwut8bv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593849368.0
    },
    {
        "author": "solEEnoid",
        "body": "They do infact have specialized hardware as of a couple years ago. They use custom built chips designed by Peter Bannon who has done chip architecture for Apple and Intel. Reverse engineering something that goes down to the custom SoC level certainly adds complexity. Also since Tesla HW3 is using ARM hardware IP within their hardware, at the very least anyone \"copying\" tesla hardware will have to deal with ARM and their very aggressive IP protection strategies.",
        "created_utc": 1593807902,
        "id": "fwu74s2",
        "permalink": "/r/wallstreetbets/comments/hkmnni/100_think_that_china_will_start_stealing_from/fwu74s2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593836702.0
    },
    {
        "author": "stilloriginal",
        "body": "Thats literally what makes it a bubble.  You’re comparing saturn to intel",
        "created_utc": 1593871271,
        "id": "fwwjbk1",
        "permalink": "/r/stocks/comments/hl1hea/how_is_tesla_stock_not_in_a_bubble/fwwjbk1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593900071.0
    },
    {
        "author": "Fuglie_Gamer",
        "body": "According to wired article here - \" several much larger tech companies, like Microsoft, Intel, and [Micron](https://www.wired.com/story/how-a-boise-company-thrives-in-the-global-chip-business/), which are funding their own DNA storage projects.\"\n\n [https://www.wired.com/story/the-rise-of-dna-data-storage/](https://www.wired.com/story/the-rise-of-dna-data-storage/) \n\nAlso - just b/c you can store data - doesn't make it profitable.  You need to be able to access and modify quickly. Don't think the article has a paywall and didn't read the entire thing but goodluck!",
        "created_utc": 1593840538,
        "id": "fwvm7o3",
        "permalink": "/r/StockMarket/comments/hky1fu/are_there_any_stocks_for_dnabased_data_storageit/fwvm7o3/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593869338.0
    },
    {
        "author": "badbaddoc",
        "body": "Nope just wouldn’t put all my chips on it unless there’s inside intel, also if someone smells something fishy the other companies could always challenge the contract",
        "created_utc": 1593844374,
        "id": "fwvqlse",
        "permalink": "/r/stocks/comments/hkfoim/why_are_we_not_allowed_to_talk_about_w0rkh0rse/fwvqlse/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593873174.0
    },
    {
        "author": "midasTch",
        "body": "Double on NVDA.. it's the only company working on AI/ML -- good for future.\nHold QCOM for 5G.. from internal sources chips are already being tested.\nFor short term- play AMD. Until Intel comes up with new tech (5/7nm) -- AMD will be soaring.",
        "created_utc": 1593878002,
        "id": "fwwuvmt",
        "permalink": "/r/stocks/comments/hl5bts/whats_your_favorite_semi_conductor_investment/fwwuvmt/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593906802.0
    },
    {
        "author": "ob-j",
        "body": "I hopped on the AMD train when people were shitting all over them still and they were trading $14 a share. Like, who the fuck else competes with Intel (in the eyes of the dumb public) other than AMD? Why wouldn’t you invest? SMH",
        "created_utc": 1593715894,
        "id": "fwq5ljb",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwq5ljb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593744694.0
    },
    {
        "author": "SwordOfKas",
        "body": "You also have to look at China in a cultural perspective. Many car companies failed in China because Chinese have a \"China first, everyone else last\" mentality. Many will go out of their way to either buy Chinese goods or counterfeit goods produced by China. It's a really hard market to get into.\n\nAs OP also said, they will and currently do perform cyber attacks on non-Chinese companies and universities all the time to steal various intellectual properties. Many companies are also forced to allow the Chinese government to do what they want to products (i.e. modify them for surveillance. The U.S. also does this with various products just as having backdoors in Intel CPUs, etc.)\n\nI'm not trying to be politically bias, this is just the reality of businesses having to tread various political and cultural waters which can deeply impact revenue and subsequently, profit.",
        "created_utc": 1593809945,
        "id": "fwuasvt",
        "permalink": "/r/wallstreetbets/comments/hkmnni/100_think_that_china_will_start_stealing_from/fwuasvt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593838745.0
    },
    {
        "author": "notlongnot",
        "body": "I see. \n\nAnd they are being pinched with Intel, Nvidia plus Arm processors. Also, they don’t have an AI roadmap. They have yet to dominate in any segments \n\nI like the CEO and all the progress they made. Recent CPU and GPU are nice.",
        "created_utc": 1593788917,
        "id": "fwt7dwy",
        "permalink": "/r/stocks/comments/hkarm3/amazon_vs_apple_vs_microsoft_vs_google/fwt7dwy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593817717.0
    },
    {
        "author": "Glassiftrue",
        "body": "If AMD doesn't hit 53 by tomorrow I'm ripping out my GPU and CPU and replacing with Intel and Nvidia out of spite",
        "created_utc": 1593618721,
        "id": "fwlduj6",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlduj6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593647521.0
    },
    {
        "author": "KingBadford",
        "body": "Fuck AMD I'm buying an Intel cpu.  Oh wait I can't because I'm fucking broke.",
        "created_utc": 1593611757,
        "id": "fwl0fxi",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0fxi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640557.0
    },
    {
        "author": "boomdynasty",
        "body": "how is INTC looking to everyone? is it a good long term hold?",
        "created_utc": 1593598661,
        "id": "fwkj39f",
        "permalink": "/r/stocks/comments/hj63kf/rstocks_daily_discussion_wednesday_jul_01_2020/fwkj39f/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627461.0
    },
    {
        "author": "awxomexd",
        "body": "Now might be a good time to buy. They've just dropped Intel completely from their base model products.",
        "created_utc": 1593594850,
        "id": "fwkfdav",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkfdav/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593623650.0
    },
    {
        "author": "Captaincadet",
        "body": "You mean they dropped intel from ALL computers and taking their computers to in house ARM processors in the next 2 years.\n\nIt looks promising from the developer kit so maybe now’s the time to buy as they won’t have to pay intel which should make their computers more profitable going forward",
        "created_utc": 1593599027,
        "id": "fwkjgi4",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkjgi4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627827.0
    },
    {
        "author": "Captaincadet",
        "body": "They are going fully ARM\n\n\nhttps://www.theguardian.com/technology/2020/jun/22/apple-ditches-intel-for-arm-processors-in-big-sur-computers",
        "created_utc": 1593606057,
        "id": "fwkri7a",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkri7a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593634857.0
    },
    {
        "author": "p_giggles",
        "body": "A range of 1,500-15,000 is also a good way for a company to say \"we have no fuckin idea and want to hype up the stock\" \n\nYou don't see analysts covering Intel with a price range of $20-$200",
        "created_utc": 1593611047,
        "id": "fwkz7pe",
        "permalink": "/r/stocks/comments/hj5rzv/arkk_and_arkw_overpriced/fwkz7pe/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593639847.0
    },
    {
        "author": "DaPurpleMage",
        "body": "INTC down just as much",
        "created_utc": 1593611840,
        "id": "fwl0l4b",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0l4b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640640.0
    },
    {
        "author": "DangerousLiberal",
        "body": "Check the share price of the two. Check Intel. Have you ever heard of dilution?",
        "created_utc": 1593623013,
        "id": "fwlmwrk",
        "permalink": "/r/wallstreetbets/comments/hj4tqj/the_tech_bubble_is_a_gay_bear_fantasy/fwlmwrk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593651813.0
    },
    {
        "author": "moltch",
        "body": "Are we getting jebaited, why is amd/micron/intel the only sector down??",
        "created_utc": 1593611913,
        "id": "fwl0ppa",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0ppa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640713.0
    },
    {
        "author": "ayyopapi",
        "body": "Intel fans",
        "created_utc": 1593624266,
        "id": "fwlplia",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlplia/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593653066.0
    },
    {
        "author": "sp3xl",
        "body": "It’s going to be 200B-ish market cap in case intel dies completely. That puts it at 3x growth potential from what we have now.",
        "created_utc": 1593604556,
        "id": "fwkpk13",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkpk13/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593633356.0
    },
    {
        "author": "madnutbutter",
        "body": "US needs curfew and mandatory masks. Too many white woke kids colonized the BLM like their great grandparents colonized Africa. They don't understand they are manipulated by foreign intel and corporate interests to do rioting, attack police, attack cars and spread the rona.\n\nMarket will stay volatile with many crashes and pumps. I think we can say finally that the mouse is fuk.",
        "created_utc": 1593602547,
        "id": "fwkn5wd",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkn5wd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593631347.0
    },
    {
        "author": "rankiba",
        "body": "Doubt intel will die",
        "created_utc": 1593604621,
        "id": "fwkpmxx",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkpmxx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593633421.0
    },
    {
        "author": "Ehralur",
        "body": "That's because Intel doesn't operate in 3 of the world's biggest industries while pushing completely new technology that will change all of these. A bear case of 1,500 in case they stay just a car company compared to 15,000 if they dominate automotive energy and autonomous driving industries makes perfect sense.\n\nSo no, it has nothing to do with them being clueless, but it's just that you can't predict whether disruptions this big will succeed.",
        "created_utc": 1593618474,
        "id": "fwldcci",
        "permalink": "/r/stocks/comments/hj5rzv/arkk_and_arkw_overpriced/fwldcci/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593647274.0
    },
    {
        "author": "altaro22",
        "body": "Checked the holdings for that etf, i dont see any of the big players frol the junteenth movement on there? A lot of big corporations like MCD, INTEL etc.",
        "created_utc": 1593629567,
        "id": "fwm1f28",
        "permalink": "/r/pennystocks/comments/hjerel/beware_of_july_7th_blackout_day/fwm1f28/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593658367.0
    },
    {
        "author": "reaper527",
        "body": "&gt; Now might be a good time to buy. They've just dropped Intel completely from their base model products.\n\nthat seems like the opposite of a good time to buy. are you old enough to remember how obscure and irrelevant apple was in the computer market in the 90's/early 2000's prior to them switching from ppc to intel x86-64?\n\nthey were a niche product.",
        "created_utc": 1593618073,
        "id": "fwlcj65",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwlcj65/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593646873.0
    },
    {
        "author": "AngelaQQ",
        "body": "Why would you \"bet\" against the best foundry in the world?\n\nLike, they're objectively the best. No one else touches them from a tech perspective. Samsung is probably the second best in the world, and they're a good 3 years behind TSMC's current node.\n\nTSMC manufactures chips for companies like Apple, AMD and Tesla. This is how good their reputation is. They're the best.\n\nBet against shit companies. Not the Rolls Royces of the industrial world.\n\nIf you're gonna bet against a foundry, bet against UMC or something. If Intel were just a foundry, I'd bet against them, because their foundry side has been floundering for years now. But I would never bet against Intel's sales and marketing....",
        "created_utc": 1593617063,
        "id": "fwlaidm",
        "permalink": "/r/stocks/comments/hjaa6i/bear_case_against_taiwan_semi_for_the_long_term/fwlaidm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593645863.0
    },
    {
        "author": "urmyheartBeatStopR",
        "body": "There ain't no way TSM is going to be bought.\n\nBuying a fab company is a shit move.\n\nAMD spun off it's fab factory.\n\nIntel is getting fucked with its own fab factory.\n\n---\n\nThat's because buying a big companies you inherit a lot of bullshit. Debt and the responsibility to integrate it with your current company (technology stack, etc..).\n\nMost tech company do aqcui hire on smaller companies.",
        "created_utc": 1593620227,
        "id": "fwlgynu",
        "permalink": "/r/stocks/comments/hj8zv0/apples_next_5g_company/fwlgynu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593649027.0
    }
]