[
    {
        "author": "cackalackattack",
        "body": "We’ll be on the third stimulus package by then. Hewlett-Packard and Epson will become official extensions of the fed. SPY at 400.",
        "created_utc": 1585954866,
        "id": "fmcxk2c",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1585983666.0
    },
    {
        "author": "dopexile",
        "body": "Betting against HPQ is suicidial. Jpow is printing $1,000,000 every second with his quantitative easing program.\n\nDo you have any idea how many $44.99 ink cartridges he is going to need?",
        "created_utc": 1585946323,
        "id": "fmcii6k",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1585975123.0
    },
    {
        "author": "03z06",
        "body": "God you're retarded....HPE is their enterprise side which focuses on servers and networking. HPQ is the consumer side that sells actual laptops.",
        "created_utc": 1588091802,
        "id": "foux1pg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588120602.0
    },
    {
        "author": "VegasGuy777",
        "body": "....as Hewlett Packard announced a worldwide shortage of printer ink due to unprecedented demand.",
        "created_utc": 1586911274,
        "id": "fnfmyc6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586940074.0
    },
    {
        "author": "mountainoptions",
        "body": "Calls on HPQ, printer needs ink",
        "created_utc": 1586576933,
        "id": "fn23lg4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586605733.0
    },
    {
        "author": "FakeCatzz",
        "body": "Even the best Hewlett Packard in the world can't stop this shit from tanking. I think what's been lost in all of this is that the fiscal stimulus isn't even a stimulus, it's just propping up the ponzi scheme for one last hurrah, and the monetary stimulus isn't a stimulus, it's just stopping half of America from starving.",
        "created_utc": 1586954325,
        "id": "fnh43ab",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586983125.0
    },
    {
        "author": "metamaoz",
        "body": "What's HPC, Hewlett Packard Computers?",
        "created_utc": 1587020049,
        "id": "fnkagv1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1587048849.0
    },
    {
        "author": "Virkokka",
        "body": "\\&gt;new account  \n\\&gt;HPQ does laptops, HPE does enterprise stuff like servers, storage and NW  \n\\&gt;HP laptops have terrible reputation, especially the retail ones (being ex-HP employee, I have my 3rd HP enterprise-class laptop and it's OK, but very costly)  \n\\&gt;You suspiciously left out number 1 laptop seller in 2019, which is Lenovo.  \n\n\nHard pass.",
        "created_utc": 1588097954,
        "id": "fova8l5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588126754.0
    },
    {
        "author": "kingofthefall420",
        "body": "i bought HPQ 5/01 p16$ for 2.11$ and \"last traded\" has been at 2$ all day, how come that be?HPQ dropped almost på 8%",
        "created_utc": 1585944978,
        "id": "fmcg2a8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585973778.0
    },
    {
        "author": "LochlanGlass",
        "body": "After wasting countless paychecks trying to short the US economy I’ve finally figured it out. I took the advice of the ladyboys on r/investing, and started to think about the long term. So I bought a fucking HP DeskJet Ink Advantage 3775 J9V8JB, and put my last dollar on the glass. I hit that fucking green button and now I’m making more money than I ever have. Only problem is, the same jizz stain is on all of them. It’s not easy work dancing at the gay bear club. \n\nHPQ $10p 🏳️‍🌈🐻",
        "created_utc": 1586942692,
        "id": "fngrx2h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586971492.0
    },
    {
        "author": "Zima14",
        "body": "Thanks for your valuable input.\n\nThis would have been my first merger, so I was quite confused by it.\n\nIn that case, I won't sell my house and buy HPQ for the guaranteed +20% in two weeks.",
        "created_utc": 1586540831,
        "id": "fn0f78q",
        "score": 1,
        "subreddit": "investing",
        "created": 1586569631.0
    },
    {
        "author": "bmoney83",
        "body": "I would argue that they aren't expensive right now. What companies are you thinking of? \n\nWhen I first started investing, I made my biggest mistakes. If I can share one thing I've learned is invest in the companies you know, dont play these lottery ticket stocks (it never works out) and don't use options as your primary investing strategy (supplement only).\n\nI'm long:\nGOOG, DIS, MSFT, AXP, NKE, SBUX, FB, PINS, UBER, QCOM, JPM, CPRI. \n\nI'm selling covered calls on:\nSBUX @ 65 s.p. expiring next week\nPINS @$15.50 expiring Thusday\n\nOptions I hold\nDIS $125 Calls expire Jan 2022\nXLF $30 Calls expire Jan 2022\n\nNames I'm looking at:\nAMD, NVDA, GS, AMZN, LYV, CRWD, HPQ, WDAY, BBY, UNH, CNC, ABBV",
        "created_utc": 1586255426,
        "id": "fmodwrh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586284226.0
    },
    {
        "author": "allinCostco",
        "body": "Hpq and xerox calls for all the printing jpow is doing",
        "created_utc": 1587428722,
        "id": "fo19utt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587457522.0
    },
    {
        "author": "proprietism",
        "body": "AAPL AMZN ARKQ ATHX BRK/B COP EADSY FDN GOOGL HPQ IGV IYE MSFT PEY QQQ ROBO SPY VWO and 15% cash",
        "created_utc": 1586469593,
        "id": "fmxpx13",
        "score": 1,
        "subreddit": "investing",
        "created": 1586498393.0
    },
    {
        "author": "Peetrius",
        "body": "HPQ puts at open. Got it.",
        "created_utc": 1586148048,
        "id": "fmk9gcg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586176848.0
    },
    {
        "author": "MSL0727",
        "body": "Very very bad company. I went from HP to Hewlett-Packard Enterprise to DXC Technology, and the whole time we were employed at DXC there was a feeling of death around with no morale and a very sad feeling around the fact that most were told they should just be happy they have a job. Although I literally sat and watched as person by person around me all inevitably got laid off. They'd come in on Thursday and be told the next day (Friday) would be their last day and they'd be lucky to get severance. I eventually left the company because of anything could be better, and I was looking to grow and not be held down. \n\nNo raises or bonuses for years, layoffs left and right, vile environment, etc. I wouldn't own it, but then again I don't track the stock price and I see it from a perspective that would never interest me in looking.",
        "created_utc": 1586103820,
        "id": "fmi77dw",
        "score": 1,
        "subreddit": "investing",
        "created": 1586132620.0
    },
    {
        "author": "franklinwritescode",
        "body": "No. This sounds wrong. \n\nSure. Consumer products are less efficient. They buy more products, used less often, multiple products per person, etc., etc. But that doesn't account for the massive volume and price that enterprises are paying. \n\nHP, Inc. (the consumer products arm) produced $14.092B in net revenue in FY2019.\n\nHPE produced $12.879B in net revenue just in compute; in addition to storage solutions HPE generated in total $16.488B total net revenue just from the sale of hardware (compute + storage). (There's also a ~$6B rev line item for services.)\n\nSo all told even not counting services HPE *crushed* (&gt; 17%) the revenue of HP, Inc.",
        "created_utc": 1587500999,
        "id": "fo4air8",
        "score": 1,
        "subreddit": "investing",
        "created": 1587529799.0
    },
    {
        "author": "skizzlegizzengizzen",
        "body": "HPQ calls now!",
        "created_utc": 1587475423,
        "id": "fo2w0ih",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587504223.0
    },
    {
        "author": "rangersfan1717",
        "body": "Am I crazy for being super super tempted by HPQ? It seems to be pretty darn low right now at under $16.\n\n&amp;#x200B;\n\nAs for stocks I have, I guess Chegg is the most unique one.  It's my long term play.",
        "created_utc": 1587123510,
        "id": "fnofmfw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587152310.0
    },
    {
        "author": "DarkScottishAle",
        "body": "This just in, J Pow just bought  HP Inc. and now is printing printers!!!!",
        "created_utc": 1586271101,
        "id": "fmoyout",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586299901.0
    },
    {
        "author": "dotroise",
        "body": "Thanks for your comment. A lot of what you said makes perfect sense. I agree with almost all the points you made but here are the parts that I am not sure about. \n\n \\&gt; Absurd brand premium to their products: Hardware assembly is infamously commoditized yet Apple's gross margin on its smartphones is 65% (compared to say 18% for HPQ); part of it is the pricing power Apple gets from the loyalty of its customer base, part of it is the sexiness of the design of their products. \n\nThey do have brand premium but the question is how much is it gonna last? Their brand premium comes from fantastic designs and breakthrough innovations from the past. In the last few years, they basically reproduced the same thing with minor changes. Ford had a great brand premium but when people started to realize they can buy Toyota for like 20% less the brand loyalty faded away (correct me if I am wrong cuz I'm not certain of numbers). Do you think people are willing to spend 700$ every two years + all the expensive accessories to buy a slightly changed iPhone? \n\nI have to disagree with the design part. If you look at their hardware and compare it to common android phones in the same price range you will see that Apple is not that great.  You can look at Galaxy S11 as an example. Big notch and bezzles and 60hz screen just to name a few downsides of iPhone. Again, I am not saying iPhones are bad but on a cost relative basis, there are better alternatives. \n\nAs far as the software goes, Apple is ahead of android in my opinion but is it worth paying that much more?",
        "created_utc": 1587004521,
        "id": "fnjqaqx",
        "score": 0,
        "subreddit": "SecurityAnalysis",
        "created": 1587033321.0
    },
    {
        "author": "redditsgarbageman",
        "body": "You're gonna live to regret something. If losing money is the worst of it, consider yourself lucky.",
        "created_utc": 1586941296,
        "id": "fngql7n",
        "score": 923,
        "subreddit": "wallstreetbets",
        "created": 1586970096.0
    },
    {
        "author": "rturtle",
        "body": "My gramps once apologized for my family not having any money on thanksgiving. \n\nHe said that in WW2 there was a scam when you were stationed in the UK. You could exchange your dollars for pounds from grey market street dealers then come back to the base and exchange your pounds for dollars at a better rate. You could repeat for infinite money.  He said he spent his money on pussy instead. \n\nThis infinite money hack is working for the banks and hedge funds right now. They are buying up shit and then claiming it as assets to get more money from the fed and then buying up more shit to infinity.\n\nGramps squandering it all on pussy was way more honest.",
        "created_utc": 1586882321,
        "id": "fne3c23",
        "score": 813,
        "subreddit": "wallstreetbets",
        "created": 1586911121.0
    },
    {
        "author": "Mods_sofa_king_gay",
        "body": "You should tell him about options!!! That's what I introduced my friends to and already in a week they are at -90%... It feels good... Misery loves company.\n\nAlso I make sure to tell them of my big wins so they get desperate. And whenever they win, I remind them how much better they would have done if they risked more... I love helping friends out",
        "created_utc": 1586822308,
        "id": "fnbu0lx",
        "score": 659,
        "subreddit": "wallstreetbets",
        "created": 1586851108.0
    },
    {
        "author": "Sporothrix",
        "body": "No chance this happens. They're proposing it to make republicans look bad for rejecting it.",
        "created_utc": 1587012125,
        "id": "fnk1ak7",
        "score": 639,
        "subreddit": "investing",
        "created": 1587040925.0
    },
    {
        "author": "BurninCrab",
        "body": "I work in PE / VC. Pretty much everyone in the community knew that the Vision Fund would be a dumpster fire when it was announced a couple years ago.\n\nThere’s a very good reason why the biggest funds top out at $15-20 billion in size. There just aren’t enough high quality investment opportunities to throw $100 billion at in a short period of time.",
        "created_utc": 1586808656,
        "id": "fnb3obs",
        "score": 489,
        "subreddit": "investing",
        "created": 1586837456.0
    },
    {
        "author": "NoCountryForOldPete",
        "body": "Honestly it wouldn't surprise me if one of these people just drops everything on some weird niche medical bone screw manufacturer that's down 99%, then sees an Indiana Jones faceripper followed by a buyout and walks away with a 10,000% gain. \n\n...and then proceeds to give me unsolicited \"advice about the market\" until one of us is in the grave.",
        "created_utc": 1586821493,
        "id": "fnbsl66",
        "score": 478,
        "subreddit": "wallstreetbets",
        "created": 1586850293.0
    },
    {
        "author": "nubface1001",
        "body": "I heard he blew it all and is working at DQ now. Poor guy",
        "created_utc": 1586978081,
        "id": "fnidcg2",
        "score": 471,
        "subreddit": "wallstreetbets",
        "created": 1587006881.0
    },
    {
        "author": "lsucadien",
        "body": "It's in Goldman's interest to say things that influence in the direction that makes them money.  That's it, the sooner you accept that the less flabbergasted you'll be.",
        "created_utc": 1586808190,
        "id": "fnb2qzg",
        "score": 469,
        "subreddit": "wallstreetbets",
        "created": 1586836990.0
    },
    {
        "author": "Tellme21w",
        "body": "Sorry to see that bro. Stop gambling. All these fucks posting huge gains are pure lucky. The other end of it is unlucky bastards like yourself losing it all...what shame.",
        "created_utc": 1586927796,
        "id": "fngc44m",
        "score": 452,
        "subreddit": "wallstreetbets",
        "created": 1586956596.0
    },
    {
        "author": "theycallmeryan",
        "body": "This screenshot took me days of watching to get. I actually bled $3k from the open today but it felt like a win because I finally got my screenshot. I had one at 69,419 and 69,421 but thought I wasn’t destined to hit the magic number.",
        "created_utc": 1587590671,
        "id": "fo86avx",
        "score": 416,
        "subreddit": "wallstreetbets",
        "created": 1587619471.0
    },
    {
        "author": "l0gicgate",
        "body": "Timeline of events:\n- Started the sub\n- Left for years / minimal activity\n- Once sub was popular he came back and demodded / banned people\n- Pushed his stupid fucking book trying to make a buck\n- Affiliated himself with True Trading Group and attempted to put on a Trading E-Sports type event with outrageous buy-in and shady prize scheme\n- Made fake account u/WSBGod and made some outlandish posts that got us on r/all and then an influx of retards came so he can promote his garbage to them\n- Changed the original logo/banner and removed the original Discord server to promote his\n- Disgruntled mods were somehow able to plan a coup with reddit mods to take him down and it brings us to today!",
        "created_utc": 1586387682,
        "id": "fmuan2v",
        "score": 394,
        "subreddit": "wallstreetbets",
        "created": 1586416482.0
    },
    {
        "author": "AnselmFox",
        "body": "It means they’re selling this week. That’s all. Fucking crooks",
        "created_utc": 1586786695,
        "id": "fn9xb0l",
        "score": 371,
        "subreddit": "investing",
        "created": 1586815495.0
    },
    {
        "author": "itachi12131415",
        "body": "&gt;Report this post\n\nTell us why\n\n&gt;I'm in this post and I don't like it",
        "created_utc": 1586909736,
        "id": "fnfkbri",
        "score": 368,
        "subreddit": "wallstreetbets",
        "created": 1586938536.0
    },
    {
        "author": "wickedwiggles",
        "body": "We can only lose 100% of our investments but gain infinitely. Think about it.",
        "created_utc": 1586931874,
        "id": "fnggxcf",
        "score": 355,
        "subreddit": "wallstreetbets",
        "created": 1586960674.0
    },
    {
        "author": "AbsolutelyAutistic",
        "body": "Nice. Now roll it all in to $TSLA put debit spreads.",
        "created_utc": 1586958048,
        "id": "fnh9lir",
        "score": 318,
        "subreddit": "wallstreetbets",
        "created": 1586986848.0
    },
    {
        "author": "Baurusdavinci",
        "body": "That's what I told him, but he wasn't exactly in the mood to hear it",
        "created_utc": 1586929995,
        "id": "fngerjh",
        "score": 317,
        "subreddit": "wallstreetbets",
        "created": 1586958795.0
    },
    {
        "author": "dan-1",
        "body": "Go on, buy AMZN calls expiring tomorrow. All in. You'll double and become a millionaire. You know you want it.",
        "created_utc": 1587065785,
        "id": "fnm66q1",
        "score": 313,
        "subreddit": "wallstreetbets",
        "created": 1587094585.0
    },
    {
        "author": "Lonely_Beer",
        "body": "People don't buy Teslas to save money on gas or the environment, they do it to flex on your broke ass as they pick your wife up from the bar",
        "created_utc": 1587039451,
        "id": "fnktg1j",
        "score": 310,
        "subreddit": "wallstreetbets",
        "created": 1587068251.0
    },
    {
        "author": "tiny_cat_bishop",
        "body": "now you're getting it. protip: trade as if the market is going to go in the direction that will make the rich people richer.\n\n*edit: momentary dyslexia",
        "created_utc": 1586873641,
        "id": "fndn42k",
        "score": 299,
        "subreddit": "wallstreetbets",
        "created": 1586902441.0
    },
    {
        "author": "GuiltyGun",
        "body": "Actually the market is going to crash cause last week I bought exactly one SPY 280 call. Now hopefully it crashes hard enough my long puts work out.\n\nSometimes you've gotta psych the system.",
        "created_utc": 1586814654,
        "id": "fnbfklp",
        "score": 299,
        "subreddit": "wallstreetbets",
        "created": 1586843454.0
    },
    {
        "author": "FinndBors",
        "body": "Why is my taxpayer money going into 70% grants to corporations? Seriously wtf is this? It is 10 times worse than what they did in the GFC and that was already extremely unpopular. Why aren’t people up in arms about this now?",
        "created_utc": 1586908776,
        "id": "fnfin8p",
        "score": 299,
        "subreddit": "investing",
        "created": 1586937576.0
    },
    {
        "author": "Killdynamite",
        "body": "“It may feel like you don’t have a lot of options.”\nWhat do you mean? I got plenty of $0.01 puts!",
        "created_utc": 1586964862,
        "id": "fnhm19w",
        "score": 296,
        "subreddit": "wallstreetbets",
        "created": 1586993662.0
    },
    {
        "author": "Captain__Yolo",
        "body": "I've lost from 25k to 1500 and managed to bring it back to over 40k this week. Don't ever give up, just take time to think and plan before going again.\n\nMy mistakes were valuable lessons that made me a better trader in the end.",
        "created_utc": 1586907627,
        "id": "fnfgjog",
        "score": 296,
        "subreddit": "wallstreetbets",
        "created": 1586936427.0
    },
    {
        "author": "avgazn247",
        "body": "Nah he doing big brain moves. Don’t have to pay taxes on two mil if u lose half of it",
        "created_utc": 1586215370,
        "id": "fmn009x",
        "score": 291,
        "subreddit": "wallstreetbets",
        "created": 1586244170.0
    },
    {
        "author": "oupablo",
        "body": "i'm a simple man. I buy when it goes down and sell when it goes even lower",
        "created_utc": 1586794518,
        "id": "fnabevw",
        "score": 290,
        "subreddit": "investing",
        "created": 1586823318.0
    },
    {
        "author": "Kule7",
        "body": "I lose a little bit of confidence in them when their target S&amp;P value moves from 2000 to 3000 in the course of a month.  Whatever crystal ball they have, it didn't do much to inform them of the stuff that's happened in the last month (chiefly policy moves, which you'd think would be something at least somewhat susceptible to prediction).",
        "created_utc": 1586786454,
        "id": "fn9wxay",
        "score": 280,
        "subreddit": "investing",
        "created": 1586815254.0
    },
    {
        "author": "anonrose",
        "body": "Fuck it was tempting.",
        "created_utc": 1587063065,
        "id": "fnm0qhn",
        "score": 265,
        "subreddit": "wallstreetbets",
        "created": 1587091865.0
    },
    {
        "author": "jamespogo",
        "body": "This confirms it, we are at the top",
        "created_utc": 1586905310,
        "id": "fnfc7lj",
        "score": 252,
        "subreddit": "wallstreetbets",
        "created": 1586934110.0
    },
    {
        "author": "cookingboy",
        "body": "“This guy is wacky and walks around office bare feet and likes to dance on conference room tables, next Steve Jobs confirmed! Hell let’s prop up the valuation by another $10B if he doesn’t take showers either!”\n\nThat’s probably the amount of DD they were doing.\n\nEDIT: On a more serious note, my feeling is that some Japanese companies/business leaders are enamored by western entrepreneurs like Steve Jobs because he achieved astounding success while acting in a way that's the polar opposite of Japanese business culture. So these investors fell into some form of modern [cargo cult](https://en.wikipedia.org/wiki/Cargo_cult) and overly attributed their success to their personality quirks. Startup founders know how to take advantage of this too, at around 2012ish a lot of founders started showing up to VC pitch meetings with messy hair and wrinkled hoodies just to subconsciously remind investors that they could be the next Zuckerberg.\n\nIn the end despite the amount of resources involved in the startup funding world, a lot of it is driven by human emotion and people doing dumb things like FOMO.",
        "created_utc": 1586812803,
        "id": "fnbbwsg",
        "score": 252,
        "subreddit": "investing",
        "created": 1586841603.0
    },
    {
        "author": "ABK-Baconator",
        "body": "Every day ask yourself are your positions justified. Don't look at the -50% next to it",
        "created_utc": 1586960927,
        "id": "fnhem60",
        "score": 247,
        "subreddit": "wallstreetbets",
        "created": 1586989727.0
    },
    {
        "author": "Randomness898",
        "body": "I had a long post about this a few days ago.  It's in my post history if you wanna read on it.  I try to give some more detail about how some of these algos work and the intricate details behind how they can influence SHORT term moves.  Your post actually would have been nice to use to further support my argument.\n\nAlthough we need to be clear to distinguish types of algos.  Technically, there are also execution algos like that retail uses to execute orders, but these are NOT the types of algos I refer to when I talk about algos.  Also keep in mind a lot of these algorithms are risk/liquidation algorithms, which means they'll buy and sell not because it is fundamentally good to buy or sell, but because it is part of their risk profile to buy or sell at this moment.",
        "created_utc": 1586915464,
        "id": "fnfu1uo",
        "score": 246,
        "subreddit": "investing",
        "created": 1586944264.0
    },
    {
        "author": "MushroomManiac",
        "body": "I started with only 45k like 9 months ago and have slowly turned it into 400k",
        "created_utc": 1586899358,
        "id": "fnf0uyp",
        "score": 246,
        "subreddit": "wallstreetbets",
        "created": 1586928158.0
    },
    {
        "author": "bmur90",
        "body": "*until employment returns to pre-COVID-19 levels*.\n\nOh so until employment reaches record levels again, got it.",
        "created_utc": 1587015808,
        "id": "fnk5s7v",
        "score": 245,
        "subreddit": "investing",
        "created": 1587044608.0
    },
    {
        "author": "AGayBlackMidget",
        "body": "I can tell you right now that it (social distancing) won't last until 2022.",
        "created_utc": 1586953590,
        "id": "fnh3505",
        "score": 236,
        "subreddit": "wallstreetbets",
        "created": 1586982390.0
    },
    {
        "author": "watupboy101",
        "body": "I went short, if I had to guess I’d say it was related to that",
        "created_utc": 1586796242,
        "id": "fnaesqc",
        "score": 228,
        "subreddit": "stocks",
        "created": 1586825042.0
    },
    {
        "author": "Freki_M",
        "body": "Fucking right? I kick myself for ages when I lose even a few hundred I'm completely willing to burn, how do you have 16 million and just dump it all into something like the market?\n\nI mean I respect the fearlessness so maybe I'm just being a coward by not yeeting my life savings into this zany market.",
        "created_utc": 1586942997,
        "id": "fngs7gj",
        "score": 227,
        "subreddit": "wallstreetbets",
        "created": 1586971797.0
    },
    {
        "author": "Watblieft",
        "body": "As grumpy bear, I decided to go with the flow and buy calls of the least appealing stock I could think of. As a protest. It became Gamestop. I'm up 140% on my calls in two days and it compensated the losses of my puts. \n\nI feel extra stupid now.",
        "created_utc": 1586900458,
        "id": "fnf2zal",
        "score": 219,
        "subreddit": "wallstreetbets",
        "created": 1586929258.0
    },
    {
        "author": "itachi12131415",
        "body": "Damn that sucks dude. Take out a loan and max out your credit cards to gamble it back",
        "created_utc": 1587002199,
        "id": "fnjmnuc",
        "score": 218,
        "subreddit": "wallstreetbets",
        "created": 1587030999.0
    },
    {
        "author": "applesNoranges98487",
        "body": "it means WSB indirectly made the rally",
        "created_utc": 1586815754,
        "id": "fnbhrot",
        "score": 216,
        "subreddit": "StockMarket",
        "created": 1586844554.0
    },
    {
        "author": "hackernight7",
        "body": "I’ve run out of explanations honestly. I don’t get it. Maybe people think they’re being too conservative and taking to opportunity to take provisions on bad loans that were not already great. But at some point, the numbers should be reflected.\n\nEdit: this comment is not specific to JPM. But like a general comment on the Nasdaq, which I follow more closely.",
        "created_utc": 1586864962,
        "id": "fndat5c",
        "score": 215,
        "subreddit": "wallstreetbets",
        "created": 1586893762.0
    },
    {
        "author": "Skwigle",
        "body": "I'm just gonna jump in here because it isn't the first time I've seen \"short squeeze\" seemingly used incorrectly and I feel like maybe some of you don't really understand what it is. The chart we are seeing now cannot be a short squeeze nor can it be a \"short squeeze in reverse\".\n\nShorting a stock means you're borrowing shares from your broker and selling them to someone at the current price. The idea being that you think the price will go down and then you can buy them back at a lower price. So if you short XYZ today at $100/share and buy them back tomorrow at $90/share, you've made $10/share. If, on the other hand, the stock goes up to $110, you've lost $10/share.\n\nNow the tricky thing about shorting a stock is that there is no limit to the upside (of the stock price). When you buy a stock, the maximum you can lose is 100%. You buy it at $100 and it goes to zero, you've lost $100/share and can't lose more. That's it. But if you short a stock, your losses are theoretically unlimited. If you shorted TSLA at $300 you'd be in a world of pain when it hit $950 because that means your losses are $650/share at that point. Your downside (on the trade) is unlimited but your upside is limited to 100% (and that's if the shares go to zero).\n\nFor these reasons, you don't want to short a stock and hold on to it forever like you might if you were long. The pain of holding onto it as the losses mount become too much to bear, but also because you don't have an unlimited amount of money in your account. At some point, you will be FORCED to buy back the stock before the losses outstrip your funds.\n\nSo a short squeeze occurs after a stock has run up considerably and reaches a point where everyone who has shorted the stock is essentially forced to buy it back before it goes too high. At this point, you'll see a huge spike on top of a run up.\n\nThere is no real opposite to a short squeeze because when you hold stocks long, your max loss is 100% and no one is ever forced to sell. You can just hold on until zero. In real life, however, you will often reach a point where people just don't want to lose more money and get out anyway. When everyone is running for the exits and sells their stock at the same time, you'll see a huge downward spike after a run down. This is usually called capitulation and often signals a reversal to an uptrend.",
        "created_utc": 1586798860,
        "id": "fnak2bu",
        "score": 213,
        "subreddit": "wallstreetbets",
        "created": 1586827660.0
    },
    {
        "author": "he_who_knows_nothin",
        "body": "Why is it that all the normal trash can just constantly get through but this is the thing that is constantly deleted.",
        "created_utc": 1586976456,
        "id": "fni9xmn",
        "score": 211,
        "subreddit": "wallstreetbets",
        "created": 1587005256.0
    },
    {
        "author": "wadewannabe3",
        "body": "If SPY closes under 244 I will chop my dick off and eat it.",
        "created_utc": 1586390661,
        "id": "fmufznz",
        "score": 210,
        "subreddit": "wallstreetbets",
        "created": 1586419461.0
    },
    {
        "author": "chedrich446",
        "body": "oh no the “loan” program ran out of money! if only there were a way to create more money out of thin air and give it to companies!! it’s too bad there is no way to do that damn.",
        "created_utc": 1587053627,
        "id": "fnlhh2a",
        "score": 208,
        "subreddit": "wallstreetbets",
        "created": 1587082427.0
    },
    {
        "author": "TTUnathan",
        "body": "Calls it is then.",
        "created_utc": 1586395772,
        "id": "fmuoye9",
        "score": 204,
        "subreddit": "wallstreetbets",
        "created": 1586424572.0
    },
    {
        "author": "bragghy",
        "body": "CASH OUT HALF OF IT and never put it back. PLEASE. DON'T BE AN AUTIST. YOLO THE REST",
        "created_utc": 1586797158,
        "id": "fnagmdy",
        "score": 203,
        "subreddit": "wallstreetbets",
        "created": 1586825958.0
    },
    {
        "author": "lorgror",
        "body": "&gt;It may not feel like it, but you have options. \n\nThat's the problem...",
        "created_utc": 1586965018,
        "id": "fnhmc8d",
        "score": 198,
        "subreddit": "wallstreetbets",
        "created": 1586993818.0
    },
    {
        "author": "rushinrussia",
        "body": "If Gordon calls this market 3 days in a row (including today's call, so 2 more) can I buy him a piece of furniture or a bulb or something. Mods hold me to it",
        "created_utc": 1585770960,
        "id": "fm5dmoq",
        "score": 198,
        "subreddit": "wallstreetbets",
        "created": 1585799760.0
    },
    {
        "author": "searchoftruth",
        "body": "Report: new virus found in Wuhan, Modelo Virus (MoVid-20) although it is just a nasty cold",
        "created_utc": 1587079961,
        "id": "fnmxa74",
        "score": 198,
        "subreddit": "wallstreetbets",
        "created": 1587108761.0
    },
    {
        "author": "MaxAds1",
        "body": " \n\n\"What power do you have over the states in this whole ordeal?\"\n\n\"The power I have over the states is tremendous. To put it in a word, absolute.\"\n\n\"Mr. President, what power do you have by the constitution over the states in this matter. I'm trying to figure out what possibilities we' can see in the future.\"\n\n\"You're terrible, you know that. It's absolutely terrible the questions you ask. You won't make it. That's why your station is the lowest it's been ever. Probably three times as low as it's ever been. If not it should be.\"\n\n\"Mr. President, can you tell me who told you that you have this power?\"\n\n\"Enough. You're done.\"\n\nFutures green.",
        "created_utc": 1586820923,
        "id": "fnbrkyg",
        "score": 193,
        "subreddit": "wallstreetbets",
        "created": 1586849723.0
    },
    {
        "author": "DownvoteFarmer9000",
        "body": "It won't even last until autumn. Even if the government tries to prolong the measures, people will increasingly start to live their lives normally and take their chances the same way people get in a car every day knowing they might die in a car crash.",
        "created_utc": 1586959292,
        "id": "fnhbp1g",
        "score": 191,
        "subreddit": "wallstreetbets",
        "created": 1586988092.0
    },
    {
        "author": "BingBong-42",
        "body": "i legit think gordon is probably smarter than everyone here so i'll trust it",
        "created_utc": 1585770906,
        "id": "fm5dj04",
        "score": 189,
        "subreddit": "wallstreetbets",
        "created": 1585799706.0
    },
    {
        "author": "wobermey1987",
        "body": "Never thought about it like that. Also sounds like they were doing very little due diligence.",
        "created_utc": 1586808877,
        "id": "fnb446h",
        "score": 188,
        "subreddit": "investing",
        "created": 1586837677.0
    },
    {
        "author": "74FFY",
        "body": "Deposited and lost $13k out of $15k Friday on some expiring shit. Spent last $2k on some 4/9 SQ calls that dropped to $306 by Monday morning. That shot up to $28k by close but I didn't sell. Tuesday it dropped to $4k by EOD and I didn't sell. Today it grew from around $4-5k at open and I finally sold it at $38k. I'm retarded at basically every point for not selling earlier, but this one worked out. \n\n1,726% gain total, and I guess 11,772% from Monday morning until I sold. \n\n http://imgur.com/a/3dRpzvD",
        "created_utc": 1586380796,
        "id": "fmtxkop",
        "score": 184,
        "subreddit": "wallstreetbets",
        "created": 1586409596.0
    },
    {
        "author": "bonomo27",
        "body": "Best presidential campaign ever. Vote for the guy that gives you a check with his name on it.",
        "created_utc": 1586948685,
        "id": "fngxm9i",
        "score": 182,
        "subreddit": "wallstreetbets",
        "created": 1586977485.0
    },
    {
        "author": "ToastyBoyxd",
        "body": "i know it is and its working. im dead inside",
        "created_utc": 1586814866,
        "id": "fnbfzrk",
        "score": 174,
        "subreddit": "wallstreetbets",
        "created": 1586843666.0
    },
    {
        "author": "Jagtem",
        "body": "The fact that it works perfectly without any editing, cutting, dubbing, or subtitles is awesome. It really is perfect.",
        "created_utc": 1586826882,
        "id": "fnc1w6r",
        "score": 171,
        "subreddit": "wallstreetbets",
        "created": 1586855682.0
    },
    {
        "author": "bamfalamfa",
        "body": "they absolutely thought they would be able to dump wework on the public. like holy shit it was so obvious it hurt my brain. i think they didnt think the entire investment community would turn on them because so many duds had already been through IPOs",
        "created_utc": 1586802875,
        "id": "fnas649",
        "score": 169,
        "subreddit": "investing",
        "created": 1586831675.0
    },
    {
        "author": "xcentriq18",
        "body": "$10 take it or leave",
        "created_utc": 1587069601,
        "id": "fnmdr8t",
        "score": 168,
        "subreddit": "wallstreetbets",
        "created": 1587098401.0
    },
    {
        "author": "Developer4Diabetes",
        "body": "Am I reading this stuff right?!?! 70% grant which means that's a 70% GIFT?!?! Are you kidding me?! I am fuming! That is far worse than the last crisis! How is that even allowed, I am so angry. Tbh I was fine with stock buybacks, because I thought they would pay the price for it, but now.... we are literally paying their bills for them... that cannot be right",
        "created_utc": 1586909149,
        "id": "fnfjay8",
        "score": 164,
        "subreddit": "investing",
        "created": 1586937949.0
    },
    {
        "author": "thekingoftherodeo",
        "body": "For everyone wondering why the big miss (&amp; you're going to see this with every bank btw).\n\n- It includes the impact of adoption of the new credit loss accounting standard (CECL).\n\n- Day 1 (1/1/20 no COVID) impact goes through retained earnings (i.e. no income statement impact), but subsequent measurement (i.e. 3/31/20 big COVID) goes through income. Hence the massive pop in reserves.\n\n- Key difference between old GAAP and new GAAP is that you must now estimate the lifetime expected credit loss for your loans adjusted for forecasted conditions\n\n- They're likely using a multi scenario weighted model and would have shifted the weightings to reflect the COVID environment; think something like 80-10-10 of most stressed economic environment:moderate stressed economic environment:baseline\n\n- Subsequent Q's won't see as big an income statement impact as the delta between prior Q provision (officially Allowance for Credit Losses) and current Q provision shouldn't be as vast.\n\n- You effectively had a black swan event for this adoption where 1/1/20 (it's effective date), you wouldn't have weighted a stressed economic environment as heavily (if at all, we nearly had the tip in 30,000 DJI almost as recently as Feb), versus 3/31/20 the remeasurement date where you have to account for, well virtually total cessation of normal economic activity.\n\nSo when they speak to building reserves (FASB will have a conniption at that language btw), they've assessed their entire portfolio for lifetime expected credit loss. You see the numbers pop particularly in cards, which are unsecured and your loss given default would to all intents and purposes be 100% vs mortgage loans where you've collateral.\n\nAlso important to bear in mind that since ~2018 the bigger lenders have been keeping higher quality mortgage loans on the books (basically they aren't selling top quality 800 FICO stuff to FNMA FMCC much if at all).\n\nJPM are very well placed to weather this, as they were in 2008. It's a well run shop under Daddy Dimon.\n\n**TL;DR: Watch out for the banks who elect to defer CECL implementation because it likely meant their models adjusted for COVID gave them numbers they didn't want to push through Q1 earnings**\n\n**TL;DR of the TL;DR = Accounting rules fucked EPS in the ass but it shouldn't be as volatile going forward**",
        "created_utc": 1586868133,
        "id": "fndeokh",
        "score": 164,
        "subreddit": "wallstreetbets",
        "created": 1586896933.0
    },
    {
        "author": "bootybootyholeyo",
        "body": "That fuckin grin. His cowboy ass enjoyed it",
        "created_utc": 1586971095,
        "id": "fnhyrmf",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1586999895.0
    },
    {
        "author": "j_kouzmanoff",
        "body": "I was thinking about it, but at $100k I can still make enough from theta to sustain the two businesses I'm running.",
        "created_utc": 1586879576,
        "id": "fndxzom",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1586908376.0
    },
    {
        "author": "IceOmen",
        "body": "Once inflation makes a haircut or a grass cut cost $25 trillion instead of a measly $25, we'll pay it off in no time.",
        "created_utc": 1586817465,
        "id": "fnbl4j3",
        "score": 160,
        "subreddit": "wallstreetbets",
        "created": 1586846265.0
    },
    {
        "author": "toaster32",
        "body": "I remember when Pokemon Go first came out, Nintendo stock spiked even though it had nothing to do with Nintendo.\n\n[Source](https://www.theverge.com/2016/7/25/12269466/nintendo-stock-plunge-pokemon-go) \n\nEdit: added source",
        "created_utc": 1586879438,
        "id": "fndxq8v",
        "score": 158,
        "subreddit": "investing",
        "created": 1586908238.0
    },
    {
        "author": "h0nest_Bender",
        "body": "&gt; Or just dump it into a hole?\n\nThe circle of life.",
        "created_utc": 1587408718,
        "id": "fo09zfz",
        "score": 158,
        "subreddit": "wallstreetbets",
        "created": 1587437518.0
    },
    {
        "author": "Naffdit",
        "body": "What infuriates me about the check process is that adult dependents (ex. college students) or 18-24-year-olds are excluded and that people with 6 figure incomes (say 100k filing independently) in high COL don't get anything. It doesn't make sense to me.",
        "created_utc": 1587018360,
        "id": "fnk8n6o",
        "score": 157,
        "subreddit": "wallstreetbets",
        "created": 1587047160.0
    },
    {
        "author": "manufacture_reborn",
        "body": "I got the call from TD, “are you sure you know what you’re doing?” today.\n\nI told them yes, absolutely, that I’m using a “crowdsourced sentiment aggregating platform” to help make my positioning decisions. They seemed cool with that, and I didn’t have to tell them it was you autists.\n\nI’m working harder to hide WSB from my broker than my wife’s boyfriend was with his other girlfriend.",
        "created_utc": 1586380792,
        "id": "fmtxkew",
        "score": 154,
        "subreddit": "wallstreetbets",
        "created": 1586409592.0
    },
    {
        "author": "rea736",
        "body": "Yeah they already paid it last week. My position was a spy credit spread exp that monday RH was down and I was assigned but they fixed it so I just lost $80. I'm surprised they gave me more then I lost",
        "created_utc": 1586833738,
        "id": "fnccwvl",
        "score": 153,
        "subreddit": "wallstreetbets",
        "created": 1586862538.0
    },
    {
        "author": "MrBroControl",
        "body": "Holy shit whats your next strat so I can copy it and therefore we both lose",
        "created_utc": 1586797206,
        "id": "fnagpva",
        "score": 152,
        "subreddit": "wallstreetbets",
        "created": 1586826006.0
    },
    {
        "author": "_ACompulsiveLiar_",
        "body": "People who say this would lose that 100k on the exact same play, then add 450k back in out of frustration to reverse their play and then lose it all\n\nIt's me. I'm people",
        "created_utc": 1587071939,
        "id": "fnmibg7",
        "score": 149,
        "subreddit": "wallstreetbets",
        "created": 1587100739.0
    },
    {
        "author": "Daveinatx",
        "body": "Is it too late to buy a Hummer?",
        "created_utc": 1587408362,
        "id": "fo09bl8",
        "score": 149,
        "subreddit": "wallstreetbets",
        "created": 1587437162.0
    },
    {
        "author": "Rshackleford22",
        "body": "It doesn't matter what he says. The feds never closed anything down. If you never announce closings, you can't announce openings. It's up to the governors of states. At least 20 states won't be opening up by then.",
        "created_utc": 1587076119,
        "id": "fnmqae8",
        "score": 147,
        "subreddit": "stocks",
        "created": 1587104919.0
    },
    {
        "author": "rtc824",
        "body": "We just hit the top of the bull trap at SPY 273\n\nIf it goes above 273 in the next 30 days I will accept a 6 month ban.\n\n*Edit. Please upvote and make this higher so that the mods see and hold me accountable. I now have skin in the game. Positions? MAR $50p 5/15, AAPL $210p 5/15.",
        "created_utc": 1586294260,
        "id": "fmq7eep",
        "score": 145,
        "subreddit": "wallstreetbets",
        "created": 1586323060.0
    },
    {
        "author": "rmb91896",
        "body": "I did this with calls about a year ago. Applied for 3 loans online with excellent credit. Approved for all 3. 75k. All of it is gone now- credit is destroyed with nothing to show for it.",
        "created_utc": 1586782711,
        "id": "fn9ripa",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1586811511.0
    },
    {
        "author": "leveredlloyd",
        "body": "Thanks Kevin. Now let’s take a look at today’s market movers. It looks like BA continues to sh*t bricks, while TSLA has surprisingly been performing well squeezing out short sellers.... **5 min ad about E-Trade commission free trading, followed by Comcast’s “we’re connecting people all over the world”... Jim, tell us what you’re seeing in rates today... crossing over to you @ricksantelli, let’s look at the 10yr curve, that’s the canary in the coal mine",
        "created_utc": 1586373990,
        "id": "fmtjwm9",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1586402790.0
    },
    {
        "author": "Bananathugg",
        "body": "\"it go up too much so it gotta go down!\"\n\nthis strategy is very smart and has been making bears RICH this month!",
        "created_utc": 1586849868,
        "id": "fncwqac",
        "score": 143,
        "subreddit": "wallstreetbets",
        "created": 1586878668.0
    },
    {
        "author": "REALSTOOPID",
        "body": "JPow has me so twisted this morning red is like when Ramsey Bolton let Theon escape prison and then cut his dick off for actually doing it. And then when he was actually getting rescued he just stayed in his cage because he was trained so well. Thats how I feel right now. This must be another trick",
        "created_utc": 1586949291,
        "id": "fngy856",
        "score": 142,
        "subreddit": "wallstreetbets",
        "created": 1586978091.0
    },
    {
        "author": "Banemorth",
        "body": "What the fuck are we supposed to do about it?  Might as well make the best out of a bad situation.  Ban.",
        "created_utc": 1585770222,
        "id": "fm5c7qj",
        "score": 141,
        "subreddit": "wallstreetbets",
        "created": 1585799022.0
    },
    {
        "author": "totally_not_the_fbi2",
        "body": "It was me my bad, was cashing out to buy some toilet paper",
        "created_utc": 1585768360,
        "id": "fm58npi",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1585797160.0
    },
    {
        "author": "Abstract_Algebruh",
        "body": "I know for a fact some retard on this sub bought a crude contract and has no idea they have to store the barrels. Its going to be an amazing post when it happens",
        "created_utc": 1587413702,
        "id": "fo0iezj",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1587442502.0
    },
    {
        "author": "Andrew_the_giant",
        "body": "In the last few weeks /months it's really gone down hill. I feel almost a sense of enlightenment without it. Almost like I can think for myself and play smart trades and actually make money.",
        "created_utc": 1586305801,
        "id": "fmqs095",
        "score": 138,
        "subreddit": "options",
        "created": 1586334601.0
    },
    {
        "author": "CCrest182",
        "body": "It will, however, go up 30 bucks in one day.",
        "created_utc": 1586389177,
        "id": "fmudcji",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1586417977.0
    },
    {
        "author": "Thenateo",
        "body": "Rip oil princes u had fun while it lasted",
        "created_utc": 1587407448,
        "id": "fo07jh5",
        "score": 135,
        "subreddit": "wallstreetbets",
        "created": 1587436248.0
    },
    {
        "author": "SlowJamm",
        "body": "We just  gave billionaires and the stock market more money than this bill, people are fine with that but not giving it to the taxpayers? I don't get it?",
        "created_utc": 1587012611,
        "id": "fnk1x77",
        "score": 135,
        "subreddit": "investing",
        "created": 1587041411.0
    },
    {
        "author": "WheatlyWoodson",
        "body": "I invested in the \"old\" Zoom at the \"new\" Zoom's IPO last year. Bought around $2, sold just below $6. Pocketed about $4k. \n\nI considered doing it again at the beginning of this outbreak, but figured lightning couldn't strike twice. I was dead wrong.",
        "created_utc": 1586885445,
        "id": "fne9kqp",
        "score": 135,
        "subreddit": "investing",
        "created": 1586914245.0
    },
    {
        "author": "JPCary",
        "body": "So he has the power to open the country, not the governors, but when it comes to shelter in place, only the governors have the power to do that. Makes tons of sense. Calls on $CORONAWAVE2\n\n\nWHO officials say its unclear whether coronavirus patients develop immunity https://www.cnbc.com/2020/04/13/who-officials-say-its-unclear-whether-recovered-coronavirus-patients-are-immune-to-second-infection.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard",
        "created_utc": 1586792485,
        "id": "fna7ifa",
        "score": 133,
        "subreddit": "wallstreetbets",
        "created": 1586821285.0
    },
    {
        "author": "retal1ator",
        "body": "At the next bad news it is very possible that we have another flash crash. The market is waaaay more wild and reactive than decades ago due to manipulation and algos.",
        "created_utc": 1586994965,
        "id": "fnja9r7",
        "score": 133,
        "subreddit": "StockMarket",
        "created": 1587023765.0
    },
    {
        "author": "AKA_Wildcard",
        "body": "Glad I'm not the only one who gets it. I don't listen to these \"advisers\" anymore. I read my own data and come to my own conclusions, and I recommend that others do the same.",
        "created_utc": 1586790841,
        "id": "fna4gcw",
        "score": 133,
        "subreddit": "investing",
        "created": 1586819641.0
    },
    {
        "author": "redditispolitical",
        "body": "Holy shit you got fucked. Those puts must have been so ITM if you got it before the stock stopped trading. Man that is some real bullshit that RH screws you over like that.",
        "created_utc": 1586808065,
        "id": "fnb2hyh",
        "score": 133,
        "subreddit": "options",
        "created": 1586836865.0
    },
    {
        "author": "theycallmeryan",
        "body": "I didn’t let it happen, just a cool side effect. I like the positions I’m in right now so I have no reason to sell them.",
        "created_utc": 1587591444,
        "id": "fo87sf5",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1587620244.0
    },
    {
        "author": "GoldenKaze",
        "body": "Central bankers are all around the world are hoping that that liquidity doesn't end up in the supermarket. Traditionally QE has only gone to the banks but now they are you spending it to give free shit to people so who knows if inflation in really dead",
        "created_utc": 1586866844,
        "id": "fndd0ti",
        "score": 130,
        "subreddit": "wallstreetbets",
        "created": 1586895644.0
    },
    {
        "author": "pretentiousRatt",
        "body": "Not that it doesn't work, it is a straight up lie that is being parroted by bullshit neocons. \nThey scream deregulation and free market when things are good and expect/demand socialism when things get fucked up.",
        "created_utc": 1586463909,
        "id": "fmxfaet",
        "score": 128,
        "subreddit": "wallstreetbets",
        "created": 1586492709.0
    },
    {
        "author": "LaughingStonks",
        "body": "Im in this post and I dont like it",
        "created_utc": 1586898434,
        "id": "fnez05p",
        "score": 127,
        "subreddit": "wallstreetbets",
        "created": 1586927234.0
    },
    {
        "author": "tea_anyone",
        "body": "I'm going to continue to do detailed technical analysis and then burn it, sacrifice a goat onto the ashes and then whichever ticker the dried blood and Ash looks like the most buy calls on.",
        "created_utc": 1586869954,
        "id": "fndh91s",
        "score": 127,
        "subreddit": "investing",
        "created": 1586898754.0
    },
    {
        "author": "Potpourrri",
        "body": "Holy fucking christ lmao\n\n\"Mommy can I sell my options?\"\n\n\"I'll think about it\"",
        "created_utc": 1586211353,
        "id": "fmmsqju",
        "score": 126,
        "subreddit": "wallstreetbets",
        "created": 1586240153.0
    },
    {
        "author": "Unhinged_Goose",
        "body": "It is a bull trap, we get it.  Fuck, why did you use so may words?",
        "created_utc": 1586402364,
        "id": "fmuzf2c",
        "score": 126,
        "subreddit": "wallstreetbets",
        "created": 1586431164.0
    },
    {
        "author": "Blackwhitehorse",
        "body": "Sub is starting to feel like it did right before the market crashed, getting gayja vu",
        "created_utc": 1586900280,
        "id": "fnf2n33",
        "score": 126,
        "subreddit": "wallstreetbets",
        "created": 1586929080.0
    },
    {
        "author": "ravocean",
        "body": "Same. My friend from Switzerland is an international student too, parents are rich af. He worked in campus during the summer and he received $1,200 today while chilling in his waterfront house back home.\nI'm a US resident, also a student and I'm not receiving it. It's absolutely retarded.",
        "created_utc": 1587019360,
        "id": "fnk9q8e",
        "score": 125,
        "subreddit": "wallstreetbets",
        "created": 1587048160.0
    },
    {
        "author": "QuakerQuaker",
        "body": "Hold, definitely hold. 6/30 gives you so much time. A lot of actually intelligent people still believe the real bottom is coming. All it takes is one algo to pick up some trend and sell, then everything comes crashing down. Good luck, man. Be good to yourself, brother.",
        "created_utc": 1586395867,
        "id": "fmup47c",
        "score": 124,
        "subreddit": "wallstreetbets",
        "created": 1586424667.0
    },
    {
        "author": "l0gicgate",
        "body": "Timeline of events:\n- Started the sub\n- Left for years / minimal activity\n- Once sub was popular he came back and demodded / banned people\n- Pushed his stupid fucking book trying to make a buck\n- Affiliated himself with True Trading Group and attempted to put on a Trading E-Sports type event with outrageous buy-in and shady prize scheme\n- Made fake account u/WSBGod and made some outlandish posts that got us on r/all and then an influx of retards came so he can promote his garbage to them\n- Changed the original logo/banner and removed the original Discord server to promote his\n- Disgruntled mods were somehow able to plan a coup with reddit mods to take him down and it brings us to today!",
        "created_utc": 1586387682,
        "id": "fmuan2v",
        "score": 394,
        "subreddit": "wallstreetbets",
        "created": 1586416482.0
    },
    {
        "author": "avgazn247",
        "body": "Nah he doing big brain moves. Don’t have to pay taxes on two mil if u lose half of it",
        "created_utc": 1586215370,
        "id": "fmn009x",
        "score": 291,
        "subreddit": "wallstreetbets",
        "created": 1586244170.0
    },
    {
        "author": "wadewannabe3",
        "body": "If SPY closes under 244 I will chop my dick off and eat it.",
        "created_utc": 1586390661,
        "id": "fmufznz",
        "score": 210,
        "subreddit": "wallstreetbets",
        "created": 1586419461.0
    },
    {
        "author": "TTUnathan",
        "body": "Calls it is then.",
        "created_utc": 1586395772,
        "id": "fmuoye9",
        "score": 204,
        "subreddit": "wallstreetbets",
        "created": 1586424572.0
    },
    {
        "author": "rushinrussia",
        "body": "If Gordon calls this market 3 days in a row (including today's call, so 2 more) can I buy him a piece of furniture or a bulb or something. Mods hold me to it",
        "created_utc": 1585770960,
        "id": "fm5dmoq",
        "score": 198,
        "subreddit": "wallstreetbets",
        "created": 1585799760.0
    },
    {
        "author": "BingBong-42",
        "body": "i legit think gordon is probably smarter than everyone here so i'll trust it",
        "created_utc": 1585770906,
        "id": "fm5dj04",
        "score": 189,
        "subreddit": "wallstreetbets",
        "created": 1585799706.0
    },
    {
        "author": "74FFY",
        "body": "Deposited and lost $13k out of $15k Friday on some expiring shit. Spent last $2k on some 4/9 SQ calls that dropped to $306 by Monday morning. That shot up to $28k by close but I didn't sell. Tuesday it dropped to $4k by EOD and I didn't sell. Today it grew from around $4-5k at open and I finally sold it at $38k. I'm retarded at basically every point for not selling earlier, but this one worked out. \n\n1,726% gain total, and I guess 11,772% from Monday morning until I sold. \n\n http://imgur.com/a/3dRpzvD",
        "created_utc": 1586380796,
        "id": "fmtxkop",
        "score": 184,
        "subreddit": "wallstreetbets",
        "created": 1586409596.0
    },
    {
        "author": "manufacture_reborn",
        "body": "I got the call from TD, “are you sure you know what you’re doing?” today.\n\nI told them yes, absolutely, that I’m using a “crowdsourced sentiment aggregating platform” to help make my positioning decisions. They seemed cool with that, and I didn’t have to tell them it was you autists.\n\nI’m working harder to hide WSB from my broker than my wife’s boyfriend was with his other girlfriend.",
        "created_utc": 1586380792,
        "id": "fmtxkew",
        "score": 154,
        "subreddit": "wallstreetbets",
        "created": 1586409592.0
    },
    {
        "author": "rtc824",
        "body": "We just hit the top of the bull trap at SPY 273\n\nIf it goes above 273 in the next 30 days I will accept a 6 month ban.\n\n*Edit. Please upvote and make this higher so that the mods see and hold me accountable. I now have skin in the game. Positions? MAR $50p 5/15, AAPL $210p 5/15.",
        "created_utc": 1586294260,
        "id": "fmq7eep",
        "score": 145,
        "subreddit": "wallstreetbets",
        "created": 1586323060.0
    },
    {
        "author": "leveredlloyd",
        "body": "Thanks Kevin. Now let’s take a look at today’s market movers. It looks like BA continues to sh*t bricks, while TSLA has surprisingly been performing well squeezing out short sellers.... **5 min ad about E-Trade commission free trading, followed by Comcast’s “we’re connecting people all over the world”... Jim, tell us what you’re seeing in rates today... crossing over to you @ricksantelli, let’s look at the 10yr curve, that’s the canary in the coal mine",
        "created_utc": 1586373990,
        "id": "fmtjwm9",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1586402790.0
    },
    {
        "author": "Banemorth",
        "body": "What the fuck are we supposed to do about it?  Might as well make the best out of a bad situation.  Ban.",
        "created_utc": 1585770222,
        "id": "fm5c7qj",
        "score": 141,
        "subreddit": "wallstreetbets",
        "created": 1585799022.0
    },
    {
        "author": "totally_not_the_fbi2",
        "body": "It was me my bad, was cashing out to buy some toilet paper",
        "created_utc": 1585768360,
        "id": "fm58npi",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1585797160.0
    },
    {
        "author": "Andrew_the_giant",
        "body": "In the last few weeks /months it's really gone down hill. I feel almost a sense of enlightenment without it. Almost like I can think for myself and play smart trades and actually make money.",
        "created_utc": 1586305801,
        "id": "fmqs095",
        "score": 138,
        "subreddit": "options",
        "created": 1586334601.0
    },
    {
        "author": "CCrest182",
        "body": "It will, however, go up 30 bucks in one day.",
        "created_utc": 1586389177,
        "id": "fmudcji",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1586417977.0
    },
    {
        "author": "Potpourrri",
        "body": "Holy fucking christ lmao\n\n\"Mommy can I sell my options?\"\n\n\"I'll think about it\"",
        "created_utc": 1586211353,
        "id": "fmmsqju",
        "score": 126,
        "subreddit": "wallstreetbets",
        "created": 1586240153.0
    },
    {
        "author": "danny_",
        "body": "It is just me, or is multiple phone calls not quite as bad as $25k lost due to flagged/delayed trades.",
        "created_utc": 1586222009,
        "id": "fmnb0cd",
        "score": 116,
        "subreddit": "investing",
        "created": 1586250809.0
    },
    {
        "author": "Mail_Order_Lutefisk",
        "body": "That is why it is called Wall Street Bets and not Wall Street Dollar Cost Averaging So I Can Drive a Fucking Toyota Camry Forever.",
        "created_utc": 1586293977,
        "id": "fmq6via",
        "score": 111,
        "subreddit": "wallstreetbets",
        "created": 1586322777.0
    },
    {
        "author": "jay9909",
        "body": "&gt; I think they only the owner has is if you use it for commercial use without his permission.\n\n/r/IHadAStroke",
        "created_utc": 1586371611,
        "id": "fmtf0ss",
        "score": 107,
        "subreddit": "wallstreetbets",
        "created": 1586400411.0
    },
    {
        "author": "klept0nic",
        "body": "To a rational human it does but I've found that most people on reddit have a victim mentality and think the world is rigged and out to get them.",
        "created_utc": 1586383307,
        "id": "fmu2f3f",
        "score": 99,
        "subreddit": "stocks",
        "created": 1586412107.0
    },
    {
        "author": "llenders97",
        "body": "i usually sell once i hit 10,000% gains, otherwise just let it expire worthless",
        "created_utc": 1585853564,
        "id": "fm8pedz",
        "score": 97,
        "subreddit": "wallstreetbets",
        "created": 1585882364.0
    },
    {
        "author": "MEGAQUIB",
        "body": "We stopped getting tendies when they took our boy off the logo and made it that caillou looking cuck.",
        "created_utc": 1585863489,
        "id": "fm9827o",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1585892289.0
    },
    {
        "author": "Mooonbound",
        "body": "Why tf is this thread not pinned?  Making me search for it",
        "created_utc": 1586383832,
        "id": "fmu3eln",
        "score": 93,
        "subreddit": "wallstreetbets",
        "created": 1586412632.0
    },
    {
        "author": "SuperomegaOP",
        "body": "Oh shit is that how it works?",
        "created_utc": 1586216370,
        "id": "fmn1pt0",
        "score": 91,
        "subreddit": "wallstreetbets",
        "created": 1586245170.0
    },
    {
        "author": "the_rabble_alliance",
        "body": "Overheard in a basement bedroom after eating tendies:\n\n\"WSB got me.\" Jartek said of WSB. \"That f***ing WSB boomed me.\"\n\nLeBron added, \"They're so autistic,\" repeating it four times.\n\nLeBron then said he wanted to add WSB to the list of subreddits he would be banned from this summer.",
        "created_utc": 1586369729,
        "id": "fmtb0jo",
        "score": 89,
        "subreddit": "wallstreetbets",
        "created": 1586398529.0
    },
    {
        "author": "Drupain",
        "body": "\"vanilla trades\"\n\nI only do BDSM trading, once you've tried it your life will never be the same. You won't even care how much money you lose.",
        "created_utc": 1586217486,
        "id": "fmn3lji",
        "score": 83,
        "subreddit": "investing",
        "created": 1586246286.0
    },
    {
        "author": "BestNarcissist",
        "body": "Sample size of three days during a black swan event?\n\nInteresting, but I'd like to see you keep running at least one of the bots to see how it does long-term.",
        "created_utc": 1585774910,
        "id": "fm5l0c6",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1585803710.0
    },
    {
        "author": "I_have_a_dog",
        "body": "We are at the start of 15 days to slow the spread. We must use these 30 days wisely. Once we have done our part and stayed isolated for 45 days, we can begin to go back to normal. 60 days may seem like a long time, but it will go quickly. After the original 90 days  of isolation is over, we can reevaluate the need to continue this lockdown past 120 days. \n\n-Mike Pence",
        "created_utc": 1586300243,
        "id": "fmqign1",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1586329043.0
    },
    {
        "author": "Unstoppable001",
        "body": "Delete this post before you jinx it",
        "created_utc": 1585856601,
        "id": "fm8v4wg",
        "score": 77,
        "subreddit": "wallstreetbets",
        "created": 1585885401.0
    },
    {
        "author": "reposado",
        "body": "Seriously. 65% drop and \"WhY isNT IT taNKing?\"",
        "created_utc": 1586390432,
        "id": "fmufkxb",
        "score": 77,
        "subreddit": "stocks",
        "created": 1586419232.0
    },
    {
        "author": "passwordisnotorange",
        "body": "Are you saying that YouInvest was responsible for 9/11? I hadn't heard that before, but I suppose it does sound plausible.",
        "created_utc": 1586212530,
        "id": "fmmuvdu",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1586241330.0
    },
    {
        "author": "Unhinged_Goose",
        "body": "This is beyond retarded.\n\nI love it.",
        "created_utc": 1586294348,
        "id": "fmq7ka4",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1586323148.0
    },
    {
        "author": "xblackout_",
        "body": "It's true I saw it happen",
        "created_utc": 1585777724,
        "id": "fm5q3i0",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1585806524.0
    },
    {
        "author": "bbues",
        "body": "u/Variation-Separate Don't get too discouraged bro that move at the end was absolute bullshit. Really enjoy your guidance on the market. Would love to keep hearing/studying it. Don't let the kids who don't understand that it's not possible to predict every single unknown fucking factor (fed manipulation) and get it right 100% of the time get you down.",
        "created_utc": 1585869243,
        "id": "fm9i6w1",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1585898043.0
    },
    {
        "author": "joyful-",
        "body": "Last time Ray Dalio called a depression publicly and committed his funds to his prediction, he was burned VERY hard (basically went bankrupt). He calls it the defining moment for his career because he learned humility, etc, and he talks about it often. I think he has to be quite confident with a lot of data backing him up for him to call out a depression after what he went through last time.",
        "created_utc": 1586385903,
        "id": "fmu7apa",
        "score": 71,
        "subreddit": "wallstreetbets",
        "created": 1586414703.0
    },
    {
        "author": "Fizzy_T",
        "body": "Come to think of it I don't have a point. Carry on.",
        "created_utc": 1585772072,
        "id": "fm5foe1",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1585800872.0
    },
    {
        "author": "edge13x",
        "body": "So.. Real talk here, guys. I think this is okay to do here, because it's not the daily thread. \n\nI'm pretty new to WSB, but I have been trading [badly] for a long time, and I have to say it's felt like treading water. I used to think that unless I was some trust fund baby with 2mil in cash waiting to be invested, it was gonna be the long haul for me.\n\nThen I found WSB, and it was great, but with each gain, there'd be things I couldn't control, or I'd chase the advice of people who didn't really do their DD. I was convinced that with all the bad news we were getting, that stocks would plummet last week, as I learned the hard way something I [and I would imagine, all of us] already knew -- the market doesn't do what it is supposed to, it does what the MMs want it to do, and in the process it takes advantage of the common trader.\n\nBut every once in a while, we get someone like /u/Variation-Separate who not only takes the time to share his secrets, but breaks it down for us, interacts with the community, and even fucking gives us confidence when the market seemingly isn't following the prophecy. He doesn't have to do any of this.\n\nI cannot do what he does as well as he does it. Not yet. But I am thankful for the knowledge I've gained, thankful for the tendies, and thankful for having my faith in good people and challenging corrupt systems resurrected.\n\nMuch love, OP. It's a rough time for a lot of people out there. You're a godsend.",
        "created_utc": 1585773213,
        "id": "fm5hssv",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1585802013.0
    },
    {
        "author": "SignalEngine",
        "body": "What are you gonna do if it drills tomorrow and friday? Surprisingly paper hands from a guy with such massive balls.",
        "created_utc": 1585773768,
        "id": "fm5iuo0",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1585802568.0
    },
    {
        "author": "tstehler1",
        "body": "I saw Questrade at a grocery store in Los Angeles yesterday. I told him how cool it was to meet him in person, but I didn’t want to be a douche and bother him and ask him for photos or anything.\nHe said, “Oh, like you’re doing now?”\nI was taken aback, and all I could say was “Huh?” but he kept cutting me off and going “huh? huh? huh?” and closing his hand shut in front of my face. I walked away and continued with my shopping, and I heard him chuckle as I walked off. When I came to pay for my stuff up front I saw him trying to walk out the doors with like fifteen Milky Ways in his hands without paying.\nThe girl at the counter was very nice about it and professional, and was like “Sir, you need to pay for those first.” At first he kept pretending to be tired and not hear her, but eventually turned back around and brought them to the counter.\nWhen she took one of the bars and started scanning it multiple times, he stopped her and told her to scan them each individually “to prevent any electrical infetterence,” and then turned around and winked at me. I don’t even think that’s a word. After she scanned each bar and put them in a bag and started to say the price, he kept interrupting her by yawning really loudly",
        "created_utc": 1586384756,
        "id": "fmu548n",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1586413556.0
    },
    {
        "author": "mrpoodles11",
        "body": "All I know is that if the market keeps being pumped up like this, when the crash does come down the road it is going to be absolutely fucking apocalyptic. I’m a gay bear for sure but I think downturns are honestly a healthy part of the business cycle. The idea that we should stop any stock market downturn with monetary policy is pretty crazy to me, but I’m also autistic as shit so what do I know.\n\nTL;DR buy a nice rifle, armor plates, and night vision goggles for long-term investments.",
        "created_utc": 1586207278,
        "id": "fmml5gv",
        "score": 67,
        "subreddit": "wallstreetbets",
        "created": 1586236078.0
    },
    {
        "author": "theknowndude",
        "body": "this will probably be the best advice i ever gave:\n\nyou dont want to hold jnug for longer than a week, in fact don‘t buy it at all",
        "created_utc": 1585783286,
        "id": "fm5zr5j",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1585812086.0
    },
    {
        "author": "dbgtboi",
        "body": "You want to know what would scare this market more than 100% unemployment and banks collapsing? The fed announcing that unlimited QE is over, we would easily hit a level 2 circuit breaker, and maybe for the first time in history level 3. Nothing scares the markets more than the fed saying they won't prop it up, look back at the end of 2018.",
        "created_utc": 1586388747,
        "id": "fmuckij",
        "score": 65,
        "subreddit": "investing",
        "created": 1586417547.0
    },
    {
        "author": "rusty_kx",
        "body": "Hey idiot, this virus grows exponentially and estimations are largely based on current data. The shit changes as it goes.",
        "created_utc": 1585857558,
        "id": "fm8wxr5",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1585886358.0
    },
    {
        "author": "4P87xfBDHcfhcMwI",
        "body": "And put it on pornhub?",
        "created_utc": 1586389361,
        "id": "fmudohj",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1586418161.0
    },
    {
        "author": "Variation-Separate",
        "body": "Thanks. I can swing the momentum, but not everyone can day trade. I want to show that having a plan and strategy, and sticking to it is the most important. Otherwise your conviction at the critical moment will always crumble.",
        "created_utc": 1586197436,
        "id": "fmm28sn",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1586226236.0
    },
    {
        "author": "obsessedwithstocks",
        "body": "Guys it’s simple. Just buy a call before it goes up, and buy puts before it goes down.",
        "created_utc": 1585944362,
        "id": "fmcexsx",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1585973162.0
    },
    {
        "author": "edge13x",
        "body": "Reading a lot of comments from concerned people. Very understandable. I'm right there with all of you. I've got a bit riding on this, a lot of which will die if a viable downtrend doesn't start before May and I can't adjust. I don't subscribe to telling people diamond hands, or blindly worshipping VS. We all have to adapt. But I am incredibly appreciative for the time he's put into these posts and educating us.\n\nThat said, we have no idea yet what will actually happen long term. /u/Variation-Separate has put together a really compelling plan. He didn't have to share it. No one has to follow it. But if you, like me, believe that there is validity and truth in his analysis, then do your own DD to embrace that vibe. Yesterday, people were freaking out in the first two hours of intraday when there was no drop, then we plummeted. Today, we flirted with 252 and are at risk of another leg up. If in the last two days, you have decided that this uptrend in the market is enough to call it quits, no one can blame you, but I would argue, maybe VS's posts aren't for you. \n\nI am a bear rn. I'm a bear not just because I have positions that reflect it -- I truly believe we're in a bad spot, and corporations, MMs, the Fed are being really irresponsible right now.  We're being set up for some horrible economic rebuilding in the 2020s. The longer the market waits to reflect this, the more fucked ordinary people are when they do. They don't have our best interests in mind. Deep down, I want us all to get through this and come out on top.\n\nI hope I'm not foolish in thinking that, collectively, we have the tools and minds to figure this out and at least make a little money before things get really bad. It's a difficult time to have conviction, but that's why I'm here in this thread (and no longer checking the dailies). Keep strong, fellow autists. Let's find patience and figure out what the next move is.",
        "created_utc": 1585865530,
        "id": "fm9br5o",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1585894330.0
    },
    {
        "author": "hamplane",
        "body": "I'm not sure what's with all the salt in this thread, u/variation-separation has been right all along.\n\n1) last Thursday/Friday were the \"biggest trading days of the year\" because we were going to see if we would break through 245 (spoiler, we didn't) and the way I read it, was that if we didn't, we would be due for a big bounce up to retest 265....literally exactly what happened today\n\n2) now the big test is if we will break through 267 (a lot of numbers between 265 and 270 have been tossed out). If we do, expect to continue rallying up and cancel the bear market, if not we'll test 245 again\n\nEveryone, this guy is a gift. Dont ruin this for us and make him run off to top secret elite web, I dont know if I can last if it goes back to being 100% mouth breathers in here instead of 99%",
        "created_utc": 1586204416,
        "id": "fmmfogx",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1586233216.0
    },
    {
        "author": "SJ_Shark_Byte",
        "body": "Disney $130c 4/17 got it",
        "created_utc": 1585866322,
        "id": "fm9d5l0",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1585895122.0
    },
    {
        "author": "redisamyth",
        "body": "Puts it is!",
        "created_utc": 1585863670,
        "id": "fm98dl2",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1585892470.0
    },
    {
        "author": "yaohyuri",
        "body": "It's pretty much much just people bitching about options not printing, hardly anything good anymore. It got to big to quick",
        "created_utc": 1586306053,
        "id": "fmqsfcj",
        "score": 56,
        "subreddit": "options",
        "created": 1586334853.0
    },
    {
        "author": "Life-Observer",
        "body": "market doesn’t care bro. it will just continue to go up. there isn’t any risk or consequences anymore just up.",
        "created_utc": 1586374130,
        "id": "fmtk6yq",
        "score": 55,
        "subreddit": "investing",
        "created": 1586402930.0
    },
    {
        "author": "Ijustquaffed",
        "body": "If tomorrow is green I am selling no matter what for a 95% loss. I can't do it anymore. I can't. I won't.  \n\n*Proceeds to open new retarded positions*",
        "created_utc": 1586207142,
        "id": "fmmkwfn",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1586235942.0
    },
    {
        "author": "lightbeersucks",
        "body": "Unlimited QE and a president pumping the market with false information = rigged\n\nAlso, go educate yourself. It’s very basic finance theory that market are irrational. It might actually be the first they that they say to you in your first day in a fucking finance course.",
        "created_utc": 1585855140,
        "id": "fm8seh6",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1585883940.0
    },
    {
        "author": "MortimerMcMire",
        "body": "over ten million dollars if SPY hits $10 tomorrow\n\nabout $3k if it doesnt",
        "created_utc": 1585771953,
        "id": "fm5fgij",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1585800753.0
    },
    {
        "author": "HinduHamma",
        "body": "Someone gets it. \n\nMarkets dump on uncertainty. That’s a fact of life. Right now there is certainty that this will hurt the economy in the short term . That’s it. We all know record unemployment. We all know companies are guiding down. \n\nAnd it’s only going to last a few quarters to a year maybe. We don’t even need a vaccine  but if one comes to life, great.. Hell we don’t even have one for the flu. Shots don’t do much. Last I checked people still die every year from flu season. \n\nMarket is moving as if this is a short term concern. Which is it. Bears want to believe the sky is falling and the world is going to stay on fire for a long time. When that becomes reality the market will price it in. Right now it ain’t a reality. \n\nRight now there’s no new uncertainty (besides oil drama but that’s a different narrative). But there is more $$ in the system. And that cash is to go somewhere. Stocks are a pretty fucking good place for it to go compared to the other shitty options (bonds, gold, oil, sitting in cash , etc)\n\nThat’s all there is to it. Money supply bigger. Money had to be allocated somewhere. The folks who get to play with this $$ are throwing it into the market. The end. You don’t get to decide where it goes. I know some of you think it’s unwise for it to go into stocks lol. \n\nGood luck on telling them they should pull out and be scared lol. I’m sure they wanna listen to redditors who snort zerohedge articles for breakfast.",
        "created_utc": 1586381080,
        "id": "fmty4l2",
        "score": 53,
        "subreddit": "investing",
        "created": 1586409880.0
    },
    {
        "author": "bluster_cretin",
        "body": "Can confirm. Saw it on reddit.",
        "created_utc": 1585780688,
        "id": "fm5vbnd",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1585809488.0
    },
    {
        "author": "Painpita",
        "body": "So your plan is to sell SPY at the bottom that you don't know, then buy calls for a snap back with a strike price unknown with a upper resistance that you don't know, and make profit out of it?\n\n&amp;#x200B;\n\nSeems bulletproof.",
        "created_utc": 1585799914,
        "id": "fm6psju",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1585828714.0
    },
    {
        "author": "scrapin_by",
        "body": "Say it with me....\n\n“MARKETS ARE FORWARD LOOKING”\n\nRecent data is indicating the curve may be flattening and measures are working. This on top of literally trillions of dollars in stimulus is whats causing confidence to come back again. \n\nNow the market could be wrong, we could double dip and covid19 might take off again.",
        "created_utc": 1586371437,
        "id": "fmtennx",
        "score": 50,
        "subreddit": "CanadianInvestor",
        "created": 1586400237.0
    },
    {
        "author": "PlayFree_Bird",
        "body": "I mean, this is all fine and well and you make some good points, but like so many of these posts lately, it's missing the most important paragraph at the end:\n\n\"Therefore, as an investor, you should...\"\n\nThis sub is about investing and the people here are interested in taking their available money and using it to maximize returns in the long run.  I suppose I just don't see the point of all these posts that all lay out some case for a massive correction or reset or collapse or depression without mentioning what the prudent course forward should be for the average person.\n\nSo, what's the play here?  Sit around with one hand on your gun and the other on your stack of cash waiting for the \"Big One\" to bring the world to its knees so that we can say, \"I told you so\"?  As somebody in another thread said, we can all play armchair analyst and try to figure out why the market isn't behaving the way we expected (or wanted it to), but you can only do that retrospectively.  By the time you figure out why the market is up 25% from two weeks ago, it's already up.  \n\nMaybe the market is due for another dive, maybe not.  But, what should we be waiting for?  We need a conclusion to your thesis here.  \"Therefore, you should...\"",
        "created_utc": 1586378554,
        "id": "fmtt4wz",
        "score": 49,
        "subreddit": "investing",
        "created": 1586407354.0
    },
    {
        "author": "iRelapse",
        "body": "Oh holy shit. I did not realise it was Friday, fucking looks like I'm holding all fucking weekend.\n\nGod damn quarantine fucking with my brain, not knowing what fucking day it is, God damn it.",
        "created_utc": 1585944273,
        "id": "fmcerza",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1585973073.0
    },
    {
        "author": "g____19",
        "body": "My lame buddy was like “brooo you need to go to r / slash / wallstreetbets I just found it and it’s fucking sooo funny brooo”\n\nSo if you see this Dan fuck you, ps your sister is pretty hot and keeps texting me late at night",
        "created_utc": 1585883024,
        "id": "fma3oep",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1585911824.0
    },
    {
        "author": "ghasp",
        "body": "To all those worried: I don't believe that VS meant that the direction of this market depends on today's actions alone. He is saying that there is major support point around SPY 248 - if the market lands above 252, it signals an upward movement to 263 which, if broken, means we are going to 270. If we hit 270, we are going to 300. It would be a sharper \"V\" shape recovery. \n\nTomorrow, or even next week, it is possible to do battle at 248 and win and signal a downward movement towards 231. Here we get into a faster free-fall.\n\nIt looks like a bear flag is happening on SPY and it is possible that the movement down is an escalator. If SPY breaks 263, the bear flag is pretty invalid IMO. VIX would mellow and we could reach the goal, but with more sideways trading (drawn out over months).\n\nCorrect or comment, please\n\nEdit: could also be other continuation patterns, but this theory more aligns with a quicker drop, like the bear flag...",
        "created_utc": 1585875178,
        "id": "fm9rw46",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1585903978.0
    },
    {
        "author": "wolfffman80",
        "body": "I’m with you, I honestly feel like if I sell the tsunami down will be the next day.  How can the market be roaring, it is just nonsense",
        "created_utc": 1586367672,
        "id": "fmt6k67",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1586396472.0
    },
    {
        "author": "EquivalentSelection",
        "body": "I know it might be a totally wild idea...but it just might work.  Brace yourselves, because this could blow your mind.\n\nCreate a new account.\n\nI know, I know... you're going to tell me that it's just not the same.  I know.  That's why it's called a \"new account\".\n\nYour new name shall be SpeaksInBooleansTrue.  You'll get your karma back - you're a hero now.  Nothing but upvotes for you no matter what you say.  You can kill babies and you're still getting upvotes.",
        "created_utc": 1586388131,
        "id": "fmubgp3",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1586416931.0
    },
    {
        "author": "SHITPOST_CENTRAL",
        "body": "My CEO scheduled 1 on 1 meetings with everyone in my department for this afternoon. It was nice knowing u bois",
        "created_utc": 1585772574,
        "id": "fm5glyr",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1585801374.0
    },
    {
        "author": "Posrover",
        "body": "Relax man. Go have a beer or two and check back tomorrow. I’ve seen plenty of these panic posts and it’s something screwy about how it appears right after it expires.",
        "created_utc": 1586381447,
        "id": "fmtyuad",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1586410247.0
    },
    {
        "author": "never_fucking_giveup",
        "body": "Holy shit it went tits up?",
        "created_utc": 1586393181,
        "id": "fmukha6",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1586421981.0
    },
    {
        "author": "kinzaman",
        "body": "Honestly, this. The large players in the market could make SPY go to 350 tomorrow if they wanted to. The market doesn’t reflect fundamentals any more, it’s just a bunch of computers calculating the optimal way to move prices around to take money away from suckers like us.\n\nThe bad news will continue to pile on, day after day and SPY will continue to go up. Then one day, for no discernible reason, it will drop 15%. It won’t make sense to any of us, but someone with deep pockets will profit greatly from it.",
        "created_utc": 1586386036,
        "id": "fmu7jun",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1586414836.0
    },
    {
        "author": "Variation-Separate",
        "body": "I said it opens up 300. But they're squeezing everyone so hard. \n\nThursday will sell off. The following weeks will be blood baths.",
        "created_utc": 1586218308,
        "id": "fmn4yli",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1586247108.0
    },
    {
        "author": "FuckThisSite2020",
        "body": "&gt; Cuban also said the pandemic will end up improving capitalism with companies putting employees first.\n\nLmao, suuuuure it will",
        "created_utc": 1586380764,
        "id": "fmtxih4",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1586409564.0
    },
    {
        "author": "Dildobagginz6969",
        "body": "My favorite thing to do in Vegas.  Get my money back.  It always works out so well.",
        "created_utc": 1586214823,
        "id": "fmmz28u",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1586243623.0
    },
    {
        "author": "pie-man",
        "body": "i bet carol baskin had something to do with it",
        "created_utc": 1586316928,
        "id": "fmr98pt",
        "score": 44,
        "subreddit": "investing",
        "created": 1586345728.0
    },
    {
        "author": "Variation-Separate",
        "body": "Yep, you got it. Close under 265.",
        "created_utc": 1586203253,
        "id": "fmmdead",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1586232053.0
    },
    {
        "author": "TriHardSlapper123",
        "body": "I'll take it in cash and buy ice cream for everyone 🍦",
        "created_utc": 1586388925,
        "id": "fmucw2m",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1586417725.0
    },
    {
        "author": "Variation-Separate",
        "body": "First, I said oil would gap down and most likely pull equities. It didn't pull equities and we had divergence.\n\nSecond, I said there would be a sell off on Thursday into close since no one really wants to hold for the long weekend.",
        "created_utc": 1586220823,
        "id": "fmn94cj",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1586249623.0
    },
    {
        "author": "Adios_numero_two",
        "body": "For any bears out there dude I feel you. Shits hit us all in different ways. My parents entrusted our family business accounts to me since I’m getting old enough to learn the ropes to take over one day but they’ve been struggling to keep the business afloat because they lack the cash flow or funds to storm the pandemic weather.\n\n\nThey told me if there’s any way I can invest some of their capital to generate extra funds to keep their store open they’re willing to let me man up and take the opportunity to do so.\n\n\nI took the remaining cash left in all of their accounts and literally dumped it into SPY puts hoping for a humble 2-3x return which will buy them a whole year of operations.\n\n\nMy portfolio is now at 2% of its original worth. I have not told my parents what happened yet. I’ve seriously fucked up. Not only did I ruin their business, but also lost their trust and probably make them regret them ever giving birth such a worthless idiot of a money sink. If I haven’t hit rock bottom yet, this might be it.",
        "created_utc": 1586220121,
        "id": "fmn7yq2",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1586248921.0
    },
    {
        "author": "superwonton",
        "body": "Grandpa how did you make your money?\n\nIn the global pandemic of 2020, your grandpa took his life savings and bought calls in Peloton because he had the foresight that regardless of 30% unemployment, people can't use a regular $200 exercise bike and need a $2300 bike with a $50 monthly subscription so it can sit and collect dust.",
        "created_utc": 1585772100,
        "id": "fm5fq9r",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1585800900.0
    },
    {
        "author": "AloneForever",
        "body": "Got it, buy calls. Thanks for your sacrifice.",
        "created_utc": 1586281027,
        "id": "fmphoyu",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1586309827.0
    },
    {
        "author": "smallchimpu",
        "body": "I wanna tell something to y'all , please get back to your life ,don't watch Batman guy for hours , don't watch futures and market for 18 hrs a day ,there is more to your life , I just realized how many days I wasted :'( ,will just keep my position for now ,but even if I earn I don't think the amount of time invested was worth it , I will probably take a break once this position ends , I am numb rn",
        "created_utc": 1585858942,
        "id": "fm8zm16",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1585887742.0
    },
    {
        "author": "jwd52",
        "body": "So... did everybody here start options trading with a few lucky moves that doubled their money, naively convince themselves that it was an easy thing to do, and then proceed to lose everything and then some with increasingly stupid decisions? Asking for a friend",
        "created_utc": 1585934090,
        "id": "fmbvpo2",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1585962890.0
    },
    {
        "author": "DeltafrogB69",
        "body": "That's exactly the principle he operates on. You don't buy his fund to make 8% a year. You buy a small piece of his fund as insurance so that when shit hits the fan and your main portfolio sinks 30% overnight, your Universa holdings balance it out by going up 600%.",
        "created_utc": 1586393343,
        "id": "fmukrv9",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1586422143.0
    },
    {
        "author": "coloradical5280",
        "body": "FFS you guys, few things:  \n\\-- VS has some of the best TA insights I've seen on this sub, but if you don't understand the fundamentals of what he's talking about and market movement in general, then go do something else until fantasy football comes back  \n\n\n\\-- If you have a strong (data driven) belief that the market will test a new low or hit a lower low, pick a strike that's a month or two out from when you think that low could happen...  e.g., NOT APRIL  \n\n\n\\-- Follow that road map, like VS said, and don't freak out in the meantime.  If you think we'll hit 200 by early May, why are you reacting to a 2% move at the beginning of April?  Have an exit date, and an exit PT:  \n\n\nExample:  I think we will retest lows around $217 by the beginning of May.  \nOver the last week I bought 5/15 $240s, $230s  and  6/17 $240s\n\nI will exit these positions if we hit $215.  It could go lower, but your never going to call the bottom so don't try.  Until then, just chill, pay attention but not obsessively.  If something fundamentally changes (e.g., and effective treatment gets approved) reconsider your theory.  \n\n\nStay calm, and stop watching Batman. Go outside, take a walk, learn to play an instrument or code or something.",
        "created_utc": 1585860777,
        "id": "fm931xk",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1585889577.0
    },
    {
        "author": "Charliebush",
        "body": "Not by OP tho. I heard Questtrade was threatening to burn their own office down and pin it on OP.",
        "created_utc": 1585865648,
        "id": "fm9byo7",
        "score": 39,
        "subreddit": "investing",
        "created": 1585894448.0
    },
    {
        "author": "motley_bruin",
        "body": "Unless Fibonacci can time travel the quantum realm and unplug Powell’s printer I don’t see it happening",
        "created_utc": 1586280581,
        "id": "fmpgtlt",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1586309381.0
    },
    {
        "author": "KremlinBot79",
        "body": "Just so he can lose it again on options expiring in four hours.",
        "created_utc": 1585787804,
        "id": "fm67acw",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1585816604.0
    },
    {
        "author": "Variation-Separate",
        "body": "Couldn’t have said it better. Thanks.",
        "created_utc": 1585875224,
        "id": "fm9rypu",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1585904024.0
    },
    {
        "author": "bazookatroopa",
        "body": "1821+ recorded deaths today...\n\nHeart disease - 1700/day\n\nCancer - 1600/day\n\nEven without many deaths being recorded... COVID-19 is now officially the most deadly thing in the US and it hasn’t even begun to peak \n\n5/1 SPY 420c",
        "created_utc": 1586295768,
        "id": "fmqa5m1",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1586324568.0
    },
    {
        "author": "GermyBones",
        "body": "BRRRRRR\n\nThat's it. That's the whole bull thesis.",
        "created_utc": 1586371451,
        "id": "fmteonz",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1586400251.0
    },
    {
        "author": "726bh",
        "body": "Thanks guys I don't need your apologies just do your crazy yolo options and if you win big do it for him",
        "created_utc": 1586212927,
        "id": "fmmvl5l",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1586241727.0
    },
    {
        "author": "saeuta31",
        "body": "I also want a \"fuck questrade\" flair. Just to remind me to never use it",
        "created_utc": 1585866779,
        "id": "fm9dyf1",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1585895579.0
    },
    {
        "author": "SensualKoala",
        "body": "POKIMANE IF YOURE READING THIS PLEASE REMEMBER THE TIME I SOLD MY HOUSE AND DONATED ALL MY MONEY TO YOU\n\nMY WIFE LEFT ME AFTER CHEATING ME WITH MY BEST FRIEND, THAT WAS ALSO MY DOG, NOW IM DIVORCED, HOMELESS AND DOGLESS\n\nBUT IT WAS ALL WORTH IT\n\nI LOVE YOU POKIMANE",
        "created_utc": 1586380283,
        "id": "fmtwknt",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1586409083.0
    },
    {
        "author": "Thieman15",
        "body": "GEX: -773m\nDIX: 51.1%\n\nMy interpretation: Market makers are short gamma (GEX is negative), meaning they’ve sold a lot of option contracts. In order to delta hedge those contracts they are having to sell more underlying equities which is putting even more downwards pressure on the market. \n\nGiven that DIX is the second highest print the system has ever seen, even on a -5% day, it’s likely that market makers are being forced to buy to prevent an even greater collapse. Correct me if I’m wrong here but this could get ugly tomorrow.\n\nEdit: looking at December 2018 recovery we saw a large discrepancy between the DIX and GEX. DIX was in the high 40’s and GEX was extremely negative. Negative gamma causes the movement of the market to be accelerated, no matter if it’s up or down. In the 2018 recovery it was an upward movement...today we’re seeing a downwards trend. This is why I think it will continue to trend downwards.",
        "created_utc": 1585782589,
        "id": "fm5yk7y",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1585811389.0
    },
    {
        "author": "SaveMyElephants",
        "body": "After awhile you get used to it. I actually enjoyed playing with their little mushroom in Thailand",
        "created_utc": 1586370445,
        "id": "fmtcjb2",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1586399245.0
    },
    {
        "author": "silicapacks",
        "body": "This is my favorite thread, feel like the IQ avg is higher here, but some of these comments are cringeworthy. VS is obviously a nice guy, not just because he shares his thoughts, but mostly because he's willing to answer VERY REPETITIVE UNNECESSARY questions. Here's the thing, when you constantly ask questions and bring doubt into the conversation, a good trader will lose their way. Pressure can also be detrimental, so the high praises and nut licking doesn't help. We all lost a lot of money here, so please chill out so your \"Messiah\" can focus.\n\nOn a brighter note, for those who need some bias to get through the night:\n\n1. SPY closed at 251.83. If I was a MM and I had a dick load of puts headed my way tmmw, knowing the feared resistance line is 252, I'd crank it up to 251.99 just to fuck with you.\n2. Gundlach is shorting.\n3. Goldman sees 200 by mid year.\n4. SPY gap at 230. SPY always fills its gaps.\n\nNote to self: Stop betting against TSLA, you fuckin bafoon!!!!!!",
        "created_utc": 1585864029,
        "id": "fm990ve",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1585892829.0
    },
    {
        "author": "StonkAutist",
        "body": "Against my better judgement I held today - I really believed in the thesis. Too bad all the government cares about is propping up the market to keep the rich rich. \n\nFor those with losses just know I went all in on these puts and lost 90k in the last week. \n\nIt could be worse. \n\nCheers.\n\nEDIT: the Thesis also made me 180k on the first leg down so I’m not broke. Just pissed i nuked it after i made it.",
        "created_utc": 1585858941,
        "id": "fm8zlyx",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1585887741.0
    },
    {
        "author": "jaehoony",
        "body": "Devil's advocate counterpoint: You know how during a bubble, we look at all those indicators you just mentioned and think, this is clearly an insane bubble and it will pop soon, but it doesn't and just keeps growing for years? What if that just keeps on happening?",
        "created_utc": 1586384808,
        "id": "fmu57qp",
        "score": 36,
        "subreddit": "stocks",
        "created": 1586413608.0
    },
    {
        "author": "CC_1138",
        "body": "LOOOOOOOOOOOL man’s gonna yolo all that dough into something really retarded and lose it all",
        "created_utc": 1586286763,
        "id": "fmpsyec",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1586315563.0
    },
    {
        "author": "bliss16",
        "body": "SPY $330C 4/17 got it",
        "created_utc": 1586383089,
        "id": "fmu207d",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1586411889.0
    },
    {
        "author": "Lead5alad",
        "body": "It is almost funny how a bunch of people on this sub (including myself) lost money buying OTM calls that expire in 30 minutes during the historical witching hour, and then just a few days later we get to see one of the biggest run-ups ever.\n\nTypical wallstreetbets fashion to be somewhat right, but to still lose a lot of money",
        "created_utc": 1586207286,
        "id": "fmml5zh",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1586236086.0
    },
    {
        "author": "rawj5561",
        "body": "/u/variation-separate, if you notice me, it will be a ray of shining light on my portfolio of blood red darkness.",
        "created_utc": 1586196531,
        "id": "fmm0isz",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1586225331.0
    }
]