[
    {
        "author": "BigTendie08",
        "body": "4 straight minutes \n\nNot a cough\n\nNot a wheeze\n\nHe sounded more cognizant than normal if anything.",
        "created_utc": 1601766155,
        "id": "g7kmvb8",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7kmvb8/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1601794955.0
    },
    {
        "author": "z74al",
        "body": "No problem--happy to help. With regard to your questions:\n\n1. The vol skew isn't that big of a deal compared to the price spread in my opinion, but just the fact that puts tend to be a little more sensitive to IV than calls makes me shy away from them. IV usually increases when prices are going down, not up. So with call credit spreads even if IV does increase (bad for me) delta is decreasing (good for me). Don't forget: it's not even about the option prices themselves, it's about the difference in premium between them. The closer they get to ATM, the bigger difference in premium between the strikes because the chance that it could go either way increases. So, the fact that they're puts isn't terribly important, it's just one little thing among many that makes me lean toward call spreads.\n2. Yes, I prefer to trade call credit spreads with this strategy. Getting burned so hard with QQQ just soured me on doing this with bull put spreads. The probability of profit is similar, but just seeing QQQ blow through my strikes was demoralizing. With index funds like these, you're just more likely to see a large gap down than a large gap up, and even when there is a gap up overnight there's usually a pullback mid-morning where I can get out before it surges higher. *I can bank on mean reversion much more readily than I can bank on there NOT being a correction.*\n3. I don't tend to alternate indexes too much lately because after reading into it, day trades only count for \"*open-close*\" trades \"of the same or a substantially similar security\" in the same day. Until I dug into it, I wasn't sure if \"*close-open*\" trades counted as day trades. They don't, so that allows me to roll more easily. I don't use more than 2 or 3 day trades in a week, but it just makes me a little nervous to potentially be trapped in a strategy because I don't want to get flagged. I only tend to use them when scaling in/out of a position. For example, when the trade I have on reaches \\~50% profit, I'll usually buy back 2 or 3 spreads and roll them out to the next expiration. I've done that in the morning a couple of times and then there happens to be a big price decline later in the day and I've already gotten to my 50% target. If I want to manage my risk and really follow the strategy, I should close my positions, so I do it and take the day trade. I'd do the same thing if it went against me. It's more about having the option (pun intended) to use them if I need them.\n4. I haven't tried it on anything leveraged or inverse and probably won't--at least right now. The volatility scares me too much because when it goes against you, it goes *HARD* (e.g. SQQQ increased almost 10% on Friday if you include after hours). QQQ burned me too bad. If I were going to do it on with a leveraged underlying I'd probably do it on a leveraged DJIA product since the Dow tends to be the least volatile of the major indexes. Just be cognizant of the fact that options are leverage, so you're using leverage on a leveraged underlying during one of the most volatile times in recent market history.\n5. As far as risk/reward goes, just do what you're comfortable with while also remembering that--for the most part, the lower your max profit the higher probability that you're going to realize said profit. I usually shoot for \\~$15 max profit with 3-5 DTE and close them between $5 and $10 which allows me to roll them every day or two. But like I said I focus on resistance points so if the next area of significant resistance puts my max profit at $10, I'd rather be a little conservative and take that higher probability than be on the wrong side of a breakout. I'll probably be willing to risk more once I have a larger account, but right now a $500 loss would be a decent sized hit.\n6. You didn't ask about this, but from my experience it's also good try to use predictable-ish intraday price movements and mean reversion to your advantage. That usually means opening/closing positions in the morning or the afternoon when volatility is the highest. So again, if SPY gaps up overnight and opens like 2% higher, the tendency is that it will fall and \"fill in\" most of those skipped prices in the next couple of hours, even if it keeps going higher for the rest of the day. This also tends to happen when it gaps down, but is more predictable for a gap up. Those movements are your chances scale in/out to increase your max profit.\n\nSorry again for the novel, but I hope I answered your questions.",
        "created_utc": 1601839826,
        "id": "g7po5jf",
        "permalink": "/r/options/comments/j4v1pc/spy_credit_spread_strategy/g7po5jf/",
        "score": 2,
        "subreddit": "options",
        "created": 1601868626.0
    },
    {
        "author": "nocursing",
        "body": "I'm cognizant of that reality, and it's also obvious that sending out stimulus money and pumping the market prior to the election would help the sitting administration, which is probably why Republicans are falling all over themselves to get something voted through and the Democrats keep moving the goalposts for what's enough spending.",
        "created_utc": 1601592332,
        "id": "g7c8ob8",
        "permalink": "/r/pennystocks/comments/j2y0z3/good_news_everyone/g7c8ob8/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601621132.0
    }
]