[
    {
        "author": "etch-bot",
        "body": "Anyone hang onto never going to print options as a reminder how dumb they were? Got some FE, FISV that just stare at me everyday.",
        "created_utc": 1597114419,
        "id": "g12azku",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597143219.0
    },
    {
        "author": "wileywyatt",
        "body": "I could talk your ear off about Square. I bought in towards the very beginning (around $10 a share), and have been consistently taking gains out along it's hyperbolic take-off.\n\nFor most of Square's publicly traded time, their payment receptacles at businesses were their big \"revolutionary\" product. Their biggest competitor to these products was \"Clover\" with company \"First Data\" (stock ticker FDC).\n\nIf I believe in a product, I often times research competitors &amp; invest a portion into the competitors as well. This was the case with Clover &amp; FDC.\n\nSeeing the writing on the wall: FISV wanted a piece of the payment receptacle money as well, and ended up merging with FDC. This is why I own FISV stock instead of FDC stock now.\n\nSquare has since also developed their Cash App, and is raking in a lot from their CryptoCurrency purchases. Something crazy, like $300M profit, from last quarter alone. I can only imagine what CoinBase is making... but I digress.\n\nFISV is a long-established financial institution, and their acquisition of FDC definitely won some of my respect. After researching FISV (before the merger), I learned enough about their company to justify holding the stock, and I'm glad I did. I'm up about 30% since the merger occurred, but that is on top of all the gains I received from FDC. Gotta love compounding interest!\n\nAll of that having been said, I expect for FISV to continue to make substantial gains over the years, but not as fast as FDC was... since FDC is essentially only a piece of their portfolio now. \n\nHope that helps, and best of luck to you!",
        "created_utc": 1598755665,
        "id": "g3bbtem",
        "score": 5,
        "subreddit": "stocks",
        "created": 1598784465.0
    },
    {
        "author": "spl1sh",
        "body": "FISV ty",
        "created_utc": 1596667204,
        "id": "g0hwob1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596696004.0
    },
    {
        "author": "Swagsung",
        "body": "Why didn't I just yolo aapl calls instead of buy fucking leaps on fiserv...🤡🤦🏽‍♂️🤡🤦🏽‍♂️🤡🤦🏽‍♂️",
        "created_utc": 1598036548,
        "id": "g2csrp5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598065348.0
    },
    {
        "author": "MurrGawd",
        "body": "FISV 🚀 🚀 🚀",
        "created_utc": 1596817761,
        "id": "g0p1q31",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596846561.0
    },
    {
        "author": "sohaib3",
        "body": "I use fiserv, it’s an app that helps you login LMAO. Shits easy money for them tbh",
        "created_utc": 1596818021,
        "id": "g0p29d5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596846821.0
    },
    {
        "author": "MurrGawd",
        "body": "**FISV** anyone?",
        "created_utc": 1596814229,
        "id": "g0otr71",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596843029.0
    },
    {
        "author": "wileywyatt",
        "body": "Lol, 95% of my portfolio in stocks with a 5% SPY Put Hedge isn't going to ruin me.\n\nEspecially when 50% of my stocks are in AMZN, GOOGL, SQ, WM, FISV, CHGG, HD, FB, BABA, MSFT, V, PYPL.\n\nYou can keep the bread Dough Boy.",
        "created_utc": 1597964894,
        "id": "g29odo3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597993694.0
    },
    {
        "author": "spl1sh",
        "body": "Why is no one talking about FISV?",
        "created_utc": 1596662227,
        "id": "g0hmlg4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596691027.0
    },
    {
        "author": "lookingatstocks",
        "body": "So no one in FISV?",
        "created_utc": 1596673023,
        "id": "g0i7s8z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596701823.0
    },
    {
        "author": "East-Entrance-5210",
        "body": "I’ve started off investing with $3000 CAD. I’m a 19 year old and plan to contribute every 2 weeks to my portfolio. I focus mainly on growth and established stocks with rather undervalued market caps.\n\nHere is my portfolio:\n\nFacebook - 23.4%\n\nSpotify - 22.6%\n\nFiserv - 18.1%\n\nGoDaddy - 14%\n\nNERD (ETF) - 11.3%\n\nSony - 10.7%\n\nI plan to add Microsoft, Netflix, and Apple to my portfolio soon. Any advice would be great, thank you.",
        "created_utc": 1596837568,
        "id": "g0q7dkg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596866368.0
    },
    {
        "author": "MurrGawd",
        "body": "**FISV** chill, we can't moon yet. Others haven't joined.",
        "created_utc": 1596821278,
        "id": "g0p96h5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596850078.0
    },
    {
        "author": "leoheartt",
        "body": "Tell your wife's boyfriend, Thanks for the advice on buying FISV Puts a few weeks back!",
        "created_utc": 1598022218,
        "id": "g2bxkhg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598051018.0
    },
    {
        "author": "cocococopuffs",
        "body": "What about fiserv?",
        "created_utc": 1598390544,
        "id": "g2uenpn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598419344.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  3rd of August\n\n\n\n## Upcoming events for Monday, August  3rd\n\n - Stock splits:\n\n    - HUSA @ **2:25**\n    - RNVA @ **1:10000**\n\n - Expected earnings:\n\n  ACRX, ADUS, AIG, AIV, AKTS, ALLK, ALX, AMRC, ANCN, APPF, ARGO, ARVN, ASMB, AVID, AWR, BCC, BCH, BFYT, BKH, BLCM, BRKR, BRX, BSM, BWXT, CBPO, CCLP, CCXI, CDEV, CHGG, CIB, CLI, CLR, CLX, CMS, CNA, CRD.B, CRNT, CRUS, CSWC, CTB, CTT, CURO, CW, CWST, DAC, DISH, DLB, DLHC, DOOR, DRRX, EEX, EME, EMN, ESS, FANG, FBM, FIVN, FRPT, GAIA, GPN, GPP, GPRE, H, HARP, HHC, HLIO, HLIT, HNRG, HPR, HRTG, HRTX, HSBC, HUD, ICHR, INVH, IPI, IR, IRET, ITRI, ITUB, IX, J, JOBS, KDMN, KLAC, KMPR, KMT, KOS, KREF, KRYS, LBTYA, LEG, LGND, LONE, MCK, MCY, MFIN, MG, MIC, MIME, MOS, MPC, MPLX, MRTX, NBIX, NBL, NBLX, NCMI, NCSM, NERV, NEX, NFE, NGHC, NNN, NR, NSP, O, OESX, OTTR, PACB, PEN, PLOW, PMBC, PULM, QTNT, RACE, RBC, REG, RMBS, RNG, RRC, RVNC, RYTM, SALT, SBAC, SEDG, SIBN, SPCE, STE, STRL, SXC, SYKE, TCMD, THC, TKR, TREX, TSN, TTWO, TXRH, UGI, VECO, VNO, VNOM, VRNS, VVV, WMB, WOW, WTS, YRCW, ZVO\n\n - Ex-div:\n\n  BANR, BKEP, BMO, CAG, CAPL, ETRN, EWBC, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, IBCP, IGD, IID, ITUB, LMRK, MET, SHLX, SPH, SRCE, SRLP, USDP, VLO, WCN, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.105%)\n    - 6-Month Bill Auction (previous: 0.130%)\n    - Construction Spending (consensus: 1.0%, previous: -2.1%)\n    - FOMC Member Bullard Speaks\n    - ISM Manufacturing Employment (previous: 42.1)\n    - ISM Manufacturing New Orders Index (previous: 56.4)\n    - ISM Manufacturing PMI (consensus: 53.6, previous: 52.6)\n    - ISM Manufacturing Prices (consensus: 52.0, previous: 51.3)\n    - Investing.com Gold Index (actual: 49.3%, previous: 52.6%)\n    - Investing.com S&amp;P 500 Index (actual: 39.0%, previous: 41.0%)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 51.3, previous: 51.3)\n    - Total Vehicle Sales (previous: 13.10M)\n\n## Upcoming events for Tuesday, August  4th\n\n - Expected earnings:\n\n  ACHC, ACIA, ACLS, ACM, ACOR, AFG, AGLE, AHH, AIZ, AJX, AKCA, ALL, ALLT, ALRN, ALSN, AMCX, AME, AMK, AMRN, AMSC, ANDE, ANET, APEN, APTO, AQB, AQMS, AQST, AQUA, ARCC, ARMK, ATI, ATVI, AVLR, AVNS, BLD, BLRX, BMCH, BMRN, BOOT, BP, BRY, BTAI, BXC, BYND, CBMG, CCR, CDK, CDLX, CDNA, CEQP, CERS, CGBD, CHCT, CHFS, CLPT, CLW, CMP, CNK, CNO, COHR, CORT, CPE, CPSI, CPTA, CRIS, CRNC, CSII, CTRE, CTSO, CYBR, CZNC, DCPH, DEA, DIS, DK, DKL, DNLI, DS, DVN, DXPE, EC, EMR, ENLC, ENPH, ENTA, EPC, EPZM, EQH, ESI, ESTE, ETH, ETON, ETRN, EVC, EVER, EVFM, EVH, EVRI, EVTC, EXC, EXK, EXPD, EXR, EYES, FARO, FI, FIS, FLGT, FLXN, FMC, FNF, FOE, FOXA, FSP, FSTR, FTSI, GBL, GDEN, GDOT, GLDD, GLT, GLUU, GMDA, GNMK, GORO, GPOR, GRBK, GTE, GTES, HAE, HCKT, HEES, HLNE, HNP, HSIC, HSKA, HTGM, HTZ, HVT, IAA, ICAD, ICD, ICFI, IGT, IMXI, INCY, INGN, INGR, INSP, IPGP, IPHI, IT, ITI, JAZZ, JBGS, JELD, KALA, KKR, KMDA, KOPN, KPTI, KRMD, KTOS, LC, LCII, LDOS, LEA, LGIH, LILA, LMNX, LOPE, LPSN, LPX, MCHP, MCS, MEC, MGP, MLAB, MMYT, MNK, MNR, MNST, MOD, MODN, MR, MRCY, MTCH, MUX, MYOK, MYOS, MYOV, NEWR, NEXT, NK, NKLA, NP, NPO, NPTN, NS, NUVA, NVMI, NVTA, NWPX, NXRT, OAS, OCFT, OEC, OI, OMI, OMP, ONCY, ONTO, OPCH, ORA, ORCC, OSPN, OTIC, OXFD, PAA, PAGP, PAYC, PAYS, PEAK, PEI, PLMR, PLNT, PRIM, PRTA, PRU, PSB, PTMN, PUMP, PXD, QGEN, QTRX, QUOT, RCM, RCUS, RDHL, REGI, REZI, RGA, RHP, RIGL, RL, RPAI, RPT, RRR, RVI, RYAM, SAMG, SBBP, SBOW, SHO, SLRC, SND, SNE, SPN, SPNE, SPNS, SPR, SRGA, STIM, SUNS, SUPN, SWX, TDG, TECH, TFSL, TGI, THFF, THRM, TISI, TLC, TPTX, TREC, TREE, TRHC, TRUP, TSLX, TSQ, TTI, TWLO, UFPT, UPWK, USAC, USCR, USFD, VAPO, VIV, VMC, VNTR, VPG, VRNA, VRSK, VSH, WBT, WEC, WIFI, WK, WMC, WMG, WRK, WTTR, WU, WW, WYNN, XENE, XENT, XERS, XNCR, XOMA, Y, ZAGG, ZBH, ZYNE\n\n - Ex-div:\n\n  BBD, BBDO, BRO, COLB, EIG, HFWA, IDA, MKTX, NFBK, NTB, SFBC, WBS, WTBA\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -6.829M)\n    - Durables Excluding Defense (previous: 9.2%)\n    - Factory Orders (consensus: 5.0%, previous: 8.0%)\n    - Factory orders ex transportation (previous: 2.6%)\n    - IBD/TIPP Economic Optimism (previous: 44.0)\n    - ISM NY Business Conditions (previous: 39.5%)\n    - ISM-New York Index (previous: 806.0)\n    - Redbook (previous: -8.7%)\n    - Redbook (previous: 1.1%)\n\n## Upcoming events for Wednesday, August  5th\n\n - Expected earnings:\n\n  ABC, ACAD, ACMR, ADT, ADTN, AEIS, AEL, AFIN, AFMD, AG, AGS, AKR, ALB, ALE, ALLO, ALNA, ALRM, AMOT, AMPH, AMPY, ANSS, AOSL, APPS, ARAV, ARES, ARLO, ARNA, ARTNA, ARWR, ASM, ASTE, ATH, ATHM, ATO, ATOM, ATRA, ATSG, AUMN, AUTO, AVA, AVXL, AWK, AXAS, AXGN, AY, BAK, BBSI, BCOR, BCSF, BDSI, BFAM, BFS, BGSF, BIP, BLDP, BMA, BNFT, BREW, BTG, BV, BWA, BWEN, CAI, CAMT, CARA, CBAY, CBD, CCMP, CCRN, CCU, CDAY, CDW, CECE, CENT, CENTA, CENX, CF, CHAP, CHNG, CHX, CIM, CLDT, CLDX, CLH, CLLS, CNFR, CNST, COLL, CPA, CPK, CPRI, CPRX, CRK, CRL, CSGS, CSTE, CTL, CTVA, CUB, CVNA, CVS, CWH, CXW, DAR, DCP, DDD, DFIN, DISCA, DNOW, DNR, DOX, DSSI, DVAX, DZSI, ECPG, ELF, EMKR, ENBL, ENR, EPR, EPRT, ERJ, ET, ETSY, EVOP, EVRG, EXPI, EXTR, EYPT, FATE, FISV, FIT, FLMN, FNHC, FNV, FOXF, FPI, FRGI, FRT, FSCT, FSLY, FSM, FTDR, FUN, FVRR, GBDC, GBT, GCP, GDDY, GEL, GFL, GGB, GLOG, GLOP, GMED, GMRE, GNK, GNL, GOLF, GPRK, GTHX, HALL, HBIO, HCC, HCFT, HDSN, HEP, HMC, HNGR, HR, HSC, HSON, HT, HUBS, HUM, HZNP, IAG, ICPT, IIPR, IMMU, INFN, INMD, INN, INSG, IONS, ISEE, ITCI, IVC, IVR, JACK, JNCE, KAR, KIDS, KIN, KRG, KRO, KW, KZR, LAND, LASR, LHCG, LL, LMRK, LNC, LPCN, LPI, LYRA, LYV, MATX, MAXR, MCHX, MDGL, MDU, MED, MET, MFC, MGEE, MGEN, MGTX, MIDD, MLCO, MNKD, MRCC, MRNA, MRO, MSC, MTG, MVIS, MWA, NE, NEPH, NESR, NEWT, NI, NKSH, NLSN, NMFC, NMIH, NRG, NSPR, NTRA, NUAN, NUS, NVAX, NVCN, NVEE, NVRO, NXST, NYMT, NYT, OBSV, OCSI, OCUL, ODP, ODT, OHI, OLN, OLP, OPGN, OPRX, OR, OSUR, OSW, OTRK, OUT, OVID, PAAS, PBPB, PDCE, PDLI, PE, PERI, PFLT, PGNY, PK, PKOH, PLUS, PNNT, PPD, PRGO, PRI, PRQR, PSA, PSN, PTCT, PTGX, PTI, PTON, PVAC, PVG, QMCO, QNST, QTWO, QUIK, RBBN, RC, RCII, RCKT, RCMT, RE, REGN, REI, RESI, RESN, REYN, RGLD, RGNX, RM, RMD, RMNI, ROCK, ROKU, RTLR, RYN, SBGI, SBLK, SBRA, SCPH, SCYX, SENS, SGMO, SGRY, SILK, SITM, SJI, SKT, SLNO, SLRX, SMSI, SMTX, SNSS, SONM, SONO, SPT, SPWR, SQ, SR, SRDX, SRE, SRLP, SRPT, SSYS, STAA, STKL, STN, STOR, STWD, SUN, SUP, SURF, SWM, SYNA, TA, TACT, TALO, TARA, TCDA, TCON, TCP, TELL, TEVA, TGB, TMDX, TPCO, TPVG, TRI, TRMB, TRVN, TRXC, TTEC, TTGT, TVTY, TWNK, TWO, UFAB, UFCS, UFI, UHAL, UIHC, UMH, USWS, VAR, VCEL, VERI, VMD, VNDA, VOYA, VRCA, VRT, VRTV, VSLR, VST, W, WATT, WD, WDC, WELL, WEN, WMGI, WPG, WSR, WTRG, WWW, XEC, ZGNX, ZIXI, ZNGA\n\n - Ex-div:\n\n  AMG, AWI, BXG, DCOM, FELE, FSBW, HESM, HTBK, KBH, LSBK, MATX, NEP, NGL, NWBI, OFED, OPBK, RELL, SIMO, SXI, VBTX, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 1,500K, previous: 2,369K)\n    - Crude Oil Imports (previous: -1.013M)\n    - Crude Oil Inventories (consensus: 0.357M, previous: -10.612M)\n    - Cushing Crude Oil Inventories (previous: 1.309M)\n    - Distillate Fuel Production (previous: 0.020M)\n    - EIA Refinery Crude Runs  (previous: 0.389M)\n    - EIA Weekly Distillates Stocks (consensus: -0.267M, previous: 0.503M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.5%, previous: 1.6%)\n    - Exports (previous: 144.51B)\n    - FOMC Member Mester Speaks\n    - Gasoline Inventories (consensus: -0.733M, previous: 0.654M)\n    - Gasoline Production (previous: 0.079M)\n    - Heating Oil Stockpiles (previous: -0.127M)\n    - ISM Non-Manufacturing Business Activity (consensus: 60.0, previous: 66.0)\n    - ISM Non-Manufacturing Employment (previous: 43.1)\n    - ISM Non-Manufacturing New Orders (previous: 61.6)\n    - ISM Non-Manufacturing PMI (consensus: 55.0, previous: 57.1)\n    - ISM Non-Manufacturing Prices (previous: 62.4)\n    - Imports (previous: 199.12B)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: -0.8%)\n    - MBA Purchase Index (previous: 306.1)\n    - Markit Composite PMI (consensus: 50.0, previous: 50.0)\n    - Mortgage Market Index (previous: 841.9)\n    - Mortgage Refinance Index (previous: 3,955.9)\n    - Seevol Cushing Storage Report (previous: 0.426M)\n    - Services PMI (consensus: 49.6, previous: 49.6)\n    - Trade Balance (consensus: -50.10B, previous: -54.60B)\n\n^^^^2020-08-03",
        "created_utc": 1596448817,
        "id": "g06yyol",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1596477617.0
    },
    {
        "author": "DerTagestrinker",
        "body": "If you’ve been buying Fiserv instead of FIS the past five years, I’m sorry.",
        "created_utc": 1598022542,
        "id": "g2by786",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598051342.0
    },
    {
        "author": "solidmussel",
        "body": "Thats exactly it.  It's relatively safe, and therefore misses out on the huge upsides you can get from stock investing.\n\nI've bought a few companies now expecting or hoping for 10% per year growth and had them blow up huge.   Aapl $100-$500 in 4 years.  Shop $100-1000 in 4 years.  Twitter $16-$40 in 4 years.  \n\nI could go on and on too. V, FISV, BRK, TMUS\n\nThe wheel strategy should be considered somewhat conservative and it has its place in a portfolio.  But it shouldn't be the only strategy",
        "created_utc": 1598328594,
        "id": "g2ro24r",
        "score": 1,
        "subreddit": "options",
        "created": 1598357394.0
    },
    {
        "author": "Wild_Cat_Cory",
        "body": "Portfolio\n\nAMZN - 6.5%\n\nAAPL - 4.0%\n\nADBE - 2.9%\n\nBABA - 3.9%\n\nBAM - 1.8%\n\nCHDN - 2.2%\n\nCRWD - 1.5%\n\nDFS - 1.0%\n\nDIS - 1.7%\n\nFISV - 1.3%\n\nGOOGL - 4.3%\n\nHCA - 2.6%\n\nIIPR - 3.1%\n\nINMD - 0.9%\n\nINS - 0.8%\n\nLVGO - 5.7%\n\nLYV - 0.9%\n\nMA - 3.5%\n\nMELI - 4.2%\n\nMSFT - 4.4%\n\nMU - 1.7%\n\nPYPL - 3.3%\n\nPENN - 1.2%\n\nPLNT - 1.1%\n\nREGI - 1.5%\n\nSAIC - 1.0%\n\nSBUX - 2.5%\n\nSHOP - 6.5%\n\nSQ - 3.9%\n\nSSNC - 1.5%\n\nSTNE - 3.1%\n\nTJX - 1.7%\n\nV - 3.3%\n\nVMW - 0.9%\n\nWEX - 1.1%\n\nWM - 2.9%\n\nWMT - 2.6%\n\nZNGA - 0.8%\n\nGUSH - 0.9%\nUCO - 1.2%\n\nCurrently up 37% ,  I tend to buy or add to my position fortnightly.\nI know I’m very tech heavy and “ war against cash” heavy.\nLooking for any critiquing please or things I should add and/or drop",
        "created_utc": 1596327346,
        "id": "g01dibd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596356146.0
    },
    {
        "author": "dwdsquared2",
        "body": "**Events in the US Today (EDT):**\n\n* 7:00am - MBA Mortgage Info \\[1/3 Volatility\\]\n* 8:15am - ADP Nonfarm Employment Change \\[3/3 Volatility\\]\n* 8:30am - Imports, Exports, Trade Balance (Jun) \\[2/3 Volatility\\]\n* 9:30am - Seevol Cushing Storage Report \\[2/3 Volatility\\]\n* 9:45am - Markit &amp; Services PMI \\[2/3 Volatility\\]\n* 10:00am - ISM Non-Manufacturing PMI (Jul) \\[3/3 Volatility\\]\n   * The Senate meets for general session\n   * The Senate Judiciary Committee will hear testimony from former Deputy AG Sally Yates as part of the panel’s probe into the underpinnings of the Justice Department’s Russia investigation\n* 10:30am - Crude Oil Inventories \\[3/3 Volatility\\]\n   * Secretary of State Mike Pompeo holds a news conference\n* 3:00pm - POTUS meets with Arizona Gov. Doug Ducey in the Oval Office\n* 5:00pm - FOMC Member Mester Speaks \\[2/3 Volatility\\]\n* The 4 Dem &amp; Rep negotiators are set to meet once again today, and are expected to take part in a separate meeting with the postmaster general as Democrats push for more funding over concerns that the Postal Service could be swamped by absentee ballots in November\n* Gold continued its ascent above a record $2,000 an ounce as investors considered the effects of more government stimulus. The dollar weakened against all of its major peers. Ten-year Treasury yields edged up, but are still near the lowest since March\n* America and China plan to assess their trade agreement in mid-August against a backdrop of rising bilateral tension, according to people briefed on the matter. China’s yuan strengthened to its highest level since March 11\n* Walt Disney stock is soaring premarket despite taking a nearly $5 billion charge, as the entertainment giant managed to register an adjusted profit late Tuesday, despite the coronavirus pandemic forcing the closure of its parks as well as movie theaters and many sporting events\n\n**Events in the World Today (EDT):**\n\n* 3:15am - Spain Services PMI (Jul) \\[2/3 Volatility\\]\n* 3:45am - Italy Services PMI (Jul) \\[2/3 Volatility\\]\n* 3:50am - France Services PMI (Jul) \\[2/3 Volatility\\]\n* 3:55am - Germany Services PMI (Jul) \\[2/3 Volatility\\]\n* 4:00am - Euro Zone Services &amp; Markit Composite PMI (Jul) \\[2/3 Volatility\\]\n* 4:30am - UK Composite &amp; Services PMI (Jul) \\[3/3 Volatility\\]\n* 5:00am - Euro Zone Retail Sales (MoM-Jun) \\[2/3 Volatility\\]\n* 8:00am - Japan BoJ Gov Kuroda Speaks \\[2/3 Volatility\\]\n* 8:30am - Canada Trade Balance (Jun) \\[2/3 Volatility\\]\n* 5:00pm - Brazil Interest Rate Decision \\[2/3 Volatility\\]\n* 11:00pm - New Zealand Inflation Expectations (QoQ) \\[2/3 Volatility\\]\n* European economic data was positive, with a euro zone composite purchasing managers’ index climbing to 54.9, the highest level in just over two years and above a flash estimate. Orders increased for the first time in five months.\n\n[Earnings Before Open:](https://i.imgur.com/li6KhLn.png)\n\n* Moderna, CVS, Wayfair, Teva, Fiverr, Humana, Regeneron, Callon Petroleum, Advanced Energy, The Wendy's Company\n\n**Earnings After Close:**\n\n* Square (4:05pm), Roku (4:00pm), Fastly (4:05pm), Etsy (4:05pm), Zynga (4:05pm), Western Digital (4:00pm), MicroVision (4:05pm), Inseego (4:05pm), Energy Transfer, Sonos (4:05pm), Fiserv (4:00pm), SunPower (4:05pm), Carvana (4:05pm), Hitbit (4:05pm), Jack in the Box (4:05pm)\n\n[Earnings This Week](https://i.redd.it/e80bziyabfe51.jpg)",
        "created_utc": 1596625917,
        "id": "g0fk2d7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596654717.0
    },
    {
        "author": "strawberry-jam-boy",
        "body": "Fisv up 4.5%\n\nWhy didn’t we play them boys",
        "created_utc": 1596665040,
        "id": "g0hscmj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596693840.0
    },
    {
        "author": "WolfPack14",
        "body": "Followed the money on FISV. Hoping for a pop tomorrow.",
        "created_utc": 1597106270,
        "id": "g11wliz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597135070.0
    },
    {
        "author": "wileywyatt",
        "body": "Not selling shares, for at least 10 years.\n\nEdit: 50% of my Portfolio is in AMZN, GOOGL, SQ, WM, FISV, CHGG, HD, FB, BABA, MSFT, V, PYPL.",
        "created_utc": 1597962536,
        "id": "g29jwpa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597991336.0
    },
    {
        "author": "HybridTrader",
        "body": "bro fisv has some crazy open interest contracts that expire in 2021.  hedge fund or insider?",
        "created_utc": 1598031236,
        "id": "g2chs8v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598060036.0
    },
    {
        "author": "CorneredSponge",
        "body": "NVDA, BABA, FISV, EQIX, WMT",
        "created_utc": 1598755567,
        "id": "g3bbng8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598784367.0
    },
    {
        "author": "Swagsung",
        "body": "Sad as fuck - my Fiserv leaps would have been worth 12.5k, but I bought GSK instead, now worth 8.2k. 4k swing, fml",
        "created_utc": 1598633495,
        "id": "g35g4v6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598662295.0
    }
]