[
    {
        "author": "JoseAureliano",
        "body": "Jesus Christ I'm actually having an amazing run. Been holding MSFT, AAPL, FSLY, SE, and TER shares and all are up 20% for me since I bought them (FSLY up 70%!). Bought a PRPL call last Friday already up 25%. Bought an ATVI call this morning up 20%. \n\nGD this is intoxicating stuff.",
        "created_utc": 1596472854,
        "id": "g084taq",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1596501654.0
    },
    {
        "author": "mpaqtrader",
        "body": " I like  PHO and TER. One is tech the other is weed but 90% of their rev is US based.",
        "created_utc": 1597696937,
        "id": "g1womn9",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1597725737.0
    },
    {
        "author": "YUFALLING4IT",
        "body": "You just have to jump in and take the risk or watch from sidelines. CURA will probably run into earnings.   Also TER is solid #5 MSO and they are dropping.",
        "created_utc": 1597087458,
        "id": "g10vf8b",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597116258.0
    },
    {
        "author": "shantmelikian",
        "body": "Guys I know... I'm just not trashing his wishful thinking.\nPlease direct your comments at him.\n\nI'm only interested in Trul, Gtii, Cura, Cl, Ter",
        "created_utc": 1597079621,
        "id": "g10f3lr",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597108421.0
    },
    {
        "author": "sophanox",
        "body": "What's their stake in TER?",
        "created_utc": 1597082941,
        "id": "g10m1lt",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597111741.0
    },
    {
        "author": "notdoingdrugs",
        "body": "Warrants. Can’t remember off top of head but I believe between CGC and JW Asset firm (chairman’s fund) - the majority of TER is spoken for. That’s why it’s so illiquid",
        "created_utc": 1597083733,
        "id": "g10nolf",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597112533.0
    },
    {
        "author": "Kevinement",
        "body": "If you’re honestly looking into starting to save money, I wouldn’t recommend blowing it in trades. Day-Trading is a super risky business even for well-experiences stock market experts.  \nJust buy broadly diversified ETFs with low TER, like an MSCI World and use the buy and hold strategy.\n\nThere’s a reason why Wall Street gets constantly jokes about blowing all their money. It’s not a joke.",
        "created_utc": 1596868450,
        "id": "g0rm0b1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596897250.0
    },
    {
        "author": "menatarms",
        "body": "TER 6 failed attempts at breaking $90 in 24 hours.  ffs.",
        "created_utc": 1597330477,
        "id": "g1bzu46",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597359277.0
    },
    {
        "author": "shantmelikian",
        "body": "TRUL, GTII, CL, CURA\n\nHonorable mentions : LHS, GRWG, TER, HARV, TILT\n\nNon canadian side for the moment",
        "created_utc": 1597341054,
        "id": "g1cnda9",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597369854.0
    },
    {
        "author": "Fredbull",
        "body": "Hi everyone, European here looking to start investing.\n\nGiven the high tax over dividends in my country, and given that I want to hold my positions for a long time, I was looking for an accumulating ETF that tracked the S&amp;P500 and purchasable through Degiro.\n\nI was looking at **iShares Core S&amp;P 500 UCITS ETF** and the page looked good, didn't see any red flags, and the TER isn't terribly high. Also it's available through my broker (Degiro).\n\nDoes anyone have any idea if this is a good option?\n\nThanks a lot!!",
        "created_utc": 1597362442,
        "id": "g1dwru0",
        "score": 1,
        "subreddit": "investing",
        "created": 1597391242.0
    },
    {
        "author": "anxiousnl",
        "body": "CL and Cura both poking green.  TER was up 10% at one point.",
        "created_utc": 1597418147,
        "id": "g1g6hqd",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597446947.0
    },
    {
        "author": "PocketAces93",
        "body": "Sounds like TER would be a good option based on your criteria",
        "created_utc": 1597419205,
        "id": "g1g8sze",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597448005.0
    },
    {
        "author": "TorpCat",
        "body": "Read what the terms mean. Look what is a good deal ( small TER of an ETF etc. ) and most importantly : risk management",
        "created_utc": 1597327353,
        "id": "g1btufy",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1597356153.0
    },
    {
        "author": "trilogee",
        "body": "They already have a cheap deal with ACRG. They're gonna have to pay a premium to take over TER and JW owns the majority. They want TER, and it's obvious they are impressed with them from Klein's comments. Just a matter of how much it will cost them or if it will make sense to pursue majority ownership.",
        "created_utc": 1596741075,
        "id": "g0lfic6",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1596769875.0
    },
    {
        "author": "roaches-geta-bad-rap",
        "body": "The way TRUL is running, I was thinking the same thing. Is M&amp;A at hand? May not be TER but this breakout sure makes me think something more than just a reaction to ER is going on.",
        "created_utc": 1597430287,
        "id": "g1gxwdy",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597459087.0
    },
    {
        "author": "henk000",
        "body": "Is TRUL buying TER? Both are running.",
        "created_utc": 1597429574,
        "id": "g1gw6mg",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597458374.0
    },
    {
        "author": "Trisolaran_arbitrage",
        "body": "TER Teradyne- they make equipment for testing semiconductors and also make robots. It’s a rock solid company fundamentally and serves as a semiconductor play that doesn’t necessarily require you to pick sides.",
        "created_utc": 1597462276,
        "id": "g1ioaio",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1597491076.0
    },
    {
        "author": "mnyahoo",
        "body": "CGC will only own ~16% of TER with current capital structure. They will need to dish out a lot more if they actually want to buy. Ter is its own company.",
        "created_utc": 1597673169,
        "id": "g1uwxui",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597701969.0
    },
    {
        "author": "ResignedFate",
        "body": "Yes, it's Canopy's next scam stock to fool investors into giving them more money with the hopes of a big payout when they acquire them only to devalue them to a point of forcing everyone to take a loss.\n\nMe a bitter Acreage holder?  Not at all /s  \n\nMaybe TER will be the one they actually follow through with.",
        "created_utc": 1597671577,
        "id": "g1ut97z",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597700377.0
    },
    {
        "author": "Kbarbs4421",
        "body": "I'm coming around on Terrascend.  I like that their investment capex for expansion is nearly complete. As they bring these markets online and/or ramp their footprints, financial performance should be quite strong relative to peers.  I also like the Canopy relationship, and have noted their increasing preference to discuss Terrascend rather than Acreage.  It certainly feels like Terrascend is viewed as a winning investment by CGC.\n\nI finally opened a modest position in TRSSF earlier this week, right at the recent support level.  I have a couple of deeper limit buys set should support fail.  If pps holds and climbs from here, I don't feel the need to chase.  As one of the best positioned companies outside of the top tier, I'm happy to have a bit of exposure going into this phase of MSO growth.\n\nThat said, I'm channeling the lessons I learned during the LP bubble.  In particular, I'm committed to taking profit and closing out positions on mid-tier names when things get nuts.  Terrascend is not a long hold for me, barring some sort of major shift in strategy or success.  When the US cannacraze happens, I'm going to winnow my exposure down to a couple of core long positions in the best run companies at that time.  Even if TER is looking really good mid-bubble, I'm going to accept that for the win it is and move on with my gains.  I'm not going to ride over the top of another wave holding onto underdogs.\n\nFWIW, I think it's important to note that Terrascend is beholden to two major insiders (Canopy and JW Asset Management).  So much so that common shareholders are certainly an after thought.  Also, so much so that those insiders should be viewed skeptically as possible vultures looking to force a takeover in the end.  In other words, Terrascend may prove to be a good company that's not a great investment for the common shareholder.  It's important not to lose sight of that as a possibility.",
        "created_utc": 1597441160,
        "id": "g1hlo41",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597469960.0
    },
    {
        "author": "bazinet666",
        "body": "It’s fucking insane how toxic this place can be lately, the cL.wt and TER we’re both amazing heads up, at this pace the people making great contributions to the board will simply stop because of all this bullshit, I get it, everyone has their own fucking agenda...anyway I’m rambling again, please keep up the good work , I believe I have already thanked you , but again, after your post , not pump!! Simple post, I did a couple days of DD to the best of my limited ability and took a decent position in TER and hit that 80% and that’s 30k profit I would not have made without your insight, so please don’t let the trash accounts in here get to you",
        "created_utc": 1596920314,
        "id": "g0tq6l3",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1596949114.0
    },
    {
        "author": "ZombehArmyLTD",
        "body": "Youre like 4 years too late to make a million but youll still do good if you invest in some of the best tickers at the right averages.\n\nCanadian side, only APHA sub C6$, or WEED sub C20$.\nStateside, CURA sub C9$, TRUL sub C20$ and GTII sub C16$. \n\nSome YOLO plays for me would be PLTH sub C3$, TER sub C5$.\n\nId wait it out. This sub seems to think itll run all the way until legalization.. i dont believe it but, you can bet with them. Youll probably be fine if you know how to take profits when they come. \n\nId kick the millionaire thoughts out the door unless you plan on holding for 15+ years. \n\nGood luck!",
        "created_utc": 1597283596,
        "id": "g1a7gge",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597312396.0
    },
    {
        "author": "RoFo2017",
        "body": "As Usual Canadian LP shits the bed (CRON) and USA MSO reports Growth better margins (TER)",
        "created_utc": 1596714144,
        "id": "g0jrcg8",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1596742944.0
    },
    {
        "author": "trilogee",
        "body": "From Todd Harrison on Twitter: Stifel on @terrascendcorp this morning in response to the positive preannouncement: \"With TER reporting its highest ever EBITDA margin of 24%, it roughly matches the Q1/20 EBITDA margin posted by GTII who we believe is the best executing operator in the space.\"",
        "created_utc": 1596720192,
        "id": "g0k35du",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1596748992.0
    },
    {
        "author": "cannainform2",
        "body": "Didn't really like how David Kline said that if permissible they are gonna take a real hard look at TER. And then say how Acreage will be taken over as its a benefit for share holders. I realize they can't say anything about taking over TER but acreage is a shit company compared to TER. Give TER more credit.",
        "created_utc": 1596737314,
        "id": "g0l6gka",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1596766114.0
    },
    {
        "author": "notdoingdrugs",
        "body": "Even though my limited MSO position is only with GTI, TER, and ACRG right now, I really hope for everyone's sake it's included",
        "created_utc": 1596579611,
        "id": "g0dsucu",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1596608411.0
    },
    {
        "author": "wegwerf874",
        "body": "There are enough UCITS-compliant ETF you can buy from the EU which are basically equivalent to VOO or VTI but without all the tax-related cross-border hassle (these are highly non-trivial for ETFs, just filing a W8-BEN won't be enough). Their TER are also as low as 0,07%. Of course, you will have currency issues, i.e. the value per share which is often denominated in EUR will vary depending on the exchange rate, but so would it be if you bought shares at a US-based broker. You can also see exchange rates as a virtue: Currently, for example, all US shares are on a 10% discount for Europeans, compared with a few months ago.\n\nJust look into EU-based products by, e.g., iShares (Blackrock), x-trackers (Deutsche), Vanguard, SPDR etc. pp.",
        "created_utc": 1596573518,
        "id": "g0dffz7",
        "score": 1,
        "subreddit": "investing",
        "created": 1596602318.0
    },
    {
        "author": "eclecticstalwart",
        "body": "Probably something @el_mercenary said. He's smart as fuck and I have been rebalancing to mimic some of his plays. He loves David and is extremely bullish on SaaS and 5g - SE, FSLY, DDOG, AYX, CRWD, NET, TER, etc. Check his post history he made like a mil holding Shop and others for 3 -4 years. \n\nWhat's your largest holding? And do you have a PT for SE?",
        "created_utc": 1596308748,
        "id": "g00g8cv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596337548.0
    },
    {
        "author": "radarbot",
        "body": "This is kind of my strategy too. I have a few different piles based on doing research of active invested fund portfolios, industry trends and my own gut feeling:\n\n1. Cloud computing (ie. NET, FSLY, etc)\n2. Digital communications (ie. TWLO, BAND, ORBC, NOK etc)\n3. Modernized Healthcare (ie. CRSP, NVTA, ARCT, TDOC, LVGO, etc)\n4. Renewable Energy (ie. SPWR, SEDG, RUN, BEP, NEE, etc)\n5. Ecommerce (ie. SQ, V, PYPL, etc)\n6. Tech hardware (ie. AMD, AMAT, MU, TSM, TER,)\n\nI've tried a DCA average into most of these stocks, but the current run up has been savage on my mental strain as some of these stocks are moving much faster than I expected, which is fucking with my DCA strategy.\n\nThanks for your response, I think we're all in the same boat and its all about discipline in this whacky market.",
        "created_utc": 1596643789,
        "id": "g0giml8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596672589.0
    },
    {
        "author": "MK45124512",
        "body": "Is there TER news? Just saw it jump to +25%",
        "created_utc": 1597671184,
        "id": "g1us5he",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597699984.0
    },
    {
        "author": "MMG39444",
        "body": "I mean they own 19.5m shares of TER and 2M warrants @ 5.85 if. That’s 100m In shares at current price. Their current market cap is 120m$. That’s like buying into TER with a bunch of other shit too for free 🤣. 50m In cash and other assets in their portfolio. It makes the list more valid as it proves and shows undervalued companies. canopy river is priced for BK. Doubt that Klein wants to take a 200m write down. He would rather inject 100m  and make it 300m and not 0.",
        "created_utc": 1597471798,
        "id": "g1janbw",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597500598.0
    },
    {
        "author": "MMG39444",
        "body": "If canopy river is laughable then how’s TER with the biggest upside, your statements are contradicting",
        "created_utc": 1597519923,
        "id": "g1n1vyw",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597548723.0
    },
    {
        "author": "thorprodigy",
        "body": "For the next 6 months I believe CL and GTII offer the best returns. I would add CURA if we get news of adult use in NY, CT, NJ or if we were to get uplisting news.  CURA is a bit bloated but a definite watch.  TRUL could be another consideration if it were to acquire more licenses through a CCHW or TER.",
        "created_utc": 1596492311,
        "id": "g09gx06",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1596521111.0
    },
    {
        "author": "cannainform2",
        "body": "Ya thats what i figure too.\nHow much of TER does CGC own?",
        "created_utc": 1596749486,
        "id": "g0lxnwp",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1596778286.0
    },
    {
        "author": "jobro962",
        "body": "Critique my portfolio allocations : I seem to like a lot of stocks to try them out and see if I catch a big winner.  \n\n12% shop\n8.5% voo\n8% xel \n8% ttd \n7.5% meli\n5% fsly \n5% se\n3.5% eltc \n3% twlo \n3% aapl\n2.7% fb \n2.5% mdb\n2% tsla \n2% pins\n1.5% appn jd lvgo mkl nflx roku sfix \n1% zm vrns wing ter sbux pypl payc nvda knsl ftnt dis ddog crwd cost asml\n.5% stne twst etsy",
        "created_utc": 1597360371,
        "id": "g1dsryu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597389171.0
    },
    {
        "author": "menatarms",
        "body": "TER gapping up today",
        "created_utc": 1597412144,
        "id": "g1fuhay",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597440944.0
    },
    {
        "author": "BxlVie",
        "body": "0.7% TER for the ETF? Or what do you mean?",
        "created_utc": 1597545598,
        "id": "g1p62ja",
        "score": 1,
        "subreddit": "investing",
        "created": 1597574398.0
    },
    {
        "author": "daccord_cava",
        "body": "that's right, the expensive ones will keep getting more expensive (it remains to be seen whether they'll retain their valuations tho)\n\ni think we've all gotten accustomed to seeing sympathy runs on turds just because they're \"in the sector\" but there does seem to be some separation occurring (`MMEN` for example)...\n\ni do think there are still some diamonds in the rough out there that have some arb in them... toddo just mentioned `AYR.A` but last i checked their execution still looked like trash...\n\nthere's been a lot of mention of `TER` by him as well and they did well with their recent pre-announcement, but all I remember about `TER` is their former-founder's twitter-fights and the shit-ass liquidity (plus i think it's still majority-controlled by the one family-fund)... price-action doesn't lie though so maybe there's something to it... i should look into them",
        "created_utc": 1596811595,
        "id": "g0onhx9",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1596840395.0
    },
    {
        "author": "Lowerlameland",
        "body": "Would be nice for TER, so it's a good rumour to start, but regardless, TER MC is only 600m Canadian, so there's room to grow for sure if the US stuff keeps going. Or if the big guys cool off, maybe money will move to a few smaller companies who are doing ok? Not sure it'll work that way. Their earnings are next Thursday and should be good anyway...",
        "created_utc": 1597432658,
        "id": "g1h38rj",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1597461458.0
    },
    {
        "author": "Blackops_21",
        "body": "LEN, MEDP, TREX, NXRT, LRCX, ICE, ABT, XPEL, AVTR, TER, RWEOY, IRDM, AMRC, CWST",
        "created_utc": 1597625324,
        "id": "g1sgstr",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1597654124.0
    }
]