[
    {
        "author": "iminfam0us",
        "body": "Fuck Daylight savings, literally cucked us by having to wait an extra hour to see futures today now.",
        "created_utc": 1604253888,
        "id": "gat9plc",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1604282688.0
    },
    {
        "author": "thatsgrossilikeit",
        "body": "I'm living day by day, there won't be a crash next week that's all I meant. The US is probably heading towards a major economic crisis in the coming years but for now let's party like it's 1928",
        "created_utc": 1604266568,
        "id": "gau006o",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1604295368.0
    },
    {
        "author": "West_Tea",
        "body": "I’m kinda amazed by the bullish sentiment on this sub right now.",
        "created_utc": 1604254625,
        "id": "gatb6pf",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1604283425.0
    },
    {
        "author": "ConsciousStrugglez",
        "body": "Took me 3 fucking months to convert from a bear to a bull, now I need to go back to bear? \nfuck me.",
        "created_utc": 1604263203,
        "id": "gatt2jq",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1604292003.0
    },
    {
        "author": "Ashamed-Unit1004",
        "body": "I was hopeful for Monday recovery after all the bearish comments here yesterday. Too many bulls now so we're fucked.",
        "created_utc": 1604255181,
        "id": "gatcchs",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1604283981.0
    },
    {
        "author": "iamchromes",
        "body": "US is on hard mode. Been looking for a job for 3 mths now",
        "created_utc": 1604251029,
        "id": "gat48ll",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1604279829.0
    },
    {
        "author": "SurgeonLoki",
        "body": "As a German I appreciate this sub. I can now permanently shitpost about murica during lockdown while being lowkey jealous",
        "created_utc": 1604266371,
        "id": "gatzm58",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1604295171.0
    },
    {
        "author": "Zamoon",
        "body": "What's your ticker bitch. If you don't have one ipo right now",
        "created_utc": 1604264779,
        "id": "gatwehn",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1604293579.0
    },
    {
        "author": "MemeticEntity",
        "body": "They canceled futures we only have the weekend dow now",
        "created_utc": 1604259355,
        "id": "gatl316",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1604288155.0
    },
    {
        "author": "BlackcockInvestments",
        "body": "Are you retards really thinking futures open now...turn back your clock Jesus.",
        "created_utc": 1604268019,
        "id": "gau2uwu",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1604296819.0
    },
    {
        "author": "nathrakh1349",
        "body": "While others are seemingly getting more bearish here, I am more convinced than ever that a melt-up is coming soon and I now think my S&amp;P 4500 target may prove to be too low.",
        "created_utc": 1604260882,
        "id": "gato996",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1604289682.0
    },
    {
        "author": "TakeTeen",
        "body": "election day is two days from now dolt",
        "created_utc": 1604268448,
        "id": "gau3oax",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604297248.0
    },
    {
        "author": "LicenseToChill32",
        "body": "I’m already hammered and kickoff is still 15 minutes away kill me now",
        "created_utc": 1604252804,
        "id": "gat7lqa",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604281604.0
    },
    {
        "author": "IronManKillsThanos",
        "body": "Calling it now. \n\n\nVote is tied for a week while the nation waits for Florida to get their shitty results together again.",
        "created_utc": 1604267983,
        "id": "gau2scj",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604296783.0
    },
    {
        "author": "BlueKnightJoe",
        "body": "The IRS has been neutered. They only audit the poors now.",
        "created_utc": 1604258506,
        "id": "gatjb9l",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604287306.0
    },
    {
        "author": "SolitaryEgg",
        "body": "People thought tech calls were free money, and they were for like 8 months straight.\n\nNow people think puts are free money, and they have been for almost a month.\n\n\nThe market will surprise you, *eventually.* That's not a good excuse to fight the trend.",
        "created_utc": 1604253208,
        "id": "gat8dhh",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604282008.0
    },
    {
        "author": "dwdsquared2",
        "body": "Battleship is on HBO Max now if you want to watch a incredibly ridiculous and fun movie.",
        "created_utc": 1604257111,
        "id": "gatgd8z",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604285911.0
    },
    {
        "author": "BuyThoseDips",
        "body": "God my life has fucking sucked since Covid...and now I have it",
        "created_utc": 1604248118,
        "id": "gasyu2v",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604276918.0
    },
    {
        "author": "mynamesadrian",
        "body": "I’m the most bullish human in existence right now, can’t wait to show you all my losses eow",
        "created_utc": 1604256513,
        "id": "gatf496",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604285313.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "I have a deep, deep regret of staying with my college girlfriend from freshman year until 25. Now all of my friends are scattered around the country. Feel like I wasted my 20s. My ex is dumb as shit. The fuck was I thinking.",
        "created_utc": 1604250760,
        "id": "gat3q9l",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604279560.0
    },
    {
        "author": "nameofundefined",
        "body": "What other options are there? So I’ve got rental property now what just let the cash pile up or buy Pokémon cards?",
        "created_utc": 1604253058,
        "id": "gat8377",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1604281858.0
    },
    {
        "author": "Ipayforsex69",
        "body": "I remember the first time I was banned from r/investing because I brought too much WSB over.  Now I'll happily DCA and invest in high dividend yield ETFs while simultaneously maxing out my Roth and Traditional IRA's.  No more yoloing like there's an endless stream of cash.",
        "created_utc": 1604264174,
        "id": "gatv5mo",
        "score": 5,
        "subreddit": "investing",
        "created": 1604292974.0
    },
    {
        "author": "BlackcockInvestments",
        "body": "Had friends move from NY to Austin, they love it. And here I am waiting for lockdown part 2...drinking starts early now",
        "created_utc": 1604268849,
        "id": "gau4geu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604297649.0
    },
    {
        "author": "perf1620",
        "body": "Nope. I own dividend etfs now so I don't feel like killing myself",
        "created_utc": 1604257752,
        "id": "gathq1z",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604286552.0
    },
    {
        "author": "jjmjasz",
        "body": "Another poorly written post with ulterior motive to pump a stock. ROOT did not go public on Friday. Opening price was $27 on Wednesday and now at $24. What’s their competitive advantage? How are they different than LEMONADE?\n\nHere’s a free tip for you, car insurance made massive amounts of money during the pandemic because well you know, folks weren’t driving as much. What’s gonna happen when more people are out on the road? Are their underwriting capabilities better than more established insurance companies?\n\nTime to short!",
        "created_utc": 1604265975,
        "id": "gatytky",
        "score": 5,
        "subreddit": "stocks",
        "created": 1604294775.0
    },
    {
        "author": "stonkpicks",
        "body": "I think the market certainly gives a little bit of fucks now",
        "created_utc": 1604248316,
        "id": "gasz79i",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604277116.0
    },
    {
        "author": "MrRigobertos",
        "body": "Now that’s some beta boy type of thinking",
        "created_utc": 1604261847,
        "id": "gatq8bi",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604290647.0
    },
    {
        "author": "VercingetorixIII",
        "body": "No, not right now",
        "created_utc": 1604252347,
        "id": "gat6qu0",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604281147.0
    },
    {
        "author": "SixOneFive615",
        "body": "Now invest it in Draftkings calls and watch it disappear.",
        "created_utc": 1604264964,
        "id": "gatws2k",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604293764.0
    },
    {
        "author": "-Charkk",
        "body": "They were the slightly better version of MCD just considering fundamentals. Made a quick 38% gain and now I'm out.",
        "created_utc": 1604254109,
        "id": "gata57j",
        "score": 4,
        "subreddit": "investing",
        "created": 1604282909.0
    },
    {
        "author": "ZarrCon",
        "body": "One way I like to visualize dividend growth investing is by using Visa as an example. A lot of people might look at its current yield of 0.70% and think it would be a terrible dividend stock to own because they yield is so low. But when you look at the actual dividend amounts things start to become a lot more clear.\n\nIn 2009, Visa paid a dividend of $0.10 a share. In 2019 they paid a dividend of $1.00 a share. Visa's stock price was around $20 in 2009, so if we use that as our cost basis, the current dividend yield we'd be receiving from shares purchased in 2009 would be 5% (known as yield on cost). So basically even though Visa currently yields 0.70% to anyone buying today, that doesn't mean everyone holding shares is making 0.70% on their investment. \n\nThis is one of the reasons Warren Buffet has been so successful over the years. For example, his cost basis on Coca Cola is $3.25 per share, and the stock currently pays a dividend of $1.64 per share. This means Buffet's yield on cost is over 50%. He invested $1.3B in KO back in the late 80s and early 90s, and will now collect $654 million in income from the stock this year alone.",
        "created_utc": 1604259628,
        "id": "gatlmlg",
        "score": 4,
        "subreddit": "stocks",
        "created": 1604288428.0
    },
    {
        "author": "VeganBelt",
        "body": "Climate Change is not just a random prediction like some of those you mentioned, we are seeing real data right now proving the planet is changing",
        "created_utc": 1604261287,
        "id": "gatp3ct",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1604290087.0
    },
    {
        "author": "WendysRestaurants",
        "body": "Your dream has been priced in for weeks now brah",
        "created_utc": 1604253431,
        "id": "gat8svc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604282231.0
    },
    {
        "author": "Ze_Hydra1",
        "body": "What's Masa up to now? Idiot wants to lose all the tendies so soon..",
        "created_utc": 1604256704,
        "id": "gatfipb",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604285504.0
    },
    {
        "author": "Mihabe",
        "body": "Thanks! Now we also know where the „doesn’t look like a hedge“ comes from. Was it so hard to write 60k spx puts bought on IB?",
        "created_utc": 1604258840,
        "id": "gatk0m6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604287640.0
    },
    {
        "author": "papaken69420",
        "body": "Tim Apple to announce Monday he spent apples cash reserves on tsla 10/30 500c’s that expired worthless and they are now filing for Ch. 11 so my puts can print",
        "created_utc": 1604260359,
        "id": "gatn5py",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604289159.0
    },
    {
        "author": "Super-zero-0",
        "body": "Are you 5yrs old? \n\nNow go eat your Halloween candy while you mama pats you on the head and tells you you're special.",
        "created_utc": 1604254379,
        "id": "gataoqc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604283179.0
    },
    {
        "author": "orchid_breeder",
        "body": "I’ve been a bear since February. And I can make a bull case right now.  \n\nVaccine is close, fed has indicated they would buy ETFs in extreme circumstances.",
        "created_utc": 1604267434,
        "id": "gau1p39",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604296234.0
    },
    {
        "author": "wsb_gang",
        "body": "I was worry about Market going to go back to the good old days like January 2020 where .025% got everyone excited.\n\nNow unless we get a +-3% swing everyone is like. MARKET IS SO BORING.",
        "created_utc": 1604248197,
        "id": "gasyzb3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604276997.0
    },
    {
        "author": "burrowed_greentext",
        "body": "Speak for urself man I'm 27 right now and I promise u everyone remembers that time in high school that becky unfollowed jessica because jessica liked her boyfriend's ig picture",
        "created_utc": 1604249422,
        "id": "gat18be",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604278222.0
    },
    {
        "author": "DrCommonMan",
        "body": "You get paid the share price that the company was bought for.\n\nIt’s at $99.00 a share right now and you will get paid 106.50 per share. A gain of $7.50 over whatever you own it at. Hopefully less than $106.50",
        "created_utc": 1604256795,
        "id": "gatfpl8",
        "score": 3,
        "subreddit": "investing",
        "created": 1604285595.0
    },
    {
        "author": "UsernameTaken_123",
        "body": "Do you have faith in God above  \nIf the Bible tells you so  \nNow do you believe in rock 'n roll  \nAnd can music save your mortal soul  \nAnd can you teach me how to dance real slow",
        "created_utc": 1604260258,
        "id": "gatmy3q",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604289058.0
    },
    {
        "author": "Bolkonsky999",
        "body": "i am all in on spt and ccl puts, and only thing worrying me about my positions is tech. amazon is already at 3000, msft at 200, i don't think they'll go much lower than that. Now, I am hoping tech won't move much on monday while everything else tanks, so spy goes down. i should be buying dia puts instead haha",
        "created_utc": 1604252963,
        "id": "gat7wpg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604281763.0
    },
    {
        "author": "meatsmoothie82",
        "body": "Nah. Money was made of money back then- now it’s just bullshit and goes up no matter what. Buy calls and quit worrying so much.",
        "created_utc": 1604264793,
        "id": "gatwfle",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604293593.0
    },
    {
        "author": "SovietPenguin69",
        "body": "8 min from now",
        "created_utc": 1604267553,
        "id": "gau1xl3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604296353.0
    },
    {
        "author": "StarWolf478",
        "body": "As someone that has debated whether or not I should buy Square stock for a while now and has come close to buying at times, I can tell you that Jack Dorsey's interview with congress pushed me more towards the \"don't buy\" side.\n\nManagement is one of the top 5 most important qualities that I look for when deciding which stocks to buy and I got a very bad impression of Jack Dorsey after watching his interview with congress. For a while now, I've heard some people say that Jack Dorsey is \"the next Steve Jobs\"; well, I did not see anything close to \"the next Steve Jobs\" in that interview; Steve Jobs would have handled that situation far better. Dorsey didn't even come across as an average CEO; he came across as \"THIS bum is the CEO of multi-billion dollar companies? WTF?\" Dorsey looked like he was drugged out of his mind during the interview and did not come across as the intelligent leader that I want to see in companies that I invest in.\n\nFrom what I've seen in YouTube comments of those interviews, many other people got the same bad impression of Jack Dorsey from those interviews that I did, so I can definitely see how this would negatively effect the stocks of his companies. It has certainly kept me from buying.",
        "created_utc": 1604258653,
        "id": "gatjmbe",
        "score": 3,
        "subreddit": "investing",
        "created": 1604287453.0
    },
    {
        "author": "dum_townerino",
        "body": "Austria now on lockdown too",
        "created_utc": 1604262724,
        "id": "gats21o",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604291524.0
    },
    {
        "author": "saltyhasp",
        "body": "Me too... 2000 to 2010 was another example of a lost decade.  It is fairly common that stocks have no gains for a decade.  We are due for another one of these at some point but no one knows when.  My guess somewhere between now and 10 years from now.",
        "created_utc": 1604262445,
        "id": "gatrgsq",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1604291245.0
    },
    {
        "author": "cbus20122",
        "body": "&gt;that if we’re faced with low growth and inflation expectations then this is where assets should be priced.\n\nBased on what model? Low growth + inflation implies higher real rates, which imply strong tightening of financial conditions. You think in that scenario stocks are priced rationally?\n\nThe whole narrative that stocks are expensive because yields are low should work both ways. If yields rise (due to inflation) stocks should then see a lot of selling, especially in longer duration exposures.\n\nLow growth + inflation expectations, if that were to actually occur, implies heavy P/E contraction in the coming years. That's assuming those expectations are actually discounting the correct things which they very well may not be.\n\nThat either gives you a 1970's type scenario, in which bonds get wrecked and stocks tread water relative to inflation, or more of a depression type deflationary scenario, in which case stocks **surely** are not priced properly.\n\nThe issue with any inflationary scenario is that if it truly gets going in any form (scenario 1 here where we see something similar to the 70's), we're in for a lot more trouble than we can handle. There is far too much debt for the economy to handle inflation pressures, and any increase in bond yields will result in massive tightening of financial conditions. That scenario likely ends up leading into a deflationary spiral in the end. There is a reason we saw a 20% drawdown in 2018. The global economy simply can't handle rate increases which inflation would cause.\n\nAs for any comparison to the the 1970's, the macro environment then was far different than now - they had very strong demographics, very low non-public debt, and the inflation was largely based on **demand** along with a few supply shocks\\*\\*.\\*\\* Globally, we couldn't be more opposite of that right now.\n\nOverall, the only particularly great argument for valuations right now is that there simply are no other great alternatives, and there has been no need to de-leverage due to the ability to lower rates and keep yields at or below zero globally. This, and the fact that unlike 08', governments are doing their best to not allow defaults of major companies, which has kept the market at least relatively orderly and prevented forced de-leveraging.\n\nIn my personal opinion, the trigger for any real longer-term recession or depression of any sort will come from inflation rising past an ever-falling threshold of growth. The \"level\" of financial tightening represented by yields has been falling for 40 years.\n\n* In 08', they over-tightened to the point where 5% caused the debt overburden to blow things up.\n* In 2018, 2.5% was getting far too tight, mandating emergency rate cuts going into 2019.\n\nNow? Debt burdens have expanded drastically post-covid, and banks are not lending very much at all. This causes a drawdown in supply, which increases overall inflation on a longer-term basis. So you get a scenario where the economy likely couldn't handle bond rates much past 1% (and that's being incredibly generous), yet the conditions for future inflation **relative to real growth** are growing.\n\nI certainly don't think the financial system is going to blow up tomorrow by any means, but we are getting close to the boundaries of the financial system to keep operating in the same way it has over the last 40 years, and any significant change, which becomes more likely the closer we get to those boundaries implies strong turbulence in the next 3-5 years.",
        "created_utc": 1604262737,
        "id": "gats338",
        "score": 3,
        "subreddit": "investing",
        "created": 1604291537.0
    },
    {
        "author": "MasterCookSwag",
        "body": "Everything is expensive right now, more expensive than it’s really ever been.  But what most people here don’t really understand is that if we’re faced with low growth and inflation expectations then this is where assets should be priced.",
        "created_utc": 1604255071,
        "id": "gatc3rc",
        "score": 3,
        "subreddit": "investing",
        "created": 1604283871.0
    },
    {
        "author": "shawnz",
        "body": "I do own a small percentage of BTC but this is way too much, you are talking about 37% of his portfolio.\n\nBitcoin is a promising new asset class which very well might be undervalued right now but in the long term, bitcoin is not expected to grow continually like stocks, since it is not like a business which can use your money to create profits. It is not a good long term investment except *maybe* as an inflation hedge, but that is not really proven yet",
        "created_utc": 1604266084,
        "id": "gatz1k1",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1604294884.0
    },
    {
        "author": "chewtality",
        "body": "In 2009 the market was over 50% off it's highs. Remind me, where is it now exactly?",
        "created_utc": 1604258446,
        "id": "gatj6p5",
        "score": 3,
        "subreddit": "investing",
        "created": 1604287246.0
    },
    {
        "author": "mobius_stripper420",
        "body": "What? You can do this now?",
        "created_utc": 1604261451,
        "id": "gatpfa8",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1604290251.0
    },
    {
        "author": "tsla500eod",
        "body": "Praise Jesus Mary &amp; Joseph my gym is finally reopening tomorrow! Now I can squat all my frustrations with DKNG out",
        "created_utc": 1604261919,
        "id": "gatqdk3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604290719.0
    },
    {
        "author": "DegenOptions",
        "body": "Where the fuck you see futures now? Cause weekend dow aint fucking futures hombre",
        "created_utc": 1604257160,
        "id": "gatggw8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604285960.0
    },
    {
        "author": "capitalistsanta",
        "body": "Stocks are too over priced. They were meant to be these transfers of wealth, but now they're reserved for the wealthy. If stocks crash, I think Crypto currency markets really take off steam: they're built for small and medium sized business for funding and have a more practical use case, imo, for the world economy, similar to how the stock market first started.",
        "created_utc": 1604265042,
        "id": "gatwxlo",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1604293842.0
    },
    {
        "author": "Lahym",
        "body": "I'm Canadian using TD, trading fees are $10. Working with \\~$10,000 right now. Does Canada have any decent alternatives with lower trading fees, (main ones like RH aren't available here) ideally won't charge me harshly for converting to USD?",
        "created_utc": 1604264459,
        "id": "gatvr8a",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604293259.0
    },
    {
        "author": "itschaboy___",
        "body": "Should trade at a small discount to the take out price given the risk the deal doesn't close and time-value considerations. This is now in the merger arb ballpark",
        "created_utc": 1604264039,
        "id": "gatuv4m",
        "score": 2,
        "subreddit": "investing",
        "created": 1604292839.0
    },
    {
        "author": "MagesticDorito",
        "body": "Agree. I honestly haven't spent much time on the site. I created it 5 days ago and spent most of my time manually entering trade history which was loads of fun, let me assure you\n\nNow....I do have running P/L in my yearly reports: [2019](https://wealthyoption.com/performance/year/2019) &amp; [2020](https://wealthyoption.com/performance/year/2020). Just in case you haven't noticed that yet. I don't have running P/L in my lifetime trade log, though. That was a little more difficult to add, so I just skipped it. If I do add it later, I'll let you know in case you're still following the trades.",
        "created_utc": 1604264120,
        "id": "gatv1jk",
        "score": 2,
        "subreddit": "options",
        "created": 1604292920.0
    },
    {
        "author": "ajsforlife",
        "body": "You’d need 5k$ at expiration but u don’t have to exercise the option. If you sell the option ITM before expiration you lose or gain just difference I. Option price so say you pay 200 and now it’s worth 2.4$ each so 240$ you gain 40$ if you sell contract before expiration",
        "created_utc": 1604257899,
        "id": "gati11z",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1604286699.0
    },
    {
        "author": "romizzle612",
        "body": "Also a large majority of their members using the cashapp direct deposit were depositing their stimulus checks. Now that stimulus support is in jeopardy it is likely SQ will lose a large percentage of their customer base.",
        "created_utc": 1604253782,
        "id": "gat9i4d",
        "score": 2,
        "subreddit": "investing",
        "created": 1604282582.0
    },
    {
        "author": "WillingCommittee",
        "body": "We are not in a bear market right now",
        "created_utc": 1604257603,
        "id": "gather8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604286403.0
    },
    {
        "author": "123elvesarefake123",
        "body": "Time didn’t change for the entire world, futures so late now for europoors :(",
        "created_utc": 1604268267,
        "id": "gau3bse",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604297067.0
    },
    {
        "author": "DarkStar668",
        "body": "How the fuck has Plant Fitness not drilled? I tend to laugh off anecdotal evidence and personal experiences, but I go to 3 different ones and they all appear to have about half the traffic they used to and this has been consistent for months now. The locations I go to are in politically red areas too, so I don't see it being purely out of fear.\n\nMy only thought is that people are too lazy to cancel and PLNT just keeps charging their accounts. Employees have told me they had tons of cancellations, but I know that doesn't necessarily mean anything outside of my region.",
        "created_utc": 1604253803,
        "id": "gat9jk8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604282603.0
    },
    {
        "author": "WinnerBuyDefault1",
        "body": "How bout now",
        "created_utc": 1604254512,
        "id": "gataye4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604283312.0
    },
    {
        "author": "Logophi1e",
        "body": "If it’s wasn’t overvalued then yes I would get tired of hearing it. But it is and so I’m not. People only get frustrated hearing this because they want their stocks to keep going up up up all the time which is just not sustainable, and is what has been happening. Valuations are extremely high right now not because the companies are actually worth that much but because most investors expect the government and the fed to continuously pump the market. Reminds me of the “unsinkable” Titanic. It’s delusional and needs to come back to reality. Not saying we need an insane crash but there shouldn’t be an expectation that “stocks only go up”. If it weren’t for QE and government stimulus, the market wouldn’t be anywhere close to where it is today and you can’t deny that. That is why saying it is overvalued is completely reasonable and actually logical.\n\nEdit: so because I changed one letter in the word stocks my entire post was removed? Very funny. Auto mods are a joke because they fail to understand context and instead remove posts simply for the use of certain words. All my points still stand.",
        "created_utc": 1604256951,
        "id": "gatg1aw",
        "score": 2,
        "subreddit": "investing",
        "created": 1604285751.0
    },
    {
        "author": "I_Know_KungFu",
        "body": "Obviously they though you were smart to do something you’d be good at! I’m glad my dad (also an engineer) gently nudged me towards it. I’d have ended up doing sales probably and while I’d probably be making more money now, those people skills help make my job now a lot easier.",
        "created_utc": 1604260253,
        "id": "gatmxrd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604289053.0
    },
    {
        "author": "BlackcockInvestments",
        "body": "I live in NY, shit is now terrible here. Aside from paying some of the highest taxes in the nation, anything that is open is jammed pack and people are already planning for a lockdown sequel.",
        "created_utc": 1604262398,
        "id": "gatrd5x",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604291198.0
    },
    {
        "author": "Rebellious_Mennonite",
        "body": "HISA is now an oxymoron thanks to the BoC. I can’t see her being an avid day-trader so if she has enough capital she should just buy and hold low volatility equities/ETFs. My grandmother’s broker was taking her to the cleaners every year with his fees so watch out for that. I set her up with options and sell covered calls on her Canadian bank stocks. With the VIX at these levels, you literally cannot lose money selling covered leaps and can easily snap up 10-15% on the premiums.",
        "created_utc": 1604248493,
        "id": "gaszizk",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1604277293.0
    },
    {
        "author": "fistymonkey1337",
        "body": "If you're not an investor than why are you on this sub? \n\nba dum tis! bazinga! #dadjoke \n\n...I'll leave now",
        "created_utc": 1604250069,
        "id": "gat2fj5",
        "score": 2,
        "subreddit": "investing",
        "created": 1604278869.0
    },
    {
        "author": "SudsAde6985",
        "body": "I’m no bull, but if MSFT closes below 200 any day before next earnings, I’d be surprised. Shorted it at 210 &amp; 225 this summer. Got to 196.25 for a moment, but still closed @ 202. Flirted with it lately, but now long 195 again on Friday. Most confident trade I made last week. Considering I’m getting slaughtered in my TUP short at the moment. Who’da thunk?",
        "created_utc": 1604252224,
        "id": "gat6inh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604281024.0
    },
    {
        "author": "7thAccountDontDelete",
        "body": "Individual companies is a valid investing strategy and shouldn’t be ignored. If you’re looking for value right now it might be smart to go for individual stocks or sector ETFs.",
        "created_utc": 1604264824,
        "id": "gatwhto",
        "score": 2,
        "subreddit": "investing",
        "created": 1604293624.0
    },
    {
        "author": "yaboigoat53",
        "body": "Boeing is completely useless right now...",
        "created_utc": 1604265342,
        "id": "gatxjv2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604294142.0
    },
    {
        "author": "TakeaRun",
        "body": "We have to wait an extra hour for futures? What now",
        "created_utc": 1604257308,
        "id": "gatgsa1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604286108.0
    },
    {
        "author": "LehmanParty",
        "body": "Do you see how TLT rose during the initial crash and then plummeted after the sustained selloff? And then this week it went down with the market? The countercyclicals have been moving with cyclicals now and will be sold to maintain collateral requirements if requirements increase due to extreme volatility. There's a similar argument for gold and utilities. TLT doesn't have much more of an upside until the proposal of negative rates begins to appear. People would be more likely to flee to IG corporate bonds in the event of a scare than to treasuries, though this time there wouldn't be a sustained liquidity crunch due to a better preparedness for such an event.",
        "created_utc": 1604266014,
        "id": "gatywch",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604294814.0
    },
    {
        "author": "antelope591",
        "body": "With that kind of loss u might as well hold. Dumb time to sell right now anyway",
        "created_utc": 1604266862,
        "id": "gau0kmy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604295662.0
    },
    {
        "author": "upsidedownbovine",
        "body": "I’m pretty sure tomorrow and Tuesday are going to be low volume days as people collectively hold their breath. Either candidate is priced in now. It’s the uncertainty… might sell calls to take advantage of volatility.",
        "created_utc": 1604265649,
        "id": "gaty5po",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604294449.0
    },
    {
        "author": "LUV2FUKMARRIEDMILFS",
        "body": "Then that degree would not be that easy and yes \n\nNow we are talking",
        "created_utc": 1604266753,
        "id": "gau0cy5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604295553.0
    },
    {
        "author": "tfogg2",
        "body": "It’s official now. We’ll see in an hour 15 if the market has your best interests at heart lol",
        "created_utc": 1604267184,
        "id": "gau17f9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604295984.0
    },
    {
        "author": "why_wouldeye_ever",
        "body": "Definetly see your point but \n\nTo be fair, theres never been a better time in the last 3 months to hop into Tesla than right now. So they really haven't lost anything by grabbing the gains of the little guys while Tesla has trended downwards and sideways since the split.",
        "created_utc": 1604267561,
        "id": "gau1y9s",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604296361.0
    },
    {
        "author": "staunch_character",
        "body": "Added to that - interest rates are so low now that stocks are the only place to park your money.\n\nIn the 90s you could throw money into a 5 year GIC with guaranteed return of more than 5%. Bonds pay less than 1% now.",
        "created_utc": 1604267591,
        "id": "gau20ds",
        "score": 2,
        "subreddit": "options",
        "created": 1604296391.0
    },
    {
        "author": "AzazelPrays",
        "body": "It’s a minute later, how are things now?",
        "created_utc": 1604254219,
        "id": "gatad1a",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604283019.0
    },
    {
        "author": "Stonka69",
        "body": "Nonsense!!! Bullshit DD.\nIts novemBEAR\n\nhttps://www.reddit.com/r/wallstreetbets/comments/jm3a83/ok_g_bears_plans_ready_for_monday/\n\nNow, this is good DD! 100% puts!!!",
        "created_utc": 1604259028,
        "id": "gatkelo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604287828.0
    },
    {
        "author": "borntoperform",
        "body": "I’m born and raised in San Jose. Cisco used to be THE place to work if you lived in the suburbs close by. Now, that’s the place to work if you are a teacher. And by teacher, I don’t mean a school teacher. I mean “those who can’t do, teach.” Basically, you work at Cisco when you give up on your career.",
        "created_utc": 1604258804,
        "id": "gatjxro",
        "score": 2,
        "subreddit": "investing",
        "created": 1604287604.0
    },
    {
        "author": "spareAnoob",
        "body": "Wouldn’t you rather have a sweet car and a nice house right now on credit than saving up for 15 years in order to pick up the same thing with the only important difference of being 15 years older",
        "created_utc": 1604262454,
        "id": "gatrhhv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604291254.0
    },
    {
        "author": "7thAccountDontDelete",
        "body": "Yea it’s pretty funny... the same bears proclaiming that the market is overvalued now, I guarantee you most of them weren’t buying in March 2020 or December 2018... they were busy claiming that the market was gonna drop a lot further. \n\nAt the end of the day I think being a permabear is just their way of coping with the fact that they can’t handle market volatility or risk.",
        "created_utc": 1604262034,
        "id": "gatqmaj",
        "score": 2,
        "subreddit": "investing",
        "created": 1604290834.0
    },
    {
        "author": "GushingGranny1",
        "body": "Oh fuck you. Now my palms are sweaty",
        "created_utc": 1604264414,
        "id": "gatvnyg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604293214.0
    },
    {
        "author": "soyarriba",
        "body": "You basically just said “priced in” but in 100 words. Cmon now.",
        "created_utc": 1604263179,
        "id": "gatt0sf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604291979.0
    },
    {
        "author": "SaneLad",
        "body": "Imma get that after hours permission now to scratch the itch. But it's not the same without options trading.",
        "created_utc": 1604253075,
        "id": "gat84ey",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604281875.0
    },
    {
        "author": "rymor",
        "body": "The way I see it, the only real risk is opportunity cost, but there are several aspects to that. \n\nIf you have money in PIC, and the market crashes, the common shares might drop by only 5% to $9.50 while the market drops 30%. That’s good news, but what do you do now? \n\nIf you think the market is set for a quick recovery, you probably pull the SPAC money out and put it into AAPL or AMZN, hoping for a 35% bounce. \n\nSo, in that case, you would have been better off in cash when the market was shaky. The SPAC (eg PIC) will recover, to at least $10 and probably more. But it won’t give you a 35% recovery. So you’ve essentially given up 5% for your capital for no reason. \n\n Now, if you think the market will be consistently bad, you might stick it out and try to play the quasi arbitrage game. The SPACs you purchase below their trust value might earn you 2-5% if a) the share price recovers, or b) you redeem your shares at the merger vote. \n\nIf the latter, that could be a long wait. If the former, the overall market is likely to recover more quickly than PIC. PIC will bounce back to $10 right away, but AAPL is likely to hit $120 before PIC hits $11. \n\nSo, that’s sort of the paradox of SPACs as I see it. I’m currently parked in QELL, DGNR, IPOF, CCIV, RBAC, RTP, and SOAC. \n\nIf the market stays choppy for a few for months, which is likely (I don’t think we get any stimulus until Feb or so after a long drawn-out battle)... then SPACs might be a decent play... CCIV, SOAC, etc could announce a target and the price could jump 20% or more while the overall market is ranging. That’s a win. \n\nBut if the market is really bad, they’ll probably wait to announce an agreement, so you don’t gain much there. And if the market does bounce back (eg sooner than expected stimulus), you’re probably better off in AMZN.\n\nThe best SPAC play IMO is to be in cash in choppy market, and if/when the market plummets, scoop up warrants and units of the better SPACs at discounted prices (eg $9.50 for tier one units; sub $1 warrants for the best management team SPACs). \n\nBut then again, if you’re able to time the market that well, you could buy SHOP or LULU at deep discounts and do just as well.",
        "created_utc": 1604254719,
        "id": "gatbdle",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1604283519.0
    },
    {
        "author": "PeterMichaelPaints",
        "body": "A lot of people don't - they don't have the income to move out of the state. And with banks not loaning to anyone right now you can't get a mortgage.",
        "created_utc": 1604256648,
        "id": "gatfeff",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604285448.0
    },
    {
        "author": "Game__0n",
        "body": "Agree with this.  There is no downside and you are guaranteed to make at least a minimal return as long as you hold it to redemption.  The only reason it is so cheap is because it's a $2B SPAC, so there's a lot of supply.   And given all the new SPAC issues, recently,  the market is heavy right now.  Will take a few months for everything to clear out",
        "created_utc": 1604255594,
        "id": "gatd7xy",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1604284394.0
    },
    {
        "author": "Sorryimadik",
        "body": "I like the silver lining at the end, “$1 invested in 1900 is worth $58000 now.” Wow if only I had invested back then...",
        "created_utc": 1604255796,
        "id": "gatdmvf",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1604284596.0
    },
    {
        "author": "dum_townerino",
        "body": "Stop promoting that tard - I’ve seen three posts about him now",
        "created_utc": 1604255851,
        "id": "gatdqt5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604284651.0
    },
    {
        "author": "Peter_Banning",
        "body": "Wish I could load up on calls right now, for tomorrow",
        "created_utc": 1604265393,
        "id": "gatxnmt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604294193.0
    },
    {
        "author": "ThePeoplesBard",
        "body": "Woo girl, I got three legs of my four leg underdog moneyline parlay in. Hit on Dolphins, Bengals, and Raiders—now I need 9ers",
        "created_utc": 1604266192,
        "id": "gatz9bi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604294992.0
    },
    {
        "author": "mrh0057",
        "body": "The stock market is way overvalued and you need to understand more of why.  You can look at things like P/E ratios and that but there is another elephant in the room right now people are ignoring.  Most of the world's population is getting older and there will be a significantly smaller number of people working per retiree and wages have been flat or going down.  Then you have increased expenses for housing and healthcare (US only).  There already is negative outflows for years and no one is talking about what happens as it accelerates as boomers retire.  The stock market started to go up significantly when the US switched from pension funds to 401k.  Granted there are other factors driving the economy but you now have a significant flow of new money into the market. \n\nBTW, bonds are sold in markets and auctions so if the rate is low that means a significant portion of the investment world thinks the economy isn't in great shape.  Have to ask yourself why are willing to lend money so cheaply.  The bond market is something like 3x bigger than the stock market.  So the bonds are saying we don't believe the current rally and why would they when corporate profits have been nearly flat since 2012 before COVID and now have decreased significantly.",
        "created_utc": 1604266739,
        "id": "gau0bxk",
        "score": 2,
        "subreddit": "investing",
        "created": 1604295539.0
    },
    {
        "author": "1234567890-_-",
        "body": "why is nasdaq the only futures being trades now?\n\nnvm I think investing.com just glitched",
        "created_utc": 1604268150,
        "id": "gau343x",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604296950.0
    },
    {
        "author": "Thales111",
        "body": "Also vega is no longer a crowded trade anymore, the pump in aug/sept sold off dramatically and most late November puts have dramatically lower vol skew now vs two months ago",
        "created_utc": 1604259027,
        "id": "gatkeji",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604287827.0
    },
    {
        "author": "OnceALoser",
        "body": "I am waiting for iPad to go on sale so I can save $25. In a latest cursory look on my Robinhood account, I lost $5k last week. Hmm. Now I know why my girl calls me a retard.",
        "created_utc": 1604258344,
        "id": "gatiyoq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604287144.0
    },
    {
        "author": "-Jocko-",
        "body": "Tell me one good reason for buying Square over PayPal",
        "created_utc": 1604250270,
        "id": "gat2t05",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604279070.0
    },
    {
        "author": "ExtensionAd2828",
        "body": "square is literally the operating system for a small business. they offer workers comp insurance, run payroll, accounting features, and of course the cash register hardware. \n\npaypal isnt on that level",
        "created_utc": 1604250380,
        "id": "gat30kc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604279180.0
    },
    {
        "author": "Dmoan",
        "body": "I think SQ is better play as PYPL hasn’t sold off much",
        "created_utc": 1604252218,
        "id": "gat6iai",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604281018.0
    },
    {
        "author": "ToastedBagels991",
        "body": "thinking about going all in on paypal. how y’all think they’ll do?",
        "created_utc": 1604250179,
        "id": "gat2mue",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604278979.0
    },
    {
        "author": "Wade12323",
        "body": "Thoughts on PayPal? Might pop on earnings",
        "created_utc": 1604251844,
        "id": "gat5suz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604280644.0
    },
    {
        "author": "papi_shampuu",
        "body": "Selling my WM calls for PayPal calls selling Tuesday morning for marathon calls and alibaba calls YOLO",
        "created_utc": 1604266473,
        "id": "gatztip",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604295273.0
    },
    {
        "author": "Made_up_quote",
        "body": "Is PayPal still a thing?  The only websites I see this being actively pushed is eBay which is probably one of the reasons I no longer use eBay.",
        "created_utc": 1604239975,
        "id": "gasl0ru",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604268775.0
    },
    {
        "author": "AsAPLARKYY",
        "body": "God damn I have some paypal i missed close on, gotta cash out as soon as market opens just incase",
        "created_utc": 1604241035,
        "id": "gasmoju",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604269835.0
    },
    {
        "author": "wakuku",
        "body": "the only problem I have with this especially with Paypal is that even if they beat expectations, the current market can't make up their mind. People will then say its already priced in and such. I think if you already have them, then keep it But I would be wary with buying some tomorrow.",
        "created_utc": 1604244310,
        "id": "gasrza4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604273110.0
    },
    {
        "author": "Dmoan",
        "body": "If things settle down come Wednesday I will stick to what works which is stay at home stocks that are priced reasonably. Apple, ATVI, MSFT, SNE, CHWY, SQ or PYPL, UPS would be my plays",
        "created_utc": 1604249675,
        "id": "gat1oyn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604278475.0
    },
    {
        "author": "RemarkableScarcity8",
        "body": "I wanna buy cause it’s so low but I know that’ll just bite me in the ass... it’s low cause banks are overall down and wfc is facing major bad news cause of their bad business practice idk I’m not a banker.. virtual financial like PayPal are the future though",
        "created_utc": 1604258897,
        "id": "gatk4us",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604287697.0
    },
    {
        "author": "THE_MIGHTY_CHAD",
        "body": "Paypal’s new buy now pay later will take online transactions by storm. Many, many new users will sign up. Rates are half of the competition. Though merchants hate paypal by default, they will appreciate the lowered fees and increased sales.\n\nStill, you should choose square over paypal due to many more reasons.",
        "created_utc": 1604250642,
        "id": "gat3i4j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604279442.0
    },
    {
        "author": "TheAppleGuy25",
        "body": "Alibaba on the 5th, PayPal tmrw pre market",
        "created_utc": 1604243637,
        "id": "gasqtbw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604272437.0
    },
    {
        "author": "DenverNuggetz",
        "body": "PayPal owns Venmo",
        "created_utc": 1604244292,
        "id": "gasry2u",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604273092.0
    },
    {
        "author": "THE_MIGHTY_CHAD",
        "body": "Thinking of buying a bunch of paypal on monday if it continues dipping.\n\nAnyone thinking of doing the same?",
        "created_utc": 1604240483,
        "id": "gaslt71",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604269283.0
    },
    {
        "author": "ricke813",
        "body": "Animal health stocks (IDXX and ZTS): Should accelerate growth in 2021 after restrictions are lifted and people are more comfortable going to the vet. See the earnings call for IDXX, revenue growth and vet visits are actually positive this year because despite the restrictions... people still care about their pets and more people WFH = more first time pet owners\n\nLYV: What I learned is that most people don't care about social distancing and are ok with packing a venue to watch concerts and sports again. So many of the mom and pop shop venues are probably going to close due to $0 cash flow this year. As long as LYV can make it out alive until restrictions are lifted... the only competitor in there way will be pretty much AEG and they can continue its pre-COVID momentum. Warning... the stock hasn't dropped a lot for a company that is in a cash crunch and has +95% revenue decrease, which surprises me. E\nWhat won't surprise me if the stock drops to $20 - $45 and I'll be a buyer.\n\nV and MA: Should also accelerate growth once a vaccine is available and transactions are lifted. They should recover a big chunk of their spending volume and cross-border fees, but I think business travel is permanently impaired. Right now I'm a V holder, but I like PYPL a bit more as my favorite fintech.",
        "created_utc": 1604239455,
        "id": "gask81r",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604268255.0
    },
    {
        "author": "coolcomfort123",
        "body": "baba and paypal for the win.",
        "created_utc": 1604242418,
        "id": "gasosyx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604271218.0
    },
    {
        "author": "Dmoan",
        "body": "It on 11/5 AH, I like PYPL also but they are reporting tomorrow and will get lost in all this madness plus the stock has barely sold off",
        "created_utc": 1604228515,
        "id": "gas6dk3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604257315.0
    },
    {
        "author": "brereddit",
        "body": "If gdp spiked, PayPal will crush earnings",
        "created_utc": 1604266724,
        "id": "gau0ax9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604295524.0
    },
    {
        "author": "DenverNuggetz",
        "body": "40 million+ users and growing at a large rate.\n\nAdd that to PayPal’s already large userbase....pypl isn’t going anywhere soon.\n\nThe company is a great play alongside SQ as the biggest threats to the large payment processors like V.",
        "created_utc": 1604250841,
        "id": "gat3vqz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604279641.0
    },
    {
        "author": "Dmoan",
        "body": "Cash app (owned by SQ) is beating Paypal and Venmo app (owned by Paypal). PayPal was very slow to add features to Venmo allowing Cash app to beat them",
        "created_utc": 1604250828,
        "id": "gat3uvn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604279628.0
    },
    {
        "author": "mulemoment",
        "body": "Also, according to technical analysis, it's been way overbought this year and needs to correct. It looks like it'll stabilize at ~140, maybe ~120 with strong sell pressure.\n\nAlso they've been getting rewarded for revenue growth, but the revenue growth is from bitcoin which 1. they're barely profitable on and 2. are seeing a growth of competition in from companies like paypal.",
        "created_utc": 1604265372,
        "id": "gatxm4s",
        "score": -2,
        "subreddit": "investing",
        "created": 1604294172.0
    },
    {
        "author": "PandaGodFliesToMoon",
        "body": "who is playing pypl and swks today? calls or puts?",
        "created_utc": 1604343254,
        "id": "gax9efe",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604372054.0
    },
    {
        "author": "Boomtown626",
        "body": "Disagreed, I think they make more sense long-term, but reading your post just got me to go fractionally reduce exposure to MSFT, GOOGL, NFLX, and the chip-makers I have (AMD, NXPI, MRVL, SWKS, SOXX), because I want the cash available to buy the dip whenever this week's bloodbath happens, and I think reducing exposure there makes more sense in the short-term than reducing my holdings in the names that will be exposed to good vaccine news and good reopening news. \n\nRemember Moderna, Pfizer, and JNJ all have stage 3 vaccine trial results they plan to announce within the next month. If you wait until the news cycle starts reminding us, then you've already missed a bigger bounce than you can reasonably expect from this year's biggest tech winners over the next few weeks.",
        "created_utc": 1604347953,
        "id": "gaxj85f",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604376753.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  2nd of November\n\n\n\n## Upcoming events for Monday, November  2nd\n\n - Stock splits:\n\n    - MDLY @ **1:10**\n\n - Expected earnings:\n\n  ADTN, ADUS, AGRX, AIZ, AKTX, ALUS, ALX, AMC, AMCX, AMRC, ANET, ANH, APPF, ARGO, ARVN, ATXI, AWR, BCC, BKH, BRKR, BSM, BTE, BWXT, BYFC, CBFV, CCLP, CCXI, CDEV, CDK, CDLX, CDW, CINR, CLCT, CLX, CNA, CNO, CNTY, CORR, CPAC, CPE, CPLP, CRD.A, CRD.B, CRNT, CRUS, CTIC, CVI, CWH, DEA, DEI, DOOR, DRIO, DRRX, DSPG, EC, ECPG, EEX, EGRX, EL, ELVT, ENIA, ESPR, EVER, EVRI, EXTN, FANG, FBM, FE, FICO, FMC, FN, FNCB, FRPT, FTSI, FUNC, FUSB, G, GAIN, GHL, GIFI, HALO, HCKT, HGEN, HLIO, HMN, HNRG, HRTG, HSIC, HUD, HURN, HZNP, IAA, ICCH, ICHR, IHT, INGR, INSP, IOVA, IPI, IR, IRET, ISEE, ITIC, ITRI, ITUB, JAKK, JAZZ, JCOM, JLL, KFRC, KMPR, KMT, KNSA, KPTI, KRYS, L, LCII, LDOS, LEG, LITE, LL, LNT, LPG, MATX, MDLZ, MEC, MED, MG, MGP, MIME, MITT, MOS, MPC, MPLX, MRTX, MSGN, MVBF, MYGN, MYOK, NC, NCMI, NERV, NI, NNN, NPTN, NSP, NSSC, NTP, NTR, NWHM, NXE, O, OGS, OMI, ON, ONCS, ONTO, OSPN, OTTR, OXBR, OXLC, PAA, PACB, PAGP, PARR, PBR, PBR.A, PEAK, PINC, PMBC, PUMP, PYPL, QTNT, RGS, RIG, RMBS, RPAI, RVNC, RYAAY, SAMA, SANM, SBAC, SEDG, SIBN, SIMO, SNDX, SOGO, SOHU, SRC, SRRA, STE, STIM, STRL, SUP, SWKS, SYN, TCMD, TEN, TLGT, TMBR, TPTX, TREX, TRVG, TRVN, TYME, UAN, UROV, USFD, VCTR, VCYT, VEON, VNO, VNOM, WBK, WING, WLFC, WM, WMB, WMK, XENT, YRCW\n\n - Ex-div:\n\n  ASGI, ASML, BANR, BKEP, CAPL, ETRN, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, IID, ITUB, KEN, LBAI, LMRK, MET, SHLX, SPH, SRCE, USDP, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.100%)\n    - 6-Month Bill Auction (previous: 0.110%)\n    - Construction Spending (consensus: 0.9%, previous: 1.4%)\n    - Core PCE Price Index (previous: 0.3%)\n    - Core PCE Price Index (previous: 1.6%)\n    - ISM Manufacturing Employment (previous: 49.6)\n    - ISM Manufacturing New Orders Index (previous: 60.2)\n    - ISM Manufacturing PMI (consensus: 55.8, previous: 55.4)\n    - ISM Manufacturing Prices (consensus: 58.6, previous: 62.8)\n    - Investing.com Gold Index (actual: 56.5%, previous: 58.5%)\n    - Investing.com S&amp;P 500 Index (actual: 65.9%, previous: 58.7%)\n    - Loan Officer Survey\n    - Manufacturing PMI (previous: 53.3)\n    - PCE Price index (previous: 1.4)\n    - PCE price index (previous: 0.3%)\n    - Total Vehicle Sales (previous: 15.70M)\n\n## Upcoming events for Tuesday, November  3rd\n\n - Expected earnings:\n\n  ACET, ACOR, AGCO, AJX, AKR, ANAT, ANDE, APLS, AQB, ARA, ARCB, ARNC, AROC, ATH, ATHM, AUBN, AVD, AVNS, AVNT, BBGI, BBU, BCTX, BHC, BLD, BMCH, BRY, BTG, BTU, CARA, CARG, CBAY, CBD, CC, CGBD, CHCT, CHFS, CHSCP, CLSK, CLW, COHR, COKE, CORT, CPTA, CRIS, CRVL, CTLT, EAF, EMR, ES, ETN, ETRN, EURN, EXC, EXK, EXPD, FATE, FI, FOX, FOXA, FSP, GBLI, GCI, GLDD, GORO, GRFS, GSH, GTE, GTES, GWPH, HBM, HRZN, HSC, HTA, HUM, HY, HYRE, ICD, ICPT, INN, INS, IOSP, IPAR, IT, ITCI, JBGS, JCI, JELD, KAR, KE, KOPN, KRMD, LFC, LFVN, LGIH, LPX, LUNA, MBI, MCK, MCRB, MCS, MCY, MDNA, MDRR, METC, MOR, MRCY, MYL, NBR, NES, NEX, NEXT, NHC, NK, NP, NPO, NR, NRC, NSIT, OCFT, OCN, OMP, OPCH, ORA, OTEL, OXFD, PACD, PAYS, PEI, PFHD, PFIS, PKOH, PMD, PRU, PTRS, PTVCA, PTVCB, QUAD, RACE, RCM, RCUS, RHP, RNWK, RVI, SAVA, SCOR, SHIP, SIM, SMCI, SMIT, SPKE, SPR, STAR, SUPN, SYY, TCFC, TCON, TEF, TIMB, TISI, TREC, TRHC, TRI, TRMT, TTI, TX, UEC, UFPT, USAC, VIST, VIV, VPG, VSH, VSTM, W, WBT, WEC, WEYS, WLK, WLKP, WMG, WTRG, WTTR, XENE, XNCR, XOMA, Y, ZBRA, ZYME\n\n - Ex-div:\n\n  AIV, AMRB, BRO, CLX, EIG, FMX, HFWA, MCBS, PCB, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.140%)\n    - API Weekly Crude Oil Stock (previous: 4.577M)\n    - Durables Excluding Defense (previous: 3.4%)\n    - Factory Orders (consensus: 1.0%, previous: 0.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 55.2)\n    - ISM NY Business Conditions (previous: 56.1%)\n    - ISM-New York Index (previous: 807.3)\n    - Redbook (previous: 0.8%)\n    - Redbook (previous: 1.2%)\n    - U.S. Presidential Election\n\n## Upcoming events for Wednesday, November  4th\n\n - Expected earnings:\n\n  AAMC, ABIO, ACAD, ACIA, AE, AEE, AFIN, AGLE, AGM, AHCO, ALB, ALBO, ALL, ALLO, ALLT, ALSK, ALTM, AMEH, AMOT, AMSC, ANIK, ANSS, ANVS, APA, APEN, AQST, ARC, ARDX, ARTNA, ASC, ASTE, ATAX, ATEX, ATLO, AVA, AWK, AXNX, AZPN, BBD, BBDO, BBSI, BCH, BEP, BIDU, BIOL, BKCC, BKD, BKEP, BKTI, BLCM, BLPH, BRX, BSBR, BSGM, BWEN, CAPL, CBMG, CCAP, CCJ, CCRN, CCU, CDXC, CEA, CECE, CF, CFMS, CHEK, CHNG, CIA, CIB, CIM, CIX, CLFD, CLH, CLI, CMP, COHN, CPK, CRK, CRY, CSGS, CSII, CSTE, CTSO, CTVA, CUTR, CVU, CWBR, CXW, CYTK, DAR, DCP, DFIN, DHX, DK, DKL, DMAC, DNLI, DNOW, DRTT, DXPE, EGY, ELF, ELY, ENBL, ENLC, EPM, EPR, EPRT, EQH, ESSA, ET, EXPE, EXPI, EXR, FCRD, FIT, FLMN, FLXN, FNF, FNHC, FNV, FOE, FRG, FRGI, FROG, FRPH, FSTR, FTDR, FUN, GDDY, GDOT, GFL, GHC, GIB, GLMD, GLRE, GMAB, GMRE, GNK, GNW, GOL, GOOD, GPL, GPP, GPRE, GPRK, GRNQ, GRP.U, GTHX, H, HAE, HARP, HBB, HEP, HLNE, HLT, HNGR, HOFV, HOLX, HR, HST, IAG, IBOC, IDN, IGC, IIPR, IMXI, INFI, INGN, INPX, IO, IONS, IQ, ITI, JCAP, JKHY, KAMN, KBAL, KGC, KIDS, KLDO, KRUS, KW, KZR, LANC, LAND, LAZY, LBTYA, LBTYB, LBTYK, LC, LCI, LCTX, LHCG, LILA, LILAK, LMRK, LNC, LND, LPI, LPL, LRMR, LTBR, LTRPA, LTRPB, LUMN, LYRA, MCEP, MCHX, MDGL, MDU, MELI, MET, MFA, MGEE, MGNX, MIRM, MLAB, MLP, MLR, MLVF, MNKD, MOSY, MRCC, MRO, MRSN, MTCH, MTG, MTRX, MTW, NEWT, NGD, NHTC, NMFC, NODK, NTN, NUS, NWPX, OESX, OLN, ORCC, ORIC, ORTX, OSUR, OTIC, OUT, PAAS, PAHC, PATI, PAYC, PDCE, PDLB, PEBK, PFBI, PFGC, PING, PIRS, PLUS, PLYA, PODD, PRAH, PRGO, PRI, PRQR, PRTA, PSA, PSEC, PSN, PTGX, PXD, QCOM, QLYS, QRTEA, QRTEB, QRVO, QTWO, QUIK, RC, RCMT, RDN, RDWR, REI, RESI, REXN, RGLD, RGNX, RKDA, RLJ, RPD, RPT, RTLR, RYAM, SAFT, SBGI, SBOW, SENEA, SENEB, SG, SGA, SGMO, SGMS, SGRY, SITM, SJI, SJW, SLF, SMG, SMSI, SMTX, SPPI, SRDX, SRT, STAA, STN, SUN, SUZ, SWM, SWX, SYKE, SYNC, TA, TAC, TACT, TALO, TBIO, TELL, TG, TGA, TISI, TLK, TMDX, TPC, TPCO, TRC, TRMB, TRNO, TRTX, TS, TSLX, TTEC, TTGT, TTOO, TWO, TYL, UBX, UFCS, UHAL, UMH, UNVR, UPWK, USDP, USWS, VAC, VAPO, VBIV, VMD, VOYA, VRCA, VRSK, VRT, VST, VTOL, VTVT, VVNT, VYGR, WEN, WHD, WHLR, WK, WRN, WSTG, WTI, WTM, WTS, WYNN, XAN, XEC, ZAGG, ZNGA, ZNH, ZYNE\n\n - Ex-div:\n\n  AMG, AWI, BBD, BBDO, CATC, CFBK, FELE, HESM, IBCP, IDA, LSBK, MTRN, NEP, NWBI, OFED, PVBC, STBA, VBTX, WSFS, XYL\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 650K, previous: 749K)\n    - All Car Sales (previous: 3.75M)\n    - All Truck Sales (previous: 12.59M)\n    - Crude Oil Imports (previous: 0.122M)\n    - Crude Oil Inventories (previous: 4.320M)\n    - Cushing Crude Oil Inventories (previous: -0.422M)\n    - Distillate Fuel Production (previous: -0.005M)\n    - EIA Refinery Crude Runs  (previous: 0.362M)\n    - EIA Weekly Distillates Stocks (previous: -4.491M)\n    - EIA Weekly Refinery Utilization Rates (previous: 1.7%)\n    - Exports (previous: 171.90B)\n    - Gasoline Inventories (previous: -0.892M)\n    - Gasoline Production (previous: 0.162M)\n    - Heating Oil Stockpiles (previous: -0.299M)\n    - ISM Non-Manufacturing Business Activity (previous: 63.0)\n    - ISM Non-Manufacturing Employment (previous: 51.8)\n    - ISM Non-Manufacturing New Orders (previous: 61.5)\n    - ISM Non-Manufacturing PMI (consensus: 57.5, previous: 57.8)\n    - ISM Non-Manufacturing Prices (previous: 59.0)\n    - Imports (previous: 239.00B)\n    - MBA 30-Year Mortgage Rate (previous: 3.00%)\n    - MBA Mortgage Applications (previous: 1.7%)\n    - MBA Purchase Index (previous: 305.2)\n    - Markit Composite PMI (consensus: 55.5, previous: 54.3)\n    - Mortgage Market Index (previous: 807.8)\n    - Mortgage Refinance Index (previous: 3,711.6)\n    - Seevol Cushing Storage Report (previous: -2.538M)\n    - Services PMI (consensus: 56.0, previous: 54.6)\n    - Trade Balance (consensus: -64.00B, previous: -67.10B)\n\n^^^^2020-11-02",
        "created_utc": 1604314822,
        "id": "gavwe93",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1604343622.0
    }
]