[
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "*Public Service Announcement*:  \n  \nMost of the leading fabless semiconductor companies such as **Advanced Micro Devices (AMD), Apple Inc., Broadcom Inc., Marvell, MediaTek, Nvidia, and Qualcomm** are customers of TSMC, as well as emerging companies such as Allwinner Technology, HiSilicon, Spectra7, and Spreadtrum. Leading programmable logic device companies Xilinx and previously Altera also make or made use of TSMC's foundry services. Some integrated device manufacturers that have their own fabrication facilities like **Intel, STMicroelectronics and Texas Instruments** outsource some of their production to TSMC.  \n  \n#TSM",
        "created_utc": 1600185829,
        "id": "g5d9w5u",
        "permalink": "/r/wallstreetbets/comments/it5xpg/daily_discussion_thread_for_september_15_2020/g5d9w5u/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600214629.0
    },
    {
        "author": "bitesizednambypamby",
        "body": "This must be the back to school selloff so parents can afford TI-84 calculators. Calls on TXN.",
        "created_utc": 1599146689,
        "id": "g3uvkv2",
        "permalink": "/r/wallstreetbets/comments/ilqp2l/daily_discussion_thread_for_september_03_2020/g3uvkv2/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599175489.0
    },
    {
        "author": "chri0311",
        "body": "Puts on Texas Instruments",
        "created_utc": 1600808305,
        "id": "g694azp",
        "permalink": "/r/wallstreetbets/comments/ixvl6q/tsla_calls_to_the_moon/g694azp/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600837105.0
    },
    {
        "author": "bcuzofdaimplication",
        "body": "If AAPL is reasonably in the green tomorrow, I might sell some of my calls and buy some calls for TXN",
        "created_utc": 1599112206,
        "id": "g3tcn26",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3tcn26/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599141006.0
    },
    {
        "author": "kw2024",
        "body": "Clicked on a random thread and holy shit those guys are bigger retards then us\n\nThe top reply said “Texas Instruments - other than calculators, they’re not really going anywhere.”\n\nBro you have to realize they make more than calculators, right? I feel like even y’all would know that.",
        "created_utc": 1599705758,
        "id": "g4m6twm",
        "permalink": "/r/wallstreetbets/comments/ipnztr/what_are_your_moves_tomorrow_september_10_2020/g4m6twm/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599734558.0
    },
    {
        "author": "Snoo_96430",
        "body": "I'm getting a tattoo never hold thru earnings, KR then TXN now RKT good companies that crushed ER and just drill God speed RKT gang my 26c did not print.",
        "created_utc": 1599087557,
        "id": "g3s54oo",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3s54oo/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599116357.0
    },
    {
        "author": "abstract__art",
        "body": "Can someone do a semi conductors for idiots and what different types each of the main companies make ?\n\nAmd \nIntel \nNvidia \nTsm \nQuallcom \nTexas Instruments \nEtc.   seems like so many of these guys I don’t know what’s good on one vs other",
        "created_utc": 1599281402,
        "id": "g4319qv",
        "permalink": "/r/investing/comments/imsxne/nvidia_will_be_the_first_1_trillion_dollar/g4319qv/",
        "score": 3,
        "subreddit": "investing",
        "created": 1599310202.0
    },
    {
        "author": "oyveyanyday",
        "body": "No don't put emergency funds into the stock market!  I get your logic, I'm heavy into stocks for dividend these days.  But IME investing your emergency fund only works when you have huge sums of money - large enough that if you lose your job, your dividends are meaningful enough to help pay the bills.  But if we're only talking about a few thousand dollars, that money will be much more valuable in cash.  If you hate the no interest, maybe shop around for a CD that will lock you in and have  a penalty if you take the $$ out early?  Those usually pay actual interest, and you'd probably just need to give up a couple of months' interest if you cash it out for an actual emergency, such as unemployment.\n\nBut investing any new savings in an ETF is great.  Everyone here will tell you to do a tech ETF, but if you invest long enough you'll realize it's best to buy things when they are on sale and wait when they are not.  Right now, tech is overpriced, AATH, or at the very least, most definitely not on sale.\n\nGo for all of the non-tech names on sale.  I highly recommend the Vanguard high dividend ETF symbol VYM which includes all of the companies you'd buy if you were into individual stocks.  And they pay a dividend so you'll get $$$ to reinvest:\n\nVerizon, JNJ, Merck, Intel, JPM, Bank of America, Pepsi, Walmart, McDonalds, Abbvie, Coca Cola, Next Era Energy, Texas Instruments, UPS, IBM, Bristol Meyes Squid, Colgate-Palmolive, Gilead, Raytheon, ADP, Duke Energy, Kimberly Clark, 3M, Lockhead Martin........the list goes on and on\n\nThe more $$$$ I have, the more I'm just putting into this fund since it has all of the solid companies I used to buy individually anyways. Also, it's on sale now, unlike tech!",
        "created_utc": 1600269520,
        "id": "g5h85pk",
        "permalink": "/r/stocks/comments/itrfij/rstocks_daily_discussion_wednesday_sep_16_2020/g5h85pk/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600298320.0
    },
    {
        "author": "mattcor76",
        "body": "SPY - 13.82%\n\nQTEC - 10.62%\n\nAMZN - 11.69%\n\nAAPL - 4.97%\n\nGOOGL - 6.89%\n\nPYPL -7.06%\n\nHD - 4.90%\n\nJNJ - 3.23%\n\nDNKN - 4.80%\n\nMCD - 4.81%\n\nKO - 2.37%\n\nENPH - 3.44%\n\nRUN - 1.91%\n\nTXN - 3.33%\n\nJ - 2.47%\n\nRKT - 5.03%\n\nHON - 5.46%\n\nPM - 3.15%\n\n&amp;#x200B;\n\nStarted on robinhood about 3 weeks ago and have built this portfolio quickly with mostly long term but some short term speculative plays. Initially I had too many eggs in the tech basket so I decided to spread it out more to control the damage once this bubble pops. What do you think?",
        "created_utc": 1598997386,
        "id": "g3nbf7y",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g3nbf7y/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599026186.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "Every single stock on my watchlist is Red, truly a first for me:\n\nRED: TXT, TXN, HD, GNRC, TSCO, PII, MBUU, BC, FOXA, ALK, BA, DCT, ACDVF, VLVLY, CBRL",
        "created_utc": 1600362269,
        "id": "g5ls79v",
        "permalink": "/r/wallstreetbets/comments/iugmeq/daily_discussion_thread_for_september_17_2020/g5ls79v/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600391069.0
    },
    {
        "author": "MrMineHeads",
        "body": "I've done only a limited amount of companies. One that I've made posts about and have recently doubled down on is Canadian Solar (CSIQ). They seem undervalued even with the risk they bear. They don't have the best ROIC, and they are pretty heavily in debt (even issued 200M in convertible bonds), but with even modest reinvestment and growth, this company is a good buy. I have to probably perfect my WACC with this company (I think it is riskier than it might seem, have to play around with the numbers a bit more), but I like what I see. Q3 will solidify my DD if I am right (I am forecasting more capex). I like management and they have been on since the beginning. CEO has been in the field since th 80s. They have some nice patents. Target is around $40/share, and opened my position at $22.80/share, with now a cost basis at $26.16/share.\n\nAnother company is Anthem (ANTM). I don't know why it is so cheap, but this is one of the best buys I've found so far. I am not completely done, but I feel the reason it is so cheap is because of upcoming US elections that will determine if the private healthcare industry is gonna shrink because of a public option under Biden. If that happens, health insurrers will see their revenues drop. I believe Biden will win (or most likely to win) which is why I am not buying the position.\n\nOne other company I've had my eye on for a while is Texas Instruments (TXN). They have marvelous ROIC (~27%), but they aren't a buy because they aren't reinvesting enough. I really have no idea how they are valued so much. I must be miscalculating their WACC and have it being too risky, but their growth just doesn't make sense even with 10x their current reinvestment rate. Make of that what you will.\n\nI am gonna do some analysis on INTC and AAPL just as an exercise, but have found other companies that might be promising.\n\nAnyway, please do your own DD. I am not a professional nor an expert. I do this in my spare time. If you are interested in this process, I have already linked the Damodaran process in my post. Follow my DD at your own discretion.",
        "created_utc": 1600270240,
        "id": "g5h9m8a",
        "permalink": "/r/investing/comments/itk6z4/serious_how_do_you_find_good_opportunitiesstocks/g5h9m8a/",
        "score": 2,
        "subreddit": "investing",
        "created": 1600299040.0
    },
    {
        "author": "JeffB1517",
        "body": "&gt;  how do you justify International exposure when those markets have been flat for over a decade? \n\nCapital gains are in the very long run a zero sum game (though it doesn't look that way since people think in terms of broad indexes).  \n  Thee the long term return of a stock is the sum of all future dividends (buybacks included).  The intrinsic value of a share is the discounted value of all future dividends.  The less expensive a stock is the less expensively you are buying that future stream of income for.  If you have a longer term horizon you want to buy assets that are cheap.  Ultimately stock prices normalize at the best estimate for discounted future dividends.\n\n&gt;  I don't see how US Tech juggernauts ever give up their advantage\n\n* Digital Equipment Corporation\n* Eastman Kodak\n* Polaroid\n* Schering-Plough\n* Sears, Roebuck and Company\n* Texas Instruments\n\nCould you have said the same thing 50 years ago about those?\n\n&gt;  It seems to me global diversification has only hurt returns historically speaking vs investing purely in the US.\n\nAbsolutely.  The USA has been the most successful economic society 1900-2000.  If you were an investor in say 1890 and compared the USA to Argentina would you have been certain of that? \n\nBut of course you don't get to invest in the USA prior to WW2.  Mostly the USA stock market isn't unreasonable.  Cap weighted it is rather high because some stocks are very richly priced.  You have to decide if you want to cap weight or hold very growth stocks.  And in 2020 you have to decide if USA outperformance in those growth areas if it happens at all is going to be  enough to justify paying the huge premium.",
        "created_utc": 1599308119,
        "id": "g445vk3",
        "permalink": "/r/investing/comments/imkhmk/global_portfolio_market_performance_seems_skewed/g445vk3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599336919.0
    },
    {
        "author": "bonghits96",
        "body": "Careful, I'm not so sure. At least in the iPad Pro here's what one article says about the LiDAR components:\n\n&gt; It’s not immediately clear from media reports who is supplying the underlying LiDAR technology, but it looks like Apple has used different components from different suppliers – including **Sony, Texas Instruments, Himax and Lumentum** – and manufactured its own “LiDAR Scanner”, as it calls it. (More details on EE Times and i-MicroNews.com.)\n\nhttps://roboticsandautomationnews.com/2020/06/17/apples-new-ipad-pro-sports-lidar-and-new-chip/33189/\n\nI mean I hope you're right (I own GRAF warrants) but I think Velodyne is more focused on automotive applications.",
        "created_utc": 1601390819,
        "id": "g72cg3k",
        "permalink": "/r/SPACs/comments/j1gmcd/shll_graf_merger_week_megathread/g72cg3k/",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601419619.0
    },
    {
        "author": "ixamnis",
        "body": "Broad Market:  That's tough to say.  If your very bullish on Tech stocks, QQQ might be your best bet. If you want a broader fund, then VOO is a good one.  QQQ uses the NASDAQ 100 as its bench mark while VOO uses the S&amp;P 500 as its benchmark. The top five holdings are the same for each of these, but in different percentages.  Another broad market fund I like is IWF. IWF uses the Russell 1000 as its benchmark.  It has a very good track record and seems to outperform the S&amp;P 500 over time. It's very similar to QQQ in its holdings, but again, percentages are slightly different.  You can't go wrong with any of these choices for a broad market fund. \n\nTech:  You'll get lots of opinions on this.  ARKQ and ARKW would be the choice of the ARK funds if you want it to be purely tech.  If you want to invest in disruptive innovative companies, but don't mind expanding beyond tech, consider ARKK. \n\nAnother one I like for tech is XLK. However, you have to keep in mind that XLK is almost 25% Apple and 25% Microsoft.  If you believe in those two companies, consider this one.  (VGT is very similar). \n\nSOXX is a fund that invests in semiconductor technology. One thing I like about this fund is that there will not be a lot of crossover between this one and your broad market fund.  Top holdings include: QCOM (9.5%), NVDA (9.5%), AVGO (8.3%), TXN (8%), INTC (5%). \n\nWCLD:  Cloud computing is a great sector, but be aware that many of these companies will also be in QQQ.  Top holdings include ZM (2.4%), CRM (2.3%), PLAN (2.2%), CRWD (2.1%), WDAY (2.1%). One thing I like about this ETF is that the investments are much more spread out than most ETFs. So, if any one company in the ETF is affected by bad news, it should have little impact on the ETF as a whole. I think WCLD is an excellent choice. \n\nClean Energy ETF:  I like ICLN like many others on this site.  I think the clean/renewable energy sector is really going to blossom over the next 10 years and I think ICLN is one of the better ETFs in the sector. Others you may want to look into include:  PBW, QCLN and TAN.",
        "created_utc": 1599572853,
        "id": "g4fvba6",
        "permalink": "/r/stocks/comments/iodkvg/interested_in_getting_a_few_etfs_and_good_use/g4fvba6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599601653.0
    },
    {
        "author": "Your_friend_Satan",
        "body": "ABBV\nAMGN\nAVGO\nAXP\nBAC\nBMY\nCSCO\nCVS\nGSK\nHD\nINTC\nJNJ\nJPM\nLHX\nLMT\nMPW\nNEE\nNOC\nPFE\nPRU\nQCOM\nSWKS\nTGT\nTXN\nUNH\nUSB\nWBA",
        "created_utc": 1601415099,
        "id": "g73wy9m",
        "permalink": "/r/options/comments/j25xmq/creating_a_watch_list_of_strong_dividend_paying/g73wy9m/",
        "score": 1,
        "subreddit": "options",
        "created": 1601443899.0
    },
    {
        "author": "LibrarianGovernment",
        "body": "IBM 190 call 9/23\n\n\nMMM 365 call 9/18\n\n\nTXN 48 put 10/01\n\n\nACB 420 call 9/18 😎\n\n\nGE 16 call 10/02",
        "created_utc": 1600290659,
        "id": "g5ihmgb",
        "permalink": "/r/wallstreetbets/comments/itw74x/thread_to_throw_off_the_algos_fuck_wall_street/g5ihmgb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600319459.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "permalink": "/r/wallstreetbets/comments/itw74x/thread_to_throw_off_the_algos_fuck_wall_street/g5irhtl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "Snoo_96430",
        "body": "I have those tattooed on my chest KR,TXN and now RKT joins that list.",
        "created_utc": 1599267434,
        "id": "g42flli",
        "permalink": "/r/wallstreetbets/comments/imgy8z/guys_i_think_theyre_onto_us/g42flli/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599296234.0
    },
    {
        "author": "VolvoKoloradikal",
        "body": "While I don't work at Intel, the reason no one in SV wants to work for Intel is more so the same reason why no one wants to work at AMD or Nvidia,SK Huynix, SuperMicro, Freescale, or Texas Instruments.\n\n&amp;#x200B;\n\nIt's because a computer engineer doing real engineering at a semiconductor firm makes 110K entry level whereas a computer engineer at a bloatware company making bluetooth cloud controlled dildo apps makes $150K entry level. The engineer at Intel also doesn't get flashy work bars and free artisan coffee or free entrance to dreamforce conferences.",
        "created_utc": 1599508911,
        "id": "g4dcx64",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4dcx64/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599537711.0
    },
    {
        "author": "tmehta8",
        "body": "Txn ...work with me",
        "created_utc": 1599661309,
        "id": "g4jr3qh",
        "permalink": "/r/wallstreetbets/comments/ipd82q/daily_discussion_thread_for_september_09_2020/g4jr3qh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599690109.0
    },
    {
        "author": "CoalFlavored",
        "body": "I’ve done quite a bit of work in the last month. All with dividends are enrolled in DRIP. In descending order by allocation -\n\nAAPL 23.57%\nTXN 21.47%\nKO 17.78%\nNET 13.60%\nARKF 8.57%\nCash 6.42%\nVNQ 3.63%\nVDC 2.48%\nBOXL 2.48%\n\nI guess I’m going for a moderately aggressive profile. AAPL, TXN, and KO for long term growth; NET, ARKF, and BOXL for pure speculation; VNQ and VDC for stability. I’m torn right now between focusing on continuing to load on more speculation (I’m 26), or to rush 100 KO shares to sell covered calls on for passive income and to essentially end up wheeling. Thoughts?",
        "created_utc": 1598974887,
        "id": "g3lncus",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g3lncus/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599003687.0
    },
    {
        "author": "Johnl582",
        "body": "27 y/o\nAAPL 18%\nMSFT 17%\nTXN 10%\nDIS 7%\nSTOR 7%\nPG 7% \nKO 7% \nINTC 5%\nAMD 4% \nPEP 7%",
        "created_utc": 1599485370,
        "id": "g4bttyu",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g4bttyu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599514170.0
    },
    {
        "author": "Romanian_",
        "body": "Honeywell \n\nRockwell Automation\n\nOmron\n\nTexas Instruments  \n\nAmphenol",
        "created_utc": 1599702195,
        "id": "g4m0aw3",
        "permalink": "/r/investing/comments/ipt4qk/automation_and_robotics/g4m0aw3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599730995.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "TXN has me interested but $129,000,000,000 for calculators ? Idk fam",
        "created_utc": 1599751396,
        "id": "g4p12z7",
        "permalink": "/r/wallstreetbets/comments/iq0jbk/daily_discussion_thread_for_september_10_2020/g4p12z7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599780196.0
    },
    {
        "author": "FartusMagutic",
        "body": "As purely an investment target I'm sticking with TXN",
        "created_utc": 1599450116,
        "id": "g4ardsh",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4ardsh/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599478916.0
    },
    {
        "author": "ixamnis",
        "body": "VOO is fairly diverse. It mimics the S&amp;P 500 index. Top holdings are:\n\nAAPL (Apple) - 7%\n\nMSFT (Microsoft) - 5.74%\n\nAMZN (Amazon) - 4.86%\n\nFB (Facebook)  - 2.4%\n\nGOOGL/GOOG - 3.3%\n\nBRK/B (Berkshire Hathaway) - 1.5%\n\nJNJ (Johnson &amp; Johnson( - 1.38%\n\nV (Visa) - 1.22%\n\nPG (Proctor &amp; Gamble) - 1.21%\n\nQQQ is a great ETF. It is likely to outperform VOO/S&amp;P 500 as long as tech continues to outperform the market. That said, there is a lot of crossover between QQQ and VOO.  The top holdings of QQQ include:\n\nAAPL - 14%\n\nAMZN - 11%\n\nMSFT - 11%\n\nFB - 4.5%\n\nGOOGL/GOOG - 7.1%\n\nTSLA - 3.3%\n\nNVDA - 2.6%\n\nSo, you can see that if you invest in both VOO and QQQ your top 5 holdings are the same, just different percentages. That's a fair bit of duplication. There is nothing wrong with doing that as long as you believe in those companies.  Just be aware of what you are doing and why. In fact, if you REALLY believed in some of those companies and wanted to INCREASE your holdings in one or two of those, you could \"enhance\" your holdings by putting some in an ETF that has one or two of those as an even larger percentage of its portfolio. For example, if you like Amazon FDIS is an ETF with 33% Amazon, followed by Tesla (7.4%), Home Depot (7%) and McDonald's (3.8%). Or you could invest in XLY which is 24% Amazon, 12% Home Depot, 6.5% McDonald's, 5.7% Nike and 4.5% Lowe's.  You can do the same with Apple (XLK is 25% Apple, VGT is 23% Apple, FTEC is 22.7% Apple, etc).\n\nNow, I'm not RECOMMENDING enhancing your portfolio in this manner, I'm merely demonstrating that you can really customize your portfolio with ETFs by duplicating your efforts in some companies to get exactly what you want without buying shares in individual companies (if that's what you want to do).\n\nPersonally, for new investors, I like the idea of investing into one broad market ETF (like VOO, for example) and then investing in a few sector ETFs.  You mention SOXX as one. That one specializes in semiconductors.  It's top holdings are QCOM (9.5%), NVDA (9.5%) AVGO (8.3%) TXN (7.9%), INTC, 5.3%, TSM (5.2%), AMD (5%). These are all solid companies. Keep in mind that if you pick VOO or QQQ as your broad market ETF, you are strong in the tech sector already and this is going to tilt your portfolio even more in the tech sector. Again, nothing wrong with that; just be aware of that.  (SMH is in most of the same companies, but different percentages). Both are highly rated ETFs.\n\nYou mentioned ICLN. I really like this ETF. I think clean/renewable energy is a sector that is only going to get stronger over the next 10 years .... well, really into the foreseeable future. It's been on a run the past 2 years and I think that will continue.  I'm very bullish on this ETF and I own quite a few shares in it.  (About 200 or so). A couple of other ETFs in this sector that you should check into are: QCLN, TAN and PBW.  Look at their holdings and their history and decide which one or ones you want to invest in. They are all good.\n\nFinally, you mentioned ARKK.  I'm bullish on all of the ARK funds.  ARKK may be one of the better ones in that group. I think most of the people in this subreddit are also bullish on this group of funds.  ARKK's top holdings include TSLA (10%), NVTA (7.2%), SQ (6.2%), ROKU (5.11%) CRSP (5%).  I'm bullish on all of these companies. This is a diverse set of companies and they are not in any one sector, so it makes the fund more of a broad market fund. That said, there is also quite a bit of Tech in the fund (depending on how you categorize some of these companies - is Tesla a Tech company or a car company?)  I like the approach Cathy Wood takes with her funds, but they can be a bit volatile and should be considered a little bit risky for that reason.\n\nI don't think you can go wrong with the approach you are looking at.  You might want to consider an approach along the lines of:\n\nVOO - 50%\n\nSOXX - 10%\n\nICLN - 20%\n\nARKK - 20%\n\nI think this would make your portfolio reasonably well diversified without being too overloaded in any one sector.  Then, if you wanted to \"enhance\" the portfolio with a few more shares in some company that you really like, you could add a few shares of that company; or put a few shares in an ETF that has a high percentage of that company (if there is one).\n\nBest of luck to you. I hope this helps.",
        "created_utc": 1599334406,
        "id": "g45nlu5",
        "permalink": "/r/stocks/comments/in5wdx/just_dca_etfs/g45nlu5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599363206.0
    },
    {
        "author": "citroen6222",
        "body": "How does Texas instruments still sell calculators? \n\nIs the whole thing propped up by teachers who don't realize a cheap Chromebook is far better alternative?",
        "created_utc": 1600950798,
        "id": "g6f1lwd",
        "permalink": "/r/wallstreetbets/comments/iyuhw0/daily_discussion_thread_for_september_24_2020/g6f1lwd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600979598.0
    }
]