[
    {
        "author": "steel_and_chrome",
        "body": "Fleet Farm, Art Van furniture, Bass pro, Cadence education, Camping World, Spring Education, AMC theatres, Ashley furniture, Zips holdings, US LBM holdings are the top 10 tenants. 66% Service, 18% Retail, 16% manufacturing. I am long but may be a long term play.",
        "created_utc": 1588708455,
        "id": "fpl8xr3",
        "permalink": "/r/stocks/comments/ge40dk/stor/fpl8xr3/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1588737255.0
    },
    {
        "author": "andrei155",
        "body": "Cloudflare is like the Shopify of content delivery networks (CDNs) and distributed denial of service (DDoS) attacks, offering both solutions at a cheap rate and making them easy to use. These services improve the speed at which your website is served globally by saving versions of the website (caching) across many global checkpoints. Say I have a website that resides on a server in the US. Someone visiting this website from Europe would have to download the contents of the website from the server in the US. With a CDN, there would be a copy of this website at multiple checkpoints in Europe and every other continent , improving the speed at which users can load the website. This distributed network of servers is also used to distribute the load from targeted attacks in traffic to the website that would otherwise overload the server and take it offline. The average user can setup Cloudfront for their personal website.  \nAmazon (AWS) is also competing in this space, with AWS Cloudfront and Shield for CDN and DDoS protection respectively. Amazon is 5-10x the price and quite convoluted to use. You would need a professional to manage your AWS subscription. Same with Google and MSFT Azure",
        "created_utc": 1590597650,
        "id": "frzse9r",
        "permalink": "/r/stocks/comments/grm4y9/can_you_help_me_understand_the_business_of/frzse9r/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1590626450.0
    },
    {
        "author": "codingprofessor",
        "body": "I'm a software engineer;\n\nFor non technical people I would suggest not to invest in technology like Twilio.\n\n- I enjoy Fastly as an industry expert - the use of CDNs and optimizing the delivery of digital content will only ever increase in need. My confidence is increased because they service products like Reddit and Imgur for example.\n\n- I would generally reccommend to find exposure or Cybersecurity through ETFs. It's a fantastic industry to support since our assets will increasingly find virtualization and therefore security will increase in value.\n\nThere are so many ways where security can grow; do banks need instant verification? Do manufacturing systems need enforced security? Do real estate exports need digital signatures?  This is why I reccommend ETFs.\n\n\n- if I were to suggest a cybersec stock with growth potential, I would suggest Cloudflare for the general use case",
        "created_utc": 1589675847,
        "id": "fqveyok",
        "permalink": "/r/stocks/comments/gl4pnt/twilio_fortinet_or_fastly/fqveyok/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1589704647.0
    },
    {
        "author": "codingprofessor",
        "body": "Cybersecurity is low in general knowledge and high in intrinsic value. If you don't believe me look at Akamais survival.\n\nFundamentally CDNs are distributed data centers and a backbone for the modern internet. CDNs have different types of optimizations - for example Fastly servers optimize for image processing while Cloudflare optimizes for security.\n\nAs virtualization and physical assets become procured and stored online more, the need for security increases.\n\n\nCloudflare sells it cheap. Cheaper than it's worth. And they've been around for a long time building many relationships along the way. They doubled the size of their sales and marketting team so I'm expecting their client size to increase as strongly as it has been.\n\nJust look up \"firebase data leaks\" if you want to see a use case for Cloudflare. They fix that without locking you into a Big Tech vendor.",
        "created_utc": 1590608633,
        "id": "fs0faz9",
        "permalink": "/r/stocks/comments/grm4y9/can_you_help_me_understand_the_business_of/fs0faz9/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1590637433.0
    },
    {
        "author": "Chadbraham",
        "body": "No they don't. It's a different style of delivery that's less focused on precisely enunciating words and more reliant on cadence &amp; melody. You can have people that use that delivery to convey more emotion without having to explicitly state how they feel, or you can have people that use it to cover up weak lyricism. Mumble rapping is just a other tool in an artist's toolbelt.",
        "created_utc": 1588622042,
        "id": "fphiu38",
        "permalink": "/r/wallstreetbets/comments/gd8zpy/daily_discussion_thread_for_may_04_2020/fphiu38/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588650842.0
    },
    {
        "author": "finfreedindep",
        "body": "I am hoping Yieldstreet is able to recover the Marine Financing which is the one they are saying was fraudulent.\n\nRegarding Cadence, Yieldstreet started off showing they had 0% principal loss.  Then that number disappeared from the site.  I see the same on [https://withcadence.io/past-deals/](https://withcadence.io/past-deals/) right now.  At some point, there will be some losses.",
        "created_utc": 1588602997,
        "id": "fpghu0g",
        "permalink": "/r/investing/comments/fg6h1v/yieldstreet_is_possibly_a_fraud/fpghu0g/",
        "score": 1,
        "subreddit": "investing",
        "created": 1588631797.0
    },
    {
        "author": "slickerydoo",
        "body": "Yes, technically they are all allowed to. Since April 8th, most retail stores do click and curbside collect.  Interesting article on this, including mentions of execs at LPs buying illegal because of convenience LOL. [https://www.nationalobserver.com/2020/04/08/news/ontario-allows-cannabis-stores-offer-delivery-and-pick-black-market-looms](https://www.nationalobserver.com/2020/04/08/news/ontario-allows-cannabis-stores-offer-delivery-and-pick-black-market-looms)\n\nInterestingly, LPs could in theory apply and set up private distribution as well (I believe this was just wholesale direct to retail...no direct to consumer rec sales). I can't find the exact link right now to the story, but the OCS claims that no LP was able to meet service requirements for private distribution. To my knowledge they haven't disclosed what those standards/requirements are, but lets be honest, we are talking about the distribution of cannabis here, this isn't exactly rocket science.\n\nI've seen comments claiming that the cost for each LP to distribute to individual stores would not be cost effective....True for very small LPs, but for the Big 5 that are moving substantial volumes...I can't imagine how this wouldn't be cost effective. Here's one theoretical example:\n\n\\- Canopy product ships from Smith Falls (1hr drive away from Ottawa). Sells wholesale to OCS and I'm assuming the terms are freight in. Product ships to OCS warehouse in Oakville....Retail in Ottawa purchase wholesale from OCS to ship to store (\\~5 hours drive back to Ottawa)....&gt;6hrs in transit time to deliver to a retail store 1hr away (Obviously, the decrease transit time is not always favourable....e.g Smith Falls to London)\n\n\\- In this example, if Canopy were to sell direct:\n\n* They could cut outbound freight costs (depends on product mix and distribution across the province, but I'm pretty certain any additional cost in outbound freight would be offset by the incremental margin gained....\n* Incremental margin per gram: By shipping direct to retail I'm assuming this would in part circumvent OCSs cut (Anyone know what margin they take per gram?)\n* Easier to optimize inventory mix: Avg. volume per shipment would decline (direct shipments, smaller batches). I'd anticipate that these direct shipments would allow LPs to be more lean.....Decreases time that product idles at OCS warehouses and less reliant on OCS purchasing cadence (It'd be interesting to know how long a gram takes to flow through the OCS supply chain, from PO to LP to delivery to retail).",
        "created_utc": 1588875016,
        "id": "fpskj2c",
        "permalink": "/r/weedstocks/comments/gf7wo9/advisory_tokyo_smoke_stores_launch_cannabis/fpskj2c/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1588903816.0
    },
    {
        "author": "codingprofessor",
        "body": "I'm unsure at what point I said this is advice. I very clearly stated that this is my strategy and my general market outlook for the future of select products and their development ecosystems.\n\nI'm a software engineer and I worked with manufacturing technology for 8 years; I invest generally within realms of my understanding and I'm a bit aware that not everybody has the same knowledge base to understand what CDNs are and how important they are in web development for example.",
        "created_utc": 1589563842,
        "id": "fqqdwsp",
        "permalink": "/r/investing/comments/gk3xle/i_started_my_career_in_november_and_investing/fqqdwsp/",
        "score": 1,
        "subreddit": "investing",
        "created": 1589592642.0
    },
    {
        "author": "dvdmovie1",
        "body": "What does 5G do for work from home that is not already being served by 4G/broadband? Genuine question.\n\nYou're seeing CDNs do very well (Fastly up 40% after earnings the other day), names like Twilio (which made a ridiculous move after earnings), Bandwidth, Ringcentral and others doing well in terms of WFH.",
        "created_utc": 1589028537,
        "id": "fq07o9z",
        "permalink": "/r/investing/comments/ggar2c/5g/fq07o9z/",
        "score": 1,
        "subreddit": "investing",
        "created": 1589057337.0
    },
    {
        "author": "DesperateDrive9",
        "body": "People are saying volume is just low and manipulated.\n\nI don't buy it. The big 3 CDNs all went up immensely....but since WSB touched this one it's dying.",
        "created_utc": 1588886078,
        "id": "fpt77r1",
        "permalink": "/r/wallstreetbets/comments/gff1ud/net_calls_got_fucked_ah/fpt77r1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588914878.0
    },
    {
        "author": "HotStockSlinger",
        "body": "Jesus Christ I had to cut off the audio because his cadence was fucking with me reading the shit.  What a retarded sounding language",
        "created_utc": 1590669564,
        "id": "fs303fb",
        "permalink": "/r/wallstreetbets/comments/gs3jqo/daily_discussion_thread_for_may_28_2020/fs303fb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590698364.0
    },
    {
        "author": "illusiveab",
        "body": "You're retarded. We all know the days, hence why I said outside the typical cadence. We all know yesterday was a holiday, so it becomes today, which is outside the typical cadence.",
        "created_utc": 1590500227,
        "id": "frvaufz",
        "permalink": "/r/wallstreetbets/comments/gqubyt/daily_discussion_thread_for_may_26_2020/frvaufz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590529027.0
    },
    {
        "author": "BF5lagsssss",
        "body": "&gt;Can you explain this? The US industry has been outsourced a lot, how is it industrially powerful?\n\nYes the US produces and licenses several of the most critical technologies around the world. Take semiconductors, the EDA semiconductor design market is controlled by primarily by two American companies Cadence and Synopsys. Without it chips couldn't even be designed. In semiconductor equipment manufacturing USA has KLA Tencor, AM and Lam which are essential to producing chips. This is just one example in the semiconductor industry and the US has several other companies producing high value content and products for the world.\n\nThe US only outsource the low value and admin stuff to developing countries to do as these products are of low Gross Margin or low cost contribution. This makes sense commercially since given future industry is driven by high value industries like high technology manufacturing and digital computing so naturally firms will focus more on . This is also one of the core reason why Trump and China hawks want to fight China as they seek to deny or slow China's ability to domestically produce high value goods such as semiconductors and supercomputers. \n\nIn fact US components are so important that you can even see their impact on companies like Huawei who has stated that it is hard to live without US components. This is why US is industrially powerful. Their products are critical to building modern day technologies and without it it is very hard to live without them.\n\n&gt;It's mostly services, but I don't see how one can say the US doesn't rely on imports with a straight face.\n\nYes but imports to the US are mainly low value products . Low value products have low cost contribution and the main Gross Profit is retained by the firm who outsources the production of the product. US doesn't really rely on imports in the sense that the US does not need to import any high tech products from anywhere as the US has the domestic capability to mass produce high tech goods efficiently.\n\nLook at China they rely on imports to survive. Without semiconductors the Chinese technology space will literally come to a grinding halt. This has been mentioned by Jack Ma before when he was in Japan where he referenced the US control over core technologies like semiconductor. This is why the US does not rely on imports since they are technologically self sufficient.",
        "created_utc": 1588327967,
        "id": "fp5fz8l",
        "permalink": "/r/wallstreetbets/comments/gavolm/bulls_never_die/fp5fz8l/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588356767.0
    },
    {
        "author": "j6hooze",
        "body": "I agree. I'm looking at Cadence now. It's smaller ball (500 min investments in 1-6 month notes) but the originators are interesting and are mostly asset backed. I appreciate the transparency of the Cadence team too (weekly market updates, daily updates from some originators, etc.).",
        "created_utc": 1588602527,
        "id": "fpgh0fn",
        "permalink": "/r/investing/comments/fg6h1v/yieldstreet_is_possibly_a_fraud/fpgh0fn/",
        "score": 1,
        "subreddit": "investing",
        "created": 1588631327.0
    },
    {
        "author": "codingprofessor",
        "body": "I agree with your assessment at the product and data level. Keep in mind that I invest in Fastly for their ability to optimize media CDNs and I look at Cloudflare as a dedicated platform for security specialists.",
        "created_utc": 1589745303,
        "id": "fqya89e",
        "permalink": "/r/stocks/comments/gl4pnt/twilio_fortinet_or_fastly/fqya89e/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589774103.0
    },
    {
        "author": "PsilocybinAlpha",
        "body": "It's certainly a good idea to keep this in mind, and to take into account the cadence and content of press releases. It's also a good idea to keep a keen eye for paid promo pieces.",
        "created_utc": 1589812106,
        "id": "fr12q8q",
        "permalink": "/r/shroomstocks/comments/glygos/champignon_sponsors_nonprofit_coalition_therapsil/fr12q8q/",
        "score": 1,
        "subreddit": "shroomstocks",
        "created": 1589840906.0
    },
    {
        "author": "chedrich446",
        "body": "If you’re thinking of chasing NET into earnings be careful. You probably saw Akamai and Fastly blow out their Q1 earnings and you think Cloudflare is a sure thing but there is a big difference between Cloudflare and other CDNs: they do not charge for bandwidth. Their plans are all fixed cost and most of their customers pay little to nothing for their services. Why does that matter? The reason other CDNs are killing it right now is because internet traffic is way up across the board. More internet traffic = their customers spending more money. Cloudflare, on the other hand, does not make more money when their customers push more traffic. If anything it will only increase their costs. *this is not financial advice, do whatever the fuck you want I don’t care*",
        "created_utc": 1588861091,
        "id": "fprschd",
        "permalink": "/r/wallstreetbets/comments/gf3vim/daily_discussion_thread_for_may_07_2020/fprschd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588889891.0
    },
    {
        "author": "redknappsaccountant",
        "body": "Uh, an internet infrastructure company ??? Literally every pumped tech company uses CDNs\n\nHow the hell are they not going to crush it over next 24 months ?",
        "created_utc": 1588875211,
        "id": "fpskxes",
        "permalink": "/r/wallstreetbets/comments/gf3vim/daily_discussion_thread_for_may_07_2020/fpskxes/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588904011.0
    },
    {
        "author": "Mr_Burkes",
        "body": "Lol who uses CloudFlare when AWS and Azure have their own CDNs",
        "created_utc": 1588891197,
        "id": "fpth7zx",
        "permalink": "/r/wallstreetbets/comments/gfe3sr/what_are_your_moves_tomorrow_may_08_2020/fpth7zx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588919997.0
    },
    {
        "author": "awkwardhawkbird",
        "body": "I liked your cadence and conversational tone, easy to digest but still a lot of good information that you don't blatantly spell out.",
        "created_utc": 1589037272,
        "id": "fq0t2e3",
        "permalink": "/r/wallstreetbets/comments/gg9lag/the_new_age_of_monetary_policy_an_indepth/fq0t2e3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589066072.0
    },
    {
        "author": "0xFFFFFF",
        "body": "Yes, people who host their websites on google/aws/azure will use the inbuilt CDNs and DDOS protection.\n\nCloudflare has tried to enter the compute space with their workers, but they have no further integrations or ecosystem. They may be cheaper the azure functions, but azure/asw/google also has free plan. I know nobody using their worker systems so I think they will have disappointing results in the sector.\n\nHowever for people who want to avoid azure/aws/google for their website security needs, cloudflare is the goto company.",
        "created_utc": 1588850233,
        "id": "fprckqg",
        "permalink": "/r/wallstreetbets/comments/gf0pn2/cloudflare_net_earnings_people/fprckqg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588879033.0
    },
    {
        "author": "chedrich446",
        "body": "&gt;&gt;most of their software is free\n\nprecisely why NET is the worst investment out of the major CDNs. when internet traffic goes up other CDNs make more money from increased bandwidth. cloudflare doesn’t charge for bandwidth so it only increases their costs. they also cater to SMB companies which ate struggling much more than big enterprise.",
        "created_utc": 1590266804,
        "id": "frl01zf",
        "permalink": "/r/wallstreetbets/comments/gpauek/possible_downside_for_cloudflarenetand_akamaiakam/frl01zf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590295604.0
    },
    {
        "author": "ThatKarmaWhore",
        "body": "You could win with a very slow cadence downward I guess",
        "created_utc": 1588377819,
        "id": "fp7usah",
        "permalink": "/r/wallstreetbets/comments/gbpcs2/weekend_discussion_thread_for_the_weekend_of_may/fp7usah/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588406619.0
    },
    {
        "author": "Kilstar",
        "body": "SMH\n\nHere's their 25 holdings as of now:\n\n1\tTaiwan Semiconductor Manufacturing Co L\tTSM US\t3,797,828\t$201,778,601.64 \t12.05%\n2\tIntel Corp\tINTC US\t2,979,264\t$178,696,254.72 \t10.68%\n3\tNvidia Corp\tNVDA US\t426,343\t$124,611,532.04 \t7.44%\n4\tBroadcom Inc\tAVGO US\t309,923\t$84,181,285.26 \t5.03%\n5\tAsml Holding Nv\tASML US\t288,591\t$83,238,302.13 \t4.97%\n6\tTexas Instruments Inc\tTXN US\t715,786\t$83,081,281.02 \t4.96%\n7\tQualcomm Inc\tQCOM US\t1,021,613\t$80,370,294.71 \t4.80%\n8\tAnalog Devices Inc\tADI US\t726,726\t$79,649,169.60 \t4.76%\n9\tAdvanced Micro Devices Inc\tAMD US\t1,501,245\t$78,650,225.55 \t4.70%\n10\tMicron Technology Inc\tMU US\t1,569,263\t$75,152,005.07 \t4.49%\n11\tNxp Semiconductors Nv\tNXPI US\t671,859\t$66,897,000.63 \t4.00%\n12\tApplied Materials Inc\tAMAT US\t1,307,056\t$64,934,542.08 \t3.88%\n13\tLam Research Corp\tLRCX US\t247,995\t$63,308,163.60 \t3.78%\n14\tKla Corp\tKLAC US\t324,060\t$53,175,005.40 \t3.18%\n15\tXilinx Inc\tXLNX US\t582,414\t$50,902,983.60 \t3.04%\n16\tCadence Design Systems Inc\tCDNS US\t604,698\t$49,059,148.74 \t2.93%\n17\tStmicroelectronics Nv\tSTM US\t1,745,035\t$44,620,544.95 \t2.67%\n18\tSkyworks Solutions Inc\tSWKS US\t393,114\t$40,836,682.32 \t2.44%\n19\tMicrochip Technology Inc\tMCHP US\t451,468\t$39,607,287.64 \t2.37%\n20\tMaxim Integrated Products Inc\tMXIM US\t556,880\t$30,617,262.40 \t1.83%\n21\tMarvell Technology Group Ltd\tMRVL US\t999,064\t$26,714,971.36 \t1.60%\n22\tQorvo Inc\tQRVO US\t225,071\t$22,063,710.13 \t1.32%\n23\tTeradyne Inc\tTER US\t344,780\t$21,562,541.20 \t1.29%\n24\tUniversal Display Corp\tOLED US\t100,420\t$15,075,050.40 \t0.90%\n25\tOn Semiconductor Corp\tON US\t824,746\t$13,233,049.57 \t0.79%\n26\tOther/Cash\t\t0\t$1,889,767.67 \t0.11%",
        "created_utc": 1588432827,
        "id": "fp9r6ht",
        "permalink": "/r/stocks/comments/gbe5cs/rstocks_daily_discussion_fundamentals_friday_may/fp9r6ht/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588461627.0
    },
    {
        "author": "dvdmovie1",
        "body": "What *was* a good opportunity in March was growth. Those names have delivered in many cases astonishing performance post-March lows. \n\n\"does anyone have any views on what sectors/stocks might be good buying opportunities?\"\n\nThere's already plenty of tech that has ramped to new all time highs that is benefiting from this. Look at the CDNs (FSLY +40% after earnings the other day), things like Twilio (+40% after earnings the other day and.....just kept going), telehealth (TDOC; LVGO - LVGO is up well over 100% YTD), anything work from home (BAND, ZM, RNG, FIVN.) If remote schooling continues, CHGG probably continues to do well.\n\nNot everything is doing badly during this.",
        "created_utc": 1589379168,
        "id": "fqhl3o0",
        "permalink": "/r/investing/comments/gizisv/upcoming_buy_opportunities/fqhl3o0/",
        "score": 1,
        "subreddit": "investing",
        "created": 1589407968.0
    },
    {
        "author": "CheapAlternative",
        "body": "NVDA, AMD, ASML, SNPS, CDNS",
        "created_utc": 1589838378,
        "id": "fr2jhjb",
        "permalink": "/r/investing/comments/glnpt2/what_stocks_are_you_waiting_to_buy_until_another/fr2jhjb/",
        "score": 1,
        "subreddit": "investing",
        "created": 1589867178.0
    },
    {
        "author": "RIC_FLAIR-WOOO",
        "body": "POOL SPGI V LMT NEE MSFT NOW CDNS AMT EQIX",
        "created_utc": 1590065719,
        "id": "frc6b4n",
        "permalink": "/r/investing/comments/gnpawk/what_are_your_most_confident_long_term_stock/frc6b4n/",
        "score": 1,
        "subreddit": "investing",
        "created": 1590094519.0
    },
    {
        "author": "illusiveab",
        "body": "Are you dumb? Expiries are the expiration date. It doesn't always follow the routine cadence.",
        "created_utc": 1590499596,
        "id": "frv9tzn",
        "permalink": "/r/wallstreetbets/comments/gqubyt/daily_discussion_thread_for_may_26_2020/frv9tzn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590528396.0
    },
    {
        "author": "eli_lilly",
        "body": "I've never actually watched Musk speak. If every third word is \"uhm\" and it has a stilted cadence, then yes.",
        "created_utc": 1590601508,
        "id": "fs00f7r",
        "permalink": "/r/wallstreetbets/comments/grh1fv/daily_discussion_thread_for_may_27_2020/fs00f7r/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590630308.0
    },
    {
        "author": "ThatKarmaWhore",
        "body": "You could win with a very slow cadence downward I guess",
        "created_utc": 1588377824,
        "id": "fp7usrz",
        "permalink": "/r/wallstreetbets/comments/gbpcs2/weekend_discussion_thread_for_the_weekend_of_may/fp7usrz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588406624.0
    },
    {
        "author": "iseebrucewillis",
        "body": "Both in the same space, personally use Cloudflare ($NET) for side projects, basically unavoidable, they are the go to for CDNs. They provide a lot of services to make your website work behind the scenes, the whole point is to provide really fast and robust access to data anywhere in the world. Even without the virus the world is using the internet more and more, and now it's turned up to 100. They are gonna go the same path as Fastly, Twilio",
        "created_utc": 1588801035,
        "id": "fppexgf",
        "permalink": "/r/wallstreetbets/comments/ger55c/56_earnings_collection_thread/fppexgf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588829835.0
    },
    {
        "author": "devereaux",
        "body": "FSLY is a clear one to me but I think a lot of companies that are in the CDN space below Akamai are fighting for a pie that actually isn't that big when they can't scale profitably and all the biggest customers will at some point abandon them to have their own CDNs anyway.\n\nI'm glad WeWork and Uber as shitty quasi-tech companies have already been punished by the market.",
        "created_utc": 1590040549,
        "id": "frbeyqk",
        "permalink": "/r/wallstreetbets/comments/gnisnu/what_are_your_moves_tomorrow_may_21_2020/frbeyqk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590069349.0
    },
    {
        "author": "SalesyMcSellerson",
        "body": "Actually, yeah it is. Sim hacking, phishing and all other manner of fuckery makes digital two factor authentication super tricky. Even RNG stuff can be picked off as well. It's a big thing in online casinos. You can figure out the seeds and predict every outcome. For that reason, physical  multifactor products that rely on radioactive decay have been around for years.\n\nSo having physical keys is really important to any sort of robust security strategy. But okta is more than that. Identity access management and authentication is huge. There's many stories of people logging into aws accounts and bankrupting former employers. This happens to all kinds of companies in many ways. Especially financial fraud. CFOs have been thrown in prison for identity / financial frauds that have been perpetrated against their companies to the tune of millions.\n\nIdentity management can identify users based on minute details. For example, just how you operate your device. Like the specific cadence that you type your passwords, etc., can help to properly identify you.\n\nSo, I feel like 33x is pretty reasonable compared to much of the tech industry and especially given the opportunity for growth. Mid markets and smbs are lagging but will be adopting security practices that were previously only being adopted by enterprises. However, it will mostly be through MSPs and/or MSSPs.",
        "created_utc": 1589693746,
        "id": "fqw5vu9",
        "permalink": "/r/wallstreetbets/comments/gl1p50/okta_earnings_528/fqw5vu9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589722546.0
    },
    {
        "author": "JasonColin",
        "body": "No serious investor goes on CDNs, especially one with barely real profit, slow pocket growth, and a large \"free\" segment that's bleeding money. Even the drunks at Vegas know to evade that machine.",
        "created_utc": 1588887744,
        "id": "fptaiwp",
        "permalink": "/r/wallstreetbets/comments/gff1ud/net_calls_got_fucked_ah/fptaiwp/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1588916544.0
    },
    {
        "author": "Vanhandle",
        "body": "Newsom pumping Salesforce",
        "created_utc": 1588705669,
        "id": "fpl3evc",
        "permalink": "/r/wallstreetbets/comments/gdv4qs/daily_discussion_thread_for_may_05_2020/fpl3evc/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588734469.0
    },
    {
        "author": "shuttdown700",
        "body": "To be fair, V and MA are tech stocks. They do financial services and don’t issue credit. They are just financial tech stocks. \n\nAlso, you have to think what’s gonna be big in the next five years. Cloud computing (AMZN, MSFT, GOOG, ADBE, and NVDA for hardware), enterprise tech platforms (MSFT, CRM, GOOG, ADBE, even AAPL and FB), video games (EA, ATVI, MSFT, NVDA, and FB has oculus)... I can continue but you get it. \n\nTech has a lower cost for growth and the lowest entry threshold for obtaining economies of scale than physical retailers or businesses with complex supply chains.",
        "created_utc": 1588638672,
        "id": "fpidief",
        "permalink": "/r/stocks/comments/gdmxm4/are_nontech_stocks_worth_investing_in/fpidief/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1588667472.0
    },
    {
        "author": "TheD-",
        "body": " really hope someone listened when I said CRM calls this morning, currently up 85%",
        "created_utc": 1588619357,
        "id": "fphdjae",
        "permalink": "/r/wallstreetbets/comments/gd8zpy/daily_discussion_thread_for_may_04_2020/fphdjae/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1588648157.0
    },
    {
        "author": "chiefhazyroom",
        "body": "CRM stonk go up dis week good",
        "created_utc": 1588646506,
        "id": "fpiqkeg",
        "permalink": "/r/wallstreetbets/comments/gdpfm2/what_plays_do_you_have_that_need_to_print/fpiqkeg/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588675306.0
    },
    {
        "author": "2dum2FUNction",
        "body": "Don’t care what anyone thinks going all in on salesforce poots tomorrow",
        "created_utc": 1588630789,
        "id": "fphzmm1",
        "permalink": "/r/wallstreetbets/comments/gdj2dv/what_are_your_moves_tomorrow_may_05_2020/fphzmm1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588659589.0
    },
    {
        "author": "CBarkleysGolfSwing",
        "body": "Mistake I think. Companies like SAP, CRM, NOW all benefit greatly moving forward. Companies will be downsizing and looking to streamline/automate business processes as much as possible.",
        "created_utc": 1588630865,
        "id": "fphzrsm",
        "permalink": "/r/wallstreetbets/comments/gdj2dv/what_are_your_moves_tomorrow_may_05_2020/fphzrsm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588659665.0
    },
    {
        "author": "blanketknabber",
        "body": "Anyone planning on playing Salesforce earnings for next week?",
        "created_utc": 1588686881,
        "id": "fpk2vop",
        "permalink": "/r/wallstreetbets/comments/gdv4qs/daily_discussion_thread_for_may_05_2020/fpk2vop/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588715681.0
    },
    {
        "author": "lisa-0717",
        "body": "Salesforce $CRM!!\n\nStable business investing heavily in R&amp;D",
        "created_utc": 1588372618,
        "id": "fp7l0i5",
        "permalink": "/r/stocks/comments/gblhn8/long_term_stock_investments_for_coronavirus/fp7l0i5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588401418.0
    },
    {
        "author": "o2lsports",
        "body": "Good thing I can put the $5 remaining from my $NOW calls into $CRM calls. Fucking Tesla Trump twitter tag team. You can survive one but not both. I hope he gets removed.",
        "created_utc": 1588362047,
        "id": "fp70xh8",
        "permalink": "/r/wallstreetbets/comments/gbl7s3/happy_birthday_to_the_ground/fp70xh8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588390847.0
    },
    {
        "author": "Beagleoverlord33",
        "body": "Still feel it’s best to focus a lot on index funds but that said I’d say V MA FB AMZN Goog BABA CRM MSFT JNJ Dis",
        "created_utc": 1588450052,
        "id": "fpakin2",
        "permalink": "/r/stocks/comments/gca1hq/what_are_you_top_10_favorite_stocks_for_the_long/fpakin2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588478852.0
    },
    {
        "author": "Industry_Standard",
        "body": "I'd probably add NOW and CRM in there as well. Aside from that, your portfolio is very similar to mine. Waiting for something around 145 to buy into OKTA, depending on macro trends.",
        "created_utc": 1588564064,
        "id": "fpf832n",
        "permalink": "/r/stocks/comments/gcpu9h/feedback_on_my_new_portfolio_please/fpf832n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588592864.0
    },
    {
        "author": "TheD-",
        "body": "crm calls at open?",
        "created_utc": 1588594432,
        "id": "fpg50s9",
        "permalink": "/r/wallstreetbets/comments/gd8zpy/daily_discussion_thread_for_may_04_2020/fpg50s9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588623232.0
    },
    {
        "author": "fuckorigin",
        "body": "Someone needs to tell the Salesforce CEO that it's time to accept the fact he's balding. Dude is on CNBC with the worst combover in the history of combovers",
        "created_utc": 1588601109,
        "id": "fpgelcx",
        "permalink": "/r/wallstreetbets/comments/gd8zpy/daily_discussion_thread_for_may_04_2020/fpgelcx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588629909.0
    },
    {
        "author": "PoolsApp",
        "body": "The reason i said brain damage is because all the tech companies give out stock-based comp like candy. I tried doing a valuation for salesforce where I was beating my head on this problem for much too long.\n\nBasically it's saying that in a levered equity scenario / equity valuation, you need to incorporate these costs in the valuation or you're overvaluing the stock",
        "created_utc": 1588643449,
        "id": "fpill7t",
        "permalink": "/r/SecurityAnalysis/comments/gdja8r/ssrn_stock_compensation_expense_cash_flows_and/fpill7t/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1588672249.0
    },
    {
        "author": "firestormdude",
        "body": "All subscription based revenue and a lot room to run. Very safe investment with good future prospects. I also like the valuation better than Salesforce or AutoDesk.\n\nAdobe has an unmatched suite for marketing professionals including audio, graphic design, web, and video. You can simultaneously make professional commercials, podcasts, music, graphics, and websites all within the same suite for $50/month. Their package is hard to beat. Been using their platform since 2009 and still use it to this day.\n\nOnly competition is companies with individual products to compete against individual Adobe products but as a packaged suite for creators and entrepreneurs, Adobe is untouchable.",
        "created_utc": 1588495991,
        "id": "fpcd2y8",
        "permalink": "/r/stocks/comments/gcmvzz/my_parents_have_put_me_mostly_in_charge_of/fpcd2y8/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588524791.0
    },
    {
        "author": "codingprofessor",
        "body": "Yes, a company has navigating multiple boom and transitions toward high speed internet and mobile devices.\n\nSo its proven to be resilient and adaptive for 40 years now.\n\n\n\nBallmer also built half a dozen new businesses,[38] such as the data centers division and the Xbox entertainment and devices division ($8.9 billion),[40] (which has prevented the Sony PlayStation and other gaming consoles from undermining Windows),[41] and oversaw the acquisition of Skype. Ballmer also constructed the company's $20 billion Enterprise Business, consisting of new products and services such as Exchange, Windows Server, SQL Server, SharePoint, System Center, and Dynamics CRM, each of which initially faced an uphill battle for acceptance but have emerged as leading or dominant in each category.[41] This diversified product mix helped to offset the company's reliance on PCs and mobile computing devices as the company entered the Post-PC era; in reporting quarterly results during April 2013, while Windows Phone 8 and Windows 8 had not managed to increase their market share above single digits, the company increased its profit 19% over the previous quarter in 2012, as the Microsoft Business Division (including Office 365) and Server and Tools division (cloud services) are each larger than the Windows division.[42][38]",
        "created_utc": 1588316757,
        "id": "fp55a0s",
        "permalink": "/r/stocks/comments/gazlzy/would_you_consider_amd_and_msft_foreverhold_stocks/fp55a0s/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588345557.0
    },
    {
        "author": "Waffini",
        "body": "P/e in Essence represents how long it theoretically takes you to get back your investment from the company earnings \nAn overvalued company tend to have a high p/e, for example Salesforce. CRM\nHowever, not always you buy stocks for their current earnings, you invest in their future earnings, which depends on your confidence in that business to deliver. For this reason the closest to blue chips the stabler p/e tend to be.\nIndustries tend to have comparable p/e, but rarely industries can compare. Tech is notoriously expensive, biotech too, with high p/e.... But this doesn't mean they are bad investments",
        "created_utc": 1588319674,
        "id": "fp58652",
        "permalink": "/r/investing/comments/gbcfrb/chasing_pe/fp58652/",
        "score": 1,
        "subreddit": "investing",
        "created": 1588348474.0
    },
    {
        "author": "AbominableTittyMan",
        "body": "Bought hella CRM 157.5 P after I heard about that huge VIX order (100m) can’t wait to make lots of money",
        "created_utc": 1588338418,
        "id": "fp5rtnr",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp5rtnr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588367218.0
    },
    {
        "author": "AbominableTittyMan",
        "body": "CRM 150 EOD",
        "created_utc": 1588339314,
        "id": "fp5t5c2",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp5t5c2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588368114.0
    },
    {
        "author": "AbominableTittyMan",
        "body": "CRM $150",
        "created_utc": 1588340307,
        "id": "fp5uoe4",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp5uoe4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588369107.0
    },
    {
        "author": "chevalliers",
        "body": "MSFT, AMZN, GOOGL, AMD, NVIDIA, SPLUNK, CROWDSTRIKE, CISCO, MICRON, AAPL, SLACK, SALESFORCE",
        "created_utc": 1588504521,
        "id": "fpcl1bl",
        "permalink": "/r/stocks/comments/gclr1n/have_to_invest_20000/fpcl1bl/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588533321.0
    },
    {
        "author": "meeni131",
        "body": "Personally, I'm worried about commoditization and competition of software. So many SaaS models today rely on the $x per user per month model and Microsoft or Google or Facebook or Salesforce come in and offer something almost of the same quality for 20% of the price.\n\n Why should I pay $10 per month per user for Slack or Zoom when Microsoft throws in Teams and Google throws in Meet to their bundle for practically free and pours in tons of cash to continue to improve them? Oh and I get the SSO using Microsoft/Google security included so don't have to spend another $10 per user per month on an Okta login? And so on and so forth.\n\nThere are some awesome software businesses out there but not as many as I would like to see. A hardware + software component or just insurmountable data advantage (like Bloomberg has) would be great but seems like so many of these public companies are very replaceable.",
        "created_utc": 1588527916,
        "id": "fpdiz0a",
        "permalink": "/r/investing/comments/gcawmd/thoughts_on_equity_valuations_and_why_they_should/fpdiz0a/",
        "score": 1,
        "subreddit": "investing",
        "created": 1588556716.0
    },
    {
        "author": "RB_GScott",
        "body": "Salesforce being at 1040 P/E seems fine",
        "created_utc": 1588689166,
        "id": "fpk6xa8",
        "permalink": "/r/wallstreetbets/comments/gdv4qs/daily_discussion_thread_for_may_05_2020/fpk6xa8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588717966.0
    },
    {
        "author": "Industry_Standard",
        "body": "SHOP, like you said. ADBE/NOW/CRM, because SaaS is and will be all enterprise software. MSFT, because despite being bigger than both AAPL and AMZN, it incredibly still has a lot more room to grow. MSFT is crazy well positioned for everything.",
        "created_utc": 1588554657,
        "id": "fpetlot",
        "permalink": "/r/stocks/comments/gczbqo/what_could_the_next_apple_or_amazon/fpetlot/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588583457.0
    },
    {
        "author": "Some-Atmosphere",
        "body": "FB - 17%, HCAT - 17%, KO - 13%, INO - 12%, CRM - 11%, MSFT - 11%, BABA - 8%, MOMO - 6%, ELY - 6%, SCYX - 1%",
        "created_utc": 1588522253,
        "id": "fpd8xg1",
        "permalink": "/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/fpd8xg1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588551053.0
    },
    {
        "author": "strambtrader",
        "body": "CRM calls  ayeee",
        "created_utc": 1588606111,
        "id": "fpgnio3",
        "permalink": "/r/wallstreetbets/comments/gd8zpy/daily_discussion_thread_for_may_04_2020/fpgnio3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588634911.0
    },
    {
        "author": "o2lsports",
        "body": "$CRM and $FLIR will moon, I will get excited, hold too long, lose everything.",
        "created_utc": 1588451006,
        "id": "fpam51o",
        "permalink": "/r/wallstreetbets/comments/gcb6bl/whats_your_prediction_for_monday/fpam51o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588479806.0
    },
    {
        "author": "Industry_Standard",
        "body": "Sure I can, because this is happening to me and every person around me, and even friends who are teachers are being pressured by their supervisors to promote cram schools. I'll have to look up Gordon Chang and see what he's said.\n\nThe US has seen growth from Uber and Tesla, like you said, but also Netflix, Waymo and Salesforce. Furthermore, if you want to include Huawei, Tencent, and Alibaba, which all started before 2000, we need to account for the continued rise of Amazon, Google, FB, Microsoft, and Apple. DJI, on the other hand, is an excellent company doing some cool things.\n\nYou can't tell me China has pivoted away from manufacturing when the number of Chinese vendors at Canton Fair has increased every year until the virus. \n\nLook, I don't think we'll find common ground in this, but I simply think the conservative nature of Chinese culture is holding China back.",
        "created_utc": 1588481718,
        "id": "fpbxzyf",
        "permalink": "/r/stocks/comments/gce1bd/warren_buffett_says_the_economy_will_overcome/fpbxzyf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588510518.0
    },
    {
        "author": "AbominableTittyMan",
        "body": "Cheap CRM puts bois 157.5 0-days",
        "created_utc": 1588339135,
        "id": "fp5svkp",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp5svkp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588367935.0
    }
]