[
    {
        "author": "726bh",
        "body": "Thank you, I have little to do because of this goddamn quarantine so busted out the old adobe illustrator.",
        "created_utc": 1585777502,
        "id": "fm5poyj",
        "permalink": "/r/wallstreetbets/comments/ft9by5/in_light_of_the_logo_change_i_decided_to_draw_the/fm5poyj/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1585806302.0
    },
    {
        "author": "jmeloso",
        "body": "I am long AAPL, MSFT, AMZN, GOOG, FB, NVDA, AMD, NFLX, BABA, ADBE, JPM, BA, TSLA.  Also recently purchased 12/31 270 SPY calls.\n\nI doubled down after the drop and my portfolio is doing better than ever.\n\nStop gambling and start investing and you’ll make money retards.   This was one of the best buying opportunities ever.",
        "created_utc": 1587089807,
        "id": "fnnde0g",
        "permalink": "/r/wallstreetbets/comments/g2mj65/what_are_your_moves_tomorrow_april_17_2020/fnnde0g/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1587118607.0
    },
    {
        "author": "MBA_Throwaway_187565",
        "body": "Things to love about Apple as business:\n\n* Other worldly return on invested capital going back a decade plus (which is downstream from everything that comes after)\n* Smartphones is a massive, stable market with an incredibly high ROI to their users: Apple derives $150bn+ of annual revenue from iPhones, most of that from North America and Europe. Despite how expensive smartphones are, tell me how much would I have to pay you to go back to using a Brick? $3000 per year? $5000 per year? The $350 / year of hardware + $500 / year of data that seemingly everyone gleefully pays is a function of just how amazing it is to have a computer / phone / camera in one, that fits in your pcoket, all with ubiquitous broadband speed internet.\n* Absurd brand premium to their products: Hardware assembly is infamously commoditized yet Apple's gross margin on its smartphones is 65% (compared to say 18% for HPQ); part of it is the pricing power Apple gets from the loyalty of its customer base, part of it is the sexiness of the design of their products. Android user = poor in New York, Los Angeles and many of the other cultural capitals of the world.\n* Customer lock in: Despite the designed obsolescence of its products, despite the high prices, despite the fact that many iPhone users (myself included!) don't even like the interface, almost all of us pony up the $700 every two years because a) the damn phones are in our palms 24/7 and it would be a nightmare to refamiliarize ourselves with a new OS, b) we'd lose the trade in value of our existing phone (though there is something of a secondary market so this isn't too crucial a factor as much as it was 5-10 years ago) and c) we've all bought so much other crap (cases, chargers, etc.) that we'd have to repurchase on top of the hardware if we switched to a different ecosystem\n* Network effect from ecosystem: the massive amount of users begets app developers, the app developers create apps that are specific to iOS which in turn begets users, Apple builds its own stuff (namely iMessage) that add to the ecosystem and is able to push services (see Apple Music) into that ecosystem, driving incremental revenue\n* Closed system = they own the ecosystem: Unlike the WinTel (+ Adobe) ecosystem of PCs in the 20 aughts or the Android ecosystem, Apple has a closed system with proprietary OS and processors.\n* Their suppliers are dependent on them / they are not dependent on suppliers: When it looks like Apple might be dependent on a supplier, they in house the capabilities, often driving the supplier bankrupt.\n\nBesides how great a business Apple is, the stock is valued much more rationally (usually mid to high teens P/E) and on current metrics than any other Tech giant therefore it makes sense that Buffett chose them and not say Facebook.\n\nEdit: fixed the size of iphone market",
        "created_utc": 1587002024,
        "id": "fnjmdik",
        "permalink": "/r/SecurityAnalysis/comments/g24cdj/what_does_warren_buffet_see_in_apple_in_15_to_20/fnjmdik/",
        "score": 11,
        "subreddit": "SecurityAnalysis",
        "created": 1587030824.0
    },
    {
        "author": "THExNeo",
        "body": "God damn. 5.2 million this week. Meanwhile I was about ready to quit my job in late January and am now stuck here \"being proactive and making marketing content for when business reopens\". Fuck. Also short $ADBE; photoshop and illustrator are not worth fucking $900 a year when you can just pirate it or use freeware like gimp.",
        "created_utc": 1587042812,
        "id": "fnky127",
        "permalink": "/r/wallstreetbets/comments/g2c9fj/daily_discussion_thread_for_april_16_2020/fnky127/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1587071612.0
    },
    {
        "author": "discovery999",
        "body": "Whatever you say chicken little. It’s not too hard to focus on winners and stocks we liked before rona. Amzn, msft, cost, wmt, aapl, adobe etc...\n\nJust be smart with your picks and only choose companies with grade A financial status.\n\nPlus don’t gamble on hospitality, tourism, oil etc...\n\nThis is not rocket science.",
        "created_utc": 1586986865,
        "id": "fniv207",
        "permalink": "/r/stocks/comments/g20t0v/its_about_to_get_bad/fniv207/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1587015665.0
    },
    {
        "author": "SeaSickPirate",
        "body": "We good, Jpow just downloaded adobe photo shop. New Kim Jung Un being 3D printed as we speak.",
        "created_utc": 1587438222,
        "id": "fo1p3z8",
        "permalink": "/r/wallstreetbets/comments/g505w1/what_are_your_moves_tomorrow_april_21_2020/fo1p3z8/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1587467022.0
    },
    {
        "author": "hfutrell",
        "body": "That’s true. But Apple also has 3x the market share in PCs that it did when it made the PowerPC to Intel transition roughly 15 years ago. From that perspective they are in a position of relative strength.\n\nConsider also how important the web is today versus 15 years ago. And consider how subscription app business models means that important apps like Adobe Creative Suite and Microsoft Office will be available to customers at no additional cost as soon as they are ready (likely day one).\n\n The transition will leave some apps behind, but on a relative scale it won’t be that disruptive to most customers.",
        "created_utc": 1587691429,
        "id": "fodwg9q",
        "permalink": "/r/investing/comments/g6u4uk/intel_stock_falls_after_report_says_apple_plans/fodwg9q/",
        "score": 7,
        "subreddit": "investing",
        "created": 1587720229.0
    },
    {
        "author": "discovery999",
        "body": "Take your focus away from the S&amp;P500 for a minute. There is a problem with every index fund right now. This is a stock pickers market with many industries failing during this virus and some flourishing. Indicies are too unpredictable right now. It’s easier to be bullish or bearish on individual stocks since rona could be with us until next year. Eg. Bullish; amzn, cost, wmt, msft, adbe, nflx etc... Bearish; trvg, ccl, aal, mgm, GE, fdx, jets, oil and all hospitality and tourism. We have 2 different economies running right now. Those that can perform fine with social distancing and those that can’t.",
        "created_utc": 1587166133,
        "id": "fnqjzky",
        "permalink": "/r/stocks/comments/g3csw2/im_more_scared_today_than_i_was_in_the_crash/fnqjzky/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1587194933.0
    },
    {
        "author": "sspianist6",
        "body": "I'm surprised no ADBE.\n\nI'm not surprised at not seeing shop, because this sub doesn't like companies that are \"overvalued\" but seemingly double every year.\n\nDisclaimer, I owned shop at 100, and an pissed I sold at 200.",
        "created_utc": 1586547390,
        "id": "fn0rk19",
        "permalink": "/r/stocks/comments/fyjaff/sharing_my_top_companies_with_you/fn0rk19/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1586576190.0
    },
    {
        "author": "4121Laurel",
        "body": "No although you’re very invested in technology\nWhich isn’t a bad thing.  \n- AAPL is great, their market value will always go back to what it was even if they don’t release the new iPhone. Don’t be afraid of a drop just average costs if it drops dramatically. \n\n- Adobe should do well with this stay at home. School is requiring the use as well as businesses from home. \n\n- Amazon is essentially showing its untouchable currently. I’m large into amazon as well. \n\n- Disney is another powerhouse that you’ll never need to worry about. The lost revenues over the following 8 months could cause a dramatic drop, in this scenario don’t panic and average your cost. \n\n- Enph - energy, I’m not familiar with this company. \n\n- Facebook is another powerhouse good pick. \n\n- Google - Great pick. \n\n- MasterCard is also a good pick, hold this. Average if it comes down to although you shouldn’t have to they trade rather high. If you’re at a major loss with their recent decline. Average in the next 3 months when there’s a better understanding how financials will deal with crisis. (You shouldn’t need to) \n\n- Microsoft - I love microsoft. They are on a tear currently. Teams daily usage is up 12 million users in the last month, this is major. Their competition is “work” slack technologies who I am also Long. \n\n- Netflix has been great good pick. \n\n- Nike is a great pick. I could expand but they’ve always done well. Constant increase throughout the life of their stock. \n\n- Nvidia is a powerhouse as well. Great pick. \n\n- Starbucks is great. I haven’t followed them through the virus but they’re a strong company large capital, their profits are also great. Good pick. \n\n- Square I like square a lot. Square has major potential in different avenues. Cash app, lending (they just got approved to lend during this time). Prior to the virus square was on a tear. I’m long on this I got in early and am very big on square. \n\nIf you’re interested in diversification:\n\nAll that being said you really are big into tech, I would suggest diversification. \n\n“Oxy” - occidental petroleum is a good long term stock. They’re trading extremely low currently due to oil wars, corona virus, issues on the board and the purchase of anadarko. (This scares a lot of investors but you seem to want long term investments) it’s a steal at 15$ a share. \n\n- Johnson and Johnson is a powerhouse. \n\n- Jet blue &amp; Delta - long term great investments. Short term extremely risky. \n\n- Walmart: trading high but they’re only going to go even higher when this is over. \n\n- AT&amp;T and Verizon: AT&amp;T trades fairly low with a large dividend. GREAT LONG TERM. Verizon has been extremely strong throughout the years.  \n\n- Ford on the long term has a lot of upside trading around half of its average price. Ford pays dividend and  history has proven America will never let ford fail. \n\n- USO is an ETF that tracks United States Oil, It’s trading extremely low, no reason not to diversify with this. ( The oil war between Saudi and Russia is coming to an end, this should do well in the long term) \n\n- Have you put any though into mutual funds to also diversify ? A good managed funds typically has large returns and low risk. \n\nReach out to me if you’d like.",
        "created_utc": 1586822188,
        "id": "fnbtsxw",
        "permalink": "/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/fnbtsxw/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1586850988.0
    },
    {
        "author": "LeGrandBoeufBleu",
        "body": "Why use Adobe when I could be playing video games, having sex, and drinking?",
        "created_utc": 1587674745,
        "id": "focr4f0",
        "permalink": "/r/wallstreetbets/comments/g6ujvp/shouldnt_adobe_be_killing_it_right_now/focr4f0/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587703545.0
    },
    {
        "author": "harley0417",
        "body": "I'm thinking about making MSFT, AMZN, V and MA (and maybe AAPL) the backbone of my portfolio. On top of that, maybe a semiconductor ETF and some combination of ADBE, BA, COST, GOOG, TSLA. I'm also considering XOM and ENPH. I'm always looking for new ideas though! Do you have any thoughts?",
        "created_utc": 1587778405,
        "id": "foi49wy",
        "permalink": "/r/wallstreetbets/comments/g7jm8g/thank_you_wsb_95k_in_2_months/foi49wy/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587807205.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Analysts are fucking retarded. This one really expects SPY to drop to 120. LMAOOOOOOOOO\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n[https://www.marketwatch.com/story/why-the-stock-market-is-nowhere-near-a-bottom-and-investors-can-expect-a-massive-hit-2020-04-13?mod=hp\\_minor\\_pos19&amp;adobe\\_mc=MCMID%3D06268509831920548542068106244447854213%7CMCORGID%3DCB68E4BA55144CAA0A4C98A5%2540AdobeOrg%7CTS%3D1586883748](https://www.marketwatch.com/story/why-the-stock-market-is-nowhere-near-a-bottom-and-investors-can-expect-a-massive-hit-2020-04-13?mod=hp_minor_pos19&amp;adobe_mc=MCMID%3D06268509831920548542068106244447854213%7CMCORGID%3DCB68E4BA55144CAA0A4C98A5%2540AdobeOrg%7CTS%3D1586883748)",
        "created_utc": 1586883799,
        "id": "fne69na",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fne69na/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586912599.0
    },
    {
        "author": "piggybanklol",
        "body": "Top Options by cost:\n\nADBE\tCall\t140.00\t06/19/20 (51 DTE)\t$30,532,761.00\n\nTSLA\tCall\t800.00\t05/01/20 (2 DTE)\t$27,587,200.00\n\nAAPL\tPut\t285.00\t01/15/21 (261 DTE)\t$13,149,675.00\n\nTGT\tPut\t120.00\t06/19/20 (51 DTE)\t$11,963,080.00\n\nFB\tCall\t200.00\t05/01/20 (2 DTE)\t$10,172,400.00\n\n\n\nTop Options by volume/oi\n\nNAME\tSIDE\tSTRIKE\tEXPIRATION\tVOL/OI\n\nBA\tCall\t145.00\t05/01/20 (2 DTE)\t9%\n\nLUV\tPut\t41.00\t05/15/20 (16 DTE)\t7%\n\nALGT\tPut\t175.00\t12/18/20 (233 DTE)\t4%\n\nADBE\tCall\t140.00\t06/19/20 (51 DTE)\t3%\n\nAAPL\tPut\t285.00\t01/15/21 (261 DTE)\t3%\n\n\nData from my scraper, used at your own risk",
        "created_utc": 1588185514,
        "id": "foz6j82",
        "permalink": "/r/wallstreetbets/comments/ga6tlc/daily_discussion_thread_for_april_29_2020/foz6j82/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588214314.0
    },
    {
        "author": "Bonzoso",
        "body": "Why am I not seeing any ADBE or SHOP in this thread?",
        "created_utc": 1586542122,
        "id": "fn0ho7q",
        "permalink": "/r/stocks/comments/fyjaff/sharing_my_top_companies_with_you/fn0ho7q/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1586570922.0
    },
    {
        "author": "Pattern_Gay_Trader",
        "body": "Or /u/17461863372823734920 who said \"I'm a professional developer and you don't know what the fuck you're talking about.\"\n\nProfessional frontend developer using Adobe Dreamweaver perhaps.",
        "created_utc": 1587043033,
        "id": "fnkycxm",
        "permalink": "/r/wallstreetbets/comments/g24tl6/someone_sold_emails_collected_from_the_old/fnkycxm/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587071833.0
    },
    {
        "author": "orrangearrow",
        "body": "It is absolutely retarded how much tech is outpacing the S&amp;P. It's all based on the belief that markets will correct and hit new ATHs. But hayseed poors were already having trouble before this RONA shitstorm. They were buying iPhones and computers and software subscriptions but a lot of that was bought with credit. Another month of this shit and nobody buying iPhones or puters of ADBE packages. Short QQQ and semis. That shit is flying too close to the sun",
        "created_utc": 1586936639,
        "id": "fngm0n5",
        "permalink": "/r/wallstreetbets/comments/g1duq3/what_are_your_moves_tomorrow_april_15_2020/fngm0n5/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1586965439.0
    },
    {
        "author": "UeberMeister",
        "body": "How's ADBE rising that fast, almost all of their subscribers are fucking broke now, freelance videographers, graphic designers, etc, won't get new jobs in a long time",
        "created_utc": 1586924050,
        "id": "fng79b5",
        "permalink": "/r/wallstreetbets/comments/g1duq3/what_are_your_moves_tomorrow_april_15_2020/fng79b5/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1586952850.0
    },
    {
        "author": "mages112",
        "body": "Long adobe. so many clip. best clip",
        "created_utc": 1586816173,
        "id": "fnbilin",
        "permalink": "/r/wallstreetbets/comments/g0rmrr/what_are_your_moves_tomorrow_april_14_2020/fnbilin/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1586844973.0
    },
    {
        "author": "fresh_ny",
        "body": "Adobe, likes to gravitate to 340+ then pull back to around 332.",
        "created_utc": 1588133388,
        "id": "fox3sce",
        "permalink": "/r/options/comments/ga2as6/wheeling_with_moderately_sized_25k_accounts/fox3sce/",
        "score": 3,
        "subreddit": "options",
        "created": 1588162188.0
    },
    {
        "author": "strikezero2",
        "body": "It's about one tenth in size of the big boys.\n\nThere are multiple stocks in that category. ADBE, CRM, PYPL, NVDA, SAP, INTC, CSCO, ORCL. \n\nSurely a huge tech success story, but not close to FAAMG in importance.",
        "created_utc": 1587759934,
        "id": "foh2yz3",
        "permalink": "/r/wallstreetbets/comments/g7dwrf/you_retards_asked_for_earnings_well_here_it_is/foh2yz3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587788734.0
    },
    {
        "author": "mesor",
        "body": "Nice of ADBE to give free photoshop licenses out for a month",
        "created_utc": 1586214947,
        "id": "fmmza69",
        "permalink": "/r/wallstreetbets/comments/fw6qn5/went_from_80k_to_22m_to_1m_in_the_past_month_time/fmmza69/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1586243747.0
    },
    {
        "author": "ranchsoup",
        "body": "TIL. I’m on some freeware. I jumped many frames n it still took forever. Going to try to get adobe cuz it made me never want to make a meme again.",
        "created_utc": 1586276864,
        "id": "fmp9g0i",
        "permalink": "/r/wallstreetbets/comments/fwl2lo/fed_chair_mountain_dew_camacho_powells_plan_to/fmp9g0i/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1586305664.0
    },
    {
        "author": "jmeloso",
        "body": "I am long AAPL, MSFT, AMZN, GOOG, FB, NVDA, AMD, NFLX, BABA, ADBE, TSLA.  Also recently purchased 12/31 279 SPY calls.\n\nI doubled down after the drop and my portfolio is doing better than ever.\n\nStop gambling and start investing and you’ll make money retards.   This was one of the best buying opportunities ever.",
        "created_utc": 1586890265,
        "id": "fnej2k3",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fnej2k3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1586919065.0
    },
    {
        "author": "walrusrampage",
        "body": "Like when I try to load a website but Adobe won't let me?",
        "created_utc": 1587485836,
        "id": "fo3f4j0",
        "permalink": "/r/wallstreetbets/comments/g5cllb/daily_discussion_thread_for_april_21_2020/fo3f4j0/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587514636.0
    },
    {
        "author": "toshi_g",
        "body": "TTD/TWLO/NOW/OKTA/DOCU/SQ/MDB\n\nAny SaaS essentially\n\nOr things like AAPL/MSFT/V/MA/FB/AMZN/GOOG/CRM/PYPL/NFLX/NVDA/ADBE if you want mega caps\n\nIf you want ETF MGK and VUG",
        "created_utc": 1587846842,
        "id": "fokq6p2",
        "permalink": "/r/stocks/comments/g80gsf/best_us_growthtech_stocks/fokq6p2/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1587875642.0
    },
    {
        "author": "minnesotatrans",
        "body": "In my opinion, the stock's price is a little too high for me.  Its' got an earnings yield of two percent.  While its' got $10 billion in book value, the market values the stock at $150 billion, with a good chunk coming from goodwill. It doesn't pay a dividend, meaning that consumers cannot get cash back (or reinvested to earn more shares)\n\n&amp;#x200B;\n\nAdobe may be a unique concept; but, the price is too high to invest into.",
        "created_utc": 1587508600,
        "id": "fo4pa71",
        "permalink": "/r/investing/comments/g5o11e/your_thoughts_about_adobe_adbe_stock/fo4pa71/",
        "score": 2,
        "subreddit": "investing",
        "created": 1587537400.0
    },
    {
        "author": "old-wizz",
        "body": "Thanks for sharing. I have some shortterm calls: xbi, tesla, shopify, amd and call leaps on big tech (microsoft, apple, adobe)",
        "created_utc": 1587692250,
        "id": "fodxysv",
        "permalink": "/r/options/comments/g62c0k/bynd_would_this_have_been_the_correct_entry/fodxysv/",
        "score": 2,
        "subreddit": "options",
        "created": 1587721050.0
    },
    {
        "author": "JealousEntrepreneur",
        "body": "That is the entire fucking point. More People use even for free so they get used to the product so it gets as oblivious as to \"google\" something. It's the same playbook adobe used to make their photoshop versions relativly easy to crack so that young  people learn how to use it and then companies later will pay for it to let those guys use it professionaly",
        "created_utc": 1585788659,
        "id": "fm68owq",
        "permalink": "/r/wallstreetbets/comments/ftbwyg/zooms_market_cap_is_basically_the_same_as_all_of/fm68owq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1585817459.0
    },
    {
        "author": "we_wuz_kangz_420",
        "body": "Yeah I'm getting a job now. After being ass raped these last 3 weeks on my puts and losing enough money to buy a brand new lexus LS. My risk/volatile tolerance and willingness to actively manage my portfolio is so fucking low now that I won't even get single company stock like Microsoft or Apple or Adobe or Tesla stock. Only sandp500 and total market ETFs. And only a couple single stock companies guaranteed to always be around forever like Waste Management or Coke or unilever.",
        "created_utc": 1586223476,
        "id": "fmndayk",
        "permalink": "/r/wallstreetbets/comments/fw70j6/what_are_your_moves_tomorrow_april_07_2020/fmndayk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586252276.0
    },
    {
        "author": "discovery999",
        "body": "Try to take you focus off the S&amp;P and Dow for a minute. There is a problem with every index fund right now. This is a stock pickers market with many industries failing during this virus and some flourishing. Indicies are too unpredictable right now. It’s easier to be bullish or bearish on individual stocks since rona could be with us until next year. Eg. Bullish; amzn, cost, wmt, msft, adbe, nflx etc... Bearish; trvg, ccl, aal, mgm, GE, fdx, jets, oil and all hospitality and tourism. We have 2 different economies running right now. Those that can perform fine with social distancing and those that can’t.",
        "created_utc": 1587168359,
        "id": "fnqnt2f",
        "permalink": "/r/stocks/comments/g39wj8/thats_it_im_out_i_dont_understand_whats_going_on/fnqnt2f/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1587197159.0
    },
    {
        "author": "firestormdude",
        "body": "AMD, Microsoft, Amazon, Activision, Adobe, Shopify. Can’t quite get 1 share of Amazon so I would do AMD and Microsoft with $1200",
        "created_utc": 1586991829,
        "id": "fnj4jrz",
        "permalink": "/r/stocks/comments/g22khe/top_stocks_to_buy_with_my_stimulus_check/fnj4jrz/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1587020629.0
    },
    {
        "author": "CrimsonBrit",
        "body": "Here’s a bunch of them: \n\nMicrosoft, Salesforce, Google, Amazon, InVitae, PayPat, Visa, MasterCard, Twilio, UnitedHealth, Facebook, Honeywell, General Motors, Adobe, Apple, Disney, Axon, Illumina, Phillips 66, Splunk, DocuSign, Activision Blizzard, Take-Two, Micron, Nvidia",
        "created_utc": 1586481376,
        "id": "fmya0tt",
        "permalink": "/r/StockMarket/comments/fxq98l/what_stocks_are_on_your_radar_for_next_week/fmya0tt/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1586510176.0
    },
    {
        "author": "CrimsonBrit",
        "body": "I appreciate the thought and effort that went into this write-up, however, you've done quite a bit of due diligence to ultimately pick 80% of the **FAANG** stocks (Facebook ($FB), Amazon ($AMZN), Apple ($AAPL), Netflix ($NFLX); and Alphabet ($GOOG) with Netflix being the one you did not pick in your list of six companies.\n\nEach of the FAANG stocks trades on the Nasdaq exchange and is included in the S&amp;P 500 Index. Since the S&amp;P 500 is a broad representation of the market, where the FAANGs make up about 15% of the S&amp;P 500—a staggering figure considering the S&amp;P 500 is generally viewed as a proxy for the United States economy as a whole,  you have basically just invested in the market as a whole, as stated by /u/Chuckox50.\n\nNot to mention that investing in Berkshire ($BRK.A) is like investing in an index fund of sorts, where Berkshire's \"fund\" also owns positions in Apple (33.9%), Amazon (0.57%), and Johnson &amp; Johnson (0.24%), adding to your positions in those three companies. Additionally, Berkshire owns relatively small positions in the SPDR S&amp;P 500 ETF Trust ([$SPY](https://www.bloomberg.com/quote/SPY:US)) and VANGUARD IX FUN/S&amp;P 500 ETF SHS NEW ([$VOO](https://www.bloomberg.com/quote/VOO:US)) ETFs, which both track the S&amp;P 500 and in turn have positions in some of the companies you have mentioned: Microsoft ($MSFT), Apple, Amazon, Facebook, Berkshire, Johnson &amp; Johnson, and Alphabet.\n\n**That being said, I still think that they are rock-solid choices and I have several of those on my radar and just as many already in my portfolio, and I intend to add to my positions for those companies.**\n\nI am investing for the long-term and currently have a high tolerance for risk, so the majority of the stocks on my lengthy list of about 55 companies on my radar right now are tech.\n\nJust to mention a bunch of them (on top of MSFT, AAPL, GOOG, NFLX, FB, and AMZN):\n\n* Financial: Visa, Mastercard, PayPal, Square\n* Healthcare: JNJ, UnitedHealth, AbbVie, Illumina, InVitae\n* Services: AMZN, Walmart, Disney, Spotfiy\n* Technology (Software): Oracle, Adobe, Salesforce, Shopify, Splunk, Docusign, Twiliio, The Trade Desk\n* Technology (Gaming): Activision Blizzard, Take-Two\n* Technology (Semiconductors): Intel, NVIDIA, AMD, Micron, Teradyne\n* Telecom/Communications: Verizon, AT&amp;T, Cisco\n\nI would like to caution you for your analysis in the write-up in regards to Berkshire. You state that your rationale for Berkshire having a competitive edge post-COVID-19 is simply \"Warren Buffett\". By the time that COVID is on the decline, Buffett will be 90 years old. I think the company can thrive without him, but if your basis for investing in that company for the long-term is a man born in 1930, I think you need to reassess your rationale.",
        "created_utc": 1586786989,
        "id": "fn9xrnw",
        "permalink": "/r/stocks/comments/g0er9t/building_a_postcovid19_investment_portfoliomy/fn9xrnw/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1586815789.0
    },
    {
        "author": "dvdmovie1",
        "body": "A lot of these names have been surprisingly resilient throughout this and have bounced quite a bit already in many cases. Things like MongoDB, Coupa (up 15% today after an upgrade), Veeva, Adobe, Microsoft, Five9, Ringcentral, Zoom and a number of others are at least back to flat YTD and in some cases up double digits %. Shopify is now +22% for the year, in mid March it was -20%. \n\nI like and own a number of names in this ETF, but I wouldn't be adding further at this point. If you like the space, I'd wait patiently and gradually add over time. So yes, I certainly like this sector for the long-term (quite a bit) but I would patiently wait for opportunities and add over time rather than just  piling in at this point.",
        "created_utc": 1586894349,
        "id": "fner3qt",
        "permalink": "/r/investing/comments/g1ch32/anyone_know_about_skyy_cloud_computing_question/fner3qt/",
        "score": 2,
        "subreddit": "investing",
        "created": 1586923149.0
    },
    {
        "author": "tybaldus",
        "body": "ADBE is 12% of my portfolio. I like the company and the stock but this is not one to play short term with. It's a bit expensive and investors know this probably hoping for some more drops to pick it up. My guess is that in the short term it will slowly go back to previous levels but it will not move as fast upwards as the other big tech players. You own a lot of it?",
        "created_utc": 1587509746,
        "id": "fo4rdu3",
        "permalink": "/r/investing/comments/g5o11e/your_thoughts_about_adobe_adbe_stock/fo4rdu3/",
        "score": 2,
        "subreddit": "investing",
        "created": 1587538546.0
    },
    {
        "author": "Asteradragon",
        "body": "Adobe is going to be releasing Illustrator for iPad sometime in 2020, apparently.",
        "created_utc": 1586874547,
        "id": "fndool3",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fndool3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586903347.0
    },
    {
        "author": "Offhisgame",
        "body": "Okay and is every industry impacted? Cyber security? Streaming video? Amazon? online shopping in general?\n\nLots of industries will see a 6 month decline and then be completely unscathed after. Look at Microsoft, Adobe, Okta, Crowdstrike, Intuit. These companies don't give a fuck. If anything this hurts their weak competitors and bolsters them. \n\nIf this sub was smart they would be focusing on oil - thats the real dog sector.",
        "created_utc": 1586880540,
        "id": "fndztxv",
        "permalink": "/r/wallstreetbets/comments/g14v6f/can_the_imf_and_jpow_get_on_the_same_page_for_f/fndztxv/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586909340.0
    },
    {
        "author": "nsfwson91",
        "body": "Good god you're retarded, how do you think adobe products work? Like jim from accounting works from home now so he needs to use photoshop?",
        "created_utc": 1587674846,
        "id": "focrf3w",
        "permalink": "/r/wallstreetbets/comments/g6ujvp/shouldnt_adobe_be_killing_it_right_now/focrf3w/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1587703646.0
    },
    {
        "author": "DonnySmallHandsTrump",
        "body": "nah that shit took y'all two weeks to make. Probably took y'all 2 hours to sign in to adobe premier",
        "created_utc": 1586816259,
        "id": "fnbirkr",
        "permalink": "/r/wallstreetbets/comments/g0rmrr/what_are_your_moves_tomorrow_april_14_2020/fnbirkr/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586845059.0
    },
    {
        "author": "sebasq",
        "body": "Check out VGT if you haven’t already. MSFT, V, Cisco, Adobe make up almost 30% of this. It has AAPL which brings it almost to 50%. Take a look at it’s top 10 holdings, physical tech and cloud tech.",
        "created_utc": 1586226757,
        "id": "fmnidxa",
        "permalink": "/r/stocks/comments/fwby3a/im_a_bull_and_i_believe_tech_will_be_up_in_the/fmnidxa/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1586255557.0
    },
    {
        "author": "Jackismyson",
        "body": "Here are my buys and prices. All bottom of technical channel. \n\n&amp;#x200B;\n\n* AAPL - $160\n* ADBE - $150\n* AMD - $30\n* AMZN - $1300\n* AON- $120\n* AVGO - $125\n* AXP - $49.57\n* BABA - $115\n* BAC - $15\n* BLL - $40\n* CDNS - $35\n* CHTR - $275\n* CMG - $325\n* COF - $40\n* COKE - $125\n* COST - $160\n* CRM - $100\n* D - $45\n* DHR - $79.82\n* DIS - $75\n* DXCM $125\n* EL - $105\n* EQIX- $325\n* EXAS - $35\n* FB - $125\n* GIS - $35\n* IRM - $20\n* ISRG - $300\n* JNJ - $75\n* KEYS - $60\n* LHX - $120\n* LOW - $50\n* LRCX - $83.85\n* LUV - $25\n* LYV - $30\n* MAA- $85\n* MAR - $35\n* MDB - $75\n* MSFT - $95\n* NKE - $50\n* NNN- $22\n* NOW - $180\n* NVDA - $150\n* O - $34.76\n* PG - $65\n* PLD - $35\n* RCL - $20\n* SBAC - $175\n* SBUX - $50\n* SNPS - $80\n* SO - $40\n* SPLK - $85\n* SRE - $70\n* T- $25\n* TDG - $150\n* TSLA - $250\n* TSM - $30\n* V - $95\n* VRTX - $125\n* VZ - $30\n* WELL - $20\n* WPC - $35",
        "created_utc": 1586207845,
        "id": "fmmm7fw",
        "permalink": "/r/wallstreetbets/comments/fw70j6/what_are_your_moves_tomorrow_april_07_2020/fmmm7fw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586236645.0
    },
    {
        "author": "discovery999",
        "body": "There is a problem with every index fund right now. This is a stock pickers market with many industries failing during this virus and some flourishing. Indicies are too unpredictable right now. It’s easier to be bullish or bearish on individual stocks since rona could be with us until next year. Eg. Bullish; amzn, cost, wmt, msft, adbe, nflx etc... Bearish; trvg, ccl, aal, mgm, GE, fdx, jets, oil and all hospitality and tourism. We have 2 different economies running right now. Those that can perform fine with social distancing and those that can’t.",
        "created_utc": 1587096983,
        "id": "fnnnzwb",
        "permalink": "/r/stocks/comments/g2smnz/buying_index_vs_individual_stocks_in_current_times/fnnnzwb/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1587125783.0
    },
    {
        "author": "meepstone",
        "body": "A rule of thumb for me is companies that will probably not go bankrupt and always make profit.\n\nYou have some that I am invested in: MSFT, GOOG, UNH, V.\n\nI also am in: JPM, COST, HD, AAPL, ADBE, PG.",
        "created_utc": 1587160025,
        "id": "fnq91zp",
        "permalink": "/r/StockMarket/comments/g35wli/i_need_advices_on_my_long_term_portfolio/fnq91zp/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1587188825.0
    },
    {
        "author": "spicyricerocket",
        "body": "Hey there--happy to give some feedback. I think your portfolio overall looks pretty decent, provided that you genuinely understand these companies and bought at reasonable prices. A good number of these companies have sustainable competitive advantages and good management, so you're off to a great start. Time is on your side, and since you're in your early 20s, there's no problem with being 100% in equities. In fact, if there was a time in your life to do so, it'd probably be now while you can afford the risk. \n\nOne point of contention that I'd like to mention is the equal weighting. Is that purposefully done? Personally, I think it's unnecessary. There's definitely a few companies in that portfolio in which you have much better understanding and conviction. Turn up the exposure on those (if they are at least fairly valued). For me, that would be DIS, MSFT, NKE, and ADBE, but for you that could be different.\n\nTo answer your question is \"14...too many to hold in a portfolio?\" I think no. Personally, I believe it's pointless to fixate on how many stocks you own. If you've got even 3 or 4 great holdings, what's holding #5 really going to do for you? Diversification for the sake of it, especially in these current market conditions, is irrational in my view. Great companies are really rare, and that's something I've come to appreciate over my investing journey. Spend time finding the truly exceptional organizations and run with them. Good luck!",
        "created_utc": 1586822214,
        "id": "fnbtul8",
        "permalink": "/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/fnbtul8/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1586851014.0
    },
    {
        "author": "bravo_company",
        "body": "Adobe, Salesforce, and other subscription based software aren't going to decline as much as you think. They are locked into multi-year contracts where customers pay license maintenance. They will only get hit where companies are not investing in technologies now and will hit their estimated sales",
        "created_utc": 1586299138,
        "id": "fmqgggp",
        "permalink": "/r/investing/comments/fwqxt7/the_case_for_a_severe_bear_market_in_the_coming/fmqgggp/",
        "score": 2,
        "subreddit": "investing",
        "created": 1586327938.0
    },
    {
        "author": "estevado",
        "body": "10 Buy and hold indefinitely stocks:\nTSLA, AMT, TWLO, V, MA, ADBE, NEE, ISRG, MELI, BAM\n\nneed 5 more?\nJD, SQ, ILMN, PYPL, SBUX\n\n5 for at least 5 years:\nTSCO, ROKU, ACN, PAYC, TTD",
        "created_utc": 1587939849,
        "id": "fooiw3n",
        "permalink": "/r/stocks/comments/g8j09r/buy_and_hold_forever/fooiw3n/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1587968649.0
    },
    {
        "author": "myglasstrip",
        "body": "Nasdaq is literally defensive lol. It's a new world. I set nasdaq on par with spy in my long term. Apple? Sitting on cash. That's the definition of defensive. The biggest names in nasdaq feel no pain. Microsoft, Apple, Amazon, Google, Facebook, talk about a strong defense. Lol PEPSI is in this man. Comcast? Adobe?(a literal money printer).\n\nDude nasdaq is amazing it has Starbucks tmobile... Like damn... I hadn't even seen the full list in awhile this is a star line up. \n\nIts hard to watch qqq sky rocket but that is literally the best companies in the world right now.",
        "created_utc": 1587456724,
        "id": "fo2c25q",
        "permalink": "/r/wallstreetbets/comments/g505w1/what_are_your_moves_tomorrow_april_21_2020/fo2c25q/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587485524.0
    },
    {
        "author": "proprietism",
        "body": "Actually, the more I consider, I would take out BABA and put in something like CRM, ADBE or TTD. The idea of holding a Chinese stock for 10 years as 10% of my portfolio when we can't trust their accounting and regulations adds too much risk and makes the potential gains potentially not worth it. I know China won't let them fail, but that may not stop them from being delisted from US exchanges after a crash at some point.",
        "created_utc": 1587564456,
        "id": "fo6pzpq",
        "permalink": "/r/stocks/comments/g5mzun/build_a_10company_longterm_portfolio/fo6pzpq/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587593256.0
    },
    {
        "author": "dwood38",
        "body": "Also this:\n\n\"As AWS is one of the largest cloud service provider, there are huge companies depending on the services, like\n\n1. Netflix - 19 million\n2. Twitch -15 million\n3. LinkedIn -13 million\n4. Facebook -11 million\n5. Turner broadcasting -10 millon\n6. BBC -09 million\n7. Baidu -09 million\n8. ESPN -08 million\n9. Adobe -08 million\n10. Twitter -08 million.\n\nWhere is even quota on this list which uses AWS services.\n\n(Data as of 2020)\"",
        "created_utc": 1587656478,
        "id": "fob60ok",
        "permalink": "/r/wallstreetbets/comments/g6k3gr/daily_discussion_thread_for_april_23_2020/fob60ok/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587685278.0
    },
    {
        "author": "RedditAlreadySaidIt",
        "body": "Yea I don’t think that’s a secret? If we don’t have a vaccine. I wonder how likely it would be that some schools would open, while others would remain closed? \n\nQuestion is how do we profit off it. Adobe?",
        "created_utc": 1587702611,
        "id": "foefnvt",
        "permalink": "/r/wallstreetbets/comments/g6tuin/what_are_your_moves_tomorrow_april_24_2020/foefnvt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587731411.0
    },
    {
        "author": "bonejohnson8",
        "body": "That was beautiful. I hope your free trial of Adobe Premier never runs out, friend.",
        "created_utc": 1587757004,
        "id": "fogu4t7",
        "permalink": "/r/wallstreetbets/comments/g77cd4/its_not_time_to_trade_fds_just_relax_take_it_easy/fogu4t7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587785804.0
    },
    {
        "author": "Lex-Luger",
        "body": "&gt;OKTA, AYX, COUP, CRWD, DDOG, NOW, ADBE, PAYC, VEEV, RNG, FIVN\n\n\nJesus, just looked at their historical growth and buying stock right now would feel like the textbook mistake of \"buying the top\". Their at all time highs or near all time highs during record unemployment and low consumer spending.\n\n\nI'm kind of amazed at just the sheer recovery these stocks made. I feel like many people are just too late. The best time to buy was around March 20-23, but it was just too scary to buy then. Hindsight.",
        "created_utc": 1587752854,
        "id": "fogi2pz",
        "permalink": "/r/investing/comments/g7c8ld/growing_saas/fogi2pz/",
        "score": 1,
        "subreddit": "investing",
        "created": 1587781654.0
    },
    {
        "author": "RetardStrength-",
        "body": "Here’s what I bought mid March crash:\nSPLK, NET, WDAY, VMW, CSCO, DAL, IT, HRL (in no particular order). \n\nWould like to add to: SPLK, WDAY, VMW\n\nAnd take new positions in: SBUX, WING, CRM, ADBE, HUBS, CRWD (depending on what pulls back). \n\nI own other stuff like ZM, AXP, JPM, DBX, WORK from early April lows which I can also add to. \n\nJust setting alerts and looking for good entry points.",
        "created_utc": 1587840466,
        "id": "fokeaib",
        "permalink": "/r/stocks/comments/g7svn9/if_the_market_crashes_again_who_are_you_dumping/fokeaib/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587869266.0
    },
    {
        "author": "BF5lagsssss",
        "body": "Honestly why bet on options. It's a true gamble. I instead just loaded all my money into IB and just bought stocks like MSFT, Home Depot, Adobe, TSM, Coke, Raytheon and Merck and am pretty happy with how the stock market so far. I dont aggressively buy options and even my GS friends tell me they aren't suppose to be the key of a portfolio. Options are really hard to read with the market being so volatile and the VIX being so high and with earnings outlook negative it's really hard to judge whether the option is ITM. The only safe bet I think is to buy 2 year calls at best but I rather buy equities than buy options since they are expensive due to standard contract size and uncertainty.",
        "created_utc": 1587847411,
        "id": "fokr8r3",
        "permalink": "/r/wallstreetbets/comments/g7wees/how_to_play_earnings_like_you_have_a_braincell/fokr8r3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587876211.0
    },
    {
        "author": "troutrecruiter",
        "body": "Why ADBE? I think the subscription model is clearly a winner but my concern is with their growth.",
        "created_utc": 1587958907,
        "id": "fopdpqs",
        "permalink": "/r/stocks/comments/g8j09r/buy_and_hold_forever/fopdpqs/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587987707.0
    },
    {
        "author": "edwerderdab",
        "body": "TDOC — 13%\nSQ — 11%\nMA — 11%\nROKU — 11%\nBZUN — 11%\nMELI — 11%\nADBE — 10%\nTTD — 9%\nSBUX — 7%\nAAPL — 6%\n\nShould I consider trimming TDOC anytime soon? 24, playing the long game,  better to let it run? \n\nNext moves will be to bring AAPL and SBUX up to speed (opportunistically) and pick from my watch list\n\nSHOP\nTSLA\nHD\nMCK\n\nShould probably own MSFT and AMZN too... hoping to end up with around 15 stocks by EOY, close to equally weighted, with the ultimate goal of 20-25 stocks\n\nThe above totals roughly 60% of my total holdings (Roth)\n\nThe other 40% is equally weighted across ETFs in a traditional 401k",
        "created_utc": 1585976676,
        "id": "fmdsmgl",
        "permalink": "/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/fmdsmgl/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586005476.0
    },
    {
        "author": "proprietism",
        "body": "QQQ (Nasdaq Index)\n\nFDN (internet companies index. Top 5 holdings: Amazon, Google, Facebook, Netflix, Cisco)\n\nIGV (software index. Top 5 holdings: Microsoft, Oracle, Adobe, Salesforce, Intuit)\n\nARKQ (automation, robotics, AI, 3D printing. Top 5 holdings: Tesla, Proto Labs, Xilinx, Stratasys, Materialize)\n\nPEY (high dividend growth index. Outperformed SPY from 2008-2019 while paying like 5-6% dividend yield.)",
        "created_utc": 1586061209,
        "id": "fmgyd4s",
        "permalink": "/r/stocks/comments/fv3pcg/pick_5_long_term_stocks/fmgyd4s/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586090009.0
    },
    {
        "author": "gmansawesome",
        "body": "Pirating is super easy, it sounds and looks complicated but it’s easy.\n\nGet a torrent-friendly VPN, or not because it doesn’t really matter. Then install utorrent. That’s it.\n\nI use Pirate Bay, just search something up, click “get this torrent” then it will automatically open up utorrent and install the thing.\n\nIf you dm me your Gmail I recently had to pirate adobe premier pro for a friend and I could send it to you.",
        "created_utc": 1586121404,
        "id": "fmj1ytr",
        "permalink": "/r/wallstreetbets/comments/fvl7le/trump_convinces_jpow_to_print_more_money/fmj1ytr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586150204.0
    },
    {
        "author": "TiredOfDebates",
        "body": "I just recently started to tool around with adobe illustrator (and vector art in general).\n\nFor someone who has absolutely no formal art training, it's pretty amazing what you can pull off with vector art.  Layers + separating complex shapes down into basic components.",
        "created_utc": 1585839176,
        "id": "fm7y8kp",
        "permalink": "/r/wallstreetbets/comments/ft9by5/in_light_of_the_logo_change_i_decided_to_draw_the/fm7y8kp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585867976.0
    },
    {
        "author": "FargotRobMe",
        "body": "It's a catalyst maybe for the very recent pop, but the underlying is worth a lot based on their outlook and company structure. They are extremely healthy and are experiencing the growth on par with MSFT, ADBE, etc. and have held a significant amount of value throughout CV.  Mind you, they've been holding near parabolic growth for a year+.\n\nReal talk, outside of options, I am heavily invested into AMD and will be increasing my position as they correct to $45 and then continue increasing.",
        "created_utc": 1585753986,
        "id": "fm4h1qp",
        "permalink": "/r/wallstreetbets/comments/fsxqpm/daily_discussion_thread_april_01_2020/fm4h1qp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585782786.0
    },
    {
        "author": "simplyOriginal",
        "body": "And the others? May I guess... ADBE?",
        "created_utc": 1585765233,
        "id": "fm52pab",
        "permalink": "/r/stocks/comments/fsxsus/why_are_people_buying_tech_stocks_right_now/fm52pab/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585794033.0
    },
    {
        "author": "Good_Sportsman",
        "body": "I wouldnt bother with pot stocks atm. Trump nor Biden will legalize and even if they did it would be a clusterfuck. Bernie would but he's got a hard fight to win the nomination. So you're looking at 4 years min for federal legalization then how ever long it takes the states to all get their rules in place. So I see 4 years worrying if things like this virus will push pot companies into insolvency with little reason for a pump. Its literaly the biggest month for pot ever and its cancelled instead of it being a month of pumping.\n\nPlus right now a whole shit load of good companies with decent financials are at a value. You'll in my opinion make more upside putting your cash in bluechips and waiting the virus out. Just my 2cents. I'd stick to shit like googl, msft, ttd, adbe, fb, wm, rtn, lmt, adp, apd, ma, v, etc. These should get you returns and some even yeild a lil dividend.\n\nIf your heart is set on pot stocks the only one I'd put money on is iipr. As pot companies need funds they sell their realestate to iipr and then iipr rents it back to them. As pot companies struggle it should leave opportunity for iipr to grow and profit. They are a reit so they pay a decent dividend. Only caution is if banking becomes available it could act as competition but shouldnt be a big deal or even a concern for a while as congress is too inept to handle even just this pandemic much less a pandemic while performing normal business. Hell without the pandemic the senate/McConnell was still useless. So yeah I'm not worried about congress actually acting on anything really ever unless it involves lining their own pockets.\n\nI am as long as I need on iipr and I dumped all my pot stocks early on in this mess for reinvestment capitol. But the above are my reasons, hopefully its useful.",
        "created_utc": 1586178462,
        "id": "fml4lp1",
        "permalink": "/r/StockMarket/comments/fvxf2g/pot_cbd/fml4lp1/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1586207262.0
    },
    {
        "author": "ThisWeeksHuman",
        "body": "sorry I don't have time to really give you much , ill just throw a few at you: fraport, total oil, wirecard, lpkf laser, nel asa (speculative position), adobe systems, maybe mtu aero engines which in my opinion is safer than an airline and less risky so if you want to invest into anything air traffic related its only fraport and mtu that I'd recommend. airbus is worse than mtu and boeing worse than airbus. visa, amazon, microsoft, are kinda safe positions but I didn't research them yet and the upside potential is less high.",
        "created_utc": 1586284589,
        "id": "fmpop09",
        "permalink": "/r/stocks/comments/fwlpul/in_broad_strokes_why_just_why/fmpop09/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586313389.0
    },
    {
        "author": "BF5lagsssss",
        "body": "Delta Air Lines\n\nVMWare\n\nRaytheon Technologies \n\nMerck \n\nAmerican Tower\n\nCrown Castle\n\nLennar\n\nAdobe\n\nMSFT\n\nBoeing\n\nAlphabet \n\nUnited Rentals\n\nADP\n\nPaychex",
        "created_utc": 1586671245,
        "id": "fn5p55l",
        "permalink": "/r/StockMarket/comments/fznrgh/longterm_investors_what_industry_andor_specific/fn5p55l/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1586700045.0
    },
    {
        "author": "CapitalC5",
        "body": "You're free to make your own choices of course, he just asked my opinion. \n\nTTWO has no debt, higher assets over liabilities percentage, way faster growth and growth potential. AAPL is great, just a bit limited in my eyes, but definitely very close to that top 20.\n\nI can't include them all. There are also ADBE, AMD, BAC, JNJ, ENPH, SQ, VISA and others that didn't make it but are great companies.",
        "created_utc": 1586600230,
        "id": "fn2rdmh",
        "permalink": "/r/stocks/comments/fyjaff/sharing_my_top_companies_with_you/fn2rdmh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586629030.0
    },
    {
        "author": "LongLoans",
        "body": "Go take a look at the largest companies in the Nasdaq and tell me which ones you think need a bailout. AAPL, MSFT, AMZN, GOOG, FB don’t need any help and make up over 40% of the Nasdaq. Hard to see NFLX, AMGN, COST, ADBE, or CSCO needing help. \n\nMost companies won’t need help and if you plan on shorting the market, you are shorting the basket, not just those that need help.",
        "created_utc": 1586660232,
        "id": "fn5azj7",
        "permalink": "/r/wallstreetbets/comments/fzkhjw/the_stock_buy_back_bubble_go_pop/fn5azj7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586689032.0
    },
    {
        "author": "lowflyingdutchman",
        "body": "Hi all, I would like some advice. \n\nWhat are the best stocks to get at the moment? I feel like I missed out on quite a lot like: NVDA, AMD, AMZN, SHOP and TSLA\n\nWhat could be some good options? What do you think about these?\nENPH, DIS, ADBE, BRK, TSM, TTD and maybe AAPL\n\nI'm really stuck, guys",
        "created_utc": 1587132720,
        "id": "fnoshr9",
        "permalink": "/r/investing/comments/g30top/daily_advice_thread_all_basic_help_or_advice/fnoshr9/",
        "score": 1,
        "subreddit": "investing",
        "created": 1587161520.0
    },
    {
        "author": "btoned",
        "body": "Do they only offer the video conferencing? If there's no suite of apps from them I'm going all in on puts. At least shit from MSFT or Adobe includes a multitude of services.",
        "created_utc": 1586799075,
        "id": "fnaki5i",
        "permalink": "/r/wallstreetbets/comments/g0gvfn/daily_discussion_thread_april_13_2020/fnaki5i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586827875.0
    },
    {
        "author": "rangersfan1717",
        "body": "Recently started out planning a long term portfolio (5+ years) that I will continue to invest in over time.  Currently at 16 stocks evenly-weighted and tried to find stocks with low debt, good financials, and potential room for growth:\n\nSEDG, ENPH, MSFT, ADBE, AAPL, AMD, ALXN, MDT, TMO, BIIB, VRTX, JNJ, AMZN, LULU, GOOG, COST\n\nAs you can see, primary focus is in healthcare and tech.  Also have an SP500 tracking etf as about 25% of the portfolio.\n\nOn my watchlist:\n\nROKU, TTWO, CHGG, NTES, EQIX, CSCO, VEEV\n\nAlso I'm young (early 20s) so my risk tolerance is higher than it would be years from now.",
        "created_utc": 1586790001,
        "id": "fna2xpz",
        "permalink": "/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/fna2xpz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586818801.0
    },
    {
        "author": "spicyricerocket",
        "body": "Hey there! Happy to give some feedback. Overall, I think this portfolio is certainly on its way, but I'd really need to know your age-range, risk tolerance, and personal investment goals. That said, you are perhaps a young, growth-minded, and relatively risk-tolerant investor, based upon your holdings. I think the roughly 50% weighting in a large cap growth index fund is adequate. At that point, I think it's certainly acceptable to branch out into individual equities (again, this is only if my previous assumptions are correct).\n\nThat said, I would personally drop FTEC. Why? Because technology is a broad sector with lots of real, discernible winners in there. Instead of picking all of them, I'd load up on those winners. To me (and to you), MSFT is one of those winners. They dominate. They're well managed. They've got growth in the form of public cloud--a long-term secular tailwind. I'd also throw ADBE and CRM in there as well.\n\nAs for TSLA, I don't like the financials or dynamics of the auto business. Sure, they're not just an auto company, but that's a significant portion of their operations. Management-wise, Musk is an incredible innovator, but I don't see him as an equally incredible CEO. That's just a terribly brief version of my 2 cents, but if you know better, go on right ahead.\n\nAs for COST, I think it's a real winner. Sure, the valuation is rich, but it is seriously one of the best businesses around. I'd go so far as to say I like it even better than AMZN. Hope this helps. Good luck!",
        "created_utc": 1586822887,
        "id": "fnbv1vh",
        "permalink": "/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/fnbv1vh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586851687.0
    },
    {
        "author": "jmeloso",
        "body": "Finally someone that makes sense.\n\nI am long AAPL, MSFT, AMZN, GOOG, FB, NVDA, AMD, NFLX, BABA, ADBE, TSLA.  Also recently purchased 12/31 279 SPY calls.\n\nI doubled down after the drop and my portfolio is doing better than ever.\n\nThank you for sharing.",
        "created_utc": 1586826852,
        "id": "fnc1uba",
        "permalink": "/r/wallstreetbets/comments/g0tdhg/why_we_wont_see_major_drops_anymore/fnc1uba/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586855652.0
    },
    {
        "author": "Jamie_DiamondHands",
        "body": "ADBE is a silent  juggernaught! Too bad only have 1/4 of the account into them.\n\nNobody is talking about them",
        "created_utc": 1586891076,
        "id": "fneknw7",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fneknw7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586919876.0
    },
    {
        "author": "soccernut1905",
        "body": "I’m a college-aged student with approx 5K saved and I’m looking to invest it.  \n\nI’ve spent a week putting together a portfolio of stocks I think are either undervalued or are built to thrive through the pandemic:\n\nCE, ADBE, LMT, MNST, QLCM, FB, INCY, ABC, BABA, CRM, MRL, FTNT, VRTX, KEYS, ETSY\n\nQuestion would be - other than what do you think of the portfolio - should I wait until the next market dip to put money in or look to invest my money now/over the next week?\n\nThank you so much in advance for your advice!",
        "created_utc": 1586840876,
        "id": "fncmtxk",
        "permalink": "/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/fncmtxk/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586869676.0
    },
    {
        "author": "firestormdude",
        "body": "Microsoft, AMD, Shopify, Adobe, The Trade Desk",
        "created_utc": 1586497349,
        "id": "fmyvura",
        "permalink": "/r/stocks/comments/fy4evw/what_are_your_top_45_growth_stocks_for_the_next_5/fmyvura/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586526149.0
    },
    {
        "author": "Offhisgame",
        "body": "All you need to look at to know youre wrong are the leaders.\n\nTrash and things shut for months are down. Software is barely down and stocks like MSFT or ADBE will likely be at new highs in a few months",
        "created_utc": 1586573632,
        "id": "fn1z2yj",
        "permalink": "/r/wallstreetbets/comments/fyt6mm/for_everyone_who_wants_to_understand_what_the_fed/fn1z2yj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586602432.0
    },
    {
        "author": "BF5lagsssss",
        "body": "MSFT and Alphabet. I got Adobe. Others have been pretty steady too like Hkme Depot. I personally dont think Apple is a good buy since yes the new iPhone releases soon but there's no one else to buy since the entire worlds balance sheet has basically grinded to a halt and is saddled with debt. I personally avoid Apple.",
        "created_utc": 1588073730,
        "id": "fou1tew",
        "permalink": "/r/StockMarket/comments/g9cdiq/investors_have_51_trillion_hiding_out_in_the/fou1tew/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1588102530.0
    },
    {
        "author": "Gnome_Village",
        "body": "Ironically, buying a house is what 1st made me research them. Being able to sign all the paperwork that comes with buying a house from my living room at my convenience was priceless to me. The more I dove into them as a company the more I liked them. I don't see them slowing down anytime soon. I'm sure there will be ups and downs especially as Adobe ramps up in the document signing wars, but DOCU isnt going anywhere.",
        "created_utc": 1588262938,
        "id": "fp2jqco",
        "permalink": "/r/stocks/comments/gaxra5/thoughts_on_docu/fp2jqco/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588291738.0
    },
    {
        "author": "old-wizz",
        "body": "I have the Apple, Microsoft, Activision and Adobe Leaps. Solid picks imo",
        "created_utc": 1588146338,
        "id": "foxjxg7",
        "permalink": "/r/options/comments/ga4z7u/any_good_leaps_to_be_had_out_there/foxjxg7/",
        "score": 1,
        "subreddit": "options",
        "created": 1588175138.0
    },
    {
        "author": "Atreyu1002",
        "body": "I think a good analogue is Photoshop. GIMP does most of what PS does, and arguably is better since the code is much much better. But PS _feels_ better, and has the UI everyone is accustomed to. PS will be nearly impossible to dethrone at this point, despite Adobe being a completely crap company.\n\nAdditionally, Google still requires an account and registration to join a meeting. AFAIK, you can join Zoom just by downloading the app. That point of friction is huge among the non-tech crowd.",
        "created_utc": 1588178536,
        "id": "foysuey",
        "permalink": "/r/investing/comments/ga8hd9/google_takes_on_zoom_makes_meet_video/foysuey/",
        "score": 1,
        "subreddit": "investing",
        "created": 1588207336.0
    },
    {
        "author": "piggybanklol",
        "body": "Unusual Options Flow:\n\nNAME\tSIDE\tSTRIKE\tEXPIRATION\tCOST\n\nADBE\tCall\t140.00\t06/19/20 (50 DTE)\t$30,532,761.00\n\nALGT\tPut\t175.00\t12/18/20 (232 DTE)\t$5,525,650.00\n\nSIX\tPut\t65.00\t01/21/22 (631 DTE)\t$4,930,000.00\n\nAMZN\tPut\t2,275.00\t05/08/20 (8 DTE)\t$3,464,020.00\n\nBABA\tCall\t170.00\t05/29/20 (29 DTE)\t$2,584,860.00\n\nThat AMZN put looks suspicious",
        "created_utc": 1588255733,
        "id": "fp25t78",
        "permalink": "/r/wallstreetbets/comments/gaszeo/daily_discussion_thread_for_april_30_2020/fp25t78/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588284533.0
    },
    {
        "author": "delsystem32exe",
        "body": "Hey you can get adobe preimeir hacked/free. I just installed a pirated illustrator and i install a pirated premier, but the permier somehow didnt work, the pirated file was kinda buggy, so i will find another pirated one premier, that was coded right.",
        "created_utc": 1585760947,
        "id": "fm4ubad",
        "permalink": "/r/wallstreetbets/comments/ft0cw3/autists_get_a_margin_call/fm4ubad/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585789747.0
    },
    {
        "author": "Hey_Jimbo",
        "body": "**New Investor seeking judgment on portfolio!**\n\nHello everyone, I've recently compiled a watch list of some stocks, ETFs, and a mutual fund. My ultimate goal is to generate long-term growth. Please give me any thoughts or critiques you may have. Thanks a million! \n\nStocks: LULU, CPRT, MGRC, MSFT, ADBE, MA, PAYC, PFSI, NMIH | ETFs: FTEC, SCHG, SMH, SPYG | Mutual Fund: TRIRX",
        "created_utc": 1585942058,
        "id": "fmcao6y",
        "permalink": "/r/investing/comments/fu7c30/daily_advice_thread_all_basic_help_or_advice/fmcao6y/",
        "score": 1,
        "subreddit": "investing",
        "created": 1585970858.0
    },
    {
        "author": "avatarfire",
        "body": "Idk if you’re trolling or what, premiere and after effects belong to Adobe.",
        "created_utc": 1585891598,
        "id": "fmaeke1",
        "permalink": "/r/wallstreetbets/comments/fu2f8m/how_do_i_make_these_funny_videos_people_post_on/fmaeke1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585920398.0
    },
    {
        "author": "Nutmasher",
        "body": "Warren Buffett made 2.5 billion dollars in 2009 selling puts on the index.\nIf you're going long, you're doing it correctly at this time.  Just make sure it's in something that's going to do well in the next few years.  Index, AMZN, ADBE, JNJ, MSFT, AAPL, BA, GOOG",
        "created_utc": 1585794438,
        "id": "fm6hwi7",
        "permalink": "/r/stocks/comments/ft662u/every_time_i_make_a_trade_the_price_drops_510/fm6hwi7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585823238.0
    },
    {
        "author": "wizard_1109",
        "body": "I agree Adobe thesis, I don’t see any competition in its niche spaces with amount of service they provide. \n\nI’m still struggling to understand the business of Salesforce and how it’s differentiate itself from other SaaS and how it can maintain its “moat” so to say.",
        "created_utc": 1586479721,
        "id": "fmy7dtp",
        "permalink": "/r/SecurityAnalysis/comments/fuxxv2/does_anyone_understand_why_shop_is_still_trading/fmy7dtp/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1586508521.0
    },
    {
        "author": "MLGIsLyf",
        "body": "[Adobe](https://www.google.com/search?q=adobe+stock+price&amp;oq=adobe+&amp;aqs=chrome.0.69i59j69i57j69i59j0l2j69i60l2j69i61.2259j0j7&amp;sourceid=chrome&amp;ie=UTF-8)",
        "created_utc": 1586458099,
        "id": "fmx42v4",
        "permalink": "/r/wallstreetbets/comments/fxqidb/daily_discussion_thread_april_09_2020/fmx42v4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586486899.0
    },
    {
        "author": "BonBelafonte",
        "body": "Love ADBE. Long calls 400c late July.",
        "created_utc": 1586891386,
        "id": "fnela64",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fnela64/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586920186.0
    },
    {
        "author": "BF5lagsssss",
        "body": "Holy shit how u get so much money to play puts. If I had so much to invest I would have just retired and left the remaining in Adobe and Home Depot.",
        "created_utc": 1586890904,
        "id": "fnekbvd",
        "permalink": "/r/wallstreetbets/comments/g17zmf/feast_your_eyes_on_my_losses_689k_on_spx_puts/fnekbvd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586919704.0
    },
    {
        "author": "ftstacks",
        "body": "MSFT, FB, ADBE, ENPH",
        "created_utc": 1586894610,
        "id": "fnerm78",
        "permalink": "/r/stocks/comments/g19oba/choose_your_favourite_tech_stocks_out_of_the/fnerm78/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586923410.0
    },
    {
        "author": "indrgun",
        "body": "Why no Adobe, Square and Salesforce?",
        "created_utc": 1586545974,
        "id": "fn0oxks",
        "permalink": "/r/stocks/comments/fyjaff/sharing_my_top_companies_with_you/fn0oxks/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586574774.0
    },
    {
        "author": "40AcresandaMeme",
        "body": "Adobe $330C 5/15 cause everyone is using PDF more than actual paper lulz",
        "created_utc": 1586728677,
        "id": "fn7vv4w",
        "permalink": "/r/wallstreetbets/comments/g05g7j/wsb_community_voted_yolo_pt_3/fn7vv4w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586757477.0
    },
    {
        "author": "yourjusticewarrior",
        "body": "Buying calls in ADOBE because of this after effects masterpiece.",
        "created_utc": 1586273237,
        "id": "fmp2m2z",
        "permalink": "/r/wallstreetbets/comments/fwl2lo/fed_chair_mountain_dew_camacho_powells_plan_to/fmp2m2z/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586302037.0
    },
    {
        "author": "tendrils87",
        "body": "We just switched from Skype for Business to Jabber, but I like WebEx and Adobe Connect better for meetings",
        "created_utc": 1586050804,
        "id": "fmgk4ml",
        "permalink": "/r/wallstreetbets/comments/fufas0/weekend_discussion_thread_april_35_2020/fmgk4ml/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586079604.0
    },
    {
        "author": "bean_scott_card",
        "body": "The bizarre thing is that even with all the cash they have they are still pussies when it comes to competing with adobe and salesforce in the digital advertising realm",
        "created_utc": 1586169342,
        "id": "fmkunuh",
        "permalink": "/r/wallstreetbets/comments/fvlczz/what_are_your_moves_tomorrow_april_06_2020/fmkunuh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586198142.0
    },
    {
        "author": "wizard_1109",
        "body": "This is great insight! What makes Adobe and CRM stand out more compare to its competitors?",
        "created_utc": 1586475676,
        "id": "fmy0pw5",
        "permalink": "/r/SecurityAnalysis/comments/fuxxv2/does_anyone_understand_why_shop_is_still_trading/fmy0pw5/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1586504476.0
    },
    {
        "author": "kotdbt",
        "body": "Look at client lists to see who is the trusted company by the companies who need security most. Rapid7 has the most impressive client list in the industry. Monsanto, Northrop, Raytheon have deep dark secrets. RPD also services Amazon, Adobe, Microsoft, Deloitte blah blah blah. Makes Palo Alto looks like they work with children.\n\n&amp;#x200B;\n\n[https://www.featuredcustomers.com/vendor/rapid7/customers](https://www.featuredcustomers.com/vendor/rapid7/customers)",
        "created_utc": 1587259267,
        "id": "fnucs22",
        "permalink": "/r/wallstreetbets/comments/g3f8a4/cybersecurity_plays_aka_fastest_growing_industry/fnucs22/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587288067.0
    },
    {
        "author": "adrock4u80",
        "body": "Adobe is in that space too.",
        "created_utc": 1587326507,
        "id": "fnwvy21",
        "permalink": "/r/stocks/comments/g4dr44/thoughts_on_docusign/fnwvy21/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587355307.0
    },
    {
        "author": "Benzo_Head",
        "body": "Adobe market cap : 171 b",
        "created_utc": 1587567425,
        "id": "fo6vcva",
        "permalink": "/r/wallstreetbets/comments/g5yjae/daily_discussion_thread_for_april_22_2020/fo6vcva/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587596225.0
    },
    {
        "author": "Hitmannnnn",
        "body": "Tech etf. Microsoft and apple make up about 40% of it. The rest are small holdings in others like visa, mastercard, nvidia, intel, cisco, adobe, etc",
        "created_utc": 1587643943,
        "id": "foabs61",
        "permalink": "/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/foabs61/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587672743.0
    },
    {
        "author": "Gk786",
        "body": "BR-4200*",
        "created_utc": 1586464177,
        "id": "fmxfstd",
        "permalink": "/r/wallstreetbets/comments/fxu37i/2020_time_person_of_the_year/fmxfstd/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1586492977.0
    },
    {
        "author": "mczyk",
        "body": "br br br brrrrrrrrrrrrrrrrr",
        "created_utc": 1586855390,
        "id": "fnd1ttv",
        "permalink": "/r/wallstreetbets/comments/g0wz6b/robinhood_is_giving_me_75_in_credit_for_a_20k/fnd1ttv/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1586884190.0
    },
    {
        "author": "pdwp90",
        "body": "I had to add the line `re.sub('br[r]+','BRR',comments.lower())` to my Python script to accommodate all the different ways people spell brr.\n\nThat translates \"br\" + any amount of number of \"r\"s into just \"BRR\".\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n#",
        "created_utc": 1586480185,
        "id": "fmy84ta",
        "permalink": "/r/wallstreetbets/comments/fy4mql/what_wsb_discussed_today/fmy84ta/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1586508985.0
    },
    {
        "author": "btoned",
        "body": "You literally have \"Br\" in your fuvking username.",
        "created_utc": 1586544757,
        "id": "fn0mnqb",
        "permalink": "/r/wallstreetbets/comments/fyf9yz/weekend_discussion_thread_april_1012_2020/fn0mnqb/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1586573557.0
    },
    {
        "author": "tiefighter1992",
        "body": "Can't spell Brawndo without Br.\n\nIt's got what plants crave.",
        "created_utc": 1586220993,
        "id": "fmn9e9m",
        "permalink": "/r/wallstreetbets/comments/fw70j6/what_are_your_moves_tomorrow_april_07_2020/fmn9e9m/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586249793.0
    },
    {
        "author": "ipodmaster8",
        "body": "brrrrrr brrrr brr br",
        "created_utc": 1585794075,
        "id": "fm6hcp9",
        "permalink": "/r/wallstreetbets/comments/ftdfzj/bulls_when_they_find_out_the_printer_has_run_out/fm6hcp9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1585822875.0
    },
    {
        "author": "GateOfFire",
        "body": "I would load up on LEAPS for the companies that will survive on their financials with or without a BR buyout. Chances are those are the one(s) he'll target, and if not then they'll recover organically.",
        "created_utc": 1586163040,
        "id": "fmkp2nh",
        "permalink": "/r/wallstreetbets/comments/fvlczz/what_are_your_moves_tomorrow_april_06_2020/fmkp2nh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586191840.0
    },
    {
        "author": "Its_the_dankness",
        "body": "Oh shit, that’s what’s up. Had some buddies talking about it but didn’t know much beyond it being some sort of BR",
        "created_utc": 1586408606,
        "id": "fmv822o",
        "permalink": "/r/wallstreetbets/comments/fxev5z/what_are_your_moves_tomorrow_april_09_2020/fmv822o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586437406.0
    },
    {
        "author": "HourPackage",
        "body": "br cough cough rrrr",
        "created_utc": 1585746325,
        "id": "fm44jkg",
        "permalink": "/r/wallstreetbets/comments/fsxqpm/daily_discussion_thread_april_01_2020/fm44jkg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585775125.0
    },
    {
        "author": "shrimpgangsta",
        "body": "Brrr. Burr. Br.",
        "created_utc": 1586136164,
        "id": "fmjrefb",
        "permalink": "/r/wallstreetbets/comments/fvdstq/money_printer_go_brrr/fmjrefb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586164964.0
    },
    {
        "author": "Leaveittoybot",
        "body": "Alright so I think we can all agree that the market is rigged and the only people who are in the circle of this knowledge are Trump's cronies.\n\nWhat we want is that juicy inside info, and what better way to get it than by getting it from his own bloodline. I'm talking Barron Trump.\n\nI think it's safe to speculate that he has graduated from Minecraft and has entered the autistic realm of fortnite. Unfortunately we can't bribe him with V-bucks but his BR squad is garbage. If we have a group of autistic individuals who can prove their worth to Barron, get squaded up with him, we can then start pulling sweet sweet insider info coming straight from the source that is Papa Trump. Wallstreetbets becomes actually profitable and we don't have to Photoshop our gains anymore.\n\nFrom this we take on Questrade and avenge that poor little girl.",
        "created_utc": 1585900400,
        "id": "fmang56",
        "permalink": "/r/wallstreetbets/comments/ftujl1/what_are_your_moves_tomorrow_april_03_2020/fmang56/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585929200.0
    },
    {
        "author": "theycallmeryan",
        "body": "I feel like a boomer but I can’t get into BR games. I grew up playing COD4-MW2 and Halo 3, I’ll always prefer team based stuff",
        "created_utc": 1586647162,
        "id": "fn4r435",
        "permalink": "/r/wallstreetbets/comments/fyf9yz/weekend_discussion_thread_april_1012_2020/fn4r435/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586675962.0
    },
    {
        "author": "legospartan",
        "body": "BR",
        "created_utc": 1586835534,
        "id": "fncfka1",
        "permalink": "/r/wallstreetbets/comments/g0rmrr/what_are_your_moves_tomorrow_april_14_2020/fncfka1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586864334.0
    },
    {
        "author": "fracklenackle",
        "body": "Brrrrrrrr...... RRRRRREEREECCRCHHHSCHCH BRRRRRRR BR BRRRR",
        "created_utc": 1586555108,
        "id": "fn15cfb",
        "permalink": "/r/StockMarket/comments/fykb2d/based_on_how_the_market_has_reacted_to_the_news/fn15cfb/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1586583908.0
    },
    {
        "author": "redtexture",
        "body": "Do not exercise.\n\nYour breakeven prior to expiration is the cost of entry.\n\nWhen you exercise, you throw away extrinsic value you can harvest br selling the option.\n\n\"Breakeven\" provided by brokers is AT EXPIRATION OR UPON EXERCISE. Ignore.\n\n2nd question, No, except to exit early, or roll out in time for larger credit and extrinsic value,  to make the cost of exercising higher for the long.",
        "created_utc": 1586556003,
        "id": "fn16xoy",
        "permalink": "/r/options/comments/fvryce/noob_safe_haven_thread_april_0612_2020/fn16xoy/",
        "score": 1,
        "subreddit": "options",
        "created": 1586584803.0
    },
    {
        "author": "M3L0NM4N",
        "body": "mista j pow sir when is br coming?",
        "created_utc": 1585929137,
        "id": "fmbmag6",
        "permalink": "/r/wallstreetbets/comments/fu6gsh/daily_discussion_thread_april_03_2020/fmbmag6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585957937.0
    },
    {
        "author": "EyeTrollYou",
        "body": "FOTR GRUN BR R FOK",
        "created_utc": 1586023448,
        "id": "fmfax7h",
        "permalink": "/r/wallstreetbets/comments/fufas0/weekend_discussion_thread_april_35_2020/fmfax7h/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586052248.0
    },
    {
        "author": "TheHappyItalianMan",
        "body": "BRRRRRR BRRRRRRR BRRRRR BRRRR BRR BR\n\nPRINTER RUNNING OUTTA INK😴😴😴🤧\nPUTS = PRINT 🥶🥶📈 💎🤲🏽\n\n\nAny single ladies here? Sup girls? 🤒",
        "created_utc": 1586523197,
        "id": "fmzkmdi",
        "permalink": "/r/wallstreetbets/comments/fyf9yz/weekend_discussion_thread_april_1012_2020/fmzkmdi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586551997.0
    },
    {
        "author": "StaffSgtDignam",
        "body": "&gt; It was a once in a lifetime buying opportunity, so just be patient. If the market is going to collapse, you'll know because the agents will be trying everything to get you to buy.\n\nReal talk, I bought a studio in NW DC for dirt cheap in 2012. Ironically, real estate prices in the area have risen so much, I've been priced out from buying a significantly larger spot now (2+ br) without moving far, far out to the burbs (currently renting again while renting out my studio). I've been waiting for another buyer's market so I'm really pumped for this. How were you narrowing your search during this time period? I found my 1st place because my roommate at the time was a real estate agent and specialized in foreclosures/short-sales.",
        "created_utc": 1586536628,
        "id": "fn074gd",
        "permalink": "/r/wallstreetbets/comments/fyemug/my_take_unemployment_and_why_75_of_the_population/fn074gd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586565428.0
    },
    {
        "author": "trojanmana",
        "body": "yup.  they bring in 5k net a month and spend 4800 of it. unemployment benefits can help but they fucked. rent in LA is 2500 -3k a month for 2 br. auto lease 500-800 with insurance. thats before food and utilities.  fall and winter gonna be rough.",
        "created_utc": 1586615700,
        "id": "fn390i9",
        "permalink": "/r/wallstreetbets/comments/fz19tl/10000_person_long_bread_line_in_texas_spy_400/fn390i9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586644500.0
    },
    {
        "author": "JoJoMaMa85",
        "body": "I know someone who works in a couple of Broadridge Financial Solution's (BR) warehouses. Dozens of people have gotten sick and two people have died. BUT, we gotta keep the fucking doors open and not give a shit about employees. \n\nFuck these businesses putting their employees lives at risk.",
        "created_utc": 1586267968,
        "id": "fmot7g1",
        "permalink": "/r/wallstreetbets/comments/fwim5b/daily_discussion_thread_april_07_2020/fmot7g1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586296768.0
    },
    {
        "author": "___alexa___",
        "body": "ɴᴏᴡ ᴘʟᴀʏɪɴɢ: [Touch The Sky (From &amp;quot;Br](https://www.youtube.com/watch?v=-8Q_OpCE-4k) ─────────⚪───── ◄◄⠀[▶](https://www.youtube.com/watch?v=-8Q_OpCE-4k)⠀►►⠀ 1:41 / 2:32 ⠀ ───○ 🔊 ᴴᴰ ⚙️",
        "created_utc": 1586140045,
        "id": "fmjy0z5",
        "permalink": "/r/wallstreetbets/comments/fvlczz/what_are_your_moves_tomorrow_april_06_2020/fmjy0z5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586168845.0
    },
    {
        "author": "SportsDogsDollars",
        "body": "I think Calgary and Edmonton will take a trim (might be small, but could be a big trim). They never did have a strong bounce back from the 2015 debacle. Now with the 1-2 punch of oil layoffs and corona virus some people are fucked and panicking. I have the following comments to support a decline in Calgary specifically: \n\n\\-Job losses in oil and layoffs from COVID\n\n\\-The market hadn't fully bounced back since 2015\n\n\\-There's already a huge influx of fully furnished apartments hitting websites like RentFaster. People's investment properties that run on Air BNB are now empty and burning holes in their pockets. The market can only absorb so many of these rentals hitting the market at once. Few people want to move apartments in this environment, so its quite plausible these units will have to be put up for sale. Then you have even more folks forced to sell, without an increase in buyers. \n\n\\- Using a specific example. There was a 1 BR+den unit in Mission (Young but nice area, within walking distance of downtown Calgary) for $293K. It was being used for short term rentals. This week the priced dropped $75K to $218K. \n\nI'm expecting some more fire sales out of desperation (job losses and empty investment properties) which will drag down the price of most sales. Long term though there could be 1 last boom in AB oil and gas. Should TMX, KXL and Enbridge Line 3 replacement all be executed and put into service, the mid 2020s could provide 1 last big hurrah for Canadian Oil.",
        "created_utc": 1586188626,
        "id": "fmllar8",
        "permalink": "/r/CanadianInvestor/comments/fw026r/canadian_housing_market_predictions/fmllar8/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1586217426.0
    },
    {
        "author": "SubParMarioBro",
        "body": "Obama stimulus printer went Br.\n\nNow it’s Brrrrrrrrrr.",
        "created_utc": 1586762060,
        "id": "fn97eub",
        "permalink": "/r/wallstreetbets/comments/fzqt8e/ive_read_through_all_the_top_dd_spy_posts_of_the/fn97eub/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586790860.0
    },
    {
        "author": "Papalopicus",
        "body": "Warzones been taking my time. It's a fun mindless, doesn't have that wonky BR feel or abilities from Apex.",
        "created_utc": 1585756701,
        "id": "fm4m5xf",
        "permalink": "/r/wallstreetbets/comments/fsxqpm/daily_discussion_thread_april_01_2020/fm4m5xf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585785501.0
    },
    {
        "author": "badtradesguy",
        "body": "eh ive been going long since the drop. cant say it hasnt worked.\n\nas for the next 6mnths, I think itll br alright. \n\nafter that is where id be concerned.",
        "created_utc": 1586499140,
        "id": "fmyxs50",
        "permalink": "/r/wallstreetbets/comments/fxzxh1/why_monday_will_be_red_gg_bears_we_won/fmyxs50/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586527940.0
    },
    {
        "author": "NontranslationalGod",
        "body": "Br R Fu",
        "created_utc": 1586122357,
        "id": "fmj3mh5",
        "permalink": "/r/wallstreetbets/comments/fvlczz/what_are_your_moves_tomorrow_april_06_2020/fmj3mh5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586151157.0
    },
    {
        "author": "ottermodee",
        "body": "BR? Huehuehuehuehue",
        "created_utc": 1586139441,
        "id": "fmjx02y",
        "permalink": "/r/wallstreetbets/comments/fvlczz/what_are_your_moves_tomorrow_april_06_2020/fmjx02y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586168241.0
    },
    {
        "author": "Sen5atus",
        "body": "They were gonna go BR anyways. I’d give it a month or two",
        "created_utc": 1586044127,
        "id": "fmg9idg",
        "permalink": "/r/investing/comments/fv3x4n/with_corona_how_close_will_deutsche_bank_get_to/fmg9idg/",
        "score": 1,
        "subreddit": "investing",
        "created": 1586072927.0
    },
    {
        "author": "wesmt",
        "body": "Br realistic at least...500",
        "created_utc": 1586043855,
        "id": "fmg9276",
        "permalink": "/r/wallstreetbets/comments/fv3rlt/200_million_potentially_temporarily_unemployed_in/fmg9276/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586072655.0
    },
    {
        "author": "DicklexicSurferer",
        "body": "Your printer go ^br",
        "created_utc": 1586273946,
        "id": "fmp3vw1",
        "permalink": "/r/wallstreetbets/comments/fwl9xx/doubling_down_is_the_key_to_success_finally_a/fmp3vw1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586302746.0
    },
    {
        "author": "hoodedcactus",
        "body": "“Brrrrrrrrrrrrrrr brrrrr brrrr”. Sir, what can you say about the epidemic? “Brrrrrrrrrrrr brrrr br”. Guys, the Mnuchin bot is broken again",
        "created_utc": 1586455990,
        "id": "fmwzx9r",
        "permalink": "/r/wallstreetbets/comments/fxscmt/secretary_mnuchin_came_onto_cnbc_this_morning/fmwzx9r/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586484790.0
    },
    {
        "author": "4LK4D3M",
        "body": "Br^r^r^r^r^r^r^r^r^r^r^r^r",
        "created_utc": 1586641417,
        "id": "fn4hdaq",
        "permalink": "/r/wallstreetbets/comments/fyf9yz/weekend_discussion_thread_april_1012_2020/fn4hdaq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586670217.0
    },
    {
        "author": "road_to_0_mmr",
        "body": "I have a bunch oh June/May long calendars too. lined up from 245 to 235 or so. My reasoning behind is that:\n- you have the wind in your back with thetha\n- if IV goes up your tent goes up so you're good\n- as i've opened them OTM your profit/risk is about 4:1 so pretty decent\n- I'll br looking in the next day to slightly do diagonals (maybe 1-2 strikes apart) so the're more on the downside\n\nSo you don't see a lot of thetha in your favor because being otm you are around the edge of profitability for  the spreads. But if it goes moderately down (even slow bleed) will quickly turn both volatility and thetha in your favor. \n\nAt least this is my stupid autistic reasoning (or lack of)",
        "created_utc": 1586717725,
        "id": "fn7colo",
        "permalink": "/r/wallstreetbets/comments/g00tkz/when_market_crash_inevitably_comesdont_scream_guh/fn7colo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586746525.0
    },
    {
        "author": "Stalkaturnedtyper",
        "body": "Br",
        "created_utc": 1586786029,
        "id": "fn9w9lw",
        "permalink": "/r/wallstreetbets/comments/g0gvfn/daily_discussion_thread_april_13_2020/fn9w9lw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586814829.0
    },
    {
        "author": "badtradesguy",
        "body": "The thing is we dont know where we are.\n\nYes ive had the same question of whether we are in the same situation as japan years ago too. ive since had my mind changed, although I do keep it in the back of my mind.\n\nA bull trap - you dont know if its going to continue down until after the fact.\n\nA bear trap. - well thats just the stock going down. This whole big drop could be a \"bear trap\" .\n\nin both scenarios its just up to the individual how you look at it, kind of like a half empty/half full. \n\nLike I said, the way to deal with a big sideways market is dollar cost averaging. You'd still be able to make profit even in that.\n\nAnd all your assumptions youre making are based on hindsight by looking back. Its ignoring that, certain events can trigger a change. events that we arent aware of.\n\nJust like the big stimulus package.\n\nFor this extreme bear market to happen, youd need a  pretty big catalyst which would lead to extended unemployment,reduced spending, reduced foreign investment.\n\nI dont think the US govt would let it get to that level. Look at the past two bail outs.\n\nYes we the US could be like japan, but it may not br an apples to apples comparison, if you look at 90s US vs 90s japan. At this point, the US is the biggest developed \"free market\" with a highly educated , highly diverse work force...so if investors are seeking returns, where else would they put their money? their bed? 1-2% bonds? investors could have left japan and put their money in the US. without the US market, where will investors put their money?",
        "created_utc": 1586865492,
        "id": "fndbedg",
        "permalink": "/r/StockMarket/comments/g0ua5i/what_really_is_happening_in_stock_markets/fndbedg/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1586894292.0
    },
    {
        "author": "justanotherit",
        "body": "I would like this too.\n\nSeems like Questrade will do PACC on some BlackRock ETFs like XGRO or XBAL. But it's not very well supported from either BlackRock or Questrade. BR no longer lists an up to date form and Questrade doesn't make any commission, so they may or may not help out. But you can try. They do DRIP too.\n\nOther than that, WealthSimple Invest, this is what you pay them for, fully automatic from deposit, purchase,   reinvest dividends and rebalancing.\n\nIf there is something else, I want to know too.",
        "created_utc": 1586747360,
        "id": "fn8q2qs",
        "permalink": "/r/CanadianInvestor/comments/g09krg/online_brokerage_with_autobuy/fn8q2qs/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1586776160.0
    },
    {
        "author": "MSL0727",
        "body": "Very very bad company. I went from HP to Hewlett-Packard Enterprise to DXC Technology, and the whole time we were employed at DXC there was a feeling of death around with no morale and a very sad feeling around the fact that most were told they should just be happy they have a job. Although I literally sat and watched as person by person around me all inevitably got laid off. They'd come in on Thursday and be told the next day (Friday) would be their last day and they'd be lucky to get severance. I eventually left the company because of anything could be better, and I was looking to grow and not be held down. \n\nNo raises or bonuses for years, layoffs left and right, vile environment, etc. I wouldn't own it, but then again I don't track the stock price and I see it from a perspective that would never interest me in looking.",
        "created_utc": 1586103820,
        "id": "fmi77dw",
        "permalink": "/r/investing/comments/fvf4dm/dxc_technology/fmi77dw/",
        "score": 1,
        "subreddit": "investing",
        "created": 1586132620.0
    },
    {
        "author": "maximuminimum",
        "body": "pwr hr flt",
        "created_utc": 1585767760,
        "id": "fm57iv6",
        "permalink": "/r/wallstreetbets/comments/fsxqpm/daily_discussion_thread_april_01_2020/fm57iv6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585796560.0
    },
    {
        "author": "flyingfunk",
        "body": "FLT- Drone Delivery",
        "created_utc": 1585762563,
        "id": "fm4xhl0",
        "permalink": "/r/CanadianInvestor/comments/fssvlx/what_is_your_biggest_holding/fm4xhl0/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1585791363.0
    }
]