[
    {
        "author": "NervousTumbleweed",
        "body": "https://www.nytimes.com/2020/07/01/world/asia/taiwan-china-hong-kong.html\n\nThis, coupled with the CEO of MSI “falling” off of a 7 story building, seems very troubling. \n\nI wouldn’t hold AMD leaps folks. I wouldn’t have said that a month ago. Fuck China.",
        "created_utc": 1594255801,
        "id": "fxdh8s9",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1594284601.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "I’m going to reiterate my [MRK](https://www.reddit.com/r/wallstreetbets/comments/hkpyve/weekend_discussion_thread_for_the_weekend_of_july/fww5ouh/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) comment with some additional research. \n\nFirst off, there’s currently a huge [shortage ](https://www.cnbc.com/2020/07/06/more-than-70-countries-at-risk-of-running-out-of-hiv-drugs-due-to-coronavirus-pandemic-who-says.html) of HIV meds where basically what happened is part supply chain disrupt, but also the two drugs they were using proved to be ineffective for HIV patients because of covid. Something about them is no longer working. \n\nSecondly, MRK’s press release for their phase 3 trial of [Islatravir](https://www.cnbc.com/2020/07/06/more-than-70-countries-at-risk-of-running-out-of-hiv-drugs-due-to-coronavirus-pandemic-who-says.html) is set to begin soon after their presentation at the AIDS 2020 virtual divulging that the Phase 2b results proved that their drug has higher efficacy and safety from the analyses. \n\nThirdly, MRK has a proven track record for putting up great [earnings](https://finance.yahoo.com/news/why-earnings-surprise-streak-could-161004767.html), and most analysts are bullish already about them for their earnings coming out 7/31. And will be even more so in the near future thanks to their EIDD-2801 exclusive rights from RidgeBack Therapeutics for an antiviral for covid until others produce a sustainable vaccine, and more so because they’ll likely make up the shortage for HIV meds with current meds and their upcoming Islatravir. \n\nFuthermore, MRK just got [FDA approval](https://www.mrknewsroom.com/newsroom/news-releases/news-details/2020/FDA-Approves-Mercks-KEYTRUDA-pembrolizumab-for-First-Line-Treatment-of-Patients-With-Unresectable-or-Metastatic-MSI-H-or-dMMR-Colorectal-Cancer/default.aspx) to use Keytruda for first-line colon cancer. Which will only drive their earnings. \n\nUnfortunately I can’t share the seeking A article, but it goes into further detail about why antivirals will be very important in the coming months since vaccines are still projected to be at least 6 months out, if not longer. If you want to see the SA article just google “Antivirals Rather Than Vaccines for COVID-19”\n\nAlso, the EIDD-2801 candidate they have rights to from RidgeBack is currently in quite a few trials, but one of the more pertinent one is in South Africa where they’re needing 50 HIV positive people to see if it can help prevent covid in them, but also they’re secretly hoping by sheer luck that the same drug can help manage HIV at the same time it prevents covid. \n\nSticking with my originals 7/31 $85-$90c, and 10/16 $90-$95, but I’ll also add 1/21 $100-$105c since there are many analysts setting $100+ fair values for eoy.\n\nEdit: TL;DR— MRK $85+ calls cause they make the good drugs for bad things and it make printer go brrrrrrrr.",
        "created_utc": 1594172562,
        "id": "fx9pas2",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594201362.0
    },
    {
        "author": "xesus2021",
        "body": "I recall, it was 2008. \n\nYou could go to BEST BUY and get a Motorola C168i, in a circular clamshell package.   It was a $15 dollar cellphone, that is what it cost, $15.\n\nIt also came with $10 of airtime, and thus, the phone itself only ended up costing $5. \n\n=== ==== ===== \n\nI bought at least three dozen of those things.",
        "created_utc": 1594788519,
        "id": "fy44ceb",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594817319.0
    },
    {
        "author": "FelWill",
        "body": "I'm jacked to the tits on boomer stocks. MSI, NOK, FLIR, RTX, C, BRK.B, BP, RDS.B, HSBC",
        "created_utc": 1594830435,
        "id": "fy5p7zy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594859235.0
    },
    {
        "author": "Extension-appeal",
        "body": "Samsung Kawasaki toyota Motorola",
        "created_utc": 1595211488,
        "id": "fymbdt8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595240288.0
    },
    {
        "author": "demnutz6666",
        "body": "Motorola cheapskate reporting",
        "created_utc": 1593637523,
        "id": "fwmj88b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593666323.0
    },
    {
        "author": "stanky_puss",
        "body": "$MSI calls will bring tendies to any autist who buys them",
        "created_utc": 1595602487,
        "id": "fz3gijd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595631287.0
    },
    {
        "author": "HeAbides",
        "body": "CPU: Intel i5-4970k\nMOBO: Asus z97 pro\nRAM: Corsair 64GB ddr4\nGFX: MSI GTX 1080 12gb\nInstalling to a few month old Samsung EVO 860",
        "created_utc": 1593994718,
        "id": "fx1tzr2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594023518.0
    },
    {
        "author": "Estate4reaL",
        "body": "I used to think that motorola and blackberry were very very good at making phones..",
        "created_utc": 1593678098,
        "id": "fwobvwi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593706898.0
    },
    {
        "author": "CallinCthulhu",
        "body": "Conveniently forgot to mention Samsung, LG, and Motorola.\n\nApple only has 20% market share.\n\nShit example",
        "created_utc": 1594097547,
        "id": "fx6c9e4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594126347.0
    },
    {
        "author": "zerooneinfinity",
        "body": "People said the same about blackberry, motorola, nokia. It's all about what's cool and those companies are going the way of the dodo bird. I own a Toyota, and love the service. But I'm not even thinking about buying another. Tesla is just way cooler for not much more.",
        "created_utc": 1593798868,
        "id": "fwtqdyc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593827668.0
    },
    {
        "author": "40034243",
        "body": "Everyone loved Motorola. Everyone loved Nokia’s. It’s going to change. Something big is going to happen.",
        "created_utc": 1594998002,
        "id": "fyd5row",
        "score": 1,
        "subreddit": "investing",
        "created": 1595026802.0
    },
    {
        "author": "0ddb4l1",
        "body": "that's great. Show me how Motorola and Nokia built a platform anything like Apple in terms of revenue streams. Even with a decrease in iPhone sales, Apple is positioned well. And if you don't think they're looking to acquire and continue to expand their offerings you're delusional.\n\nYou're just assuming something has to change because of those past failures. You made no point to my post other than 'something big is going to happen' backed by nothing.",
        "created_utc": 1594998296,
        "id": "fyd6ckt",
        "score": 1,
        "subreddit": "investing",
        "created": 1595027096.0
    },
    {
        "author": "BloodMossHunter",
        "body": "can anyone look into MSI and tell us why it keeps dropping over the last xx months? It had huge highs, it beats earnings IIRC but it is on downward slope. The chart looks like its consolidating.",
        "created_utc": 1594458786,
        "id": "fxn3hak",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594487586.0
    },
    {
        "author": "soap808s",
        "body": "Anyone who knows this industry... if Huawei is banned  - could they essentially buy out another US cell company (Nokia, Motorola) so they continue to be in business here?",
        "created_utc": 1594307667,
        "id": "fxfgx5q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594336467.0
    },
    {
        "author": "desice",
        "body": "Um.. what? When the smart phone came out, did we see a similar thing? Two decades later,, where is Nokia, Ericsson, Motorola, LG? FOH",
        "created_utc": 1594351572,
        "id": "fxhu3xn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594380372.0
    },
    {
        "author": "mammaryglands",
        "body": "A Motorola with a cracked up screen",
        "created_utc": 1594777243,
        "id": "fy3mk2z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594806043.0
    },
    {
        "author": "makesalotofpancakes",
        "body": "MSI Stealthbook. Amazing performance/cost/size balance. Most importantly, they run cooler than Razer.",
        "created_utc": 1593796389,
        "id": "fwtlk85",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593825189.0
    },
    {
        "author": "daevas_dantanian",
        "body": "You'd think they would have learned from Motorola.",
        "created_utc": 1593818128,
        "id": "fwup7pz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593846928.0
    },
    {
        "author": "whatifitried",
        "body": "&gt;If you think F, GM, Toyota, and every other major car company don’t have a plan to fully integrate EV once the consumer is actually READY for it, you’re insane.\n\nI think they have plans for that.\n\nI also think those plans will fail for all but one of those companies.  Blackberry had plans, Motorola had plans.\n\nDisruption really hits incumbents hard, and they do not have the proper leadership in place at any level to change the way the company works in such a profound way.",
        "created_utc": 1594650369,
        "id": "fxxjx8p",
        "score": 1,
        "subreddit": "investing",
        "created": 1594679169.0
    },
    {
        "author": "michaelwriting",
        "body": "I can't imagine any demand for $25k+ seasonal luxury motorcycles under current circumstances either.\n\nHOG just shed 700 jobs last week and the stock is still hanging around, even uptrending.\n\nThe market does not always mirror reality. Funny you should mention MOT/MSI. I worked there when the dot com bubble bursted.",
        "created_utc": 1594679138,
        "id": "fxz6n9d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594707938.0
    },
    {
        "author": "michaelwriting",
        "body": "Back at the day, all the MOT/MSI news was focused on the consumer cell phone market flinging up and down. But their hidden cash cow was in their government contract projects.",
        "created_utc": 1594679661,
        "id": "fxz7ncr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594708461.0
    },
    {
        "author": "stanky_puss",
        "body": "Sold my 8/21 MSI $140 calls at yesterday’s top and rolled into $150 and $155 calls as well as doubling up on $160 calls (all 8/21 expiry). Wish me luck, boys",
        "created_utc": 1595602005,
        "id": "fz3fk50",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595630805.0
    },
    {
        "author": "Mojeaux18",
        "body": "CEOs can make a hell of a difference.  \nJack Welch of GE retired. Immelt sunk it.  \nBob Galvin of Motorola retired, years of struggle and his son Chris sank it. \n\nRegarding selling of stock the argument is that his paper wealth is not cash.  \nAnd you argue that even 4b is more than 1000 lifetimes but that’s false.  1000 lifetimes like you and I.  But as your expense goes up things get more complicated.  We buy a house it’s complicated.  We buy 10 houses it’s more than 10 times complicated and you need to hire managers.  Hire 10 managers and you have even more complications.  And so on.",
        "created_utc": 1593989211,
        "id": "fx1kezt",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1594018011.0
    },
    {
        "author": "40034243",
        "body": "The younger generation liked Nokia. They liked Motorola. Everything changes.",
        "created_utc": 1594998035,
        "id": "fyd5u3h",
        "score": 1,
        "subreddit": "investing",
        "created": 1595026835.0
    },
    {
        "author": "project21124",
        "body": "MSI has much better laptops for the same or lesser price",
        "created_utc": 1594767692,
        "id": "fy3630m",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594796492.0
    },
    {
        "author": "stanky_puss",
        "body": "MSI calls 8/21 $140 strike",
        "created_utc": 1594603278,
        "id": "fxvwil8",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594632078.0
    },
    {
        "author": "FactualNeutronStar",
        "body": "You don't know what you're talking about. Not car batteries, batteries. Like Powerwall. Like the 129 MWh battery farm in Australia. The farm in Australia alone made Tesla tens of millions - imagine that scaled up across the globe. With renewables like solar and wind coming to dominate electricity generation, utility-scale batteries will be necessary to store that electricity. That business alone will be worth billions. \n\nVehicle to grid is similar but much more decentralized. People can plug in their vehicle and earn some extra cash simply to use their car as energy storage. Same with robotaxis. Tesla can skim off the top and still outcompete Uber/Lyft with no labor cost. \n\nYes a lot of these come from the same product but that's *exactly why* Tesla is worth so much. What you're essentially doing is treating an iPhone the same as a Motorola flip phone. Yes they both make calls. But an iPhone has tons of other services in the form of software that make it worth far more than any flip phone.",
        "created_utc": 1595469665,
        "id": "fyxsip9",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1595498465.0
    }
]