[
    {
        "author": "88crypto",
        "body": "I wouldn't trust old boomer,  who sold DAL for 20, right in the bottom,  who denied investing in AAPL until late 2018, and was still bullish on IBM until the same year.  He outperformed by 90% of hedge funds and major indexes in last 10 years.  He's, probably, still bullish on railroads and coal.",
        "created_utc": 1591396144,
        "id": "ft0sa60",
        "permalink": "/r/wallstreetbets/comments/gx8p6h/hertz_bankruptcy_is_cancelled_by_robinhood/ft0sa60/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1591424944.0
    },
    {
        "author": "LordMeatwich",
        "body": "So there was a guy in the daily thread earlier that said he had some insider info that IBM would only be using AMD going forward, but wasn’t sure on the time frame of the news. Obviously just some random dude on the Internet, but looking up AMD stock on Robinhood, the most recent article is about unusual bullish options activity. Thinking of getting in tomorrow. Anybody know anything about any of this?",
        "created_utc": 1591155058,
        "id": "fspju1g",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fspju1g/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591183858.0
    },
    {
        "author": "nebraskajone",
        "body": "IBM, 50% payout, 12% dividend growth over last 10 years, 4.96 yield",
        "created_utc": 1591717504,
        "id": "fthi68f",
        "permalink": "/r/investing/comments/gzmtji/book_summary_get_rich_with_dividends_in_4/fthi68f/",
        "score": 10,
        "subreddit": "investing",
        "created": 1591746304.0
    },
    {
        "author": "Loro1991",
        "body": "insider bought $100K worth of CLDR calls, buyout just announced. Very good chance its IBM\n\nhttps://newsfilter.io/a/2088184062928b5c3dee00890ebfa92f",
        "created_utc": 1591727475,
        "id": "fti366t",
        "permalink": "/r/wallstreetbets/comments/gzkapz/daily_discussion_thread_for_june_09_2020/fti366t/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591756275.0
    },
    {
        "author": "LimbaughsBlackLung69",
        "body": "So I have some slight DD/Insider info...\n\nAMD and IBM is all I’ll say. Not sure on dates or prices.\n\nApparently, IBM is going to be using only AMD procs in their servers. Not sure when they’ll put that info out there.\n\nBut there you go retards.",
        "created_utc": 1591125235,
        "id": "fsnz1y3",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnz1y3/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591154035.0
    },
    {
        "author": "Dougiejurgens2",
        "body": "We should start a 3x leveraged downtrodden boomer etf. BA, ibm, airlines, cruise lines, KO etc",
        "created_utc": 1593552599,
        "id": "fwiowpy",
        "permalink": "/r/wallstreetbets/comments/hiv3zw/what_are_your_moves_tomorrow_july_01_2020/fwiowpy/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1593581399.0
    },
    {
        "author": "LimbaughsBlackLung69",
        "body": "Reposting from earlier. \n\nAMD has a deal with IBM to start solely providing them their processors. I posted the insider info a week or two ago in one of the megathreads. I don’t know when the deal will be announced.\n\nDo what you wish with that information my fellow autists.",
        "created_utc": 1592237683,
        "id": "fuwx60o",
        "permalink": "/r/wallstreetbets/comments/h9dhxy/daily_discussion_thread_for_june_15_2020/fuwx60o/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1592266483.0
    },
    {
        "author": "VanillaBox",
        "body": "T $32c 9/18 - Not moving. Good enough\n\nKO $50c 9/18 - Ripping my asshole in half\n\nBUD $55c 9/18 - Ripping my asshole in half\n\nIBM $130c 10/16 - Meh\n\nJ $90c 10/16 - Not moving\n\nWFC $30c 01/2021 - Not moving\n\nOKE $40c 01/2021 - Mild up\n\nXOM $52.5c Jan 2021 - Meh\n\nI need a bull run bad :(",
        "created_utc": 1592858933,
        "id": "fvob0fh",
        "permalink": "/r/wallstreetbets/comments/hdzqai/what_are_your_moves_tomorrow_june_23_2020/fvob0fh/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1592887733.0
    },
    {
        "author": "__justsayin__",
        "body": "Not sure why this was downvoted, it's literally true.  It's funny how on Canadian**Investor** people ignore the whole \"past performance is not indictivie of future results\", especially when it comes to Warren.  Fact is - from airlines, to not acting *at all* during the March lows, to investments in questionable companies like IBM, *completely* missing out on companies like Amazon and other tech firms that have grown a ton over the past 5, 10 years, a very large dud by investing in Occidental Petroleum (which is down a shit ton since he got in a year or two ago), and on and on it goes - he's made a lot of mistakes recently.   He's just not sharp enough to keep up with investing in 2020, with tech making up a bigger portion of the markets (&amp; society) along with a very aggressive fed.",
        "created_utc": 1591485319,
        "id": "ft7j7f7",
        "permalink": "/r/CanadianInvestor/comments/gxymnx/warren_buffet_is_continuing_to_sell_should_we_do/ft7j7f7/",
        "score": 8,
        "subreddit": "CanadianInvestor",
        "created": 1591514119.0
    },
    {
        "author": "OfficialHavik",
        "body": "PowerPC was a dying architecture though and IBM was already a dinosaur company even at that point. Mobile is hot yes, but x86 isn't dying, which is why I find this move surprising. Unless Apple wants to be suuuuuper ahead of the game and throw away all that prior software support just to be so.",
        "created_utc": 1591713322,
        "id": "fth9x6q",
        "permalink": "/r/investing/comments/gzlam3/apple_will_announce_move_to_armbased_macs_later/fth9x6q/",
        "score": 8,
        "subreddit": "investing",
        "created": 1591742122.0
    },
    {
        "author": "BlackHammer20",
        "body": "Also IBM: Would need to increase in value by 50% to reach all time high set in 2012",
        "created_utc": 1591719506,
        "id": "fthmc2r",
        "permalink": "/r/investing/comments/gzmtji/book_summary_get_rich_with_dividends_in_4/fthmc2r/",
        "score": 7,
        "subreddit": "investing",
        "created": 1591748306.0
    },
    {
        "author": "PatientFaithlessness",
        "body": "Hello fellow autists,\n\nMany of you know me as the $DOCU preacher, who stuck his mighty COCKU into $DOCU last week and pulled out after massive 4x returns. (\\~$40k in total profit). If your father's son is looking to wank himself off for the coming few months, I am presenting a new opportunity!\n\n(*caution: This post will contain ideas that are for not suited for the faint in heart, but rather targeting autists who wish to earn a FUCKING PROFIT!)*\n\nAs many of you know, $WORK is, in essence, a replacement for email. It is a remote collaboration tool that allows people to effectively work together, access hundreds of thousands of critical applications and services, and find important information to do their best work. Last week they reported solid earnings, with Revenue jumped 50% from year-ago levels, and the company reported adding 12,000 new paying customers. More than 90,000 organizations signed on with Slack on either a paid or free plan during the three months ending April 30. The number of organizations paying $100,000 or more to Slack in annual recurring revenue rose by nearly half to 963. It also sees the good times continuing. The company projects full-year revenue growth of 36% to 38%.\n\nDespite these solid reports, the company dropped 16%.\n\nInvestors in Slack should be proud of the company’s performance. According to management, the firm did extremely well in what was the first quarter of its 2021 fiscal year. Based on the data provided, revenue at the firm came in at $201.65 million. This represents a gain of 49.6% over the $134.82 million the firm generated the same quarter a year earlier. Such a high growth rate, particularly for a firm with a market capitalization of $22.4 billion before reporting the news, is difficult to come by. Currently the stock is severely undervalued and will probably rebound very quickly before hedge funds and smart money rebalance and pump this to the fucking moon. This morning Motley just posted two articles on $WORK, Investors Observer released improved price targets for $WORK, and the legendary David Hynes is asking you to get into a threesome and start Fucking $WORK in its ass!\n\n[https://finance.yahoo.com/news/first-time-canaccord-buy-rating-231519661.html](https://finance.yahoo.com/news/first-time-canaccord-buy-rating-231519661.html)\n\nBesides the fact that $WORK has plenty of room to consolidate growth with its SaaS potential, it's also beginning to form some monstrous partnerships with other tech giants like IBM and AMZN.\n\nPositions:\n\n8/21c $44. Cheap as tits and can only go up after being down 70% from last week.",
        "created_utc": 1591816121,
        "id": "ftm4ewz",
        "permalink": "/r/wallstreetbets/comments/h07z0d/daily_discussion_thread_for_june_10_2020/ftm4ewz/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591844921.0
    },
    {
        "author": "AllYoullOwnIsEarth",
        "body": "Bro you sound like you're holding IBM shares.",
        "created_utc": 1592011848,
        "id": "funt710",
        "permalink": "/r/wallstreetbets/comments/h7s30c/weekend_discussion_thread_for_the_weekend_of_june/funt710/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1592040648.0
    },
    {
        "author": "BlindTreeFrog",
        "body": "Buying Bitcoin is a gamble of faith that Bitcoin will have increased value at a future date.\n\nBuying stock is either:  \n1.  Belief that a company is worthwhile and something that one wants to own a piece of and possibly participate in voting/guidance of the company   \n2.  Faith that dividend payouts will generate acceptable passive income  \n3.  A gamble that someone believing any of these three points will come by later and pay more money than you did for the shares you want to sell  \n(For small time investors who aren't buying respectable amounts of shares of companies and getting their names high on the \"pay me out first\" list which will add other ways to make money and more control of the company's direction)\n\nIf you only consider option 3 regarding stocks, there is no difference between buying BitCoin and buying Stocks; it's just a matter of which faith in the gamble being in your favor is stronger.\n\nWith Bitcoin, you are gambling purely on someone else being willing to gamble.  Yeah you can point to acceptance rates for payment services, but that hasn't penetrated enough to really be a factor outside of the true believers.\n\nWith stocks, you have the company to base actions on.  Pretend that  I bought 100 shares of IBM because I think they have good Research back in the early 2000's before Watson went on Jeopardy.  After Jeopardy the public demonstration doesn't change anything about the shares I own, but it caused people to want to buy shares of IBM; whatever reason they had didn't matter because it meant I could sell for an increased value.   And (in theory) I can see that cause an effect if I watch what the company is doing.  Everytime? No;  The market isn't that rational.   But could I see it more often then with bitcoin or straight chance?  Likely.",
        "created_utc": 1591677034,
        "id": "ftg0z81",
        "permalink": "/r/investing/comments/gz6xjl/sp_500_closes_at_3232_year_to_date_price_return/ftg0z81/",
        "score": 6,
        "subreddit": "investing",
        "created": 1591705834.0
    },
    {
        "author": "imunfair",
        "body": "&gt;Thank you for illustrating the point.\n\nHaha. I don't know the financial state of IBM and I'm unfamiliar with A&amp;P, but I think it's hilarious that Lie-Minimum snuck ***the*** largest oil major into his list just because he hates fossil fuels. That's like putting McDonalds on a list of bankrupt companies.",
        "created_utc": 1592354567,
        "id": "fv2o9g5",
        "permalink": "/r/investing/comments/ha9qlj/the_rise_of_momandpop_investors_in_the_stock/fv2o9g5/",
        "score": 6,
        "subreddit": "investing",
        "created": 1592383367.0
    },
    {
        "author": "arcsine",
        "body": "Looks like we have a winner! IBM stock bought me my house. Maybe I should buy back in. I mostly sold because of the Lenovo split. Their X86 hardware was bulletproof, but some of their software is traaaaaash.",
        "created_utc": 1591717820,
        "id": "fthitrw",
        "permalink": "/r/investing/comments/gzmtji/book_summary_get_rich_with_dividends_in_4/fthitrw/",
        "score": 5,
        "subreddit": "investing",
        "created": 1591746620.0
    },
    {
        "author": "Lamushi",
        "body": "I work at computer = IBM",
        "created_utc": 1591143758,
        "id": "fsp06yu",
        "permalink": "/r/wallstreetbets/comments/gvj9k9/get_dow_jones_up/fsp06yu/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591172558.0
    },
    {
        "author": "dumbToBeHere",
        "body": "Somehow have a feeling NSDQ is forming a top arnd 10000 - a psychological top..  best to hedge FAGMAN positions before the jobs report.\n\nFB,Goog: ads moving out in the economy\nApple: no innovation, overpriced phones. \nMsft: ibm redux\nNetflix: look at the fcf \nAmzn: karma will take care of itself",
        "created_utc": 1593559478,
        "id": "fwj29t6",
        "permalink": "/r/wallstreetbets/comments/hiv3zw/what_are_your_moves_tomorrow_july_01_2020/fwj29t6/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593588278.0
    },
    {
        "author": "Berrymore13",
        "body": "Everyone out here with the meme stonks and REITS (I also have a nice stack of differing REIT calls). But low key my IBM and UAA far OTM calls that I bought last Monday are both up 200% already, with my IBM ones being up almost 300%. Both are 7/17 exp. Man making money daily feels good",
        "created_utc": 1591670892,
        "id": "ftfrlpb",
        "permalink": "/r/wallstreetbets/comments/gz6uth/what_are_your_moves_tomorrow_june_09_2020/ftfrlpb/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591699692.0
    },
    {
        "author": "Cicero1982",
        "body": "Ugh... 🤮 No thanks. Don’t invest in companies where some social justice scheme takes precedent over merit in leadership. Profitable companies that are run by folks who earned their way to the top only for me please. Not investing on the basis of race, gender, religion, or creed. Nor am I investing on political motives or ideals. Only green for me. My dollar is an unbiased equal opportunity tendie. \n\nhttps://millennialmoney.com/public-com/\n\n“Themes are simply bundles of stocks that are grouped under a central theme for the sake of discovery. Some of these themes include:\n\nTech Giants: The most influential and powerful tech companies, which include Netflix (NFLX), Alphabet (GOOGL), Oracle (ORCL), Amazon (AMZN), Facebook (FB), etc.\n\nThe Future is Female: S&amp;P 500 companies led by female CEOs, which include General Motors (GM), Kohl’s (KSS), IBM (IBM), Eventbrite (EB), Progressive (PGR), etc.\n\nClean and Green: Environmentally-friendly companies, which include Vivint Solar (VSLR), Waste Management (WM), Ecolab (ECL), Darling Ingredients (DAR), etc.”",
        "created_utc": 1592948030,
        "id": "fvsbkfy",
        "permalink": "/r/wallstreetbets/comments/hemvx9/banned_from_public_the_social_stock_trading_app/fvsbkfy/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1592976830.0
    },
    {
        "author": "RIZup18769",
        "body": "XLF, IBM, JPM AND SPY 312 calls today. SQQQ and VXX puts. can’t for the life of me remember why I went with VXX puts. But that’s usually when I do my best.",
        "created_utc": 1593491991,
        "id": "fwg0dqq",
        "permalink": "/r/wallstreetbets/comments/hi7lau/what_are_your_moves_tomorrow_june_30_2020/fwg0dqq/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593520791.0
    },
    {
        "author": "jcalcerano",
        "body": "Yes, I first started buying SPY in 1980 and its such a shame that my biggest holdings are IBM, Exxon, and GE. Wish I bought SPY this year to get exposure to Apple and MSFT! \n\n/s",
        "created_utc": 1593466751,
        "id": "fwesme1",
        "permalink": "/r/investing/comments/hi180q/what_factors_could_lead_the_sp500_committee_to/fwesme1/",
        "score": 5,
        "subreddit": "investing",
        "created": 1593495551.0
    },
    {
        "author": "Lie-Minimum",
        "body": "What if they’re holding A&amp;P, IBM, Sears, Kodak, Hertz, Enron, Exxon Mobil, or Peabody energy stock?",
        "created_utc": 1592350814,
        "id": "fv2ho0s",
        "permalink": "/r/investing/comments/ha9qlj/the_rise_of_momandpop_investors_in_the_stock/fv2ho0s/",
        "score": 4,
        "subreddit": "investing",
        "created": 1592379614.0
    },
    {
        "author": "uninfinity",
        "body": "***Microsoft (MSFT) bans police from using its facial-recognition technology, following similar moves from IBM (IBM) and Amazon (AMZN)***",
        "created_utc": 1591895258,
        "id": "ftppcsx",
        "permalink": "/r/wallstreetbets/comments/h0whtp/daily_discussion_thread_for_june_11_2020/ftppcsx/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591924058.0
    },
    {
        "author": "GamblingMikkee",
        "body": "Bro go CAT. Go INTC go XOM go CVX go BA go MMM go IBM go JNJ go MRK go DOW go RTX",
        "created_utc": 1592446444,
        "id": "fv6vztf",
        "permalink": "/r/wallstreetbets/comments/haz16z/what_are_your_moves_tomorrow_june_18_2020/fv6vztf/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1592475244.0
    },
    {
        "author": "imgonnadieplshelp",
        "body": "Second bottom confirmed I’m down 50% with an IBM call for $145 strike at least it expires next year",
        "created_utc": 1591921613,
        "id": "ftr6djj",
        "permalink": "/r/wallstreetbets/comments/h78mbw/national_suicide_prevention_lifeline/ftr6djj/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591950413.0
    },
    {
        "author": "PunPryde",
        "body": "#ibm is dead money, Oracle is dead money",
        "created_utc": 1593541410,
        "id": "fwi159r",
        "permalink": "/r/wallstreetbets/comments/hikka1/daily_discussion_thread_for_june_30_2020/fwi159r/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1593570210.0
    },
    {
        "author": "blackcoffee0123",
        "body": "they got lucky faggot. they could've easily bought Lehman brothers or IBM or blackberry.",
        "created_utc": 1592852754,
        "id": "fvnyisc",
        "permalink": "/r/wallstreetbets/comments/hdpp7j/daily_discussion_thread_for_june_22_2020/fvnyisc/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1592881554.0
    },
    {
        "author": "nebraskajone",
        "body": "IBM",
        "created_utc": 1591717493,
        "id": "fthi5g0",
        "permalink": "/r/investing/comments/gzmtji/book_summary_get_rich_with_dividends_in_4/fthi5g0/",
        "score": 3,
        "subreddit": "investing",
        "created": 1591746293.0
    },
    {
        "author": "ballllllllllls",
        "body": "They got out of IBM iirc.",
        "created_utc": 1591644804,
        "id": "fteey34",
        "permalink": "/r/wallstreetbets/comments/gz3u9o/warren_buffet_wisdom/fteey34/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591673604.0
    },
    {
        "author": "Berrymore13",
        "body": "Also reports of a deal with IBM coming out sometime in the future.  AMD and IBM about to head to the ISS",
        "created_utc": 1591376321,
        "id": "fsznbnd",
        "permalink": "/r/wallstreetbets/comments/gx1vt8/daily_discussion_thread_for_june_05_2020/fsznbnd/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591405121.0
    },
    {
        "author": "spyaintnobitch",
        "body": "No one ever got fired for choosing IBM .... they all died shortly after of old age",
        "created_utc": 1593472249,
        "id": "fwf3eww",
        "permalink": "/r/wallstreetbets/comments/hi7lau/what_are_your_moves_tomorrow_june_30_2020/fwf3eww/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593501049.0
    },
    {
        "author": "omglawlz",
        "body": "Is AMD gonna pop? Some dude was on here taking about a deal with IBM they have coming soon. He probably sold me the calls.",
        "created_utc": 1591508474,
        "id": "ft8rdgm",
        "permalink": "/r/wallstreetbets/comments/gxbzbj/weekend_discussion_thread_for_the_weekend_of_june/ft8rdgm/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591537274.0
    },
    {
        "author": "ss_400401",
        "body": "That's because Teams launched a stable version in early 2020 and copied all the stuff Slack already has. The only way you will benefit is it gets acquired by Oracle or IBM. Like the way you said, it is a better quality product not the best that can lock in enterprise users.\n\nFor instance look what happened when NYC schools banned Zoom. The next day MSFT executives flew to NYC and captured the whole business.",
        "created_utc": 1591306200,
        "id": "fswl243",
        "permalink": "/r/wallstreetbets/comments/gwizix/your_tendies_at_work/fswl243/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591335000.0
    },
    {
        "author": "beta-one",
        "body": "Hey - great questions so let me shed some light.\n\nMost of these big companies rely on reseller models as they don't have the capacity to go after SMBs. Your point is spot on - CTS goes after small and medium size enterprises while IBM will go after the Fortune 500. It is purely a reseller model...but the company's main focus is converting these clients into more software. \n\nA lot of the targets they acquire are usually product specific - they end up selling a ton of Cisco or a ton of Dell without much overlap. But if they are selling Cisco, it's not as if their clients aren't buying Dell products also. That's the value prop that they pitch when they acquire targets - we are going to give you the tools to sell everything your clients want and need and your clients will love that they will not have multiple vendors. So effectively cross-selling is a huge selling point for the targets. \n\nWith respect to Red Hat, IBM is actually giving Converge market development funds to pursue these markets effectively throwing their full weight behind them. \n\nAnd yes, 700m and still on the Venture...not something you see every day. I am pretty confident they will uplist to the TSX within the year and will aim to go after NASDAQ later this year if not early next year.",
        "created_utc": 1591634284,
        "id": "ftdtmf9",
        "permalink": "/r/CanadianInvestor/comments/gz0ah3/converge_technology_tsxvcts_smallcap_cdn_play/ftdtmf9/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1591663084.0
    },
    {
        "author": "DukePhil",
        "body": "How does this technology reseller model work; they license/resell solutions from Dell, IBM, etc... as in a contractor? Yet at the same time, compete directly with Dell, IBM, etc...when they're bidding on new business?\n\nOr does CTS focus on smaller companies and their budgets, while IBM deals with the Fortune 500?\n\nNot trying to poke holes in the thesis, just trying to understand this business model.\n\nSide note - did almost CAD 700 mil in revenue for FY2019...and still on the TSX Venture?! Wow.\n\nAppreciate the write-up on this relatively unknown play. Nice change from the usual CAPREIT, RioCan, big banks, etc... that we see here...",
        "created_utc": 1591633822,
        "id": "ftdsp63",
        "permalink": "/r/CanadianInvestor/comments/gz0ah3/converge_technology_tsxvcts_smallcap_cdn_play/ftdsp63/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1591662622.0
    },
    {
        "author": "blivet",
        "body": "Someone else pointed out that Apple has been let down in a big way three times now by chip manufacturers. Motorola, IBM, and now Intel have failed to deliver what they promised, which meant that Apple’s product lines stagnated. The first two times it nearly meant the end of Apple as a viable company. Apple is of course in a much stronger position than it was a couple of decades ago, but they’ve obviously decided they can no longer afford to be dependent on an outside vendor.",
        "created_utc": 1592871921,
        "id": "fvoz4b8",
        "permalink": "/r/stocks/comments/hdyke6/the_moment_aapl_announced_ending_partnership_with/fvoz4b8/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1592900721.0
    },
    {
        "author": "ryit29",
        "body": "What if I were to tell you IBM is a cloud company",
        "created_utc": 1592935747,
        "id": "fvrmewn",
        "permalink": "/r/wallstreetbets/comments/hebygw/daily_discussion_thread_for_june_23_2020/fvrmewn/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1592964547.0
    },
    {
        "author": "D_is_for_Dante",
        "body": "Don't forget SAP.\n\nDon't forget the UK IBM. There dividend ratio is somewhat meh, but it's consistent.",
        "created_utc": 1591616041,
        "id": "ftcz38g",
        "permalink": "/r/investing/comments/gywr6t/the_search_for_great_nonus_dividend_stocks/ftcz38g/",
        "score": 3,
        "subreddit": "investing",
        "created": 1591644841.0
    },
    {
        "author": "475563",
        "body": "ALL IN CALLS BABY! $C $UBER and $IBM fyi",
        "created_utc": 1593113839,
        "id": "fvzin4i",
        "permalink": "/r/wallstreetbets/comments/hfjl3w/daily_discussion_thread_for_june_25_2020/fvzin4i/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593142639.0
    },
    {
        "author": "gigantoir",
        "body": "look at SMH semiconductor etf. just broke out of a bull flag. whole sector is gonna take off, and i saw a lot of volume on 6/19 60c. idk shit about IBM though",
        "created_utc": 1591155218,
        "id": "fspk3cr",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fspk3cr/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591184018.0
    },
    {
        "author": "sailing_jabroni",
        "body": "What does IBM even stand for? Nothing!",
        "created_utc": 1591163858,
        "id": "fspwnvg",
        "permalink": "/r/wallstreetbets/comments/gvj9k9/get_dow_jones_up/fspwnvg/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591192658.0
    },
    {
        "author": "Berrymore13",
        "body": "This is the second day in a row my 7/17 IBM 150c's had a massive spike on their premium out of nowhere near EOD.  They were in the mid to high .30's all day, and out of nowhere just now they shot up to 1.16 a contract, and have now settled back around 0.57.  IV hasn't moved.  Very confused by this, but I'll take it lmao",
        "created_utc": 1591732578,
        "id": "ftidy4y",
        "permalink": "/r/wallstreetbets/comments/gzkapz/daily_discussion_thread_for_june_09_2020/ftidy4y/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591761378.0
    },
    {
        "author": "billy8988",
        "body": "True, he said, he wouldn't invest in something that he doesn't understand the business model. About 10 years ago, for the first time, he invested in IBM and at that time he said, he went through 50 years worth of IBM's financial disclosures to understand it's business before investing. And then few years ago, he invested in AAPL. He still hasn't invested in MSFT even though Gates has been serving on  BRK's board for a long time, probably because he doesn't understand the software/cloud business as well.",
        "created_utc": 1592430511,
        "id": "fv62dlk",
        "permalink": "/r/stocks/comments/haxwso/what_warren_buffett_gets_right_and_wrong_on/fv62dlk/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1592459311.0
    },
    {
        "author": "Lie-Minimum",
        "body": "Ibm is also a big money loser right now. Maybe I’m a bit disingenuous for putting them all together but the idea stands.",
        "created_utc": 1592356842,
        "id": "fv2s4j6",
        "permalink": "/r/investing/comments/ha9qlj/the_rise_of_momandpop_investors_in_the_stock/fv2s4j6/",
        "score": 3,
        "subreddit": "investing",
        "created": 1592385642.0
    },
    {
        "author": "acidtrip76",
        "body": "Acquiring company usually pays a premium on the stock price.  A couple of examples:\n\n Amazon paid $42 per share in an all-cash deal for whole foods which included debt. **The premium paid was \\~27% to whole foods closing price** on Thursday, June 15 \n\n&amp;#x200B;\n\nWhen IBM Acquired Red hat \" The company, which won approval for the purchase from U.S. regulators in May and European Union regulators in late June, agreed to pay $190 a share for Red Hat, representing a **63 percent premium.** \"",
        "created_utc": 1593114108,
        "id": "fvzj7b9",
        "permalink": "/r/pennystocks/comments/hfs7wl/mergers/fvzj7b9/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1593142908.0
    },
    {
        "author": "winnning007",
        "body": "Bet IBM computer got some cure for covid but that would be a crime in todays world.",
        "created_utc": 1593055769,
        "id": "fvx6p7n",
        "permalink": "/r/wallstreetbets/comments/hf8cor/what_are_your_moves_tomorrow_june_25_2020/fvx6p7n/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593084569.0
    },
    {
        "author": "pao664",
        "body": "Lmao   Fuk IBM.",
        "created_utc": 1593541356,
        "id": "fwi10y5",
        "permalink": "/r/wallstreetbets/comments/hikka1/daily_discussion_thread_for_june_30_2020/fwi10y5/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593570156.0
    },
    {
        "author": "unteagle20",
        "body": "I remember the post as well. Ive never heard anything about the IBM thing, I’m just a fan of amd products. I’ve been long AMD since last year and know that they are coming in shit hot in oem and soon to be mobile space and then if this ibm shit is true then holy fuck we could see big moves soon. Still suspicious of the rumor but I’m in weeklies to monthlies waiting on big news",
        "created_utc": 1591155466,
        "id": "fspkhfc",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fspkhfc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591184266.0
    },
    {
        "author": "Lie-Minimum",
        "body": "So breaking even in 20 years is good? That’s assuming a dying ibm doesn’t cut dividends.",
        "created_utc": 1592366592,
        "id": "fv3841m",
        "permalink": "/r/investing/comments/ha9qlj/the_rise_of_momandpop_investors_in_the_stock/fv3841m/",
        "score": 2,
        "subreddit": "investing",
        "created": 1592395392.0
    },
    {
        "author": "LimbaughsBlackLung69",
        "body": "AMD has a deal with IBM to start solely providing them their processors. I posted the insider info a week or two ago in one of the megathreads. I don’t know when the deal will be announced. \n\nDo what you wish with that information my fellow autist.",
        "created_utc": 1592235450,
        "id": "fuwsgr7",
        "permalink": "/r/wallstreetbets/comments/h9dhxy/daily_discussion_thread_for_june_15_2020/fuwsgr7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592264250.0
    },
    {
        "author": "Randomness898",
        "body": "Rule number 1. Don't trade options on boomer stocks unless it's a specific earnings or event. \n\nSo please don't do PFE, KO, IBM, WMT, JNJ, etc.",
        "created_utc": 1592262342,
        "id": "fuycta7",
        "permalink": "/r/wallstreetbets/comments/h9nsx3/what_are_your_moves_tomorrow_june_16_2020/fuycta7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592291142.0
    },
    {
        "author": "PoloNewt",
        "body": "IBM puts and TVIX shares just erased all my losses over the past year",
        "created_utc": 1591893139,
        "id": "ftpkuzh",
        "permalink": "/r/wallstreetbets/comments/h0whtp/daily_discussion_thread_for_june_11_2020/ftpkuzh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591921939.0
    },
    {
        "author": "bazza010101",
        "body": "100% agree\n\nbetter to be wrong small than wrong big\n\nI will take my $200 loss on Tuesday and my $200 loss on Wednesday knowing that could be easily a hell of alot more\n\nNow i have cash here to throw in a good company once this down market is over and the overall market is up.................when you see the likes of McDonalds, Uber, Walt Disney, IBM, Fedex and Nike etc  all down today between 5%-9% you should be listening",
        "created_utc": 1591899533,
        "id": "ftpy8dx",
        "permalink": "/r/pennystocks/comments/h13j8n/i_took_a_lot_of_flak_for_this_post_now_we_see_its/ftpy8dx/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1591928333.0
    },
    {
        "author": "nebraskajone",
        "body": "It's an interesting stock the head of the IBM cloud business is now the CEO as of April, much like in Microsoft case where the head of their Cloud business became the CEO and their stock soared after being stagnant for 15 years.",
        "created_utc": 1591718111,
        "id": "fthjfky",
        "permalink": "/r/investing/comments/gzmtji/book_summary_get_rich_with_dividends_in_4/fthjfky/",
        "score": 2,
        "subreddit": "investing",
        "created": 1591746911.0
    },
    {
        "author": "jabunkie",
        "body": "So unless you already invest in an index fund,  look at stocks that are historically low for what they are worth.  My personal favorite is Boeing, the largest DOW component, one of two of its kind, and they currently have some issues they are ironing out but maintain a backlog of orders for the grounded maxes.  Also look into companies that issue historically high dividends, IBM, MICROSOFT, APPLE etc for long holds. I usually have 50% of my money in hype stocks like DKNG, PENN, CCL get my gains get out and put the gains back into my longer holds.",
        "created_utc": 1591635485,
        "id": "ftdw26c",
        "permalink": "/r/stocks/comments/gz0yxj/sold/ftdw26c/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591664285.0
    },
    {
        "author": "din_crosbys",
        "body": "My favorite, IVR, is a good stock for dividends and longterm holders. So are IBM and REIT. \n\nThis is the link to the highest dividend stocks I found. Hope this helps!!\nhttps://www.nerdwallet.com/blog/investing/how-to-invest-dividend-stocks/",
        "created_utc": 1591565498,
        "id": "ftb1gzb",
        "permalink": "/r/stocks/comments/gyk6k1/stocks_with_highest_dividends/ftb1gzb/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591594298.0
    },
    {
        "author": "ejobit",
        "body": "I loaded up on them this morning for the Boomer rotation that we are witnessing. IBM is on the runway",
        "created_utc": 1591648434,
        "id": "ftemeva",
        "permalink": "/r/wallstreetbets/comments/gz6uth/what_are_your_moves_tomorrow_june_09_2020/ftemeva/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591677234.0
    },
    {
        "author": "soliloquilee",
        "body": "With IBM to the iss",
        "created_utc": 1591382759,
        "id": "ft00rp3",
        "permalink": "/r/wallstreetbets/comments/gx1vt8/daily_discussion_thread_for_june_05_2020/ft00rp3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591411559.0
    },
    {
        "author": "slowand-old",
        "body": "It stands for REITard stocks. The big 4 are Roku, EBay, IBM, and T-mobile. Hence REIT\n\nJust a WSB meme really",
        "created_utc": 1593219814,
        "id": "fw4ff2h",
        "permalink": "/r/wallstreetbets/comments/hgeyf9/weekend_discussion_thread_for_the_weekend_of_june/fw4ff2h/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593248614.0
    },
    {
        "author": "475563",
        "body": "$IBM YOU ARE A JOKE YOUR MOM IS A HOE",
        "created_utc": 1592941621,
        "id": "fvryid8",
        "permalink": "/r/wallstreetbets/comments/hebygw/daily_discussion_thread_for_june_23_2020/fvryid8/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592970421.0
    },
    {
        "author": "PrissyyKrissyy",
        "body": "They’re work from home learn from home AR virtual tech. I just feel that’s the move right now with the way everything is going. They’ve had nothing but consistent good news and today they were chosen by the Dallas Indep School District. Here’s the posting on TOS along with what’s lead up to why they’ve been successful thus far. Just my opinion but i feel comfortable where im at position-wise to hold a little longer. Again I am totally a noob trader.\n\n\n\nSANTA CLARA, Calif. and TORONTO, June 29, 2020 (GLOBE NEWSWIRE) -- NexTech AR Solutions (NexTech) (OTCQB: NEXCF) (CSE: NTAR) (FSE: N29), an emerging leader in augmented reality for eCommerce, AR learning applications, and AR-enhanced video conferencing and virtual events is pleased to announce that it has signed a contract to supply it’s InfernoAR video conferencing and virtual events platform to the Dallas Independent School District (Dallas ISD).   \n\nNextech AR CEO Evan Gappelberg comments. “We are excited to have been chosen by the Dallas ISD and we look forward to working with them on this and other projects.” He continues “ we continue to win new business as enterprise pivots away from less secure platforms, people are looking for platforms that stop breaches and protect privacy. InfernoAR-video conferencing and virtual events platform, recently reported a breakthrough in security with the help of Fastly an edge computing company. Bringing token authentication to the edge greatly enhances security and performance, which is huge for winning more contracts from our growing customer base. We are currently experiencing a surge in demand for our services across our multiple business segments including: AR-ecommerce, our ARitize app, and our InfernoAR-video conferencing and virtual events platform”.\n\nSecurity is a core feature of InfernoAR – the platform has serviced many Fortune 500 businesses including Johnson and Johnson, Viacom, Merk and others.  Token authentication allows the CDNs to reject serving videos to unauthorized users, by taking the JWT authentication to the edge security is pushed closer to the user and load is taken off the core application.\n\nAbout InfernoAR\n\nInfernoAR, supports clients that require integration with enterprise systems, custom workflow, cognitive search and discovery, interactive features and secure multi-CDN streaming in front of and behind the firewall. InfernoAR has been providing top products and service in the video streaming space for 10+ years.\n\nRecent Company Highlights in 2020:\n\nJune 22, 2020: Signed a one year contract to provide its InfernoAR Virtual Events video conferencing platform services to Real Asset Media. The initial contract value is for $135,000 with the potential for substantial additional revenue as augmented reality use cases emerge.\n \nJune 19, 2020: NexTech closed a private placement of 1,528,036 units priced at the market price of $2.10 per unit (the “Units”) for gross proceeds of $3,208,875 (the “Offering”). This financing provides the company with a healthy cash and inventory position of over $7.5million - it’s highest ever.\n \nJune 18, 2020: Company announces that it has signed a partner supplier agreement with BDA, LLC. BDA Sports will be using the InfernoAR virtual event platform for their signature annual Think Tank 2020 program for teams in NHL, NBA,  MLB, and NFL.\n \nJune 10, 2020: Company signed a partner agreement and contract to provide its InfernoAR Virtual Events platform services to Skybridge World Dubai clients.  Skybridge is a leading events, exhibition and marketing solutions provider to global corporations whose clients include: Emirates Glass, IBM, Lilly, Henkel, Amgen and many others. NexTech and Skybridge have already solidified their partnership and signed up their first customer, Bohringer Ingelheim.\n \nJune 4, 2020 The company launched its new ARitize360 app now live and available for a FREE download on both iOS and Android. The app's 3D scan technology will add to the revenue-generating power of its AR eCommerce solution and its recently launched 3D/AR advertising platform.\n \nJune 3, 2020: The company achieved record revenue and gross profit for the month of May 2020. Both revenue and gross profit showed dramatic increases in May. Notably, compared to May 2019, the company’s revenue increased 169% to $1,300,000 while gross profit grew 290% to $800,000 representing the highest revenue and gross profit ever achieved in a single month.\n \nJune 1, 2020 : CEO Evan Gappelberg purchased 100,000 shares. It was reported that on 5/5/2020 he purchased 929,885 common shares of NexTech common stock, this is his fourth buy for the year 2020.\n \nMay 25, 2020: Signed a contract to supply its Augmented Reality Solutions to a $30 billion market capital, publicly-traded global technology company.\n \nMay 22, 2020: The company announced very positive results for its recently launched 3D/AR Ad Network which went live on February 4th 2020. Using the company’s 3D/AR ads resulted in a 300% increase in sales conversions, a 32% increase in click-through-rate (CTR) and a 23% lower cost per click than traditional 2D ads.\n \nMay 21, 2020: InfernoAR Virtual Events platform chosen to supply a $13 billion capital, publicly-traded global insurance company, for their global leadership two day summit starting June 6th.\n \nMay 19, 2020: Inferno AR integration with Cvent Solutions optimizing the entire InfernoAR event management value chain. Integration with CVENT will broaden the utility and increase the appeal of the platform by helping end-users seamlessly register and become more productive while using the platform.\n \nMay 14, 2020: Q1 Revenue grows 177% to $2.5 million, Gross Profit grows 267% to $1.3 million, Working Capital of $3.5 million.\n \nMay 12, 2020: InfernoAR platform integration with all major video platforms including its previously announced integration with Zoom, Microsoft Teams, Skype, and new integrations with Cisco Webex, BlueJeans, Google Hangouts, Google Meet, and GoToMeetings. These critical integrations continue to extend the capabilities of the platform, broaden the utility of the platform and help end-users become even more productive while using the platform.\nAbout NexTech AR Solutions Corp.\n\nNexTech is one of the leaders in the rapidly growing AR industry, estimated to hit $120 billion by 2022, according to Statista. NexTech, the first publicly traded “pure-play” AR company, began trading on the CSE on October 31st, 2018. NexTech has a two-pronged strategy for rapid growth including growth through acquisition of eCommerce businesses and growth of its omni-channel AR SaaS platform called ARitize™.\n\nThe company is pursuing four verticals in AR.\n\nARitize™ For eCommerce: The company launched its technologically advanced webAR for eCommerce early in 2019 and has been rapidly signing up customers onto its SaaS platform. Customers include Walther Arms, Wright Brothers, Mr. Steak, and Budweiser. NexTech has the first ​‘full funnel’ end-to-end eCommerce solution for the AR industry including its 3D product capture, 3D ads for Facebook and Google, ‘Try it On’ technology for online apparel, 3D and 360-degree product views, and ‘one click buy’.\n\nARitize™ 3D/AR Advertising Platform: launched in Q1 2020 the ad platform will be the industry's first end-to-end solution whereby the company will leverage its 3D asset creation into 3D, 360, AR ads. In 2019, according to IDC, global advertising spend will be about $725 billion.\n\nInfernoAR:  the world's most advanced Augmented Reality and Video Learning Experience Platform for Events, is a SaaS video platform that integrates Interactive Video, Artificial Intelligence and Augmented Reality in one secure platform to allow enterprises the ability to create the world’s most engaging virtual event management and learning experiences. Automated closed captions and translations to over 64 languages put InfernoAR in a class by itself.\n\nARitize™ Hollywood Studios: expected to launch in 2020, the studio has created a proprietary entertainment venue for which it is producing immersive content using 360 video, and augmented reality as the primary display platform.",
        "created_utc": 1593459630,
        "id": "fwedypw",
        "permalink": "/r/stocks/comments/hi5mr3/nexcf_run_up/fwedypw/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593488430.0
    },
    {
        "author": "knac8",
        "body": "&gt;Mostly agree with you but what is your evidence the the big 5 are in a bubble? Looking back at the dot com crash (an actual bubble), interest rates were much higher and you couldn't even talk about earnings multiples because many of those companies had no earnings. Interest rates have a massive impact on valuations. Stocks are somewhat expensive now but were much more expensive back then. Don't think we are in a bubble.\n\nIs not even close to 2K, I agree, so is \"mild\" bubble territory right now (so it could go much higher). But even now IMO they are discounting growth multiple times of what they will be in the next years because a couple reasons:\n\n\\- Those mega-corps face HUGE risks in the future mostly in the regulatory and political space. Take in mind more than any all those depend greatly on foreign growth and regulatory capture. As the public discourse turns towards nationalism, de-globalization, populism, etc. (This theme can be applied to the broad market too, there is a lot of risk that is not priced in the market re. politics, national and international). All this will stall growth for those firms.\n\n\\- Future growth depends for most of those companies on the global economic corporate environment  (MSFT, FB, GOOG, AMZN) or consumer demand and household economy (AAPL, AMNZ). Both for them are poised to be disappointing in the next years, we will either get no growth and deleverage or stagflation IMO. None of these are good for real growth (stocks suffered greatly in the 70's and there was a similar situation with some large stocks greatly valued just before then, back then it was things like IBM, KO, MCD).\n\n\\- They are the \"hot stuff\" right now, have heard this song many times, just as other sectors and companies in other times: \"time is different\", \"a new paradigm\" yada, yada, yada. They are mature and assume a stable unchanging environment with continued growth that just statistically speaking is very improbable to happen. Recency bias with great fundamental reasons to make them appealing, as most stocks that start this kind of mild bubble (is a different animal than the 2K bubble, more similar to the 50-60's that I was talking about).\n\nI could be totally wrong though, since technically right now we are momentum (algo) and liquidity driven the stocks can easily keep going unless downward pressure turns, but from a valuation PoV, forward looking (not next couple quarters, but years down the line) those valuations are rich IMO.",
        "created_utc": 1592942553,
        "id": "fvs0f59",
        "permalink": "/r/wallstreetbets/comments/hej625/stocks_are_grossly_overvalued/fvs0f59/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592971353.0
    },
    {
        "author": "ewokninja123",
        "body": "LOL, IBM and XOM ... those aren't quite like the others. No matter what you think of their long term future they are very profitable companies right now. Exxon is the largest oil company in America, you don't think they couldn't buy their way into alternative fuels when the time comes? \n\nIBM bought Red Hat not too long ago and is making a major shift into the cloud. \n\nBesides, they both pay a healthy dividend as mature  companies.  \n\nMight want to pick other companies that are bankrupt",
        "created_utc": 1592368636,
        "id": "fv3b35z",
        "permalink": "/r/investing/comments/ha9qlj/the_rise_of_momandpop_investors_in_the_stock/fv3b35z/",
        "score": 2,
        "subreddit": "investing",
        "created": 1592397436.0
    },
    {
        "author": "FoghornLegporn",
        "body": "Altria (MO) is the US' leading tobacco company that has ventured into other segments, such as wine, beer, smokeless nicotine products, and even cannabis in the past. Other countries still smoke quite a bit, and having the #1 brand Marlboro, will still bring in profits while they adjust what they decide to do. 40yrs is a long time, and holding for that long is silly. The top companies in 1980 were GM, Ford, a few oil, and IBM. Would you be happy holding Ford, GM, and IBM right now?",
        "created_utc": 1592512010,
        "id": "fv9n5dt",
        "permalink": "/r/stocks/comments/hb5wmg/which_single_dividend_paying_stock_would_you_pick/fv9n5dt/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1592540810.0
    },
    {
        "author": "Sniffing_SuperTimor",
        "body": "I'll say IBM. Has the legacy behind it, but no one really gives a shit",
        "created_utc": 1592336745,
        "id": "fv1pmlp",
        "permalink": "/r/wallstreetbets/comments/ha16p4/daily_discussion_thread_for_june_16_2020/fv1pmlp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592365545.0
    },
    {
        "author": "BadAssCodpiece",
        "body": "Today was my first day Investing. I dropped in $250, another $100 scheduled to hit tomorrow. I'm up $10 which I believe translates to 2.5%. \n\nToday I purchased: \n\nIBM x1 at 127.15\n\nDAL x2 at 27\n\nUAL x2 at 30.78\n\nAnd a couple of penny stocks all around a buck each.\n\n\n I'm excited to see what tomorrow brings and what deals I can scoop up with that hundred. :)",
        "created_utc": 1591230740,
        "id": "fst3qge",
        "permalink": "/r/stocks/comments/gw4h9x/are_you_smarter_than_a_roboinvestor_rstocks/fst3qge/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591259540.0
    },
    {
        "author": "Berrymore13",
        "body": "WTF?  My 7/17 IBM 150c's that I got last week were hovering around being up 250% just now, or around .45 a contract.  The price of the stock moved up like .50c, and my contracts just jumped to 1.01 a contract....just gained 400% out of nowhere?  IV hasn't moved",
        "created_utc": 1591645918,
        "id": "fteh89b",
        "permalink": "/r/wallstreetbets/comments/gywpuw/daily_discussion_thread_for_june_08_2020/fteh89b/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591674718.0
    },
    {
        "author": "ZarrCon",
        "body": "How many stocks out there actually fit that criteria? The only ones I found after a quick look were ABBV, IBM and MO.",
        "created_utc": 1591708095,
        "id": "fth0nzh",
        "permalink": "/r/stocks/comments/gzmkaz/book_summary_get_rich_with_dividends_in_4/fth0nzh/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591736895.0
    },
    {
        "author": "TripleBrain",
        "body": "Now why the fuck exactly would any company that’s not the size of intel, Apple, ibm etc need 150 hosts??? You know the point of a host right? It’s to host a meeting. You really think anyone will need to host 150 meetings in the same time frame? Hell no.\n\nAnd aside from that, you know these are not gonna be large companies because they won’t be categorizing it as “companies with 10+” employees. That’s like using inches to measure a mile. \nI’d bet a majority of those companies have under 10 hosts.",
        "created_utc": 1591158971,
        "id": "fsppy0c",
        "permalink": "/r/wallstreetbets/comments/gvmf01/zoom_technology_post_er_analysis/fsppy0c/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591187771.0
    },
    {
        "author": "lloydgross24",
        "body": "if you don't want to play options, just invest in value. There's a ton of value out there to be had still. I love me some VIAC personally. Crazy cheap with nice possible growth with streaming stuff they are working on.\n\nMarvel has pretty decent valuation with some nice growth possiblities with 5g. Some undervalued energy names. IBM crazy cheap tech on valuation metrics and a 5% yield. \n\nI realize we are options here but investing there is plenty of stuff to get in on. Buy some long term calls on undervalued names with good financials. Or play earnings.",
        "created_utc": 1593134469,
        "id": "fw0lx4l",
        "permalink": "/r/wallstreetbets/comments/hft4mc/what_are_your_moves_tomorrow_june_26_2020/fw0lx4l/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593163269.0
    },
    {
        "author": "Cruian",
        "body": "&gt;What I'm betting is that in the long run these businesses are too big to crash and the potential for future growth is endless\n\nPeople probably said the same about GE, IBM, and other companies years ago: https://www.reddit.com/r/investing/comments/hf4jdo/is_there_anything_that_could_plausibly_cause_a/fvva5pp",
        "created_utc": 1593102571,
        "id": "fvyv767",
        "permalink": "/r/investing/comments/hfogf2/investing_in_big_5_tech_stocks_and_other_popular/fvyv767/",
        "score": 2,
        "subreddit": "investing",
        "created": 1593131371.0
    },
    {
        "author": "robert_fake_v2",
        "body": "but apple was on the way of becoming irrelevant in 1995 and Amazon had tons of competitors during the dot bubble. They were definitely not the leaders of the markets. It takes great insight to buy Amazon or Apple stock in 1995 and it takes extreme courage to not to sell at the peak of 2000. \n\nI think both Amazon and Apple has become IBM in 1995. What is the next Apple or Amazon in another 25 years. Is that company around us now? Well, that is a billion dollar question.",
        "created_utc": 1593020648,
        "id": "fvvf5ew",
        "permalink": "/r/stocks/comments/hf1245/would_you_believe_that_kansas_city_southern_a/fvvf5ew/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593049448.0
    },
    {
        "author": "sauceboss757",
        "body": "I don't really watch CNBC unless I'm actively trading so I didn't hear that lol. Idk if they're flip flopped because it really is a different business, Slack is more of a messaging service for businesses and Zoom is really just a casual videoconferencing service. I guess that's why ZM is worth much more currently, because they have a lot more users, but how they are gonna monetize them is unclear. Slack monetizes from day one. I'm sketched on how many Amazon employees will actually be using Slack, as all they did was approve its use for employees. But if Amazon surpasses IBM as Slack's top customer (350,000+ employees) that's gonna be great news. \n\nHonestly I didn't even know there was a choice anymore? Who the hell is still subscribed to Apple Music? And yeah Kim's podcast is gonna suck beyond belief but you know for a fact she's gonna bring on Kanye, Kendall, Kylie and any celebrity who she wants. That's gonna make it popular as a mf with the females. \n\nHonestly, for speculative purposes, I'm done with puts. The only puts in my portfolio will be for hedging.",
        "created_utc": 1592590076,
        "id": "fvczues",
        "permalink": "/r/wallstreetbets/comments/hbrrcb/big_move_coming/fvczues/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592618876.0
    },
    {
        "author": "radioref",
        "body": "Just as soon as JPOW wraps up:\n\n# IBM IS GOING TO THE MOON!!!",
        "created_utc": 1593541339,
        "id": "fwi0zpl",
        "permalink": "/r/wallstreetbets/comments/hikka1/daily_discussion_thread_for_june_30_2020/fwi0zpl/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593570139.0
    },
    {
        "author": "SWeaseL92",
        "body": "If $100 is what's making you stay away from tech giants like Apple Amazon Google Facebook MSFT, I recommend you XLK. It's a tech sector ETF, take a look at their portfolio, and probably has every company you are interested in. I personally do not own this, but this is one of the most popular tech sector ETF. \n\nOn individual stocks, I currently own MSFT, TSMC, and IBM.",
        "created_utc": 1591996158,
        "id": "fun1d31",
        "permalink": "/r/stocks/comments/h7t193/tech_stocks_under_100/fun1d31/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1592024958.0
    },
    {
        "author": "sebassrod",
        "body": "Thought on Walmart, Kroger, and ibm?",
        "created_utc": 1592277048,
        "id": "fuz2ysq",
        "permalink": "/r/wallstreetbets/comments/h9nsx3/what_are_your_moves_tomorrow_june_16_2020/fuz2ysq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592305848.0
    },
    {
        "author": "blackhorse6",
        "body": "I’m down 6.6% today , my CVX, IBM and UPS killed me. But I’m still in the green for the year , until tomorrow of course .",
        "created_utc": 1591909643,
        "id": "ftqja7o",
        "permalink": "/r/stocks/comments/h17utz/fun_game_called_who_lost_the_most_today/ftqja7o/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591938443.0
    },
    {
        "author": "protovack",
        "body": "this reallocation you refer to has already happened and is continuing to happen, but there is a limit to it. Microsoft and Apple are not going to take over the world. They may be huge companies, and there is room for them to grow for sure. But all other essential businesses will continue to exist, and grow, and profit. Diversification is more important than ever. Never forget that. \n\nAt one time, it seemed like AOL and IBM would rule the world. Things change, companies fall, things get reorganized. Never assume that the current mega-caps will always be there.",
        "created_utc": 1592430113,
        "id": "fv61lax",
        "permalink": "/r/stocks/comments/hb0cjf/how_the_second_crash_will_look_like/fv61lax/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1592458913.0
    },
    {
        "author": "iTrapGas",
        "body": "The market hasn’t even priced in second wave of corona yet more pain to come - PFE T VZ UPS KO ABBV ET CVX C JPM MMM HD IBM PEP JNJ MRK",
        "created_utc": 1592451363,
        "id": "fv73zis",
        "permalink": "/r/investing/comments/hb6sm4/just_started_a_dividend_portfolio/fv73zis/",
        "score": 2,
        "subreddit": "investing",
        "created": 1592480163.0
    },
    {
        "author": "homemaker1",
        "body": "Though the IBM and amazon rumors do make a little sense. They are direct competitors of microsoft and might not use teams.",
        "created_utc": 1591296722,
        "id": "fsw0nqh",
        "permalink": "/r/wallstreetbets/comments/gwizix/your_tendies_at_work/fsw0nqh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591325522.0
    },
    {
        "author": "nebraskajone",
        "body": "In the sixties and seventies no one was fired for buying IBM products, my guess today is that nobody gets fired for buying Microsoft or Amazon cloud services,  they are the hip companies today. I think that's where the industry feel comes from",
        "created_utc": 1591726395,
        "id": "fti0wgr",
        "permalink": "/r/investing/comments/gzmtji/book_summary_get_rich_with_dividends_in_4/fti0wgr/",
        "score": 2,
        "subreddit": "investing",
        "created": 1591755195.0
    },
    {
        "author": "omglawlz",
        "body": "Hoping AMD 60c print next week. There was some guy on here talking about a deal with IBM",
        "created_utc": 1591397465,
        "id": "ft0v279",
        "permalink": "/r/wallstreetbets/comments/gxbzbj/weekend_discussion_thread_for_the_weekend_of_june/ft0v279/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591426265.0
    },
    {
        "author": "mpbh",
        "body": "&gt; it is a cloud company and its the largest competition for amazon cloud\n\nExcept for Microsoft, Google, and IBM which all make more from cloud and actually support multi-cloud",
        "created_utc": 1591122055,
        "id": "fsns93t",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsns93t/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591150855.0
    },
    {
        "author": "clutchtho",
        "body": "I wasn't talking about Bitcoin or crypto. I believe DLT and blockchain should be listed as one of your asset groups...maybe with some mention of IBM/AWS Blockchain tech.",
        "created_utc": 1593463223,
        "id": "fwelh26",
        "permalink": "/r/investing/comments/hhx2ax/my_covid_portfolio_restructure_mexicanamerican/fwelh26/",
        "score": 2,
        "subreddit": "investing",
        "created": 1593492023.0
    },
    {
        "author": "tysonsmithshootname",
        "body": "You make great points, and I hope you are right, brother! My livelihood depends on it lol.\n\nI absolutely agree people will be seeking direct human contact. But that can be achieved without hotels. If 80% of attendees want to go to a conference, the 20% who are afraid are being heard by the Group contacts and travel planners. That will ease over time, but it may take half a decade (like we saw after the Recession) for group contribution to get back to normal percentages. \n\nAs it relates to hotels, the issue isn't as much the individual traveler as much as companies cutting travel requirements out of budgets and putting mandates to hold meetings virtually. Or consolidating quarterly events into an annual event. Or let's say companies send less ppl to trade shows/conventions from their contingencies. Or even a company like IBM mandating a 25% travel reduction would have a major ripple effect throughout the industry. \n\nLeisure travel alone won't cut it for most markets. Even a low to moderate negative shift in corporate travel behavior will be beaten up badly. I believe 85% of travelers will return, but profitability will be inconsistent at best for the next 3 to 5 years.",
        "created_utc": 1593477372,
        "id": "fwfcoi9",
        "permalink": "/r/investing/comments/hi3tdu/latest_stats_from_goldman_show_consumers_starting/fwfcoi9/",
        "score": 2,
        "subreddit": "investing",
        "created": 1593506172.0
    },
    {
        "author": "Motionz85",
        "body": "WFC is like the IBM of banks if IBM hadn’t acquired RedHat.  Bloated garbage that runs with extremely high and unnecessary personnel costs in the back office.  They are becoming less and less competitive with peers on a number fronts as well.  There own employees choose to use other mortgage lenders even with the employee discounts due non-competitive pricing.",
        "created_utc": 1592879137,
        "id": "fvpbidz",
        "permalink": "/r/wallstreetbets/comments/hdyq3y/very_important_wells_fargo_dd/fvpbidz/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592907937.0
    },
    {
        "author": "SWeaseL92",
        "body": "Hey guys, I'm trying to diversify my stock a little more with 1 or 2 more stocks in different sectors like energy/finance... Right now, it is a little too focused on IT sector i think...I would appreciate any suggestions. I'm looking for long term stocks (\\~10 years) with decent dividends (2\\~3%). Please also chime in if you have any suggestions for my stock portfolio in general. (This is stock investment only and I am investing decent amount (13%-15%) in 401k that follows other indices/equities/commodities)\n\n* Microsft (MSFT) - 29.38% \n* Atnt (T) - 14.64% \n* Pepsi (PEP) - 14.24% \n* Pfizer (PFE) - 8.54%\n* Starbucks (SBUX) - 6.68%\n* Beyond Meat (BYND) - 5.80% \n* Intelligent Business Machine (IBM) - 5.41%\n* Waste Management (WM) - 4.61%\n* Taiwan Semiconductor (TSM) - 4.47%\n* Johnson n Johnson (JNJ) - 3.82%\n* Coca Cola (KO) - 2.42% \n\nThank you!",
        "created_utc": 1591131276,
        "id": "fsobzus",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fsobzus/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591160076.0
    },
    {
        "author": "mulletstation",
        "body": "You think MSFT is more risky than IBM? \n\nyyyyikes",
        "created_utc": 1591319384,
        "id": "fsxa1ad",
        "permalink": "/r/investing/comments/gwfit0/what_3_stocks_would_you_give_to_your_newborn_if/fsxa1ad/",
        "score": 2,
        "subreddit": "investing",
        "created": 1591348184.0
    },
    {
        "author": "oO0-__-0Oo",
        "body": "IBM",
        "created_utc": 1591661955,
        "id": "ftfc5h6",
        "permalink": "/r/wallstreetbets/comments/gz3u9o/warren_buffet_wisdom/ftfc5h6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591690755.0
    },
    {
        "author": "yura37",
        "body": "100k qqq 10k tqqq  40k amzn 100k between ko, ibm, tan, pg, and smh 10k fro 20k ttd 10k docu 20k lulu 5k payc 5k ayx 30k gld or metal of choice. Stop losses ~5-10% on everything. I would wait for 10-15% drawdown before entry on individual equities since everything is super extended. That's if i had to do stocks. Currently I'm monitoring my trades every day so i would throw 200k in those same stocks, sell covered calls, and the other 150k would be options plays.",
        "created_utc": 1591635977,
        "id": "ftdx1wp",
        "permalink": "/r/wallstreetbets/comments/gyotgl/i_have_350000_cash_where_should_i_invest_it_right/ftdx1wp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591664777.0
    },
    {
        "author": "Berrymore13",
        "body": "As far as the REIT's go, I'm sitting on some 6/19 TWO calls to ride the wave they take hopefully soon here lmao.  Otherwise I grabbed a nice stack of 7/17 and 8/21 NRZ calls today to just sit on.  Hoping they both print big.  My 717 IBM 150c's that I got last week are already printing.  Almost a 3 bagger already, and I'm barely a week into them",
        "created_utc": 1591649246,
        "id": "fteo2ro",
        "permalink": "/r/wallstreetbets/comments/gz6uth/what_are_your_moves_tomorrow_june_09_2020/fteo2ro/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591678046.0
    },
    {
        "author": "WSBankrupt",
        "body": "Saw that lmao.\n\nIBM just canned its facial recognition/AI software and working with law enfocement also as it is not only racist but also sexist somehow, according to their CEO.\n\nThere is now about to be a push to stop publicly available crime statistics.",
        "created_utc": 1591760736,
        "id": "ftjtpu0",
        "permalink": "/r/wallstreetbets/comments/gzuxmi/what_are_your_moves_tomorrow_june_10_2020/ftjtpu0/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591789536.0
    },
    {
        "author": "LilindianNCO",
        "body": "Seems like IBM is trying to buy them. Seen plenty of call option activity for 7/17. Loooot of volume. Company seems great with big upside, recommended by the motley fool. I just dumped garbage DGLY for a small profit and am planning on jumping to Cloudera",
        "created_utc": 1592532165,
        "id": "fvanr42",
        "permalink": "/r/investing/comments/hbrrny/opinions_on_cloudera_inc/fvanr42/",
        "score": 2,
        "subreddit": "investing",
        "created": 1592560965.0
    },
    {
        "author": "GamblingMikkee",
        "body": "Not my XOM or my IBM LMAO",
        "created_utc": 1592964032,
        "id": "fvt4nmu",
        "permalink": "/r/wallstreetbets/comments/helxve/what_are_your_moves_tomorrow_june_24_2020/fvt4nmu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592992832.0
    },
    {
        "author": "475563",
        "body": "$IBM Rise you stupid bitch!  lazy ass",
        "created_utc": 1592940831,
        "id": "fvrwvzc",
        "permalink": "/r/wallstreetbets/comments/hebygw/daily_discussion_thread_for_june_23_2020/fvrwvzc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592969631.0
    },
    {
        "author": "Dougiejurgens2",
        "body": "Is there any reason why I should not put everything into IBM august calls",
        "created_utc": 1593472210,
        "id": "fwf3c9d",
        "permalink": "/r/wallstreetbets/comments/hi7lau/what_are_your_moves_tomorrow_june_30_2020/fwf3c9d/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593501010.0
    },
    {
        "author": "chovyfu",
        "body": "what company? if you think the company is mismanaged and probably not going to hit paydirt for you I would sell. When my company got acquired by IBM I knew I had to sell the IBM stock asap. That company was purely a mis-managed shitshow internally.",
        "created_utc": 1593489248,
        "id": "fwfwfdj",
        "permalink": "/r/stocks/comments/hifp5m/should_i_dump_my_vested_rsus_while_i_can/fwfwfdj/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593518048.0
    },
    {
        "author": "TheNomadicAspie",
        "body": "Oh, well in that case you win and I guess I should only buy options on companies that have a track record for being ethical.\n\nGuess I can't invest in\n\nStarbucks\nWalmart\nWhole Foods\nAmazon\nMicrosoft\nNintendo\nBP\nAT&amp;T\nTarget\nUnicor\nDell\nEddie Bauer\nKmart\nBoeing\nMacy's\nVerizon\nWendy's\nMcDonald's\nRevlon\nJCPenney\nSprint\nHonda\nFruit Of The Loom\nIntel\nNordstrom\nMotorola\nFidelity\nAmerican Airlines\nPfizer\nSara Lee\nAvis\nExxon\nProcter &amp; Gamble\nTexas Instruments\nBank Of America\nHewlett-Packard\nUPS\nShell\nIBM\nCaterpillar\nJohnson &amp;Johnson\nCargill\nMary Kay\nUnited Airlines\nState Farm\nHoneywell\n\nSince they all use prison labor. Since I can't donate my gains from GEO to charity, what would you suggest I invest in instead?",
        "created_utc": 1591055144,
        "id": "fskwdc4",
        "permalink": "/r/wallstreetbets/comments/guo4b1/geo_invest_in_the_riots_with_private_prisons/fskwdc4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591083944.0
    },
    {
        "author": "Avaronah",
        "body": "Do some more research on IBM. They're not doing well",
        "created_utc": 1591163696,
        "id": "fspwgfz",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fspwgfz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591192496.0
    },
    {
        "author": "dreammanalishi",
        "body": "I usually wait til the morning to decide, but Friday morning's list was...\n\nAYX\n\nBAH\n\nBLK\n\nBLL\n\nCAT\n\nCERN\n\nCL\n\nCMCSA\n\nCNSL\n\nCPB\n\nCSCO\n\nCTVA\n\nCVNA\n\nCZR\n\nDB\n\nDE\n\nDIS\n\nELF\n\nERIC\n\nGGG\n\nHD\n\nHLF\n\nHMC\n\nHUBB\n\nIEC\n\nINTC\n\nJNPR\n\nKDP\n\nKWR\n\nLANC\n\nLMT\n\nLOW\n\nLRCX\n\nMA\n\nMJCO\n\nMMM\n\nMORN\n\nMS\n\nMU\n\nMWA\n\nOOMA\n\nPAYC\n\nPCAR\n\nPCTY\n\nPSTG\n\nQCOM\n\nRACE\n\nSMTC\n\nSNE\n\nSPY\n\nSSSS\n\nSTN\n\nTCX\n\nTQQQ\n\nTSLA\n\nUBS\n\nULTA\n\nV\n\nVMW\n\nWCN\n\nWDAY\n\nWGO\n\nWIRE\n\nZEN\n\nZNGA\n\nI'm sure some will carry over to Monday.\n\nI move fast in the morning, but if I have time, maybe I'll try to remember to post before the market opens.",
        "created_utc": 1591462839,
        "id": "ft5c6bv",
        "permalink": "/r/wallstreetbets/comments/gxubtc/the_market_already_has_a_blueprint_in_front_of_you/ft5c6bv/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591491639.0
    },
    {
        "author": "Soggy-Prune",
        "body": "MCD is a good dividend play, good yield and growth. V has a low yield but high growth. I own both. \n\nI own dividend stocks because it makes it easier to hold things like SHOP, AMZN, PAYC, NFLX, GOOGL, NVDA (negligible dividend but I’ll take it). The dividends pay my living expense and the non-payers just sit in my portfolio and get bigger. All my stocks have a job, though not the same exact function. \n\nWould I have been better off with a portfolio of 100% SHOP calls? YOLO FTW? That would have done even better than QQQ, VUG, MCD or V, right? Well yeah, but I want to preserve my wealth as well as grow it. I also want to preserve my sanity. I want to sleep well at night, most nights. If I doubled my  net worth tomorrow it would not have a dramatic effect on my life, but if I lost it all I’d be ruined. I’m too old for that shit. \n\nSo it all depends on your goals and life circumstances too. If you’re young and in accumulation mode, go for capital gains. Dividends literally do not matter to you; total return is all. If you’re old and in withdrawal mode, dividends have a place (so do bonds). Chasing yield rarely ends well though.",
        "created_utc": 1591458535,
        "id": "ft4zc1n",
        "permalink": "/r/investing/comments/gxnhnt/why_go_for_dividends_when_there_are_capital_gains/ft4zc1n/",
        "score": 4,
        "subreddit": "investing",
        "created": 1591487335.0
    },
    {
        "author": "UnofficialGhost",
        "body": "Fuck I wish PAYC options were cheaper",
        "created_utc": 1591465992,
        "id": "ft5lruy",
        "permalink": "/r/wallstreetbets/comments/gxubtc/the_market_already_has_a_blueprint_in_front_of_you/ft5lruy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591494792.0
    },
    {
        "author": "BilliansShayeK",
        "body": "PAYC. ISRG",
        "created_utc": 1591145123,
        "id": "fsp2mms",
        "permalink": "/r/stocks/comments/gvi7wu/what_stocks_do_you_follow_that_you_dont_actually/fsp2mms/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591173923.0
    },
    {
        "author": "dreammanalishi",
        "body": "PAYC\n\nPCTY\n\nANET\n\nRBBN\n\noff the top of my head... those have been up and down enough to make me more money than some of the meme stocks but are along the same vein.\n\nGenerally, finding stocks related to meme stocks works best for me because by the time you see a news article or a post the market has already reacted.\n\nCertain correlated tickers and even ETFs often experience a delayed reaction, making it easier to buy and sell it for a fraction of a percent a few hundred times in a couple of days.",
        "created_utc": 1591457286,
        "id": "ft4vcp5",
        "permalink": "/r/StockMarket/comments/gxqkdk/what_are_the_best_industries_to_invest_in_right/ft4vcp5/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1591486086.0
    },
    {
        "author": "youngbloodtraveler",
        "body": "Where's the paycom link from, is that for internal employees only?",
        "created_utc": 1591287658,
        "id": "fsvgzo8",
        "permalink": "/r/pennystocks/comments/gwkjqk/new_xspa_job_openings/fsvgzo8/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591316458.0
    },
    {
        "author": "LinkFrost",
        "body": "Came here to say this. \n\nI don’t think GLW is going to be replacing windows broken from riots. \n\nI do think smartphone components are undervalued though. Looking at QCOM and other Apple suppliers lagging behind Apple’s recovery, might be able to do the same with GLW. \n\nGLW seems to have buyers at 22.50, I’d definitely buy if GLW dropped to somewhere between $20-22, within the next week, and ride the pre earnings surge for a maybe 5-10% profit, but it seems to be closely linked to consumer discretionary so keep an eye out for that",
        "created_utc": 1591026100,
        "id": "fsj9xwg",
        "permalink": "/r/wallstreetbets/comments/guhwdr/looks_like_i_wasnt_the_first_retard/fsj9xwg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591054900.0
    },
    {
        "author": "cranial_pudding",
        "body": "Did they talk about QCOM on Cramer or some shit\n\nWhats up with the ridiculous volume on 85c 6/12, I can't find any news and have been waiting all morning",
        "created_utc": 1591026270,
        "id": "fsja9q3",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsja9q3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591055070.0
    },
    {
        "author": "cranial_pudding",
        "body": "Volume on QCOM 85c 6/12 just went from 16k to 22k in less than 10 minutes lmao",
        "created_utc": 1591023962,
        "id": "fsj64h0",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsj64h0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591052762.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of June\n\n\n\n## Upcoming events for Monday, June  1st\n\n - Stock splits:\n\n    - EW @ **3:1** (Payable date: 05/29/2020)\n\n - Expected earnings:\n\n  ATEX, ATHM, AXAS, CANF, CSWC, ENS, ERJ, GSM, HHR, IDXG, IRS, LONE, MLAB, NAOV, NGL, OGEN, PIXY, PLX, PRCP, PSTI, PUMP, QTT, RMBL, SBT, STAF, THR, TTM, XYF\n\n - Ex-div:\n\n  AGR, BPOP, CATY, CRD.A, CRD.B, EBIX, EDUC, ESNT, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, IGD, IID, ITUB, KEY, KNSL, LHX, NEE, QIWI, RCKY, SNP, SOI, SWK, UVSP, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.130%)\n    - 6-Month Bill Auction (previous: 0.160%)\n    - Construction Spending (consensus: -6.0%, previous: 0.9%)\n    - ISM Manufacturing Employment (consensus: 35.0, previous: 27.5)\n    - ISM Manufacturing New Orders Index (previous: 27.1)\n    - ISM Manufacturing PMI (consensus: 43.0, previous: 41.5)\n    - ISM Manufacturing Prices (consensus: 37.0, previous: 35.3)\n    - Investing.com Gold Index (actual: 52.4%, previous: 56.9%)\n    - Investing.com S&amp;P 500 Index (actual: 23.9%, previous: 22.3%)\n    - Manufacturing PMI (consensus: 39.8, previous: 36.1)\n\n## Upcoming events for Tuesday, June  2nd\n\n - Stock splits:\n\n    - LPI @ **1:20**\n\n - Expected earnings:\n\n  AMBA, APPS, BBW, BZUN, CBRL, CRDF, CRWD, DCI, DKS, ENT, EVRI, GME, GRPN, HCR, HQY, HUD, IOTS, JT, LEJU, MDLA, MOGO, NEXT, PKX, PXS, RGS, RLMD, ROSE, SB, SOHO, TIF, TISI, TUES, WEI, WUBA, ZM\n\n - Ex-div:\n\n  AAON, AROW, AVT, AVY, BBD, BBDO, GHL, HAL, KRNY, LIN, NNA, NPO, ODFL, OPOF, OTTW, PAHC, PEBK, PJT, SLB, UG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 8.700M)\n    - ISM NY Business Conditions (previous: 4.3%)\n    - ISM-New York Index (previous: 826.5)\n    - Redbook (previous: -1.5%)\n    - Redbook (previous: -5.5%)\n    - Total Vehicle Sales (previous: 8.60M)\n\n## Upcoming events for Wednesday, June  3rd\n\n - Expected earnings:\n\n  ABM, AEO, AKTX, ALOT, AMSC, BWAY, CHNG, CLDR, CMTL, CNK, CORR, CPB, CPRI, CTXR, CZZ, DLPN, ESTC, EXPR, EYES, FOSL, GEF, GOOS, GWRE, HALL, HEPA, JAX, LMB, MBOT, MCF, NOVN, PBIO, PVH, QES, QMCO, SBSW, SMAR, SRNE, TENX, TLYS, UNFI, VOLT, VRA, VRNT, WTI, YJ, ZUO\n\n - Ex-div:\n\n  CEO, FRO, HD, HVT, HVT.A, MBCN, MOS, NEM, NLSN, PTEN, QCOM, RMBI, SSTK, SU\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -9,000K, previous: -20,236K)\n    - Crude Oil Imports (previous: 2.066M)\n    - Crude Oil Inventories (consensus: -1.944M, previous: 7.928M)\n    - Cushing Crude Oil Inventories (previous: -3.395M)\n    - Distillate Fuel Production (previous: -0.024M)\n    - Durables Excluding Defense (previous: -16.2%)\n    - EIA Refinery Crude Runs  (previous: 0.088M)\n    - EIA Weekly Distillates Stocks (consensus: 1.771M, previous: 5.494M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.0%, previous: 1.9%)\n    - Factory Orders (consensus: -12.5%, previous: -10.4%)\n    - Factory orders ex transportation (previous: -3.7%)\n    - Gasoline Inventories (consensus: 0.100M, previous: -0.724M)\n    - Gasoline Production (previous: 0.005M)\n    - Heating Oil Stockpiles (previous: 0.107M)\n    - ISM Non-Manufacturing Business Activity (previous: 26.0)\n    - ISM Non-Manufacturing Employment (previous: 30.0)\n    - ISM Non-Manufacturing New Orders (previous: 32.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 41.8)\n    - ISM Non-Manufacturing Prices (previous: 55.1)\n    - MBA 30-Year Mortgage Rate (previous: 3.42%)\n    - MBA Mortgage Applications (previous: 2.7%)\n    - Markit Composite PMI (consensus: 36.4, previous: 27.0)\n    - Mortgage Market Index (previous: 746.5)\n    - Seevol Cushing Storage Report (previous: -4.261M)\n    - Services PMI (consensus: 36.9, previous: 26.7)\n\n## Upcoming events for Thursday, June  4th\n\n - Expected earnings:\n\n  AINC, AMC, AVGO, BAK, BITA, BMA, BVXV, CAAS, CAL, CARE, CCEP, CIEN, CLUB, CMD, COO, CRC, CVIA, DBI, DLNG, DLTH, DOCU, DOMO, FLR, FUV, GES, GGAL, GHG, GIII, GPS, HBB, HOME, INWK, IRCP, JILL, KLXE, LLEX, MARK, MDB, MIK, MMYT, MOV, MTN, NAV, NGG, NX, OESX, PD, PRTY, RRGB, RTIX, SAIC, SCWX, SEAC, SENS, SJM, SPWH, TNP, TTC, UFAB, VJET, WORK, WPRT, XBIT, XELA, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AIN, AJG, AL, AMNB, ANAT, BAC, BAX, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CDK, CERN, CHRW, CTXS, D, ESBK, FFNW, FLO, FRME, GARS, GOLF, GPC, HLI, HWC, HWKN, ICBK, INT, KFRC, KMB, KNX, LCII, MANT, MBWM, MLI, NAVI, NVDA, ORI, PBIP, PCH, PEP, PII, RF, SEE, SLM, SNR, SQM, TGNA, TILE, TRST, TT, UFCS, WM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.130%)\n    - 8-Week Bill Auction (previous: 0.135%)\n    - Challenger Job Cuts (previous: 1,576.9%)\n    - Challenger Job Cuts (previous: 671.129K)\n    - Continuing Jobless Claims (consensus: 25,750K, previous: 21,052K)\n    - Exports (previous: 187.80B)\n    - Imports (previous: 232.20B)\n    - Initial Jobless Claims (consensus: 1,800K, previous: 2,123K)\n    - Jobless Claims 4-Week Avg. (previous: 2,608.00K)\n    - Natural Gas Storage (consensus: 107B, previous: 109B)\n    - Nonfarm Productivity (consensus: -2.5%, previous: -2.5%)\n    - Trade Balance (consensus: -44.30B, previous: -44.40B)\n    - Unit Labor Costs (consensus: 4.8%, previous: 4.8%)\n\n^^^^2020-06-01",
        "created_utc": 1591005619,
        "id": "fsigvgq",
        "permalink": "/r/RobinHood/comments/guhudl/daily_discussion_thread_june_1st_2020/fsigvgq/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1591034419.0
    },
    {
        "author": "wdmx",
        "body": "QCOM",
        "created_utc": 1591022197,
        "id": "fsj2xff",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsj2xff/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591050997.0
    },
    {
        "author": "cranial_pudding",
        "body": "18k volume and less than 100 OI on QCOM 85c 6/12",
        "created_utc": 1591023529,
        "id": "fsj5bpl",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsj5bpl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591052329.0
    },
    {
        "author": "jabathehut6900",
        "body": "Anyone see the volume of QCOM options for 6/12?",
        "created_utc": 1591023873,
        "id": "fsj5ykg",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsj5ykg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591052673.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of June\n\n\n\n## Upcoming events for Monday, June  1st\n\n - Stock splits:\n\n    - EW @ **3:1** (Payable date: 05/29/2020)\n\n - Expected earnings:\n\n  ATEX, ATHM, AXAS, CANF, CSWC, ENS, ERJ, GSM, HHR, IDXG, IRS, LONE, MLAB, NAOV, NGL, OGEN, PIXY, PLX, PRCP, PSTI, PUMP, QTT, RMBL, SBT, STAF, THR, TTM, XYF\n\n - Ex-div:\n\n  AGR, BPOP, CATY, CRD.A, CRD.B, EBIX, EDUC, ESNT, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, IGD, IID, ITUB, KEY, KNSL, LHX, NEE, QIWI, RCKY, SNP, SOI, SWK, UVSP, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.130%)\n    - 6-Month Bill Auction (previous: 0.160%)\n    - Construction Spending (consensus: -6.0%, previous: 0.9%)\n    - ISM Manufacturing Employment (consensus: 35.0, previous: 27.5)\n    - ISM Manufacturing New Orders Index (previous: 27.1)\n    - ISM Manufacturing PMI (consensus: 43.0, previous: 41.5)\n    - ISM Manufacturing Prices (consensus: 37.0, previous: 35.3)\n    - Investing.com Gold Index (actual: 52.4%, previous: 56.9%)\n    - Investing.com S&amp;P 500 Index (actual: 23.9%, previous: 22.3%)\n    - Manufacturing PMI (consensus: 39.8, previous: 36.1)\n\n## Upcoming events for Tuesday, June  2nd\n\n - Stock splits:\n\n    - LPI @ **1:20**\n\n - Expected earnings:\n\n  AMBA, APPS, BBW, BZUN, CBRL, CRDF, CRWD, DCI, DKS, ENT, EVRI, GME, GRPN, HCR, HQY, HUD, IOTS, JT, LEJU, MDLA, MOGO, NEXT, PKX, PXS, RGS, RLMD, ROSE, SB, SOHO, TIF, TISI, TUES, WEI, WUBA, ZM\n\n - Ex-div:\n\n  AAON, AROW, AVT, AVY, BBD, BBDO, GHL, HAL, KRNY, LIN, NNA, NPO, ODFL, OPOF, OTTW, PAHC, PEBK, PJT, SLB, UG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 8.700M)\n    - ISM NY Business Conditions (previous: 4.3%)\n    - ISM-New York Index (previous: 826.5)\n    - Redbook (previous: -1.5%)\n    - Redbook (previous: -5.5%)\n    - Total Vehicle Sales (previous: 8.60M)\n\n## Upcoming events for Wednesday, June  3rd\n\n - Expected earnings:\n\n  ABM, AEO, AKTX, ALOT, AMSC, BWAY, CHNG, CLDR, CMTL, CNK, CORR, CPB, CPRI, CTXR, CZZ, DLPN, ESTC, EXPR, EYES, FOSL, GEF, GOOS, GWRE, HALL, HEPA, JAX, LMB, MBOT, MCF, NOVN, PBIO, PVH, QES, QMCO, SBSW, SMAR, SRNE, TENX, TLYS, UNFI, VOLT, VRA, VRNT, WTI, YJ, ZUO\n\n - Ex-div:\n\n  CEO, FRO, HD, HVT, HVT.A, MBCN, MOS, NEM, NLSN, PTEN, QCOM, RMBI, SSTK, SU\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -9,000K, previous: -20,236K)\n    - Crude Oil Imports (previous: 2.066M)\n    - Crude Oil Inventories (consensus: -1.944M, previous: 7.928M)\n    - Cushing Crude Oil Inventories (previous: -3.395M)\n    - Distillate Fuel Production (previous: -0.024M)\n    - Durables Excluding Defense (previous: -16.2%)\n    - EIA Refinery Crude Runs  (previous: 0.088M)\n    - EIA Weekly Distillates Stocks (consensus: 1.771M, previous: 5.494M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.0%, previous: 1.9%)\n    - Factory Orders (consensus: -12.5%, previous: -10.4%)\n    - Factory orders ex transportation (previous: -3.7%)\n    - Gasoline Inventories (consensus: 0.100M, previous: -0.724M)\n    - Gasoline Production (previous: 0.005M)\n    - Heating Oil Stockpiles (previous: 0.107M)\n    - ISM Non-Manufacturing Business Activity (previous: 26.0)\n    - ISM Non-Manufacturing Employment (previous: 30.0)\n    - ISM Non-Manufacturing New Orders (previous: 32.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 41.8)\n    - ISM Non-Manufacturing Prices (previous: 55.1)\n    - MBA 30-Year Mortgage Rate (previous: 3.42%)\n    - MBA Mortgage Applications (previous: 2.7%)\n    - Markit Composite PMI (consensus: 36.4, previous: 27.0)\n    - Mortgage Market Index (previous: 746.5)\n    - Seevol Cushing Storage Report (previous: -4.261M)\n    - Services PMI (consensus: 36.9, previous: 26.7)\n\n## Upcoming events for Thursday, June  4th\n\n - Expected earnings:\n\n  AINC, AMC, AVGO, BAK, BITA, BMA, BVXV, CAAS, CAL, CARE, CCEP, CIEN, CLUB, CMD, COO, CRC, CVIA, DBI, DLNG, DLTH, DOCU, DOMO, FLR, FUV, GES, GGAL, GHG, GIII, GPS, HBB, HOME, INWK, IRCP, JILL, KLXE, LLEX, MARK, MDB, MIK, MMYT, MOV, MTN, NAV, NGG, NX, OESX, PD, PRTY, RRGB, RTIX, SAIC, SCWX, SEAC, SENS, SJM, SPWH, TNP, TTC, UFAB, VJET, WORK, WPRT, XBIT, XELA, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AIN, AJG, AL, AMNB, ANAT, BAC, BAX, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CDK, CERN, CHRW, CTXS, D, ESBK, FFNW, FLO, FRME, GARS, GOLF, GPC, HLI, HWC, HWKN, ICBK, INT, KFRC, KMB, KNX, LCII, MANT, MBWM, MLI, NAVI, NVDA, ORI, PBIP, PCH, PEP, PII, RF, SEE, SLM, SNR, SQM, TGNA, TILE, TRST, TT, UFCS, WM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.130%)\n    - 8-Week Bill Auction (previous: 0.135%)\n    - Challenger Job Cuts (previous: 1,576.9%)\n    - Challenger Job Cuts (previous: 671.129K)\n    - Continuing Jobless Claims (consensus: 25,750K, previous: 21,052K)\n    - Exports (previous: 187.80B)\n    - Imports (previous: 232.20B)\n    - Initial Jobless Claims (consensus: 1,800K, previous: 2,123K)\n    - Jobless Claims 4-Week Avg. (previous: 2,608.00K)\n    - Natural Gas Storage (consensus: 107B, previous: 109B)\n    - Nonfarm Productivity (consensus: -2.5%, previous: -2.5%)\n    - Trade Balance (consensus: -44.30B, previous: -44.40B)\n    - Unit Labor Costs (consensus: 4.8%, previous: 4.8%)\n\n^^^^2020-06-01",
        "created_utc": 1591005619,
        "id": "fsigvgq",
        "permalink": "/r/RobinHood/comments/guhudl/daily_discussion_thread_june_1st_2020/fsigvgq/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1591034419.0
    }
]