[
    {
        "author": "bandwagonnetsfan",
        "body": "So buy Norton anti virus?",
        "created_utc": 1600469443,
        "id": "g5r533g",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600498243.0
    },
    {
        "author": "kidney83",
        "body": "CS are one of the true Endpoint Detection and Response (EDR) vendors. It goes way beyond traditional antivirus (McAfee, Symantec, Trend, etc). \n\nThe next gen endpoint protection vendors focus primarily on behaviour based detection rather than signatures. Collecting a large number of contextual metrics and then correlating these to detect indicators of compromise and prevent them effectively.\n\nCS are one of the best out there. Superb marketing. Lots of hype. Only vendor I've seen that goes toe-to-toe is Cybereason. They are not listed yet though, but keep an eye out.",
        "created_utc": 1599083085,
        "id": "g3rvrp9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599111885.0
    },
    {
        "author": "Engrish_Bulldog",
        "body": "Endpoint Detection/Response and NGAV actually but yeah close enough.  They're honestly the best player in the EDR space right now. I'm a chief information security officer in NYC and all of my peers are dropping traditional AV like Symantec for CS because it allows a smaller team to do more. The tool is an incredible force multiplier if you have a SOC that knows what to do with it.",
        "created_utc": 1598971315,
        "id": "g3ldpqy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599000115.0
    },
    {
        "author": "MrBankruptcy",
        "body": "DIX S&amp;P 500 42.1\n\nSPY 31   QQQ 47\n\n  https://imgur.com/ffbBJwG   Anyone able to tell what's going on with SPY? Lower and Lower Volume\n\nTop High Dpi UBER COTY PE BKR NLOK AMZN GME\n\nTop Low Dpi TSLA AMD C VALE XOM NVD\n\nMine QCOM 37  XLB 69  SQ 65 DRN 36",
        "created_utc": 1600208536,
        "id": "g5esbsi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600237336.0
    },
    {
        "author": "CallsOnAlcoholism",
        "body": "It’s NLOK and “NortonLifeLock” you absolute genius",
        "created_utc": 1600094702,
        "id": "g58gyah",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600123502.0
    },
    {
        "author": "dkmc6",
        "body": "Look up Tom Hiddleston impression's of Robert De niro on the Graham Norton show on YouTube, he does the diner scene from Heat perfectly",
        "created_utc": 1599027426,
        "id": "g3otnwz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599056226.0
    },
    {
        "author": "OkSwan5",
        "body": "MRVL\nPHR\nNLOK",
        "created_utc": 1600602951,
        "id": "g5ysvfe",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600631751.0
    },
    {
        "author": "dreybaybay",
        "body": "Of course fundamentals matter. By knowing tech I mean I’m in the industry and I know what products are best and how well they’re doing compared to others well before you see it in top line results - and definitely before wall st. who don’t use the tech on the ground and see the trends competitively. There is no doubt that provides an edge on where to place your bets across B2B tech if you’re competing, partnering, and integrating with the other players in the space and through your network. \n\nGreat example is new Relic. Everyone in the industry new they were getting killed way before their price halved because of architectural decisions and pricing mechanics changes. Everyone knew it was two players eating their lunch (stocks which have since some very well).\nSame with Symantec and Oracle and all their adjacent competitors. \n\nThere is just no way I could know that about energy and telecom at this juncture.\n\nMaybe I can get there but hard for me to make big bets on who is differentiating themselves when I have no idea how these guys differentiate their products and services.  \n\nAnd I guess just trying to figure out if it’s worth investing time to understand another space as intimately without living and breathing it the way I have with tech. \n\nEdit: typos",
        "created_utc": 1600674222,
        "id": "g62u5q3",
        "score": 1,
        "subreddit": "investing",
        "created": 1600703022.0
    },
    {
        "author": "mattlockesreddit",
        "body": "PH3 by layne Norton, I’ve been lifting for like 6 years but I haven’t made any significant strength gains in the past 2 years because I haven’t counted cals. Need to again just not stable right now",
        "created_utc": 1600567971,
        "id": "g5wpkdd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600596771.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "no_flags_on_the_play",
        "body": "Imagine not being balls deep in NLOK calls",
        "created_utc": 1600649620,
        "id": "g61vrkg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600678420.0
    },
    {
        "author": "Ifuqinhateit",
        "body": "EMC, Symantec and CA are no longer ticker symbols, so, don’t kid yourself. Big companies go away. Cloud transformation is really just starting and you really have no idea what is going to happen over the next 10 years. It used to take five years just to implement an important enterprise software solution at an F100 and fully unwinding it was insanely difficult and took a long time. It was even difficult at smaller enterprises. Now, not so much. I never said cloud companies don’t have good revenue streams or they aren’t poised for growth, I’ve said all along that it isn’t as sticky as it used to be. The decay can happen just as quickly as the growth.",
        "created_utc": 1600870156,
        "id": "g6bhktl",
        "score": 1,
        "subreddit": "investing",
        "created": 1600898956.0
    },
    {
        "author": "Ifuqinhateit",
        "body": "Research Brodcom’s acquisitions of CA and Symantec. It’ll tell you all you need to know.",
        "created_utc": 1600889952,
        "id": "g6cliiv",
        "score": 0,
        "subreddit": "investing",
        "created": 1600918752.0
    },
    {
        "author": "iredditacc",
        "body": "Nice you’re the NLOK guy congrats",
        "created_utc": 1599246304,
        "id": "g40y53h",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1599275104.0
    },
    {
        "author": "MrBankruptcy",
        "body": "DIX 43.8   QQQ 45    SPY 61\n\nBest HST PTON PE COP WBA NLOK AMZN MOS Z\n\nWorst TSLA C NVDA BP AMAT NGD NKE",
        "created_utc": 1600381064,
        "id": "g5n3jyv",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1600409864.0
    },
    {
        "author": "MrBankruptcy",
        "body": "DIX S&amp;P 40.9    QQQ 42   SPY 58\n\nTop 5 QID ROKU PE NLOK ATUS\n\nWORST 5 TSLA C NVDA BP KR\n\nMINE QCOM 33 SQ 58  XLB 68  NIO 57 SPCE 57 DRN 16",
        "created_utc": 1600294116,
        "id": "g5ipt9v",
        "score": -8,
        "subreddit": "wallstreetbets",
        "created": 1600322916.0
    },
    {
        "author": "mattcor76",
        "body": "SPY - 13.82%\n\nQTEC - 10.62%\n\nAMZN - 11.69%\n\nAAPL - 4.97%\n\nGOOGL - 6.89%\n\nPYPL -7.06%\n\nHD - 4.90%\n\nJNJ - 3.23%\n\nDNKN - 4.80%\n\nMCD - 4.81%\n\nKO - 2.37%\n\nENPH - 3.44%\n\nRUN - 1.91%\n\nTXN - 3.33%\n\nJ - 2.47%\n\nRKT - 5.03%\n\nHON - 5.46%\n\nPM - 3.15%\n\n&amp;#x200B;\n\nStarted on robinhood about 3 weeks ago and have built this portfolio quickly with mostly long term but some short term speculative plays. Initially I had too many eggs in the tech basket so I decided to spread it out more to control the damage once this bubble pops. What do you think?",
        "created_utc": 1598997386,
        "id": "g3nbf7y",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599026186.0
    },
    {
        "author": "CoalFlavored",
        "body": "I’ve done quite a bit of work in the last month. All with dividends are enrolled in DRIP. In descending order by allocation -\n\nAAPL 23.57%\nTXN 21.47%\nKO 17.78%\nNET 13.60%\nARKF 8.57%\nCash 6.42%\nVNQ 3.63%\nVDC 2.48%\nBOXL 2.48%\n\nI guess I’m going for a moderately aggressive profile. AAPL, TXN, and KO for long term growth; NET, ARKF, and BOXL for pure speculation; VNQ and VDC for stability. I’m torn right now between focusing on continuing to load on more speculation (I’m 26), or to rush 100 KO shares to sell covered calls on for passive income and to essentially end up wheeling. Thoughts?",
        "created_utc": 1598974887,
        "id": "g3lncus",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599003687.0
    }
]