[
    {
        "author": "tvjust",
        "body": "Let the games begin - Would love a nice pump n dump in NIO\n\n60$ Jan. Call - Suck it TSLA",
        "created_utc": 1594824165,
        "id": "fy5cexm",
        "score": 4969,
        "subreddit": "wallstreetbets",
        "created": 1594852965.0
    },
    {
        "author": "theodros1",
        "body": "14k to 159k is impressive as hell. Losing it all is somehow more impressive",
        "created_utc": 1595691478,
        "id": "fz7cw3h",
        "score": 4052,
        "subreddit": "wallstreetbets",
        "created": 1595720278.0
    },
    {
        "author": "BoredPersonAtWork",
        "body": "Chuck E. Cheese. Revive the company &amp; rebrand it",
        "created_utc": 1594824231,
        "id": "fy5cjm6",
        "score": 2133,
        "subreddit": "wallstreetbets",
        "created": 1594853031.0
    },
    {
        "author": "soozler",
        "body": "Shit man. You could have just as easily bet the other way and quadrupled your life savings, became a gambling addict, and lost it all in three months anyway.  I'm sorry bud.",
        "created_utc": 1595904456,
        "id": "fzh303u",
        "score": 1602,
        "subreddit": "wallstreetbets",
        "created": 1595933256.0
    },
    {
        "author": "CEO_of_Tism",
        "body": "These 4 men combined could buy 70% of the earth and rename it Faggyland if they wanted",
        "created_utc": 1595508255,
        "id": "fyz3l2i",
        "score": 1597,
        "subreddit": "wallstreetbets",
        "created": 1595537055.0
    },
    {
        "author": "patrickbateman02",
        "body": "Blow on the cartridge and put it back in\n\nEdit: this comment blew up. Thanks for the love gang !",
        "created_utc": 1595607914,
        "id": "fz3rn89",
        "score": 1374,
        "subreddit": "wallstreetbets",
        "created": 1595636714.0
    },
    {
        "author": "coolgoulfool",
        "body": "I bought Intel puts last night 5 minutes to close on whim from a random comment here. Not a good strat at ALL but I knew about Intel's current issues and have been long on AMD for a bit. Woke up to see the my puts over 100%. Love it",
        "created_utc": 1595631898,
        "id": "fz54pts",
        "score": 1050,
        "subreddit": "wallstreetbets",
        "created": 1595660698.0
    },
    {
        "author": "felixe00",
        "body": "Uninstall and reinstall. \n\nIf that doesn't work:\n\nDon't pay it, gift all your assets (assuming you have any), and file for bankruptcy.\n\nOnce the smoke has settled get your assets back, use them as leverage for a loan and go all in on SPY $420c 1/15/21",
        "created_utc": 1595609753,
        "id": "fz3vk80",
        "score": 1034,
        "subreddit": "wallstreetbets",
        "created": 1595638553.0
    },
    {
        "author": "doougle",
        "body": "You can't speak of this crisis as thought it's already behind us.   The economic challenge has hardly even begun and the virus part is still getting worse by the week.\n\nThe market has held up because the gov't is basically paying the bills of the unemployed.  That isn't sustainable.   I don't know how it ends but it will end somehow.  That's the part that will probably be worse than 2008.",
        "created_utc": 1595589694,
        "id": "fz2w9n1",
        "score": 918,
        "subreddit": "investing",
        "created": 1595618494.0
    },
    {
        "author": "redditingatwork23",
        "body": "It was real money.",
        "created_utc": 1595701627,
        "id": "fz7vmcr",
        "score": 908,
        "subreddit": "wallstreetbets",
        "created": 1595730427.0
    },
    {
        "author": "Kornbread2000",
        "body": "If you ask the Wall Street Journal, it is when the gamblers have sports to bet on again.",
        "created_utc": 1595277215,
        "id": "fyp1w7s",
        "score": 898,
        "subreddit": "investing",
        "created": 1595306015.0
    },
    {
        "author": "Zohboh",
        "body": "Hey Dad, long time no see.  Hope everything is well.  I recently got a job as a tax specialist at the IRS and it has come to my attention that you're in arrears.  But don't worry I got your back.  I just need 50k in Google Play cards and I should be able to remove the hold on your account.\n\n&amp;#x200B;\n\nIs there a Target or Dollar General nearby?",
        "created_utc": 1595859447,
        "id": "fzem9w5",
        "score": 844,
        "subreddit": "wallstreetbets",
        "created": 1595888247.0
    },
    {
        "author": "averagerobotboi",
        "body": "All I need is one good play to make it all back!\n\nEdit: Thanks for FP boyz.  A vague idea of my positions below.",
        "created_utc": 1595592746,
        "id": "fz301ut",
        "score": 748,
        "subreddit": "wallstreetbets",
        "created": 1595621546.0
    },
    {
        "author": "pok753",
        "body": "No that’s about all my savings. I made it on yolo so it’s rightful it goes out on yolo..",
        "created_utc": 1595518149,
        "id": "fyzky4p",
        "score": 717,
        "subreddit": "wallstreetbets",
        "created": 1595546949.0
    },
    {
        "author": "WrongPurpose",
        "body": "Did you just made 1.2 million because Intel shit the bed? Congrats, now cash out and retire before you loose it all.",
        "created_utc": 1595601172,
        "id": "fz3dy1g",
        "score": 709,
        "subreddit": "wallstreetbets",
        "created": 1595629972.0
    },
    {
        "author": "SwitchedOnNow",
        "body": "I think it’s going down, unless it goes up. Then I think it’ll go up unless it goes down.",
        "created_utc": 1595706906,
        "id": "fz87oh6",
        "score": 694,
        "subreddit": "stocks",
        "created": 1595735706.0
    },
    {
        "author": "tybone537",
        "body": "You make too much sense, panic sell it is.\n\n\nEDIT: First time I’ve ever received an award on reddit, actually first award ever, I am honored.",
        "created_utc": 1595597316,
        "id": "fz36z3h",
        "score": 608,
        "subreddit": "stocks",
        "created": 1595626116.0
    },
    {
        "author": "LavenderAutist",
        "body": "Wouldn't it be funny if the stock mooned after the earnings release, but then plummeted after the earnings call.",
        "created_utc": 1595450330,
        "id": "fywsy97",
        "score": 571,
        "subreddit": "wallstreetbets",
        "created": 1595479130.0
    },
    {
        "author": "Rcrowley3",
        "body": "Someone on here bought this truck but they’ll never admit it.",
        "created_utc": 1595186131,
        "id": "fyl2v7n",
        "score": 559,
        "subreddit": "wallstreetbets",
        "created": 1595214931.0
    },
    {
        "author": "maxiaoling",
        "body": "Elon send me gold if we report positive earnings today!\n\nEdit: wtf this blew up. Don’t really deserve it but TIL there is a kinky invite only platinumuserclub subreddit",
        "created_utc": 1595417088,
        "id": "fyv1quq",
        "score": 544,
        "subreddit": "wallstreetbets",
        "created": 1595445888.0
    },
    {
        "author": "AveenoFresh",
        "body": "I went through your post/comment history. At no point did you ever tell anyone that NVAX would be a good buy, or post any DD on it. \n\nY'all just come in, lurk, make great plays, and only post when it profits? Nah, man. Be a bro and share intel.",
        "created_utc": 1594571743,
        "id": "fxubdo1",
        "score": 530,
        "subreddit": "wallstreetbets",
        "created": 1594600543.0
    },
    {
        "author": "MakeoverBelly",
        "body": "Because he was a huge asshole. He changed.\n\nCharlie Munger says that some maybe not so nice people start doing philanthropy because it's a \"cool\" thing to do when you're rich, but then it changes them. It may even apply to himself.",
        "created_utc": 1594530533,
        "id": "fxsvaue",
        "score": 524,
        "subreddit": "stocks",
        "created": 1594559333.0
    },
    {
        "author": "Arkansasmyundies",
        "body": "“Davis said that in some cases he had failed to determine the source of recovered materials, leading him to conclude, “We couldn’t make it ourselves.”\n\nTranslation: If it’s not a Boeing Jet, shits gotta be martians 👽",
        "created_utc": 1595760056,
        "id": "fzagyx1",
        "score": 522,
        "subreddit": "wallstreetbets",
        "created": 1595788856.0
    },
    {
        "author": "comparmentaliser",
        "body": "Intel’s lead architect left a few weeks ago - supposedly to join AMD (which is where he was prior to Intel anyway).\n\nThere was a good post on wsb a few weeks back about it - obviously there’s a lot of speculation, but it’s plausible.\n\nAlso, AMD have been gaining on Intel in terms of performance, power and heat. That said, Intel is still a household name, and they have a very aggressive marketing and licensing strategy. For example, Lenovo’s flagship X line of laptops are Intel-only, but they’re supposedly just waiting for that agreement to expire before moving on to AMD (I’d kill for an ARM X1 though :)",
        "created_utc": 1595756422,
        "id": "fzadkrp",
        "score": 495,
        "subreddit": "investing",
        "created": 1595785222.0
    },
    {
        "author": "prestodigitarium",
        "body": "It might mean your shares’ value ceases to exist, though.",
        "created_utc": 1595688509,
        "id": "fz77sx6",
        "score": 494,
        "subreddit": "investing",
        "created": 1595717309.0
    },
    {
        "author": "LavenderAutist",
        "body": "Only one more day before the loss / gain porn begins.\n\nIt will be epic.",
        "created_utc": 1595359535,
        "id": "fyso6f4",
        "score": 492,
        "subreddit": "wallstreetbets",
        "created": 1595388335.0
    },
    {
        "author": "ImSickOfYouToo",
        "body": "The stock market was lower than it was a couple hours ago.  Get used to it, it happens a bunch.",
        "created_utc": 1595529425,
        "id": "fz09766",
        "score": 485,
        "subreddit": "stocks",
        "created": 1595558225.0
    },
    {
        "author": "dyrbrdyrbr",
        "body": "“This has gone up 20% in two days” ... “I know some of you don’t consider this a serious investment.”\n\nYep, that’s it.",
        "created_utc": 1595887799,
        "id": "fzg8xk2",
        "score": 483,
        "subreddit": "investing",
        "created": 1595916599.0
    },
    {
        "author": "everlastingdeath",
        "body": "I'd probably end it if I was this guy. I went from 5k to 32k to 4k. Even at that bridges didn't seem like a bad idea.",
        "created_utc": 1595700904,
        "id": "fz7u9pg",
        "score": 478,
        "subreddit": "wallstreetbets",
        "created": 1595729704.0
    },
    {
        "author": "SwitchedOnNow",
        "body": "I can’t tell if Elon’s brilliant or retarded. It seems a combination of both.",
        "created_utc": 1594853962,
        "id": "fy721ox",
        "score": 470,
        "subreddit": "wallstreetbets",
        "created": 1594882762.0
    },
    {
        "author": "SECwontletMEB",
        "body": "Nice, don’t look at it as a 97% loss, you doubled your money from 1k-2k!!!",
        "created_utc": 1595593088,
        "id": "fz30ina",
        "score": 465,
        "subreddit": "wallstreetbets",
        "created": 1595621888.0
    },
    {
        "author": "Power80770M",
        "body": "Blow it all on bad options trades, of course!",
        "created_utc": 1595860782,
        "id": "fzeoq5z",
        "score": 448,
        "subreddit": "wallstreetbets",
        "created": 1595889582.0
    },
    {
        "author": "skomes99",
        "body": "I just saw this on ft.com and laughed.\n\nIt was just this year the Slack CEO was laughing at Teams, and they sent Microsoft a joke card about being late to the party, but they're clearly worried now.",
        "created_utc": 1595430448,
        "id": "fyvmw47",
        "score": 441,
        "subreddit": "investing",
        "created": 1595459248.0
    },
    {
        "author": "KevinDoesntGiveAHoot",
        "body": "If that was the case then I’d just cancel my membership and watch exclusive shows for free. Netflix would lose customer revenue and have to replace it with Ad revenue",
        "created_utc": 1595130140,
        "id": "fyizkv8",
        "score": 440,
        "subreddit": "stocks",
        "created": 1595158940.0
    },
    {
        "author": "FranklynTheTanklyn",
        "body": " They would just include it in a firmware update.",
        "created_utc": 1595510924,
        "id": "fyz7ozc",
        "score": 435,
        "subreddit": "wallstreetbets",
        "created": 1595539724.0
    },
    {
        "author": "Odd-Cause",
        "body": "Or it will go back to $420.69 by thursday. Then he will “take it private”",
        "created_utc": 1595370260,
        "id": "fyta8j8",
        "score": 431,
        "subreddit": "wallstreetbets",
        "created": 1595399060.0
    },
    {
        "author": "vadimyuryev",
        "body": "IV Crush Explained:  \nBased on the state of the current market as a whole, and the state of the stock in question, the stock will have a certain % of Implied Volatility.  \nFor example, if the IV is 40%, this means that a year from today, the market expects that the current stock price will either be 40% higher than it is today, or 40% lower than it is today.\n\n  \nThat's why IV was very high for stocks during Coronavirus, because the market was volatile and nobody really knew what was gonna happen, so there was a chance for stock prices to move drastically either up or down.  \nAbout a couple of weeks or a month before the earnings of a stock, people start talking about how the company will perform on their earnings report. If everything has been chugging along normally, their Implied Volatility stays pretty low since nobody expects there to be a huge move in either direction.  \n\n\nNow in the case of Tesla, which is a meme stock (basically incredibly popular and in the news all the time), there are drastically varying opinions. Some people believe they will fail their earnings for Q2 and the stock will crash down to 1000 or less points.   \nSome people believe they will succeed and the stock price will jump to 2000 points.  \nBecause of these drastically varying opinions and controversy, the Implied Volatility goes up.   \n\n\nBecause IV goes up, more people buy into the stock thinking they could earn some nice tendies. This increases the demand for options, which in turn raises the premium fee of buying those options.  \n\n\nThe demand and premium price stays high right up until earnings, since people are expecting a huge move in the stock price. As soon as the earnings gets released, everyone knows the truth and they know if they were wrong or right. The stock price changes quickly in after earnings trading to reflect the earnings report.  \n\n\nThis instantly crushes the Implied Volatility since nobody expects the price the move drastically anymore, and this GREATLY reduces the premium price of the option you own, so you lost all of that extra value due to increased demand.   \n\n\nOn top of that, your option expires tomorrow and the extrinsic value of your option decayed over time. Tomorrow, the extrinsic value will be worthless, so all you will be left with is the difference in stock price and your strike price. If you're not above break even, you basically lost all of your money.",
        "created_utc": 1595523279,
        "id": "fyzvm2j",
        "score": 418,
        "subreddit": "wallstreetbets",
        "created": 1595552079.0
    },
    {
        "author": "blindgraysquirrel",
        "body": "Where else would they hoard it? Under the pillows in the pillow section?? I checked there during my DD",
        "created_utc": 1595183432,
        "id": "fykxomm",
        "score": 411,
        "subreddit": "wallstreetbets",
        "created": 1595212232.0
    },
    {
        "author": "IamMat",
        "body": "Here's what will happen and i will come back to this once earnings are released next week.\n\n&amp;#x200B;\n\n1) AMD will get pumped hard until earnings\n\n2) It will beat top and bottom but will dump, similar to microsoft.  This is our environment right now.",
        "created_utc": 1595543113,
        "id": "fz11pfn",
        "score": 410,
        "subreddit": "investing",
        "created": 1595571913.0
    },
    {
        "author": "BoomBoom_King",
        "body": "Yes, but he pulled out before it all came crashing down. People called him nuts for selling while equities were flying. That's why he is echoing \"Dont be greedy\".",
        "created_utc": 1595258738,
        "id": "fyo01j4",
        "score": 402,
        "subreddit": "stocks",
        "created": 1595287538.0
    },
    {
        "author": "Ivanhu1",
        "body": "This is an absolute flawless plan and there’s absolutely no chance that it won’t work.",
        "created_utc": 1595090374,
        "id": "fyh46dc",
        "score": 397,
        "subreddit": "wallstreetbets",
        "created": 1595119174.0
    },
    {
        "author": "everlastingdeath",
        "body": "That's how a smart person would look at it, but to me I lost 27k because I had the entire 32k in cash at one point so it felt like real money.",
        "created_utc": 1595701421,
        "id": "fz7v8ki",
        "score": 389,
        "subreddit": "wallstreetbets",
        "created": 1595730221.0
    },
    {
        "author": "peaceful_manlet",
        "body": "It might make the newbies (im a newb too) buy more because most newbies focus so much on the Price.\n\nI dont care since I just buy fractions.",
        "created_utc": 1596141901,
        "id": "fzs5o9f",
        "score": 387,
        "subreddit": "stocks",
        "created": 1596170701.0
    },
    {
        "author": "snek-jazz",
        "body": "&gt; What do you all make of this?\n\nBitcoiner since 2013 here, it's just like all the other times, we had a blow off top at the end of 2018, then around 80% correction during bear market 1-2 years of slow recovery back to about 50% (we are here now) and the next bull market starts.\n\nWhen it passes the old ATH (20k) a new hype cycle starts and new users start piling in as FOMO reaches its peak.",
        "created_utc": 1595888803,
        "id": "fzgaxa9",
        "score": 387,
        "subreddit": "investing",
        "created": 1595917603.0
    },
    {
        "author": "brokenarrow326",
        "body": "Lol in case no one explained it yet or you havent googled, Implied volatility is one of factors that make up the option price. If there is high IV it means that particular option is most likely in high demand bidding up the price. So the underlying stock can move in the right direction but if the move isnt strong enough to overcome the high IV factored into the premium you paid, you’ll most likely not make anything on the option or in this case lose money. Yay complex math!",
        "created_utc": 1595521815,
        "id": "fyzsha1",
        "score": 386,
        "subreddit": "wallstreetbets",
        "created": 1595550615.0
    },
    {
        "author": "CumFlakess",
        "body": "Let’s just pass it off to Gen Z",
        "created_utc": 1595311396,
        "id": "fyqo1ix",
        "score": 364,
        "subreddit": "wallstreetbets",
        "created": 1595340196.0
    },
    {
        "author": "paincorp",
        "body": "I love how people keep realizing how bad of a situation airlines are in, like people haven’t been saying it for 4 months now.",
        "created_utc": 1595682370,
        "id": "fz6yn28",
        "score": 364,
        "subreddit": "investing",
        "created": 1595711170.0
    },
    {
        "author": "_scottyb",
        "body": "I had this happen to me, well not quite the same.\n\nI had a spread on Amazon go in the money and I got assigned. Hit me for like 100k or some stupid shit when the max loss on the spread was supposed to be $500. The problem was that the assignment happens instantly, but when they go to execute the other leg of the spread to keep you covered, it takes 2-3 business days to process. So i actually only lost $500, didnt owe a margin call, and got locked out due to my account showing I owed 100k.\n\nWhen I saw the news article about that kid offing himself due to losing everything when, \"it was supposed to be a defined risk trade,\" i knew exactly what had happened. And even worse, if robinhoods customer service actually existed, the poor kid could have gotten real answers",
        "created_utc": 1595616569,
        "id": "fz4a5gj",
        "score": 358,
        "subreddit": "wallstreetbets",
        "created": 1595645369.0
    },
    {
        "author": "TheHappyItalianMan",
        "body": "So, my day trades were capped off because I made 4th trade on the the week following July 4th. I forgot that its five TRADING days, rather than business days. This made me pdt marked, so I lost my 3 trades a week.\n\nFast forward to yesterday, I was jacked to the tits in spy puts, I bought them at open Thursday, wanted to lock in profits. Had a bunch of spreads opened to try to hedge profits, but decided I wanted to just cash out, so I day traded, locked my account.\n\nOnce you lock you account, you have the remainder of the day to go nuts with day trades, went through a bunch of Tesla Spreads, Spy contracts and racked up 30+ trades in a day to cap off my robinhood journey.\n\nI’d assume the spreads make it look like I traded an insane amount, so realistically I probably need to deposit $3000ish-$5000. No wonder that kid killed himself, robinhood is fucking terrible. \n\nI have accts with tasty, and tos so just gonna transfer my funds into tos for the 90 day period.\n\nUPDATE: Sarah from robinhood just email’d me, I have an actual day trade call amount of $3,125.\n\nSo yeah. Fuck robinhood",
        "created_utc": 1595608698,
        "id": "fz3tat4",
        "score": 344,
        "subreddit": "wallstreetbets",
        "created": 1595637498.0
    },
    {
        "author": "ohmy420",
        "body": "Since that should have been obvious, then logically it should be very obvious what the big gainers of the next 2 months should be. So, what are they?",
        "created_utc": 1594608375,
        "id": "fxw4pi9",
        "score": 342,
        "subreddit": "investing",
        "created": 1594637175.0
    },
    {
        "author": "Twizzar",
        "body": "I know it was perfect chance for a pump!",
        "created_utc": 1594845358,
        "id": "fy6kwc2",
        "score": 338,
        "subreddit": "wallstreetbets",
        "created": 1594874158.0
    },
    {
        "author": "draw2discard2",
        "body": "I find that losing money is really helpful with this issue. When I am gaining I want to look all the time, but if things suck and there are no actions I plan to take I may ignore it for weeks. Also, I find being in the wilderness without internet for weeks can also help.",
        "created_utc": 1595318528,
        "id": "fyqvnu8",
        "score": 332,
        "subreddit": "stocks",
        "created": 1595347328.0
    },
    {
        "author": "Freeon1",
        "body": "Yea... The thing is.. money is not the only issue\n\nIt takes a insane big toll on your mental health and maybe those around you.\n\nBut hey.. I'mretarded\n\nSo pray for a red day and I'll give out presents",
        "created_utc": 1595696396,
        "id": "fz7lqqw",
        "score": 323,
        "subreddit": "wallstreetbets",
        "created": 1595725196.0
    },
    {
        "author": "humdrumoflife",
        "body": "So you put in 47k and still have 66.8k, what are you crying about exactly?\n\nStop making crazy trades and calm it down.",
        "created_utc": 1595547037,
        "id": "fz19a7q",
        "score": 323,
        "subreddit": "wallstreetbets",
        "created": 1595575837.0
    },
    {
        "author": "UBCStudent9929",
        "body": "its quite literally the memeiest of the meme stocks, which is exactly why I won't bet against it. Will it eventually crash, burn and get completely disintegrated? Yea sure. But they are also backed by retard strength, and could keep upright for another half a year, and with the current price to short/IV its trading at its just isn't worth it.\n\nTheres much better targets imo, like SHOP",
        "created_utc": 1595342778,
        "id": "fyrpzae",
        "score": 323,
        "subreddit": "wallstreetbets",
        "created": 1595371578.0
    },
    {
        "author": "Amigo_del_Cartel",
        "body": "Everybody knows this but people are in it to make money, not to be right.",
        "created_utc": 1595580912,
        "id": "fz2n7dx",
        "score": 312,
        "subreddit": "wallstreetbets",
        "created": 1595609712.0
    },
    {
        "author": "nealyart179",
        "body": "Thank you for that. I like your organization as well. It was pleasant to read.",
        "created_utc": 1595175316,
        "id": "fykiatx",
        "score": 302,
        "subreddit": "options",
        "created": 1595204116.0
    },
    {
        "author": "q234qrfa4wa4awtraw",
        "body": "The threat is to ban you from trading on RH for 90 days.\n\nThat's like slapping the pipe out of a crack addict's hand, and it shattering on the ground.\n\nCan you get another pipe?  Yeah, but what are you going to do in the meantime?!",
        "created_utc": 1595612853,
        "id": "fz428m5",
        "score": 300,
        "subreddit": "wallstreetbets",
        "created": 1595641653.0
    },
    {
        "author": "Guerrito69",
        "body": "Bought it when it was 12.80 but only bought 1 stock.  Rookie college mistake 🤦🏻‍♂️",
        "created_utc": 1595448960,
        "id": "fywpy7c",
        "score": 295,
        "subreddit": "RobinHood",
        "created": 1595477760.0
    },
    {
        "author": "longGERN",
        "body": "I owned amd at $15 in 2018 and sold at $18. Bought HEAR at $32, kept it in my portfolio this year because I enjoyed the 2 year landslide of pain, then sold this yr at $5",
        "created_utc": 1595629073,
        "id": "fz4zi1o",
        "score": 295,
        "subreddit": "wallstreetbets",
        "created": 1595657873.0
    },
    {
        "author": "averagerobotboi",
        "body": "I'm swimming in it!",
        "created_utc": 1595593124,
        "id": "fz30kgp",
        "score": 283,
        "subreddit": "wallstreetbets",
        "created": 1595621924.0
    },
    {
        "author": "damanamathos",
        "body": "I doubt it, most companies in this space are still private.",
        "created_utc": 1595164584,
        "id": "fyk0ij7",
        "score": 279,
        "subreddit": "investing",
        "created": 1595193384.0
    },
    {
        "author": "Okmanl",
        "body": "Or you have to adopt a ruthless persona when you're the CEO of a company. \"Many say you don't have to be ruthless to do well in business.\n\nBut, honestly, if the bottom line is your yardstick, it helps. A lot.\n\nSure, you want to be inspiring your team, sure you need to have empathy, but you also constantly need to be getting rid of fat, driving and demanding, always fighting for the business and putting it first.\n\n**I mean, you need to be pretty ruthless to fire a weak performer you know well who desperately needs their job. But if you don't, you drag down the team and/or the work just doesn't get done right. Sure, you try to make it work, but what if you can't? It's tough, and many just can't pull that trigger.**\n\nIt’s very easy to make excuses for that employee, especially if the business is making a ton of money. But the most successful CEOs will just do it.\"",
        "created_utc": 1594530943,
        "id": "fxsvump",
        "score": 277,
        "subreddit": "stocks",
        "created": 1594559743.0
    },
    {
        "author": "billwaters",
        "body": "Sir please stop going through my post history I'm already fucked as it is",
        "created_utc": 1595387238,
        "id": "fyu3buq",
        "score": 276,
        "subreddit": "wallstreetbets",
        "created": 1595416038.0
    },
    {
        "author": "dmx442",
        "body": "They could have made much much more by placing puts and tweeting some dumb shit like \"closing factories for the next month because I feel like it\". Idiots",
        "created_utc": 1594847771,
        "id": "fy6pv62",
        "score": 274,
        "subreddit": "investing",
        "created": 1594876571.0
    },
    {
        "author": "Qwertyforu",
        "body": "And I thought it was too expensive at 300 😭",
        "created_utc": 1595450008,
        "id": "fyws8nk",
        "score": 274,
        "subreddit": "stocks",
        "created": 1595478808.0
    },
    {
        "author": "jcarmona24",
        "body": "yeah I read that it was over [$93k](https://blockchair.com/bitcoin/address/bc1qxy2kgdygjrsqtzq2n0yrf2493p83kkfjhx0wlh).  What a brilliant way to get $$ if you can hack Elon and safely get away with it.\n\nedit: also if they lowered the price on Elon's from $1k to like $100 I bet they would've made a lot more.  $57.4k was the peak I saw the account at.  Now at $49k so assuming hackers are moving BTC now.  \n\nedit 2:  NVM they are hacking a LOT more accounts. Uber and Kanye just got hit. Account up to $90k",
        "created_utc": 1594845659,
        "id": "fy6lidv",
        "score": 271,
        "subreddit": "investing",
        "created": 1594874459.0
    },
    {
        "author": "martinvandepas",
        "body": "For 8 years, I worked at Intel as an electrical engineer designing circuits for the future manufacturing processes that Intel would be releasing 2-4 years into the future. There are literally thousands of MS and PhD engineers working on the myriad of challenges involved in making better computer chips. All the way from the design of the manufacturing tools, the amount of NAND gates in a library, the modeling and forecasting of dozens of transistor parameters, writing and supporting the simulation tools, to what I was doing designing and testing: analog circuits in a not yet stable manufacturing process. And hundreds of other challenges that each had teams from a few to a few dozen engineers trying to solve them. It's an insanely complex task. Most engineers working on any of these tasks are so specialized that they don't have any idea how to do the job of the engineers sitting a few aisles over. These engineers are 5-9 management layers below the CEO. Other companies operate the same way, it's just how chip design is done. \n\nIntel's main advantage over the last few decades was that it continuously had the most advanced manufacturing process, maintaining a 1-2 year lead over its closest competitors. However over the last ten years, TSMC has caught up and now overtaken Intel. This is mostly due to Intel's engineering struggles with it's last few manufacturing processes. These things spend half a decade in planning and development. Decisions were made years ago that they are now stuck with. \n\nYour points are all about top level management and I'm sure there's some truth to how important the CEO's decisions are, but I think Intel's current problems are primarily engineering problems with the manufacturing process. I sincerely doubt it's for lack of investment by CEOs. I think it's more likely that TSMC had better engineering talent and was able to do things more creatively that ended up wildly successful.  And surely some luck there too.\n\nAMD has been doing well with their architectures recently and they should get credit for that, but their architectures were always quite good, the thing holding them back was their process and what had been a disadvantage, with TSMC, is now a huge advantage. They are poised to take market share, but they mostly have TSMC to thank for that.",
        "created_utc": 1595777052,
        "id": "fzb3mtw",
        "score": 263,
        "subreddit": "investing",
        "created": 1595805852.0
    },
    {
        "author": "reggiemt",
        "body": "This story has popped up 10 times in my life this past month and I'd never heard it before that. Guess it's having its day",
        "created_utc": 1595911481,
        "id": "fzhdt3e",
        "score": 262,
        "subreddit": "wallstreetbets",
        "created": 1595940281.0
    },
    {
        "author": "rich000",
        "body": "That often doesn't work in practice.\n\nSuppose you have the highest pay in the industry.  You spend $1B researching 500 different formulas for batteries.  Any of them is simple enough that anybody could memorize them.  It turns out that 499 of them are duds, but 1 of them is a significant improvement.\n\nHere is the problem - that formula is something that dozens of employees at least end up knowing.  It cost the company $1B to obtain that formula - not so much to obtain the formula but to figure out that this is the one worth putting in the product.\n\nNow some other company can just offer one of those dozen employees $1M as a signing bonus and they get a $1B secret.  So, pay them all $10M a year!  Well, now the company can offer $100M and STILL get a $1B secret.  \n\nAnd it wasn't like any of those dozen employees \"discovered\" that formula due to their ingenuity and deserve all the money personally.  Maybe those 500 formulas are just all random tweaks of a common formula, and it was purely trial and error that lead to the right formula.  ANYBODY who did the work would have discovered it - the company just had to assign the testing to 100 scientists testing 5 formulas each at great expense, and one got lucky, purely because they were lucky.\n\nWhile I agree that companies should pay employees well to retain them, that doesn't mean that this is a substitute for IP law.  If you make the cheapest approach to R&amp;D to let somebody else do the work and then just poach their employees for a bit more, then nobody will do R&amp;D, and all of those employees will end up unemployed.\n\nDon't get me wrong - I think that plenty of employees are underpaid or not given sufficient bonuses for their creative discoveries.  However, the person who pulls the ball out of the lottery machine shouldn't get a cut of the jackpot every time somebody wins just for being the person who drew the ball.",
        "created_utc": 1595551490,
        "id": "fz1hgjc",
        "score": 261,
        "subreddit": "investing",
        "created": 1595580290.0
    },
    {
        "author": "ForgotUsername0909",
        "body": "&gt;Seconds later I realized it means 10 million dollars\n\n20 million.",
        "created_utc": 1595903869,
        "id": "fzh20nt",
        "score": 261,
        "subreddit": "wallstreetbets",
        "created": 1595932669.0
    },
    {
        "author": "LkMMoDC",
        "body": "Considering he's doing it for this sub it should be considered charitable. Like donating to a special needs school.",
        "created_utc": 1594829068,
        "id": "fy5mcc3",
        "score": 260,
        "subreddit": "wallstreetbets",
        "created": 1594857868.0
    },
    {
        "author": "XaroDuckSauce",
        "body": "Dont think too hard about this, they decided the best way to show percent gains is (account value-Initial investment)/Initial investment. Then they decided that in order to stop deposits from looking like gains, and withdrawals to stop looking like losses, is to adjust initial investment instead of account value.\n\nOn my schwab i deposited 7k, and it shows me up 7k this week. I think RH does it better.",
        "created_utc": 1595348519,
        "id": "fys1bkd",
        "score": 260,
        "subreddit": "wallstreetbets",
        "created": 1595377319.0
    },
    {
        "author": "Imadethisforsatmemes",
        "body": "I bought more. If I'm gonna watch a ship sink, it better be the fucking titanic 💎🖐",
        "created_utc": 1595278185,
        "id": "fyp3upv",
        "score": 258,
        "subreddit": "wallstreetbets",
        "created": 1595306985.0
    },
    {
        "author": "thereapercomesforall",
        "body": "Completely agree. Change your mindset, change your strategy. I usually follow rules (admittedly taken from a [discord](https://discord.com/invite/zCRns4w) group I'm in):\n\n1) I usually only trade Monday, Tuesday, Wednesday/ Thursday EOD/Friday EOD \n\n2) I only play sectors I am confident in \n\n3) If i see something that looks truly unusual (ie: I don't know this ticker, why is it have such high volume, let's look at the bids, let's look at its option history, let's see what on twitter/stocktwits is being said about that) at the morning/lunch/EOD, I may trade it. A great example of this is Friday contacts a month ago on INO, which netted over 1000% when all was said and done. \n\n4) History and flow is most important. If I have been trading for a while and the market is topsy-turvy, I know when an alert comes in (and I check the history), I may be in for a quick intraday play. If things seem slowly growing, longer out, I know to play longer, directionally. \n\n5) Don't FOMO ever \n\n6) If you have a smaller account limit your exposure. Bigger accounts can make winners run longer, and take more losses. \n\n7) News is most important. An alert is often proceeded by a flurry of news in most tickers. Figure out what that news is. If you can't find anything, could potentially ignore. \n\n8) If you are having a bad day, don't make it worse by revenge trading. A whale alert are usually quite OTM, capturing direction. You will get greedy and lose momentum if you are chasing. \n\n9) Figure out your trading style and stick to that schedule \n\nEdit: Spacing",
        "created_utc": 1595280961,
        "id": "fyp9i24",
        "score": 257,
        "subreddit": "pennystocks",
        "created": 1595309761.0
    },
    {
        "author": "WowSuchBao",
        "body": "*we print it digitally*",
        "created_utc": 1595483667,
        "id": "fyyd47i",
        "score": 255,
        "subreddit": "wallstreetbets",
        "created": 1595512467.0
    },
    {
        "author": "Tr4n0n",
        "body": "Lose it all on some dumb ass calls that I shouldnt be making. Already down to 5.5k in my account😉, currently in azn 65c for 21/8 though, should be good. May also go all out on tesla 3500c 24/7 for earnings yolo",
        "created_utc": 1595195049,
        "id": "fylj6rx",
        "score": 254,
        "subreddit": "wallstreetbets",
        "created": 1595223849.0
    },
    {
        "author": "NoDevelopment6321",
        "body": "Maybe you need a hobby? Seems like trading is your \"job\" but you do it somewhat constantly. Maybe clock out and get into a hobby.",
        "created_utc": 1595513581,
        "id": "fyzcadn",
        "score": 251,
        "subreddit": "StockMarket",
        "created": 1595542381.0
    },
    {
        "author": "placebotwo",
        "body": "Windows XP, call it by name you uncouth swine.",
        "created_utc": 1595515655,
        "id": "fyzg4cp",
        "score": 250,
        "subreddit": "wallstreetbets",
        "created": 1595544455.0
    },
    {
        "author": "cloud9flyerr",
        "body": "I sold at 9:31 for a loss and watched it go right up. Good play fuck you",
        "created_utc": 1594735858,
        "id": "fy1d8gk",
        "score": 250,
        "subreddit": "wallstreetbets",
        "created": 1594764658.0
    },
    {
        "author": "Frostfright",
        "body": "dude they cant MAKE you pay it back\n\nwhat are they gonna do, threaten you? lol.",
        "created_utc": 1595608360,
        "id": "fz3sl31",
        "score": 248,
        "subreddit": "wallstreetbets",
        "created": 1595637160.0
    },
    {
        "author": "LeliaAustin",
        "body": "He started making some money and then instantly took on debt, locking in high expenses so that he'd immediately begin bleeding out his net worth the moment his income decreased - even if it remained elevated.\n\nWhich is what 99% of everyone does.   If you are clearing 30 grand a month, why not wait a few months and buy a car in cash.  No, you immediately finance the most expensive car you can find for 7 years, so that you'll carry the debt over to some period when your income decreases - great thinking champ!\n\nThe amount of debt I carry is none.  Which doesn't make me rich, it just means, I've decided I crash and burn at 0, instead of -657K.\n\nAnd I crash and burn at 0 frequently and it feels exactly the same except I don't lose my car.",
        "created_utc": 1595780513,
        "id": "fzbaaq4",
        "score": 241,
        "subreddit": "wallstreetbets",
        "created": 1595809313.0
    },
    {
        "author": "bigdopa1",
        "body": "1) congrats, it’s a great feeling when it all starts coming together\n\n2) your gf will never care\n\n3) that’s okay though. That’s life",
        "created_utc": 1595300750,
        "id": "fyq965t",
        "score": 237,
        "subreddit": "stocks",
        "created": 1595329550.0
    },
    {
        "author": "ShinoPrime987",
        "body": "How quickly people forget what happened to AIG and all its investors. AIG was seen as too big to fail. Oh it failed. 100k$ back at their height is worth like what 2k$ now?\n\nAll credit to Warren Buffet for doing what he has done, but selling stocks is a very important part of investing. Don't take everything he says as gospel. This quote is very clearly being spoken in hyperbole. Warren just recently sold billions in airline stock.",
        "created_utc": 1594853306,
        "id": "fy70tk2",
        "score": 236,
        "subreddit": "investing",
        "created": 1594882106.0
    },
    {
        "author": "PeterMichaelPaints",
        "body": "Hey man, I don't touch TSLA because I don't understand it - but if you're making money I'm happy for you.\n\nCongrats.",
        "created_utc": 1595457353,
        "id": "fyx6kxf",
        "score": 236,
        "subreddit": "wallstreetbets",
        "created": 1595486153.0
    },
    {
        "author": "drsunnyday",
        "body": "So in the short term these lower continuing numbers seem to be good for the economy but it is important to remember that some of these continuing claims are not ending due to people finding work. Many of them are like where I will be in two weeks where all benefits have run out and I cannot claim unemployment anymore. I thus won’t count as a number but I won’t have money coming in. \n\nThis is going to be very bad for the economy",
        "created_utc": 1595510854,
        "id": "fyz7kry",
        "score": 234,
        "subreddit": "investing",
        "created": 1595539654.0
    },
    {
        "author": "wallstreet_cfa",
        "body": "Open another account in a family members name, use the same 500x margin and buy it instead of shorting. You’ll be right back on track bro. Don’t worry, I lost 90% of my portfolio two weeks ago shorting a stock that got auto liquidated. Made almost all of it back",
        "created_utc": 1595901288,
        "id": "fzgxksu",
        "score": 233,
        "subreddit": "wallstreetbets",
        "created": 1595930088.0
    },
    {
        "author": "GOOPY_CHUTE",
        "body": "Remember, kids: This shit works... until it doesn't.",
        "created_utc": 1595744380,
        "id": "fza1gb0",
        "score": 227,
        "subreddit": "wallstreetbets",
        "created": 1595773180.0
    },
    {
        "author": "Napppy",
        "body": "\"Not everyone will get it.\"  Feel free to downvote the messenger",
        "created_utc": 1595620091,
        "id": "fz4hlb5",
        "score": 226,
        "subreddit": "wallstreetbets",
        "created": 1595648891.0
    },
    {
        "author": "Thanos-Wept",
        "body": "“Let’s just ignore that and  value it more than every other auto company on earth”",
        "created_utc": 1595450580,
        "id": "fywthm7",
        "score": 225,
        "subreddit": "investing",
        "created": 1595479380.0
    },
    {
        "author": "havearedpill",
        "body": "I paid a $15k tax bill with Amazon gift cards to a nice man with a thick Indian accent over the phone. I found it a bit odd, but I guess that's how the IRS works now.",
        "created_utc": 1595378466,
        "id": "fytonuy",
        "score": 224,
        "subreddit": "wallstreetbets",
        "created": 1595407266.0
    },
    {
        "author": "BravewardSweden",
        "body": "His eyes kind of look downcast at the floor as he says, \"Yes, we did, that's another way to think about it.  We did,\" when asked if the printer is actually going \"brrr.\"\n\nThe interviewing is going, \"Say it ain't so, Joe,\" and Jerome is going, \"Yes, kid, I'm afraid it is.\"\n\nLike...yeah, it's all a sham - nothin' we can do about it now.",
        "created_utc": 1595352499,
        "id": "fys9j9i",
        "score": 224,
        "subreddit": "wallstreetbets",
        "created": 1595381299.0
    },
    {
        "author": "likeitis121",
        "body": "That's a junk article really full of speculation trying to push the market higher.\n\nThe author doesn't even approach the subject that the Fed isn't actually allowed to buy stocks.  Janet Yellin even has gone on record saying that, but she also thought that Fed should have that ability, but it would be up to congress.  I think it would be politically toxic in this environment, and very dangerous precedent.  It would basically backstop any widespread speculation, and 100% take any risk out of the stock market, which would lead to runaway valuations, and a massive bubble.  The other part of this is with it going to congress, Democrats uphold one chamber, and they are not going to go down a path that is seen as simply backstopping all those wealthy people in the market, and leading to widespread speculation.  \n\nPeople see recessions as all bad for the stock market, and that's really not true.  During expansions valuations tend to expand much faster than profits and economic activity does.  Recessions force a reset of this.  Not letting it reset means you're going to have the entire market trading at a 100 pe ratio.",
        "created_utc": 1595168733,
        "id": "fyk6pyo",
        "score": 224,
        "subreddit": "StockMarket",
        "created": 1595197533.0
    },
    {
        "author": "kashflowz",
        "body": "Ngl ima do it. Ive spent 3k on worse.",
        "created_utc": 1594753932,
        "id": "fy2e4t1",
        "score": 223,
        "subreddit": "wallstreetbets",
        "created": 1594782732.0
    },
    {
        "author": "Stevie_wonders88",
        "body": "Shows the hackers are not very stock savy.\n\nAll they had to do was have Elon Musk's twitter announce production of certain models to be suspended and 35% of all Teslas needed to be recalled for a huge issue.\n\nBuy puts and profit.\n\n&amp;#x200B;\n\nEDIT: PEople are saying it is easy to track. IT is very hard to prove it in court. Insider trading is very common BECAUSE it is hard to actually prove beyond a reasonable doubt . IMO I would rather go for a risky muli million dollar heist then a $50,000 dollar bitcoin heist.",
        "created_utc": 1594851838,
        "id": "fy6y1e5",
        "score": 221,
        "subreddit": "StockMarket",
        "created": 1594880638.0
    },
    {
        "author": "smasho",
        "body": "So this is a golden opportunity for the dollar, as it were.",
        "created_utc": 1595899386,
        "id": "fzgua50",
        "score": 219,
        "subreddit": "wallstreetbets",
        "created": 1595928186.0
    },
    {
        "author": "UncertainDegen",
        "body": "As a Scientist myself it seems like an asshole move to use your kids as advertisment for your vaccine. Worst case is still that these kids may be more affected by the real Sars-Cov19.",
        "created_utc": 1595179834,
        "id": "fykqr7u",
        "score": 217,
        "subreddit": "wallstreetbets",
        "created": 1595208634.0
    },
    {
        "author": "Waltzer_White18",
        "body": "Can't lose any money Thursday if I lose it all on Tuesday",
        "created_utc": 1595801768,
        "id": "fzcfsbb",
        "score": 216,
        "subreddit": "stocks",
        "created": 1595830568.0
    },
    {
        "author": "TU_NYCE",
        "body": "Wait what... You guys can see what we rename our accounts to? The fuck... My checkings is called retard fund.  \n\n\nNow it all makes sense whenever I speak to customer rep they speak slowly to me",
        "created_utc": 1594927790,
        "id": "fya8iz1",
        "score": 215,
        "subreddit": "wallstreetbets",
        "created": 1594956590.0
    },
    {
        "author": "BrunoRib",
        "body": "Is he going to get it? Because this picture says [Otherwise](https://i.imgur.com/onNdpuF_d.webp?maxwidth=640&amp;shape=thumb&amp;fidelity=medium)",
        "created_utc": 1595372020,
        "id": "fytdgbx",
        "score": 214,
        "subreddit": "wallstreetbets",
        "created": 1595400820.0
    },
    {
        "author": "Its_the_dankness",
        "body": "Boardgame concept: Options Trading - The Game\n\n2-4 players, there is a vertical digital board that holds 50 stocks that move up or down in value each day. Each turn is a trading day or trading week where you can buy hold or sell your options, and each day / week has one or more cards from a deck pulled (\"Trade Talks Going Well, blah blah blah equities rise by X%, blah blah blah equities fall by X%\" or \"ANALysts think this sector is overbought, suggest derisking, Tech Equities fall by X%). Maybe each of the cards has a small microchip that could be inserted into the board to make the prices change automatically.",
        "created_utc": 1594170445,
        "id": "fx9lqpp",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1594199245.0
    },
    {
        "author": "fetusblender666",
        "body": "Microsoft you lil baby back bitch we let bill gates microchip our vaccines for this? 🤦‍♂️",
        "created_utc": 1594733027,
        "id": "fy18dpt",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1594761827.0
    },
    {
        "author": "midwestck",
        "body": "NVDA has sole propriety over all microchip tech. AMD hit's $10,000/share even though they filed chapter 11",
        "created_utc": 1594323687,
        "id": "fxgeqi2",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594352487.0
    },
    {
        "author": "Jaie_E",
        "body": "You have enough money to trade mu and amd. Follow r/amd_stock and the microchip market and I can carve yourself a modest but profitable niche",
        "created_utc": 1594507963,
        "id": "fxrnwzt",
        "score": 2,
        "subreddit": "smallstreetbets",
        "created": 1594536763.0
    },
    {
        "author": "iCan20",
        "body": "vaccine is a hoax to get bill gates microchip to control us so we buy more msft stock",
        "created_utc": 1594816183,
        "id": "fy4yxc8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594844983.0
    },
    {
        "author": "COVID-19Enthusiast",
        "body": "I can only begin to imagine the downstream implications. This would be like discovering oil or inventing the microchip.",
        "created_utc": 1594521345,
        "id": "fxsdwqr",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1594550145.0
    },
    {
        "author": "catgambler",
        "body": "They put a microchip in my fucking back",
        "created_utc": 1595134870,
        "id": "fyj5x96",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1595163670.0
    },
    {
        "author": "jpric155",
        "body": "They also believe bill gates is trying to put a microchip in them via vaccine.",
        "created_utc": 1594818393,
        "id": "fy528hj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594847193.0
    },
    {
        "author": "Dbohnno",
        "body": "My mom just said that Bill Gates is pushing vaccines to microchip everyone as predicted in Revaluation.",
        "created_utc": 1593798523,
        "id": "fwtpq0r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593827323.0
    },
    {
        "author": "_-Meh-",
        "body": "MCHP = 1 \nATVI = 1\nSNE = 1\nMU = 1\nQTUM = 1\nSNAP = 1\nPLUG = 5\nNNVC = 2\nGE = 2\nAMRX = 1\nSWN = 1",
        "created_utc": 1594505269,
        "id": "fxrgdu8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594534069.0
    },
    {
        "author": "GatorMD12",
        "body": "I DARE SOMEONE TO PUMP A MICROCHIP/penny BULLSHIT STOCK!",
        "created_utc": 1593911156,
        "id": "fwygj13",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593939956.0
    },
    {
        "author": "Elderscrolls_",
        "body": "I want to try to make immortality, Or an artificial way of immortality, If you invest we can hire neurologists and computer scientist to reverse engineer a microchip to coexist with the brain and collect memories.(I’ll explain more soon)",
        "created_utc": 1594874068,
        "id": "fy803uo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594902868.0
    },
    {
        "author": "spyVSspy420-69",
        "body": "I am a number on a spreadsheet. I even made some of those spreadsheets. But thinking Gates is trying to microchip you makes you a fucking retard.",
        "created_utc": 1594957522,
        "id": "fybqimx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594986322.0
    },
    {
        "author": "Nurin321",
        "body": "Nah we are not stupid we all know Bill Gates did Corona :| he wants to take AlL ThE OxIGen and MiCrOChIp us °0°",
        "created_utc": 1594321257,
        "id": "fxg9nep",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594350057.0
    },
    {
        "author": "ReadAndReddit123",
        "body": "Anyone else not want a microchip implanted in their brain 🧠 neuralink a little dystopian it’s a no for me dawg",
        "created_utc": 1594282571,
        "id": "fxej43r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594311371.0
    },
    {
        "author": "burdenedworld",
        "body": "From what I read, especially some analysts that I follow via paid subscriptions, many have said to invest in the microchip producing companies.\n\nI've been following all the companies you mentioned via a stock trading app I use and I have to agree with you, the stock price is fairly low at the moment. Once 5g comes on, it'll shoot up massively just like what happened with apple back when iPhone came on the scene.\n\nThat's just my opinion and in no way is that financial advice, so carry on doing your own research too. That's my two cents.",
        "created_utc": 1594508397,
        "id": "fxrpjpb",
        "score": 1,
        "subreddit": "investing",
        "created": 1594537197.0
    },
    {
        "author": "GlutenFreeBuns",
        "body": "They think he wants to microchip us",
        "created_utc": 1594847027,
        "id": "fy6ob7b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594875827.0
    },
    {
        "author": "OptimalVanilla",
        "body": "Maybe, but they have convinced others of hating Gates. I know many people on the Left and right that believe he is going to microchip everyone with the Covid vaccine.",
        "created_utc": 1594568238,
        "id": "fxu4snz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594597038.0
    },
    {
        "author": "LemonChickenPlate",
        "body": "does it come with the microchip like bill gates promised??",
        "created_utc": 1594620993,
        "id": "fxwll9z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594649793.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "https://www.nytimes.com/2020/07/01/world/asia/taiwan-china-hong-kong.html\n\nThis, coupled with the CEO of MSI “falling” off of a 7 story building, seems very troubling. \n\nI wouldn’t hold AMD leaps folks. I wouldn’t have said that a month ago. Fuck China.",
        "created_utc": 1594255801,
        "id": "fxdh8s9",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1594284601.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "I’m going to reiterate my [MRK](https://www.reddit.com/r/wallstreetbets/comments/hkpyve/weekend_discussion_thread_for_the_weekend_of_july/fww5ouh/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) comment with some additional research. \n\nFirst off, there’s currently a huge [shortage ](https://www.cnbc.com/2020/07/06/more-than-70-countries-at-risk-of-running-out-of-hiv-drugs-due-to-coronavirus-pandemic-who-says.html) of HIV meds where basically what happened is part supply chain disrupt, but also the two drugs they were using proved to be ineffective for HIV patients because of covid. Something about them is no longer working. \n\nSecondly, MRK’s press release for their phase 3 trial of [Islatravir](https://www.cnbc.com/2020/07/06/more-than-70-countries-at-risk-of-running-out-of-hiv-drugs-due-to-coronavirus-pandemic-who-says.html) is set to begin soon after their presentation at the AIDS 2020 virtual divulging that the Phase 2b results proved that their drug has higher efficacy and safety from the analyses. \n\nThirdly, MRK has a proven track record for putting up great [earnings](https://finance.yahoo.com/news/why-earnings-surprise-streak-could-161004767.html), and most analysts are bullish already about them for their earnings coming out 7/31. And will be even more so in the near future thanks to their EIDD-2801 exclusive rights from RidgeBack Therapeutics for an antiviral for covid until others produce a sustainable vaccine, and more so because they’ll likely make up the shortage for HIV meds with current meds and their upcoming Islatravir. \n\nFuthermore, MRK just got [FDA approval](https://www.mrknewsroom.com/newsroom/news-releases/news-details/2020/FDA-Approves-Mercks-KEYTRUDA-pembrolizumab-for-First-Line-Treatment-of-Patients-With-Unresectable-or-Metastatic-MSI-H-or-dMMR-Colorectal-Cancer/default.aspx) to use Keytruda for first-line colon cancer. Which will only drive their earnings. \n\nUnfortunately I can’t share the seeking A article, but it goes into further detail about why antivirals will be very important in the coming months since vaccines are still projected to be at least 6 months out, if not longer. If you want to see the SA article just google “Antivirals Rather Than Vaccines for COVID-19”\n\nAlso, the EIDD-2801 candidate they have rights to from RidgeBack is currently in quite a few trials, but one of the more pertinent one is in South Africa where they’re needing 50 HIV positive people to see if it can help prevent covid in them, but also they’re secretly hoping by sheer luck that the same drug can help manage HIV at the same time it prevents covid. \n\nSticking with my originals 7/31 $85-$90c, and 10/16 $90-$95, but I’ll also add 1/21 $100-$105c since there are many analysts setting $100+ fair values for eoy.\n\nEdit: TL;DR— MRK $85+ calls cause they make the good drugs for bad things and it make printer go brrrrrrrr.",
        "created_utc": 1594172562,
        "id": "fx9pas2",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594201362.0
    },
    {
        "author": "xesus2021",
        "body": "I recall, it was 2008. \n\nYou could go to BEST BUY and get a Motorola C168i, in a circular clamshell package.   It was a $15 dollar cellphone, that is what it cost, $15.\n\nIt also came with $10 of airtime, and thus, the phone itself only ended up costing $5. \n\n=== ==== ===== \n\nI bought at least three dozen of those things.",
        "created_utc": 1594788519,
        "id": "fy44ceb",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594817319.0
    },
    {
        "author": "FelWill",
        "body": "I'm jacked to the tits on boomer stocks. MSI, NOK, FLIR, RTX, C, BRK.B, BP, RDS.B, HSBC",
        "created_utc": 1594830435,
        "id": "fy5p7zy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594859235.0
    },
    {
        "author": "Extension-appeal",
        "body": "Samsung Kawasaki toyota Motorola",
        "created_utc": 1595211488,
        "id": "fymbdt8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595240288.0
    },
    {
        "author": "demnutz6666",
        "body": "Motorola cheapskate reporting",
        "created_utc": 1593637523,
        "id": "fwmj88b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593666323.0
    },
    {
        "author": "stanky_puss",
        "body": "$MSI calls will bring tendies to any autist who buys them",
        "created_utc": 1595602487,
        "id": "fz3gijd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595631287.0
    },
    {
        "author": "HeAbides",
        "body": "CPU: Intel i5-4970k\nMOBO: Asus z97 pro\nRAM: Corsair 64GB ddr4\nGFX: MSI GTX 1080 12gb\nInstalling to a few month old Samsung EVO 860",
        "created_utc": 1593994718,
        "id": "fx1tzr2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594023518.0
    },
    {
        "author": "Estate4reaL",
        "body": "I used to think that motorola and blackberry were very very good at making phones..",
        "created_utc": 1593678098,
        "id": "fwobvwi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593706898.0
    },
    {
        "author": "CallinCthulhu",
        "body": "Conveniently forgot to mention Samsung, LG, and Motorola.\n\nApple only has 20% market share.\n\nShit example",
        "created_utc": 1594097547,
        "id": "fx6c9e4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594126347.0
    },
    {
        "author": "zerooneinfinity",
        "body": "People said the same about blackberry, motorola, nokia. It's all about what's cool and those companies are going the way of the dodo bird. I own a Toyota, and love the service. But I'm not even thinking about buying another. Tesla is just way cooler for not much more.",
        "created_utc": 1593798868,
        "id": "fwtqdyc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593827668.0
    },
    {
        "author": "40034243",
        "body": "Everyone loved Motorola. Everyone loved Nokia’s. It’s going to change. Something big is going to happen.",
        "created_utc": 1594998002,
        "id": "fyd5row",
        "score": 1,
        "subreddit": "investing",
        "created": 1595026802.0
    },
    {
        "author": "0ddb4l1",
        "body": "that's great. Show me how Motorola and Nokia built a platform anything like Apple in terms of revenue streams. Even with a decrease in iPhone sales, Apple is positioned well. And if you don't think they're looking to acquire and continue to expand their offerings you're delusional.\n\nYou're just assuming something has to change because of those past failures. You made no point to my post other than 'something big is going to happen' backed by nothing.",
        "created_utc": 1594998296,
        "id": "fyd6ckt",
        "score": 1,
        "subreddit": "investing",
        "created": 1595027096.0
    },
    {
        "author": "BloodMossHunter",
        "body": "can anyone look into MSI and tell us why it keeps dropping over the last xx months? It had huge highs, it beats earnings IIRC but it is on downward slope. The chart looks like its consolidating.",
        "created_utc": 1594458786,
        "id": "fxn3hak",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594487586.0
    },
    {
        "author": "soap808s",
        "body": "Anyone who knows this industry... if Huawei is banned  - could they essentially buy out another US cell company (Nokia, Motorola) so they continue to be in business here?",
        "created_utc": 1594307667,
        "id": "fxfgx5q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594336467.0
    },
    {
        "author": "desice",
        "body": "Um.. what? When the smart phone came out, did we see a similar thing? Two decades later,, where is Nokia, Ericsson, Motorola, LG? FOH",
        "created_utc": 1594351572,
        "id": "fxhu3xn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594380372.0
    },
    {
        "author": "mammaryglands",
        "body": "A Motorola with a cracked up screen",
        "created_utc": 1594777243,
        "id": "fy3mk2z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594806043.0
    },
    {
        "author": "makesalotofpancakes",
        "body": "MSI Stealthbook. Amazing performance/cost/size balance. Most importantly, they run cooler than Razer.",
        "created_utc": 1593796389,
        "id": "fwtlk85",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593825189.0
    },
    {
        "author": "daevas_dantanian",
        "body": "You'd think they would have learned from Motorola.",
        "created_utc": 1593818128,
        "id": "fwup7pz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593846928.0
    },
    {
        "author": "whatifitried",
        "body": "&gt;If you think F, GM, Toyota, and every other major car company don’t have a plan to fully integrate EV once the consumer is actually READY for it, you’re insane.\n\nI think they have plans for that.\n\nI also think those plans will fail for all but one of those companies.  Blackberry had plans, Motorola had plans.\n\nDisruption really hits incumbents hard, and they do not have the proper leadership in place at any level to change the way the company works in such a profound way.",
        "created_utc": 1594650369,
        "id": "fxxjx8p",
        "score": 1,
        "subreddit": "investing",
        "created": 1594679169.0
    },
    {
        "author": "michaelwriting",
        "body": "I can't imagine any demand for $25k+ seasonal luxury motorcycles under current circumstances either.\n\nHOG just shed 700 jobs last week and the stock is still hanging around, even uptrending.\n\nThe market does not always mirror reality. Funny you should mention MOT/MSI. I worked there when the dot com bubble bursted.",
        "created_utc": 1594679138,
        "id": "fxz6n9d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594707938.0
    },
    {
        "author": "michaelwriting",
        "body": "Back at the day, all the MOT/MSI news was focused on the consumer cell phone market flinging up and down. But their hidden cash cow was in their government contract projects.",
        "created_utc": 1594679661,
        "id": "fxz7ncr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594708461.0
    },
    {
        "author": "stanky_puss",
        "body": "Sold my 8/21 MSI $140 calls at yesterday’s top and rolled into $150 and $155 calls as well as doubling up on $160 calls (all 8/21 expiry). Wish me luck, boys",
        "created_utc": 1595602005,
        "id": "fz3fk50",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595630805.0
    },
    {
        "author": "Mojeaux18",
        "body": "CEOs can make a hell of a difference.  \nJack Welch of GE retired. Immelt sunk it.  \nBob Galvin of Motorola retired, years of struggle and his son Chris sank it. \n\nRegarding selling of stock the argument is that his paper wealth is not cash.  \nAnd you argue that even 4b is more than 1000 lifetimes but that’s false.  1000 lifetimes like you and I.  But as your expense goes up things get more complicated.  We buy a house it’s complicated.  We buy 10 houses it’s more than 10 times complicated and you need to hire managers.  Hire 10 managers and you have even more complications.  And so on.",
        "created_utc": 1593989211,
        "id": "fx1kezt",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1594018011.0
    },
    {
        "author": "40034243",
        "body": "The younger generation liked Nokia. They liked Motorola. Everything changes.",
        "created_utc": 1594998035,
        "id": "fyd5u3h",
        "score": 1,
        "subreddit": "investing",
        "created": 1595026835.0
    },
    {
        "author": "project21124",
        "body": "MSI has much better laptops for the same or lesser price",
        "created_utc": 1594767692,
        "id": "fy3630m",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594796492.0
    },
    {
        "author": "stanky_puss",
        "body": "MSI calls 8/21 $140 strike",
        "created_utc": 1594603278,
        "id": "fxvwil8",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594632078.0
    },
    {
        "author": "FactualNeutronStar",
        "body": "You don't know what you're talking about. Not car batteries, batteries. Like Powerwall. Like the 129 MWh battery farm in Australia. The farm in Australia alone made Tesla tens of millions - imagine that scaled up across the globe. With renewables like solar and wind coming to dominate electricity generation, utility-scale batteries will be necessary to store that electricity. That business alone will be worth billions. \n\nVehicle to grid is similar but much more decentralized. People can plug in their vehicle and earn some extra cash simply to use their car as energy storage. Same with robotaxis. Tesla can skim off the top and still outcompete Uber/Lyft with no labor cost. \n\nYes a lot of these come from the same product but that's *exactly why* Tesla is worth so much. What you're essentially doing is treating an iPhone the same as a Motorola flip phone. Yes they both make calls. But an iPhone has tons of other services in the form of software that make it worth far more than any flip phone.",
        "created_utc": 1595469665,
        "id": "fyxsip9",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1595498465.0
    },
    {
        "author": "Tiaan",
        "body": "I moved out of vanguard a while ago because of their outdated UI and no 2FA option that wasn't SMS based. I can't imagine how a huge financial firm still offers SMS based 2fA without realizing how huge of a security flaw it is with sim swapping. At least fidelity and Schwab offer an authenticator-like app with symantec VIP. Vanguard has been behind on the times for a while now and shows no signs of getting with it.\n\nWith all of the great brokerage account options out there, there's very little reason to use Vanguard. Don't get me wrong, I love the Vanguard funds, but you can access all of their ETFs in many other platforms. For example, you can literally buy fractional shares of Vanguard ETFs in Fidelity for no extra cost at the same expense ratio as you get in Vanguard. That's something that you can't even do in Vanguard itself!",
        "created_utc": 1595273496,
        "id": "fyouani",
        "score": 15,
        "subreddit": "investing",
        "created": 1595302296.0
    },
    {
        "author": "ryit29",
        "body": "Anyone that likes Cloudflare should be forced to install Norton Antivirus because that's what it feels like going to a Cloudflare protected website",
        "created_utc": 1595021562,
        "id": "fyehqjq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595050362.0
    },
    {
        "author": "InformationDispenser",
        "body": "Look at NLOK stock when it gave a $12 dividend. The stock went down about $12. Investors didn't lose money but they didn't gain any either.",
        "created_utc": 1595438180,
        "id": "fyw2pfb",
        "score": 2,
        "subreddit": "investing",
        "created": 1595466980.0
    },
    {
        "author": "nokstar",
        "body": "Lots of celebs do it.\n\nElon, Steve Carrell, Charlie Sheen, Tommy Lee Jones, John Travolta, Edward Norton, Sean Penn, Al Pacino, the list goes on. \n\nIt makes sense, as a celebrity your income may hinge on your appearance. Not saying it's morally correct, but it gets results.\n\nhttps://www.styleitfit.com/celebrity-hair-transplants/",
        "created_utc": 1594396405,
        "id": "fxjhzsj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594425205.0
    },
    {
        "author": "BrightEyes2150",
        "body": "You are right.  There was definitely bad decision making by the CEO like using AVG anti virus free version and using a Symantec firewall.",
        "created_utc": 1593873755,
        "id": "fwwndvs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593902555.0
    },
    {
        "author": "Lewis2203",
        "body": "Baill is gifford US, chelverton UK growth, Scottish mortgage, Legg mason japan, Baillie gifford emerging markets, Fundsmith, Lindsell train, shippon Norton, Edinburgh worldwide\n\nAll these funds have outperformed in the long run, consistently.",
        "created_utc": 1594909473,
        "id": "fy975pk",
        "score": 1,
        "subreddit": "investing",
        "created": 1594938273.0
    },
    {
        "author": "trololololoooooo",
        "body": "It’s a solid company and the definite leader in endpoint security. They’re facing some increasing competition, mostly by Microsoft with their defender ATP tool that’s included in some of their enterprise license bundles for M365. \n\nThat said the space is still saturated with companies using legacy endpoint security vendors like Symantec and mcafee. Those companies will likely be shifting over to Defender ATP or crowdstrike in the near future (1-3 years, most license agreements for enterprise security tools are at max 3 years or 5 if the company capitalized hardware along with it). \n\nAnother factor, as companies continue going to the cloud for their needs, that will also be a forcing factor away from legacy on premise security solutions. \n\nAlso, the threat environment is driving companies to shift away from legacy solutions to crowdstrike and others. Their recent marketing play is in the antiransomware space, a threat which they are very effective at stopping. \n\nTLDR: CRWD has a lot of runway for growth, some competition heating up; for the foreseeable future it will continue growing at breakneck speed due to increasing needs for a variety of reasons, and an evolving cyber threat landscape.",
        "created_utc": 1594578199,
        "id": "fxunvwy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594606999.0
    },
    {
        "author": "ThatsMyPurse69",
        "body": "Mostly a bunch of random names that I’m familiar with. SVMK, SKT, CHNG, GAN, CBOE\n\nalso some FD’s on meme stocks I bought today, PTON, SNAP, TWTR \n\nPuts on weak names that tend to dump hard. NLOK, LYFT",
        "created_utc": 1594941029,
        "id": "fyaz1tf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594969829.0
    },
    {
        "author": "jebronnlamezz",
        "body": "Norton life lock stock c",
        "created_utc": 1594777936,
        "id": "fy3nqgb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594806736.0
    },
    {
        "author": "kileek",
        "body": "Here is the article:  \n\n&amp;#x200B;\n\nAn Ontario government task force is calling for the province’s securities regulator to be dramatically transformed, proposing an independent tribunal to hear cases and a broadened mandate that includes making economic growth a priority.\n\nThe Capital Markets Modernization Task Force, which was launched by the Ministry of Finance in February, has also proposed rules that it hopes will allow smaller, independent investment dealers to better compete against their larger rivals in the banking sector and has urged the government to ban a specific, exploitative type of short-selling.\n\nThe proposals are among 47 recommendations touted as the first wide-scope review of Ontario’s capital markets since 2003. The full list of proposals is scheduled to be released Thursday but is not final; the task force, chaired by Walied Soliman, the Canadian chair of law firm Norton Rose Fulbright, is seeking public comment before it puts forward its final list in the fall.\n\nAmong the more sweeping proposals are major structural reforms to the Ontario Securities Commission, the country’s largest. Currently, the organization is run by about a dozen commissioners who play three roles: setting policy, functioning as a board of directors and adjudicating cases of alleged wrongdoing.\n\nThe task force has called for that system to be dismantled and has proposed creating an entirely new capital markets tribunal – one that would be completely separate from the OSC and report directly to the Minister of Finance. It has also proposed a slightly less drastic option, which would create an adjudicative tribunal within the OSC.\n\nOntario’s securities law stipulates that the roles of OSC chair and chief executive officer be filled by the same person. The report says those roles need to be split, as is expected of the corporations the OSC oversees.\n\n“It was time for the Ontario Securities Commission to evolve to the governance standards that it holds our issuers to across this province,” Mr. Soliman said in an interview.\n\nAnother big-picture proposal is a rejigging of the OSC’s mandate. As it stands, the commission is responsible for enforcing securities laws, but the task force has raised the idea of expanding its mission to include the “fostering of capital formation and competitive capital markets.” Such a move, it said, would “institutionally and culturally” shift the organization to consider economic growth, which would help it reduce “fees and anti-competitive behaviour.”\n\nThe task force has also floated a number of changes that it said will “level the playing field” between smaller, independent market dealers and the behemoths in the banking sector. It has singled out the practice known as “tied selling,” in which banks use preferential interest rates or incentives to compel companies to raise capital through their own affiliates. Although this is already banned by federal banking law, the task force said it heard from dealers and issuers that commercial lenders “continue to engage in these practices.”\n\nThis raises the possibility of forbidding such “exclusivity arrangements” and requiring a senior banking officer to attest that no such bundling deals have been struck. The task force also asked market participants how they would feel if, by law, a specific percentage of all underwriting arrangements across the province were required to be performed by “non-bank-owned investment dealers.”\n\nMr. Soliman said many of these proposals are in response to a decline in the number of smaller investment dealers. He said that when bank dealers were asked about tied selling, they denied offering such incentives – in which case, Mr. Soliman said, the proposed changes won’t affect their business.\n\nHe said the province needs to sustain independent dealers because small companies and entrepreneurs are not able to get an audience with bank dealers. “We would not have had a cannabis capital market in this province if we didn’t have small dealers,” he said. “None of the larger financial institutions were interested in getting involved in cannabis issuers because of cross-border legal issues.”\n\nHis group is also seeking to stamp out a sophisticated financial trick used by some institutional investors, a type of trading that was highlighted in a Globe and Mail report in November on the collapse of the cannabis sector. Hedge funds anticipating a new cannabis deal would short the issuer’s shares before the deal launched, knowing an offering in the works would be available at a discount. They would then cover their positions by purchasing large portions of the financing and, in effect, instantly earn a discount percentage.\n\nThis practice “harms the corporation, its shareholders and the uninformed investors trading against the short sellers,” the task force report states. The report proposes that any market participant that has previously shorted securities of the same type as offered under a prospectus should be forbidden from acquiring those securities under the prospectus.\n\nThe task force has also urged the government to give the OSC new powers to help it collect unpaid fines from market wrongdoers. Similar to changes enacted in British Columbia, it has called for new laws that would allow the regulator to freeze assets in the early stages of an investigation and force fraudsters to pay their OSC fines before they are allowed to renew their driver’s licence or licence plates.",
        "created_utc": 1594321106,
        "id": "fxg9bxo",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1594349906.0
    },
    {
        "author": "eskimohazz",
        "body": "CrowdStrike - they have the best and simplest EPP/EDR solution on the market, and the enterprise endpoint security market is collapsing and it’s not looking good for incumbents like Symantec/Broadcom or McAfee.",
        "created_utc": 1594430242,
        "id": "fxlavst",
        "score": 1,
        "subreddit": "investing",
        "created": 1594459042.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "There is, but it's not the same play as pure cybersecurity companies like Symantec, Crowdstrike, etc. \n  \nThey do provide insights and analytics from the data collected: https://www.splunk.com/en_us/software/enterprise-security.html\n  \nhttps://www.datadoghq.com/blog/announcing-security-monitoring/  \n  \nI personally have used only the app/log monitoring components.  \n  \nPS: Datadog added the security monitoring feature in April in Q2. More upsell :)",
        "created_utc": 1595268890,
        "id": "fyokrar",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595297690.0
    },
    {
        "author": "maxkingusa",
        "body": "I am going to start scaling into PSTG next week if we get a pullback.  I start my position on Thursday. PSTG has been winning storage deals away from Dell and NetApp.  Cost, Performance, and reliability favor PSTG.",
        "created_utc": 1595121720,
        "id": "fyimvyx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595150520.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  8th of July\n\n\n\n## Upcoming events for Wednesday, July  8th\n\n - Stock splits:\n\n    - GOOLF @ **1:10**\n    - BCNAY @ **9:5** (Payable date: 07/07/2020)\n    - CPPKF @ **1:4**\n    - SNFCA @ **102.5:100** (Payable date: 07/17/2020)\n\n - Expected earnings:\n\n  AIR, BBBY, EXFO, MSM, NTIC, ORMP, SAR, SMPL, TLRD\n\n - Ex-div:\n\n  CVBF, DHF, FLIC, IMKTA, JOUT, KAI, MA, MBT, TSE\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.832%)\n    - Consumer Credit (consensus: -15.50B, previous: -68.78B)\n    - Crude Oil Imports (previous: -0.506M)\n    - Crude Oil Inventories (consensus: -3.114M, previous: -7.195M)\n    - Cushing Crude Oil Inventories (previous: -0.263M)\n    - Distillate Fuel Production (previous: 0.063M)\n    - EIA Refinery Crude Runs  (previous: 0.193M)\n    - EIA Weekly Distillates Stocks (consensus: -0.075M, previous: -0.593M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.9%)\n    - FOMC Member Bostic Speaks\n    - Gasoline Inventories (consensus: -0.002M, previous: 1.199M)\n    - Gasoline Production (previous: 0.111M)\n    - Heating Oil Stockpiles (previous: -0.564M)\n    - MBA 30-Year Mortgage Rate (previous: 3.29%)\n    - MBA Mortgage Applications (previous: -1.8%)\n    - Mortgage Market Index (previous: 758.9)\n    - Seevol Cushing Storage Report (previous: -1.637M)\n    - Thomson Reuters IPSOS PCSI (previous: 48.78)\n\n## Upcoming events for Thursday, July  9th\n\n - Expected earnings:\n\n  AZZ, DAL, FC, HELE, JILL, MTA, SLP, WBA, WDFC\n\n - Ex-div:\n\n  AFB, BRC, BTI, CIO, CULP, EBF, GIS, GNTX, INTU, KIO, LEN, LEN.B, LNC, LOAN, MAS, NTAP, NYT, OGE, PKBK, PPR, RCII, SPG, T, TD, TLK, TOL, UDR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.450%)\n    - 4-Week Bill Auction (previous: 0.115%)\n    - 8-Week Bill Auction (previous: 0.135%)\n    - Continuing Jobless Claims (consensus: 18,950K, previous: 19,290K)\n    - Initial Jobless Claims (consensus: 1,375K, previous: 1,427K)\n    - Jobless Claims 4-Week Avg. (previous: 1,503.75K)\n    - Natural Gas Storage (previous: 65B)\n    - Wholesale Inventories (consensus: -1.2%, previous: 0.3%)\n    - Wholesale Trade Sales (consensus: -4.0%, previous: -16.9%)\n\n## Upcoming events for Friday, July 10th\n\n - Expected earnings:\n\n  GBX, INFY, SJR\n\n - Ex-div:\n\n  ACV, AFIN, AIO, CBH, CCD, CGO, CHI, CHW, CLI, CPZ, CSQ, ECC, EFL, EHT, EIC, EVF, GNL, GROW, HPF, HPI, HPS, HRL, HTD, LGI, MRVL, NCV, NCZ, OZK, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RDY, UVV, VGI, WDR, WSBF, ZTR\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 99.0K)\n    - CFTC Copper speculative net positions (previous: 20.6K)\n    - CFTC Corn speculative net positions (previous: -157.4K)\n    - CFTC Crude Oil speculative net positions (previous: 543.8K)\n    - CFTC Gold speculative net positions (previous: 266.7K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 43.8K)\n    - CFTC Natural Gas speculative net positions (previous: -63.4K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -49.6K)\n    - CFTC Silver speculative net positions (previous: 37.6K)\n    - CFTC Soybeans speculative net positions (previous: 122.9K)\n    - CFTC Wheat speculative net positions (previous: -14.6K)\n    - Core PPI (consensus: 0.1%, previous: -0.1%)\n    - Core PPI (consensus: 0.4%, previous: 0.3%)\n    - IEA Monthly Report\n    - PPI (consensus: -0.2%, previous: -0.8%)\n    - PPI (consensus: 0.4%, previous: 0.4%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 185)\n    - U.S. Baker Hughes Total Rig Count (previous: 263)\n    - WASDE Report\n\n^^^^2020-07-08",
        "created_utc": 1594212674,
        "id": "fxb3i7q",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1594241474.0
    },
    {
        "author": "NocNocNoc19",
        "body": "Im not sure how much money you have to start with. Vanguard index funds have been my overall best investment. Voo, VTI, VT. if you dont have enough to buy whole shares of those robin hood offers fractional shares but I have never gone that route so I honestly don't know how good of a thing they are. Other then that do a lot of research. Read a lot. Dont buy and think your going to sell again any time soon. Ive only been actually investing for about 2 years. In that time I have only sold 1 position because I no longer liked the investment long term. Everything else i have bought with the intent to hold for 10+ years baring something extremely unforeseen. I buy a lot of blue chips and companies im somewhat familiar with as well. I work in tech so I own cisco, palo alto, fortinet, netapp because I work with there products a lot. But i probably only own about 30 individual companies and over 50% of my portfolio is in those index funds i mentioned earlier. Is this winning advice, I have no idea but its been working for me.",
        "created_utc": 1594219150,
        "id": "fxbeshq",
        "score": 1,
        "subreddit": "investing_discussion",
        "created": 1594247950.0
    },
    {
        "author": "briannco",
        "body": "NTAP has made several good acquisitions that they have managed to fuck up. Why would this one be any different?",
        "created_utc": 1594685179,
        "id": "fxzhr35",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594713979.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  9th of July\n\n\n\n## Upcoming events for Thursday, July  9th\n\n - Stock splits:\n\n    - IRRZF @ **2:5**\n\n - Expected earnings:\n\n  AZZ, FC, HELE, JILL, MTA, SLP, WBA, WDFC\n\n - Ex-div:\n\n  AFB, BRC, BTI, CIO, CULP, EBF, GIS, GNTX, INTU, KIO, LEN, LEN.B, LNC, LOAN, MAS, NTAP, NYT, OGE, PKBK, PPR, RCII, SPG, T, TD, TLK, TOL, UDR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.450%)\n    - 4-Week Bill Auction (previous: 0.115%)\n    - 8-Week Bill Auction (previous: 0.135%)\n    - Continuing Jobless Claims (consensus: 18,950K, previous: 19,290K)\n    - Initial Jobless Claims (consensus: 1,375K, previous: 1,427K)\n    - Jobless Claims 4-Week Avg. (previous: 1,503.75K)\n    - Natural Gas Storage (consensus: 58B, previous: 65B)\n    - Wholesale Inventories (consensus: -1.2%, previous: 0.3%)\n    - Wholesale Trade Sales (consensus: -4.0%, previous: -16.9%)\n\n## Upcoming events for Friday, July 10th\n\n - Expected earnings:\n\n  GBX, INFY, SJR\n\n - Ex-div:\n\n  ACV, AFIN, AIO, CBH, CCD, CGO, CHI, CHW, CLI, CPZ, CSQ, ECC, EFL, EHT, EIC, EVF, GNL, GROW, HPF, HPI, HPS, HRL, HTD, LGI, MRVL, NCV, NCZ, OZK, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RDY, UVV, VGI, WDR, WSBF, ZTR\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 99.0K)\n    - CFTC Copper speculative net positions (previous: 20.6K)\n    - CFTC Corn speculative net positions (previous: -157.4K)\n    - CFTC Crude Oil speculative net positions (previous: 543.8K)\n    - CFTC Gold speculative net positions (previous: 266.7K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 43.8K)\n    - CFTC Natural Gas speculative net positions (previous: -63.4K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -49.6K)\n    - CFTC Silver speculative net positions (previous: 37.6K)\n    - CFTC Soybeans speculative net positions (previous: 122.9K)\n    - CFTC Wheat speculative net positions (previous: -14.6K)\n    - Core PPI (consensus: 0.1%, previous: -0.1%)\n    - Core PPI (consensus: 0.4%, previous: 0.3%)\n    - IEA Monthly Report\n    - PPI (consensus: -0.2%, previous: -0.8%)\n    - PPI (consensus: 0.4%, previous: 0.4%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 185)\n    - U.S. Baker Hughes Total Rig Count (previous: 263)\n    - WASDE Report\n\n^^^^2020-07-09",
        "created_utc": 1594288809,
        "id": "fxepaay",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1594317609.0
    },
    {
        "author": "briannco",
        "body": "NTAP is a lost cause. You buying a lot of coal stocks too?",
        "created_utc": 1594670951,
        "id": "fxypyr3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594699751.0
    },
    {
        "author": "yukhateeee",
        "body": "I don't follow PAYX closely, so I could be wrong. They're a well-regarded / well-managed company. Companies like that are difficult to short.  People keep buying the dips, so they don't go down as much as you want, nor stay down for long.",
        "created_utc": 1593776451,
        "id": "fwsoeg7",
        "score": 1,
        "subreddit": "options",
        "created": 1593805251.0
    },
    {
        "author": "TheLoneComic",
        "body": "Paychex, to be on topic, has a long history of organic growth, but not being an industry group leader will probably hurt it as the economic contraction really starts to take hold, probably starting as early as right after this Independence Day weekend or a couple weeks thereafter.\n\nNot to be one of those the sky is falling people, the markets as well as the economy have been showing resilience and surprise here and there despite the massive wave of bankruptcies, student loan defaults, stay closed small business environment and more tsunami-ing toward us.\n\nIt’s gonna hammer, but remember the old market adage- it’s always a sunny day on Wall Street.",
        "created_utc": 1593663411,
        "id": "fwnu8xt",
        "score": 1,
        "subreddit": "options",
        "created": 1593692211.0
    },
    {
        "author": "ggFuji",
        "body": "Thoughts on Paychex?",
        "created_utc": 1593802702,
        "id": "fwtxmr3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593831502.0
    },
    {
        "author": "expat31",
        "body": "shit my bad i thought i was commenting on a NIO pusher post... don't know anything about PAYX",
        "created_utc": 1593813180,
        "id": "fwugkgy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593841980.0
    },
    {
        "author": "amoctar",
        "body": "Payx hr software company will report next week. I think If they beat ADP (leader in the market) gonna moon. Don't buy payx though seem like they're set to miss",
        "created_utc": 1593680747,
        "id": "fwoel9e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593709547.0
    },
    {
        "author": "amoctar",
        "body": "Who's following payx for earnings next week?",
        "created_utc": 1593617911,
        "id": "fwlc7bp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593646711.0
    },
    {
        "author": "sub2pewdiepie-_-",
        "body": "PAYX gang rise up!",
        "created_utc": 1593610189,
        "id": "fwkxs4f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593638989.0
    },
    {
        "author": "xRiotZx",
        "body": "Anyone playing PAYX earnings?",
        "created_utc": 1593802882,
        "id": "fwtxywr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593831682.0
    },
    {
        "author": "amoctar",
        "body": "Payx",
        "created_utc": 1593621471,
        "id": "fwljmax",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593650271.0
    },
    {
        "author": "malloun123",
        "body": "Anyone playing SQ? I’m in on PYPL and missed the big jump for SQ this morning but do we see continued growth?",
        "created_utc": 1593618206,
        "id": "fwlcstj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593647006.0
    },
    {
        "author": "Sea_Seaworthiness",
        "body": "Why is spy mooning but amd and pypl sucking cock",
        "created_utc": 1593611541,
        "id": "fwl028c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640341.0
    },
    {
        "author": "Jusgivechees",
        "body": "PYPL is killing me.",
        "created_utc": 1593611851,
        "id": "fwl0lt0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640651.0
    },
    {
        "author": "626reppin",
        "body": "PYPL and that stairway to heaven",
        "created_utc": 1593621300,
        "id": "fwlj98f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593650100.0
    },
    {
        "author": "giacomoerre",
        "body": "Do you accept paypal?",
        "created_utc": 1593601797,
        "id": "fwkmbsk",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1593630597.0
    },
    {
        "author": "Blind-Yolo",
        "body": "I’ve been flipping DDOG and FSLY calls on dips and swings recently. Was thinking about PYPL, I’ll check out SQ and put some price alerts on that as well. Trying to get some non tech related calls after we get some pullback. Was considering JPM and BYND, but looks like I may have missed my chance at with BYND. Was hoping they would wait another day or two to rocket up",
        "created_utc": 1593602817,
        "id": "fwknh36",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593631617.0
    },
    {
        "author": "ReyTheFox12",
        "body": "PayPal and eBay dips is free money.",
        "created_utc": 1593619952,
        "id": "fwlge0h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593648752.0
    },
    {
        "author": "RamboWarFace",
        "body": "PYPL 200 EOM?",
        "created_utc": 1593618915,
        "id": "fwle8p8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593647715.0
    },
    {
        "author": "iam1whoknocks",
        "body": "PYPL calls at open. Your welcome",
        "created_utc": 1593605939,
        "id": "fwkrcj0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593634739.0
    },
    {
        "author": "tundrawookyAK",
        "body": "Pypl $200c 9/18",
        "created_utc": 1593615580,
        "id": "fwl7l0q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593644380.0
    },
    {
        "author": "chrisvictors",
        "body": "hope everyone bought $PYPL dip cuz it’s gon sky rocket now!!! cya",
        "created_utc": 1593613291,
        "id": "fwl373e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593642091.0
    },
    {
        "author": "KelbySmith",
        "body": "wtf PayPal",
        "created_utc": 1593611242,
        "id": "fwkzjp1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640042.0
    },
    {
        "author": "TheRahulParmar",
        "body": "Paypal rejected that 175 top hard",
        "created_utc": 1593611797,
        "id": "fwl0ig2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640597.0
    },
    {
        "author": "Sea_Seaworthiness",
        "body": "pypl stop being a retard",
        "created_utc": 1593612718,
        "id": "fwl257m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593641518.0
    },
    {
        "author": "KelbySmith",
        "body": "PayPal might beat",
        "created_utc": 1593618490,
        "id": "fwlddig",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1593647290.0
    },
    {
        "author": "KelbySmith",
        "body": "PYPL $200C 7/24 Cheap Potential 10 bagger up to earnings. Get in",
        "created_utc": 1593618449,
        "id": "fwldagf",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1593647249.0
    },
    {
        "author": "KelbySmith",
        "body": "PayPal to the moonnn",
        "created_utc": 1593618741,
        "id": "fwldvy4",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1593647541.0
    }
]