[
    {
        "author": "Surfincloud9",
        "body": "Man I love Alicia Keys.",
        "created_utc": 1593702380,
        "id": "fwpc7tb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593731180.0
    },
    {
        "author": "Shishi1315",
        "body": "All you need is an email and $50 to sign up for these trading apps &amp; bam- you're on your way to being a millionaire. I've seen so many loss posts it's sad.\n\nKinda like giving the keys of a P1 to a 17 year old boy. No training, no advice just follow the herd  (HTZ &amp; GNC to the moon) Many come here, but  then have to decipher the bullshit from the legit. \n\nRH (and others) has a moral &amp; ethical obligation regarding their clients. Make a few tutorials mandatory before betting the farm. \n\nSome will jump in &amp; make headway. But those numbers will be few and far between.",
        "created_utc": 1593629578,
        "id": "fwm1g02",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593658378.0
    },
    {
        "author": "ABVerageJoe69",
        "body": "Best of luck to you, but this is not effectively weaponized autism, it's some stupid boomer shit. My grandfather worked for Ford for 40 years and is one of many, many former employees that make up Ford's gigantic pention liability. Additionally, Ford has been a big source of dividends, which decreases stock price on payout. Additionally, Ford employees are unionized, so any gains get watered down before the investors see them. Peep the 5yr price history on Ford, expect more of that, leveling out if you're actually optimistic.\n\nOh, and F is discontinuing production of its cars. I am currently typing this in a Ford fusion, love this car. Ford is counting on people like me to trade in my keys and buy F150s and SUVs, but a lot of people are just not going to do it. The new Broncos look dope, but most people will just buy a comparable car from a different make.",
        "created_utc": 1593688415,
        "id": "fwomks1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593717215.0
    },
    {
        "author": "psiguy686",
        "body": "If you throw it all in TSLA 7/10 1240/1250 or AMZN 7/10 2980/2990 debit spreads you can be given the keys to the sub in my eyes. But you have to let them expire, no selling.",
        "created_utc": 1593661429,
        "id": "fwnrajd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593690229.0
    },
    {
        "author": "theyellowtacomaking",
        "body": "\" The infinite **monkey** theorem states that a **monkey** hitting keys at random on a **typewriter** keyboard for an infinite amount of time will almost surely type any given text, such as the complete works of William Shakespeare. \"",
        "created_utc": 1593639982,
        "id": "fwmooo0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593668782.0
    },
    {
        "author": "Tim-Li-Investing",
        "body": "Storage rental sounds like a great idea. Each bedroom can be one storage unit with individual keys. Worst case if they don’t pay, you can take possession of the stuff and sell it on Kijiji.",
        "created_utc": 1593699055,
        "id": "fwp4tes",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1593727855.0
    },
    {
        "author": "envirused_covidslave",
        "body": "Highly doubt Hydrogen will replace anything. It's a very volatile fuel that can become heavilly unstable with little upset. What if Timmy wants to steal mom's keys and goes for a joyride? Hope he doesn't crash, or a city block is decimated.",
        "created_utc": 1593718921,
        "id": "fwqbvu8",
        "score": -1,
        "subreddit": "investing",
        "created": 1593747721.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "https://www.nytimes.com/2020/07/01/world/asia/taiwan-china-hong-kong.html\n\nThis, coupled with the CEO of MSI “falling” off of a 7 story building, seems very troubling. \n\nI wouldn’t hold AMD leaps folks. I wouldn’t have said that a month ago. Fuck China.",
        "created_utc": 1594255801,
        "id": "fxdh8s9",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1594284601.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "I’m going to reiterate my [MRK](https://www.reddit.com/r/wallstreetbets/comments/hkpyve/weekend_discussion_thread_for_the_weekend_of_july/fww5ouh/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf) comment with some additional research. \n\nFirst off, there’s currently a huge [shortage ](https://www.cnbc.com/2020/07/06/more-than-70-countries-at-risk-of-running-out-of-hiv-drugs-due-to-coronavirus-pandemic-who-says.html) of HIV meds where basically what happened is part supply chain disrupt, but also the two drugs they were using proved to be ineffective for HIV patients because of covid. Something about them is no longer working. \n\nSecondly, MRK’s press release for their phase 3 trial of [Islatravir](https://www.cnbc.com/2020/07/06/more-than-70-countries-at-risk-of-running-out-of-hiv-drugs-due-to-coronavirus-pandemic-who-says.html) is set to begin soon after their presentation at the AIDS 2020 virtual divulging that the Phase 2b results proved that their drug has higher efficacy and safety from the analyses. \n\nThirdly, MRK has a proven track record for putting up great [earnings](https://finance.yahoo.com/news/why-earnings-surprise-streak-could-161004767.html), and most analysts are bullish already about them for their earnings coming out 7/31. And will be even more so in the near future thanks to their EIDD-2801 exclusive rights from RidgeBack Therapeutics for an antiviral for covid until others produce a sustainable vaccine, and more so because they’ll likely make up the shortage for HIV meds with current meds and their upcoming Islatravir. \n\nFuthermore, MRK just got [FDA approval](https://www.mrknewsroom.com/newsroom/news-releases/news-details/2020/FDA-Approves-Mercks-KEYTRUDA-pembrolizumab-for-First-Line-Treatment-of-Patients-With-Unresectable-or-Metastatic-MSI-H-or-dMMR-Colorectal-Cancer/default.aspx) to use Keytruda for first-line colon cancer. Which will only drive their earnings. \n\nUnfortunately I can’t share the seeking A article, but it goes into further detail about why antivirals will be very important in the coming months since vaccines are still projected to be at least 6 months out, if not longer. If you want to see the SA article just google “Antivirals Rather Than Vaccines for COVID-19”\n\nAlso, the EIDD-2801 candidate they have rights to from RidgeBack is currently in quite a few trials, but one of the more pertinent one is in South Africa where they’re needing 50 HIV positive people to see if it can help prevent covid in them, but also they’re secretly hoping by sheer luck that the same drug can help manage HIV at the same time it prevents covid. \n\nSticking with my originals 7/31 $85-$90c, and 10/16 $90-$95, but I’ll also add 1/21 $100-$105c since there are many analysts setting $100+ fair values for eoy.\n\nEdit: TL;DR— MRK $85+ calls cause they make the good drugs for bad things and it make printer go brrrrrrrr.",
        "created_utc": 1594172562,
        "id": "fx9pas2",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594201362.0
    },
    {
        "author": "xesus2021",
        "body": "I recall, it was 2008. \n\nYou could go to BEST BUY and get a Motorola C168i, in a circular clamshell package.   It was a $15 dollar cellphone, that is what it cost, $15.\n\nIt also came with $10 of airtime, and thus, the phone itself only ended up costing $5. \n\n=== ==== ===== \n\nI bought at least three dozen of those things.",
        "created_utc": 1594788519,
        "id": "fy44ceb",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594817319.0
    },
    {
        "author": "FelWill",
        "body": "I'm jacked to the tits on boomer stocks. MSI, NOK, FLIR, RTX, C, BRK.B, BP, RDS.B, HSBC",
        "created_utc": 1594830435,
        "id": "fy5p7zy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594859235.0
    },
    {
        "author": "Extension-appeal",
        "body": "Samsung Kawasaki toyota Motorola",
        "created_utc": 1595211488,
        "id": "fymbdt8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595240288.0
    },
    {
        "author": "demnutz6666",
        "body": "Motorola cheapskate reporting",
        "created_utc": 1593637523,
        "id": "fwmj88b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593666323.0
    },
    {
        "author": "stanky_puss",
        "body": "$MSI calls will bring tendies to any autist who buys them",
        "created_utc": 1595602487,
        "id": "fz3gijd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595631287.0
    },
    {
        "author": "HeAbides",
        "body": "CPU: Intel i5-4970k\nMOBO: Asus z97 pro\nRAM: Corsair 64GB ddr4\nGFX: MSI GTX 1080 12gb\nInstalling to a few month old Samsung EVO 860",
        "created_utc": 1593994718,
        "id": "fx1tzr2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594023518.0
    },
    {
        "author": "Estate4reaL",
        "body": "I used to think that motorola and blackberry were very very good at making phones..",
        "created_utc": 1593678098,
        "id": "fwobvwi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593706898.0
    },
    {
        "author": "CallinCthulhu",
        "body": "Conveniently forgot to mention Samsung, LG, and Motorola.\n\nApple only has 20% market share.\n\nShit example",
        "created_utc": 1594097547,
        "id": "fx6c9e4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594126347.0
    },
    {
        "author": "zerooneinfinity",
        "body": "People said the same about blackberry, motorola, nokia. It's all about what's cool and those companies are going the way of the dodo bird. I own a Toyota, and love the service. But I'm not even thinking about buying another. Tesla is just way cooler for not much more.",
        "created_utc": 1593798868,
        "id": "fwtqdyc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593827668.0
    },
    {
        "author": "40034243",
        "body": "Everyone loved Motorola. Everyone loved Nokia’s. It’s going to change. Something big is going to happen.",
        "created_utc": 1594998002,
        "id": "fyd5row",
        "score": 1,
        "subreddit": "investing",
        "created": 1595026802.0
    },
    {
        "author": "0ddb4l1",
        "body": "that's great. Show me how Motorola and Nokia built a platform anything like Apple in terms of revenue streams. Even with a decrease in iPhone sales, Apple is positioned well. And if you don't think they're looking to acquire and continue to expand their offerings you're delusional.\n\nYou're just assuming something has to change because of those past failures. You made no point to my post other than 'something big is going to happen' backed by nothing.",
        "created_utc": 1594998296,
        "id": "fyd6ckt",
        "score": 1,
        "subreddit": "investing",
        "created": 1595027096.0
    },
    {
        "author": "BloodMossHunter",
        "body": "can anyone look into MSI and tell us why it keeps dropping over the last xx months? It had huge highs, it beats earnings IIRC but it is on downward slope. The chart looks like its consolidating.",
        "created_utc": 1594458786,
        "id": "fxn3hak",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594487586.0
    },
    {
        "author": "soap808s",
        "body": "Anyone who knows this industry... if Huawei is banned  - could they essentially buy out another US cell company (Nokia, Motorola) so they continue to be in business here?",
        "created_utc": 1594307667,
        "id": "fxfgx5q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594336467.0
    },
    {
        "author": "desice",
        "body": "Um.. what? When the smart phone came out, did we see a similar thing? Two decades later,, where is Nokia, Ericsson, Motorola, LG? FOH",
        "created_utc": 1594351572,
        "id": "fxhu3xn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594380372.0
    },
    {
        "author": "mammaryglands",
        "body": "A Motorola with a cracked up screen",
        "created_utc": 1594777243,
        "id": "fy3mk2z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594806043.0
    },
    {
        "author": "makesalotofpancakes",
        "body": "MSI Stealthbook. Amazing performance/cost/size balance. Most importantly, they run cooler than Razer.",
        "created_utc": 1593796389,
        "id": "fwtlk85",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593825189.0
    },
    {
        "author": "daevas_dantanian",
        "body": "You'd think they would have learned from Motorola.",
        "created_utc": 1593818128,
        "id": "fwup7pz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593846928.0
    },
    {
        "author": "whatifitried",
        "body": "&gt;If you think F, GM, Toyota, and every other major car company don’t have a plan to fully integrate EV once the consumer is actually READY for it, you’re insane.\n\nI think they have plans for that.\n\nI also think those plans will fail for all but one of those companies.  Blackberry had plans, Motorola had plans.\n\nDisruption really hits incumbents hard, and they do not have the proper leadership in place at any level to change the way the company works in such a profound way.",
        "created_utc": 1594650369,
        "id": "fxxjx8p",
        "score": 1,
        "subreddit": "investing",
        "created": 1594679169.0
    },
    {
        "author": "michaelwriting",
        "body": "I can't imagine any demand for $25k+ seasonal luxury motorcycles under current circumstances either.\n\nHOG just shed 700 jobs last week and the stock is still hanging around, even uptrending.\n\nThe market does not always mirror reality. Funny you should mention MOT/MSI. I worked there when the dot com bubble bursted.",
        "created_utc": 1594679138,
        "id": "fxz6n9d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594707938.0
    },
    {
        "author": "michaelwriting",
        "body": "Back at the day, all the MOT/MSI news was focused on the consumer cell phone market flinging up and down. But their hidden cash cow was in their government contract projects.",
        "created_utc": 1594679661,
        "id": "fxz7ncr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594708461.0
    },
    {
        "author": "stanky_puss",
        "body": "Sold my 8/21 MSI $140 calls at yesterday’s top and rolled into $150 and $155 calls as well as doubling up on $160 calls (all 8/21 expiry). Wish me luck, boys",
        "created_utc": 1595602005,
        "id": "fz3fk50",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595630805.0
    },
    {
        "author": "Mojeaux18",
        "body": "CEOs can make a hell of a difference.  \nJack Welch of GE retired. Immelt sunk it.  \nBob Galvin of Motorola retired, years of struggle and his son Chris sank it. \n\nRegarding selling of stock the argument is that his paper wealth is not cash.  \nAnd you argue that even 4b is more than 1000 lifetimes but that’s false.  1000 lifetimes like you and I.  But as your expense goes up things get more complicated.  We buy a house it’s complicated.  We buy 10 houses it’s more than 10 times complicated and you need to hire managers.  Hire 10 managers and you have even more complications.  And so on.",
        "created_utc": 1593989211,
        "id": "fx1kezt",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1594018011.0
    },
    {
        "author": "40034243",
        "body": "The younger generation liked Nokia. They liked Motorola. Everything changes.",
        "created_utc": 1594998035,
        "id": "fyd5u3h",
        "score": 1,
        "subreddit": "investing",
        "created": 1595026835.0
    },
    {
        "author": "project21124",
        "body": "MSI has much better laptops for the same or lesser price",
        "created_utc": 1594767692,
        "id": "fy3630m",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594796492.0
    },
    {
        "author": "stanky_puss",
        "body": "MSI calls 8/21 $140 strike",
        "created_utc": 1594603278,
        "id": "fxvwil8",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594632078.0
    },
    {
        "author": "FactualNeutronStar",
        "body": "You don't know what you're talking about. Not car batteries, batteries. Like Powerwall. Like the 129 MWh battery farm in Australia. The farm in Australia alone made Tesla tens of millions - imagine that scaled up across the globe. With renewables like solar and wind coming to dominate electricity generation, utility-scale batteries will be necessary to store that electricity. That business alone will be worth billions. \n\nVehicle to grid is similar but much more decentralized. People can plug in their vehicle and earn some extra cash simply to use their car as energy storage. Same with robotaxis. Tesla can skim off the top and still outcompete Uber/Lyft with no labor cost. \n\nYes a lot of these come from the same product but that's *exactly why* Tesla is worth so much. What you're essentially doing is treating an iPhone the same as a Motorola flip phone. Yes they both make calls. But an iPhone has tons of other services in the form of software that make it worth far more than any flip phone.",
        "created_utc": 1595469665,
        "id": "fyxsip9",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1595498465.0
    },
    {
        "author": "noobieinvestor101",
        "body": "I find all of this hilarious tbh. Bruno Wu is a freakin' billionaire. Not saying rich people don't do illegal things, but it just doesn't seem worth his time to make up fake deals in order to create fake PR for a small company to siphon investor's thousands of dollars. He's an American citizen who is chairman of an American company and if he wanted to just make money, he could chill out and invest his billion dollars -- which would be a lot easier than creating a lot of fake news in hopes to gain a bit more capital through some shell company. It just doesn't add up for me or seem worth his time. I'd imagine companies doing shady things want to stay on the downlow, and Ideanomics is doing the opposite of that",
        "created_utc": 1593632896,
        "id": "fwm8u30",
        "score": 15,
        "subreddit": "pennystocks",
        "created": 1593661696.0
    },
    {
        "author": "iiianon",
        "body": "I love how it ends with “And he disrespected the Wu-Tang Clan”",
        "created_utc": 1595360146,
        "id": "fyspfyl",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1595388946.0
    },
    {
        "author": "templario765",
        "body": "My thoughts exactly. Wu is already a billionaire why would he want to fraud investors over some millions of dollars and ruin his reputation and credibility in the process.",
        "created_utc": 1593633301,
        "id": "fwm9qzb",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1593662101.0
    },
    {
        "author": "Cisiowian",
        "body": "It's worth whatever someone is willing to buy at. During the Wu lock downs my neighbor's kids were successfully selling toilet paper at $5/roll. Is it really worth this much?",
        "created_utc": 1594698502,
        "id": "fy044fk",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1594727302.0
    },
    {
        "author": "the_real_herr_doktor",
        "body": "If anyone's attended the last investor presentation by Alf you would've heard they've halved their debt and the pipeline is extremely healthy. Oh and this is just the beginning.  \n\n\nEV x China x Bruno Wu x Gov commercial fleet contracts = WIN",
        "created_utc": 1595329117,
        "id": "fyr5znq",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1595357917.0
    },
    {
        "author": "2dum2FUNction",
        "body": "Wu tang ain’t nothing to fuk wit",
        "created_utc": 1594700969,
        "id": "fy07qae",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594729769.0
    },
    {
        "author": "ScopePerspective",
        "body": "thanks for the western union telegram",
        "created_utc": 1594654529,
        "id": "fxxrrbu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594683329.0
    },
    {
        "author": "patrickbateman02",
        "body": "Never fuck with wu tang",
        "created_utc": 1594058040,
        "id": "fx4cony",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594086840.0
    },
    {
        "author": "K215215",
        "body": "Solo Wu Album Ranks -\n\n1) Ironman\n\n2) Only Built for Cuban Linx\n\n3) Return to the 36 Chambers\n\n4) Liquid Swords\n\n5) Supreme Clientele\n\n6) Tical\n\n7) Bobby Digital\n\n8) Tical 2000 Judgment Day\n\n9) Beneath the Surface\n\n10) Fishscale",
        "created_utc": 1594501704,
        "id": "fxr20t7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594530504.0
    },
    {
        "author": "Ilove2bustinmyownass",
        "body": "you azn morons deserve this lol imagine investing in a vaccine that sounds like a wu tang clan member lol get fukked",
        "created_utc": 1595207837,
        "id": "fym5f8z",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595236637.0
    },
    {
        "author": "J_Powell_Ate_My_Ass",
        "body": "yea member of wu tang",
        "created_utc": 1594859282,
        "id": "fy7bnsg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594888082.0
    },
    {
        "author": "wesmt",
        "body": "I'd advise against it unless you've done your research...Wu-Tang Clan ain't nothin to fuck with.",
        "created_utc": 1594873904,
        "id": "fy7zvg4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594902704.0
    },
    {
        "author": "sap91",
        "body": "&gt;Wu lock downs\n\nWe can't leave the house because RZA told us to stay home",
        "created_utc": 1594732121,
        "id": "fy16wil",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594760921.0
    },
    {
        "author": "TeamGravityAnalytica",
        "body": "This is Bruno Wu vs. a good friend of Steve Bannon, Guo Wengui.\n\n[https://law.justia.com/cases/new-york/other-courts/2019/2019-ny-slip-op-30892-u.html](https://law.justia.com/cases/new-york/other-courts/2019/2019-ny-slip-op-30892-u.html)\n\nRead that. It's hilarious. You'd have to do a lot more than ban Chinese Stocks. Beyonce's father was involved this company last year, BNGI.",
        "created_utc": 1594350426,
        "id": "fxhs9xd",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594379226.0
    },
    {
        "author": "the_heat_waver",
        "body": "CREAM\n\n[Wu-Tang Financial](https://www.youtube.com/watch?v=zhUnEg0he4A)",
        "created_utc": 1594349699,
        "id": "fxhr3f4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594378499.0
    },
    {
        "author": "Pr4370r1u5",
        "body": "They do not appear to be.\n\nDiscussing with my MIL, she says Bruno Wu gets bored with a project after about 2 years. So watch for the divestment and pivot about 18 months from now.",
        "created_utc": 1595341040,
        "id": "fyrmrvd",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1595369840.0
    },
    {
        "author": "Downbooper",
        "body": "Wu tang financial, a place for you and your kids",
        "created_utc": 1595468444,
        "id": "fyxqe49",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1595497244.0
    },
    {
        "author": "significant-Jacket",
        "body": "LOL imaging believing in the next LK\n\nJust western union your $ to me, I'll find you some more entertaining ways to burn them up",
        "created_utc": 1594071809,
        "id": "fx54j54",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594100609.0
    },
    {
        "author": "Brian_117",
        "body": "Yeah if I get a reply from them I'll tell ya, the thing is Bruno Wu is both the chairman of Ideanomics and of Sun Seven Star Investment Group(SSSIG) and as SSSIG they've had dealings with China Tower...so here's hoping it really was translation errors and not realizing they were working with Ideanomics, cause they only knew about MEG or SSSIG. But yeah I closed my position cause I rather wait for a verifiable catalyst coming from the top.",
        "created_utc": 1593662354,
        "id": "fwnsoy5",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1593691154.0
    },
    {
        "author": "Monkeycash",
        "body": "Yo you guys know Naomi Wu on Youtube? [https://www.youtube.com/watch?v=bfnEGS0GNVM&amp;t=557s](https://www.youtube.com/watch?v=bfnEGS0GNVM&amp;t=557s)\n\nFor a second I thought i am watching Pornhub.",
        "created_utc": 1594786391,
        "id": "fy41apb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594815191.0
    },
    {
        "author": "Naveua",
        "body": "Got the Wu on repeat 👐🏾",
        "created_utc": 1594706068,
        "id": "fy0e7e3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594734868.0
    },
    {
        "author": "Sevro_andthe_howlers",
        "body": "\"If what you say is true, the Wu Tang, and the RH, could be dangerous.\"",
        "created_utc": 1594873974,
        "id": "fy7zz1c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594902774.0
    },
    {
        "author": "ib_dropout",
        "body": "Damn, Wu mao soldiers be widening their audience. 😂",
        "created_utc": 1594954342,
        "id": "fyblkys",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1594983142.0
    },
    {
        "author": "preatam91",
        "body": "Wu-tang who?",
        "created_utc": 1593812001,
        "id": "fwuegxy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593840801.0
    },
    {
        "author": "Defiant_Ant",
        "body": "There are health factors more prevalent in blacks that make them more susceptible to bite the dust due to the WU Flu.... sickle cell, da beeties etc.   Also they’re more likely to stand on crowded street corners yelling and breaking things together.  They’ll tell you how broken and racist the system is while looting and then decry the systematic racism... ‘why I gets da covid.... orange man bad’",
        "created_utc": 1593913485,
        "id": "fwyjtb7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593942285.0
    },
    {
        "author": "HODL_monk",
        "body": "The biggest problem with gold is, its all stored in easily seizable vaults. And the government can and will seize them, whenever it needs more money to spend. https://en.wikipedia.org/wiki/Executive_Order_6102\n\nAs to the FUD toward Bitcoin :\n\n1. All tech starts complicated, then the iPhone comes along and fixes it, see Libra and the abject fear from government officials just the suggestion created. The first email providers were clunky as hell, you had to set up these two different servers, one to send, and one to receive, it was the dumbest thing ever, it could never catch on that way, but it was clearly better than snail mail, and once a decent web client abstracted away the hard part, then it took over, and the rest is history.\n\n2. Bitcoin is easy to steal with malware, at least from a software wallet, but Hardware Wallets make this almost impossible, and once you get one, its no longer an issue, unless someone tricks you into sending your Bitcoin to them, but people have been tricked into sending Western Union wires to thieves as long as sending money has been a thing, so its not much more steal-able, with precautions.\n\n3. Proper backups make this very unlikely, but not impossible. Anything can be lost, if its physical. Most people just have money in the bank, and its not going to get lost very easily there, so some care is required to avoid this problem.\n\n4. 3000 + new digital currencies have already been created, and some people have purchased them, but then again, some people bought Venezuelan Bolivars as well, but then they learned not to buy candy wrapper money, and then they stopped. A new digital currency doesn't make Bitcoin worthless, its just another thing people might buy, and then they will learn not to. I could offer you a hunk of Pyrite, but only a fool would buy that instead of gold...\n\n5. Yes, requires these things, but modern smart phones have all three of these things, and most people have one, so its less of a barrier as it appears.\n\n6. This is always possible, but since Bitcoin is a distributed ledger, any successful hack could be rolled back (old copy of who owns what is used), or the coin forked to an unbreakable variant (hard fork upgrade), so its not as catastrophic as it appears.",
        "created_utc": 1593895383,
        "id": "fwxqxpn",
        "score": 1,
        "subreddit": "investing",
        "created": 1593924183.0
    },
    {
        "author": "billyspeers",
        "body": "wu tang",
        "created_utc": 1594694364,
        "id": "fxzxk8m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594723164.0
    },
    {
        "author": "Scandy7",
        "body": "SE is an internet and mobile platform company.  It operates thru the following segments: digital entertainment(think amazon prime video), E Commerce(so like amazon sells everything online), and digital financial services(think amazons deal with western union).  So yes, SE operates in very similar fashions to amazon.",
        "created_utc": 1595288829,
        "id": "fyporlt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595317629.0
    },
    {
        "author": "bettercallsaully",
        "body": "wu tang again?",
        "created_utc": 1595304801,
        "id": "fyqfef5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595333601.0
    },
    {
        "author": "hellomario",
        "body": "wu tang power",
        "created_utc": 1595016821,
        "id": "fye8bzq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595045621.0
    },
    {
        "author": "TeamGravityAnalytica",
        "body": "Dr. Bruno Wu is not America.  Do you really want me to answer your question about stupidity and fraud in America? I am willing to go through and provide you a case per year of someone really famous getting involved in a fraud. Just last year Beyonce Dad got involved in a penny stock marijuana scam. Check the ticker BNGI. \n\nhttps://merryjane.com/news/beyonces-dad-has-entered-the-legal-weed-game\n\nIf I handed you a million dollars and said there will be stories written about you for a few weeks that you won't like would you care? I think you are conflating your attachment to your decision and the reality of the US stock market. \n\nBut, if you want I am more than willing to show you a list of famous people involved in massive frauds, either purposefully or out of stupidity.",
        "created_utc": 1593937419,
        "id": "fwzcpuk",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593966219.0
    },
    {
        "author": "revelency-116",
        "body": "Not doing shit until you release that wu-tang joint",
        "created_utc": 1593695405,
        "id": "fwoxedi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593724205.0
    },
    {
        "author": "Brian_117",
        "body": "bro enough bullshit, I was holding IDEX too for a while, it cost me money, I did some extra research cause I never thought Bruno Wu would be lying, this guy is telling the truth.",
        "created_utc": 1593695659,
        "id": "fwoxvzd",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593724459.0
    },
    {
        "author": "ninjasenses",
        "body": "i can get you that channel id if you release that wu-tang album\n\nmy portfolio diversity is 99% TSLA",
        "created_utc": 1593699275,
        "id": "fwp5agr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593728075.0
    },
    {
        "author": "iarehuuman",
        "body": "I went for the SpaceX launch (pretty packed tbh) 3 miles from the cape Canaveral launch site.  Returned to self quarantine right after, been shut in since spring break. Still no wu flu",
        "created_utc": 1593801904,
        "id": "fwtw4zm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593830704.0
    },
    {
        "author": "Webb_Scout_Leader",
        "body": "If you'd do a moments worth of research you'd find out that Wu is working on getting it verified. Once this gets verified it'll be a fun ride. SBES will make you some loot.",
        "created_utc": 1594435490,
        "id": "fxlj9b3",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594464290.0
    },
    {
        "author": "prudhviraju9",
        "body": "Its shell company  with no profit for 17 years. I have been following this company for 2+ years and every thing they claimed till date never even showed penny profit.\n\nThey release PR for billion dollar deals every year and show negative earnings. They have backlog of 50+ billion dollar rev pending which they never speak now\n\nWU is biggest scumbag of Nasdaq history",
        "created_utc": 1594686018,
        "id": "fxzj8oc",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594714818.0
    },
    {
        "author": "theineffablebob",
        "body": "Classic Wu Tang pattern on SPY",
        "created_utc": 1594907362,
        "id": "fy93dur",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594936162.0
    },
    {
        "author": "imahohohoho",
        "body": "Sorry! Wrong link. \n\n\nhttps://www.finextra.com/pressarticle/83052/ideanomics-to-sell-fintech-village-site-to-local-council\n\nThey are in talks to sell it, as this isn’t the focus of the company anymore. I saw an interview with Alf Poor saying the same. Fintech was a Bruno Wu thing, and Poor wants the company to move into the EV side of things.",
        "created_utc": 1594937442,
        "id": "fyasfdv",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594966242.0
    },
    {
        "author": "Nickoman365",
        "body": "Wu Forever",
        "created_utc": 1594915427,
        "id": "fy9ixk7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594944227.0
    },
    {
        "author": "find_your_zen",
        "body": "That's not what that says.\n\nIDEX bought it to renovate, tore some shit down, realized one of the materials is like toxic or some shit, ended up costing them a lot lot more than anticipated, they announced they're seeking a partner some time ago, but West Hartford is understandably upset that they've left the site to basically sit as an eyesore and have made a deal with Ideanomics that the town reserves the right of first refusal wherein they could just snatch the property back. Seems likely, and it will be bad PR when it happens. Or, if it hangs in the balance long ehough, they might get their revenue right enough to finish renovations and start an impressive Fintech Hub, however I'm not holding my breath for that.\n\nWu was the one to push for Fintech Village, that seems to be what his sights are set on, while Alf seems much more interested in expansion into green energy services.",
        "created_utc": 1594918308,
        "id": "fy9owp5",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594947108.0
    },
    {
        "author": "omglawlz",
        "body": "Wu Mart ain't nothing to fuck with",
        "created_utc": 1594217154,
        "id": "fxbb27i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594245954.0
    },
    {
        "author": "Cmoz",
        "body": "&gt;There are literally THOUSANDS of competing cryptos. Someone can create one in their basement in a few days.\n\nSo? Someone can code up a new facebook in a few days too. Brand equity and existing user networks matter.\n\n&gt;What is the last major purchase you made in btc? What is the last major company to accept BTC for purchases?\n\nPaid for my webhosting and bought some things on amazon with bitcoin recently. Also, there are cards you can use to spend your bitcoin balance anywhere, so companies accepting it is nice, but isnt really required for use.\n\n&gt;I understand the utility, and I own some, but my God it is a laughable use of money if you're going to compare it with equities.\n\nLaughable? Do you laugh at Western Union?",
        "created_utc": 1594770224,
        "id": "fy3aj52",
        "score": 1,
        "subreddit": "investing",
        "created": 1594799024.0
    },
    {
        "author": "ssryoken2",
        "body": "Moneygram as their is a good chance they might be acquired by western union",
        "created_utc": 1594833910,
        "id": "fy5wlw0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594862710.0
    },
    {
        "author": "xiovelrach",
        "body": "Naming a bunch of other stonks is what we call “moving the goal posts”, it is a weak attempt at distracting from your incorrect assessment of MVIS. Also known as muddying the waters... and I was wrong, they were founded by Shane/Wu in 2004, still listed in 2018.",
        "created_utc": 1593714896,
        "id": "fwq3ggf",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593743696.0
    },
    {
        "author": "Snoo_86776",
        "body": "Never trust a EV / fintech company being run on its new DBA by a reality TV executive\n\n\nThe cries of those burnt by ideanomics, seven stars investments,  Shanda Group, sina, Asia television sounds like this:\n DR Bruno Wu who?\n\nHis PHD is not in business,  but in international relations and public affairs.. \"oh a bullshit artist!\"\n\nThe name of the CEO is Alfred Poor... spoiler alert.\n\nAnd regardless to alternate DD facts.\n\nWU is of Chinese nationality.  With his PHD he knows how to use international law to take your money and run.\n\nhttps://en.m.wikipedia.org/wiki/Bruno_Wu",
        "created_utc": 1593849005,
        "id": "fwvvflo",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1593877805.0
    },
    {
        "author": "slamdunktiger86",
        "body": "**BREAKING**\n\nNew single collaboration featuring Wu Tang released:\n\nDiversify your bonds Nigg@",
        "created_utc": 1594145758,
        "id": "fx89f12",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594174558.0
    },
    {
        "author": "find_your_zen",
        "body": "Gotcha. Still basically the same. The town expressed right of first refusal so they are going to decide wether they want to buy it back and in the mean time are paying for the property maintenance.\n\nWu has said recently that he would rather it be developed and Poor wants to focus on EV.",
        "created_utc": 1594943207,
        "id": "fyb2zlf",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594972007.0
    },
    {
        "author": "captnstabbing",
        "body": "No one gives a fuck, risk a million dollar hospital bill if your unlucky \nEnough to survive a severe bout of Wu flu.",
        "created_utc": 1594466690,
        "id": "fxnm1zq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594495490.0
    },
    {
        "author": "Always2xDown",
        "body": "This has also gone from .0078 to .0044 since it was posted last. That is what I looked at first, after realizing the post read very familiar.\n\nMore interested in the convertible note and 89,449,480 shares or 9.9% of common shares exercised by Felicia Preston and EMA Group LLC back in February\n\nhttps://www.otcmarkets.com/filing/html?id=13914945&amp;guid=NGcFUKqdzRcThyh\n\nIt even references the fact that \n\n\nThe Reporting Persons’ beneficial ownership of 89,449,480* shares of Common Stock constitutes 9.9%* of all the outstanding shares of Common Stock, based upon 814,080,625 shares of Common Stock outstanding as of February 28, 2018, as reported by the Issuer in its most recent Annual Report.\n\nAll that said, if this thing gets some volume, some hype, and a story other than “check out my boi Wu” I’d hop on the pump and drop the dump.\n\nBy the way isn’t it Mr. Robert Xu not WU behind SPOM, HDii and this?",
        "created_utc": 1594438453,
        "id": "fxlnpqo",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594467253.0
    },
    {
        "author": "SlightlySalty007",
        "body": "Pay someone to send her the money through Western Union.",
        "created_utc": 1594750979,
        "id": "fy27vud",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594779779.0
    },
    {
        "author": "Cmoz",
        "body": "The increased utility (or beneficial use) inherently causes it to grow in value in and of itself, through forces such as the transactional demand for money. \n\nWhy is it relevant if value transfers to me through this manner, or through a more traditional mechanism such as investing in Western Union stock? Either way I'm profiting from the growth of a transaction network.",
        "created_utc": 1595183893,
        "id": "fykyk2d",
        "score": 1,
        "subreddit": "investing",
        "created": 1595212693.0
    },
    {
        "author": "gabehay",
        "body": "Get this question a lot. If I can help other people grow their portfolio and make money while doing it Wu wouldn’t I? It doesn’t require any effort from me because I just tell people what I’m trading",
        "created_utc": 1595304025,
        "id": "fyqe8ww",
        "score": 0,
        "subreddit": "stocks",
        "created": 1595332825.0
    }
]