[
    {
        "author": "Zathamos",
        "body": "Had huge success last month betting KLAC would retake old highs, bought a 200 call when it was 173. Took that and went all in on SPLK coming back. Bought jan 180 calls when it was 163 for 2.14, current value is around 800. Holding till expiry",
        "created_utc": 1608842070,
        "id": "ggxglx5",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1608870870.0
    },
    {
        "author": "Jigan93",
        "body": "The fact that more people are investing in the market thus price of the equity of company X goes up - doesn't make it a fairly valued company. In the stock market, unlike business, fair value is not what others are willing to pay for it, but rather what the underlying business is worth. If you did your DD on company X and figured that its intrinsic value of the stock is say $10, because its currently at $20 doesn't mean you need to jump in because everyone's are fine with buying at $20. It just means you put that company on your watchlist and move on, looking for something either close to IV or trading at discount. That's what in my opinion a sound investing is overall. At some point investors were buying N-KLA at $70 - but its fair value was nowhere close to that. Just shows that imo markets are inefficient and you can make a decent chunk of $ throughout your investment experience if you exploit those inefficiencies",
        "created_utc": 1608047007,
        "id": "gfxhgeu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1608075807.0
    },
    {
        "author": "stockerjocker",
        "body": "KLAC boys",
        "created_utc": 1607490030,
        "id": "gf4zy5f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1607518830.0
    },
    {
        "author": "Tendieluvr",
        "body": "He’s right, it’s how it works. Check the N KLA chart",
        "created_utc": 1606955798,
        "id": "gefpitd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606984598.0
    }
]