[
    {
        "author": "kevlarcoozie",
        "body": "Microsoft teams, Cisco WebEx, Google just rolled out their version, this stuff ain't exactly ground breaking.",
        "created_utc": 1591152115,
        "id": "fspeuq1",
        "score": 42,
        "subreddit": "stocks",
        "created": 1591180915.0
    },
    {
        "author": "joeschmo28",
        "body": "This is just not true. I worked for one of the largest technology companies in the world and they switched from Cisco WebEx to Zoom. It was such an improvement it’s not even funny.",
        "created_utc": 1591148710,
        "id": "fsp8yod",
        "score": 19,
        "subreddit": "stocks",
        "created": 1591177510.0
    },
    {
        "author": "Cwc123",
        "body": "Imagine being a zm bear LMAO. They have competition by fb,cisco, msft, googl? What a joke! Do you really think these companies have the capital to program a video chat app, the most innovative technology in the world? And what, they will offer these services for free to their users as part of an integrated bundle of products that are used by every organization in the world? Who cares? Companies dont care about adding new costs. And what, they have security issues. ok? what company cares about securities or hackes? Thats right,none. Oh and the best one. ItS oVErValUed. no? they generated 27m income this quarter. this means that if you buy zm now, you turn a profit in 600 years. Are you really that fcking impatient? You cant wait? And so what if they had their best quarter ever and will never see anything close to that ever again? Video conferencing is the futur. Want to go play golf? lmao good one, crack a cold beer and talk on zoom. Your boss wants you to meet an important client for good first impressions? lmao fuck that, just call him on zm while wearing boxers and a suit top. no companies will have offices after this year. none. they will all use zm. everyone will work remote.",
        "created_utc": 1591232366,
        "id": "fst6o52",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591261166.0
    },
    {
        "author": "GranAutismo92",
        "body": "Started with 2k, up 22k, got a good deal for the watch so I bought it, LULU, ATVI, PAYPAL, MAXR all triple baggers, csco and DIS 67% , 74%",
        "created_utc": 1591065101,
        "id": "fsle5jj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591093901.0
    },
    {
        "author": "vvv561",
        "body": "Cisco hasn't split up WebEx's revenue since 2015. \n\nIt was $4B then. \n\nIt was one of Cisco's fastest growing segment from 2015 - 2020.\n\nAnd now Cisco says they are doing 24x the normal call volume during peak hours.\n\nWebEx is crushing ZM, period.",
        "created_utc": 1591248023,
        "id": "fstwcen",
        "score": 4,
        "subreddit": "investing",
        "created": 1591276823.0
    },
    {
        "author": "astroyanny",
        "body": "Anyone else read CSCO as “C-S-CO” like the game CSGO",
        "created_utc": 1591155997,
        "id": "fsplbtz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591184797.0
    },
    {
        "author": "1monster90",
        "body": "You shouldn't invest money you can't afford to lose. Personally, money in the stock market is money I am considering nonexistent until 2045.   \nDon't be greedy but don't be cynical either. I think you could really benefit from making a list of interesting stocks. And from that list try to pick at least 10 stocks that you find promising and buy. Even if it's just 1 share (that way you will be focused on these companies, it's not so much to make a profit than making yourself focus and research these companies. I find it easier to focus on stocks I have at least one share with that stocks I don't own at all).  \n\n\nHere is my list of shares I'm watching carefully, feel free to research it.  \nMSFT, V, MA, NKE, NTDOY, LOGI, SPXL, TQQQ, DOCU,  TRIP, ALGN, F, GME, APPL, NFLX, SBUX, LUV, HS, AMZN, AAL, TMUS, PG,  INTC, QCOM, PYPL, T, ATVI, RSG, FDM, AXP, CSCO, TGT, PLSE, TROW, ORCL,  FDX, CUBE, BABA, CTAS, ALK, JNJ, LLY, CB, NEE, FANG, GAMR, TWLO, TNA,  LABU, FAS, CTRE, PEP, EBAY, DFS, GE, SNQP, MS, RF, AMG, HIG, BR, BEN,  ZNGA, COR, WWE, WYNN, VT, VTI, ELY, ADBE, SQ, TWTR, CVS, CRSP, QQ, NDLS,  WU, MTRX, PUTW, TECL, GM, NYMT, MU and NDAQ .",
        "created_utc": 1591285099,
        "id": "fsvbk0t",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1591313899.0
    },
    {
        "author": "mpbh",
        "body": "I work for a 300k person company that was almost entirely remote before COVID. We tried zoom and everyone loved it, but security and cost were the biggest issues. WebEx enterprise is cheaper and more secure, but the UX blows fat dick.\n\nIf Zoom can improve their security and offer better enterprise pricing, they'll be a clear winner. Until then, Cisco is king.",
        "created_utc": 1591130964,
        "id": "fsobc3p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591159764.0
    },
    {
        "author": "typicaluswhitemale",
        "body": "This graph is for people that use a flip phone.  GDP as it was calculated is now BS for the past about 10-15 years.  Buffet has traded sideways for about the last 5 years now.  It's now a global economy.  \n\nTLDR on GDP; it only counts products/services produced DOMESTICALLY.  Thats right, where have ALL of tech been produced for the past 5-10 years?  This doesn't include things such as AMD, Cisco, Alibaba, Aliexpress, literally any type of tech mfg., \n\nChina has tripled GDP in last 10 years.  To rely on a US GDP graph vs. value of the market is:\n\nRETARDED.\n\nIf companies that produce all of their products in china are taken out of the stock market valuation, I will stand corrected.  Also, are companies like BABA, JD, etc. taken out too?",
        "created_utc": 1591155204,
        "id": "fspk2ld",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591184004.0
    },
    {
        "author": "s3riousChef",
        "body": "the user interface for Zoom is also the best compared to other products.\n\nCisco Webex - garbage.\nMS Teams - not designed as Zoom competitor but a Slack competitor. Video chat was an after-thought.\nSkype - Dead",
        "created_utc": 1591166247,
        "id": "fspzo4b",
        "score": 2,
        "subreddit": "investing",
        "created": 1591195047.0
    },
    {
        "author": "Avid1",
        "body": "Good day to stock up on some CSCO calls...",
        "created_utc": 1591037785,
        "id": "fsjxvxd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591066585.0
    },
    {
        "author": "Vast_Cricket",
        "body": "Huawei moved its technology from US to its northern border. US gov't never charged its stealing of Cisco operating system on router being so lenient back then.",
        "created_utc": 1591235283,
        "id": "fstbvu6",
        "score": 2,
        "subreddit": "investing",
        "created": 1591264083.0
    },
    {
        "author": "Socrateeez",
        "body": "That’s just it though, they’ve built any amazing infrastructure that’s held up to the skyrocketing demand of covid without a real hitch. Plus Eric Yuan basically said fuck you to Cisco over the piece of shit Webex and started zoom. Maybe he’ll go with amazon, one never really knows these days, but I have a feeling he’s got a vision for zoom",
        "created_utc": 1591225157,
        "id": "fsst6fz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591253957.0
    },
    {
        "author": "aspergillum",
        "body": "from the prospectus\n\n&gt; The weight of each Index constituent is initially based on each constituent’s free-float market capitalization and then adjusted upward or downward based on a proprietary composite score calculated based on three growth-oriented fundamental factors of each company: trailing 12-month sales growth, trailing 12-month earnings per share (“EPS”) growth, and 12-month forward- looking EPS growth consensus estimates. \n\n\n&gt;The Index is rebalanced and reconstituted annually, effective on the first Wednesday of each May based on data as of the tenth business day prior to the reconstitution date. As of March 1, 2019, the three largest Index constituents and the weights were as follows: Cisco Systems, Inc (5.33%); Amazon.com, Inc. (4.91%); Apple Inc. (4.45%).\n\nThe biggest holding is Cisco.  It's using its own criteria to buy from the S&amp;P 500",
        "created_utc": 1591136325,
        "id": "fsomdgl",
        "score": 2,
        "subreddit": "investing",
        "created": 1591165125.0
    },
    {
        "author": "MementoMori97",
        "body": "Picked up a handful of Ericsson shares today too so probably going to buy 40 NOK shares and 30-50 ERIC shares instead. Throwing the rest of the 1000 beyond that into CSCO and ITOT.",
        "created_utc": 1591153344,
        "id": "fspgz45",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591182144.0
    },
    {
        "author": "omglawlz",
        "body": "CSCO bought that software company the other day. They trying to become a big growth stock? They tried to buy DDOG before they went public. Obviously they know they need to incorporate into the cloud and SaaS",
        "created_utc": 1591155641,
        "id": "fspkrkk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591184441.0
    },
    {
        "author": "JoseAureliano",
        "body": "Especially since every tech company has their own version of video chat at this point. Like, Google has Hangouts, Microsoft has Teams (and Skype?), Facebook has Messenger and WhatsApp and idk what else, even fucking Cisco has WebEx",
        "created_utc": 1591150485,
        "id": "fspc1sf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591179285.0
    },
    {
        "author": "dammahomelihpodep",
        "body": "I have a lot of invested in large cap stocks like MSFT, COST, CSCO, XOM, WMT, FB, GE, EA and a few others. And I also trade around 30k in pennystocks, which is up by 73%.",
        "created_utc": 1591210668,
        "id": "fsrypk3",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1591239468.0
    },
    {
        "author": "MementoMori97",
        "body": "Increased my positions in NOK, ERIC, ITOT and CSCO today before 9am",
        "created_utc": 1591215270,
        "id": "fss8pem",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591244070.0
    },
    {
        "author": "xRiotZx",
        "body": "No it's legit autists who read the DD pumping. This happened with 2 stocks I've been in, CSOD and CSCO.",
        "created_utc": 1591021782,
        "id": "fsj26v4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591050582.0
    },
    {
        "author": "SwoleStoner",
        "body": "Anyone buying CSCO dip or are there better plays?",
        "created_utc": 1591026736,
        "id": "fsjb6ny",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591055536.0
    },
    {
        "author": "thisisbsol",
        "body": "Nasdaq up, all my NVDA, CSCO, ADBE calls down. Just what I like",
        "created_utc": 1591027195,
        "id": "fsjc3r2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591055995.0
    },
    {
        "author": "blazespinnaker",
        "body": "Lot of buyback support at 52 on this stock.   I'd look at it as another CSCO and trade it the same way.\n\nThat said, Zoom could surprise to the upside on earnings and potentially push Oracle higher as there was a big deal about Oracle cloud hosting Zoom.\n\nOracle Cloud is really Oracles only chance to escape the doldrums, but it's not a very good cloud compared to its competitors.",
        "created_utc": 1591056768,
        "id": "fskzbzc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591085568.0
    },
    {
        "author": "ApartheidClyde",
        "body": "short CSCO, if next leg down is due to china this shit is going down",
        "created_utc": 1591084821,
        "id": "fsm5vba",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591113621.0
    },
    {
        "author": "itsatrashaccount",
        "body": "I know business (1000+ users) switching from Cisco, Poly, etc.  to Zoom.    I think Zoom is overpriced but the 2020 growth numbers will cement them as a top player in video conf.  Since it will be more positive news stonk only going up playa.  Take it with a grain of salt, just reporting what i see from the front.",
        "created_utc": 1591018637,
        "id": "fsiwutq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591047437.0
    },
    {
        "author": "Bigchrome",
        "body": "I thought the same at first, and was like \"Man, I thought Cisco would at least hire people who can write..\"",
        "created_utc": 1591108585,
        "id": "fsn0coc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591137385.0
    },
    {
        "author": "Bigchrome",
        "body": "I think you're missing that the email wasn't at Cisco",
        "created_utc": 1591106712,
        "id": "fsmwtxq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591135512.0
    },
    {
        "author": "jonnydoo84",
        "body": "MSFT and CSCO i'm keeping an eye",
        "created_utc": 1591312855,
        "id": "fswy8bm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591341655.0
    },
    {
        "author": "CuseTown",
        "body": "Racks on racks with SPY QQQ HD CSCO. Should’ve bought yesterday’s dip",
        "created_utc": 1591364958,
        "id": "fsz0gh6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591393758.0
    },
    {
        "author": "Red_Sea_Pedestrian",
        "body": "Would be nice if AMD could take some cues from Cisco.",
        "created_utc": 1591368820,
        "id": "fsz7svj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591397620.0
    },
    {
        "author": "Alex8525",
        "body": "My CSCO calls are 300% up",
        "created_utc": 1591369365,
        "id": "fsz8vj8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591398165.0
    },
    {
        "author": "_DillyPickle_",
        "body": "BA 4 shares\nCCL 2 shares\nCSCO 2 shares \nDAL 2 shares\nDIS 2 shares\nNYMT 2 shares \nPLUG 8 shares\n\nStill new to investing to criticism is welcome, also looking for recommendations for buying.",
        "created_utc": 1591237488,
        "id": "fstfryv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591266288.0
    },
    {
        "author": "Drew707",
        "body": "You know who benefits from Slack?  Zoom.  Would not be surprised at an acquisition.  GOOG, MSFT, and CSCO all have complete ecosystems, but Zoom needs Slack, and Slack shouldn't care about that.",
        "created_utc": 1591304477,
        "id": "fswhglk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591333277.0
    },
    {
        "author": "schplat",
        "body": "ORCL and CSCO are cut from the same cloth.",
        "created_utc": 1591375744,
        "id": "fszm3r0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591404544.0
    },
    {
        "author": "masmith1495",
        "body": "Long Term Dividend Portfolio\n\nLooking for feedback on a recently put together portfolio and possible recommendations and stocks/ETFs to add. Just a start but looking to add shares periodically over time. \n\nTicker/Shares Held/Purchase Price \n\nBOTZ  - 5 - $24.32 (Growth over dividend)\n\nESPO - 5 - $47.76  (Growth over dividend) \n\nSCHD - 5 - $53.90 \n\nCSCO - 5 - $46.19\n\nDAL - 10 - $26.47\n\nDUK - 2 - $86.63\n\nO - 5 - $56.23 \n\nPEP - 1 - $133.84\n\nVZ - 5 - $56.57",
        "created_utc": 1591201580,
        "id": "fsrf06l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591230380.0
    },
    {
        "author": "reddituseranyonymous",
        "body": "Thanks. Im guessing chips and components need to be upgraded for 5G wireless? I bought some CSCO and IBM today",
        "created_utc": 1591206138,
        "id": "fsrosg9",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1591234938.0
    },
    {
        "author": "OT411",
        "body": "I agree, Ford uses Cisco Webex\n\nSame with the university I attend",
        "created_utc": 1591210943,
        "id": "fsrzbk5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591239743.0
    },
    {
        "author": "bobrobor",
        "body": "And CSCO",
        "created_utc": 1591215444,
        "id": "fss92se",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591244244.0
    },
    {
        "author": "HUMPDAY77",
        "body": "Cisco ?",
        "created_utc": 1591055590,
        "id": "fskx6qy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591084390.0
    },
    {
        "author": "MementoMori97",
        "body": "Personally, I would go about 50-75% in a total market or S&amp;P 500 index fund like VTI, VOO, SPY, ITOT, etc. And then use the other 25-50% in high quality companies you like and research. \n\nFor example: 60%-VTI 20%-MSFT 10%-KO 10%XOM\n\n(THIS IS JUST AN EXAMPLE NOT SAYING PICK THESE WITHOUT LOOKING INTO IT)\n\nMy brokerage account currently is ~40% ITOT and the rest is split pretty evenly between Nokia, a clean energy ETF and Cisco, with Cisco having the highest weighting of the three.\n\nJust gotta do your own research and be confident in any individual stocks you pick. Index funds are much safer but still have the potential for corrections and to lose money in the near term.",
        "created_utc": 1591026631,
        "id": "fsjaz7g",
        "score": 1,
        "subreddit": "investing",
        "created": 1591055431.0
    },
    {
        "author": "ChoochMMM",
        "body": "Did anyone else get CSCO calls today?",
        "created_utc": 1591053288,
        "id": "fsksxqs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591082088.0
    },
    {
        "author": "TheAvantGardeners",
        "body": "Plot twist, they use CSCO /s",
        "created_utc": 1591037953,
        "id": "fsjy8mm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591066753.0
    },
    {
        "author": "xRiotZx",
        "body": "CSCO ER",
        "created_utc": 1591069178,
        "id": "fslkyqi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591097978.0
    },
    {
        "author": "That70sUsername",
        "body": "No, it's not driven by a magical expectation. The high price is due to their market penetration, which is unlike any competitor.\n\nI'm not saying it's justified, I honestly have no idea what the true value of this company is, nobody does, but the value in Zoom is so much more than a 'magical expectation'.\n\nTech companies have stickier customers than any other industry in history due to the incredible amounts of data they can collect.\n\nAt a global scale, both on a consumer, business and enterprise level, Zoom has daily analytics on:\n\n- How many video conferences take place\n- Who participates in them\n- Whether they use chat features or just the video/audio\n- How many people are in a meeting\n- How close participants are geographically\n\nHonestly, I could make this list as long as I liked, the data points are endless.\n\nNo other video conference company has such deep penetration across every area of the vidconf market. \n\nThat mix of personal, business and enterprise penetration isn't something anyone else in the market has, and it's so incredibly valuable at a data analytics level. \n\nBeing able to compare and contrast customer behaviours across different contexts unlocks insights that power incredible company growth (see: Facebook)\n\nThis incredible amount of data informs their future product development opportunities, meaning that it's a strong bet that Zoom is going to make better future plays in the technology space than their competitors (e.g. Google, Webex, etc).\n\nNote again that these competitors cover an area of the market each (personal, enterprise), Zoom covers all of it and more.\n\nWhen you combine that with the fact that they have already destroyed every competitor in the space on user experience and customer satisfaction, this puts them at a huge advantage over every other player in the video conference space. \n\nThey came into this space as a startup competing against Microsoft, Cisco and Google, and they're winning by a country mile.\n\nSo when video chats move from 'schedule a call' to an all inclusive platform that handles all communications across audio/video, personal/business, etc, Zoom is going to be the best placed to dominate that huge market.\n\nThis is an equivalent shift in the Telcom industry as the one from dial phones to mobile phones. \n\nIf you're imagining what a shift like that might look like, imagine having cameras from your TV, fridge and various 'IoT enabled' devices around your house that follow you as you talk to people.\n\nImagine having an affordable interactive whiteboard in your house that updates as your video partners write on their own interactive whiteboards.\n\nImagine it get used to plan family trips out as much as it's used to plan corporate strategies.\n\nImagine being able to manipulate AR models on video and share it with the world.\n\nThat all requires a central platform to harness all the data involved and turn it into a user experience. Zoom is better placed to do that than any other company in the world right now.\n\nThat is what it's price is driven by.\n\nAnd all you see is people whining that they had a security breach, as though that can't be fixed (which it has).\n\nEvery company has data breaches, not every company is this well placed to dominate a market that is going to grow like wildfire over the next 20 years.\n\n---------\n\nNow, with all that being said, I still only have 10% of my portfolio in Zoom, even with all this going for it, every company is a 50/50 bet at best. But if I'm gonna pick 10 companies in the world to invest in, Zoom is definitely one of them.",
        "created_utc": 1591259528,
        "id": "fsua1hd",
        "score": 1,
        "subreddit": "investing",
        "created": 1591288328.0
    },
    {
        "author": "grathe",
        "body": "&gt;it's not CFA analysts who need to come around. It's the current shareholders who already bought at \"inflated\" valuations.\n\nNot at all. If (when?) the big boys decide to dump, current buying demand will not be near enough to maintain the prices.\n\nRight now they are slowly unloading to not scare off the buyers.\n\nI think of these stocks kind of like CSCO in 2000",
        "created_utc": 1591334870,
        "id": "fsxz45v",
        "score": 1,
        "subreddit": "investing",
        "created": 1591363670.0
    },
    {
        "author": "WaitingForGateaux",
        "body": "Why are webcasts for cloud/networking always the glitchiest? The WORK call quality sucks. CLDR yesterday sucked. CSCO sucked, HPE sucked. \n\nAre \"undocumented shoppers\" looting optical fiber in California?",
        "created_utc": 1591305754,
        "id": "fswk4e3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591334554.0
    },
    {
        "author": "jonnydoo84",
        "body": "I have a good amount of Cisco shares, but webex kind of sucks.",
        "created_utc": 1591232866,
        "id": "fst7kak",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591261666.0
    },
    {
        "author": "burninTsherman",
        "body": "Cisco, Google and Microsoft are better alternatives.",
        "created_utc": 1591140390,
        "id": "fsou1ow",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591169190.0
    },
    {
        "author": "GreatMidnight",
        "body": "This literally doesn't matter. Even if webex goes to zero Cisco will just sell more routers for the increased voice and video traffic required on the networks.",
        "created_utc": 1591143871,
        "id": "fsp0e6y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591172671.0
    },
    {
        "author": "oldskol_d",
        "body": "Don't short CSCO based on this post.  Pre-pandemic many entities were moving away from WebEx due to the introduction  of numerous lower cost upstarts.  The fact that ops company didn't realize that WebEx was a premium product, reserved for external meetings, until the third month of the pandemic indicates that we should short his firm.",
        "created_utc": 1591112770,
        "id": "fsn8r8g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591141570.0
    },
    {
        "author": "rlv28",
        "body": "MSFT 16.63%\n\nCSCO 3.66%\n\nWFC 2.25%\n\nV 11.52%\n\nAAPL 16.49%\n\nWM 4.73%\n\nAMZN 38.68%\n\nSCHF 5.97%\n\nAll positions in Roth IRA",
        "created_utc": 1591218595,
        "id": "fssfpic",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591247395.0
    },
    {
        "author": "icantfindanametwice",
        "body": "Fake dd- source: am former Cisco contractor live with ex webex employee and know many who went from csco to Zoom.\n\nWebex or WebEx is how it’s written internally always, never hyphenated. Check the Cisco billboard on 880 in the Bay Area close to Cisco’s campus.\n\nThen again, I’m a random internet punter who didn’t take the time to do crappy photoshop. So never mind, go buy.",
        "created_utc": 1591105636,
        "id": "fsmux48",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591134436.0
    },
    {
        "author": "Rocfranklogjam001",
        "body": "Some context. This is only one company but it is the third largest company in its market sector. Not sure what percentage web-ex is for csco but I would imagine it’s a reasonable portion. Every company I have worked for used Web-ex  on MS systems. I see this change moving through a lot of industries especially with the high number of MS system users.",
        "created_utc": 1591103588,
        "id": "fsmrhlh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591132388.0
    },
    {
        "author": "steatorrhoea",
        "body": "323 million in revenue \n\nAnd net revenue 27 million \n\nSchools opening up. FB, MSFT, Whatsapp, Cisco, and the tom’s mom have the same tech prepacked for much cheaper (or free) with more security. \n\nLet’s just assume the stars are going to keep aligning for zoom and growth is sustained.",
        "created_utc": 1591160918,
        "id": "fspsq26",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591189718.0
    },
    {
        "author": "facehuggerpoop",
        "body": "CSCO hardly moves for anything.\n\nUnless those calls are far out to avoid theta burn, don’t.",
        "created_utc": 1591022589,
        "id": "fsj3mlq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591051389.0
    },
    {
        "author": "xRiotZx",
        "body": "All memory data used to support servers for companies like ZM, CSCO, MSFT, etc is manufactured by MU.",
        "created_utc": 1591027238,
        "id": "fsjc6tt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591056038.0
    },
    {
        "author": "HiMyNamesEvan",
        "body": "Cisco",
        "created_utc": 1591073685,
        "id": "fslrv33",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591102485.0
    },
    {
        "author": "inb4ElonMusk",
        "body": "I've never used either. WebEx a few times but that's it. I just don't see how ZM could ever compete with Microsoft or Cisco on the pricing long term.",
        "created_utc": 1591116081,
        "id": "fsnfm48",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591144881.0
    },
    {
        "author": "SirPickleSwanson",
        "body": "Csco pump",
        "created_utc": 1591127471,
        "id": "fso3tjs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156271.0
    },
    {
        "author": "mpbh",
        "body": "Like I said, for our 300k population WebEx was cheaper. Zoom doesn't have the same volume discount that Cisco offered.",
        "created_utc": 1591131532,
        "id": "fsocj7x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591160332.0
    },
    {
        "author": "Investinwaffl3s",
        "body": "that is hilarous\n\nI am holding CSCO so good for me, LOL",
        "created_utc": 1591130861,
        "id": "fsob4gy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591159661.0
    },
    {
        "author": "WSBnoobxor",
        "body": "Probably move as slow as Well and Cisco",
        "created_utc": 1591133161,
        "id": "fsofx6q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591161961.0
    },
    {
        "author": "azwel",
        "body": "i see they own  \n\n* Microsoft Corporation 18.51%\n* Apple Inc.\n* Visa Inc. Class A 4.15%\n* Intel Corporation 3.81%\n* Mastercard Incorporated Class A 3.51%\n* Cisco Systems, Inc.\n* Adobe Inc.\n* NVIDIA Corporation 2.48\n\nI Have a lot of those.  A couple like cisco  adobe, nvidia, i dont have.  I could either buy those few,  or just this etf..",
        "created_utc": 1591126310,
        "id": "fso1bpq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591155110.0
    },
    {
        "author": "sgt_warturkey",
        "body": "Sitting on the sidelines is the worst thing you can do. If you're really that risk averse, at least buy some Vanguard fund or get Wells Fargo, Coke and Cisco while they're still kind of on sale.",
        "created_utc": 1591167668,
        "id": "fsq1dse",
        "score": 1,
        "subreddit": "investing",
        "created": 1591196468.0
    },
    {
        "author": "wimmelbuilder",
        "body": "My take is Zoom will slowly get eroded over a few years and then get bought out by Cisco or HPE where all enterprise software go to die",
        "created_utc": 1591179349,
        "id": "fsqe67p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591208149.0
    },
    {
        "author": "GreatMidnight",
        "body": "John Chambers once said after the Tandberg acquisition that for every dollar of video revenue, Cisco would see 9 dollars of route-switch and now wireless. Anything that drives more traffic over the network increases the sales of Cisco for the enterprise as well as the backbone provider.",
        "created_utc": 1591147179,
        "id": "fsp697b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591175979.0
    },
    {
        "author": "RIC_FLAIR-WOOO",
        "body": "I prefer QQQ but if you want strictly \"tech\", I guess VGT is pretty good too.  I wish QQQ didn't hold so much stinker CSCO, though.",
        "created_utc": 1591291306,
        "id": "fsvouyg",
        "score": 1,
        "subreddit": "investing",
        "created": 1591320106.0
    },
    {
        "author": "ChoochMMM",
        "body": "Anyone have CSCO calls?",
        "created_utc": 1591280500,
        "id": "fsv276u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591309300.0
    },
    {
        "author": "thebiggdirtyy",
        "body": "Never bought into draftkings due to the volatile nature of it.\n\nWent with Cisco, Microsoft, shaw and Onex\n\nUp 5% total portfolio since April 11th and I'm happy",
        "created_utc": 1591330842,
        "id": "fsxt9e1",
        "score": 1,
        "subreddit": "investing",
        "created": 1591359642.0
    },
    {
        "author": "Jwceltic5",
        "body": "Some ideas for chipmakers - TSM, LRCX, KLAC",
        "created_utc": 1591204158,
        "id": "fsrkhl2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591232958.0
    },
    {
        "author": "mechtech",
        "body": "&gt; I shorted the market when Apple initially reported supply chain problems back in early February and turned 15k into 130k\n\nHah, I did exactly the same thing. Turned 5k into 100k in an old brokerage account through Apple puts at the start of the crash. Once South Korea and Samsung facilities got hit with COVID I figured there would be (warranted) doomsday predictions about tech supply chains that would hit AAPL.\n\nI did end up catching the bottom though in another account. SABR @ 3, CPRI @ 6, LEAPS on VTR @ 15. Those were the core buys when the market was at peak liquidation. That account was managed into a more balanced COVID-recovery portfolio. Still very heavy on SABR and CPRI.\n\nHere are some of the current holdings: https://i.imgur.com/IAiV8gp.png. It's admittedly an absolute mess because it's all locked in a brokerage account that none of this should have taken place in. The market was literally down 10% and my main trading account was in a hilariously bad margin call while I was on the phone with someone asking \"is the world ending\", so the set of buys at market bottom were extremely haphazard and chaotic. Meanwhile, tech is my wheelhouse yet I happened to be about to pull the trigger on luxury clothing (which I know *absolutely* nothing about) because it's apparently trading at half of its bankruptcy value and buys needed to happen within a window of the next few minutes as the -10% market was turning. Just an absurd day. Things may have literally been on fire as far as my memory serves. Soon it will be in an IB portfolio margin account with proper management tools though.\n\nSo the path has been: Set of random equities and options from the SPY 2200 market bottom -&gt; Scaling out of those positions and buying Quality/Tech (asml, lrcx, nok, sbux, oled , chl were the buys in the weeks after the bottom) -&gt; Value COVID recovery/\"return to normalcy\" stocks (brk, bx, banks, txrh, cxw, vwagy, dfs, banks). There's also been some side ventures in there like buying CLMT and XOM during the negative oil event, and those won't be held long term.\n\nLots of options not showing there as well. Collars on positions, covered calls, 200k short nasdaq hedge. Basically locking in the profits and marching towards neutral until the positions can move over to the PM margin account and it can turn into something actually sane.\n\nA lot of that stuff is probably going to be gone by next friday and sold into the rotation. dfs up 10% today, sabr up 12%, txrh up 8%, Well +7%, VTR +10%, CXW +6%... Today was the exact day that that list of stocks was positioned for. There was a 4 sigma move into value a few weeks ago that I took to be a canary in the coal mine for the rotation. Looked like a quake from quant funds moving factors around. Not sure what's next. It's probably time to focus on the insane quarterly reports we're about to get, and start actually paying attention to the real economy and things like the +600 unemployment checks rolling off and the unemployment trajectory. Maybe just step out of the way until that all picks trends.\n\nThere are still many laggards to pick out but they by and large have debt loads that carry a very real bankruptcy risk, and some extreme exposure to COVID and lockdowns (restaurants, entertainment, companies like SABR that provide the back-end for flight booking). So they come with a bundle of esoteric and disastrous tail risks, but honestly, some of the common risk exposures like consumer credit risk, commercial real estate, etc aren't rocket science to hedge against. Most of this stuff is not something I'd want to leave alone without watching charts for even a day though, even in a decently hedged portfolio.",
        "created_utc": 1591210114,
        "id": "fsrxhjt",
        "score": 1,
        "subreddit": "investing",
        "created": 1591238914.0
    },
    {
        "author": "anomander_rake123",
        "body": "Hitting my head against the wall for selling my lam research calls yday",
        "created_utc": 1591193364,
        "id": "fsqy3hb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591222164.0
    }
]