[
    {
        "author": "IllegalArgument",
        "body": "First time watching Mad Money ever. Jim Cramer is unintelligible. He slurs all of his words together and has the weirdest cadence and intonation patterns.",
        "created_utc": 1582067742,
        "id": "fi1yyw6",
        "permalink": "/r/wallstreetbets/comments/f5yqz8/what_are_your_moves_tomorrow_february_19_2020/fi1yyw6/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1582096542.0
    },
    {
        "author": "_J0hn_",
        "body": "&gt; I put $1,000 into the Target Retirement 2060 Fund, but I feel like it's more reasonable to retire in 2065 now. :(\n\nThe difference will barely be measurable. \n\n&gt; Additionally, I want to be a bit more aggressive. I want to jump into VTSMX and VFINX.\n\nYou already own VTSMX in your target date fund.\n\n&gt; Can I allocate money for Target Retirement 2065 Fund, Target Retirement 2060 Fund, FTSMX, and VFINX separately?\n\nYes you can but that's stupid.  Target Date Funds are all-in-one fire-and-forget investing strategies.  It makes zero sense to buy both 2060 and 2065 when they are 100% exactly the same except for their *slightly* different glide path that you won't even see for several decades.  VTSMX and VFINX track nearly identically over the long term and their top holdings are basically the same.  There is ZERO reason to have both.  Pick one.  Or pick neither since you *already* own VTSMX in your TD fund.\n\nAs far as being aggressive...90% stocks (as your TD fund dictates) is *very* aggressive.  There is ~~no added~~ barely any measurable benefit to going to &gt;90% stocks.  Best strategy is pick ONE target date fund and keep contributing to it every year (or whatever your investing cadence will be).",
        "created_utc": 1581541121,
        "id": "fhfdcxu",
        "permalink": "/r/investing/comments/f2qav9/daily_advice_thread_all_basic_help_or_advice/fhfdcxu/",
        "score": 2,
        "subreddit": "investing",
        "created": 1581569921.0
    },
    {
        "author": "ButtFart88",
        "body": "Manchurian Pete is just Obama 2.0. Smooth cadence with nothing of value.",
        "created_utc": 1582167704,
        "id": "fi5p4bm",
        "permalink": "/r/wallstreetbets/comments/f6hd6q/what_are_your_moves_tomorrow_february_20_2020/fi5p4bm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582196504.0
    },
    {
        "author": "USTS2020",
        "body": "Buttigieg talks with the cliche politician cadence and tone, almost like he's trying to mimic Obama",
        "created_utc": 1582168376,
        "id": "fi5q9ht",
        "permalink": "/r/wallstreetbets/comments/f6hd6q/what_are_your_moves_tomorrow_february_20_2020/fi5q9ht/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582197176.0
    },
    {
        "author": "skwirly715",
        "body": "The answer to this question mostly depends on the time frame you are looking at for results. \n\nIf you mean short term, trying to make a trade, the market is testing support so check over the next 3 closes to determine which way it will break and trade on that. \n\nIf you are looking long term, you should be depositing &amp; investing regularly and as scheduled regardless of market health and rebalancing on a wider cadence. This dip wouldn’t affect you much, as you’re going to buy anyway and you can afford to wait a couple of weeks to see if you need to make a significant rebalance into bonds/gold (if bear) or maintain your balance (if bull).",
        "created_utc": 1582564592,
        "id": "finjpor",
        "permalink": "/r/stocks/comments/f8qhow/dow_futures_drop_680_points_as_coronavirus_cases/finjpor/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1582593392.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 11th of February\n\n\n\n## Upcoming events for Tuesday, February 11th\n\n - Expected earnings:\n\n  AAT, ACCO, ACGL, ADPT, AIZ, AKAM, AKRO, ALIM, AMCR, AMX, AN, ARA, ASC, ATEN, AXLA, AZRE, BCEL, BE, BFIN, BIOX, BXMT, CCR, CEIX, CNO, CPAC, CPSI, CPSS, CRL, CRNC, CRTO, CRTX, CTO, CVET, D, DBD, DCP, DEI, DENN, DIOD, DTIL, EEFT, ELMD, EXAS, EXC, FLOW, FSP, GPMT, GRPN, GT, GTIM, HAS, HCAT, HCSG, HLT, HOOK, IAA, INGR, IRTC, ISR, JLL, KRNT, LCII, LPX, LSCC, LYFT, MAS, MLM, MMYT, MORF, MWK, NCR, NGM, NMIH, NNN, NSP, NXTC, OMC, ONDK, PEAK, PKD, PNTG, PRI, PRVL, PSN, PTN, REXR, SANW, SCCO, SEE, SFST, SILK, SQNS, ST, STOK, STSA, SWTX, TGB, TGH, TGNA, TGTX, TH, TSU, UA, UAA, UDR, USFD, VIRT, VNOM, VREX, VTGN, WTRE, WU, XGN\n\n - Ex-div:\n\n  BFIN, BOKF, CEN, ECC, EIC, FOF, GWB, HOMB, INF, INVH, LDP, LEVI, LGI, MDC, MIE, MKTX, MSA, NFBK, PSF, RA, RNP, SASR, SIRI, SLB, TESS, TTEK, UTF, VLO, WETF, WINA, WNEB\n\n - Economic events and announcements:\n\n    - 3-Year Note Auction (previous: 1.567%)\n    - API Weekly Crude Oil Stock (previous: 4.180M)\n    - FOMC Member Bullard Speaks\n    - FOMC Member Kashkari Speaks\n    - FOMC Member Quarles Speaks\n    - Fed Chair Powell Testifies\n    - JOLTs Job Openings (consensus: 7.000M, previous: 6.800M)\n    - NFIB Small Business Optimism (consensus: 103.4, previous: 102.7)\n    - Redbook (previous: 0.2%)\n    - Redbook (previous: 5.7%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, February 12th\n\n - Stock splits:\n\n    - NVIV @ **1:30**\n\n - Expected earnings:\n\n  AB, ACEL, AEL, AKR, AM, AMAT, ANDE, APLT, AR, ARCC, ASGN, ATOM, ATUS, AVLR, BCOV, BG, BLBD, BRKR, BSGM, CDNS, CF, CHEF, CHNG, CIDM, CIGI, CIM, CME, CODX, COHU, COWN, CPA, CRWS, CSCO, CSTE, CTL, CTRE, CVE, CVS, CX, CXW, CYBR, CYRN, DISH, DMAC, DSSI, DYAI, DYNT, ECOM, EFC, EFX, EQC, EQIX, EQX, FCPT, FET, FGBI, FOSL, FR, FTSI, GEO, GOLD, GOOD, GPN, HR, HUBS, IBN, IDYA, IFF, IPG, IQV, IRT, JHX, JMP, JRSH, KAI, KALA, KGC, KLDO, KMDA, LAD, LPI, LPL, LTRX, MCHX, MCO, MFC, MGM, MIRM, MIST, MNOV, MRO, NBL, NBLX, NESR, NLY, NPO, NSIT, NTAP, NTB, NTWK, NUS, NWE, OIS, OSW, PEGA, PERI, PGRE, PROS, PRSP, PRTA, PRTH, PS, PSNL, PSTI, PTSI, QDEL, QLYS, QUIK, QUOT, RDFN, RDWR, REG, RLMD, RUSHA, RYAM, SHOP, SLF, SLGG, SONM, SPWR, SSNC, STAG, TAP, TCO, TCX, TEVA, TGE, TMDI, TMDX, TRIP, TRMB, TRNO, TRVG, TTGT, TW, TYL, UE, VCTR, VERU, VNDA, VXRT, WCN, WELL, WNC\n\n - Ex-div:\n\n  ACV, ADM, AIO, AMG, ARMK, BSIG, CBH, DBL, DSE, DSL, EFL, EHT, ELY, ETR, EVF, GDV, GNT, GUT, HPF, HPI, HPS, HTD, IVH, IVZ, NCV, NCZ, OMP, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RMD, SIMO, STBA, TBNK, TJX, VGI, ZION, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.869%)\n    - Crude Oil Imports (previous: 0.051M)\n    - Crude Oil Inventories (consensus: 2.931M, previous: 3.355M)\n    - Cushing Crude Oil Inventories (previous: 1.068M)\n    - Distillate Fuel Production (previous: -0.003M)\n    - EIA Refinery Crude Runs  (previous: 0.048M)\n    - EIA Weekly Distillates Stocks (consensus: -0.633M, previous: -1.512M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.3%, previous: 0.2%)\n    - FOMC Member Harker Speaks\n    - Fed Chair Powell Testifies\n    - Federal Budget Balance (consensus: -11.5B, previous: -13.3B)\n    - Gasoline Inventories (consensus: 0.667M, previous: -0.091M)\n    - Gasoline Production (previous: 0.745M)\n    - Heating Oil Stockpiles (previous: -0.014M)\n    - MBA 30-Year Mortgage Rate (previous: 3.71%)\n    - MBA Mortgage Applications (previous: 5.0%)\n    - MBA Purchase Index (previous: 283.8)\n    - Mortgage Market Index (previous: 682.0)\n    - Mortgage Refinance Index (previous: 2,975.7)\n    - OPEC Monthly Report\n    - Thomson Reuters IPSOS PCSI (previous: 63.42)\n\n## Upcoming events for Thursday, February 13th\n\n - Expected earnings:\n\n  AAN, ACOR, ACST, AEG, AEM, AER, AGIO, AIG, AIMC, AKG, ALE, ALKS, ALYA, AMN, ANET, APRE, ARES, ARI, ARR, AUY, AYR, AYX, BABA, BAX, BCOR, BCS, BFAM, BIO, BKI, BL, BPMC, BRG, BWA, CARG, CBB, CC, CCEP, CERC, CGNX, CPS, CRY, CS, CTT, CTXR, CVM, CXP, CZNC, DAN, DAVA, DDOG, DLPH, DLR, DUK, DXCM, EEX, EQM, ETRN, EVLO, EXPE, FAF, FIS, FNF, FORR, FTS, FULC, GDDY, GLOB, GNCA, GNRC, GTLS, HE, HII, HIMX, HTA, HUN, ICL, IMAC, INCY, IPGP, IRM, IRWD, KELYA, KHC, KPTI, LBTYA, LECO, LH, LIN, LOGM, LPSN, MANU, MAT, MERC, MFG, MHK, MRC, MTRN, NBEV, NBSE, NEPT, NET, NEXA, NGD, NICE, NKSH, NMRK, NVDA, NVMI, OMN, OTLK, PATK, PBF, PBFX, PDFS, PDS, PEP, POOL, PVG, R, RARE, RDCM, REPL, ROKU, RSG, RWT, SAFE, SITC, SMP, SON, SPSC, SPXC, SRTS, SSTK, SVMK, SWAV, SWIR, TEX, THS, TLND, TNET, TPX, TRP, TRUP, TRVI, TRWH, TU, TUFN, UROV, VECO, VIE, WEX, WH, WM, WRE, WRTC, WSO, WST, YCBD, YELP, YETI, ZBRA, ZTS\n\n - Ex-div:\n\n  ABC, ADS, ADX, AFT, AGCO, AGN, AHC, AIF, AIT, AIV, ALE, AMGN, AMP, APAM, ARR, AVK, AWR, BA, BAF, BAH, BBF, BBK, BBN, BCX, BDJ, BFK, BFO, BFST, BFY, BFZ, BG, BGIO, BGR, BGT, BGY, BHK, BHLB, BHV, BIT, BKH, BKK, BLE, BLW, BME, BNY, BOE, BP, BQH, BRKL, BSD, BSE, BSET, BSM, BST, BSTZ, BTA, BTT, BTZ, BUI, BWFG, BYM, BZM, CCD, CF, CGO, CHD, CHI, CHW, CII, CLCT, COP, CORR, CPZ, CSQ, DCI, DRE, DUK, EBMT, EDF, EDI, EGF, EMR, ENB, EQT, EVA, FBK, FCCY, FCFS, FDEF, FINS, FMO, FNHC, FRA, FRBA, FSB, GBAB, GCBC, GEO, GGM, GHY, GOF, GRC, GWRS, HA, HTH, HTLF, HXL, HYT, IHIT, INN, ISD, JBL, JCO, JEF, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LEO, LLY, LNN, LSTR, MCA, MEN, MHD, MMD, MMM, MMS, MNE, MOG.A, MOG.B, MSBI, MSEX, MSVB, MTX, MUE, MUI, MUS, NAC, NAD, NAN, NBB, NCB, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NXST, NYV, NZF, OBNK, ODC, OPP, OPY, OSK, OTTR, OXLC, OXSQ, PBI, PCSB, PEO, PER, PFS, PFSI, PGZ, PKOH, PSTL, PZN, RBA, RDS.A, RDS.B, RIV, RMI, RMM, RSF, SAL, SALT, SBRA, SCHW, SIGI, SJM, SJR, SMBC, SMP, SONA, SPG, SRF, SRV, SSBI, SZC, TAIT, TCF, TECH, TFC, TSBK, UTL, UTX, V, VBF, VTA, VVR, WEC, WRK, WTRG, XEC, YUM\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.341%)\n    - 4-Week Bill Auction (previous: 1.540%)\n    - 8-Week Bill Auction (previous: 1.550%)\n    - CPI (consensus: 0.2%, previous: 0.2%)\n    - CPI (consensus: 2.4%, previous: 2.3%)\n    - CPI Index, n.s.a. (consensus: 257.86, previous: 256.97)\n    - CPI Index, s.a (previous: 258.50)\n    - CPI, n.s.a (previous: -0.09%)\n    - Cleveland CPI (previous: 0.2%)\n    - Continuing Jobless Claims (consensus: 1,745K, previous: 1,751K)\n    - Core CPI (consensus: 0.2%, previous: 0.1%)\n    - Core CPI (consensus: 2.2%, previous: 2.3%)\n    - Core CPI Index (previous: 265.92)\n    - Initial Jobless Claims (consensus: 210K, previous: 202K)\n    - Jobless Claims 4-Week Avg. (previous: 211.75K)\n    - Natural Gas Storage (previous: -137B)\n    - Real Earnings (consensus: 0.1%, previous: -0.1%)\n\n## Upcoming events for Friday, February 14th\n\n - Stock splits:\n\n    - PKBK @ **110:100** (Payable date: 03/03/2020)\n\n - Expected earnings:\n\n  ABR, AL, AXL, AZN, BLX, CGC, ENB, ESNT, GNLN, HDB, IMGN, INMB, MGP, NWL, PIXY, POR, PPL, PVL, RWLK, SXT, TRTN, YNDX\n\n - Ex-div:\n\n  ALK, AUDC, CABO, CADE, CE, CG, CHCT, COTY, CTSH, CURO, CVX, DHT, DLX, ECT, FDBC, FTS, GIM, GLOP, HBI, HIW, JHG, KMPR, LAZ, LYTS, MC, MNR, MUR, NATI, PCF, PEAK, PFLT, PROV, PRU, PSX, PTMN, ROK, SBR, SO, SPB, SWX, SXC, TEI, TSLF, UI, UMH, WMK, WWD\n\n - Economic events and announcements:\n\n    - Business Inventories (consensus: 0.1%, previous: -0.2%)\n    - CFTC Aluminium speculative net positions (previous: -58.9K)\n    - CFTC Copper speculative net positions (previous: -14.4K)\n    - CFTC Corn speculative net positions (previous: 73.4K)\n    - CFTC Crude Oil speculative net positions (previous: 461.8K)\n    - CFTC Gold speculative net positions (previous: 330.1K)\n    - CFTC Nasdaq 100 speculative positions (previous: 24.4K)\n    - CFTC Natural Gas speculative net positions (previous: -261.5K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 16.8K)\n    - CFTC Silver speculative net positions (previous: 63.4K)\n    - CFTC Soybeans speculative net positions (previous: -6.3K)\n    - CFTC Wheat speculative net positions (previous: 41.1K)\n    - Capacity Utilization Rate (consensus: 76.8%, previous: 77.0%)\n    - Core Retail Sales (consensus: 0.3%, previous: 0.7%)\n    - Export Price Index (consensus: -0.1%, previous: -0.2%)\n    - Export Price Index (previous: -0.7%)\n    - FOMC Member Mester Speaks\n    - Import Price Index (consensus: -0.2%, previous: 0.3%)\n    - Import Price Index (previous: 0.5%)\n    - Industrial Production (consensus: -0.2%, previous: -0.3%)\n    - Industrial Production (previous: -1.01%)\n    - Manufacturing Production (consensus: -0.1%, previous: 0.2%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.50%)\n    - Michigan Consumer Expectations (consensus: 90.3, previous: 90.5)\n    - Michigan Consumer Sentiment (consensus: 99.5, previous: 99.8)\n    - Michigan Current Conditions (consensus: 115.0, previous: 114.4)\n    - Michigan Inflation Expectations (previous: 2.5%)\n    - Retail Control (consensus: 0.3%, previous: 0.5%)\n    - Retail Inventories Ex Auto (previous: -0.2%)\n    - Retail Sales (consensus: 0.3%, previous: 0.3%)\n    - Retail Sales (previous: 5.82%)\n    - Retail Sales Ex Gas/Autos (previous: 0.5%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 676)\n    - U.S. Baker Hughes Total Rig Count (previous: 790)\n\n^^^^2020-02-11",
        "created_utc": 1581418811,
        "id": "fhamyv8",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fhamyv8/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1581447611.0
    },
    {
        "author": "r1senfa17h",
        "body": "WHO guy: \"This. is not. a time. for fear. This. is not. a time. for panic.\" \\[periods added to emphasize cadence of his accent\\].\n\nI feel like the WHO is just China's PR department now. O well, at least stonks go up.",
        "created_utc": 1580916078,
        "id": "fgm1kmf",
        "permalink": "/r/wallstreetbets/comments/ez7z3h/daily_discussion_thread_february_05_2020/fgm1kmf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580944878.0
    },
    {
        "author": "dacv393",
        "body": "Yeah I meant less latency than the current satellites. But also in those certain cases it could possibly be lower than ever traditional over the wire signal. Not suggesting that's going to be the selling point for the average user, since yeah CDNs and stuff, although I do remember reading how financial institutions in certain places (like London I think) would pay top dollar for some sort of dedicated channel on Starlink/LEO sat internet since those couple ms of lower latency could mean millions for high frequency trading or other stuff when trading in foreign markets",
        "created_utc": 1581086125,
        "id": "fgsjsys",
        "permalink": "/r/investing/comments/ezwjdt/musks_spacex_plans_a_spinoff_ipo_for_starlink/fgsjsys/",
        "score": 1,
        "subreddit": "investing",
        "created": 1581114925.0
    },
    {
        "author": "ayngaran12",
        "body": "Foamix, CRSP, NVDIA, AIMT, SNE, CDNS. I am very confident in these stocks, have been primarily bullish on gold miners for the last month and a half and researched a lot of companies in that time period and this are the opportunities I see right now on my watchlist.",
        "created_utc": 1582319986,
        "id": "fibe0kb",
        "permalink": "/r/stocks/comments/f7dfpb/who_are_you_buying_on_discount_right_now/fibe0kb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1582348786.0
    },
    {
        "author": "dWog-of-man",
        "body": "When’s the launch cadence increase to more than once per month?",
        "created_utc": 1581990580,
        "id": "fhz4cr9",
        "permalink": "/r/wallstreetbets/comments/f5ipa4/spce_bears_go_away/fhz4cr9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582019380.0
    },
    {
        "author": "HeAbides",
        "body": "Around the late 90s, it became incredibly popular to increase operational efficiency (a.k.a. dollars made per dollars spent) by minimizing the amount of overhead through efficient supply chains. This is frequently referred to as [the Toyota way](https://en.wikipedia.org/wiki/The_Toyota_Way), but commonly implemented under the auspices of [Lean Six Sigma](https://en.wikipedia.org/wiki/Lean_Six_Sigma).\n\n If you have a supply chain where you just order tons of materials have have them waiting for a long time in a warehouse to be used when you need them, your company is paying for more materials than it \"needs to\". Under perfect conditions, you get just the amount of materials that you need to keep production going for the short term, and replenish on a higher cadence. As long as you have reliable supply chains, this greatly reduces overhead, since you \"own\" a lot less of the components of your product at any given time.\n\nOver the past two decades, manufacturing companies have greatly reduced component inventories in keeping with these principals, rather moving towards receiving these components with as little time to spare as possible (a.k.a. [just-in-time](https://en.wikipedia.org/wiki/Just-in-time_manufacturing). This looks great for upper management under smooth conditions. The profits go up without selling any more product! ....However, it also means that if a supplier disruption occurs, you have far, far less time to react or find an alternate. It makes supply chains less robust to disruptions, as there is no slack in the system. No warehouses of parts than can cover the gap.\n\nI sincerely think this outbreak will cause global companies to reevaluate the risk-reward of lean manufacturing.",
        "created_utc": 1582045169,
        "id": "fi0uqhp",
        "permalink": "/r/wallstreetbets/comments/f5seog/sars_vs_coronavirus_why_its_different_this_time/fi0uqhp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582073969.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 12th of February\n\n\n\n## Upcoming events for Wednesday, February 12th\n\n - Stock splits:\n\n    - FIRZF @ **1:10**\n    - CNRMF @ **1:2**\n    - NVIV @ **1:30**\n\n - Expected earnings:\n\n  AB, ACEL, AEL, AKR, AM, AMAT, ANDE, APLT, AR, ARCC, ASGN, ATOM, ATUS, AVLR, BG, BLBD, BRKR, BSGM, CDNS, CF, CHEF, CHNG, CIDM, CIGI, CIM, CME, CODX, COHU, COWN, CPA, CRWS, CSCO, CSTE, CTL, CTRE, CVE, CVS, CX, CXW, CYBR, CYRN, DISH, DMAC, DSSI, DYAI, DYNT, ECOM, EDRY, EFC, EFX, EQC, EQIX, EQX, FCPT, FET, FGBI, FOSL, FR, FTSI, GEO, GOLD, GOOD, GPN, HR, HUBS, IBN, IDYA, IFF, IPG, IQV, IRT, JHX, JMP, KAI, KALA, KGC, KLDO, KMDA, LAD, LPI, LPL, LTRX, MCHX, MCO, MFC, MGM, MIRM, MIST, MNOV, MRO, NBL, NBLX, NESR, NLY, NPO, NSIT, NTAP, NTB, NTWK, NUS, NWE, OIS, OSW, PEGA, PERI, PGRE, PROS, PRSP, PRTA, PRTH, PS, PSNL, PSTI, PTSI, QDEL, QLYS, QUIK, QUOT, RDFN, RDWR, REG, RLMD, RUSHA, RYAM, SHOP, SLF, SLGG, SONM, SPWR, SSNC, STAG, TAP, TCX, TEVA, TGE, TMDI, TMDX, TRIP, TRMB, TRNO, TRVG, TTGT, TW, TYL, UE, VCTR, VERU, VNDA, VXRT, WCN, WELL, WNC\n\n - Ex-div:\n\n  ACV, ADM, AIO, AMG, ARMK, BSIG, CBH, DBL, DSE, DSL, EFL, EHT, ELY, ETR, EVF, GDV, GNT, GUT, HPF, HPI, HPS, HTD, IVH, IVZ, NCV, NCZ, OMP, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RMD, SIMO, STBA, TBNK, TJX, VGI, ZION, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.869%)\n    - Crude Oil Imports (previous: 0.051M)\n    - Crude Oil Inventories (consensus: 2.987M, previous: 3.355M)\n    - Cushing Crude Oil Inventories (previous: 1.068M)\n    - Distillate Fuel Production (previous: -0.003M)\n    - EIA Refinery Crude Runs  (previous: 0.048M)\n    - EIA Weekly Distillates Stocks (consensus: -0.557M, previous: -1.512M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.4%, previous: 0.2%)\n    - FOMC Member Harker Speaks\n    - Fed Chair Powell Testifies\n    - Federal Budget Balance (consensus: -11.5B, previous: -13.3B)\n    - Gasoline Inventories (consensus: 0.546M, previous: -0.091M)\n    - Gasoline Production (previous: 0.745M)\n    - Heating Oil Stockpiles (previous: -0.014M)\n    - MBA 30-Year Mortgage Rate (previous: 3.71%)\n    - MBA Mortgage Applications (previous: 5.0%)\n    - MBA Purchase Index (previous: 283.8)\n    - Mortgage Market Index (previous: 682.0)\n    - Mortgage Refinance Index (previous: 2,975.7)\n    - OPEC Monthly Report\n    - Thomson Reuters IPSOS PCSI (previous: 63.42)\n\n## Upcoming events for Thursday, February 13th\n\n - Expected earnings:\n\n  ACOR, ACST, AEG, AEM, AER, AGIO, AGTC, AIG, AIMC, AIRI, AKG, ALE, ALKS, ALYA, AMAG, AMN, ANET, APRE, ARES, ARI, ARR, AUY, AYR, AYTU, AYX, BABA, BAX, BBIO, BCS, BFAM, BIO, BKI, BL, BPMC, BRG, BWA, CARG, CBB, CC, CCEP, CERC, CGNX, CRY, CS, CTT, CTXR, CXP, CZNC, DAN, DAVA, DDOG, DLPH, DLR, DUK, DXCM, EEX, EPIX, EQM, ETRN, EVLO, EXPE, FAF, FIS, FNF, FORR, FTS, FULC, GDDY, GLOB, GNCA, GNRC, GTLS, HE, HII, HIMX, HTA, HUN, ICL, IGMS, IMAC, INCY, IPGP, IRM, IRWD, JRSH, KELYA, KHC, KPTI, KRTX, KTB, KTOV, LBTYA, LECO, LH, LIN, LLEX, LOGM, LPSN, MANU, MAT, MERC, MFG, MHK, MR, MRC, MTRN, NBEV, NBSE, NEPT, NET, NEXA, NGD, NICE, NKSH, NMRK, NVDA, NVMI, OMN, ONVO, OTLK, PATK, PBF, PBFX, PDFS, PDS, PEP, PLSE, POOL, PROF, PZG, R, RARE, RDCM, REPL, ROKU, RSG, RWT, SAFE, SAND, SCPL, SCU, SEEL, SITC, SMP, SNN, SON, SPSC, SPXC, SRTS, SSTK, SVMK, SWAV, SWIR, TEX, THS, TLND, TNET, TPCO, TPX, TRP, TRUP, TRVI, TRWH, TU, TUFN, UROV, VECO, VIE, WEX, WH, WM, WRE, WRTC, WSO, WST, XCUR, XFOR, YCBD, YELP, YETI, ZBRA, ZTS\n\n - Ex-div:\n\n  ABC, ADS, ADX, AFT, AGCO, AGN, AHC, AIF, AIT, AIV, ALE, AMGN, AMP, APAM, ARR, AVK, AWR, BA, BAF, BAH, BBF, BBK, BBN, BCX, BDJ, BFK, BFO, BFST, BFY, BFZ, BG, BGIO, BGR, BGT, BGY, BHK, BHLB, BHV, BIT, BKH, BKK, BLE, BLW, BME, BNY, BOE, BP, BQH, BRKL, BSD, BSE, BSET, BSM, BST, BSTZ, BTA, BTT, BTZ, BUI, BWFG, BYM, BZM, CCD, CF, CGO, CHD, CHI, CHW, CII, CLCT, COP, CORR, CPZ, CSQ, DCI, DRE, DUK, EBMT, EDF, EDI, EGF, EMR, ENB, EQT, EVA, FBK, FCCY, FCFS, FDEF, FINS, FMO, FNHC, FRA, FRBA, FSB, GBAB, GCBC, GEO, GGM, GHY, GOF, GRC, GWRS, HA, HTH, HTLF, HXL, HYT, IHIT, INN, ISD, JBL, JCO, JEF, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LEO, LLY, LNN, LSTR, MCA, MEN, MHD, MMD, MMM, MMS, MNE, MOG.A, MOG.B, MSBI, MSEX, MSVB, MTX, MUE, MUI, MUS, NAC, NAD, NAN, NBB, NCB, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NXST, NYV, NZF, OBNK, ODC, OPP, OPY, OSK, OTTR, OXLC, OXSQ, PBI, PCSB, PEO, PER, PFS, PFSI, PGZ, PKOH, PSMT, PSTL, PZN, RBA, RDS.A, RDS.B, RIV, RMI, RMM, RSF, SAL, SALT, SBRA, SCHW, SIGI, SJM, SJR, SMBC, SMP, SONA, SPG, SRF, SRV, SSBI, SZC, TAIT, TCF, TECH, TFC, TSBK, UTL, UTX, V, VBF, VTA, VVR, WAL, WEC, WRK, WTRG, XEC, YUM\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.341%)\n    - 4-Week Bill Auction (previous: 1.540%)\n    - 8-Week Bill Auction (previous: 1.550%)\n    - CPI (consensus: 0.2%, previous: 0.2%)\n    - CPI (consensus: 2.4%, previous: 2.3%)\n    - CPI Index, n.s.a. (consensus: 257.86, previous: 256.97)\n    - CPI Index, s.a (previous: 258.44)\n    - CPI, n.s.a (previous: -0.09%)\n    - Cleveland CPI (previous: 0.2%)\n    - Continuing Jobless Claims (consensus: 1,745K, previous: 1,751K)\n    - Core CPI (consensus: 0.2%, previous: 0.1%)\n    - Core CPI (consensus: 2.2%, previous: 2.3%)\n    - Core CPI Index (previous: 265.83)\n    - Initial Jobless Claims (consensus: 210K, previous: 202K)\n    - Jobless Claims 4-Week Avg. (previous: 211.75K)\n    - Natural Gas Storage (previous: -137B)\n    - Real Earnings (consensus: 0.1%, previous: -0.1%)\n\n## Upcoming events for Friday, February 14th\n\n - Stock splits:\n\n    - PKBK @ **110:100** (Payable date: 03/03/2020)\n\n - Expected earnings:\n\n  ABR, AL, AXL, AZN, BBX, BLX, CGC, CYOU, ENB, ESNT, GNLN, HDB, IMGN, INMB, MGP, NWL, PIXY, POR, PPL, PVL, RWLK, SOGO, SOHU, SPR, SXT, TRTN, YNDX\n\n - Ex-div:\n\n  ALK, AUDC, CABO, CADE, CE, CG, CHCT, COTY, CTSH, CURO, CVX, DHT, DLX, ECT, ENBL, FDBC, FTS, GIM, GLOP, HBI, HIW, JHG, KMPR, LAZ, LPX, LYTS, MC, MNR, MUR, NATI, PCF, PEAK, PFLT, PROV, PRU, PSX, PTMN, R, ROK, SBR, SO, SPB, STK, SWX, SXC, TEI, TSLF, UI, UMH, VCIF, WMK, WWD\n\n - Economic events and announcements:\n\n    - Business Inventories (consensus: 0.1%, previous: -0.2%)\n    - CFTC Aluminium speculative net positions (previous: -58.9K)\n    - CFTC Copper speculative net positions (previous: -14.4K)\n    - CFTC Corn speculative net positions (previous: 73.4K)\n    - CFTC Crude Oil speculative net positions (previous: 461.8K)\n    - CFTC Gold speculative net positions (previous: 330.1K)\n    - CFTC Nasdaq 100 speculative positions (previous: 24.4K)\n    - CFTC Natural Gas speculative net positions (previous: -261.5K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 16.8K)\n    - CFTC Silver speculative net positions (previous: 63.4K)\n    - CFTC Soybeans speculative net positions (previous: -6.3K)\n    - CFTC Wheat speculative net positions (previous: 41.1K)\n    - Capacity Utilization Rate (consensus: 76.8%, previous: 77.0%)\n    - Core Retail Sales (consensus: 0.3%, previous: 0.7%)\n    - Export Price Index (consensus: -0.1%, previous: -0.2%)\n    - Export Price Index (previous: -0.7%)\n    - FOMC Member Mester Speaks\n    - Import Price Index (consensus: -0.2%, previous: 0.3%)\n    - Import Price Index (previous: 0.5%)\n    - Industrial Production (consensus: -0.2%, previous: -0.3%)\n    - Industrial Production (previous: -1.01%)\n    - Manufacturing Production (consensus: -0.1%, previous: 0.2%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.50%)\n    - Michigan Consumer Expectations (consensus: 90.3, previous: 90.5)\n    - Michigan Consumer Sentiment (consensus: 99.5, previous: 99.8)\n    - Michigan Current Conditions (consensus: 115.0, previous: 114.4)\n    - Michigan Inflation Expectations (previous: 2.5%)\n    - Retail Control (consensus: 0.3%, previous: 0.5%)\n    - Retail Inventories Ex Auto (previous: -0.2%)\n    - Retail Sales (consensus: 0.3%, previous: 0.3%)\n    - Retail Sales (previous: 5.82%)\n    - Retail Sales Ex Gas/Autos (previous: 0.5%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 676)\n    - U.S. Baker Hughes Total Rig Count (previous: 790)\n\n^^^^2020-02-12",
        "created_utc": 1581505212,
        "id": "fhdwj8m",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fhdwj8m/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1581534012.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 10th of February\n\n\n\n## Upcoming events for Monday, February 10th\n\n - Expected earnings:\n\n  ACB, AEMD, AGN, AIN, AMKR, APPS, ARGO, AVYA, BHF, BIP, BLKB, BRX, BYND, CHGG, CMBM, CMP, CNA, CRNT, CSTL, DMPI, DO, DVA, ELVT, ELY, EPC, ESSA, FLDM, FRT, GBDC, GFN, GNSS, GO, GPP, GPRE, ICMB, IIIV, IIVI, ITUB, IVC, JCOM, JE, KMPR, L, LMNX, MCC, MCY, MELI, MESA, MGI, MIME, MLAB, MOH, MPAA, NFE, OMAB, OMF, PRCP, PSEC, PSTL, QSR, RE, RICK, RLGT, RNG, RPD, SBLK, STE, TMQ, TPTX, UL, UN, VOYA, VRNS, WTER, WTS, XPEL, XPO\n\n - Ex-div:\n\n  APO, ARCB, CWBC, ETRN, GHM, KMT, MCBC, MDRR, MTG, NI, NMM, PCAR, PGC, SBBX, STZ, STZ.B, SWKS, WBS, XLNX, XOM\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 1.550%)\n    - 6-Month Bill Auction (previous: 1.520%)\n    - CB Employment Trends Index (previous: 109.70)\n    - FOMC Member Bowman Speaks\n    - FOMC Member Harker Speaks\n    - Investing.com Gold Index (actual: 51.3%, previous: 57.4%)\n    - Investing.com S&amp;P 500 Index (actual: 45.1%, previous: 43.8%)\n\n## Upcoming events for Tuesday, February 11th\n\n - Expected earnings:\n\n  AAT, ACCO, ACGL, ADPT, AIZ, AKAM, AKRO, ALIM, AMCR, AMX, AN, ARA, ASC, ATEN, AXLA, AZRE, BCEL, BE, BFIN, BIOX, BXMT, CCR, CEIX, CNO, CPAC, CPSI, CPSS, CRL, CRNC, CRTO, CRTX, CTO, CVET, D, DBD, DCP, DEI, DENN, DIOD, DTIL, EEFT, ELMD, EXAS, EXC, FLOW, FSP, GPMT, GRPN, GT, GTIM, HAS, HCAT, HCSG, HLT, HOOK, IAA, INGR, IRTC, ISR, JLL, KRNT, LCII, LPX, LSCC, LYFT, MAS, MEC, MLM, MMYT, MORF, MWK, NCR, NGM, NMIH, NNN, NSP, NXTC, OMC, ONDK, OPRT, PEAK, PKD, PNTG, PRI, PRVL, PSN, PTN, REXR, RM, SANW, SCCO, SEE, SFST, SILK, SQNS, ST, STOK, STSA, SWTX, TGB, TGNA, TGTX, TH, TSU, UA, UAA, UDR, USFD, VIRT, VNOM, VREX, VTGN, WTRE, WU, XGN\n\n - Ex-div:\n\n  BFIN, BOKF, CEN, ECC, EIC, FOF, GWB, HOMB, INF, INVH, LDP, LEVI, LGI, MDC, MIE, MKTX, MSA, NFBK, PSF, RA, RNP, SASR, SIRI, SLB, TESS, TTEK, UTF, VLO, WETF, WINA, WNEB\n\n - Economic events and announcements:\n\n    - 3-Year Note Auction (previous: 1.567%)\n    - API Weekly Crude Oil Stock (previous: 4.180M)\n    - FOMC Member Bullard Speaks\n    - FOMC Member Kashkari Speaks\n    - FOMC Member Quarles Speaks\n    - Fed Chair Powell Testifies\n    - JOLTs Job Openings (consensus: 7.233M, previous: 6.800M)\n    - NFIB Small Business Optimism (consensus: 103.4, previous: 102.7)\n    - Redbook (previous: 0.2%)\n    - Redbook (previous: 5.7%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, February 12th\n\n - Stock splits:\n\n    - NVIV @ **1:30**\n\n - Expected earnings:\n\n  AB, ACEL, AEL, AKR, AM, AMAT, ANDE, APLT, AR, ARCC, ASGN, ATOM, ATUS, AVLR, BCOV, BG, BLBD, BRKR, BSGM, CDNS, CF, CFX, CHEF, CHNG, CIDM, CIGI, CIM, CME, CODX, COHU, COWN, CPA, CRWS, CSCO, CSTE, CTL, CTRE, CVE, CVS, CXW, CYBR, CYRN, DISH, DMAC, DSSI, DYAI, DYNT, ECOM, EFC, EFX, EQC, EQIX, EQX, FCPT, FET, FLIR, FOSL, FR, FTSI, GEO, GOLD, GOOD, GPN, HR, HUBS, IBN, IDYA, IFF, IPG, IQV, IRT, JHX, JMP, JRSH, KAI, KGC, KLDO, KMDA, LAD, LPI, LPL, LTRX, MCHX, MCO, MFC, MGM, MIST, MNOV, MRO, NBL, NBLX, NLY, NPO, NSIT, NTAP, NTB, NTWK, NUS, NWE, OIS, OSW, PEGA, PERI, PGRE, PING, PRSP, PRTA, PRTH, PS, PSNL, PTSI, QDEL, QLYS, QUIK, QUOT, RDFN, RDWR, REG, RLMD, RUSHA, RYAM, SHOP, SLF, SLGG, SONM, SPWR, SSNC, STAG, TAP, TCO, TCX, TEVA, TGE, TMDI, TRIP, TRMB, TRVG, TTGT, TW, TYL, UE, UROV, VCTR, VERU, VNDA, WCN, WELL, WNC\n\n - Ex-div:\n\n  ACV, ADM, AIO, AMG, ARMK, CBH, DBL, DSE, DSL, EFL, EHT, ELY, ETR, EVF, GDV, GNT, GUT, HPF, HPI, HPS, HTD, IVH, IVZ, NCV, NCZ, OMP, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RMD, SIMO, STBA, TBNK, TJX, VGI, ZION, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.869%)\n    - Crude Oil Imports (previous: 0.051M)\n    - Crude Oil Inventories (consensus: 2.831M, previous: 3.355M)\n    - Cushing Crude Oil Inventories (previous: 1.068M)\n    - Distillate Fuel Production (previous: -0.003M)\n    - EIA Refinery Crude Runs  (previous: 0.048M)\n    - EIA Weekly Distillates Stocks (consensus: -0.014M, previous: -1.512M)\n    - EIA Weekly Refinery Utilization Rates (previous: 0.2%)\n    - FOMC Member Harker Speaks\n    - Fed Chair Powell Testifies\n    - Federal Budget Balance (previous: -13.3B)\n    - Gasoline Inventories (consensus: 2.057M, previous: -0.091M)\n    - Gasoline Production (previous: 0.745M)\n    - Heating Oil Stockpiles (previous: -0.014M)\n    - MBA 30-Year Mortgage Rate (previous: 3.71%)\n    - MBA Mortgage Applications (previous: 5.0%)\n    - MBA Purchase Index (previous: 283.8)\n    - Mortgage Market Index (previous: 682.0)\n    - Mortgage Refinance Index (previous: 2,975.7)\n    - OPEC Monthly Report\n    - Thomson Reuters IPSOS PCSI (previous: 63.42)\n\n## Upcoming events for Thursday, February 13th\n\n - Expected earnings:\n\n  AAN, ACOR, ACST, AEG, AEM, AER, AGIO, AIG, AIMC, AKG, ALE, ALKS, ALYA, AMN, ANET, APRE, ARES, ARI, ARR, AUY, AYR, AYX, BABA, BAX, BCOR, BFAM, BIO, BKI, BL, BRG, BWA, CARG, CBB, CC, CCEP, CERC, CGNX, COOP, CPS, CRY, CS, CTT, CTXR, CVM, CXP, CZNC, DAN, DAVA, DDOG, DLPH, DLR, DUK, DXCM, EEX, EQM, EQT, ETRN, EVLO, EXPE, FAF, FIS, FNF, FORR, FTS, FULC, GDDY, GLOB, GNRC, GTLS, HE, HII, HIMX, HTA, HUN, ICL, IMAC, INCY, IPGP, IRM, IRWD, KELYA, KHC, LBTYA, LECO, LH, LIN, LOGM, LPSN, MANU, MAT, MERC, MFG, MHK, MRC, MTRN, NBEV, NBSE, NEPT, NET, NEXA, NGD, NICE, NKSH, NMM, NMRK, NVDA, NVMI, OMN, OTLK, PATK, PBF, PBFX, PDFS, PDS, PEP, POOL, PVG, R, RDCM, REPL, ROKU, RSG, RWT, SAFE, SITC, SMP, SON, SPSC, SPXC, SRTS, SSTK, SVMK, SWAV, SWIR, TEX, THS, TLND, TNET, TPX, TRP, TRUP, TRVI, TRWH, TU, TUFN, VECO, VIE, WEX, WH, WM, WRE, WRTC, WSO, WST, YCBD, YELP, YETI, ZBRA, ZTS\n\n - Ex-div:\n\n  ABC, ADS, ADX, AFT, AGCO, AGN, AHC, AIF, AIT, AIV, ALE, AMGN, AMP, APAM, ARR, AVK, AWR, BA, BAF, BAH, BBF, BBK, BBN, BCX, BDJ, BFK, BFO, BFST, BFY, BFZ, BG, BGIO, BGR, BGT, BGY, BHK, BHLB, BHV, BIT, BKH, BKK, BLE, BLW, BME, BNY, BOE, BP, BQH, BRKL, BSD, BSE, BSET, BSM, BST, BSTZ, BTA, BTT, BTZ, BUI, BWFG, BYM, BZM, CCD, CF, CGO, CHD, CHI, CHW, CII, CLCT, COP, CORR, CPZ, CSQ, DCI, DRE, DUK, EBMT, EDF, EDI, EGF, EMR, ENB, EQT, EVA, FBK, FCCY, FCFS, FDEF, FINS, FMO, FNHC, FRA, FRBA, FSB, GBAB, GCBC, GEO, GGM, GHY, GOF, GRC, GWRS, HA, HTH, HTLF, HXL, HYT, IHIT, INN, ISD, JBL, JCO, JEF, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LEO, LLY, LNN, LSTR, MCA, MEN, MHD, MMD, MMM, MMS, MNE, MOG.A, MOG.B, MSBI, MSEX, MSVB, MTX, MUE, MUI, MUS, NAC, NAD, NAN, NBB, NCB, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NXST, NYV, NZF, OBNK, ODC, OPP, OPY, OSK, OTTR, OXLC, OXSQ, PBI, PCSB, PEO, PER, PFS, PGZ, PKOH, PSTL, PZN, RBA, RDS.A, RDS.B, RIV, RMI, RMM, RSF, SAL, SALT, SBRA, SCHW, SIGI, SJM, SJR, SMBC, SMP, SONA, SPG, SRF, SRV, SSBI, SZC, TAIT, TCF, TECH, TFC, TSBK, UTL, UTX, V, VBF, VTA, VVR, WEC, WRK, WTRG, XEC, YUM\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.341%)\n    - 4-Week Bill Auction (previous: 1.540%)\n    - 8-Week Bill Auction (previous: 1.550%)\n    - CPI (consensus: 0.2%, previous: 0.2%)\n    - CPI (consensus: 2.5%, previous: 2.3%)\n    - CPI Index, n.s.a. (consensus: 257.87, previous: 256.97)\n    - CPI Index, s.a (previous: 258.50)\n    - CPI, n.s.a (previous: -0.09%)\n    - Cleveland CPI (previous: 0.2%)\n    - Continuing Jobless Claims (previous: 1,751K)\n    - Core CPI (consensus: 0.2%, previous: 0.1%)\n    - Core CPI (consensus: 2.2%, previous: 2.3%)\n    - Core CPI Index (previous: 265.92)\n    - Initial Jobless Claims (consensus: 212K, previous: 202K)\n    - Jobless Claims 4-Week Avg. (previous: 211.75K)\n    - Natural Gas Storage (previous: -137B)\n    - Real Earnings (previous: -0.1%)\n\n^^^^2020-02-10",
        "created_utc": 1581332416,
        "id": "fh7hpht",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fh7hpht/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1581361216.0
    },
    {
        "author": "DaggerMoth",
        "body": "Anybody ever tell you that your cadence sounds like Myron Copes? Gave me some good ole flashbacks.",
        "created_utc": 1581536500,
        "id": "fhf59m6",
        "permalink": "/r/wallstreetbets/comments/f2tjkn/moderators_update_on_paper_trading_competition/fhf59m6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581565300.0
    },
    {
        "author": "knowledgemule",
        "body": "It is not. The companies I specifically wanna flag is AMAT CDNS",
        "created_utc": 1582206922,
        "id": "fi6tel9",
        "permalink": "/r/SecurityAnalysis/comments/f6drcj/heterogeneous_compute_the_paradigm_shift_no_one/fi6tel9/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1582235722.0
    },
    {
        "author": "gettendies",
        "body": "That doesn't fit the lyrical cadence for thr song though",
        "created_utc": 1581689297,
        "id": "fhkqetq",
        "permalink": "/r/wallstreetbets/comments/f3qool/daily_discussion_thread_february_14_2020/fhkqetq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581718097.0
    },
    {
        "author": "chaney3",
        "body": "Lol, feelin' cute. 😜 Might fuck around and buy some $GLW today.",
        "created_utc": 1580976133,
        "id": "fgommcy",
        "permalink": "/r/wallstreetbets/comments/ezgfp6/what_are_your_moves_tomorrow_february_06/fgommcy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581004933.0
    },
    {
        "author": "pet_wolverine",
        "body": "Nice username.\n\nYa know, just in the end make the decision that you think is best and be ready to live with the consequences.  A lot of people were certain that the policies of President Obama would further tank the economy and market, so they stayed away from the stock market through his entire presidency.\n\nA lot of people were convinced that President's Trump's policies would tank the market, and that the bull market was getting too old and had pushed too far, so they pulled money out.  I'm actually part of that group.  I didn't clear out of the market, but I put a big chunk of my 401k money into treasuries soon after Trump got elected.  That money has suffered pretty big opportunity cost for me.\n\nNow a lot of people are convinced that the market has entered irrationality territory, and that fundamentals don't support share prices.  I get that.  Mind you, there are a lot of stocks out there, and some trade at very discounted prices.  I recently added shares of GLW, XOM, DD, and SFM in my portfolio based on extreme share price weakness.  But yeah, maybe it's finally time to cash out some of those huge earnings on high-flying stocks and ETFs.  I don't know.  I'm holding more than I buy these days.  Only time will tell whether we're at or near a top, and by then it'll be too late to act on today's market.",
        "created_utc": 1580743496,
        "id": "fgfnqq6",
        "permalink": "/r/investing/comments/ey8f8i/someone_please_talk_me_out_of_timing_this_market/fgfnqq6/",
        "score": 1,
        "subreddit": "investing",
        "created": 1580772296.0
    },
    {
        "author": "MeowTseTongue",
        "body": "All in on Corning",
        "created_utc": 1581143057,
        "id": "fgvb6oz",
        "permalink": "/r/wallstreetbets/comments/f0gt6n/weekend_discussion_thread_february_79_2020/fgvb6oz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581171857.0
    },
    {
        "author": "ValenTom",
        "body": "Indeed I am. I’m developing my Roth IRA into a dividend growth portfolio. I target blue chip stocks that have been beat up by the market. This allows me to have a higher yield, purchase more shares, and have a greater chance for share price appreciation. I currently hold:\n\nAT&amp;T: $31.84 average\n\nCVS: $58.05 average (Yes I am aware the dividend is frozen)\n\nCorning Glass: $26.91 average (mostly acquiring GLW this year)\n\nI can already tell your investment style differs from mine based on your username. I keep my 401(k) solely in a target date fund and use my taxable brokerage for my higher risk stocks. I enjoy the process of building my own dividend portfolio and have had great success so far.",
        "created_utc": 1581527354,
        "id": "fhepovk",
        "permalink": "/r/investing/comments/f2qg8l/cvs_health_beats_on_fourthquarter_earnings_and/fhepovk/",
        "score": 1,
        "subreddit": "investing",
        "created": 1581556154.0
    },
    {
        "author": "HereToHelp12o8",
        "body": "Sustainalbe stocks:\n\n&amp;#x200B;\n\nA ----- AGILENT TECHNOLOGIES INC\n\nABT ----- ABBOTT LABORATORIES\n\nACN ----- \\*\\*\\*ACCENTURE PLC IRELAND SHS CL A\n\nADS ----- ALLIANCE DATA SYSTEM CORP\n\nADSK ----- AUTODESK INC\n\nAMGN ----- AMGEN INC\n\nAPD ----- AIR PRODUCTS &amp; CHEMICALS INC\n\nAXP ----- AMERICAN EXPRESS COMPANY\n\nBAC ----- BANK OF AMERICA CORP\n\nBAX ----- BAXTER INTERNATIONAL INC\n\nBBY ----- BEST BUY COMPANY INC\n\nBDX ----- BECTON DICKINSON &amp; CO\n\nBLL ----- BALL CORP\n\nBYND ----- BEYOND MEAT INC COMMON STOCK\n\nCL ----- COLGATE PALMOLIVE COMPANY\n\nCPB ----- CAMPBELL SOUP CO\n\nCSCO ----- CISCO SYSTEMS INC\n\nCSIQ ----- \\*\\*\\*CANADIAN SOLAR INC\n\nCSX ----- CSX CORPORATION COM\n\nCVS ----- CVS HEALTH CORPORATION\n\nDIS ----- WALT DISNEY CO\n\nDNKN ----- DUNKIN BRANDS GROUP INC\n\nECL ----- ECOLAB INC\n\nEL ----- ESTEE LAUDER COMPANIES INC CL A\n\nEW ----- EDWARDS LIFESCIENCES CORP\n\nG ----- \\*\\*\\*GENPACT LIMITED\n\nGIS ----- GENERAL MILLS INC\n\nGM ----- GENERAL MOTORS COMPANY\n\nGSK ----- \\*\\*\\*GLAXOSMITHKLINE PLC SPONSORED ADR(FRM\n\nHAS ----- HASBRO INC\n\nHPQ ----- HP INC COM\n\nHST ----- HOST HOTELS &amp; RESORTS INC\n\nHSY ----- HERSHEY COMPANY (THE)\n\nHUM ----- HUMANA INC\n\nIBM ----- INTERNATIONAL BUSINESS MACHINES CORP\n\nIR ----- \\*\\*\\*INGERSOLL RAND PLC\n\nJLL ----- JONES LANG LASALLE INC\n\nJNPR ----- JUNIPER NETWORKS\n\nK ----- KELLOGG CO\n\nKMB ----- KIMBERLY CLARK CORP\n\nKR ----- KROGER CO (THE)\n\nLLY ----- ELI LILLY &amp; CO\n\nMAN ----- MANPOWERGROUP\n\nMDT ----- \\*\\*\\*MEDTRONIC PLC COM\n\nMET ----- METLIFE INC\n\nMLHR ----- HERMAN MILLER INC\n\nMMM ----- 3M COMPANY\n\nMOS ----- MOSAIC COMPANY\n\nMRK ----- MERCK &amp; CO INC\n\nMSI ----- MOTOROLA SOLUTIONS INC\n\nNLOK ----- NORTONLIFELOCK INC COMMON STOCK\n\nNOVN ----- NOVAN INC COM\n\nNVDA ----- NVIDIA CORP\n\nOC ----- OWENS CORNING\n\nORCL ----- ORACLE CORPORATION\n\nPG ----- PROCTER &amp; GAMBLE CO\n\nPHG ----- \\*\\*\\*KONINKLIJKE PHILIPS N V\n\nREGN ----- REGENERON PHARMACEUTICALS INC\n\nRMD ----- RESMED INC\n\nROG ----- ROGERS CORP\n\nSCS ----- STEELCASE INC-MICH CL A\n\nSNY ----- \\*\\*\\*SANOFI ADR\n\nSRE ----- SEMPRA ENERGY\n\nSTT ----- STATE STREET CORP\n\nTDC ----- TERADATA CORP\n\nUN ----- \\*\\*\\*UNILEVER N V YORK SHS ADR\n\nUPS ----- UNITED PARCEL SVC INC CL B\n\nVAR ----- VARIAN MEDICAL SYSTEMS INC\n\nVIE ----- VIELA BIO INC COMMON STOCK\n\nVMW ----- VMWARE INC CL A\n\nWDAY ----- WORKDAY INC CLASS A COMMON STOCK\n\nWHR ----- WHIRLPOOL CORP COMMON STOCK\n\nXRX ----- XEROX HOLDINGS CORPORATION COMMON STOCK",
        "created_utc": 1581436032,
        "id": "fhb6t9r",
        "permalink": "/r/investing/comments/f28fi2/safe_stocks/fhb6t9r/",
        "score": 1,
        "subreddit": "investing",
        "created": 1581464832.0
    },
    {
        "author": "chaney3",
        "body": "Lol, feelin' cute. 😜 Might fuck around and buy some $GLW today.",
        "created_utc": 1580976133,
        "id": "fgommcy",
        "permalink": "/r/wallstreetbets/comments/ezgfp6/what_are_your_moves_tomorrow_february_06/fgommcy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581004933.0
    },
    {
        "author": "pet_wolverine",
        "body": "Nice username.\n\nYa know, just in the end make the decision that you think is best and be ready to live with the consequences.  A lot of people were certain that the policies of President Obama would further tank the economy and market, so they stayed away from the stock market through his entire presidency.\n\nA lot of people were convinced that President's Trump's policies would tank the market, and that the bull market was getting too old and had pushed too far, so they pulled money out.  I'm actually part of that group.  I didn't clear out of the market, but I put a big chunk of my 401k money into treasuries soon after Trump got elected.  That money has suffered pretty big opportunity cost for me.\n\nNow a lot of people are convinced that the market has entered irrationality territory, and that fundamentals don't support share prices.  I get that.  Mind you, there are a lot of stocks out there, and some trade at very discounted prices.  I recently added shares of GLW, XOM, DD, and SFM in my portfolio based on extreme share price weakness.  But yeah, maybe it's finally time to cash out some of those huge earnings on high-flying stocks and ETFs.  I don't know.  I'm holding more than I buy these days.  Only time will tell whether we're at or near a top, and by then it'll be too late to act on today's market.",
        "created_utc": 1580743496,
        "id": "fgfnqq6",
        "permalink": "/r/investing/comments/ey8f8i/someone_please_talk_me_out_of_timing_this_market/fgfnqq6/",
        "score": 1,
        "subreddit": "investing",
        "created": 1580772296.0
    }
]