[
    {
        "author": "Ax1er",
        "body": "ADSK not a clue what they do other than print.",
        "created_utc": 1593652007,
        "id": "fwnbrmn",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwnbrmn/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593680807.0
    },
    {
        "author": "A_nilsen",
        "body": "I have 4 different strategy of investments, where two of them correlated.\n\nThe 5 strategy is currently off and it is a SP500 ETF, I'm not buying not because of FED, more because of the indicators I had mentioned. If they will go to the normal levels I will convert some share of the portfolio to the SP500 ETF or maybe some leverage Index ETF if it be good enough.\n\nFirst two strategies are become clarified as we enter the Great Commodities Cycle. You can see everywhere, with gold prices, uranium, ore and more. Gold is actually outperform the broad market in the last two years because of this. And it isn't going to stop. The Great Commodities Cycle was predictable because of some rates and graphs, but it a little bit more complicated to explain it here. My good performance is literally from the big hedge with gold against the markets. \n\n So how we can earn some money from it? \n\n1. Just buy Gold (GLD or IUA) and hold for 10 years.\n2. Buy commodities connected companies. But you have to choose good ones, with small debt, great management, and good free cash flow.\n\nThe 3 strategy is to find \"hidden\" value companies. Companies with a good history, perfect management, growing sales, but bad times. Not so bad, just for some reasons the news coverage is bad for them right now. It couldn't be a \"hype\" company like Amazon, it has to be smaller one, who nobody from the newbie investor knows.\n\nIt is very complicated strategy, but it is very rewarding one. To find this kind of company a great work needed to be done. A lot of financial data investigated, and a lot of research on the company. But as I said it is very rewarding. Returns on this are very high.\n\nThe 4 strategies is to find a flawns, a perfect places to earn some good return in the short period of time. It could be some crazy and unknown commodity or a short. Shorts are very dangerous, cause you play against the market mood, which is forever up. But.\n\nFor example I shorted the ADSK, very unusual things to do. If you ask today somebody about ADSK in the reddit, everybody will explain how great the company is, and how good to invest in it. \n\nI buy short at February this year for 210 and sell it for 140 in the pick of the crisis in March. Making literally nice money from it.",
        "created_utc": 1593613848,
        "id": "fwl48ab",
        "permalink": "/r/investing/comments/him609/daily_advice_thread_all_basic_help_or_advice/fwl48ab/",
        "score": 1,
        "subreddit": "investing",
        "created": 1593642648.0
    }
]