[
    {
        "author": "bentrods126",
        "body": "I have 10 with 7 being penny stocks. ADI, DKNG, SPCE are the other ones",
        "created_utc": 1591046303,
        "id": "fskfe0r",
        "permalink": "/r/pennystocks/comments/gusw1i/how_many_different_stocks_do_you_have_in_your/fskfe0r/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1591075103.0
    },
    {
        "author": "aurora4000",
        "body": "My take: it has been profitable in the past year to hold AMD and sell calls against it. Usually  the profit ranges from 12-17% per call option sold, depending upon  various factors of course. Have also held ADI, MO, GS and sold calls against them, collecting the dividend and the premium. 90% of the time the calls that I've sold expire worthless - so I keep the premium and the stock.",
        "created_utc": 1593122596,
        "id": "fw00tl4",
        "permalink": "/r/options/comments/hfuoup/selling_stocks_vs_selling_itm_call_options/fw00tl4/",
        "score": 1,
        "subreddit": "options",
        "created": 1593151396.0
    },
    {
        "author": "Constant_Curve",
        "body": "Scholars state that the origins of Sikhism were influenced by the nirgun (“without form”) and not sagun (“with form”) conception of God of the Bhakti movement in medieval India.[1][6] The roots of Sikhism can be traced to the Sants of northern India,[1] whose ideology grew to become the Bhakti movement.[1][7] Furthermore, \"Indic mythology permeates the Sikh Sacred canon, the Guru Granth Sahib and adds delicate nuance and substance to the sacred symbolic universe of the Sikhs of today and of their past ancestors\".[8]\n\nDuring the Mughal Empire period, the Sikh and Hindu traditions believe that Sikhs helped protect Hindus from Islamic persecution, and this caused martyrdom of their Guru.[16] The Sikh historians, for example, record that the Sikh movement was rapidly growing in northwest India, and Guru Tegh Bahadur was openly encouraging Sikhs to, \"be fearless in their pursuit of just society: he who holds none in fear, nor is afraid of anyone, is acknowledged as a man of true wisdom\", a statement recorded in Adi Granth 1427.[17][18][19] While Guru Tegh Bahadur influence was rising, Aurangzeb had reimposed jazia which was a tax on non-Muslims.[18][20][21]\n\n\n\nThere is an organic relation of Sikhs to Hindus, states Zaehner, both in religious thought and their communities, and virtually all Sikhs' ancestors were Hindus.[111] Some Hindu groups, like the BJP and related nationalist organizations, view Sikhism as a tradition within Hinduism along with other Dharmic faiths (such as some Hindus referring to Sikhs as Keshdhari Hindus),[112] even though the Sikh faith is a distinct religion.[111] Historically, Sikhs were seen as the protectors of Hindus, among others, and were even considered by some right-wing Hindu political organizations like the RSS as the \"sword arm\" of Hinduism.[113][114] This status as protectors of Hindus was strong enough that Punjabi Hindus would often raise their eldest son as a Sikh.[113]",
        "created_utc": 1591784921,
        "id": "ftkm39u",
        "permalink": "/r/wallstreetbets/comments/gzo3gu/an_autist_in_the_making/ftkm39u/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591813721.0
    },
    {
        "author": "MiddleC5",
        "body": "I regret missing the recovery on Skyworks, Broadcom, Analog Devices, and Texas Instruments. I also regret not buying Enphase a lot sooner.",
        "created_utc": 1593176625,
        "id": "fw247f5",
        "permalink": "/r/stocks/comments/hg6vox/investors_that_missed_out/fw247f5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593205425.0
    }
]