[
    {
        "author": "WestmontOG07",
        "body": "Here is what is on my watch list and why:\n\n1. Google --- (Obvious choice with TONS of cash, tons of free cash flow and, more importantly, a business model that will survive the test of time). Premarket, it looks like the price is about $1,126.00. (I like to see this one at $1000, or below, but I've been nibbling on down days. \n\n2.  Amazon --- (Another pick where they have a solid balance sheet and continue to do business is in this tumultuous environment. I think bricks and mortar retail, outside of pharmacies, grocery stores, auto parts stores and few others, are going to be in big trouble unless there is a bailout --- Amazon will benefit from this and I've been buying on down days WHEN the stock is sub $1750. (It hit below this number twice since we have been having these crashes)\n\n3. Facebook --- (Another one with an unreal balance sheet, like Google. I've been adding to this name when it dips below $150.00 BUT at $162 premarket, I may add some more today)\n\n4. Skyworks / Qualcomm --- Both are solid, necessary companies, especially in mobile / 5G. I've been buying Qualcomm at below $70 and Skyworks below $80. Skyworks has ZERO debt and Qualcomm, as we all know, is a powerhouse of a company that most phone companies use: (LG, Samsung, Google, Oppo, Nokia, Apple (Verizon phones), etc...) this company isn't going anywhere and I would start to nibble on what looks to be a red day today!\n\n5. CVS Pharmacy --- This company has huge potential stock growth because they just acquired Aetna health insurance. They also have the brick and mortar CVS stores, along with the minuteclinics AND they have a PBM (Caremark) which negotiates lower drug prices for consumers and large companies. They are well diversified and have serious stock appreciation potential, even during these tough times, because there really is nowhere else to shop for goods, outside of Amazon and Grocery stores, PLUS everyone needs health insurance, which CVS offers through the recently acquired Aetna arm!\n\nGood luck today and happy investing --- for the long term!",
        "created_utc": 1585742830,
        "id": "fm40355",
        "permalink": "/r/stocks/comments/fsvbj1/what_stocks_you_would_buy_right_now_if_you_had_5k/fm40355/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585771630.0
    },
    {
        "author": "BuyLowSellNever",
        "body": "One of my favourites right now is QCOM. Super undervalued, massive growth potential, they’re slightly more leveraged than I would like to see but you can’t win them all.\n\n\nYou can’t really go wrong with the big 5 (MSFT, AAPL, GOOG, AMZN, FB) provided they’re trading at a good price.\n\n\nSome other great companies with strong balance sheets INTC, V and MA.\n\n\nLook I know people will react strongly to INTC because AMD are gobbling up their market share, but INTC have a great management team and last year returned something like 40% ROIC which is definitely a buying signal.",
        "created_utc": 1585751829,
        "id": "fm4d8wo",
        "permalink": "/r/stocks/comments/ft0hy8/help_deciding_which_of_the_following_utility/fm4d8wo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585780629.0
    },
    {
        "author": "WestmontOG07",
        "body": "I added to:\nQcom, SWKS, American Express, Facebook and google today.\n\nAdditionally I sold puts, as a short term hedge, on:\n\nQualcomm, CVS, SPY, WFC.\n\nUpdated my YouTube channel this AM with puts I closed out of at market open!\n\nInvesting101WITHCZ!",
        "created_utc": 1585770585,
        "id": "fm5cwve",
        "permalink": "/r/stocks/comments/fsvbj1/what_stocks_you_would_buy_right_now_if_you_had_5k/fm5cwve/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585799385.0
    },
    {
        "author": "BuyLowSellNever",
        "body": "TSLA is hugely overpriced.\n\n\nAAPL is reasonably priced but it’s not undervalued.\n\n\nHUM and QCOM are two nicely undervalued stocks.",
        "created_utc": 1585737353,
        "id": "fm3ud18",
        "permalink": "/r/investing/comments/fsx8al/any_undervalued_stocks_with_a_decent_fa/fm3ud18/",
        "score": 1,
        "subreddit": "investing",
        "created": 1585766153.0
    },
    {
        "author": "lucafcawesome",
        "body": "Thanks a lot. I’ve got a few of those, including Qcom, on my watchlist and will defo buy when i feel we are closer to the bottom. In terms of intel i just personally dislike how poor they have been in terms of integrated graphics &amp; just think they haven’t be pushing enough",
        "created_utc": 1585751986,
        "id": "fm4diva",
        "permalink": "/r/stocks/comments/ft0hy8/help_deciding_which_of_the_following_utility/fm4diva/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585780786.0
    },
    {
        "author": "BuyLowSellNever",
        "body": "QCOM is honestly one of the best stocks you can buy.\n\n\nMassively undervalued with, great management team and strong long term growth potential.\n\n\nTheir quite highly leveraged though, so if you’re happy with that than I vote buy buy buy.\n\n\nDefinitely in my top 3 stocks to own!",
        "created_utc": 1585729099,
        "id": "fm3mqd3",
        "permalink": "/r/investing/comments/fsvmqr/qcom_swks/fm3mqd3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1585757899.0
    },
    {
        "author": "SorrowsSkills",
        "body": "I'm still hoping to see the market drop more. I got greedy and didn't buy during the low point but I'm hoping to pick up a few stocks:\n\nTesla 350\n\nApple 230\n\nMSFT 125\n\nFB 130\n\nGoogle 1k\n\nBeyond meat 50\n\nDisney 80\n\nAir Canada 10\n\nThen some consideration is going into Wynn, Wendy's, MU and Qcom",
        "created_utc": 1585762581,
        "id": "fm4xiuy",
        "permalink": "/r/stocks/comments/fszcds/stock_watch_list_april_1_2020/fm4xiuy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585791381.0
    }
]