[
    {
        "author": "UpperSpinach",
        "body": "MARKETWATCH: Federal Reserve purchases Hewlett-Packard for $69M in T-bills, eyes Epson and Xerox",
        "created_utc": 1599777031,
        "id": "g4rhik4",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599805831.0
    },
    {
        "author": "PM_ME_YR_BAD_IDEA",
        "body": "I've been in both HPQ and PYR for months. I think these are both gonna be huge if they can deliver on everything they say they're going to do. Check my post history for a recent much less detailed DD than OPs.",
        "created_utc": 1600531995,
        "id": "g5tvkf1",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1600560795.0
    },
    {
        "author": "MowMowSplat",
        "body": "Then see the near 10% drop today and read about how they can't scale for a shit. \n\nI'm long on HPQ but damn its tough.",
        "created_utc": 1600819605,
        "id": "g69ov8u",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1600848405.0
    },
    {
        "author": "Bull_Logic",
        "body": "- HPQ has been bouncing off the 50DMA since June and could possibly do it again. It went below the 50DMA slightly but bounced off support created on 8/18.\n\n- NIU appears to be creating a descending triangle on the daily chart, possible short in the upcoming days/weeks.\n\n- GM might have had an overreaction from the NKLA news. Possible bounce off of both the 50DMA and 200DMA. Golden cross also forming. Only issue here is that if more NKLA news comes out we could see more downside. I'd wait for confirmation to touch this.",
        "created_utc": 1601145716,
        "id": "g6ph8n4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601174516.0
    },
    {
        "author": "ryanmcl1",
        "body": "HPQ makes the printers, idiot.",
        "created_utc": 1599534254,
        "id": "g4ena1i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599563054.0
    },
    {
        "author": "PM_ME_YR_BAD_IDEA",
        "body": "Think about what Daddy Musk said about silicon then Google what HPQ Silicons purevap process is.",
        "created_utc": 1600818991,
        "id": "g69ntx5",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1600847791.0
    },
    {
        "author": "PM_ME_YR_BAD_IDEA",
        "body": "Yup. Should look at HPQ too, someone just posted a big DD on this sub. I've been in for awhile, and think even if their tech isn't mentioned on Tuesday that they'll be a huge player in the energy storage sector going forward.\n\nFull disclosure I was in GIGA before it pumped based purely on speculation (I smelled a pump, musk loves calling things \"GIGA\") and sold as soon as that article hit and folks here started picking out paint colors for their lambo. If you're following the crowd you're generally too late.",
        "created_utc": 1600535518,
        "id": "g5u1zaz",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1600564318.0
    },
    {
        "author": "squaredk2",
        "body": "Most Of this profit was SLV $25c spread, expiring end of each month, Aug thru Nov. Also bought a single share of Tesla at $1500 and recently made some money flipping a few calls here and there like peloton and HPQ",
        "created_utc": 1598973048,
        "id": "g3liflh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599001848.0
    },
    {
        "author": "PM_ME_YR_BAD_IDEA",
        "body": "They're named in this PVBuzz article that was just published: [https://pvbuzz.com/tesla-battery-cost-reduction-strategy/](https://pvbuzz.com/tesla-battery-cost-reduction-strategy/)\n\nFull disclosure: I'm long here. I think we'll start seeing some positive price action closer to the end of the year, when they are meant to start delivering powder samples to whomever they have an NDA with. Of course, if the samples are garbage or they can't scale we won't see any positive price action. \n\nAnd, putting on my tin foil hat for a second here: Regarding them not even being able to name whom they have an NDA with. In an interview with the CEO of HPQ he blatantly wouldn't/couldn't pronounce Elon Musk properly. Is he not allowed to say his name cause of an NDA or is it just cause he's French Canadian and has an accent?",
        "created_utc": 1600873506,
        "id": "g6bny7a",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1600902306.0
    },
    {
        "author": "ChubbsMcGoo",
        "body": "I saw that. Very impressive to get in on that that early. I’m just seeing what else is out there that’s in competition with HPQ and with that also trying to find the holy HPQ Tesla ties. Thanks for the tip. I’m probably going to take the gamble and sit on it. Bring on the patience and hope. We’ll see what production in December looks like.",
        "created_utc": 1600892848,
        "id": "g6cr8fe",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1600921648.0
    },
    {
        "author": "vantyle",
        "body": "Sorry if this is a dumb question, but you are saying Tesla might partner with both HPQ and URAGF?",
        "created_utc": 1601482673,
        "id": "g76olkn",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601511473.0
    },
    {
        "author": "FlyAllNight",
        "body": "Any predictions on how HPQ will react once the markets open?",
        "created_utc": 1601471851,
        "id": "g762quq",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601500651.0
    },
    {
        "author": "OnlineWithLuke",
        "body": "Doesn't really matter if Biden wins. Tesla is a private company that would utilize this tech to make cheaper electric vehicles. By making a $25k vehicle, they are opening themselves up to a VERY large market.   \n\n\nHPQ is also working with Apollon which is a French company and they've got all of Europe that they can tackle.",
        "created_utc": 1601477068,
        "id": "g76brgx",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601505868.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "repagator8",
        "body": "HPQ silicon.  I'm looking into it\n\nthese small caps HPQ and NNO they probably won't be mentioned by tesla but they are probably sub contracted in some way in the production of the  batteries for tesla.  Even if tesla is making batteries in house they can't do everything on their own.",
        "created_utc": 1600535755,
        "id": "g5u2fwo",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1600564555.0
    },
    {
        "author": "TCass29",
        "body": "SNE 80c 9/11  \nINCY 97.5c 9/18  \nRKT 40c 9/18  \nSPCE 18c 9/18  \nHPQ 25c 11/20  \n  \nand some shares of stuff",
        "created_utc": 1599230144,
        "id": "g3zmg4g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599258944.0
    },
    {
        "author": "daviddjg0033",
        "body": "MY goal is to sell the ink cartridges to Jerome Powell himself.  I sell ink cartridges as my day job.  Made a fortune before the pandemic but business is booming as paper goes to old tech.  Losing some customers to new tech.  Calls on $HPQ puts on $HPE.",
        "created_utc": 1599433402,
        "id": "g4a0w4w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599462202.0
    },
    {
        "author": "MP9",
        "body": "no ones going to mention HPQ?",
        "created_utc": 1599003422,
        "id": "g3no99l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599032222.0
    },
    {
        "author": "Greasyfork",
        "body": "HPQ Sillicon $HPQ is a Canadian sillicon producer focussing on replacing graphite with sillicon in batteries among other things. Penny stock at the moment.",
        "created_utc": 1601237372,
        "id": "g6vsekp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601266172.0
    },
    {
        "author": "OnlineWithLuke",
        "body": "I've been in HPQ for years now. It is a test of patience and hope. I can't comment on short term trading as this is not one of those.",
        "created_utc": 1600892276,
        "id": "g6cq55z",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1600921076.0
    },
    {
        "author": "gayforgoblin",
        "body": "This message is sponsored by $HPQ -JPow",
        "created_utc": 1601501679,
        "id": "g780p5d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601530479.0
    },
    {
        "author": "BrexFlexx",
        "body": "What about AXP, MCD, JNJ, PEP, HPQ, IBM, KO, ...?",
        "created_utc": 1599580262,
        "id": "g4g8v72",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599609062.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  7th of September\n\n\n\n## Upcoming events for Monday, September  7th\n\n - Expected earnings:\n\n  CBAT, EBR, EBR.B, GRAF, HCAC, HJLI, HPK, JT, PLAG, QD, SAMA, SINA, THCA, THCB, WB\n\n - Economic events and announcements:\n\n    - Investing.com Gold Index (actual: 56.3%, previous: 54.7%)\n    - Investing.com S&amp;P 500 Index (actual: 34.5%, previous: 28.6%)\n    - United States - Labor Day\n\n## Upcoming events for Tuesday, September  8th\n\n - Stock splits:\n\n    - PRGCF @ **1:10**\n\n - Expected earnings:\n\n  ABM, ANAT, ASFI, AZRX, BWL.A, CASY, CIG, COE, COUP, CVGW, CVV, DRD, GEC, HMY, HQY, IDXG, KBSF, KEQU, KTRA, LULU, METX, MFAC, NSSC, PHR, PPIH, SCPE, SEAC, TC, TEUM, UEC, UTSI, UXIN, WORK\n\n - Ex-div:\n\n  AEE, AVT, BBDC, BDX, CNI, HPE, HPQ, INSW, JKHY, LANC, LHX, OBCI, PEG, RCI, STNG, TFSL\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.115%)\n    - 3-Year Note Auction (previous: 0.179%)\n    - 52-Week Bill Auction (previous: 0.140%)\n    - 6-Month Bill Auction (previous: 0.105%)\n    - CB Employment Trends Index (previous: 50.89)\n    - Consumer Credit (consensus: 13.75B, previous: 8.95B)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - NFIB Small Business Optimism (previous: 98.8)\n\n## Upcoming events for Wednesday, September  9th\n\n - Stock splits:\n\n    - ALEDY @ **16:5**\n\n - Expected earnings:\n\n  ACB, AEO, AKER, ALOT, AMRH, APWC, ATLC, AVAV, AXR, BBCP, BCOW, BIGC, BROG, CBLI, CEI, CTXR, CVU, DSGX, EPM, FMCI, GFN, GIII, GME, HDS, HMG, HOTH, HTHT, HUSA, KEP, KFFB, LAKE, LMFA, LMNR, LOVE, MCFT, MEIP, NAV, OBSV, ORCL, REVG, RH, SCWX, SGMA, SLQT, STRM, TDAC, VERX, VRNT, WORX, WUBA, YGYI, ZNH, ZS\n\n - Ex-div:\n\n  AAT, ANTM, CASH, CME, DHF, FNV, GPN, HOG, KIM, LADR, MDU, MGM, MPW, NEM, NRIM, PPL, PPR, SJI, TRTN, TRV, TU, UBCP, UMBF, VCTR, VFC\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.660%)\n    - API Weekly Crude Oil Stock (previous: -6.360M)\n    - Cushing Crude Oil Inventories (previous: 0.110M)\n    - EIA Short-Term Energy Outlook\n    - JOLTs Job Openings (consensus: 6.000M, previous: 5.889M)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -2.0%)\n    - MBA Purchase Index (previous: 309.6)\n    - Mortgage Market Index (previous: 755.1)\n    - Mortgage Refinance Index (previous: 3,316.2)\n    - Redbook (previous: 4.6%)\n    - Redbook (previous: 5.8%)\n    - Seevol Cushing Storage Report (previous: -1.368M)\n    - Thomson Reuters IPSOS PCSI (previous: 47.05)\n\n## Upcoming events for Thursday, September 10th\n\n - Stock splits:\n\n    - ALEDY @ **16:5** (Payable date: 09/09/2020)\n\n - Expected earnings:\n\n  AIM, AMRK, ANPC, BIOX, CHWY, CKX, CLUB, CPAH, DSWL, FARM, FFBW, FLR, FLUX, GRNQ, GTT, JG, LPTH, LTRX, PBIO, PCYG, PLAY, PTN, PTON, PZG, RFIL, RLGT, SCX, UEPS, VEDL, VITL, VNCE, VOLT, WVFC, ZUMZ\n\n - Ex-div:\n\n  ACV, ADP, AIO, AL, AMSF, BIG, BSIG, BTO, CAI, CAL, CBH, CRWS, CTXS, DCF, DKS, ECC, EFL, EHT, EIC, ENS, EVF, EXPO, FDUS, FFIC, FHN, FIS, FISI, FMNB, FRO, FUSB, G, GARS, GFI, GHY, HEQ, HPF, HPI, HPS, HRB, HTD, HTY, ICFI, IIIN, ISD, ITT, JHI, JHS, KFRC, KIO, LGI, MANT, NCV, NCZ, NDAQ, NRGX, NSP, NTRS, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RVT, SAMG, SNDR, SPTN, SR, TCBK, THG, TXT, UBSI, UNTY, VGI, VSH, WMB, WSBC, ZTR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.406%)\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 14,000K, previous: 13,254K)\n    - Core PPI (consensus: 0.2%, previous: 0.5%)\n    - Core PPI (consensus: 0.3%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.655M)\n    - Crude Oil Inventories (consensus: -1.887M, previous: -9.362M)\n    - Distillate Fuel Production (previous: -0.343M)\n    - EIA Refinery Crude Runs  (previous: -0.844M)\n    - EIA Weekly Distillates Stocks (consensus: -1.357M, previous: -1.676M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -5.2%, previous: -5.3%)\n    - Gasoline Inventories (consensus: -3.036M, previous: -4.320M)\n    - Gasoline Production (previous: 0.016M)\n    - Heating Oil Stockpiles (previous: 0.280M)\n    - Initial Jobless Claims (consensus: 838K, previous: 881K)\n    - Jobless Claims 4-Week Avg. (previous: 991.75K)\n    - Natural Gas Storage (consensus: 34B, previous: 35B)\n    - PPI (consensus: -0.3%, previous: -0.4%)\n    - PPI (consensus: 0.2%, previous: 0.6%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -1.4%)\n    - Wholesale Trade Sales (consensus: 4.9%, previous: 8.8%)\n\n^^^^2020-09-07",
        "created_utc": 1599472813,
        "id": "g4bg86y",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1599501613.0
    },
    {
        "author": "TheWino",
        "body": "I learned this playing HPQ. Felt like I lost a month for no gain.",
        "created_utc": 1599426829,
        "id": "g49pj28",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599455629.0
    },
    {
        "author": "fuckyoutobi",
        "body": "I think PYRO and HPQ are great and good to hold. PYRO just signed a new deal with the US Navy for 11.5 million so hold it!",
        "created_utc": 1599273360,
        "id": "g42pdq4",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599302160.0
    },
    {
        "author": "PM_ME_YR_BAD_IDEA",
        "body": "How about HPQ?",
        "created_utc": 1600453158,
        "id": "g5q6wwc",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1600481958.0
    },
    {
        "author": "PM_ME_YR_BAD_IDEA",
        "body": "Hear me out. Are you familiar with a Canadian company called Pyrogenesis ($PYRNF or PYR.v for us Canadians). They manufacture plasma torches, used in the refinement process used by Vale. They reduce the GHG emitted by these processes significantly.\n\nPyrogenesis is in the process of negotiating contracts with 3 companies for sale of their torches. One of these companies is rumored to be Vale.\n\nPyrogenesis is hosting a special AGM on battery day.\n\nThere's more.\n\nDaddy Musk has mentioned that both nanotubes and high grade silicon are essential for his batteries.\n\nPyrogenesis has a stake in a company called HPQ Silicon Resources ($URAGF, HPQ.v on the tsxv). They paid about 50% more than the current SP for their stake so you know there's probably at least a 50% upside here.\n\nWhat does HPQ do? Manufacture high grade silicon products. Oh and they PRed an NDA about talks with an advanced material developer about energy storage applications in June. \n\nYou do the math, I was on the GIGA train at 0.70 CAD and got off when we broke 1.50 over the past week or so. My battery day play is all HPQ and PYR.\n\nThose of you that have read this far are likely googling charts now and wondering why PYR shit the bed recently. It was due to an analyst on BNN taking a call regarding PYR and giving a false response to the question. There's more on stockhouse about this if you can sift through all the garbage.",
        "created_utc": 1600397495,
        "id": "g5nxqy1",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1600426295.0
    },
    {
        "author": "OnlineWithLuke",
        "body": "This article does a great job of summing it up.\n\nhttps://pvbuzz.com/tesla-battery-cost-reduction-strategy/\n\n\"The new process involves using metallurgical silicon which not many companies have the process, nor expertise to produce effectively.\n\nLuckily, there is one notable mention, HPQ Silicon. HPQ Silicon is a Montreal-based technology company that is developing new proprietary low-cost processes that can produce the metallurgical grade high purity silicon that battery manufacturers are looking for in one step and then transform that Silicon into spherical silicon powders.\n\nThe first process, called the PUREVAP™ Quartz Reduction Reactor (QRR) Project, has successfully produced, transformed, and purified quartz into high purity silicon metal (4N+ Si) in one step. In the second process, the PUREVAP™ Nano Silicon Reactor (NSiR) would enable the low-cost transformation of melted silicon into spherical nanopowders and nanowires. These spherical silicon metal nanopowders will allow the manufacturing of high-performance lithium-ion batteries using silicon metal anodes.\n\n“Our technology can simplify and standardize the process used to convert quartz into silicon and then convert Silicon into nano-sized particles,” says Bernard Tourillon, HPQ Silicon’s CEO. “By doing this affordably, the market potential of silicon anode batteries and the products which could potentially utilize them could be vastly expanded.”\"",
        "created_utc": 1600879152,
        "id": "g6bzdjg",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1600907952.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "MementoMori97",
        "body": "I literally just added LRCX to my actual stock portfolio and now seeing it on WSB is making me scared",
        "created_utc": 1600268209,
        "id": "g5h5l1n",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600297009.0
    },
    {
        "author": "shashankssj3",
        "body": "AMAT/LRCX bounce incoming...been charting like a hawk. Just watch.",
        "created_utc": 1599779477,
        "id": "g4rmqen",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599808277.0
    },
    {
        "author": "dscg24",
        "body": "VMWare, Lam Research, Google\n\nAnyone have any thoughts on the three?",
        "created_utc": 1599959185,
        "id": "g50hmwc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599987985.0
    },
    {
        "author": "123random7",
        "body": "Looking at LRCX, KEYS, SHOP",
        "created_utc": 1599513499,
        "id": "g4dnvwr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599542299.0
    },
    {
        "author": "shashankssj3",
        "body": "Eyeing AMAT 9/18 60$ calls and LRCX 9/12 exp close to the money calls tomorrow. Ridiculously oversold and RSI at \\~30..love the charts on both for a nice bounce.",
        "created_utc": 1599714373,
        "id": "g4mjtgg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599743173.0
    },
    {
        "author": "discodropper",
        "body": "Pretty much everyone will list off some of the household names in big tech, like AAPL, MSFT, AMZN, ADBE, GOOGL, etc. All of these are industry leaders with solid financials, so they’re probably a safe bet for long-term growth. Though they may be overvalued right now (pretty much everything is). \n\nOther than those, within tech I tend to like semiconductors. I figure that cloud computing, AI, AR/VR, self-driving cars, fintech, bitcoin mining, smart phones and computers, etc. are just going to become a bigger and bigger part of the economy. And computer chips (CPUs, GPUs, SSDs, those chips in your credit card, etc.) are at the heart of all of these technologies. It’s pretty clear that technological progress here isn’t slowing, and demand for chips is just going to continue to grow. If you want to go with individual companies, NVDA, AMD, TSM, AMAT, MU, LRCX are all at the forefront right now, and have solid balance sheets. If you don’t want to put all your money on one horse, a non-diversified, semiconductor-focused ETF like SMH or SOXX will give you exposure here while mitigating some of the risk. \n\nGreen/clean energy is a promising market, but it’s a really young industry so there’s a lot of risk in trying to pick a winner. TSLA is ahead of the pack for now, but it’ll have competitors nipping at it’s heals soon enough, and the stock is currently way overvalued. There are also other sectors of this market that TSLA hasn’t tapped into, and could see massive growth in the next 5-15 years as we begin to wean off of fossil fuels. Again, a focused ETF like PBW or QCLN is a good way to mitigate risk and broaden exposure without having to pick a single winner. That said, this sector may be overvalued right now because oil/gas have taken a big hit during COVID and green energy isn’t quite ready for prime time. In other words, oil/gas are currently cheap and will probably rebound a bit Post-COVID, so you could make money with fossil fuels, but I’d stay out of them long-term and bet on clean energy/vehicles instead. \n\nI also like biotech and genomic medicine. TMO is a blue chip that basically has a monopoly and is a go-to for all biological research. Pretty safe bet on a well run company that’ll be around for years. LZAGY, RHHBY, and TECH are similar, but tend to have their hands in more clinical trials and drug development, mainly with small molecules and other ‘classic’ treatment methods. I’m sure there’s a good ETF in this sector, but I haven’t really looked as it’s my field. CRISPR, gene therapy, etc. are all starting to show promise in the clinic, but is a really nascent industry. MRNA and BNTX are probably overvalued right now due to COVID speculation, but if they can get their delivery mechanisms to work (and they’re showing promise), they’ll basically revolutionize medicine. Again, if you don’t want to bet on a single horse, ARKG is a good ETF for genomic medicine. TNX is a very young company that’s showing a lot of promise for sequencing technology, so high risk but potentially very high reward. \n\nOther than that, it’s always a good idea to put money into ‘boring’ non-risky, non-tech stocks. COST, WMT will probably be good picks during the coming economic crisis, and may actually be able to compete with AMZN if they shore up their online interface. V and MC are solid standbys (can’t go wrong with credit cards). Also probably a safe bet to go with health insurance companies. SPY is also a broadly diversified ETF (basically the tracks the S&amp;P) that will be a safe bet long-term.\n\nMy suggestion would be to pick industries you think will grow long-term, and select a few stocks or an ETF within them. Set up a rather diversified portfolio so you aren’t overexposed on any one front (I’ve lost more than the market with this last slump, for instance, since I’m overexposed in tech; I could probably use more ‘boring’ stocks like WMT). One or two shares apiece from 50 promising companies is a much safer bet than 500 shares in one or two very promising companies. Keep each at a smallish percentage of your total (I get really uncomfortable if a single stock goes above 10% of my total, even if it began as 1%, so I sell to bring it back down and use the profit to diversify). Generally speaking, the riskier the industry/company is, the lower percentage of your total it should be. \n\nHope this helps!",
        "created_utc": 1600163197,
        "id": "g5ca2if",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600191997.0
    },
    {
        "author": "Blackops_21",
        "body": "Generally I look for anything on my Watchlist that falls &gt;3.5% without a valid reason (offering new shares like AZEK or trade war implications regarding LRCX would keep me from buying those \"dips\").",
        "created_utc": 1600029388,
        "id": "g55r453",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1600058188.0
    },
    {
        "author": "mikesmcd",
        "body": "That $LRCX article from this morning has me hyped for some major gains coming up. That discount price, though.",
        "created_utc": 1600269281,
        "id": "g5h7orv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600298081.0
    },
    {
        "author": "commitpushdrink",
        "body": "I’ve had my eye on LRCX for a few months now and with tech doing what it’s doing I’m debating 10/23 or 7/16/21 calls slightly OTM.\n\nThey’re simply the best at what the do and what they do is about to see fucking WILD demand when people see how fast 5G really is.",
        "created_utc": 1599514810,
        "id": "g4dqgpq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599543610.0
    },
    {
        "author": "Redererer",
        "body": "LRCX &amp; AMAT are both long term holds for me.",
        "created_utc": 1599248279,
        "id": "g4147dr",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599277079.0
    },
    {
        "author": "DouglasAndrews",
        "body": "I was up 31% before close on 8/31 and I'm still up 24% y'all need to make better investments \n\nAAPL, RUN, NVDA, AMD, HASI, PYPL, ADBE, CRM, XYL, AY, AUG, NEE,CWEN, AGR, EQIX, ADSK, ATVI, PCY, LBRDK, PGR, LRCX, SPCE, ORCL, AMAT, STM, TT, INTC, ALL, ENIA, CWCO",
        "created_utc": 1599169728,
        "id": "g3wq65b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599198528.0
    },
    {
        "author": "mikesmcd",
        "body": "That $LRCX discount price though",
        "created_utc": 1600268361,
        "id": "g5h5vq1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600297161.0
    },
    {
        "author": "MementoMori97",
        "body": "LDOS, LRCX",
        "created_utc": 1600223201,
        "id": "g5fjd9g",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600252001.0
    },
    {
        "author": "MementoMori97",
        "body": "23 years old, letting my Brokerage account grow until I'm ready to put a down payment on a house in a couple years.\n\nBrokerage account:\n\nITOT - 28%\n\nICLN - 15%\n\nWM - 12%\n\nV - 9%\n\nVZ - 9%\n\nBMRG - 9%\n\nLRCX - 9%\n\nCash - 9%\n\n(Will be looking to buy some more shares of ICLN, LRCX and WM next paycheck and add LDOS at around 9% of my portfolio.)\n\n\n\nRoth IRA:\n\nFOCPX (Fidelity OTC fund) - 40%\n\nFSMEX (Medical Technology fund) - 30% \n\nFBSOX (Select IT portfolio) - 20%\n\nFCPGX (Small/Medium Cap growth) - 10%",
        "created_utc": 1599955498,
        "id": "g505xgw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599984298.0
    },
    {
        "author": "dameLillardManiac",
        "body": "ELI5 for this SMIC news? Is my LRCX stock in danger?",
        "created_utc": 1599470874,
        "id": "g4bejkp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599499674.0
    },
    {
        "author": "Blackops_21",
        "body": "That's hilarious. Lam research is on hedge funds top 100 most bought list. Synnex has increased their revenue and earnings by wide margins each of the last 5 years. Do you even research things before you talk?",
        "created_utc": 1599219751,
        "id": "g3yyqxz",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599248551.0
    },
    {
        "author": "heartstesler",
        "body": "CRWD and all others look good and should move up from here\n\nI bought stocks of CRWD.\n\nInfact I bought lot of tech stocks on this dip including Apple Nvidia Tesla Microsoft MasterCard Docusign Lam research\n\nI will keep buying these tech stocks on dips",
        "created_utc": 1599518745,
        "id": "g4dx55d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599547545.0
    },
    {
        "author": "Trumpowell",
        "body": "Thoughts on $LRCX",
        "created_utc": 1599722515,
        "id": "g4mtnbl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599751315.0
    },
    {
        "author": "123random7",
        "body": "Watchlist -  LRCX  ( 5G ), BLK (Finance) , TWLO (Cloud), and SHOP (e-commerce) if you still feel like you want to diversify but otherwise double-down if there's large dip to DCA",
        "created_utc": 1599780594,
        "id": "g4rot2z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599809394.0
    },
    {
        "author": "Blackops_21",
        "body": "2017. Before I give you too much hope I've invested 13k total now lol so some was my own money. In reality I turned 13k into 23k. Using as much capital as possible to day trade one stock or a 3x ETF on perfect days where everything is going good, premarket is all green, futures are up big, like yesterday. Holding through earnings has worked in my favor quite a bit. Betting big on FB, LRCX, and ORLY when they were down.",
        "created_utc": 1599090794,
        "id": "g3scilb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599119594.0
    },
    {
        "author": "snyder810",
        "body": "1. MSFT\n2. AAPL\n3. FB or AMZN - buying right now I’d lean FB\n4. SQ\n5. MA\n6. Semiconductor of your choice - I like LRCX\n7. TDOC\n8. JPM - not a classic “boom” but banks look to have a large turnaround yet, I wouldn’t want to not have a banking play to catch some of that\n9. UNH - imo best in class healthcare play, if you want a higher risk profile pick a biotech you believe in that could take off instead. EX: BLUE\n10. LMT, HD, or CAT - not sexy, but steady growth and balance\n11. energy company of your choice - renewables look like the long term play, but Oil is likely to boom back in your 10 year horizon. If it were me I’d probably play a VLO or PSX to catch the boom and maybe hold in to a renewable turn\n\n12. Speculative tech play - a mid or small cap you believe in\n13. Speculative turnaround play - travel or entertainment category",
        "created_utc": 1599654930,
        "id": "g4jguuj",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599683730.0
    },
    {
        "author": "MP9",
        "body": "I've worked alongside LRCX and they are super efficient and demand high standard. Haven't seen very many companies like LRCX. They can be assholes to their suppliers though. You sort of have to be in some scenarios.",
        "created_utc": 1599656960,
        "id": "g4jjstf",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599685760.0
    },
    {
        "author": "Beagleoverlord33",
        "body": "Amazon\nGoogle \nFacebook\nSalesforce \nV/ma\nLowes\nAmat/lrcx\nBaba\nJd\nPypl\n\nCheated with a few but I like the fin tech and semi equipment space for the near future and would rather pick a bundle then one winner.",
        "created_utc": 1599678868,
        "id": "g4kq2eu",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599707668.0
    },
    {
        "author": "123random7",
        "body": "Bought calls on LRCX",
        "created_utc": 1599698780,
        "id": "g4lts49",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599727580.0
    },
    {
        "author": "catarahbpus",
        "body": "26-year-old, long term investor. Let me know what you guys think or any suggestions!\n\nMSFT (20%)\nQCOM (18%)\nMU  (8.25%)\nLOW (7.5%)\nT (6.5%)\nWFC (5.8%)\nKO (5.5%)\nABBV (4.2%)\nLEVI (4.1%)\nAFL (4%)\nRTX (4%)\nDUK (3.5%)\nGOOGL(2.5%)\n\n\n 6% Cash\n\nBeen thinking of taking profits from some of these (MSFT/QCOM) Adding something like O, LRCX. DOCU/ARBE but on a weakness would be solid. Any other suggestions or thoughts on changes?",
        "created_utc": 1599053556,
        "id": "g3psrtu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599082356.0
    },
    {
        "author": "shashankssj3",
        "body": "$AMAT and $LRCX due for a bounce",
        "created_utc": 1599830856,
        "id": "g4tl41a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599859656.0
    },
    {
        "author": "catarahbpus",
        "body": "Honestly it just goes back to Warren Buffy, be fearful when people are greedy and greedy when people are fearful. Wanted to get LRCX yesterday at 338 but missed it and didn't want to pay the extra 5-8% now look! Down 341, and see what's in store tomorrow, more fear or greed. If it's fear I'm sitting with my cards in hand and looking what I need to add. Hell, I was holding flat this morning until 10am. No need to sell especially just to try and save some change to buy in lower.",
        "created_utc": 1599168495,
        "id": "g3wn7m6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599197295.0
    },
    {
        "author": "Trumpowell",
        "body": "Have you seen the new sanctions on Chinese semiconductor companies\n\nRIP to AMAT, LAM research",
        "created_utc": 1599631039,
        "id": "g4itfsn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599659839.0
    },
    {
        "author": "shashankssj3",
        "body": "Has the same exact chart as AMAT actually. Both LRCX and AMAT move in tangent",
        "created_utc": 1599710565,
        "id": "g4mekx5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599739365.0
    },
    {
        "author": "shashankssj3",
        "body": "LRCX and AMAT have same chart and same set up. Only going with AMAT cuz of the UOA",
        "created_utc": 1599740069,
        "id": "g4nx8a2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599768869.0
    },
    {
        "author": "shashankssj3",
        "body": "LRCX and AMAT",
        "created_utc": 1599742729,
        "id": "g4o54vn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599771529.0
    },
    {
        "author": "Summebride",
        "body": "Agree with LRCX.  It seems to have been unfairly punished in the last week.  Good for a trade at least.",
        "created_utc": 1599807571,
        "id": "g4svyao",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599836371.0
    },
    {
        "author": "UnpolishedPleb",
        "body": "Ah yes all the classic comments about the “tech bubble” and how everything is overvalued. Guess what... “tech” is literally a part of our daily lives now. \n\nIn the dotcom times it was all about lofty valuation on the possibility that tech would be the next big sector. Turns out many years later to actually be true and everyone is pissed off that they were wrong about doubting it. \n\nNow Apple, and Microsoft are literally at the top of the S&amp;P500 yet some people still cannot accept them because of P/E valuations and it’s logical but I think its hilarious how contradictory some of the statements can be. \n\nThese people talk about how its impossible to time the market or that past performance doesn’t indicate future performance yet there is one thing they are certain of. A tech bubble because of the tech bubble that happened 20 years ago. How can everyone be so certain these companies are overvalued when the sector has lead the market for the last 10 years. Maybe tech will fall back or maybe it will continue to outperform for another 10 years. We just don’t know. What’s certain is tech is not what it was 20 years ago and it will be interesting to see how it grows going forward. Those who say techs outperformance isn’t relevant just want to rationalize their bearish stance on tech IMO.  \n\nAll this said the tech sector is  broad and there are fairly valued solid companies out there with good balance sheets. TSM(P/E 27.4) and LRCX(P/E 20.9) are some I am interested in.",
        "created_utc": 1599439871,
        "id": "g4ab50d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599468671.0
    },
    {
        "author": "Redererer",
        "body": "I’ve been waiting on someone to mention LRCX on this sub forever.",
        "created_utc": 1599239004,
        "id": "g40bt6m",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599267804.0
    },
    {
        "author": "mikesmcd",
        "body": "My bets are on $LRCX. Time for some solid gains!",
        "created_utc": 1600269837,
        "id": "g5h8sof",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600298637.0
    },
    {
        "author": "Blackops_21",
        "body": "Sony, Synnex, Lam Research Corp, Teradyne, to name a couple",
        "created_utc": 1599191102,
        "id": "g3y16pg",
        "score": -1,
        "subreddit": "StockMarket",
        "created": 1599219902.0
    },
    {
        "author": "yachtsandthots",
        "body": "Motorola Razr and ring tones lol",
        "created_utc": 1599013314,
        "id": "g3o905c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599042114.0
    },
    {
        "author": "2slowam",
        "body": "I believe that when the secondary manufacturers release (evga, msi, etc), they'll be cheaper. Going to fly off the shelves.",
        "created_utc": 1599068566,
        "id": "g3qtqtc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599097366.0
    }
]