[
    {
        "author": "robotlasagna",
        "body": "Imagine if you used this strategy 20 years ago and one of your picks was GE or Cisco. Both of those companies were seen as unstoppable back then.\n\nA lot can happen in 20 years.",
        "created_utc": 1594848603,
        "id": "fy6rl3f",
        "score": 181,
        "subreddit": "investing",
        "created": 1594877403.0
    },
    {
        "author": "wegwerf874",
        "body": "I'm a very old man, and this feels too much like Cisco. Great company with two-digit annual growth rate in the nineties but back then priced for the year 2050.",
        "created_utc": 1595456948,
        "id": "fyx5vch",
        "score": 69,
        "subreddit": "investing",
        "created": 1595485748.0
    },
    {
        "author": "ODNI_NSA_FBI_CIA_DIA",
        "body": "They were using cisco webx.",
        "created_utc": 1596142631,
        "id": "fzs8qk0",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1596171431.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "It is hard to tell what tech stocks and the NASDAQ will do but a bit of history is worth studying.\n\nIn 2000 Cisco was the giant of the internet and the internet was the giant of tech stocks. Every employee at Cisco was rich because they all got stock options (yes, including the janitors in those days) and the stock price had climbed from $10 in 98 to $33 in 99 and $79/sh in 2000. They did then sell and still do sell routers that were the backbone of the internet and CSCO was everyone's tech darling. I can't tell you how many Cisco employees had told me in spring of 2000 that they were not going to diversify until CSCO hit $100/sh. In Sept of 2001, their share price had dropped to $12/share. They still were the backbone of the internet but the internet and tech were no longer the darling of the Market. In Feb of 2009 they were at $14/sh and are today at $48/sh. So they today as an ongoing company still doing what it did and with a strong balance sheet are trading at roughly 2/3rds the price they were 20 years ago. That is what can happen to a really good tech company.\n\nBTW, CSCO is not the only one. Intel was at $74.88 in the fall of 2000 and is at $60/sh now and was running around in the $20's for most of the past 20 years. Still a great tech company doing great things.   And yes Intel employees also got rich on options.  I met with a Intel employee, a janitor, single, living in a trailer that was about to exercise $3 mm in net in the money INTC options and needed help with estate planning.   Those were the days.  A short edit:  In 2000 the estate tax began with only $675,000 of assets at death and it started just below 50% and quickly grew to 55%.   So you didn't need to be very wealthy to need estate tax planning.\n\nMicrosoft, one of today's tech darlings, was $50/sh in early 2000. It wandered around $25/share for 15 years until it again hit $50/sh in fall of 2015, fifteen long years later. The last 5 years have been good for it but will it stay at $200/sh?",
        "created_utc": 1595185321,
        "id": "fyl1bdi",
        "score": 56,
        "subreddit": "stocks",
        "created": 1595214121.0
    },
    {
        "author": "likeitis121",
        "body": "Depends on how you categorize them.  They aren't software companies, but the general market sees them as tech companies, which is the companies that benefit so much.  The people hyping up Tesla so much, are arguing that it's a tech company, even though it makes cars.\n\nThe big 5 (MSFT/AAPL/AMZN/FB/GOOG) are definitely solid companies.  That doesn't change the fact that they've gotten overvalued.  Apple has grown 2.5x in value the past few years, but revenues have slowed, and profits really haven't changed much.  \n\nBelow that top tier you have a bunch of unprofitable $100-300M companies that have gotten hyped up.  And simply comparing it to 2000 without reference is ignoring it.  Microsoft, Cisco, and Intel were top 10 companies and weren't the single product late 90's product that you focus on.  Cisco still lost 90% of it's value, and still isn't back up there.  Microsoft still took 16 years to recover it's lost market cap.  \n\nHow am I throwing a tantrum.  It's a fact that the only time that valuation compared to trailing earnings was higher was the dot com bubble, and near right before great depression, the only time that market cap was higher as a percentage of GDP was dot com bubble.  There's tons of comparables that suggest this market is overvalued, and absolutely 0 that it's undervalued compared to history.",
        "created_utc": 1594779580,
        "id": "fy3qh5v",
        "score": 18,
        "subreddit": "StockMarket",
        "created": 1594808380.0
    },
    {
        "author": "skwirly715",
        "body": "MSFT has growth potential due to its diversification across tech sub-sectors. It is also safe for this reason, whereas single-service companies are less so. I don’t think you can put it in the same box as Cisco or Intel, hardware companies focused on providing a single service. \n\nMSFT has greater market share in the broader tech sector than either of those companies because it has expanded vertically (across sub sectors, for example gaming, office software, web services, laptops/hardware) instead of trying to expand horizontally (within its own sub sector) and has plans to continue to do so via its cloud services. I personally do not know who will “win” the cloud web services sub sector but I know that MSFT won’t lose purely due to its advantage in existing office software (MS Office integrates well with devices like Azure and Sharepoint making it more appealing to companies exploring the cloud).\n\nI love your take regarding the cyclical nature of those speculator dollars, but I think MSFT should be compared to AAPL, AMZN, and GOOG instead of CSCO and Intel. Maybe Shopify is a better comp for CSCO and Intel?",
        "created_utc": 1595194666,
        "id": "fylihmd",
        "score": 18,
        "subreddit": "stocks",
        "created": 1595223466.0
    },
    {
        "author": "Iskippedfaceday",
        "body": "I don’t mean to sound rebellious, but this sub has really rejected the potential of this stock for no reason.\n\nThey are partnered with: Apple, Nvidia, Intel, AMD, Boeing, IBM, Lenovo, HP, Lyft, Puma, Toshiba, Raytheon, Thunderbolt, Universal Audio, Focusrite, and Cisco etc...\n\nThey also make twice as much revenue as their entire market cap and now have the only PCIe 4.0 expansion system in the world.\n\nI understand that the history of this sub is based on people getting burned and such, but when we all drool over a possible partnership with ONE of those companies? This company has them all already. \n\nTheir contracts with the U.S. military, side projects with NVIDIA, and the incentives given to their CEO to keep their share price up are just bonuses. \n\nI am really committed to seeing how this company performs, because after beating their earnings so many times, they are definitely well-positioned to move forward.",
        "created_utc": 1594671110,
        "id": "fxyqaxx",
        "score": 17,
        "subreddit": "pennystocks",
        "created": 1594699910.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "Dividends?  We are talking about tech stocks here.  CSCO began dividends in 2011 at an overwhelming $0.06/share.  MSFT started dividends in 2003 at a magnificent 8 cents/share and today is paying an outstanding dividend of 0.98%.   Intel (INTC) was paying dividends in 2000 and it was a huge 2 cents/share.   The words dividends and tech stocks can not easily be used in the same sentence.",
        "created_utc": 1595187041,
        "id": "fyl4k6y",
        "score": 14,
        "subreddit": "stocks",
        "created": 1595215841.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "I seriously thought about buying a Model 3 last year.  Ultimately I did not as I think I would have range anxiety on long trips.  But a number of friends have Teslas and each of them really like the car.  I also think that Tesla is going to be a viable car company long term and will do well in the future.\n\nThe problem is that the current price would only be justified if they were already profitable building and selling 5-6 mm cars per year and they don't do 10% of that and are not in any way profitable.   So anyone buying now is assuming they will find somebody that is a greater fool than they are to actually buy the stock from them at a price higher than $1500.\n\nIn 2000 I was young and stupid and financially had a great year.  Some of the companies I invested in that are still very successful and still leaders in their field were CSCO and JNPR.   2000 was the year of the internet and Cisco built all the routers for the internet worldwide.  Some ex Cisco employees had started Juniper and were building specialty routers that were pushing Cisco to improve.   All of that still is true and both companies are fabulously profitable and leaders in their field but today can be classified as old tech.  I paid $65/sh for CSCO and bought JNPR at $65, $83, and $115/sh.   Today CSCO is $48 and JNPR is $22 with no splits in the meantime.   Sometime you can be early and never recover.   That is where Tesla is now.   In 20 years 80% of the cars being sold will be EVs or H2 and every manufacturer will be making excellent products.  Tesla will be old tech and the 20 year olds now pumping Tesla will be 40 with 2 kids approaching college age and wondering about that $1500/sh stock they bought in 2020 that is worth $350/sh in 2040.",
        "created_utc": 1594520788,
        "id": "fxsce6i",
        "score": 13,
        "subreddit": "investing",
        "created": 1594549588.0
    },
    {
        "author": "__justsayin__",
        "body": "You don't want a tech stock paying a \"good dividend\" since most of them are losers - just look at the likes of IBM, CSCO, even QCOM.  You want a tech company which focuses on growth, and growth companies typically do not pay dividends.",
        "created_utc": 1594771155,
        "id": "fy3c463",
        "score": 12,
        "subreddit": "CanadianInvestor",
        "created": 1594799955.0
    },
    {
        "author": "CptTonyStark",
        "body": "NASDAQ more than tripled from late 1998 to March 2000. The P/E ratios soared above 100. Expectations of future stock returns ranged from 15%-25% a year. \n\nCISCO was selling at a triple digit P/E ratio, with a market cap of $600 billion. If Cisco grew it's earnings by 15% a year, it would still be selling well above the avg P/E ratio 10 years later. And if it returned 15% for the next 25 years and the US economy continued growing at 5% a year, Cisco would be bigger than the entire economy.\n\nWhen the bubble burst, even a blue Chip like Cisco lost 90% of its value.",
        "created_utc": 1595791262,
        "id": "fzbvsle",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1595820062.0
    },
    {
        "author": "_icarcus",
        "body": "first, figure out which sector you want to invest in. tech? energy? cloud computing? AI? home builders? \n\nsecond, find ETF’s that cover that sector and then compare its 5-10 yr chart to the S&amp;P 500. \n\nFrom an outside perspective, from Jim Cramer — host of CNBC’s, MAD MONEY — a fool proof way to start a saving is to invest your first $10,000 into a total market ETFs. Something like the SPY, VOO, VTI, or — if you want to focus on growth stocks — high risk, high return: VOOG. \n\nOverall, ETFs will allow you exposure to hundreds of companies under one name. Apple, MSFT, Cisco will all be  a tech focused ETF. They, on average, follow the markets trend and produce steady but OK returns. \n\nCheck out etf.com and look at their ETF screeners. They’ll tell you the expense rates (how much it costs a year), it’s price, what companies it has holdings in, and it has a return chart of 5+ years.",
        "created_utc": 1595800863,
        "id": "fzce488",
        "score": 10,
        "subreddit": "RobinHood",
        "created": 1595829663.0
    },
    {
        "author": "SurgeonLoki",
        "body": "Anti tech trust. Streamed with YouTube, meeting via Cisco and the Congress morons using iPhones....only in America 😓",
        "created_utc": 1596053469,
        "id": "fznm8a4",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1596082269.0
    },
    {
        "author": "UABeeezy",
        "body": "Congress using Cisco is classic boomer shit. Only they would use a competitor when doing a virtual antitrust hearing. Fucking dweebs",
        "created_utc": 1596043326,
        "id": "fzn0w5k",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1596072126.0
    },
    {
        "author": "AccomplishedClub6",
        "body": "You are assuming GE and CSCO aren't also part of index funds that people have invested in (which also lost money when these stocks dropped).\n\nYou are also assuming 100% of the stocks people pick will crash down and never recover, and there won't be big winners in some of their picks.  Picking stocks is exactly like an index fund, except it's a smaller group of stocks relative to the thousands in an index fund.  So just like an index fund, there will be losers in your stock picks.  But just like an index, there will be 20% of your picks that return 80% of the total profits over the long term.",
        "created_utc": 1594863111,
        "id": "fy7ib89",
        "score": 7,
        "subreddit": "investing",
        "created": 1594891911.0
    },
    {
        "author": "solidmussel",
        "body": "For 4 months in.... I think you have a pretty good start. \n\nOne suggestion... dont be overconfident about your picks. \n\nI'd also point out that you have some entire sectors missing and you may want to find a good retail/grocery, real estate stock (I hold Kroger and Costco and sun communities).\n\nYou may also want to add a couple extreme value and a couple high growth.\n\nFor value I hold ATT, IBM, Cisco, BRK.  For growth I have SHOP, NFLX, Splunk,  and Lyft.\n\nLastly get Google in there!!",
        "created_utc": 1594605668,
        "id": "fxw0evs",
        "score": 7,
        "subreddit": "investing",
        "created": 1594634468.0
    },
    {
        "author": "dawgsgoodjortsbad",
        "body": "AMZN was AMZN in 2000.  MFST was MFST.  CISCO was CISCO.  \n\nAll of them crashed HARD AF (&gt; 50+%) in 2000.\n\nIf you bought Microsoft back in 2000 at the peak, you would have to hold over 16 years just to break even.",
        "created_utc": 1595455155,
        "id": "fyx2rao",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595483955.0
    },
    {
        "author": "covalent523",
        "body": "lol jeff using his name while mark using facebook as his in the cisco call. ALPHA AF",
        "created_utc": 1596043329,
        "id": "fzn0wdm",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596072129.0
    },
    {
        "author": "hijinks",
        "body": "yes.. ask any good option trader.. most of them will not hold through earnings. \n\nCisco is a good example. Their CEO would come out and say.. ya we beat beatings by 30 cents BUT we expect a lot of new competition. Stock will sell off. \n\nOr he comes out and earnings are -30 cents and he says outcome looks good moving forward and stock goes up",
        "created_utc": 1595392487,
        "id": "fyub8c9",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595421287.0
    },
    {
        "author": "robotlasagna",
        "body": "They said \\*exactly\\* this about Cisco back in 1999/2000. Cisco was going to run the world and be the future of television and radio and all this other stuff and they (at the time were supposed to be the first $1T market cap company. You should go on CNN finance and search the archives and see the similarities with how people talked about Cisco vs Tesla.\n\nDont get me wrong Tesla is a super forward thinking company but you should always at least consider the possibility that people are a little too excited about its prospects in terms of share price.",
        "created_utc": 1594741597,
        "id": "fy1o9of",
        "score": 5,
        "subreddit": "investing",
        "created": 1594770397.0
    },
    {
        "author": "Shacreme",
        "body": "Online Schooling? Tech stocks should shoot up to the moon......\n\nMSFT, ZM, CSCO should shoot up 4/5%",
        "created_utc": 1595013672,
        "id": "fye1zm6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595042472.0
    },
    {
        "author": "ChronicCSD",
        "body": "CSCO is such dog shit. Its baffling.",
        "created_utc": 1593701330,
        "id": "fwp9tuw",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593730130.0
    },
    {
        "author": "Rahvinx",
        "body": "Csco\nIt's not sexy but they make money hand over fist",
        "created_utc": 1594774709,
        "id": "fy3i9qc",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594803509.0
    },
    {
        "author": "Children_of_Lucifer",
        "body": "All I got from the link was Cisco Webex. So all in CSCO?",
        "created_utc": 1595294885,
        "id": "fypz9pk",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595323685.0
    },
    {
        "author": "Marcheesio",
        "body": "Yeah, exactly. If you used this same logic 20 years, sure you’d have winners but you’d also be holding stocks like GE and Cisco which have seriously lagged the market as a whole.\n\nThere’s no such thing as a “never sell” stock. Berkshire Hathaway might be the closest, that’s about it.",
        "created_utc": 1595554530,
        "id": "fz1mql6",
        "score": 5,
        "subreddit": "stocks",
        "created": 1595583330.0
    },
    {
        "author": "Aaronsmth5",
        "body": "I have used teams and also frequently use Webex from Cisco. Zoom is fucking terrible",
        "created_utc": 1595298025,
        "id": "fyq4mys",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595326825.0
    },
    {
        "author": "Power80770M",
        "body": "Nope, you're wrong. Cisco, Intel, Oracle, and Microsoft had absolutely insane valuations back then, and they were all very profitable.",
        "created_utc": 1594071020,
        "id": "fx52y7k",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594099820.0
    },
    {
        "author": "Neo1331",
        "body": "True, it's going to be interesting to see where Intel goes in the next 5 years. Though AMD is eroding their market share slightly, I really don't think they will get a lot of server side clients in the end. Intel controls about 98% of the server world and corporate clients don't think on a year to year basis, so if 7 nm doesn't come out till 2022 it won't effect their corporate client base all that much.  \n\nRemember the world runs on Intel, Microsoft and Cisco....",
        "created_utc": 1595611961,
        "id": "fz40b1h",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595640761.0
    },
    {
        "author": "haasvacado",
        "body": "Gentleman, idgaf about your individual views on the severity of the current pandemic but y’all should know that the rising numbers outside the US may very well contribute to a rapid shift in global sentiment towards “oh, fuck here we go again” in the next week or two. \n\nShort term positions so you don’t write me off as a frustrated bear:\n\nUL 62.5c 8/21\nCSCO 46.5c 7/31\nDBX 22.5p 7/31\nKO 48.5p 7/31",
        "created_utc": 1595949292,
        "id": "fzipk7o",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595978092.0
    },
    {
        "author": "Sayter",
        "body": "most sectors red. AMZN AAPL MSFT GOOGLE WMT COST NVDA AMD CSCO are keeping us up or we'll be pulled to 313.",
        "created_utc": 1594320641,
        "id": "fxg8c0n",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594349441.0
    },
    {
        "author": "Pleather_Boots",
        "body": "I think (IMO) we may be in a “melt up” or mini bubble now that could result in a pullback but not a crash like 2000. \n\nMy main painful memory of 2000 was buying Cisco, a solid tech, watching it go up 10x in a few months. Being jubilant at my investing skills. And watching it drop down to where it started. \n\nWe’re not seeing run ups like that across the market. Some are getting close but most not nearly that high. \n\nI’ve sold off a little of my holdings as they reach all time highs because I don’t want to have another case of 20 year regret as I did with Cisco.",
        "created_utc": 1594231663,
        "id": "fxc51ic",
        "score": 4,
        "subreddit": "investing",
        "created": 1594260463.0
    },
    {
        "author": "haasvacado",
        "body": "I’ve played 4 or 5 stocks like a fiddle this week but I have no vibe for tomorrow. Sold off everything. See you guys next week.\n\nEdit:\nCSCO\nHPQ\nKO\nDBX",
        "created_utc": 1596129005,
        "id": "fzqx0dt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596157805.0
    },
    {
        "author": "SageOfSixCabbages",
        "body": "Second this. They're working with Cisco and their software is more on the contact tracing of COVID.",
        "created_utc": 1594944636,
        "id": "fyb5hs9",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1594973436.0
    },
    {
        "author": "NerdBlender",
        "body": "I’m sorry, but how exactly do they have a back door? \n\nYou obviously don’t understand how networks work. It’s absolutely no more risk using Huawei than using Cisco, Nokia, Ericsson or anyone else.\n\nNetwork providers build security around devices and can see exactly how much data is being sent where, if a copy of data was being funnelled to China, or if someone was attempting unauthorised access to equipment you would be damn sure they would know about it.\n\nIf we were saying we are not using Huawei because of China and their human rights records or their censorship, then fine. But we are doing this because the US say so. \n\nI have never seen a scrap of evidence that says Huawei are any less secure than any other network hardware vendor. If there was, don’t you think their competition and the security services would be shouting it from the rooftops, but they are not. \n\nThis is not a national security issue, this is a trade issue.",
        "created_utc": 1594798098,
        "id": "fy4fkzj",
        "score": 4,
        "subreddit": "investing",
        "created": 1594826898.0
    },
    {
        "author": "realmastodon2",
        "body": "\\&gt;cisco\n\nI always mistakenly think Oracle owns them.",
        "created_utc": 1595481989,
        "id": "fyyb2qm",
        "score": 4,
        "subreddit": "investing",
        "created": 1595510789.0
    },
    {
        "author": "Coyote-Thunder",
        "body": "Some of their investors include: Cisco, Samsung, and WWE. BAH GOD THATS KANE'S MUSIC!",
        "created_utc": 1595004814,
        "id": "fydjlo3",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1595033614.0
    },
    {
        "author": "strolls",
        "body": "The top item on his list of unsustainable valuations is Cisco.\n\nLook at the date, and then look at [Cisco's chart.](https://i.imgur.com/o5KnpYr.png)\n\nThis article was written at the peak of the dot-com boom, and he appears to have called it.\n\nI'm not convinced the article is alarmingly appropriate today - I'd need clarification on that.",
        "created_utc": 1595223080,
        "id": "fymrzlz",
        "score": 4,
        "subreddit": "SecurityAnalysis",
        "created": 1595251880.0
    },
    {
        "author": "ElephantSquad",
        "body": "Puts on CISCO after this abomination of a webex showing\n\nTheir tech is as slow and old as these congressmen",
        "created_utc": 1596046431,
        "id": "fzn7cnx",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596075231.0
    },
    {
        "author": "MementoMori97",
        "body": "My advice:\n\n1) Index funds are a great way to mitigate some risk from just holding singular companies. Personally I hold my entire Roth in mutual funds (some index and some actively managed) and 1/3 of my individual account in index funds.\n\n2) Look into a Roth IRA if you plan to hold long term. (For tax purposes). Dividends cause taxable events and are taxed as income, a Roth lets your money grow tax free but you can't take out more than what you originally put in without penalties.\n\n3) Personally I hate the idea of partial shares of stocks/etfs. I'd rather just save up a bit more and buy a full share, but thats just my preference.\n\nAs for dividend stocks: CSCO, T, KO, etc. There are many classic dividend stocks you can find on the internet.",
        "created_utc": 1593629812,
        "id": "fwm1ywy",
        "score": 3,
        "subreddit": "stocks",
        "created": 1593658612.0
    },
    {
        "author": "LuxGang",
        "body": "There's mountains of data that show most people (including professionals who do it for a living) don't beat the market consistently over the long term. If it was so easy to trim the fat, everyone would do it and there would be no market to beat.\n\nThe fact that most people lose to the market over the long term is undeniable proof that you will at some point make a mistake, have an emotional reaction, buy too high, or sell too early, and you will lose to the market.\n\nEveryone used to think CSCO, XOM, and T were the future and nothing would stop them. Look where we are now. \n\nAnd before you say \"BuT tHeSe TeCh CoMpAnIeS aRe DiFfErEnT!\" I suggest looking at anti-trust cases of the past, and how those are likely to return with the amount of power these FANG stocks command.",
        "created_utc": 1596148436,
        "id": "fzsrcti",
        "score": 3,
        "subreddit": "stocks",
        "created": 1596177236.0
    },
    {
        "author": "Astronaut100",
        "body": "I wouldn't touch bank stocks. They have been and will continue to be a yield trap. Interest rates aren't going up till at least 2022. Stocks like T, VZ, IBM, and CSCO are better yield plays. At least, they have some potential to grow.",
        "created_utc": 1594155482,
        "id": "fx8tuev",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594184282.0
    },
    {
        "author": "also_roses",
        "body": "TSM 7/31 $70c\nPTON 7/31 $85c\nSNAP 7/31 $30c\nCSCO 7/31 $50c \n\nAnd some fuck it TLRD 8/22 $1c",
        "created_utc": 1594437598,
        "id": "fxlmgae",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594466398.0
    },
    {
        "author": "AnAnonymousFool",
        "body": "Every stock you mentioned is down 25-40% over the last 5 years. Dividends are great, but you'd have made way more by putting your money into basically any top tech stock\n\nThat 13% that GLV pays out is annualized. Per month, they pay out roughly 1%. So essentially you get ~20% total growth over a 5 year period if you account for the decrease in stock price and the lower dividends you get throughout the last 5 years. Compare that to MSFT which is up 340% not including their small 1% dividend. or TSLA which is up 450% over the last 5 years. Or even a less hyped tech stock like Cisco is up 63% in the last 5 years. Or look at some more crazy stocks like Shopify which is up over **2000%** over the last 5 years. Yes you read that right\n\nDividend stocks are nice to diversify and get some consistent income, but it doesn't have anywhere near the upside that stocks have. To make a livable wage on dividend stocks, you'd have to have somewhere close to a $1M portfolio that is 100% invested into dividend stocks and that would return you like $60k if youre lucky before taxes\n\nEdit: I see I'm getting down votes, so maybe people just hate the tech stock hype, so ill look at other industries. O'Reily Autoparts is up 80% over the past 5 years. McDonalds is up 95% over the last 5 years. The list goes on\n\nSure there are also some very negative stocks, but dividend stocks will NEVER have the same growth opportunity that a regular stock has",
        "created_utc": 1594945837,
        "id": "fyb7jio",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594974637.0
    },
    {
        "author": "IDidntTellYouThat",
        "body": "True... but have you looked up the cost of the Cisco hardware? It's like \"buy Cisco products if you hate money!\"",
        "created_utc": 1594841862,
        "id": "fy6dkya",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594870662.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "As another commenter said Cisco the darling and backbone of the internet was at $77/share in March of 2000.  20 years later it is at $45 and spent most of the intervening years in the teens.  So anybody that thinks their paltry 5-10 year time horizon is gonna help is whistling Dixie.  And this is a huge still massively successful company as opposed to a company with no products, no or little earnings and an illusory future.\n\nBut I certainly understand as I was young and stupid once myself and bought some of the NASDAQ crap at way too high a price.",
        "created_utc": 1594247166,
        "id": "fxd1j4c",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594275966.0
    },
    {
        "author": "geooooorge",
        "body": "They're using Webex... Calls on CSCO ???",
        "created_utc": 1596044815,
        "id": "fzn415f",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596073615.0
    },
    {
        "author": "power_of_sun",
        "body": "Hold CSCO???",
        "created_utc": 1594323348,
        "id": "fxge11e",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594352148.0
    },
    {
        "author": "RainbowSexPants",
        "body": "WebEx is doggy shit, that's why the man that created it left Cisco and created Zoom.",
        "created_utc": 1594511918,
        "id": "fxrvwed",
        "score": 3,
        "subreddit": "investing",
        "created": 1594540718.0
    },
    {
        "author": "its_me_poida",
        "body": "Going deep long on WORK, CSCO, GSK, SNE, NEP, NEM - abandoning cash gang going to activate my buying power.",
        "created_utc": 1594622963,
        "id": "fxwnqc3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594651763.0
    },
    {
        "author": "bkorsedal",
        "body": "Burn baby burn!  Cisco Inferno!  Burn baby burn!  Burn that mother fucker down!",
        "created_utc": 1595562562,
        "id": "fz20hkd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595591362.0
    },
    {
        "author": "Vast_Cricket",
        "body": "I think CSCO stock split occuring every 6 months.",
        "created_utc": 1595186939,
        "id": "fyl4deg",
        "score": 3,
        "subreddit": "stocks",
        "created": 1595215739.0
    },
    {
        "author": "johnhammondsexpenses",
        "body": "Cisco never returned to its Dotcom level highs to date, so its possible to be a solid company and previously have been in bubble that should be stayed away from.",
        "created_utc": 1594089423,
        "id": "fx5zyv0",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1594118223.0
    },
    {
        "author": "LSatou",
        "body": "Here's a few sector ETFs I'm a big fan of:\n\nPAWZ (IDXX, FRPT, ZTS, CHWY) \n\nWCLD (FSLY, DOCU, ZM, SHOP, etc)\n\nHACK (CSCO, PANW, NET, SPLK)\n\nFTXL (SWKS, TER, NVDA, INTC, MRVL etc)",
        "created_utc": 1594948427,
        "id": "fybbwfo",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594977227.0
    },
    {
        "author": "RetardStrength-",
        "body": "Pays to own some dividend payers in the portfolio for sideways market. On top of all the growth plays I made in March I also picked up Extra Space Storage, Cisco, Banks, and Philip Morris. If the growth plays slow down I can fall back on dividends. Gotta love portfolio strategy... fun times",
        "created_utc": 1594962356,
        "id": "fybxaj3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594991156.0
    },
    {
        "author": "lm2bofbb",
        "body": "I'm just a random dude on the internet and I don't think I know a lot more than you do, but overall I like it. \n\nTo be completely honest though, if you asked someone 20 years ago what should be in their buy and hold forever portfolio they'd've said companies like Cisco, eBay and Yahoo, and have no clue why you're talking about some company named after a river in South America. They'd also laugh you out the room for suggesting Apple. Thus, I'd probably avoid most tech companies outside of Microsoft for 'hold forever,' as it has a platform, which is much more difficult to overtake.\n\n  \nI'd also maybe shy away from McDonald's. I think most younger Americans don't like it as much as some newer competitors from various aspects; Chick-Fil-A for people looking for something cheap and Five Guys and Shake Shack for people who are willing to shell out the extra few bucks for a better quality burger.",
        "created_utc": 1594997483,
        "id": "fyd4qrl",
        "score": 2,
        "subreddit": "investing",
        "created": 1595026283.0
    },
    {
        "author": "9090990",
        "body": "Anyone see the EV to sales ratio on SHOP and how it is higher than Cisco was in the dot com boom? I know I’m gonna get burnt but it’s so tempting to short.",
        "created_utc": 1594501852,
        "id": "fxr2hfc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594530652.0
    },
    {
        "author": "Kainint",
        "body": "Real shit.\n\nHere's my positions currently:\n\nFor 7/17:  \nTWTR 38c  \nNIO 17c  \nSNAP 29c  \nMSFT 225c  \nUPWK 20c (meme stock from front page, but it was super cheap so 🤷)\n  \nFor 8/21:  \nCSCO 60c  \n\n\n  \nTwitter in particular has been very resistant to drops recently (barring today, but everything ate the drops today), and Cisco seems like a shoe-in with the massive rollout of new network infrastructures impacting earnings and consistent growth.",
        "created_utc": 1594328782,
        "id": "fxgpduv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594357582.0
    },
    {
        "author": "dum_townerino",
        "body": "Google Meet as well. AND WebEx (Cisco)\n\nZM is fuk once people wake up",
        "created_utc": 1594342545,
        "id": "fxhf4ky",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594371345.0
    },
    {
        "author": "roaf",
        "body": "I work as a autist in this space and have been for the last 10 years. I can tell you after working for 5 different companies in the last decade and doing Cisco to MSFT, MSFT to Cisco and running POCs for all of them no one is as close as MSFT is right now. \n\nTeams is just an entry point. Hardware right now is almost irrelevant as all businesses are moving parts of their business to permanent WFH if they have not already.\n\nCisco/Slack/Zoom/your mom doesn't have Power Apps/Power Automate/PowerBI and the connector sources to MS Teams that Microsoft does. \n\nIt isn't just about the audio and video companies want, they want to automate all the entry level jobs that were onsite or just menial. \n\nTelling you guys I am not that smart. I was getting close to good money and to leave one job before COVID it took me 1.5 years to get the same money. Since COVID hit it took me 3 weeks to change to my current position with an increase.",
        "created_utc": 1594836504,
        "id": "fy626j7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594865304.0
    },
    {
        "author": "feelinggoodabouthood",
        "body": "Ask those who didn't sell csco in 2000, and bought more on the dip.",
        "created_utc": 1595482040,
        "id": "fyyb50b",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1595510840.0
    },
    {
        "author": "ryit29",
        "body": "Who the heck buys value tech stocks like Cisco. If the tech bubble bursts, tech value stocks will crash more than tech growth stocks lol",
        "created_utc": 1595165303,
        "id": "fyk1i55",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595194103.0
    },
    {
        "author": "kyle_io",
        "body": "It may also be worth looking at this from another angle. You've already shown an interest in some diversification, given your broad accumulation of tech stocks rather than betting on an individual one. And you list an interest in additional companies, 2 payment / financials and 3 healthcare related.\n\nA lot of the focus on long term investing is based on the minimization of downside. Ex: Suppose one company from your list of 7 tech stocks got banned from a country (we're seeing the beginnings of this with Huawei, likely expect some retaliation). How exposed are you to that negative news?\n\nBy constructing your own collection of 7+ tech stocks, you'll end up re-creating your own mini diversified ETF. By adding additional sectors into your investment portfolio, you're diversifying your risk from one sector into multiple. The end result is an actively managed portfolio where you do all the work. If you value your time / energy spent on managing stocks in this portfolio, you're effectively paying a fee for this actively managed portfolio. At the very least, you're spending your free time.\n\nSuppose you want to focus on a tech-heavy portfolio, but from a less actively managed standpoint. You can pick up an etf, like VGT for example, that focuses on just the tech sector. From the top asset holdings as of 6/30, that etf holds AAPL, MSFT, V, M, INTC, NVDA, Adobe, Cisco, Paypal, Salesforce with roughly 60% of it's assets. This is actually pretty well aligned with your current collection of stocks. There are individual sector ETFs, dividend growth ETFs, disruptive tech ETFs, and broad market ETFs. It's important to recognize when the collection of stocks you end up with actually aligns with a broader index. Arguably your current portfolio and intended direction seems like 40% VGT and 30% VHT. If later you want to add exposure to other parts of the economy, you might end up with a mix of multiple individual sector ETFs, which might end up having significant overlap with the S&amp;P500 or VTI (total market ETF). A long road to end up at a broad market ETF.\n\nThe important thing about ETFs that track benchmarks / indices is that the index is a moving target. Right now there are discussions about TSLA being included in the S&amp;P 500, which would kick some other company out. All the S&amp;P index tracking funds would adjust to this new definition of the index, and all passive investors would then be exposed to TSLA. This is true for many of the index tracking funds, the index definition can change and the funds change to reflect that.\n\nIn trying to outperform an index, you're making a bet that you can pick stocks that do better than the continually evolving indices that track economic growth of various sectors. It's always worth evaluating whether you can outperform the 7-9% long term avg the S&amp;P500 returns, and how much effort it takes for you to do that. By spending a lot of time and effort on stocks, you're spending time trying to improve performance on current savings. Your time could also be spent acquiring skills to increase your earning potential, increasing future savings.\n\nTL;DR: Upgrade your portfolio to sector ETFs, eventually to VTI.",
        "created_utc": 1595197606,
        "id": "fylnvo7",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595226406.0
    },
    {
        "author": "ReversalTheory",
        "body": "Holy shit AMD, Cisco, Netgear keep printing for me 🤑",
        "created_utc": 1595550326,
        "id": "fz1fd4p",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595579126.0
    },
    {
        "author": "Saul-Clive99",
        "body": "AAPL, MSFT, AMZN, FB, GOOG, INTC, CSCO, CMCSA, KO and TSLA.",
        "created_utc": 1595550609,
        "id": "fz1fvsc",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595579409.0
    },
    {
        "author": "LegalAdvantage2",
        "body": "They just released an app with Cisco. And they are an education play because more schools will announce going online",
        "created_utc": 1595008708,
        "id": "fydrp37",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1595037508.0
    },
    {
        "author": "nascentmind",
        "body": "This is true very much true in India. Most of these \"product\" companies are heavily filled with contractors and their numbers are almost equal to greater than the permanent employees. There are multiple contractors which are basically outsourcing companies with their employees working onsite at Intel, Cisco etc.\n\nMany a times I see that these contractors are employed to do the death march for failing products or if the company is failing, to keep them afloat. I have seen this with Renesas mobile which had their modem come from Nokia acquisition which had completely failed in the market. They then was brought by Broadcom and everyone was laid off and was again resold to some Chinese company.",
        "created_utc": 1595823118,
        "id": "fzdeta7",
        "score": 2,
        "subreddit": "investing",
        "created": 1595851918.0
    },
    {
        "author": "gibmekarmababe",
        "body": "Cisco Webex",
        "created_utc": 1596059953,
        "id": "fznzgzh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596088753.0
    },
    {
        "author": "The-Hyrax",
        "body": "Thoughts on QRVO? Looks promising. \n\nCustomers like AAPL, CSCO, HPQ etc. \n\nNow $767M revenue, expecting $900+ next Q",
        "created_utc": 1596133333,
        "id": "fzr85gg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596162133.0
    },
    {
        "author": "trashcantambourine",
        "body": "I’ve been buying Cisco calls for months. All real businesses use webex.",
        "created_utc": 1596149150,
        "id": "fzssugx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596177950.0
    },
    {
        "author": "GourmetFilet",
        "body": "Ill check it out. I do remember that CSCO play. it was perfect timing. Thanks!!",
        "created_utc": 1595899836,
        "id": "fzgv25w",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595928636.0
    },
    {
        "author": "VladimirPutin2016",
        "body": "WebEx man, CSCO 200% by EOD",
        "created_utc": 1596046604,
        "id": "fzn7pob",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596075404.0
    },
    {
        "author": "haasvacado",
        "body": "Marsupial Persuasion checking in. We’re doing fine; just trying to keep abreast of all the neat deals out there.\n\nBought puts on KO, DBX\nBought calls on UL, CSCO, and HPQ. \nToo lazy to type exp but mostly a month or less.\n\nI stay the fuck away from memes and the big bad tech on trial. And SPY; no thanks.",
        "created_utc": 1595965206,
        "id": "fzjmo67",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595994006.0
    },
    {
        "author": "MementoMori97",
        "body": "Is this for an IRA or Roth IRA or just a normal brokerage account?\n\nDividends create taxable income so REITs, and other high dividend investments are better suited for a tax-advantaged account. Not that you can't hold them in regular brokerage accounts, you just have taxes to pay on the income.\n\nPersonally I think you are too heavily weighted into T, CSCO could be another good tech choice for dividends. Maybe look into a total market index fund or S&amp;P index fund to hold ~1/3 of your portfolio in, this helps mitigate risk and track the market as a whole.\n\nThis is just my suggestion, feel free to do what you wish but I enjoy the little volatility saftey net my 30% ITOT holding in my individual account gives me.",
        "created_utc": 1593615668,
        "id": "fwl7rfa",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593644468.0
    },
    {
        "author": "WrongWeekToQuit",
        "body": "If you look back at the dotcom bubble pop, the one-hit wonders went bankrupt, but their demise also took a lot of wind out of the sails of the big tech names of the day including Microsoft, Cisco, IBM, HP, Sun, INTC, etc.  Yes, some of these were indeed tech companies, but they were huge and some well diversified.  \n\nWhile NASDAQ dropped around 80% in the recession, even the Russell 2000 dropped about 50% over the same period so everyone took a hit.",
        "created_utc": 1594592636,
        "id": "fxveokk",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1594621436.0
    },
    {
        "author": "StoneDragonSD",
        "body": "They may very well continue to explode in the short run, but I don’t believe it will last. I think they will come back down to earth. AMZN to me looks like CSCO in 1999. I am not a buyer of tech here.",
        "created_utc": 1594481528,
        "id": "fxoreak",
        "score": 2,
        "subreddit": "investing",
        "created": 1594510328.0
    },
    {
        "author": "stephenphph",
        "body": "Lots of people dont even know anything about One Stop Systems. Sure it ran up 27% yesterday. But thats nothing for this stock. This could be 50+ in a year or two. Their AI EDGE Technology is superior to competitors and Cloud Technologies and will be used in all AI. They have partnerships with many of the top tech companies and their financials are pretty good. I would wait for a pull back and re-enter. Thats what im doing. Screw these people in here trying to pump a stock for 30 seconds and get out. Unless you have 10k+ and are experienced you should be research good companies you want to invest a little bit into to start, invest, and watch and learn and use some play money to learn with gambling on random stocks you think might take off. If you cant afford to lose money, you need to pick your stocks wisely instead of relying on forums 100%. You need to learn to read charts and learn analysis and market trends etc. Sure you can rely on forums, but 99% of the people here told you not to buy this company and yet they have no idea what they are talking about.\n\nEdit: because im sure some of these pros are going to come out and downvote me and tell me pennies make you rich....\n\n OSS is partnered with: Apple, NVIDIA, Intel, AMD, Boeing, IBM, Lenovo,  HP, Lyft, Puma, Toshiba, Raytheon, Thunderbolt, Universal Audio,  Focusrite, and Cisco etc...  They also make twice as much revenue as their entire market cap and now  have the only PCIe 4.0 expansion system in the world. \n\nI can give you an example of EDGE technology vs Cloud technology but honestly all you are looking for is , should i buy? and Im not going to waste my time with that. Research the difference between EDGE technology and Cloud technology... this is how people find these stocks before they blow up. these people in here thinking they are going to get a hot tip everyday on a surefire banger.... absolutely delusional.",
        "created_utc": 1594702562,
        "id": "fy09vrw",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1594731362.0
    },
    {
        "author": "likeitis121",
        "body": "Eh, I still think it's pretty bad.  We have a whole pile of $10B+ companies that have no expectations of being profitable.  People think dot com bubble was all about these nothing companies, but Cisco, Microsoft, and Intel were some of the big valuation names at the times.  They are all still around, and profitable, but the valuations still can get way off.  Cisco and Intel are still below peaks from 2000, and Microsoft took 16 years to pass it.  \n\nW5000/GDP is about 55% higher than it was in 2000; so unless we think that companies are deriving that much more revenue outside of the country, then I think people are being too complacent about the valuations.",
        "created_utc": 1594952811,
        "id": "fybj5f0",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1594981611.0
    },
    {
        "author": "Sherpav",
        "body": "7/17 $60 eBay calls, 8/21 $60 CSCO calls, 7/24 $220 MSFT calls, and $130 7/17 WMT calls. I’m pretty stoked with all of them",
        "created_utc": 1594326355,
        "id": "fxgkeh1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594355155.0
    },
    {
        "author": "jz187",
        "body": "You got good company. Warren Buffet is buying gas pipelines and Bill Gross is all in on value stocks. I'm buying gas pipelines myself.\n\nTech is in a bubble. I still remember the dot com bubble of the late 90s. I still remember how Microsoft didn't break even with its 1999 peak until 2015.\n\nIf you had invested in a basket of tech stocks back in late 1999, early 2000, chances are, you are only doing well now because of Amazon. Just look at what happened to [Pets.com](https://Pets.com), Cisco, Sun Microsystems, Yahoo, Netscape. Many stocks went to zero, others were bought for pennies on the dollar from their peak valuations. Still others took decades to break even or still hasn't broken even.\n\nThe thing is, even with Amazon, you could have bought at 95% off from its bubble peak if you had just waited a few years.\n\nThere may very well be a time to buy tech, but that time is not now. The time is when the bubble burst and the valuations are pricing in irrational pessimism. Amazon dropped from $113/share in March 2000 to $5/share in October 2001.\n\nThe future of mankind belongs to high tech, but right now there are a lot of posers that are using tech as nothing more than a talking point to scam money from investors. Wait until these guys go bankrupt, and the survivors are priced like they are going out of business, then buy.\n\nIn investing, being early is the same thing as being wrong. Many people think tech investing works like early bird gets the worm, but in reality it's the second mouse that gets the cheese. The first wave of investors will fund the build out of all these companies, then there will be a crash as it becomes obvious not all these companies can generate a profit. Then the companies will go bankrupt, consolidate, and the survivors learn how to be profitable. This happened with railroads, cars, aircraft, electronics, internet. Each one was a major tech revolution of its day, and each one also burned a ton of early investors.\n\nThe time to buy tech is 2 years after the crash. This gives enough time for the bankruptcies and consolidation to happen.\n\n\\---\n\nOh, and dump Air Canada. Please stay away from Airlines unless you are a better investor than Warren Buffet. Airline investing is not for newbies, it's literally one of the hardest sectors to be a successful investor in. If you scan the world's list of richest people, no one made their money in airlines. If you must, keep 1% at most in AC as play money. Almost no one is smart enough to make money in airlines, you are likely not an exception.",
        "created_utc": 1594769554,
        "id": "fy39g19",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1594798354.0
    },
    {
        "author": "MementoMori97",
        "body": "Go with an S&amp;P or total market index fund instead for at least a chunk of your investments to tone down some volatility and uncertainty that individual stocks have.\n\nPersonally I stay far far away from WFC in my investments due to their account fraud shit. There are so many better options for individual companies IMO.\n\nThe only individual stocks I hold are CSCO, WM, RTX, NOK, BMRG, and PFE.",
        "created_utc": 1595636446,
        "id": "fz5cuvf",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595665246.0
    },
    {
        "author": "Sweet-Zookeepergame",
        "body": "Just look at Oblong $OBLG :\n\n1.Profitable\n2.Partnership with Cisco\n3.No debt\n4.NASA, Siemens and Verizon are already clients\n\nNot a penny anymore. I hope it‘s ok for posting about it here.",
        "created_utc": 1595713610,
        "id": "fz8pfoq",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1595742410.0
    },
    {
        "author": "ggochoo",
        "body": "Have people been bullish on CSCO before? I’m guessing revenue from webex will be a surprise and boost",
        "created_utc": 1596232423,
        "id": "fzx4kpp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596261223.0
    },
    {
        "author": "AceVonSpades",
        "body": "Calls on Cisco",
        "created_utc": 1596051311,
        "id": "fznhpwa",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596080111.0
    },
    {
        "author": "MasterDDT",
        "body": "Thanks, god damn I thought all this China/security shit was priced in already for ZM, it dropped earlier. Lmao also senators always using Cisco Webex, they must have $CSCO calls",
        "created_utc": 1596130110,
        "id": "fzqzmw0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596158910.0
    },
    {
        "author": "24901Miles",
        "body": "Yeah. The commerce business could split and compete with Walmart while AWS can be on its own against Cisco and all that.",
        "created_utc": 1595990642,
        "id": "fzkyw97",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596019442.0
    },
    {
        "author": "Chvip",
        "body": "As said before great advice and I agree it wouldn't be a great habit to get into in the long run. Right now I am looking at CSCO investor relations to get to know them better than I already do. I like to see that they have a good lead/market share in 5g and WiFi - 6.",
        "created_utc": 1594077919,
        "id": "fx5gab3",
        "score": 2,
        "subreddit": "investing",
        "created": 1594106719.0
    },
    {
        "author": "newlife_newaccount",
        "body": "I mean people do that shit with cisco and sysco so....",
        "created_utc": 1594095440,
        "id": "fx69b37",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594124240.0
    },
    {
        "author": "Soybeanrice",
        "body": "Appreciate the advice. I’m not putting it all into leveraged etf’s - got some “ghetto bonds” aka stocks that never move (Cisco for example)",
        "created_utc": 1594156738,
        "id": "fx8wf6y",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594185538.0
    },
    {
        "author": "theonedollarking",
        "body": "Okay I kind of shit myself when I saw this.\n\nThey are partnered with: Apple, NVIDIA, Intel, AMD, Boeing, IBM, Lenovo, HP, Lyft, Puma, Toshiba, Raytheon, Thunderbolt, Universal Audio, Focusrite, Cisco... ???? \n\nU.S. navy? \n\nI don’t know what to do here. My guard is up but I still don’t know if I want to go in...",
        "created_utc": 1594672658,
        "id": "fxytjcd",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1594701458.0
    },
    {
        "author": "Soybeanrice",
        "body": "I pretend Cisco are bonds - legit is a rock",
        "created_utc": 1594665462,
        "id": "fxyed5p",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594694262.0
    },
    {
        "author": "LegalAdvantage2",
        "body": "PHUN just dropped an app with Cisco for covid",
        "created_utc": 1594995372,
        "id": "fyd0iyc",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1595024172.0
    },
    {
        "author": "neutralpoliticsbot",
        "body": "all of a sudden everyone needs CSCO!",
        "created_utc": 1595515270,
        "id": "fyzfejo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595544070.0
    },
    {
        "author": "spxputs",
        "body": "i’m surprised CSCO hasn’t done more with WebEx to compete with Zoom. \n\nthey just need to hustle to make it look more consumer-y and less intimidating to your average non-business user and invest in marketing it as a non-China linked secure version. literally no reason why they shouldn’t be riding the video conferencing wave",
        "created_utc": 1596228369,
        "id": "fzwsf4g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596257169.0
    },
    {
        "author": "LittleTragik",
        "body": "Got some Cisco 48c this morning on the dip. Earnings on the 12th. I sell IT equipment to businesses and think they are going to do pretty well. Lots of companies upgrading hardware right now. They also have Webex which is non Chinese zoom. Get in before premiums get too high.",
        "created_utc": 1596148860,
        "id": "fzss8pw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596177660.0
    },
    {
        "author": "fresh-one",
        "body": "Could be anything. Data collection software, trained models to iterate on with transfer learning, simulation software for generating training data. All of this is time consuming to make. Lyft, Google, Uber all have open sourced some of their data, helping bootstrap something more quickly too. \n\nThey will be behind, sure. But with more resources and scale, one could get ahead eventually too. Look at Huawei-Cisco and 5G. Start from behind but now Huawei is a great choice cost and performance POV.",
        "created_utc": 1593806870,
        "id": "fwu5a61",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593835670.0
    },
    {
        "author": "scopolamine",
        "body": "My Q2 earnings winners prediction:\n\nPYPL, NVDA, PG, PFE, BLK, CME, AMGN, CSCO, GILD, INTC, IBM, MDT, TMUS, SQ and AGN",
        "created_utc": 1593978952,
        "id": "fx11d2v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594007752.0
    },
    {
        "author": "Monk_Boy",
        "body": "Look at CSCO price chart starting early 2000. That's what a tech bubble looks like. After 20 years the stock still hasn't recovered.",
        "created_utc": 1593983485,
        "id": "fx19rmb",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1594012285.0
    },
    {
        "author": "dumbducky",
        "body": "Fun fact: if you bought $10k of CSCO exactly 20 years ago and reinvested all your dividends, you would have almost $10k of CSCO today.",
        "created_utc": 1594048922,
        "id": "fx3u81w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594077722.0
    },
    {
        "author": "flyingorange",
        "body": "Since its IPO in 1990, CSCO has made a 115000% growth. At the same time, MSFT which was a public company for a longer period (since 1986) only managed to overtake CSCO in March 2019",
        "created_utc": 1594053620,
        "id": "fx43itr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594082420.0
    },
    {
        "author": "Drokgnar",
        "body": "Cisco getting sued for discrimination.. hmm",
        "created_utc": 1593696669,
        "id": "fwozvay",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593725469.0
    },
    {
        "author": "BongRips4Jezus",
        "body": "My hands are going to be tested these next few days. Most of my positions are calls for AAPL and MSFT in January. And GLW shares",
        "created_utc": 1594938460,
        "id": "fyaubwi",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594967260.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW: Glass manufacturer that is used in vials, phones, TVs, and other medical/commercial appliances. They have a contract to produce vials for Pfizer, and received a grant from the government to ensure that they will be able to produce enough vials for the future vaccine. Had their price target upgraded to $33 by Citigroup, currently oversold at $25.75\n\nDon’t know when this thing is gonna moon again, but I hope it’s soon. Probably needs to announce another biomed contract to turn more heads. White knuckling these calls hoping the market realizes its value soon",
        "created_utc": 1593635683,
        "id": "fwmf23z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593664483.0
    },
    {
        "author": "FormalFew",
        "body": "Last chance on cheap GLW $30 calls, don't say you weren't warned",
        "created_utc": 1594928968,
        "id": "fyaay6c",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594957768.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "True, hoping to catch lightening in a bottle with GLW again. Their PT was raised to 36 and they broke $28 resistance yesterday.",
        "created_utc": 1595015966,
        "id": "fye6mz9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595044766.0
    },
    {
        "author": "AstockcollapseNow",
        "body": "Anyone have a read on GLW, JNPR, CIEN, etc.; the \"fiber optics\" plays?  \n\n\nNext major stimulus should have a big broadband piece to it.",
        "created_utc": 1595018337,
        "id": "fyebbwf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595047137.0
    },
    {
        "author": "emtendo",
        "body": "Corning as well (GLW) make the glass bottles that all the vaccines will be stored in...\n\nEdit: got ticker symbol wrong",
        "created_utc": 1594799365,
        "id": "fy4gvhi",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594828165.0
    },
    {
        "author": "peter-doubt",
        "body": "First: congrats .. good ride!\n\nSecond: you beat me in... @70 vs me @140.\n\nThird: we agree .. this price is nuts!  \n\nPercentagewise, your timing has helped you outperform me.  By a long shot!  \n\nWhat to do next?  I'm looking at SMH.... Semiconductor ETF .. weighted to 5G build out. . oh, NVDA is part of it.\n\nAs for dividends.. not much unless you're taking risks with oils, but at 3%, I could suggest Corning (GLW).  Their market volume may be declining, but there's little comment about the volume they can supply to pharma packaging (think billions of doses in glass vials).\n\nAny other ideas?",
        "created_utc": 1594167043,
        "id": "fx9fy4k",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594195843.0
    },
    {
        "author": "oaklandChi84",
        "body": "My GLW and NOK calls are coming back to life. About damn time.",
        "created_utc": 1594315580,
        "id": "fxfxcce",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594344380.0
    },
    {
        "author": "FormalFew",
        "body": "For realises, this is your final reminder on the day that Corning Glass/$GLW is only going to profit from lockdowns. They're also heavy in the plexiglass/vinyl market",
        "created_utc": 1594755972,
        "id": "fy2ieuf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594784772.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW leaving oversold territory. About damn time",
        "created_utc": 1594047880,
        "id": "fx3s8pg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594076680.0
    },
    {
        "author": "cutiesarustimes2",
        "body": "Owens corning makes the best cotton candy imo.",
        "created_utc": 1594708056,
        "id": "fy0ghdv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594736856.0
    },
    {
        "author": "_Oboe_",
        "body": "Corning is a great play for shares. \n\nNo option volume. So, not a good WSB post.",
        "created_utc": 1594913011,
        "id": "fy9e018",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594941811.0
    },
    {
        "author": "BeginningOriginal0",
        "body": "Good luck, I’ve been long Corning for a few years and hopped on calls early this morning with the news. Awesome company with exposure to many different activities (5G, med devices, electronics). Also a great town to visit in upstate ny.",
        "created_utc": 1594909441,
        "id": "fy973l6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594938241.0
    },
    {
        "author": "LavenderAutist",
        "body": "First it was gorilla glass. And now this?\n\nGLW is never going anywhere.",
        "created_utc": 1594921841,
        "id": "fy9wdan",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594950641.0
    },
    {
        "author": "visionarymind",
        "body": "🔱🎩 cumpenny  ℹ️💲 GLW❔\n\n👁 will wait \n\n⏳",
        "created_utc": 1594939384,
        "id": "fyaw0wa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594968184.0
    },
    {
        "author": "999rwh",
        "body": "GLW- Glass Vials",
        "created_utc": 1594784589,
        "id": "fy3ym2h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594813389.0
    },
    {
        "author": "FormalFew",
        "body": "Last chance to get in on GLW, you've been warned",
        "created_utc": 1594753605,
        "id": "fy2dg2x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594782405.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Well over $10,000. Instead I’m still down 2,000. The most I fucked up on was selling my GLW 24c when it was trading at 23. Had already quintupled my money and got out. Then over the next week it shot up to $28. Could’ve turned $150 into $6,000.",
        "created_utc": 1594747220,
        "id": "fy1zw31",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594776020.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "C’mon GLW, break $28, start the new uptrend!",
        "created_utc": 1594835288,
        "id": "fy5zl4x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594864088.0
    },
    {
        "author": "FormalFew",
        "body": "GLW 28/28.5c 7/31",
        "created_utc": 1594837663,
        "id": "fy64ny1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594866463.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Hey I missed an opportunity to turn $150 into $12,000 on GLW calls. Made a profit of $600 and thought I was being smart. Then it mooned, and I just watched in disbelief.",
        "created_utc": 1593798609,
        "id": "fwtpvsm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593827409.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Called that GLW breakout yesterday. $35 here we come",
        "created_utc": 1594909475,
        "id": "fy975uo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594938275.0
    },
    {
        "author": "StrictDefinition4",
        "body": "If we need 8 billion vials I think glass companies will profit like crazy GLW has the biggest contract I believe and they got a 200$ million contract from the government to expand.",
        "created_utc": 1594922468,
        "id": "fy9xog5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594951268.0
    },
    {
        "author": "everybodzzz",
        "body": "&gt; GLW\n\npriced in - if you're hearing about a DoD contract now, every contractor's mistress in DC knew about it a month ago.",
        "created_utc": 1594916708,
        "id": "fy9lksc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594945508.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Get in on this GLW uptrend. Cheap options and this stock likes to rise for a week or two despite overall market movement when it breaks out of resistance",
        "created_utc": 1594910241,
        "id": "fy98l7r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594939041.0
    },
    {
        "author": "ShirleyDirty",
        "body": "Ppg and corning",
        "created_utc": 1594335022,
        "id": "fxh1rip",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594363822.0
    },
    {
        "author": "_Oboe_",
        "body": "Corning is going to kill it, but absolutely no volume on calls.",
        "created_utc": 1594827053,
        "id": "fy5i6nm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594855853.0
    },
    {
        "author": "Es-Click",
        "body": "PGE, AZN, K12,Corning,NRZ,",
        "created_utc": 1594829570,
        "id": "fy5ndyd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594858370.0
    },
    {
        "author": "seancarr181",
        "body": "I have no idea what Corning is but I'll look into it lol. I'm assuming calls",
        "created_utc": 1595048983,
        "id": "fyfq3ma",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595077783.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW and AZN",
        "created_utc": 1595005443,
        "id": "fydkwdf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595034243.0
    },
    {
        "author": "math1024",
        "body": "The main difference between 5G and the previous roll outs is just a lot more fiber and small cell antennas. I think the best 5G plays would be fiber companies like GLW, COMM, and OCC.\n\nThere's also been [legislation](https://en.wikisource.org/wiki/Executive_Order_13858) promoting onshoring so you might want to focus on american manufacturers.",
        "created_utc": 1594988527,
        "id": "fycpcsq",
        "score": 1,
        "subreddit": "investing",
        "created": 1595017327.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW reported 5 new insider trades to the SEC yesterday.\n\n\n$19,709.90 of shares acquired by Henretta Deborah A (Director)\n\n\n$33,592.30 of shares acquired by Cummings Robert F Jr (Director)   \n\n\n$11,655.00 of shares acquired by Canning John A Jr  \n\n\n$24,864.00 of shares acquired by Burns Stephanie (Director)  \n\n$28,179.20 of shares acquired by Martin Kevin J (Director)",
        "created_utc": 1593799277,
        "id": "fwtr64r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593828077.0
    },
    {
        "author": "ValenTom",
        "body": "Initiated a position in Prudential Financial in my Roth IRA today. I was previously targeting Realty Income but the share price is just a tad higher than where I’d like to continue accumulating. As long as PRU stays around these levels I’ll continue accumulating 8-10 shares per month for the foreseeable future. \n\nBrings my Roth IRA to five total holdings as I develop a DGI portfolio there. \n\nAT&amp;T\n\nCVS\n\nCorning Glass\n\nRealty Income\n\nPrudential Financial",
        "created_utc": 1594050147,
        "id": "fx3wleb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594078947.0
    },
    {
        "author": "iamfar_",
        "body": "Schott, Corning and BD are all bigger players.\n\nPlus given the timelines of these vaccine projects I doubt pharma companies are going to spend the time to evaluate an alternate container closure system.",
        "created_utc": 1594791137,
        "id": "fy47qbb",
        "score": 1,
        "subreddit": "investing",
        "created": 1594819937.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW started its breakout. Could be a really good play for the next two weeks",
        "created_utc": 1594845334,
        "id": "fy6kuiy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594874134.0
    },
    {
        "author": "smungung",
        "body": "$103 calls on Corning!? What type of crack are you smoking?",
        "created_utc": 1594907980,
        "id": "fy94gxr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594936780.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW actually held stable today, could be the sign of the next leg up",
        "created_utc": 1593732795,
        "id": "fwr35wv",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1593761595.0
    },
    {
        "author": "BongRips4Jezus",
        "body": "My hands are going to be tested these next few days. Most of my positions are calls for AAPL and MSFT in January. And GLW shares",
        "created_utc": 1594938460,
        "id": "fyaubwi",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594967260.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW: Glass manufacturer that is used in vials, phones, TVs, and other medical/commercial appliances. They have a contract to produce vials for Pfizer, and received a grant from the government to ensure that they will be able to produce enough vials for the future vaccine. Had their price target upgraded to $33 by Citigroup, currently oversold at $25.75\n\nDon’t know when this thing is gonna moon again, but I hope it’s soon. Probably needs to announce another biomed contract to turn more heads. White knuckling these calls hoping the market realizes its value soon",
        "created_utc": 1593635683,
        "id": "fwmf23z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593664483.0
    },
    {
        "author": "FormalFew",
        "body": "Last chance on cheap GLW $30 calls, don't say you weren't warned",
        "created_utc": 1594928968,
        "id": "fyaay6c",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594957768.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "True, hoping to catch lightening in a bottle with GLW again. Their PT was raised to 36 and they broke $28 resistance yesterday.",
        "created_utc": 1595015966,
        "id": "fye6mz9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595044766.0
    },
    {
        "author": "AstockcollapseNow",
        "body": "Anyone have a read on GLW, JNPR, CIEN, etc.; the \"fiber optics\" plays?  \n\n\nNext major stimulus should have a big broadband piece to it.",
        "created_utc": 1595018337,
        "id": "fyebbwf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595047137.0
    },
    {
        "author": "emtendo",
        "body": "Corning as well (GLW) make the glass bottles that all the vaccines will be stored in...\n\nEdit: got ticker symbol wrong",
        "created_utc": 1594799365,
        "id": "fy4gvhi",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594828165.0
    },
    {
        "author": "peter-doubt",
        "body": "First: congrats .. good ride!\n\nSecond: you beat me in... @70 vs me @140.\n\nThird: we agree .. this price is nuts!  \n\nPercentagewise, your timing has helped you outperform me.  By a long shot!  \n\nWhat to do next?  I'm looking at SMH.... Semiconductor ETF .. weighted to 5G build out. . oh, NVDA is part of it.\n\nAs for dividends.. not much unless you're taking risks with oils, but at 3%, I could suggest Corning (GLW).  Their market volume may be declining, but there's little comment about the volume they can supply to pharma packaging (think billions of doses in glass vials).\n\nAny other ideas?",
        "created_utc": 1594167043,
        "id": "fx9fy4k",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594195843.0
    },
    {
        "author": "oaklandChi84",
        "body": "My GLW and NOK calls are coming back to life. About damn time.",
        "created_utc": 1594315580,
        "id": "fxfxcce",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594344380.0
    },
    {
        "author": "FormalFew",
        "body": "For realises, this is your final reminder on the day that Corning Glass/$GLW is only going to profit from lockdowns. They're also heavy in the plexiglass/vinyl market",
        "created_utc": 1594755972,
        "id": "fy2ieuf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594784772.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW leaving oversold territory. About damn time",
        "created_utc": 1594047880,
        "id": "fx3s8pg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594076680.0
    },
    {
        "author": "cutiesarustimes2",
        "body": "Owens corning makes the best cotton candy imo.",
        "created_utc": 1594708056,
        "id": "fy0ghdv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594736856.0
    },
    {
        "author": "_Oboe_",
        "body": "Corning is a great play for shares. \n\nNo option volume. So, not a good WSB post.",
        "created_utc": 1594913011,
        "id": "fy9e018",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594941811.0
    },
    {
        "author": "BeginningOriginal0",
        "body": "Good luck, I’ve been long Corning for a few years and hopped on calls early this morning with the news. Awesome company with exposure to many different activities (5G, med devices, electronics). Also a great town to visit in upstate ny.",
        "created_utc": 1594909441,
        "id": "fy973l6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594938241.0
    },
    {
        "author": "LavenderAutist",
        "body": "First it was gorilla glass. And now this?\n\nGLW is never going anywhere.",
        "created_utc": 1594921841,
        "id": "fy9wdan",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594950641.0
    },
    {
        "author": "visionarymind",
        "body": "🔱🎩 cumpenny  ℹ️💲 GLW❔\n\n👁 will wait \n\n⏳",
        "created_utc": 1594939384,
        "id": "fyaw0wa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594968184.0
    },
    {
        "author": "999rwh",
        "body": "GLW- Glass Vials",
        "created_utc": 1594784589,
        "id": "fy3ym2h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594813389.0
    },
    {
        "author": "FormalFew",
        "body": "Last chance to get in on GLW, you've been warned",
        "created_utc": 1594753605,
        "id": "fy2dg2x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594782405.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Well over $10,000. Instead I’m still down 2,000. The most I fucked up on was selling my GLW 24c when it was trading at 23. Had already quintupled my money and got out. Then over the next week it shot up to $28. Could’ve turned $150 into $6,000.",
        "created_utc": 1594747220,
        "id": "fy1zw31",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594776020.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "C’mon GLW, break $28, start the new uptrend!",
        "created_utc": 1594835288,
        "id": "fy5zl4x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594864088.0
    },
    {
        "author": "FormalFew",
        "body": "GLW 28/28.5c 7/31",
        "created_utc": 1594837663,
        "id": "fy64ny1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594866463.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Hey I missed an opportunity to turn $150 into $12,000 on GLW calls. Made a profit of $600 and thought I was being smart. Then it mooned, and I just watched in disbelief.",
        "created_utc": 1593798609,
        "id": "fwtpvsm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593827409.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Called that GLW breakout yesterday. $35 here we come",
        "created_utc": 1594909475,
        "id": "fy975uo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594938275.0
    },
    {
        "author": "StrictDefinition4",
        "body": "If we need 8 billion vials I think glass companies will profit like crazy GLW has the biggest contract I believe and they got a 200$ million contract from the government to expand.",
        "created_utc": 1594922468,
        "id": "fy9xog5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594951268.0
    },
    {
        "author": "everybodzzz",
        "body": "&gt; GLW\n\npriced in - if you're hearing about a DoD contract now, every contractor's mistress in DC knew about it a month ago.",
        "created_utc": 1594916708,
        "id": "fy9lksc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594945508.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Get in on this GLW uptrend. Cheap options and this stock likes to rise for a week or two despite overall market movement when it breaks out of resistance",
        "created_utc": 1594910241,
        "id": "fy98l7r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594939041.0
    },
    {
        "author": "ShirleyDirty",
        "body": "Ppg and corning",
        "created_utc": 1594335022,
        "id": "fxh1rip",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594363822.0
    },
    {
        "author": "_Oboe_",
        "body": "Corning is going to kill it, but absolutely no volume on calls.",
        "created_utc": 1594827053,
        "id": "fy5i6nm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594855853.0
    },
    {
        "author": "Es-Click",
        "body": "PGE, AZN, K12,Corning,NRZ,",
        "created_utc": 1594829570,
        "id": "fy5ndyd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594858370.0
    },
    {
        "author": "seancarr181",
        "body": "I have no idea what Corning is but I'll look into it lol. I'm assuming calls",
        "created_utc": 1595048983,
        "id": "fyfq3ma",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595077783.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW and AZN",
        "created_utc": 1595005443,
        "id": "fydkwdf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595034243.0
    },
    {
        "author": "math1024",
        "body": "The main difference between 5G and the previous roll outs is just a lot more fiber and small cell antennas. I think the best 5G plays would be fiber companies like GLW, COMM, and OCC.\n\nThere's also been [legislation](https://en.wikisource.org/wiki/Executive_Order_13858) promoting onshoring so you might want to focus on american manufacturers.",
        "created_utc": 1594988527,
        "id": "fycpcsq",
        "score": 1,
        "subreddit": "investing",
        "created": 1595017327.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW reported 5 new insider trades to the SEC yesterday.\n\n\n$19,709.90 of shares acquired by Henretta Deborah A (Director)\n\n\n$33,592.30 of shares acquired by Cummings Robert F Jr (Director)   \n\n\n$11,655.00 of shares acquired by Canning John A Jr  \n\n\n$24,864.00 of shares acquired by Burns Stephanie (Director)  \n\n$28,179.20 of shares acquired by Martin Kevin J (Director)",
        "created_utc": 1593799277,
        "id": "fwtr64r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593828077.0
    },
    {
        "author": "ValenTom",
        "body": "Initiated a position in Prudential Financial in my Roth IRA today. I was previously targeting Realty Income but the share price is just a tad higher than where I’d like to continue accumulating. As long as PRU stays around these levels I’ll continue accumulating 8-10 shares per month for the foreseeable future. \n\nBrings my Roth IRA to five total holdings as I develop a DGI portfolio there. \n\nAT&amp;T\n\nCVS\n\nCorning Glass\n\nRealty Income\n\nPrudential Financial",
        "created_utc": 1594050147,
        "id": "fx3wleb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594078947.0
    },
    {
        "author": "iamfar_",
        "body": "Schott, Corning and BD are all bigger players.\n\nPlus given the timelines of these vaccine projects I doubt pharma companies are going to spend the time to evaluate an alternate container closure system.",
        "created_utc": 1594791137,
        "id": "fy47qbb",
        "score": 1,
        "subreddit": "investing",
        "created": 1594819937.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW started its breakout. Could be a really good play for the next two weeks",
        "created_utc": 1594845334,
        "id": "fy6kuiy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594874134.0
    },
    {
        "author": "smungung",
        "body": "$103 calls on Corning!? What type of crack are you smoking?",
        "created_utc": 1594907980,
        "id": "fy94gxr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594936780.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "GLW actually held stable today, could be the sign of the next leg up",
        "created_utc": 1593732795,
        "id": "fwr35wv",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1593761595.0
    }
]