[
    {
        "author": "stockpikr",
        "body": "*This is a large shift for UK telecoms, Erickson, Samsung, Nokia, and Qualcomm. These companies will have until 2027 to* ***remove and replace*** *all 5g transmission equipment.*\n\nFYI, Erickson, Samsung, Nokia are competitors to Huawei and use no Huawei equipment. Qualcomm sells chipsets to Huawei for use in their phones and buy nothing from Huawei.",
        "created_utc": 1594751239,
        "id": "fy28fsr",
        "score": 215,
        "subreddit": "investing",
        "created": 1594780039.0
    },
    {
        "author": "LovableContrarian",
        "body": "Bruh, it's based on future expectations.\n\nAMD is grabbing market share like a hungry slut (not just in consumer PCs but also in consoles, enterprise, servers, etc), and INTC just continues to fuck up everything. It's honestly sort of amazing how many mistakes Intel has made in the past year or so, and they are legitimately at risk of becoming completely uncompetitive.\n\nThey basically lost 100% of the enthusiast/custom PC market overnight, and most of their revenue now comes from contracts with Dell, Lenovo, Apple, etc for desktop and notebook CPUs (and a few other random components, like wifi and Bluetooth cards). And, these companies will almost definitely be looking to AMD, as Intel's 7nm chips aren't expected to be available until *at least* 2022, and AMD is already mass-producing. Depending on how hard these companies ditch Intel, it could be an actual death blow. \n\nAnd that doesn't even bring up the issue that things are shifting more and more to mobile platforms, where Intel completely failed. Companies like Apple, Samsung, and Qualcomm absolutely dominate in the mobile SoC sector and managed to castrate a titan when Intel attempted to enter that market and failed miserably. \n\nIt's bad news all around. \n\nDoes that mean they can't come back? No. Of course they can. But the concerns are real.\n\nWhat other major stocks have you seen recently crash 13% on earnings then just... Stay there? Flat? We are in the most legendary dip-buying market of all time, where almost any dip will be bought without any logic, and yet no one would touch INTC, which is one of the biggest tech companies in the world.\n\nIt's a bit concerning.\n\nYour DD is basically \"bruh, it's Intel. And they made a lot of money in 2019.\" But that's frankly just not very good DD my friend.",
        "created_utc": 1595631956,
        "id": "fz54toq",
        "score": 127,
        "subreddit": "wallstreetbets",
        "created": 1595660756.0
    },
    {
        "author": "dwdsquared2",
        "body": "**Events in the US Today (EDT):**\n\n* 7:00am - MBA Mortgage Apps. (WoW) &amp; 30-yr Rate \\[1/3 Volatility\\]\n* 8:30am - Goods Trade Balance (Jun) \\[2/3 Volatility\\]\n   * Retail Inv. Ex Auto (Jun) \\[2/3 Volatility\\]\n* 9:00am - The House meets for session\n* 9:30am - Seevol Cushing Oil Storage Report \\[2/3 Volatility\\]\n* 10:00am - Pending Home Sales (MoM-Jun) \\[3/3 Volatility\\]\n   * The Senate meets for session\n* 10:30am - Crude Oil Inventories \\[3/3 Volatility\\]\n* 12:00pm - House Committee Hearing: Examining the Dominance of Amazon, Apple, Facebook, and Google\n   * [YouTube Live Link](https://www.youtube.com/watch?v=WBFDQvIrWYM&amp;feature=emb_title)\n   * [News article on why the hearing is happening &amp; possible outcomes](https://thehill.com/policy/technology/509287-top-tech-ceos-brace-for-house-grilling)\n   * Witnesses\n      * Jeff Bezos, Amazon ([Prepared Statement](http://docs.house.gov/meetings/JU/JU05/20200729/110883/HHRG-116-JU05-Wstate-BezosJ-20200729.pdf))\n      * Tim Cook, Apple ([Prepared Statement](http://docs.house.gov/meetings/JU/JU05/20200729/110883/HHRG-116-JU05-Wstate-CookT-20200729.pdf))\n      * Sundar Pichai, Alphabet/Google ([Prepared Statement](http://docs.house.gov/meetings/JU/JU05/20200729/110883/HHRG-116-JU05-Wstate-PichaiS-20200729.pdf))\n      * Mark Zuckerberg, Facebook ([Prepared Statement](http://docs.house.gov/meetings/JU/JU05/20200729/110883/HHRG-116-JU05-Wstate-ZuckerbergM-20200729.pdf))\n* 1:35pm - POTUS participates in a roundtable with supporters\n   * Odessa Marriott Hotel and Conference Center, Odessa, Texas\n* **2:00pm - FOMC Statement \\[3/3 Volatility\\]**\n   * **Fed Interest Rate Decision \\[3/3 Volatility\\]**\n* 2:05pm - POTUS delivers remarks at a fundraising committee reception\n* **2:30pm - FOMC Press Conference \\[3/3 Volatility\\]**\n   * Conducted by Chairman Jerome Powell\n* 3:50pm - POTUS participates in a tour of Double Eagle Energy Oil Rig\n   * Double Eagle Energy Oil Rig, Permian Basin, Texas\n* 4:20pm - POTUS delivers remarks on restoring energy dominance in the Permian Basin and signs Presidential Permits\n* The Fed announced yesterday that it extended most of its emergency lending programs by three months, through the remainder of 2020\n* Senate Majority Leader Mitch McConnell said he would not bring up a coronavirus aid bill in the Senate which does not include liability protections\n   * Democratic leaders met again on Tuesday with top Trump administration negotiators\n   * Trump partially dismissed the GOP’s plan during a press conference on Tuesday, calling the package “sort of semi-irrelevant” as the bill involved no Democratic input\n\n**Events in the World Today (EDT):**\n\n* 1:30am - Japan BoJ Deputy Gov Amamiya Speaks \\[2/3 Volatility\\]\n* 4:00am - South Africa Core CPI (MoM-Jun) \\[2/3 Volatility\\]\n* 8:00am - Brazil Unemployment Rate \\[2/3 Volatility\\]\n* 6:45pm - New Zealand Building Consents (MoM-Jun) \\[2/3 Volatility\\]\n* 7:50pm - Japan Retail Sales (YoY-Jun) \\[2/3 Volatility\\]\n* 9:00pm - New Zealand ANZ Business Confidence (Jul) \\[2/3 Volatility\\]\n* Shares slid in Japan, where Fitch Ratings lowered its outlook on the country’s debt and earnings at Canon Inc. disappointed\n* Vietnam Prime Minister Nguyen Xuan Phuc said every province and city in the country was at high risk of coronavirus infections\n* Hong Kong faces large-scale outbreak that may lead to a ‘collapse’ of its hospital system, Carrie Lam says\n* Oil prices have stabilized after the American Petroleum Institute’s weekly estimate of U.S. crude inventories showed a much bigger draw than expected\n\n**Earnings Before Open:**\n\n* General Dynamics, Shopify, Boeing (7:30am), GE (6:20am), Spotify (6:00am), Aphria, Anthem, Wingstop, GM (7:30am), Six Flags, Blue Apron (6:15am), ADP\n\n**Earnings After Close:**\n\n* PayPal (4:15pm), Qualcomm (4:00pm), Teladoc, ServiceNow, Lam Research, Crown castle, Qorvo (4:00pm), O'Reilly Auto Parts, United Rentals, Vale\n\n[Earnings this Week](https://i.redd.it/6i19e9do82d51.jpg)",
        "created_utc": 1596020434,
        "id": "fzlytk3",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1596049234.0
    },
    {
        "author": "lookingatstocks",
        "body": "I’m so happy, my portfolio is going to double from 2.2k to at least 4k tomorrow. I put 700$ in QCOM calls I am having big dopamine in my head can’t wait for tomorrow",
        "created_utc": 1596056519,
        "id": "fznskwg",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1596085319.0
    },
    {
        "author": "__justsayin__",
        "body": "You don't want a tech stock paying a \"good dividend\" since most of them are losers - just look at the likes of IBM, CSCO, even QCOM.  You want a tech company which focuses on growth, and growth companies typically do not pay dividends.",
        "created_utc": 1594771155,
        "id": "fy3c463",
        "score": 12,
        "subreddit": "CanadianInvestor",
        "created": 1594799955.0
    },
    {
        "author": "aryalmuskan17",
        "body": "QCOM MOTHER FUCKERS. DIDNT EVEN REALIZE THEY HAD EARNINGS TODAY. MY STUPIDITY WORKED OUT",
        "created_utc": 1596053317,
        "id": "fznlww0",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1596082117.0
    },
    {
        "author": "midwestck",
        "body": "Intel has fossilized and is now on display at the Smithsonian. Qualcomm is a penny stock",
        "created_utc": 1594341282,
        "id": "fxhd03a",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1594370082.0
    },
    {
        "author": "BFGameReplays",
        "body": "Someone shoot me in the fucking face. I knew QCOM would explode and I was too much of a pussy to buy",
        "created_utc": 1596054134,
        "id": "fznnmhy",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1596082934.0
    },
    {
        "author": "karlaxel2",
        "body": "CNBC broadcast from end of December 1999.\n\nIt’s fucking insane. Notable excerpts include “Qualcomm is up over 10% today to $564, as analysts upgrade price target to $1,000.” \n\nDoes this bullshit sound familiar? Take a look.\n\nhttps://youtu.be/H5cmFPPDKbQ\n\nEdit: 19:10 is the interview with the “analyst” who upgraded Qualcomm PT to $1,000",
        "created_utc": 1594160259,
        "id": "fx93gnu",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1594189059.0
    },
    {
        "author": "pain474",
        "body": "Like AMD or QCOM?",
        "created_utc": 1596141918,
        "id": "fzs5qhp",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1596170718.0
    },
    {
        "author": "Tendiebendie",
        "body": "Next weeks ER 🔥 list:\n\n\nBA SBUX PFE SPOT AAPL V MA KHC GOOG GOOGL CAT MMM CL GM XOM ABBV APHA GM QCOM GE PG QCOM PYPL UAA FB AMZN",
        "created_utc": 1595498663,
        "id": "fyyseiu",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1595527463.0
    },
    {
        "author": "mango1144",
        "body": "Up $1k on the week but I'm sitting here fantasizing about KODK, SHOP, and QCOM calls I didn't pull the trigger on.\n\nGreed is a hell of a drug. \n\nREMEMBER TO BE GRATEFUL FOR WHAT YOU HAVE &amp; DON'T STOP LIVING YOUR LIFE. Don't widdle away all of your time stuck in the pipe dream.",
        "created_utc": 1596060212,
        "id": "fznzzg3",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1596089012.0
    },
    {
        "author": "Desmater",
        "body": "Few? Every tech company did good.\n\nMSFT, AAPL, AMD, INTC, QCOM, AMZM, FB, GOOGL.\n\nNetflix did great too. Just they already got their whole year growth in first half of the year.",
        "created_utc": 1596148742,
        "id": "fzsrzqc",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1596177542.0
    },
    {
        "author": "slowand-old",
        "body": "QCOM with the double take lol",
        "created_utc": 1596053268,
        "id": "fznlt6h",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1596082068.0
    },
    {
        "author": "csklmf",
        "body": "Just went to restroom and I realized I precummed a little. Well, I did not even watch porn during lunch break. Must be the QCOM position I am holding.",
        "created_utc": 1596064753,
        "id": "fzo8nur",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1596093553.0
    },
    {
        "author": "The_Weekend_DOW",
        "body": "So that’s where all of the Intel money went, right into QCOM",
        "created_utc": 1596054269,
        "id": "fznnwmg",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1596083069.0
    },
    {
        "author": "yaboiRich",
        "body": "Congratulations.... \n\nIt was either a choice for Qualcomm or PayPal for me prior to close and I chose PayPal. \n\nI should've bought into both.",
        "created_utc": 1596071690,
        "id": "fzole0x",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1596100490.0
    },
    {
        "author": "daaabears1",
        "body": "This is what I did: I started with YouTube to learn exactly what 5G is, how it works differently compared to 4G and how absolutely life changing 5G will be compared to 4G. We’re talking self driving cars, delivery drones, and doctors in New York performing surgery on soldiers in Afghanistan in a tent. \n\nFrom there you have the companies that make the actually radio transmission device like Nokia and Ericsson (both very reasonably priced). Those devices have to go somewhere so you put them on a tower owned by AMT and CCI (crown castle, not carnival cruise line). Those companies make money renting the towers to the service providers. Then you have the companies that make the chips that go into those devices, the chips that go into cell phones, drones and the internet of things (NVDA, INTC, MRVL, QCOM, etc.). Then there are the companies that make the devices we buy to connect us to 5G (Apple, amazon, google, Tesla). Finally there are the service providers like Verizon att and t mobile that connect our devices to the 5G network. \n\nI suggest starting at YouTube. There are videos that explain what each company does and their role in the 5G network.\n\nHowever, I wanted ALL of the companies with not a lot of money so I went after the 5G ETF (ticker: FIVG).",
        "created_utc": 1595302302,
        "id": "fyqbmrn",
        "score": 7,
        "subreddit": "stocks",
        "created": 1595331102.0
    },
    {
        "author": "Matrix1216",
        "body": "A buyer of 5500 Qualcomm sept 18 calls today just scored big. Holy smokes",
        "created_utc": 1596055286,
        "id": "fznq1ha",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1596084086.0
    },
    {
        "author": "brownbrandon",
        "body": "oh boy I went the wrong way on QCOM\n\n&amp;#x200B;\n\nEdit: maybe not",
        "created_utc": 1596053075,
        "id": "fznleqt",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1596081875.0
    },
    {
        "author": "NotSoIntelligentAnt",
        "body": "Played AMD and Qualcomm earnings perfectly. Only down $100 for the month now.",
        "created_utc": 1596055358,
        "id": "fznq6u9",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596084158.0
    },
    {
        "author": "aditenz716",
        "body": "It's the busiest week of second-quarter earnings season, with 171 S&amp;P 500 companies scheduled to report.  \n\n Monday 7/27\n\nF5 Networks , Hasbro , and SAP report quarterly results.\n\nThe Census Bureau releases the Durable Goods report for June. Expectations are for a 5.5% rise in new orders for durable manufactured goods, to $205 billion, after a 15.7% jump in May.\n\nThe Federal Reserve Bank of Dallas reports its Texas Manufacturing Outlook survey for July. Economists forecast a reading of just above zero, continuing the index's rebound from records lows in March and April.\n\nTuesday 7/28\n\n3M , Advanced Micro Devices , Altria Group , Amgen , eBay , McDonald's , MSCI , Mondelez International , Pfizer , Raytheon Technologies , S&amp;P Global , Starbucks , and Visa report earnings.\n\nThe Conference Board releases its Consumer Confidence Index for June. Consensus estimate is for a 95.5 reading, slightly below May's 98.1.\n\nWednesday 7/29\n\nThe Federal Open Market Committee announces its monetary policy decision. The central bank is expected to keep interest rates near zero through 2022.\n\nBoeing , Crown Castle International , Facebook , General Electric , Norfolk Southern , PayPal Holdings , Qualcomm , Sanofi , and Shopify report quarterly results.\n\nThe National Association of Realtors releases its Pending Home Sales Index for June. The index is seen rising 5.4% to a 105 reading, after a record spike of 44.3% in May.\n\nThursday 7/30\n\nAlphabet , Amazon.com , American Tower , Apple , Comcast , ConocoPhillips , Electronic Arts , Eli Lilly , Ford Motor , Gilead Sciences , Moody's , Newmont , Northrop Grumman , Procter &amp; Gamble , and United Parcel Service hold conference calls to discuss earnings.\n\nThe Bureau of Economic Analysis reports gross domestic product for the second quarter. Consensus estimate is for a decline of 34%, after a 5% fall in the first quarter. The largest quarterly drop recorded was 10% for the first three months of 1958. The BEA's release will probably confirm the end of the longest economic expansion in U.S. history, which began in June of 2009.\n\nFriday 7/31\n\nAbbVie , Caterpillar , Charter Communications , Chevron , Colgate-Palmolive , Exxon Mobil , Merck , Phillips 66 , and Under Armour report earnings.\n\nThe Institute for Supply Management releases its Chicago Purchasing Manager Index for July. Economists forecast a 42 reading, above June's 36.6 but still below the expansionary level of 50, which the index hasn't surpassed since last summer.\n\nThe BEA reports personal income and spending for June. Expectations for a 3% decline in income and a 6% jump in spending. This compares with a 4.2% drop and a 8.2% gain, respectively, in May.\n\n&amp;#x200B;\n\n\\-Barrons",
        "created_utc": 1595848531,
        "id": "fze6arg",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595877331.0
    },
    {
        "author": "ar1195",
        "body": "Holy fuck does anyone have qcom calls? I’m just gonna buy FDs on every tech stock prior to earnings just in case one or two of them turn into this/amd",
        "created_utc": 1596053710,
        "id": "fznmqic",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596082510.0
    },
    {
        "author": "SpiderBiteHurts",
        "body": "Any contract killers in here? Your targets are the TSLA and QCOM tickers. Your reward? You can come to my birthday party at the arcade.",
        "created_utc": 1595900387,
        "id": "fzgw07o",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595929187.0
    },
    {
        "author": "vasgarov",
        "body": "My personal Opinion : Dead cat's bounce is possible if the market goes green. Long term Intel is done their architecture has peaked. ARM based is the play now ( NVIDIA, AMD, Qualcomm, TSMC)   tho it is a bit late now as well for that.",
        "created_utc": 1595602532,
        "id": "fz3gloh",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595631332.0
    },
    {
        "author": "NorseLegend",
        "body": "Finally dumped the QCOM leaps I've been bag holding since Feb for $17,988.20 (128% gain.)  Brought my account total back over the PDT limit ($32,000.)  Today was a good day.",
        "created_utc": 1596142808,
        "id": "fzs9wi4",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596171608.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "You know in school when all the kids (AMD, QCOM, XLNX, etc) are playing joyfully on the playground and there is that one poor kid with a \"Dunce\" hat crying in the corner?  \n  \nThat kid is Intel.",
        "created_utc": 1596055239,
        "id": "fznpy17",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596084039.0
    },
    {
        "author": "tutle_nuts",
        "body": "Maybe in the ever shrinking market of desktops. Phones is largely Qualcomm (in apples case theyve moved to making their own). In terms of embedded (cars, electronics, etc.) Its mainly arm micros running some dist. of linux. Intel imo is still best in breed for legacy chips, as will as industry bc look at their acquisitions &amp; assets.",
        "created_utc": 1595699235,
        "id": "fz7r1vh",
        "score": 5,
        "subreddit": "stocks",
        "created": 1595728035.0
    },
    {
        "author": "aryalmuskan17",
        "body": "I’m an idiot. Didn’t realize Qualcomm had earnings today. Hope they fly",
        "created_utc": 1596053212,
        "id": "fznlov0",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596082012.0
    },
    {
        "author": "SpiderBiteHurts",
        "body": "You know what? Tomorrow. Tomorrow's the day I tell the girl I love my feelings. That girl's name? QCOM 8/21 90p.",
        "created_utc": 1595898910,
        "id": "fzgtg92",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595927710.0
    },
    {
        "author": "ixamnis",
        "body": "**RICK** \\- Not fond of this one. In the current environment, I see no upside.  \n\nRecognia has detected a \"Head and Shoulders Top\" chart pattern formed on RCI Hospitality Holdings Inc (RICK on NASDAQ). This bearish signal indicates that the price may fall from the close of 12.63 to the range of 7.25 - 8.25. The pattern formed over 24 days which is roughly the period of time in which the target price range may be achieved.\n\nRCI Hospitality Holdings Inc has a current support price of 11.03 and a resistance level of 15.32.\n\nA Head and Shoulders Top is considered a bearish signal. It indicates a possible reversal of the current uptrend to a new downtrend. A perfect example of the pattern has three sharp high points, the middle one being the highest, created by three successive rallies in the price of the financial instrument. The technical event occurs when the resistance marked by the neckline is \"broken\", thereby confirming the pattern.\n\n**NCLH** \\- It could be some time before you see returns on this one. Of all the cruise lines this one is probably in the best shape, financially. Long term hold, but be cautious.\n\n**MGM** \\- Another high risk stock. Again, this will likely come back in the long term, but I think you could do better with a solid tech stock or ETF in its place.\n\n**DKNG** \\- Probably overpriced, currently, but a decent long term pick.\n\n**QCOM** \\- solid company, great potential for both short term and long term. Buy lots of this one. Price target is $103; buy for under $90 if possible.\n\n**TMUS** \\- May struggle a bit in the next few weeks, but this is a solid pick. Might be a bit overpriced at the moment, but I think it will climb to $120 by the end of the year. Great long-term stock.\n\n**ETSY** \\- I think this is a decent pick, but it may be overbought at the moment. See if it dips, and buy the dip.\n\n**SQ** \\- I really like this company and this stock; but, again, I'm concerned that it may be overpriced. I'd watch for a dip, and buy then.\n\n**BA** \\- This one could be a good mid-term swing play. The MAX will be re-certified, and when that happens, I think the stock will pop. That said, the market for new jets may take years to reach the levels it was at a year ago. Buy, watch for the pop up, then sell.\n\n(Just my opinion. I own shares of NCLH, MGM and TMUS)",
        "created_utc": 1593657542,
        "id": "fwnl460",
        "score": 5,
        "subreddit": "stocks",
        "created": 1593686342.0
    },
    {
        "author": "t33po",
        "body": "QCOM the latest front in the Boomer's Revenge! Watch out for GE this weekend.",
        "created_utc": 1596054588,
        "id": "fznokxu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596083388.0
    },
    {
        "author": "Ze_Hydra1",
        "body": "QCOM is being pressured to buy 5G. $NOK definitely the only option. Long term extremely bullish for NOK. Those $5C's long dated look like free money.",
        "created_utc": 1594256454,
        "id": "fxdidue",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594285254.0
    },
    {
        "author": "Draiko",
        "body": "China is like RIGHT there and Taiwan is on their shopping list. If anything threatens Taiwan, TSMC is going to turn into a very very bumpy ride.\n\nAlso, we're about to go through a big smartphone slowdown which means both Apple and Qualcomm are going to cut their orders with TSMC.\n\nApple already cut their screen orders and paid $1 B to Samsung to do it.",
        "created_utc": 1595564546,
        "id": "fz23oyp",
        "score": 5,
        "subreddit": "investing",
        "created": 1595593346.0
    },
    {
        "author": "pcguywilson",
        "body": "Decent week. AAPL, FSLY, PRPL, ETSY, SLV, NVDA, QCOM and AMD\nhttps://imgur.com/k9N1zt5",
        "created_utc": 1596226221,
        "id": "fzwnzwp",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596255021.0
    },
    {
        "author": "pain474",
        "body": "KODK was something completely different, just the vaccine pump. Just check the last tech stocks. QCOM mooned, AMD mooned. Yes, MSFT dropped. But it didn't get pumped in AM at least. It got dumped straight ahead. Yes there might be a small fast but overall they'll go up with uncertainty gone.",
        "created_utc": 1596142353,
        "id": "fzs7qu2",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596171153.0
    },
    {
        "author": "lloydgross24",
        "body": "QCOM... So much freaking insider trading. All sorts of 105 call buying last week. TONS\n\nShould have known.\n\nI mean I didn't buy calls or puts. But that pisses me off seeing such blatant insider info.",
        "created_utc": 1596053571,
        "id": "fznmfxp",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596082371.0
    },
    {
        "author": "Jarreddit15",
        "body": "Lol someone sold QCOM at $88.80\n\nCurrently at $101 and rising",
        "created_utc": 1596053465,
        "id": "fznm7zs",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596082265.0
    },
    {
        "author": "iredditacc",
        "body": "Possible red flag indicated in the Qualcomm earnings report is that an unnamed customer is delaying their 5g phones. Given the big partnership between AAPL and QCOM, it could be them.\n\nSource:\n\n&gt;\tBut the company said it expected 5G handset shipments would be 15% lower year-over-year in the quarter ending in September, due to a customer delaying a “global 5G handset launch.”\n\nhttps://www.cnbc.com/2020/07/29/qualcomm-qcom-earnings-q3-2020.html",
        "created_utc": 1596060106,
        "id": "fznzrvr",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596088906.0
    },
    {
        "author": "121518nine",
        "body": "Had this nagging in my head to buy Qualcomm all week. Wtf",
        "created_utc": 1596061200,
        "id": "fzo1xd6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596090000.0
    },
    {
        "author": "harryburton420",
        "body": "qcom call holders rich tomorrow?",
        "created_utc": 1596060791,
        "id": "fzo14d8",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596089591.0
    },
    {
        "author": "Twoverybigwords00",
        "body": "I sold qcom before close and am bag holding amd puts from last week ama",
        "created_utc": 1596073172,
        "id": "fzoo2tb",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596101972.0
    },
    {
        "author": "ThePeoplesBard",
        "body": "Damn, why weren’t any of you shilling QCOM today?",
        "created_utc": 1596054541,
        "id": "fznohgq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596083341.0
    },
    {
        "author": "ceskanda",
        "body": "Bought at close: \npypl 7/31 185C 8/7 197.5C 8/14 200C\nqcom 7/31 90C \nlrcx 7/31 370C\nAzn 7/31 55C  -No idea why I bought this I guess I was hoping for some vaccine hype in their report tmrw. \n\nTmrw will consider chgg 8/7 80C",
        "created_utc": 1596059008,
        "id": "fznxkyr",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596087808.0
    },
    {
        "author": "n0zorz",
        "body": "wait what is happening to QCOM... I thought my calls were dead and then... what? Links for PDF?",
        "created_utc": 1596053290,
        "id": "fznluv4",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596082090.0
    },
    {
        "author": "n0zorz",
        "body": "Thank you QCOM but honestly I should've given you even more RESPECC",
        "created_utc": 1596053643,
        "id": "fznmli6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596082443.0
    },
    {
        "author": "1terrortoast",
        "body": "Lol Qualcomm with the bear bait in the beginning and suddenly moon mission",
        "created_utc": 1596053623,
        "id": "fznmk1l",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596082423.0
    },
    {
        "author": "ReverseSalmonLadder",
        "body": "Qcom bois wya?",
        "created_utc": 1596054638,
        "id": "fznooqn",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596083438.0
    },
    {
        "author": "MiyokoWilken",
        "body": "Trimed up my portfolio today and made some nice new positions I’m happy with. \n\nQCOM, AVTI, LULU, BJs, TSM, VALE, VZ. Calls bc I’m not a faggot. LOVE THE Qcom upgrade",
        "created_utc": 1595868137,
        "id": "fzf3tnt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595896937.0
    },
    {
        "author": "time_to_nuke_china",
        "body": "There are safety considerations with electromagnetic (EM) radiation.  Visible light, radiowaves, x-rays, etc are some of the bands on the complete spectrum of frequencies.  \n   \n[There are ionising and non-ionising bands as per this chart.](https://ichef.bbci.co.uk/news/375/cpsprodpb/2682/production/_107885890_5ggraphic-nc.png)  \n  \nFor ionising radiation like x-rays we have to limit exposure because it is harming our cells' dna. For non-ionising radiation we have to limit exposure because body tissue heats up when it absorbs them.  \n  \nConsider sunlight, which is a broad band of EM. We can feel infrared heating us up but we can't feel the UV burning us.  \n  \nWell, [5G is going to use frequencies up to about 100GHz](https://photos5.appleinsider.com/gallery/30805-50906-An-illustration-of-the-areas-of-spectrum-5G-could-operate-within-via-Qualcomm-xl.jpg) which is much lower frequency band than sunlight and is not ionising radiation.  \n  \n5G is actually using microwaves so you know it can cook your flesh, except the power output of your phone's radio is kept well under the safe limits. The phone towers are a higher power output but the inverse square law means the receive level is quite low by the time it gets to you, and because of the number of mobile users, 5G towers and 4G towers are very close together transmitting on low power because that gives a cleaner signal and more data throughput.  \n  \nFinally I will quote the safe limit of 100GHz microwave output. [This NIH page mentions 10 Watts per square meter and 0.08 Watts per Kg.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6765906/) A 5G phone will never get anywhere near that and the tower signal will be received by the antenna at about 0.0000001 Watts  and I would guess that your body would absorb about 1 milliWatt max from the tower. \n  \nSo because we have blood and sweat cooling us down, the tiny bit of heat is no issue. We're talking milliwatts total, compared to   sunlight which is about 1000W of radiation per square meter and some of that is ionising, unlike 5G. And even sunlight isn't too bad in moderation but 5G is fine as a low level background signal. Actually if you look on a spectrum analyser... there is a noise floor at 100GHz with signals here and there anyway.  \n  \nI hope that puts it into perspective... 5G is basically low power warm radiation and doesn't modify DNA (doesn't cause cancer). And it can't cook you because the power output is low, like TV and FM signals. It is like TV and radio signals but a higher band and with a much more efficient modulation scheme for data throughput.  \n  \nThanks for listening to my TED Talk.",
        "created_utc": 1595412844,
        "id": "fyuxaq9",
        "score": 4,
        "subreddit": "stocks",
        "created": 1595441644.0
    },
    {
        "author": "uaoleksiy",
        "body": "4 trades today.. all winners.. up 50% on QCOM and UPS, 20% on FDX and 15% on PYPL.. portfolio up 24.46% for the day.. think im done for today.. see you bois tomorrow.. try not to lose it all by close",
        "created_utc": 1596122046,
        "id": "fzqi9r0",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596150846.0
    },
    {
        "author": "choose_a_use",
        "body": "QCOM fucking non stop",
        "created_utc": 1596054264,
        "id": "fznnw9m",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596083064.0
    },
    {
        "author": "Twoverybigwords00",
        "body": "Thank God I got out of QCOM with seconds left 😤",
        "created_utc": 1596053039,
        "id": "fznlc3w",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596081839.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "QCOM and SQ my top 2 choices (although I would go with PayPal instead of SQ).",
        "created_utc": 1593656507,
        "id": "fwnjepr",
        "score": 3,
        "subreddit": "stocks",
        "created": 1593685307.0
    },
    {
        "author": "acm444",
        "body": "7/31 $ATVI Calls! \n7/31 $QCOM Calls! \nLong term $UUP Puts! \nUber, $KMX &amp; $PK Shares those are long termers too. Bought all that today.",
        "created_utc": 1594088476,
        "id": "fx5yecx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594117276.0
    },
    {
        "author": "Baykah21",
        "body": "BYND, FB, MSFT, QCOM, SQ",
        "created_utc": 1595592907,
        "id": "fz309rn",
        "score": 3,
        "subreddit": "stocks",
        "created": 1595621707.0
    },
    {
        "author": "Xbsnguy",
        "body": "Looks like your portfolio is geared towards a 5G play. Unfortunately telecom giants like AT&amp;T and others like Nokia don't have volatile enough price action to really justify options, nevermind tying down large amounts of capital in leaps. If you want to play 5G, your best bet IMO is Qualcomm, but they've already benefited from the 5G pump.\n\nWith respect to your ALLY puts, this is misstimed. Ally is on the uptrend. If you want to short then wait for it to reverse, but be ready to close out when the market decides it's time to reverse yet again. Maybe they'll actually announce bankruptcy by winter/late fall, and your puts will print bigly, but I'm personally not a fan of taking contrarian positions to what the market wants to do.\n\nYou can either (1) close your positions and open new ones in stocks that will actually move or (2) leg into spreads to credit yourself some of the losses back and hold until expiry.\n\nPersonally, it's going to suck, but I think you should close.",
        "created_utc": 1595623034,
        "id": "fz4nnks",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595651834.0
    },
    {
        "author": "jukito1",
        "body": "Holy fuck qcom",
        "created_utc": 1596056776,
        "id": "fznt3gi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596085576.0
    },
    {
        "author": "MBlaizze",
        "body": "I have a small position that I picked up at around $76, and boy do I wish I bought more. Qualcomm seems very well positioned for the 5G rollout, a dividend at 2.79%, and they have a solid balance sheet. Great long term hold imo.",
        "created_utc": 1596062969,
        "id": "fzo5c6n",
        "score": 3,
        "subreddit": "investing",
        "created": 1596091769.0
    },
    {
        "author": "kylejohn1234",
        "body": "Look at QCOM and you tell me",
        "created_utc": 1596160429,
        "id": "fztgo0q",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596189229.0
    },
    {
        "author": "athletic_trauma",
        "body": "Holy shit that is a massive shrek dick on QCOM",
        "created_utc": 1596053330,
        "id": "fznlxta",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596082130.0
    },
    {
        "author": "PaperShark0001",
        "body": "Qcom said bye im going down, then SIIIKE",
        "created_utc": 1596053436,
        "id": "fznm5qv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596082236.0
    },
    {
        "author": "BadDadBot",
        "body": "Hi an idiot. didn’t realize qualcomm had earnings today. hope they fly, I'm dad.",
        "created_utc": 1596053227,
        "id": "fznlpzm",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596082027.0
    },
    {
        "author": "ASUbuckDevil",
        "body": "Congrats on QCOM haha.",
        "created_utc": 1596055567,
        "id": "fznqmmm",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596084367.0
    },
    {
        "author": "121518nine",
        "body": "Qualcomm looks ripe for a boost",
        "created_utc": 1595999813,
        "id": "fzld2lx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596028613.0
    },
    {
        "author": "nostylist2900",
        "body": "QCOM calls finna print tomorrow",
        "created_utc": 1595886699,
        "id": "fzg6r4z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595915499.0
    },
    {
        "author": "SpiderBiteHurts",
        "body": "Almost time for puts on QCOM. They do be lookin tasty.",
        "created_utc": 1595887063,
        "id": "fzg7hjb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595915863.0
    },
    {
        "author": "FinndBors",
        "body": "10x would take NET at around qualcomm levels.\n\nI think it's unlikely, but it isn't impossible. I couldn't find good larger software plays that might be a better business comparison. Maybe VMW, they have a 60 billion market cap. Which is still a 6x from where it is today. I think a 5x is a good target to sell a portion of winnings at (basically at around 150 share price). I think it is possible if they continue to eat market share and then turn on the earnings spigot. There are obviously risks that they can't -- I'm actually somewhat concerned that they have so much market share already but aren't profitable.",
        "created_utc": 1593646476,
        "id": "fwn1wsw",
        "score": 3,
        "subreddit": "stocks",
        "created": 1593675276.0
    },
    {
        "author": "choose_a_use",
        "body": "QCOM release of 5G chips delayed due to Samsung 5nm struggles.\nI mean it doesn’t get clear than this. Fucking TSM to the moon",
        "created_utc": 1595536617,
        "id": "fz0omzf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595565417.0
    },
    {
        "author": "NorseLegend",
        "body": "Anyone playing QCOM going into ER next week?  Been holding quite a few leaps, starting to worry it's gonna shit the bed.  1/15/21 exp all: 2 90 C's, 5 97.5 C's, 5 100 C's, and 13 110 C's.  Pretty much break even on all of them right now, bought them in the high 80s.  Trying to decide if I should bail before the ER or not.",
        "created_utc": 1595342400,
        "id": "fyrp9of",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595371200.0
    },
    {
        "author": "bosshaug",
        "body": "Sooo qcom puts for earnings right",
        "created_utc": 1595871552,
        "id": "fzfayue",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595900352.0
    },
    {
        "author": "rfgrunt",
        "body": "Uh, Qualcomm blocked/fought the Broadcom merger. Qualcomm blocked from buying NXP is more applicable.",
        "created_utc": 1596220980,
        "id": "fzwbxyj",
        "score": 3,
        "subreddit": "investing",
        "created": 1596249780.0
    },
    {
        "author": "aryalmuskan17",
        "body": "WOW. Totally forgot about bud. Got so focused and hype on QCOM. Forgot about my 4 bud 58c 8/14",
        "created_utc": 1596069629,
        "id": "fzoho7i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596098429.0
    },
    {
        "author": "SpiderBiteHurts",
        "body": "Woooo love holding out on that QCOM snap. Please fuckin hold til morning.",
        "created_utc": 1596053077,
        "id": "fznlewr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596081877.0
    },
    {
        "author": "nsrbigshot",
        "body": "QCOM TO DA MOON",
        "created_utc": 1596054240,
        "id": "fznnuev",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596083040.0
    },
    {
        "author": "Wall_Street_Jesus",
        "body": "QCOM and PYPL 😍",
        "created_utc": 1596054269,
        "id": "fznnwo2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596083069.0
    },
    {
        "author": "fairytailzz",
        "body": "Interestingly enough that QCOM and AMD did something similar(gives good sales forecast), and price started soaring. Too bad I sold QCOM recently when it was $90 :(",
        "created_utc": 1596054998,
        "id": "fznpfy1",
        "score": 3,
        "subreddit": "investing",
        "created": 1596083798.0
    },
    {
        "author": "thegoldstandard55",
        "body": "QCOM has been a serial disappointer when it comes to earnings over the years.  That being said with all the money rolling in from Apple they could moon up.",
        "created_utc": 1595901668,
        "id": "fzgy8m9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595930468.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Shopify PayPal CrowdStrike NVIDIA Apple QCOM Adobe",
        "created_utc": 1593731653,
        "id": "fwr14x9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1593760453.0
    },
    {
        "author": "heartstesler",
        "body": "It’s not stock\n\nIt’s the chip sale and Apple iPhone \n\nWhen US can ban Huawei  China can ban Apple Qualcomm intel and all other lam research Texas Instruments micron technology Nvidia and many more",
        "created_utc": 1594823298,
        "id": "fy5arow",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594852098.0
    },
    {
        "author": "TwoBigPotatoes",
        "body": "What about Intel and Qualcomm?",
        "created_utc": 1594341165,
        "id": "fxhcsyp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594369965.0
    },
    {
        "author": "ghostbearinforest",
        "body": "Tech has been dipping after earnings.  So I'm playing the trend.  And amd is known to be volatile.  Plus anyone that owns amd already knows they are gonna crush earnings so it's expected and why I'm playing the run up to ER and dumping before.  It's safer.  And I have no idea how the market will react.  Tesla beat earnings shot up then tanked.  Msft beat earnings then tanked.  Qualcomm beat earnings then dipped lol.  So who knows.",
        "created_utc": 1595541826,
        "id": "fz0z560",
        "score": 3,
        "subreddit": "stocks",
        "created": 1595570626.0
    },
    {
        "author": "cablanedo",
        "body": "Qualcomm is a good pickup, they will dominate when 5G rolls out",
        "created_utc": 1595591706,
        "id": "fz2ypmj",
        "score": 3,
        "subreddit": "stocks",
        "created": 1595620506.0
    },
    {
        "author": "Deezkicks",
        "body": "What do ppl think of Qualcomm er?",
        "created_utc": 1595901370,
        "id": "fzgxpsk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595930170.0
    },
    {
        "author": "aryalmuskan17",
        "body": "OMG QUALCOMM",
        "created_utc": 1596053364,
        "id": "fznm0dq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596082164.0
    },
    {
        "author": "aryalmuskan17",
        "body": "Paying my speeding ticket I just got with my Qcom winnings",
        "created_utc": 1596053397,
        "id": "fznm2t4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596082197.0
    },
    {
        "author": "GasolineTruth",
        "body": "Have qcom calls and bought shares at 89 on the dip. Is the spike real or what? If it opens at like 102 it's not yacht money but it's small ocean boat money lol.",
        "created_utc": 1596053600,
        "id": "fznmi6r",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596082400.0
    },
    {
        "author": "The-Hyrax",
        "body": "Holy shit QCOM AH",
        "created_utc": 1596053763,
        "id": "fznmujj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596082563.0
    },
    {
        "author": "aswinneel",
        "body": "What’s the underrated tech earnings this week .. something like Qualcomm\n\nNeed to bag those",
        "created_utc": 1596054889,
        "id": "fznp7m0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596083689.0
    },
    {
        "author": "DCS431516526",
        "body": "Wtf QCOM",
        "created_utc": 1596053166,
        "id": "fznllh7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596081966.0
    },
    {
        "author": "RIZup18769",
        "body": "I had BUY QCOM @94C 8/21 written down on my desk for a week and didn’t pull the trigger. That combined with missing out on KODK regrets makes today a double dick punch.",
        "created_utc": 1596065462,
        "id": "fzo9zmv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596094262.0
    },
    {
        "author": "ElectronF",
        "body": "Nvidia has peaked.  They got no where to go.  The only company they could get to use nvidia chips for anything, but their own products was nintendo, and they had to sell them at cost to nintendo to make it happen.  All nvidia has is rasing prices on consumer graphics cards and that will run out of steam eventually.\n\nComma.ai developed a self driving camera system with nvidia chips back in 2017-2018, but then the nvidia exec product developer got fired and replaced.  The new one refused to sell chips at a fair market rate and demanded they buy entire mini-pc boards at 5 times the price, not just the chips.  Comma wasted $100k in r&amp;d developing a product they no longer had chips for. Now george hotz praises qualcomm, not for being cheap(gotta buy in larger batches), but for being consistent and reliable as a chip source so they can actually design a product around a chip and not get screwed.\n\ntl;dr nvidia is too expensive for anyone to use their chips, not because the chips are expensive to make, but because they have crappy pricing and don't guarantee supply unless you are a huge company.",
        "created_utc": 1594078156,
        "id": "fx5gpxy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594106956.0
    },
    {
        "author": "SwordfshII",
        "body": "Two choices\n\n1. Buy back at a loss\n2. Let it exercise. Sell puts on the stock. Collect premium and eventually buy back in.\n\nI made it well on QCOM. It usually runs in the $87-$91 range. Bought in at 87, sold $91 calls just recently exercised, now selling $87 puts.",
        "created_utc": 1594780903,
        "id": "fy3sovq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594809703.0
    },
    {
        "author": "nduxx",
        "body": "1. INTC is getting its ass eaten on their own instruction set by AMD. Shit they wouldn't even have x86_64 if it weren't for AMD way back when.\n\n2. INTC completely missed the mobile ship, conceded all gains to ARMH, AAPL, TSMC, NVDA, QCOM and whoever else.\n\n3. INTC completely missed the GPU ship, conceded all gains to NVDA.\n\nThere's no bull case for this company. They're basically legacy crap the way IBM is, and yesterday they made it official.",
        "created_utc": 1595605929,
        "id": "fz3ngko",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595634729.0
    },
    {
        "author": "M3L0NM4N",
        "body": "Qualcomm might be a better bet for 5G/mobile",
        "created_utc": 1595665396,
        "id": "fz6h0o0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595694196.0
    },
    {
        "author": "alejandro232",
        "body": "MSFT-34%\nAAPL-25%\nFB-15%\nKO-9%\nWFC-8%\nNET-6%\nQCOM-3%",
        "created_utc": 1595702047,
        "id": "fz7wems",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595730847.0
    },
    {
        "author": "stunner47",
        "body": "What are the chances that QCOM beats earnings estimate ?",
        "created_utc": 1595857333,
        "id": "fzeijjq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595886133.0
    },
    {
        "author": "finvesturself",
        "body": "IMO, they will announce a target soon. \n\nHere's why :\n\nMr. Paulson is Vice President of Product Management at Qualcomm (A powerhouse of a company, and a great 5G play in itself). This alone tells me they probably have had a target before inception. Why? He has a full time dedicated career with a full plate. A man in that position is highly unlikely to undertake such a large endeavor on the possibility of acquiring a deal. Given his position and connections,  It is far more likely that he stumbled across an amazing opportunity or was approached by one. After consultation and/or careful deliberation, starting a SPAC was the fastest way to raise money and get this target to market. Given his background and ties I would also conclude that the target company will be in INDIA, which by the way has been making leaps and bounds in network expansion. IMO, they are hammering out the terms with the target now.  5G has already begun its rollout. So, it is in their best interest to announce sooner rather than later.",
        "created_utc": 1595867536,
        "id": "fzf2knk",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1595896336.0
    },
    {
        "author": "nostylist2900",
        "body": "QCOM $95 8/7 if u like money",
        "created_utc": 1595872667,
        "id": "fzfdciz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595901467.0
    },
    {
        "author": "HTleo",
        "body": "My QCOM calls printed big time. Up 500%. Kaching!!!!",
        "created_utc": 1596118378,
        "id": "fzqb0kp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596147178.0
    }
]