[
    {
        "author": "radioref",
        "body": "Some fucking CORN trader wearing coveralls and sitting in a bum ass 1970's brown trimmed office in Iowa or Nebraska for a corn processing plant is working on an IBM 3270 terminal, punching the same damn numbers every day, and is now wondering what in the holy hellfire fuck is going on.",
        "created_utc": 1597249646,
        "id": "g187ztk",
        "permalink": "/r/wallstreetbets/comments/i8b56i/daily_discussion_thread_for_august_12_2020/g187ztk/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1597278446.0
    },
    {
        "author": "pforsbergfan9",
        "body": "It would be like if Kroger and IBM bought onlyfans",
        "created_utc": 1598548360,
        "id": "g31hq2z",
        "permalink": "/r/stocks/comments/ihn3q6/walmart_is_teaming_up_with_microsoft_on_tiktok_bid/g31hq2z/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1598577160.0
    },
    {
        "author": "Vast_Cricket",
        "body": "I remember a shareholder of IBM, a widow attended at IBM annual meeting. She cried at the meeting that her only savings was left by her husband who worked at IBM from pre-type writer days. The stock tanked to $40 (about $***10*** today when factored into splits). They stopped paying dividend that year. It was the dividend she lived on. She had no social security as women did not work.  Fast forward, if all your savings are in 1 basket. You could repeat her mistake.  \n\nA lawyer's secretary was asked to buy stocks for her boss. She knew nothing about stocks but bought smaller positions of everything he owned. She willed the stocks to her sister. When she died her sister found out she had a $7.5M networth.",
        "created_utc": 1597519976,
        "id": "g1n225p",
        "permalink": "/r/stocks/comments/iadhkf/how_risky_is_it_to_hold_425_shares_of_apple_aapl/g1n225p/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1597548776.0
    },
    {
        "author": "iseebrucewillis",
        "body": "r/investing: China stonks are fake, brb while I max out my 401k on IBM for the dividends.\n\nr/wsb: all in BABA 300c 8/7, Gynese stonks only go up",
        "created_utc": 1596646532,
        "id": "g0gofez",
        "permalink": "/r/wallstreetbets/comments/i48x8j/baba_is_undervalued_its_going_to_the_moon/g0gofez/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1596675332.0
    },
    {
        "author": "infinitelimits00",
        "body": "AMD will easily outperform Intel. Intel is like IBM from 10 years ago. No growth, terrible leaders, etc. The day they fire Bob Swan is the day Intel will go up 10%.",
        "created_utc": 1597362520,
        "id": "g1dwx4m",
        "permalink": "/r/stocks/comments/i9avyi/amd_ceo_sold_159_millions_worth_of_amd_stock/g1dwx4m/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1597391320.0
    },
    {
        "author": "wanmoar",
        "body": "&gt; She’s wondering if she could retroactively get all these passed dividends back.\n\nOn what basis does she think the IBM person she spoke has it wrong to say that ESPP shares were not eligible for stock splits?\n\nIf he is right, then she's not owed any amount of unpaid dividends.",
        "created_utc": 1597606592,
        "id": "g1rj10c",
        "permalink": "/r/investing/comments/iapy5c/ibm_stock_certificates_from_1970s/g1rj10c/",
        "score": 10,
        "subreddit": "investing",
        "created": 1597635392.0
    },
    {
        "author": "infinitelimits00",
        "body": "Man boomers getting screwed. \n\nRTX, XOM, PFE. Not to mention already with INTC, CSCO, and IBM going down/lagging rest of market with earnings. BA sucking all year. \n\nAll they have is Disney now unless they count Microsoft.",
        "created_utc": 1598315412,
        "id": "g2r0xo3",
        "permalink": "/r/wallstreetbets/comments/ifwowm/what_are_your_moves_tomorrow_august_25_2020/g2r0xo3/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1598344212.0
    },
    {
        "author": "Recoil42",
        "body": "It's not just their CRM. SFCC is godawful too. We do migrations and SFCC customers are dying to get off of it. Salesforce is the modern \"nobody's ever been fired buying ibm\", but the product is awful.",
        "created_utc": 1598482976,
        "id": "g2yp87g",
        "permalink": "/r/investing/comments/ih4jxb/after_crushing_earnings_salesforce_announces/g2yp87g/",
        "score": 8,
        "subreddit": "investing",
        "created": 1598511776.0
    },
    {
        "author": "moazzam0",
        "body": "I'm up exactly $420 on IBM today lol",
        "created_utc": 1598646800,
        "id": "g368fs3",
        "permalink": "/r/wallstreetbets/comments/iieg0t/weekend_discussion_thread_for_the_weekend_of/g368fs3/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1598675600.0
    },
    {
        "author": "YaBoyPsycho",
        "body": "IBM is not at all comparable to AAPL",
        "created_utc": 1596741132,
        "id": "g0lfn1o",
        "permalink": "/r/StockMarket/comments/i4vxi6/aapl_miss_the_boat_or_is_it_not_too_late/g0lfn1o/",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1596769932.0
    },
    {
        "author": "Tyler2191",
        "body": "I do have a small position in SPYD but I’ll say that I don’t really find dividends worth it for me. I’m buying individual stocks and the dividend yield is an added bonus. Been picking up shares in IBM and as many MSFT shares as I can get my hands on because I believe their shares are underpriced. But, don’t go by my suggestions, for the most part I’m just an idiot retail investor.",
        "created_utc": 1597704801,
        "id": "g1x7zjh",
        "permalink": "/r/RobinHood/comments/ibnlxh/dividend_yielding_stocksetfs/g1x7zjh/",
        "score": 7,
        "subreddit": "RobinHood",
        "created": 1597733601.0
    },
    {
        "author": "SunriseSurprise",
        "body": "The dotcom boom was full of NKLA's - companies that became big on ideas where they hadn't even really launched yet. It was a \"build it and they will come\" time on the internet, so people were trying to get in even before the \"build it\" part, and then a string of failures led to people realizing wait, that's stupid and they fled back out.\n\nYes, there's a NKLA now, and it shouldn't be worth more than a couple dollars per share, and companies like TSLA and ZM are way over the value they should be, but the rock solid companies at the heart of the index booms are the AMZNs, MSFTs, FBs and so on that are making a fucking ton of revenue and continually growing. They're not remotely close to the dotcom era because at the time of the dotcom era, the only tech company that was in their shoes was ironically MSFT. Maybe some others like IBM too, not sure, but now, tech is literally far and away the dominant industry and that's not going to change anytime soon. The shift was already happening but covid accelerated it.",
        "created_utc": 1598496146,
        "id": "g2zdjin",
        "permalink": "/r/wallstreetbets/comments/iha9ph/this_is_not_a_bubble/g2zdjin/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1598524946.0
    },
    {
        "author": "cookingboy",
        "body": "Calm the fuck down dude. What's \"you people\"? I work in Silicon Valley and more than half of my networth is in tech stocks and I've been a long term investor of TSLA since the stock was at $70.\n\nYes software is eating the future blah blah and yes we'll all live in United States of Amazon at one point but it doesn't mean you can't have extremely overvalued individual stocks.\n\nJust because I believe in the future of EVs doesn't mean Tesla's valuation at *today* is justified, and even less so for companies like Nikola. Just because I believe in the future of tele-commuting doesn't mean Zoom isn't grossly overvalued.\n\nJust like it would be silly to dump your entire networth into IBM stocks just because you believe Personal Computers are going to take off. Or bet everything on Atari because you believe video games are the future. How's that YOLO bet on AOL, internet is the future right? \n\nVery often first movers don't stay dominant as a market matures and undergoes explosive growth.\n\n&gt;The CEO underpromises and over-delivers.\n\n**/Chokes on water** So which parallel universe are you from? Is Covid just as bad there?",
        "created_utc": 1597961233,
        "id": "g29h9yl",
        "permalink": "/r/investing/comments/idhr6y/tesla_closes_above_2000_for_the_first_time_ever/g29h9yl/",
        "score": 7,
        "subreddit": "investing",
        "created": 1597990033.0
    },
    {
        "author": "overwashed",
        "body": "I think the issue come at weighing things early in a company life.\n\nIt’s like saying when Apple first started if it’s worth more than IBM or Xerox at that time.",
        "created_utc": 1598052314,
        "id": "g2dnj36",
        "permalink": "/r/wallstreetbets/comments/ie7pg7/is_tesla_really_worth_more_than_walmart/g2dnj36/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1598081114.0
    },
    {
        "author": "KevinMKZ",
        "body": "Intel is really the new IBM",
        "created_utc": 1597878688,
        "id": "g25mal2",
        "permalink": "/r/wallstreetbets/comments/icx1gj/fuck_all_the_intel_haters_10_billion_accelerated/g25mal2/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1597907488.0
    },
    {
        "author": "Jarreddit15",
        "body": "Couldn’t think of a worse big tech combination for Tik Tok than fucking ORCL\n\nMaybe IBM should make a bid too",
        "created_utc": 1597722553,
        "id": "g1y44at",
        "permalink": "/r/wallstreetbets/comments/iblrnn/what_are_your_moves_tomorrow_august_18_2020/g1y44at/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1597751353.0
    },
    {
        "author": "Confirmatory",
        "body": "The stock price times the number of outstanding shares is the company’s valuation, also referred to as market cap. \n\nIf Tesla were to unexpectedly announce a revolutionary Cyberplane, investors would buy Tesla shares driving up the stock price. The stock price will go up because investors think that Tesla will be able to earn more profit, grow, etc. \n\nThey think Tesla stock will offer them a return on their investment: they will want to sell their stock for a profit to other investors, who also think Tesla will earn them a return, or they will want returns in the form of dividends. For growth companies, like Tesla, investors do not expect dividends any time soon. However, once the growth slows, investors will want dividends. At this point, if a company cannot justify its valuation because it is not earning enough profit per share, it will not be able to provide a high percentage dividend. For example, AT&amp;T and IBM offer 5%+ dividends. Tesla would need to earn $90 per share to be able to sustain a 5% dividend at the current $1800 stock price. If Tesla cannot offer a competitive dividend and it had similar growth prospects, investors will sell their shares and invest elsewhere.",
        "created_utc": 1597704499,
        "id": "g1x7dvi",
        "permalink": "/r/wallstreetbets/comments/ibk9vh/at_this_rate_tesla_will_still_be_too_expensive/g1x7dvi/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1597733299.0
    },
    {
        "author": "GamblingMikkee",
        "body": "Mine is bad. XOM, DOW, IBM, RTX, JPM, KMI, INTC, MMM, CAT, MO",
        "created_utc": 1596505656,
        "id": "g0a61rn",
        "permalink": "/r/wallstreetbets/comments/i34g5h/what_are_your_moves_tomorrow_august_04_2020/g0a61rn/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596534456.0
    },
    {
        "author": "infinitelimits00",
        "body": "INTC, XOM, IBM, CSCO, and KO - your boomer professor would be so proud.",
        "created_utc": 1598410254,
        "id": "g2vexcf",
        "permalink": "/r/wallstreetbets/comments/igqk5k/i_need_some_advice_so_i_can_lose_some_money/g2vexcf/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598439054.0
    },
    {
        "author": "RetardStrength-",
        "body": "To all the SF tech dudes in the room (I know you’re here) what’s your take on CSCO? I took a position at the March lows and bought more today after the sell off. Having a tech company pay a nice dividend is attractive to me but I’m worried they may be the next IBM (declining revenue, no longer relevant, losing to competitors, etc.). What’s your take tech dudes?",
        "created_utc": 1597366227,
        "id": "g1e3r11",
        "permalink": "/r/wallstreetbets/comments/i977qn/what_are_your_moves_tomorrow_august_14_2020/g1e3r11/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597395027.0
    },
    {
        "author": "SWeaseL92",
        "body": "Dont enter the market with the mindset of “I dont mind if i lose some money”. Value every dollar you invest in so you don’t blindly buy some random company that everyone tells you to buy, when in fact they are financially unstable and bound to go bankrupt. \nStart out with googling XX company’s investor relations, and seeing if their revenues are growing, if their cash flow is looking solid, if they dont got too much debt.\nThen think about what sector would flourish for next several years, like untact/green energy/5G/etc. Go watch some youtube videos from successful investors like Buffet, Ackman, Marks, Fisher, Dalio, etc. and see what their insights are in the current post-covid market.\nDo some filtering process, and select several companies from a few sectors, and build your portfolio.\n\nYou are 19, and there is a lot of room for trial and error, but start out with a good investment habit, you will be able to retire by 50. \n\nJust so you could find where to begin from, my portfolio is currently consisted of: MSFT, AAPL, TSLA, TSM, PEP, JNJ, WM, IBM, T, PPD. I personally swap out a stock at most once a quarter.",
        "created_utc": 1597187374,
        "id": "g15ltr9",
        "permalink": "/r/stocks/comments/i822rp/new_in_the_stock_market/g15ltr9/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1597216174.0
    },
    {
        "author": "Dmoan",
        "body": "Intc is pulling an IBM with buybacks while competition slowly kills them and while it managed to sucker people like buffet into buy the ibm stock, ultimately it didn’t end well for ibm. And also unlike IBM, Intel faces far more fierce competition.",
        "created_utc": 1597875202,
        "id": "g25fnxu",
        "permalink": "/r/wallstreetbets/comments/icv9yx/what_are_your_moves_tomorrow_august_20_2020/g25fnxu/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597904002.0
    },
    {
        "author": "APHAbaghodler",
        "body": "Legit why the fuck did Lenovo/IBM ever think it was a good idea to use Displayport natively on ThinkPads when the industry fucking standard is HDMI..?? Why?",
        "created_utc": 1596921161,
        "id": "g0trrfg",
        "permalink": "/r/wallstreetbets/comments/i5l1m1/weekend_discussion_thread_for_the_weekend_of/g0trrfg/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596949961.0
    },
    {
        "author": "2gurleys1kupp",
        "body": "SPCE, FB, RKT, BA, MSFT, INTC, IBM, BLNK - theres lots of meme stonks",
        "created_utc": 1598074798,
        "id": "g2f14jf",
        "permalink": "/r/wallstreetbets/comments/ie47ug/weekend_discussion_thread_for_the_weekend_of/g2f14jf/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598103598.0
    },
    {
        "author": "DerTagestrinker",
        "body": "Professor in this Darden video is explaining what the S&amp;P 500 is and he says it's made up of the 500 largest companies in the US like GM, IBM then goes \"it probably wouldn't have Tesla in there\" and laughs\n\nThe video is max two years old",
        "created_utc": 1597889478,
        "id": "g2666zs",
        "permalink": "/r/wallstreetbets/comments/icv9yx/what_are_your_moves_tomorrow_august_20_2020/g2666zs/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597918278.0
    },
    {
        "author": "Vast_Cricket",
        "body": "For years IBM had tried to replace its hard drive with other technologies. When I say years it is like 1970s era and on. The data storage cost is still way more affordable than SSD. Although both look free with file sharing storage companies offering so much storage for free.",
        "created_utc": 1597685035,
        "id": "g1vuo10",
        "permalink": "/r/stocks/comments/ibgp1r/western_digital_micron_and_the_immense_promise_of/g1vuo10/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1597713835.0
    },
    {
        "author": "Tetkobear",
        "body": "Even though I’m in all red today, feeling good about my new line up (all calls, out to 2021): AMZN, AAPL, FB (just doubled down), TGT, IBM (artificial intelligence driven), PTON, and a little BABA and ORCL for gambling.",
        "created_utc": 1597864018,
        "id": "g24s95v",
        "permalink": "/r/wallstreetbets/comments/ickxce/daily_discussion_thread_for_august_19_2020/g24s95v/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597892818.0
    },
    {
        "author": "trentshockey",
        "body": "Sure maybe some of them, you could have said that about CSCO or IBM in the tech bubble as well. Both of which are either below or even with their 00 high more than 20 years later. Sure their business models make sense, but if there isn’t enough revenue it doesn’t justify the valuations.",
        "created_utc": 1598637669,
        "id": "g35p1nj",
        "permalink": "/r/StockMarket/comments/iiaaev/us_tech_stocks_are_now_worth_more_than_the_entire/g35p1nj/",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1598666469.0
    },
    {
        "author": "kovacs",
        "body": "I may be wrong but I look at Slack and all I see is Netscape 2.0. Netscape vs. Microsoft and we know how that ended. You can't survive when your biggest competitor is giving away a good enough product for free and you have to charge in order to survive. I worked at an enterprise software company that had the exact same problem (IBM and Oracle giving away similar, good enough product). For that reason  I've always seen Slack as dead man walking. I could be totally wrong but that's how I currently see them.",
        "created_utc": 1598588713,
        "id": "g33pc9j",
        "permalink": "/r/wallstreetbets/comments/ihytvq/hello_im_the_square_guy_ready_to_lose_it_all/g33pc9j/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598617513.0
    },
    {
        "author": "CombodianBreastMilk",
        "body": "You should buy shares of IBM and keep working until you are 67 when you can claim full social security.",
        "created_utc": 1598554866,
        "id": "g31wq5b",
        "permalink": "/r/wallstreetbets/comments/ihieiu/daily_discussion_thread_for_august_27_2020/g31wq5b/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598583666.0
    },
    {
        "author": "Power80770M",
        "body": "[It has always been this way] (https://www.stlouistrust.com/why-most-stocks-underperform-index/#:~:text=The%20positive%20skew%20of%20stock,distribution%20of%20returns%20over%20time.):\n\n\n* The mean annual return of all stocks between 1926 and 2016 was 14.74%, while the median was a mere 5.23%. That is a HUGE difference.\n\n* Over half the stocks delivered negative returns during their lifetimes.\nOnly 42% outperformed the 3-month Treasury Bill.\n\n* Just five stocks (Exxon, Apple, Microsoft, GE and IBM) account for 10% of all wealth created by the stock market between 1926 and 2016.\n\n* Just 4% of all stocks accounted for **all the wealth** created by the stock market from 1926 and 2016.\n\n* A similar study of data from a shorter time period, 1989 through 2015, found like results: a very large positive skew where just 20% of the stocks produced all the return, over 50% of the stocks underperformed cash and 40% of the stocks provided a negative return.",
        "created_utc": 1597949903,
        "id": "g28qxip",
        "permalink": "/r/wallstreetbets/comments/idbh7m/2020_from_bust_to_boom_in_60_seconds_bubble_chart/g28qxip/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597978703.0
    },
    {
        "author": "radioref",
        "body": "Let me tell you something. If you are buying and making fucking stock derivatives trades and you don’t know how a stock split works you better close out those positions and fucking buy 4 shares of IBM and 6 shares of Ford and go to bed.\n\nJesus fucking Christ people.",
        "created_utc": 1596321990,
        "id": "g014ib4",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g014ib4/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596350790.0
    },
    {
        "author": "Ethericl",
        "body": "Its like Major League Baseball vs T-ball\n\nAMD NVDA AAPL vs IBM INTC \n\nYou know who's gonna win, I think INTC will death spiral slowly but surely",
        "created_utc": 1596412463,
        "id": "g05n1am",
        "permalink": "/r/wallstreetbets/comments/i2mdg8/anyone_placing_calls_on_intel/g05n1am/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596441263.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "Are people just blindly buying the dip on ORCL? There is no way they end up buying TikTok. Their cloud infrastructure also sucks.  \n  \nSource: have used some of their services. By personal experience, I would rank from best to worst: AWS, GCP, Azure, OCI, IBM Cloud  \n  \nORCL 55P 9/18",
        "created_utc": 1597857087,
        "id": "g24d1a3",
        "permalink": "/r/wallstreetbets/comments/ickxce/daily_discussion_thread_for_august_19_2020/g24d1a3/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1597885887.0
    },
    {
        "author": "diddycorp",
        "body": "I feel like intel is the next ibm. Sideways or slow downward action until they can get it together. They are so much behind their competitors",
        "created_utc": 1598841650,
        "id": "g3fed3u",
        "permalink": "/r/wallstreetbets/comments/ijjh2p/what_are_your_moves_tomorrow_august_31_2020/g3fed3u/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598870450.0
    },
    {
        "author": "dpetropo",
        "body": "I worked at IBM for 2 years, those boomers would have absolutely no fucking clue what to do with TikTok.",
        "created_utc": 1596300024,
        "id": "fzzy3fi",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzzy3fi/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596328824.0
    },
    {
        "author": "Dmoan",
        "body": "Got downvoted early morning when I said that intc will be back at 49 because no one falls for ibm buy back strategy any more.",
        "created_utc": 1597946263,
        "id": "g28iqqi",
        "permalink": "/r/wallstreetbets/comments/id7lxj/daily_discussion_thread_for_august_20_2020/g28iqqi/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1597975063.0
    },
    {
        "author": "teegolf1",
        "body": "No individual stock is set and forget forever. GE was a hundred year-old diversified giant that looked unstoppable in the 1970s-1990s. Now look it. GM, Ford, IBM, the list goes on and on. Don’t think it couldn’t happen to today’s favorites. Amazon and Google could be broken up by the government just like AT&amp;T was. Apple could lose its dominance with just a few bad products.    Diversification through mutual funds or a minimum of 25 stocks from various sectors is the way to go.",
        "created_utc": 1596925700,
        "id": "g0u06ap",
        "permalink": "/r/stocks/comments/i5z15f/is_buying_5_stocks_of_a_bluechip_company_like_dis/g0u06ap/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1596954500.0
    },
    {
        "author": "Wearahat02",
        "body": "INTC reminds me of GE/IBM.\nIBM never disappeared, but they stopped being one of the highlights of the market to a company that just exists in a stagnant and slow decline state.\nBut INTC doesn't have the luxury to slowly decline in their sector so their stock price if they don't turn things around will look more like GE than IBM.\nEven if they do turn things around, their profits of today reflects the fact that they have bulk of market share already, so even if they do regain the title permanently their PE might go up from 9 to 15, so betting on a turnaround that happens doesn't yield huge rewards.",
        "created_utc": 1596571893,
        "id": "g0dbhx7",
        "permalink": "/r/stocks/comments/i3nn77/thoughts_on_intel/g0dbhx7/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1596600693.0
    },
    {
        "author": "LovableContrarian",
        "body": "I wonder if people said that when IBM had little dips in the 80s.",
        "created_utc": 1596308333,
        "id": "g00fdpu",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g00fdpu/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596337133.0
    },
    {
        "author": "crel42",
        "body": "You’d think this sub was full of retards until you read the shit some idiots write on StockTwits... “MSFT,AAPL,AMZN,GOOGL, bearish on all of them, sell now they will all go into a correction sooner or later”. \nYeah, no shit sherlock. Go deal with your GE, IBM stocks, dumbass.",
        "created_utc": 1597964578,
        "id": "g29nsvq",
        "permalink": "/r/wallstreetbets/comments/idhs5y/what_are_your_moves_tomorrow_august_21_2020/g29nsvq/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1597993378.0
    },
    {
        "author": "Japappelflap",
        "body": "Genomics (treatment (CRISPR) and testing(Invitae))\ngreen energy(next era, tesla)\nCloud/quantum computing(msft,amazon, Google and maybe IBM) \nselfdriving taxi network and transportation(tesla, Amazon) \ndigital payments/wallet(Square,Adyen, facebook, google and Apple) \nRobotica and AI (google, boston dynamics and nvidia)\nchips, mainly ARM (arm, tsmc, nvidia)\nAR/VR ( facebook and Apple)\n\nMy top picks are tesla, invitae and Apple",
        "created_utc": 1597421273,
        "id": "g1gdces",
        "permalink": "/r/investing/comments/i9ob2z/what_sector_do_you_think_will_be_the_next_to/g1gdces/",
        "score": 4,
        "subreddit": "investing",
        "created": 1597450073.0
    },
    {
        "author": "ichbintrash",
        "body": "all these posts bout intl reminds me of ibm 16,  \"wow what a dip, market overreaction, itll hit a new ath withhin this yr its tech, dont bet against big blue\"\n\n4 years l8r, n that garbage is nowhere near where they used to be",
        "created_utc": 1596413773,
        "id": "g05p9ty",
        "permalink": "/r/wallstreetbets/comments/i2mdg8/anyone_placing_calls_on_intel/g05p9ty/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596442573.0
    },
    {
        "author": "Dmoan",
        "body": "People always point out to Microsoft anti trust ruling and say Washington might do similar things against Apple. But situation is far different:\n\nThere were multiple companies lobbying against Microsoft (Oracle, Ibm etc ) in 00s where as not many stand against Apple now. While Microsoft ironically has now raised concern about App Store it is not willing to fight in Washington over it.\n\nBill gates was known to be not willing to engage in aggressive lobbying, unlike Apple which throws millions\n\nMicrosoft wasn’t well liked by Washington or general populace unlike Apple\n\nWashington is far more pro big business and cares less about competition or consumers now, when compared to 00s especially after dot com bubble.\n\nSo end of day nothing will happen to Apple and stock market knows it",
        "created_utc": 1598214300,
        "id": "g2mcv5q",
        "permalink": "/r/wallstreetbets/comments/ifa72q/what_are_your_moves_tomorrow_august_24_2020/g2mcv5q/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598243100.0
    },
    {
        "author": "miscsubs",
        "body": "I think there are three issues:\n\n1. People are just not investing in manufacturing/industrials so the P/Es are low. Manufacturing is hard, especially when you're as diverse as 3M. And it's not sexy.\n2. One of their main sectors is automotive which is likely on a downturn cycle due to covid and even probably before that.\n3. They've been in a restructuring mode for 2 or 3 years. \n\nI think it's a good company and they do have a strong culture but they're kind of like IBM of 10-15 years ago in a way. It'd be bad news if they took the IBM route.",
        "created_utc": 1598892040,
        "id": "g3hhirp",
        "permalink": "/r/investing/comments/ik15a0/whats_up_with_3m_mmm/g3hhirp/",
        "score": 4,
        "subreddit": "investing",
        "created": 1598920840.0
    },
    {
        "author": "yachtking1",
        "body": "IBM",
        "created_utc": 1596410776,
        "id": "g05k6v3",
        "permalink": "/r/wallstreetbets/comments/i2iqcm/what_are_your_moves_tomorrow_august_03_2020/g05k6v3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596439576.0
    },
    {
        "author": "eldobs",
        "body": "S&amp;P 500 hasn't been soaring the same way tech stocks have in the past few years, so yeah it makes sense to initially think screw the S&amp;P 500. Thing is, you have no idea if this trend will continue, or what specific technology companies will end up working out -- at one point, investing in IBM or GE was seen as a sure thing.\n\n&amp;#x200B;\n\nBy investing in the S&amp;P 500, you don't have to worry about whether or not you've invested in the next IBM.",
        "created_utc": 1598725185,
        "id": "g39kp26",
        "permalink": "/r/stocks/comments/iix15m/give_me_your_stock_buying_advice_for_my_kid_2_yrs/g39kp26/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1598753985.0
    },
    {
        "author": "Indigeridoo",
        "body": "The top 10 stocks are literally always worth about 20% of the overall market, it's not new. Look at IBM in the 60's.",
        "created_utc": 1597799588,
        "id": "g21y4aw",
        "permalink": "/r/wallstreetbets/comments/icajvq/the_10_largest_stocks_in_the_sp_are_worth_more/g21y4aw/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597828388.0
    },
    {
        "author": "greg24211",
        "body": "hello GE and IBM",
        "created_utc": 1598317526,
        "id": "g2r4rdg",
        "permalink": "/r/stocks/comments/ifzhpi/is_intel_a_good_buy_right_now/g2r4rdg/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1598346326.0
    },
    {
        "author": "vvvvfl",
        "body": "&gt;Also being a pioneer in RISC desktop/laptop computing... I mean, I think this is not really talked about as much as the 5G iPhone 12 hype.\n\nI mean,  you do know that Apple used RISC IBM PowerPCs up until..2006 ?",
        "created_utc": 1598379799,
        "id": "g2tsgnt",
        "permalink": "/r/wallstreetbets/comments/igg23t/is_apple_silicon_even_remotely_priced_in/g2tsgnt/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598408599.0
    },
    {
        "author": "lucun",
        "body": "I've always considered Cloudflare a networking/CDN company. The big 4 US cloud providers provides what Cloudflare offers (CDN, networking) along with a lot of other compute/data capabilities. However, Cloudflare's networking/CDNs are great value for small customers. Cloudflare integrates well with all 4 major US cloud providers, which helps get a few bigger customers who are in enterprise cloud. I would consider Akamai a more direct competitor to Cloudflare.\n\nThe Cloudflare serverless offering is new to me and sounds interesting, but AWS/Azure/GCP/IBM serverless integrates with numerous other AWS/Azure/GCP/IBM services. Not everything can run well in a serverless configuration. This will be a disadvantage to Cloudflare's serverless in attracting any big enterprises. However, again, smaller customers may want a simplified experience and go with Cloudflare over the very feature rich cloud offerings of the big 4. Also, I'd bet Cloudflare's serverless would be cheaper as well.\n\nBasically, Cloudflare won't be getting much of the big lucrative enterprise contracts that the Big 4 have, and their only real moat is the better value they give to customers who only need their small set of services. And there's a lot of small businesses out there that need what Cloudflare offers.\n\nDisclosure: I own shares of IBM/AMZN/MSFT",
        "created_utc": 1597295095,
        "id": "g1aqacu",
        "permalink": "/r/investing/comments/i8fz31/cloudflare_net_could_get_really_big_or_im_missing/g1aqacu/",
        "score": 3,
        "subreddit": "investing",
        "created": 1597323895.0
    },
    {
        "author": "trader9899",
        "body": "I understand adding gold but why drop Jpm and gs and then adding BAC and who the fuck invest in ibm.",
        "created_utc": 1597698125,
        "id": "g1wsist",
        "permalink": "/r/wallstreetbets/comments/ibkabh/saudi_arabias_wealth_fund_exits_boeing_facebook/g1wsist/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597726925.0
    },
    {
        "author": "VeryStableGenius",
        "body": "&gt; I mean left behind like GE.\n\nYes, GE failed.     So did pets.com.   One doesn't invest in a single dividend yielding stock, but in a basket of a dozen or two.    A couple will go under like GE.  A couple will go up, up, up until the dividend yield is low and one trades them in for something cheaper with a higher yield.\n\n&gt; Like IBM. \n\nOh, and IBM is paying 5.22% at a PE of 14.  Nice!  I'd put some of this one on my mom's portfolio.",
        "created_utc": 1597953807,
        "id": "g290dj5",
        "permalink": "/r/investing/comments/idfnvm/whats_the_point_of_dividend_investing/g290dj5/",
        "score": 3,
        "subreddit": "investing",
        "created": 1597982607.0
    },
    {
        "author": "Dmoan",
        "body": "That’s bad news overall for a tech company that’s lagging they have given on competing and simply pulling an ibm maneuver",
        "created_utc": 1597872098,
        "id": "g259j9i",
        "permalink": "/r/wallstreetbets/comments/icv9yx/what_are_your_moves_tomorrow_august_20_2020/g259j9i/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597900898.0
    },
    {
        "author": "M1NDSW1TCH",
        "body": "This article caught my eye last week, I think it's relevant.\n\nBusinesses are accelerating their tech investment timelines, IBM Canada head says:\n\n [https://financialpost.com/news/businesses-are-accelerating-their-tech-investment-timelines-ibm-canada-head-says](https://financialpost.com/news/businesses-are-accelerating-their-tech-investment-timelines-ibm-canada-head-says) \n\n(I'm long)",
        "created_utc": 1596565045,
        "id": "g0ct0lm",
        "permalink": "/r/CanadianInvestor/comments/i3krc7/thoughts_on_cts/g0ct0lm/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1596593845.0
    },
    {
        "author": "t33po",
        "body": "If, huge **IF**, the Tik Tok thing isn't settled by monday open, I'm getting some itm IBM calls. 1. Their cloud services could use a headline grabbing client - higher offer. 2. Boomers love some old school blue chips - regulatory approval could get fastracked without the anti-trust blah blah. 3. On the 1% chance it happens, it will pop way more than MSFT- already a $1.5T company.\n\nWorst case, it stays flat as usual and I'm out a couple hundred in two weeks. Pure speculation on Trump's big tech hate and boomer nostalgia.",
        "created_utc": 1596299756,
        "id": "fzzxko2",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzzxko2/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596328556.0
    },
    {
        "author": "HinduHamma",
        "body": "Ya tell micron how well a 10b buyback program works for their stock price \n\nBuncha fucking bums. Buying and holding nvda at this price is still gonna beat holding intel . By a fucking mile\n\nIntel can absolutely turn into the next IBM type. Safe and steady but nothing special happening with their growth going forward.",
        "created_utc": 1598124219,
        "id": "g2iated",
        "permalink": "/r/wallstreetbets/comments/ieni32/intel_on_intel_my_dd/g2iated/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598153019.0
    },
    {
        "author": "devodid",
        "body": "Next week: IBM in talks to buy tiktok",
        "created_utc": 1597721287,
        "id": "g1y20je",
        "permalink": "/r/wallstreetbets/comments/iblrnn/what_are_your_moves_tomorrow_august_18_2020/g1y20je/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597750087.0
    },
    {
        "author": "jeffdidntkillhimslf",
        "body": "What does IBM even do anymore?",
        "created_utc": 1598196077,
        "id": "g2lbb4j",
        "permalink": "/r/wallstreetbets/comments/ie47ug/weekend_discussion_thread_for_the_weekend_of/g2lbb4j/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598224877.0
    },
    {
        "author": "AnonZeit",
        "body": "Fastly: TikTok and video delivery of cheap ads.\n\nNET: Azure, IBM, Google Cloud and Wordpress",
        "created_utc": 1596749135,
        "id": "g0lwy09",
        "permalink": "/r/wallstreetbets/comments/i4z4q7/what_are_your_moves_tomorrow_august_07_2020/g0lwy09/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596777935.0
    },
    {
        "author": "infinitelimits00",
        "body": "Yea boomers are in shambles.\n\nIntel, Boeing, Cisco, ..., IBM is next.",
        "created_utc": 1597264246,
        "id": "g194w6i",
        "permalink": "/r/wallstreetbets/comments/i8l3ny/what_are_your_moves_tomorrow_august_13_2020/g194w6i/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597293046.0
    },
    {
        "author": "jpowpump",
        "body": "once nvidia starts partnering with the big autos its over. it will be the microsoft taking a shit on ibm moment",
        "created_utc": 1597437487,
        "id": "g1hdtxa",
        "permalink": "/r/wallstreetbets/comments/i9t8hn/weekend_discussion_thread_for_the_weekend_of/g1hdtxa/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597466287.0
    },
    {
        "author": "Hadin_gar_Kan",
        "body": "Kudlo perhaps lets it slip that IBM is interested in tiktok. Or hes been doing dick-dingers. \\~0:29\n\n [https://www.youtube.com/watch?v=LlPtqc-SsgQ](https://www.youtube.com/watch?v=LlPtqc-SsgQ)",
        "created_utc": 1596568160,
        "id": "g0d19dk",
        "permalink": "/r/wallstreetbets/comments/i3gpgo/daily_discussion_thread_for_august_04_2020/g0d19dk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596596960.0
    },
    {
        "author": "thegoldstandard55",
        "body": "Kodak, IBM, Xerox, HP, GE",
        "created_utc": 1596509292,
        "id": "g0acnyk",
        "permalink": "/r/wallstreetbets/comments/i34g5h/what_are_your_moves_tomorrow_august_04_2020/g0acnyk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596538092.0
    },
    {
        "author": "trader9899",
        "body": "You can put airline. Com reit. Hotel. Bullshit legacy tech like ibm/oracle. But no you want to bet against meme stock",
        "created_utc": 1596777669,
        "id": "g0n9qq6",
        "permalink": "/r/wallstreetbets/comments/i56ss3/amzn_fb_puts/g0n9qq6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596806469.0
    },
    {
        "author": "TerrestrialPlanet",
        "body": "SPY, CSCO, EEM, MSFT, FB, AAPL, NFLX, QQQ, IWM, DIS, IBM would be symbols I'd consider.",
        "created_utc": 1598665291,
        "id": "g376fkr",
        "permalink": "/r/options/comments/iiff93/best_stocks_under_1100_to_sell_covered_calls/g376fkr/",
        "score": 2,
        "subreddit": "options",
        "created": 1598694091.0
    },
    {
        "author": "Blackops_21",
        "body": "The leading chip manufacturer in the world was unable to figure out how to make the latest tech, while their competitor did years before them. That's market share they may never get back. IBM all over again.",
        "created_utc": 1598398372,
        "id": "g2utekw",
        "permalink": "/r/RobinHood/comments/igddx7/do_any_of_you_invest_based_on_balance_sheet_pe/g2utekw/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1598427172.0
    },
    {
        "author": "321drowssap",
        "body": "I am not an expert at all but I will answer your question as I understand it. I am slightly old school so my investment and retirement plans existed before Robinhood and other brokers offered free trading:\n\nI will move from specific to broad.\n\nLevel 1: stocks and bonds. These are a specific entity one can buy. I can buy a specific share of apple or an actual T-note. Think of stocks as an individual m&amp;m candy piece and a bond as a pretzel \n\nLevel 2: index funds and ETFs: these are essentially a mix specific stocks that can be purchased more easily than creating the mix yourself. This is your first layer of diversification. Say I want to invest $100 in “tech,” I can buy $100 share in a tech ETF that is a mix of apple, IBM, Amazon stocks. This is beneficial because many of these individual stocks are worth more than $100, so I wouldn’t be able to buy an Apple share with my $100/month investment, but I can buy a $100 share of a “tech” ETF. Brokerage fees. My bank charges $7 per trade. It cost me $21 dollars in brokerage fees to buy the 3 above shares but only $7 to buy the ETF which is a mix. Think of an ETF like a bag of different m&amp;ms. Some peanut m&amp;ms, some regular, etc...\nIndex funds are similar but the target an index like the SP500. If you want to invest “in the market” without anymore thought than that, an index fund is recommended.\n\nMutual funds: (may be wrong on this) The way I understand mutual funds is they are offered by a specific broker or bank. For example, my IRA (see below) is comprised of mutual funds. With my bank, I pay no brokerage fees to purchase monthly, reoccurring positions in my mutual funds. Mutual funds can be targeted to an index, like the SP500 or they can be even more broad. My index funds are called “targeted lifecycle funds” these are platforms set up for dummies like me as an automatic diversification geared towards a retirement date (in my case 2050). This fund is a mix of American stocks, international stocks, and bonds. Back in the day there were increased brokers fees to purchase international stocks on a foreign stock exchange. My mutual fund lets me diversify even outside of the American economy at no additional cost in brokerage fees. Additionally, the “lifecycle” of the mutual fund means that as the years progress, it buys different specific entities. When it’s young, it is skewed towards stocks and international as they are riskier but also higher yield. As the fund matures towards 2050, it becomes less risky and buys more bonds. The idea being if there’s a recession when I’m 30, i have time to ride the upswing, but if a recession occurs the year before I retire and my portfolio is only stocks, I could lose half of the value of my portfolio right before retirement. Bonds are more secure. Think of mutual funds like a bag of trail mix, a mix of m&amp;ms and pretzels.\n\nTax Shelters: 401k and IRAs - these are not something you can buy, but rather a bucket you hold your specific investments in. They have tax benefits and other benefits (like employer matching %). My IRA is fully composed of mutual funds purchased monthly from my bank via autopay with no brokerage fees. Additionally my IRA is a Roth IRA which means I pay taxes on the money before it buys a mutual fund. But I don’t have to pay taxes when I withdraw. This is recommended if you expect your salary to increase as you get older and more senior in your company (most people) or if you are unsure if tax law will change and be higher when you retire. So for every $10 of my salary, i pay $3 in tax and buy $7 in mutual funds. If it were a traditional IRA i could buy $10 in mutual funds but pay out at my tax bracket when I retire.\n\nA lot of this stuff has changed with technology and no fee brokerages. So don’t necessarily copy what I do. My system works for me because it’s easy, diversified, and automatic. I have additional “play” money that i more activity engage with the market, but because I’m a dumb idiot, I treat that play money as essentially gambling money and if I lose it all on Tesla stock, my retirement isn’t affected.\n\nI call my above strategy the “get rich slow” scheme. And it works for me.",
        "created_utc": 1598458813,
        "id": "g2x9h7q",
        "permalink": "/r/investing/comments/igz1d2/what_is_the_best_investing_tip_for_beginner/g2x9h7q/",
        "score": 2,
        "subreddit": "investing",
        "created": 1598487613.0
    },
    {
        "author": "Barracuda_Blue",
        "body": "IBM got dementia and is going in a different direction than everyone else.\n\nJust let her go...",
        "created_utc": 1596820540,
        "id": "g0p7mw5",
        "permalink": "/r/wallstreetbets/comments/i5b9o9/daily_discussion_thread_for_august_07_2020/g0p7mw5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596849340.0
    },
    {
        "author": "Mirved",
        "body": "So you are going to invest in IBM, Xerox, HTC etc?  \n\n  \n\n* A company like Facebook can easily fall/stagnate as these named above. You already see that Facebook is slowly being ostracized. Instagram is old news all kids are on TikTok now, Whatsapp can easily be turned in for the next big thing. \n* Google / Amazon still has potential. They are in alot of things and well diversified.\n* Apple is hard, they are starting to hit their ceiling in certain markets, innovation is stalling and the products are becoming less popular. They might be able to spin this around and they still have big potential in the personal computer market.\n* Microsoft is very stable and diversified with the option to integrate new tech in their huge product portfolio.",
        "created_utc": 1598886398,
        "id": "g3h3czf",
        "permalink": "/r/stocks/comments/ijw2hu/what_do_you_think_of_buying_airport_stocks_now/g3h3czf/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598915198.0
    },
    {
        "author": "closingbell",
        "body": "&gt; The truth is, they are a powerful player in tech trading at a massive discount. \n\nRight - just like CSCO &amp; IBM...aka dead money for years.",
        "created_utc": 1596919511,
        "id": "g0tonrh",
        "permalink": "/r/investing/comments/i62pil/intel_ceo_bought_400k_of_intel_stock_upcoming/g0tonrh/",
        "score": 2,
        "subreddit": "investing",
        "created": 1596948311.0
    },
    {
        "author": "Dmoan",
        "body": "What is happening to Intel is similar to what happened to ibm they are slowing losing ground but only their decline will be fast as vendors abandon their chips for AMD. Apple is already moving on.",
        "created_utc": 1597873243,
        "id": "g25btz4",
        "permalink": "/r/wallstreetbets/comments/icv9yx/what_are_your_moves_tomorrow_august_20_2020/g25btz4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597902043.0
    },
    {
        "author": "kickace",
        "body": "IBM uses it as well.",
        "created_utc": 1598219052,
        "id": "g2mma01",
        "permalink": "/r/wallstreetbets/comments/ifbqta/slack_work_unfairly_punished_by_teams/g2mma01/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598247852.0
    },
    {
        "author": "-nye-",
        "body": "Idk man I’m into intel and it’s the same thing. I believe in them but they’re not going parabolic like the meme techs. Like why would people park their money in IBM when they could be riding the AAPL train. Only hope is when tech slumps people go back to the “value” techs",
        "created_utc": 1598203161,
        "id": "g2lqgv9",
        "permalink": "/r/wallstreetbets/comments/ie47ug/weekend_discussion_thread_for_the_weekend_of/g2lqgv9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598231961.0
    },
    {
        "author": "The_Texidian",
        "body": "The problem is with you trying to over complicate my question. \n\n\nI’m just asking for trivia, which company has the highest annual dividend. I cited that IBM pays out $6.52 a year with its current dividend. \n\n\nI’m not asking for yield, I’m not asking for stock picks, I’m not asking about fractional shares or dividend growth. My question is quite simple. \n\n\nMy question is in different words: If I were to buy 1 share of 1 company at ANY price, which 1 share will pay me the most in 1 year.",
        "created_utc": 1598229529,
        "id": "g2n5qhs",
        "permalink": "/r/stocks/comments/ifd8y2/what_stock_pays_the_highest_dividend/g2n5qhs/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598258329.0
    },
    {
        "author": "tyrryt",
        "body": "There are always the true believer zealots, wailing about all the fundamentals and \"new paradigms\" and how, of course, \"this time it's different\".  \n\nIBM was going to corner the market on computers, CSCO was going to corner the market on routers, pets.com was going to corner the market on pet food, (unnameable virtual currency) was going to corner the market for dollar alternatives, etc., etc.  There are hundreds of names in the past few decades alone.\n\nAll of them \"cornered the market\", all of them were touted to hell and back by the true believers, with endless lists of reasons that this time it's different, all of them went parabolic, and all of them collapsed 70-90%.",
        "created_utc": 1598027895,
        "id": "g2ca3oc",
        "permalink": "/r/wallstreetbets/comments/idwp2h/tesla_market_cap_is_now_higher_than_walmart/g2ca3oc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598056695.0
    },
    {
        "author": "HinduHamma",
        "body": "Except reasonably priced is not some universal definition. Just because you don’t like to pay that premium doesn’t mean it’s doesn’t have other willing buyers. And go ahead and believe you are smarter than them. \n\nGo ahead and buy those cheap low PE stocks or value defensive picks. But they aren’t treated with a nice big multiple for a reason. They don’t deserve to be “overvalued” or hyped. \n\nFord and GM look cheap right! IBM, GE? Cisco. Banks. Ya I’ll pass. They are cheaper for a reason. Weak fundamentals and growth.",
        "created_utc": 1598303579,
        "id": "g2qedts",
        "permalink": "/r/investing/comments/ifwuvm/robert_schillers_pe_discussion/g2qedts/",
        "score": 2,
        "subreddit": "investing",
        "created": 1598332379.0
    },
    {
        "author": "bitcoinchamps",
        "body": "Got my eye on $IBM, they pay a good dividend as well.",
        "created_utc": 1597670545,
        "id": "g1uqej1",
        "permalink": "/r/investing/comments/ibdszj/stocks_making_the_biggest_moves_premarket/g1uqej1/",
        "score": 2,
        "subreddit": "investing",
        "created": 1597699345.0
    },
    {
        "author": "TaxWizard69",
        "body": "IBM is just an extreme example of a fallen tech giant. They've had terrible management for decades and did every short-termists decision possible to meet EPS estimates. If Steve Ballmer was IBM's CEO I might believe he was one of their better CEOs in history. Today's big tech are just really well managed companies with CEOs/founders who are well connected with its employees and their consumer markets. They all have strong ecosystems around their products, amazing balance sheets, and a long-term approach to a lot of their projects. It's a big extreme from IBM. It comes with a lot of scrutiny since these companies have to be really cutthroat and aggressive against competitors but it's a big learning lesson from IBM.",
        "created_utc": 1596391873,
        "id": "g04jhu9",
        "permalink": "/r/investing/comments/i2ba5z/investing_in_apple_for_the_next_10_years/g04jhu9/",
        "score": 2,
        "subreddit": "investing",
        "created": 1596420673.0
    },
    {
        "author": "TerrestrialPlanet",
        "body": "&gt; What companies do you think this could be applied to? \n\nIf you are into dividends stocks, you may check out \"dogs of the dow\" --  [https://en.wikipedia.org/wiki/Dogs\\_of\\_the\\_Dow](https://en.wikipedia.org/wiki/Dogs_of_the_Dow) \n\n&amp;#x200B;\n\n1. DOW\n2. XOM\n3. IBM\n4. VZ\n5. CVX\n6. PFE\n7. MMM\n8. WBA\n9. CSCO\n10. KO",
        "created_utc": 1596611455,
        "id": "g0f5wup",
        "permalink": "/r/options/comments/i3d90o/suggestion_needed_selling_covered_calls_on_a/g0f5wup/",
        "score": 2,
        "subreddit": "options",
        "created": 1596640255.0
    },
    {
        "author": "UABeeezy",
        "body": "Pretty sure tiktok is worth more than IBM. Not gonna happen",
        "created_utc": 1596299919,
        "id": "fzzxw0j",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzzxw0j/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596328719.0
    },
    {
        "author": "svgscrewball",
        "body": "1st I said reddit for testing, Then there is \n\nhttps://www.featuredcustomers.com/vendor/cloudflare/customers/reddit\n\n\nhttps://www.featuredcustomers.com/vendor/cloudflare/customers/shopify\n\n\nThen there is this  [\"Cloudflare’s relationship with the giants of the tech world could play a major role in determining its future. Amazon (AMZN), Alphabet (GOOGL), Microsoft (MSFT), and IBM (IBM) all have major cloud platforms, and all but AMZN currently partner with Cloudflare. Google Cloud, Microsoft Azure, and IBM Cloud integrate Cloudflare into their platforms to deliver its services to their customers.\"](https://www.forbes.com/sites/greatspeculations/2019/09/12/what-investors-need-to-know-about-the-cloudflare-net-ipo/#64b28e283d8e)\n\nEDIT: But many will be competitors going forward\n\nEDIT: Still like their chart better",
        "created_utc": 1597202069,
        "id": "g16dxml",
        "permalink": "/r/stocks/comments/i7pwzj/which_stock_cloudflare_fastly_zscaler_or_twillo/g16dxml/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1597230869.0
    },
    {
        "author": "Amerlis",
        "body": "Same reason IBM is still around and Oracle. \nEnterprise. Otherwise known as the “if it ain’t broke we ain’t changing shit, and if it is broke we buy more of the same shit”. \n\nMicrosoft might fall in and out of being cool or even the hot topic of conversation, but they about as defensive without going full boomer.",
        "created_utc": 1597248748,
        "id": "g185wj7",
        "permalink": "/r/wallstreetbets/comments/i8b56i/daily_discussion_thread_for_august_12_2020/g185wj7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597277548.0
    },
    {
        "author": "Darkmarth32",
        "body": "You are vastly underestimating the performance of AMDs CPU, the instructions per clock which is the measure of performance independent of clock speed is actually better for most instructions on AMDs new CPUs, in the future when TSMC hits the wall on size. The shift will move to more architectural improvements like chiplets, as well as pushing higher clock speeds similar to Intel's 14nm++++.\n\nAll that sad I do agree that Intel will be ok, but I could see them sort of leveling out, similar to an IBM.",
        "created_utc": 1597200249,
        "id": "g16aq6c",
        "permalink": "/r/wallstreetbets/comments/i822hx/intc_in_a_nutshell/g16aq6c/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597229049.0
    },
    {
        "author": "CptTonyStark",
        "body": "In 1963, IBM and Xerox had high P/E ratios of 38.5 and 25 respectively. By 1969, these increased to 44.4 and 50.8, even as the overall P/E ratio declined from 18.6 to 14.",
        "created_utc": 1596778720,
        "id": "g0nb3ru",
        "permalink": "/r/wallstreetbets/comments/i4z4q7/what_are_your_moves_tomorrow_august_07_2020/g0nb3ru/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596807520.0
    },
    {
        "author": "bloatedkat",
        "body": "Next headline: \"IBM in talks to buy TikTok\"\n\nThe companies looking for a piece of TikTok just keeps getting more and more antiquated.",
        "created_utc": 1597727063,
        "id": "g1yaqn4",
        "permalink": "/r/wallstreetbets/comments/ibtun4/oracle_in_talks_to_buy_tiktoks_us_business_whats/g1yaqn4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597755863.0
    },
    {
        "author": "AnalSepage",
        "body": "33/33/33 IBM/GE/F = perfect portfolio",
        "created_utc": 1597851354,
        "id": "g240ywg",
        "permalink": "/r/wallstreetbets/comments/ickxce/daily_discussion_thread_for_august_19_2020/g240ywg/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597880154.0
    },
    {
        "author": "anticounter",
        "body": "I'm just a casual, but here's my broad take.. The industry is broadly categorized between semiconductors (71 listed companies) and semiconductor equipment (ie making the machines used to make the chips, 38 listed companies). It covers a wide range of technologies-- analog chips, processors, network equipment, LEDs, etc.-- and generally companies need to have their niche in the global supply chain in order to have an advantage. This is because the supply chain from silicon wafer to finished product is too complex to completely vertically integrated. You can't be a foundry, equipment designer/maker, and chip designer/maker all at the same time efficiently. Also, your equipment maker can also potentially sell the manufacturing equipment to your competitors. In fact, many offer \"turn key\" solutions-- just give us the cash and the space, and we'll set up the whole factory for you! So the companies that do well tend to have (or had) an exceptional R&amp;D performance/expenditures to differentiate (AMD, NVDA, TSM today; INTC and IBM in the past). That also makes it a difficult business to maintain an advantage in, since sometimes you just run into an R&amp;D problem and no matter how much money you throw at it the engineers just can't come up with a workable solution (eg INTC).",
        "created_utc": 1598106647,
        "id": "g2h1h60",
        "permalink": "/r/investing/comments/iei292/semiconductors/g2h1h60/",
        "score": 2,
        "subreddit": "investing",
        "created": 1598135447.0
    },
    {
        "author": "programmingguy",
        "body": "If you are looking at just the dividend, ok. But I don't see IBM as a long term hold...the mainframe behemoth just slogs and tries to reinvent itself. They have some potential on the enterprise cloud space and as large organizations migrate from legacy systems hope for increased recurring revenues through vendor lock-in but there's a lot of competition in that space and they are so large to have that make a significant impact. I bought IBM under 100 during the pandemic as a safety play since they have a lot of cash and enough service contracts to maintain a lot of cashflow during uncertain times but I'll be selling them at 140. I don't see IBM as a growth play.",
        "created_utc": 1597674163,
        "id": "g1uziga",
        "permalink": "/r/investing/comments/ibdszj/stocks_making_the_biggest_moves_premarket/g1uziga/",
        "score": 2,
        "subreddit": "investing",
        "created": 1597702963.0
    },
    {
        "author": "an27725",
        "body": "so is this going to be another IBM and HP type where they fail to compete with newer players, especially AWS and such?",
        "created_utc": 1597694388,
        "id": "g1wh3yg",
        "permalink": "/r/wallstreetbets/comments/iblhni/vmw_buy_the_last_value_unicorn/g1wh3yg/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597723188.0
    },
    {
        "author": "Particular-Wedding",
        "body": "Didn't know Op wrote for Barron's.  Good job!  Future stocks to cover: XRX and IBM.  I mean technically they are tech stocks. . .",
        "created_utc": 1598653789,
        "id": "g36maiw",
        "permalink": "/r/wallstreetbets/comments/iiehid/the_boomer_weekly_august_28_2020/g36maiw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598682589.0
    },
    {
        "author": "heizenbergbb",
        "body": "IBM, ABBV, RTX, ED, O, CVX, PM, WBA, VZ, T, PFE there are a couple more but I don't have my spreadsheet handy.",
        "created_utc": 1598819620,
        "id": "g3e8ne6",
        "permalink": "/r/wallstreetbets/comments/ijjh2p/what_are_your_moves_tomorrow_august_31_2020/g3e8ne6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598848420.0
    },
    {
        "author": "Gen8Master",
        "body": "Virtualisation is an ancient concept. IBM was doing it half a century ago on mainframes. AWS, Azure and GCP started off doing the same thing but as a service. So it's not because its \"old tech\". VMware just never improved on the concept. VMs are super wasteful in terms of CPU, memory and storage. The race to virtualise the actual apps and services (that run on top of the OS) is what mattered and they got left behind.",
        "created_utc": 1598487155,
        "id": "g2yx0l2",
        "permalink": "/r/stocks/comments/ih62lv/vmware_why_is_this_company_valued_so_low_pe_less/g2yx0l2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598515955.0
    },
    {
        "author": "jpowpump",
        "body": "You will be called a pussy in here if you invest in dividends. \n\nT is the safest bet with the highest yields.\n\nXOM has 8.5% yields but there is the chance of it getting cut. Small chance but still a chance. \n\nIBM also pays a decent dividend and has some upside if they can stay focused in growth areas.",
        "created_utc": 1598492991,
        "id": "g2z7xth",
        "permalink": "/r/wallstreetbets/comments/ih6bzk/what_are_your_moves_tomorrow_august_27_2020/g2z7xth/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598521791.0
    },
    {
        "author": "sumane12",
        "body": "IBM is a stock I considered doing this strategy with",
        "created_utc": 1596523929,
        "id": "g0ax4bw",
        "permalink": "/r/options/comments/i3d90o/suggestion_needed_selling_covered_calls_on_a/g0ax4bw/",
        "score": 2,
        "subreddit": "options",
        "created": 1596552729.0
    },
    {
        "author": "Charizard_gets_tail",
        "body": "Average analyst upside forecast according to Capital IQ: 74%. I read some of the analyst reports and that original post and liked the sound of the company, bought some a few weeks ago. In particular they seem to have high certification levels for a reseller:\n\n\"The company attained the highest possible certification with Microsoft and Cisco. With Dell the company has the highest certification in Canada and is close to achieving the highest in North America. As the second largest partner to IBM, Converge is positioned well to become a strategic reseller of Red Hat solutions; we note that Red Hat is moving from 15% of channel sales through partners such as Converge towards 60%. Recently, CRN®, a brand of The Channel Company (private), ranked Converge within the top 50 on its 2020 Solution Provider 500 list.\"",
        "created_utc": 1596563077,
        "id": "g0cny5x",
        "permalink": "/r/CanadianInvestor/comments/i3krc7/thoughts_on_cts/g0cny5x/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1596591877.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM, INTC, CSCO\n\nLol",
        "created_utc": 1597673160,
        "id": "g1uwx5q",
        "permalink": "/r/wallstreetbets/comments/ibbhcu/daily_discussion_thread_for_august_17_2020/g1uwx5q/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597701960.0
    },
    {
        "author": "Vast_Cricket",
        "body": "*They have fewer competitors.* It has *not* generated a lot of income. Yahoo financial, Zacks, Schwab and other analysts predict *short term, intermediate term being flat(red*), while long term being good(green). Some gave C, even F ratings.  I acquired a small position on the basis it could get sold to a bigger player like IBM, Oracle.  I *do not hesitate to liquidate* if the performance stays at this level by 2021.\n\nTo answer like commentaries, reviews posted here. I suggest you do your own analysis. There were way many posts why L\\_ K  co ff ee,  buy out  ru mors will be great buy.  The stocks lost much market capitalization and a few are behind bars.",
        "created_utc": 1597803654,
        "id": "g225mw5",
        "permalink": "/r/stocks/comments/icc4xd/why_do_people_seem_to_like_net_so_much/g225mw5/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1597832454.0
    },
    {
        "author": "callerids",
        "body": "If net sales, which is the lifeblood of the firm, increases by 7.2%, then operating income will typically follow a similar increase. To really get to the bottom of this question, one would need to analyze the cost structure of the company in previous quarters and what changes led to such an outsized improvement.\n\nWhen operating income shows a sizeable increase, then this implies that the company was able to reduce their costs to such an extent that for every extra dollar of revenue IBM was (somehow!) able to squeeze 3.2x more earnings compared to previous quarters. \n\nThe growth in sales is not a cap per se on operating income growth, but any mismatches are generally a flag to \"dig deeper\".",
        "created_utc": 1597859434,
        "id": "g24i23g",
        "permalink": "/r/SecurityAnalysis/comments/i7x9v4/2h_2020_security_analysis_questions_and/g24i23g/",
        "score": 2,
        "subreddit": "SecurityAnalysis",
        "created": 1597888234.0
    },
    {
        "author": "Lie-Minimum",
        "body": "Soon companies like ibm will trade for .5 pe.",
        "created_utc": 1598417569,
        "id": "g2vqfif",
        "permalink": "/r/investing/comments/ignejm/what_are_three_tech_stocks_you_think_still_have_a/g2vqfif/",
        "score": 2,
        "subreddit": "investing",
        "created": 1598446369.0
    },
    {
        "author": "radioref",
        "body": "Some fucking CORN trader wearing coveralls and sitting in a bum ass 1970's brown trimmed office in Iowa or Nebraska for a corn processing plant is working on an IBM 3270 terminal, punching the same damn numbers every day, and is now wondering what in the holy hellfire fuck is going on.",
        "created_utc": 1597249646,
        "id": "g187ztk",
        "permalink": "/r/wallstreetbets/comments/i8b56i/daily_discussion_thread_for_august_12_2020/g187ztk/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1597278446.0
    },
    {
        "author": "Vast_Cricket",
        "body": "I remember a shareholder of IBM, a widow attended at IBM annual meeting. She cried at the meeting that her only savings was left by her husband who worked at IBM from pre-type writer days. The stock tanked to $40 (about $***10*** today when factored into splits). They stopped paying dividend that year. It was the dividend she lived on. She had no social security as women did not work.  Fast forward, if all your savings are in 1 basket. You could repeat her mistake.  \n\nA lawyer's secretary was asked to buy stocks for her boss. She knew nothing about stocks but bought smaller positions of everything he owned. She willed the stocks to her sister. When she died her sister found out she had a $7.5M networth.",
        "created_utc": 1597519976,
        "id": "g1n225p",
        "permalink": "/r/stocks/comments/iadhkf/how_risky_is_it_to_hold_425_shares_of_apple_aapl/g1n225p/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1597548776.0
    },
    {
        "author": "iseebrucewillis",
        "body": "r/investing: China stonks are fake, brb while I max out my 401k on IBM for the dividends.\n\nr/wsb: all in BABA 300c 8/7, Gynese stonks only go up",
        "created_utc": 1596646532,
        "id": "g0gofez",
        "permalink": "/r/wallstreetbets/comments/i48x8j/baba_is_undervalued_its_going_to_the_moon/g0gofez/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1596675332.0
    },
    {
        "author": "infinitelimits00",
        "body": "AMD will easily outperform Intel. Intel is like IBM from 10 years ago. No growth, terrible leaders, etc. The day they fire Bob Swan is the day Intel will go up 10%.",
        "created_utc": 1597362520,
        "id": "g1dwx4m",
        "permalink": "/r/stocks/comments/i9avyi/amd_ceo_sold_159_millions_worth_of_amd_stock/g1dwx4m/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1597391320.0
    },
    {
        "author": "wanmoar",
        "body": "&gt; She’s wondering if she could retroactively get all these passed dividends back.\n\nOn what basis does she think the IBM person she spoke has it wrong to say that ESPP shares were not eligible for stock splits?\n\nIf he is right, then she's not owed any amount of unpaid dividends.",
        "created_utc": 1597606592,
        "id": "g1rj10c",
        "permalink": "/r/investing/comments/iapy5c/ibm_stock_certificates_from_1970s/g1rj10c/",
        "score": 10,
        "subreddit": "investing",
        "created": 1597635392.0
    },
    {
        "author": "infinitelimits00",
        "body": "Man boomers getting screwed. \n\nRTX, XOM, PFE. Not to mention already with INTC, CSCO, and IBM going down/lagging rest of market with earnings. BA sucking all year. \n\nAll they have is Disney now unless they count Microsoft.",
        "created_utc": 1598315412,
        "id": "g2r0xo3",
        "permalink": "/r/wallstreetbets/comments/ifwowm/what_are_your_moves_tomorrow_august_25_2020/g2r0xo3/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1598344212.0
    },
    {
        "author": "YaBoyPsycho",
        "body": "IBM is not at all comparable to AAPL",
        "created_utc": 1596741132,
        "id": "g0lfn1o",
        "permalink": "/r/StockMarket/comments/i4vxi6/aapl_miss_the_boat_or_is_it_not_too_late/g0lfn1o/",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1596769932.0
    },
    {
        "author": "Tyler2191",
        "body": "I do have a small position in SPYD but I’ll say that I don’t really find dividends worth it for me. I’m buying individual stocks and the dividend yield is an added bonus. Been picking up shares in IBM and as many MSFT shares as I can get my hands on because I believe their shares are underpriced. But, don’t go by my suggestions, for the most part I’m just an idiot retail investor.",
        "created_utc": 1597704801,
        "id": "g1x7zjh",
        "permalink": "/r/RobinHood/comments/ibnlxh/dividend_yielding_stocksetfs/g1x7zjh/",
        "score": 7,
        "subreddit": "RobinHood",
        "created": 1597733601.0
    },
    {
        "author": "cookingboy",
        "body": "Calm the fuck down dude. What's \"you people\"? I work in Silicon Valley and more than half of my networth is in tech stocks and I've been a long term investor of TSLA since the stock was at $70.\n\nYes software is eating the future blah blah and yes we'll all live in United States of Amazon at one point but it doesn't mean you can't have extremely overvalued individual stocks.\n\nJust because I believe in the future of EVs doesn't mean Tesla's valuation at *today* is justified, and even less so for companies like Nikola. Just because I believe in the future of tele-commuting doesn't mean Zoom isn't grossly overvalued.\n\nJust like it would be silly to dump your entire networth into IBM stocks just because you believe Personal Computers are going to take off. Or bet everything on Atari because you believe video games are the future. How's that YOLO bet on AOL, internet is the future right? \n\nVery often first movers don't stay dominant as a market matures and undergoes explosive growth.\n\n&gt;The CEO underpromises and over-delivers.\n\n**/Chokes on water** So which parallel universe are you from? Is Covid just as bad there?",
        "created_utc": 1597961233,
        "id": "g29h9yl",
        "permalink": "/r/investing/comments/idhr6y/tesla_closes_above_2000_for_the_first_time_ever/g29h9yl/",
        "score": 7,
        "subreddit": "investing",
        "created": 1597990033.0
    },
    {
        "author": "overwashed",
        "body": "I think the issue come at weighing things early in a company life.\n\nIt’s like saying when Apple first started if it’s worth more than IBM or Xerox at that time.",
        "created_utc": 1598052314,
        "id": "g2dnj36",
        "permalink": "/r/wallstreetbets/comments/ie7pg7/is_tesla_really_worth_more_than_walmart/g2dnj36/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1598081114.0
    },
    {
        "author": "KevinMKZ",
        "body": "Intel is really the new IBM",
        "created_utc": 1597878688,
        "id": "g25mal2",
        "permalink": "/r/wallstreetbets/comments/icx1gj/fuck_all_the_intel_haters_10_billion_accelerated/g25mal2/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1597907488.0
    },
    {
        "author": "Jarreddit15",
        "body": "Couldn’t think of a worse big tech combination for Tik Tok than fucking ORCL\n\nMaybe IBM should make a bid too",
        "created_utc": 1597722553,
        "id": "g1y44at",
        "permalink": "/r/wallstreetbets/comments/iblrnn/what_are_your_moves_tomorrow_august_18_2020/g1y44at/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1597751353.0
    },
    {
        "author": "Confirmatory",
        "body": "The stock price times the number of outstanding shares is the company’s valuation, also referred to as market cap. \n\nIf Tesla were to unexpectedly announce a revolutionary Cyberplane, investors would buy Tesla shares driving up the stock price. The stock price will go up because investors think that Tesla will be able to earn more profit, grow, etc. \n\nThey think Tesla stock will offer them a return on their investment: they will want to sell their stock for a profit to other investors, who also think Tesla will earn them a return, or they will want returns in the form of dividends. For growth companies, like Tesla, investors do not expect dividends any time soon. However, once the growth slows, investors will want dividends. At this point, if a company cannot justify its valuation because it is not earning enough profit per share, it will not be able to provide a high percentage dividend. For example, AT&amp;T and IBM offer 5%+ dividends. Tesla would need to earn $90 per share to be able to sustain a 5% dividend at the current $1800 stock price. If Tesla cannot offer a competitive dividend and it had similar growth prospects, investors will sell their shares and invest elsewhere.",
        "created_utc": 1597704499,
        "id": "g1x7dvi",
        "permalink": "/r/wallstreetbets/comments/ibk9vh/at_this_rate_tesla_will_still_be_too_expensive/g1x7dvi/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1597733299.0
    },
    {
        "author": "GamblingMikkee",
        "body": "Mine is bad. XOM, DOW, IBM, RTX, JPM, KMI, INTC, MMM, CAT, MO",
        "created_utc": 1596505656,
        "id": "g0a61rn",
        "permalink": "/r/wallstreetbets/comments/i34g5h/what_are_your_moves_tomorrow_august_04_2020/g0a61rn/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596534456.0
    },
    {
        "author": "infinitelimits00",
        "body": "INTC, XOM, IBM, CSCO, and KO - your boomer professor would be so proud.",
        "created_utc": 1598410254,
        "id": "g2vexcf",
        "permalink": "/r/wallstreetbets/comments/igqk5k/i_need_some_advice_so_i_can_lose_some_money/g2vexcf/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598439054.0
    },
    {
        "author": "RetardStrength-",
        "body": "To all the SF tech dudes in the room (I know you’re here) what’s your take on CSCO? I took a position at the March lows and bought more today after the sell off. Having a tech company pay a nice dividend is attractive to me but I’m worried they may be the next IBM (declining revenue, no longer relevant, losing to competitors, etc.). What’s your take tech dudes?",
        "created_utc": 1597366227,
        "id": "g1e3r11",
        "permalink": "/r/wallstreetbets/comments/i977qn/what_are_your_moves_tomorrow_august_14_2020/g1e3r11/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597395027.0
    },
    {
        "author": "SWeaseL92",
        "body": "Dont enter the market with the mindset of “I dont mind if i lose some money”. Value every dollar you invest in so you don’t blindly buy some random company that everyone tells you to buy, when in fact they are financially unstable and bound to go bankrupt. \nStart out with googling XX company’s investor relations, and seeing if their revenues are growing, if their cash flow is looking solid, if they dont got too much debt.\nThen think about what sector would flourish for next several years, like untact/green energy/5G/etc. Go watch some youtube videos from successful investors like Buffet, Ackman, Marks, Fisher, Dalio, etc. and see what their insights are in the current post-covid market.\nDo some filtering process, and select several companies from a few sectors, and build your portfolio.\n\nYou are 19, and there is a lot of room for trial and error, but start out with a good investment habit, you will be able to retire by 50. \n\nJust so you could find where to begin from, my portfolio is currently consisted of: MSFT, AAPL, TSLA, TSM, PEP, JNJ, WM, IBM, T, PPD. I personally swap out a stock at most once a quarter.",
        "created_utc": 1597187374,
        "id": "g15ltr9",
        "permalink": "/r/stocks/comments/i822rp/new_in_the_stock_market/g15ltr9/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1597216174.0
    },
    {
        "author": "Dmoan",
        "body": "Intc is pulling an IBM with buybacks while competition slowly kills them and while it managed to sucker people like buffet into buy the ibm stock, ultimately it didn’t end well for ibm. And also unlike IBM, Intel faces far more fierce competition.",
        "created_utc": 1597875202,
        "id": "g25fnxu",
        "permalink": "/r/wallstreetbets/comments/icv9yx/what_are_your_moves_tomorrow_august_20_2020/g25fnxu/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597904002.0
    },
    {
        "author": "APHAbaghodler",
        "body": "Legit why the fuck did Lenovo/IBM ever think it was a good idea to use Displayport natively on ThinkPads when the industry fucking standard is HDMI..?? Why?",
        "created_utc": 1596921161,
        "id": "g0trrfg",
        "permalink": "/r/wallstreetbets/comments/i5l1m1/weekend_discussion_thread_for_the_weekend_of/g0trrfg/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596949961.0
    },
    {
        "author": "2gurleys1kupp",
        "body": "SPCE, FB, RKT, BA, MSFT, INTC, IBM, BLNK - theres lots of meme stonks",
        "created_utc": 1598074798,
        "id": "g2f14jf",
        "permalink": "/r/wallstreetbets/comments/ie47ug/weekend_discussion_thread_for_the_weekend_of/g2f14jf/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598103598.0
    },
    {
        "author": "DerTagestrinker",
        "body": "Professor in this Darden video is explaining what the S&amp;P 500 is and he says it's made up of the 500 largest companies in the US like GM, IBM then goes \"it probably wouldn't have Tesla in there\" and laughs\n\nThe video is max two years old",
        "created_utc": 1597889478,
        "id": "g2666zs",
        "permalink": "/r/wallstreetbets/comments/icv9yx/what_are_your_moves_tomorrow_august_20_2020/g2666zs/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597918278.0
    },
    {
        "author": "Vast_Cricket",
        "body": "For years IBM had tried to replace its hard drive with other technologies. When I say years it is like 1970s era and on. The data storage cost is still way more affordable than SSD. Although both look free with file sharing storage companies offering so much storage for free.",
        "created_utc": 1597685035,
        "id": "g1vuo10",
        "permalink": "/r/stocks/comments/ibgp1r/western_digital_micron_and_the_immense_promise_of/g1vuo10/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1597713835.0
    },
    {
        "author": "Tetkobear",
        "body": "Even though I’m in all red today, feeling good about my new line up (all calls, out to 2021): AMZN, AAPL, FB (just doubled down), TGT, IBM (artificial intelligence driven), PTON, and a little BABA and ORCL for gambling.",
        "created_utc": 1597864018,
        "id": "g24s95v",
        "permalink": "/r/wallstreetbets/comments/ickxce/daily_discussion_thread_for_august_19_2020/g24s95v/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597892818.0
    },
    {
        "author": "Power80770M",
        "body": "[It has always been this way] (https://www.stlouistrust.com/why-most-stocks-underperform-index/#:~:text=The%20positive%20skew%20of%20stock,distribution%20of%20returns%20over%20time.):\n\n\n* The mean annual return of all stocks between 1926 and 2016 was 14.74%, while the median was a mere 5.23%. That is a HUGE difference.\n\n* Over half the stocks delivered negative returns during their lifetimes.\nOnly 42% outperformed the 3-month Treasury Bill.\n\n* Just five stocks (Exxon, Apple, Microsoft, GE and IBM) account for 10% of all wealth created by the stock market between 1926 and 2016.\n\n* Just 4% of all stocks accounted for **all the wealth** created by the stock market from 1926 and 2016.\n\n* A similar study of data from a shorter time period, 1989 through 2015, found like results: a very large positive skew where just 20% of the stocks produced all the return, over 50% of the stocks underperformed cash and 40% of the stocks provided a negative return.",
        "created_utc": 1597949903,
        "id": "g28qxip",
        "permalink": "/r/wallstreetbets/comments/idbh7m/2020_from_bust_to_boom_in_60_seconds_bubble_chart/g28qxip/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597978703.0
    },
    {
        "author": "radioref",
        "body": "Let me tell you something. If you are buying and making fucking stock derivatives trades and you don’t know how a stock split works you better close out those positions and fucking buy 4 shares of IBM and 6 shares of Ford and go to bed.\n\nJesus fucking Christ people.",
        "created_utc": 1596321990,
        "id": "g014ib4",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g014ib4/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596350790.0
    },
    {
        "author": "Ethericl",
        "body": "Its like Major League Baseball vs T-ball\n\nAMD NVDA AAPL vs IBM INTC \n\nYou know who's gonna win, I think INTC will death spiral slowly but surely",
        "created_utc": 1596412463,
        "id": "g05n1am",
        "permalink": "/r/wallstreetbets/comments/i2mdg8/anyone_placing_calls_on_intel/g05n1am/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596441263.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "Are people just blindly buying the dip on ORCL? There is no way they end up buying TikTok. Their cloud infrastructure also sucks.  \n  \nSource: have used some of their services. By personal experience, I would rank from best to worst: AWS, GCP, Azure, OCI, IBM Cloud  \n  \nORCL 55P 9/18",
        "created_utc": 1597857087,
        "id": "g24d1a3",
        "permalink": "/r/wallstreetbets/comments/ickxce/daily_discussion_thread_for_august_19_2020/g24d1a3/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1597885887.0
    },
    {
        "author": "dpetropo",
        "body": "I worked at IBM for 2 years, those boomers would have absolutely no fucking clue what to do with TikTok.",
        "created_utc": 1596300024,
        "id": "fzzy3fi",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzzy3fi/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596328824.0
    },
    {
        "author": "Dmoan",
        "body": "Got downvoted early morning when I said that intc will be back at 49 because no one falls for ibm buy back strategy any more.",
        "created_utc": 1597946263,
        "id": "g28iqqi",
        "permalink": "/r/wallstreetbets/comments/id7lxj/daily_discussion_thread_for_august_20_2020/g28iqqi/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1597975063.0
    },
    {
        "author": "teegolf1",
        "body": "No individual stock is set and forget forever. GE was a hundred year-old diversified giant that looked unstoppable in the 1970s-1990s. Now look it. GM, Ford, IBM, the list goes on and on. Don’t think it couldn’t happen to today’s favorites. Amazon and Google could be broken up by the government just like AT&amp;T was. Apple could lose its dominance with just a few bad products.    Diversification through mutual funds or a minimum of 25 stocks from various sectors is the way to go.",
        "created_utc": 1596925700,
        "id": "g0u06ap",
        "permalink": "/r/stocks/comments/i5z15f/is_buying_5_stocks_of_a_bluechip_company_like_dis/g0u06ap/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1596954500.0
    },
    {
        "author": "Wearahat02",
        "body": "INTC reminds me of GE/IBM.\nIBM never disappeared, but they stopped being one of the highlights of the market to a company that just exists in a stagnant and slow decline state.\nBut INTC doesn't have the luxury to slowly decline in their sector so their stock price if they don't turn things around will look more like GE than IBM.\nEven if they do turn things around, their profits of today reflects the fact that they have bulk of market share already, so even if they do regain the title permanently their PE might go up from 9 to 15, so betting on a turnaround that happens doesn't yield huge rewards.",
        "created_utc": 1596571893,
        "id": "g0dbhx7",
        "permalink": "/r/stocks/comments/i3nn77/thoughts_on_intel/g0dbhx7/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1596600693.0
    },
    {
        "author": "LovableContrarian",
        "body": "I wonder if people said that when IBM had little dips in the 80s.",
        "created_utc": 1596308333,
        "id": "g00fdpu",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g00fdpu/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596337133.0
    },
    {
        "author": "crel42",
        "body": "You’d think this sub was full of retards until you read the shit some idiots write on StockTwits... “MSFT,AAPL,AMZN,GOOGL, bearish on all of them, sell now they will all go into a correction sooner or later”. \nYeah, no shit sherlock. Go deal with your GE, IBM stocks, dumbass.",
        "created_utc": 1597964578,
        "id": "g29nsvq",
        "permalink": "/r/wallstreetbets/comments/idhs5y/what_are_your_moves_tomorrow_august_21_2020/g29nsvq/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1597993378.0
    },
    {
        "author": "Japappelflap",
        "body": "Genomics (treatment (CRISPR) and testing(Invitae))\ngreen energy(next era, tesla)\nCloud/quantum computing(msft,amazon, Google and maybe IBM) \nselfdriving taxi network and transportation(tesla, Amazon) \ndigital payments/wallet(Square,Adyen, facebook, google and Apple) \nRobotica and AI (google, boston dynamics and nvidia)\nchips, mainly ARM (arm, tsmc, nvidia)\nAR/VR ( facebook and Apple)\n\nMy top picks are tesla, invitae and Apple",
        "created_utc": 1597421273,
        "id": "g1gdces",
        "permalink": "/r/investing/comments/i9ob2z/what_sector_do_you_think_will_be_the_next_to/g1gdces/",
        "score": 4,
        "subreddit": "investing",
        "created": 1597450073.0
    },
    {
        "author": "ichbintrash",
        "body": "all these posts bout intl reminds me of ibm 16,  \"wow what a dip, market overreaction, itll hit a new ath withhin this yr its tech, dont bet against big blue\"\n\n4 years l8r, n that garbage is nowhere near where they used to be",
        "created_utc": 1596413773,
        "id": "g05p9ty",
        "permalink": "/r/wallstreetbets/comments/i2mdg8/anyone_placing_calls_on_intel/g05p9ty/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596442573.0
    },
    {
        "author": "Dmoan",
        "body": "People always point out to Microsoft anti trust ruling and say Washington might do similar things against Apple. But situation is far different:\n\nThere were multiple companies lobbying against Microsoft (Oracle, Ibm etc ) in 00s where as not many stand against Apple now. While Microsoft ironically has now raised concern about App Store it is not willing to fight in Washington over it.\n\nBill gates was known to be not willing to engage in aggressive lobbying, unlike Apple which throws millions\n\nMicrosoft wasn’t well liked by Washington or general populace unlike Apple\n\nWashington is far more pro big business and cares less about competition or consumers now, when compared to 00s especially after dot com bubble.\n\nSo end of day nothing will happen to Apple and stock market knows it",
        "created_utc": 1598214300,
        "id": "g2mcv5q",
        "permalink": "/r/wallstreetbets/comments/ifa72q/what_are_your_moves_tomorrow_august_24_2020/g2mcv5q/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598243100.0
    },
    {
        "author": "yachtking1",
        "body": "IBM",
        "created_utc": 1596410776,
        "id": "g05k6v3",
        "permalink": "/r/wallstreetbets/comments/i2iqcm/what_are_your_moves_tomorrow_august_03_2020/g05k6v3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596439576.0
    },
    {
        "author": "Indigeridoo",
        "body": "The top 10 stocks are literally always worth about 20% of the overall market, it's not new. Look at IBM in the 60's.",
        "created_utc": 1597799588,
        "id": "g21y4aw",
        "permalink": "/r/wallstreetbets/comments/icajvq/the_10_largest_stocks_in_the_sp_are_worth_more/g21y4aw/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597828388.0
    },
    {
        "author": "greg24211",
        "body": "hello GE and IBM",
        "created_utc": 1598317526,
        "id": "g2r4rdg",
        "permalink": "/r/stocks/comments/ifzhpi/is_intel_a_good_buy_right_now/g2r4rdg/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1598346326.0
    },
    {
        "author": "vvvvfl",
        "body": "&gt;Also being a pioneer in RISC desktop/laptop computing... I mean, I think this is not really talked about as much as the 5G iPhone 12 hype.\n\nI mean,  you do know that Apple used RISC IBM PowerPCs up until..2006 ?",
        "created_utc": 1598379799,
        "id": "g2tsgnt",
        "permalink": "/r/wallstreetbets/comments/igg23t/is_apple_silicon_even_remotely_priced_in/g2tsgnt/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598408599.0
    },
    {
        "author": "lucun",
        "body": "I've always considered Cloudflare a networking/CDN company. The big 4 US cloud providers provides what Cloudflare offers (CDN, networking) along with a lot of other compute/data capabilities. However, Cloudflare's networking/CDNs are great value for small customers. Cloudflare integrates well with all 4 major US cloud providers, which helps get a few bigger customers who are in enterprise cloud. I would consider Akamai a more direct competitor to Cloudflare.\n\nThe Cloudflare serverless offering is new to me and sounds interesting, but AWS/Azure/GCP/IBM serverless integrates with numerous other AWS/Azure/GCP/IBM services. Not everything can run well in a serverless configuration. This will be a disadvantage to Cloudflare's serverless in attracting any big enterprises. However, again, smaller customers may want a simplified experience and go with Cloudflare over the very feature rich cloud offerings of the big 4. Also, I'd bet Cloudflare's serverless would be cheaper as well.\n\nBasically, Cloudflare won't be getting much of the big lucrative enterprise contracts that the Big 4 have, and their only real moat is the better value they give to customers who only need their small set of services. And there's a lot of small businesses out there that need what Cloudflare offers.\n\nDisclosure: I own shares of IBM/AMZN/MSFT",
        "created_utc": 1597295095,
        "id": "g1aqacu",
        "permalink": "/r/investing/comments/i8fz31/cloudflare_net_could_get_really_big_or_im_missing/g1aqacu/",
        "score": 3,
        "subreddit": "investing",
        "created": 1597323895.0
    },
    {
        "author": "trader9899",
        "body": "I understand adding gold but why drop Jpm and gs and then adding BAC and who the fuck invest in ibm.",
        "created_utc": 1597698125,
        "id": "g1wsist",
        "permalink": "/r/wallstreetbets/comments/ibkabh/saudi_arabias_wealth_fund_exits_boeing_facebook/g1wsist/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597726925.0
    },
    {
        "author": "VeryStableGenius",
        "body": "&gt; I mean left behind like GE.\n\nYes, GE failed.     So did pets.com.   One doesn't invest in a single dividend yielding stock, but in a basket of a dozen or two.    A couple will go under like GE.  A couple will go up, up, up until the dividend yield is low and one trades them in for something cheaper with a higher yield.\n\n&gt; Like IBM. \n\nOh, and IBM is paying 5.22% at a PE of 14.  Nice!  I'd put some of this one on my mom's portfolio.",
        "created_utc": 1597953807,
        "id": "g290dj5",
        "permalink": "/r/investing/comments/idfnvm/whats_the_point_of_dividend_investing/g290dj5/",
        "score": 3,
        "subreddit": "investing",
        "created": 1597982607.0
    },
    {
        "author": "Dmoan",
        "body": "That’s bad news overall for a tech company that’s lagging they have given on competing and simply pulling an ibm maneuver",
        "created_utc": 1597872098,
        "id": "g259j9i",
        "permalink": "/r/wallstreetbets/comments/icv9yx/what_are_your_moves_tomorrow_august_20_2020/g259j9i/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597900898.0
    },
    {
        "author": "M1NDSW1TCH",
        "body": "This article caught my eye last week, I think it's relevant.\n\nBusinesses are accelerating their tech investment timelines, IBM Canada head says:\n\n [https://financialpost.com/news/businesses-are-accelerating-their-tech-investment-timelines-ibm-canada-head-says](https://financialpost.com/news/businesses-are-accelerating-their-tech-investment-timelines-ibm-canada-head-says) \n\n(I'm long)",
        "created_utc": 1596565045,
        "id": "g0ct0lm",
        "permalink": "/r/CanadianInvestor/comments/i3krc7/thoughts_on_cts/g0ct0lm/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1596593845.0
    },
    {
        "author": "t33po",
        "body": "If, huge **IF**, the Tik Tok thing isn't settled by monday open, I'm getting some itm IBM calls. 1. Their cloud services could use a headline grabbing client - higher offer. 2. Boomers love some old school blue chips - regulatory approval could get fastracked without the anti-trust blah blah. 3. On the 1% chance it happens, it will pop way more than MSFT- already a $1.5T company.\n\nWorst case, it stays flat as usual and I'm out a couple hundred in two weeks. Pure speculation on Trump's big tech hate and boomer nostalgia.",
        "created_utc": 1596299756,
        "id": "fzzxko2",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzzxko2/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596328556.0
    },
    {
        "author": "HinduHamma",
        "body": "Ya tell micron how well a 10b buyback program works for their stock price \n\nBuncha fucking bums. Buying and holding nvda at this price is still gonna beat holding intel . By a fucking mile\n\nIntel can absolutely turn into the next IBM type. Safe and steady but nothing special happening with their growth going forward.",
        "created_utc": 1598124219,
        "id": "g2iated",
        "permalink": "/r/wallstreetbets/comments/ieni32/intel_on_intel_my_dd/g2iated/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598153019.0
    },
    {
        "author": "devodid",
        "body": "Next week: IBM in talks to buy tiktok",
        "created_utc": 1597721287,
        "id": "g1y20je",
        "permalink": "/r/wallstreetbets/comments/iblrnn/what_are_your_moves_tomorrow_august_18_2020/g1y20je/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597750087.0
    },
    {
        "author": "jeffdidntkillhimslf",
        "body": "What does IBM even do anymore?",
        "created_utc": 1598196077,
        "id": "g2lbb4j",
        "permalink": "/r/wallstreetbets/comments/ie47ug/weekend_discussion_thread_for_the_weekend_of/g2lbb4j/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598224877.0
    },
    {
        "author": "AnonZeit",
        "body": "Fastly: TikTok and video delivery of cheap ads.\n\nNET: Azure, IBM, Google Cloud and Wordpress",
        "created_utc": 1596749135,
        "id": "g0lwy09",
        "permalink": "/r/wallstreetbets/comments/i4z4q7/what_are_your_moves_tomorrow_august_07_2020/g0lwy09/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596777935.0
    },
    {
        "author": "infinitelimits00",
        "body": "Yea boomers are in shambles.\n\nIntel, Boeing, Cisco, ..., IBM is next.",
        "created_utc": 1597264246,
        "id": "g194w6i",
        "permalink": "/r/wallstreetbets/comments/i8l3ny/what_are_your_moves_tomorrow_august_13_2020/g194w6i/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597293046.0
    },
    {
        "author": "jpowpump",
        "body": "once nvidia starts partnering with the big autos its over. it will be the microsoft taking a shit on ibm moment",
        "created_utc": 1597437487,
        "id": "g1hdtxa",
        "permalink": "/r/wallstreetbets/comments/i9t8hn/weekend_discussion_thread_for_the_weekend_of/g1hdtxa/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597466287.0
    },
    {
        "author": "Hadin_gar_Kan",
        "body": "Kudlo perhaps lets it slip that IBM is interested in tiktok. Or hes been doing dick-dingers. \\~0:29\n\n [https://www.youtube.com/watch?v=LlPtqc-SsgQ](https://www.youtube.com/watch?v=LlPtqc-SsgQ)",
        "created_utc": 1596568160,
        "id": "g0d19dk",
        "permalink": "/r/wallstreetbets/comments/i3gpgo/daily_discussion_thread_for_august_04_2020/g0d19dk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596596960.0
    },
    {
        "author": "thegoldstandard55",
        "body": "Kodak, IBM, Xerox, HP, GE",
        "created_utc": 1596509292,
        "id": "g0acnyk",
        "permalink": "/r/wallstreetbets/comments/i34g5h/what_are_your_moves_tomorrow_august_04_2020/g0acnyk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596538092.0
    },
    {
        "author": "trader9899",
        "body": "You can put airline. Com reit. Hotel. Bullshit legacy tech like ibm/oracle. But no you want to bet against meme stock",
        "created_utc": 1596777669,
        "id": "g0n9qq6",
        "permalink": "/r/wallstreetbets/comments/i56ss3/amzn_fb_puts/g0n9qq6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596806469.0
    },
    {
        "author": "Blackops_21",
        "body": "The leading chip manufacturer in the world was unable to figure out how to make the latest tech, while their competitor did years before them. That's market share they may never get back. IBM all over again.",
        "created_utc": 1598398372,
        "id": "g2utekw",
        "permalink": "/r/RobinHood/comments/igddx7/do_any_of_you_invest_based_on_balance_sheet_pe/g2utekw/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1598427172.0
    },
    {
        "author": "Barracuda_Blue",
        "body": "IBM got dementia and is going in a different direction than everyone else.\n\nJust let her go...",
        "created_utc": 1596820540,
        "id": "g0p7mw5",
        "permalink": "/r/wallstreetbets/comments/i5b9o9/daily_discussion_thread_for_august_07_2020/g0p7mw5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596849340.0
    },
    {
        "author": "closingbell",
        "body": "&gt; The truth is, they are a powerful player in tech trading at a massive discount. \n\nRight - just like CSCO &amp; IBM...aka dead money for years.",
        "created_utc": 1596919511,
        "id": "g0tonrh",
        "permalink": "/r/investing/comments/i62pil/intel_ceo_bought_400k_of_intel_stock_upcoming/g0tonrh/",
        "score": 2,
        "subreddit": "investing",
        "created": 1596948311.0
    },
    {
        "author": "Dmoan",
        "body": "What is happening to Intel is similar to what happened to ibm they are slowing losing ground but only their decline will be fast as vendors abandon their chips for AMD. Apple is already moving on.",
        "created_utc": 1597873243,
        "id": "g25btz4",
        "permalink": "/r/wallstreetbets/comments/icv9yx/what_are_your_moves_tomorrow_august_20_2020/g25btz4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597902043.0
    },
    {
        "author": "kickace",
        "body": "IBM uses it as well.",
        "created_utc": 1598219052,
        "id": "g2mma01",
        "permalink": "/r/wallstreetbets/comments/ifbqta/slack_work_unfairly_punished_by_teams/g2mma01/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598247852.0
    },
    {
        "author": "-nye-",
        "body": "Idk man I’m into intel and it’s the same thing. I believe in them but they’re not going parabolic like the meme techs. Like why would people park their money in IBM when they could be riding the AAPL train. Only hope is when tech slumps people go back to the “value” techs",
        "created_utc": 1598203161,
        "id": "g2lqgv9",
        "permalink": "/r/wallstreetbets/comments/ie47ug/weekend_discussion_thread_for_the_weekend_of/g2lqgv9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598231961.0
    },
    {
        "author": "The_Texidian",
        "body": "The problem is with you trying to over complicate my question. \n\n\nI’m just asking for trivia, which company has the highest annual dividend. I cited that IBM pays out $6.52 a year with its current dividend. \n\n\nI’m not asking for yield, I’m not asking for stock picks, I’m not asking about fractional shares or dividend growth. My question is quite simple. \n\n\nMy question is in different words: If I were to buy 1 share of 1 company at ANY price, which 1 share will pay me the most in 1 year.",
        "created_utc": 1598229529,
        "id": "g2n5qhs",
        "permalink": "/r/stocks/comments/ifd8y2/what_stock_pays_the_highest_dividend/g2n5qhs/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598258329.0
    },
    {
        "author": "tyrryt",
        "body": "There are always the true believer zealots, wailing about all the fundamentals and \"new paradigms\" and how, of course, \"this time it's different\".  \n\nIBM was going to corner the market on computers, CSCO was going to corner the market on routers, pets.com was going to corner the market on pet food, (unnameable virtual currency) was going to corner the market for dollar alternatives, etc., etc.  There are hundreds of names in the past few decades alone.\n\nAll of them \"cornered the market\", all of them were touted to hell and back by the true believers, with endless lists of reasons that this time it's different, all of them went parabolic, and all of them collapsed 70-90%.",
        "created_utc": 1598027895,
        "id": "g2ca3oc",
        "permalink": "/r/wallstreetbets/comments/idwp2h/tesla_market_cap_is_now_higher_than_walmart/g2ca3oc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598056695.0
    },
    {
        "author": "HinduHamma",
        "body": "Except reasonably priced is not some universal definition. Just because you don’t like to pay that premium doesn’t mean it’s doesn’t have other willing buyers. And go ahead and believe you are smarter than them. \n\nGo ahead and buy those cheap low PE stocks or value defensive picks. But they aren’t treated with a nice big multiple for a reason. They don’t deserve to be “overvalued” or hyped. \n\nFord and GM look cheap right! IBM, GE? Cisco. Banks. Ya I’ll pass. They are cheaper for a reason. Weak fundamentals and growth.",
        "created_utc": 1598303579,
        "id": "g2qedts",
        "permalink": "/r/investing/comments/ifwuvm/robert_schillers_pe_discussion/g2qedts/",
        "score": 2,
        "subreddit": "investing",
        "created": 1598332379.0
    },
    {
        "author": "bitcoinchamps",
        "body": "Got my eye on $IBM, they pay a good dividend as well.",
        "created_utc": 1597670545,
        "id": "g1uqej1",
        "permalink": "/r/investing/comments/ibdszj/stocks_making_the_biggest_moves_premarket/g1uqej1/",
        "score": 2,
        "subreddit": "investing",
        "created": 1597699345.0
    },
    {
        "author": "TaxWizard69",
        "body": "IBM is just an extreme example of a fallen tech giant. They've had terrible management for decades and did every short-termists decision possible to meet EPS estimates. If Steve Ballmer was IBM's CEO I might believe he was one of their better CEOs in history. Today's big tech are just really well managed companies with CEOs/founders who are well connected with its employees and their consumer markets. They all have strong ecosystems around their products, amazing balance sheets, and a long-term approach to a lot of their projects. It's a big extreme from IBM. It comes with a lot of scrutiny since these companies have to be really cutthroat and aggressive against competitors but it's a big learning lesson from IBM.",
        "created_utc": 1596391873,
        "id": "g04jhu9",
        "permalink": "/r/investing/comments/i2ba5z/investing_in_apple_for_the_next_10_years/g04jhu9/",
        "score": 2,
        "subreddit": "investing",
        "created": 1596420673.0
    },
    {
        "author": "TerrestrialPlanet",
        "body": "&gt; What companies do you think this could be applied to? \n\nIf you are into dividends stocks, you may check out \"dogs of the dow\" --  [https://en.wikipedia.org/wiki/Dogs\\_of\\_the\\_Dow](https://en.wikipedia.org/wiki/Dogs_of_the_Dow) \n\n&amp;#x200B;\n\n1. DOW\n2. XOM\n3. IBM\n4. VZ\n5. CVX\n6. PFE\n7. MMM\n8. WBA\n9. CSCO\n10. KO",
        "created_utc": 1596611455,
        "id": "g0f5wup",
        "permalink": "/r/options/comments/i3d90o/suggestion_needed_selling_covered_calls_on_a/g0f5wup/",
        "score": 2,
        "subreddit": "options",
        "created": 1596640255.0
    },
    {
        "author": "UABeeezy",
        "body": "Pretty sure tiktok is worth more than IBM. Not gonna happen",
        "created_utc": 1596299919,
        "id": "fzzxw0j",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzzxw0j/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596328719.0
    },
    {
        "author": "svgscrewball",
        "body": "1st I said reddit for testing, Then there is \n\nhttps://www.featuredcustomers.com/vendor/cloudflare/customers/reddit\n\n\nhttps://www.featuredcustomers.com/vendor/cloudflare/customers/shopify\n\n\nThen there is this  [\"Cloudflare’s relationship with the giants of the tech world could play a major role in determining its future. Amazon (AMZN), Alphabet (GOOGL), Microsoft (MSFT), and IBM (IBM) all have major cloud platforms, and all but AMZN currently partner with Cloudflare. Google Cloud, Microsoft Azure, and IBM Cloud integrate Cloudflare into their platforms to deliver its services to their customers.\"](https://www.forbes.com/sites/greatspeculations/2019/09/12/what-investors-need-to-know-about-the-cloudflare-net-ipo/#64b28e283d8e)\n\nEDIT: But many will be competitors going forward\n\nEDIT: Still like their chart better",
        "created_utc": 1597202069,
        "id": "g16dxml",
        "permalink": "/r/stocks/comments/i7pwzj/which_stock_cloudflare_fastly_zscaler_or_twillo/g16dxml/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1597230869.0
    },
    {
        "author": "Amerlis",
        "body": "Same reason IBM is still around and Oracle. \nEnterprise. Otherwise known as the “if it ain’t broke we ain’t changing shit, and if it is broke we buy more of the same shit”. \n\nMicrosoft might fall in and out of being cool or even the hot topic of conversation, but they about as defensive without going full boomer.",
        "created_utc": 1597248748,
        "id": "g185wj7",
        "permalink": "/r/wallstreetbets/comments/i8b56i/daily_discussion_thread_for_august_12_2020/g185wj7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597277548.0
    },
    {
        "author": "Darkmarth32",
        "body": "You are vastly underestimating the performance of AMDs CPU, the instructions per clock which is the measure of performance independent of clock speed is actually better for most instructions on AMDs new CPUs, in the future when TSMC hits the wall on size. The shift will move to more architectural improvements like chiplets, as well as pushing higher clock speeds similar to Intel's 14nm++++.\n\nAll that sad I do agree that Intel will be ok, but I could see them sort of leveling out, similar to an IBM.",
        "created_utc": 1597200249,
        "id": "g16aq6c",
        "permalink": "/r/wallstreetbets/comments/i822hx/intc_in_a_nutshell/g16aq6c/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597229049.0
    },
    {
        "author": "CptTonyStark",
        "body": "In 1963, IBM and Xerox had high P/E ratios of 38.5 and 25 respectively. By 1969, these increased to 44.4 and 50.8, even as the overall P/E ratio declined from 18.6 to 14.",
        "created_utc": 1596778720,
        "id": "g0nb3ru",
        "permalink": "/r/wallstreetbets/comments/i4z4q7/what_are_your_moves_tomorrow_august_07_2020/g0nb3ru/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596807520.0
    },
    {
        "author": "bloatedkat",
        "body": "Next headline: \"IBM in talks to buy TikTok\"\n\nThe companies looking for a piece of TikTok just keeps getting more and more antiquated.",
        "created_utc": 1597727063,
        "id": "g1yaqn4",
        "permalink": "/r/wallstreetbets/comments/ibtun4/oracle_in_talks_to_buy_tiktoks_us_business_whats/g1yaqn4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597755863.0
    },
    {
        "author": "AnalSepage",
        "body": "33/33/33 IBM/GE/F = perfect portfolio",
        "created_utc": 1597851354,
        "id": "g240ywg",
        "permalink": "/r/wallstreetbets/comments/ickxce/daily_discussion_thread_for_august_19_2020/g240ywg/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597880154.0
    },
    {
        "author": "anticounter",
        "body": "I'm just a casual, but here's my broad take.. The industry is broadly categorized between semiconductors (71 listed companies) and semiconductor equipment (ie making the machines used to make the chips, 38 listed companies). It covers a wide range of technologies-- analog chips, processors, network equipment, LEDs, etc.-- and generally companies need to have their niche in the global supply chain in order to have an advantage. This is because the supply chain from silicon wafer to finished product is too complex to completely vertically integrated. You can't be a foundry, equipment designer/maker, and chip designer/maker all at the same time efficiently. Also, your equipment maker can also potentially sell the manufacturing equipment to your competitors. In fact, many offer \"turn key\" solutions-- just give us the cash and the space, and we'll set up the whole factory for you! So the companies that do well tend to have (or had) an exceptional R&amp;D performance/expenditures to differentiate (AMD, NVDA, TSM today; INTC and IBM in the past). That also makes it a difficult business to maintain an advantage in, since sometimes you just run into an R&amp;D problem and no matter how much money you throw at it the engineers just can't come up with a workable solution (eg INTC).",
        "created_utc": 1598106647,
        "id": "g2h1h60",
        "permalink": "/r/investing/comments/iei292/semiconductors/g2h1h60/",
        "score": 2,
        "subreddit": "investing",
        "created": 1598135447.0
    },
    {
        "author": "programmingguy",
        "body": "If you are looking at just the dividend, ok. But I don't see IBM as a long term hold...the mainframe behemoth just slogs and tries to reinvent itself. They have some potential on the enterprise cloud space and as large organizations migrate from legacy systems hope for increased recurring revenues through vendor lock-in but there's a lot of competition in that space and they are so large to have that make a significant impact. I bought IBM under 100 during the pandemic as a safety play since they have a lot of cash and enough service contracts to maintain a lot of cashflow during uncertain times but I'll be selling them at 140. I don't see IBM as a growth play.",
        "created_utc": 1597674163,
        "id": "g1uziga",
        "permalink": "/r/investing/comments/ibdszj/stocks_making_the_biggest_moves_premarket/g1uziga/",
        "score": 2,
        "subreddit": "investing",
        "created": 1597702963.0
    },
    {
        "author": "an27725",
        "body": "so is this going to be another IBM and HP type where they fail to compete with newer players, especially AWS and such?",
        "created_utc": 1597694388,
        "id": "g1wh3yg",
        "permalink": "/r/wallstreetbets/comments/iblhni/vmw_buy_the_last_value_unicorn/g1wh3yg/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597723188.0
    },
    {
        "author": "sumane12",
        "body": "IBM is a stock I considered doing this strategy with",
        "created_utc": 1596523929,
        "id": "g0ax4bw",
        "permalink": "/r/options/comments/i3d90o/suggestion_needed_selling_covered_calls_on_a/g0ax4bw/",
        "score": 2,
        "subreddit": "options",
        "created": 1596552729.0
    },
    {
        "author": "Charizard_gets_tail",
        "body": "Average analyst upside forecast according to Capital IQ: 74%. I read some of the analyst reports and that original post and liked the sound of the company, bought some a few weeks ago. In particular they seem to have high certification levels for a reseller:\n\n\"The company attained the highest possible certification with Microsoft and Cisco. With Dell the company has the highest certification in Canada and is close to achieving the highest in North America. As the second largest partner to IBM, Converge is positioned well to become a strategic reseller of Red Hat solutions; we note that Red Hat is moving from 15% of channel sales through partners such as Converge towards 60%. Recently, CRN®, a brand of The Channel Company (private), ranked Converge within the top 50 on its 2020 Solution Provider 500 list.\"",
        "created_utc": 1596563077,
        "id": "g0cny5x",
        "permalink": "/r/CanadianInvestor/comments/i3krc7/thoughts_on_cts/g0cny5x/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1596591877.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM, INTC, CSCO\n\nLol",
        "created_utc": 1597673160,
        "id": "g1uwx5q",
        "permalink": "/r/wallstreetbets/comments/ibbhcu/daily_discussion_thread_for_august_17_2020/g1uwx5q/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597701960.0
    },
    {
        "author": "Vast_Cricket",
        "body": "*They have fewer competitors.* It has *not* generated a lot of income. Yahoo financial, Zacks, Schwab and other analysts predict *short term, intermediate term being flat(red*), while long term being good(green). Some gave C, even F ratings.  I acquired a small position on the basis it could get sold to a bigger player like IBM, Oracle.  I *do not hesitate to liquidate* if the performance stays at this level by 2021.\n\nTo answer like commentaries, reviews posted here. I suggest you do your own analysis. There were way many posts why L\\_ K  co ff ee,  buy out  ru mors will be great buy.  The stocks lost much market capitalization and a few are behind bars.",
        "created_utc": 1597803654,
        "id": "g225mw5",
        "permalink": "/r/stocks/comments/icc4xd/why_do_people_seem_to_like_net_so_much/g225mw5/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1597832454.0
    },
    {
        "author": "callerids",
        "body": "If net sales, which is the lifeblood of the firm, increases by 7.2%, then operating income will typically follow a similar increase. To really get to the bottom of this question, one would need to analyze the cost structure of the company in previous quarters and what changes led to such an outsized improvement.\n\nWhen operating income shows a sizeable increase, then this implies that the company was able to reduce their costs to such an extent that for every extra dollar of revenue IBM was (somehow!) able to squeeze 3.2x more earnings compared to previous quarters. \n\nThe growth in sales is not a cap per se on operating income growth, but any mismatches are generally a flag to \"dig deeper\".",
        "created_utc": 1597859434,
        "id": "g24i23g",
        "permalink": "/r/SecurityAnalysis/comments/i7x9v4/2h_2020_security_analysis_questions_and/g24i23g/",
        "score": 2,
        "subreddit": "SecurityAnalysis",
        "created": 1597888234.0
    },
    {
        "author": "-nye-",
        "body": "IBM",
        "created_utc": 1598201364,
        "id": "g2lmovc",
        "permalink": "/r/wallstreetbets/comments/ie47ug/weekend_discussion_thread_for_the_weekend_of/g2lmovc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598230164.0
    },
    {
        "author": "undecidedmarketmaker",
        "body": "INTC is going down the IBM/Oracle route, do not recommend",
        "created_utc": 1597420879,
        "id": "g1gci2m",
        "permalink": "/r/wallstreetbets/comments/i9jdiq/daily_discussion_thread_for_august_14_2020/g1gci2m/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597449679.0
    },
    {
        "author": "Dr_Ne0n_Fleshbiscuit",
        "body": "When I first started investing almost 30 years ago right out of college,  I put every other paycheck into mutual funds. After awhile I figured I could do at least as well as the meager returns they were earning, read the classic One Up On Wall Street, and decided to use my professional knowledge of the computer industry to guide my investments. This has worked incredibly well.\n\nI was an early investor in AAPL, ADBE, AMZN, UI, TWLO, TSLA. And in companies that are gone due to acquisitions: Macromedia, Pixar. Others I rode up and sold off long ago when they lost their luster: IBM, Nokia. Many others.\n\nMy best results have always been from playing the long game buying companies with outstanding and unique offerings, when they were not well-known, hard to explain, unfairly maligned, or otherwise undervalued. They don't come along very often.\n\nInvestment funds can provide a decent return, by soothsaying financials, news, and trends, and you probably won't lose money in a well-managed fund.\n\nHowever, if you have specialized knowledge, you can do incredibly well. It's a hobby that can lead to wealth, but if you're not interested in following the markets, decent is the safe bet.",
        "created_utc": 1597424620,
        "id": "g1gkvy0",
        "permalink": "/r/investing/comments/i93vg0/i_paid_1000_for_an_adam_khoo_investing_course_so/g1gkvy0/",
        "score": 2,
        "subreddit": "investing",
        "created": 1597453420.0
    },
    {
        "author": "GamblingMikkee",
        "body": "GE, XOM, F, IBM &gt; MSFT, NFLX",
        "created_utc": 1597087109,
        "id": "g10uomt",
        "permalink": "/r/wallstreetbets/comments/i751vc/daily_discussion_thread_for_august_10_2020/g10uomt/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597115909.0
    },
    {
        "author": "Space_Lord_MF",
        "body": "Ill translate for you since I do stocks. He basically said 30% of his stocks are Delta Airlines. He is planning to buy 10 to 16 shares of IBM and hope they go up 30 to 50 cents a share looking to make $8 total. He's also a swinger (probably just watches his gf with other dudes tho)who is buying $3.05 and $3.45 worth of fractional shares of intel and a PIMCO ETF.\n\nHope this helps you understand.",
        "created_utc": 1597097560,
        "id": "g11g9yl",
        "permalink": "/r/wallstreetbets/comments/i785ws/intel_options/g11g9yl/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597126360.0
    },
    {
        "author": "SugarAdamAli",
        "body": "Ok so,,, everybody used MySpace, AOL, yahoo, blackberry, ibm, xerox, until they didn’t. \n\nYour experience as an intern at 5 places means nothing in the investment world 5 years from now, there is a reason why investors look for moats",
        "created_utc": 1597110669,
        "id": "g124fth",
        "permalink": "/r/stocks/comments/i7d3ob/thoughts_on_docusign_docu/g124fth/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1597139469.0
    },
    {
        "author": "Space_Lord_MF",
        "body": "One of  these always puts out great news constantly and their CEO actually is an engineer.\n\nThe other has bad news constantly, delays, fell 2 years behind, are expected to lose a big chunk their market to fierce competition, and their CEO is a financials guy who ran several companies into the ground.\n\nIntels best case scenario is they become the next IBM. Theyll make $ still but it wont translate to stocks.\n\nNVIDIA is better than both though. They will be huge.",
        "created_utc": 1598031748,
        "id": "g2ciun4",
        "permalink": "/r/stocks/comments/idxqj4/intel_or_amd_which_is_the_better_investment/g2ciun4/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598060548.0
    },
    {
        "author": "solidmussel",
        "body": "On google cloud, Gartner shows them as number 3.  Msft and amzn have top spots by quite a long shot.  But the other players like oracle and IBM are also way behind google.\n\n\nGoogles cloud is still growing fast and becoming a more meaningful piece of their revenue over time",
        "created_utc": 1597982277,
        "id": "g2ajjo5",
        "permalink": "/r/investing/comments/idf7cb/why_is_goog_worth_so_much_less_than_aapl_amzn_msft/g2ajjo5/",
        "score": 2,
        "subreddit": "investing",
        "created": 1598011077.0
    },
    {
        "author": "terryacki",
        "body": "IBM 126 c 8/28 confirmed play",
        "created_utc": 1597689298,
        "id": "g1w3x47",
        "permalink": "/r/wallstreetbets/comments/ibbhcu/daily_discussion_thread_for_august_17_2020/g1w3x47/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597718098.0
    },
    {
        "author": "ornery_panfish",
        "body": "I did this for my wife. Since OP's mom is getting dividend checks, the paperwork should have an account number. That number can be used to register on Computershare.\n\nI set my wife's up so her dividends get re-invested and it costs nothing. It's a shame they weren't set up like that before. She'd have about $8k more worth of stock if her dividends were reinvested from the beginning.\n\nEdit: This was for IBM stock she got from her grandfather when she was born in the early 80s.",
        "created_utc": 1597604826,
        "id": "g1rfkhe",
        "permalink": "/r/investing/comments/iapy5c/ibm_stock_certificates_from_1970s/g1rfkhe/",
        "score": 2,
        "subreddit": "investing",
        "created": 1597633626.0
    },
    {
        "author": "diddycorp",
        "body": "OGs were FDing on IBM",
        "created_utc": 1598410016,
        "id": "g2vehnp",
        "permalink": "/r/wallstreetbets/comments/igjxsn/what_are_your_moves_tomorrow_august_26_2020/g2vehnp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598438816.0
    },
    {
        "author": "DankMemelord25",
        "body": "I won't out a huge amount into it, Ive just been doing some research and I think it's time for IBM to die. Kinda just want to prove my thesis right",
        "created_utc": 1596273380,
        "id": "fzywp2y",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzywp2y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596302180.0
    },
    {
        "author": "ExceptionallyGreat",
        "body": "My view of IBM is very different than yours, I see it as a company that has very deep roots entangling various government sectors around the world. To me it is a company that doesn't want to be the shiny new thing in the public eyes. It want to remain in the background and has solidified it's position for decades in that direction.",
        "created_utc": 1596274180,
        "id": "fzyxfqs",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzyxfqs/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596302980.0
    },
    {
        "author": "Joneric",
        "body": "I started investing 20 years ago. Bought tiny stocks for large potential upside and lost. Learned after frustration to buy stocks I wouldn’t be embarrassed to hold like intel and ibm etc and it pays off slowly. You can make 10% a year and in 10 years it’s pretty substantial.",
        "created_utc": 1596286872,
        "id": "fzzal81",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzzal81/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596315672.0
    },
    {
        "author": "shreyas-t05",
        "body": "They are behind AMD and Nvidia for a while. Next 2-3 years is very crucial, or they will become like IBM.",
        "created_utc": 1596270010,
        "id": "fzytj3z",
        "permalink": "/r/investing/comments/i17f96/nvidia_in_advanced_talks_to_buy_softbanks_chip/fzytj3z/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596298810.0
    },
    {
        "author": "Radiologer",
        "body": "Going long IBM",
        "created_utc": 1596362044,
        "id": "g02r0sy",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g02r0sy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596390844.0
    },
    {
        "author": "roufathome",
        "body": "Regardless of what people say, these companies will do just fine near long term. For those trying to justify the IBM and Nokia case on these companies, things are different today. Innovation is happening constantly. Apple is no more just iphones &amp; macs. Microsoft is no more just windows. If they were, they would surely be in Nokia's position today. \n\nAlso remember the hundreds of billions these companies have in cash. I don't think the fallen tech companies had a similar story.\n\nNonetheless, there might come a time when these companies are no longer driven by innovation/change. Then you know what to do. Remember, it took 3 years for IBM to see any significant decline in stock performance. So, rest assured, you won't see all your savings go down the drain overnight. Review your holdings annually and you'll be doing just fine.",
        "created_utc": 1596375416,
        "id": "g03gf48",
        "permalink": "/r/investing/comments/i2ba5z/investing_in_apple_for_the_next_10_years/g03gf48/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596404216.0
    },
    {
        "author": "Conbad99",
        "body": "Check this out. It is what you are looking for\n\n[https://stockfetcher.com/sf/symcompare2.php?days=60&amp;sym=ibm](https://stockfetcher.com/sf/symcompare2.php?days=60&amp;sym=ibm)",
        "created_utc": 1596340469,
        "id": "g01ymsj",
        "permalink": "/r/stocks/comments/i21zti/finding_corresponding_stock_charts/g01ymsj/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596369269.0
    },
    {
        "author": "smallchimpu",
        "body": "**This car is 25000 $ sir**\n\n\nI only have 20000 $ , anyways give me an hour\n\n\n~buys spy calls~\n\n\nI would like the keys of that 50 Grand one",
        "created_utc": 1596741719,
        "id": "g0lgz3j",
        "permalink": "/r/wallstreetbets/comments/i4p4at/daily_discussion_thread_for_august_06_2020/g0lgz3j/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1596770519.0
    },
    {
        "author": "yaboiRich",
        "body": "A kid welded the teachers car and house keys together. He had a mental breakdown",
        "created_utc": 1596608417,
        "id": "g0f2on7",
        "permalink": "/r/wallstreetbets/comments/i3qotz/what_are_your_moves_tomorrow_august_05_2020/g0f2on7/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596637217.0
    },
    {
        "author": "uaoleksiy",
        "body": "Where you goin? My girl and I just bought a condo in white plains. Signing everything and getting keys this Friday.",
        "created_utc": 1596493219,
        "id": "g09ipm8",
        "permalink": "/r/wallstreetbets/comments/i34g5h/what_are_your_moves_tomorrow_august_04_2020/g09ipm8/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596522019.0
    },
    {
        "author": "menatarms",
        "body": "I know a guy who was working there when it went under but he was fairly mid to low level.  he was in an apartment the  company was renting, and driving a car they had leased to him.  when it all went to shit was told he had a week to move out and return the car.  so he threw an epic party in the apartment, trashed the place, drove the car to the office, parked outside, then dropped the keys to both down a drain and got a taxi to the airport.",
        "created_utc": 1596318516,
        "id": "g00yhfp",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g00yhfp/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596347316.0
    },
    {
        "author": "uaoleksiy",
        "body": "Bought all cash. Wrote a check to the seller’s attorney through my attorney. They asked for proof of funds but then got our cashier’s check and stopped asking shit. Getting keys this Friday.",
        "created_utc": 1596423093,
        "id": "g064rz6",
        "permalink": "/r/wallstreetbets/comments/i2iqcm/what_are_your_moves_tomorrow_august_03_2020/g064rz6/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596451893.0
    },
    {
        "author": "DamianNapo",
        "body": " \"BIO-key recently signed up the municipal government of Durham, North Carolina for [identity management with PortalGuard](https://www.biometricupdate.com/202007/durham-nc-upgrades-security-with-bio-keys-portalguard-iam), which is the seventh partnership agreement since the company picked up PortalGuard in its recent [acquisition of PistolStar](https://www.biometricupdate.com/202007/bio-key-closes-pistolstar-acquisition-and-idex-biometrics-employees-trade-salary-for-stock).\"  \n\n\n [https://www.biometricupdate.com/202008/bio-key-provides-single-sign-on-transaction-security-and-account-recovery-for-credit-card-processor](https://www.biometricupdate.com/202008/bio-key-provides-single-sign-on-transaction-security-and-account-recovery-for-credit-card-processor)",
        "created_utc": 1596757100,
        "id": "g0mc220",
        "permalink": "/r/pennystocks/comments/i51bjm/bkyi_daily_megathread/g0mc220/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1596785900.0
    },
    {
        "author": "Bigchrome",
        "body": "If someone would just blanket pay me $0.575 cent a mile to go drive and I got as much as I wanted, I'd be grabbing my car keys right now.",
        "created_utc": 1596764006,
        "id": "g0mo3ao",
        "permalink": "/r/investing/comments/i4zt61/verge_uber_continues_to_hemorrhage_cash_during/g0mo3ao/",
        "score": 3,
        "subreddit": "investing",
        "created": 1596792806.0
    },
    {
        "author": "MichaelHunt7",
        "body": "Since when does twitch allow you to play full game’s via cloud access? Promo keys and access keys to download games are different.",
        "created_utc": 1596589360,
        "id": "g0eaohq",
        "permalink": "/r/wallstreetbets/comments/i3jxry/msft_buy_the_dip/g0eaohq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596618160.0
    },
    {
        "author": "drjj79",
        "body": "If he fucks the market, better pass the keys of the WH and Melania to Biden already.",
        "created_utc": 1596775062,
        "id": "g0n63dw",
        "permalink": "/r/wallstreetbets/comments/i4z4q7/what_are_your_moves_tomorrow_august_07_2020/g0n63dw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596803862.0
    },
    {
        "author": "somnitendy",
        "body": "Tiktok dance videos are the keys to the multiverse.",
        "created_utc": 1596305275,
        "id": "g008ymb",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g008ymb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596334075.0
    },
    {
        "author": "greenotf",
        "body": "Good point. Will add more detail on my keys to profits.",
        "created_utc": 1596319705,
        "id": "g010kni",
        "permalink": "/r/wallstreetbets/comments/i20qq0/1m_since_precovid_high/g010kni/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596348505.0
    },
    {
        "author": "satireplusplus",
        "body": "User /u/bangorlol reverse engineered this himself, here are the findings:\n\nSo I can personally weigh in on this. I reverse-engineered the app, and feel confident in stating that I have a very strong understanding for how the app operates (or at least operated as of a few months ago).\n\nTikTok is a data collection service that is thinly-veiled as a social network. If there is an API to get information on you, your contacts, or your device... well, they're using it.\n\n* Phone hardware (cpu type, number of course, hardware ids, screen dimensions, dpi, memory usage, disk space, etc)\n\n* Other apps you have installed (I've even seen some I've deleted show up in their analytics payload - maybe using as cached value?)\n\n* Everything network-related (ip, local ip, router mac, your mac, wifi access point name)\n\n* Whether or not you're rooted/jailbroken\n\n* Some variants of the app had GPS pinging enabled at the time, roughly once every 30 seconds - this is enabled by default if you ever location-tag a post IIRC\n\n* They set up a local proxy server on your device for \"transcoding media\", but that can be abused very easily as it has zero authentication\n\nThe scariest part of all of this is that much of the logging they're doing is remotely configurable, and unless you reverse every single one of their native libraries (have fun reading all of that assembly, assuming you can get past their customized fork of OLLVM!!!) and manually inspect every single obfuscated function. They have several different protections in place to prevent you from reversing or debugging the app as well. App behavior changes slightly if they know you're trying to figure out what they're doing. There's also a few snippets of code on the Android version that allows for the downloading of a remote zip file, unzipping it, and executing said binary. There is zero reason a mobile app would need this functionality legitimately.\n\n... Here's the thing though.. they don't want you to know how much information they're collecting on you, and the security implications of all of that data in one place, en masse, are fucking huge. They encrypt all of the analytics requests with an algorithm that changes with every update (at the very least the keys change) just so you can't see what they're doing. They also made it so you cannot use the app at all if you block communication to their analytics host off at the DNS-level.",
        "created_utc": 1596320381,
        "id": "g011qr0",
        "permalink": "/r/wallstreetbets/comments/i1lhrl/trump_says_tik_tok_will_be_banned_as_soon_as/g011qr0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596349181.0
    },
    {
        "author": "please-put-in-trash",
        "body": "You don’t evict you pay for keys",
        "created_utc": 1596321123,
        "id": "g0130u1",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g0130u1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596349923.0
    },
    {
        "author": "FreeSpiritRunning",
        "body": "I started investing when I was 18 pretty much the same way these posts state..through my father.\n\nNote: I turned 18 in 1999, the top was definitly in back then. QCOM and CSCO were among some of my best performers while I just blindly rammed all my Pizza Hut tip money into the market...I remember buying a mansion in my head by the time I was 19 then motherfuckin Alan Greenspan gave me the keys to my mobile home lol. \n\nAlso I bagheld 100 shares MSFT at a cost average in the low 40 till 2010 when I cut my losses and slammed them into SPY instead. Bird up.",
        "created_utc": 1596377731,
        "id": "g03may3",
        "permalink": "/r/stocks/comments/i2bznd/how_many_im_a_teenager_posts_do_we_think_are/g03may3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596406531.0
    },
    {
        "author": "CoffeeNTrees",
        "body": "If you hold still, I'll get my keys outta there.",
        "created_utc": 1596570292,
        "id": "g0d74rm",
        "permalink": "/r/wallstreetbets/comments/i3ozim/explosion_in_beirut_calls_on_gld/g0d74rm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596599092.0
    },
    {
        "author": "koenigsburg-20",
        "body": "I have not looked into it, but I doubt you will own the keys to the wallet, and technically you do not own any digital assets within the crypto EFT. \n\nPersonally, I buy or mine my own crypto and store it in my own wallet. With crypto, I don't like other people touching my digital assets.",
        "created_utc": 1596636169,
        "id": "g0g1v0v",
        "permalink": "/r/investing/comments/i45q0o/what_do_you_people_think_of_bitcoin_etfs/g0g1v0v/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596664969.0
    },
    {
        "author": "Sayter",
        "body": "just gave you the keys to figure it out in that last award. that shit should be enough for you to realize. I'm fucking for real.",
        "created_utc": 1596543472,
        "id": "g0bhtug",
        "permalink": "/r/wallstreetbets/comments/i3gpgo/daily_discussion_thread_for_august_04_2020/g0bhtug/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596572272.0
    },
    {
        "author": "Sayter",
        "body": "just gave you the keys to figure it out in that last award. just that shit should be enough for you to realize. there's shit that you just don't fucking understand.",
        "created_utc": 1596543414,
        "id": "g0bhr4j",
        "permalink": "/r/wallstreetbets/comments/i3gpgo/daily_discussion_thread_for_august_04_2020/g0bhr4j/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596572214.0
    },
    {
        "author": "Thenattylimit",
        "body": "If they don't pass might as well give Biden keys to the WH now.",
        "created_utc": 1596720445,
        "id": "g0k3ore",
        "permalink": "/r/wallstreetbets/comments/i4p4at/daily_discussion_thread_for_august_06_2020/g0k3ore/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596749245.0
    },
    {
        "author": "capitalistsanta",
        "body": "This is weird advice and don’t take this as “dont invest”: invest SO much man, but invest in the new stuff. Stocks are the rich mans game in 2020, this isn’t 1950 anymore, stocks are the price that they are at because of a lot of manipulation by our government. I like that you’re in small caps. Learn about Cryptocurrency: Bitcoin, Ethereum, Ampleforth, Decentralized Finance, staking, private keys, exchanges, absorb it all. Jump into the new stuff don’t even think about it just learn as you go. IMO there’s more opportunity in Cryptocurrency than Stocks and I personally think it’s more fun and a 24 hour market and can be done entirely on your phone if you want and buying in is so cheap right now, like pennies to invest in good tokens. If you don’t believe me check out AERGO, a Token that has more impressive partnerships than hundreds of thousands of companies in the stock market. I don’t think that dropping money into an index fund is a BAD idea, but IMO it’s more of an 80s-2010s idea that isn’t going to be as successful when the market is so disconnected from the realities facing America at the moment. I would HIGHLY recommend “How to Make Money in Stocks” by William ONeil; the founder of Investor Business Daily. His strategies helped me make money in crypto this month in particular. But man just learn. That shit is free. Learn, explore, make folders and book mark shit. Definitely also recommend “Steal Like an Artist”",
        "created_utc": 1596353475,
        "id": "g02ehjj",
        "permalink": "/r/stocks/comments/i253cm/15_yrs_old_no_bills_so_im_putting_every_check/g02ehjj/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596382275.0
    },
    {
        "author": "TheDWord775",
        "body": "And downloading activation keys. Unfortunately for us, they've gotta a lot better a protecting their assets and maximizing profits. Remember, you don't actually own software, unless you create it, you're just paying for the right to use it.",
        "created_utc": 1596490113,
        "id": "g09chaj",
        "permalink": "/r/wallstreetbets/comments/i34g5h/what_are_your_moves_tomorrow_august_04_2020/g09chaj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596518913.0
    },
    {
        "author": "learningoptions",
        "body": "I only lost my keys. I mean, I know where they are, I just can’t get to them.",
        "created_utc": 1596333309,
        "id": "g01navp",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/g01navp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596362109.0
    },
    {
        "author": "pugofwallstreet",
        "body": "Just mashing some keys. Not a strawman. OK.\n\nJust you do you dude. I'm over it. I don't care.",
        "created_utc": 1596667894,
        "id": "g0hy1dx",
        "permalink": "/r/pennystocks/comments/i4ea7a/discussion_on_submitting_blind_limit_buy_orders/g0hy1dx/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1596696694.0
    },
    {
        "author": "Suikodenstar",
        "body": "They’re insured so I’m not worried, personally\n\nEdit: also, your balance stays the same whether they borrow from it or not. I feel confident that my funds are secured. I got a loan for stocks through them with no credit inquires out of my crypto. Not your keys, not your coins still rings true but it’s working for me.",
        "created_utc": 1596681813,
        "id": "g0inyci",
        "permalink": "/r/investing/comments/i4ijbp/question_on_nexo_giving_10_interest_on_crypto/g0inyci/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596710613.0
    },
    {
        "author": "Sampson2003",
        "body": "Lol I would say caring if they showed up is a pretty big deal. Not sure what we are even debating anymore. The higher up someone is just justified the trust of handing them the keys to your beemer",
        "created_utc": 1596734971,
        "id": "g0l1059",
        "permalink": "/r/wallstreetbets/comments/i4g119/why_not_go_back_to_work_on_unemployment_why/g0l1059/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596763771.0
    },
    {
        "author": "PostM8",
        "body": "Damn. Just wait till the boomers get word of the Alicia keys deal",
        "created_utc": 1596723385,
        "id": "g0kacrl",
        "permalink": "/r/wallstreetbets/comments/i4p4at/daily_discussion_thread_for_august_06_2020/g0kacrl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596752185.0
    },
    {
        "author": "my-balls-really-itch",
        "body": "Deadass just whip your cock out and slap random keys on your keyboard and that’s the ticker your gamble.",
        "created_utc": 1596791221,
        "id": "g0noui5",
        "permalink": "/r/wallstreetbets/comments/i59ycj/i_want_to_play_stock_market_roulette/g0noui5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596820021.0
    },
    {
        "author": "Suikodenstar",
        "body": "Sorry I replied to the main post so I’ll just copy\n\n\nThey’re insured so I’m not worried, personally\n\nEdit: also, your balance stays the same whether they borrow from it or not. I feel confident that my funds are secured. I got a loan for stocks through them with no credit inquires out of my crypto. Not your keys, not your coins still rings true but it’s working for me.",
        "created_utc": 1596698928,
        "id": "g0jbgxn",
        "permalink": "/r/investing/comments/i4ijbp/question_on_nexo_giving_10_interest_on_crypto/g0jbgxn/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596727728.0
    },
    {
        "author": "jammerjoint",
        "body": "I'd exit MU, OXY, KEYS, FLT, UBER.  Candidates for reduction are INTU, WFC, GILD.  If this is a tax-advantaged account I would sell it all.  Load everything into VT and BND according to your horizon / risk tolerance.\n\n&gt; avoid the hassle of trying to beat the market, which I’m clearly not good at\n\nAlways good to have this attitude, ego loses a lot of money for a lot of people.",
        "created_utc": 1596668829,
        "id": "g0hzui8",
        "permalink": "/r/investing/comments/i446j3/daily_advice_thread_all_basic_help_or_advice/g0hzui8/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596697629.0
    },
    {
        "author": "DaRyteJuan",
        "body": "KEYS is Keysight Technologies",
        "created_utc": 1596716132,
        "id": "g0juwfi",
        "permalink": "/r/investing/comments/fa4hyn/motley_fool_5g_stock_pick/g0juwfi/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596744932.0
    },
    {
        "author": "Realchacal",
        "body": "Non-nerdy people (I guess like 99%) probably won't manage their Bitcoin private keys themselves. Instead they will have Bitcoin in some bank account, and sending from one account to another can be done off-chain. Banks probably would just have to make like 1 clearing transaction or so per day.\n\nFor the remaining 1% lightning network **will** come.",
        "created_utc": 1596738117,
        "id": "g0l8dwj",
        "permalink": "/r/investing/comments/i4lwxd/jpmorgan_says_younger_investors_going_for_bitcoin/g0l8dwj/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596766917.0
    },
    {
        "author": "marvinrivera1",
        "body": "If you must know, Don’t buy crypto on Robinhood!!\nYou don’t own anything crypto you buy there because they hold the private keys not you!!",
        "created_utc": 1596551039,
        "id": "g0bubms",
        "permalink": "/r/RobinHood/comments/i3amzc/i_was_experimenting_with_crypto_a_bit_just_now/g0bubms/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1596579839.0
    },
    {
        "author": "bbbpppccc",
        "body": "They should be doing that and that’s my expectation, but if someone was able to get the keys to the vault.\nThat would be insane but nonetheless within the realm of 0.0000000001%",
        "created_utc": 1596609137,
        "id": "g0f3gzw",
        "permalink": "/r/wallstreetbets/comments/i3qotz/what_are_your_moves_tomorrow_august_05_2020/g0f3gzw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596637937.0
    },
    {
        "author": "thewallrus",
        "body": "Na, it looks like they do.\nhttps://arstechnica.com/tech-policy/2020/07/florida-teen-arrested-charged-with-being-mastermind-of-twitter-hack/\n\n It doesn't matter who has the keys to your house if you are the lock manufacturer.",
        "created_utc": 1596294250,
        "id": "fzzmob6",
        "permalink": "/r/wallstreetbets/comments/i1e1y8/twitter_was_hacked_by_a_17_year_old/fzzmob6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596323050.0
    },
    {
        "author": "PajeetScammer",
        "body": "Would have been hard to hide a brokerage account and cashed out usd at any point.\n\nCry ,pto is much easier to hide and retrieve later. He won't even have to give up the ethere ,um unless he wants to under threat of harsher punishment as long as he keeps his private keys to himself.\n\nIf that \"send one ill send back 2\" scam on Twitter and everywhere else hadn't been one of the most popular well known scams of the last 5 years he would have made millions\n\n(The guys to first run it on Twitter using fake accounts with similar names before verified accounts actually did make millions- this is exact scam is what initially led to verified accounts. Ppl copying vitalik buterin's twitter)",
        "created_utc": 1596268965,
        "id": "fzysixy",
        "permalink": "/r/wallstreetbets/comments/i1e1y8/twitter_was_hacked_by_a_17_year_old/fzysixy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596297765.0
    },
    {
        "author": "stockbotdasan",
        "body": "I use it it has its issue like limited liquidity and if you have a big account you can only put 10000 into a stock but for small account I feel like it’s worth it for day trading.  \n\nIt’s ui is dogs but but if you combine it with a chrome extension call lasertoast it lets you add hot keys and better day trading menu.  I would also recommend using something like benzinga to get a Gould chart and indicators as this does not offer any sort usable chart.",
        "created_utc": 1596461218,
        "id": "g07dw7r",
        "permalink": "/r/pennystocks/comments/i2wp1n/ustocktrade_recommendation/g07dw7r/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1596490018.0
    },
    {
        "author": "Signal_Teaching4646",
        "body": "Hi all. I’m new to this forum and was hopping you could help me rebalance my portfolio. I started investing at the beginning of last year and have about a little over 30k in my account. However, I am trailing the s&amp;p500 and nasdaq (quite considerably) for the period and would like to get some advice on what would be the best approach for “catching up” to the market. Currently my portfolio is GOOGL 18%, FB 14%, V 10%, MU 9%, INTC 8%, OXY 8%, BA 7%, WFC 5%, INTU 4%, KEYS 4%, FLT 4%, UBER 3%, JNJ 3%, GILD 3%, MCD 2%.\n\nGiven the holdings above, where do you recommend I reduce/add or exit positions? I am considering selling the portfolio entirely and buying a few index funds instead to avoid the hassle of trying to beat the market, which I’m clearly not good at lol.\n\nAny feedback appreciated. Thanks",
        "created_utc": 1596645605,
        "id": "g0gmei5",
        "permalink": "/r/investing/comments/i446j3/daily_advice_thread_all_basic_help_or_advice/g0gmei5/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596674405.0
    },
    {
        "author": "gnocchicotti",
        "body": "Looks like a nothingburger. I believe this is NDA documentation provided to some Intel customers, not the keys to the castle.",
        "created_utc": 1596751347,
        "id": "g0m1c9f",
        "permalink": "/r/wallstreetbets/comments/i4wtun/intel_massive_data_leak/g0m1c9f/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596780147.0
    },
    {
        "author": "fedeveloper",
        "body": "It would have to become a part of building code to really blow up (pun intended). Unfortunately most builders just want cheap, cheap, cheap before they hand the keys over to the buyer and gtfo.",
        "created_utc": 1596714662,
        "id": "g0js522",
        "permalink": "/r/investing/comments/i4php8/polycarbonate_windows_the_future/g0js522/",
        "score": 1,
        "subreddit": "investing",
        "created": 1596743462.0
    }
]