[
    {
        "author": "Titans_2001",
        "body": "Accela, ACI Worldwide, Inc., Acumen Data Systems, Adobe, ADP, Advanced, Aladtec, Alfresco, ARCHIBUS, ASG Technologies, Asseco Group, Atlas Business Solutions, Atlassian, Avue Technologies, Benefitexpress, Berger-Levrault, Berger-Levrault, Blackbaud, Blackboard, Capita Software, Cegid, Celayix Software, CentralSquare Technologies, Ceridian, Cerner Corporation, Cisco Systems, Citrix, Computer Modeling Group, Connecting-Expertise NV, Dileoz, Dropbox, Dude Solutions Inc., eCivis, a GTY Technology Company, FIS Global, Fiserv, Google, Granicus, Hexagon, High Line, a NEOGOV Company, Huddle, Informatica, Intime Solutions, Itineris, Ivanti, Kofax, Kronos Incorporated, Laserfiche, LogMeIn, Inc., NEOGOV, Nice Systems, Oleeo, Open Text Corporation, OptForce, Peopleadmin, a Powerschool Company, PROACTIS Group, Roper Technologies, Inc., Salesforce, ServiceNow, Silverlake Axis, Squiz, Sunview Software, Tableau Software, TeamDynamix, Teradata Corporation, TMA Systems, UNIT4, viDesktop Inc., Visma, Vitech Systems Group, Workday, XCD HR Limited, Zoom Video, Tyler\n\nSome are private, but that should keep you busy for awhile. You’re welcome.",
        "created_utc": 1607068705,
        "id": "gekpqsr",
        "permalink": "/r/wallstreetbets/comments/k66875/what_are_your_moves_tomorrow_december_04_2020/gekpqsr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1607097505.0
    },
    {
        "author": "cuntnuzzler",
        "body": "&gt;FLT\n\nSir this is a penny stock discussion....",
        "created_utc": 1606824606,
        "id": "ge92vdb",
        "permalink": "/r/pennystocks/comments/k440mr/daily_plays_december_01_2020/ge92vdb/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1606853406.0
    },
    {
        "author": "Interesting_Screen99",
        "body": "Buy a bunch of cheap penny stocks and hope it takes off?  That's horrible advise.  TSXV is full of some really nice hidden gems but it requires DD.  Majority of the companies there are duds.  I would consider buying PNG based on the fundamentals, I wouldn't buy FLT at this point because it is essentially gambling.",
        "created_utc": 1607009778,
        "id": "gehsg1s",
        "permalink": "/r/CanadianInvestor/comments/k5sia1/daily_discussion_thread_for_december_03_2020/gehsg1s/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1607038578.0
    },
    {
        "author": "harryorbsjr",
        "body": "Damn seems like they issued $12 million worth of new shares in a bought deal\n\n[https://money.tmx.com/en/quote/FLT/news/5090010583508080/Drone\\_Delivery\\_Canada\\_Announces\\_Upsized\\_Bought\\_Deal\\_Public\\_Offering\\_to\\_120\\_Million](https://money.tmx.com/en/quote/FLT/news/5090010583508080/Drone_Delivery_Canada_Announces_Upsized_Bought_Deal_Public_Offering_to_120_Million)\n\nDoes this mean we're about to see a major dip?",
        "created_utc": 1606836605,
        "id": "ge9l8lr",
        "permalink": "/r/CanadianInvestor/comments/k4fz8n/daily_discussion_thread_for_december_01_2020/ge9l8lr/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1606865405.0
    },
    {
        "author": "Therlys",
        "body": "What about FLT?\n\nJust watched the newest CEO interview on youtube. I really like his vibes seems very intelligent and motivated to push DDC. I really like when asked about amazon having to take steps back on drone delivery and put a pause on it. Essentially they are not at the level DDC is at and can't compare with DDC performance.\n\n[https://www.youtube.com/watch?v=FCm2p\\_dPFRc](https://www.youtube.com/watch?v=FCm2p_dPFRc)\n\n\"Air Canada has partnered with [Drone Delivery Canada](https://dronedeliverycanada.com/applications/) as its exclusive drone delivery service provider – the first agreement of its kind globally. ACC has targeted up to 150,000 transactional routes to offer to their customers to help serve remote communities and increase efficiency in last-mile delivery across many verticals. \"\n\n[https://renx.ca/the-last-last-mile-delivery-drones-retailers-and-lockourier-canada/](https://renx.ca/the-last-last-mile-delivery-drones-retailers-and-lockourier-canada/)",
        "created_utc": 1606928001,
        "id": "gedxty0",
        "permalink": "/r/stocks/comments/k559ax/rstocks_daily_discussion_wednesday_dec_02_2020/gedxty0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606956801.0
    },
    {
        "author": "DrPunisher",
        "body": "Banks (BMO, BNS, TD), energy (ENB, SU), REIT (REI, CHP, SRU) and my telehealth/tec (DOC,JNH,MTRX,FLT)\n\nGood thinking",
        "created_utc": 1606944452,
        "id": "gef16na",
        "permalink": "/r/CanadianInvestor/comments/k57t31/how_much_cash_is_everyone_holding_onto_right_now/gef16na/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1606973252.0
    },
    {
        "author": "sporadicjesus",
        "body": "Its already above a dollar (canadian check the ticker FLT)\n\nDown to .95 cents at the moment, for sure to crash at least to .88",
        "created_utc": 1606912489,
        "id": "ged1n7y",
        "permalink": "/r/pennystocks/comments/k54y3h/takof_halted_raising_12m_this_good_or_bad/ged1n7y/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1606941289.0
    },
    {
        "author": "paedrarmy1",
        "body": "90% of my portfolio is in MRTX, FLT,  and SCR, all bought from the middle of the jump and I'm still convinced something is going to tank.",
        "created_utc": 1606998628,
        "id": "gehaim0",
        "permalink": "/r/CanadianInvestor/comments/k5sia1/daily_discussion_thread_for_december_03_2020/gehaim0/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1607027428.0
    },
    {
        "author": "tyco3232",
        "body": "$flt",
        "created_utc": 1606870633,
        "id": "gebixb6",
        "permalink": "/r/investing/comments/k4j98w/canadian_electric_truck_and_bus_manufacturer_to/gebixb6/",
        "score": 1,
        "subreddit": "investing",
        "created": 1606899433.0
    },
    {
        "author": "Yoschnitzel",
        "body": "I heard about MTRX here a few months ago and bought around 0.35.  then it climbed without crashing and the hype kept going here.  Bought more at 0.66, which I thought was too late but I'm over 100% gains now.  Now I'm just holding long and laughing as great deals keep getting announced and moving the price higher.  \n\nJust pay attention.. the things talked about today like FLT and PNG will take off eventually.  Be patient, and realize that it's gambling.  Buy a bunch of a cheap penny stock and hope it takes off.  Sometimes they do, sometimes they don't.  If you want safe returns, don't play around with penny stocks.  \n\nMIR might go big, they're making a new class of pain killer that could disrupt the opiod industry.  Super cheap, might be worth a ton, but I've parked my money in there (and lost a bunch at this point) in the hopes their Phase 3 trials go great and this thing goes up 1000% in a year or two.",
        "created_utc": 1607002905,
        "id": "gehg8so",
        "permalink": "/r/CanadianInvestor/comments/k5sia1/daily_discussion_thread_for_december_03_2020/gehg8so/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1607031705.0
    },
    {
        "author": "Yoschnitzel",
        "body": "What your quoted me on was taken out of context. That statement was meant to demonstrate that it is indeed gambling.  On a bigger picture, of course DD occurs anytime I move my money anywhere, as it should for everyone.\n\nI also wouldn't touch FLT simply because I don't believe that drone delivery will replace cheap human labour at this time.  Sure it can help get medicine to far away areas, but that won't double my money anytime soon.",
        "created_utc": 1607013356,
        "id": "gehztlk",
        "permalink": "/r/CanadianInvestor/comments/k5sia1/daily_discussion_thread_for_december_03_2020/gehztlk/",
        "score": 0,
        "subreddit": "CanadianInvestor",
        "created": 1607042156.0
    }
]