[
    {
        "author": "SensibleReply",
        "body": "Wanna feel better? Let me help!\n\nI put my nose to the grindstone at 18, graduated with honors from college in 4 years, top 10% of my med school class 4 years after that, completed my residency 4 years after that. Walked out of residency at age 30 as an eye surgeon and started seeing patients at my own practice 3 days out of residency. I was probably no shit the youngest solo practice ophthalmologist in the country for a moment there.\n\nHated it. Wished every day that I hadn't worked so hard the entirety of my 20s. Hated that I was caught in a field that is high stress and has to deal with demanding patients. Hated that I owed a huge sum of money for school and the business loan. Hated that I'll only ever get rich one patient at a time.\n\nA day off costs me about $2k now. I can't outsource or automate anything, can't scale up, just have to see each patient and do each case and take less money as reimbursement gets cut every year. At 35, I still owe six figures on my business loan (though I'll probably clear it next year).\n\nWhat you were doing is my dream. My own hours? No patients or insurance companies to answer to? No surgical complications or bad outcomes! I consistently am putting a huge chunk of my pay into the market hoping to be able to quit this job and do what you did. I'd rather be trading than operating. I'm a top tier cataract surgeon with a high volume, and I'll need to work for 5-10 years to get to where you were. Grass is always greener, friend.\n\nEdit: Buy ZBRA LEAPs. Jan 2022, but they ain't cheap. Thank me later.",
        "created_utc": 1594605017,
        "id": "fxvzcxs",
        "permalink": "/r/wallstreetbets/comments/hq65dq/dont_be_like_me_find_meaning_in_your_life_because/fxvzcxs/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1594633817.0
    },
    {
        "author": "ThePeoplesBard",
        "body": "Tomorrow, I'm going to start working shortly after sunrise, about 6:30. Maybe 7:00 if I have breakfast. It's important to start early because it's going to feel like 105 degrees in northern Virginia the next few days. I have to weed the dahlia beds. Then the sunflowers and zinnias. The orchard needs pruning, and we need to widen the deer fences because the branches have grown. Then I'm going to stake the tomatoes. They've just started fruiting, and they're the right height. They're late, because even our nights have been hot, and cool nights are vital for nightshade fruiting. But they're beautiful, healthy plants. We have Sweet 100s and Better Boys for hybrids, and Brandywine, Mortgage Lifter, and Green Zebra for heirlooms.\n\nThen, at 3:30, I'm going to open my app and sell my 10 bagger SPY puts.\n\nOr not. At least I have tomatoes to look forward to.",
        "created_utc": 1594859169,
        "id": "fy7bgne",
        "permalink": "/r/wallstreetbets/comments/hruzcj/what_are_your_moves_tomorrow_july_16_2020/fy7bgne/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1594887969.0
    },
    {
        "author": "turdbirdwerd",
        "body": "I feel like this time it’s not gonna be as easy. Like know we all kkow the plays. But this time it’s gonna be a zebra market! You heard it here first",
        "created_utc": 1595556976,
        "id": "fz1r099",
        "permalink": "/r/wallstreetbets/comments/hwppqo/feeling_vibes_again/fz1r099/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595585776.0
    },
    {
        "author": "Wolf_Of_1337_Street",
        "body": "Zebra gang",
        "created_utc": 1595364652,
        "id": "fysyw9e",
        "permalink": "/r/wallstreetbets/comments/hveqed/what_are_your_moves_tomorrow_july_22_2020/fysyw9e/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595393452.0
    },
    {
        "author": "1st_Amendment_EndRun",
        "body": "relax, zebra.\n\nIt'll take an average of 108 days before that lion shits a litter of cubs that need to be fed your meat... and that's assuming some other alpha CoViD doesn't come along and eat all the cubs.",
        "created_utc": 1594811244,
        "id": "fy4ss1f",
        "permalink": "/r/wallstreetbets/comments/hrlkq4/stop_jerking_off_fellow_retards/fy4ss1f/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594840044.0
    },
    {
        "author": "HornedHiddenOne",
        "body": "Google ZEBRA (zero extrinsic back ratio spread), you won't be disappointed",
        "created_utc": 1596178018,
        "id": "fzu7a71",
        "permalink": "/r/options/comments/i12hsu/going_synthetically_long/fzu7a71/",
        "score": 2,
        "subreddit": "options",
        "created": 1596206818.0
    },
    {
        "author": "NotNamedNathan",
        "body": "Kids lucky as shit, got to tag along to like some trump leadership conference (lmao) in DC, some seminar led by Churchill’s grandson (I believe), all this random shit. Vs me and the middle bri are just like... fuck our lives\n\nThis is why I should’ve never broken up with the stupid rich girl I dated once. They had a damn zebra on their ranch. Should’ve bit the bullet.",
        "created_utc": 1594269777,
        "id": "fxe457n",
        "permalink": "/r/wallstreetbets/comments/hnofn2/what_are_your_moves_tomorrow_july_09_2020/fxe457n/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594298577.0
    },
    {
        "author": "Phizzsicks",
        "body": "How to make money:\nCalls on $Zbra and $wmt and $tsla \n\nPuts on: $mrna and ccl after todays highs",
        "created_utc": 1594810841,
        "id": "fy4sc0k",
        "permalink": "/r/wallstreetbets/comments/hrlhn4/spx_500_up_or_down/fy4sc0k/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594839641.0
    },
    {
        "author": "TheWeirdSlimShady",
        "body": "&gt;Buy ZBRA LEAPs\n  \nelaborate pls?",
        "created_utc": 1594619138,
        "id": "fxwjhem",
        "permalink": "/r/wallstreetbets/comments/hq65dq/dont_be_like_me_find_meaning_in_your_life_because/fxwjhem/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594647938.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 27th of July\n\n\n\n## Upcoming events for Monday, July 27th\n\n - Stock splits:\n\n    - FMO @ **1:5**\n    - MCC @ **1:20**\n\n - Expected earnings:\n\n  ABCB, ACI, AGNC, AMG, AMKR, ARE, ARLP, AVY, BOH, BRO, BSVN, CATY, CBU, CINF, CMRE, CR, CSBR, CX, DGICA, DSX, EHC, EQT, FBMS, FFIV, FIBK, FIX, FRBA, FRTA, FSB, GOOD, HAS, HBMD, HBT, HMST, HSII, HSTM, HTLF, HXL, IBA, IVAC, JBT, JJSF, LECO, LKFN, LM, LXFR, MEDP, MEDS, MMLP, MNSB, NBTB, NOV, NWBI, NXPI, OGS, OMF, PCH, PFG, PMBC, PPBI, PRK, QCRH, QTS, RBB, RNST, RPM, SALT, SAP, SBFG, SI, SMBC, SSD, TBI, TCF, TESS, TFII, TNET, UHS, USAK, VCRA, VET\n\n - Ex-div:\n\n  CVLY, FAST, SAFM\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.193%)\n    - 3-Month Bill Auction (previous: 0.120%)\n    - 5-Year Note Auction (previous: 0.330%)\n    - 6-Month Bill Auction (previous: 0.130%)\n    - Core Durable Goods Orders (consensus: 3.5%, previous: 3.7%)\n    - Dallas Fed Mfg Business Index (previous: -6.1)\n    - Durable Goods Orders (consensus: 7.2%, previous: 15.7%)\n    - Durables Excluding Defense (previous: 15.3%)\n    - Goods Orders Non Defense Ex Air (consensus: 2.3%, previous: 1.6%)\n    - Investing.com Gold Index (actual: 52.6%, previous: 50.9%)\n    - Investing.com S&amp;P 500 Index (actual: 41.0%, previous: 40.0%)\n\n## Upcoming events for Tuesday, July 28th\n\n - Stock splits:\n\n    - EMO @ **1:5**\n    - CEM @ **1:5**\n    - CTR @ **1:5**\n\n - Expected earnings:\n\n  AAT, ABG, ACCO, AFL, AGYS, AKAM, ALRS, AMAL, AMD, AMED, AMGN, APAM, APEN, ARCH, ASC, ASH, ATEN, ATRC, AUDC, AWI, AXS, B, BDGE, BE, BEN, BGFV, BPFH, BSBR, BUSE, BXP, BYD, CAC, CAR, CATC, CB, CCS, CE, CHRW, CMI, CNC, COWN, CSGP, CSLT, CSV, CVLT, CYH, DCOM, DENN, DHI, DTE, DXCM, EBAY, EBMT, ECL, EDU, EGP, EIX, ENVA, EQR, FBC, FBP, FCF, FELE, FEYE, FTV, GLW, GSS, HA, HAFC, HBCP, HIW, HLI, HOG, HP, HRZN, HUN, IBCP, IBTX, IMAX, IRDM, IVZ, JBLU, JNPR, LBC, LBRT, LH, LSCC, LW, MASI, MCD, MDC, MDLZ, MLM, MMM, MO, MPWR, MRC, MSCI, MTDR, MXIM, NBR, NEO, NWE, OKE, OMCL, OVV, OXSQ, PEGA, PFC, PFE, PII, PJT, PKG, PKI, PLT, PRGX, PRLB, PROV, QUMU, RCKY, RDHL, RNR, ROK, ROP, RRD, RTX, RVSB, RXN, SAN, SBUX, SHW, SIFY, SITC, SPGI, SPN, SQNS, SSNC, SSTK, ST, STAG, STX, SYX, TCS, TENB, THFF, THG, TPB, TRMK, TRU, TRVG, UDR, UMBF, UNM, USX, V, VBTX, WAB, WAT, WDR, WH, WNC, WNEB, WRE, XGN, XRX, YNDX, ZBRA\n\n - Ex-div:\n\n  AMRB, ATR, CFG, CLX, ENTG, GBX, WST\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 0.511%)\n    - API Weekly Crude Oil Stock (previous: 7.544M)\n    - CB Consumer Confidence (consensus: 94.5, previous: 98.1)\n    - Dallas Fed Services Revenues (previous: 5.7)\n    - Redbook (previous: -7.5%)\n    - Redbook (previous: 1.9%)\n    - Richmond Manufacturing Index (previous: -27)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -28)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 4.0%, previous: 4.0%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 0.3%, previous: 0.3%)\n    - Texas Services Sector Outlook (previous: 2.1)\n\n## Upcoming events for Wednesday, July 29th\n\n - Expected earnings:\n\n  AAN, ACGL, ADM, ADP, AEGN, AEM, AER, AGI, AHCO, AHT, AIN, AJRD, ALG, ALGT, ALIM, ALKS, ALTA, ALTM, AM, AMP, ANTM, APA, APHA, APLS, APRN, AQMS, AR, ARCB, ASGN, ATNI, AVB, AVGR, AVTR, AX, AXTA, BA, BBVA, BCO, BDC, BG, BHLB, BKCC, BKU, BLKB, BOOT, BSGM, BSMX, BSX, BTU, BXMT, CAKE, CBL, CCI, CCJ, CDE, CERN, CF, CFFN, CFMS, CGNX, CHDN, CHE, CHEF, CHT, CLS, CME, CMO, CMPR, CNMD, CODI, CONE, CORR, CPAC, CPF, CPLP, CRHM, CRTO, CS, CTO, CTSH, CVEO, CXO, DIN, DRE, DRTT, DT, DX, EEFT, EGOV, ENB, EPD, EQC, EQIX, ESRT, ETN, ETR, EVBN, EXEL, EZPW, FB, FBHS, FCPT, FICO, FISI, FLOW, FSS, FTI, GAIN, GD, GE, GIB, GLDD, GM, GRFS, GRMN, GWB, HBB, HBNC, HES, HESM, HI, HOLX, HOME, HPP, HWKN, ILPT, INOV, IO, IPG, IRT, ISBC, JAKK, JCS, JHG, JRVR, KAMN, KGC, KLIC, KN, KRA, KRC, KTOS, LADR, LFUS, LIVN, LRCX, LXU, LYG, MAA, MANT, MC, MCO, MEET, MEOH, MFG, MGLN, MGRC, MHH, MHO, MKSI, MLVF, MMSI, MNRO, MOBL, MPX, MSEX, MTOR, MTSI, MUFG, MYRG, NEXA, NGVT, NLS, NLY, NMM, NMR, NOA, NOVA, NOW, NSC, NSCO, NYCB, OC, OCX, OII, OIS, OMC, ONDK, ORLY, ORN, PAG, PB, PDM, PEIX, PGRE, PI, PPC, PS, PTC, PYPL, QCOM, QEP, QRVO, R, RAIL, RDWR, RDY, RES, RGCO, RIG, RJF, ROIC, ROL, RYI, SAIA, SANM, SBBP, SBH, SBPH, SC, SCI, SDPI, SFM, SGC, SHOO, SHOP, SIGI, SIMO, SITE, SIX, SKY, SLAB, SLRX, SMG, SNY, SP, SPFI, SPG, SPOT, SRDX, SREV, SRI, STRA, SWIR, TAK, TARO, TBIO, TBPH, TDOC, TEL, TGI, TKC, TLRD, TMDI, TPC, TPL, TRNO, TROW, TROX, TRTX, TS, TSE, TSEM, TSU, TT, TTEK, TTMI, TUP, TX, TYL, UCTT, URI, UTHR, UVE, VAC, VGZ, VICI, VKTX, VNDA, VSEC, VTVT, WERN, WHD, WING, WIRE, WLL, WRI, WTI, WTRE, XAN, YUM, YUMC\n\n - Ex-div:\n\n  AM, BPMP, ERF, FRC, HMLP, KNOP, MSB, PVBC\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.076M)\n    - Crude Oil Inventories (consensus: -2.088M, previous: 4.892M)\n    - Cushing Crude Oil Inventories (previous: 1.375M)\n    - Distillate Fuel Production (previous: -0.097M)\n    - EIA Refinery Crude Runs  (previous: -0.103M)\n    - EIA Weekly Distillates Stocks (consensus: -0.618M, previous: 1.073M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.5%, previous: -0.2%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (consensus: -1.386M, previous: -1.802M)\n    - Gasoline Production (previous: -0.016M)\n    - Goods Trade Balance (previous: -75.26B)\n    - Heating Oil Stockpiles (previous: -0.750M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 5.1%)\n    - Pending Home Sales (consensus: 15.3%, previous: 44.3%)\n    - Pending Home Sales Index (previous: 99.6)\n    - Retail Inventories Ex Auto (previous: -1.6%)\n    - Seevol Cushing Storage Report (previous: 0.769M)\n    - Wholesale Inventories (previous: -1.2%)\n\n## Upcoming events for Thursday, July 30th\n\n - Expected earnings:\n\n  AAPL, ABTX, ACA, ADSW, AGCO, AGIO, AIMT, AINC, AJG, ALXN, AMSF, AMT, AMZN, ANIK, AOS, APO, APTV, ARI, ARW, ASPN, ATR, ATUS, AZN, BAND, BAX, BC, BGCP, BGS, BHR, BIO, BLDR, BPMC, BRKS, BSAC, BUD, BVN, BZH, CARR, CARS, CASA, CBTX, CBZ, CC, CCC, CFR, CG, CGEN, CI, CLF, CMCO, CMCSA, CNHI, CNOB, CNX, CNXM, COG, COHU, COLM, COOP, COP, COR, CPG, CPT, CRAI, CROX, CRS, CRY, CUBI, CUZ, CVA, CWT, CXP, DAN, DBD, DCO, DD, DECK, DLA, DLR, DLX, DNKN, DRQ, DSPG, DVA, EA, EBS, EGHT, EGO, EKSO, ELAN, ERII, ERJ, ESXB, EVLO, EXAS, EXP, EXPE, EXPO, F, FCN, FHI, FLEX, FLS, FMBH, FMS, FND, FORM, FORR, FTAI, FTS, FWRD, GHM, GIL, GILD, GLPI, GNRC, GOOG, GOOGL, GPC, GPI, GRA, GTX, HBI, HGV, HIG, HOPE, HST, HTGC, HTH, HUBB, HUBG, HURN, ICE, IDA, INFI, INT, IP, IRMD, ISDR, ITGR, JILL, K, KDP, KEX, KHC, KNSL, LAWS, LIN, LKQ, LLY, LNTH, LOCO, LPLA, LTC, LXRX, MA, MAS, MATW, MD, MDRX, MELI, MERC, MGM, MGNX, MGPI, MHK, MITK, MIXT, MMC, MMP, MN, MOH, MPW, MSA, MT, MTA, MTD, MTLS, MTX, MTZ, MWK, MX, MYE, NATI, NEM, NOC, NTCT, NTUS, NVCR, NVST, NXGN, ODFL, OFC, ONEW, OPI, ORBC, ORC, OSK, PATK, PBI, PCG, PEB, PFPT, PFS, PG, POWI, PQG, PRFT, PRO, QDEL, RDFN, RDS.A, RGEN, ROG, RP, RTRX, SAH, SEM, SGEN, SHAK, SIRI, SKYW, SNDR, SO, SOI, SPSC, SPXC, SSB, STBA, SWK, SWN, SYK, TAL, TAP, TBBK, TEAM, TEX, TFX, TIGO, TMHC, TNC, TNDM, TPX, TRP, TRS, TW, TWOU, TXT, ULH, UPS, UTL, VC, VCYT, VLO, VRAY, VRTU, VRTX, WEX, WLTW, WM, WRTC, WWE, WYND, X, XEL, XFOR, XHR, XLNX, XPO, XYL, ZEN\n\n - Ex-div:\n\n  AGNC, ALLY, AOS, ATLO, AVAL, BMRC, BRMK, BSRR, CADE, CCLP, COST, CRT, CSWI, DCP, DD, DNP, EFC, ENLC, EPD, EV, FT, GECC, GEL, GPP, GRP.U, KFFB, LNT, MCBS, MS, NI, NNN, NWN, OHI, ORC, OSBC, OVBC, PAA, PAGP, PBT, PETS, PFE, PLBC, PSEC, PSXP, SBNY, SLG, STAG, TGP, TRGP, TXN, UNM, USAC, UVE, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 17,067K, previous: 16,197K)\n    - Core PCE Prices (consensus: 1.40%, previous: 1.70%)\n    - GDP (consensus: -34.0%, previous: -5.0%)\n    - GDP Price Index (consensus: 1.2%, previous: 1.6%)\n    - GDP Sales (previous: -3.5%)\n    - Initial Jobless Claims (consensus: 1,400K, previous: 1,416K)\n    - Jobless Claims 4-Week Avg. (previous: 1,360.25K)\n    - Natural Gas Storage (consensus: 36B, previous: 37B)\n    - PCE Prices (previous: 1.3%)\n    - Real Consumer Spending (previous: -6.8%)\n\n^^^^2020-07-27",
        "created_utc": 1595844034,
        "id": "fze1qb2",
        "permalink": "/r/RobinHood/comments/hyph34/daily_discussion_thread_july_27th_2020/fze1qb2/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1595872834.0
    },
    {
        "author": "californication_",
        "body": "Red 80 x zebra on 2",
        "created_utc": 1594006860,
        "id": "fx2dea9",
        "permalink": "/r/wallstreetbets/comments/hlt7rc/what_are_your_moves_tomorrow_july_06_2020/fx2dea9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594035660.0
    },
    {
        "author": "g-l-h-f",
        "body": "Buying power reduction/capital efficiency on the ITM option position vs shares if you keep delta constant. An even better position to take is a ‘zebra’ where you buy 2 ITM and sell one ATM. The folks at tastytrade call it a zebra 🦓",
        "created_utc": 1595991073,
        "id": "fzkzmy9",
        "permalink": "/r/wallstreetbets/comments/hzmwad/did_i_do_it_right/fzkzmy9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596019873.0
    },
    {
        "author": "VegaStoleYourTendies",
        "body": "You could do a diagonal or calendar spread, and potentially manage into free or reduced long options. Otherwise maybe a delta buster or a ZEBRA? It'd help if I knew what you were trying to accomplish, are you trying to make a directional bet? Hedge tail risk?",
        "created_utc": 1594083611,
        "id": "fx5q6v9",
        "permalink": "/r/options/comments/hlu98p/high_riskreward_directional_strategies/fx5q6v9/",
        "score": 1,
        "subreddit": "options",
        "created": 1594112411.0
    },
    {
        "author": "HarveyBirdman3",
        "body": "Ah I see. Almost like a zebra? \n\n\nI’m having trouble seeing any reason to buy non-div stock when you can do a synth long - esp if you want to go long using margin but don’t want to pay crazy interest. Maybe I’m missing something?",
        "created_utc": 1595300244,
        "id": "fyq8c6u",
        "permalink": "/r/options/comments/ht1hb1/risk_takers/fyq8c6u/",
        "score": 1,
        "subreddit": "options",
        "created": 1595329044.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 28th of July\n\n\n\n## Upcoming events for Tuesday, July 28th\n\n - Stock splits:\n\n    - EMO @ **1:5**\n    - CEM @ **1:5**\n    - CTR @ **1:5**\n    - PKKFF @ **1:10**\n\n - Expected earnings:\n\n  AAT, ABG, ACCO, AFL, AGYS, AKAM, ALRS, AMAL, AMD, AMED, AMGN, APAM, APEN, ARCH, ASC, ASH, ATEN, ATRC, AUDC, AWI, AXS, B, BDGE, BE, BEN, BGFV, BPFH, BSBR, BUSE, BXP, BYD, CAC, CAR, CATC, CB, CCS, CE, CHRW, CMI, CNC, COWN, CSGP, CSLT, CSV, CVLT, CYH, DCOM, DENN, DHI, DTE, DXCM, EBAY, EBMT, ECL, EDU, EGP, EIX, ENVA, EQR, FBC, FBP, FCF, FELE, FEYE, FTV, GLW, GSS, HA, HAFC, HBCP, HIW, HLI, HOG, HP, HRZN, HUN, IBCP, IBTX, IMAX, IRDM, IVZ, JBLU, JNPR, KAI, LBC, LBRT, LH, LSCC, LW, MASI, MCD, MDC, MDLZ, MLM, MMM, MO, MPWR, MRC, MSCI, MTDR, MXIM, NBR, NCR, NEO, NWE, OKE, OMC, OMCL, OVV, OXSQ, PEGA, PFC, PFE, PII, PJT, PKG, PKI, PLT, PRGX, PRLB, PROV, QUMU, RCKY, RDHL, RNR, ROK, ROP, RRD, RTX, RVSB, RXN, SAN, SBUX, SHW, SIFY, SITC, SPGI, SPN, SQNS, SSNC, SSTK, ST, STAG, STX, SYX, TCS, TENB, THFF, THG, TPB, TRMK, TRU, TRVG, UDR, UMBF, UNM, USX, V, VBTX, WAB, WAT, WDR, WH, WNC, WNEB, WRE, XGN, XRX, YNDX, ZBRA\n\n - Ex-div:\n\n  AMRB, ATR, CFG, CLX, ENTG, GBX, WST\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 0.511%)\n    - API Weekly Crude Oil Stock (previous: 7.544M)\n    - CB Consumer Confidence (consensus: 94.5, previous: 98.1)\n    - Dallas Fed Services Revenues (previous: 5.7)\n    - Redbook (previous: -7.5%)\n    - Redbook (previous: 1.9%)\n    - Richmond Manufacturing Index (previous: -27)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -28)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 4.0%, previous: 4.0%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 0.3%, previous: 0.3%)\n    - Texas Services Sector Outlook (previous: 2.1)\n\n## Upcoming events for Wednesday, July 29th\n\n - Expected earnings:\n\n  AAN, ACGL, ADM, ADP, AEGN, AEM, AER, AGI, AHCO, AHT, AIN, AJRD, ALG, ALGT, ALIM, ALKS, ALTA, ALTM, AM, AMP, ANTM, APA, APHA, APLS, APRN, AQMS, AR, ARCB, ASGN, ATNI, AVB, AVGR, AVTR, AX, AXTA, BA, BBVA, BCO, BDC, BFST, BG, BHLB, BKCC, BKU, BLKB, BOOT, BSGM, BSMX, BSX, BTE, BTU, BXMT, CAJ, CAKE, CBD, CBL, CCI, CCJ, CDE, CERN, CF, CFFN, CFMS, CGNX, CHDN, CHE, CHEF, CHT, CKH, CLBK, CLS, CME, CMO, CMPR, CNMD, CODI, CONE, CORR, CPF, CRHM, CRTO, CS, CTO, CTSH, CVEO, CXO, DB, DIN, DORM, DRE, DRTT, DT, DX, EEFT, EGOV, ENB, EPD, EQC, EQIX, ESRT, ETN, ETR, EVBN, EXEL, EZPW, FARO, FB, FBHS, FCPT, FICO, FISI, FLOW, FSS, FTI, GAIN, GD, GE, GIB, GLDD, GM, GRFS, GRMN, GSK, GWB, HBB, HBNC, HES, HESM, HI, HOLX, HOME, HPP, HWKN, ILPT, INOV, INVA, IO, IPG, IRT, ISBC, JAKK, JCS, JHG, JMP, JRVR, KAMN, KGC, KLIC, KN, KRA, KRC, KTOS, LFUS, LIVN, LN, LRCX, LXU, LYG, MAA, MANT, MC, MCO, MEET, MEOH, MFG, MGLN, MGRC, MHH, MHO, MKSI, MLCO, MLVF, MMSI, MNRO, MOBL, MPX, MSC, MSEX, MTOR, MTSI, MUFG, MYRG, NBN, NEXA, NGVT, NLS, NLY, NMM, NMR, NOA, NOVA, NOW, NSC, NYCB, OC, OCX, ODT, OII, OIS, ONDK, ORLY, ORN, PAG, PB, PDM, PEIX, PGRE, PI, PPC, PS, PTC, PYPL, QCOM, QEP, QRVO, R, RAIL, RDWR, RDY, RES, RGCO, RIG, RJF, ROIC, ROL, RYI, SAIA, SANM, SBBP, SBH, SBPH, SC, SCCO, SCI, SFM, SGC, SHOO, SHOP, SIGI, SIMO, SITE, SIX, SKY, SLAB, SLRX, SMG, SNY, SONM, SPFI, SPG, SPOT, SRDX, SREV, SRI, STRA, SWIR, TAK, TARO, TBIO, TBPH, TCFC, TDOC, TEL, TKC, TLRD, TMDI, TPC, TPL, TRNO, TROW, TROX, TRTX, TS, TSE, TSEM, TSU, TT, TTEK, TTMI, TUP, TX, TYL, UCTT, URI, USAP, UTHR, UVE, VAC, VGZ, VICI, VKTX, VNDA, VSEC, VTVT, WERN, WHD, WING, WIRE, WLL, WPG, WRI, WSBF, WTI, WTRE, XAN, YUM, YUMC\n\n - Ex-div:\n\n  AM, BPMP, ERF, FRC, HMLP, KNOP, MSB, PVBC\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.076M)\n    - Crude Oil Inventories (consensus: -2.088M, previous: 4.892M)\n    - Cushing Crude Oil Inventories (previous: 1.375M)\n    - Distillate Fuel Production (previous: -0.097M)\n    - EIA Refinery Crude Runs  (previous: -0.103M)\n    - EIA Weekly Distillates Stocks (consensus: -0.333M, previous: 1.073M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.5%, previous: -0.2%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (consensus: -0.967M, previous: -1.802M)\n    - Gasoline Production (previous: -0.016M)\n    - Goods Trade Balance (previous: -75.26B)\n    - Heating Oil Stockpiles (previous: -0.750M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 5.1%)\n    - Pending Home Sales (consensus: 15.0%, previous: 44.3%)\n    - Pending Home Sales Index (previous: 99.6)\n    - Retail Inventories Ex Auto (previous: -1.6%)\n    - Seevol Cushing Storage Report (previous: 0.769M)\n    - Wholesale Inventories (previous: -1.2%)\n\n## Upcoming events for Thursday, July 30th\n\n - Expected earnings:\n\n  AAPL, ABTX, ACA, ADSW, AGCO, AGIO, AIMT, AINC, AJG, ALXN, AMSF, AMT, AMZN, ANIK, AOS, APO, APTV, ARI, ARW, ASPN, ATR, ATUS, AZN, BAND, BAX, BC, BEAT, BGCP, BGS, BHR, BIO, BLDR, BPMC, BRKS, BSAC, BUD, BVN, BZH, CACC, CARR, CARS, CASA, CBTX, CBZ, CC, CCC, CFR, CG, CGEN, CI, CLF, CMCO, CMCSA, CNHI, CNOB, CNX, CNXM, COG, COHU, COLM, COOP, COP, COR, CPG, CPT, CRAI, CROX, CRS, CRY, CUBI, CUZ, CVA, CWT, CXP, DAN, DBD, DCO, DD, DECK, DLA, DLR, DLX, DNKN, DRQ, DSPG, DVA, EA, EBS, EGHT, EGO, EKSO, ELAN, ERII, ERJ, ESXB, EVLO, EXAS, EXP, EXPE, EXPO, F, FCN, FHI, FLEX, FLS, FMBH, FMS, FND, FORM, FORR, FTAI, FTS, FWRD, GFF, GHM, GIL, GILD, GLPI, GNRC, GOOG, GOOGL, GPC, GPI, GRA, GRUB, GSHD, GTX, HBI, HGV, HIG, HOPE, HST, HTGC, HTH, HUBB, HUBG, HURN, ICE, IDA, INFI, INT, IP, IRMD, ISDR, ITGR, JILL, K, KDP, KEX, KHC, KL, KNSL, KRNY, LADR, LAWS, LIN, LKQ, LLY, LNTH, LOCO, LPLA, LXRX, MA, MAS, MATW, MD, MDRX, MELI, MERC, MGM, MGNX, MGPI, MHK, MITK, MIXT, MMC, MMP, MN, MOH, MPW, MSA, MT, MTA, MTD, MTLS, MTX, MTZ, MWK, MX, MYE, NATI, NEM, NOC, NTCT, NTUS, NVCR, NVST, NXGN, ODFL, OFC, ONEW, OPI, ORBC, ORC, OSK, PATK, PBI, PCG, PEB, PFPT, PFS, PG, POWI, PQG, PRFT, PRO, QDEL, RARE, RDFN, RDS.A, RGEN, RLGY, ROG, RP, RTRX, RWT, SAH, SAND, SEM, SGEN, SHAK, SIRI, SKYW, SNDR, SO, SOI, SPSC, SPXC, SSB, STBA, SWK, SWN, SYK, TAL, TAP, TBBK, TEAM, TEX, TFX, TIGO, TMHC, TNC, TNDM, TPX, TRP, TRS, TW, TWOU, TXT, ULH, UPS, UTL, VC, VCYT, VLO, VRAY, VRTU, VRTX, WEX, WLTW, WM, WRLD, WRTC, WWE, WYND, X, XEL, XFOR, XHR, XLNX, XPO, XYL, ZEN\n\n - Ex-div:\n\n  AGNC, ALLY, AOS, ATLO, AVAL, BMRC, BRMK, BSRR, CADE, CCLP, COST, CRT, CSWI, DCP, DD, DNP, EFC, ENLC, EPD, EV, FT, GECC, GEL, GPP, GRP.U, KFFB, LNT, MCBS, MS, NI, NNN, NWN, OHI, ORC, OSBC, OVBC, PAA, PAGP, PBT, PETS, PFE, PLBC, PSEC, PSXP, SBNY, SLG, STAG, TGP, TRGP, TXN, UNM, USAC, UVE, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 16,200K, previous: 16,197K)\n    - Core PCE Prices (consensus: 1.00%, previous: 1.70%)\n    - GDP (consensus: -34.1%, previous: -5.0%)\n    - GDP Price Index (consensus: 1.1%, previous: 1.6%)\n    - GDP Sales (previous: -3.5%)\n    - Initial Jobless Claims (consensus: 1,450K, previous: 1,416K)\n    - Jobless Claims 4-Week Avg. (previous: 1,360.25K)\n    - Natural Gas Storage (consensus: 36B, previous: 37B)\n    - PCE Prices (previous: 1.3%)\n    - Real Consumer Spending (previous: -6.8%)\n\n## Upcoming events for Friday, July 31st\n\n - Stock splits:\n\n    - TLSA @ **5:2** (Payable date: 07/30/2020)\n\n - Expected earnings:\n\n  ABBV, AON, AROC, ASIX, ASX, ATRO, AXL, BAH, BCBP, BCPC, BERY, CAT, CBOE, CBRE, CHD, CHTR, CL, CPLP, CTS, CVX, D, ES, FCAU, GLYC, GT, HRC, IMGN, IMO, ITT, ITW, JCI, LAZ, LHX, LTC, LYB, MGI, MRK, NVT, NWL, OFS, OIIM, OXLC, PBF, PBFX, PEG, PINS, PIPR, PNM, POR, PSX, PSXP, SCM, SHLX, SLCA, SNA, SPB, SRC, TAC, TU, UAA, UBX, VFC, WETF, WPC, WY, XOM\n\n - Ex-div:\n\n  AB, AES, AON, ASRV, BMTC, BX, C, CASY, CNBKA, DGICA, DGICB, DMLP, FCCO, HAS, HEP, HFBL, KMI, LBAI, LCUT, MATW, MCI, NRG, NSEC, NVEC, O, OCFC, OKE, ORRF, OVLY, PAYX, PBCT, PEBO, PNW, RELX, STL, SXT, SYF, TCP, WABC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 125.0K)\n    - CFTC Copper speculative net positions (previous: 38.6K)\n    - CFTC Corn speculative net positions (previous: -98.9K)\n    - CFTC Crude Oil speculative net positions (previous: 548.9K)\n    - CFTC Gold speculative net positions (previous: 266.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 15.7K)\n    - CFTC Natural Gas speculative net positions (previous: -22.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -43.0K)\n    - CFTC Silver speculative net positions (previous: 46.8K)\n    - CFTC Soybeans speculative net positions (previous: 121.5K)\n    - CFTC Wheat speculative net positions (previous: 18.8K)\n    - Chicago PMI (consensus: 43.9, previous: 36.6)\n    - Core PCE Price Index (consensus: 0.2%, previous: 0.1%)\n    - Core PCE Price Index (consensus: 1.0%, previous: 1.0%)\n    - Dallas Fed PCE (previous: 1.50%)\n    - Employment Benefits (previous: 0.40%)\n    - Employment Cost Index (consensus: 0.6%, previous: 0.8%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (consensus: 2.70%, previous: 2.50%)\n    - Michigan Consumer Expectations (consensus: 66.2, previous: 72.3)\n    - Michigan Consumer Sentiment (consensus: 73.0, previous: 73.2)\n    - Michigan Current Conditions (consensus: 84.2, previous: 87.1)\n    - Michigan Inflation Expectations (consensus: 3.1%, previous: 3.0%)\n    - PCE Price index (previous: 0.5)\n    - PCE price index (previous: 0.1%)\n    - Personal Income (consensus: -0.5%, previous: -4.2%)\n    - Personal Spending (consensus: 5.5%, previous: 8.2%)\n    - Real Personal Consumption (previous: 8.1%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 181)\n    - U.S. Baker Hughes Total Rig Count (previous: 251)\n\n^^^^2020-07-28",
        "created_utc": 1595930416,
        "id": "fzhy8hz",
        "permalink": "/r/RobinHood/comments/hzbxy3/daily_discussion_thread_july_28th_2020/fzhy8hz/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1595959216.0
    },
    {
        "author": "Thevoleman",
        "body": "You SOB, I'm in. Going to buy some ZBRA stocks Monday, for once I'm listening to a doctor's advice, lol.",
        "created_utc": 1594628297,
        "id": "fxwt50a",
        "permalink": "/r/wallstreetbets/comments/hq65dq/dont_be_like_me_find_meaning_in_your_life_because/fxwt50a/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594657097.0
    },
    {
        "author": "SensibleReply",
        "body": "I like ZBRA stock. A lot. I think it’s being overlooked and will be very valuable going forward, but I can’t tell you when people might notice it. So buying weekly calls or even monthly calls might burn you. I’m advocating for long dated calls. Google LEAP options to get started if you’re curious. Little more risk/reward than owning stock.\n\nFelt like I needed a position after my wall of text.",
        "created_utc": 1594624365,
        "id": "fxwp8ge",
        "permalink": "/r/wallstreetbets/comments/hq65dq/dont_be_like_me_find_meaning_in_your_life_because/fxwp8ge/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594653165.0
    },
    {
        "author": "VegaStoleYourTendies",
        "body": "Calendars/diagonals can get you free/reduced long options, otherwise check out something like the ZEBRA or a delta buster",
        "created_utc": 1594341318,
        "id": "fxhd2be",
        "permalink": "/r/options/comments/hobbpu/best_strategies_for_directional_trades/fxhd2be/",
        "score": 1,
        "subreddit": "options",
        "created": 1594370118.0
    }
]