[
    {
        "author": "theWMWotMW",
        "body": "I’m at a small engineering firm (less than 50 total) and we’re abruptly moving to a WFH environment. It’s going smoothly so far. We already have excellent bandwidth at the office and at most of our residences. I personally had to buy a desk and clear out a space in the basement because all of our bedrooms are occupied by children. Once I’m set up I’m to bring my work rig (custom built machine made to run a bunch of AutoDesk software) home and VPN to the servers at work. I serve a critical role at my company as I am the only one authorized to set up or update project sheets or backgrounds in AutoCAD. I am very optimistic to our success through this. I have several months of work lined up for me that can’t really be interrupted. Contracts are signed, bonds are voter-approved, work is going to get done. A year from now, who knows. But I’ve been with my place for 15+ years. They hss as be been good to my family and I at every juncture in our lives. My sentiment for the future is still quite strong.",
        "created_utc": 1584607720,
        "id": "fkwvjw7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584636520.0
    },
    {
        "author": "gigantoir",
        "body": "Less than 12% of S&amp;P component stocks are above their 200 day moving averages lol here's top 10 by distance to the 200 day average\n\n|Symbol|LastClose|200 day rolling|Close – 200 %|\n:--|:--|:--|:--|\n|AMD|$47.46|$36.65|29.5%|\n|BIIB|$327.89|$261.75|25.3%|\n|AAPL|$298.81|$242.37|23.3%|\n|ALB|$84.30|$70.60|19.4%|\n|ADBE|$360.28|$303.78|18.6%|\n|AMAT|$60.16|$52.60|14.4%|\n|ATVI|$60.59|$53.04|14.2%|\n|AGN|$193.84|$170.12|13.9%|\n|ADSK|$190.83|$167.58|13.9%|\n|ANSS|$258.81|$228.90|13.1%|",
        "created_utc": 1583220493,
        "id": "fjchmyo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583249293.0
    },
    {
        "author": "currygoat",
        "body": "I see Netflix as adept strategists as they did not lose competitive advantage during your aforementioned technology transitions. Microsoft on the other hand, missed several technology transitions and came back last decade. While yes, they participated in the SaaS transition, that was one of many strategic changes Satya Nadella enacted when he took the helm.\n\nI see the SaaS transition as secular rather than company-specific driver. From my perspective, Adobe's primary competitive threat was piracy, but that was an industry-wide phenomenon (particularly in software and music) and not unique to the company. I'd say both of these industries as a whole came back due to the SaaS transition. You could literally pick any leading software company in 2013-2016 and watch as they reclaimed profits from piracy during this transition. Some that are transitioning later, like Autodesk, are going through that now. You could also argue that Universal, Warner, and Sony regained their competitive advantage, but it is actually Apple (via Apple Music) that participated in the SaaS transition (Spotify was SaaS only).",
        "created_utc": 1583435342,
        "id": "fjkwllf",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1583464142.0
    },
    {
        "author": "JPAMota",
        "body": "I kinda like Hasbro , Autodesk and a few gaming stocks right now . I mean .. hasbro at almost a 10 year low https://youtu.be/Xk2VfbYyEHU",
        "created_utc": 1584416387,
        "id": "fkpq8lo",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1584445187.0
    },
    {
        "author": "awest623",
        "body": "What's fucked is I'm supposed to return to Korea from tdy in 17 days. That got gutted",
        "created_utc": 1584141274,
        "id": "fkfs6jp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584170074.0
    },
    {
        "author": "GruelOmelettes",
        "body": "Dang, sold my QQQ put at lunch today for a little profit to get a share of TDY to bring that average down.",
        "created_utc": 1583953247,
        "id": "fk8c1ic",
        "score": 1,
        "subreddit": "investing",
        "created": 1583982047.0
    },
    {
        "author": "QuantumCrab27",
        "body": "Im army and supposed to go tdy in two days, really curious to see if that gets fucked.",
        "created_utc": 1584138555,
        "id": "fkfnt06",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584167355.0
    },
    {
        "author": "GruelOmelettes",
        "body": "Dang, sold my QQQ put at lunch today for a little profit to get a share of TDY to bring that average down.",
        "created_utc": 1583953247,
        "id": "fk8c1ic",
        "score": 1,
        "subreddit": "investing",
        "created": 1583982047.0
    },
    {
        "author": "Zerole00",
        "body": "While we're on the topic of DD, I've been holding shares of XLNX for about a year now - can anyone explain to me what they actually do?",
        "created_utc": 1584561489,
        "id": "fkv3vuk",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1584590289.0
    },
    {
        "author": "kenji4861",
        "body": "**UNUSUAL OPTIONS ACTIVITY for 4/17**\n\n**CALL**\n\n* ABT\n* AMD\n* AGN\n* WYNN\n* XLNX\n\n**PUTS**\n\n* ALL\n* AXP\n* AWK\n* ADI\n* XRX\n* ZBH",
        "created_utc": 1583986449,
        "id": "fk9y0k7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1584015249.0
    },
    {
        "author": "Pyrrhus246",
        "body": "Nokia went FPGA originally for their 5G cells. These are more flexible than ASICs so good for testing and network design but they are less power efficient. Power is a big issue in 5G as telco's will need 3-5x the amount of sites we needed for LTE. \n\nEricsson went ASIC from the beginning which was the right call. In addition Ericsson has higher mshare vs Nokia and 5G will use the same RAN as LTE - so do I swap my whole network out or buy better 5G tech from the company I already buy my network infrastructure from?\n\nThat said MNO's are suffering and will buy from whoever offers the best terms. Payment terms will beat the better tech for many MNO's.\n\nI would still buy ERIC over NOK calls but better rhan both would be to back the tech behind them both and that will be ASICs.\n\nAlso ERIC &amp; NOK make their money from support/services/maintenance contracts as the MNO's play them off against each other to drive down Capex costs. Neither will profit bigly from 5G until at least mid 2021 when network maintenance contracts scale up.\n\nTLDR: Look for 5G ASIC companies instead of FPGA manufacturers like Xilinx. If going long ERIC or NOK buy exp as far out as you can - selling network infrastructure is low margin they make money from network services.",
        "created_utc": 1584414036,
        "id": "fkpmzpm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584442836.0
    },
    {
        "author": "MrMcjibblets1990",
        "body": "XLNX about to break it's low again :) byeeeeeee. Too bad XEL is fucking following it",
        "created_utc": 1583854303,
        "id": "fk46hk0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583883103.0
    },
    {
        "author": "MrMcjibblets1990",
        "body": "TWTR and XLNX poooooootsssssss!!!!!!",
        "created_utc": 1583792191,
        "id": "fk237qf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583820991.0
    },
    {
        "author": "___AJ___",
        "body": "Expect the news to come out around April/May. Also make sure to buy calls on the company providing the chips\nhttps://thefly.com/landingPageNews.php?id=2980744&amp;headline=MRVL;XLNX;NOK;SSNLF-Xilinx-ASIC-displacement-Nokia-cost-pressures-to-benefit-Marvell-says-Needham",
        "created_utc": 1583084777,
        "id": "fj71xer",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583113577.0
    },
    {
        "author": "MrMcjibblets1990",
        "body": "XLNX, and TWTR weekly poots with XEL 4/17 calls. Thinking about averaging down on  XLNX",
        "created_utc": 1583848034,
        "id": "fk3whyl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583876834.0
    },
    {
        "author": "HotRodCircus",
        "body": "I'm eyeing XLNX 6/21 $90 calls at ~$6.13 in the middle of the bid/ask spread. Keep in mind they were at $91.74 during the first gigantic selloff and their 52-week high was $141.60 back in April of last year, but then again past performance isn't an indication etc etc",
        "created_utc": 1584382463,
        "id": "fko8zqm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584411263.0
    }
]