[
    {
        "author": "zjmoney",
        "body": "At least you're off the list. You can get fractional shares now",
        "created_utc": 1586928062,
        "id": "fngcfub",
        "permalink": "/r/wallstreetbets/comments/g1l6v5/117k_to_5k_i_sit_here_typing_this_as_i_drown_my/fngcfub/",
        "score": 1647,
        "subreddit": "wallstreetbets",
        "created": 1586956862.0
    },
    {
        "author": "BandicootDrip",
        "body": "Same things been happening to me for the last month now. About to start charging mfs for my economic outlook (which is just an aggregate of WSB shitposts).",
        "created_utc": 1586814277,
        "id": "fnbeu2e",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbeu2e/",
        "score": 967,
        "subreddit": "wallstreetbets",
        "created": 1586843077.0
    },
    {
        "author": "rturtle",
        "body": "My gramps once apologized for my family not having any money on thanksgiving. \n\nHe said that in WW2 there was a scam when you were stationed in the UK. You could exchange your dollars for pounds from grey market street dealers then come back to the base and exchange your pounds for dollars at a better rate. You could repeat for infinite money.  He said he spent his money on pussy instead. \n\nThis infinite money hack is working for the banks and hedge funds right now. They are buying up shit and then claiming it as assets to get more money from the fed and then buying up more shit to infinity.\n\nGramps squandering it all on pussy was way more honest.",
        "created_utc": 1586882321,
        "id": "fne3c23",
        "permalink": "/r/wallstreetbets/comments/g17zmf/feast_your_eyes_on_my_losses_689k_on_spx_puts/fne3c23/",
        "score": 813,
        "subreddit": "wallstreetbets",
        "created": 1586911121.0
    },
    {
        "author": "Swag-man",
        "body": "Similar experience. Got asked for trading advice by a friend for his new account yesterday. Told him that the market would give him an atomic wedgie and direct him to the bread line if he tried hopping in right now. “What are you talking about? Did you see last week? Best week since 1974!” The top is in boys.",
        "created_utc": 1586815329,
        "id": "fnbgwt9",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbgwt9/",
        "score": 514,
        "subreddit": "wallstreetbets",
        "created": 1586844129.0
    },
    {
        "author": "Venally",
        "body": "It's fun to speculate in isolation, but not really. Let's say Real Estate does collapse, whoops, there goes your REITS too. What's that? Ouch, there goes Banks. Services to Banks are now in panic. Observers go wild. People flee into the streets. Anarchy begins. Carole Baskin definitely killed her husband.\n\nI don't know, but there's definitely chain reactions in the economy, and sector crashes don't really happen in isolation.",
        "created_utc": 1586818055,
        "id": "fnbm9bo",
        "permalink": "/r/wallstreetbets/comments/g0tdhg/why_we_wont_see_major_drops_anymore/fnbm9bo/",
        "score": 498,
        "subreddit": "wallstreetbets",
        "created": 1586846855.0
    },
    {
        "author": "NoCountryForOldPete",
        "body": "My canned response now is \"Take the quantity of money that you're looking to \"invest\", buy 25% now, 15% more in a week, and 10% every week after that.\" At least that way if there is any significant downturn they'll have spread the pain out a little and won't hold me accountable when they can't make their car payments.",
        "created_utc": 1586814784,
        "id": "fnbfttf",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbfttf/",
        "score": 481,
        "subreddit": "wallstreetbets",
        "created": 1586843584.0
    },
    {
        "author": "thekingoftherodeo",
        "body": "For anyone wondering about the reserve build they speak to, I'd like to add a couple of points;\n\n- It includes the impact of adoption of the new credit loss accounting standard (CECL /ASC 326). \n\n- Key difference between old GAAP and new GAAP is that you must now estimate the lifetime expected credit loss for your loans adjusted for forecasted conditions. **So as of these 3/31 results, the increase in expected credit loss from the current portfolio over its entire life is $6.8B - to the extent of the capability &amp; accuracy of JPM's model, this is as bad is it gets.** \n\n- Day 1 (1/1/20 no COVID) impact goes through retained earnings (i.e. no income statement impact), but subsequent measurement (i.e. 3/31/20 big COVID) goes through income. Hence the massive pop in reserves.\n\n- They're likely using a multi scenario weighted model and would have shifted the weightings to reflect the COVID environment; think something like 80-10-10 of most stressed economic environment:moderate stressed economic environment:baseline\n\n- Subsequent Q's won't see as big an income statement impact as the delta between prior Q provision (officially Allowance for Credit Losses) and current Q provision shouldn't be as vast.\n\n- You effectively had a black swan event for this adoption where 1/1/20 (it's effective date), you wouldn't have weighted a stressed economic environment as heavily (if at all, we nearly had the tip in 30,000 DJI almost as recently as Feb), versus 3/31/20 the remeasurement date where you have to account for, well virtually total cessation of normal economic activity.\n\nSo when they speak to building reserves (FASB will have a conniption at that language btw), they've assessed their entire portfolio for lifetime expected credit loss. You see the numbers pop particularly in cards, which are unsecured and your loss given default would to all intents and purposes be 100% vs mortgage loans where you've collateral. \n\nAlso important to bear in mind that since ~2018 the bigger lenders have been keeping higher quality mortgage loans on the books (basically they aren't selling top quality 800 FICO stuff to FNMA FMCC much if at all). Those ratings factor into the modeling which leads me to believe that their +$6.8B is pretty accurate.\n\nJPM are very well placed to weather this, as they were in 2008. It's a well run shop under Dimon.\n\n**TL;DR: The EPS miss is due to new accounting rules &amp; watch out for any bank who chooses to defer implementation (CARES relief) as it likely means their numbers on the 3/31 run were pretty bad**",
        "created_utc": 1586867495,
        "id": "fndduem",
        "permalink": "/r/investing/comments/g13qp8/jpmorgan_reports_big_decline_in_firstquarter/fndduem/",
        "score": 476,
        "subreddit": "investing",
        "created": 1586896295.0
    },
    {
        "author": "nubface1001",
        "body": "I heard he blew it all and is working at DQ now. Poor guy",
        "created_utc": 1586978081,
        "id": "fnidcg2",
        "permalink": "/r/wallstreetbets/comments/g1ykwh/warren_buffett_is_a_gay_bear/fnidcg2/",
        "score": 471,
        "subreddit": "wallstreetbets",
        "created": 1587006881.0
    },
    {
        "author": "Paging-Dr-Trollman",
        "body": "Well, he has successfully flattened the curve at least!\n\nIs pornhub still free now?",
        "created_utc": 1587669036,
        "id": "focajfg",
        "permalink": "/r/wallstreetbets/comments/g6pmji/for_the_first_time_in_my_life_i_feel_at_home/focajfg/",
        "score": 390,
        "subreddit": "wallstreetbets",
        "created": 1587697836.0
    },
    {
        "author": "hodl_for_the_moon",
        "body": "Wow I went from 25k to 1k last week and then now i’m at $200 lol",
        "created_utc": 1586907704,
        "id": "fnfgoww",
        "permalink": "/r/wallstreetbets/comments/g1gkln/healthcare_worker_on_the_front_lines_lost_it_all/fnfgoww/",
        "score": 337,
        "subreddit": "wallstreetbets",
        "created": 1586936504.0
    },
    {
        "author": "AbsolutelyAutistic",
        "body": "Nice. Now roll it all in to $TSLA put debit spreads.",
        "created_utc": 1586958048,
        "id": "fnh9lir",
        "permalink": "/r/wallstreetbets/comments/g1s3n1/yolo_update_160k_on_my_spxspy_puts_in_16_hours/fnh9lir/",
        "score": 318,
        "subreddit": "wallstreetbets",
        "created": 1586986848.0
    },
    {
        "author": "justseeyoutonight",
        "body": "This shows how broken our economy has genuinely become and how poorly run much of corporate America now is.\n\nI'm not talking as a socialist either, I'm talking as a capitalist. A country where the central bank has to buy the junk debt of companies because too many of them took on too much is not a capitalist economy, and we'll pay for it for decades in a much less dynamic, innovative country.",
        "created_utc": 1587679029,
        "id": "fod2i28",
        "permalink": "/r/stocks/comments/g6vp3b/there_are_only_two_us_companies_left_with_aaa/fod2i28/",
        "score": 302,
        "subreddit": "stocks",
        "created": 1587707829.0
    },
    {
        "author": "tiny_cat_bishop",
        "body": "now you're getting it. protip: trade as if the market is going to go in the direction that will make the rich people richer.\n\n*edit: momentary dyslexia",
        "created_utc": 1586873641,
        "id": "fndn42k",
        "permalink": "/r/wallstreetbets/comments/g15eo0/stonks_will_only_go_down_when_its_convenient_for/fndn42k/",
        "score": 299,
        "subreddit": "wallstreetbets",
        "created": 1586902441.0
    },
    {
        "author": "GuiltyGun",
        "body": "Actually the market is going to crash cause last week I bought exactly one SPY 280 call. Now hopefully it crashes hard enough my long puts work out.\n\nSometimes you've gotta psych the system.",
        "created_utc": 1586814654,
        "id": "fnbfklp",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbfklp/",
        "score": 299,
        "subreddit": "wallstreetbets",
        "created": 1586843454.0
    },
    {
        "author": "FinndBors",
        "body": "Why is my taxpayer money going into 70% grants to corporations? Seriously wtf is this? It is 10 times worse than what they did in the GFC and that was already extremely unpopular. Why aren’t people up in arms about this now?",
        "created_utc": 1586908776,
        "id": "fnfin8p",
        "permalink": "/r/investing/comments/g1e6mq/us_airlines_treasury_reach_agreement_in_principle/fnfin8p/",
        "score": 299,
        "subreddit": "investing",
        "created": 1586937576.0
    },
    {
        "author": "TheCuriousKea",
        "body": "I watched the Big Short and I too am now a consummate professional investor 🧠",
        "created_utc": 1587067498,
        "id": "fnm9mx5",
        "permalink": "/r/wallstreetbets/comments/g2mfdg/we_are_forgetting_the_most_important_scene_from/fnm9mx5/",
        "score": 290,
        "subreddit": "wallstreetbets",
        "created": 1587096298.0
    },
    {
        "author": "smallchimpu",
        "body": "Run now , cash out , unsub wsb rn ! Please ,have seen a lot of stories like yours , sadly the ending is catastrophic ! Iay sound corny but run now",
        "created_utc": 1586379206,
        "id": "fmtug84",
        "permalink": "/r/wallstreetbets/comments/fxellq/this_bear_learned_to_stop_fighting_the_feds_20k/fmtug84/",
        "score": 266,
        "subreddit": "wallstreetbets",
        "created": 1586408006.0
    },
    {
        "author": "tryexceptifnot1try",
        "body": "Dude TSLA is back up to fucking $700 with 85% of it's production shut down for the next couple months at least. That is a company which needed to thread the needle not to die because of it's cash flow and debt. I am actually starting to feel better about the puts I bought yesterday as the put/call ratio is now back to the all-time lows we saw in January. The amount of bullish sentiment right now is completely insane. Problem is we have time tied to options so I need to start rethinking my August puts that are going to get kicked in the nuts today.",
        "created_utc": 1586866635,
        "id": "fndcrdx",
        "permalink": "/r/wallstreetbets/comments/g13ode/jpmorgan_posts_earnings_of_078_missing_estimate/fndcrdx/",
        "score": 261,
        "subreddit": "wallstreetbets",
        "created": 1586895435.0
    },
    {
        "author": "AloneForever",
        "body": "Incredibly bullish, now they don't have to deliver all those planes they promised. Really great news for Boeing.",
        "created_utc": 1586876899,
        "id": "fndsyfj",
        "permalink": "/r/wallstreetbets/comments/g175n9/boeing_customers_cancel_staggering_150_max_plane/fndsyfj/",
        "score": 256,
        "subreddit": "wallstreetbets",
        "created": 1586905699.0
    },
    {
        "author": "Commissar_Genki",
        "body": "Sir, this is now a fascist state.",
        "created_utc": 1586870730,
        "id": "fndift8",
        "permalink": "/r/wallstreetbets/comments/g15eo0/stonks_will_only_go_down_when_its_convenient_for/fndift8/",
        "score": 254,
        "subreddit": "wallstreetbets",
        "created": 1586899530.0
    },
    {
        "author": "dont-speak-mostly",
        "body": "Now re-loan that money at a higher rate and become a big bank.",
        "created_utc": 1586780857,
        "id": "fn9p6zn",
        "permalink": "/r/wallstreetbets/comments/g0hw81/personal_loans_the_next_bubble/fn9p6zn/",
        "score": 249,
        "subreddit": "wallstreetbets",
        "created": 1586809657.0
    },
    {
        "author": "flaccid_burp",
        "body": "Don’t forget the part where banks now have zero reserve requirement. Not as if you have to back up all the loans with something real anyway",
        "created_utc": 1586804481,
        "id": "fnavdeq",
        "permalink": "/r/wallstreetbets/comments/g0p8t5/jay_fucking_powell_ladies_and_gentlemen/fnavdeq/",
        "score": 246,
        "subreddit": "wallstreetbets",
        "created": 1586833281.0
    },
    {
        "author": "AGayBlackMidget",
        "body": "I can tell you right now that it (social distancing) won't last until 2022.",
        "created_utc": 1586953590,
        "id": "fnh3505",
        "permalink": "/r/wallstreetbets/comments/g1quhn/coronavirus_study_warns_social_distancing_may/fnh3505/",
        "score": 236,
        "subreddit": "wallstreetbets",
        "created": 1586982390.0
    },
    {
        "author": "fishythepete",
        "body": "Of course Tesla is worth more now that they’re not making cars.",
        "created_utc": 1586795223,
        "id": "fnacs79",
        "permalink": "/r/wallstreetbets/comments/g0m6v5/tesla_is_going_to_the_moon/fnacs79/",
        "score": 230,
        "subreddit": "wallstreetbets",
        "created": 1586824023.0
    },
    {
        "author": "modestsmets",
        "body": "congratulations , Sell now don't too greed learn from analfarmer2",
        "created_utc": 1586915611,
        "id": "fnfual5",
        "permalink": "/r/wallstreetbets/comments/g1ioqa/191k_295k_in_2_weeks/fnfual5/",
        "score": 223,
        "subreddit": "wallstreetbets",
        "created": 1586944411.0
    },
    {
        "author": "Watblieft",
        "body": "As grumpy bear, I decided to go with the flow and buy calls of the least appealing stock I could think of. As a protest. It became Gamestop. I'm up 140% on my calls in two days and it compensated the losses of my puts. \n\nI feel extra stupid now.",
        "created_utc": 1586900458,
        "id": "fnf2zal",
        "permalink": "/r/wallstreetbets/comments/g1duq3/what_are_your_moves_tomorrow_april_15_2020/fnf2zal/",
        "score": 219,
        "subreddit": "wallstreetbets",
        "created": 1586929258.0
    },
    {
        "author": "UnwantedRelishMan",
        "body": "I remember in junior high the high schoolers were having their ACT tests. They were on break and we went up to one and asked how the test was. He just said “ahhh idk I just put no for every answer” \n\nThe dude smokes meth and fixes lawnmowers now.",
        "created_utc": 1586978037,
        "id": "fnid953",
        "permalink": "/r/wallstreetbets/comments/g1y9et/every_autist_here/fnid953/",
        "score": 218,
        "subreddit": "wallstreetbets",
        "created": 1587006837.0
    },
    {
        "author": "frostbiite1790",
        "body": "The printer can now go super saiyan 2",
        "created_utc": 1586971364,
        "id": "fnhzcdg",
        "permalink": "/r/wallstreetbets/comments/g1wbe0/contest_what_news_will_the_fedjpowtrump_announce/fnhzcdg/",
        "score": 217,
        "subreddit": "wallstreetbets",
        "created": 1587000164.0
    },
    {
        "author": "Uniqueguy264",
        "body": "It’s $-40 now. That’s like $-2 a gallon of gas",
        "created_utc": 1587407613,
        "id": "fo07vjt",
        "permalink": "/r/wallstreetbets/comments/g4y9z1/hes_already_dead/fo07vjt/",
        "score": 215,
        "subreddit": "wallstreetbets",
        "created": 1587436413.0
    },
    {
        "author": "Boardatworck",
        "body": "People here used to be at least pretending to be savvy investors. There used to be a lot of people here who had normal jobs and we're using trading as some way to get ahead so you could retire early. At least 50 percent of the DD was intelligent and logically sounds. \nNow it seems like everyone here is just a gambling addict with no job hoping to get rich so they don't have get a real job. Everytime the market doesn't follow their retarded advice everyone keeps posing the same economically illiterate memes. There are still some intelligent people here, but the retards are crowding them all out.",
        "created_utc": 1588109875,
        "id": "fovyq4o",
        "permalink": "/r/wallstreetbets/comments/g9vsgk/state_of_the_sub/fovyq4o/",
        "score": 215,
        "subreddit": "wallstreetbets",
        "created": 1588138675.0
    },
    {
        "author": "Skwigle",
        "body": "I'm just gonna jump in here because it isn't the first time I've seen \"short squeeze\" seemingly used incorrectly and I feel like maybe some of you don't really understand what it is. The chart we are seeing now cannot be a short squeeze nor can it be a \"short squeeze in reverse\".\n\nShorting a stock means you're borrowing shares from your broker and selling them to someone at the current price. The idea being that you think the price will go down and then you can buy them back at a lower price. So if you short XYZ today at $100/share and buy them back tomorrow at $90/share, you've made $10/share. If, on the other hand, the stock goes up to $110, you've lost $10/share.\n\nNow the tricky thing about shorting a stock is that there is no limit to the upside (of the stock price). When you buy a stock, the maximum you can lose is 100%. You buy it at $100 and it goes to zero, you've lost $100/share and can't lose more. That's it. But if you short a stock, your losses are theoretically unlimited. If you shorted TSLA at $300 you'd be in a world of pain when it hit $950 because that means your losses are $650/share at that point. Your downside (on the trade) is unlimited but your upside is limited to 100% (and that's if the shares go to zero).\n\nFor these reasons, you don't want to short a stock and hold on to it forever like you might if you were long. The pain of holding onto it as the losses mount become too much to bear, but also because you don't have an unlimited amount of money in your account. At some point, you will be FORCED to buy back the stock before the losses outstrip your funds.\n\nSo a short squeeze occurs after a stock has run up considerably and reaches a point where everyone who has shorted the stock is essentially forced to buy it back before it goes too high. At this point, you'll see a huge spike on top of a run up.\n\nThere is no real opposite to a short squeeze because when you hold stocks long, your max loss is 100% and no one is ever forced to sell. You can just hold on until zero. In real life, however, you will often reach a point where people just don't want to lose more money and get out anyway. When everyone is running for the exits and sells their stock at the same time, you'll see a huge downward spike after a run down. This is usually called capitulation and often signals a reversal to an uptrend.",
        "created_utc": 1586798860,
        "id": "fnak2bu",
        "permalink": "/r/wallstreetbets/comments/g0kuea/look_at_the_volume_for_today/fnak2bu/",
        "score": 213,
        "subreddit": "wallstreetbets",
        "created": 1586827660.0
    },
    {
        "author": "krispyfriedyuca",
        "body": "Reminds me as a Realtor, back in 2016, the house flipping business was at its peak and all kinds of average joes and beckies would say shit like “I wanna start investing in property, if I can find one for $100k do some work on it and sell it for $150k that’d be ideal”\n\nBitch first of all you and everybody else wants to find a nice juicy deal to flip.\n\nSecond of all most of the REO inventory is drying up at this point, and any distressed property that is actively listed for sale is being bid up too high for you to squeeze a reasonable margin.\n\nThird of all what the fuck do you know about buying, rehabbing and selling houses?? You think you see that shit on TV and think “hey I could do that”\n\nSame idiocy is happening now with the stock market. All of a sudden some of my acquaintances who don’t even know what the fuck a stonk was a month ago, would like to invest in some airlines because “it’s gonna go up and I wanna double my money” \n\nI welcome that dumb money. More fish come into the game and the sharks feast. (I’m more of a puffer fish but I’ll still take my share)",
        "created_utc": 1586818714,
        "id": "fnbnj7e",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbnj7e/",
        "score": 209,
        "subreddit": "wallstreetbets",
        "created": 1586847514.0
    },
    {
        "author": "Phizzsicks",
        "body": "If you're pissed now, wait till a vaccine is made, the quarantine is lifted and sales are up then the market decides to  crash",
        "created_utc": 1586873137,
        "id": "fndm9ip",
        "permalink": "/r/wallstreetbets/comments/g16302/well_at_this_point_31103_for_spy_is_where_all/fndm9ip/",
        "score": 209,
        "subreddit": "wallstreetbets",
        "created": 1586901937.0
    },
    {
        "author": "NoCountryForOldPete",
        "body": "I swear, I'm going to break out in a cold sweat from now on when someone says \"So, I've been thinking about buying some stocks...\", and then expects me to give them good advice, but really they're talking to the market equivalent of Gollum and I'm waffling like I haven't seen direct sunlight in a decade.",
        "created_utc": 1586818854,
        "id": "fnbnsmy",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbnsmy/",
        "score": 196,
        "subreddit": "wallstreetbets",
        "created": 1586847654.0
    },
    {
        "author": "Sonicmansuperb",
        "body": "I've come to make an announcement. u/John-TeamQuestrade's a bitch ass motherfucker, you pissed on my FUCKING wife, that's right, he took his optioned fucking cally dick out, and he pissed on my FUCKING wife and he said his strike was \"thiiiiss biiigg\". And I said \"That's risky!\" so I'm making a callout post on my wallstreetbets . com: u/John-TeamQuestrade, you got a small strike, it's the size of this walnut except WAY smaller, and guess what, here's what my call looks like BGHGGHGHGHGHG. That's right baby! All covered, no shorts, no holding! Look at that it looks like 2 calls and a put! He fucked my wife, so guess what I'M GONNA FUCK THE EARTH. That's right this is what you get! MY SUPER LASER PISS! Except I'm not gonna piss on the Earth, I'm gonna go higher, I'm pissing on THE DOW!! How do you like that Buffet?? I pissed on THE DOW you IDIOT!! You have 23 hours before the piss Drrroplets hit the fucking Earth, now get out of my fucking sight before I piss on you too!",
        "created_utc": 1586383832,
        "id": "fmu3els",
        "permalink": "/r/wallstreetbets/comments/fxbwal/correction_all_bans_have_been_cleared_except_for/fmu3els/",
        "score": 190,
        "subreddit": "wallstreetbets",
        "created": 1586412632.0
    },
    {
        "author": "VICInvestor11",
        "body": "The bank posted quarterly per share earnings of 78 cents, a figure that  missed analyst’s $1.84  estimate as the company added $6.8 billion to  loan loss provisions, JPMorgan said Tuesday in a release. \n\nNow THAT'S bullish, GREEN GREEN GREEN",
        "created_utc": 1586863507,
        "id": "fnd99gy",
        "permalink": "/r/investing/comments/g13qp8/jpmorgan_reports_big_decline_in_firstquarter/fnd99gy/",
        "score": 190,
        "subreddit": "investing",
        "created": 1586892307.0
    },
    {
        "author": "Vertex_2",
        "body": "Definitely need to buy calls now",
        "created_utc": 1586867923,
        "id": "fndeekw",
        "permalink": "/r/wallstreetbets/comments/g14r5n/imf_slashes_growth_forecasts_says_world_will_very/fndeekw/",
        "score": 189,
        "subreddit": "wallstreetbets",
        "created": 1586896723.0
    },
    {
        "author": "StaticBroom",
        "body": "The market didn’t split from reality.  Reality split from the market.\n\nDoesn’t make sense? Good. Now you understand.",
        "created_utc": 1586994095,
        "id": "fnj8pdy",
        "permalink": "/r/StockMarket/comments/g22xuz/wall_streets_bulls_drive_epic_market_split_from/fnj8pdy/",
        "score": 180,
        "subreddit": "StockMarket",
        "created": 1587022895.0
    },
    {
        "author": "Thorshammer18",
        "body": "Yesterday red futures didnt matter. Now green futures matter. Crazy double talk.",
        "created_utc": 1586833979,
        "id": "fncd9t0",
        "permalink": "/r/wallstreetbets/comments/g0xl1l/the_vix_is_now_below_40_futures_up_15_across_the/fncd9t0/",
        "score": 173,
        "subreddit": "wallstreetbets",
        "created": 1586862779.0
    },
    {
        "author": "Hypoglybetic",
        "body": "How much fucking money do you have that you can put $300k into options that fucking expire 10 days from now?",
        "created_utc": 1586901792,
        "id": "fnf5jfb",
        "permalink": "/r/wallstreetbets/comments/g1d0yi/bought_nearly_300k_in_spxspy_apr24_282_puts_at/fnf5jfb/",
        "score": 170,
        "subreddit": "wallstreetbets",
        "created": 1586930592.0
    },
    {
        "author": "jakemoffsky",
        "body": "As a gambling addict I can confirm this is true, my wife and her boyfriend really appreciate that i'm an investor now and not a degenerate gambler.\n\nSpy 250p 6/15",
        "created_utc": 1586897844,
        "id": "fnexua5",
        "permalink": "/r/wallstreetbets/comments/g1ba0j/all_revenues_that_would_normally_goto_casinos_are/fnexua5/",
        "score": 166,
        "subreddit": "wallstreetbets",
        "created": 1586926644.0
    },
    {
        "author": "Developer4Diabetes",
        "body": "Am I reading this stuff right?!?! 70% grant which means that's a 70% GIFT?!?! Are you kidding me?! I am fuming! That is far worse than the last crisis! How is that even allowed, I am so angry. Tbh I was fine with stock buybacks, because I thought they would pay the price for it, but now.... we are literally paying their bills for them... that cannot be right",
        "created_utc": 1586909149,
        "id": "fnfjay8",
        "permalink": "/r/investing/comments/g1e6mq/us_airlines_treasury_reach_agreement_in_principle/fnfjay8/",
        "score": 164,
        "subreddit": "investing",
        "created": 1586937949.0
    },
    {
        "author": "thekingoftherodeo",
        "body": "For everyone wondering why the big miss (&amp; you're going to see this with every bank btw).\n\n- It includes the impact of adoption of the new credit loss accounting standard (CECL).\n\n- Day 1 (1/1/20 no COVID) impact goes through retained earnings (i.e. no income statement impact), but subsequent measurement (i.e. 3/31/20 big COVID) goes through income. Hence the massive pop in reserves.\n\n- Key difference between old GAAP and new GAAP is that you must now estimate the lifetime expected credit loss for your loans adjusted for forecasted conditions\n\n- They're likely using a multi scenario weighted model and would have shifted the weightings to reflect the COVID environment; think something like 80-10-10 of most stressed economic environment:moderate stressed economic environment:baseline\n\n- Subsequent Q's won't see as big an income statement impact as the delta between prior Q provision (officially Allowance for Credit Losses) and current Q provision shouldn't be as vast.\n\n- You effectively had a black swan event for this adoption where 1/1/20 (it's effective date), you wouldn't have weighted a stressed economic environment as heavily (if at all, we nearly had the tip in 30,000 DJI almost as recently as Feb), versus 3/31/20 the remeasurement date where you have to account for, well virtually total cessation of normal economic activity.\n\nSo when they speak to building reserves (FASB will have a conniption at that language btw), they've assessed their entire portfolio for lifetime expected credit loss. You see the numbers pop particularly in cards, which are unsecured and your loss given default would to all intents and purposes be 100% vs mortgage loans where you've collateral.\n\nAlso important to bear in mind that since ~2018 the bigger lenders have been keeping higher quality mortgage loans on the books (basically they aren't selling top quality 800 FICO stuff to FNMA FMCC much if at all).\n\nJPM are very well placed to weather this, as they were in 2008. It's a well run shop under Daddy Dimon.\n\n**TL;DR: Watch out for the banks who elect to defer CECL implementation because it likely meant their models adjusted for COVID gave them numbers they didn't want to push through Q1 earnings**\n\n**TL;DR of the TL;DR = Accounting rules fucked EPS in the ass but it shouldn't be as volatile going forward**",
        "created_utc": 1586868133,
        "id": "fndeokh",
        "permalink": "/r/wallstreetbets/comments/g13ode/jpmorgan_posts_earnings_of_078_missing_estimate/fndeokh/",
        "score": 164,
        "subreddit": "wallstreetbets",
        "created": 1586896933.0
    },
    {
        "author": "Chabubu",
        "body": "Now that we have Trump, I miss Bush...  he was an idiot too, but at least he knew he was.",
        "created_utc": 1586968755,
        "id": "fnhtvcs",
        "permalink": "/r/wallstreetbets/comments/g1v8ty/please_sir_just_one_profitable_trade/fnhtvcs/",
        "score": 163,
        "subreddit": "wallstreetbets",
        "created": 1586997555.0
    },
    {
        "author": "IAmABlubFish",
        "body": "Maybe I'm just old, but after purchasing multiple \"new\" electronics from Amazon and seeing they were already used and returned I only buy electronics from Best Buy now.  Nothing better than wearing your new noise canceling headphones and seeing they are already setup for bluetooth with someone else's name on them.",
        "created_utc": 1586957294,
        "id": "fnh8egs",
        "permalink": "/r/wallstreetbets/comments/g1rnkf/spy_5000_eod_best_buy_to_furlough_about_51000/fnh8egs/",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1586986094.0
    },
    {
        "author": "bowlersan",
        "body": "You realize this is just some fucking asshat working over there WITH NOTHING BETTER TO DO WITH THEIR TIME reading this comment right now. Probably an intern\n\nYeah I'm speaking to you buddy. The more you spew at this guy the more idiotic and self-harming your actions look. Stop feeding him, because he's just going to keep on posting, and I'm running out of popcorn\n\nPS I fucked your wife",
        "created_utc": 1585773416,
        "id": "fm5i6f5",
        "permalink": "/r/wallstreetbets/comments/ft80y4/got_a_call_from_police_regarding_threats_to/fm5i6f5/",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1585802216.0
    },
    {
        "author": "nightcoder2020",
        "body": "This. Today on Marketwatch \"GOLDMAN says the bottom is in!\" I read this as \"OK Tards. NOW its puts time for realsies\"",
        "created_utc": 1586812038,
        "id": "fnbaeil",
        "permalink": "/r/wallstreetbets/comments/g0psrf/a_short_timeline_of_goldmans_bullshit/fnbaeil/",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1586840838.0
    },
    {
        "author": "buyitout",
        "body": "the markets are crazy right now, at this rate we might hit all time highs tomorrow!",
        "created_utc": 1587073488,
        "id": "fnmlari",
        "permalink": "/r/investing/comments/g2nvcr/gilead_jumps_9_after_patients_in_a_trial_were/fnmlari/",
        "score": 157,
        "subreddit": "investing",
        "created": 1587102288.0
    },
    {
        "author": "Vyruz2",
        "body": "The most bullish news ever, ~22 million people total now unemployed instead of 23 million. Great numbers, the best really",
        "created_utc": 1587040938,
        "id": "fnkvdmv",
        "permalink": "/r/wallstreetbets/comments/g2e1la/5245_million_weekly_jobless_claims/fnkvdmv/",
        "score": 152,
        "subreddit": "wallstreetbets",
        "created": 1587069738.0
    },
    {
        "author": "CanopyGains",
        "body": "No, no, $6 Trillion now..",
        "created_utc": 1586883055,
        "id": "fne4sgp",
        "permalink": "/r/wallstreetbets/comments/g18kt2/putshire_cashaway/fne4sgp/",
        "score": 149,
        "subreddit": "wallstreetbets",
        "created": 1586911855.0
    },
    {
        "author": "Speeder97",
        "body": "That's because the market has balanced and is now self-sustaining",
        "created_utc": 1586812237,
        "id": "fnbasec",
        "permalink": "/r/wallstreetbets/comments/g0rmy1/seems_like_jpows_ink_cartridge_is_running_a_bit/fnbasec/",
        "score": 148,
        "subreddit": "wallstreetbets",
        "created": 1586841037.0
    },
    {
        "author": "chocslaw",
        "body": "Great job, now we get to do the sideways shuffle until they all expire worthless.   WAY TO GO",
        "created_utc": 1586816688,
        "id": "fnbjlkq",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbjlkq/",
        "score": 146,
        "subreddit": "wallstreetbets",
        "created": 1586845488.0
    },
    {
        "author": "rtc824",
        "body": "We just hit the top of the bull trap at SPY 273\n\nIf it goes above 273 in the next 30 days I will accept a 6 month ban.\n\n*Edit. Please upvote and make this higher so that the mods see and hold me accountable. I now have skin in the game. Positions? MAR $50p 5/15, AAPL $210p 5/15.",
        "created_utc": 1586294260,
        "id": "fmq7eep",
        "permalink": "/r/wallstreetbets/comments/fwsofr/what_are_your_moves_tomorrow_april_08_2020/fmq7eep/",
        "score": 145,
        "subreddit": "wallstreetbets",
        "created": 1586323060.0
    },
    {
        "author": "rmb91896",
        "body": "I did this with calls about a year ago. Applied for 3 loans online with excellent credit. Approved for all 3. 75k. All of it is gone now- credit is destroyed with nothing to show for it.",
        "created_utc": 1586782711,
        "id": "fn9ripa",
        "permalink": "/r/wallstreetbets/comments/g0hw81/personal_loans_the_next_bubble/fn9ripa/",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1586811511.0
    },
    {
        "author": "leveredlloyd",
        "body": "Thanks Kevin. Now let’s take a look at today’s market movers. It looks like BA continues to sh*t bricks, while TSLA has surprisingly been performing well squeezing out short sellers.... **5 min ad about E-Trade commission free trading, followed by Comcast’s “we’re connecting people all over the world”... Jim, tell us what you’re seeing in rates today... crossing over to you @ricksantelli, let’s look at the 10yr curve, that’s the canary in the coal mine",
        "created_utc": 1586373990,
        "id": "fmtjwm9",
        "permalink": "/r/wallstreetbets/comments/fxcw4i/special_guest_on_cnbc_starter_pack/fmtjwm9/",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1586402790.0
    },
    {
        "author": "Hot_Pink_Unicorn",
        "body": "Google makes most of its money on advertising, now that's gone. \n\nApple can only sell so many $1.2k phones during an economic downturn. \n\nMSFT still will make butt loads of $$$ but it's azure will suffer. \n\nAmazon probably will replace most of the retail but if people can't spend money then AMZN won't be as profitable. \n\n&amp;#x200B;\n\nFB is screwed since it's all ads. \n\nNVidia - has 50% of its profits are from consumer graphics. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI'm thinking the only reason all the tech stocks are booming is because they are relatively safe in the short term, long term they will still take a hit.",
        "created_utc": 1586823426,
        "id": "fnbw05x",
        "permalink": "/r/wallstreetbets/comments/g0tdhg/why_we_wont_see_major_drops_anymore/fnbw05x/",
        "score": 143,
        "subreddit": "wallstreetbets",
        "created": 1586852226.0
    },
    {
        "author": "REALSTOOPID",
        "body": "JPow has me so twisted this morning red is like when Ramsey Bolton let Theon escape prison and then cut his dick off for actually doing it. And then when he was actually getting rescued he just stayed in his cage because he was trained so well. Thats how I feel right now. This must be another trick",
        "created_utc": 1586949291,
        "id": "fngy856",
        "permalink": "/r/wallstreetbets/comments/g1pvny/daily_discussion_thread_april_15_2020/fngy856/",
        "score": 142,
        "subreddit": "wallstreetbets",
        "created": 1586978091.0
    },
    {
        "author": "Raccoonpug",
        "body": "Well...im waiting?... my put doesnt have all day now!!!!",
        "created_utc": 1586873543,
        "id": "fndmy46",
        "permalink": "/r/wallstreetbets/comments/g166y6/goldman_speaks_again_downturn_will_be_4_times/fndmy46/",
        "score": 139,
        "subreddit": "wallstreetbets",
        "created": 1586902343.0
    },
    {
        "author": "lsharvard200",
        "body": "Haha it wasn't overdue... I just kind of went crazy buying stuff on my CC last couple of weeks maxing out my credit line after I saw my account value jump. Im gonna quit my job tomorrow and enjoy life a bit now :)",
        "created_utc": 1588213408,
        "id": "fp0oef4",
        "permalink": "/r/wallstreetbets/comments/gan19b/turned_500k_into_21mm_in_a_couple_of_weeks_thanks/fp0oef4/",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1588242208.0
    },
    {
        "author": "NZ_Troll",
        "body": "Typical living condition of a bear since the printer went into overdrive. Wife's BF kicked him out and now he's drinking his own piss. Don't do puts kids.",
        "created_utc": 1588204539,
        "id": "fp08my6",
        "permalink": "/r/wallstreetbets/comments/gak2gf/i_said_if_spy_closed_green_today_i_would_drink_my/fp08my6/",
        "score": 137,
        "subreddit": "wallstreetbets",
        "created": 1588233339.0
    },
    {
        "author": "lolnopound",
        "body": "In alternate reality when coronavirus hit -\n\nWSB: \"Stocks crashed way too much way too quickly. The government and federal reserve aren't going to let the entire economy collapse, I'm buying calls now in expectation of the stimulus and QE.\"\n\nJerome Powell: \"Sorry, I don't believe we should be manipulating markets. If a company can't survive a 2 month shutdown then they shouldn't be in business.\"\n\nWSB: \"How is the fed just doing nothing while all these jobs are lost and businesses are bankrupt?? The game is so fucking rigged.\"",
        "created_utc": 1586782032,
        "id": "fn9qmqj",
        "permalink": "/r/wallstreetbets/comments/g0gvfn/daily_discussion_thread_april_13_2020/fn9qmqj/",
        "score": 136,
        "subreddit": "wallstreetbets",
        "created": 1586810832.0
    },
    {
        "author": "Salmonfisher420",
        "body": "Boeing is down from $440 to $130, one of the biggest market movers and you just now decide to buy puts? Welcome home brother",
        "created_utc": 1587052295,
        "id": "fnlesyd",
        "permalink": "/r/wallstreetbets/comments/g2hg59/i_got_puts_on_ba/fnlesyd/",
        "score": 134,
        "subreddit": "wallstreetbets",
        "created": 1587081095.0
    },
    {
        "author": "bubbagumpskrimps222",
        "body": "You are home now brother 🙏",
        "created_utc": 1587424485,
        "id": "fo12l27",
        "permalink": "/r/wallstreetbets/comments/g53mh0/i_brought_oil_contract_and_cant_close_20k_loss_in/fo12l27/",
        "score": 133,
        "subreddit": "wallstreetbets",
        "created": 1587453285.0
    },
    {
        "author": "theycallmeryan",
        "body": "I didn’t let it happen, just a cool side effect. I like the positions I’m in right now so I have no reason to sell them.",
        "created_utc": 1587591444,
        "id": "fo87sf5",
        "permalink": "/r/wallstreetbets/comments/g67cuw/69420_in_a_month/fo87sf5/",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1587620244.0
    },
    {
        "author": "GoldenKaze",
        "body": "Central bankers are all around the world are hoping that that liquidity doesn't end up in the supermarket. Traditionally QE has only gone to the banks but now they are you spending it to give free shit to people so who knows if inflation in really dead",
        "created_utc": 1586866844,
        "id": "fndd0ti",
        "permalink": "/r/wallstreetbets/comments/g12zl6/stonkbob_tells_it_like_it_is/fndd0ti/",
        "score": 130,
        "subreddit": "wallstreetbets",
        "created": 1586895644.0
    },
    {
        "author": "khizoa",
        "body": "now he owes robinhood a free stock",
        "created_utc": 1587664815,
        "id": "fobxn62",
        "permalink": "/r/wallstreetbets/comments/g6pmji/for_the_first_time_in_my_life_i_feel_at_home/fobxn62/",
        "score": 130,
        "subreddit": "wallstreetbets",
        "created": 1587693615.0
    },
    {
        "author": "ckilby2",
        "body": "They are not worth anything right now so no reason to sell. Diamond hands are easy when they are worth -95%",
        "created_utc": 1586873227,
        "id": "fndmeva",
        "permalink": "/r/wallstreetbets/comments/g15zf0/this_is_the_top/fndmeva/",
        "score": 128,
        "subreddit": "wallstreetbets",
        "created": 1586902027.0
    },
    {
        "author": "jrdrake",
        "body": "My company said this week that from now on we all have to pay them to be employees I don't think it's right",
        "created_utc": 1586863306,
        "id": "fnd928u",
        "permalink": "/r/wallstreetbets/comments/g13p12/pay_cuts_furloughs_and_layoffsoh_my/fnd928u/",
        "score": 127,
        "subreddit": "wallstreetbets",
        "created": 1586892106.0
    },
    {
        "author": "Nochthitus44",
        "body": "tldr some young guy got lucky and made 100k to 16 million. Which isnt that unbelievable since I made 95k from basically 2k with so many wrong plays. Then same guy lost 16 mil to 100k; I lost 95k to bit over 6k in the brokerage right now. Guy cant quit job because he sold himself to the military.",
        "created_utc": 1586940871,
        "id": "fngq6o6",
        "permalink": "/r/wallstreetbets/comments/g1l6v5/117k_to_5k_i_sit_here_typing_this_as_i_drown_my/fngq6o6/",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1586969671.0
    },
    {
        "author": "Succulentship",
        "body": "How are there gifs on ur comment. The flames are awesome. I need one to soothe my now poor heart.",
        "created_utc": 1587699012,
        "id": "foe9wph",
        "permalink": "/r/wallstreetbets/comments/g6wbth/the_bear_case_vs_bull_case_argument/foe9wph/",
        "score": 122,
        "subreddit": "wallstreetbets",
        "created": 1587727812.0
    },
    {
        "author": "always_polite",
        "body": "what are you gonna do now? i'd be so upset.",
        "created_utc": 1587664996,
        "id": "foby6l9",
        "permalink": "/r/wallstreetbets/comments/g6pmji/for_the_first_time_in_my_life_i_feel_at_home/foby6l9/",
        "score": 120,
        "subreddit": "wallstreetbets",
        "created": 1587693796.0
    },
    {
        "author": "Apacheone",
        "body": "Yep in the same boat. I know people who have received 4 million in PPP, and others are still waiting. \n\nIt feels like the media and markets are completely disconnected from what's actually happening on the ground. The PPP program is a disaster. Nobody even knows the exact mechanisms for loan forgiveness yet. Food banks are jammed yet the markets are soaring? How is this going to look 60 days from now when people are struggling to find a meal and they find out trillions were spent to prop up asset prices and ensure the value of corporate bonds...",
        "created_utc": 1586834832,
        "id": "fncejah",
        "permalink": "/r/wallstreetbets/comments/g0xltw/main_street_is_fucked/fncejah/",
        "score": 119,
        "subreddit": "wallstreetbets",
        "created": 1586863632.0
    },
    {
        "author": "BitSexual",
        "body": "I now have several $k invested with a gecko for a financial advisor.",
        "created_utc": 1585771076,
        "id": "fm5dugr",
        "permalink": "/r/wallstreetbets/comments/ft7aby/ok_retards_gordon_has_spoke/fm5dugr/",
        "score": 117,
        "subreddit": "wallstreetbets",
        "created": 1585799876.0
    },
    {
        "author": "captainlvsac",
        "body": "There once was a man from Nantucket\n\nHe learned about puts and said fuck it\n\nHe lost his net worth thinking spy would inverse and now he has $rope and a bucket",
        "created_utc": 1586876555,
        "id": "fndsbqt",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fndsbqt/",
        "score": 116,
        "subreddit": "wallstreetbets",
        "created": 1586905355.0
    },
    {
        "author": "ma____",
        "body": "Whoever said \"reality doesn't matter anymore\" yesterday was 100% correct. We've just undone ~10 years worth of job construction in a matter of a month, we *should* be in the toilet right now, but as far as the market is concerned, we are at late 2019 levels.",
        "created_utc": 1587040878,
        "id": "fnkvapc",
        "permalink": "/r/wallstreetbets/comments/g2e1la/5245_million_weekly_jobless_claims/fnkvapc/",
        "score": 114,
        "subreddit": "wallstreetbets",
        "created": 1587069678.0
    },
    {
        "author": "Charliebush",
        "body": "The economy now runs on memes.",
        "created_utc": 1586795631,
        "id": "fnadkrr",
        "permalink": "/r/wallstreetbets/comments/g0m6v5/tesla_is_going_to_the_moon/fnadkrr/",
        "score": 113,
        "subreddit": "wallstreetbets",
        "created": 1586824431.0
    },
    {
        "author": "AloneForever",
        "body": "Thanks for your sacrifice, hopefully my puts print now.",
        "created_utc": 1586368099,
        "id": "fmt7i7y",
        "permalink": "/r/wallstreetbets/comments/fxb2n0/im_done_i_surrender/fmt7i7y/",
        "score": 110,
        "subreddit": "wallstreetbets",
        "created": 1586396899.0
    },
    {
        "author": "kodbell",
        "body": "Recently, I went through a similar scenario. Just sharing for other autists passtime,\n\n* I ended last year at 680K (started that year with $1800. Before 2019, I lost 120K in my lifetime)\n* After Iran bombing in Jan, I entered SPX puts expiring March 17 (lost 200k during  this time)\n* I bag held them until Feb 19 and exited for 520K account ( I got scared as all the dips are being instantaneously bought by bulls on the same day like previous COVID scare for 2 days from china, mysterious intraday drop on Feb 18 and several other days like that)\n* Immediately from the next week of Feb20, the market was in the toilet like crazy turmoil. I kept watching for a couple of weeks beating myself that I missed by 8-10 Million gain by closing my position on Feb19\n* To avoid stress I went leaps on deep 30% ITM BA(at 260), RCL(at 66), LYFT(at 38) calls for 2021 thinking they have super beaten already and deep ITM is safe but to my luck, they went further in the toilet.\n* my position is such that for my leaps to make any money all tickers should actually more than double in price.  so I thought why to bother with options and sold them and just bought shares in BA, Lyft, SAVE at their bottom. By now my account is 160k.\n* Waited a week for pop and exited all these 3 tickers shares for 35% gain and ended the account for 256K\n* Went all in on RGS shares for avg cost of 5.60 (averaged over 3 days but unable to catch bottom as later it went further to 4.20). However, I felt reasonably confident that it will at least $7-8 in 3-4 months considering just the franchise fees.\n* JPOW brrrrr...ing helped for the past week and this morning closed all the stock for avg price of 9.70. Now the account is 450K\n* Maybe making &gt;100% percent on just shares in the past 2/3 weeks feels better even though I still lost over 220kthis year. However, the main kicker is that I will feel worst forever for missing 8-10M gain as I waited so long and exited right before dumping on SPX puts. After missing this kind of once in a lifetime trade, I kind of lost appetite for riskier options thinking I may never beat that missed out trade odds.",
        "created_utc": 1586882102,
        "id": "fne2w5p",
        "permalink": "/r/wallstreetbets/comments/g17zmf/feast_your_eyes_on_my_losses_689k_on_spx_puts/fne2w5p/",
        "score": 109,
        "subreddit": "wallstreetbets",
        "created": 1586910902.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "I bought into $ROKU, the falling knife. at 100, 95, 85, 80 and then 68 as it plummeted. Finally, I am validated for my autistic stubbornness that a fucking pure play streaming platform with a solid cash to debt ratio shouldn’t be drilling to the center of the earth.\n\nNow I bet you feel silly for taking the kids and leaving me, Heather, as I lay in the bathtub, chanting ROKU, fully nude, while boiling an Amazon Firestick on the stove to appease the fickle streaming gods. Come back, babe, I’m better now.",
        "created_utc": 1586867547,
        "id": "fnddwq1",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fnddwq1/",
        "score": 108,
        "subreddit": "wallstreetbets",
        "created": 1586896347.0
    },
    {
        "author": "CaptainCanuck93",
        "body": "The whole allure of tech* is the idea that it can scale sales without scaling costs nearly as much. I don't understand how a company with a couple apps requires so much manpower\n\n*I understand Uber barely counts as a tech company, but they aren't even close right now",
        "created_utc": 1588121664,
        "id": "fowkom4",
        "permalink": "/r/investing/comments/g9wwpa/uber_cto_resigns_as_company_reportedly_considers/fowkom4/",
        "score": 108,
        "subreddit": "investing",
        "created": 1588150464.0
    },
    {
        "author": "kirbyone",
        "body": "Nice I put in $300 yesterday and now its $6",
        "created_utc": 1587589160,
        "id": "fo83bhn",
        "permalink": "/r/wallstreetbets/comments/g67cuw/69420_in_a_month/fo83bhn/",
        "score": 108,
        "subreddit": "wallstreetbets",
        "created": 1587617960.0
    },
    {
        "author": "Bluerigg",
        "body": "I'm going to go broke trying to do this now",
        "created_utc": 1587071102,
        "id": "fnmgou9",
        "permalink": "/r/wallstreetbets/comments/g2jxyw/34k_566k_in_amzn_calls_this_week_im_out/fnmgou9/",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1587099902.0
    },
    {
        "author": "gratitudeisbs",
        "body": "Lol the Fed has been doing shady shit like this for decades now \n\nAmericans are too busy arguing about fringe issues like abortion and “climate change” and “gay rights” meanwhile the Fed has been stealing trillions of dollars of wealth from taxpayers and giving it to the 1%",
        "created_utc": 1586780018,
        "id": "fn9o7sf",
        "permalink": "/r/wallstreetbets/comments/g0hp5j/which_companiesbanks_are_getting_money_from_jpow/fn9o7sf/",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1586808818.0
    },
    {
        "author": "dlctrades",
        "body": "Honestly Buffet selling even that small stake in Delta helped out the 💎🖐 on my burning puts.\n\nBefore COVID media was saying he lost his touch having been outperformed by S&amp;P for the last 5 years. Sitting on a shit ton of cash everyone waiting for him to buy anything and instead he sticks to his guns, says everything is overvalued, and gives money back to shareholders.\n\nNow, especially if we do have another leg down, he has enough cash on hand to acquire companies for half of their market cap 2 months ago. \n\nHe wouldn't have sold Delta shares during the \"rally\" if he thought it was truly a V shaped recovery. \n\nI'm with the Oracle. SPY 273P 06/19 picked up today at the highs. Would love to add a 300P if it gets there so keep Brrrring Powell.",
        "created_utc": 1586402519,
        "id": "fmuznhg",
        "permalink": "/r/wallstreetbets/comments/fxjkoa/this_is_what_we_mean_by_bear_vs_bull/fmuznhg/",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1586431319.0
    },
    {
        "author": "mijnpaispiloot",
        "body": "Remdesivir tested multiple times and everytime was ineffective. Now it suddenly is the cure in a study with 125 covid patients, 2 died. 1.6% deathrate sounds awfuly familiar if you ask me...",
        "created_utc": 1587072445,
        "id": "fnmjaqs",
        "permalink": "/r/wallstreetbets/comments/g2nvb2/rip/fnmjaqs/",
        "score": 102,
        "subreddit": "wallstreetbets",
        "created": 1587101245.0
    },
    {
        "author": "magisteerial",
        "body": "All the positive news is priced in.  \"Be fearful when others are greedy\"...this is what you should do right now. Double bottom incoming......  \n\nLol just kidding fool brrrrrrrrrrrrrrrrrrrrr trumps all",
        "created_utc": 1586381802,
        "id": "fmtzirp",
        "permalink": "/r/wallstreetbets/comments/fxfe86/were_at_market_top/fmtzirp/",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1586410602.0
    },
    {
        "author": "Scarbane",
        "body": "Whoever sold those options is feeling pretty good right about now.",
        "created_utc": 1586793076,
        "id": "fna8n4h",
        "permalink": "/r/wallstreetbets/comments/g0jmfv/so_who_wants_to_volunteer_to_hold_me/fna8n4h/",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1586821876.0
    },
    {
        "author": "Lolsmileyface13",
        "body": "oh my gosh. \n\nall we needed was for the final bears yesterday to dump their loads. \n\nI AM THE FINAL BEAR AND I AM VINDICATED. ONLY DOWN 92% NOW",
        "created_utc": 1586955621,
        "id": "fnh5w80",
        "permalink": "/r/wallstreetbets/comments/g1pvny/daily_discussion_thread_april_15_2020/fnh5w80/",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1586984421.0
    },
    {
        "author": "midwestck",
        "body": "Carol in reception let it slip, now the cat's out of the bag SPY 5p 4/13",
        "created_utc": 1586801831,
        "id": "fnaq3bs",
        "permalink": "/r/wallstreetbets/comments/g0oc45/los_angeles_county_govt_opening_forecast/fnaq3bs/",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1586830631.0
    },
    {
        "author": "trpwangsta",
        "body": "Please browse don't kill yourself. Hopefully you're young and smart enough to realize you will make this money back. It stings now, but just know there are people out there that love you. Nobody here, but somewhere else for sure. Open up a Roth IRA and buy some mutual funds.",
        "created_utc": 1586891829,
        "id": "fnem5d5",
        "permalink": "/r/wallstreetbets/comments/g17zmf/feast_your_eyes_on_my_losses_689k_on_spx_puts/fnem5d5/",
        "score": 93,
        "subreddit": "wallstreetbets",
        "created": 1586920629.0
    },
    {
        "author": "chibaytri",
        "body": "I remember the exact same posts from when we had that first rip-your-face-off rally from the March low to 2450. Then 2500, then 2650, and on. I suppose any number of you could be right. I just don't understand why so many of these posts have the sentiment of \"2x leveraged all in or 100% cash.\" This is essentially a bet that you are incredibly adept at timing the market. I could never imagine being that confident.\n\nYou could just trim to lower equity exposure. You could buy negative-beta. You could hedge with puts. You could hedge the hedge with debit spreads. Shit, at VIX 33, long puts are actually kind of cheap right now. Maybe not full coverage, but significant exposure to downside.\n\nI just don't see why people are so eager to give up their entire exposure to the upside.",
        "created_utc": 1588120492,
        "id": "fowiliy",
        "permalink": "/r/stocks/comments/g9yppj/today_i_sold_my_entire_portfolio_good_luck/fowiliy/",
        "score": 93,
        "subreddit": "stocks",
        "created": 1588149292.0
    },
    {
        "author": "ToastyBoyxd",
        "body": "i can only afford the bread line now",
        "created_utc": 1586814801,
        "id": "fnbfv5b",
        "permalink": "/r/wallstreetbets/comments/g0sh5u/maybe_trump_is_right/fnbfv5b/",
        "score": 93,
        "subreddit": "wallstreetbets",
        "created": 1586843601.0
    },
    {
        "author": "netxero",
        "body": "Easy, April 17 is now suddenly a few days away",
        "created_utc": 1586805018,
        "id": "fnawfgx",
        "permalink": "/r/wallstreetbets/comments/g0p8t5/jay_fucking_powell_ladies_and_gentlemen/fnawfgx/",
        "score": 92,
        "subreddit": "wallstreetbets",
        "created": 1586833818.0
    },
    {
        "author": "Slayer7413",
        "body": "Yup I sent one of my buddies an invitation to robinhood almost two years ago. About a week ago I got a message that I received a free stock from him signing up. At the time I invited him I kept bugging him to sign up and he never did, guess now he thinks this the time to buy stocks because I dont think he even knows what options are. I think a lot of noobs are seeing all the headlines on TV and thinking this is the bottom. Once they see their first big red day they all gonna be jumping ship",
        "created_utc": 1586815267,
        "id": "fnbgsho",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbgsho/",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1586844067.0
    },
    {
        "author": "PPfinance",
        "body": "Okay so not going to lie I've been thinking of quitting reddit for awhile now. Anyone that's been here for awhile knows that the big subs are basically just a collection of the same jokes or reposts, with almost the same verbatim top comments posted every time. The news section and politics subs are widely considered cancerous, so I stay away from those. I've unsubbed to basically everything except investing related subreddits and r/buildapcsales and r/hardwareswap.\n\nBeing subbed to this small amount of subs has made me realize that even the investing subs are generally pointless too. It's just a collection of the same hive mind posts day after day, with a few actual news or interesting posts every once in awhile. Don't even get me started on WSB, which has devolved into yet another sub where the same 5 jokes have been run into the ground for years. In the months that I've limited myself to these subs, I can't say I've really learned much or bettered myself as an investor. I can only read \"my case for the bear market\" so many times, clearly written by an 18 yr old with limited experience. Am I being pessimistic for wanting to get out of this place?",
        "created_utc": 1586783627,
        "id": "fn9sr5b",
        "permalink": "/r/investing/comments/g0gapr/goldman_sachs_predicts_sp500_at_3000_by_year_end/fn9sr5b/",
        "score": 87,
        "subreddit": "investing",
        "created": 1586812427.0
    },
    {
        "author": "tobinHQ",
        "body": "So you’re telling me that you think investors are just as confident now as they were in February of last year? Totally forgot about covid-18, my bad.",
        "created_utc": 1586783570,
        "id": "fn9so6f",
        "permalink": "/r/wallstreetbets/comments/g0ina1/before_you_pin_your_hopes_on_earnings_to_make/fn9so6f/",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1586812370.0
    },
    {
        "author": "Gatorm8",
        "body": "Yea I didn’t believe this 2 weeks ago when I was down 40% but now I’m down 80% and I get it",
        "created_utc": 1586921948,
        "id": "fng48lk",
        "permalink": "/r/wallstreetbets/comments/g1k8rs/the_market_can_stay_irrational_longer_than_you/fng48lk/",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1586950748.0
    },
    {
        "author": "TonySu",
        "body": "You are all under the impression that you're receiving a cheque with Trump's name printed in the corner or something. He's pulling a big brain move and printing his name on the receiver line. Trump is now the world's first trillionaire.",
        "created_utc": 1586952897,
        "id": "fnh29e7",
        "permalink": "/r/wallstreetbets/comments/g1p80a/trumps_name_to_appear_on_benefit_cheques_it_is/fnh29e7/",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1586981697.0
    },
    {
        "author": "Mayhem_Jones",
        "body": "\"Aytu Bioscience, Inc. (AYTU) Upgraded to Strong Buy: What Does It Mean for the Stock?\"\n\n...it means it will drop at LEAST 20% now. GREAT!!",
        "created_utc": 1586885818,
        "id": "fneabwq",
        "permalink": "/r/pennystocks/comments/g19yoq/aytu_bioscience_inc_aytu_upgraded_to_strong_buy/fneabwq/",
        "score": 86,
        "subreddit": "pennystocks",
        "created": 1586914618.0
    },
    {
        "author": "LactobaSILLY",
        "body": "They brought in a new ex-Nintendo executive with proven track record, closed down stores for time being (despite originally trying not to), and closed 300 stores that were bleeding. The new exec is promising a revamping of stores and streamlining the business. That might lead to why it’s up. \n\nTrust me, I hate GME as much as the next guy but I wouldn’t touch this for now, too many variables.",
        "created_utc": 1586874539,
        "id": "fndoo2b",
        "permalink": "/r/options/comments/g16fba/gamestop_up_35_more_valuable_than_precrash_puts/fndoo2b/",
        "score": 86,
        "subreddit": "options",
        "created": 1586903339.0
    },
    {
        "author": "zjmoney",
        "body": "At least you're off the list. You can get fractional shares now",
        "created_utc": 1586928062,
        "id": "fngcfub",
        "permalink": "/r/wallstreetbets/comments/g1l6v5/117k_to_5k_i_sit_here_typing_this_as_i_drown_my/fngcfub/",
        "score": 1647,
        "subreddit": "wallstreetbets",
        "created": 1586956862.0
    },
    {
        "author": "BandicootDrip",
        "body": "Same things been happening to me for the last month now. About to start charging mfs for my economic outlook (which is just an aggregate of WSB shitposts).",
        "created_utc": 1586814277,
        "id": "fnbeu2e",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbeu2e/",
        "score": 967,
        "subreddit": "wallstreetbets",
        "created": 1586843077.0
    },
    {
        "author": "rturtle",
        "body": "My gramps once apologized for my family not having any money on thanksgiving. \n\nHe said that in WW2 there was a scam when you were stationed in the UK. You could exchange your dollars for pounds from grey market street dealers then come back to the base and exchange your pounds for dollars at a better rate. You could repeat for infinite money.  He said he spent his money on pussy instead. \n\nThis infinite money hack is working for the banks and hedge funds right now. They are buying up shit and then claiming it as assets to get more money from the fed and then buying up more shit to infinity.\n\nGramps squandering it all on pussy was way more honest.",
        "created_utc": 1586882321,
        "id": "fne3c23",
        "permalink": "/r/wallstreetbets/comments/g17zmf/feast_your_eyes_on_my_losses_689k_on_spx_puts/fne3c23/",
        "score": 813,
        "subreddit": "wallstreetbets",
        "created": 1586911121.0
    },
    {
        "author": "Swag-man",
        "body": "Similar experience. Got asked for trading advice by a friend for his new account yesterday. Told him that the market would give him an atomic wedgie and direct him to the bread line if he tried hopping in right now. “What are you talking about? Did you see last week? Best week since 1974!” The top is in boys.",
        "created_utc": 1586815329,
        "id": "fnbgwt9",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbgwt9/",
        "score": 514,
        "subreddit": "wallstreetbets",
        "created": 1586844129.0
    },
    {
        "author": "Venally",
        "body": "It's fun to speculate in isolation, but not really. Let's say Real Estate does collapse, whoops, there goes your REITS too. What's that? Ouch, there goes Banks. Services to Banks are now in panic. Observers go wild. People flee into the streets. Anarchy begins. Carole Baskin definitely killed her husband.\n\nI don't know, but there's definitely chain reactions in the economy, and sector crashes don't really happen in isolation.",
        "created_utc": 1586818055,
        "id": "fnbm9bo",
        "permalink": "/r/wallstreetbets/comments/g0tdhg/why_we_wont_see_major_drops_anymore/fnbm9bo/",
        "score": 498,
        "subreddit": "wallstreetbets",
        "created": 1586846855.0
    },
    {
        "author": "NoCountryForOldPete",
        "body": "My canned response now is \"Take the quantity of money that you're looking to \"invest\", buy 25% now, 15% more in a week, and 10% every week after that.\" At least that way if there is any significant downturn they'll have spread the pain out a little and won't hold me accountable when they can't make their car payments.",
        "created_utc": 1586814784,
        "id": "fnbfttf",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbfttf/",
        "score": 481,
        "subreddit": "wallstreetbets",
        "created": 1586843584.0
    },
    {
        "author": "thekingoftherodeo",
        "body": "For anyone wondering about the reserve build they speak to, I'd like to add a couple of points;\n\n- It includes the impact of adoption of the new credit loss accounting standard (CECL /ASC 326). \n\n- Key difference between old GAAP and new GAAP is that you must now estimate the lifetime expected credit loss for your loans adjusted for forecasted conditions. **So as of these 3/31 results, the increase in expected credit loss from the current portfolio over its entire life is $6.8B - to the extent of the capability &amp; accuracy of JPM's model, this is as bad is it gets.** \n\n- Day 1 (1/1/20 no COVID) impact goes through retained earnings (i.e. no income statement impact), but subsequent measurement (i.e. 3/31/20 big COVID) goes through income. Hence the massive pop in reserves.\n\n- They're likely using a multi scenario weighted model and would have shifted the weightings to reflect the COVID environment; think something like 80-10-10 of most stressed economic environment:moderate stressed economic environment:baseline\n\n- Subsequent Q's won't see as big an income statement impact as the delta between prior Q provision (officially Allowance for Credit Losses) and current Q provision shouldn't be as vast.\n\n- You effectively had a black swan event for this adoption where 1/1/20 (it's effective date), you wouldn't have weighted a stressed economic environment as heavily (if at all, we nearly had the tip in 30,000 DJI almost as recently as Feb), versus 3/31/20 the remeasurement date where you have to account for, well virtually total cessation of normal economic activity.\n\nSo when they speak to building reserves (FASB will have a conniption at that language btw), they've assessed their entire portfolio for lifetime expected credit loss. You see the numbers pop particularly in cards, which are unsecured and your loss given default would to all intents and purposes be 100% vs mortgage loans where you've collateral. \n\nAlso important to bear in mind that since ~2018 the bigger lenders have been keeping higher quality mortgage loans on the books (basically they aren't selling top quality 800 FICO stuff to FNMA FMCC much if at all). Those ratings factor into the modeling which leads me to believe that their +$6.8B is pretty accurate.\n\nJPM are very well placed to weather this, as they were in 2008. It's a well run shop under Dimon.\n\n**TL;DR: The EPS miss is due to new accounting rules &amp; watch out for any bank who chooses to defer implementation (CARES relief) as it likely means their numbers on the 3/31 run were pretty bad**",
        "created_utc": 1586867495,
        "id": "fndduem",
        "permalink": "/r/investing/comments/g13qp8/jpmorgan_reports_big_decline_in_firstquarter/fndduem/",
        "score": 476,
        "subreddit": "investing",
        "created": 1586896295.0
    },
    {
        "author": "nubface1001",
        "body": "I heard he blew it all and is working at DQ now. Poor guy",
        "created_utc": 1586978081,
        "id": "fnidcg2",
        "permalink": "/r/wallstreetbets/comments/g1ykwh/warren_buffett_is_a_gay_bear/fnidcg2/",
        "score": 471,
        "subreddit": "wallstreetbets",
        "created": 1587006881.0
    },
    {
        "author": "hodl_for_the_moon",
        "body": "Wow I went from 25k to 1k last week and then now i’m at $200 lol",
        "created_utc": 1586907704,
        "id": "fnfgoww",
        "permalink": "/r/wallstreetbets/comments/g1gkln/healthcare_worker_on_the_front_lines_lost_it_all/fnfgoww/",
        "score": 337,
        "subreddit": "wallstreetbets",
        "created": 1586936504.0
    },
    {
        "author": "AbsolutelyAutistic",
        "body": "Nice. Now roll it all in to $TSLA put debit spreads.",
        "created_utc": 1586958048,
        "id": "fnh9lir",
        "permalink": "/r/wallstreetbets/comments/g1s3n1/yolo_update_160k_on_my_spxspy_puts_in_16_hours/fnh9lir/",
        "score": 318,
        "subreddit": "wallstreetbets",
        "created": 1586986848.0
    },
    {
        "author": "tiny_cat_bishop",
        "body": "now you're getting it. protip: trade as if the market is going to go in the direction that will make the rich people richer.\n\n*edit: momentary dyslexia",
        "created_utc": 1586873641,
        "id": "fndn42k",
        "permalink": "/r/wallstreetbets/comments/g15eo0/stonks_will_only_go_down_when_its_convenient_for/fndn42k/",
        "score": 299,
        "subreddit": "wallstreetbets",
        "created": 1586902441.0
    },
    {
        "author": "GuiltyGun",
        "body": "Actually the market is going to crash cause last week I bought exactly one SPY 280 call. Now hopefully it crashes hard enough my long puts work out.\n\nSometimes you've gotta psych the system.",
        "created_utc": 1586814654,
        "id": "fnbfklp",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbfklp/",
        "score": 299,
        "subreddit": "wallstreetbets",
        "created": 1586843454.0
    },
    {
        "author": "FinndBors",
        "body": "Why is my taxpayer money going into 70% grants to corporations? Seriously wtf is this? It is 10 times worse than what they did in the GFC and that was already extremely unpopular. Why aren’t people up in arms about this now?",
        "created_utc": 1586908776,
        "id": "fnfin8p",
        "permalink": "/r/investing/comments/g1e6mq/us_airlines_treasury_reach_agreement_in_principle/fnfin8p/",
        "score": 299,
        "subreddit": "investing",
        "created": 1586937576.0
    },
    {
        "author": "TheCuriousKea",
        "body": "I watched the Big Short and I too am now a consummate professional investor 🧠",
        "created_utc": 1587067498,
        "id": "fnm9mx5",
        "permalink": "/r/wallstreetbets/comments/g2mfdg/we_are_forgetting_the_most_important_scene_from/fnm9mx5/",
        "score": 290,
        "subreddit": "wallstreetbets",
        "created": 1587096298.0
    },
    {
        "author": "smallchimpu",
        "body": "Run now , cash out , unsub wsb rn ! Please ,have seen a lot of stories like yours , sadly the ending is catastrophic ! Iay sound corny but run now",
        "created_utc": 1586379206,
        "id": "fmtug84",
        "permalink": "/r/wallstreetbets/comments/fxellq/this_bear_learned_to_stop_fighting_the_feds_20k/fmtug84/",
        "score": 266,
        "subreddit": "wallstreetbets",
        "created": 1586408006.0
    },
    {
        "author": "tryexceptifnot1try",
        "body": "Dude TSLA is back up to fucking $700 with 85% of it's production shut down for the next couple months at least. That is a company which needed to thread the needle not to die because of it's cash flow and debt. I am actually starting to feel better about the puts I bought yesterday as the put/call ratio is now back to the all-time lows we saw in January. The amount of bullish sentiment right now is completely insane. Problem is we have time tied to options so I need to start rethinking my August puts that are going to get kicked in the nuts today.",
        "created_utc": 1586866635,
        "id": "fndcrdx",
        "permalink": "/r/wallstreetbets/comments/g13ode/jpmorgan_posts_earnings_of_078_missing_estimate/fndcrdx/",
        "score": 261,
        "subreddit": "wallstreetbets",
        "created": 1586895435.0
    },
    {
        "author": "AloneForever",
        "body": "Incredibly bullish, now they don't have to deliver all those planes they promised. Really great news for Boeing.",
        "created_utc": 1586876899,
        "id": "fndsyfj",
        "permalink": "/r/wallstreetbets/comments/g175n9/boeing_customers_cancel_staggering_150_max_plane/fndsyfj/",
        "score": 256,
        "subreddit": "wallstreetbets",
        "created": 1586905699.0
    },
    {
        "author": "Commissar_Genki",
        "body": "Sir, this is now a fascist state.",
        "created_utc": 1586870730,
        "id": "fndift8",
        "permalink": "/r/wallstreetbets/comments/g15eo0/stonks_will_only_go_down_when_its_convenient_for/fndift8/",
        "score": 254,
        "subreddit": "wallstreetbets",
        "created": 1586899530.0
    },
    {
        "author": "dont-speak-mostly",
        "body": "Now re-loan that money at a higher rate and become a big bank.",
        "created_utc": 1586780857,
        "id": "fn9p6zn",
        "permalink": "/r/wallstreetbets/comments/g0hw81/personal_loans_the_next_bubble/fn9p6zn/",
        "score": 249,
        "subreddit": "wallstreetbets",
        "created": 1586809657.0
    },
    {
        "author": "flaccid_burp",
        "body": "Don’t forget the part where banks now have zero reserve requirement. Not as if you have to back up all the loans with something real anyway",
        "created_utc": 1586804481,
        "id": "fnavdeq",
        "permalink": "/r/wallstreetbets/comments/g0p8t5/jay_fucking_powell_ladies_and_gentlemen/fnavdeq/",
        "score": 246,
        "subreddit": "wallstreetbets",
        "created": 1586833281.0
    },
    {
        "author": "AGayBlackMidget",
        "body": "I can tell you right now that it (social distancing) won't last until 2022.",
        "created_utc": 1586953590,
        "id": "fnh3505",
        "permalink": "/r/wallstreetbets/comments/g1quhn/coronavirus_study_warns_social_distancing_may/fnh3505/",
        "score": 236,
        "subreddit": "wallstreetbets",
        "created": 1586982390.0
    },
    {
        "author": "fishythepete",
        "body": "Of course Tesla is worth more now that they’re not making cars.",
        "created_utc": 1586795223,
        "id": "fnacs79",
        "permalink": "/r/wallstreetbets/comments/g0m6v5/tesla_is_going_to_the_moon/fnacs79/",
        "score": 230,
        "subreddit": "wallstreetbets",
        "created": 1586824023.0
    },
    {
        "author": "modestsmets",
        "body": "congratulations , Sell now don't too greed learn from analfarmer2",
        "created_utc": 1586915611,
        "id": "fnfual5",
        "permalink": "/r/wallstreetbets/comments/g1ioqa/191k_295k_in_2_weeks/fnfual5/",
        "score": 223,
        "subreddit": "wallstreetbets",
        "created": 1586944411.0
    },
    {
        "author": "Watblieft",
        "body": "As grumpy bear, I decided to go with the flow and buy calls of the least appealing stock I could think of. As a protest. It became Gamestop. I'm up 140% on my calls in two days and it compensated the losses of my puts. \n\nI feel extra stupid now.",
        "created_utc": 1586900458,
        "id": "fnf2zal",
        "permalink": "/r/wallstreetbets/comments/g1duq3/what_are_your_moves_tomorrow_april_15_2020/fnf2zal/",
        "score": 219,
        "subreddit": "wallstreetbets",
        "created": 1586929258.0
    },
    {
        "author": "UnwantedRelishMan",
        "body": "I remember in junior high the high schoolers were having their ACT tests. They were on break and we went up to one and asked how the test was. He just said “ahhh idk I just put no for every answer” \n\nThe dude smokes meth and fixes lawnmowers now.",
        "created_utc": 1586978037,
        "id": "fnid953",
        "permalink": "/r/wallstreetbets/comments/g1y9et/every_autist_here/fnid953/",
        "score": 218,
        "subreddit": "wallstreetbets",
        "created": 1587006837.0
    },
    {
        "author": "frostbiite1790",
        "body": "The printer can now go super saiyan 2",
        "created_utc": 1586971364,
        "id": "fnhzcdg",
        "permalink": "/r/wallstreetbets/comments/g1wbe0/contest_what_news_will_the_fedjpowtrump_announce/fnhzcdg/",
        "score": 217,
        "subreddit": "wallstreetbets",
        "created": 1587000164.0
    },
    {
        "author": "Uniqueguy264",
        "body": "It’s $-40 now. That’s like $-2 a gallon of gas",
        "created_utc": 1587407613,
        "id": "fo07vjt",
        "permalink": "/r/wallstreetbets/comments/g4y9z1/hes_already_dead/fo07vjt/",
        "score": 215,
        "subreddit": "wallstreetbets",
        "created": 1587436413.0
    },
    {
        "author": "Skwigle",
        "body": "I'm just gonna jump in here because it isn't the first time I've seen \"short squeeze\" seemingly used incorrectly and I feel like maybe some of you don't really understand what it is. The chart we are seeing now cannot be a short squeeze nor can it be a \"short squeeze in reverse\".\n\nShorting a stock means you're borrowing shares from your broker and selling them to someone at the current price. The idea being that you think the price will go down and then you can buy them back at a lower price. So if you short XYZ today at $100/share and buy them back tomorrow at $90/share, you've made $10/share. If, on the other hand, the stock goes up to $110, you've lost $10/share.\n\nNow the tricky thing about shorting a stock is that there is no limit to the upside (of the stock price). When you buy a stock, the maximum you can lose is 100%. You buy it at $100 and it goes to zero, you've lost $100/share and can't lose more. That's it. But if you short a stock, your losses are theoretically unlimited. If you shorted TSLA at $300 you'd be in a world of pain when it hit $950 because that means your losses are $650/share at that point. Your downside (on the trade) is unlimited but your upside is limited to 100% (and that's if the shares go to zero).\n\nFor these reasons, you don't want to short a stock and hold on to it forever like you might if you were long. The pain of holding onto it as the losses mount become too much to bear, but also because you don't have an unlimited amount of money in your account. At some point, you will be FORCED to buy back the stock before the losses outstrip your funds.\n\nSo a short squeeze occurs after a stock has run up considerably and reaches a point where everyone who has shorted the stock is essentially forced to buy it back before it goes too high. At this point, you'll see a huge spike on top of a run up.\n\nThere is no real opposite to a short squeeze because when you hold stocks long, your max loss is 100% and no one is ever forced to sell. You can just hold on until zero. In real life, however, you will often reach a point where people just don't want to lose more money and get out anyway. When everyone is running for the exits and sells their stock at the same time, you'll see a huge downward spike after a run down. This is usually called capitulation and often signals a reversal to an uptrend.",
        "created_utc": 1586798860,
        "id": "fnak2bu",
        "permalink": "/r/wallstreetbets/comments/g0kuea/look_at_the_volume_for_today/fnak2bu/",
        "score": 213,
        "subreddit": "wallstreetbets",
        "created": 1586827660.0
    },
    {
        "author": "krispyfriedyuca",
        "body": "Reminds me as a Realtor, back in 2016, the house flipping business was at its peak and all kinds of average joes and beckies would say shit like “I wanna start investing in property, if I can find one for $100k do some work on it and sell it for $150k that’d be ideal”\n\nBitch first of all you and everybody else wants to find a nice juicy deal to flip.\n\nSecond of all most of the REO inventory is drying up at this point, and any distressed property that is actively listed for sale is being bid up too high for you to squeeze a reasonable margin.\n\nThird of all what the fuck do you know about buying, rehabbing and selling houses?? You think you see that shit on TV and think “hey I could do that”\n\nSame idiocy is happening now with the stock market. All of a sudden some of my acquaintances who don’t even know what the fuck a stonk was a month ago, would like to invest in some airlines because “it’s gonna go up and I wanna double my money” \n\nI welcome that dumb money. More fish come into the game and the sharks feast. (I’m more of a puffer fish but I’ll still take my share)",
        "created_utc": 1586818714,
        "id": "fnbnj7e",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbnj7e/",
        "score": 209,
        "subreddit": "wallstreetbets",
        "created": 1586847514.0
    },
    {
        "author": "Phizzsicks",
        "body": "If you're pissed now, wait till a vaccine is made, the quarantine is lifted and sales are up then the market decides to  crash",
        "created_utc": 1586873137,
        "id": "fndm9ip",
        "permalink": "/r/wallstreetbets/comments/g16302/well_at_this_point_31103_for_spy_is_where_all/fndm9ip/",
        "score": 209,
        "subreddit": "wallstreetbets",
        "created": 1586901937.0
    },
    {
        "author": "NoCountryForOldPete",
        "body": "I swear, I'm going to break out in a cold sweat from now on when someone says \"So, I've been thinking about buying some stocks...\", and then expects me to give them good advice, but really they're talking to the market equivalent of Gollum and I'm waffling like I haven't seen direct sunlight in a decade.",
        "created_utc": 1586818854,
        "id": "fnbnsmy",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbnsmy/",
        "score": 196,
        "subreddit": "wallstreetbets",
        "created": 1586847654.0
    },
    {
        "author": "Sonicmansuperb",
        "body": "I've come to make an announcement. u/John-TeamQuestrade's a bitch ass motherfucker, you pissed on my FUCKING wife, that's right, he took his optioned fucking cally dick out, and he pissed on my FUCKING wife and he said his strike was \"thiiiiss biiigg\". And I said \"That's risky!\" so I'm making a callout post on my wallstreetbets . com: u/John-TeamQuestrade, you got a small strike, it's the size of this walnut except WAY smaller, and guess what, here's what my call looks like BGHGGHGHGHGHG. That's right baby! All covered, no shorts, no holding! Look at that it looks like 2 calls and a put! He fucked my wife, so guess what I'M GONNA FUCK THE EARTH. That's right this is what you get! MY SUPER LASER PISS! Except I'm not gonna piss on the Earth, I'm gonna go higher, I'm pissing on THE DOW!! How do you like that Buffet?? I pissed on THE DOW you IDIOT!! You have 23 hours before the piss Drrroplets hit the fucking Earth, now get out of my fucking sight before I piss on you too!",
        "created_utc": 1586383832,
        "id": "fmu3els",
        "permalink": "/r/wallstreetbets/comments/fxbwal/correction_all_bans_have_been_cleared_except_for/fmu3els/",
        "score": 190,
        "subreddit": "wallstreetbets",
        "created": 1586412632.0
    },
    {
        "author": "VICInvestor11",
        "body": "The bank posted quarterly per share earnings of 78 cents, a figure that  missed analyst’s $1.84  estimate as the company added $6.8 billion to  loan loss provisions, JPMorgan said Tuesday in a release. \n\nNow THAT'S bullish, GREEN GREEN GREEN",
        "created_utc": 1586863507,
        "id": "fnd99gy",
        "permalink": "/r/investing/comments/g13qp8/jpmorgan_reports_big_decline_in_firstquarter/fnd99gy/",
        "score": 190,
        "subreddit": "investing",
        "created": 1586892307.0
    },
    {
        "author": "Vertex_2",
        "body": "Definitely need to buy calls now",
        "created_utc": 1586867923,
        "id": "fndeekw",
        "permalink": "/r/wallstreetbets/comments/g14r5n/imf_slashes_growth_forecasts_says_world_will_very/fndeekw/",
        "score": 189,
        "subreddit": "wallstreetbets",
        "created": 1586896723.0
    },
    {
        "author": "StaticBroom",
        "body": "The market didn’t split from reality.  Reality split from the market.\n\nDoesn’t make sense? Good. Now you understand.",
        "created_utc": 1586994095,
        "id": "fnj8pdy",
        "permalink": "/r/StockMarket/comments/g22xuz/wall_streets_bulls_drive_epic_market_split_from/fnj8pdy/",
        "score": 180,
        "subreddit": "StockMarket",
        "created": 1587022895.0
    },
    {
        "author": "Thorshammer18",
        "body": "Yesterday red futures didnt matter. Now green futures matter. Crazy double talk.",
        "created_utc": 1586833979,
        "id": "fncd9t0",
        "permalink": "/r/wallstreetbets/comments/g0xl1l/the_vix_is_now_below_40_futures_up_15_across_the/fncd9t0/",
        "score": 173,
        "subreddit": "wallstreetbets",
        "created": 1586862779.0
    },
    {
        "author": "Hypoglybetic",
        "body": "How much fucking money do you have that you can put $300k into options that fucking expire 10 days from now?",
        "created_utc": 1586901792,
        "id": "fnf5jfb",
        "permalink": "/r/wallstreetbets/comments/g1d0yi/bought_nearly_300k_in_spxspy_apr24_282_puts_at/fnf5jfb/",
        "score": 170,
        "subreddit": "wallstreetbets",
        "created": 1586930592.0
    },
    {
        "author": "jakemoffsky",
        "body": "As a gambling addict I can confirm this is true, my wife and her boyfriend really appreciate that i'm an investor now and not a degenerate gambler.\n\nSpy 250p 6/15",
        "created_utc": 1586897844,
        "id": "fnexua5",
        "permalink": "/r/wallstreetbets/comments/g1ba0j/all_revenues_that_would_normally_goto_casinos_are/fnexua5/",
        "score": 166,
        "subreddit": "wallstreetbets",
        "created": 1586926644.0
    },
    {
        "author": "Developer4Diabetes",
        "body": "Am I reading this stuff right?!?! 70% grant which means that's a 70% GIFT?!?! Are you kidding me?! I am fuming! That is far worse than the last crisis! How is that even allowed, I am so angry. Tbh I was fine with stock buybacks, because I thought they would pay the price for it, but now.... we are literally paying their bills for them... that cannot be right",
        "created_utc": 1586909149,
        "id": "fnfjay8",
        "permalink": "/r/investing/comments/g1e6mq/us_airlines_treasury_reach_agreement_in_principle/fnfjay8/",
        "score": 164,
        "subreddit": "investing",
        "created": 1586937949.0
    },
    {
        "author": "thekingoftherodeo",
        "body": "For everyone wondering why the big miss (&amp; you're going to see this with every bank btw).\n\n- It includes the impact of adoption of the new credit loss accounting standard (CECL).\n\n- Day 1 (1/1/20 no COVID) impact goes through retained earnings (i.e. no income statement impact), but subsequent measurement (i.e. 3/31/20 big COVID) goes through income. Hence the massive pop in reserves.\n\n- Key difference between old GAAP and new GAAP is that you must now estimate the lifetime expected credit loss for your loans adjusted for forecasted conditions\n\n- They're likely using a multi scenario weighted model and would have shifted the weightings to reflect the COVID environment; think something like 80-10-10 of most stressed economic environment:moderate stressed economic environment:baseline\n\n- Subsequent Q's won't see as big an income statement impact as the delta between prior Q provision (officially Allowance for Credit Losses) and current Q provision shouldn't be as vast.\n\n- You effectively had a black swan event for this adoption where 1/1/20 (it's effective date), you wouldn't have weighted a stressed economic environment as heavily (if at all, we nearly had the tip in 30,000 DJI almost as recently as Feb), versus 3/31/20 the remeasurement date where you have to account for, well virtually total cessation of normal economic activity.\n\nSo when they speak to building reserves (FASB will have a conniption at that language btw), they've assessed their entire portfolio for lifetime expected credit loss. You see the numbers pop particularly in cards, which are unsecured and your loss given default would to all intents and purposes be 100% vs mortgage loans where you've collateral.\n\nAlso important to bear in mind that since ~2018 the bigger lenders have been keeping higher quality mortgage loans on the books (basically they aren't selling top quality 800 FICO stuff to FNMA FMCC much if at all).\n\nJPM are very well placed to weather this, as they were in 2008. It's a well run shop under Daddy Dimon.\n\n**TL;DR: Watch out for the banks who elect to defer CECL implementation because it likely meant their models adjusted for COVID gave them numbers they didn't want to push through Q1 earnings**\n\n**TL;DR of the TL;DR = Accounting rules fucked EPS in the ass but it shouldn't be as volatile going forward**",
        "created_utc": 1586868133,
        "id": "fndeokh",
        "permalink": "/r/wallstreetbets/comments/g13ode/jpmorgan_posts_earnings_of_078_missing_estimate/fndeokh/",
        "score": 164,
        "subreddit": "wallstreetbets",
        "created": 1586896933.0
    },
    {
        "author": "Chabubu",
        "body": "Now that we have Trump, I miss Bush...  he was an idiot too, but at least he knew he was.",
        "created_utc": 1586968755,
        "id": "fnhtvcs",
        "permalink": "/r/wallstreetbets/comments/g1v8ty/please_sir_just_one_profitable_trade/fnhtvcs/",
        "score": 163,
        "subreddit": "wallstreetbets",
        "created": 1586997555.0
    },
    {
        "author": "IAmABlubFish",
        "body": "Maybe I'm just old, but after purchasing multiple \"new\" electronics from Amazon and seeing they were already used and returned I only buy electronics from Best Buy now.  Nothing better than wearing your new noise canceling headphones and seeing they are already setup for bluetooth with someone else's name on them.",
        "created_utc": 1586957294,
        "id": "fnh8egs",
        "permalink": "/r/wallstreetbets/comments/g1rnkf/spy_5000_eod_best_buy_to_furlough_about_51000/fnh8egs/",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1586986094.0
    },
    {
        "author": "bowlersan",
        "body": "You realize this is just some fucking asshat working over there WITH NOTHING BETTER TO DO WITH THEIR TIME reading this comment right now. Probably an intern\n\nYeah I'm speaking to you buddy. The more you spew at this guy the more idiotic and self-harming your actions look. Stop feeding him, because he's just going to keep on posting, and I'm running out of popcorn\n\nPS I fucked your wife",
        "created_utc": 1585773416,
        "id": "fm5i6f5",
        "permalink": "/r/wallstreetbets/comments/ft80y4/got_a_call_from_police_regarding_threats_to/fm5i6f5/",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1585802216.0
    },
    {
        "author": "nightcoder2020",
        "body": "This. Today on Marketwatch \"GOLDMAN says the bottom is in!\" I read this as \"OK Tards. NOW its puts time for realsies\"",
        "created_utc": 1586812038,
        "id": "fnbaeil",
        "permalink": "/r/wallstreetbets/comments/g0psrf/a_short_timeline_of_goldmans_bullshit/fnbaeil/",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1586840838.0
    },
    {
        "author": "buyitout",
        "body": "the markets are crazy right now, at this rate we might hit all time highs tomorrow!",
        "created_utc": 1587073488,
        "id": "fnmlari",
        "permalink": "/r/investing/comments/g2nvcr/gilead_jumps_9_after_patients_in_a_trial_were/fnmlari/",
        "score": 157,
        "subreddit": "investing",
        "created": 1587102288.0
    },
    {
        "author": "Vyruz2",
        "body": "The most bullish news ever, ~22 million people total now unemployed instead of 23 million. Great numbers, the best really",
        "created_utc": 1587040938,
        "id": "fnkvdmv",
        "permalink": "/r/wallstreetbets/comments/g2e1la/5245_million_weekly_jobless_claims/fnkvdmv/",
        "score": 152,
        "subreddit": "wallstreetbets",
        "created": 1587069738.0
    },
    {
        "author": "CanopyGains",
        "body": "No, no, $6 Trillion now..",
        "created_utc": 1586883055,
        "id": "fne4sgp",
        "permalink": "/r/wallstreetbets/comments/g18kt2/putshire_cashaway/fne4sgp/",
        "score": 149,
        "subreddit": "wallstreetbets",
        "created": 1586911855.0
    },
    {
        "author": "Speeder97",
        "body": "That's because the market has balanced and is now self-sustaining",
        "created_utc": 1586812237,
        "id": "fnbasec",
        "permalink": "/r/wallstreetbets/comments/g0rmy1/seems_like_jpows_ink_cartridge_is_running_a_bit/fnbasec/",
        "score": 148,
        "subreddit": "wallstreetbets",
        "created": 1586841037.0
    },
    {
        "author": "chocslaw",
        "body": "Great job, now we get to do the sideways shuffle until they all expire worthless.   WAY TO GO",
        "created_utc": 1586816688,
        "id": "fnbjlkq",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbjlkq/",
        "score": 146,
        "subreddit": "wallstreetbets",
        "created": 1586845488.0
    },
    {
        "author": "rtc824",
        "body": "We just hit the top of the bull trap at SPY 273\n\nIf it goes above 273 in the next 30 days I will accept a 6 month ban.\n\n*Edit. Please upvote and make this higher so that the mods see and hold me accountable. I now have skin in the game. Positions? MAR $50p 5/15, AAPL $210p 5/15.",
        "created_utc": 1586294260,
        "id": "fmq7eep",
        "permalink": "/r/wallstreetbets/comments/fwsofr/what_are_your_moves_tomorrow_april_08_2020/fmq7eep/",
        "score": 145,
        "subreddit": "wallstreetbets",
        "created": 1586323060.0
    },
    {
        "author": "rmb91896",
        "body": "I did this with calls about a year ago. Applied for 3 loans online with excellent credit. Approved for all 3. 75k. All of it is gone now- credit is destroyed with nothing to show for it.",
        "created_utc": 1586782711,
        "id": "fn9ripa",
        "permalink": "/r/wallstreetbets/comments/g0hw81/personal_loans_the_next_bubble/fn9ripa/",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1586811511.0
    },
    {
        "author": "leveredlloyd",
        "body": "Thanks Kevin. Now let’s take a look at today’s market movers. It looks like BA continues to sh*t bricks, while TSLA has surprisingly been performing well squeezing out short sellers.... **5 min ad about E-Trade commission free trading, followed by Comcast’s “we’re connecting people all over the world”... Jim, tell us what you’re seeing in rates today... crossing over to you @ricksantelli, let’s look at the 10yr curve, that’s the canary in the coal mine",
        "created_utc": 1586373990,
        "id": "fmtjwm9",
        "permalink": "/r/wallstreetbets/comments/fxcw4i/special_guest_on_cnbc_starter_pack/fmtjwm9/",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1586402790.0
    },
    {
        "author": "Hot_Pink_Unicorn",
        "body": "Google makes most of its money on advertising, now that's gone. \n\nApple can only sell so many $1.2k phones during an economic downturn. \n\nMSFT still will make butt loads of $$$ but it's azure will suffer. \n\nAmazon probably will replace most of the retail but if people can't spend money then AMZN won't be as profitable. \n\n&amp;#x200B;\n\nFB is screwed since it's all ads. \n\nNVidia - has 50% of its profits are from consumer graphics. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\nI'm thinking the only reason all the tech stocks are booming is because they are relatively safe in the short term, long term they will still take a hit.",
        "created_utc": 1586823426,
        "id": "fnbw05x",
        "permalink": "/r/wallstreetbets/comments/g0tdhg/why_we_wont_see_major_drops_anymore/fnbw05x/",
        "score": 143,
        "subreddit": "wallstreetbets",
        "created": 1586852226.0
    },
    {
        "author": "REALSTOOPID",
        "body": "JPow has me so twisted this morning red is like when Ramsey Bolton let Theon escape prison and then cut his dick off for actually doing it. And then when he was actually getting rescued he just stayed in his cage because he was trained so well. Thats how I feel right now. This must be another trick",
        "created_utc": 1586949291,
        "id": "fngy856",
        "permalink": "/r/wallstreetbets/comments/g1pvny/daily_discussion_thread_april_15_2020/fngy856/",
        "score": 142,
        "subreddit": "wallstreetbets",
        "created": 1586978091.0
    },
    {
        "author": "Raccoonpug",
        "body": "Well...im waiting?... my put doesnt have all day now!!!!",
        "created_utc": 1586873543,
        "id": "fndmy46",
        "permalink": "/r/wallstreetbets/comments/g166y6/goldman_speaks_again_downturn_will_be_4_times/fndmy46/",
        "score": 139,
        "subreddit": "wallstreetbets",
        "created": 1586902343.0
    },
    {
        "author": "lolnopound",
        "body": "In alternate reality when coronavirus hit -\n\nWSB: \"Stocks crashed way too much way too quickly. The government and federal reserve aren't going to let the entire economy collapse, I'm buying calls now in expectation of the stimulus and QE.\"\n\nJerome Powell: \"Sorry, I don't believe we should be manipulating markets. If a company can't survive a 2 month shutdown then they shouldn't be in business.\"\n\nWSB: \"How is the fed just doing nothing while all these jobs are lost and businesses are bankrupt?? The game is so fucking rigged.\"",
        "created_utc": 1586782032,
        "id": "fn9qmqj",
        "permalink": "/r/wallstreetbets/comments/g0gvfn/daily_discussion_thread_april_13_2020/fn9qmqj/",
        "score": 136,
        "subreddit": "wallstreetbets",
        "created": 1586810832.0
    },
    {
        "author": "Salmonfisher420",
        "body": "Boeing is down from $440 to $130, one of the biggest market movers and you just now decide to buy puts? Welcome home brother",
        "created_utc": 1587052295,
        "id": "fnlesyd",
        "permalink": "/r/wallstreetbets/comments/g2hg59/i_got_puts_on_ba/fnlesyd/",
        "score": 134,
        "subreddit": "wallstreetbets",
        "created": 1587081095.0
    },
    {
        "author": "bubbagumpskrimps222",
        "body": "You are home now brother 🙏",
        "created_utc": 1587424485,
        "id": "fo12l27",
        "permalink": "/r/wallstreetbets/comments/g53mh0/i_brought_oil_contract_and_cant_close_20k_loss_in/fo12l27/",
        "score": 133,
        "subreddit": "wallstreetbets",
        "created": 1587453285.0
    },
    {
        "author": "GoldenKaze",
        "body": "Central bankers are all around the world are hoping that that liquidity doesn't end up in the supermarket. Traditionally QE has only gone to the banks but now they are you spending it to give free shit to people so who knows if inflation in really dead",
        "created_utc": 1586866844,
        "id": "fndd0ti",
        "permalink": "/r/wallstreetbets/comments/g12zl6/stonkbob_tells_it_like_it_is/fndd0ti/",
        "score": 130,
        "subreddit": "wallstreetbets",
        "created": 1586895644.0
    },
    {
        "author": "ckilby2",
        "body": "They are not worth anything right now so no reason to sell. Diamond hands are easy when they are worth -95%",
        "created_utc": 1586873227,
        "id": "fndmeva",
        "permalink": "/r/wallstreetbets/comments/g15zf0/this_is_the_top/fndmeva/",
        "score": 128,
        "subreddit": "wallstreetbets",
        "created": 1586902027.0
    },
    {
        "author": "jrdrake",
        "body": "My company said this week that from now on we all have to pay them to be employees I don't think it's right",
        "created_utc": 1586863306,
        "id": "fnd928u",
        "permalink": "/r/wallstreetbets/comments/g13p12/pay_cuts_furloughs_and_layoffsoh_my/fnd928u/",
        "score": 127,
        "subreddit": "wallstreetbets",
        "created": 1586892106.0
    },
    {
        "author": "Nochthitus44",
        "body": "tldr some young guy got lucky and made 100k to 16 million. Which isnt that unbelievable since I made 95k from basically 2k with so many wrong plays. Then same guy lost 16 mil to 100k; I lost 95k to bit over 6k in the brokerage right now. Guy cant quit job because he sold himself to the military.",
        "created_utc": 1586940871,
        "id": "fngq6o6",
        "permalink": "/r/wallstreetbets/comments/g1l6v5/117k_to_5k_i_sit_here_typing_this_as_i_drown_my/fngq6o6/",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1586969671.0
    },
    {
        "author": "Apacheone",
        "body": "Yep in the same boat. I know people who have received 4 million in PPP, and others are still waiting. \n\nIt feels like the media and markets are completely disconnected from what's actually happening on the ground. The PPP program is a disaster. Nobody even knows the exact mechanisms for loan forgiveness yet. Food banks are jammed yet the markets are soaring? How is this going to look 60 days from now when people are struggling to find a meal and they find out trillions were spent to prop up asset prices and ensure the value of corporate bonds...",
        "created_utc": 1586834832,
        "id": "fncejah",
        "permalink": "/r/wallstreetbets/comments/g0xltw/main_street_is_fucked/fncejah/",
        "score": 119,
        "subreddit": "wallstreetbets",
        "created": 1586863632.0
    },
    {
        "author": "BitSexual",
        "body": "I now have several $k invested with a gecko for a financial advisor.",
        "created_utc": 1585771076,
        "id": "fm5dugr",
        "permalink": "/r/wallstreetbets/comments/ft7aby/ok_retards_gordon_has_spoke/fm5dugr/",
        "score": 117,
        "subreddit": "wallstreetbets",
        "created": 1585799876.0
    },
    {
        "author": "captainlvsac",
        "body": "There once was a man from Nantucket\n\nHe learned about puts and said fuck it\n\nHe lost his net worth thinking spy would inverse and now he has $rope and a bucket",
        "created_utc": 1586876555,
        "id": "fndsbqt",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fndsbqt/",
        "score": 116,
        "subreddit": "wallstreetbets",
        "created": 1586905355.0
    },
    {
        "author": "ma____",
        "body": "Whoever said \"reality doesn't matter anymore\" yesterday was 100% correct. We've just undone ~10 years worth of job construction in a matter of a month, we *should* be in the toilet right now, but as far as the market is concerned, we are at late 2019 levels.",
        "created_utc": 1587040878,
        "id": "fnkvapc",
        "permalink": "/r/wallstreetbets/comments/g2e1la/5245_million_weekly_jobless_claims/fnkvapc/",
        "score": 114,
        "subreddit": "wallstreetbets",
        "created": 1587069678.0
    },
    {
        "author": "Charliebush",
        "body": "The economy now runs on memes.",
        "created_utc": 1586795631,
        "id": "fnadkrr",
        "permalink": "/r/wallstreetbets/comments/g0m6v5/tesla_is_going_to_the_moon/fnadkrr/",
        "score": 113,
        "subreddit": "wallstreetbets",
        "created": 1586824431.0
    },
    {
        "author": "AloneForever",
        "body": "Thanks for your sacrifice, hopefully my puts print now.",
        "created_utc": 1586368099,
        "id": "fmt7i7y",
        "permalink": "/r/wallstreetbets/comments/fxb2n0/im_done_i_surrender/fmt7i7y/",
        "score": 110,
        "subreddit": "wallstreetbets",
        "created": 1586396899.0
    },
    {
        "author": "kodbell",
        "body": "Recently, I went through a similar scenario. Just sharing for other autists passtime,\n\n* I ended last year at 680K (started that year with $1800. Before 2019, I lost 120K in my lifetime)\n* After Iran bombing in Jan, I entered SPX puts expiring March 17 (lost 200k during  this time)\n* I bag held them until Feb 19 and exited for 520K account ( I got scared as all the dips are being instantaneously bought by bulls on the same day like previous COVID scare for 2 days from china, mysterious intraday drop on Feb 18 and several other days like that)\n* Immediately from the next week of Feb20, the market was in the toilet like crazy turmoil. I kept watching for a couple of weeks beating myself that I missed by 8-10 Million gain by closing my position on Feb19\n* To avoid stress I went leaps on deep 30% ITM BA(at 260), RCL(at 66), LYFT(at 38) calls for 2021 thinking they have super beaten already and deep ITM is safe but to my luck, they went further in the toilet.\n* my position is such that for my leaps to make any money all tickers should actually more than double in price.  so I thought why to bother with options and sold them and just bought shares in BA, Lyft, SAVE at their bottom. By now my account is 160k.\n* Waited a week for pop and exited all these 3 tickers shares for 35% gain and ended the account for 256K\n* Went all in on RGS shares for avg cost of 5.60 (averaged over 3 days but unable to catch bottom as later it went further to 4.20). However, I felt reasonably confident that it will at least $7-8 in 3-4 months considering just the franchise fees.\n* JPOW brrrrr...ing helped for the past week and this morning closed all the stock for avg price of 9.70. Now the account is 450K\n* Maybe making &gt;100% percent on just shares in the past 2/3 weeks feels better even though I still lost over 220kthis year. However, the main kicker is that I will feel worst forever for missing 8-10M gain as I waited so long and exited right before dumping on SPX puts. After missing this kind of once in a lifetime trade, I kind of lost appetite for riskier options thinking I may never beat that missed out trade odds.",
        "created_utc": 1586882102,
        "id": "fne2w5p",
        "permalink": "/r/wallstreetbets/comments/g17zmf/feast_your_eyes_on_my_losses_689k_on_spx_puts/fne2w5p/",
        "score": 109,
        "subreddit": "wallstreetbets",
        "created": 1586910902.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "I bought into $ROKU, the falling knife. at 100, 95, 85, 80 and then 68 as it plummeted. Finally, I am validated for my autistic stubbornness that a fucking pure play streaming platform with a solid cash to debt ratio shouldn’t be drilling to the center of the earth.\n\nNow I bet you feel silly for taking the kids and leaving me, Heather, as I lay in the bathtub, chanting ROKU, fully nude, while boiling an Amazon Firestick on the stove to appease the fickle streaming gods. Come back, babe, I’m better now.",
        "created_utc": 1586867547,
        "id": "fnddwq1",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fnddwq1/",
        "score": 108,
        "subreddit": "wallstreetbets",
        "created": 1586896347.0
    },
    {
        "author": "Bluerigg",
        "body": "I'm going to go broke trying to do this now",
        "created_utc": 1587071102,
        "id": "fnmgou9",
        "permalink": "/r/wallstreetbets/comments/g2jxyw/34k_566k_in_amzn_calls_this_week_im_out/fnmgou9/",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1587099902.0
    },
    {
        "author": "gratitudeisbs",
        "body": "Lol the Fed has been doing shady shit like this for decades now \n\nAmericans are too busy arguing about fringe issues like abortion and “climate change” and “gay rights” meanwhile the Fed has been stealing trillions of dollars of wealth from taxpayers and giving it to the 1%",
        "created_utc": 1586780018,
        "id": "fn9o7sf",
        "permalink": "/r/wallstreetbets/comments/g0hp5j/which_companiesbanks_are_getting_money_from_jpow/fn9o7sf/",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1586808818.0
    },
    {
        "author": "dlctrades",
        "body": "Honestly Buffet selling even that small stake in Delta helped out the 💎🖐 on my burning puts.\n\nBefore COVID media was saying he lost his touch having been outperformed by S&amp;P for the last 5 years. Sitting on a shit ton of cash everyone waiting for him to buy anything and instead he sticks to his guns, says everything is overvalued, and gives money back to shareholders.\n\nNow, especially if we do have another leg down, he has enough cash on hand to acquire companies for half of their market cap 2 months ago. \n\nHe wouldn't have sold Delta shares during the \"rally\" if he thought it was truly a V shaped recovery. \n\nI'm with the Oracle. SPY 273P 06/19 picked up today at the highs. Would love to add a 300P if it gets there so keep Brrrring Powell.",
        "created_utc": 1586402519,
        "id": "fmuznhg",
        "permalink": "/r/wallstreetbets/comments/fxjkoa/this_is_what_we_mean_by_bear_vs_bull/fmuznhg/",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1586431319.0
    },
    {
        "author": "mijnpaispiloot",
        "body": "Remdesivir tested multiple times and everytime was ineffective. Now it suddenly is the cure in a study with 125 covid patients, 2 died. 1.6% deathrate sounds awfuly familiar if you ask me...",
        "created_utc": 1587072445,
        "id": "fnmjaqs",
        "permalink": "/r/wallstreetbets/comments/g2nvb2/rip/fnmjaqs/",
        "score": 102,
        "subreddit": "wallstreetbets",
        "created": 1587101245.0
    },
    {
        "author": "magisteerial",
        "body": "All the positive news is priced in.  \"Be fearful when others are greedy\"...this is what you should do right now. Double bottom incoming......  \n\nLol just kidding fool brrrrrrrrrrrrrrrrrrrrr trumps all",
        "created_utc": 1586381802,
        "id": "fmtzirp",
        "permalink": "/r/wallstreetbets/comments/fxfe86/were_at_market_top/fmtzirp/",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1586410602.0
    },
    {
        "author": "Scarbane",
        "body": "Whoever sold those options is feeling pretty good right about now.",
        "created_utc": 1586793076,
        "id": "fna8n4h",
        "permalink": "/r/wallstreetbets/comments/g0jmfv/so_who_wants_to_volunteer_to_hold_me/fna8n4h/",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1586821876.0
    },
    {
        "author": "Lolsmileyface13",
        "body": "oh my gosh. \n\nall we needed was for the final bears yesterday to dump their loads. \n\nI AM THE FINAL BEAR AND I AM VINDICATED. ONLY DOWN 92% NOW",
        "created_utc": 1586955621,
        "id": "fnh5w80",
        "permalink": "/r/wallstreetbets/comments/g1pvny/daily_discussion_thread_april_15_2020/fnh5w80/",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1586984421.0
    },
    {
        "author": "midwestck",
        "body": "Carol in reception let it slip, now the cat's out of the bag SPY 5p 4/13",
        "created_utc": 1586801831,
        "id": "fnaq3bs",
        "permalink": "/r/wallstreetbets/comments/g0oc45/los_angeles_county_govt_opening_forecast/fnaq3bs/",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1586830631.0
    },
    {
        "author": "trpwangsta",
        "body": "Please browse don't kill yourself. Hopefully you're young and smart enough to realize you will make this money back. It stings now, but just know there are people out there that love you. Nobody here, but somewhere else for sure. Open up a Roth IRA and buy some mutual funds.",
        "created_utc": 1586891829,
        "id": "fnem5d5",
        "permalink": "/r/wallstreetbets/comments/g17zmf/feast_your_eyes_on_my_losses_689k_on_spx_puts/fnem5d5/",
        "score": 93,
        "subreddit": "wallstreetbets",
        "created": 1586920629.0
    },
    {
        "author": "ToastyBoyxd",
        "body": "i can only afford the bread line now",
        "created_utc": 1586814801,
        "id": "fnbfv5b",
        "permalink": "/r/wallstreetbets/comments/g0sh5u/maybe_trump_is_right/fnbfv5b/",
        "score": 93,
        "subreddit": "wallstreetbets",
        "created": 1586843601.0
    },
    {
        "author": "netxero",
        "body": "Easy, April 17 is now suddenly a few days away",
        "created_utc": 1586805018,
        "id": "fnawfgx",
        "permalink": "/r/wallstreetbets/comments/g0p8t5/jay_fucking_powell_ladies_and_gentlemen/fnawfgx/",
        "score": 92,
        "subreddit": "wallstreetbets",
        "created": 1586833818.0
    },
    {
        "author": "Slayer7413",
        "body": "Yup I sent one of my buddies an invitation to robinhood almost two years ago. About a week ago I got a message that I received a free stock from him signing up. At the time I invited him I kept bugging him to sign up and he never did, guess now he thinks this the time to buy stocks because I dont think he even knows what options are. I think a lot of noobs are seeing all the headlines on TV and thinking this is the bottom. Once they see their first big red day they all gonna be jumping ship",
        "created_utc": 1586815267,
        "id": "fnbgsho",
        "permalink": "/r/wallstreetbets/comments/g0say1/i_know_the_markets_headed_for_a_downturn_because/fnbgsho/",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1586844067.0
    },
    {
        "author": "PPfinance",
        "body": "Okay so not going to lie I've been thinking of quitting reddit for awhile now. Anyone that's been here for awhile knows that the big subs are basically just a collection of the same jokes or reposts, with almost the same verbatim top comments posted every time. The news section and politics subs are widely considered cancerous, so I stay away from those. I've unsubbed to basically everything except investing related subreddits and r/buildapcsales and r/hardwareswap.\n\nBeing subbed to this small amount of subs has made me realize that even the investing subs are generally pointless too. It's just a collection of the same hive mind posts day after day, with a few actual news or interesting posts every once in awhile. Don't even get me started on WSB, which has devolved into yet another sub where the same 5 jokes have been run into the ground for years. In the months that I've limited myself to these subs, I can't say I've really learned much or bettered myself as an investor. I can only read \"my case for the bear market\" so many times, clearly written by an 18 yr old with limited experience. Am I being pessimistic for wanting to get out of this place?",
        "created_utc": 1586783627,
        "id": "fn9sr5b",
        "permalink": "/r/investing/comments/g0gapr/goldman_sachs_predicts_sp500_at_3000_by_year_end/fn9sr5b/",
        "score": 87,
        "subreddit": "investing",
        "created": 1586812427.0
    },
    {
        "author": "tobinHQ",
        "body": "So you’re telling me that you think investors are just as confident now as they were in February of last year? Totally forgot about covid-18, my bad.",
        "created_utc": 1586783570,
        "id": "fn9so6f",
        "permalink": "/r/wallstreetbets/comments/g0ina1/before_you_pin_your_hopes_on_earnings_to_make/fn9so6f/",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1586812370.0
    },
    {
        "author": "Gatorm8",
        "body": "Yea I didn’t believe this 2 weeks ago when I was down 40% but now I’m down 80% and I get it",
        "created_utc": 1586921948,
        "id": "fng48lk",
        "permalink": "/r/wallstreetbets/comments/g1k8rs/the_market_can_stay_irrational_longer_than_you/fng48lk/",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1586950748.0
    },
    {
        "author": "TonySu",
        "body": "You are all under the impression that you're receiving a cheque with Trump's name printed in the corner or something. He's pulling a big brain move and printing his name on the receiver line. Trump is now the world's first trillionaire.",
        "created_utc": 1586952897,
        "id": "fnh29e7",
        "permalink": "/r/wallstreetbets/comments/g1p80a/trumps_name_to_appear_on_benefit_cheques_it_is/fnh29e7/",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1586981697.0
    },
    {
        "author": "Mayhem_Jones",
        "body": "\"Aytu Bioscience, Inc. (AYTU) Upgraded to Strong Buy: What Does It Mean for the Stock?\"\n\n...it means it will drop at LEAST 20% now. GREAT!!",
        "created_utc": 1586885818,
        "id": "fneabwq",
        "permalink": "/r/pennystocks/comments/g19yoq/aytu_bioscience_inc_aytu_upgraded_to_strong_buy/fneabwq/",
        "score": 86,
        "subreddit": "pennystocks",
        "created": 1586914618.0
    },
    {
        "author": "LactobaSILLY",
        "body": "They brought in a new ex-Nintendo executive with proven track record, closed down stores for time being (despite originally trying not to), and closed 300 stores that were bleeding. The new exec is promising a revamping of stores and streamlining the business. That might lead to why it’s up. \n\nTrust me, I hate GME as much as the next guy but I wouldn’t touch this for now, too many variables.",
        "created_utc": 1586874539,
        "id": "fndoo2b",
        "permalink": "/r/options/comments/g16fba/gamestop_up_35_more_valuable_than_precrash_puts/fndoo2b/",
        "score": 86,
        "subreddit": "options",
        "created": 1586903339.0
    },
    {
        "author": "FartSpeller",
        "body": "Even though you are a paper hands assed bitch, this is very good.  Any retard can hit a home run every now and again. Beating the market over 10 years is hard.",
        "created_utc": 1586964365,
        "id": "fnhl1wm",
        "permalink": "/r/wallstreetbets/comments/g1s3n1/yolo_update_160k_on_my_spxspy_puts_in_16_hours/fnhl1wm/",
        "score": 85,
        "subreddit": "wallstreetbets",
        "created": 1586993165.0
    },
    {
        "author": "purepwnage85",
        "body": "businesses have all of the money they need now! extremely bullish SPY 4000 EoW V shape recovery confirmed!",
        "created_utc": 1587048247,
        "id": "fnl72mc",
        "permalink": "/r/wallstreetbets/comments/g2g6mn/small_business_rescue_loan_program_hits_349/fnl72mc/",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1587077047.0
    },
    {
        "author": "doublebeatloaf",
        "body": "Psychology is fucking wild, man. I've really wanted a $500 guitar pedal for months now and haven't bought it because I'm a good boy and don't \"need it\".... yet here I am chuckling to myself about a $10k loss in 3 weeks lmao.",
        "created_utc": 1586827719,
        "id": "fnc3aw6",
        "permalink": "/r/wallstreetbets/comments/g0rmrr/what_are_your_moves_tomorrow_april_14_2020/fnc3aw6/",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1586856519.0
    },
    {
        "author": "toomuchtodotoday",
        "body": "Congrats! Now move to a real broker.",
        "created_utc": 1587049716,
        "id": "fnl9tok",
        "permalink": "/r/options/comments/g2gl9s/lk_puts_victory/fnl9tok/",
        "score": 84,
        "subreddit": "options",
        "created": 1587078516.0
    },
    {
        "author": "taniagx1",
        "body": "I can finally trade with confidence now. I’ve been in a dark place since.",
        "created_utc": 1586375247,
        "id": "fmtmfyu",
        "permalink": "/r/wallstreetbets/comments/fx8msd/the_true_wsb_logo_is_back_the_ugly_baby_is_gone/fmtmfyu/",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1586404047.0
    },
    {
        "author": "bwlodkowski",
        "body": "Good job in recognizing the pattern, but I’m not necessarily convinced it means anything or if it will continue. Now it very well could continue, but predicting the short term tendencies of the stock market is nearly an impossible task. If it were easy, there’d be millionaires everywhere.",
        "created_utc": 1586400394,
        "id": "fmuwf3s",
        "permalink": "/r/RobinHood/comments/fxgaf8/on_to_something_let_me_see_what_yall_think/fmuwf3s/",
        "score": 83,
        "subreddit": "RobinHood",
        "created": 1586429194.0
    },
    {
        "author": "tryexceptifnot1try",
        "body": "They better draw the whole thing now because that thing is going to be gone relatively soon. JPM is probably the best ran bank and they just told everyone they're preparing to eat a gigantic shit sandwich. Wait until we see what the badly ran banks are preparing for. WFC is reporting tonight and they are one of the mediocre banks so it should give some guidance on just how bad the the terrible banks are going to be. This should be a terrible sign for the market if the best ran bank is taking a significantly larger write down than expected. I still think the rug-pull is going down this week I just may need to protect myself and eat it on some of the positions to build a call hedge.",
        "created_utc": 1586867817,
        "id": "fnde9j4",
        "permalink": "/r/wallstreetbets/comments/g13ode/jpmorgan_posts_earnings_of_078_missing_estimate/fnde9j4/",
        "score": 82,
        "subreddit": "wallstreetbets",
        "created": 1586896617.0
    },
    {
        "author": "Salmonfisher420",
        "body": "The average American will suffer from this the rest of their life, the rich will now have inflated assets and buy up billions in stock to become richer. This fucked America for a good 20 years in taxes",
        "created_utc": 1586459454,
        "id": "fmx6phx",
        "permalink": "/r/wallstreetbets/comments/fxyhri/updated_chamath_palihapitiya_chairman_of_spce/fmx6phx/",
        "score": 82,
        "subreddit": "wallstreetbets",
        "created": 1586488254.0
    },
    {
        "author": "Randomness898",
        "body": "Yea that's a good question (tldr at end).  For some stocks it can be like 5+ years.  For sure, Tesla won't realize it's fundamentals until like 5+ years, and even then, it can pull a MSFT in which it goes from a blue chip to a blue chip + growth stock (with Azure), in which case, it still may not fully realize that part of it's fundamentals until we know how big cloud will be.\n\nBut when I invest, my target is always like 2+ years for all my stocks and for the stock market as a whole.  That's why I've always been buying this entire time, since even though we can definitely sell off short term back to say 240, I know long term, the stock market will be better than 280.  More importantly, I am confident the individual stocks I pick will be better than what they are currently longer term.  That's why a DCA approach is a fairly standard and safe approach.  Of course, you can adjust this DCA approach to be way more aggressive on drops and less aggressive on up moves (like buy way less on a day like today, if today was your set buying date).  I don't worry about the market going down short term for my long term investments.  Plus, if you look, so many tech stocks, like MSFT, AMZN, NVDA, NFLX, etc. are all up for the year despite this!\n\nNow, for trading, you can also trade the fundamentals in the short term - which would be months here.  If you believe the economy will be slower to return to work, if the Q1 and Q2 earnings will be bad, if the vaccine will take longer than normal, if social distincing in a way still continues even after we open up, if consumer demand is less, if the credit problem comes back, etc., or some combination of that, you can trade that.  So for example, you can buy like a 3 month 15% OTM put or something.  Perhaps you believe QQQ &gt; IWM (that's what I believe), so in that case, maybe if you are long QQQ, you can short IWM as a market hedge.  So many ways to trade that.\n\ntldr: \n\nTrading should be on either short term TECHNIALS (days - weeks) or short term FUNDAMENTALS (which will be months)\n\nInvesting should be on long term FUNDAMENTALS (which will be years).  I'm a believer in the US Economy and particularly the tech sector and a few non-tech stocks like COST, so I will always invest when I have the chance to do so, without having to always try to predict the bottom.  Predicting the bottom or the top is best used in the above trading section.",
        "created_utc": 1586916660,
        "id": "fnfw0iy",
        "permalink": "/r/investing/comments/g1imut/this_bear_market_rally_is_largely_due_to_fomo/fnfw0iy/",
        "score": 79,
        "subreddit": "investing",
        "created": 1586945460.0
    },
    {
        "author": "Lolsmileyface13",
        "body": "my puts haven't made money for legitimately more than 15 trading days now. \n\nand yet here I am. Retarded as ever.",
        "created_utc": 1586867433,
        "id": "fnddrjj",
        "permalink": "/r/wallstreetbets/comments/g13jnz/daily_discussion_thread_april_14_2020/fnddrjj/",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1586896233.0
    },
    {
        "author": "oarabbus",
        "body": "&gt;How is this going to look 60 days from now when people are struggling to find a meal and they find out trillions were spent to prop up asset prices and ensure the value of corporate bonds...\n\nThis. A head of household with a steady job has other things to worry about than how rich some people may be.\n\nBut take away his job, leave him unable to provide for his wife and children and he'll be ready to grab his pitchfork against any boogeyman in sight",
        "created_utc": 1586839217,
        "id": "fnckohq",
        "permalink": "/r/wallstreetbets/comments/g0xltw/main_street_is_fucked/fnckohq/",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1586868017.0
    },
    {
        "author": "heartbre4k_kid",
        "body": "„..., however given the likelihood of a fairly severe recession...“ \n\nJamie Dimon is one of the most influential bankers in our current time. Maybe even THE most influential with JPM being the biggest Bank in the US.\n\nI hope people stop downplaying now what’s to come after a statement like this.",
        "created_utc": 1586870386,
        "id": "fndhwod",
        "permalink": "/r/investing/comments/g13qp8/jpmorgan_reports_big_decline_in_firstquarter/fndhwod/",
        "score": 77,
        "subreddit": "investing",
        "created": 1586899186.0
    }
]