[
    {
        "author": "marksizzle",
        "body": "Great question! Two part answer. To be honest, usually these goals are just that. Goals. Typically set a little bit out of reach to motivate you to put in the extra work. So perhaps they believe $4.50 (just an example) is realistic, and $5.50 could only happen if he was really kicking ass. That being said, it gives him a target and you know the saying “shoot for the moon and you’ll land among the stars”.\n\nAdditionally, the CEO has a pretty solid background in which he led another PCIe tech company to success and an acquisition. They were purchased by Broadcom (a very large chip manufacturer of processors, SoCs, and connectivity chips). So yes, I believe that down the road there could be an acquisition in play, especially nvidia so heavily involved. Only time will tell on that part though.\n\nThanks for the questions.",
        "created_utc": 1594819517,
        "id": "fy541xp",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1594848317.0
    },
    {
        "author": "couscous_nouvel",
        "body": "apple beats earnings?? eps is less than half of pre covid and people aint buying more phones or watches.\nin fact broadcom warned apple not to launch new product due to low demand and supply chain shock.\n\nim not a bear or a bull, i just have bullshit allergy",
        "created_utc": 1596236577,
        "id": "fzxfxxl",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1596265377.0
    },
    {
        "author": "rfgrunt",
        "body": "Uh, Qualcomm blocked/fought the Broadcom merger. Qualcomm blocked from buying NXP is more applicable.",
        "created_utc": 1596220980,
        "id": "fzwbxyj",
        "score": 3,
        "subreddit": "investing",
        "created": 1596249780.0
    },
    {
        "author": "ritholtz76",
        "body": "I think, AVGO price is relatively cheaper compared to others. It is a big entity with decent growth expectations and good dividend.  Management seems to have good eye for buying tech companies and keep growing in size.",
        "created_utc": 1594525687,
        "id": "fxsnkw0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594554487.0
    },
    {
        "author": "nascentmind",
        "body": "This is true very much true in India. Most of these \"product\" companies are heavily filled with contractors and their numbers are almost equal to greater than the permanent employees. There are multiple contractors which are basically outsourcing companies with their employees working onsite at Intel, Cisco etc.\n\nMany a times I see that these contractors are employed to do the death march for failing products or if the company is failing, to keep them afloat. I have seen this with Renesas mobile which had their modem come from Nokia acquisition which had completely failed in the market. They then was brought by Broadcom and everyone was laid off and was again resold to some Chinese company.",
        "created_utc": 1595823118,
        "id": "fzdeta7",
        "score": 2,
        "subreddit": "investing",
        "created": 1595851918.0
    },
    {
        "author": "Myweedalt",
        "body": "Not soon but broadcom(September) still has some cheap 9/18s you can get now and hold.",
        "created_utc": 1596062667,
        "id": "fzo4rly",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596091467.0
    },
    {
        "author": "PM_ME_DANK",
        "body": "Come on over to r/dividends! We'd be happy to help you out. A search of the subreddit for 'dividend growth stocks' should get you started on the right path. Also can take a look at some of the top holdings of VIG and VIGI. Personally I love $AVGO, $LMT, $UNH, $MDT, $HD, $MA, etc",
        "created_utc": 1594572666,
        "id": "fxud5e5",
        "score": 2,
        "subreddit": "investing",
        "created": 1594601466.0
    },
    {
        "author": "bluemagic_112",
        "body": "What are your thoughts on AVGO? Seems it still has more room to run and IV is decent.",
        "created_utc": 1594781387,
        "id": "fy3thy7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594810187.0
    },
    {
        "author": "ReThinkingForMyself",
        "body": "There are still some decent buys in second tier tech like AVGO.",
        "created_utc": 1593967277,
        "id": "fx0fc0f",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593996077.0
    },
    {
        "author": "Take_Notice_Walk",
        "body": "I own TSM, Nvidia, LAM research, ABVO\n\nFor me TSM. Pretty steady and decent value\n\nNVDA. Overvalued but basically betting on the future being AI and blockchain \n\nLAM research for semis materials. Still room for growth. Pretty volatile so there might be more buying opportunities. \n\nBroadcom. A good dividend semi conductor. but i might consider dropping them for Qualcomm  \n\nI dropped Skyworks because I felt they relied mostly on Apple. Probably a dumb move since I need semi geared toward 5G",
        "created_utc": 1593923148,
        "id": "fwyx18i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593951948.0
    },
    {
        "author": "Iskippedfaceday",
        "body": "They have the only PCIe 4.0 product compatible with Nvidia’s A-100 GPUs.\n\nTheir revenue has increased by 57% YoY and is currently double their market cap.\n\nTheir CEO has led two companies in the exact same industry to success and one was bought out by Broadcom. \n\nThe idea is not that they’re going to be a tech giant, but that trading at 100,000k average volume does not align with the the types of contracts they land and the types of companies they do business with. My argument was that they don’t deserve to be a giant yet, but trading at $3-4 would make much more sense than trading at $2 when considering their resume.",
        "created_utc": 1594704495,
        "id": "fy0cba6",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594733295.0
    },
    {
        "author": "CharlieBrown364",
        "body": "I think QCOM has more potential than INTC, but is also riskier.\n\nI do think that TSM, AVGO, and NVDA are better than all the other semiconductor stocks. I would definitely buy these over QCOM or INTC. \n\nIf you want more growth (and therefore risk), you can go with AMD, MU, QRVO, or SWKS. Though do keep in mind that NVDA is growing very quickly. \n\nAlso, AVGO has a nice dividend.\n\nMy top semiconductor stock is NVDA. I want to buy in, but it’s pretty overvalued. But it also keeps going up.",
        "created_utc": 1594454308,
        "id": "fxmr102",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594483108.0
    },
    {
        "author": "bagel_maker974",
        "body": "MSFT, SHOP, AMZN, AVGO, AMT, CCI are all holdings I would buy and hold without looking at for 15 years without worries",
        "created_utc": 1594240580,
        "id": "fxcnzby",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594269380.0
    },
    {
        "author": "ritholtz76",
        "body": "That is a big negative news. Samething with lots of small FOMO cloud stocks here (NET and LLNW). Employers are dumping into this rally. \n\nI think AVGO is not bad in terms of valuations. But it is a big company.  It is a collections of Semi companies.  mgmt seems to be thriving with this business model. Good dividend as well. They can pull close to $25 EPS next year. It went all the way to $150 during sell off and doubled in to the rally. I bought some at current price.",
        "created_utc": 1595083917,
        "id": "fygswdn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595112717.0
    },
    {
        "author": "ritholtz76",
        "body": "They have 13B long term debt with and 100B market cap.  Not sure if it is a bad thing. AVGO has a bigger debt. That is how they seem to roll with by buying companies.",
        "created_utc": 1595090326,
        "id": "fyh435a",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1595119126.0
    },
    {
        "author": "Interesting_Material",
        "body": "MSFT, V, PKG, NET, TER, KL, AVGO are the main ones I've been putting money in.",
        "created_utc": 1596223631,
        "id": "fzwiouu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596252431.0
    },
    {
        "author": "isospeedrix",
        "body": "Ugh my AVGO call placed at bottom didn’t filll",
        "created_utc": 1596209644,
        "id": "fzvhgyc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596238444.0
    },
    {
        "author": "ThisPomelo4",
        "body": "That's a really interesting observation. The stock has consolidated around this level three times in the past 15 months or so. Kind of makes me wonder what could carry it across the threshold. Broadcom is involved in a variety of businesses, which makes it hard to trade the stock around individual headlines or events related to 5G, China, slowing handset demand, datacenters, cloud....\n\nAlso, what's up with the discrepancy between their EPS figures? The non-GAAP figure is always several times the GAAP figure, and the explanation they offer is extremely vague.\n\nAre you thinking it could break out up, or down? Seems like spot has been poking at that $320 ceiling from time to time. It wants to break through.",
        "created_utc": 1596085333,
        "id": "fzp7hmv",
        "score": 1,
        "subreddit": "options",
        "created": 1596114133.0
    },
    {
        "author": "Parallelism09191989",
        "body": "AVGO\n\nIt’s a slow boring stock that’s increased dividends 6x \n\nIt’s legit",
        "created_utc": 1593885631,
        "id": "fwx9cxq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593914431.0
    },
    {
        "author": "Crazycracker24",
        "body": "If u wanted to do this, why not buy hood stock like AT&amp;T,broadcom,atria,  and get 1000 dollars in dividends a year and use the dividends to buy into pennies, that way you're playing with positive money.",
        "created_utc": 1594012782,
        "id": "fx2lhnx",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1594041582.0
    },
    {
        "author": "Mausteidenmies",
        "body": "Nokia uses broadcom processors (that weird ReefShark thingy) for their base stations and Ericsson uses Intel surprisingly.\n\nI wouldn't touch Huawei with a stick.",
        "created_utc": 1593697859,
        "id": "fwp2auc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593726659.0
    },
    {
        "author": "kalavoycekala",
        "body": "For every one example you give that supports your argument there are 10 I can give to support mine. Look at Amazon, Netflix, Broadcom, Alibaba, Google, Nvidia, veeva, Facebook, etc. What does doing this achieve? It's the very definition of a confirmation bias.",
        "created_utc": 1594660799,
        "id": "fxy4jpf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594689599.0
    },
    {
        "author": "type_error",
        "body": "AVGO?",
        "created_utc": 1594332205,
        "id": "fxgwb3j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594361005.0
    },
    {
        "author": "GooseRage",
        "body": "I’m personally a fan of dividend paying tech stocks AVGO, TXN, and IBM all pump out a pretty good dividend while also having growth potential.",
        "created_utc": 1594213105,
        "id": "fxb46r8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594241905.0
    },
    {
        "author": "SpaceBollzz",
        "body": "I just trickled some fractional shares with microsoft and canadian solar, broadcom. Waiting for more red days... and deeper red days",
        "created_utc": 1595542360,
        "id": "fz107gu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595571160.0
    },
    {
        "author": "CheapAlternative",
        "body": "No. They're a shitty company with no technical excellence that nickels and dimes you on literally everything internally. Fundamentally intel will not be as successful as say AMD/Nvidia/Apple/Google/Broadcom for the simple reason that no self respecting engineer will want to work for them vs competitors elsewhere. They've been poached to the bone over the last 4 years and never even tried fighting back.",
        "created_utc": 1595623333,
        "id": "fz4o9fg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595652133.0
    },
    {
        "author": "dameLillardManiac",
        "body": "yup. im tits deep in uvxy calls and avgo puts.",
        "created_utc": 1595372359,
        "id": "fyte1pa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595401159.0
    },
    {
        "author": "frrealz",
        "body": "Sorry, still don't understand your point. \n\n1. Qualcomm does not have any dealings with Huawei at the moment. They might START supplying Huawei with SoCs and modems, so Qualcomm will be gaining market share in China. Additionally, this would mean the QCOM-Huawei patent dispute would be resolved, with the chips in QCOM's favor.\n2. Qualcomm has a large involvement with the US government. There is a reason the Broadcom takeover was blocked and that the Feds strongly recommended FCC to revoke their ruling.",
        "created_utc": 1595017941,
        "id": "fyeak4g",
        "score": 1,
        "subreddit": "investing",
        "created": 1595046741.0
    },
    {
        "author": "ritholtz76",
        "body": "Earning suppose to go up during next 5g cycle. Trading at reasonable valuations. Similarly with Broadcom. These are pretty big market cap companies. We are not going to see big returns. QCOM is a defianation of company with big moat technology. Management bought back 25% of the shares in last few years. I am really not sure how to evaluate these tech stocks with every reporter giving price targets at 30 to 40 PE future multiples with some TAM justification. I got little but of these two.",
        "created_utc": 1595040000,
        "id": "fyfdexm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595068800.0
    },
    {
        "author": "snake250",
        "body": "Oh sorry, I missed that you had AVGO already. Good choice.",
        "created_utc": 1594999253,
        "id": "fyd8873",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595028053.0
    },
    {
        "author": "HJForsythe",
        "body": "Fuckkkkkkkkkkkkkkkkk. Maybe if broadcom or qualcomm announces a acquisition. Without that they're fucked for a year.",
        "created_utc": 1596201952,
        "id": "fzuxzy3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596230752.0
    },
    {
        "author": "svgscrewball",
        "body": "Seems pretty good for a start. On the DIP I would add\nMA, V, QQQ, ARKW.\n\nIf you have a very long time horizon (and are risk tolerant) you might want to consider\nMELI, FSLY, NOW, SHOP, AVGO",
        "created_utc": 1593852398,
        "id": "fwvyoz3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593881198.0
    },
    {
        "author": "IndependentElevator2",
        "body": "23 y/o heading to law school next month.\n\nTaxable Brokerage:\n\n3 AVGO, 1 BLK, 20 BRK.B, 16 CRM, 11 CRSP, 5 DIS, 5 GS, 3 IXC, 100 JPM, 44 MSFT, 1 NRZ, 35 O, 4 SPG, 6 SQ, 2 T, 7 TWLO, and 1 WFC\n\nRoth IRA:\n\n20 BRK.B, 10 MSFT, 1 O, 6 VGT, 50 VNQ, and 43 VTI\n\n401K:\n\n$19460 in short term bonds to be transferred to Roth IRA",
        "created_utc": 1594015561,
        "id": "fx2oudw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594044361.0
    },
    {
        "author": "Furloughedinvester",
        "body": "Broadcom apparently has a very nice dividend as well as the potential for great future growth.\n\nI've been eyeing them for a while but I'm already so damn heavy in the tech sector I hesitate to add more. However, once I've balanced my portfolio a bit with some consumer staples I'm going to add them for sure.",
        "created_utc": 1594277698,
        "id": "fxee09d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594306498.0
    },
    {
        "author": "TrudeausMakeupArtist",
        "body": "MU or AVGO for the \"value\" chip play? Looking for a 20% price upside when the dust settles.",
        "created_utc": 1594691394,
        "id": "fxzsj8e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594720194.0
    },
    {
        "author": "Vanmenton",
        "body": "I have a 220k+ portfolio and I only have 20k in tech (Broadcom). All other tech companies are valued based on future earnings and I don't play that game. Yes, over the past 5-6 years (when I started in my mid 20s) I could have made a killing, but I'm still not comfortable investing in a business that makes no money. \n\nApple makes money but I simply hate it with a passion so I won't invest in it. Google and Microsoft are overvalued. The rest are all junky meme stocks for the most part.",
        "created_utc": 1594767519,
        "id": "fy35rog",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1594796319.0
    },
    {
        "author": "Shaun8030",
        "body": "No amzn ? Long term Nvidia  &gt;&gt; Broadcom due to superior growth potential imo",
        "created_utc": 1594768554,
        "id": "fy37nli",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1594797354.0
    },
    {
        "author": "HammyHamDog",
        "body": "It doesn’t go with the theme of my portfolio... but I think it is a good company to invest in for the future... I believe in the CEO, and I believe in the company.... \n\nI personally like dividend paying value stocks with growth potential.... VZ, PFE, CSCO, AVGO, IBM, with a little something for super inflation like GOLD..\n\nBut the reason I suggested to you camping world was because you asked about fishing... and that is the company I believe to have an amazing CEO",
        "created_utc": 1594780808,
        "id": "fy3sj8i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594809608.0
    },
    {
        "author": "Chem3580ThrowAway",
        "body": "Yeah I hold AVGO in my portfolio because it seems like a more stable business (will always needs semiconductors regardless of what tech company seems to be \"hot\" in the moment)",
        "created_utc": 1594994947,
        "id": "fyczpcc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595023747.0
    },
    {
        "author": "snake250",
        "body": "Nice portfolio, I hold CVS, BMY, PFE and MO as well.\n\n&gt;&gt;No exposure to telecoms\n\nTake a look however at AVGO, TXN and QCOM. Dividend yields are comparable to PFE or JNJ. These are not \"hot\" tech stocks such as AAPL, but they are semiconductor manufacturers with durable businesses and if you think that tech will continue to \"grow and boom\", then semiconductor demand is going to continue to go up as well.",
        "created_utc": 1594993498,
        "id": "fycx3ab",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595022298.0
    },
    {
        "author": "CharlieBrown364",
        "body": "I would recommend that you DCA (dollar cost average) into a mix of market ETFs (SPY, VOO), blue chip stocks (FAANG, MSFT, WMT to name a few), dividend stocks (not sure, maybe JNJ, PEP, AVGO, MO, O), growth stocks (PYPL, ADBE, TTD, TSLA, SQ, NVDA), and growth ETFs (WCLD, QCLD, ARKK).\n\nGenerally, having about 20-30 stocks is “diversified enough”. \n\nIf you want to be a little risky, you could put some of your money in Bitcoin. It’s INCREDIBLY risky, but has The potential to be huge. Just don’t put more than 10% of your money into it.\n\nIf you want to have some fun, and also be risky, you could put 5k aside for swing trading and day trading. This could be playing earnings season, news articles, penny stocks, or SPACs. You should only do this if you enjoy doing it, and beware of this risk involved.\n\nI am not a financial advisor, so don’t take my advice without doing your own DD (due diligence). I’m just a 15 year old kid with too much free time and an interest in stocks. \n\nAlso, I’m more interested in tech stocks, so the examples I gave above are all related to tech (other than the dividend stocks and QCLN). Keep this in mind.\n\nAlso, to the rest of you, what do you think about my strategy, and what do you think about my stock picks? Anything else you think OP should know?",
        "created_utc": 1594455347,
        "id": "fxmuazz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594484147.0
    },
    {
        "author": "eskimohazz",
        "body": "CrowdStrike - they have the best and simplest EPP/EDR solution on the market, and the enterprise endpoint security market is collapsing and it’s not looking good for incumbents like Symantec/Broadcom or McAfee.",
        "created_utc": 1594430242,
        "id": "fxlavst",
        "score": 1,
        "subreddit": "investing",
        "created": 1594459042.0
    },
    {
        "author": "landob",
        "body": "Thats really odd. I literally took the first advice I found \"invest in what you know\" and have had nothing but profit. Barely looked at any financial sheets. I work in IT, so most of what I grabbed is stuff I really know.\n\nWDC, AMD, QCOM, AVGO, LOGI - every single one of them is up for me.\n\nThen a couple randoms\n\nSYF - I owe them money on multiple cards. I like the 0 interest financing\n\nELF - I asked my wife what she would invest in, she chose this. I actually did look into its financials, board of directors, CEO etc and liked what I saw.\n\nWEN - I love their food, bought in when they announced breakfast\n\nWTRG - bought soley just to add to some diversification. Like I just brought up a list of dividend stocks and said to myself \"hmmm we always going to need water. Ill buy this\"\n\nYou could get a monkey to pick some random stocks and hold them and you will make money in this market it seems to me. Only things I've lost money on is random pennystocks I've derped with. Oh and Carnival, I was holding some of that before this Covid mess &gt;.&lt;",
        "created_utc": 1595545490,
        "id": "fz16axd",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1595574290.0
    },
    {
        "author": "sayjota",
        "body": "You can use M1Finance to create fee-free \"etfs\" of your own. I have a pie holding 11 semi stocks in equal weights (TSM, NVDA, QCOMM, AVGO, AMD, etc) and it's 100% free.",
        "created_utc": 1596055670,
        "id": "fznquao",
        "score": 1,
        "subreddit": "investing",
        "created": 1596084470.0
    },
    {
        "author": "hammondish",
        "body": "$1000 heh?\nI'd find something a little more exciting than MSFT or NET...\nAt your age, you can afford to take some risks and wait for a company to grow. If you started 20 years ago, advice like MSFT would be like advice to buy Ford (20 years ago). 20 years ago it would have been better to buy MSFT, and not particularly risky either.\n\nHere's what you should do.\nNCNO IPOs tomorrow.\nSit at your computer or phone or whatever, and watch for this stock to start trading.\nPut all your money into it the minute it starts trading.\nNow you can either hold it for a couple years while it booms, or take an exit in the next day or two when it for a quick 20-30% or more.\n\nI own MSFT, GOOG, AMZN, PYPL, and many others that have produced 100-200% gains for me, but I bought them in 2016, not now.\n\nKeep putting your money into your account and buy 40% boring stable stocks like MSFT, but really now is kind of a questionable time to be buying stocks like NET or SHOP... these things have a LOT of room to cool off. More important than what you buy, is developing a strategy and learning to follow stocks.\n\nIf anything, I'd wait for the next dip (which I think will hit this week), and take some positions in stocks that haven't fully broken out yet, but have pretty solid long term growth in front of them (I'm looking at you AMD, EDIT, SNCR, RAMO, CRNC, ADPT).\n\nFor long, low-risk, my next investment will be FISV.\nMy most recent high-risk play was OSS bought last week... 30% up from there.",
        "created_utc": 1594694778,
        "id": "fxzy8mp",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594723578.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "Then why not buy any other payment processor? 20 years from now SQ could be left by the wayside by better services/products, as that is already happening right now.\n\nShit, V, MA, and FISV aren’t mooning like them.",
        "created_utc": 1594168824,
        "id": "fx9j083",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594197624.0
    },
    {
        "author": "wild__illusion",
        "body": "Should I sell my FISV 8/21 110callsfor 200% profit? Or will the momentum continue?",
        "created_utc": 1594831808,
        "id": "fy5s59y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594860608.0
    },
    {
        "author": "wild__illusion",
        "body": "I took profit at 100% with LVGO and it mooned 10% the next day. missed out on 1000% gain. The momentum is great with FISV.",
        "created_utc": 1594832264,
        "id": "fy5t415",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594861064.0
    },
    {
        "author": "Legitimate-Assistant",
        "body": "I work in the industry and can say that the logic is exactly how Visa, and other similar companies will be moving forward. \n\nFor Visa, look no further than their acquisition of Cardinal Commerce(used for the aforementioned payer authentication)  and Plaid(finance data transfer) to see that Visa is dumping literal billions into new technologies and consolidating their position. While also participating in every single possible chargeable service in payment processing and using their extensive platform to cooperate with MasterCard and other card networks to create a unified payment processing ecosystem.\n\nFor Square, their big services are their merchant aquiring + gateway services and cash app(big Bitcoin volumes exchanged here), while also offering payroll and banking services.  Their value will be dependent on Cash app utilization, their ability to poach merchants from existing providers, and their ability to build new technologies while implementing existing ones into their suite of services. \n\nFiserv is another interesting mover, they are helping to allow for the acceptance of Ebt transaction online, a big deal for American grocery retail with the transition to online ordering. They also are now the acquiring bank for Aldi as of July 3 and this added over 2k locations to their customer base. \n\nAlibaba is popular to most because we all know the online store, but they also are a FinTech provider and have Ant financial/Alipay under their belt. And they heavily invest in new technologies. \n\nEven PayPal is still highly profitable with potential for further growth. Using app based tech like one touch, and the overall simplicity of their process is fantastic. But it is yet to be seen how negatively they will be impacted by the universal checkout standard the big 4 card networks are set to release.\n\n\nCheck out FINX for a FinTech ETF and compare it's performance by % to Spy. You will be impressed.",
        "created_utc": 1594145727,
        "id": "fx89cq1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594174527.0
    },
    {
        "author": "troy_caster",
        "body": "FISV a buy or not?",
        "created_utc": 1594822805,
        "id": "fy59uq0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594851605.0
    },
    {
        "author": "troy_caster",
        "body": "does anyone know anything about FISV?",
        "created_utc": 1594823624,
        "id": "fy5bdnn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594852424.0
    },
    {
        "author": "jtbm99",
        "body": "I am going to buy 1000 FISV 105c 7/17",
        "created_utc": 1594772696,
        "id": "fy3esab",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594801496.0
    },
    {
        "author": "thebabaghanoush",
        "body": "Or just buy QQQ\n\nOr if you insist buy QQQ or FTEC (tech), XAR (defense), FISV (fintech), and FSTA (consumer spending)",
        "created_utc": 1595000986,
        "id": "fydbon8",
        "score": 1,
        "subreddit": "investing",
        "created": 1595029786.0
    },
    {
        "author": "Jng87",
        "body": "I would buy all the stocks on your list except square. It could continue to do very well but is out of my risk tolerance (valuation and still too early, they will need to challenge bigger players to penetrate the larger market) I’m less concerned about pypl’s valuation because they already have broken into the mainstream market especially government issued payments. In general regarding valuation in this space they are all going to be higher current valuations because they are al high quality businesses with high expected growth rates I believe you have to analyze the potential addressable market and probability they can enter and take market share that you can come up with your own estimation of fwd P/E say 3-5 years out or else you will always look at the next year fwd PE and say it’s too high...\n\n\nSo the way I see it\n\n-pypl is the high growth play\n-v and ma are the established mature companies in this space that can still do double digits\n-fiserv is the value play\n-square has been on a tear and is in more speculative territory",
        "created_utc": 1594566541,
        "id": "fxu1t9y",
        "score": 1,
        "subreddit": "investing",
        "created": 1594595341.0
    },
    {
        "author": "Monitor9News",
        "body": "&gt; Paypal - How concerning is the PE ratio? At 112, it's very high. Is that because it is overvalued or because of something else, is a bad indicator in this case? \n\nYes, it's bad. It means it's incredibly overvalued, especially considering that its astronomical rise in value happened in the past four months.\n\n&gt; Square - Love this stock, but they are barely making money. Is that a problem at this point?\n\nThey made money last year, but not in Q1 of 2020. What's more concerning is that the stock is also overvalued.\n\n&gt; Visa - regulatory risk in europe, but they own authorize.net, which is huge in internet payments  \n&gt;  \n&gt;Mastercard - not sure how this is different from visa\n\nMore or less fairly valued or slightly overvalued blue chip stocks. They're not going anywhere anytime soon.\n\n&gt;Fiserv - They bought first data, which is good. Havent recovered since the covid crash.\n\nWhat's worrying me about them is the level of insider stock selling. Valuation isn't that attractive either.",
        "created_utc": 1594447829,
        "id": "fxm5uxm",
        "score": 1,
        "subreddit": "investing",
        "created": 1594476629.0
    },
    {
        "author": "troy_caster",
        "body": "So...I'm sitting here wondering...\n\nAnyone have a TL:DR on why FISV isn't mooning along with SQ and PYPL?",
        "created_utc": 1594338381,
        "id": "fxh7yde",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594367181.0
    },
    {
        "author": "Dingaling015",
        "body": "Just a few I've come across so far:\n\nDLPN - public offering ends tomorrow, ER expected by end of next week or sooner, already getting pumped by Yates though so caution here.\n\nEROS - Rumored merger announcement with STX, recently been approved so we're all just waiting for a PR. It's already run up quite though (again thanks to Yates lol) so who knows.\n\nThere's also CHFS which has been well enough talked about here but I did not buy so do your own DD. There are also several other COVID plays that people have been talking about but hardly any volume to merit a second look.\n\nBut yeah this week's been meh.",
        "created_utc": 1594243569,
        "id": "fxcu7ou",
        "score": 7,
        "subreddit": "pennystocks",
        "created": 1594272369.0
    },
    {
        "author": "MostRetardedAutist",
        "body": "I've got AMD $63p weekly FD.  Hoping STX is the fortune teller for AMD.",
        "created_utc": 1595967045,
        "id": "fzjqjb1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595995845.0
    },
    {
        "author": "SuspiciousStuff3",
        "body": "Western fucking digital, slayed on their last earnings never recovered and Seagate just got wacked for missing, their direct competition 9/18 45 calls bias",
        "created_utc": 1596062819,
        "id": "fzo51ul",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596091619.0
    },
    {
        "author": "MustardQuenelle",
        "body": "Why isn't Seagate in the graphic?",
        "created_utc": 1595934696,
        "id": "fzi2l9z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595963496.0
    },
    {
        "author": "VeggieVendor",
        "body": "Started investing about 3 weeks ago. Made some mistakes but I think my portfolio right now is decent. Any feedback is much appreciated.\n\nABBV - 4 @ 96.73 (99.28)\n\nSPCE - 5 @ 16.07 (16.79)\n\nSTX - 5 @ 50.32 (46.56)\n\nTSLA - 0.1488 @ 1343.25 (1365.88)\n\nNFLX - 1.43131 @ 457.62 (502.78)\n\nFB - 2 @ 212.20 (243.58)\n\nAAPL - 1.32175 @ 359.56 (381.37)\n\nMSFT - 2.51192 @199.49 (212.83)\n\nMCD - 2 @ 186.21 (185.83)\n\nQQQ - 1 @ 255.93 (259.99)\n\nVYM - 3 @ 79.87 (78.90)\n\nI want to slowly increase my holdings in MSFT and NFLX long term, as well as in QQQ.",
        "created_utc": 1594260978,
        "id": "fxdq9u7",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594289778.0
    },
    {
        "author": "Rossoneri",
        "body": "&gt;  this sub has really rejected the potential of this stock for no reason\n\nThe reason is that it's got 40M in market cap.  It's a tiny company that does a tiny amount of business.  Your list of \"partners\" paints an overly optimistic picture when it's really more of a list of \"people who buy their products and people who sell products to them\".  The build some specialty computing, nothing really groundbreaking here. \n\nAlso \"Puma\" is one of their brands, it's not their partner.  They might be an interesting company, but the shilling and misleading posts indicate that they are closer to being pump &amp; dump than real quality.\n\n-----------------------------------------------\n\n**For comparison:**\n\n**broadberry.com** Partners: toshiba, seagate, intel, amd, windows, nvidia\n\n**dihuni.com** Partners: lockheed, duke, intel, johns hopkins, NASA, US Navy, FDA, UCIrvine, UCSF\n\n**abmx.com** Partners: microsoft, redhat, western digital, intel, supermicro, vmware, ubuntu\n\nIf anybody claims a company has a \"partnership\" without showing the contract details.  Ignore them.",
        "created_utc": 1594701368,
        "id": "fy08a0s",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1594730168.0
    },
    {
        "author": "andrewchapman17",
        "body": "greenland staring gerald butler by stx entertainment in theaters august 16th, official trailer on youtube has over 7 million views",
        "created_utc": 1594263549,
        "id": "fxdulww",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594292349.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 27th of July\n\n\n\n## Upcoming events for Monday, July 27th\n\n - Stock splits:\n\n    - FMO @ **1:5**\n    - MCC @ **1:20**\n\n - Expected earnings:\n\n  ABCB, ACI, AGNC, AMG, AMKR, ARE, ARLP, AVY, BOH, BRO, BSVN, CATY, CBU, CINF, CMRE, CR, CSBR, CX, DGICA, DSX, EHC, EQT, FBMS, FFIV, FIBK, FIX, FRBA, FRTA, FSB, GOOD, HAS, HBMD, HBT, HMST, HSII, HSTM, HTLF, HXL, IBA, IVAC, JBT, JJSF, LECO, LKFN, LM, LXFR, MEDP, MEDS, MMLP, MNSB, NBTB, NOV, NWBI, NXPI, OGS, OMF, PCH, PFG, PMBC, PPBI, PRK, QCRH, QTS, RBB, RNST, RPM, SALT, SAP, SBFG, SI, SMBC, SSD, TBI, TCF, TESS, TFII, TNET, UHS, USAK, VCRA, VET\n\n - Ex-div:\n\n  CVLY, FAST, SAFM\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.193%)\n    - 3-Month Bill Auction (previous: 0.120%)\n    - 5-Year Note Auction (previous: 0.330%)\n    - 6-Month Bill Auction (previous: 0.130%)\n    - Core Durable Goods Orders (consensus: 3.5%, previous: 3.7%)\n    - Dallas Fed Mfg Business Index (previous: -6.1)\n    - Durable Goods Orders (consensus: 7.2%, previous: 15.7%)\n    - Durables Excluding Defense (previous: 15.3%)\n    - Goods Orders Non Defense Ex Air (consensus: 2.3%, previous: 1.6%)\n    - Investing.com Gold Index (actual: 52.6%, previous: 50.9%)\n    - Investing.com S&amp;P 500 Index (actual: 41.0%, previous: 40.0%)\n\n## Upcoming events for Tuesday, July 28th\n\n - Stock splits:\n\n    - EMO @ **1:5**\n    - CEM @ **1:5**\n    - CTR @ **1:5**\n\n - Expected earnings:\n\n  AAT, ABG, ACCO, AFL, AGYS, AKAM, ALRS, AMAL, AMD, AMED, AMGN, APAM, APEN, ARCH, ASC, ASH, ATEN, ATRC, AUDC, AWI, AXS, B, BDGE, BE, BEN, BGFV, BPFH, BSBR, BUSE, BXP, BYD, CAC, CAR, CATC, CB, CCS, CE, CHRW, CMI, CNC, COWN, CSGP, CSLT, CSV, CVLT, CYH, DCOM, DENN, DHI, DTE, DXCM, EBAY, EBMT, ECL, EDU, EGP, EIX, ENVA, EQR, FBC, FBP, FCF, FELE, FEYE, FTV, GLW, GSS, HA, HAFC, HBCP, HIW, HLI, HOG, HP, HRZN, HUN, IBCP, IBTX, IMAX, IRDM, IVZ, JBLU, JNPR, LBC, LBRT, LH, LSCC, LW, MASI, MCD, MDC, MDLZ, MLM, MMM, MO, MPWR, MRC, MSCI, MTDR, MXIM, NBR, NEO, NWE, OKE, OMCL, OVV, OXSQ, PEGA, PFC, PFE, PII, PJT, PKG, PKI, PLT, PRGX, PRLB, PROV, QUMU, RCKY, RDHL, RNR, ROK, ROP, RRD, RTX, RVSB, RXN, SAN, SBUX, SHW, SIFY, SITC, SPGI, SPN, SQNS, SSNC, SSTK, ST, STAG, STX, SYX, TCS, TENB, THFF, THG, TPB, TRMK, TRU, TRVG, UDR, UMBF, UNM, USX, V, VBTX, WAB, WAT, WDR, WH, WNC, WNEB, WRE, XGN, XRX, YNDX, ZBRA\n\n - Ex-div:\n\n  AMRB, ATR, CFG, CLX, ENTG, GBX, WST\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 0.511%)\n    - API Weekly Crude Oil Stock (previous: 7.544M)\n    - CB Consumer Confidence (consensus: 94.5, previous: 98.1)\n    - Dallas Fed Services Revenues (previous: 5.7)\n    - Redbook (previous: -7.5%)\n    - Redbook (previous: 1.9%)\n    - Richmond Manufacturing Index (previous: -27)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -28)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 4.0%, previous: 4.0%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 0.3%, previous: 0.3%)\n    - Texas Services Sector Outlook (previous: 2.1)\n\n## Upcoming events for Wednesday, July 29th\n\n - Expected earnings:\n\n  AAN, ACGL, ADM, ADP, AEGN, AEM, AER, AGI, AHCO, AHT, AIN, AJRD, ALG, ALGT, ALIM, ALKS, ALTA, ALTM, AM, AMP, ANTM, APA, APHA, APLS, APRN, AQMS, AR, ARCB, ASGN, ATNI, AVB, AVGR, AVTR, AX, AXTA, BA, BBVA, BCO, BDC, BG, BHLB, BKCC, BKU, BLKB, BOOT, BSGM, BSMX, BSX, BTU, BXMT, CAKE, CBL, CCI, CCJ, CDE, CERN, CF, CFFN, CFMS, CGNX, CHDN, CHE, CHEF, CHT, CLS, CME, CMO, CMPR, CNMD, CODI, CONE, CORR, CPAC, CPF, CPLP, CRHM, CRTO, CS, CTO, CTSH, CVEO, CXO, DIN, DRE, DRTT, DT, DX, EEFT, EGOV, ENB, EPD, EQC, EQIX, ESRT, ETN, ETR, EVBN, EXEL, EZPW, FB, FBHS, FCPT, FICO, FISI, FLOW, FSS, FTI, GAIN, GD, GE, GIB, GLDD, GM, GRFS, GRMN, GWB, HBB, HBNC, HES, HESM, HI, HOLX, HOME, HPP, HWKN, ILPT, INOV, IO, IPG, IRT, ISBC, JAKK, JCS, JHG, JRVR, KAMN, KGC, KLIC, KN, KRA, KRC, KTOS, LADR, LFUS, LIVN, LRCX, LXU, LYG, MAA, MANT, MC, MCO, MEET, MEOH, MFG, MGLN, MGRC, MHH, MHO, MKSI, MLVF, MMSI, MNRO, MOBL, MPX, MSEX, MTOR, MTSI, MUFG, MYRG, NEXA, NGVT, NLS, NLY, NMM, NMR, NOA, NOVA, NOW, NSC, NSCO, NYCB, OC, OCX, OII, OIS, OMC, ONDK, ORLY, ORN, PAG, PB, PDM, PEIX, PGRE, PI, PPC, PS, PTC, PYPL, QCOM, QEP, QRVO, R, RAIL, RDWR, RDY, RES, RGCO, RIG, RJF, ROIC, ROL, RYI, SAIA, SANM, SBBP, SBH, SBPH, SC, SCI, SDPI, SFM, SGC, SHOO, SHOP, SIGI, SIMO, SITE, SIX, SKY, SLAB, SLRX, SMG, SNY, SP, SPFI, SPG, SPOT, SRDX, SREV, SRI, STRA, SWIR, TAK, TARO, TBIO, TBPH, TDOC, TEL, TGI, TKC, TLRD, TMDI, TPC, TPL, TRNO, TROW, TROX, TRTX, TS, TSE, TSEM, TSU, TT, TTEK, TTMI, TUP, TX, TYL, UCTT, URI, UTHR, UVE, VAC, VGZ, VICI, VKTX, VNDA, VSEC, VTVT, WERN, WHD, WING, WIRE, WLL, WRI, WTI, WTRE, XAN, YUM, YUMC\n\n - Ex-div:\n\n  AM, BPMP, ERF, FRC, HMLP, KNOP, MSB, PVBC\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.076M)\n    - Crude Oil Inventories (consensus: -2.088M, previous: 4.892M)\n    - Cushing Crude Oil Inventories (previous: 1.375M)\n    - Distillate Fuel Production (previous: -0.097M)\n    - EIA Refinery Crude Runs  (previous: -0.103M)\n    - EIA Weekly Distillates Stocks (consensus: -0.618M, previous: 1.073M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.5%, previous: -0.2%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (consensus: -1.386M, previous: -1.802M)\n    - Gasoline Production (previous: -0.016M)\n    - Goods Trade Balance (previous: -75.26B)\n    - Heating Oil Stockpiles (previous: -0.750M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 5.1%)\n    - Pending Home Sales (consensus: 15.3%, previous: 44.3%)\n    - Pending Home Sales Index (previous: 99.6)\n    - Retail Inventories Ex Auto (previous: -1.6%)\n    - Seevol Cushing Storage Report (previous: 0.769M)\n    - Wholesale Inventories (previous: -1.2%)\n\n## Upcoming events for Thursday, July 30th\n\n - Expected earnings:\n\n  AAPL, ABTX, ACA, ADSW, AGCO, AGIO, AIMT, AINC, AJG, ALXN, AMSF, AMT, AMZN, ANIK, AOS, APO, APTV, ARI, ARW, ASPN, ATR, ATUS, AZN, BAND, BAX, BC, BGCP, BGS, BHR, BIO, BLDR, BPMC, BRKS, BSAC, BUD, BVN, BZH, CARR, CARS, CASA, CBTX, CBZ, CC, CCC, CFR, CG, CGEN, CI, CLF, CMCO, CMCSA, CNHI, CNOB, CNX, CNXM, COG, COHU, COLM, COOP, COP, COR, CPG, CPT, CRAI, CROX, CRS, CRY, CUBI, CUZ, CVA, CWT, CXP, DAN, DBD, DCO, DD, DECK, DLA, DLR, DLX, DNKN, DRQ, DSPG, DVA, EA, EBS, EGHT, EGO, EKSO, ELAN, ERII, ERJ, ESXB, EVLO, EXAS, EXP, EXPE, EXPO, F, FCN, FHI, FLEX, FLS, FMBH, FMS, FND, FORM, FORR, FTAI, FTS, FWRD, GHM, GIL, GILD, GLPI, GNRC, GOOG, GOOGL, GPC, GPI, GRA, GTX, HBI, HGV, HIG, HOPE, HST, HTGC, HTH, HUBB, HUBG, HURN, ICE, IDA, INFI, INT, IP, IRMD, ISDR, ITGR, JILL, K, KDP, KEX, KHC, KNSL, LAWS, LIN, LKQ, LLY, LNTH, LOCO, LPLA, LTC, LXRX, MA, MAS, MATW, MD, MDRX, MELI, MERC, MGM, MGNX, MGPI, MHK, MITK, MIXT, MMC, MMP, MN, MOH, MPW, MSA, MT, MTA, MTD, MTLS, MTX, MTZ, MWK, MX, MYE, NATI, NEM, NOC, NTCT, NTUS, NVCR, NVST, NXGN, ODFL, OFC, ONEW, OPI, ORBC, ORC, OSK, PATK, PBI, PCG, PEB, PFPT, PFS, PG, POWI, PQG, PRFT, PRO, QDEL, RDFN, RDS.A, RGEN, ROG, RP, RTRX, SAH, SEM, SGEN, SHAK, SIRI, SKYW, SNDR, SO, SOI, SPSC, SPXC, SSB, STBA, SWK, SWN, SYK, TAL, TAP, TBBK, TEAM, TEX, TFX, TIGO, TMHC, TNC, TNDM, TPX, TRP, TRS, TW, TWOU, TXT, ULH, UPS, UTL, VC, VCYT, VLO, VRAY, VRTU, VRTX, WEX, WLTW, WM, WRTC, WWE, WYND, X, XEL, XFOR, XHR, XLNX, XPO, XYL, ZEN\n\n - Ex-div:\n\n  AGNC, ALLY, AOS, ATLO, AVAL, BMRC, BRMK, BSRR, CADE, CCLP, COST, CRT, CSWI, DCP, DD, DNP, EFC, ENLC, EPD, EV, FT, GECC, GEL, GPP, GRP.U, KFFB, LNT, MCBS, MS, NI, NNN, NWN, OHI, ORC, OSBC, OVBC, PAA, PAGP, PBT, PETS, PFE, PLBC, PSEC, PSXP, SBNY, SLG, STAG, TGP, TRGP, TXN, UNM, USAC, UVE, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 17,067K, previous: 16,197K)\n    - Core PCE Prices (consensus: 1.40%, previous: 1.70%)\n    - GDP (consensus: -34.0%, previous: -5.0%)\n    - GDP Price Index (consensus: 1.2%, previous: 1.6%)\n    - GDP Sales (previous: -3.5%)\n    - Initial Jobless Claims (consensus: 1,400K, previous: 1,416K)\n    - Jobless Claims 4-Week Avg. (previous: 1,360.25K)\n    - Natural Gas Storage (consensus: 36B, previous: 37B)\n    - PCE Prices (previous: 1.3%)\n    - Real Consumer Spending (previous: -6.8%)\n\n^^^^2020-07-27",
        "created_utc": 1595844034,
        "id": "fze1qb2",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1595872834.0
    },
    {
        "author": "lmmortalMachine",
        "body": "What about data storage companies like Western Digital and Seagate? Always going to need it and more so in this digital age and furthermore.",
        "created_utc": 1594978481,
        "id": "fycedna",
        "score": 1,
        "subreddit": "investing",
        "created": 1595007281.0
    },
    {
        "author": "wambamsamalamb",
        "body": "Going to wait and see if KO, STX, RTX drop some more.\n\nETFs and such, I’m eyeing XLU, ITA, ICLN, FTEC always a good time to add a little of these.\n\nAlso looking at some acq corps but you can’t talk about them here I guess",
        "created_utc": 1594600612,
        "id": "fxvs5mm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594629412.0
    },
    {
        "author": "zomboyashik",
        "body": "STX",
        "created_utc": 1594402241,
        "id": "fxju1uf",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1594431041.0
    },
    {
        "author": "stephenphph",
        "body": "Wasnt this released months ago????\n\n&amp;#x200B;\n\n[https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749](https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749)",
        "created_utc": 1594225434,
        "id": "fxbrmss",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594254234.0
    },
    {
        "author": "ThesisRobot",
        "body": "I didn't see that on the front page, but I have access to the bloomberg terminal, so all official PR's come through my breaking news wire. And all we see is the    \n\n\n\"  \\*CCI APPROVES MERGER OF EROS INTL, STX FILMWORKS, MARCO ALLIANCE \"  that is just the government agency that approves these types of mergers from what I understand. I'd also like to add the CEO has said he will do an announcement on Friday at 11 (not sure what time zone)   \n\n\nSo I am a little confused, I was really hoping for a nice sell the news here.",
        "created_utc": 1594295896,
        "id": "fxex5ab",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594324696.0
    },
    {
        "author": "neocoff",
        "body": "Dip on STX then",
        "created_utc": 1596057646,
        "id": "fznuu6h",
        "score": 1,
        "subreddit": "options",
        "created": 1596086446.0
    },
    {
        "author": "ryit29",
        "body": "How come computer storage companies like WDC and STX are tanking? More cloud means more hard drives needed. What am I missing?",
        "created_utc": 1596113412,
        "id": "fzq2ona",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596142212.0
    },
    {
        "author": "Bobodelboy",
        "body": "STX. Getting a nice bounce back from earnings, low IV ripe for a 10 bagger 46c 7/31 .12, in the money at .90/1.00",
        "created_utc": 1596043086,
        "id": "fzn0eci",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596071886.0
    },
    {
        "author": "p0tempkin",
        "body": "STX crashing 10% AH",
        "created_utc": 1595966759,
        "id": "fzjpxnd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595995559.0
    },
    {
        "author": "wsb-narrator",
        "body": "Seagate garbage",
        "created_utc": 1595966873,
        "id": "fzjq6fu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595995673.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 28th of July\n\n\n\n## Upcoming events for Tuesday, July 28th\n\n - Stock splits:\n\n    - EMO @ **1:5**\n    - CEM @ **1:5**\n    - CTR @ **1:5**\n    - PKKFF @ **1:10**\n\n - Expected earnings:\n\n  AAT, ABG, ACCO, AFL, AGYS, AKAM, ALRS, AMAL, AMD, AMED, AMGN, APAM, APEN, ARCH, ASC, ASH, ATEN, ATRC, AUDC, AWI, AXS, B, BDGE, BE, BEN, BGFV, BPFH, BSBR, BUSE, BXP, BYD, CAC, CAR, CATC, CB, CCS, CE, CHRW, CMI, CNC, COWN, CSGP, CSLT, CSV, CVLT, CYH, DCOM, DENN, DHI, DTE, DXCM, EBAY, EBMT, ECL, EDU, EGP, EIX, ENVA, EQR, FBC, FBP, FCF, FELE, FEYE, FTV, GLW, GSS, HA, HAFC, HBCP, HIW, HLI, HOG, HP, HRZN, HUN, IBCP, IBTX, IMAX, IRDM, IVZ, JBLU, JNPR, KAI, LBC, LBRT, LH, LSCC, LW, MASI, MCD, MDC, MDLZ, MLM, MMM, MO, MPWR, MRC, MSCI, MTDR, MXIM, NBR, NCR, NEO, NWE, OKE, OMC, OMCL, OVV, OXSQ, PEGA, PFC, PFE, PII, PJT, PKG, PKI, PLT, PRGX, PRLB, PROV, QUMU, RCKY, RDHL, RNR, ROK, ROP, RRD, RTX, RVSB, RXN, SAN, SBUX, SHW, SIFY, SITC, SPGI, SPN, SQNS, SSNC, SSTK, ST, STAG, STX, SYX, TCS, TENB, THFF, THG, TPB, TRMK, TRU, TRVG, UDR, UMBF, UNM, USX, V, VBTX, WAB, WAT, WDR, WH, WNC, WNEB, WRE, XGN, XRX, YNDX, ZBRA\n\n - Ex-div:\n\n  AMRB, ATR, CFG, CLX, ENTG, GBX, WST\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 0.511%)\n    - API Weekly Crude Oil Stock (previous: 7.544M)\n    - CB Consumer Confidence (consensus: 94.5, previous: 98.1)\n    - Dallas Fed Services Revenues (previous: 5.7)\n    - Redbook (previous: -7.5%)\n    - Redbook (previous: 1.9%)\n    - Richmond Manufacturing Index (previous: -27)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -28)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 4.0%, previous: 4.0%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 0.3%, previous: 0.3%)\n    - Texas Services Sector Outlook (previous: 2.1)\n\n## Upcoming events for Wednesday, July 29th\n\n - Expected earnings:\n\n  AAN, ACGL, ADM, ADP, AEGN, AEM, AER, AGI, AHCO, AHT, AIN, AJRD, ALG, ALGT, ALIM, ALKS, ALTA, ALTM, AM, AMP, ANTM, APA, APHA, APLS, APRN, AQMS, AR, ARCB, ASGN, ATNI, AVB, AVGR, AVTR, AX, AXTA, BA, BBVA, BCO, BDC, BFST, BG, BHLB, BKCC, BKU, BLKB, BOOT, BSGM, BSMX, BSX, BTE, BTU, BXMT, CAJ, CAKE, CBD, CBL, CCI, CCJ, CDE, CERN, CF, CFFN, CFMS, CGNX, CHDN, CHE, CHEF, CHT, CKH, CLBK, CLS, CME, CMO, CMPR, CNMD, CODI, CONE, CORR, CPF, CRHM, CRTO, CS, CTO, CTSH, CVEO, CXO, DB, DIN, DORM, DRE, DRTT, DT, DX, EEFT, EGOV, ENB, EPD, EQC, EQIX, ESRT, ETN, ETR, EVBN, EXEL, EZPW, FARO, FB, FBHS, FCPT, FICO, FISI, FLOW, FSS, FTI, GAIN, GD, GE, GIB, GLDD, GM, GRFS, GRMN, GSK, GWB, HBB, HBNC, HES, HESM, HI, HOLX, HOME, HPP, HWKN, ILPT, INOV, INVA, IO, IPG, IRT, ISBC, JAKK, JCS, JHG, JMP, JRVR, KAMN, KGC, KLIC, KN, KRA, KRC, KTOS, LFUS, LIVN, LN, LRCX, LXU, LYG, MAA, MANT, MC, MCO, MEET, MEOH, MFG, MGLN, MGRC, MHH, MHO, MKSI, MLCO, MLVF, MMSI, MNRO, MOBL, MPX, MSC, MSEX, MTOR, MTSI, MUFG, MYRG, NBN, NEXA, NGVT, NLS, NLY, NMM, NMR, NOA, NOVA, NOW, NSC, NYCB, OC, OCX, ODT, OII, OIS, ONDK, ORLY, ORN, PAG, PB, PDM, PEIX, PGRE, PI, PPC, PS, PTC, PYPL, QCOM, QEP, QRVO, R, RAIL, RDWR, RDY, RES, RGCO, RIG, RJF, ROIC, ROL, RYI, SAIA, SANM, SBBP, SBH, SBPH, SC, SCCO, SCI, SFM, SGC, SHOO, SHOP, SIGI, SIMO, SITE, SIX, SKY, SLAB, SLRX, SMG, SNY, SONM, SPFI, SPG, SPOT, SRDX, SREV, SRI, STRA, SWIR, TAK, TARO, TBIO, TBPH, TCFC, TDOC, TEL, TKC, TLRD, TMDI, TPC, TPL, TRNO, TROW, TROX, TRTX, TS, TSE, TSEM, TSU, TT, TTEK, TTMI, TUP, TX, TYL, UCTT, URI, USAP, UTHR, UVE, VAC, VGZ, VICI, VKTX, VNDA, VSEC, VTVT, WERN, WHD, WING, WIRE, WLL, WPG, WRI, WSBF, WTI, WTRE, XAN, YUM, YUMC\n\n - Ex-div:\n\n  AM, BPMP, ERF, FRC, HMLP, KNOP, MSB, PVBC\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.076M)\n    - Crude Oil Inventories (consensus: -2.088M, previous: 4.892M)\n    - Cushing Crude Oil Inventories (previous: 1.375M)\n    - Distillate Fuel Production (previous: -0.097M)\n    - EIA Refinery Crude Runs  (previous: -0.103M)\n    - EIA Weekly Distillates Stocks (consensus: -0.333M, previous: 1.073M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.5%, previous: -0.2%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (consensus: -0.967M, previous: -1.802M)\n    - Gasoline Production (previous: -0.016M)\n    - Goods Trade Balance (previous: -75.26B)\n    - Heating Oil Stockpiles (previous: -0.750M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 5.1%)\n    - Pending Home Sales (consensus: 15.0%, previous: 44.3%)\n    - Pending Home Sales Index (previous: 99.6)\n    - Retail Inventories Ex Auto (previous: -1.6%)\n    - Seevol Cushing Storage Report (previous: 0.769M)\n    - Wholesale Inventories (previous: -1.2%)\n\n## Upcoming events for Thursday, July 30th\n\n - Expected earnings:\n\n  AAPL, ABTX, ACA, ADSW, AGCO, AGIO, AIMT, AINC, AJG, ALXN, AMSF, AMT, AMZN, ANIK, AOS, APO, APTV, ARI, ARW, ASPN, ATR, ATUS, AZN, BAND, BAX, BC, BEAT, BGCP, BGS, BHR, BIO, BLDR, BPMC, BRKS, BSAC, BUD, BVN, BZH, CACC, CARR, CARS, CASA, CBTX, CBZ, CC, CCC, CFR, CG, CGEN, CI, CLF, CMCO, CMCSA, CNHI, CNOB, CNX, CNXM, COG, COHU, COLM, COOP, COP, COR, CPG, CPT, CRAI, CROX, CRS, CRY, CUBI, CUZ, CVA, CWT, CXP, DAN, DBD, DCO, DD, DECK, DLA, DLR, DLX, DNKN, DRQ, DSPG, DVA, EA, EBS, EGHT, EGO, EKSO, ELAN, ERII, ERJ, ESXB, EVLO, EXAS, EXP, EXPE, EXPO, F, FCN, FHI, FLEX, FLS, FMBH, FMS, FND, FORM, FORR, FTAI, FTS, FWRD, GFF, GHM, GIL, GILD, GLPI, GNRC, GOOG, GOOGL, GPC, GPI, GRA, GRUB, GSHD, GTX, HBI, HGV, HIG, HOPE, HST, HTGC, HTH, HUBB, HUBG, HURN, ICE, IDA, INFI, INT, IP, IRMD, ISDR, ITGR, JILL, K, KDP, KEX, KHC, KL, KNSL, KRNY, LADR, LAWS, LIN, LKQ, LLY, LNTH, LOCO, LPLA, LXRX, MA, MAS, MATW, MD, MDRX, MELI, MERC, MGM, MGNX, MGPI, MHK, MITK, MIXT, MMC, MMP, MN, MOH, MPW, MSA, MT, MTA, MTD, MTLS, MTX, MTZ, MWK, MX, MYE, NATI, NEM, NOC, NTCT, NTUS, NVCR, NVST, NXGN, ODFL, OFC, ONEW, OPI, ORBC, ORC, OSK, PATK, PBI, PCG, PEB, PFPT, PFS, PG, POWI, PQG, PRFT, PRO, QDEL, RARE, RDFN, RDS.A, RGEN, RLGY, ROG, RP, RTRX, RWT, SAH, SAND, SEM, SGEN, SHAK, SIRI, SKYW, SNDR, SO, SOI, SPSC, SPXC, SSB, STBA, SWK, SWN, SYK, TAL, TAP, TBBK, TEAM, TEX, TFX, TIGO, TMHC, TNC, TNDM, TPX, TRP, TRS, TW, TWOU, TXT, ULH, UPS, UTL, VC, VCYT, VLO, VRAY, VRTU, VRTX, WEX, WLTW, WM, WRLD, WRTC, WWE, WYND, X, XEL, XFOR, XHR, XLNX, XPO, XYL, ZEN\n\n - Ex-div:\n\n  AGNC, ALLY, AOS, ATLO, AVAL, BMRC, BRMK, BSRR, CADE, CCLP, COST, CRT, CSWI, DCP, DD, DNP, EFC, ENLC, EPD, EV, FT, GECC, GEL, GPP, GRP.U, KFFB, LNT, MCBS, MS, NI, NNN, NWN, OHI, ORC, OSBC, OVBC, PAA, PAGP, PBT, PETS, PFE, PLBC, PSEC, PSXP, SBNY, SLG, STAG, TGP, TRGP, TXN, UNM, USAC, UVE, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 16,200K, previous: 16,197K)\n    - Core PCE Prices (consensus: 1.00%, previous: 1.70%)\n    - GDP (consensus: -34.1%, previous: -5.0%)\n    - GDP Price Index (consensus: 1.1%, previous: 1.6%)\n    - GDP Sales (previous: -3.5%)\n    - Initial Jobless Claims (consensus: 1,450K, previous: 1,416K)\n    - Jobless Claims 4-Week Avg. (previous: 1,360.25K)\n    - Natural Gas Storage (consensus: 36B, previous: 37B)\n    - PCE Prices (previous: 1.3%)\n    - Real Consumer Spending (previous: -6.8%)\n\n## Upcoming events for Friday, July 31st\n\n - Stock splits:\n\n    - TLSA @ **5:2** (Payable date: 07/30/2020)\n\n - Expected earnings:\n\n  ABBV, AON, AROC, ASIX, ASX, ATRO, AXL, BAH, BCBP, BCPC, BERY, CAT, CBOE, CBRE, CHD, CHTR, CL, CPLP, CTS, CVX, D, ES, FCAU, GLYC, GT, HRC, IMGN, IMO, ITT, ITW, JCI, LAZ, LHX, LTC, LYB, MGI, MRK, NVT, NWL, OFS, OIIM, OXLC, PBF, PBFX, PEG, PINS, PIPR, PNM, POR, PSX, PSXP, SCM, SHLX, SLCA, SNA, SPB, SRC, TAC, TU, UAA, UBX, VFC, WETF, WPC, WY, XOM\n\n - Ex-div:\n\n  AB, AES, AON, ASRV, BMTC, BX, C, CASY, CNBKA, DGICA, DGICB, DMLP, FCCO, HAS, HEP, HFBL, KMI, LBAI, LCUT, MATW, MCI, NRG, NSEC, NVEC, O, OCFC, OKE, ORRF, OVLY, PAYX, PBCT, PEBO, PNW, RELX, STL, SXT, SYF, TCP, WABC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 125.0K)\n    - CFTC Copper speculative net positions (previous: 38.6K)\n    - CFTC Corn speculative net positions (previous: -98.9K)\n    - CFTC Crude Oil speculative net positions (previous: 548.9K)\n    - CFTC Gold speculative net positions (previous: 266.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 15.7K)\n    - CFTC Natural Gas speculative net positions (previous: -22.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -43.0K)\n    - CFTC Silver speculative net positions (previous: 46.8K)\n    - CFTC Soybeans speculative net positions (previous: 121.5K)\n    - CFTC Wheat speculative net positions (previous: 18.8K)\n    - Chicago PMI (consensus: 43.9, previous: 36.6)\n    - Core PCE Price Index (consensus: 0.2%, previous: 0.1%)\n    - Core PCE Price Index (consensus: 1.0%, previous: 1.0%)\n    - Dallas Fed PCE (previous: 1.50%)\n    - Employment Benefits (previous: 0.40%)\n    - Employment Cost Index (consensus: 0.6%, previous: 0.8%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (consensus: 2.70%, previous: 2.50%)\n    - Michigan Consumer Expectations (consensus: 66.2, previous: 72.3)\n    - Michigan Consumer Sentiment (consensus: 73.0, previous: 73.2)\n    - Michigan Current Conditions (consensus: 84.2, previous: 87.1)\n    - Michigan Inflation Expectations (consensus: 3.1%, previous: 3.0%)\n    - PCE Price index (previous: 0.5)\n    - PCE price index (previous: 0.1%)\n    - Personal Income (consensus: -0.5%, previous: -4.2%)\n    - Personal Spending (consensus: 5.5%, previous: 8.2%)\n    - Real Personal Consumption (previous: 8.1%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 181)\n    - U.S. Baker Hughes Total Rig Count (previous: 251)\n\n^^^^2020-07-28",
        "created_utc": 1595930416,
        "id": "fzhy8hz",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1595959216.0
    },
    {
        "author": "RichardCabeza",
        "body": "\n\n\nYep they installed back doors on huawei, which is actually one if the reasons they pulled out of the US in 2014.\n\nAccording to the report, the NSA has planted backdoors to access computers, hard drives, routers, and other devices from companies such as Cisco, Dell, Western Digital, Seagate, Maxtor, Samsung, and Huawei.\n\nhttps://www.spiegel.de/international/world/catalog-reveals-nsa-has-back-doors-for-numerous-devices-a-940994.html",
        "created_utc": 1594395033,
        "id": "fxjf83g",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594423833.0
    },
    {
        "author": "RichardCabeza",
        "body": "So your point is spying on your own people isnbad but nothing compared to a country using its supply chain to spy on the world right?\n\nYou do know that we spied on our allies including tapping Merkel's phone right?\n\nHeres a quote from Spiegel on the snowden report\n\nNSA has planted backdoors to access computers, hard drives, routers, and other devices from companies such as Cisco, Dell, Western Digital, Seagate, Maxtor, Samsung, and Huawei.\n\nhttps://www.spiegel.de/international/world/catalog-reveals-nsa-has-back-doors-for-numerous-devices-a-940994.html\n\nDo you not know about this and snowden?  Like seriously?\n\nAnd idk how you can make the comment theres no longer back doors.  Its like oh weve only done it 3 or 4 times but for reals weve stopped now.",
        "created_utc": 1594394961,
        "id": "fxjf32q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594423761.0
    },
    {
        "author": "KnightAnthony",
        "body": "Lol, there's a funny and profitable story regarding this company. I had very little idea about this one until I began looking into streaming choices due to COVID stay-at-home orders! I'm a cable cord cutter, but family wanted entertainment. So I compared mainly Netflix with Amazon, but research led me to study Roku.....and only for the remote control ability! I had a great experience with Seagate, and this Roku was giving me a similar vibe. So I took a gamble and bought 150 shares in one of my \"forget-it-about\" brokerage accounts. $10K is usually my starting investment, and I got it around $72 back in March. Again....TOTAL speculation and totally forgot I owned it! And if it weren't for some chatter about it yesterday, I would never had known how much it had appreciated. Lol, my PT was only $100, but when I saw that it was $150, I sold it all! Doubled my money in just a few months on something I wasn't expecting much. Might get back into it, but ROKU is not something I \"love\" so will have to think about it.",
        "created_utc": 1594903175,
        "id": "fy8wkou",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594931975.0
    },
    {
        "author": "TheSuper_Namek",
        "body": "Eros will be probably announce ER after Netflix dropped theirs, eros is like the bollywood Netflix with their Eros now platform and eh they just got  approval from indian goverment to merge with STX entertainment  that is a Hollywood filmmaker they are going international after the merger  and they are dirt cheap right now.. company has potential but management doesn't seem to care about the shareholders",
        "created_utc": 1594869794,
        "id": "fy7tnlk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594898594.0
    },
    {
        "author": "minawarr",
        "body": "I grew up on bollywood movies and we are a bollywood household I will say. Eros has dwindled out of being one of the large production houses in India. The last hit movie it produced was in 2015 (bajirao mastani). I cant even recall any new bollywood music they have produced. \n\nI enjoyed watching the Eros entertainment banner when I was younger, but the scene is alot more competitive than it used to be in India in the 80s and 90s. All the top actors have launched their own production houses and tseries basically rules the music rights. \n\nI'm not sure how the STX merger will pan out. STX is more of a indie based company and  Indians enjoy over the top extravagant movies. Most indie productions don't bring in the box office numbers.",
        "created_utc": 1594273739,
        "id": "fxe9g3t",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594302539.0
    },
    {
        "author": "stephenphph",
        "body": "I saw this from April.....\n\n[https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749](https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749)",
        "created_utc": 1594225459,
        "id": "fxbroq4",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594254259.0
    },
    {
        "author": "SirPounces",
        "body": "STX calls",
        "created_utc": 1595445041,
        "id": "fywhg1r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595473841.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "Because WDC is dogshit. Long STX all the way",
        "created_utc": 1595817464,
        "id": "fzd67xw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595846264.0
    },
    {
        "author": "ChiefGriffey",
        "body": "Buy STX on this dip?",
        "created_utc": 1596038581,
        "id": "fzmrn4o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596067381.0
    },
    {
        "author": "wild__illusion",
        "body": "What's going on with STX??",
        "created_utc": 1595966573,
        "id": "fzjpjp9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595995373.0
    },
    {
        "author": "stephenphph",
        "body": "i personally think they are waiting till friday for the PR. i read somewhere that Friday they are doing a live interview about their merger and future associations with apple, youtube, &amp; microsoft.  this stock is massively undervalued. people have been saying $12 PT since talks of a merger last year. there were 2m dark pool buys today. honestly the movies their merger STX has come out with are pretty damn good and if thats the direction of bollywood. this is a good long term hold. sure make some quick profits but def keep some in for long term. i might buy more in the PM tomorrow.",
        "created_utc": 1594263778,
        "id": "fxduzcn",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594292578.0
    },
    {
        "author": "j33tAy",
        "body": "yup exactly. my covered calls are XLK, XLF, AMD, STX, SRNE and EEM. \n\nIV is high enough that I can make a solid 1% a week selling weekly calls when the stock goes sideways.\n\nlet me know what kinda house you get in 2 years!",
        "created_utc": 1594248465,
        "id": "fxd42g7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594277265.0
    },
    {
        "author": "The_Big_Willy",
        "body": "I have WDC in my Roth IRA. Since you hold STX, let me ask you, does the fact that they’re not diversifying into NAND technology concern you? That’s the only reason I picked up WDC over STX.",
        "created_utc": 1594819262,
        "id": "fy53ms9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594848062.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "They diversified into NAND tech back in 2017. They were severely undervalued compared to WDC at the time, as investors were sleeping on that fact. Personally, I even own a Seagate NVMe SSD.",
        "created_utc": 1594819548,
        "id": "fy543sw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594848348.0
    },
    {
        "author": "Adelphia_",
        "body": "$STX 8/20 50C Earnings Play",
        "created_utc": 1594827589,
        "id": "fy5ja0x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594856389.0
    },
    {
        "author": "Various_Art",
        "body": "These are my predictions do something near it. \nBuy CRESY @ $3.61. An agricultural stock from some South American Country (Argentina). Agriculture is automated and if they are about to be hungry I would prefer you donate the gains to South America.\nThis would be 27.7K shares. If it gains 125% in the next 6 months due to famine you can do well. Also if it reaches $12.5 you can make $346,250. You should obviously diversify.\nTWLO ~$313  Dec. 21, 2020.\n\nBEEEG YOLO RISK\n\nAnytime you write a contract called an option you have unlimited risk. DO NOT WRITE A CONTRACT. \n\nYou will be purchasing a contract. You want something that is out of the money going into the money meaning, it won't look like it is about to make money before the strike date.\n\nCurrently I would suggest a CALL option. I will leave some predictions below for most likely to succeed. You need to buy a few things to get \n\nMMM ~$179 Oct. 30, 2020\nSPY ~$336 Nov. 13, 2020\nCOST ~$340 Oct 16, 2020\n\n\nBEEG Mooon Strat\n\nSTX Call Option ~$60 Nov. 13, 2020\nCACC Call Option ~$555 Aug. 21, 2020\nFOX Call Option ~$35 Jan. 1, 2021\nBBBY Call Option ~$25 Nov. 25, 2020\n\n\nSafe Bet \n\nTL;DR - I suggest a straight purchase of shares.  \nSuch as: JPM @ 99.73 7/15. Hold for 25% gain, unfortunately leaves you at $125,000. \n\nWhatever you do pick something with positive net income for at least 3 years. Has a minimum of 5 M volume or similar Blue chip qualities.",
        "created_utc": 1594864522,
        "id": "fy7ks9d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594893322.0
    },
    {
        "author": "Sailo21",
        "body": "STX-EROS MERGER CLOSES. \n\nhttps://www.hollywoodreporter.com/news/stx-eros-merger-closes-creating-global-content-streaming-player-1300854",
        "created_utc": 1596117859,
        "id": "fzqa2xg",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1596146659.0
    },
    {
        "author": "SamuraiHelmet",
        "body": "Spitballing here, but STX and WDC were and probably still are dominated by sales of magnetic storage, which is on its way out. They've pivoted slowly into solid state storage, but they're not the technological leaders, and they lack the state backing of some of the big Korean storage companies.",
        "created_utc": 1595978769,
        "id": "fzkdnx4",
        "score": 1,
        "subreddit": "investing",
        "created": 1596007569.0
    },
    {
        "author": "TAWS",
        "body": "Seagate vs. WDC. Which is the better company?",
        "created_utc": 1596030305,
        "id": "fzmcgul",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596059105.0
    },
    {
        "author": "james00543",
        "body": "sure, how much of those are equipped with seagate drives? I think consumer laptop/desktop uses samsung/micron. \n\nsource: in the storage industry.",
        "created_utc": 1596031140,
        "id": "fzmdwiy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596059940.0
    },
    {
        "author": "wild__illusion",
        "body": "What are your thoughts on STX earnings? Hold?",
        "created_utc": 1595964438,
        "id": "fzjl2iu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595993238.0
    },
    {
        "author": "wild__illusion",
        "body": "STX down almost 10% AH.",
        "created_utc": 1595966645,
        "id": "fzjpp2s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595995445.0
    },
    {
        "author": "Ernest_EA",
        "body": "What happened to STX seagate?",
        "created_utc": 1596034752,
        "id": "fzmkiys",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596063552.0
    },
    {
        "author": "public_instigator",
        "body": "AMD, STX, ADBE, AAPL, DIS",
        "created_utc": 1594877426,
        "id": "fy84kui",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594906226.0
    },
    {
        "author": "Dingaling015",
        "body": "Just a few I've come across so far:\n\nDLPN - public offering ends tomorrow, ER expected by end of next week or sooner, already getting pumped by Yates though so caution here.\n\nEROS - Rumored merger announcement with STX, recently been approved so we're all just waiting for a PR. It's already run up quite though (again thanks to Yates lol) so who knows.\n\nThere's also CHFS which has been well enough talked about here but I did not buy so do your own DD. There are also several other COVID plays that people have been talking about but hardly any volume to merit a second look.\n\nBut yeah this week's been meh.",
        "created_utc": 1594243569,
        "id": "fxcu7ou",
        "score": 7,
        "subreddit": "pennystocks",
        "created": 1594272369.0
    },
    {
        "author": "VeggieVendor",
        "body": "Started investing about 3 weeks ago. Made some mistakes but I think my portfolio right now is decent. Any feedback is much appreciated.\n\nABBV - 4 @ 96.73 (99.28)\n\nSPCE - 5 @ 16.07 (16.79)\n\nSTX - 5 @ 50.32 (46.56)\n\nTSLA - 0.1488 @ 1343.25 (1365.88)\n\nNFLX - 1.43131 @ 457.62 (502.78)\n\nFB - 2 @ 212.20 (243.58)\n\nAAPL - 1.32175 @ 359.56 (381.37)\n\nMSFT - 2.51192 @199.49 (212.83)\n\nMCD - 2 @ 186.21 (185.83)\n\nQQQ - 1 @ 255.93 (259.99)\n\nVYM - 3 @ 79.87 (78.90)\n\nI want to slowly increase my holdings in MSFT and NFLX long term, as well as in QQQ.",
        "created_utc": 1594260978,
        "id": "fxdq9u7",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594289778.0
    },
    {
        "author": "Rossoneri",
        "body": "&gt;  this sub has really rejected the potential of this stock for no reason\n\nThe reason is that it's got 40M in market cap.  It's a tiny company that does a tiny amount of business.  Your list of \"partners\" paints an overly optimistic picture when it's really more of a list of \"people who buy their products and people who sell products to them\".  The build some specialty computing, nothing really groundbreaking here. \n\nAlso \"Puma\" is one of their brands, it's not their partner.  They might be an interesting company, but the shilling and misleading posts indicate that they are closer to being pump &amp; dump than real quality.\n\n-----------------------------------------------\n\n**For comparison:**\n\n**broadberry.com** Partners: toshiba, seagate, intel, amd, windows, nvidia\n\n**dihuni.com** Partners: lockheed, duke, intel, johns hopkins, NASA, US Navy, FDA, UCIrvine, UCSF\n\n**abmx.com** Partners: microsoft, redhat, western digital, intel, supermicro, vmware, ubuntu\n\nIf anybody claims a company has a \"partnership\" without showing the contract details.  Ignore them.",
        "created_utc": 1594701368,
        "id": "fy08a0s",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1594730168.0
    },
    {
        "author": "andrewchapman17",
        "body": "greenland staring gerald butler by stx entertainment in theaters august 16th, official trailer on youtube has over 7 million views",
        "created_utc": 1594263549,
        "id": "fxdulww",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594292349.0
    },
    {
        "author": "wambamsamalamb",
        "body": "Going to wait and see if KO, STX, RTX drop some more.\n\nETFs and such, I’m eyeing XLU, ITA, ICLN, FTEC always a good time to add a little of these.\n\nAlso looking at some acq corps but you can’t talk about them here I guess",
        "created_utc": 1594600612,
        "id": "fxvs5mm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594629412.0
    },
    {
        "author": "zomboyashik",
        "body": "STX",
        "created_utc": 1594402241,
        "id": "fxju1uf",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1594431041.0
    },
    {
        "author": "stephenphph",
        "body": "Wasnt this released months ago????\n\n&amp;#x200B;\n\n[https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749](https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749)",
        "created_utc": 1594225434,
        "id": "fxbrmss",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594254234.0
    },
    {
        "author": "ThesisRobot",
        "body": "I didn't see that on the front page, but I have access to the bloomberg terminal, so all official PR's come through my breaking news wire. And all we see is the    \n\n\n\"  \\*CCI APPROVES MERGER OF EROS INTL, STX FILMWORKS, MARCO ALLIANCE \"  that is just the government agency that approves these types of mergers from what I understand. I'd also like to add the CEO has said he will do an announcement on Friday at 11 (not sure what time zone)   \n\n\nSo I am a little confused, I was really hoping for a nice sell the news here.",
        "created_utc": 1594295896,
        "id": "fxex5ab",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594324696.0
    },
    {
        "author": "RichardCabeza",
        "body": "\n\n\nYep they installed back doors on huawei, which is actually one if the reasons they pulled out of the US in 2014.\n\nAccording to the report, the NSA has planted backdoors to access computers, hard drives, routers, and other devices from companies such as Cisco, Dell, Western Digital, Seagate, Maxtor, Samsung, and Huawei.\n\nhttps://www.spiegel.de/international/world/catalog-reveals-nsa-has-back-doors-for-numerous-devices-a-940994.html",
        "created_utc": 1594395033,
        "id": "fxjf83g",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594423833.0
    },
    {
        "author": "RichardCabeza",
        "body": "So your point is spying on your own people isnbad but nothing compared to a country using its supply chain to spy on the world right?\n\nYou do know that we spied on our allies including tapping Merkel's phone right?\n\nHeres a quote from Spiegel on the snowden report\n\nNSA has planted backdoors to access computers, hard drives, routers, and other devices from companies such as Cisco, Dell, Western Digital, Seagate, Maxtor, Samsung, and Huawei.\n\nhttps://www.spiegel.de/international/world/catalog-reveals-nsa-has-back-doors-for-numerous-devices-a-940994.html\n\nDo you not know about this and snowden?  Like seriously?\n\nAnd idk how you can make the comment theres no longer back doors.  Its like oh weve only done it 3 or 4 times but for reals weve stopped now.",
        "created_utc": 1594394961,
        "id": "fxjf32q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594423761.0
    },
    {
        "author": "TheSuper_Namek",
        "body": "Eros will be probably announce ER after Netflix dropped theirs, eros is like the bollywood Netflix with their Eros now platform and eh they just got  approval from indian goverment to merge with STX entertainment  that is a Hollywood filmmaker they are going international after the merger  and they are dirt cheap right now.. company has potential but management doesn't seem to care about the shareholders",
        "created_utc": 1594869794,
        "id": "fy7tnlk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594898594.0
    },
    {
        "author": "minawarr",
        "body": "I grew up on bollywood movies and we are a bollywood household I will say. Eros has dwindled out of being one of the large production houses in India. The last hit movie it produced was in 2015 (bajirao mastani). I cant even recall any new bollywood music they have produced. \n\nI enjoyed watching the Eros entertainment banner when I was younger, but the scene is alot more competitive than it used to be in India in the 80s and 90s. All the top actors have launched their own production houses and tseries basically rules the music rights. \n\nI'm not sure how the STX merger will pan out. STX is more of a indie based company and  Indians enjoy over the top extravagant movies. Most indie productions don't bring in the box office numbers.",
        "created_utc": 1594273739,
        "id": "fxe9g3t",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594302539.0
    },
    {
        "author": "stephenphph",
        "body": "I saw this from April.....\n\n[https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749](https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749)",
        "created_utc": 1594225459,
        "id": "fxbroq4",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594254259.0
    },
    {
        "author": "stephenphph",
        "body": "i personally think they are waiting till friday for the PR. i read somewhere that Friday they are doing a live interview about their merger and future associations with apple, youtube, &amp; microsoft.  this stock is massively undervalued. people have been saying $12 PT since talks of a merger last year. there were 2m dark pool buys today. honestly the movies their merger STX has come out with are pretty damn good and if thats the direction of bollywood. this is a good long term hold. sure make some quick profits but def keep some in for long term. i might buy more in the PM tomorrow.",
        "created_utc": 1594263778,
        "id": "fxduzcn",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594292578.0
    },
    {
        "author": "j33tAy",
        "body": "yup exactly. my covered calls are XLK, XLF, AMD, STX, SRNE and EEM. \n\nIV is high enough that I can make a solid 1% a week selling weekly calls when the stock goes sideways.\n\nlet me know what kinda house you get in 2 years!",
        "created_utc": 1594248465,
        "id": "fxd42g7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594277265.0
    },
    {
        "author": "The_Big_Willy",
        "body": "I have WDC in my Roth IRA. Since you hold STX, let me ask you, does the fact that they’re not diversifying into NAND technology concern you? That’s the only reason I picked up WDC over STX.",
        "created_utc": 1594819262,
        "id": "fy53ms9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594848062.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "They diversified into NAND tech back in 2017. They were severely undervalued compared to WDC at the time, as investors were sleeping on that fact. Personally, I even own a Seagate NVMe SSD.",
        "created_utc": 1594819548,
        "id": "fy543sw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594848348.0
    },
    {
        "author": "Adelphia_",
        "body": "$STX 8/20 50C Earnings Play",
        "created_utc": 1594827589,
        "id": "fy5ja0x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594856389.0
    },
    {
        "author": "Various_Art",
        "body": "These are my predictions do something near it. \nBuy CRESY @ $3.61. An agricultural stock from some South American Country (Argentina). Agriculture is automated and if they are about to be hungry I would prefer you donate the gains to South America.\nThis would be 27.7K shares. If it gains 125% in the next 6 months due to famine you can do well. Also if it reaches $12.5 you can make $346,250. You should obviously diversify.\nTWLO ~$313  Dec. 21, 2020.\n\nBEEEG YOLO RISK\n\nAnytime you write a contract called an option you have unlimited risk. DO NOT WRITE A CONTRACT. \n\nYou will be purchasing a contract. You want something that is out of the money going into the money meaning, it won't look like it is about to make money before the strike date.\n\nCurrently I would suggest a CALL option. I will leave some predictions below for most likely to succeed. You need to buy a few things to get \n\nMMM ~$179 Oct. 30, 2020\nSPY ~$336 Nov. 13, 2020\nCOST ~$340 Oct 16, 2020\n\n\nBEEG Mooon Strat\n\nSTX Call Option ~$60 Nov. 13, 2020\nCACC Call Option ~$555 Aug. 21, 2020\nFOX Call Option ~$35 Jan. 1, 2021\nBBBY Call Option ~$25 Nov. 25, 2020\n\n\nSafe Bet \n\nTL;DR - I suggest a straight purchase of shares.  \nSuch as: JPM @ 99.73 7/15. Hold for 25% gain, unfortunately leaves you at $125,000. \n\nWhatever you do pick something with positive net income for at least 3 years. Has a minimum of 5 M volume or similar Blue chip qualities.",
        "created_utc": 1594864522,
        "id": "fy7ks9d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594893322.0
    }
]