[
    {
        "author": "thicc_dads_club",
        "body": "Companies with a market cap &gt; 180B, by P/E (excluding BRK, obv):\n\n&amp;#x200B;\n\n|Symbol|Market cap|P/E|\n|:-|:-|:-|\n|INTC|186|8.95|\n|BAC|232|13.34|\n|VZ|248|13.62|\n|TM|199|15.02|\n|JPM|349|15.08|\n|MRK|204|17.76|\n|T|202|18.63|\n|UNH|318|19.36|\n|WMT|426|21.97|\n|CMCSA|225|22.15|\n|JNJ|385|23.12|\n|HD|290|23.42|\n|PFE|204|23.44|\n|PG|345|26.68|\n|KO|226|27.55|\n|NVS|193|28.04|\n|PEP|198|28.39|\n|TSM|494|30.52|\n|FB|768|31.08|\n|MSFT|1591|34.27|\n|GOOGL|1175|35.12|\n|GOOG|1178|35.22|\n|AAPL|1995|36.32|\n|BABA|733|37.64|\n|V|435|43.59|\n|MA|322|50.11|\n|ADBE|222|58.76|\n|ABT|197|58.85|\n|DIS|251|69.84|\n|PYPL|226|72.09|\n|NFLX|216|78.3|\n|NKE|209|78.69|\n|NVDA|324|87.87|\n|AMZN|1555|91.28|\n|CRM|235|103.68|\n|TSLA|464|997.74|\n\nYou can rule out companies that BRK already holds: AAPL, AMZN, BAC, KO, JNJ, JPM, MA, MRK, PFE, PG, and V. That leaves:\n\n&amp;#x200B;\n\n|Symbol|Market cap|P/E|\n|:-|:-|:-|\n|INTC|186|8.95|\n|VZ|248|13.62|\n|TM|199|15.02|\n|T|202|18.63|\n|UNH|318|19.36|\n|WMT|426|21.97|\n|CMCSA|225|22.15|\n|HD|290|23.42|\n|NVS|193|28.04|\n|PEP|198|28.39|\n|TSM|494|30.52|\n|FB|768|31.08|\n|MSFT|1591|34.27|\n|GOOGL|1175|35.12|\n|GOOG|1178|35.22|\n|BABA|733|37.64|\n|ADBE|222|58.76|\n|ABT|197|58.85|\n|DIS|251|69.84|\n|PYPL|226|72.09|\n|NFLX|216|78.3|\n|NKE|209|78.69|\n|NVDA|324|87.87|\n|CRM|235|103.68|\n|TSLA|464|997.74|\n\nIMO you can also rule out INTC (risky), telecom (not a common target for Buffet), and anything with a P/E over 50. That leaves:\n\n&amp;#x200B;\n\n|Symbol|Market cap|P/E|\n|:-|:-|:-|\n|TM|199|15.02|\n|UNH|318|19.36|\n|WMT|426|21.97|\n|HD|290|23.42|\n|NVS|193|28.04|\n|PEP|198|28.39|\n|TSM|494|30.52|\n|FB|768|31.08|\n|MSFT|1591|34.27|\n|GOOGL|1175|35.12|\n|GOOG|1178|35.22|\n|BABA|733|37.64|\n\nI think that Toyota is an interesting option. Low P/E, decent dividend, and still to announce an all-electric car.",
        "created_utc": 1606141255,
        "id": "gdbz319",
        "score": 77,
        "subreddit": "investing",
        "created": 1606170055.0
    },
    {
        "author": "Jsizzle19",
        "body": "There’s only like 20 companies it could be, so the best guesses are as follows:\n\nPfizer, PayPal, Bank of America, Salesforce, Disney, Adobe or maybe Home Depot but I think their valuation has too high based on timing, to fit the $223B valuation.",
        "created_utc": 1606134085,
        "id": "gdbpe3c",
        "score": 27,
        "subreddit": "investing",
        "created": 1606162885.0
    },
    {
        "author": "roastedbagel",
        "body": "It's such a double standard tho... Msft and crm have contracts with the government too but nobody cares...\n\nPLTR is gonna be huge simply cause their technology is severely needed by regular companies now that said companies have tons of data from their crm systems and no idea what to do with it, PLTR helps consolidate that data and does it very well.",
        "created_utc": 1605681330,
        "id": "gcp2k2d",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1605710130.0
    },
    {
        "author": "tinyraccoon",
        "body": "Yeah, we saw that earlier this year too when CRM, HON, and AMGN were added to the DJIA.",
        "created_utc": 1605568007,
        "id": "gcju6cy",
        "score": 15,
        "subreddit": "stocks",
        "created": 1605596807.0
    },
    {
        "author": "Awesome____Sauce",
        "body": "If there's a civil war I'm going to seize the salesforce tower.",
        "created_utc": 1604476380,
        "id": "gb3h68r",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1604505180.0
    },
    {
        "author": "dsarif70",
        "body": "\\&gt; I’d never see any org use the platform over Tableau and Salesforce\n\nPalantir is not a CRM.",
        "created_utc": 1605773989,
        "id": "gct852y",
        "score": 11,
        "subreddit": "investing",
        "created": 1605802789.0
    },
    {
        "author": "TheDraftDaddy",
        "body": "Been long on WORK for 4-5 months, this was a more of an earnings runup play for me, got lucky with the acquisition news timing.  Knew a merger was possible, but CRM surprised me, thought it would be Atlassian or MSFT",
        "created_utc": 1606350200,
        "id": "gdlxnpc",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1606379000.0
    },
    {
        "author": "internetnewuser",
        "body": "   \n**Salesforce has held talks to buy Slack Technologies--WSJ**",
        "created_utc": 1606322817,
        "id": "gdkgix6",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1606351617.0
    },
    {
        "author": "keenanodonnell1",
        "body": "Buy Walmart at open tommorow\n1. Walmart recently revealed their new service “Walmart plus” which is like Amazon prime except with same day delivery instead of 2 day delivery. This is something east for Walmart to implement since they have stores around the nation that can deliver products to customers from the store to your home in the same day. It is impossible for companies like Amazon to do this because of their lack of physical stores.\n\n2. Since Walmart has a strong online store and will sell tons and tons of stuff online and in store around the Christmas season, it is a very low risk stock. The recent PS5 and Xbox Series having a lot of stock on Walmarts web store lately has gained them a lot of sales and led to a lot of new exposure to their online store driving up Salesforce other products. \n\n3. For all you speculative trader out there: A huge investing firm BlackRock recently bought $8,000,000 in Walmart Call Options. That is a massive amount of options especially for a firm that usually buys stocks not options. If you don’t trust advice let $8mil speak for me.\n\n4.Walmart is a huge part of the retail store market which goes up with vaccine news. This means that if they’re is new news about a vaccine Walmart will go up. \n\n5. Walmart is currently in a good position to buy, it is up a small amount over the past month, week, and day it never goes red for very long. The stock is resistant to the volatility of the rest of the market and people are starting to notice that and put their money in\n\n6. Below is a video that goes in depth into why we need to buy Walmart\n\n[Video Outlining Walmart Buy](https://youtu.be/SMnO-rw-0UM)",
        "created_utc": 1606771897,
        "id": "ge6uqzd",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1606800697.0
    },
    {
        "author": "0xhodlr",
        "body": "$ASAN calls for 3 reasons:  \nRecently went public through direct listing, just like PLTR. I think this means they're underpriced, you get ability to buy in alongside institutionals  \n$CRM buying $WORK, good for entire SAAS productivity space  \nIf you google ASAN, the first thing that comes up is \"[Autistic Self Advocacy Network](https://autisticadvocacy.org/about-asan/)\". If that's not a stock for WSB, I don't know what is.",
        "created_utc": 1606589572,
        "id": "gdwmz5o",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1606618372.0
    },
    {
        "author": "tylerono",
        "body": "Tesla, Amazon, NIO, RUN/VSLR, index funds, some ETFs (TAN, QCLN, ICLN), SQ, CRM, various solar stocks, etc.",
        "created_utc": 1604725148,
        "id": "gbfc5a4",
        "score": 7,
        "subreddit": "RobinHood",
        "created": 1604753948.0
    },
    {
        "author": "gherna67",
        "body": " \n\n# Repost: Salesforce Deal to Buy Slack Expected to Be Announced Tuesday After Market Close\n\n📷\n\n* Salesforce's deal to buy Slack is expected to be announced Tuesday after markets close, sources told CNBC's David Faber.\n* The deal is expected to be about half cash and half stock, the sources said, and will price Slack at a premium.\n* Salesforce is set to report quarterly earnings on Tuesday.\n\n[https://www.nbcnewyork.com/news/business/money-report/salesforce-deal-to-buy-slack-expected-to-be-announced-tomorrow-after-market-close/2751515/](https://www.nbcnewyork.com/news/business/money-report/salesforce-deal-to-buy-slack-expected-to-be-announced-tomorrow-after-market-close/2751515/)\n\n&amp;#x200B;\n\nI'm jacked to the tits in CRM bull spreads with no hedge",
        "created_utc": 1606763796,
        "id": "ge6dkgr",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1606792596.0
    },
    {
        "author": "totally_not_a_bot_ok",
        "body": "I have GDX calls ATM looking for a bounce. The biggest contributors to my recovery were   \nTSLA BABA MU MPC and CRM",
        "created_utc": 1606254312,
        "id": "gdhkuwc",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1606283112.0
    },
    {
        "author": "Halizones",
        "body": "Buy the CRM dip, they’ve got earnings next week",
        "created_utc": 1606325026,
        "id": "gdkl3av",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1606353826.0
    },
    {
        "author": "Lyfelife",
        "body": "I’m going into some $CRM prior to the earnings call",
        "created_utc": 1606689183,
        "id": "ge37qi5",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1606717983.0
    },
    {
        "author": "supfresh64",
        "body": "CRM down almost 6% on this news, guess slack purchase sucks for their balance sheet",
        "created_utc": 1606335722,
        "id": "gdl6t1x",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1606364522.0
    },
    {
        "author": "Butt-Pirate-Yarrr",
        "body": "Lol good job! You lucked out with the salesforce acquiring slack announcement. Don’t be so quick to throw this money away. Step back and be careful. You hit a lotto ticket, don’t fuck it up.",
        "created_utc": 1606351317,
        "id": "gdlzkim",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1606380117.0
    },
    {
        "author": "AnonymousAstro",
        "body": "Ended the day +$400 on some CRM and ZM spreads. It ain’t much but it’s honest work",
        "created_utc": 1606777611,
        "id": "ge77ft7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1606806411.0
    },
    {
        "author": "LUV2FUKMARRIEDMILFS",
        "body": "CRM$ sales force babe \n\nEarnings \n\nCALLS OR PUTS !!!",
        "created_utc": 1606692085,
        "id": "ge3d9s2",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1606720885.0
    },
    {
        "author": "in_a_rush_for_a_rush",
        "body": "up 69% today on CRM 260 calls. \n\nNice",
        "created_utc": 1606770498,
        "id": "ge6ruj9",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1606799298.0
    },
    {
        "author": "nosalute",
        "body": "# CRM bringing the entire DOW down\n\n# PLTR MOONING LIKE A MOFO",
        "created_utc": 1606322585,
        "id": "gdkg1lf",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1606351385.0
    },
    {
        "author": "Significant_Ad_4651",
        "body": "There’s tons of competition this is an emerging space I would say where what this category of software is not fully defined and tons of people are converging in the same space from different directions.\n\nThe Problem?  In large businesses you have tons of data from different systems and lots of inefficiencies.  It is very hard to have a single source of truth and front line workers attempt to game most systems that measure them.\n\nThe Solution: I like the title Execution Management Systems (coined by Celonis), but no one yet agrees.   This emerging class of software attempts to combine data, analyze it, and allow you to automate and take action from one central system.  It also allows you to set different business priorities and based on those may recommend different actions.\n\nThe competitors:\n\nAnalytics tools:  You have Tableau, Domo.  Primarily built on reporting they need to extend into automation, and process mining and AI recommendation engines.  I’d say they have a ways to go expect Tableau with Salesforce could have many of the pieces.\n\nData Warehouse Tools: Palantir is somewhere between this and analytics tool with an AI component already well developed.  These tools work to store and analyze data and also usually have some automation with the systems they interact with.  Snowflake is the big name here.\n\nERP/System of Records: These systems mostly approach the problem by trying to do all analytics , AI, automation, within their platform.  You’ve got Salesforce, Workday, SAP and Oracle here.\n\nSystems of engagement: a set of tools that usually are a front end for other systems of record.  Notably ServiceNow trying to be a universal front end to business systems.\n\nProcess Miners:  Celonis is the big name and growing fast.  They approach the problem with unique tech that analyzes how processes flow through these systems.  I think process mining is a critical piece you need to execute the insights and automation and a lot of the players above don’t have too much of that piece.  \n\nRPA:  UIPath and Automation Anywhere.  They started out just automating on the front end.  Now they’re trying to add other components to be a universal execution engine.  \n\nMiddleware: Boomi but notably Salesforce Mulesoft.  They need to add analytics, AI and process mining to get to where this space is going.\n\nEveryone knows this Execution System/Universal Truth is where the future is at.  No one has every piece of that figured out.  But everyone sees while there will always be a place for a system of record (like an ERP/HCM and CRM tools) this new kind of software will be what guides those tools (the one tool to rule them all so to speak).  \n\nDespite what Palantir claims they aren’t the universal leader but they are like a top 3 choice.  This space is crazy fragmented and no one even knows what to call it yet.",
        "created_utc": 1605566171,
        "id": "gcjpmrt",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1605594971.0
    },
    {
        "author": "yacnamron",
        "body": "CRM calls for earnings 🤫don’t tell the algos",
        "created_utc": 1606703976,
        "id": "ge3yswe",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1606732776.0
    },
    {
        "author": "DownVotesWillCome",
        "body": "BABA because it’s the Chinese Amazon apparently.\n\nDIS because it’s a multi-market beast.\n\nBA because it will take that long to get back to ATH but if you bought in at the summer lows it’ll be great.\n\nAirBnB once it IPOs because it will rise.\n\nCRM digital sales will keep going up\n\nAmazon because it’s not going anywhere and keeps expanding (pharmacy, drones, cloud, government contracts)\n\nMicrosoft lots of hands in lots of cookie jars. \n\nGoogle see above and once it clears the legal hurdles over the next couple years it will grow. \n\nApple because it will find a way to stay relevant and the younger generations pick IOS over all others. \n\nDisclaimer: I own them all except AirBnB obviously.",
        "created_utc": 1606015402,
        "id": "gd5jr73",
        "score": 5,
        "subreddit": "stocks",
        "created": 1606044202.0
    },
    {
        "author": "j455b",
        "body": "PLTR buying CRM buying WORK?",
        "created_utc": 1606323483,
        "id": "gdkhwct",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1606352283.0
    },
    {
        "author": "swaggymedia",
        "body": "CRM comment volume up 10,500%\n\nMGNI [comment volume up 2,300%](https://www.swaggystocks.com/dashboard/stocklabs/wallstreetbets-trends) \n\nCongrats guys on MGNI you are officially investing in a company that you have no idea what they even do 😂😂",
        "created_utc": 1606335594,
        "id": "gdl6k12",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1606364394.0
    },
    {
        "author": "Berisha11",
        "body": "Hey guys, do you know of some lesser known AI stocks that have huge potential? We all know about Google, Nvidia, Salesforce, Apple, etc.\n\nBut what are some lesser known AI companies that we rarely hear of, that could have a promising future?",
        "created_utc": 1606185955,
        "id": "gdef9vu",
        "score": 5,
        "subreddit": "stocks",
        "created": 1606214755.0
    },
    {
        "author": "onyux",
        "body": "Salesforce in talks to acquire Slack",
        "created_utc": 1606323092,
        "id": "gdkh3h5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606351892.0
    },
    {
        "author": "marcus_aurelius_wsb",
        "body": "CRM dropped 3% while SLACK went up 7%. Salesforce (crm) gonna buy work (slack)",
        "created_utc": 1606322609,
        "id": "gdkg3dq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606351409.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "For the Slack and Salesforce deal:  \n  \n**The companies have been holding talks and could announce a deal as soon as next week, the person said. A deal hasn’t been finalized and could still fall apart, the person said, asking not to be named because the matter is private.**  \n  \nFuckin hell, this is giving me PTSD from the TikTok saga. CNBC kept saying \"as soon as this weekend\", \"as soon as next week\" etc etc and it dragged on for months!",
        "created_utc": 1606338883,
        "id": "gdlcx0c",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606367683.0
    },
    {
        "author": "PepperoniFogDart",
        "body": "Yep! I bought CRM calls a week ago, and it’s all gone.",
        "created_utc": 1606351386,
        "id": "gdlzooc",
        "score": 4,
        "subreddit": "options",
        "created": 1606380186.0
    },
    {
        "author": "ondori_co",
        "body": "Firstly you're a retard for trying to convince us to buy puts on the basis that the stonk is inflated by speculation.\n\nThat's literally when you should buy calls. Who gives a fuck about fair valuation and EPS.\n\nTSLA doesn't, NIO doesn't. XPEV doesn't. PLTR doesn't. DOCU doesn't. CRM doesn't. You know what, most of NYSE, NASDAQ &amp; TMX don't give two shits about EPS.\n\nI've had Quantum$cape when it was traded under the SPAC which I can't name cause its banned. I'm up 100% on both my stonks and my warrants.\n\nAnd if you were holder in the SPAC you would have got a fat 300 page investors relations booklet that showed the distribution of shares. Which explicitly shows that VW of America owns a fat wad of shares that they cannot sell for first 180 days. Same with many big boy investors.\n\nAnd that the warrants are restricted until 2025. And that only a small % of shares are available for public float. and a bunch of other important shit.\n\nBut also youre retarded for thinking that this should be considered a negative\n\nQuantom$cape hasn't even proved they can meet the manufacturing demands of their committed sales 4 years from now.\n\nIf Quantom$cape runs into problems with meeting demand, I'm going to be filthy rich. Because IF it has issues getting batteries out of their factories, that means their fucking tech works and it is flying off the shelf. Every single automaker would show up at the doorstep with cash and engineers on hand to get their production thru-put up",
        "created_utc": 1606761453,
        "id": "ge68ju4",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606790253.0
    },
    {
        "author": "GatorMD12",
        "body": "10k NIO 10k XPEV 10k CRM 10k WCC shares 3.50 fro some nugs",
        "created_utc": 1604788719,
        "id": "gbi9zml",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604817519.0
    },
    {
        "author": "GnarlyPounderWoo",
        "body": "Need a crack team of retards to help me break the code of CRM, ZM, SNAP, PINS, TTD, BBBY, HOME, and so on for randomly flying up 30% after earnings.",
        "created_utc": 1604788926,
        "id": "gbiamgq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604817726.0
    },
    {
        "author": "BenShapiroOANN",
        "body": "You’ll fuck so many married, big titted, big booty MILFS playing CRM",
        "created_utc": 1606692421,
        "id": "ge3dwvw",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606721221.0
    },
    {
        "author": "JC7577",
        "body": "Slack was around 14B before the CRM announcement. Think we'll see a 30B valuation(around 2x) buy for Slack which is around $50. 12/4/20 45C could be a likely 5 bagger with the announcement tomorrow amc.",
        "created_utc": 1606753406,
        "id": "ge5rt90",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606782206.0
    },
    {
        "author": "Metaflair",
        "body": "Bearish on this in the long run. Salesforce has a piss poor reputation in most cyber security circles I am in and it is only a matter of time before something major happens. Adding more software to this mess is only going to bring about the reckoning quicker.",
        "created_utc": 1606604379,
        "id": "gdxubo2",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1606633179.0
    },
    {
        "author": "steve_pops_01",
        "body": "Anyone on the $CRM train\n\nEarnings next week",
        "created_utc": 1606577812,
        "id": "gdvr0uy",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606606612.0
    },
    {
        "author": "Bandeeznutz",
        "body": "WORK share price increase is all based on a buy out rumor w/ CRM. Now they’re saying AMZN, GOOGL, &amp; MSFT among others are also interested in buying WORK.\n\nNext week this thing comes crashes down",
        "created_utc": 1606587131,
        "id": "gdwfim2",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606615931.0
    },
    {
        "author": "putsonall",
        "body": "You gave it plenty. Teams is far newer than Slack. Ironically, Microsoft is the new upstart.\n\nTeams likely *will* eat it alive.\n\nBut Slack doesn’t need to die completely.\n\nImo Slack always made sense as a loss leader that gets people bought into a distribution channel. Salesforce makes perfect sense. They need more distribution for their (terrible) CRM.",
        "created_utc": 1606358051,
        "id": "gdmanh4",
        "score": 4,
        "subreddit": "investing",
        "created": 1606386851.0
    },
    {
        "author": "FIArrari",
        "body": "I have no clue why so many microsoft products are so underrated. This is just one. I have a grant of 20 products to use for free. Office 365, some cloud service, some CRM program, teams, sharepoint. They are so much better than google for example. They just don't get along with the casual users, I think. Also, even [bing.com/translator](https://bing.com/translator) seems so much better than google translate.",
        "created_utc": 1606067388,
        "id": "gd8n031",
        "score": 4,
        "subreddit": "stocks",
        "created": 1606096188.0
    },
    {
        "author": "robinhoodguy4b5",
        "body": "CRM buying WORK",
        "created_utc": 1606323057,
        "id": "gdkh0rp",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606351857.0
    },
    {
        "author": "TimmyC",
        "body": "$WORK straight up on Salesforce news",
        "created_utc": 1606322455,
        "id": "gdkfrw6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606351255.0
    },
    {
        "author": "lescoobs",
        "body": "Missed out on work and salesforce spike today.  Congrats to everybody who was able to get it on the trade.",
        "created_utc": 1606332404,
        "id": "gdl08yu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606361204.0
    },
    {
        "author": "TrouserSnake88",
        "body": "So why did SLACK moon and CRM drop?",
        "created_utc": 1606349150,
        "id": "gdlvuw6",
        "score": 4,
        "subreddit": "options",
        "created": 1606377950.0
    },
    {
        "author": "tadhg8811",
        "body": "I'm in 2 minds about Hubspot. \n\nIn my mind the bull case is that they have managed to bundle quite a few core products into one solution. EG they have CRM, Marketing software, sales software and CMS. And they have managed to build out this broad product offering while keeping the product quality fairly high. This matters because as they go upmarket more, they are going to meet customers who want more consolidation in the tools they use and not to have different providers for everything. They've also managed to keep revenue growth fairly high for a number of years which is a good sign.\n\nThe bear case is exactly what you alluded to, they are in a very competitive space and since the product is so broad they have a lot of competitors. EG Zendesk and Salesforce are quite different but both compete with Hubspot.\n\nSo, it's a tricky one but I definitely don't have as strong a conviction about them as others on the list.",
        "created_utc": 1605821323,
        "id": "gcvf3ci",
        "score": 4,
        "subreddit": "SecurityAnalysis",
        "created": 1605850123.0
    },
    {
        "author": "GatorMD12",
        "body": "WHO ELSE SWINGING CRM",
        "created_utc": 1604787389,
        "id": "gbi5z1d",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604816189.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "Do you even know what QCOM does?  \n  \nZM and CRM are pure software. Margins are wildly different.",
        "created_utc": 1604513645,
        "id": "gb520cn",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604542445.0
    },
    {
        "author": "m1rrari",
        "body": "So they are taking the Salesforce approach, except they send engineers instead of sales people.",
        "created_utc": 1605506737,
        "id": "gcgyls8",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1605535537.0
    },
    {
        "author": "in_a_rush_for_a_rush",
        "body": "Anyone playing CRM earnings tomorrow?\n\ngot calls but the slack acq might make it drop",
        "created_utc": 1606778432,
        "id": "ge79cl3",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606807232.0
    },
    {
        "author": "agiatezza",
        "body": "Just went all in holding calls until Monday. NVDA PLTR DKNG now at the dip, GMHI MU, CRM VRTS BABA and FSR. 70% sitting in weekly and leaps",
        "created_utc": 1605905674,
        "id": "gcz9lx8",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1605934474.0
    },
    {
        "author": "ReversalTheory",
        "body": "Salesforce deal to buy Slack could be announced next week, CNBC says",
        "created_utc": 1606331077,
        "id": "gdkxlhz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606359877.0
    },
    {
        "author": "nycliving1",
        "body": "WORK halted on rumors of buyout by SalesForce",
        "created_utc": 1606322438,
        "id": "gdkfqmb",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606351238.0
    },
    {
        "author": "Jokell",
        "body": "Well... lost all my early day PLTR gains on Corsair and Salesforce😓",
        "created_utc": 1606334901,
        "id": "gdl57bk",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606363701.0
    },
    {
        "author": "swaggymedia",
        "body": "Salesforce ( CRM ) [comment volume up 5,100%](https://www.swaggystocks.com/dashboard/stocklabs/wallstreetbets-trends) \n\nNice work guys!",
        "created_utc": 1606324819,
        "id": "gdkko3t",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606353619.0
    },
    {
        "author": "randomshitsz",
        "body": "What happened to CRM?",
        "created_utc": 1606324934,
        "id": "gdkkwku",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606353734.0
    },
    {
        "author": "IdkWtfImDoingBro",
        "body": "CRM calls at open? \n\n\nPs. Fuck the cowboys",
        "created_utc": 1606437089,
        "id": "gdpvvnz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606465889.0
    },
    {
        "author": "helio987",
        "body": "Right now it's easy, the past 5 years, people have been riding apple, amazon, tesla, etc..When I first got into stocks back in 1999, it was easy back then as well, I did not have much money but I thought it was normal to buy something like nortel and make 50% in a few weeks.  I took a bath after the tech crash and the Bush years from 2001-2009 were terrible with slow growth.  I do somethings myself now and I also use a money manager through the bank.  He has made terrible choices because he believes in resources and financials, which lost me a lot.  I only use him because I get access to some private equity funds which perform fairly well and I should have made him dump all the oil.  My own little group I invest in, I did good the first 5 years but the buy and hold I was doing petered out and I should have shifted assets sooner like you said.  But I sold a bunch of stuff in February as I felt a drop coming and got in voo, salesforce, tesla at some nice low levels, where my bank guy did shit.  I got a couple mutual funds that do very well for me, I just may put most of money there as they have excellent history over 20 years.",
        "created_utc": 1605875510,
        "id": "gcxogdr",
        "score": 4,
        "subreddit": "investing",
        "created": 1605904310.0
    },
    {
        "author": "throughthevalley77",
        "body": "$SNOW and $CRM for take off",
        "created_utc": 1605626609,
        "id": "gcm7nzp",
        "score": 3,
        "subreddit": "stocks",
        "created": 1605655409.0
    },
    {
        "author": "I_HEART_BUTT_STUFF",
        "body": "CRM possible earnings runup.",
        "created_utc": 1606199070,
        "id": "gdf00cg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606227870.0
    },
    {
        "author": "EpiStat",
        "body": "WORK teaming up with salesforce. Stock halted.",
        "created_utc": 1606322574,
        "id": "gdkg0r7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606351374.0
    },
    {
        "author": "razorteddy",
        "body": "I bought Salesforce shares, earnings next week too.",
        "created_utc": 1606325871,
        "id": "gdkmusa",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606354671.0
    },
    {
        "author": "Sho-gunner",
        "body": "Should I buy CRM? Charts look great, and they’re even talking about buying Slack.",
        "created_utc": 1606331828,
        "id": "gdkz3l4",
        "score": 3,
        "subreddit": "stocks",
        "created": 1606360628.0
    },
    {
        "author": "skycake10",
        "body": "&gt; I don't think CRM is buying WORK for the tech. My thinking is they're doing it for the brand value and a loyal customer base they can upsell to. \n\nI think you're right that they're mostly buying it for the customer base and brand, but it's not a binary. \n\nFor the tech, they're not buying it for the tech from a \"this is incredibly innovative and extremely hard to reproduce\" perspective, but from a \"this is a mature software product\" perspective. Yes, if they really wanted to Salesforce could definitely recreate it, but it would be a months or years undertaking to get it to a stable and mature state.",
        "created_utc": 1606339172,
        "id": "gdldgqr",
        "score": 3,
        "subreddit": "investing",
        "created": 1606367972.0
    },
    {
        "author": "Knowsence",
        "body": "CRM dip bought. I bought a couple calls literally 3 minutes before the slack news came out. It instantly lost like 40% value. Bought more EOD. Earnings next week.",
        "created_utc": 1606339715,
        "id": "gdleizm",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606368515.0
    },
    {
        "author": "boobs___mcgee",
        "body": "SNOW is mew, CRM is mewtwo, PLTR is darkrai",
        "created_utc": 1606341043,
        "id": "gdlh55s",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606369843.0
    },
    {
        "author": "steve_pops_01",
        "body": "Buy the $CRM dip",
        "created_utc": 1606324687,
        "id": "gdkkea5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606353487.0
    },
    {
        "author": "AmbitiousSingh",
        "body": "What's the outlook on CRM? Bought some during the dip thinking it would go back up but down 20% already on my calls.",
        "created_utc": 1606343289,
        "id": "gdllerh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606372089.0
    },
    {
        "author": "OCV2000",
        "body": "I really like this deal, I think Slack is much more valuable as a part of CRM.",
        "created_utc": 1606767550,
        "id": "ge6lmdg",
        "score": 3,
        "subreddit": "investing",
        "created": 1606796350.0
    },
    {
        "author": "BuffettGOAT",
        "body": "CRM took such a beating from this WORK deal. It should be basically priced into tomorrow's earnings right?",
        "created_utc": 1606771675,
        "id": "ge6uaf3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606800475.0
    },
    {
        "author": "shrewer_",
        "body": "Hottest Cyber Monday deals: BABA, CRM, PLTR, NIO, NKLA, and TSLA. 🔥🌈🐻📉",
        "created_utc": 1606751443,
        "id": "ge5nuz9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606780243.0
    },
    {
        "author": "Lyfelife",
        "body": "Purchased salesforce for 248, hoping a small run up post earnings this week can net me a bit for a swing",
        "created_utc": 1606603002,
        "id": "gdxq87a",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1606631802.0
    },
    {
        "author": "throughthevalley77",
        "body": "Mango doing the same thing I do... repeatedly spam something on a social media platform for it to come true. Please tank CRM so I can buy in cheaper.",
        "created_utc": 1604351599,
        "id": "gaxquzf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604380399.0
    },
    {
        "author": "SourceCodeSeller",
        "body": "Zm snap pins logi aapl ericcson crm \n\nLots",
        "created_utc": 1604357737,
        "id": "gay33zt",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604386537.0
    },
    {
        "author": "t777m",
        "body": "I’m 18, a student, getting money by saving parts of my student loan. My objectives are to simply get an understanding of investment and then work towards targets (a quick way of getting money would be nice but i understand that in my position its not faesible). As I’m starting off with a weak source of money i’d prefer a safer strategy, for now. I managed to get hold of 0.02 ETH and a share of SDC.\n\nI have recently picked up an interest in investing and am thinking about starting in the coming days, on trading 212. Ive selected the FAANG companies, Microsoft, Tesla, Shopify, Salesforce, Nvidia, Adobe and Vanguard emerging markets etf. I’m not sure about the percentages.\n\nis this a good pie and what percentages should i use?",
        "created_utc": 1604276240,
        "id": "gauijhz",
        "score": 3,
        "subreddit": "investing",
        "created": 1604305040.0
    },
    {
        "author": "ourobboros",
        "body": "Thoughts on CRM? I work with several clients and 80% of them connect their CRMs to salesforce and on top of that, some also use heroku, marketing cloud, pardot all owned by Salesforce. Earnings coming up too.",
        "created_utc": 1605549831,
        "id": "gcimp6g",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605578631.0
    },
    {
        "author": "JungAndReckless6",
        "body": "Don’t be disappointed, this is one of the best outcomes for Slack. At the rumored price CRM is paying of 30 billion, WORK will have moved nearly 100% from its pre announcement stock price. Furthermore, they were bound to be acquired at some point, without big backers able to cross sell them and expose them to a larger market they would have slowly lost market share to Teams and Zoom, even if they have a slightly better product. It’s really hard to get businesses to spend money on Slack when they already use Microsoft products.\n\nI was hoping that Amazon would be the ones to acquire them as we have adopted Slack as our main internal communication network but it wasn’t meant to be.",
        "created_utc": 1606753764,
        "id": "ge5sjin",
        "score": 3,
        "subreddit": "investing",
        "created": 1606782564.0
    },
    {
        "author": "sr71Girthbird",
        "body": "I would imagine a lot of people/organizations saw the ~7% drop in CRM last week as a fairly good buying opportunity, and not as a quick buck. That is a huge drop and thus entry point if you’re planning on buying and holding. \n\nEither way, the January expiration accounts for most scenarios including IV crush, minor sell of, earnings miss etc.",
        "created_utc": 1606703339,
        "id": "ge3xmp1",
        "score": 3,
        "subreddit": "options",
        "created": 1606732139.0
    },
    {
        "author": "Cowmaro",
        "body": "So we just not touching CRM this time around for earnings?",
        "created_utc": 1606766092,
        "id": "ge6ii3h",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606794892.0
    },
    {
        "author": "Simplivest",
        "body": "There are currently 71 stocks on our ***Gangbuster Growers*** screen.  Here are some of the names:\n\nAMZN, GOOG, CSGP, NFLX, ADBE, NOW, TTD, TREE, ALGN, EPAM, PAYC, RNG, VRTX, VEEV, PANW, FB, CRM, TEAM, ARE, SEDG, AYX, GLOB, MED\n\nHope that gives you something to chew on.\n\n**--- Simplivest ---**",
        "created_utc": 1605919859,
        "id": "gd0099z",
        "score": 3,
        "subreddit": "stocks",
        "created": 1605948659.0
    },
    {
        "author": "emirsway",
        "body": "CRM is gonna moon on vaccine news right guys? right?",
        "created_utc": 1606431203,
        "id": "gdpmdqn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606460003.0
    },
    {
        "author": "ShakerIce",
        "body": "If salesforce buys out slack for $65/share on Tuesday I would 💦💦💦",
        "created_utc": 1606499679,
        "id": "gds9z2q",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606528479.0
    },
    {
        "author": "infinitelimits00",
        "body": "It's actually annoying 50% of the posts are PLTR. I barely trade it and it makes up a lot of my posts too cause everyone else is talking about it. \n\nSince I've been on here for the last 30 mins, I haven't seen a single post on WORK/CRM and maybe 2 posts about ZM, one of which is mine.\n\nLike trading WORK next week for CRM's earnings will be super interesting but it's like no one even knows about it. Heck I rarely even see Tesla posts anymore...is it because all you guys can afford are the 1-3 dollar PLTR options?",
        "created_utc": 1606505320,
        "id": "gdslaze",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606534120.0
    },
    {
        "author": "xjayroox",
        "body": "Did the Salesforce CEO shoot someone?",
        "created_utc": 1606322968,
        "id": "gdkgu5s",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606351768.0
    },
    {
        "author": "thisonelife83",
        "body": "CRM is purchasing WORK - makes sense now - reported by WSJ 5 minutes ago.",
        "created_utc": 1606323517,
        "id": "gdkhyu5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606352317.0
    },
    {
        "author": "kawkface",
        "body": "CRM to buy WORK wtfffffff",
        "created_utc": 1606323111,
        "id": "gdkh4ux",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606351911.0
    },
    {
        "author": "cisconut30",
        "body": "WORK is halted -- CRM in talks to buy them.  No Trading",
        "created_utc": 1606322509,
        "id": "gdkfvyk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606351309.0
    },
    {
        "author": "LUV2FUKMARRIEDMILFS",
        "body": "CRM GET FUCKED!!!\nDame bro wtf 😳",
        "created_utc": 1606323186,
        "id": "gdkhabo",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606351986.0
    },
    {
        "author": "2BeersADay",
        "body": "Purchased by Salesforce is what my app says.",
        "created_utc": 1606323414,
        "id": "gdkhr8b",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606352214.0
    },
    {
        "author": "ReversalTheory",
        "body": "Easiest $20k I've ever made. Thanks WORK and CRM, but most of all thank you to those who got caught buying all my 40c's at $300 lmao",
        "created_utc": 1606323723,
        "id": "gdkie9x",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606352523.0
    },
    {
        "author": "SuperInsaneGoku",
        "body": "CRM may buy it. If  deal is sealed your puts will be worthless.",
        "created_utc": 1606323614,
        "id": "gdki67m",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606352414.0
    },
    {
        "author": "GasolineTruth",
        "body": "Since trying to get in WORK after the first ten minutes is basically playing knife games with your dick and balls, does anyone have a theory on what CRM might pivot to if they don't like the price for slack? That seems like the real play, buy 500 fds at .02 or .03 each on some boring collaboration ticker and watch it gap up 5 years worth of growth into the money in one second.",
        "created_utc": 1606324711,
        "id": "gdkkg1w",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606353511.0
    },
    {
        "author": "chiefrios",
        "body": "Potential CRM deal",
        "created_utc": 1606325337,
        "id": "gdklqhq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606354137.0
    },
    {
        "author": "ForgotPWAgainSigh",
        "body": "Slack will probably be small incremental profis for Salesforce but the outlook on Salesforce as a complete solution increases in value.\n\nNow... It's time to figure out the right strike for long calls.",
        "created_utc": 1606325549,
        "id": "gdkm6fy",
        "score": 3,
        "subreddit": "stocks",
        "created": 1606354349.0
    },
    {
        "author": "Gorbie007",
        "body": "CRM announced they might want to buy them",
        "created_utc": 1606325291,
        "id": "gdkln4o",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606354091.0
    },
    {
        "author": "echan00",
        "body": "Why do you think it’s a good idea? I think it’s a horrible idea to buy now. The stock jumped 20-25% today because salesforce “might” buy it. That’s an easy way to get burned buddy",
        "created_utc": 1606335806,
        "id": "gdl6yux",
        "score": 3,
        "subreddit": "investing",
        "created": 1606364606.0
    },
    {
        "author": "Liberate_and_Develop",
        "body": "While you all are panicking over the PLTR dip, is anyone here smart enough to also hop in the $CRM dip? Thinking about getting in Jan 15 or Feb 19 275c. News of slack acquisition will fade and the stock will rebound",
        "created_utc": 1606331588,
        "id": "gdkym86",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606360388.0
    },
    {
        "author": "TheRealRelaxedHabibi",
        "body": "So I just ran an activity report for my IBKR account, YTD.\n\nMy most profitable options were SQ, UNH, NOW &amp; CRM.\n\nMy biggest losses stemmed from TSLA, AAPL &amp; NVDA.\n\nSmaller gains came from QQQ, SPY, CAT &amp; BABA calls.\n\nI am -2.42% in this account and 19% up on another account which I don't touch (A mix of ETFs).",
        "created_utc": 1604733932,
        "id": "gbfmm54",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604762732.0
    },
    {
        "author": "commitpushdrink",
        "body": "Because basically everything else has for the last six months except snap and salesforce",
        "created_utc": 1605144983,
        "id": "gbzub4c",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605173783.0
    },
    {
        "author": "Logaratyunas",
        "body": "All PLTR long term holders listen up.\n\nTodays earning will very well crash the price from $15 to $7.50 and maybe $4 in the next few days. Many pussy diamond hands have sold, or are selling before the bell. Many will sell once the price plunge to under $10. But know that AMZN, MSFT, AAPL, FB &amp; NFLX have all dropped below half of their IPO price. Believe in data analytics, their ability to reach all corners of the world with their human tracking, and their billionaire CEO who is a PayPal founder and FB first investor. They may be the next Microsoft, Adobe or Salesforce.\n\nTldr: $12 Puts are sure to print after they blow their earnings for this profitless company...",
        "created_utc": 1605201817,
        "id": "gc2ank3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605230617.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  2nd of November\n\n\n\n## Upcoming events for Monday, November  2nd\n\n - Stock splits:\n\n    - MDLY @ **1:10**\n\n - Expected earnings:\n\n  ADTN, ADUS, AGRX, AIZ, AKTX, ALUS, ALX, AMC, AMCX, AMRC, ANET, ANH, APPF, ARGO, ARVN, ATXI, AWR, BCC, BKH, BRKR, BSM, BTE, BWXT, BYFC, CBFV, CCLP, CCXI, CDEV, CDK, CDLX, CDW, CINR, CLCT, CLX, CNA, CNO, CNTY, CORR, CPAC, CPE, CPLP, CRD.A, CRD.B, CRNT, CRUS, CTIC, CVI, CWH, DEA, DEI, DOOR, DRIO, DRRX, DSPG, EC, ECPG, EEX, EGRX, EL, ELVT, ENIA, ESPR, EVER, EVRI, EXTN, FANG, FBM, FE, FICO, FMC, FN, FNCB, FRPT, FTSI, FUNC, FUSB, G, GAIN, GHL, GIFI, HALO, HCKT, HGEN, HLIO, HMN, HNRG, HRTG, HSIC, HUD, HURN, HZNP, IAA, ICCH, ICHR, IHT, INGR, INSP, IOVA, IPI, IR, IRET, ISEE, ITIC, ITRI, ITUB, JAKK, JAZZ, JCOM, JLL, KFRC, KMPR, KMT, KNSA, KPTI, KRYS, L, LCII, LDOS, LEG, LITE, LL, LNT, LPG, MATX, MDLZ, MEC, MED, MG, MGP, MIME, MITT, MOS, MPC, MPLX, MRTX, MSGN, MVBF, MYGN, MYOK, NC, NCMI, NERV, NI, NNN, NPTN, NSP, NSSC, NTP, NTR, NWHM, NXE, O, OGS, OMI, ON, ONCS, ONTO, OSPN, OTTR, OXBR, OXLC, PAA, PACB, PAGP, PARR, PBR, PBR.A, PEAK, PINC, PMBC, PUMP, PYPL, QTNT, RGS, RIG, RMBS, RPAI, RVNC, RYAAY, SAMA, SANM, SBAC, SEDG, SIBN, SIMO, SNDX, SOGO, SOHU, SRC, SRRA, STE, STIM, STRL, SUP, SWKS, SYN, TCMD, TEN, TLGT, TMBR, TPTX, TREX, TRVG, TRVN, TYME, UAN, UROV, USFD, VCTR, VCYT, VEON, VNO, VNOM, WBK, WING, WLFC, WM, WMB, WMK, XENT, YRCW\n\n - Ex-div:\n\n  ASGI, ASML, BANR, BKEP, CAPL, ETRN, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, IID, ITUB, KEN, LBAI, LMRK, MET, SHLX, SPH, SRCE, USDP, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.100%)\n    - 6-Month Bill Auction (previous: 0.110%)\n    - Construction Spending (consensus: 0.9%, previous: 1.4%)\n    - Core PCE Price Index (previous: 0.3%)\n    - Core PCE Price Index (previous: 1.6%)\n    - ISM Manufacturing Employment (previous: 49.6)\n    - ISM Manufacturing New Orders Index (previous: 60.2)\n    - ISM Manufacturing PMI (consensus: 55.8, previous: 55.4)\n    - ISM Manufacturing Prices (consensus: 58.6, previous: 62.8)\n    - Investing.com Gold Index (actual: 56.5%, previous: 58.5%)\n    - Investing.com S&amp;P 500 Index (actual: 65.9%, previous: 58.7%)\n    - Loan Officer Survey\n    - Manufacturing PMI (previous: 53.3)\n    - PCE Price index (previous: 1.4)\n    - PCE price index (previous: 0.3%)\n    - Total Vehicle Sales (previous: 15.70M)\n\n## Upcoming events for Tuesday, November  3rd\n\n - Expected earnings:\n\n  ACET, ACOR, AGCO, AJX, AKR, ANAT, ANDE, APLS, AQB, ARA, ARCB, ARNC, AROC, ATH, ATHM, AUBN, AVD, AVNS, AVNT, BBGI, BBU, BCTX, BHC, BLD, BMCH, BRY, BTG, BTU, CARA, CARG, CBAY, CBD, CC, CGBD, CHCT, CHFS, CHSCP, CLSK, CLW, COHR, COKE, CORT, CPTA, CRIS, CRVL, CTLT, EAF, EMR, ES, ETN, ETRN, EURN, EXC, EXK, EXPD, FATE, FI, FOX, FOXA, FSP, GBLI, GCI, GLDD, GORO, GRFS, GSH, GTE, GTES, GWPH, HBM, HRZN, HSC, HTA, HUM, HY, HYRE, ICD, ICPT, INN, INS, IOSP, IPAR, IT, ITCI, JBGS, JCI, JELD, KAR, KE, KOPN, KRMD, LFC, LFVN, LGIH, LPX, LUNA, MBI, MCK, MCRB, MCS, MCY, MDNA, MDRR, METC, MOR, MRCY, MYL, NBR, NES, NEX, NEXT, NHC, NK, NP, NPO, NR, NRC, NSIT, OCFT, OCN, OMP, OPCH, ORA, OTEL, OXFD, PACD, PAYS, PEI, PFHD, PFIS, PKOH, PMD, PRU, PTRS, PTVCA, PTVCB, QUAD, RACE, RCM, RCUS, RHP, RNWK, RVI, SAVA, SCOR, SHIP, SIM, SMCI, SMIT, SPKE, SPR, STAR, SUPN, SYY, TCFC, TCON, TEF, TIMB, TISI, TREC, TRHC, TRI, TRMT, TTI, TX, UEC, UFPT, USAC, VIST, VIV, VPG, VSH, VSTM, W, WBT, WEC, WEYS, WLK, WLKP, WMG, WTRG, WTTR, XENE, XNCR, XOMA, Y, ZBRA, ZYME\n\n - Ex-div:\n\n  AIV, AMRB, BRO, CLX, EIG, FMX, HFWA, MCBS, PCB, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.140%)\n    - API Weekly Crude Oil Stock (previous: 4.577M)\n    - Durables Excluding Defense (previous: 3.4%)\n    - Factory Orders (consensus: 1.0%, previous: 0.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 55.2)\n    - ISM NY Business Conditions (previous: 56.1%)\n    - ISM-New York Index (previous: 807.3)\n    - Redbook (previous: 0.8%)\n    - Redbook (previous: 1.2%)\n    - U.S. Presidential Election\n\n## Upcoming events for Wednesday, November  4th\n\n - Expected earnings:\n\n  AAMC, ABIO, ACAD, ACIA, AE, AEE, AFIN, AGLE, AGM, AHCO, ALB, ALBO, ALL, ALLO, ALLT, ALSK, ALTM, AMEH, AMOT, AMSC, ANIK, ANSS, ANVS, APA, APEN, AQST, ARC, ARDX, ARTNA, ASC, ASTE, ATAX, ATEX, ATLO, AVA, AWK, AXNX, AZPN, BBD, BBDO, BBSI, BCH, BEP, BIDU, BIOL, BKCC, BKD, BKEP, BKTI, BLCM, BLPH, BRX, BSBR, BSGM, BWEN, CAPL, CBMG, CCAP, CCJ, CCRN, CCU, CDXC, CEA, CECE, CF, CFMS, CHEK, CHNG, CIA, CIB, CIM, CIX, CLFD, CLH, CLI, CMP, COHN, CPK, CRK, CRY, CSGS, CSII, CSTE, CTSO, CTVA, CUTR, CVU, CWBR, CXW, CYTK, DAR, DCP, DFIN, DHX, DK, DKL, DMAC, DNLI, DNOW, DRTT, DXPE, EGY, ELF, ELY, ENBL, ENLC, EPM, EPR, EPRT, EQH, ESSA, ET, EXPE, EXPI, EXR, FCRD, FIT, FLMN, FLXN, FNF, FNHC, FNV, FOE, FRG, FRGI, FROG, FRPH, FSTR, FTDR, FUN, GDDY, GDOT, GFL, GHC, GIB, GLMD, GLRE, GMAB, GMRE, GNK, GNW, GOL, GOOD, GPL, GPP, GPRE, GPRK, GRNQ, GRP.U, GTHX, H, HAE, HARP, HBB, HEP, HLNE, HLT, HNGR, HOFV, HOLX, HR, HST, IAG, IBOC, IDN, IGC, IIPR, IMXI, INFI, INGN, INPX, IO, IONS, IQ, ITI, JCAP, JKHY, KAMN, KBAL, KGC, KIDS, KLDO, KRUS, KW, KZR, LANC, LAND, LAZY, LBTYA, LBTYB, LBTYK, LC, LCI, LCTX, LHCG, LILA, LILAK, LMRK, LNC, LND, LPI, LPL, LRMR, LTBR, LTRPA, LTRPB, LUMN, LYRA, MCEP, MCHX, MDGL, MDU, MELI, MET, MFA, MGEE, MGNX, MIRM, MLAB, MLP, MLR, MLVF, MNKD, MOSY, MRCC, MRO, MRSN, MTCH, MTG, MTRX, MTW, NEWT, NGD, NHTC, NMFC, NODK, NTN, NUS, NWPX, OESX, OLN, ORCC, ORIC, ORTX, OSUR, OTIC, OUT, PAAS, PAHC, PATI, PAYC, PDCE, PDLB, PEBK, PFBI, PFGC, PING, PIRS, PLUS, PLYA, PODD, PRAH, PRGO, PRI, PRQR, PRTA, PSA, PSEC, PSN, PTGX, PXD, QCOM, QLYS, QRTEA, QRTEB, QRVO, QTWO, QUIK, RC, RCMT, RDN, RDWR, REI, RESI, REXN, RGLD, RGNX, RKDA, RLJ, RPD, RPT, RTLR, RYAM, SAFT, SBGI, SBOW, SENEA, SENEB, SG, SGA, SGMO, SGMS, SGRY, SITM, SJI, SJW, SLF, SMG, SMSI, SMTX, SPPI, SRDX, SRT, STAA, STN, SUN, SUZ, SWM, SWX, SYKE, SYNC, TA, TAC, TACT, TALO, TBIO, TELL, TG, TGA, TISI, TLK, TMDX, TPC, TPCO, TRC, TRMB, TRNO, TRTX, TS, TSLX, TTEC, TTGT, TTOO, TWO, TYL, UBX, UFCS, UHAL, UMH, UNVR, UPWK, USDP, USWS, VAC, VAPO, VBIV, VMD, VOYA, VRCA, VRSK, VRT, VST, VTOL, VTVT, VVNT, VYGR, WEN, WHD, WHLR, WK, WRN, WSTG, WTI, WTM, WTS, WYNN, XAN, XEC, ZAGG, ZNGA, ZNH, ZYNE\n\n - Ex-div:\n\n  AMG, AWI, BBD, BBDO, CATC, CFBK, FELE, HESM, IBCP, IDA, LSBK, MTRN, NEP, NWBI, OFED, PVBC, STBA, VBTX, WSFS, XYL\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 650K, previous: 749K)\n    - All Car Sales (previous: 3.75M)\n    - All Truck Sales (previous: 12.59M)\n    - Crude Oil Imports (previous: 0.122M)\n    - Crude Oil Inventories (previous: 4.320M)\n    - Cushing Crude Oil Inventories (previous: -0.422M)\n    - Distillate Fuel Production (previous: -0.005M)\n    - EIA Refinery Crude Runs  (previous: 0.362M)\n    - EIA Weekly Distillates Stocks (previous: -4.491M)\n    - EIA Weekly Refinery Utilization Rates (previous: 1.7%)\n    - Exports (previous: 171.90B)\n    - Gasoline Inventories (previous: -0.892M)\n    - Gasoline Production (previous: 0.162M)\n    - Heating Oil Stockpiles (previous: -0.299M)\n    - ISM Non-Manufacturing Business Activity (previous: 63.0)\n    - ISM Non-Manufacturing Employment (previous: 51.8)\n    - ISM Non-Manufacturing New Orders (previous: 61.5)\n    - ISM Non-Manufacturing PMI (consensus: 57.5, previous: 57.8)\n    - ISM Non-Manufacturing Prices (previous: 59.0)\n    - Imports (previous: 239.00B)\n    - MBA 30-Year Mortgage Rate (previous: 3.00%)\n    - MBA Mortgage Applications (previous: 1.7%)\n    - MBA Purchase Index (previous: 305.2)\n    - Markit Composite PMI (consensus: 55.5, previous: 54.3)\n    - Mortgage Market Index (previous: 807.8)\n    - Mortgage Refinance Index (previous: 3,711.6)\n    - Seevol Cushing Storage Report (previous: -2.538M)\n    - Services PMI (consensus: 56.0, previous: 54.6)\n    - Trade Balance (consensus: -64.00B, previous: -67.10B)\n\n^^^^2020-11-02",
        "created_utc": 1604314822,
        "id": "gavwe93",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1604343622.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  3rd of November\n\n\n\n## Upcoming events for Tuesday, November  3rd\n\n - Expected earnings:\n\n  ACET, ACOR, AGCO, AKR, ANAT, ANDE, APLS, AQB, ARA, ARCB, AROC, ATH, ATHM, AVNS, AVNT, BBGI, BBU, BCTX, BHC, BLD, BMCH, BRY, BTG, BTU, CARA, CBAY, CBD, CC, CGBD, CHCT, CHFS, CHSCP, CLSK, CLW, COHR, COKE, CORT, CPTA, CRIS, CRVL, CTLT, DS, EAF, EMR, ES, ETN, ETRN, EURN, EXC, EXK, EXPD, FATE, FI, FOX, FOXA, FPRX, FSP, GBLI, GCI, GLDD, GORO, GRFS, GSH, GTES, GWPH, HBM, HRZN, HSC, HTA, HUD, HUM, HY, HYRE, ICD, ICPT, INN, INS, IOSP, IPAR, IT, ITCI, JBGS, JCI, JELD, KAR, KE, KOPN, KRMD, LFC, LFVN, LGIH, LPX, MBI, MCK, MCRB, MCS, MCY, MDNA, MDRR, METC, MOR, MRCY, MYL, NBR, NES, NEX, NEXT, NHC, NK, NMCI, NP, NPO, NR, NRC, NSIT, OCFT, OCN, OMP, OPCH, ORA, OTEL, OXFD, PACD, PAYS, PEI, PFIS, PKOH, PMD, PRU, PTRS, PTVCA, PTVCB, QUAD, RACE, RCM, RCUS, RHP, RNWK, RVI, SAVA, SHIP, SIM, SMCI, SPKE, SPR, STAR, SUPN, SYY, TCFC, TCON, TIMB, TREC, TRHC, TRI, TRMT, TTI, TX, UEC, UFPT, USAC, VIST, VIV, VPG, VSH, VSTM, W, WBT, WEC, WEYS, WLK, WLKP, WMG, WTRG, WTTR, XENE, XOMA, Y, ZBRA, ZYME\n\n - Ex-div:\n\n  AIV, AMRB, BRO, CLX, EIG, FMX, HFWA, MCBS, PCB, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.140%)\n    - API Weekly Crude Oil Stock (previous: 4.577M)\n    - Durables Excluding Defense (previous: 3.4%)\n    - Factory Orders (consensus: 1.0%, previous: 0.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 55.2)\n    - ISM NY Business Conditions (previous: 56.1%)\n    - ISM-New York Index (previous: 807.3)\n    - Redbook (previous: 0.8%)\n    - Redbook (previous: 1.2%)\n    - Total Vehicle Sales (consensus: 16.50M, previous: 16.30M)\n    - U.S. Presidential Election\n\n## Upcoming events for Wednesday, November  4th\n\n - Expected earnings:\n\n  AAMC, ABIO, ACAD, ACIA, AE, AEE, AFIN, AGLE, AGM, AHCO, ALB, ALBO, ALL, ALLO, ALLT, ALSK, ALTM, AMEH, AMOT, AMSC, ANIK, ANSS, ANVS, APA, APEN, AQST, ARC, ARDX, ARTNA, ASC, ASTE, ATAX, ATEX, ATLO, AVA, AWK, AXNX, AZPN, BBD, BBDO, BBSI, BCH, BEP, BIDU, BIOL, BKCC, BKD, BKEP, BKTI, BLCM, BLPH, BRX, BSBR, BSGM, BWEN, CAPL, CBMG, CCAP, CCJ, CCRN, CCU, CDXC, CEA, CECE, CF, CFMS, CHEK, CHNG, CIA, CIB, CIM, CIX, CLFD, CLH, CLI, CMP, COHN, CPK, CRK, CRY, CSGS, CSII, CSTE, CTSO, CTVA, CUTR, CVU, CWBR, CXW, CYTK, DAR, DCP, DFIN, DHX, DK, DKL, DMAC, DNLI, DNOW, DRTT, DXPE, EGY, ELF, ELY, ENBL, ENLC, EPM, EPR, EPRT, EQH, ESSA, ET, EXPE, EXPI, EXR, FCRD, FIT, FLMN, FLXN, FNF, FNHC, FNV, FOE, FRG, FRGI, FROG, FRPH, FSTR, FTDR, FUN, GDDY, GDOT, GFL, GHC, GIB, GLMD, GLRE, GMAB, GMRE, GNK, GNW, GOL, GOOD, GPL, GPP, GPRE, GPRK, GRNQ, GRP.U, GTHX, H, HAE, HARP, HBB, HEP, HLNE, HLT, HNGR, HOFV, HOLX, HR, HST, IAG, IBOC, IDN, IGC, IIPR, IMXI, INFI, INGN, INPX, IO, IONS, IQ, ITI, JCAP, JKHY, KAMN, KBAL, KGC, KIDS, KLDO, KRUS, KW, KZR, LANC, LAND, LAZY, LBTYA, LBTYB, LBTYK, LC, LCI, LCTX, LHCG, LILA, LILAK, LMRK, LNC, LND, LPI, LPL, LRMR, LTBR, LTRPA, LTRPB, LUMN, LYRA, MCEP, MCHX, MDGL, MDU, MELI, MET, MFA, MGEE, MGNX, MIRM, MLAB, MLP, MLR, MLVF, MNKD, MOSY, MRCC, MRO, MRSN, MTCH, MTG, MTRX, MTW, NEWT, NGD, NHTC, NMFC, NODK, NTN, NUS, NWPX, OESX, OLN, ORCC, ORIC, ORTX, OSUR, OTIC, OUT, PAAS, PAHC, PATI, PAYC, PDCE, PDLB, PEBK, PFBI, PFGC, PING, PIRS, PLUS, PLYA, PODD, PRAH, PRGO, PRI, PRQR, PRTA, PSA, PSEC, PSN, PTGX, PXD, QCOM, QLYS, QRTEA, QRTEB, QRVO, QTWO, QUIK, RC, RCMT, RDN, RDWR, REI, RESI, REXN, RGLD, RGNX, RKDA, RLJ, RPD, RPT, RTLR, RYAM, SAFT, SBGI, SBOW, SENEA, SENEB, SG, SGA, SGMO, SGMS, SGRY, SITM, SJI, SJW, SLF, SMG, SMSI, SMTX, SPPI, SRDX, SRT, STAA, STN, SUN, SUZ, SWM, SWX, SYKE, SYNC, TA, TAC, TACT, TALO, TBIO, TELL, TG, TGA, TISI, TLK, TMDX, TPC, TPCO, TRC, TRMB, TRNO, TRTX, TS, TSLX, TTEC, TTGT, TTOO, TWO, TYL, UBX, UFCS, UHAL, UMH, UNVR, UPWK, USDP, USWS, VAC, VAPO, VBIV, VMD, VOYA, VRCA, VRSK, VRT, VST, VTOL, VTVT, VVNT, VYGR, WEN, WHD, WHLR, WK, WRN, WSTG, WTI, WTM, WTS, WYNN, XAN, XEC, ZAGG, ZNGA, ZNH, ZYNE\n\n - Ex-div:\n\n  AMG, AWI, BBD, BBDO, CATC, CFBK, FELE, HESM, IBCP, IDA, LSBK, MTRN, NEP, NWBI, OFED, PVBC, STBA, VBTX, WSFS, XYL\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 650K, previous: 749K)\n    - All Car Sales (previous: 3.75M)\n    - All Truck Sales (previous: 12.59M)\n    - Crude Oil Imports (previous: 0.122M)\n    - Crude Oil Inventories (consensus: 1.964M, previous: 4.320M)\n    - Cushing Crude Oil Inventories (previous: -0.422M)\n    - Distillate Fuel Production (previous: -0.005M)\n    - EIA Refinery Crude Runs  (previous: 0.362M)\n    - EIA Weekly Distillates Stocks (consensus: -1.960M, previous: -4.491M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.4%, previous: 1.7%)\n    - Exports (previous: 171.90B)\n    - Gasoline Inventories (consensus: -1.220M, previous: -0.892M)\n    - Gasoline Production (previous: 0.162M)\n    - Heating Oil Stockpiles (previous: -0.299M)\n    - ISM Non-Manufacturing Business Activity (consensus: 62.0, previous: 63.0)\n    - ISM Non-Manufacturing Employment (previous: 51.8)\n    - ISM Non-Manufacturing New Orders (previous: 61.5)\n    - ISM Non-Manufacturing PMI (consensus: 57.5, previous: 57.8)\n    - ISM Non-Manufacturing Prices (previous: 59.0)\n    - Imports (previous: 239.00B)\n    - MBA 30-Year Mortgage Rate (previous: 3.00%)\n    - MBA Mortgage Applications (previous: 1.7%)\n    - MBA Purchase Index (previous: 305.2)\n    - Markit Composite PMI (consensus: 55.5, previous: 54.3)\n    - Mortgage Market Index (previous: 807.8)\n    - Mortgage Refinance Index (previous: 3,711.6)\n    - Seevol Cushing Storage Report (previous: -2.538M)\n    - Services PMI (consensus: 56.0, previous: 54.6)\n    - Trade Balance (consensus: -63.80B, previous: -67.10B)\n\n^^^^2020-11-03",
        "created_utc": 1604401217,
        "id": "gazsbv8",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1604430017.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  4th of November\n\n\n\n## Upcoming events for Wednesday, November  4th\n\n - Expected earnings:\n\n  AAMC, ABIO, ACAD, ACIA, AE, AEE, AFIN, AGLE, AGM, AHCO, ALB, ALBO, ALL, ALLO, ALLT, ALSK, ALTM, AMEH, AMOT, AMSC, ANIK, ANSS, ANVS, APA, APEN, AQST, ARC, ARDX, ARTNA, ASC, ASTE, ATAX, ATEX, ATLO, AVA, AWK, AXNX, AZPN, BBD, BBDO, BBSI, BCH, BEP, BIDU, BIOL, BKCC, BKD, BKEP, BKTI, BLCM, BLPH, BRX, BSBR, BSGM, BWEN, CAPL, CBMG, CCAP, CCJ, CCRN, CCU, CDXC, CEA, CECE, CF, CFMS, CHEK, CHNG, CIA, CIB, CIM, CIX, CLFD, CLH, CLI, CMP, COHN, CPK, CRK, CRY, CSGS, CSII, CSTE, CTSO, CTVA, CUTR, CVU, CWBR, CXW, CYTK, DAR, DCP, DFIN, DHX, DK, DKL, DMAC, DNLI, DNOW, DRTT, DXPE, EGY, ELF, ELY, ENBL, ENLC, EPM, EPR, EPRT, EQH, ESSA, ET, EXPE, EXPI, EXR, FCRD, FIT, FLMN, FLXN, FNF, FNHC, FNV, FOE, FRG, FRGI, FROG, FRPH, FSTR, FTDR, FUN, GDDY, GDOT, GFL, GHC, GIB, GLMD, GLRE, GMAB, GMRE, GNK, GNW, GOL, GOOD, GPL, GPP, GPRE, GPRK, GRNQ, GRP.U, GTHX, H, HAE, HARP, HBB, HEP, HLNE, HLT, HNGR, HOFV, HOLX, HR, HST, IAG, IBOC, IDN, IGC, IIPR, IMXI, INFI, INGN, INPX, IO, IONS, IQ, ITI, JCAP, JKHY, KAMN, KBAL, KGC, KIDS, KLDO, KRUS, KW, KZR, LANC, LAND, LAZY, LBTYA, LBTYB, LBTYK, LC, LCI, LCTX, LHCG, LILA, LILAK, LMRK, LNC, LND, LPI, LPL, LRMR, LTBR, LTRPA, LTRPB, LUMN, LYRA, MCEP, MCHX, MDGL, MDU, MDXG, MELI, MET, MFA, MGEE, MGNX, MIRM, MLAB, MLP, MLR, MLVF, MNKD, MOSY, MRCC, MRO, MRSN, MTCH, MTG, MTRX, MTW, NEWT, NGD, NHTC, NMFC, NODK, NTN, NUS, NWPX, OESX, OLN, ORCC, ORIC, ORTX, OSUR, OTIC, OUT, PAAS, PAHC, PATI, PAYC, PDCE, PDLB, PEBK, PFBI, PFGC, PING, PIRS, PLUS, PLYA, PODD, PRAH, PRGO, PRI, PRQR, PRTA, PSA, PSEC, PSN, PTGX, PXD, QCOM, QLYS, QRTEA, QRTEB, QRVO, QTWO, QUIK, RC, RCMT, RDN, RDWR, REI, RESI, REXN, RGLD, RGNX, RKDA, RLJ, RPD, RPT, RTLR, RYAM, SAFT, SBGI, SBOW, SENEA, SENEB, SG, SGA, SGMO, SGMS, SGRY, SITM, SJI, SJW, SLF, SMG, SMSI, SMTX, SPPI, SRDX, SRT, STAA, STN, SUN, SUZ, SWM, SWX, SYKE, SYNC, TA, TAC, TACT, TALO, TBIO, TELL, TG, TGA, TISI, TLK, TMDX, TPC, TPCO, TRC, TRMB, TRNO, TRTX, TS, TSLX, TTEC, TTGT, TTOO, TWO, TYL, UBX, UFCS, UHAL, UMH, UNVR, UPWK, USDP, USWS, VAC, VAPO, VBIV, VMD, VOYA, VRCA, VRSK, VRT, VST, VTOL, VTVT, VVNT, VYGR, WEN, WHD, WHLR, WK, WRN, WSTG, WTI, WTM, WTS, WYNN, XAN, XEC, ZAGG, ZNGA, ZNH, ZYNE\n\n - Ex-div:\n\n  AMG, AWI, BBD, BBDO, CATC, CFBK, FELE, HESM, IBCP, IDA, LSBK, MTRN, NEP, NWBI, OFED, PVBC, STBA, VBTX, WSFS, XYL\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 650K, previous: 749K)\n    - All Car Sales (previous: 3.75M)\n    - All Truck Sales (previous: 12.59M)\n    - Crude Oil Imports (previous: 0.122M)\n    - Crude Oil Inventories (consensus: 0.890M, previous: 4.320M)\n    - Cushing Crude Oil Inventories (previous: -0.422M)\n    - Distillate Fuel Production (previous: -0.005M)\n    - EIA Refinery Crude Runs  (previous: 0.362M)\n    - EIA Weekly Distillates Stocks (consensus: -1.729M, previous: -4.491M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.4%, previous: 1.7%)\n    - Exports (previous: 171.90B)\n    - Gasoline Inventories (consensus: -0.871M, previous: -0.892M)\n    - Gasoline Production (previous: 0.162M)\n    - Heating Oil Stockpiles (previous: -0.299M)\n    - ISM Non-Manufacturing Business Activity (consensus: 62.0, previous: 63.0)\n    - ISM Non-Manufacturing Employment (previous: 51.8)\n    - ISM Non-Manufacturing New Orders (previous: 61.5)\n    - ISM Non-Manufacturing PMI (consensus: 57.5, previous: 57.8)\n    - ISM Non-Manufacturing Prices (previous: 59.0)\n    - Imports (previous: 239.00B)\n    - MBA 30-Year Mortgage Rate (previous: 3.00%)\n    - MBA Mortgage Applications (previous: 1.7%)\n    - MBA Purchase Index (previous: 305.2)\n    - Markit Composite PMI (consensus: 55.5, previous: 54.3)\n    - Mortgage Market Index (previous: 807.8)\n    - Mortgage Refinance Index (previous: 3,711.6)\n    - Seevol Cushing Storage Report (previous: -2.538M)\n    - Services PMI (consensus: 56.0, previous: 54.6)\n    - Trade Balance (consensus: -63.80B, previous: -67.10B)\n\n## Upcoming events for Thursday, November  5th\n\n - Expected earnings:\n\n  AAIC, AAOI, AAON, AAWW, AAXN, ABC, ABUS, ACEL, ACIW, ACLS, ACMR, ACRS, ACRX, ADAP, ADMA, ADMS, ADT, ADVM, AEIS, AERI, AEZS, AG, AGFS, AGIO, AGO, AGS, AHH, AIG, AINV, AIRG, AIRI, AJX, AKBA, AKTS, ALDX, ALNY, ALRM, ALRN, ALTR, AMCR, AMH, AMN, AMPE, AMPY, AMRK, AMRN, AMRS, AMS, AMYT, ANGI, ANIP, AOSL, AP, APLE, APPN, APT, APVO, ARAV, ARCT, ARLO, ARNA, ARNC, ARPO, ARRY, ASM, ASMB, ATEC, ATGE, ATNX, ATRA, ATRC, ATRS, AUTL, AUTO, AVLR, AVNW, AVRO, AXDX, AXSM, AY, AYX, AZN, AZUL, BABA, BAP, BATRA, BATRK, BBAR, BBIO, BCE, BCEI, BCRX, BCSF, BCYC, BDSI, BDX, BFAM, BFS, BGS, BGSF, BHB, BHF, BIGC, BILL, BKNG, BLDP, BLFS, BLL, BMRN, BMY, BNFT, BNL, BRG, BRT, BW, CABA, CABO, CAH, CALA, CAPR, CARG, CATB, CBB, CBIO, CCOI, CCR, CDAY, CDTX, CDXS, CEIX, CELC, CEMI, CEVA, CGEN, CHH, CHMA, CHRS, CHUY, CI, CIO, CIR, CKPT, CKX, CLBS, CLLS, CLNC, CLNE, CLR, CLVS, CLXT, CMBM, CMLS, CMRX, CNCE, CNDT, CNHI, CNK, CNP, CNQ, COLD, COLL, COMM, CORE, CPLG, CPRI, CPS, CPSI, CRBP, CRDF, CREX, CRHM, CRMD, CRON, CSLT, CSOD, CSU, CTHR, CTMX, CTRE, CUBE, CUE, CWEN, CWEN.A, CWK, CYRX, CZNC, CZR, D, DAC, DBX, DCPH, DDD, DEN, DHC, DISCA, DISCB, DISCK, DISH, DLX, DNB, DNN, DRH, DRNA, DUK, DVAX, DXC, DXYN, EA, EARN, EB, EBS, ECOL, ECOM, ED, EDIT, EFC, EGLE, EIGI, EIGR, ELA, ELOX, EMAN, EML, ENDP, ENG, ENV, EOG, EPAM, EPAY, ESGR, ESTE, EVA, EVBG, EVC, EVH, EVOK, EVOP, EVRG, EXEL, EYE, EYEG, EYPT, FARM, FAT, FC, FFG, FGEN, FLDM, FLL, FLO, FLS, FLT, FNKO, FOCS, FOLD, FOR, FOUR, FRT, FVE, FWONA, FWONK, GBT, GDEN, GDP, GDYN, GEL, GEN, GERN, GH, GKOS, GLIBA, GLP, GLPG, GLUU, GLYC, GM, GNL, GOLD, GOOS, GOVX, GPRO, GPX, GRPN, GSBD, GTN, GTN.A, GTYH, HALL, HASI, HBI, HBIO, HCFT, HCI, HDSN, HEAR, HFC, HHC, HII, HLF, HMHC, HMTV, HSKA, HSON, HUBS, HWCC, HZN, IAC, IBP, ICAD, ICFI, ICUI, IDCC, IGMS, IHC, IIVI, IMH, IMMR, IMRA, IMUX, INCY, INFN, INMB, INSG, INVE, IOVA, IRCP, IRM, IRTC, IRWD, ITP, IVR, JAX, JHX, JJSF, JYNT, KALA, KDMN, KDNY, KELYA, KELYB, KIM, KL, KODK, KOP, KRO, KRP, KRTX, KURA, KWR, LAMR, LASR, LAUR, LCUT, LEU, LGF.A, LGF.B, LIN, LIVX, LMNX, LNTH, LOMA, LOPE, LPTH, LSI, LSPD, LSXMA, LSXMB, LSXMK, LTHM, LXP, LXU, LYV, MAC, MAIN, MANT, MAXR, MCHP, MDP, MEIP, MGEN, MGTX, MGY, MIDD, MITK, MLCO, MMI, MNPR, MNRL, MNST, MNTX, MOD, MR, MRAM, MRIN, MSC, MSON, MT, MTD, MTSI, MUR, MXL, MYOS, NAVB, NBLX, NCLH, NCSM, NEPH, NET, NEWR, NFG, NGS, NH, NINE, NKSH, NKTR, NL, NLOK, NLSN, NMIH, NMRK, NMTR, NNA, NNBR, NNI, NOMD, NRG, NRP, NS, NSA, NTLA, NTRA, NUZE, NVAX, NVCN, NVIV, NVRO, NVTA, NWGI, NWLI, NWN, NWS, NWSA, NXST, NYMT, NYT, OBSV, OCUL, ODP, OEC, OFIX, OGE, OLP, ONCT, ONVO, OTEX, OTRK, OYST, PAE, PANL, PAR, PBA, PBH, PBPB, PBYI, PCTI, PCTY, PCYG, PCYO, PDEX, PDFS, PDSB, PEIX, PESI, PETQ, PFSI, PGNY, PGTI, PH, PHI, PK, PLM, PLNT, PLUG, PMT, PNRG, PPL, PRA, PRAA, PRDO, PRMW, PROF, PRTK, PRVB, PS, PSNL, PTI, PTMN, PTON, PVAC, PZZA, QTRX, QUOT, RBA, RCKT, RDFN, RDUS, RDVT, REFR, REG, REGI, REGN, REZI, RFP, RGA, RGEN, RIBT, RIGL, RMAX, RMNI, RNET, ROKU, RP, RRGB, RSG, RTRX, RUN, SAGE, SAIL, SATS, SB, SBH, SBPH, SBR, SBRA, SCPL, SCU, SEAS, SEEL, SELB, SFE, SHI, SHO, SHYF, SIC, SIGA, SKT, SLQT, SLRC, SP, SPCE, SPNS, SPRO, SQ, SQFT, SRCL, SRE, SRG, SRLP, SRPT, SRTS, SSSS, STAG, STFC, STKS, STMP, STNG, STOR, STRA, STWD, SUNS, SUPV, SVM, SVMK, SVRA, SWCH, SYBX, SYNA, SYRS, TAST, TBPH, TCPC, TCX, TDC, TECH, TEVA, TFFP, TGI, TGS, THM, THR, THS, TIPT, TM, TMUS, TMX, TNAV, TNDM, TPIC, TPRE, TPVG, TR, TREE, TRGP, TRIP, TRUE, TRXC, TSE, TTD, TTWO, TVTY, TWI, TWNK, UBER, UE, UEIC, UEPS, UGP, UIHC, UPLD, USPH, UTZ, UVV, VBFC, VCEL, VER, VG, VGR, VIAV, VIVE, VMC, VNTR, VRAY, VRRM, VRTU, VRTV, VSAT, VSTO, VTGN, VYNE, WCC, WLDN, WLL, WMC, WMS, WNC, WRK, WSC, WTRH, WWR, WWW, XCUR, XERS, XFOR, XLRN, XNCR, XONE, XPO, XRAY, XXII, YELP, YETI, YMAB, YORW, YPF, YTRA, Z, ZEUS, ZG, ZIOP, ZTS\n\n - Ex-div:\n\n  AFB, BCBP, BCO, BMRC, BP, BPFH, BSBR, CEQP, CFFN, CIT, CMCO, CMS, CTAS, CXO, DCOM, DHF, DKL, EDF, EDI, ET, ETN, FCBC, FCF, FE, FHI, FIBK, FRAF, FRBA, FSBW, GMLP, GPP, HMST, HSII, HTBK, HWKN, IBTX, INTC, JBHT, LBC, LW, MC, MMLP, MMP, MPLX, NBLX, NGL, NS, NSC, NXST, NYCB, OPBK, PFE, PH, PNFP, PPBI, RBNC, RELL, SBFG, SIRI, SRLP, STZ, STZ.B, SUN, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.000%)\n    - 8-Week Bill Auction (previous: 0.085%)\n    - Challenger Job Cuts (previous: 118.804K)\n    - Challenger Job Cuts (previous: 118.804K)\n    - Challenger Job Cuts (previous: 185.9%)\n    - Continuing Jobless Claims (consensus: 7,200K, previous: 7,756K)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Initial Jobless Claims (consensus: 732K, previous: 751K)\n    - Jobless Claims 4-Week Avg. (previous: 787.75K)\n    - Natural Gas Storage (consensus: 37B, previous: 29B)\n    - Nonfarm Productivity (consensus: 5.6%, previous: 10.1%)\n    - Unit Labor Costs (consensus: -11.5%, previous: 9.0%)\n\n^^^^2020-11-04",
        "created_utc": 1604487616,
        "id": "gb3ss47",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1604516416.0
    },
    {
        "author": "dareftw",
        "body": "It’s pretty true. I have a BS in Economics and an MA in applied economics and an MQM (Masters in Quantitative Management) as well. And the first question people ask when they find out what I did in college is about the economy and stocks. And it’s a dumb question and they don’t even realize it. Like I spent years learning about scarcity and a bunch of basically applied calculus and statistics. \n\nUnless I work directly for a brokerage I wouldn’t have enough time to make an informed decision any one way or the other, and even then it would only be a best estimate and one with enough of a likely chance to not be correct that it would be pretty irresponsible to give an opinion on it. \n\nI can fully do the math behind it sure, but the stock market has proven time and time again that it’s irrational and not really predictable with any algorithm. There is a reason that economic theory even says throwing a dart at a chart of stocks and picking where it lands is just as likely to be accurate than if you picked it based on extensive amounts of DD and research. \n\nBut I just point people towards index’s, tell them if they aren’t retiring in the next 5 years don’t be afraid or worried that the stock market drops every now and then etc etc. \n\ntl;dr Economists don’t study the economy they study scarcity. I’d be extremely skeptical of any economist claiming to know what the market will do or that they have figured out the stock market. We exist to do small scale data analysis, or to advise large scale economic moves aka monetary/fiscal policy, we aren’t adept at guessing small movements within certain markets. And if we’re in a spot where we can then we are also in a spot where the sec would have something to say if we profited off it.",
        "created_utc": 1604436008,
        "id": "gb1jcz6",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1604464808.0
    },
    {
        "author": "submarine-observer",
        "body": "I understand China = bad on Reddit. But basically Jack Ma wants Ants financial to act like a bank without the banking regulations. He is bloodsucker worse than Jeff Bezos.",
        "created_utc": 1604420121,
        "id": "gb0lrf9",
        "score": 14,
        "subreddit": "investing",
        "created": 1604448921.0
    },
    {
        "author": "beyondarmonia",
        "body": "Jack Ma was an English teacher 😅",
        "created_utc": 1604427292,
        "id": "gb110eu",
        "score": 12,
        "subreddit": "investing",
        "created": 1604456092.0
    },
    {
        "author": "RealisticHumanBot",
        "body": "5M MA crossover, the bulls have won",
        "created_utc": 1604284502,
        "id": "gaux9kw",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1604313302.0
    },
    {
        "author": "vitaq",
        "body": "Ever seen that Elon / Jack Ma interview? Cringe worthy",
        "created_utc": 1604420942,
        "id": "gb0nhni",
        "score": 10,
        "subreddit": "investing",
        "created": 1604449742.0
    },
    {
        "author": "stonkpicks",
        "body": "Jack Ma vs Elon Musk. Clearly Elon is crushing it today",
        "created_utc": 1604427926,
        "id": "gb12cm5",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1604456726.0
    },
    {
        "author": "swolking",
        "body": "Jack Ma is literally one of us and you should buy the dip to support him.\n\n “As the Chinese like to say, if you borrow 100,000 yuan from the bank, you are a bit scared; if you borrow a million yuan, both you and the bank are a little nervous; but if you take a 1 billion yuan loan, you are not scared at all, the bank is,” Ma said. ",
        "created_utc": 1604427637,
        "id": "gb11qol",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1604456437.0
    },
    {
        "author": "bad_ass_blunts",
        "body": "In a way, yes.\n\nMany wealthy businessmen in China are charged with crimes.\n\nJack Ma is the useful kind of capitalist that won't step too much on the PRC's toes, and can serve as an ambassador for China's state capitalism.",
        "created_utc": 1604422610,
        "id": "gb0r1lo",
        "score": 7,
        "subreddit": "investing",
        "created": 1604451410.0
    },
    {
        "author": "wvwvvwvvvw",
        "body": "Have you watched the video with him and Elon? Jack ma is literally retarded",
        "created_utc": 1604442729,
        "id": "gb1x9q1",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604471529.0
    },
    {
        "author": "rightovahere",
        "body": "Lmao Jack Ma really went off and started talking shit to the Chinese Govt right before his IPO? That's a big dick move right there.\n\nI might get back into BABA with this wild dip. Earnings coming up too",
        "created_utc": 1604430020,
        "id": "gb16r4s",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604458820.0
    },
    {
        "author": "coldhamm",
        "body": "Jack Ma got caught in a sex scandal with 5 Taiwanese lads",
        "created_utc": 1604420161,
        "id": "gb0ludg",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604448961.0
    },
    {
        "author": "HotStockSlinger",
        "body": "Jack Ma is going to have a mysterious accident soon.",
        "created_utc": 1604422005,
        "id": "gb0prac",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604450805.0
    },
    {
        "author": "Cyrusis",
        "body": "They (Chinese regulators) are showing Jack Ma who is boss. It’s a joke.",
        "created_utc": 1604443867,
        "id": "gb1ziqx",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604472667.0
    },
    {
        "author": "Furloughedinvester",
        "body": "Couldn't Uncle Ma Ma keep his mouth shut till AFTER the damn ipo??",
        "created_utc": 1604462577,
        "id": "gb2x5xo",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604491377.0
    },
    {
        "author": "VaginalDischarge",
        "body": "Wish I could roll Jack Ma up into a little ball like in the cartoons and dunk him in an over the door Nerf hoop right about now.",
        "created_utc": 1604428507,
        "id": "gb13kk6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604457307.0
    },
    {
        "author": "Stlblues1516",
        "body": "Technically MasterCard and visa are in the technology sector.",
        "created_utc": 1604354341,
        "id": "gaxwffw",
        "score": 5,
        "subreddit": "stocks",
        "created": 1604383141.0
    },
    {
        "author": "drrbillionaire",
        "body": "curfews occurring in MA again. other states might follow. lockdowns in EU already. is it time to get calls on ZM or wait until the EOW?",
        "created_utc": 1604349743,
        "id": "gaxmzz6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604378543.0
    },
    {
        "author": "shivdvm",
        "body": "BABA’s Jack Ma is the Chinese equivalent to Musk.... Innovating and talking shit w/ the govt and ramping up volatility. Here hoping today was just his version of “price to high IMO”",
        "created_utc": 1604442592,
        "id": "gb1x00b",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1604471392.0
    },
    {
        "author": "cariusQ",
        "body": "Who the fuck upvoted you?\n\nThis is most batshit insane comment I have read about Ma.",
        "created_utc": 1604437297,
        "id": "gb1m5cz",
        "score": 4,
        "subreddit": "investing",
        "created": 1604466097.0
    },
    {
        "author": "flyedchicken",
        "body": "Jack Ma made big China mad",
        "created_utc": 1604421815,
        "id": "gb0pchg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604450615.0
    },
    {
        "author": "ImNoAlbertFeinstein",
        "body": "\"ANT would not be systemic risk to Chinese economic system because China does not have a system.\"\n-Jack Ma",
        "created_utc": 1604420333,
        "id": "gb0m77p",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604449133.0
    },
    {
        "author": "BlackcockInvestments",
        "body": "They got my boy jack ma, free ma!",
        "created_utc": 1604370849,
        "id": "gayr2mv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604399649.0
    },
    {
        "author": "donefukupped",
        "body": "Ma is already on a leash. Cannot escape China with his momey. He cannot leave the county with his family.",
        "created_utc": 1604380614,
        "id": "gaz6zla",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604409414.0
    },
    {
        "author": "Technoho",
        "body": "Nio done incredible today when u consider every other China stock is heavy red thanks to Jack Ma spanking",
        "created_utc": 1604417911,
        "id": "gb0h8ki",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604446711.0
    },
    {
        "author": "rluo92",
        "body": "Don't get me wrong, more power to any of you who made money off of NIO or BABA or any other Chinese companies, but if any of yall retards are still surprised that this is happening, you deserve to lose money if you did. This is why, as appealing as any Chinese companies seems, I personally don't touch them since the government can literally fuck you in the ass anytime.\n\nThis shit happened cause Ma said some non PC stuff regarding the country, if you piss off the govt in anyway, you will burn for it, any of the big companies in china needs approval from the govt to be successful in any major form, and they can take that opportunity from you just as quickly as when they first gave it to you.\n\nGood luck guys.",
        "created_utc": 1604425849,
        "id": "gb0xxll",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604454649.0
    },
    {
        "author": "txrazorhog",
        "body": "That was his other cousin Lo Ma, using Albert's handle.  He's dyslexic.",
        "created_utc": 1604421545,
        "id": "gb0orwc",
        "score": 3,
        "subreddit": "investing",
        "created": 1604450345.0
    },
    {
        "author": "cafenegroporfa",
        "body": "jack ma was just blitzed on scorpion liquor",
        "created_utc": 1604469841,
        "id": "gb38l7v",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604498641.0
    },
    {
        "author": "Dmoan",
        "body": "Not about power but about greed they likely want Jack ma to throw all commie party member couple billion. How do you think so many communist party officials have condos in NY, Toronto and London",
        "created_utc": 1604440977,
        "id": "gb1tstk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604469777.0
    },
    {
        "author": "throwaway__3012",
        "body": "The issue is the Chinese govt is retaliating against jack ma after he criticized the govt. I think they might shut down the ipo for longer or not let it go through",
        "created_utc": 1604425376,
        "id": "gb0wwzl",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604454176.0
    },
    {
        "author": "yeahman64",
        "body": "Grapefruit and MasterCard calls for December.",
        "created_utc": 1604354737,
        "id": "gaxx82g",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604383537.0
    },
    {
        "author": "ImmigrantInvester",
        "body": "But he is an idiot though. Checkout his interview with Elon Musk. It hurts so much to watch Ma being an idiot. He however has good connection with CCPA and uses slave labor for his Alibaba. He even stole the name from the people who he enslaves with the help of CCPA.",
        "created_utc": 1604428866,
        "id": "gb14bix",
        "score": 3,
        "subreddit": "investing",
        "created": 1604457666.0
    },
    {
        "author": "ForgotUsername98767",
        "body": "Real key issue:\n\n-Jack Ma criticized the gouvernment and system too hard for once and CCP decided to send a warning\n\nChinese companies work because the CCP allows it. They can randomly pump 10% and lose 10% according to the whims of the communist party. Nobody here should forget that.",
        "created_utc": 1604427111,
        "id": "gb10mg6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604455911.0
    },
    {
        "author": "miaomiaomiao",
        "body": "Chinese government needs the innovation that Jack Ma's companies have provided, and Jack Ma needs a non-hostile Chinese gov that allows him to expand his businesses. I'm sure they will figure it out together because it will advantage them both.",
        "created_utc": 1604427971,
        "id": "gb12g1g",
        "score": 3,
        "subreddit": "investing",
        "created": 1604456771.0
    },
    {
        "author": "send_the_gnar",
        "body": "MA checking in happy to vote for ranked choice in future elections. fingers crossed here",
        "created_utc": 1604437741,
        "id": "gb1n1q0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604466541.0
    },
    {
        "author": "RationallyXuberant",
        "body": "#WELP\n\nhttps://www.bloomberg.com/news/articles/2020-11-04/china-is-planning-a-bigger-ant-crackdown-with-bank-funding-curbs-kh2wr8pb\n\n&gt; The shock suspension of Ant Group Co.’s $35 billion initial public offering is just the beginning of a renewed campaign by China to rein in the fintech empire controlled by Jack Ma, Bloomberg reports.\n\n&gt; Authorities are now setting their sights on Ant’s biggest source of revenue: its credit platforms that funnel loans from banks and other financial institutions to millions of consumers across China, according to people familiar with the matter.",
        "created_utc": 1604465062,
        "id": "gb31asv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604493862.0
    },
    {
        "author": "Shorter_McGavin",
        "body": "Nope.  Source: My wife is a teacher in MA",
        "created_utc": 1604356307,
        "id": "gay0bu1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604385107.0
    },
    {
        "author": "longGERN",
        "body": "Wanna play mastercard dip, maybe march 320 or Jan 310",
        "created_utc": 1604271994,
        "id": "gauahon",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604300794.0
    },
    {
        "author": "dr_vegapunk",
        "body": "I think this is Xi just making sure Ma knows who's the boss.",
        "created_utc": 1604380890,
        "id": "gaz7czh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604409690.0
    },
    {
        "author": "throwaway__3012",
        "body": "I might buy in but this might be China trying to fuck ma",
        "created_utc": 1604420943,
        "id": "gb0nhr6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604449743.0
    },
    {
        "author": "cocococopuffs",
        "body": "If anyone’s wondering why BABA ANT financial is being suspended in China it’s because lately Jack Ma been talking a lot of shit about China’s banking system and bad mouthing the government and calling their system fraud. Alipay has also been offering services he government has deemed illegal. \n\nThis shit ain’t going through",
        "created_utc": 1604421479,
        "id": "gb0omve",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604450279.0
    },
    {
        "author": "Pablo_Sumo",
        "body": "I saw that one.  I think Ma was smoking something on that day.\nI saw lots of ma's talks and interviews he never talked like that before.",
        "created_utc": 1604441248,
        "id": "gb1ucf7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604470048.0
    },
    {
        "author": "ZillionMidi",
        "body": "I love when people make this argument because it has absolutely zero logic at all. If anything the electoral college creates herd mentality because of the winner take all aspect to it and it lowers voter turnout. Republican votes in MA, NY, and CA don’t matter. If we switched to a popular vote then republicans in California would have their vote matter.",
        "created_utc": 1604478833,
        "id": "gb3jzs4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604507633.0
    },
    {
        "author": "canadianformalwear",
        "body": "Did a google search, Jack Ma isn’t in a gulag somewhere so, all in BABA calls.",
        "created_utc": 1604418904,
        "id": "gb0j7v7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604447704.0
    },
    {
        "author": "BenjaminGunn",
        "body": "Fuck you Jack Ma get in there and suck some commie dick like my calls depend on it!!!",
        "created_utc": 1604444928,
        "id": "gb21kjf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604473728.0
    },
    {
        "author": "PajeetScammer",
        "body": "Have you ever seen the Elon + Jack Ma interview? Not sure if it was a language barrier thing but Ma seemed genuinely retarded. \n\nAll success in China is based on nepotism and scamming",
        "created_utc": 1604434798,
        "id": "gb1gqoh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604463598.0
    },
    {
        "author": "usingthisonthetoilet",
        "body": "Bigger than PayPal though, it’s like a MasterCard and Financial services company had a baby",
        "created_utc": 1604426537,
        "id": "gb0zety",
        "score": 2,
        "subreddit": "investing",
        "created": 1604455337.0
    },
    {
        "author": "lifesaboxofchoco",
        "body": "Yeah I really think it's a good value to buy now but then I don't know if there's still other \"punishment\" awaiting since Jack Ma criticised them so bluntly last week. It' s a solid company though aside from the politic factors",
        "created_utc": 1604429578,
        "id": "gb15t4u",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604458378.0
    },
    {
        "author": "lifesaboxofchoco",
        "body": "It's utterly ridiculous how this has been planned and approved for months, the IPO subscription is completed with many retail and institutional investor subscribed with margin borrowing, and then China just suddenly decide to change the regulation and pull the plug 2 days before the IPO.\n\nWhat a coincidence that this sudden decision was made a week after Jack Ma gave a long blunt criticism about China's current financial system and regulations in a financial forum in Shanghai, in front of hundreds of bankers and regulators. You really don't want to piss the Chinese authority man.",
        "created_utc": 1604429203,
        "id": "gb150si",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604458003.0
    },
    {
        "author": "raiderkev",
        "body": "Jack Ma shitted on Gyna. Now he has to go to reeducation camp and ANT IPO cancelled",
        "created_utc": 1604431360,
        "id": "gb19i4y",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604460160.0
    },
    {
        "author": "whatshisuserface",
        "body": "how do you translate “fell out of a window” from russian to chinese? because jack ma might fall out of a window soon",
        "created_utc": 1604431967,
        "id": "gb1arwr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604460767.0
    },
    {
        "author": "kg9936",
        "body": "Checking in from Eastern MA. Also found out on WSB",
        "created_utc": 1604366066,
        "id": "gayien4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604394866.0
    },
    {
        "author": "shehatezme1",
        "body": "CCP fucking BABA over Jack Ma comments on China monetary policies is all you need to know about power",
        "created_utc": 1604419194,
        "id": "gb0jtfq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604447994.0
    },
    {
        "author": "Zonked420",
        "body": "Jack Ma ANT gang in shambles",
        "created_utc": 1604421301,
        "id": "gb0o96a",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604450101.0
    },
    {
        "author": "Cj96734",
        "body": "jack ma opened his fat mouth and criticized gyna. now ant ipo on hold, or off the table",
        "created_utc": 1604426861,
        "id": "gb103gb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604455661.0
    },
    {
        "author": "nightfucker",
        "body": "What did Ma say?",
        "created_utc": 1604415963,
        "id": "gb0ddp3",
        "score": 2,
        "subreddit": "investing",
        "created": 1604444763.0
    },
    {
        "author": "jimmbean",
        "body": "MA and MI both implementing stronger virus measures/curfews. Yup this thing is gonna tank when all the other blue states follow after Tuesday.",
        "created_utc": 1604346697,
        "id": "gaxgm4j",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604375497.0
    },
    {
        "author": "ChrisBattles",
        "body": "How is it misinformation? I'm guessing the title included the reference to Canoo to describe the relevance to this sub. And, it's good info.\n\nSame for the past info that Jack Ma had sought out Canoo.\n\nNot all info is an attempt to manipulate stock prices. Get a grip.",
        "created_utc": 1604366973,
        "id": "gayk15s",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1604395773.0
    },
    {
        "author": "-Mr_Unknown-",
        "body": "No honey... because Ma is desperately pushing Ant as a Tech company and CCP just told him “lol, no. You are a financial institution and will be regulated accordingly, by the way, you don’t meet half the requirements as such.”",
        "created_utc": 1604437182,
        "id": "gb1lwei",
        "score": 2,
        "subreddit": "investing",
        "created": 1604465982.0
    },
    {
        "author": "wdcvvv",
        "body": "Not as high as Jack Ma",
        "created_utc": 1604469800,
        "id": "gb38j4u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604498600.0
    },
    {
        "author": "Jarlaxle_rigged_it",
        "body": "its still below its 100day ma.. wouldnt go near it until its back above \\~3300.",
        "created_utc": 1604351764,
        "id": "gaxr7e2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604380564.0
    },
    {
        "author": "shagagav",
        "body": "Jack ma don’t fuck me tm bb!!",
        "created_utc": 1604458426,
        "id": "gb2pp7x",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604487226.0
    },
    {
        "author": "meetmyphantoms",
        "body": "Jack Ma curse strikes again",
        "created_utc": 1604454869,
        "id": "gb2je3r",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604483669.0
    },
    {
        "author": "mcramalot",
        "body": "Fuck jack ma and his stupid mouth",
        "created_utc": 1604414447,
        "id": "gb0aj5f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604443247.0
    },
    {
        "author": "bad_ass_blunts",
        "body": "They criticize privately, or publicly with under the table permission.\n\nMa does have an interesting history of working abroad but seems more likely a tool than an insurrectionary.",
        "created_utc": 1604422749,
        "id": "gb0rc5k",
        "score": 2,
        "subreddit": "investing",
        "created": 1604451549.0
    },
    {
        "author": "Buildsoc",
        "body": "This guy whining about what others are doing has to be the biggest snowflake move ever on a stock message board 😂Wah,...other people are being too politically correct Wah😂 ma feels",
        "created_utc": 1604268996,
        "id": "gau4qsd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604297796.0
    },
    {
        "author": "Technoho",
        "body": "Nah Jack Ma just publicly chatted shite about Chinese state banks and they can't have their top business magnate doing that sorta stuff",
        "created_utc": 1604435291,
        "id": "gb1hsuq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604464091.0
    },
    {
        "author": "Myther6",
        "body": "Spot just chilling below that 30 day MA. Cmon baby lets go down",
        "created_utc": 1604331663,
        "id": "gawkthy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604360463.0
    },
    {
        "author": "LlamaPajamasBanana",
        "body": "TSLA weekly FD’s. Amirite\n\nShits trading at 69 day ma. Fuckin no brainer boys.",
        "created_utc": 1604366528,
        "id": "gayj8c3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604395328.0
    },
    {
        "author": "Game__0n",
        "body": "[Callaway to Merge with TopGolf](https://www.reuters.com/article/topgolf-ma-callaway-golf-idUKL4N2HI4PH)",
        "created_utc": 1604367572,
        "id": "gayl3qs",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1604396372.0
    },
    {
        "author": "longGERN",
        "body": "MA $320c gang?",
        "created_utc": 1604331157,
        "id": "gawjsmz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604359957.0
    },
    {
        "author": "EmptyLevel",
        "body": "i’m a retard but v and ma been giving me boomer vibes lately",
        "created_utc": 1604398126,
        "id": "gazpgy8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604426926.0
    },
    {
        "author": "TimCooksButtBuddy",
        "body": "Why cant i deposit $ into my Draftkings in MA for DFS?  I just downloaded this shit since i bought 500 shares last week. I know the sportsbook is off limits but i should be able to deposit for dfs",
        "created_utc": 1604241765,
        "id": "gasnuej",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604270565.0
    },
    {
        "author": "New_Great",
        "body": "More than 50% of the companies currently listed will likely go to zero in your lifetime. Saying Amazon can't fail likely means there are other investors that share your same attitude, not only is that incorrect but it is priced in. You can draw the same conclusion throughout history with companies like exxon, general electric, ma bell, how could they lose and they did.\n\nAlso, Amazon is great i own a lot. I did make a weighted bet and I do agree no more than 10% per company.",
        "created_utc": 1604415937,
        "id": "gb0dbuw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604444737.0
    },
    {
        "author": "abcomputer",
        "body": "Jack Ma criticized China's stock exchange. Shit might just go down hard.",
        "created_utc": 1604414936,
        "id": "gb0bfo2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604443736.0
    },
    {
        "author": "Boomtown626",
        "body": "Ant Group statement on CNBC: Apologies to investors for inconvenience, will wait for regulators' further notice for future developments. \n\nBest case scenario imo: Jack Ma has been humbled and embarrassed. Chinese government makes its point, eventually this comes back around. When that happens, we see the green twin to today's red candle.",
        "created_utc": 1604414675,
        "id": "gb0ay5o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604443475.0
    },
    {
        "author": "djrocks420",
        "body": "Is Ma part of everything in china?...",
        "created_utc": 1604417713,
        "id": "gb0guda",
        "score": 1,
        "subreddit": "investing",
        "created": 1604446513.0
    },
    {
        "author": "datacanbeuseful",
        "body": "Ma got carried away. He could be the next top 10 richest Chinese behind bars.",
        "created_utc": 1604418146,
        "id": "gb0hpno",
        "score": 1,
        "subreddit": "investing",
        "created": 1604446946.0
    },
    {
        "author": "longGERN",
        "body": "Is MA Jan 320c a hold",
        "created_utc": 1604418771,
        "id": "gb0iy72",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604447571.0
    },
    {
        "author": "3250feralhogs",
        "body": "What is with these dudes like Ma and the Twitter guy running two companies? Is the job of CEO that un-taxing that you can run two major corporations at once?",
        "created_utc": 1604419462,
        "id": "gb0kdkm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604448262.0
    },
    {
        "author": "EmbiidWeTrust",
        "body": "Fuck China man. Ma you can come to TrumpMerica and make some money",
        "created_utc": 1604419873,
        "id": "gb0l8l1",
        "score": 1,
        "subreddit": "investing",
        "created": 1604448673.0
    },
    {
        "author": "Au_contraire_zippy",
        "body": "wtf are you talking about? I was asking about the 52 week Moving Average (MA) setting he is using, genius. \n\nget back in your cage.",
        "created_utc": 1604410221,
        "id": "gb039n6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604439021.0
    },
    {
        "author": "wilstreak",
        "body": "It has been suspended.\n\nhttps://www.bloomberg.com/news/articles/2020-11-03/jack-ma-s-ant-group-ipo-suspended-by-shanghai-star-board",
        "created_utc": 1604410336,
        "id": "gb03g5u",
        "score": 1,
        "subreddit": "investing",
        "created": 1604439136.0
    },
    {
        "author": "KiloGrah4m",
        "body": "No dude. \n\nBiggest IPO in the world, China trying to build their stock market, need to look like it's regulated and they care.\n\nThey are going to have Jack Ma on TV just like those americans have the Zucker and Hobo Jack on TV.",
        "created_utc": 1604410189,
        "id": "gb037vv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604438989.0
    },
    {
        "author": "ace425",
        "body": "Knowing the Chinese, they'll find a way to seize the company and have him replaced with someone willing to toe the party line instead of outright destroying the company. If they outright fucked over one of the single largest Chinese companies in existence it would destroy international trust and investment in Chinese firms for a long time to come. They aren't that stupid. They'll find a way to make Ma bend to their will, or they'll hand the company over to someone else. Then the IPO will move forward.",
        "created_utc": 1604425724,
        "id": "gb0xnxy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604454524.0
    },
    {
        "author": "Cj96734",
        "body": "yeah, that was dumb of ma to pop off like that, but still think the ipo goes thru",
        "created_utc": 1604425591,
        "id": "gb0xdrx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604454391.0
    },
    {
        "author": "mollyhollygolly",
        "body": "Not unless Jack Ma wants to get invited back for “tea”",
        "created_utc": 1604411354,
        "id": "gb052yj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604440154.0
    },
    {
        "author": "shagagav",
        "body": "Jack ma throw some lube on plz",
        "created_utc": 1604427173,
        "id": "gb10r6b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604455973.0
    },
    {
        "author": "dbergkamp10",
        "body": "Jack Ma didn’t kiss the ring and called the banks pawnshops. This looks awful for China and HK for foreign investors who they want to IPO versus NYSE. Expect him to publicly apologize. Goes live next Tuesday. Too many investors with too much tied up capital.",
        "created_utc": 1604430500,
        "id": "gb17pkz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604459300.0
    },
    {
        "author": "-xMrMx-",
        "body": "Ma is one of the dumbest people I have ever heard speak. Puts on Gina",
        "created_utc": 1604461300,
        "id": "gb2uwcs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604490100.0
    },
    {
        "author": "firstonesnotfree",
        "body": "It’s not about the language, but the conversation surrounding AI and other technological improvements. That conversation was laughable.\n\nAgreed that Jack Ma is a very smart person, when it relates to business. Of course, AliBaba isn’t a “new” idea. It’s just Amazon copy pasted in China.",
        "created_utc": 1604458185,
        "id": "gb2p9pc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604486985.0
    },
    {
        "author": "voodoodudu",
        "body": "I heard Ma said something to piss off the govt. Anyone know what he said?",
        "created_utc": 1604457171,
        "id": "gb2ngiw",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1604485971.0
    },
    {
        "author": "deah12",
        "body": "Ma pissed off the CCP seriously",
        "created_utc": 1604486203,
        "id": "gb3rd58",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604515003.0
    },
    {
        "author": "HotStockSlinger",
        "body": "Will BABA go up or down if Jack Ma disappears suddenly?",
        "created_utc": 1604432960,
        "id": "gb1cv0c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604461760.0
    },
    {
        "author": "miaomiaomiao",
        "body": "Why does this affect BABA?\n\n - Alibaba purchased a 33% stake in Ant Group in 2018\n - Alibaba uses Alipay\n - Jack Ma is founder of both companies\n\nOnly the first one should affect the value of BABA stock, right?",
        "created_utc": 1604413305,
        "id": "gb08g6e",
        "score": 1,
        "subreddit": "investing",
        "created": 1604442105.0
    },
    {
        "author": "ntipMIRV",
        "body": "Look at that clear breakout, this bitch does not want to visit 20d ma.",
        "created_utc": 1604220730,
        "id": "garxf8s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604249530.0
    },
    {
        "author": "Sablac",
        "body": "Didnt MA report earnings last wednesday?",
        "created_utc": 1604232582,
        "id": "gasazog",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604261382.0
    },
    {
        "author": "darkrood",
        "body": "My dad withdrawal my foreign saving that i've saved up since I was little.\n\nHe also got the nerve going around telling everyone that \"I want ma son to grow and not rely on inheritance.\"\n\nFuck you pop, you didn't even pay for my elementary school.",
        "created_utc": 1604222293,
        "id": "garzdni",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604251093.0
    },
    {
        "author": "tirth__p",
        "body": "lol all MA just went green",
        "created_utc": 1604284910,
        "id": "gauxz3o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604313710.0
    },
    {
        "author": "fredczar",
        "body": "Why do we always assume that there’s some form of conspiracy going on with anything China does. If anything, China is a huge supporter of Ma. Pretty sure the IPO will go through in the future.",
        "created_utc": 1604443559,
        "id": "gb1yx29",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604472359.0
    },
    {
        "author": "westtownie",
        "body": "next year.  Chinese banks are butt hurt because Ant only has 2% of its loans on its balance sheet when traditional banks have to carry 30% and apparently Jack Ma pissed off  some people in the party and now Ant is being investigated",
        "created_utc": 1604435593,
        "id": "gb1ig6f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604464393.0
    }
]