[
    {
        "author": "visvya",
        "body": "I know Etsy just switched over to Google Cloud. Verizon, Salesforce, Spotify, and a number of other companies use them too. [Here's a list](https://cloud.google.com/customers/).",
        "created_utc": 1587005445,
        "id": "fnjrpme",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1587034245.0
    },
    {
        "author": "thisrich",
        "body": "I too work in B2B Saas. You’re an idiot. alteryx is the fucking shit. Go try to pull data from Salesforce and SAP and make it play nice without an army of developers shitting themselves over the course of a month - as opposed to an afternoon with Alteryx.",
        "created_utc": 1586834891,
        "id": "fncemj8",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1586863691.0
    },
    {
        "author": "InsertOffensiveWord",
        "body": "This, and Uber's gross margin is still 49%.  Not as high as some SaaS (CRM, for example, is at 75%), but it's still a tech company. It scales (with the additional help you mention).",
        "created_utc": 1588123288,
        "id": "fownhlo",
        "score": 5,
        "subreddit": "investing",
        "created": 1588152088.0
    },
    {
        "author": "BananaSuitGoat",
        "body": "EVERYONE BUY SALESFORCE NOW! GOING UP 73%.",
        "created_utc": 1586210011,
        "id": "fmmq8zd",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586238811.0
    },
    {
        "author": "msimp000",
        "body": "How the fuck is $CRM $CNVA and $UBER fucking green right now, what world am I living in?",
        "created_utc": 1587407854,
        "id": "fo08cmi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587436654.0
    },
    {
        "author": "strikezero2",
        "body": "It's about one tenth in size of the big boys.\n\nThere are multiple stocks in that category. ADBE, CRM, PYPL, NVDA, SAP, INTC, CSCO, ORCL. \n\nSurely a huge tech success story, but not close to FAAMG in importance.",
        "created_utc": 1587759934,
        "id": "foh2yz3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587788734.0
    },
    {
        "author": "toshi_g",
        "body": "TTD/TWLO/NOW/OKTA/DOCU/SQ/MDB\n\nAny SaaS essentially\n\nOr things like AAPL/MSFT/V/MA/FB/AMZN/GOOG/CRM/PYPL/NFLX/NVDA/ADBE if you want mega caps\n\nIf you want ETF MGK and VUG",
        "created_utc": 1587846842,
        "id": "fokq6p2",
        "score": 3,
        "subreddit": "stocks",
        "created": 1587875642.0
    },
    {
        "author": "Dyunder",
        "body": "Reminder SALESFORCE has $100 million stake in zoom right now",
        "created_utc": 1587758322,
        "id": "fogy514",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587787122.0
    },
    {
        "author": "MyMyHooBoy",
        "body": "Burn day trade for 47% gains? Edit:64% now\nEdit2: 2 contract Crm call 5/1",
        "created_utc": 1587152904,
        "id": "fnpvsb0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587181704.0
    },
    {
        "author": "CrimsonBrit",
        "body": "I appreciate the thought and effort that went into this write-up, however, you've done quite a bit of due diligence to ultimately pick 80% of the **FAANG** stocks (Facebook ($FB), Amazon ($AMZN), Apple ($AAPL), Netflix ($NFLX); and Alphabet ($GOOG) with Netflix being the one you did not pick in your list of six companies.\n\nEach of the FAANG stocks trades on the Nasdaq exchange and is included in the S&amp;P 500 Index. Since the S&amp;P 500 is a broad representation of the market, where the FAANGs make up about 15% of the S&amp;P 500—a staggering figure considering the S&amp;P 500 is generally viewed as a proxy for the United States economy as a whole,  you have basically just invested in the market as a whole, as stated by /u/Chuckox50.\n\nNot to mention that investing in Berkshire ($BRK.A) is like investing in an index fund of sorts, where Berkshire's \"fund\" also owns positions in Apple (33.9%), Amazon (0.57%), and Johnson &amp; Johnson (0.24%), adding to your positions in those three companies. Additionally, Berkshire owns relatively small positions in the SPDR S&amp;P 500 ETF Trust ([$SPY](https://www.bloomberg.com/quote/SPY:US)) and VANGUARD IX FUN/S&amp;P 500 ETF SHS NEW ([$VOO](https://www.bloomberg.com/quote/VOO:US)) ETFs, which both track the S&amp;P 500 and in turn have positions in some of the companies you have mentioned: Microsoft ($MSFT), Apple, Amazon, Facebook, Berkshire, Johnson &amp; Johnson, and Alphabet.\n\n**That being said, I still think that they are rock-solid choices and I have several of those on my radar and just as many already in my portfolio, and I intend to add to my positions for those companies.**\n\nI am investing for the long-term and currently have a high tolerance for risk, so the majority of the stocks on my lengthy list of about 55 companies on my radar right now are tech.\n\nJust to mention a bunch of them (on top of MSFT, AAPL, GOOG, NFLX, FB, and AMZN):\n\n* Financial: Visa, Mastercard, PayPal, Square\n* Healthcare: JNJ, UnitedHealth, AbbVie, Illumina, InVitae\n* Services: AMZN, Walmart, Disney, Spotfiy\n* Technology (Software): Oracle, Adobe, Salesforce, Shopify, Splunk, Docusign, Twiliio, The Trade Desk\n* Technology (Gaming): Activision Blizzard, Take-Two\n* Technology (Semiconductors): Intel, NVIDIA, AMD, Micron, Teradyne\n* Telecom/Communications: Verizon, AT&amp;T, Cisco\n\nI would like to caution you for your analysis in the write-up in regards to Berkshire. You state that your rationale for Berkshire having a competitive edge post-COVID-19 is simply \"Warren Buffett\". By the time that COVID is on the decline, Buffett will be 90 years old. I think the company can thrive without him, but if your basis for investing in that company for the long-term is a man born in 1930, I think you need to reassess your rationale.",
        "created_utc": 1586786989,
        "id": "fn9xrnw",
        "score": 2,
        "subreddit": "stocks",
        "created": 1586815789.0
    },
    {
        "author": "42337d",
        "body": "all these are on my watch list as well.  the only one i can't really seem to justify is CRM.  i can't get over their insane p/e ratio.  unless they are planning on taking over the world, it is just insane.  their stock will probably keep going up because of course it will, but can explain why investors are throwing money at them when they make 15 cents per share, please enlighten.",
        "created_utc": 1586214152,
        "id": "fmmxuda",
        "score": 2,
        "subreddit": "investing",
        "created": 1586242952.0
    },
    {
        "author": "JB_HotSnakes",
        "body": "$CRM 160c 5/1. Bought one at the end of the day and will get another tomorrow. The stock tanked today on an overreaction to the market, but was still ITM at open. It will recover quickly.",
        "created_utc": 1587522336,
        "id": "fo5cfcp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1587551136.0
    },
    {
        "author": "DividendWarlock",
        "body": "I'm a back office cuck and have never used CRM software before",
        "created_utc": 1587051697,
        "id": "fnldmkw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1587080497.0
    },
    {
        "author": "ss_400401",
        "body": "&gt;That's aggressive my guy.  Love to hear your rationale for how MSFT is gonna clear their ATH so quick.  Azure is a nice bonus but they are losing far more revenue in other areas than Azure can make up for.  (Not disagreeing with your positions btw, actually pretty intrigued ..  keep us updated!)\n\nHere are my reasons to buy LEAPS on MSFT\n\n1. Teams that will eat slacks lunch\n2. JEDI contract will help secure future government contracts and helps further to move the legacy applications from Cobol or whatever language to .Net/ C#\n3. Has Visual studio, .net ( asp.net, c# and vb.net) to compete against java. Also SQL server competes directly with Oracle DB\n4. New Xbox releasing this year\n5. Linked helps during hard times like this\n6. GIT Hub - 60% of the worlds open source software projects are stored on GIT hub\n7. Azure which is the crown jewel and competes with AWS\n8. VR/ AR with Hololens and hardware with surface\n9. I assume they will buy Service now or Sales force since Microsoft Dynamics is not that of a great CRM tool.",
        "created_utc": 1588110843,
        "id": "fow0mti",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588139643.0
    },
    {
        "author": "Jackismyson",
        "body": "Here are my buys and prices. All bottom of technical channel. \n\n&amp;#x200B;\n\n* AAPL - $160\n* ADBE - $150\n* AMD - $30\n* AMZN - $1300\n* AON- $120\n* AVGO - $125\n* AXP - $49.57\n* BABA - $115\n* BAC - $15\n* BLL - $40\n* CDNS - $35\n* CHTR - $275\n* CMG - $325\n* COF - $40\n* COKE - $125\n* COST - $160\n* CRM - $100\n* D - $45\n* DHR - $79.82\n* DIS - $75\n* DXCM $125\n* EL - $105\n* EQIX- $325\n* EXAS - $35\n* FB - $125\n* GIS - $35\n* IRM - $20\n* ISRG - $300\n* JNJ - $75\n* KEYS - $60\n* LHX - $120\n* LOW - $50\n* LRCX - $83.85\n* LUV - $25\n* LYV - $30\n* MAA- $85\n* MAR - $35\n* MDB - $75\n* MSFT - $95\n* NKE - $50\n* NNN- $22\n* NOW - $180\n* NVDA - $150\n* O - $34.76\n* PG - $65\n* PLD - $35\n* RCL - $20\n* SBAC - $175\n* SBUX - $50\n* SNPS - $80\n* SO - $40\n* SPLK - $85\n* SRE - $70\n* T- $25\n* TDG - $150\n* TSLA - $250\n* TSM - $30\n* V - $95\n* VRTX - $125\n* VZ - $30\n* WELL - $20\n* WPC - $35",
        "created_utc": 1586207845,
        "id": "fmmm7fw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586236645.0
    },
    {
        "author": "The_Folkhero",
        "body": "I like social media as a secular play long term so I would say PINS is a good one and possible candidate to get bought by a bigger company. \n\nOn that same social media note, Sprout Social (SPT) IPO'd recently and is trading around 14.00/share. I see social media monitoring as being a good \"pick and shovel\" play in the social media sector. Potential takeover candidate as well (Salesforce, etc?) in my opinion.",
        "created_utc": 1587413316,
        "id": "fo0hnwi",
        "score": 2,
        "subreddit": "stocks",
        "created": 1587442116.0
    },
    {
        "author": "helsinki01",
        "body": "I see CRM as the low hanging fruit. Almost ripe. Ready to drop 50%+ \n\nAdding a few more long expiring Puts tomorrow if it moves above $160",
        "created_utc": 1588125433,
        "id": "fowr7su",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588154233.0
    },
    {
        "author": "jschreiber77",
        "body": "I mean, FDGs top ten holdings are f'n fantastic.  It's a solid expense ratio too.  I've seen ETFs (primarily mutual funds that exceed over 2% for expense ratios -- which is utterly ridiculous).  I personally own shares of XLY -- mainly because I didn't want to shell out $2400 a share for AMZN, but this ETF also has 9 other solid blue chip/growth stocks in it.  AMZN, being it's #1 holding is at nearly 26%.  I was looking into another ETF, ARKW, for the soul purpose of adding a percentage of TSLA and SQ into my portfolio (they offer these holdings at both 9%, respectively.  I'll have to do some additional research on FDG though as it holds TSLA, MA, SAM, WORK, CRM and DOCU (all stocks I don't own).\n\n[https://ipro.americancentury.com/content/ipro/en/products/etfs/fund-list/american-century-focused-dynamic-growth-etf.html](https://ipro.americancentury.com/content/ipro/en/products/etfs/fund-list/american-century-focused-dynamic-growth-etf.html)",
        "created_utc": 1588013651,
        "id": "forka6a",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1588042451.0
    },
    {
        "author": "jinxy0320",
        "body": "Agreed, hiring is frozen among almost all FAANG departments for the rest of the year with the hit being more painful for digital ad-reliant players like Facebook/Google, major players a tier below like Uber/Square/Salesforce are all bleeding cash atm with no clear rebound in sight, and any business largely B2C reliant like Dropbox/Yelp/Uber/Lyft are already planning mass layoffs.",
        "created_utc": 1587771387,
        "id": "fohrrsn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1587800187.0
    },
    {
        "author": "luluwinsteadd13",
        "body": "Honestly a majority of AAPL’s revenue is hardware and during an economic slowdown or uncertainty, I would say stick with it services security, cloud computing, machine learning, analytics, CRM applications..",
        "created_utc": 1587614863,
        "id": "fo9b5f6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1587643663.0
    },
    {
        "author": "bravo_company",
        "body": "Adobe, Salesforce, and other subscription based software aren't going to decline as much as you think. They are locked into multi-year contracts where customers pay license maintenance. They will only get hit where companies are not investing in technologies now and will hit their estimated sales",
        "created_utc": 1586299138,
        "id": "fmqgggp",
        "score": 2,
        "subreddit": "investing",
        "created": 1586327938.0
    },
    {
        "author": "oldprecision",
        "body": "CRM on calls list",
        "created_utc": 1586209995,
        "id": "fmmq7xm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586238795.0
    },
    {
        "author": "Hip-H0pAn0nym0us",
        "body": "So I wanted to start dollar cost averaging into the market, weekly, and I bought shares a few weeks ago in a few companies. I think I timed my buys really well actually. I bought MSFT for $136, CRM for $119, NKE for $61, and MA for $215. However, right after I bought, we had the rally, and prices haven’t really gotten back down to where I first bought in. This has been making me hesitant to continue buying in, because I thought prices would keep falling. Am I making a mistake by not continuing to buy in weekly? Do you think prices will get back down to those levels? I’m worried that next week we’ll have another “bear market rally” and prices won’t get back down to where I’m hoping. But I also realize that they could, it just may take longer than I’m expecting. I also realize that by dollar cost averaging, I should stick to my set buying interval. Maybe weekly was to aggressive and I should do monthly? Thoughts?",
        "created_utc": 1585944948,
        "id": "fmcg0cq",
        "score": 1,
        "subreddit": "investing",
        "created": 1585973748.0
    },
    {
        "author": "LocalForumTr0LL",
        "body": "When are the next earnings releases for the major tech companies like Apple, Google, Salesforce, etc?\n\nIt's not listed on their official Investor Relations part of their sites.",
        "created_utc": 1585873677,
        "id": "fm9pj7q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585902477.0
    },
    {
        "author": "rsilv18",
        "body": "Salesforce",
        "created_utc": 1586054823,
        "id": "fmgq13v",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1586083623.0
    },
    {
        "author": "borntoperform",
        "body": "Salesforce is a behemoth of a company. Ain’t no way Zoom is worth a quarter of CRM.",
        "created_utc": 1586059637,
        "id": "fmgwdw2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586088437.0
    },
    {
        "author": "wizard_1109",
        "body": "I agree Adobe thesis, I don’t see any competition in its niche spaces with amount of service they provide. \n\nI’m still struggling to understand the business of Salesforce and how it’s differentiate itself from other SaaS and how it can maintain its “moat” so to say.",
        "created_utc": 1586479721,
        "id": "fmy7dtp",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1586508521.0
    },
    {
        "author": "ZFickle",
        "body": "States should contract CRM for this sort of work\n\nCalls on CRM?",
        "created_utc": 1586429908,
        "id": "fmvt4zw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586458708.0
    },
    {
        "author": "throwaway60612312412",
        "body": "TD Ameritrade Individual Account: MSFT, SQ, AVGO, BABA, BRK.b, BLK, GS, JPM, V, CRM, TWLO, O, SPG, DIS, CRSP, NRZ, and IXC\n\nVanguard Roth IRA: VTI, VNQ, VGT, BRK.b, MSFT, and BABA\n\nTransamerica 401k: 80% Legal &amp; General S&amp;P 500 and 20% SSgA International Index (shitty options)",
        "created_utc": 1586502123,
        "id": "fmz0rep",
        "score": 1,
        "subreddit": "investing",
        "created": 1586530923.0
    },
    {
        "author": "indrgun",
        "body": "Why no Adobe, Square and Salesforce?",
        "created_utc": 1586545974,
        "id": "fn0oxks",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586574774.0
    },
    {
        "author": "Chuckox50",
        "body": "Baba will be here in twenty years \n\nNetflix is going to have to merge with someone \n\nI probably don’t understand how salesforce makes most of their money to comment - it seems like they’ll either fade or merge before they really turn a profit. \n\nOf these three, BABA is who I would invest in",
        "created_utc": 1586696471,
        "id": "fn6dsd5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586725271.0
    },
    {
        "author": "ryan_dfs",
        "body": "What makes you like Visa compared to American Express?\n\nSalesforce is a Silicon Valley stock with a crazy valuation. You're paying a huge premum for a company with no track record.",
        "created_utc": 1586216818,
        "id": "fmn2h73",
        "score": 1,
        "subreddit": "investing",
        "created": 1586245618.0
    },
    {
        "author": "dman77777",
        "body": "Salesforce ..no track record? What the heck are you smoking. The world basically runs on Salesforce.",
        "created_utc": 1586243827,
        "id": "fmo3art",
        "score": 1,
        "subreddit": "investing",
        "created": 1586272627.0
    },
    {
        "author": "faint-smile",
        "body": "Salesforce isn’t content management. It’s business automation which you could argue has a better business case post-pandemic.",
        "created_utc": 1586309480,
        "id": "fmqxy7q",
        "score": 1,
        "subreddit": "investing",
        "created": 1586338280.0
    },
    {
        "author": "bean_scott_card",
        "body": "The bizarre thing is that even with all the cash they have they are still pussies when it comes to competing with adobe and salesforce in the digital advertising realm",
        "created_utc": 1586169342,
        "id": "fmkunuh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586198142.0
    },
    {
        "author": "gizamo",
        "body": "Every big tech company has Sr devs making that much, or even much more. Here's a [2012 break down of pay for devs at GOOG](https://www.infoworld.com/article/3304439/man-or-myth-the-3-million-google-engineer.html), but AAPL, FB, NFLX, CRM, etc. all pay many devs that much. That said, I'm not at a tech company. So, it's not unheard of outside of tech as well. I even know guys at IBM and ORCL who make that much, and those guys are known to pay their devs poorly.",
        "created_utc": 1586571163,
        "id": "fn1vlay",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586599963.0
    },
    {
        "author": "wizard_1109",
        "body": "This is great insight! What makes Adobe and CRM stand out more compare to its competitors?",
        "created_utc": 1586475676,
        "id": "fmy0pw5",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1586504476.0
    },
    {
        "author": "BusinessCoat",
        "body": "You missed a couple zeroes there. One business I know of that has about 700 employees is paying $100k/month just for Salesforce.",
        "created_utc": 1586671111,
        "id": "fn5ozsp",
        "score": 1,
        "subreddit": "investing",
        "created": 1586699911.0
    },
    {
        "author": "AOC46",
        "body": "Do you so cold calls? Sales to new clients? Do you do add on and upgrades for current clients too? Small or medium businesses I guess?\n\nI own some crm.",
        "created_utc": 1587309642,
        "id": "fnw1q47",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587338442.0
    },
    {
        "author": "tybaldus",
        "body": "Dump Ford, ATT, ABI and Inbev.\n\nKeep Microsoft, Salesforce, Verizon. \n\nFor the others - keep them or sell and go for GOOG, BRK, AMZN, V or SPY.",
        "created_utc": 1587335919,
        "id": "fnxcliw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587364719.0
    },
    {
        "author": "eltractorcito22",
        "body": "Also sell saas (erp/crm specifically) and we for sure crashed for a few weeks there but it seems to be coming back. Businesses that will survive this are seeing the benefit of upgrading their on prem, outdated systems to cloud based.",
        "created_utc": 1587304118,
        "id": "fnvt94e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587332918.0
    },
    {
        "author": "dwdsquared2",
        "body": "$DIS Removed from BofA US 1 List, Salesforce Maintained\n$CRM\n\nhttps://twitter.com/DeItaOne/status/1253290675371749376?s=19",
        "created_utc": 1587642905,
        "id": "foaa22x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587671705.0
    },
    {
        "author": "CurtisOwnsU",
        "body": "To give some context I had a majority of my money invested into VTSAX and sold back in mid 2019.\n\nAfter everything went down i figured it was my chance to start buying. I do not have a whole lot of experience in buying stocks in terms of diversification and risk management.\n\nJust looking for any general advice. I am 29 so i have a decently high risk tolerance but not super insane.  \n\nCurrent holdings:  \n40 AAPL (282.45) $10804.80  \n25 FB (173.14) $4377.50  \n40 MSFT (168.98) $6776.00  \n10 TSLA (732.28) $6900.10  \n250 DAL (23.73) $5720.00  \n35 BA (139.88) $4830.00  \n50 CRM (154.88) $7575.00  \n20 SPLK (124.87) $2543.60  \n20 TTD (219.19) $4430.00  \n20 AXP (83.79) $1639.80  \n20 V (167.21) $3233.60  \n\nTotal 62k invested. Holding about 33k in cash. Did i buy to high? Should i sell and wait? I am down about 1.7k so far. Are any of these stocks horrible ideas?",
        "created_utc": 1587521882,
        "id": "fo5bqnc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587550682.0
    },
    {
        "author": "veediepoo",
        "body": "Well i mean inflated PE is usually a sign of  stock that has earnings growth to support that price. Just look at Amazon, Salesforce, etc. they've been overvalued by traditional metrics for years but their earnings keep growing a rate that support the price.",
        "created_utc": 1587408058,
        "id": "fo08r1w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587436858.0
    },
    {
        "author": "Khralx",
        "body": "Posted same question about CRM earlier here with no replies. Seeing NASDAQ heading the downturn makes me feel that poor IBMs earnings in tech industry makes investor's concerns that tech stocks are not that covid resistant ? And then, those with crazy P/E like AMD and Salesforce went down... this would be my thought, especially for AMD, that was one of the green ones amid red days, and suddenly plunges the most. Dunno.",
        "created_utc": 1587487459,
        "id": "fo3ihpo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587516259.0
    },
    {
        "author": "caramelpies",
        "body": "Wtf happened to Salesforce today",
        "created_utc": 1587481004,
        "id": "fo35ni6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587509804.0
    },
    {
        "author": "SaltyPretzelFist",
        "body": "In house production, deliver of trucks to Busch this year. Salesforce and servicing is contracted out.",
        "created_utc": 1587006404,
        "id": "fnjt5zc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587035204.0
    },
    {
        "author": "Trumpfan420_He_HIM",
        "body": "i cant give you advice but financials are not doing well after JPM and BAC earnings. \n\njust my 2 cents that rotation is the best way to pump back to highs... if that is the MM's goal.\n\ni do have some BAC calls but i been buying AMD BA and salesforce. wish to god i saw amzn coming.",
        "created_utc": 1587077025,
        "id": "fnmrz5l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587105825.0
    },
    {
        "author": "Warm_Tzatziki",
        "body": "I agree with that. And I'm not on the it's p-p-priced in wagon. \n\nHowever a drop in such a massive way is not to be expected as Feb/March. We have established the winners on the market in this situation, we know which companies should do ok, and we know the losers. A full pull back for all stocks is gone. Partial - sure. Not to be avoided. \n\nI wouldn't buy Delta or MGM now. I have no doubt to though MSFT, Netflix, CRM etc will do good. They actually can contribute from the crisis. \n\nThis crisis will have many faces and will be so much different than the others. Simply because of the the fact that many jobs can be done from home. It's the first time in crisis history. \n\nI do not disagree actually with you. I think its just a different view.",
        "created_utc": 1586870481,
        "id": "fndi22i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586899281.0
    },
    {
        "author": "ss_400401",
        "body": "Most state projects are developed in Microsoft .net and that has been from a long time.  Bought calls based on the following factors starting with the recent NBA deal and would advice you buy calls expiring in August or Sep since you will have time to hedge if anything goes sideways next week.\n\n [https://www.cnbc.com/amp/2020/04/16/microsoft-and-nba-sign-azure-surface-deal-starting-in-2020-21-season.html](https://www.cnbc.com/amp/2020/04/16/microsoft-and-nba-sign-azure-surface-deal-starting-in-2020-21-season.html)\n\n1. Microsoft Teams  will eat slacks lunch and the new office 365 cloud subscription model which started on 4/21 has teams included. I believe corporations will slowly dump slack because of the higher costs and join Teams. Unfortunately it cannot take on zoom as zoom is a superior video conferencing tool.\n2. JEDI contract will help secure future government contracts and helps further to move the legacy applications from Cobol or whatever language the state's are running to .Net/ C#\n3. Has Visual studio, .net ( asp.net, c# and vb.net) to compete against java. Also SQL server competes directly with Oracle DB\n4. New Xbox releasing this year\n5. Linked helps during hard times like this\n6. GIT Hub - 60% of the worlds open source software projects are stored on GIT hub\n7. Azure which is the crown jewel and competes with AWS\n8. VR/ AR with Hololens and hardware with surface\n9. I assume they will buy Service now or Sales force since Microsoft Dynamics is not that of a great CRM tool.\n10. If azure can prove its reliable for NBA, it will open doors for international games like Soccer, Formula1, Olympics etc..",
        "created_utc": 1587691247,
        "id": "fodw4hm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587720047.0
    },
    {
        "author": "blowhand",
        "body": "Shopify is a platform for any business to sell their wares online.  It is fairly widely adopted across industries for its age; businesses across sectors use it to sell whatever they can ship. \n\nThere is conversation of Microsoft standing up a competitor, which makes sense as probably 25% of Shopify instances include a Microsoft product (like MS Dynamics CRM) within the tech stack.  Of course Microsoft could buy Shopify if they can’t initiate the product well enough.  \n\nSo be aware of this...\n\nhttps://plaktheme.com/2020/01/microsoft-ecommerce-competitor-to-shopify/",
        "created_utc": 1587663455,
        "id": "fobtdep",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587692255.0
    },
    {
        "author": "TimelyTint",
        "body": "MSFT SHOP BABA CRM",
        "created_utc": 1588265856,
        "id": "fp2pss0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588294656.0
    },
    {
        "author": "paxnjackson",
        "body": "Imo Crm under 160 is a buy AMD under 50 is a buy",
        "created_utc": 1588201126,
        "id": "fp029aw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588229926.0
    },
    {
        "author": "Urdnought",
        "body": "Salesforce",
        "created_utc": 1588162184,
        "id": "foy0jpn",
        "score": 1,
        "subreddit": "investing",
        "created": 1588190984.0
    },
    {
        "author": "Industry_Standard",
        "body": "Don't have the ETFs, but I have a similar split of tech, with some SHOP, AMD, CRM, PYPL, BABA. SHOP has some pretty wild swings, so you might still be able to get in at ~570 on a down day. Not into ZM (giant competition from MSFT/FB/GOOGL) and RNG (overvalued). ADBE is another I like but haven't gotten in. It's profitable, has consistent growth, and the leader in its industry.",
        "created_utc": 1587908613,
        "id": "fomzrde",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587937413.0
    },
    {
        "author": "sketchyuser",
        "body": "I like this advice. I have a long time horizon so I've been thinking something like:\n\n40% VGT\n40% MGK\n20% VCR\n\nI went to a \"portfolio analysis\" website, and it recommended I just do 100% VGT. Not sure if I agree with that, any thoughts?\n\nAlso I like CRM, NVDA, NOW, Visa, Home Depot, PANW, ROKU as well",
        "created_utc": 1585769443,
        "id": "fm5appm",
        "score": 1,
        "subreddit": "investing",
        "created": 1585798243.0
    },
    {
        "author": "BigBrownBearMarket",
        "body": "This \"analysis\" is pointless. Salesforce market cap is &gt;100 billion. This is the same sort of analysis people make when Salesforce had a market cap of 17 billion in 2011. This is retarded \"analysis\".",
        "created_utc": 1585820216,
        "id": "fm7b7oa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585849016.0
    },
    {
        "author": "firestormdude",
        "body": "It’s just a glorified spreadsheet and database at the end of the day so nothing fancy tbh. It’s like Uber. Anyone can replicate their business but they’re so entrenched with brand dominance, it’s going to be hard to beat them. Microsoft could easily come up with a competing product for Salesforce as could many other tech giants but Salesforce is entrenched and growing so I don’t see it taking a hit in the immediate future. Long term, I do see some risk.\n\nI like Adobe and Shopify better so I own those two and haven’t bought Salesforce.",
        "created_utc": 1586496344,
        "id": "fmyuq3o",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1586525144.0
    },
    {
        "author": "FahCureMother",
        "body": "Dividend stocks\nFirst Republic Bank $99  d0.76%\nDisney - $104.50  d1.68%\nCoka cola - $49  d3.35%\nVisa - $173 d1.69%\nJohnson and Johnson - $141  d2.69%\nProctor gamble - $114  d2.6%\nVerizon - $57  d4.28%\nCostco - $300  d0.87%\nJp Morgan chase - $102.76  d3.5%\nMarriot $81  d2.36%\nAmerican Express $94  d1.82%\nExxon Mobile $43  d8.07%\nMicrosoft $161  d1.24%\nApple - $267  d1.15%\n\nNon-dividend stocks\nUnited Airlines - 31.50\nAlaska Airlines - 31.61\nNetflix- $370\nTesla - $590 \nGoogle- $1206\nAmazon -$2042\nChewy - $43\nCanopy - $15\nAphria - $3\nApple - $267 d1.15\nBrk.b - $193.84\nSalesforce -$150\nAlibaba - $196.37\nAdobe - $315\nShopify - $417",
        "created_utc": 1586497661,
        "id": "fmyw797",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586526461.0
    },
    {
        "author": "paxnjackson",
        "body": "Cloud technology. Working habits will forever be changed, I wouldn’t be surprised if more companies realize working remotely is cost efficient and decreases liability after this is all over.  BABA MSFT CRM",
        "created_utc": 1586705510,
        "id": "fn6qug8",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1586734310.0
    },
    {
        "author": "Holy_crow_above_me",
        "body": "Right now invest in CRM or AAPL while they are a little down.  If you think the PS5 will do well get some SNE while it is down as well",
        "created_utc": 1586645548,
        "id": "fn4of21",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1586674348.0
    },
    {
        "author": "appzly",
        "body": "from my minimal research, visa seems to be safer because of the way it operates and promises a better long term growth because of their efforts to expand internationally.\n\nI like what I've heard about salesforce: their business management, benioff, good earnings, and they're leading in cloud computing. \n\nCan you make a case for American Express? What other companies do you like more than salesforce?",
        "created_utc": 1586217612,
        "id": "fmn3swr",
        "score": 1,
        "subreddit": "investing",
        "created": 1586246412.0
    },
    {
        "author": "somanychins",
        "body": "It is. But convenience has never been enough to stop IT from doing anything they want. Probably not a long lived differentiation anyway. \n\nhttps://news.microsoft.com/2019/11/14/microsoft-and-salesforce-expand-strategic-partnership-to-accelerate-customer-success/",
        "created_utc": 1586104137,
        "id": "fmi7s0d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586132937.0
    },
    {
        "author": "HoosierPride",
        "body": "Isn’t ZM integrated with Salesforce?",
        "created_utc": 1586103446,
        "id": "fmi6k19",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586132246.0
    },
    {
        "author": "haw35ome",
        "body": "Hi, everyone. I'm new to stocks, and via cash app I've \"planted the seed\" of my portfolio so to speak by investing a little on AMD. I do plan to add more each month to AMD until I have one share or so. I'm a CIS major, so I'd rather invest in something I know. While nothing's set in stone yet, I'm following &amp; looking at CSCO, INFY, RTX, ORCL, CRM, and COUP.\n\nAny tips or websites on learning about companys' business choices?",
        "created_utc": 1586891444,
        "id": "fnele7y",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586920244.0
    },
    {
        "author": "damanamathos",
        "body": "To put some high level numbers around it, they grew revenue 88% last year (Jan-20). If revenue growth accelerates to 100% in Jan-21 due to more businesses adopting video conferencing, then slows to 80% in Jan-22, and 60% in Jan-23, it'll generate $3.6bn revenue in Jan-23.\n\nIf in Jan-22 it trades on 20x forward revenue it will be a $245 stock.\n\nMost people have growth rates that are too low, and have growth slowing too much. Salesforce in Jan-03 grew 127%, then 88%, then 84%, 76%, 60%, 51%, 44%, whereas most are assuming a much sharper cliff for Zoom which I don't think is right given increased customer adoption and ability to expand product set.\n\nIf it's growing revenue 60% in Jan-23 should it trade on 20x forward sales? Right now Atlassian trades on 21x forward sales with 31% sales growth, Okta trades on 21x forward sales with 32% sales, etc, so Zoom could conceivably trade higher than 20x forward sales in a couple years time.",
        "created_utc": 1586834819,
        "id": "fnceiml",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586863619.0
    },
    {
        "author": "Warm_Tzatziki",
        "body": "That's salty. And some of the comments are pretty stupid as well. Seeing comments like \"introduce them to options, I did this and they are already -90%. Feels good\" etc. \n\nI told my friends asking same question that if they are looking for a get rich quick scheme, they will be out of money quickly. For mid and long term trades its not a bad moment. You really think in a couple of months Microsoft, Amazon, Salesforce etc... won't be higher?\n\nComments overloaded with loss lovers",
        "created_utc": 1586857521,
        "id": "fnd3p76",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586886321.0
    },
    {
        "author": "mrcorndogman33",
        "body": "CRM 160c 5/1?",
        "created_utc": 1587651371,
        "id": "foarns6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587680171.0
    },
    {
        "author": "1_over_f",
        "body": "I'm primarily interested in MSFT, DDOG, CRWD, NET, DOCU, WORK, and SQ. There are some other great ones I would consider picking up. I'm interested in SalesForce; they're huge and have a product that seems to become deeply ingrained in the stack and I like their CEO. I've read one of his books and he seems to have always been customer-focused and willing to take risks. I've never used the product though so I would like to have that experience first. Amazon seems to be another obvious pickup. I rate IBM very low. Neutral about Atlassian. I also would not hold Oracle.",
        "created_utc": 1587653245,
        "id": "foavx6u",
        "score": 1,
        "subreddit": "investing",
        "created": 1587682045.0
    },
    {
        "author": "jwiegley",
        "body": "This is me buying and then dumping CRM:\n\nhttps://i.imgur.com/RvSBg73.jpg\n\nI’m the opposite of a savant at market timing.",
        "created_utc": 1587602445,
        "id": "fo8rolb",
        "score": 1,
        "subreddit": "options",
        "created": 1587631245.0
    },
    {
        "author": "zakwill",
        "body": "Why trade the SPY? If you want to make real money, take your 29k buy a few different companies you believe in! Then start to put in covered calls. PYPL SQ MU SBUX NKE CRM are just some right in your wheel house. Believe me in the long run you will make much more than trying to trade the SPY. Also, be smart with your covered calls. Don’t do the weeklies. Get some good premium. If you have the time  to truly invest, take advantage of it!!",
        "created_utc": 1587219529,
        "id": "fnsdy7e",
        "score": 1,
        "subreddit": "options",
        "created": 1587248329.0
    },
    {
        "author": "jschreiber77",
        "body": "I’d sell 16 of them and keep DIS, SBUX, STZ, MSFT and CRM.  Once you get the cash to trade (2 business days), buy these 5 stocks:\n\nTTD, BRK.B, BABA, AAPL and V — OR you can hold the cash, invest 50% of your funds into ETFs and wait a few months until the above stock prices decline a bit — then buy them.",
        "created_utc": 1587332721,
        "id": "fnx702g",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587361521.0
    },
    {
        "author": "petricha11",
        "body": "Investing 20k long term\n\nCRM %30\nBTG %20\nCOP %17\nAMD %14\nENPH %13\nVIPS %16\n\nSuggestions admonitions appreciated",
        "created_utc": 1587525534,
        "id": "fo5h630",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587554334.0
    },
    {
        "author": "CrimsonBrit",
        "body": "Salesforce ($CRM) taking a big dip (-7%) today, but I can't find a reason for it online. Is it due to the unemployment numbers and and the reduced workforce? \n\nI created a decently-large watchlist of stocks to my radar on March 18th (a couple days before the big drop) and didn't pull the trigger on any of them like an idiot. Some of these stocks would have made me a lot of money since then (e.g. Wayfair +335%; Tesla +107%; Square +65%, etc.).\n\nI added CRM to my watchlist at $119.59, and today it is trading around $151. Looking long-term, an entry point may produce itself shortly.\n\nAnyone have any thoughts on $CRM whether they be short-term, long-term, etc.?",
        "created_utc": 1587480898,
        "id": "fo35gbf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587509698.0
    },
    {
        "author": "MisterPicklecopter",
        "body": "Agreed! Data and visualizations are the future /u/DingleTheDongle. Knowing Excel alone has a tremendous amount of value.\n\nI'd also add learning Salesforce as a ton of opportunity. Anything data or database thinking is great.",
        "created_utc": 1587468460,
        "id": "fo2n434",
        "score": 1,
        "subreddit": "investing",
        "created": 1587497260.0
    },
    {
        "author": "Dahnhilla",
        "body": "~CRM~\n\nCEO, 2 directors and COO sold stock this week. Was overvalued as fuck and it's tanked today, almost 9%.",
        "created_utc": 1587483619,
        "id": "fo3anle",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587512419.0
    },
    {
        "author": "H3TheDon",
        "body": "Millions dollars to customize a CRM for your business lol..no",
        "created_utc": 1587427773,
        "id": "fo189ec",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587456573.0
    },
    {
        "author": "bbbpppccc",
        "body": "It's not necessarily a good or bad sign.\n\nBased on what I'm seeing, I'm taking it as CFO is just gradually selling shares like a lot of top execs I've seen. He has \\~1.4M shares to go, last sale was for 11k of them\n\nExample of similar pattern is CEO of CRM. Sells like 20k shares ($3M) pretty often, but has been doing that for a really long time.   \n\n\nWhen there's a large sale (shares sold to shares left over) then there might be something. Also if they form is filed late, like 1 &gt; week late. I'll mostly play on late filings   \n\n\nExample of that is SPWR during Feb earnings. Sale was in mid Jan, but reported shortly before earnings",
        "created_utc": 1587429121,
        "id": "fo1aix2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587457921.0
    },
    {
        "author": "Trumpfan420_He_HIM",
        "body": "amd @ 42, BA @ 100, CRM @ 142\n\ngl shorting the fed!",
        "created_utc": 1586992040,
        "id": "fnj4xps",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587020840.0
    },
    {
        "author": "ethereumkid",
        "body": "You at $CRM? They have a 15% discount IIRC.",
        "created_utc": 1587051424,
        "id": "fnld3nn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587080224.0
    },
    {
        "author": "sAfuRos",
        "body": "SFDC and ServiceNow have expanded far beyond CRM but the core CRM business is essentially a consolidated, single source of truth for any and all customer facing data, revenue, etc.  Imagine you were selling $50,000 software to all your contacts, who didn't know what the software is.  You need to track an incredible amount of data, not just immediately, but over time.",
        "created_utc": 1586957999,
        "id": "fnh9in0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586986799.0
    },
    {
        "author": "SImpleWinkle",
        "body": "I was always nervous to invest into either Uber or Lyft. Seems to me that they are all still in survival mode, burning through investors cash with no profit in site. Lots of regulatory, labour issues and dependence on sub-contractors with no loyalty. As I was once a frequent user of multiple deliver/rideshare apps I've also noticed how often they've been *basically* buying their business through generous marketing offers.\n\nThis type of news proves they don't have nearly as much run way as more established software firms. Salesforce, Workday, Oracle, IBM, etc. Sitting on massive renewal bases having way less stress to their financials. Or bigger tech firms like Google, Apple, and Amazon that look to be taking over our world. \n\nNow they have to survive a pandemic with a fraction of the same revenue as they had coming in. Good luck, would stay away if i were you.",
        "created_utc": 1588182784,
        "id": "foz0xuy",
        "score": 1,
        "subreddit": "investing",
        "created": 1588211584.0
    },
    {
        "author": "GourmetFilet",
        "body": "TSLA goes down with the market today ima be pissed. \n\nThis happened with CRM last fall to me. Was about to be a 5 bagger then market dropped at open and wiped out all ER gains.",
        "created_utc": 1588250777,
        "id": "fp1xxhr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588279577.0
    },
    {
        "author": "AngelaQQ",
        "body": "&gt; FAANG should include Microsoft.  \n\nSilly, don't you know that Microsoft is already included in the CUM group of stocks, which includes CRM, UBER, and MSFT.",
        "created_utc": 1588282401,
        "id": "fp3nfxq",
        "score": 1,
        "subreddit": "investing",
        "created": 1588311201.0
    },
    {
        "author": "uwjames",
        "body": "But Salesforce will do it first.",
        "created_utc": 1587839310,
        "id": "fokc4su",
        "score": 1,
        "subreddit": "investing",
        "created": 1587868110.0
    },
    {
        "author": "firestormdude",
        "body": "I’m a web developer and programmer who’s tracked the trends in e-commerce. Shopify is by far the most robust platform for small businesses and it’s subscription based at a reasonable price people can afford to pay each month. It includes payment processing as well as part of the monthly fee.\n\nFrom my experience, people are very slow to cancel subscriptions tied to their websites, especially when it’s not breaking the bank. This is how Shopify retains its business and continues to grow.\n\nIt’s competition has never and will likely never catch up. I’ve used platforms like BigCommerce, Magento, and even dated a gal that worked at Volusion in Austin and none of them stack up with what Shopify offers.\n\nShopify is right up there with Adobe and Salesforce as a great growth stock to own with all subscription based revenue. However, I would not buy a ton right now until the market takes out its March lows given the current circumstances in the economy. We definitely have not hit bottom yet in the market and have a ways to fall.",
        "created_utc": 1586025955,
        "id": "fmff5mt",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1586054755.0
    },
    {
        "author": "Electric_pokemon",
        "body": "1)I think the industry dominance you are talking about is mostly smaller and mid sized customers - Adobe Magento and Salesforce Demandware are very capable and competitive solutions up market. If anything, they are the go to solutions for Enterprise.\n\n2) Shopify has a lot of exposure to VC backed D2C companies, many of which are now struggling for life. The room to growth becomes very questionable when a lot of these e-commerce companies have been burning cash, the whole model is now under question. VC funding has stopped, completely.\n\nDropshipping is likely to be another casualty in post COVID world - cheap stuff from China, which is mostly consumer discretionary, isn't going to grow 50% a year with unemployment rising, if anything businesses will see declining sales of these. You might see unemployed people starting more of these business, but they'll not offset decline in merchant solutions revenue (dependent on sales).\n\n3) Unlike Amazon, Shopify doesn't control it's destiny. It relies on its sellers to be successful. I do like the fulfilment aspect but again, Shopify relies on its sellers to be successful selling through their own marketing- it doesn't bring organic traffic to its customers the way Amazon does. Amazon has achieved the unthinkable - no one foresaw AWS for example.",
        "created_utc": 1586043892,
        "id": "fmg94hx",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1586072692.0
    },
    {
        "author": "kojied",
        "body": "Are they really worth 38.22B?  \nFor context Goldman is 50.79B, Salesforce is 120.21B. Is Zoom worth 3/4 of Goldman, 1/4 of Salesforce?",
        "created_utc": 1586049865,
        "id": "fmgijum",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586078665.0
    },
    {
        "author": "InfertilePanda",
        "body": "Thanks dawg! This is fascinating. I know you've posted a list of books before you recommend for general reading/philospophy, but I can't seem to find it. If you could list those, that would be awesome. I've learned more from you here in a week or so than from a year of research...which means i just need to research more. thanks for the food for thought! Oh, and I would like to see a covenant breakdown for a non-consumer facing B2B like Salesforce, Crowdstrike, etc.",
        "created_utc": 1585918178,
        "id": "fmb4m0z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585946978.0
    },
    {
        "author": "galaxy1011",
        "body": "CRM straight line down",
        "created_utc": 1587482050,
        "id": "fo37m7m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587510850.0
    },
    {
        "author": "2Fast2Smart2Pretty",
        "body": "How is it more? Is it integrated with JIRA or salesforce etc? I worked somewhere for a year that had it and I used it like I would Skype, but what's so great about it?",
        "created_utc": 1587495826,
        "id": "fo3zygh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587524626.0
    },
    {
        "author": "isit5pmnyet",
        "body": "I've been sitting on Veev for a while. Ex salesforce kiddos who know what they are doing.",
        "created_utc": 1587452877,
        "id": "fo287p4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587481677.0
    },
    {
        "author": "ImJustTryin2Retire",
        "body": "CRM is a good long term short but the options are way to expensive compared to its movement. I’ll try to time the collapse perfectly with FD’s. Will report losses later",
        "created_utc": 1587683608,
        "id": "fodea8b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587712408.0
    },
    {
        "author": "Capt_Picard_7",
        "body": "Thinking about a play on CRM.  I see limited upside at current price.  Anyone else on CRM puts?",
        "created_utc": 1587650722,
        "id": "foaq2j7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587679522.0
    },
    {
        "author": "Remarkable_Amount",
        "body": "In March when the market dipped, I loaded up on Match, CRM, TEAM, and RTX as a long term hold.\nFor funsies, I got IVR, CCL, MGM, and Delta.",
        "created_utc": 1587345510,
        "id": "fnxsnge",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587374310.0
    },
    {
        "author": "juan2make10di",
        "body": "Take a few steps back. Compare the world 1990, 2000, 2008 and now 2020. What has progressed, like a lot? Tech. 2008 cloud vs now... Ecommerce 2008 vs now. Huge differences, marketspace has grown significantly and Intel is dropping the ball right now? That's what happens when you feel too fucking comfortable. Large corps sign multi-year contracts with Intel, it's not a switch one year to another. Take Salesforce for example, look at the almost decade long contracts they've signed. Right now companies are giving AMD a shot and they have been taking advantage of taking market share now, this is what truly matters, you can look at history 10-20 years ago if you want, but that won't tell you anything about today's market. Can Intel get their shit together and recapture the tiny marketshare they lost and prevent further fleeing? Yeah, they definitely have a shot. AMD is poaching their people and it has been playing well into their strategy. Intel has hopefully been getting it's shit together, however this doesn't discount AMDs strategy and execution these last few years, yeah they got real lucky as well. Servers are another huge area AMD has been killing it recently. Anyway, yes valuation is high, however consider how the market has been changing and all the large contracts expiring and about to expire. \n\nAs for Tesla, very optimistic, they are far ahead of themselves, however they will lead past vehicles, they'll be laying down future infrastructure and grow much larger than anyone expected imo, however it's a ways away so they'll have their ups and downs imo. Tsla puts and AMD puts short term, calls longterm",
        "created_utc": 1587357556,
        "id": "fnyaid7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587386356.0
    },
    {
        "author": "cblazek1",
        "body": "Salesforce prob just dumped all there shares",
        "created_utc": 1587752565,
        "id": "fogha1d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587781365.0
    },
    {
        "author": "LSG1",
        "body": "That's good context, thanks for the insight. Yes I've looked at Zscaler, Data Dog and some others. They seem to have their niche, but just want excited about their growth  Five9 seems to be doing well, outperforming the market for what they do. I will look into Crowdstrike. I'm already holding CRM.",
        "created_utc": 1587771748,
        "id": "fohsfit",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1587800548.0
    },
    {
        "author": "strikezero2",
        "body": "Nah, sizewise they're all in the same ballpark, and a few months ago NFLX was smaller than some of them. And Apple is also mainly manufacturing.\n\nNFLX 186B\n\nADBE 166B\n\nCRM 138B\n\nPYPL 141B\n\nNVDA 177B\n\nSAP 142B\n\nINTC 254B\n\nCSCO 180B\n\nORCL 167B",
        "created_utc": 1587761308,
        "id": "foh78g1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587790108.0
    },
    {
        "author": "zippercot",
        "body": "And Slack, Salesforce, Workday... the list is endless and growing.",
        "created_utc": 1587127427,
        "id": "fnokb4x",
        "score": 1,
        "subreddit": "investing",
        "created": 1587156227.0
    },
    {
        "author": "dlctrades",
        "body": "Honestly Buffet selling even that small stake in Delta helped out the 💎🖐 on my burning puts.\n\nBefore COVID media was saying he lost his touch having been outperformed by S&amp;P for the last 5 years. Sitting on a shit ton of cash everyone waiting for him to buy anything and instead he sticks to his guns, says everything is overvalued, and gives money back to shareholders.\n\nNow, especially if we do have another leg down, he has enough cash on hand to acquire companies for half of their market cap 2 months ago. \n\nHe wouldn't have sold Delta shares during the \"rally\" if he thought it was truly a V shaped recovery. \n\nI'm with the Oracle. SPY 273P 06/19 picked up today at the highs. Would love to add a 300P if it gets there so keep Brrrring Powell.",
        "created_utc": 1586402519,
        "id": "fmuznhg",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1586431319.0
    },
    {
        "author": "amoctar",
        "body": "In few years they gonna talk about some 'genius' who predicted the crash like he's some kind of oracle while there's at least a million retard predicting Armageddon everyday",
        "created_utc": 1587039833,
        "id": "fnktxb1",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1587068633.0
    },
    {
        "author": "SnacksOnSeedCorn",
        "body": "It's more like, some retail investors just want an oracle to lead them to riches so there's a huge audience for this low effort analysis. I wouldn't call it GS's main business, more like a way to monetize exhaust data.",
        "created_utc": 1586790366,
        "id": "fna3lag",
        "score": 11,
        "subreddit": "investing",
        "created": 1586819166.0
    },
    {
        "author": "DrOctopus-",
        "body": "Or...guess how many companies will be looking to save by cutting all of these 1 trick pony software licenses and negotiate a way better deal with a bundled Enterprise solution from Microsoft, Oracle, etc... MSFT will do just fine in this.",
        "created_utc": 1586826401,
        "id": "fnc132b",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1586855201.0
    },
    {
        "author": "702Nav",
        "body": "Posting ridiculous DDs and acting like an Oracle is the same thing 😂😂",
        "created_utc": 1587178172,
        "id": "fnr35rr",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1587206972.0
    },
    {
        "author": "sweatyminge",
        "body": "\"now let's look at the bull case\"\n\nWhere was the bear case? All I read was you saying what wasn't going to happen like some card reading oracle.\n\nHow the fuck you call people delusional when you litterally haven't even mentioned COVID19 once, where the fuck is that in your bull case?\n\nIf this drags on into June or the US gets hit by a hard second wave you are fucked.\n\nChina welded people in their flats for months, the US hasn't even fully shutdown yet.",
        "created_utc": 1586469116,
        "id": "fmxp0lp",
        "score": 9,
        "subreddit": "investing",
        "created": 1586497916.0
    },
    {
        "author": "doopseruasai",
        "body": "Can you explain it to us plebeians mr all knowing oracle",
        "created_utc": 1586205190,
        "id": "fmmh6fd",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1586233990.0
    },
    {
        "author": "mourningbagel",
        "body": "Lmao that was literally an ad for Oracle",
        "created_utc": 1585950952,
        "id": "fmcqrjw",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1585979752.0
    },
    {
        "author": "dawhizkid",
        "body": "What if corona undoes Buffetts entire legacy as the Omaha Oracle? World is changing too fast for him to keep up.",
        "created_utc": 1585956298,
        "id": "fmczxlc",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1585985098.0
    },
    {
        "author": "yoloornoglow",
        "body": "Can we ban people who post retarded DD in the narration of an oracle and then are completely fucking wrong? \n\nLike that ketlani person who posts 4 times and gets upvoted to the heavens like he solved the financial issues of modern times, then gets raped by 3rd best day in SPY history?",
        "created_utc": 1586224580,
        "id": "fmnf13t",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1586253380.0
    },
    {
        "author": "Wheymen_",
        "body": "THE ORACLE, SEPARATE VARIATION, HAS FORETOLD",
        "created_utc": 1586290269,
        "id": "fmpzr1w",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1586319069.0
    },
    {
        "author": "designerfx",
        "body": "Yeah, thanks for the writeup. I'm reminded of the paralegals who wrote for Groklaw and helped me understand basic legal shit during cases like google vs oracle, where the average pleb had no idea. Appreciate it, fuzzy.",
        "created_utc": 1586983063,
        "id": "fninhp7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1587011863.0
    },
    {
        "author": "okgenxer",
        "body": "Old news by now but it's ridiculous that Trump started hyping hydroxychloroquine  after talking to Larry Fucking Ellison from Oracle. FUCK ORACLE\n\n[https://www.nbcnews.com/politics/donald-trump/trump-chloroquine-push-came-after-talk-donor-source-says-n1190771](https://www.nbcnews.com/politics/donald-trump/trump-chloroquine-push-came-after-talk-donor-source-says-n1190771)",
        "created_utc": 1587741536,
        "id": "fofrigk",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1587770336.0
    },
    {
        "author": "lloydgross24",
        "body": "Could you imagine if he put a massive hedge on his more exposed positions back in January?\nThe banks and airlines alone would have returned a bunch of capital. He may have even sold at a profit. \n\nI mean he's called the oracle of omaha for a reason lol. I mean I'd imagine somehow he's not really down that much $$ either here or in the long term.",
        "created_utc": 1585958341,
        "id": "fmd38f7",
        "score": 5,
        "subreddit": "investing",
        "created": 1585987141.0
    },
    {
        "author": "CroissantDuMonde",
        "body": "Chamath, the oracle of WSB.",
        "created_utc": 1587573899,
        "id": "fo785pz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587602699.0
    },
    {
        "author": "lnsufficientgravitas",
        "body": "It's very simple - VWAP is simply the volume weighted average price.  Go look at your favorite ticker and add VWAP + an upper and lower band set to a factor of 2.  Look back over time at how the stonk tends to trade around VWAP and the upper/lower bands.\n\nMost of the time, you should see that the stock will want to \"float\" back to VWAP throughout the day-sometimes it doesn't, but it's better than just trying to trace a chart with your finger on robinhood and guestimate purely off price and not volume.\n\nCombine this with time and sales flow to get an idea as to the momentum.  It's something you need to just play with and get a feel for.\n\nMy approach is basically - has the stock plunged well below VWAP, and pierced the lower bound?  I probably wouldn't go short but will consider going long to catch a bounce back to VWAP.  Inverse?  Consider going the other way.  Sitting at VWAP and VWAP is flat?  Probably won't touch it as I'm not an oracle  \n\n\nIt's not a silver bullet though and won't always work - I've seen SPY explode over VWAP and just keep reaching upwards, beyond the upper band.  I've tried to short from here and have gotten stopped out as JPOW's raging erections just keep blowing out the chart with green dildos.",
        "created_utc": 1587059854,
        "id": "fnlub9y",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587088654.0
    },
    {
        "author": "e30jawn",
        "body": "&gt; Can we ban people who post retarded DD in the narration of an oracle\n\nplease.",
        "created_utc": 1586224693,
        "id": "fmnf7i5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586253493.0
    },
    {
        "author": "knagy17",
        "body": "All hail the oracle Gordon. When us retards have tendies for life because of him, we’ll make him our God",
        "created_utc": 1585771856,
        "id": "fm5fa7j",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1585800656.0
    },
    {
        "author": "bitcoinslinga",
        "body": "The Oracle has spoken.",
        "created_utc": 1586904179,
        "id": "fnfa1rt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586932979.0
    },
    {
        "author": "PNWPlayZ",
        "body": "not all, but i got these.\n\nCisco, Seaboard Corp, BAC, JPM, Goldman Sachs, WFC, Raytheon, Lockheed Martin, Honey Well, General Dynamics, Fedex, UAL,UPs, DB Hunt, Liberty Media, Charter Comms, T Mobile, Verizon, Apple,Google Oracle, Sales Force, Apple, MSFT, IBM, Intel",
        "created_utc": 1586905497,
        "id": "fnfckax",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1586934297.0
    },
    {
        "author": "gambling_rambler",
        "body": "TSLA will gap up to 800 tomorrow. The great oracle Elon said so in my dreams last night",
        "created_utc": 1586995628,
        "id": "fnjbgqx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587024428.0
    },
    {
        "author": "pennystockplayer",
        "body": "Are you new to wsb or trading forums? People like him come and go all the time. They are a dime a dozen. He is not some oracle, just some dude with an opinion.",
        "created_utc": 1586226168,
        "id": "fmnhhiq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1586254968.0
    },
    {
        "author": "ljpeers",
        "body": "Oracle has spoken",
        "created_utc": 1587345804,
        "id": "fnxt5u4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587374604.0
    },
    {
        "author": "captain_blabbin",
        "body": "move over Cramer the oracle has arrived",
        "created_utc": 1587582950,
        "id": "fo7qsr2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587611750.0
    },
    {
        "author": "strikezero2",
        "body": "It's about one tenth in size of the big boys.\n\nThere are multiple stocks in that category. ADBE, CRM, PYPL, NVDA, SAP, INTC, CSCO, ORCL. \n\nSurely a huge tech success story, but not close to FAAMG in importance.",
        "created_utc": 1587759934,
        "id": "foh2yz3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587788734.0
    },
    {
        "author": "Drogbanana",
        "body": "I had Tesla puts and calls at $480.  I'm like the reverse oracle",
        "created_utc": 1585944086,
        "id": "fmcefou",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1585972886.0
    },
    {
        "author": "PaintedParadise",
        "body": "“I like tiger king tehe. Netflix is a buy” - Cramer the Oracle",
        "created_utc": 1586375812,
        "id": "fmtnkzy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1586404612.0
    },
    {
        "author": "121518nine",
        "body": "ORACLE, TELL ME, LIMIT ⬆️or ⬇️? I won’t take any answer in between.",
        "created_utc": 1586224234,
        "id": "fmnehu5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1586253034.0
    },
    {
        "author": "moduspwne",
        "body": "thank you almighty oracle with your crystal ball",
        "created_utc": 1585870908,
        "id": "fm9l0ww",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1585899708.0
    },
    {
        "author": "Dmoan",
        "body": "hydroxychloroquine was pushed by Trump after a phone call with Oracle head Larry Ellison (Who is a big donor). I guess having billions makes you a medical expert.",
        "created_utc": 1587677695,
        "id": "focyuw5",
        "score": 3,
        "subreddit": "investing",
        "created": 1587706495.0
    },
    {
        "author": "tendies_central",
        "body": "The Oracle has spoken",
        "created_utc": 1585949033,
        "id": "fmcnegv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1585977833.0
    },
    {
        "author": "Slowhand1971",
        "body": "Closed Friday, oh market Oracle",
        "created_utc": 1586370865,
        "id": "fmtdfrr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586399665.0
    },
    {
        "author": "SomethingMusic",
        "body": "[cisco has diminishing cash on hand](https://www.macrotrends.net/stocks/charts/CSCO/cisco/cash-on-hand), though they probably can handle operating expenses for 3 months on savings\n\n[Oracle has also significantly](https://www.macrotrends.net/stocks/charts/ORCL/oracle/cash-on-hand) reduced cash\n\nStill, the point being most businesses do not have the liquidity necessary to operate for a significant time without income, especially small and medium-sized businesses who have to operate against bigger businesses on thinner margins. 60% of US population is living paycheck to paycheck, [and only 10% businesses have enough savings to operate for two months, and 20% of businesses can operate for 2m with decreased revenue](https://twitter.com/LizAnnSonders/status/1247619174039465988). \n\nSmall business has seen the biggest decline in 34 years, and you cannot based your decisions on the few cash rich businesses that are successful.",
        "created_utc": 1586474418,
        "id": "fmxyjjj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586503218.0
    },
    {
        "author": "CrimsonBrit",
        "body": "I appreciate the thought and effort that went into this write-up, however, you've done quite a bit of due diligence to ultimately pick 80% of the **FAANG** stocks (Facebook ($FB), Amazon ($AMZN), Apple ($AAPL), Netflix ($NFLX); and Alphabet ($GOOG) with Netflix being the one you did not pick in your list of six companies.\n\nEach of the FAANG stocks trades on the Nasdaq exchange and is included in the S&amp;P 500 Index. Since the S&amp;P 500 is a broad representation of the market, where the FAANGs make up about 15% of the S&amp;P 500—a staggering figure considering the S&amp;P 500 is generally viewed as a proxy for the United States economy as a whole,  you have basically just invested in the market as a whole, as stated by /u/Chuckox50.\n\nNot to mention that investing in Berkshire ($BRK.A) is like investing in an index fund of sorts, where Berkshire's \"fund\" also owns positions in Apple (33.9%), Amazon (0.57%), and Johnson &amp; Johnson (0.24%), adding to your positions in those three companies. Additionally, Berkshire owns relatively small positions in the SPDR S&amp;P 500 ETF Trust ([$SPY](https://www.bloomberg.com/quote/SPY:US)) and VANGUARD IX FUN/S&amp;P 500 ETF SHS NEW ([$VOO](https://www.bloomberg.com/quote/VOO:US)) ETFs, which both track the S&amp;P 500 and in turn have positions in some of the companies you have mentioned: Microsoft ($MSFT), Apple, Amazon, Facebook, Berkshire, Johnson &amp; Johnson, and Alphabet.\n\n**That being said, I still think that they are rock-solid choices and I have several of those on my radar and just as many already in my portfolio, and I intend to add to my positions for those companies.**\n\nI am investing for the long-term and currently have a high tolerance for risk, so the majority of the stocks on my lengthy list of about 55 companies on my radar right now are tech.\n\nJust to mention a bunch of them (on top of MSFT, AAPL, GOOG, NFLX, FB, and AMZN):\n\n* Financial: Visa, Mastercard, PayPal, Square\n* Healthcare: JNJ, UnitedHealth, AbbVie, Illumina, InVitae\n* Services: AMZN, Walmart, Disney, Spotfiy\n* Technology (Software): Oracle, Adobe, Salesforce, Shopify, Splunk, Docusign, Twiliio, The Trade Desk\n* Technology (Gaming): Activision Blizzard, Take-Two\n* Technology (Semiconductors): Intel, NVIDIA, AMD, Micron, Teradyne\n* Telecom/Communications: Verizon, AT&amp;T, Cisco\n\nI would like to caution you for your analysis in the write-up in regards to Berkshire. You state that your rationale for Berkshire having a competitive edge post-COVID-19 is simply \"Warren Buffett\". By the time that COVID is on the decline, Buffett will be 90 years old. I think the company can thrive without him, but if your basis for investing in that company for the long-term is a man born in 1930, I think you need to reassess your rationale.",
        "created_utc": 1586786989,
        "id": "fn9xrnw",
        "score": 2,
        "subreddit": "stocks",
        "created": 1586815789.0
    },
    {
        "author": "Johndoe1850",
        "body": "It is exhausting. What we do know is no one knows what the market is doing. The world has never been on lockdown like this before. Closest thing we have to compare it to would be a world war. But the economies are vastly different now. So I say be like the Oracle. When others get greedy get scared. When others get scared get greedy. I think we are somewhere in the middle right now.",
        "created_utc": 1586921107,
        "id": "fng2ze8",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1586949907.0
    },
    {
        "author": "Treylw13",
        "body": "Wow, congrats on the big win in $SHOP.  I was going to say hold onto the cash and buy more back if it gets sub $450, but looking at your portfolio you seem to be holding enough.  I appreciate your disciplined approach, especially being in your mid-20’s.  The only top of the mind thoughts I had are:\n\nGo with individual stocks if you enjoy stock picking, you can index in your 401k and ESOP.\n-drop oracle from the list\n- add AYX and possibly ANET to your tech list, everything else on there looks great.\n- I like higher growth names in healthcare as well, LVGO, GH, HQY come to mind as all long term plays (I also own Illumina, watching NVTA but don’t love it)\n- PINS and SFIX seem to have a lot of upside from current levels as well, (SFIX popped pop my radar due to incredible amounts of insider buying). \n\nHope this gives you some decent ideas, either approach seems well thought out and would work fine.  I guess it depends on how much time you want to dedicate to it and how much you enjoy stock picking.",
        "created_utc": 1587517974,
        "id": "fo55jov",
        "score": 2,
        "subreddit": "stocks",
        "created": 1587546774.0
    },
    {
        "author": "alohaclaude",
        "body": "I fucking called 2800 at market open, mods i want the flair \"the Oracle\"",
        "created_utc": 1587585207,
        "id": "fo7veqb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1587614007.0
    },
    {
        "author": "silicapacks",
        "body": "Alright Oracle... now what? \nYou need to be right one more time. \nThen they will follow. \nThen you can rug pull.",
        "created_utc": 1587073050,
        "id": "fnmkgmy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1587101850.0
    },
    {
        "author": "pennystockplayer",
        "body": "Bunch of new traders that never saw a chart before thought he was an oracle. He wasn’t. They lost money.",
        "created_utc": 1586405620,
        "id": "fmv4570",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586434420.0
    },
    {
        "author": "wegwerf874",
        "body": "Well, Lynch's lifestyle was also insane compared with Buffett's. He visited - how many? - 250 companies a year together with his entourage, while the Oracle has spent most of his time at home.",
        "created_utc": 1586462635,
        "id": "fmxcv3l",
        "score": 2,
        "subreddit": "investing",
        "created": 1586491435.0
    },
    {
        "author": "syu425",
        "body": "Micro dosing acid. I might have to communicate with my oracle",
        "created_utc": 1586197090,
        "id": "fmm1ky7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586225890.0
    },
    {
        "author": "121518nine",
        "body": "Oracle, your emotional petulance doesn’t change the fact that JPow is using your tears 😭 as printing ink.",
        "created_utc": 1586204416,
        "id": "fmmfoi7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586233216.0
    },
    {
        "author": "nakedwaffeln",
        "body": "Damn son, you're an oracle",
        "created_utc": 1587158797,
        "id": "fnq6u4i",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1587187597.0
    },
    {
        "author": "P4cific4",
        "body": "There is a difference between invesing in leaders in tech (Google, Microsoft, Apple, Cisco, SAP,Oracle, Broadcom or Intuit to name a few) and investing in start-ups...  One in investing while the ther one is mostly gambling.",
        "created_utc": 1587591577,
        "id": "fo881hz",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1587620377.0
    },
    {
        "author": "InvestPalaver",
        "body": "Some companies are serial acquirers they make acquisitions every year and they state that it is part of their growth strategy. For example ORCL will be making acquisitons every year. So I treat it similar to how you would forecast Capex. Usually capex is taken as a % of revenue historically then projected forward, I do the same with acquisitions. They do tend to be lumpier so my model will be smoother than the eventual reality but what you are trying to get to is how much capital the company is reinvesting in the business. I also want to make sure that my growth projections are not out of line with my reinvestment requirements so sometimes I will use acquisitions to fill that gap.",
        "created_utc": 1587012500,
        "id": "fnk1s4y",
        "score": 2,
        "subreddit": "investing",
        "created": 1587041300.0
    },
    {
        "author": "Bizzatcherama99",
        "body": "Correction *AM’FAG or AM’FAGOT (oracle and tesla)",
        "created_utc": 1587766698,
        "id": "fohiv02",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1587795498.0
    },
    {
        "author": "Domgrath42",
        "body": "Calls on Oracle",
        "created_utc": 1585950902,
        "id": "fmcqogm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1585979702.0
    },
    {
        "author": "burnt_pubes",
        "body": "They are selling the preverbial shovels in the smart contract gold rush. Smart contracts don't realize their full potential without chainlink(or another oracle solution, though chainlink is way ahead of everyone else at the moment). Good watch:\n\nhttps://youtu.be/ecOEbsOUGOU",
        "created_utc": 1587415089,
        "id": "fo0l4ld",
        "score": 2,
        "subreddit": "investing",
        "created": 1587443889.0
    },
    {
        "author": "RemiMartin",
        "body": "its funny how the oracle of omaha gets quoted in here days in and days out, but all of a sudden when shtf, no one remembers.",
        "created_utc": 1586454006,
        "id": "fmwvz7u",
        "score": 2,
        "subreddit": "investing",
        "created": 1586482806.0
    },
    {
        "author": "muninn_77",
        "body": "Yea the oracle priced in their substantial losses and the upcoming recession. Still worth $100/share in 2025.",
        "created_utc": 1586871303,
        "id": "fndjaqi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586900103.0
    },
    {
        "author": "nitz21",
        "body": "How is ORCL successfully hiding behind the corner?",
        "created_utc": 1585769884,
        "id": "fm5bk4d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585798684.0
    },
    {
        "author": "McZotteBaard",
        "body": "but i'm no oracle so don't count on me",
        "created_utc": 1585754397,
        "id": "fm4hsbs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585783197.0
    },
    {
        "author": "zerowangtwo",
        "body": "That's literally just a select list of companies that probably hasn't been updated yet. And afaik AB InBev is a **huge**, non-tech company.\n\nInstead of looking at an arbitrary list of customers on their website, you could just read their [S1](https://www.notre-shop.com/) and see that their customers include Conde Nast, Dell, Oracle, Wells Fargo, Gap, and many others.\n\nAlso, if large companies aren't using Zoom then what are they using? Webex? Teams? Those two are widely considered to be inferior to Zoom.",
        "created_utc": 1585843555,
        "id": "fm866y2",
        "score": 1,
        "subreddit": "investing",
        "created": 1585872355.0
    },
    {
        "author": "BrainOnLoan",
        "body": "Treating him as a reverse oracle is going to get you more accurate information.",
        "created_utc": 1585900168,
        "id": "fman8g5",
        "score": 1,
        "subreddit": "investing",
        "created": 1585928968.0
    },
    {
        "author": "LynxJesus",
        "body": "Replace \"put\" and \"call\" and you've got yourself a money printing oracle * taps forehead *",
        "created_utc": 1585793445,
        "id": "fm6gcxx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585822245.0
    },
    {
        "author": "YoUrK11iNMeSMa11s",
        "body": "Can everyone just shut the fuck up about what’s gonna happen on the next 5 min candle please. The truth is everyone one is in the same boat, bull or bear we all have the same information. Stop acting like an oracle that has the tendies prophecy.",
        "created_utc": 1585924339,
        "id": "fmbdur5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585953139.0
    },
    {
        "author": "nitz21",
        "body": "So, anyone know why $ORCL is in shelter in place?",
        "created_utc": 1585772492,
        "id": "fm5ggi0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585801292.0
    },
    {
        "author": "vegita1022",
        "body": "If you're gonna quote buffet .. quote the actual returns by portfolio:\n\n47.37% of the Oracle of Omaha's invested money is currently tied up in the financial sector.   \n\nInformation technology is the second-largest holding in Buffett's portfolio, representing 24.2% of invested capital at the end of June.    \n\nLastly, consumer staples made up 15.23% of Berkshire Hathaway's portfolio     \n\nBuffett's company will bring in almost $1.9 billion in dividends in 2019. \n\nLong story short, dividends have been a major contributing factor to Warren Buffett's success for decades.",
        "created_utc": 1586024908,
        "id": "fmfde8e",
        "score": 1,
        "subreddit": "investing",
        "created": 1586053708.0
    },
    {
        "author": "Flvr_blstd_gldfsh",
        "body": "Don't be obsessed with the oracle from Omaha jeezus",
        "created_utc": 1586064082,
        "id": "fmh1ul7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586092882.0
    },
    {
        "author": "StuPots790",
        "body": "There is no benefit. Here are the downsides: underperformance, no dividends, overweight boomer stocks like oil, banks, airlines while underweight technology (especially cloud based enterprise).\nIMO you'll make more money investing in $BX or $KKR from their cash distributions. Those guys are cutting deals all the time instead of sitting on cash as the \"Oracle\" and under performing the longest bull run ever. Yes, I blaspheme the church of WB.",
        "created_utc": 1586010043,
        "id": "fmeottp",
        "score": 1,
        "subreddit": "investing",
        "created": 1586038843.0
    },
    {
        "author": "yoloornoglow",
        "body": "Lmao. I wish I could say “UM YEAH SPY SHOULD TRADE WITHIN A 50 PONT FUVKING RANGE ME ORACLE HEHEHEHEH”.",
        "created_utc": 1586365281,
        "id": "fmt1c6b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586394081.0
    },
    {
        "author": "rainTendies",
        "body": "Perfect example of how important it is to not over-leverage on positions especially if having short-term timelines. Recognize \"theta gang\"/option writers are most effective at making profits selling options =&lt; 45 days DTE and they do well. As an options holder/buyer one has to be able to \"go long\" and be strict with following risk and money mgmt and understand how to pick tickers/contracts having the \"greeks\" with best potential and avoiding those with the worst potential. Similar as it is in the world of investing in mutual funds/ETFs in a 401k/IRA (diversify and avoid pricey managed load-fee funds) there is such a thing as diversifying in options trades (not all-in on SPY or SPY and QQQ, place only small % on a position, include a contrarian position, don't overpay, always keep sufficient \"dry powder\"/cash equity that allows for repositioning in trades you believe in but market moved against in near term, have plan when to enter/exit before making a trade, don't get emotional, cut losses sooner rather than later, etc).  \n\nYou know you're in trouble if this applies:  \n\n\\--&gt; If you catch yourself using the word “hope”. You’re fucked. “ I hope it goes up” “ I hope it goes down”. Your hopes will get crushed. &lt;--\n\nSV/VS never gave instructions. He gave his interpretation of what the market appears to be doing and where it may be heading and provided his positions. He clearly included the not financial advice caveat. NO ONE CAN PREDICT THE MARKET. With this one we are in unprecedented times. When you hear of hedge funds and experienced trading firms blowing up their accounts, it would be unbelievable if some internet stranger was a Guru/Oracle who could predict the market moves with timing that is only off by days and ticker price moves only off by 5 pts or less. The reason he got such a huge following was because his earliest posts seem to do just that and as time moved forward it became clear to everyone that no one can predict and not even the most detailed thorough TA can give away clues for what will happen a week+ down the road.  \n\nHave a fun ride on this rollercoaster of a market! Of course I'm holding Poots that are very depressed/down at the moment. =)",
        "created_utc": 1586366209,
        "id": "fmt3cu9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586395009.0
    },
    {
        "author": "karmalizing",
        "body": "Are you a oracle?",
        "created_utc": 1586785553,
        "id": "fn9vj7s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586814353.0
    },
    {
        "author": "nopeplescovd",
        "body": "Can't Oracle just make their own Zoom? \n\nLmfao.",
        "created_utc": 1586960395,
        "id": "fnhdni2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586989195.0
    },
    {
        "author": "Redknife11",
        "body": "Oh wow. 2 hours. You fucking Oracle. Shut up",
        "created_utc": 1586969665,
        "id": "fnhvqvo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586998465.0
    },
    {
        "author": "cleanAir101",
        "body": "Tomorrow up or down you Oracle",
        "created_utc": 1586983087,
        "id": "fninjjd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587011887.0
    },
    {
        "author": "alsamo579",
        "body": "Depends on if that extra 10-30% is worth anything to you. I don’t know I’m no oracle.",
        "created_utc": 1586299567,
        "id": "fmqh8oq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586328367.0
    },
    {
        "author": "Ruthless_CEO",
        "body": "The oracle said it.",
        "created_utc": 1586219208,
        "id": "fmn6gwj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586248008.0
    },
    {
        "author": "captain_blabbin",
        "body": "i've consulted with the oracle (my penis) and its pointing down. Down it is",
        "created_utc": 1586287338,
        "id": "fmpu22a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586316138.0
    },
    {
        "author": "pkincy",
        "body": "Frankly I forget.  It was in the Human Resources software busines.  Not Oracle, not PeopleSoft, not Tom Seibel but a very similar company.  I had executive clients at all of these companies but only had one prospective client at the company I am talking about.   He was an executive and had 100% of his networth in the company.   Right before the first discovery of the books being cooked we had recommended he take $10 mm of his company stock and do a Charitable Remainder Trust.  I forgot exactly what his lifetime income would have been....like half a million a year.  He declined and so he lost about $70 mm when the stock tanked.   They moved the hdqtrs to Colorado from Silicon Valley and somehow clawed their way back to profitability and a high stock price.  The second time I met with the client we recommended a $5 mm CRT again to lock in some diversification and life time income as well as generate some tax deduction so he could sell some of his low basis company stock.  Again he declined.  The second time he lost nearly all of what was that time about $60 mm of stock.  Brilliant people don't always make the best decisions.",
        "created_utc": 1586134798,
        "id": "fmjp1jh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586163598.0
    },
    {
        "author": "alohaclaude",
        "body": "dont you dare insult the oracle, I finally had something to believe in last week. cost me a lot of money so far but I was entertained 🌈🐻 if SPY goes to 270 I'm quitting options",
        "created_utc": 1586158210,
        "id": "fmkklp4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586187010.0
    },
    {
        "author": "dadftendirekt",
        "body": "Great, now we're getting our DD from the Oracle of Autism",
        "created_utc": 1586014055,
        "id": "fmeuwpp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586042855.0
    },
    {
        "author": "gizamo",
        "body": "Every big tech company has Sr devs making that much, or even much more. Here's a [2012 break down of pay for devs at GOOG](https://www.infoworld.com/article/3304439/man-or-myth-the-3-million-google-engineer.html), but AAPL, FB, NFLX, CRM, etc. all pay many devs that much. That said, I'm not at a tech company. So, it's not unheard of outside of tech as well. I even know guys at IBM and ORCL who make that much, and those guys are known to pay their devs poorly.",
        "created_utc": 1586571163,
        "id": "fn1vlay",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586599963.0
    },
    {
        "author": "kingkang80",
        "body": "I'm just highly anticipating 3 more weeks on Saturday, May 2 when the Oracle will speak at his annual meeting.",
        "created_utc": 1586677804,
        "id": "fn5vyc0",
        "score": 1,
        "subreddit": "investing",
        "created": 1586706604.0
    },
    {
        "author": "i-can-sleep-for-days",
        "body": "That's why Warren is so successful after all these years. Even though people call him the Oracle of Omaha, he still freely admits that he doesn't know everything.",
        "created_utc": 1587235032,
        "id": "fnt5k3w",
        "score": 1,
        "subreddit": "investing",
        "created": 1587263832.0
    },
    {
        "author": "PepeSilviaFTW",
        "body": "The more I look at AAPL, the more I think *\"When is the last time they did something truly great?\"* The market has always been about what have you done for me lately. \n\nApple is consumer brand. A $400 phone is at the bottom of most peoples priority list right now. I see them being traded at around $200 in 2-3 months.   \nMSFT has enterprise level solutions that will solve most remote office hurdles.   \nThey will continue to rise.   \nI'm about to go for a run, but I could go on about IBM, Oracle, and the tech sector all day.   \nDPZ, DG, NFLX, etc. are being rewarded for the convenience of there current offerings.   \n\n\nJust thinking out loud about how some companies will be traded in the next few weeks, months, years.    \n\n\nWhat are some of y'alls thoughts?",
        "created_utc": 1587308863,
        "id": "fnw0fci",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587337663.0
    },
    {
        "author": "giffyRIam",
        "body": "I am in tech. Oracle is possibly worth shorting; it doesn't deserve its market cap. It is a place developers go to retire and get a big pay check. Years ago, I looked into working for Boeing and saw that their software teams were a mess. I didn't predict the 737 Max but I also wasn't surprised. I feel the same about Oracle though their engineers actually seem competent, and they don't have all the red tape boeing is famous for.",
        "created_utc": 1587317082,
        "id": "fnwex8e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587345882.0
    },
    {
        "author": "Alternative-ambush",
        "body": "The oracle has spoke.",
        "created_utc": 1587330693,
        "id": "fnx3e3t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587359493.0
    },
    {
        "author": "somefeenIRE",
        "body": "When Alien Bob Dole comes down to run for president that's when I know the Simpsons are the Oracle.",
        "created_utc": 1587553414,
        "id": "fo6b9k8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587582214.0
    },
    {
        "author": "dontbeevian",
        "body": "My DD’s disclaimer: This web page simulates the famous \"Magic Eight Ball\" toy, a registered trademark of Mattel Inc. The \"Magic Eight Ball\" trademark and various 8-Ball answers are used without permission of Mattel Inc. Mattel Inc. is neither affiliated with this site, nor with authors of this site. By using this oracle you agree that your doing so at your own risk. Authors will not be responsible for any choices based on advices from this oracle. Informations displayed within this site are not necessarily based on facts. Void where prohibited, taxed, or misconstrued. No children or animals were harmed in the process of construction of this oracle. WebAp{p}lications.com, 2008 — 2020",
        "created_utc": 1587612155,
        "id": "fo977uh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587640955.0
    },
    {
        "author": "GalaxyShards",
        "body": "I’ve been buying DataDog. Amazon, Microsoft, and VMWare for highly rated. I’m not a fan of Oracle.",
        "created_utc": 1587650791,
        "id": "foaq83j",
        "score": 1,
        "subreddit": "investing",
        "created": 1587679591.0
    },
    {
        "author": "desquibnt",
        "body": "I've never heard of Ponos Industries but after googling the name, it looks like they're basically just trolling big corporations offering to buy shares at huge discounts or premiums. They did the same thing with AT&amp;T and Oracle last year\n\nEdit: found the scam\n\nhttps://www.investors.com/promoted-content/ponos-industries/notice-of-offer-to-purchase-for-cash-up-to-500000-shares-of-common-stock-of-the-boeing-company-at-180-00-net-per-share-by-ponos-industries-llc/\n\n&gt; ...however, the Offer is conditioned upon the satisfaction or waiver (where applicable) of a number of conditions set forth in the Offer to Purchase, including, among other things, the closing price of the Shares on the New York Stock Exchange on the last full trading day prior to the Expiration Date exceeding the Offer Price...\n\n\"We'll only buy them from you at $180 if the share price is over $180 at the expiration of the offer\"",
        "created_utc": 1587656655,
        "id": "fob6ktl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587685455.0
    },
    {
        "author": "sryu4",
        "body": "\"The oracle of dick sucking\"",
        "created_utc": 1587585298,
        "id": "fo7vl97",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587614098.0
    },
    {
        "author": "xblackout_",
        "body": "I'm very familiar with the space, the simple way to find out if smart contract technology makes sense with a particular use case is to ask 'do you trust the other party'? If the answer is no, then perfect, that's the problem that smart contracts solve. Trustless transactions.\n\nPersonally I'm bullish on: Ethereum, Chainlink, IOTA, Bitcoin.\n\nBTC: I see this as being an eternal legacy store of value. Highly illiquid, should be treated as digital gold. The hedge of the space.\n\nEth: Most promising and popular platform for innovation, moving to proof-of-stake meaning improvements to efficiency and it's got a better 'at scale' thanks to the addition of layer 2 development on top.\n\nChainlink: 'The' Oracle network. This requires a bit of technical knowledge to understand, but this network works in conjunction with other types of DLTs. It solves the biggest problem of smart contract technology. Essentially it lets DLT applications make API calls to external systems (the web). I'm most bullish on this by far.\n\nIOTA: an outlier, a potential game changer. A more exploratory type of network that uses DAG tech which could ultimately be the fastest and cheapest per transaction. The team has made great progress and this tech has the potential to disrupt the rest, but their scope of work and vision is massive.",
        "created_utc": 1587406422,
        "id": "fo05h6k",
        "score": 1,
        "subreddit": "investing",
        "created": 1587435222.0
    },
    {
        "author": "oGSully",
        "body": "Thank you for the cold take Oracle",
        "created_utc": 1587481922,
        "id": "fo37dkv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587510722.0
    },
    {
        "author": "bye_ear",
        "body": "Sold 1/21 ORCL 55c to raise cash to support my put buying addiction",
        "created_utc": 1587480661,
        "id": "fo3507b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587509461.0
    },
    {
        "author": "TrollFarm4",
        "body": "You keep dodging the question.\n\n&gt; One example is in supply chains/inventory management. Companies have ERP accounting systems from decades ago that are essentially information silos not only within their own company, but also to other organizations/companies/partners that they are working with.\n\nBlockchains do not replace ERP systems, they are just a data structure that could be used by parts of an ERP system for something like a supply chain.\n\nSo let's start there, I want to upgrade the ERP system for my company. Can you quantify why I should use a blockchain over oracle or workday?\n\n\n\n&gt; Instead of employing (and trusting) tons of people to inefficiently manage these systems, isn’t it cheaper/easier/better to have all necessary information available on an as needed basis to all network participants\n\nYou've got it backwards. Blockchains are inefficient because they focus on being trustless. Centralized systems are incredibly efficient. \n\nThe reality is that it's significantly easier and cheaper to just not use a blockchain. There's a reason why next to no one actually uses blockchains.",
        "created_utc": 1587473847,
        "id": "fo2tpub",
        "score": 1,
        "subreddit": "investing",
        "created": 1587502647.0
    },
    {
        "author": "trowawayatwork",
        "body": "IBM bluemix was the worst piece of shit that I touched and I touched oracle",
        "created_utc": 1587141440,
        "id": "fnp97kj",
        "score": 1,
        "subreddit": "investing",
        "created": 1587170240.0
    },
    {
        "author": "ss_400401",
        "body": "Most state projects are developed in Microsoft .net and that has been from a long time.  Bought calls based on the following factors starting with the recent NBA deal and would advice you buy calls expiring in August or Sep since you will have time to hedge if anything goes sideways next week.\n\n [https://www.cnbc.com/amp/2020/04/16/microsoft-and-nba-sign-azure-surface-deal-starting-in-2020-21-season.html](https://www.cnbc.com/amp/2020/04/16/microsoft-and-nba-sign-azure-surface-deal-starting-in-2020-21-season.html)\n\n1. Microsoft Teams  will eat slacks lunch and the new office 365 cloud subscription model which started on 4/21 has teams included. I believe corporations will slowly dump slack because of the higher costs and join Teams. Unfortunately it cannot take on zoom as zoom is a superior video conferencing tool.\n2. JEDI contract will help secure future government contracts and helps further to move the legacy applications from Cobol or whatever language the state's are running to .Net/ C#\n3. Has Visual studio, .net ( asp.net, c# and vb.net) to compete against java. Also SQL server competes directly with Oracle DB\n4. New Xbox releasing this year\n5. Linked helps during hard times like this\n6. GIT Hub - 60% of the worlds open source software projects are stored on GIT hub\n7. Azure which is the crown jewel and competes with AWS\n8. VR/ AR with Hololens and hardware with surface\n9. I assume they will buy Service now or Sales force since Microsoft Dynamics is not that of a great CRM tool.\n10. If azure can prove its reliable for NBA, it will open doors for international games like Soccer, Formula1, Olympics etc..",
        "created_utc": 1587691247,
        "id": "fodw4hm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587720047.0
    },
    {
        "author": "captain_blabbin",
        "body": "the oracle has arrived",
        "created_utc": 1587740189,
        "id": "fofowf8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587768989.0
    },
    {
        "author": "huyvitran",
        "body": "\"if he was a great investor...\" I dont think anyone has beaten him in long term investing. He s called oracle of omaha for a reason. To answer your question, i dont know, but he did say he bought too early in 2008. Also, a lot of his business probably badly hard and may need his cash injection.",
        "created_utc": 1587898992,
        "id": "fompfkg",
        "score": 1,
        "subreddit": "investing",
        "created": 1587927792.0
    },
    {
        "author": "setzer89",
        "body": "Tell us the future if you’re an oracle!",
        "created_utc": 1587905064,
        "id": "fomvf0n",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587933864.0
    },
    {
        "author": "JDragon1",
        "body": "U/Spuri0n have you taken a look at the competitors? IBM (Kenexa), Oracle, Citrix, and SAP released their 2019 annual reports. Some of them released their Q1 earnings, too.\n\nOracle and IBM earn 70-80% of their revenue from their cloud based services and software. SAP and Citrix (Web-Ex) is more weighted in this area. Growth has been trailing for all of these companies, except for one: Citrix.\n\nMy favorite out of all of them, including Cornerstone, has to be Citrix. Unfortunately, that Citrix ship has sailed. It had a damn check mark recovery! Citrix seems like a safe bet to go long, but this LMS industry seems like a short term play for me. \n\nI'd stick with CSDO for the earnings play with a small position of $32.5 5/15 calls. I would prefer going out to June, but there is no volume.\n\nI think I'll wait and see how Citrix behaves to decide if I want to jump in long term.",
        "created_utc": 1587833658,
        "id": "fok1k9m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587862458.0
    },
    {
        "author": "dwdsquared2",
        "body": "That's where I say gotta be careful trading with emotions.\n\nI work in IT and man, do I want to buy puts out of spite (hi ORCL), but I'd lose so much money. \n\nUnless it's WFC.  After watching that Dirty Money episode on them, idk if I can do anything but puts.",
        "created_utc": 1587818779,
        "id": "fojer51",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587847579.0
    },
    {
        "author": "Marshawns-lunch",
        "body": "Since you are some sort of oracle, do tell how long you envision this shut down going? Also, please explain what you feel the value of your puts will be in a scenario where the world actually collapses like you think.",
        "created_utc": 1585814371,
        "id": "fm75v04",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585843171.0
    },
    {
        "author": "NotGucci",
        "body": "Msft looks good for next year. CSCO and orcl as well.  I'm bag holding BA shares ughhh",
        "created_utc": 1585857617,
        "id": "fm8x1sm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585886417.0
    },
    {
        "author": "david_chi",
        "body": "Oracle of Omaha dumps it and you want to yolo it.  🤷🏻‍♂️",
        "created_utc": 1585965500,
        "id": "fmde2fr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585994300.0
    },
    {
        "author": "Sarkham89",
        "body": "? \n\nI mean I suppose it depends on how you define a lot.\n\nConsumer staples, almost all,  entirely benefit from this. The majority of the tech stocks will benefit from this. Grocery retailers, biotech. \n\nI’m not sure if you are thinking big enough. Maybe you think every restaurant, airline, and consumer discretionary is struggling and NFLX will benefit. Here let me rattle of a list of large companies for you and you can check out there peers that are in the industry. \n\nOff the dome:\n\nKHC, ORCL, NFLX, INTC, AMD, CAG, STZ, ZM, ATVI, CLX, KR, NVDA, PEP, KO, COST, GILAD, SPOT, CHWY, AMZN, MSFT, CISCO, RNG, SPOT, EVERYBIOTECHINDUSTRY, EVERYECOMMERCESERVICE, EVERYINTERNETSECURITY, EVERYSTREAMINGSERVICE, EVERYCLOUDBASED\n\nThose are just some tickers, there are probably thousands more tickets that all BENEFIT or remain very largely unaffected from the Coronavirus. As a majority I’m certain that most businesses will service. \n\nI know since I’ve been unemployed I’ve subscribed to three online subscriptions and have bought at least a half dozen books. \n\nDid anyone use Zoom before Coronavirus? \n\nSo, depends how you define a lot, I suppose. Important to note, it is not majority, tho.",
        "created_utc": 1586345392,
        "id": "fms3j2j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586374192.0
    },
    {
        "author": "Donut_Diet",
        "body": "I've been long time holder of  brk.b and have no fears of the Oracle or Munger passing away. The company is fully prepared of both of their deaths and has been for a while;   \n\nHis will outlines no shares will be sold after his death but rather, over time, .a shares converted to .b shares which will be distributed to various foundations. He expects this will take 12-15 years so it won't be dramatic.  \n\nThe company has solid directors and managers that each control portions of the company, e.g. Todd Combs running a 14$ billion portion of their equity fund with Ted Weschler. These are some of the best of the best and it appears Buffet has full faith in them.",
        "created_utc": 1586398899,
        "id": "fmuu2ks",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586427699.0
    },
    {
        "author": "Berrymore13",
        "body": "Give me the play next week oracle. My portfolio Is all but dead, and I need a 10 bagger to revive it 😂",
        "created_utc": 1586447081,
        "id": "fmwiaj6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586475881.0
    },
    {
        "author": "SPANman",
        "body": "Hope PING continues its slide, and that PAYX remembers it has absolutely no business being above $60 with these unemployment levels.  \n\n\nPING 20P 4/17 PAYX 55p 4/17",
        "created_utc": 1585776487,
        "id": "fm5nusk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585805287.0
    },
    {
        "author": "sriki123",
        "body": "$32P PAYX? mad lad..I have $50P same expiry.lol",
        "created_utc": 1586222386,
        "id": "fmnbl9z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586251186.0
    },
    {
        "author": "gabedenley",
        "body": "I hope the economy dies \nHYG 72p 4/17 \nPAYX 32P 6/17",
        "created_utc": 1586230132,
        "id": "fmnnarg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586258932.0
    },
    {
        "author": "username111112222233",
        "body": "PAYX puts too, their whole business is payroll / HR for small businesses\n\nvolume isn’t the same as options for SPY - but existent",
        "created_utc": 1586028111,
        "id": "fmfirhx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586056911.0
    },
    {
        "author": "luvens",
        "body": "Same with payx",
        "created_utc": 1585744708,
        "id": "fm42d5x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585773508.0
    },
    {
        "author": "username111112222233",
        "body": "PAYX",
        "created_utc": 1585893125,
        "id": "fmag8wm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585921925.0
    },
    {
        "author": "SPANman",
        "body": "PING, PAYX, PRU .... I guess I like P",
        "created_utc": 1585768907,
        "id": "fm59oxo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585797707.0
    },
    {
        "author": "Bismarck3000",
        "body": "British Petroleum, Canadian National Railway, Copart, Coca-Cola, Paychex, Las Vegas Sands, McDonalds, Royal Dutch Shell, Sirius XM, StoneCo, Visa, Waste Management",
        "created_utc": 1586417507,
        "id": "fmvhtz7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586446307.0
    },
    {
        "author": "Moar_Donuts",
        "body": "cant lose anymore on my $PAYX puts, Main Street USA wins!",
        "created_utc": 1586439602,
        "id": "fmw4wod",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586468402.0
    },
    {
        "author": "jpoms13",
        "body": "Not to mention competitors like Paycom ($PAYC, I think) are taking business from them.\n\nFull Disclosure: I hate Paychex. I’ve moved two companies away from their payroll services.",
        "created_utc": 1586043586,
        "id": "fmg8mp1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586072386.0
    }
]